{"title":"New Campagnolo patents reveal more about their new wireless derailleurs","link":"https://www.cyclingtips.com/2023/04/campagnolo-wireless-derailleur-patent-news/","date":1680700397000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-Derailleur-patent-details-rear-derailleur-drawing-heros.jpg?width=1200\" alt=\"New Campagnolo patents reveal more about their new wireless derailleurs\" /></figure><p><span>We shared <a href=\"https://www.cyclingtips.com/2023/03/campagnolo-wireless-power-meter-coming/\" target=\"_blank\">our findings after diving deep into Campagnolo’s patents</a> and other leaks a few weeks back. The result was what we think to be called <a href=\"https://www.cyclingtips.com/tag/campagnolo/\" target=\"_blank\">Campagnolo</a> Super Record WRL, a wireless electronic groupset with batteries at each shift lever and derailleur. </span></p>\n<p><span>New patent applications shed greater light on what those new Campagnolo wireless derailleurs might look like, including battery mounting systems, potential connectivity with smart devices, and more.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-Derailleur-patent-details-rear-derailleur-drawing.jpg?width=730\" alt=\"Campagnolo-Wireless-Derailleur-patent-details-rear-derailleur-drawing\" width=\"1084\" height=\"960\" /><figcaption>Further detail of what a wireless Campagnolo rear derailleur could look like. The design has a bit of flair to it, not unlike Campagnolo’s 12-speed mechanical derailleurs. (Image: Campagnolo)</figcaption></figure>\n<p><strong>Read more – </strong><a href=\"https://www.cyclingtips.com/2023/04/bike-bling-at-the-2023-taipei-cycle-show/\" target=\"_blank\">Bike bling at the 2023 Taipei Cycle Show</a></p>\n<p><span>Let’s start with the rear derailleur. We originally reported that the rear derailleur would have a battery that wasn’t mounted behind the derailleur like that of <a href=\"https://www.cyclingtips.com/tag/sram/\" target=\"_blank\">SRAM</a> AXS derailleurs, but one that would be “mounted upward, downward, or outward of the derailleur itself.”</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-Rear-Derailleur-patent-details-battery-removal-1340x593.jpg?width=730\" alt=\"Campagnolo-Wireless-Rear-Derailleur-patent-details---battery-removal\" width=\"1340\" height=\"593\" /><figcaption>The battery for a potential Campagnolo wireless rear derailleur seems almost encased and protected by the rear derailleur’s parallelogram. Perhaps this is a way to get around SRAM’s rear derailleur patents? (Image: Campagnolo)</figcaption></figure>\n<p><span>This latest drawing is far more detailed. From the drawings – and the descriptions within the patent – it looks like the battery mounts from just behind the inside of the parallelogram. If you have the derailleur installed, the battery is attached to the back of the parallelogram, and closer to the pulley wheels than anything.</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-drivetrain-front-derailleur-battery-removal.jpg?width=730\" alt=\"Campagnolo-Wireless-drivetrain-front-derailleur-battery-removal\" width=\"926\" height=\"1416\" /><figcaption>Battery removal looks to be fairly straightforward, though the battery is placed in front of the derailleur rather than in the back like SRAM AXS front derailleurs. (Image: Campagnolo)</figcaption></figure></figure>\n<figure></figure>\n<p><span>Both derailleurs will include buttons presumably to pair derailleurs to the shifters together. Derailleurs will also feature built-in accelerometers to ensure movement wakes the derailleurs from a low-power sleep mode. </span></p>\n<p><span>The derailleurs will include sensors for Bluetooth, Bluetooth Low Energy, or ANT+ protocols. In short, expect the new Campagnolo wireless drivetrain to be able to pair with a smartphone or bike computer without the use of an adaptor or the like. </span></p>\n<p><span>The patent also describes the use of a wireless setup for firmware updates. Hopefully, this will be able to be done directly through the user rather than having to go to a bike shop with the appropriate software.</span></p>\n<p><span>Based on the patent language, expect the batteries to lock in with a clipping mechanism, and the rear derailleur battery to slide in and out as well as clip in. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-Derailleur-patent-details-battery-breakdown.jpg?width=730\" alt=\"Campagnolo-Wireless-Derailleur-patent-details-battery-breakdown\" width=\"944\" height=\"1370\" /><figcaption>This drawing shows off battery details. Both batteries look to have their own latch to connect it to the derailleur as well as light railing to allow the battery to slide in and out. (Image: Campagnolo)</figcaption></figure>\n<p>These patent drawings seem to give some credence to <a href=\"https://www.instagram.com/reel/CdBRKv4Pq0v/\" target=\"_blank\">an Instagram video</a> from about a year ago in which the author claims a new Campagnolo Super Record groupset is on the way.</p>\n<p>They also share an image of what they claim to be a wireless Campagnolo derailleur.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Campagnolo-Wireless-Derailleur-rendering-e1680632158228.png?width=465\" alt=\"Campagnolo-Wireless-Derailleur-rendering\" width=\"465\" height=\"609\" /><figcaption>A screenshot from the above video of what a Campagnolo wireless rear derailleur could look like. Bear in mind that this looks like a rough rendering; expect a Super Record WRL rear derailleur to be fully encased in carbon fiber. (Image: Instagram/@weightweeniesbrasil)</figcaption></figure>\n<p>Now don’t get too frustrated, Campagnolo fans. This possible rendering might have the characteristic wave in the derailleur’s parallelogram but it also seems to miss the direct mount capability that the mechanical Campagnolo 12s derailleurs have.</p>\n<p><span>When will the Campagnolo wireless groupset be available? Will there be any integration with the likes of <a href=\"https://www.cyclingtips.com/tag/classified/\" target=\"_blank\">Classified</a> Powershift or others? We still don’t have firm updates but once we know, so will you. </span></p>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a43b3f15139343218db2a6fed316cbd823f91a7be9c107e6cedc5c6212681e21","category":"Cycling"}