{"title":"Physiological response of milkfish (Chanos chanos) to capture in a fly fishing catch‐and‐release recreational fishery","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12741?af=R","date":1727495636000,"content":"<h2>Abstract</h2>\n<p>Recreational angling for novel marine species and related tourism development can be important in a Blue Economy. The milkfish (<i>Chanos chanos</i>) is growing in popularity as a target of fly fishing-based catch-and-release (C&amp;R) recreational fisheries, largely because of their challenge to catch and powerful swimming abilities, resulting in fight times that can exceed 1 h. Anecdotal sentiments by anglers claim that milkfish can fight for long periods of time because they do not accumulate blood lactate. To test this hypothesis, we measured blood lactate and blood glucose for 21 milkfish caught by fly fishing in the remote Alphonse Group of islands, Republic of Seychelles. Fight times ranged 5–78.3 min. Blood lactate and blood glucose concentrations increased with fight times that did not exceed 60 min. Total length of milkfish was not correlated to blood lactate or blood glucose concentrations. Ours is the first study on C&amp;R of milkfish that debunks the anecdote that milkfish can fight for long periods of time because they do not accumulate blood lactate. Our study also revealed that milkfish may begin to physiologically recover after fight times longer than 60 min. In the context of C&amp;R, our study indicates that anglers should limit fight times to 20–30 min when possible to reduce angling-induced physiological stress and other potential impacts (e.g., depredation) on milkfish in recreational fisheries.</p>","author":"Andy J. Danylchuk, \nLucas P. Griffin, \nMichael Lawrence, \nSascha Clark Danylchuk, \nEleanor Brighton, \nGail Fordham, \nGeorge Curd, \nKyle Simpson, \nDevan Vd Merwe, \nSteven J. Cooke","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"a446d1c53d1eb8c2248661855097ded362e1530f89268e560a82a9a710f2404f","category":"Environment"}