{"title":"Steve Jobs apparently wanted an iPhone nano in 2011—and we have questions","link":"https://www.macworld.com/article/353667/iphone-nano-steve-jobs-ipod.html","date":1629451800000,"content":"<div>\n<section><div></div></section><p>When Apple unveiled the iPhone 12 mini last year, it made sense. Over the past several years, the iPhone has gotten bigger and bigger, and people who wanted a small phone were seemingly left out in the cold, forced to handle six-inch handsets. So the iPhone 12 mini filled a need.</p>\n\n\n\n<p>Now it seems that Steve Jobs was planning a smaller iPhone way back in 2011. According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs&amp;xcust=1-1-353667-1-0-0&amp;sref=https://www.macworld.com/feed\">a trove of emails and documents analyzed by The Verge</a>, Jobs wanted to discuss the “iPhone nano plan” during an executive meeting in late 2010 outlining Apple’s multi-year iPhone strategy that included a “low cost iPhone model based on iPod touch” and an early look at the “iPhone 5 hardware.”</p>\n\n\n\n<p>It’s hard to figure exactly what he meant by iPhone nano. At the time, Apple was selling the incredibly popular iPhone 4, which was actually smaller than the iPhone 3GS (115.20 x 59.00 x 9.30mm vs 115.50 x 62.10 x 12.30mm) and already one of the smallest phones available. But based on Apple’s other “nano” product, we can guess what the iPhone nano would be.</p>\n\n\n\n<p>Six years earlier, Jobs had unveiled the <a href=\"https://www.macworld.com/article/176961/nanoreview.html\">iPod nano</a>, which was hailed as “a full-featured iPod in an impossibly small size.” At $199 for 4GB of storage, the iPod nano filled the price and storage gap between the low-end iPod shuffle and the flagship iPod and quickly became one of Apple’s most popular music players. The original iPod nano had a Click Wheel like the original iPod but later adopted a home button.</p>\n\n\n\n<p>So, assuming an iPhone nano would follow a similar concept, what would it look like? Who would it appeal to? And why would Apple need to launch one? These are just some of the questions we have about this mythical device.</p>\n\n\n\n<p>At the time, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://www.bloomberg.com/news/2011-02-10/apple-said-to-work-on-cheaper-more-versatile-iphone-models.html&amp;xcust=1-1-353667-1-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg reported on a possible iPhone nano</a> in the works at Apple that was “allegedly about one-third smaller than the current iPhone 4” with similar specs that would cost around $200 without needing to be subsidized (how Apple sold iPhones at the time). While cutting costs made sense, cutting down the size didn’t. The iPhone 4 had a 3.5-inch screen, so an iPhone nano would presumably have a 2.5-inch one like the original iPod nano, which is fine for a music player but seems comically small for a phone.</p>\n\n\n\n<p>Unfortunately, we’ll never know what Apple was actually planning for the iPhone nano and Steve Jobs’ health <a href=\"https://www.macworld.com/article/213994/steve-jobs-resigns-as-apple-ceo.html\">took a turn for the worse</a> not long after this meeting. But we know one thing—he very likely would have approved of the <a href=\"https://www.macworld.com/article/234921/iphone-12-mini-review-a-concentration-not-a-reduction.html\">iPhone 12 mini</a>. </p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a456fda8f6ed4c24a02c7cc775af584d38b8273d2cfd79a4bf642276a6a62fc4","category":"Apple"}