{"title":"Linezolid Adsorption on the Filters during Continuous Renal Replacement Therapy: In Vitro Study","link":"https://www.preprints.org/manuscript/202408.1209/v1","date":1723785279000,"content":"Renal replacement therapy (RRT), widely used in the treatment of renal injury in the course of sepsis, aims to eliminate the toxins and proinflammatory cytokines, involved in the pathomechanism underlying septic shock. Dialysis filters characterised by a high adsorption potential for cytokines in RRT when septic renal injury is the case. It is of key importance in the antibiotics treatment of sepsis to achieve desired values of PK/PD indices. Continuous renal replacement therapy (CRRT) may affect antimicrobial clearance, increasing their elimination in some cases. The aim of this study was to determine the degree of adsorption for linezolid, on three different types of filters used in CRRT. In our in vitro study a continuous veno-venous hemofiltration (CVVH) was conducted using 3 types of filters: polysulfone (PS), polyethyleneimine-treated polyacrylonitrile (PAN PEI) and non-PEI-treated polyacrylonitrile (PAN) filters. Each type of filter was used in 3 CVVH cycles, involving the use of 600 mg of linezolid dissolved in 700 ml of bovine blood or in 700 ml of 0.9% NaCl. In each case the total volume of the obtained solution was 1000 ml. Blood samples, at particular time points, were collected in order to measure drug concentration. The differences in mean drug/NaCl adsorption and drug/ blood adsorption were determined using one-way ANOVA with multiple comparisons by Tukey post-hoc test. A p-value of &lt; 0.05 was considered to be significant. A significant adsorption of linezolid was found for PAN PEI filter, both in samples obtained from bovine blood and 0.9% NaCl solutions, at the endpoint. No significant adsorption was demonstrated on PAN or PS filters. There is a need for in vivo research to confirm the effect of filter type on linezolid concentration in patients undergoing CRRT.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a458fb1afc757fb029ac541be9e1247b2f0b8b3daf9322c0e0c520ac3ee7910f","category":"Interdisciplinary"}