{"title":"Review: Sean Bean gives Snowpiercer a charismatic villain to stir the pot","link":"https://arstechnica.com/?p=1752340","date":1617577122000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/snow1-980x604.jpg\" alt=\"\"></div>\n        <p>\n          <em>Snowpiercer</em> was overtaken by the supply train <em>Big Alice</em> in the S1 finale.                      [credit:\n                        YouTube/TNT                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The unexpected arrival of the presumed-dead Mr. Wilford throws a wrench into the revolutionaries' plans to reform governance aboard the train, in the second season of <a href=\"https://en.wikipedia.org/wiki/Snowpiercer_(TV_series)\"><em>Snowpiercer</em></a>, TNT's TV adaptation of the <a href=\"https://en.wikipedia.org/wiki/Snowpiercer\">2013 film</a> of the same name, directed by Bong Joon-ho. Most of the talented ensemble cast members who made S1 so worth watching are back and as good as ever, but ultimately S2 belongs to Sean Bean, whose portrayal of Wilford gives the series the charismatic, larger-than-life (human) villain it needed to really raise the emotional stakes.</p>\n<p><strong>(Spoilers for S1 below. Major spoilers for the S2 finale below the second gallery. We'll give you a heads-up when we get there.)</strong></p>\n<p>As <a href=\"https://arstechnica.com/gaming/2021/01/sean-bean-joins-cast-as-the-elusive-mr-wilford-in-snowpiercer-s2-trailer/\">we've reported previously</a>, TNT's series is set seven years after the climate catastrophe that produced the Freeze. Daveed Diggs (<em>Hamilton, Blindspotting</em>) plays Andre Layton, a prisoner at the tail end of the train (aka the \"Tailies\")—those without tickets for the train who managed to climb onboard at the last minute, before the train departed and left the rest of humanity to die. In S1, Layton gets caught up in a revolutionary struggle against the strictly imposed social hierarchy aboard <em>Snowpiercer</em>. The conditions in the tail are squalid, and typical punishment for insubordination is having one's arm stuck through a portal into the cold outside until it freezes solid and shatters off. There's also a prison car to punish more serious infractions, whose occupants are kept in suspension in \"the Drawers.\"</p></div><p><a href=\"https://arstechnica.com/?p=1752340#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1752340&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a45890b13f09f3626e0b317c82dae24ce2874957dab1009cfe4c4519b754361b","category":"Tech"}