{"title":"IoMT Landscape: Navigating Current Challenges and Pioneering Future Research Trends","link":"https://www.preprints.org/manuscript/202405.1056/v1","date":1715872821000,"content":"Smart electronic devices and telemedicine are widely used in humans' daily lives. This provides remote treatment of patients using information and communications technology. New telemedicine technologies, such as the Internet of Medical Things (IoMT), make it easier for medical and computing devices to communicate regularly and effectively. Critical motivations for adapting the IoMT are reduced cost, increased quality of life, and timely medical intervention. IoMT is significant because it enables continuous, real-time patient monitoring during routine everyday activities using a variety of wearables and sensors. With big data, the IoMT technology makes excellent use of Artificial Intelligence (AI) to support disease detection and health condition prediction, alerting patients and healthcare providers. Many research studies have been conducted to explore various aspects of IoMT and its applications in the real world. However, it is challenging to comprehend all the techniques and solutions proposed by the research community. Therefore, this survey sheds light on some crucial aspects of IoMT technologies and explores the potential research gaps and directions the research community could tackle. The survey examines and discusses the characteristics of IoMT standards, protocols, and types. It then delves into the layers of IoMT and distinguishes them into Fog and edge. The studies published under each type were explored, and the limitations of these works were highlighted. The research gaps and directions on IoMT approaches and technologies were also highlighted. With such findings and research directions, further research endeavors could be carried out to address the issues and existing limitations in the IoMT.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a461bb6fe7b7e723ebfd1314c1dad19ea2f8b9bd832a2793cf0a1e357a41980c","category":"Interdisciplinary"}