{"title":"The Importance of Early Detection and Prevention of Atypical Skin Lesions and Another Risk Factors in a Younger Population","link":"https://www.preprints.org/manuscript/202410.1430/v1","date":1729225723000,"content":"Background/Objectives: Skin cancer is becoming increasingly common due to increasing risk factors such as excessive UV radiation, genetic predisposition, fair skin, and a history of sunburn. Melanoma accounts for only 1% of cases but causes the majority of skin cancer deaths. Dysplastic nevi (DN) are important precursors of melanoma. The aim of this study was to investigate the influence of these risk factors on the pathogenesis, incidence, and stage of skin cancer.; Methods: The study included 591 patients aged 18 to 64 who visited the Clinic in 2022–2023 for skin examinations. Each patient completed a questionnaire regarding the risk factors for melanoma and atypical melanocytic nevi and then underwent a dermatoscopic examination of the whole body using a digital videodermatoscope. Statistical analysis of the collected data was performed.; Results: Dermatoscopic examination revealed a lesion suggestive of melanoma in 1,69% of the patients. Risk factors for developing melanoma included male gender, family history of melanoma, number of skin moles, sunburns in childhood, sun-dependent hobby, using tanning bed, using cream with low SPF, not avoiding sun exposure and co-occurrence of actinic keratosis.; Conclusions: Risk factors for melanoma and dysplastic nevi are still common among patients, but the situation has been improving over the years. Early intervention and education on sun safety can play pivotal roles in reducing the incidence of atypical moles and potentially preventing malignant transformations. Keywords: dysplastic nevum; melanoma; risk factors; dermoscopy; prevention","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a4715c6ba354851d2f2ea4630fa8f53d1246408baaf08e7bd62bb9ef10d7c40e","category":"Interdisciplinary"}