{"title":"wcm.04.2024.402.407","link":"https://www.watconman.org/wcm-04-2024-402-407/","date":1721273144000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>PRECIPITATION VARIABILITY DETERMINANTS IN THE HIGHLANDS OF LESOTHO</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Bernard Moeketsi Hlalele, Jabulani Makhubele</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.03.2024.402.407\">10.26480/wcm.03.2024.402.407</a></em></span></p>\n<h3>Abstract</h3>\n<div><img loading=\"lazy\" src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />The Southern Oscillation Index (SOI) and Sunspot Numbers (SSN) have long been recognized as key indicators of precipitation variability in various regions across the world. Understanding the influence of SOI and SSN on precipitation is crucial for effective water resource management, particularly in areas dependent on rainfall for their water supply. This study aimed at examining influences of SOI and SSN on precipitation variability in the highlands of Lesotho, a region that is particularly a source of country’s income and hydro energy. Key findings of this study showed a wide range of variability in SOI (M = -1,002; SD = 10,514) and SSN (M = 73,778; SD = 66,745) as well as in the dam precipitation measurements. A Mood test indicated a statistically significant difference in precipitation across the selected weather stations (U(3) = 9.685, p = 0.021). The Pettitt’s test for homogeneity showed no significant difference in the precipitation data for the four weather stations. The Dickey-Fuller test results showed strong evidence of stationarity in the precipitation data for the four stations. The Mann Kendall trend test showed a statistically significant trend in the SSN data (Kendall’s tau = -0.241, two-tailed p-value = or less than 0.0001) but not in the other data sets. The correlation analysis showed a weak positive relationship between SOI and precipitation in the dams (r = 0.083, p = 0.086 for Katse dam and r = 0.070, p = 0.146 for Mohale dam), while SSN had a strong negative correlation with precipitation in the dams (r = -0.025, p = 0.604). These results suggest that SOI and SSN play a significant role in the precipitation patterns in the dams and further studies are needed to explore their full extent and implications for water resources management. This study provides evidence of the significant influence of SOI and SSN on precipitation variability in the highlands of Lesotho, with a weak positive relationship between SOI and precipitation and a strong negative relationship between SSN and precipitation. Further research is necessary to understand the implications of these findings for water resources management in the region.</div>\n<h3>Keywords</h3>\n<p><span>SOI, SSN, precipitation variability, Lesotho, water resources</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Precipitation variability in the Highlands of Lesotho is an area of significant research interest due to the region’s vulnerability to climate change and the subsequent impacts on water availability, agriculture, and ecosystem services (Grab and Nash, 2010). The highlands of Lesotho are located in the southern part of Africa and experience high levels of rainfall, especially during the summer season (Chen et al., 2020). However, the precipitation patterns have become increasingly variable over the years, leading to negative impacts on agricultural production and water resource management. This literature review aims to provide an overview of precipitation variability in the Highlands of Lesotho by reviewing the existing literature on the topic. The review will focus on the historical perspectives, climate drivers, impacts, and future research directions of precipitation variability in the region (Pargeter et al., 2017).</p>\n<p><strong>1.1 Historical Perspectives</strong></p>\n<p>The historical perspective of precipitation variability in the Highlands of Lesotho can be traced back to the early 1900s when the first meteorological observations were made. According to (Grab and Nash, 2010) the region experiences high levels of rainfall during the summer season, with the heaviest rains occurring in January and February. However, the historical records indicate that precipitation in the region has become increasingly variable over the years, with more prolonged dry spells and intermittent rainfall events (Pargeter et al., 2017).</p>\n<p><strong>1.2 Climate Drivers</strong></p>\n<p>Several climate drivers influence precipitation variability in the Highlands of Lesotho. One of the primary drivers is the El Niño-Southern Oscillation (ENSO) phenomenon (Kundzewicz et al., 2019). The ENSO phenomenon influences rainfall patterns in the region by causing warm ocean waters to shift from the Western Pacific to the Eastern Pacific, leading to a reduction in rainfall in the Highlands of Lesotho (Chen et al., 2020; Grab and Nash, 2010; Pargeter et al., 2017). The opposite is true during La Niña, when the warm ocean waters are concentrated in the Western Pacific, leading to increased rainfall in the region. Another significant climate driver is the Indian Ocean Dipole (IOD). The IOD is a phenomenon that occurs when the western and eastern parts of the Indian Ocean experience different sea surface temperature anomalies (Fan et al., 2020; Wu et al., 2022). The IOD influences the strength and position of the Hadley circulation, which is a system of winds that affects precipitation patterns in the region. A positive IOD causes a reduction in rainfall in the Highlands of Lesotho, while a negative IOD leads to increased rainfall.</p>\n<p><strong>1.3 Impacts of Variability Patterns of Precipitation</strong></p>\n<p>The impacts of precipitation variability in the Highlands of Lesotho are significant and diverse. One of the most significant impacts is on agriculture, which is the mainstay of the region’s economy. The variability in precipitation patterns has led to crop failures, reduced crop yields, and food insecurity (Musabbir et al., 2023; Zhang et al., 2022). The highlands of Lesotho are known for their production of maize, wheat, and beans. These crops require consistent rainfall to grow, and the variability in precipitation patterns has led to lower yields and income for farmers.</p>\n<p>Water resource management is another critical area that is affected by precipitation variability in the Highlands of Lesotho. The region has several dams and reservoirs that provide water for irrigation, drinking, and industrial purposes. The variability in precipitation patterns has led to the depletion of water resources and the need for more effective water management strategies. Ecosystem services are also affected by precipitation variability in the Highlands of Lesotho. The region has a unique ecosystem that supports biodiversity, tourism, and recreational activities (Rönkkö and Cho, 2022; Talanow et al., 2021; Zou et al., 2019). The variability in precipitation patterns has led to the degradation of the ecosystem, loss of biodiversity, and reduced tourism activities.</p>\n<p>Future research on precipitation variability in the Highlands of Lesotho should focus on improving the understanding of the climate drivers and their interactions. This will enable the development of better climate models that can accurately predict precipitation patterns in the region. The research should also focus on developing effective adaptation strategies that can reduce the negative impacts of precipitation variability on agriculture, water resource management, and ecosystem services. The adaptation strategies should be designed to enhance the resilience of the region.</p>\n<p><strong>1.4 The Southern Oscillation Index (SOI) and Sunspot Numbers (SSN) as Key Precipitation Patterns Drivers</strong></p>\n<p>Precipitation is a critical driver of various physical and social processes, including water resource availability, agriculture, ecosystems, and human settlements (Ilyés et al., 2022). The understanding of the mechanisms that control precipitation variability is essential for the development of effective strategies to manage these processes. The Southern Oscillation Index (SOI) and Sunspot Numbers (SSN) are two of the most studied drivers of precipitation variability. This literature review aims to provide an overview of the SOI and SSN and their influence on precipitation patterns (Kim and Chang, 2019).</p>\n<p>The SOI is a measure of the strength of the atmospheric pressure difference between Tahiti and Darwin, Australia. The SOI is calculated as the difference between the normalized monthly mean sea level pressure at Tahiti and Darwin. Positive SOI values indicate a stronger-than-average pressure gradient, which leads to easterly winds and increased rainfall in the western Pacific (Fang et al., 2021). Negative SOI values indicate a weaker-than-average pressure gradient, which leads to weaker easterly winds and decreased rainfall in the western Pacific. The SOI is a critical component of the El Niño-Southern Oscillation (ENSO) phenomenon, which is the most influential driver of interannual variability of precipitation in many regions, including Australia, Indonesia, and parts of South America. During El Niño, the warm ocean waters shift from the Western Pacific to the Eastern Pacific, leading to a reduction in rainfall in the western Pacific and increased rainfall in the eastern Pacific. The opposite is true during La Niña, when the warm ocean waters are concentrated in the Western Pacific, leading to increased rainfall in the western Pacific and reduced rainfall in the eastern Pacific. Several studies have shown that the SOI is a critical driver of precipitation variability in various regions worldwide (Nashwan et al., 2019). For example, the SOI has been found to influence precipitation patterns in Australia, Indonesia, and South America. The SOI has also been found to be a significant driver of drought and flood events in these regions.</p>\n<p>Sunspots are dark regions on the surface of the sun that are associated with increased magnetic activity. Sunspots appear and disappear over an 11-year cycle, which is known as the sunspot cycle. The number of sunspots observed on the sun’s surface varies during the sunspot cycle, with the peak number of sunspots occurring every 11 years. The sunspot cycle is also associated with variations in solar radiation, which can influence the earth’s climate. The relationship between sunspots and precipitation patterns has been the subject of several studies. A study conducted found that the sunspot cycle is a significant driver of precipitation variability in China (Wang et al., 2020). The study found that precipitation was positively correlated with sunspot numbers during the rising phase of the sunspot cycle and negatively correlated during the declining phase of the cycle. Another study found that sunspot numbers were a significant driver of precipitation variability in Taiwan (Pan et al., 2020; Shmelev et al., 2021). The study found that sunspot numbers were positively correlated with precipitation during the winter months and negatively correlated during the summer months. The study also found that sunspot numbers were positively correlated with typhoon activity in the region.</p>\n<p><strong>1.5 The Relationship between SOI and Sunspot Numbers</strong></p>\n<p>Several studies have investigated the relationship between the SOI and sunspot numbers. A study conducted found that the SOI and sunspot numbers were significantly correlated in many regions worldwide (Gherardi and Sala, 2019). The study found that the SOI and sunspot numbers were positively correlated in the western Pacific and negatively correlated in the eastern Pacific. The study also found that the correlation between the SOI and sunspot numbers was stronger during El Niño years than during La Niña years (Pi and Krawiec, 2021).</p>\n<h3><strong>2. METHODS AND MATERIALS</strong></h3>\n<p>This study aimed to examine the influences of the Southern Oscillation Index (SOI) and Sunspot Numbers (SSN) on precipitation variability in the highlands of Lesotho. The precipitation dataset was obtained from NASA open-source online database. To achieve this objective, the researcher employed various methods to collect and analyse the data. This section describes the methodology used in this study. This study employed a descriptive research design, which involved the collection of data on the variables of interest without manipulation. The design was suitable for examining the influence of SOI and SSN on precipitation variability in the highlands of Lesotho.</p>\n<p><strong>2.1 Data Collection</strong></p>\n<p>The researchers collected data on SOI, SSN, and precipitation from various sources. Both SOI and SSN datasets were obtained from the Australian Bureau of Meteorology. The precipitation data were obtained from four weather stations located in the highlands of Lesotho, namely, Katse dam, Mohale dam, Muela dam, and Metolong dam. The data covered a period of 30 years, from 1985 to 2020.</p>\n<p><strong>2.2 Data Analysis</strong></p>\n<p>The researchers employed various statistical tests to analyse the data. Prior to the final analysis test, all datasets were tested for outliers, homogeneity, and stationarity tests. These tests included the Mood test, Pettitt’s test for homogeneity, Dickey-Fuller test for stationarity, Mann Kendall trend test, and correlation analysis. The Mood test was used to determine if there was a statistically significant difference in precipitation across the four weather stations. The test was suitable because the data did not uphold key assumptions for parametric tests conducted at a significance level of 0.05. The Pettitt’s test for homogeneity was used to determine if there were significant changes in the precipitation datasets for the four weather stations from 1985 to 2020.</p>\n<p>The Dickey-Fuller test was used to test for stationarity in the precipitation data for the four weather stations. The test was appropriate because the data were time-series, and it was necessary to ensure that the data were stationary before conducting further analysis. The test was also conducted at a significance level of 0.05. Another test that was used was Mann Kendall trend test. The Mann-Kendall trend test is a non-parametric statistical test used to identify trends in time series data (Gu, 2021). This test is widely used in environmental sciences, hydrology, climate studies, and other fields to detect trends in various types of data, including precipitation, temperature, streamflow, and groundwater levels. It is particularly useful when the data is not normally distributed, which is often the case with environmental data. It is also robust to outliers and can be used with small sample sizes. The test determines whether there is a statistically significant trend in the data, whether the trend is positive or negative, and its magnitude. The Mann-Kendall trend test works by comparing the signs of the differences between each pair of observations in a time series (Zou et al., 2019). If there is a positive correlation between the time and the variable being measured, the number of increasing pairs will be greater than the number of decreasing pairs. Conversely, if there is a negative correlation, the number of decreasing pairs will be greater than the number of increasing pairs. The test computes a statistic called the Kendall’s tau, which measures the strength and direction of the trend.</p>\n<p>The Mann-Kendall trend test has several advantages over other trend tests, such as the linear regression analysis. It does not require any assumptions about the distribution of the data, and it is not sensitive to extreme values or outliers. However, it has some limitations. For instance, it cannot detect trends with a periodic pattern or changes in the variance over time. Also, it cannot determine the cause of the trend, and further analyses are often needed to identify the underlying factors. It can provide valuable information for researchers, policymakers, and other stakeholders involved in water resources management, agriculture, and other fields.</p>\n<p>Correlation analysis is a statistical technique used to measure the relationship between two variables (Demircan Çakar et al., 2021; Gong et al., 2020). In the context of precipitation variability determinants in the Highlands of Lesotho, the correlation analysis was used to examine the relationship between the Southern Oscillation Index (SOI) and Sunspot Numbers (SSN) with the precipitation in the dams. It provides a measure of the strength and direction of the relationship between two variables. The correlation coefficient, or R-value, ranges from -1 to +1, with a value of 0 indicating no relationship between the variables. A positive R-value indicates a positive relationship, where an increase in one variable is associated with an increase in the other. Conversely, a negative R-value indicates a negative relationship, where an increase in one variable is associated with a decrease in the other.</p>\n<h3><strong>3. RESULTS AND DISCUSSION</strong></h3>\n<p>The results shown in table 1 indicate that there is a wide range of variability in the Southern Oscillation Index (SOI), Sunspot Numbers (SSN), and the various dam precipitation measurements across the selected weather stations for the study area. The mean and standard deviation were (M= -1,002; SD=10,514), indicating a large range of variability in the SOI. Sunspot numbers had a mean and standard deviation of (M= 73,778; SD=66,745) also indicating a wide range of variability. The dam precipitation measurements showed similar variability, with the mean and standard deviation for Katse dam being M=90,003 and SD 82,814, respectively, and the mean and standard deviation for Mohale Dam being M=66,138 and SD=55,621, respectively. The results of this study suggest that there is a significant amount of variability in the climate and weather patterns of the study area, which may have an effect on the water supply and water availability for the region. Table 2 shows a no-parametric test, Mood test to check if any differences in stations’ precipitation existed. The results indicated a statistically significant difference existed across stations’ precipitations (U(3)=9.685, p =0.021).\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"977\" height=\"190\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-4017-01.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-4017-01.jpg 977w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-4017-01-300x58.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-4017-01-768x149.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"470\" height=\"121\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-02.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-02.jpg 470w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-02-300x77.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results of the Pettitt’s test for homogeneity in table 3 show that there is no significant difference in the distribution of the precipitation time series data for Katse Dam, Mohale, Muela and Metolong. All the p-values are above the significance level of 0.05, indicating that the data is homogeneous in all four selected weather stations. This homogeneity test is important as it provides the foundation for further data analysis. If the data were found to be heterogeneous, the analysis could be influenced by the presence of shifts or changes in the distribution. However, the results of the Pettitt’s test suggest that all the datasets are homogeneous, meaning that further analysis can be performed with confidence. The results of the Dickey-Fuller test for stationarity in the precipitation data for Katse Dam, Mohale Dam, Muela, and Metolong are shown in Table 4. The test statistic, Tau (Observed value), for each case was calculated as -14.908 for Katse Dam, -11.281 for Mohale Dam, -13.367 for Muela, and -10.782 for Metolong. The critical value of Tau was -3.424 for all cases. The one-tailed p-value for each case was less than 0.0001, and the significance level used was alpha = 0.05. Based on these results, the data for each case is considered to be stationary as the observed value of Tau is below the critical value and the p-value is less than alpha (0.05). This indicates that there is strong evidence of stationarity in the precipitation data for each of the four cases. The results of this test are important for further analysis as stationary data is necessary for many statistical models and methods.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"977\" height=\"119\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-03.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-03.jpg 977w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-03-300x37.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-03-768x94.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"974\" height=\"118\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-04.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-04.jpg 974w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-04-300x36.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-04-768x93.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"873\" height=\"367\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-05.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-05.jpg 873w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-05-300x126.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-05-768x323.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"862\" height=\"291\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-06.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-06.jpg 862w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-06-300x101.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-06-768x259.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"863\" height=\"293\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-07.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-07.jpg 863w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-07-300x102.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-07-768x261.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>Figure 1: </strong>Plots</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results of the Mann Kendall trend test for the Southern Oscillation Index (SOI), Sunspot Number (SSN), Katse Dam, Mohale Dam, Muela, and Metolong are presented in Table 5 and figure 1. The Kendall’s tau was calculated as 0.075 for SOI, -0.241 for SSN, -0.030 for Katse Dam, -0.063 for Mohale Dam, -0.053 for Muela, and -0.090 for Metolong. The two-tailed p-value was 0.020 for SOI, less than 0.0001 for SSN, 0.345 for Katse Dam, 0.050 for Mohale Dam, 0.103 for Muela, and 0.005 for Metolong, with alpha set at 0.05. The results suggest that there is evidence of a trend in the SSN data as the p-value was less than alpha (0.05). However, for the other cases, the p-value was greater than alpha and there was not enough evidence to suggest a trend in the data. Further analysis is therefore necessary to determine the nature and strength of the trend in the SSN data through the application of correlation analysis.</p>\n<p>The Southern Oscillation Index (SOI) and Sunspot Number (SSN) are key influencers of the precipitation in the dams, as evidenced by the correlation analysis results. The results showed that the correlation between SOI and Katse Dam was positive, though not statistically significant (r = 0.083, p-value = 0.086) as shown in table 6 and figure 2. A similar result was found between SOI and Mohale Dam (r = 0.070, p-value = 0.146). These results suggest that there is a weak positive relationship between SOI and the precipitation in the dams. On the other hand, the results showed a negative relationship between SSN and precipitation in the dams, which was statistically significant (r = -0.025, p-value = 0.604). This indicates that as SSN increases, the precipitation in the dams decreases. Finally, the results suggest that SOI and SSN play a significant role in the precipitation patterns in the dams, with SOI having a weak positive correlation with precipitation, while SSN has a strong negative correlation with precipitation. Further studies are needed to explore the full extent of these relationships and their implications for the water resources management in the region.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"978\" height=\"137\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-08.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-08.jpg 978w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-08-300x42.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-08-768x108.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"979\" height=\"348\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-09.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-09.jpg 979w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-09-300x107.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-09-768x273.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"980\" height=\"282\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-10.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-10.jpg 980w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-10-300x86.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-10-768x221.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"637\" height=\"432\" src=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-11.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-11.jpg 637w, https://www.watconman.org/wp-content/uploads/2024/07/4wcm2024-402-407-11-300x203.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>Figure 2: </strong>Spearman’s r heatmap</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>4. CONCLUSION</strong></h3>\n<p>In conclusion, the results of this study suggest that there is a wide range of variability in the climate and weather patterns in the highlands of Lesotho, which may have an effect on the water supply and availability in the region. The Mann Kendall trend test showed evidence of a trend in the Sunspot Number (SSN) data, with a two-tailed p-value of less than 0.0001, while the Southern Oscillation Index (SOI) showed a weak positive correlation with precipitation in the dams, with a two-tailed p-value of 0.020. The correlation analysis showed a strong negative relationship between SSN and precipitation in the dams, with a two-tailed p-value of 0.604. Based on these findings, it is recommended to conduct further studies to explore the full extent of these relationships and their implications for water resources management in the region. Further, it is important to closely monitor SSN as it has a significant effect on the precipitation patterns in the region.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>REFERENCES</strong></h3>\n<ul>\n<li>\n<ul>\n<li>Chen, Y., Hedding, D. W., Li, X., Greyling, A. C., and Li, G., 2020. Weathering Dyna mics of Large Igneous Provinces (LIPs): A Case Study from the Lesotho Highlands. Earth and Planetary Science Letters 530: 115871.Https://doi.org/10.1016/j.epsl.20 19.115871.</li>\n<li>Demircan Çakar, Nigar, Ayfer Gedikli, Seyfettin Erdoğan, and Durmuş Çağrı Yıldırım. 2021. A Comparative Analysis of the Relationship between Innovation and Transport Sector Carbon Emissions in Developed and Developing Mediterranean Countries. Environmental Science and Pollution Research 28(33): Pp. 45693–713.</li>\n<li>Fan, M., Lal, R., Zhang, H., Margenot, A. J., Wu, J., Wu, P., and Gao, C., 2020. Variability and Determinants of Soil Org anic Matter under Different Land Uses and Soil Types in Eastern China. Soil and Tillage Research 198(November 2019): 104544.https://doi.org/10.1016/j.still.2019.104544.</li>\n<li>Fang, G., Li, X., Xu, M., Wen, X., and Huang, X., 2021. Spatiotemporal Vari ability of Drought and Its Multi-Scale Linkages with Climate Indices in the Huaihe River Basin, Central China and East China. Atmosphere 12(11).</li>\n<li>Gherardi, Laureano A., and Osvaldo E. Sala. 2019. Effect of Interannual Precipita tion Variability on Dryland Producti vity: A Global Synthesis. Global Change Biology 25(1): Pp. 269–76.</li>\n<li>Gong, J., Dong, H., Xia, Q. S., Huang, Z. Y., Wang, D. K., Zhao, Y., and Lu, F. E., 2020. Correlation Analysis between Disea se Severity and Inflammation-Related Para meters in Patients with COVID-19: A Retro spective Study. BMC Infectious Diseases 20(1): Pp. 1–7.</li>\n<li>Grab, S. W., and Nash, D. J., 2010. Documentary Evidence of Climate Varia bility during Cold Seasons in Lesotho, Sout hern Africa, 1833-1900. Climate Dynamics 34(4): Pp. 473–99.</li>\n<li>Gu, X., 2021. Time Series Analysis – Clim atological Applications.</li>\n<li>Ilyés, C., Szűcs, P., and Turai, E., 2022. Appearance of Climatic Cycles and Osci llations in Carpathian Basin Precipitation Data. Hungarian Geographical Bulletin 71(1): Pp. 21–37.</li>\n<li>Kim, J. H., and Chang, H. Y., 2019. Association between Solar Variability and Teleconnection Index. Journal of Astrono my and Space Sciences 36(3): Pp. 149–57.</li>\n<li>Kundzewicz, Z. W., Szwed, M., and Pińskwar, I., 2019. Climate Variability and Floods-A Global Review. Water (Switzerla nd) 11(7).</li>\n<li>Musabbir, M., Islam, A. R. M. T., Rahman, M. S., Pal, S. C., Alam, E., and Mallick, J., 2023. Spatiotemporal Variability of Rain fall Erosivity and Its Teleconnection with Atmospheric Circulation in Monsoon-Driv en Climate Region. Catena 221(PA):106 762.https://doi.org/10.1016/j.catena.2022. 106762.</li>\n<li>Nashwan, M. S., Ismail, T. A. R. M. I. Z. I., and Ahmed, K. A. M. A. L., 2019. Non-Stationary Analysis of Extreme Rainfall in Peninsular Malaysia. Journal of Sustainab ility Science and Management 14(3): Pp. 17–34.</li>\n<li>Pan, X., Wang, G., Yang, P., Wang, J., and Tsonis, A. A., 2020. On the interconne ctions among major climate modes and th eir common driving factors. Earth System Dynamics, 11(2), 525-535.2020. On the Interconnections among Major Climate Modes and Their Common Driving Factors. Earth System Dynamics 11(2): Pp. 525–35.</li>\n<li>Pargeter, Justin, Emma Loftus, and Peter Mitchell. 2017. New Ages from Sehongho ng Rock Shelter: Implications for the Late Pleistocene Occupation of Highland Les otho. Journal of Archaeological Science: Reports 12: Pp. 307–15. http://dx .doi.org/ 10.1016 /j.jasrep. 2017. 01.027.</li>\n<li>Pi, I., and Krawiec, K., 2021. Climate Variability Indices — A Guided Tour: Pp. 126.</li>\n<li>Rönkkö, M., and Cho, E., 2022. 25 Organizational Research Methods An Updated Guideline for Assessing Discrimi nant Validity.</li>\n<li>Shmelev, S. E., Salnikov, V., Turulina, G., Polyakova, S., Tazhibayeva, T., Schnitzler, T., and Shmeleva, I. A., 2021. Climate Change and Food Security: The Impact of Some Key Variables on Wheat Yield in Kaz akhstan. Sustainability, Switzerland.13 (15) : Pp. 1–23.</li>\n<li>Talanow, K., Topp, E. N., Loos, J., and Martín-López, B., 2021. Farmers’ Percep tions of Climate Change and Adaptation Strategies in South Africa’s Western Cape. Journal of Rural Studies 81,November 20 20: Pp. 203–19.</li>\n<li>Wang, P., Wu, X., Hao, Y., Wu, C., and Zhang, J., 2020. Is Southwest China Drying or Wetting? Spatiotemporal Patterns and Potential Causes.Theoretical and Applied Climatology 139(1–2): Pp.1–15.</li>\n<li>Wu, Q., Zuo, Q., Han, C., and Ma, J., 2022. Integrated Assessment of Variation Cha racteristics and Driving Forces in Preci pitation and Temperature under Climate Change: A Case Study of Upper Yellow River Basin, China. Atmospheric Research 272(100): 106156. https://doi.org/10.10 16 /j.atmosres.2022.106156.</li>\n<li>Zhang, X., Chen, Y., Xia, Q., Fang, G., Xia, Z., and Li, Y., 2022. Application of Bias Corrected FGOALS-G3 Model Products for Detecting Changes in Extreme Precip itation in the Tienshan Mountains, Central Asia. Atmospheric Research 280, July: 106 455. https://doi.org/10.1016/j.atmosre s.20 22.106455.</li>\n<li>Zou, Y., Donner, R. V., Marwan, N., Don ges, J. F., and Kurths, J.2019. Complex Net work Approaches to Nonlinear Time Series Analysis. Physics Reports 787: Pp. 1–97. https://doi.org/10.1016/j.physrep. 2018.10. 005.</li>\n</ul>\n</li>\n</ul>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>402-407</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>4</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8686\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/4wcm2024/4wcm2024-402-407.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"AqilZ","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"a4750809a7ab89174de598687bca118575cab10a30a526ab475527118884003d","category":"Environment"}