{"title":"325 Longitudinal retrospective study of performance and biomarkers of energy balance and gastrointestinal functionality in unweaned calves subjected to transport or entire commercialization at arrival","link":"https://academic.oup.com/jas/article/102/Supplement_3/12/7757057?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Data from 347 unweaned male dairy beef calves enrolled in 3 studies from 2021 to 2023 were used to evaluate the impact of transport or entire commercialization (marketing and transport) on performance recovery [average daily gain (ADG) and concentrate intake (CI)] and biomarkers of energy balance [non-esterified fatty acids (NEFA), beta-hydroxybutyrate (BHB), and glucose] and gastrointestinal functionality [gut permeability (Cr-EDTA) and enterocyte mass (citrulline)] at farm arrival. Calves were distributed in 3 treatments according to the different managements subjected in the previous studies: calves from a sole dairy farm that were not fasted neither transported (CTR), calves from a sole dairy farm that were transported and fasted for 19 h (TRA), and multi-origin calves commercially marketed and transported for 9 h (COM). On arrival at the rearing farm (d 0), calves were allocated individually, and body weight (BW) was recorded. Calves were fed milk replacer twice daily, and they had ad libitum access to concentrate and water. Concentrate (CI) and milk replacer intake were recorded daily, and BW and the biomarkers of energy balance and gut dysfunction were obtained on d 0 (arrival), 1, 2, and 7. Data were analyzed with mixed models. An interaction (<span>P</span> &lt; 0.01) between treatment and time was observed for CI. On d 0 CTR and TRA had similar CI, while COM had the least CI. On d 1, all treatments decreased CI except CTR. While TRA recovered CI to CTR levels, COM had 50% less CI compared with the other calves on d 7. The COM calves had the least (<span>P</span> &lt; 0.01) ADG compared with CTR and TRA calves. On d 0, COM calves had greater (<span>P</span> &lt; 0.01) concentrations of NEFA and BHB compared with TRA and CTR, and TRA greater (<span>P</span> &lt; 0.01) than CTR calves. The COM calves did not recover NEFA and BHB basal concentrations by d 7 as observed in TRA calves. Concentration of Cr-EDTA was greater on d 0 for TRA calves compared with CTR and COM calves, however concentration of Cr-EDTA was greater during the first 7 d in COM calves compared with CTR and TRA calves. Finally, citrulline concentration was less in COM calves compared with CTR and TRA calves independently of the sampling day. The entire commercialization process, marketing and transportation, of unweaned dairy beef calves impairs intake recovery and growth, and these results are aligned with negative energy balance and comprised gastrointestinal functionality at farm arrival.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a480fccdd6f75b1d04e0f5b05e1f1e5d14c8a169cc42562988d1b11f4475590f","category":"Environment"}