{"title":"Multiplexed transcriptional profiling of Dermatophagoides house dust mites allergens in human epithelium cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24109?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Allergic asthma, a chronic disease characterized by airway inflammation, poses a significant public health concern. It is well-established that house dust mites (HDMs) are common inducers of allergic responses in individuals, particularly children. In central Taiwan, our research team observed that over 80% of allergic children exhibited sensitization to various HDMs species. This investigation aims to bridge the gap between these observations and a better understanding of the early fundamental mechanisms for preventing allergic diseases. Specifically, our study delves into the impact of crude extracts of HDMs on human epithelial BEAS-2B cells. Our findings, based on RNA sequencing (RNA-seq) analysis, shed light on how three major <i>Dermatophagoides</i> HDMs allergens activate a common Toll-like receptor signaling pathway in human epithelial cells within a 4-h treatment. During this process, the nuclear transcription factor NF-κB translocated into the cell nucleus within 30 min of allergen stimulation, triggering the expression of pro-inflammatory genes such as IL-6 and IL-8 over 4 h. Additionally, when the cells were treated with specific <i>Dermatophagoides microceras (Der m)</i> allergens, it resulted in the upregulation of genes that regulate type 1 diabetes mellitus (T1DM) signaling pathways. This led to the mediation of IL-12A inflammation. Furthermore, there was an increase in gene sets associated with cilia function and the microtubule cytoskeleton in human epithelial cells after treatment with a combination of <i>Der m</i> allergens and Dexamethasone. Additionally, OMICs analysis was conducted to examine the effects of HDMs allergenic stimulation on human epidermal cells. We aimed to improve our understanding of the molecular mechanisms within cells and identify potential targets and natural products in the treatment of asthma caused by HDMs allergens.</p>","author":"Chia‐Yang Lin, \nChun‐Wen Cheng, \nJiunn‐Liang Ko, \nKo‐Huang Lue, \nYu‐Fan Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"a4844e1cee3067f09b12c91e4902e974d2c62ae232d2748d92b6fed8111d0678","category":"Environment"}