{"title":"Transfer Learning and Deep Neural Networks for Robust Intersubject Hand Movement Detection from EEG Signals","link":"https://www.preprints.org/manuscript/202408.1351/v1","date":1724066204000,"content":"In this proposed work, five systems were developed to classify four motor functions—forward hand movement (FW), grasp (GP), release (RL), and reverse hand movement (RV)—from EEG signals. The dataset used is WAY-EEG-GAL, involving participants performing a sequence of hand movements. During preprocessing, bandpass filtering was applied to remove artifacts and focus on the mu and beta frequency bands. The first system, a preliminary study model, explored the overall framework of EEG signal processing and classification. It utilized time-domain features like variance and frequency-domain features like alpha and beta power, with classification performed using a KNN model. Insights from this system informed the development of a baseline system, which uses the same dataset but different feature extraction and classification paradigms. This baseline system combined the common spatial patterns (CSP) method with continuous wavelet transform (CWT) for feature extraction and employed a GoogLeNet classifier with transfer learning. Classification was performed on six unique pairs of events derived from the four motor functions, using both intrasubject and intersubject methods. The baseline system achieved the highest accuracy of 99.73% for the GP-RV pair and the lowest accuracy of 80.87% for the FW-GP pair in intersubject classification. Building on this, three additional systems were developed to perform 4-way classification. Among these, the final model, ML-CSP-OVR, achieved the highest intersubject classification accuracy of 78.08% using all combined data and 76.39% for leave-one-out intersubject classification. This proposed model, which features a novel combination of CSP-OVR, CWT, and GoogLeNet, demonstrates strong potential as a general system for motor imagery (MI) tasks without being subject-dependent.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a492784e16410ac177e058c824ecfa405cea31796ef6ea5c33f82c8f4b8bdb3c","category":"Interdisciplinary"}