{"title":"Modeling the economic burden of postpartum hemorrhage due to substandard uterotonics in Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003181","date":1718892000000,"content":"<p>by Kiara Bautista, Yi-Fang (Ashley) Lee, Colleen R. Higgins, Petra Procter, Sara Rushwan, Abraham Baidoo, Kofi Issah, Chris Opoku Fofie, A. Metin Gülmezoglu, Lester Chinery, Sachiko Ozawa</p>\r\n\r\nUterotonics are essential in preventing postpartum hemorrhage (PPH), the leading direct cause of maternal death worldwide. However, uterotonics are often substandard in low- and middle-income countries, contributing to poor maternal health outcomes. This study examines the health and economic impact of substandard uterotonics in Ghana. A decision-tree model was built to simulate vaginal and cesarean section births across health facilities, uterotonic quality and utilization, PPH risk and diagnosis, and resulting health and economic outcomes. We utilized delivery data from Ghana’s maternal health survey, risks of health outcomes from a Cochrane review, and E-MOTIVE trial data for health outcomes related to oxytocin quality. We compared scenarios with and without substandard uterotonics, as well as scenarios altering uterotonic use and care-seeking behaviors. We found that substandard uterotonic use contributes to $18.8 million in economic burden annually, including $6.3 million and $4.8 million in out-of-pocket expenditures in public and private sectors, respectively. Annually, the National Health Insurance Scheme bears $1.6 million in costs due to substandard uterotonic use. Substandard uterotonics contribute to $6 million in long-term productivity losses from maternal mortality annually. Improving the quality of uterotonics could reduce 20,000 (11%) PPH cases, 5,000 (11%) severe PPH cases, and 100 (11%) deaths due to PPH annually in Ghana. Ensuring the quality of uterotonics would result in millions of dollars in cost savings and improve maternal health outcomes for the government and families in Ghana. Cost savings from improving uterotonic quality would provide financial protection and help Ghana advance toward Universal Health Coverage.","author":"Kiara Bautista","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a496bb75aaf1752ae4c4e802707222b577b74fdbc38e074dbae86ff1cb35af74","category":"Environment"}