{"title":"RESISTANCE TO PHYTOPHTHORA1 promotes cytochrome b559 formation during early photosystem II biogenesis in Arabidopsis","link":"https://academic.oup.com/plcell/article/36/10/4143/7706168?rss=1","date":1720051200000,"content":"<span><div>Abstract</div>As an essential intrinsic component of photosystem II (PSII) in all oxygenic photosynthetic organisms, heme-bridged heterodimer cytochrome <span>b559</span> (Cyt <span>b559</span>) plays critical roles in the protection and assembly of PSII. However, the underlying mechanisms of Cyt <span>b559</span> assembly are largely unclear. Here, we characterized the Arabidopsis (<span>Arabidopsis thaliana</span>) <span>rph1</span> (<span>resistance to Phytophthora1</span>) mutant, which was previously shown to be susceptible to the oomycete pathogen <span>Phytophthora brassicae</span>. Loss of RPH1 leads to a drastic reduction in PSII accumulation, which can be primarily attributed to the defective formation of Cyt <span>b559</span>. Spectroscopic analyses showed that the heme level in PSII supercomplexes isolated from <span>rph1</span> is significantly reduced, suggesting that RPH1 facilitates proper heme assembly in Cyt <span>b559</span>. Due to the loss of RPH1-mediated processes, a covalently bound PsbE–PsbF heterodimer is formed during the biogenesis of PSII. In addition, <span>rph1</span> is highly photosensitive and accumulates elevated levels of reactive oxygen species under photoinhibitory-light conditions. RPH1 is a conserved intrinsic thylakoid protein present in green algae and terrestrial plants, but absent in <span>Synechocystis</span>, and it directly interacts with the subunits of Cyt <span>b559</span>. Thus, our data demonstrate that RPH1 represents a chloroplast acquisition specifically promoting the efficient assembly of Cyt <span>b559</span>, probably by mediating proper heme insertion into the apo-Cyt <span>b559</span> during the initial phase of PSII biogenesis.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"a499d0e372cc9813ec7880343934bca0cb083c86e46a2429b1f5384bcf399aec","category":"Environment"}