{"title":"Exploring the role of interleukin-1β and interleukin-6 in the pathophysiology of obsessive-compulsive disorder","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306125","date":1719410400000,"content":"<p>by Nisat Sarmin, A. S. M. Roknuzzaman, Rapty Sarker, Mamun-or- Rashid, Ahasanul Hasan, M. M. A. Shalahuddin Qusar, Eva Rahman Kabir, Md. Rabiul Islam, Zobaer Al Mahmud</p>\r\nBackground <p>Obsessive-compulsive disorder (OCD) is a highly prevalent neuropsychiatric disorder. Recently, there has been a growing interest in investigating the association between pro-inflammatory cytokines and the pathogenesis of OCD. However, studies targeting interleukin-1β (IL-1β) and interleukin-6 (IL-6) in OCD are limited. Therefore, the present study aimed to explore the potential role of pro-inflammatory cytokines IL-1β and IL-6 in the pathophysiology and development of OCD.</p> Methods <p>This study recruited 58 OCD patients and 30 age-sex-matched healthy controls (HCs). A qualified psychiatrist diagnosed OCD patients and assessed HCs based on the Diagnostic and Statistical Manual for Mental Health Disorders, 5th edition (DSM-5) criteria. We measured the severity of OCD using the Yale-Brown Obsessive Compulsive Scale (Y-BOCS). Serum IL-1β and IL-6 levels were measured using ELISA kits following the appropriate methods.</p> Results <p>The results showed that serum IL-1β levels were significantly elevated in OCD patients compared to HCs (23.68±1.65 pg/ml vs. 15.75±1.02 pg/ml; p = 0.002). Similarly, OCD patients exhibited significantly higher serum IL-6 levels than HCs (44.97±0.73 pg/ml vs. 37.04±0.35 pg/ml; p&lt;0.001). We observed both cytokines were positively correlated with the Y-BOCS scores in OCD patients (IL-1β: r = 0.380, p = 0.015; IL-6: r = 0.324, p = 0.026) which indicates their role in disease pathophysiology.</p> Conclusion <p>These results suggest that serum IL-1β and IL-6 levels may be associated with the pathophysiology of OCD. Also, these cytokines levels in blood samples can serve as early risk assessment tools for the development of OCD. We recommend further studies in a large and homogeneous population to support these findings.</p>","author":"Nisat Sarmin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a49e1581953ea9031a7fd0149c69cbae61fc4dfa673ec12f422105747145caa2","category":"Interdisciplinary"}