{"title":"Bloomberg รายงาน สหรัฐฯ เตรียมสอบสวน stablecoins หลังกังวลว่าอาจเป็นความเสี่ยงต่อระบบการเงิน","link":"https://www.blognone.com/node/124726","date":1631543775000,"content":"<div><div><div><p>สำนักข่าว Bloomberg รายงานว่า กระทรวงการคลังของสหรัฐฯ และหน่วยงานอื่น ๆ กำลังเตรียมสอบสวน stablecoins ผ่านสภาดูแลความมั่นคงทางการเงินหรือ FSOC โดยหน่วยงานภาครัฐกังวลว่าสกุลเงินดิจิทัลเหล่านี้ส่วนใหญ่ยังไม่ได้อยู่ภายใต้การกำกับดูแล และเป็นความเสี่ยงต่อระบบการเงินได้ จึงจำเป็นต้องตรวจสอบอย่างจริงจัง</p>\n<p>กลุ่มเหรียญ cryptocurrency ที่เรียกว่า stablecoins ถูกสร้างขึ้นมาให้มีมูลค่าผูกกับสกุลเงินทั่วไปซึ่งจะผันผวนน้อยกว่าสินทรัพย์ดิจิทัลต่าง ๆ เช่น USDT, USDC หรือ BUSD ที่ 1 เหรียญมีมูลค่าเท่ากับหรือใกล้เคียงกับ 1 ดอลลาร์ ซึ่งบริษัทที่เป็นผู้พัฒนาเหรียญอย่าง Tether ระบุว่าเหรียญเหล่านี้มีสินทรัพย์หนุนหลัง อย่างเช่นตราสารหนี้บริษัทเอกชนหรือว่าเงินดอลลาร์</p>\n<p>ปัจจุบันเหรียญ stablecoins ที่อยู่ในตลาดคริปโตมีมูลค่ากว่า 1.2 แสนล้านดอลลาร์ และนิยมใช้กับธุรกรรมต่าง ๆ ในลักษณะที่คล้ายกับผลิตภัณฑ์ทางการเงินอย่างบัญชีธนาคาร รวมถึงใช้เป็นสื่อกลางในการเทรดสินทรัพย์ดิจิทัลอย่าง Bitcoin ด้วย ดังนั้น stablecoins จึงสำคัญต่อตลาดคริปโตมาก</p>\n<p>แหล่งข่าวของ Bloomberg ระบวุ่า หน่วยงานรัฐซึ่งนำโดย Janet Yellen รัฐมนตรีกระทรวงการคลังของสหรัฐฯ เตรียมจะตรวจสอบและออกคำแนะนำเกี่ยวกับ stablecoins ซึ่งคาดว่าคณะกรรมการจะโฟกัสไปที่ Tether ที่บริษัทยืนยันว่ามีสินทรัพย์หนุนหลังจำนวนมหาศาล โดยทางคณะกรรมการจะต้องศึกษาก่อนว่าหน่วยงานรัฐควรดำเนินการอย่างไร ซึ่งอาจต้องให้หน่วยงานรัฐเข้าไปแทรกแซงตลาดหรือกำกับดูแลเพื่อลดความเสี่ยงของธุรกรรมที่ทำผ่าน stablecoins ด้วย</p>\n<p>ที่มา - <a href=\"https://www.bloomberg.com/news/articles/2021-09-11/stablecoins-face-crackdown-as-u-s-discusses-risk-council-review\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fd39a71f4baf7c56fa9536a05576f6ec.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div><div><a href=\"/topics/usa\">USA</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a49f212a7b46ba02a7b623c2addbb8ca9ace8a2d823728ea1b84f0065cb518bf","category":"Thai"}