{"title":"What to do with a dead Mac’s built-in SSD to secure your privacy","link":"https://www.macworld.com/article/349089/what-to-do-with-a-dead-macs-built-in-ssd-to-secure-your-privacy.html","date":1624525200000,"content":"\n<div>\n<section><div></div></section><p>Apple shifted several years ago to using SSDs built directly into the main board of a Mac. That was for efficiency, cost, reduced heat dissipation, and other reasons, but it also made it impossible to upgrade the drive after purchase. The price we pay for thin computers.</p>\n\n\n\n<p>But what if your Mac dies and you want to get rid of it without private data some other party has the potential of retrieving?</p>\n\n\n\n<p>Previously, we addressed how to cope with a dead video display or video card in a Mac, noting that it might be possible to use Target Disk Mode and mount that Mac’s drive on another Mac and potentially erase it. This behavior has changed with M1 Macs, which requires a startup authentication phase to <a href=\"https://www.macworld.com/article/341818/how-to-share-a-macs-drive-with-another-mac-whether-intel-or-apple-silicon.html\">enter Sharing Disk mode</a>.</p>\n\n\n\n<p>If your Mac can’t be roused at all, however, go through this list first.</p>\n\n\n\n<ul><li>Check if your Mac really can’t have its drive removed. Maybe it can! My wife had a 2014 MacBook Pro fail recently, and after running through all the options for repair, we took the bottom case off, removed one screw, and slid out its built-in SSD before sending it off to Apple’s recycling partner. (We could now get it securely destroyed; see below.)</li><li>Consider whether you had FileVault enabled. Because the machine is seemingly dead and powered off, the drive is absolutely “at rest”! In that situation, someone must have the password of an account on the Mac enabled for FileVault to unlock the key that decrypts your drive. The drive’s data is otherwise unrecoverable.</li><li>Note the particular case that exists with Intel Macs with a T2 Security Chip or an M1 Apple silicon processor: if FileVault is turned off, the drive remains encrypted using a key stored in the Secure Enclave on the chip or processor. Starting up the computer decrypts the drive, though a malicious party would still have to break into your account. However, if the drive is separate from the T2 chip or M1 processor, the key is lost forever—it’s as good as if FileVault were enabled.</li></ul><p>If you’re not sure about FileVault status with a pre-T2/M1 Mac and can’t remove the drive, or have a T2/M1 Mac and had FileVault off and this makes you nervous, here are your options.</p>\n\n\n\n<ul><li><a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/me/recycling/&amp;subid1=1-1-349089-0-0-0\">Use Apple’s free recycling program</a>. However, it’s worth pointing out the footnote on the page; “You are solely responsible for removing all data, including confidential and personal data, from the device prior to shipping.” I’m sure Apple’s partners have security in place to wipe or destroy drives, but Apple doesn’t want to assume liability for the problem.</li><li>Use a local electronics recycler that has an erasure certification. Many community-oriented and business-focused recyclers have gone through a certification process that requires them to provide details and show their methods of ensuring data is erased from a drive or that a damaged drive is destroyed in the process of recycling. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.retirepc.com/environment/r2-compliance/&amp;xcust=1-1-349089-0-0-0&amp;sref=https://www.macworld.com/feed\">This page at RetirePC explains the process</a>. Look for certification on the sites of local recyclers.</li><li>Open up the Mac, find the SSD, and break the chips. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/Guide/How+to+safely+and+securely+destroy+data+on+SSDs+and+memory+sticks/142798&amp;xcust=1-1-349089-0-0-0&amp;sref=https://www.macworld.com/feed\">iFixIt has advice on removable SSDs</a>, which isn’t directly applicable but may help. The site also has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/Teardown/MacBook+Pro+16-Inch+2019+Teardown/128106&amp;xcust=1-1-349089-0-0-0&amp;sref=https://www.macworld.com/feed\">teardowns</a> of all Mac models and calls out flash storage (distinct from RAM) in photographs.</li></ul><p><em>This Mac 911 article is in response to a question submitted by Macworld reader Will.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a4a014bf80aa0627e69f3323364ce12576971469ebc6ab38e55bf933cecd5092","category":"Apple"}