{"title":"Apple's iPhone 15 Event Expected September 12 or 13, Launch on September 22","link":"https://www.macrumors.com/2023/08/06/iphone-15-event-september-12-or-13/","date":1691328929000,"content":"Apple's annual <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> event is expected to take place on either Tuesday, September 12, or Wednesday, September 13, this year, <a href=\"https://www.bloomberg.com/news/newsletters/2023-08-06/apple-iphone-15-comes-amid-us-sales-slowdown-tim-cook-q3-earnings-comments-lkzfs14u\">according to <em>Bloomberg</em>'s Mark Gurman</a> in the latest edition of his Power On newsletter. With Apple's usual timing, pre-orders for the new iPhones would go live a few days later on Friday, September 15, and a launch would come one week later on September 22.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPhone-15-Pro-Blue-Front-Perspective-Feature.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nApple typically holds its event in the first two weeks of the month, enabling it to launch its new iPhones and book significant revenue before the company's fiscal quarter wraps up at the end of the month, and it appears this year will be no exception. There have, however, been rumors of production challenges, which could mean certain models see very tight supplies or even a slightly later launch.\r<br />\n\r<br />\nA <a href=\"https://9to5mac.com/2023/08/03/sources-iphone-15-event-september/\">report from <em>9to5Mac</em></a> last week claimed that multiple carrier partners have blocked employees from taking time off on Wednesday, September 13, in anticipation of a \"major smartphone announcement.\" It's not entirely clear why carrier employee off days would be blocked on an event day, as pre-order and launch days are their busiest times, but it does line up with Gurman's reported schedule.\r<br />\n\r<br />\nApple's ‌iPhone‌ events are most commonly held on Tuesdays, except for weeks that coincide with Labor Day  on that Monday in the United States. In those cases, the events are usually held on Wednesdays to allow media to travel on the previous day without interfering with the holiday. Given the rumored week does not include Labor Day this year, that would argue for a Tuesday event on September 12, but it's not out of the question for Apple to opt for a Wednesday event for some reason.\r<br />\n\r<br />\nApple usually sends out media invitations roughly a week advance, so we still have some time before we get official confirmation on the event date, but additional rumors firming things up will likely surface over the next month.\r<br />\n\r<br />\nIn addition to the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> lineup, the September event is expected to include updated <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a> and <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a> 2 models, final details and launch dates for <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> and related operating system updates, and perhaps a few other announcements.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/06/iphone-15-event-september-12-or-13/\">Apple's iPhone 15 Event Expected September 12 or 13, Launch on September 22</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-iphone-15-event-expected-september-12-or-13-launch-on-september-22.2397924/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a4a520ef3d11d605cc6ce75864891d5f0331a454a7a69794764792216e1cdfea","category":"Apple"}