{"title":"Anxiety disorders among youth with substance use and associated factors in Northwest Ethiopia: A community-based study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300927","date":1711029600000,"content":"<p>by Mamaru Melkam, Demeke Demilew, Tilahun Kassew, Biruk Fanta, Sewbesew Yitayih, Kassahun Alemu, Yassin Muhammed, Berhanie Getnet, Eden Abetu, Gebrekidan Ewnetu Tarekeg, Mohammed Oumer, Goshu Nenko</p>\r\nIntroduction <p>Anxiety disorder is an unpleasant emotional feeling with symptoms related to psychological and autonomic symptoms such as headache, perspiration, palpitations, dizziness, and stomach discomfort. The use of substances become a worldwide problem among youth which brings situation that leads to serious social and health-related problems. Anxiety disorders with substance use have a huge impact on their high prevalence, therapeutic issues, and poor prognosis on clinical effects. Although the prevalence of anxiety disorders is significant among young people who use substances, limited studies were conducted. Therefore, this study revealed the burden of anxiety disorders among youth with substance use and associated factors in Ethiopia.</p> Method <p>A community-based multi-stage with a simple random sampling technique was conducted. A total of 372 substance users study participants were recruited for this study. Alcohol, Smoking, and Substance Involvement Screening Tests, Depression Anxiety Stress Scales, and other tools were used to assess anxiety disorders with substance use and associated factors. Data were entered into Epi-data version 4.6, and exported to SPSS version 20 for further analysis. Bi-variables logistic regression analysis was employed to identify variables with a p-value of &lt; 0.2 and associated factors were determined in multi-variables logistic regression analysis with a p-value &lt; 0.05 with AOR and CI.</p> Results <p>From a total of 372 respondents the overall prevalence of anxiety disorders with substance use was 48.1%. Male sex [AOR = 1.99; 95% CI: (1.01–3.93)], low educational status of the father [AOR = 6.38 95%CI: (1.50–7.08)], and the presence of stress [AOR = 2.48; 95% CI: 2.48(2.43–4.40)] were significantly associated factors with anxiety disorders with substances use.</p> Conclusions and recommendations <p>The prevalence of anxiety disorders with substance use was 48.1% therefore; it is recommended that the zonal administration give collaborative work with the health bureau and facilitate awareness creation about the impact of substance abuse. Clinicians are recommended to mitigate anxiety disorders with substance use to get a good prognosis for clients with controlling their stress.</p>","author":"Mamaru Melkam","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a4a8361584a9395c197a8740b43d9a29762e543f6e26503339cafc6a2875e27e","category":"Interdisciplinary"}