{"title":"DC Rainmaker State of Sports Tech 2021 Keynote","link":"https://www.dcrainmaker.com/2021/10/dc-rainmaker-state-of-sports-tech-2021-keynote.html","date":1634561699000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2020/10/vlcsnap-2020-10-20-18h19m24s082.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/DCR-Presentation2021.jpg\" /></a></p>\n<p>It’s up! The 2021 State of Sports Tech Keynote that was delivered last week, encompassing everything going well…and not so well, in the sports tech industry. From watches to indoor training, sensors to action cams, and given this is an industry focused event – also the degradation of standards in the fitness realm.</p>\n<p>For a decade now I’ve been giving a ‘State of Sports Tech’ annual keynote each fall. Historically this has been delivered at the ANT+ Symposium. But that was discontinued last year, and thus instead the venue shifted to the Garmin Developer Virtual Conference. But, the annual keynote keeps focused on the same thing – regardless of the hosting event.</p>\n<p>Remember, the audience for the presentation is the sports tech industry, not specifically consumers. Though, I’ve found over the last decade that many DCR Readers are interested in the presentation, and thus tend to enjoy the dive behind the scenes.  As always, while the presentation may be held in one venue or another, neither Garmin nor any other entity has any control of what I say. Nor do they pay me for it.</p>\n<p>As with most years, I start off with the overall trends, and then dig into each of the trends deeper throughout the presentation. I talk about everything from concerns with how anti-cheating controls are handled in the rise of Esports, to how the lack of in-person industry events over the last year has contributed a growing neglect of standards and cross-product integration. On the flip side I talk about all the cool stuff too. From police units using Varia radar to deal with bad drivers, and continuous glucose monitoring maybe finally getting it’s moment in the sports sun.</p>\n<p>Ok, intro over, just hit ‘Play’ on <a href=\"https://www.youtube.com/watch?v=03Rh1W8tPZw\">the presentation below</a>. I’ve <strong>put in YouTube chapters</strong> so you can dig around and find the sections that are most interesting to you. <strong>You’ll see those as you drag along the timeline</strong> in the video.</p>\n<p></p>\n<p>Oh, and here’s the <a href=\"https://www.youtube.com/watch?v=4D4_UfQsL2c\">2020 edition</a>, if you want to watch that. Or, the <a href=\"https://www.youtube.com/playlist?list=PL2d0vVOWVtklwjsHN5l0Ah6Xi1oPM5tXL\">entire playlist of all past ones is here.</a></p>\n<p>With that – thanks for watching, and reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"a4a8a2a1d12a9caa82a245c367fa7b83a780a94e05e756e4cb039f38d9598e7c","category":"Cycling"}