{"title":"260 Industrial hemp (Cannabis sativa) supplementation improved plasma antioxidant enzymes and stress hormones in beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/87/7757127?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Industrial hemp is a rich source of antioxidants due to its high CBD but there is little information known about its impact on plasma antioxidant enzyme activity and stress hormone in beef cattle. The objective of this study was to determine the effect of industrial hemp supplementation on plasma antioxidant enzymes and stress hormone of Angus cattle. Black Angus heifers (n = 20) were completely randomized into either control (CON: n = 10, receiving 0 g of hemp) or hemp (HEMP: n = 10, receiving 30 g of hemp in 200 g of commercial concentrate) in a trial that lasted for 6 wk. Each group was replicated twice. Hay and water were offered ad libitum, experimental diets were offered o700 h daily. Blood samples were collected on d 0, 7, 14, 21, 28, 35 of the experiment for enzyme-linked immunosorbent assay to determine enzyme activity using standard kits. Data were analyzed using GLIMMIX procedure for repeated measure in SAS 9.4 with Compound symmetry as covariance structure while means were separated with Tukey at 5% alpha. There was significant (<span>P</span> &lt; 0.05) difference in cortisol with HEMP group having 97.54 ng/mL and 122.23 ng/mL for CON. There was treatment x time interaction in total antioxidant capacity (TAOC) and malondialdehyde, TAOC range was 7.26 to 13.95 U/mL in HEMP group and 7.56 to 11.80 U/mL in CON. In conclusion, industrial hemp improved plasma antioxidant status, reduced lipid peroxidation and decreased stress level thereby improving the performance and welfare of beef cattle</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a4a92b1c22b21797d9e6334276cbb8dc54c2ac1f3e5eeb7c75c482471d684953","category":"Environment"}