{"title":"Why you’ll want an iPhone 15 Pro this year–even if you’ve never bought one before","link":"https://www.macworld.com/article/1968238/iphone-15-pro-rumors-a17-processor-telephoto-camera-titanium-action-button.html","date":1688921063000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With WWDC behind us and summer in full swing, it won’t be long before the iPhone 15 is upon us. It’s still about two months away, but the rumor mill is already giving us a good idea of what to expect. Just as we have had for the last few years, we expect a standard iPhone 15 in regular and Plus sizes (6.1 and 6.7 inches, though slimmer bezels may make the displays ever-so-slightly larger), and the iPhone 15 Pro in nearly identical standard and Max sizes.</p>\n\n\n\n<p>At the low end, pricing is expected to be similar to current iPhone 14 models: $799/£849 for the standard iPhone 15 and $899/£949 for the larger Plus model. At the high end, prices could jump by $100, with some rumors suggesting that the largest Pro model will be rebranded as the iPhone 15 Ultra and have an even higher price hike.</p>\n\n\n\n<p>So why should you pay so much more? What do you get when you spring for one of the iPhone 15 Pro models? Based on the best available rumors so far, here are the differences that Apple hopes will entice you to spend hundreds more.</p>\n\n\n\n<h2>The A17 chip</h2>\n\n\n\n<p>For the last two years, Apple has put a different chip in the Pro model iPhones. The iPhone 13 Pro had an A15 Bionic like the iPhone 13, only the higher-end phone had 5 GPU cores instead of 4. With the iPhone 14, Apple went further and made the A16 Bionic exclusive to the Pro models–the standard iPhone 14 and iPhone 14 Plus got the A15 again (with 5 GPU cores). </p>\n\n\n\n<p>If you want the <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-cpu-gpu-ram.html\">A17</a> and all the benefits it brings, you’re going to need to buy the iPhone 15 Pro or Max. The iPhone 15 and iPhone 15 Plus are going to get the A16 found in the iPhone 14 Pro and Pro Max. That’s still a very fast chip, but we have high hopes that the new 3nm process will allow Apple to really push the A17 design in new ways instead of just making it 15-20 percent faster.</p>\n\n\n\n<h2>The titanium body</h2>\n\n\n\n<p>The iPhone 15 Pro’s enclosure may be made of titanium instead of stainless steel, just like the Apple Watch Ultra. That would be the first time Apple used a new material in the iPhone Pro since the model launched in 2019.</p>\n\n\n\n<p>Steel tends to be a little stronger and harder than titanium (it varies widely depending on the exact composition and heat treatment of the steel), but titanium is still very strong and hard and weighs about half as much as steel. That means a much lighter and more comfortable iPhone–especially the largest Max/Ultra model, which currently tips the scales at 240 grams.</p>\n\n\n\n<h2>The telephoto camera</h2>\n\n\n\n<p>The regular iPhones have a standard (wide) and an ultrawide camera. The Pro models include a telephoto camera–currently a 12MP camera with 3x zoom in the iPhone 14 Pro.</p>\n\n\n\n<p>Some say the iPhone 15 will have the same big 48MP wide-angle camera as the iPhone 14 Pro, which could be a reason to not buy the Pro model. But consider this: the non-Pro iPhones have thus far not supported the ProRAW format, which is required to capture full-sized 48MP photos–in standard HEIF or JPG formats you only get pixel-binned 12MP photos. Since ProRAW likely isn’t coming to the non-Pro iPhone 15, we assume iPhone 15 photos will be limited to 12MP images, so you’ll still need an iPhone 15 Pro to take full advantage of the 48MP camera.</p>\n\n\n\n<p>Regardless, the iPhone 15 Pro is sure to have a telephoto camera that the iPhone 15 doesn’t have. And if you’re looking at a larger phone, the iPhone 15 Pro Max is said to feature a new periscope lens telephoto camera with an optical zoom of 5x-6x and a digital zoom of at least 20X, both substantially better than they the iPhone 14 Pro. </p>\n\n\n\n<p>Furthermore, the Pro iPhones also have LiDAR sensors, which is good for AR apps and for improving focus and portrait mode in dark environments. It also might be useful when the Vision Pro ships next year.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 14 Pro camera bump\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?quality=50&amp;strip=all 3356w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/iphone14-pro-cameras02.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption>The iPhone 15 Pro Max (Ultra?) may get a 5x or 6x periscope telephoto lens.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>The Action button</h2>\n\n\n\n<p>With the iPhone 15 Pro models, Apple is rumored to finally replace the mute switch, which has been with us since the original iPhone, with a button. This so-called “Action button” would perform different functions depending on how you’re using your phone. For example, when locked it will mute or unmute your iPhone, but perhaps when using the Camera app, it could take on another function like quickly switching between video and photo modes. Maybe a double-tap of the button from your home screen will perform a shortcut from a list of options, similar to the <a href=\"https://www.macworld.com/article/551757/how-to-ios-back-tap-accessibility.html\">“back tap” accessibility feature</a>?</p>\n\n\n\n<p>There’s no reason that mute needs to be a toggle switch rather than a button, and a button provides a lot more flexibility. Plus, it means cases without awkward cutouts. And it look like you’ll only get it on the Pro phones.</p>\n\n\n\n<h2>The display</h2>\n\n\n\n<p>The iPhone 15 is expected to have an OLED display with the Dynamic Island, as found on the iPhone 14 Pro today. But even so, the Pro models are still far superior, with features like higher peak and outdoor brightness, always-on display, and ProMotion. And that always-on display will get even more useful in <a href=\"https://www.macworld.com/article/1940357/ios-17-features-live-voicemail-autocorrect-contact-posters-standby.html\">iOS 17 thanks to the new StandBy feature</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 15 USB-C port leaked pic\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/02/iphone-15-usb-c-port-leak.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption>All iPhone 15 models are going to get USB-C, but the Pros might be a lot faster.</figcaption></figure><p>Unknownz21/@URedditor</p></div>\n\n\n\n<h2>The USB-C port</h2>\n\n\n\n<p>All iPhone 15 models are expected to ditch the Lightning connector in favor of USB-C. The European Union’s new laws require it on future products. The rumors suggest that we can expect USB 2.0 data transfer speeds on the regular iPhone 15 (480 Mbits per second, just like Lightning), while the iPhone 15 Pro will get USB 3.2 or Thunderbolt 3 support, giving data transfer speeds of up to 20 or 40 Gbits per second. </p>\n\n\n\n<p>Faster charging speeds are a possibility, though some rumors suggest that those higher speeds will be limited to special USB-C cables that have authentication chips in them like Lightning cables do today.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a4b4d42b189ccffcc9d2afefd5492c363525de331a63ae74eb664e6ac5427271","category":"Apple"}