{"title":"An Experimental Approach to Improve the Geometric Accuracy of Micro-features Fabricated by Stereolithography (SLA)","link":"https://www.preprints.org/manuscript/202403.0520/v1","date":1709900393000,"content":"In this paper, we present an experimental procedure to enhance the dimensional accuracy of fabrication via Stereolithography (SLA) of features at the micro-scale. Using a custom benchmark part, deviations in feature dimensions (micro-pores diameters and depths) were detected and measured by confocal microscopy. Samples characterization and experimental observations allowed the identification of inaccuracy sources, mainly due to the laser beam scanning strategy and to the incomplete removal of uncured liquid resin in post-processing (i.e., IPA washing). As a technology baseline, the measured dimensional errors on pores diameters were up to -46%. A compensation method of the nominal laser spot diameter (85m) was defined and implemented resulting in relevant improvements in dimensional accuracy of 9.8% and 11.3% on full-open pores diameter and depth, respectively. Further investigation was performed on a customized test part to adjust the calibration procedure. The measurements revealed that the estimate of the laser beam spot size is 968m. Measurements on micro-pores having different sizes revealed that a constant compensation parameter (i.e., C=85, 96, 120m) is not fully effective at the micro-scale, where average errors still remain at -24%, -18.8%, and -16% for compensations equals to 85, 96 and 120m, respectively. A further experimental campaign allowed the identification of an effective nonlinear compensation law where the compensation parameter depends on the micro-feature size C= f (D). Results show a sharp improvement in dimensional accuracy on micro-pore fabrication, with errors consistently below +8.2%. The proposed compensation method can be extended for the fabrication of any micro-features without restrictions on the specific technology implementation. Concerning the inaccuracy introduced by the laser path, experimentation with a customized part allowed the optimization of the part orientation to reduce the errors and their differences along the X and Y machine axes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a4c21bfce9933628737122edea8def5099bb7557d606a0498228866d8e556363","category":"Interdisciplinary"}