{"title":"My sweetheart has a basketball match: The relationship between love-hate and identification of individuals attending a euroleague match for recreational purposes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307892","date":1722002400000,"content":"<p>by Mustafa Can Koc, Laurentiu-Gabriel Talaghir, Aydin Pekel, Arif Cetin, Leonard Stoica</p>\r\n\r\nThe objective of this research was to examine the Love-Hate and Identification Relationship of Individuals Participating in Euroleague Match for Recreational Purposes. The study was conducted using a relational survey methodology. The study’s population comprises persons who watching recreational purpose part in the Euroleague match held in Istanbul in 2023–2024 season, while the sample consists of 178 voluntary participants selected through convenience sampling. The participants completed the Fan Love-Hate Scale and Fan Identification Scale, in addition to being asked about their gender, marital status, age, educational status, and frequency of attending football matches per week. The data collected from the personal information form and scales was entered into the IBM SPSS 24.0 software package for analysis. Statistical analyses were conducted using the Independent Sample T test and One-way Anova methods. The LSD test was employed to ascertain the dissimilarity between the groups. The Pearson correlation analysis was utilized to ascertain the association between the variables of love-hate and identity. In summary, it is evident that demographic factors, including gender and age, significantly influence fan perceptions and sports identification. In contrast, there is no substantial correlation observed between attributes such as level of education achieved and the frequency of engaging in sports activities, and the aforementioned outcomes. The significant associations identified between the Fan Love-Hate Scale and the Sports Fan Identification Scale underscore the complex relationship between fans’ emotional experiences and their connection to sports. Further investigations could be conducted to go deeper into the underlying causes that contribute to these relationships and inequalities, so resulting in a more thorough understanding of fan psychology.","author":"Mustafa Can Koc","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a4c7fb7a8476f2aa4ba9c318ad922da35fc24d0fc8f2d2d4151a6f2966b529c4","category":"Interdisciplinary"}