{"title":"iOS 16.4 Expands iPhone 14's Emergency SOS via Satellite to Six More Countries","link":"https://www.macrumors.com/2023/03/27/emergency-sos-via-satellite-six-more-countries/","date":1679938432000,"content":"As planned, Apple today expanded Emergency SOS via Satellite to Austria, Belgium, Italy, Luxembourg, the Netherlands, and Portugal. In a <a href=\"https://www.apple.com/it/newsroom/2023/03/emergency-sos-now-in-austria-belgium-italy-luxembourg-netherlands-portugal/\">press release</a>, Apple said the feature requires the iOS 16.4 update released today to function in these countries.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/Emergency-SOS-via-Satellite-iPhone-YT.jpg\" alt width=\"3564\" height=\"1996\" />\r<br />\nEmergency SOS via Satellite enables iPhone 14 models to connect to Globalstar satellites in countries where the feature is available, allowing users to send text messages to emergency service dispatchers when outside the range of cellular and Wi-Fi coverage. The service is free to use for two years after activating an iPhone 14, and this two-year period will begin today for users in the newly supported countries.\r<br />\n\r<br />\nWith iOS 16.4, Apple says a user dialing a local emergency number in the newly supported countries will automatically be redirected to 112, the European emergency number, in the event that the call fails due to no cellular or Wi-Fi connection.\r<br />\n\r<br />\nIn a support document, Apple warns that foliage or other obstructions can result in messages taking longer to send or failing to send, and satellite connectivity might not work in places above 62° latitude, such as northern parts of Canada and Alaska.\r<br />\n\r<br />\nEmergency SOS via Satellite first launched in November in the U.S. and Canada and requires an iPhone 14, iPhone 14 Plus, iPhone 14 Pro, or iPhone 14 Pro Max. The service expanded to France, Germany, Ireland, and the UK in December. iPhone users should read Apple's <a href=\"https://support.apple.com/en-us/HT213426\">support document</a> for important details about the service.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a>, <a href=\"https://www.macrumors.com/roundup/ipados-16/\">iPadOS 16</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/emergency-sos-via-satellite/\">Emergency SOS via Satellite</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-16.238\">iOS 16</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/27/emergency-sos-via-satellite-six-more-countries/\">iOS 16.4 Expands iPhone 14's Emergency SOS via Satellite to Six More Countries</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-16-4-expands-iphone-14s-emergency-sos-via-satellite-to-six-more-countries.2384971/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a4cbbd21467d617ad3d35c74b1ea444bcb714571b2794a2f2cdd50b0524fae43","category":"Apple"}