{"title":"A comparative study of influenza surveillance systems and administrative data in England during the 2022–2023 season","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003627","date":1726840800000,"content":"<p>by Jonathon Mellor, Rachel Christie, James Guilder, Robert S. Paton, Suzanne Elgohari, Conall Watson, Sarah R. Deeny, Thomas Ward</p>\r\n\r\nAccurate and representative surveillance is essential for understanding the impact of influenza on healthcare systems. During the 2022–2023 influenza season, the Northern Hemisphere experienced its most significant epidemic wave since the onset of the COVID-19 pandemic in 2020. Concurrently, new surveillance systems, developed in response to the pandemic, became available within health services. In this study, we analysed per capita admission rates from National Health Service hospital Trusts across four surveillance systems in England during the winter of 2022–2023. We examined differences in reporting timeliness, data completeness, and regional coverage, modelling key epidemic metrics including the maximum admission rates, cumulative seasonal admissions, and growth rates by fitting generalised additive models at national and regional levels. From modelling the admission rates per capita, we find that different surveillance systems yield varying estimates of key epidemiological metrics, both spatially and temporally. While national data from these systems generally align on the maximum admission rate and growth trends, discrepancies emerge at the subnational level, particularly in the cumulative admission rate estimates, with notable issues observed in London and the East of England. The rapid growth and decay phases of the epidemic contributed to higher uncertainty in these estimates, especially in regions with variable data quality. The study highlights that the choice of surveillance system can significantly influence the interpretation of influenza trends, especially at the subnational level, where regional disparities may mask true epidemic dynamics. Comparing multiple data sources enhances our understanding of the impact of seasonal influenza epidemics and highlights the limitations of relying on a single system.","author":"Jonathon Mellor","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a4dd45b36fe83ed62c97cdd99382d5e7f2d51884f163872d649d79b3a710d195","category":"Environment"}