{"title":"Heat stress reveals a fertility debt owing to postcopulatory sexual selection","link":"https://academic.oup.com/evlett/article/8/1/101/7078771?rss=1","date":1678924800000,"content":"<span><div>Abstract</div>Climates are changing rapidly, demanding equally rapid adaptation of natural populations. Whether sexual selection can aid such adaptation is under debate; while sexual selection should promote adaptation when individuals with high mating success are also best adapted to their local surroundings, the expression of sexually selected traits can incur costs. Here we asked what the demographic consequences of such costs may be once climates change to become harsher and the strength of natural selection increases. We first adopted a classic life history theory framework, incorporating a trade-off between reproduction and maintenance, and applied it to the male germline to generate formalized predictions for how an evolutionary history of strong postcopulatory sexual selection (sperm competition) may affect male fertility under acute adult heat stress. We then tested these predictions by assessing the thermal sensitivity of fertility (TSF) in replicated lineages of seed beetles maintained for 68 generations under three alternative mating regimes manipulating the opportunity for sexual and natural selection. In line with the theoretical predictions, we find that males evolving under strong sexual selection suffer from increased TSF. Interestingly, females from the regime under strong sexual selection, who experienced relaxed selection on their own reproductive effort, had high fertility in benign settings but suffered increased TSF, like their brothers. This implies that female fertility and TSF evolved through genetic correlation with reproductive traits sexually selected in males. Paternal but not maternal heat stress reduced offspring fertility with no evidence for adaptive transgenerational plasticity among heat-exposed offspring, indicating that the observed effects may compound over generations. Our results suggest that trade-offs between fertility and traits increasing success in postcopulatory sexual selection can be revealed in harsh environments. This can put polyandrous species under immediate risk during extreme heat waves expected under future climate change.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"a4ec6a91824b4a467909a8afaa428f9023e01fec82012e6e5c7cd28923cdaea1","category":"Environment"}