{"title":"GBF family member PfGBF3 and NAC family member PfNAC2 regulate rosmarinic acid biosynthesis under high light","link":"https://academic.oup.com/plphys/article/195/2/1728/7619323?rss=1","date":1709596800000,"content":"<span><div>Abstract</div>Rosmarinic acid (RA) is an important medicinal metabolite and a potent food antioxidant. We discovered that exposure to high light intensifies the accumulation of RA in the leaves of perilla (<span>Perilla frutescens</span> (L.) Britt). However, the molecular mechanism underlying RA synthesis in response to high light stress remains poorly understood. To address this knowledge gap, we conducted a comprehensive analysis employing transcriptomic sequencing, transcriptional activation, and genetic transformation techniques. High light treatment for 1 and 48 h resulted in the upregulation of 592 and 1,060 genes, respectively. Among these genes, three structural genes and 93 transcription factors exhibited co-expression. Notably, NAC family member <span>PfNAC2</span>, GBF family member <span>PfGBF3</span>, and cinnamate-4-hydroxylase gene <span>PfC4H</span> demonstrated significant co-expression and upregulation under high light stress. Transcriptional activation analysis revealed that PfGBF3 binds to and activates the <span>PfNAC2</span> promoter. Additionally, both PfNAC2 and PfGBF3 bind to the <span>PfC4H</span> promoter, thereby positively regulating <span>PfC4H</span> expression. Transient overexpression of <span>PfNAC2</span>, <span>PfGBF3</span>, and <span>PfC4H</span>, as well as stable transgenic expression of <span>PfNAC2</span>, led to a substantial increase in RA accumulation in perilla. Consequently, PfGBF3 acts as a photosensitive factor that positively regulates PfNAC2 and PfC4H, while PfNAC2 also regulates PfC4H to promote RA accumulation under high light stress. The elucidation of the regulatory mechanism governing RA accumulation in perilla under high light conditions provides a foundation for developing a high-yield RA system and a model to understand light-induced metabolic accumulation.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"a4f88937d74318609befd3a4f4998f5866d36f2d0596799ce1f68b0c6870bb9a","category":"Environment"}