{"title":"Double blocking of carbon metabolism causes a large increase of Calvin–Benson cycle compounds in cyanobacteria","link":"https://academic.oup.com/plphys/article/195/2/1491/7611675?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>Carbon-flow-regulator A (CfrA) adapts carbon flux to nitrogen conditions in nondiazotrophic cyanobacteria. Under nitrogen deficiency, CfrA leads to the storage of excess carbon, which cannot combine with nitrogen, mainly as glycogen. <span>cfrA</span> overexpression from the arsenite-inducible, nitrogen-independent P<span>arsB</span> promoter allows analysis of the metabolic effects of CfrA accumulation. Considering that the main consequence of <span>cfrA</span> overexpression is glycogen accumulation, we examined carbon distribution in response to <span>cfrA</span> expression in <span>Synechocystis</span> sp. PCC 6803 strains impaired in synthesizing this polymer. We carried out a comparative phenotypic analysis to evaluate <span>cfrA</span> overexpression in the wild-type strain and in a mutant of ADP-glucose pyrophosphorylase (ΔglgC), which is unable to synthesize glycogen. The accumulation of CfrA in the wild-type background caused a photosynthetic readjustment although growth was not affected. However, in a ΔglgC strain, growth decreased depending on CfrA accumulation and photosynthesis was severely affected. An elemental analysis of the H, C, and N content of cells revealed that <span>cfrA</span> expression in the wild-type caused an increase in the C/N ratio, due to decreased nitrogen assimilation. Metabolomic study indicated that these cells store sucrose and glycosylglycerol, in addition to the previously described glycogen accumulation. However, cells deficient in glycogen synthesis accumulated large amounts of Calvin–Benson cycle intermediates as <span>cfrA</span> was expressed. These cells also showed increased levels of some amino acids, mainly alanine, serine, valine, isoleucine, and leucine. The findings suggest that by controlling <span>cfrA</span> expression, in different conditions and strains, we could change the distribution of fixed carbon, with potential biotechnological benefits.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"a4f868320f4de5feca6b2472457f99b550934b6a5bd4e466fa8b5e30bad0a328","category":"Environment"}