{"title":"Matching and Rewriting Rules in Object-Oriented Databases","link":"https://www.preprints.org/manuscript/202408.0536/v1","date":1723112172000,"content":"Graph query languages such as Cypher are widely adopted to match and retrieve data in a graph representation, due to their ability of retrieving and transforming information. Despite the most natural way to match and transform information is through rewriting rules, those are scarcely or partially adopted in graph query languages. Their inability of doing so has a major impact on the subsequent way the information is structured, as it might then appear more natural to provide major constraint over the data representation so to consequently constraint the way the information should be represented. On the other hand, recent works  are starting to move towards an opposite direction, as the provision of a truly general semistructured model (GSM) allows to both represent all the available data formats (Network-Based, Relational, and Semistructured) as well as support an holistic query language expressing all major queries in such languages. In this paper, we show that the usage of GSM enables the definition of a general rewriting mechanism which can be expressed in current graph query languages only at the cost of adhering the query to the specificity of the underlying data representation. We formalise the proposed query language in terms graph rewriting mechanisms described as a set of production rules $L\\to R$ while providing restriction to the characterization of L, while extending it to support structural graph nesting operations, useful to aggregate similar information around an entry-point of interest. We discuss how GSM, by fully supporting index-based data representation, allows for a better physical model implementation leveraging the benefits of columnar database storages. Preliminary benchmarks shows the scalability of this proposed implementation in comparison with state-of-the-art implementations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a4f997eb5d5c48fb987597fbb56943107cf1ddb7a79da865eee164a46a214057","category":"Interdisciplinary"}