{"title":"UCI part of mission to evacuate 165 Afghan citizens","link":"https://www.cyclist.co.uk/news/10186/uci-afghan-refugees","date":1634034845000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>12 Oct 2021</span></div>    </div></div><p>\nThose saved include female cyclists and cycling management with 38 given refuge in Switzerland and welcomed to join UCI's training centre</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2020/03/swiss_alpes_vaudoises_003.jpg?itok=cRML2WWE\" />  </div>\n<div>\n      <p> The <a href=\"/tags/uci\" target=\"_self\">UCI</a> says it has been part of an operation to evacuate 165 people from Afghanistan including female cyclists and members of the Afghan Cycling Federation.</p>\n<p>In a press release published yesterday, the organisation revealed that it worked alongside <a href=\"/tags/israel-start-up-nation\" target=\"_self\">Israel Start-Up Nation</a> owner <a href=\"/news/7716/it-s-not-called-sportswashing-it-s-called-sport-sylvan-adams-interview\" target=\"_self\">Sylvan Adams</a>, non-profit IsraAID, the Asian Cycling Confederation, FIFA and several governments to help evacuate 125 citizens following the seizing of power by the Taliban in August.</p>\n<p>It added that a further 20 had also been able to escape as part of those efforts bringing the total to 165 saved, getting into Europe via Albania.</p>\n<p>Of those, 38 have apparently already been welcomed in Switzerland, where the UCI is based, and are being helped to settle legally. In the announcement, the UCI said it hoped the evacuees would join the UCI World Cycling Centre, which has accomodation and training faciities for cyclists from across the world.</p>\n<p>The rest of the refugees will go to Canada, France, Israel and the USA.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/1697/whats-it-like-to-ride-a-hill-climb\">What's it like to ride a hill climb?</a></div>      <div><a href=\"/in-depth/8828/best-of-the-best-cyclist-s-favourite-lightweight-bikes\">Best of the best: Cyclist’s favourite lightweight bikes</a></div>      <div><a href=\"/in-depth/7055/pain-and-glory-inside-the-catford-hill-climb-the-worlds-oldest-cycling-race\">Pain and glory: Inside the Catford Hill Climb, the world's oldest cycling race</a></div>      <div><a href=\"/buying-guides/4343/best-road-bike\">Best road bikes: the best bikes on the market from under £1,000 to over £10,000</a></div>    </div></div><p>\n<a href=\"/news/2997/who-is-new-uci-president-david-lappartient\" target=\"_blank\">David Lappartient</a>, UCI president, said, 'It is very important for the UCI to make a commitment to the members of the cycling family who are suffering due to the current situation in Afghanistan, and I am delighted that our efforts in this respect are providing opportunities for the people concerned in decent living conditions.'</p>\n<p>He also thanked the governments involved in the mission: Switzerland, France, Canada, Albania, UAE and Israel as well as Philippe Leuba from the Vaud state in Switzerland where the UCI has its headquarters and Osama Al Shafar, UCI vice-president and president of the Asian Cycling Confederation.</p>\n<p>Finally Lappartient said that the evacuation was financed by Sylvan Adams, who <a href=\"/news/7716/it-s-not-called-sportswashing-it-s-called-sport-sylvan-adams-interview\" target=\"_self\">spoke to <em>Cyclist </em>in 2020</a> about his investment in the sport. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"a5092169b61728fdfd4a0e91da691c42cd84e188eea8ddfae616d05be1e98c9c","category":"Cycling"}