{"title":"iOS 15 Spotlight Improvements: Rich Results, Web Images, Photos Search, Lock Screen Access and More","link":"https://www.macrumors.com/guide/ios-15-spotlight/","date":1628802356000,"content":"Apple in <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a> is making several improvements to Spotlight, aka the universal search feature that can be accessed on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>'s <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> with a downward swipe.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-search-feature.jpg\" />\r\n<br />\r\nSpotlight is a one-stop resource for accessing everything you might want to find on an iOS device, and in ‌iOS 15‌, it's better than ever. This guide highlights all of the new features that are coming to Spotlight with Apple's latest update.\r\n<br />\r\n\r\n<br />\r\n<h2>Rich Search Results</h2>\r\n<br />\r\nApple's <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> knowledge database has been expanded and the Spotlight feature now supports rich search results, so you can get more information than before directly from the Spotlight interface.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-rich-results-actors.jpg\" />\r\n<br />\r\nIf you search for a movie or a TV show, for example, and then tap on the result, you'll see information like how you can watch the show, the actors, trailers, seasons, links to the TV app, Messages discussions you've had about the content, ‌Siri‌ suggested search results, and more.\r\n<br />\r\n\r\n<br />\r\nWith <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a>, a search such as this brings up a much more limited range of information, typically limited to a web search.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-rich-results-contacts-siri.jpg\" />\r\n<br />\r\nRich search results work for all kinds of search topics, including contacts, actors, musicians, movies, and TV shows. With contacts, it will bring up a full contact card with Message interactions, shared links, Wallet transactions, <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> location, photos from apps, and emails in addition to the standard contact info, making the Spotlight search much more informative.\r\n<br />\r\n\r\n<br />\r\n<h2>Web Images Search</h2>\r\n<br />\r\nSpotlight can be used to search for images on the web. So, for example, if you type \"cat images\" into the Spotlight search interface, Spotlight will now provide a selection of the most popular web images.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-images-search.jpg\" />\r\n<br />\r\nTapping into an image will show you additional images related to the image you tapped, and you can continue tapping through images to find just what you're looking for.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-images-search-2.jpg\" />\r\n<br />\r\nThe web images search feature can be used to find pictures of people, animals, plants, landmarks, monuments, and more. It doesn't work for every search, but for most topics, just adding an \"images\" to the search is a quick way to bring up image web results.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-images-search-type.jpg\" />\r\n<br />\r\n<h2>Photos Search</h2>\r\n<br />\r\nIn addition to searching the web for images, Spotlight can also now look for specific pictures in your own photo library. When you search for \"cat photos\" or \"dog photos,\" for example, Spotlight surfaces the photos that are stored on your device in the \"<a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> From Apps\" section.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-photos-search.jpg\" />\r\n<br />\r\nIf you tap into a search, you can see additional search results, and there's also an option to open up the ‌Photos‌ app to see all the photos that are relevant to the search.\r\n<br />\r\n\r\n<br />\r\nYou can search through your Photo Library in Spotlight by location, people, scenes, and specific objects that are in the photos like a pet or a plant.\r\n<br />\r\n\r\n<br />\r\n‌Photos‌ that were shared with you through the Messages app can be found in Spotlight by using a contact name in the search.\r\n<br />\r\n\r\n<br />\r\n<h2>Lock Screen Spotlight Search</h2>\r\n<br />\r\nIf you swipe downward on the Lock Screen of the ‌iPhone‌, you can get to the Spotlight search interface without having to unlock the ‌iPhone‌.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-spotlight-lock-screen-search.jpg\" />\r\n<br />\r\nA Spotlight search conducted while the ‌iPhone‌ is locked does not bring up personal information like your own photos, text messages, and contacts, focusing instead on general content from the web, ‌Siri‌ Knowledge, News, Stocks, dictionary, and more.\r\n<br />\r\n\r\n<br />\r\nAll personalized results only come up when the ‌iPhone‌ is unlocked, so if someone gets ahold of your ‌iPhone‌, they can use it for search purposes but will not be able to see your info.\r\n<br />\r\n\r\n<br />\r\n<h2>App Searches</h2>\r\n<br />\r\n<a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> searches have been improved in ‌iOS 15‌, and if you search for an app that you want to use, you can now install it right from Spotlight without leaving the Spotlight search interface.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/ios-15-install-apps-from-spotlight.jpg\" />\r\n<br />\r\n<h2>Maps Spotlight Search Improvements</h2>\r\n<br />\r\nIf you search for a business that supports Apple's App Clips feature, you can see action buttons on the Maps result in Spotlight. You can do things like access menus or tickets, see reservations, make an appointment, order takeout or delivery, see waitlist and showtime information, get parking details, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/app-clip-maps-spotlight-button-ios-15.jpg\" />\r\n<br />\r\n<h2>Spotlight Search Warnings</h2>\r\n<br />\r\nAs part of a suite of <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">Child Safety features</a>, Apple is expanding guidance for ‌Siri‌ and Spotlight that will offer resources to help children stay safe online and get help with unsafe situations.\r\n<br />\r\n\r\n<br />\r\nIf a user searches for topics related to Child Sexual Abuse Material, for example, Apple will offer interventions that will explain to users that interest in this topic is harmful and problematic, offering resources on ways to get help.\r\n<br />\r\n\r\n<br />\r\n<h2>Guide Feedback</h2>\r\n<br />\r\nHave questions about the new Spotlight features in ‌iOS 15‌, know of a feature we left out, or want to offer feedback on this guide? <a href=\"mailto:guides@macrumors.com\">Send us an email here</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-15-spotlight/\">iOS 15 Spotlight Improvements: Rich Results, Web Images, Photos Search, Lock Screen Access and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-15-spotlight-improvements-rich-results-web-images-photos-search-lock-screen-access-and-more.2307391/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZwdzmEpFC2g:lz33-1hNhqk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZwdzmEpFC2g:lz33-1hNhqk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ZwdzmEpFC2g\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a50ae9ff85b00dadd9d65816d5c0ba6f64d171fae8027b69186df1e83f9969f8","category":"Apple"}