{"title":"Hands-On With Google's Pixel Fold Smartphone","link":"https://www.macrumors.com/2023/07/21/hands-on-with-googles-pixel-fold-smartphone/","date":1689953789000,"content":"Google in May unveiled its first foldable smartphone, the Pixel Fold. We picked up a Pixel Fold and thought we'd check it out to see how it compares to Apple's latest iPhones.\r<br />\n\r<br />\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe Pixel Fold has a display size of 7.6 inches when it is unfolded, but when collapsed, the cover display measures in at 5.8 inches. Both displays feature a refresh rate up to 120Hz, like the latest Pro iPhones. It has a strong hinge that works at any angle, and when closed, there's no gap in the hinge. \r<br />\n\r<br />\nSize wise, the Pixel Fold is the perfect size for day to day use when folded thanks to the cover screen, and it's sized like the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> X for reference. At 7.6 inches unfolded, it's bigger than any smartphone but smaller than an <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>, so it is a nice in-between size that's neither too small nor too big. \r<br />\n\r<br />\nThere's a Google Tensor G2 processor inside, Google's analogue to the A-series chips that Apple designs. It features 12GB RAM and starts with 256GB of storage and a 4821mAh battery, so the hardware is not too far off of what Apple's offering. As for software, Google has been working on Android for foldable smartphones, but developers have not all adapted their Android apps for the form factor and it's noticeable. \r<br />\n\r<br />\nGoogle included a 48-megapixel rear camera, the same as Apple's 14 Pro and Pro Max, which is okay, but nothing spectacular. It also has 10.8-megapixel telephoto and ultrawide cameras, along with a 9.5-megapixel front-facing camera and an 8-megapixel inner camera.\r<br />\n\r<br />\nRumors have suggested that Apple is experimenting with foldable smartphone technology, but so far work on such a device has not moved out of the early prototyping stage. There is no word on when Apple might come out with a folding ‌iPhone‌, but with the launch of the Pixel Fold, the major Android manufacturers all offer foldable smartphones.\r<br />\n\r<br />\nThe Pixel Fold is priced at $1,800, which is much higher priced than anything Apple offers. The steep price point for foldables may be one reason why Apple has yet to enter the market. <div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/google-pixel/\">Google Pixel</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/21/hands-on-with-googles-pixel-fold-smartphone/\">Hands-On With Google's Pixel Fold Smartphone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-googles-pixel-fold-smartphone.2396519/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a50b83b1f3b89bc8d6e2849440baf1b7fddd1f2ea48b3af643abe7fc5ad4d185","category":"Apple"}