{"title":"Maize requires arogenate dehydratase 2 for resistance to Ustilago maydis and plant development","link":"https://academic.oup.com/plphys/article/195/2/1642/7618151?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Maize (<span>Zea mays</span>) smut is a common biotrophic fungal disease caused by <span>Ustilago maydis</span> and leads to low maize yield. Maize resistance to <span>U. maydis</span> is a quantitative trait. However, the molecular mechanism underlying the resistance of maize to <span>U. maydis</span> is poorly understood. Here, we reported that a maize mutant caused by a single gene mutation exhibited defects in both fungal resistance and plant development. <span>maize mutant highly susceptible to U. maydis</span> (<span>mmsu</span>) with a dwarf phenotype forms tumors in the ear. A map-based cloning and allelism test demonstrated that 1 gene encoding a putative arogenate dehydratase/prephenate dehydratase (ADT/PDT) is responsible for the phenotypes of the <span>mmsu</span> and was designated as <span>ZmADT2</span>. Combined transcriptomic and metabolomic analyses revealed that <span>mmsu</span> had substantial differences in multiple metabolic pathways in response to <span>U. maydis</span> infection compared with the wild type. Disruption of <span>ZmADT2</span> caused damage to the chloroplast ultrastructure and function, metabolic flux redirection, and reduced the amounts of salicylic acid (SA) and lignin, leading to susceptibility to <span>U. maydis</span> and dwarf phenotype. These results suggested that <span>ZmADT2</span> is required for maintaining metabolic flux, as well as resistance to <span>U. maydis</span> and plant development in maize. Meanwhile, our findings provided insights into the maize response mechanism to <span>U. maydis</span> infection.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"a512bf293422e998870f268e1a13e205a1adc3c203d9eb7a006ea0729451c700","category":"Environment"}