{"title":"Can recent evolutionary history promote resilience to environmental change?","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae074/7774884?rss=1","date":1727222400000,"content":"<span><div>Abstract</div>Principles of social evolution have long been used retrospectively to interpret social interactions, but have less commonly been applied predictively to inform conservation and animal husbandry strategies. We investigate whether differences in developmental environment, facilitated by divergent social conditions, can predict resilience to environmental change. Upon exposure to harsh novel environments, populations that previously experienced more benign social environments are predicted either to suffer fitness losses (the “mutation load hypothesis” and “selection filter hypothesis”) or maintain fitness (the “beneficial mutation hypothesis”). We tested these contrasting predictions using populations of burying beetles <span>Nicrophorus vespilloides</span> we had evolved experimentally for 45 generations under contrasting social environments by manipulating the supply of post-hatching parental care. We exposed sexually immature adults from each population to varying heat stress and measured the effect on survival and reproduction. The greater the level of parental care previously experienced by a population, the better its survival under heat stress during sexual maturation. Although this is consistent with the “beneficial mutation hypothesis,” it is also possible that populations that had evolved without post-hatching care were simply more prone to dying during maturation, regardless of their thermal environment. Overall, we suggest that stochastic genetic variation, probably due to founder effects, had a stronger influence on resilience. We discuss the implications for translocation and captive breeding programs.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"a51d309e0e1c6602afce76ffa46bc99750065aae0426b6ff91bc218d5e516589","category":"Environment"}