{"title":"Antagonism and Synergism Characterize the Interactions Between Four North American Potato Virus Y Strains","link":"https://www.preprints.org/manuscript/202405.0129/v1","date":1714637713000,"content":"Potato virus Y (PVY) is one of the most important constraints to potato production worldwide. There is an increasing occurrence of recombinant PVY strains PVYNTN and PVYN-Wi and a decline in the incidence of the nonrecombinant PVYO. We hypothesized that this may be due to the ability of these recombinant strains to antagonize and/or outcompete PVYO in mixed infections. To deter-mine this, we investigated interactions between PVYO and three recombinant PVY strains com-mon in North America: PVYNTN, PVYN-Wi, and PVYN:O. Overall, our study showed that these inter-actions are tissue dependent. Specifically, PVYNTN, the main causal agent of potato tuber necrotic ringspot disease (PTNRD), was found to be more adaptable than PVYO, especially in potato leaves due, at least in part, to the Ny gene that confers hypersensitive resistance (HR) to PVYO. Further-more, PVYN-Wi was found to repress PVYO in potato tubers but act synergistically in potato leaves. The PVYO-induced foliage necrosis in cultivar ‘Ranger Russet’ was observed to be more severe in plants co-infected by PVYN-Wi and PVYN:O, respectively, resulting in plant death. Strikingly, this PVYO -induced necrosis was suppressed by PVYNTN in doubly infected plants. These interactions may, at least partially, explain the decreasing incidence of PVYO in United States potato produc-tion regions, especially given that many cultivars contain the Ny gene, which likely limits PVYO enabling PVYNTN and PVYN-Wi to outcompete. We also found that replication and cell-to-cell movement of these PVY strains in tubers at 4C was similar to levels at ambient temperature.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a539b3e3270ea0c3da09f3b8d519e2979ac23fa85839bca596871b17dddf8be8","category":"Interdisciplinary"}