{"title":"สแกมเมอร์ขอเครื่องหมายยืนยันตัวตนกับ Gmail สำเร็จ เริ่มหลอกลวงผู้อื่นแล้ว","link":"https://www.blognone.com/node/134137","date":1685699506000,"content":"<div><div><div><p>ก่อนหน้านี้ <a href=\"https://www.blognone.com/node/133691\">Gmail ได้ออกเครื่องหมายถูกสีฟ้าหลังชื่อผู้ส่งอีเมล เพื่อใช้ในการยืนยันองค์กร</a> ซึ่งเครื่องหมายถูกเป็นสิ่งที่ทำเพื่อใช้ในการตรวจสอบตัวตนออนไลน์เบื้องต้นได้ทันทีที่เห็น ล่าสุด Chris Plummer วิศวกรด้านความมั่นคงทางไซเบอร์สังเกตว่า มิจฉาชีพเจอวิธีใช้ประโยชน์จากเครื่องหมายของถูก Google เพื่อหลอกลวงผู้อื่นให้เชื่อว่าเป็นข้อความมาจากบริษัทที่น่าเชื่อถือ</p>\n<p>Plummer แสดงหน้าจอที่คนร้ายปลอมตัวเป็นบริษัท UPS โดยอาศัยการยืนยันตัวตนจาก sub-domain ของ UPS ที่ชื่อว่า kelerymjrlnra.ups.com อีกทีหนึ่ง ไม่แน่ชัดว่าคนร้ายสามารถยึดโดเมนนี้อย่างไร แต่ผลสุดท้ายคือคนร้ายสามารถส่งอีเมลโดยได้รับเครื่องหมายสีน้ำเงินจากกูเกิลได้</p>\n<p>ต่อมา Plummer ทวีตเล่าถึงความไม่พอใจจากการที่ติดต่อกับทาง Google เพื่อแจ้งให้ทราบถึงข้อผิดพลาด แต่ถูกปฏิเสธและตอบกลับว่าเป็น “พฤติกรรมโดยเจตนา” แต่เกิดเป็นกระแสวิจารณ์ใน Twitter จำนวนมากทำให้ Google เริ่มกลับมาพิจารณาปัญหาดังกล่าวอีกครั้ง</p>\n<p>Gmail มีการให้บริษัทและองค์กรต่างๆ สามารถยืนยันตัวตนได้ด้วยระบบต่างๆ เช่น BIMI (ตัวบ่งชี้แบรนด์สำหรับการระบุข้อความ), VMC (เครื่องหมายรับรองที่ได้รับการยืนยัน) และ DMARC (การตรวจสอบข้อความตามโดเมน, การรายงาน และการยอมรับ) เมื่อบริษัทผ่านกระบวนการตรวจสอบแล้ว Gmail จะเริ่มแสดง Logo ของบริษัท รวมถึงเครื่องหมายสีน้ำเงินข้างๆ ชื่อของบริษัท</p>\n<blockquote><p>There is most certainly a bug in Gmail being exploited by scammers to pull this off, so I submitted a bug which <a href=\"https://twitter.com/Google?ref_src=twsrc%5Etfw\">@google</a> lazily closed as “won’t fix - intended behavior”. How is a scammer impersonating <a href=\"https://twitter.com/UPS?ref_src=twsrc%5Etfw\">@UPS</a> in such a convincing way “intended”. <a href=\"https://t.co/soMq7KraHm\">pic.twitter.com/soMq7KraHm</a></p>\n<p>— plum (@chrisplummer) <a href=\"https://twitter.com/chrisplummer/status/1664075886545575941?ref_src=twsrc%5Etfw\">June 1, 2023</a></p></blockquote>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c9bc3f3c939109144417fd0581519737.png\" alt /></p>\n<p>ที่มา: <a href=\"https://www.androidpolice.com/gmail-blue-verified-checkmark-fake-scammers/\">androidpolice</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gmail\">Gmail</a></div><div><a href=\"/topics/scam\">Scam</a></div><div><a href=\"/topics/e-mail\">E-mail</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a54e77893e6ddea0c6542e54db71c4d9dbf9813cf691013495e9aa58bd96543e","category":"Thai"}