{"title":"Ride Concepts Partners with TAMBA to Raise Funds for the [Re]Build the Future December Donor Drive","link":"https://theradavist.com/2021/12/ride-concepts-partners-with-tamba-to-raise-funds-for-the-rebuild-the-future-december-donor-drive/","date":1639493385000,"content":"<p><img src=\"https://media.theradavist.com/uploads/2021/12/RC_FeelGoodGiveBack_1080x1080_2x-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The rider-owned and operated mountain bike footwear company pledges a donation to rebuild and restore Lake Tahoe wildfire-impacted trails and calls on the mtb community to join them. Read on below for how you can help out and win a $300 gift card to <a href=\"http://www.rideconcepts.com/\" target=\"_blank\">Rideconcepts.com</a>.</p>\n<p><span></span></p>\n<p>Each December, Ride Concepts puts its best foot forward to support an initiative that is important to the mountain bike community. After a record-breaking wildfire season and the devastation caused by the Caldor Fire in Ride Concept’s backyard of South Lake Tahoe, giving back is more important than ever. This is why Ride Concepts has teamed up with the Tahoe Area Mountain Biking Association (TAMBA) to support the [Re]Build the Future: December Donor Drive. Ride Concepts has made a healthy donation to the drive and hopes the mountain bike community will do so as well. Every donation made to TAMBA in the month of December will be entered to win a $300 gift card to <a href=\"http://www.rideconcepts.com/\" target=\"_blank\">RideConcepts.com</a>. The winner will be selected in January. <a href=\"https://tamba.org/rebuild-donor-drive/\" target=\"_blank\">Donate Now</a> for a chance to win.</p>\n<p><em>The Caldor Fire burned in Northern California in late August, where it spread into the Lake Tahoe basin and threatened the mountain community of South Lake Tahoe. The wildfire burned for 69 days, scorched 221,835 acres, destroyed 1,003 structures and caused the evacuation of more than 50,000 residents. The devastating blaze and subsequent heavy fire fighting equipment caused damage to an estimated 20 miles of the most popular mountain bike trails in the South Lake Tahoe area. </em></p>\n<p>The post <a href=\"https://theradavist.com/2021/12/ride-concepts-partners-with-tamba-to-raise-funds-for-the-rebuild-the-future-december-donor-drive/\">Ride Concepts Partners with TAMBA to Raise Funds for the [Re]Build the Future December Donor Drive</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"a550642afcfc381295799260ceb0157dbda1d67ca7f5b5917546a5f12c6ff931","category":"Cycling"}