{"title":"Molecular phylogenetics of the trochid subfamily Umboniinae (Gastropoda: Trochoidea): working towards a new systematic framework","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae008/7668003?rss=1","date":1715299200000,"content":"<span><div>ABSTRACT</div>We present here the most taxon-rich phylogeny for the trochid subfamily Umboniinae published to date, with representatives from 14 of the 19 known genera, and as a result show that Umboniinae needs comprehensive taxonomic and systematic revision. We identified one clade corresponding to a new genus with four species collected from deeper water than is typical of most umboniine taxa and one new species likely belonging to a second, undescribed genus (all to be described elsewhere). Only four genera, as currently interpreted were recovered, as monophyletic: <span>Umbonium, Lirularia, Monilea</span> and <span>Rossiteria. Zethalia</span> (monotypic for extant taxa), <span>Pseudominolia, Isanda</span> and <span>Parminolia</span> were all represented by a single species (the latter by <span>Gibbula vanwalleghemi</span>; Poppe, Tagaro &amp; Dekker, 2006). <span>Conotalopia, Ethalia, Ethaliella, Ethminolia, Sericominolia</span> and <span>Vanitrochus</span> were all polyphyletic. We formally recognize the following new combinations: <span>Sericominolia glaphyrella</span> (Melvill &amp; Standen, 1895), <span>Sericominolia vitiliginea</span> (Menke, 1843), <span>Vanitrochus ornatus</span> (Sowerby III, 1903) and <span>Parminolia vanwalleghemi</span> (Poppe, Tagaro &amp; Dekker, 2006), although further molecular studies are desirable to confirm these decisions. The first three generic reassignments make <span>Sericominolia</span> and <span>Vanitrochus</span> monophyletic in our tree. We also suggest that <span>Ethaliella</span> cf. <span>rhodomphala</span> (Souverbie, 1875) should be transferred to one of several clades with species previously assigned to <span>Ethminolia</span>, for which an appropriate genus name has not yet been resolved. This decision makes <span>Ethaliella</span> monophyletic. We also identified several cryptic species complexes, including <span>Rossiteria nucleus</span> (Philippi, 1850), the type species of <span>Rossiteria</span>. The phylogeny presented is a first step towards a more resolved systematic framework for Umboniinae and will allow future studies of key morphological innovations.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"a567b527b73e7c726ae3fe8f29a6a6e38e0ffaa5e1a6eb1c7f281223d0534ac3","category":"Environment"}