{"title":"Environmental enrichment reduces restricted repetitive behavior by altering gray matter microstructure","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307290","date":1722434400000,"content":"<p>by Anna L. Farmer, Marcelo Febo, Bradley J. Wilkes, Mark H. Lewis</p>\r\n\r\nRestricted, repetitive behaviors are common symptoms in neurodevelopmental disorders including autism spectrum disorder. Despite being associated with poor developmental outcomes, repetitive behaviors remain poorly understood and have limited treatment options. Environmental enrichment attenuates the development of repetitive behaviors, but the exact mechanisms remain obscure. Using the C58 mouse model of repetitive behavior, we performed diffusion tensor imaging to examine microstructural alterations associated with the development of repetitive behavior and its attenuation by environmental enrichment. The C57BL/6 mouse strain, which displays little or no repetitive behavior, was used as a control group. We observed widespread differences in diffusion metrics between C58 mice and C57BL/6 mice. In juvenile C58 mice, repetitive motor behavior displayed strong negative correlations with fractional anisotropy in multiple gray matter regions, whereas in young adult C58 mice, high repetitive motor behavior was most strongly associated with lower fractional anisotropy and higher radial diffusivity in the striatum. Environmental enrichment increased fractional anisotropy and axial diffusivity throughout gray matter regions in the brains of juvenile C58 mice and overlapped predominantly with cerebellar and sensory regions associated with repetitive behavior. Our results suggest environmental enrichment reduces repetitive behavior development by altering gray matter microstructure in the cerebellum, medial entorhinal cortex, and sensory processing regions in juvenile C58 mice. Under standard laboratory conditions, early pathology in these regions appears to contribute to later striatal and white matter dysfunction in adult C58 mice. Future studies should examine the role these regions play in the development of repetitive behavior and the relationship between sensory processing and cerebellar deficits and repetitive behavior.","author":"Anna L. Farmer","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a568717dc729461257205b8e4555f8da147475a5e13a867484bc1708a4072183","category":"Interdisciplinary"}