{"title":"MyWhoosh Selected for UCI Cycling Esports World Championship for 2024-2026: A Few Thoughts","link":"https://www.dcrainmaker.com/2023/08/mywhoosh-selected-for-uci-cycling-esports-world-championship-for-2024-2026-a-few-thoughts.html","date":1692358730000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/08/MyWhooshUCI.png\"><img title=\"MyWhooshUCI\" src=\"https://media.dcrainmaker.com/images/2023/08/MyWhooshUCI_thumb.png\" alt=\"MyWhooshUCI\" width=\"720\" height=\"405\" /></a></p>\n<p>The <a href=\"https://www.uci.org/pressrelease/uci-and-mywhoosh-sign-three-year-partnership-for-organisation-of-uci-cycling/7wbX3Jf24UMzVufmMCgpxx\">UCI &amp; MyWhoosh announced yesterday</a> that the <a href=\"https://www.dcrainmaker.com/2022/07/a-look-at-mywhoosh-indoor-cycling-app-a-first-ride-explainer.html\">MyWhoosh virtual cycling platform</a> has been selected for the UCI Cycling Esports World Championships in 2024/2025/2026. Up till now Zwift has been the platform utilized for the online cycling World Championship event, which has typically been held in the winter months (usually between December and February, this past year for 2023 it was held in February). Note that this Esports event is very different than the <a href=\"https://en.wikipedia.org/wiki/UCI_Indoor_Cycling_World_Championships\">‘Indoor Cycling’ event</a>, as that event involves ‘artistic cycling’ – and has been held since 1956. In case you’ve never seen that, you need to stop what you’re <a href=\"https://www.youtube.com/watch?v=wSdKBK0gfr4\">doing and watch this immediately</a>. Likewise, this is all different than the <a href=\"https://www.youtube.com/watch?v=vumSmqpr3XA\">UCI Cycle-Ball World Championships</a>, equally amazing.</p>\n<p>The <a href=\"https://en.wikipedia.org/wiki/UCI_Cycling_Esports_World_Championships\">Esports variant has been held since 2020</a> (albeit skipping 2021) on Zwift, born mostly out of a blend of pandemic-era tailwinds, and Zwift’s <a href=\"https://www.cyclingweekly.com/news/racing/olympics/zwift-racing-one-step-closer-to-becoming-olympic-sport-with-new-olympic-virtual-series-497074\">desire at the time to try and get cycling Esports into the 2024 Olympics</a>.</p>\n<p>Now, many over the last 24 hours have said this seems like a ‘loss’ for Zwift, and in some ways that is probably true. But one has to remember, this is simply a paid bidding for this event. In the past, other platforms have evaluated it as well – and we’ve seen sponsorships there too. For example, both Garmin/Tacx and Wahoo have sponsored the event as well, on the hardware front (trainers). On the platform side, other platforms have looked at it as well, but my discussions over the years with them have all roughly mirrored the same commentary of it being somewhat pointless back then to put in a bid against Zwift’s heavily-backed investment money, and connections at the UCI level.</p>\n<p>But MyWhoosh doesn’t have those sorts of financial constraints. Based in the UAE, MyWhoosh is paired with the country’s heavy investment in cycling events over the next 6 years. In fact, their press release highlights many of those, providing a quote from UCI President David Lappartient saying:</p>\n<blockquote><p>“We are delighted to welcome MyWhoosh as the new platform and organiser of the UCI Cycling Esports World Championships for the next three years, and we are convinced that they will continue to develop this exciting and popular event. Today’s announcement further confirms Abu Dhabi’s commitment to our sport after it hosted a magnificent edition of the UCI Urban Cycling World Championships in 2022. The city will again welcome this event in 2024, as well as the UCI Road World Championships and the UCI Gran Fondo World Championships in 2028 and the UCI Track World Championships in 2029.  The next three editions of the UCI Cycling Esports World Championships add to Abu Dhabi’s reputation as host of top-class cycling events.”</p></blockquote>\n<p>The point here being, everything about these selections are driven by money (and connections), not functionality or user bases. In checking with Zwift, they confirmed that they did put in a bid for the 2024-2026 Esports World Championships. It’s not clear if any additional platforms also put in bids.</p>\n<p>Certainly, one can have a technical debate on which platform is preferred, or even a debate on which platform is most engaging for cyclists. But aside from meeting some minimum paper theory UCI criteria on what said Esports platform must have (which historically was basically written with Zwift in mind), this is really all about money changing hands. Like most online cycling platforms (save TrainerRoad), there are external investors. In Zwift’s case, that’s a <a href=\"https://www.crunchbase.com/organization/zwift\">slate of investors</a>. And in MyWhoosh’s case, it’s a <a href=\"https://www.crunchbase.com/organization/mywhoosh\">bit more fuzzy</a>, but not hard to follow the trail.</p>\n<p>To begin, the platform has a partnership with Team UAE Emirates (the pro cycling team). While MyWhoosh gets skittish around discussing their investors, the simplified version is the lead/primary investor is the government of the UAE (United Arab Emirates), just like it is for Team UAE Emirates and countless other sport/tourism efforts. Their “CEO and Managing Director” (official listed title on the press release) is Akhtar Saeed Hashmi, also the CEO of numerous UAE entities <a href=\"http://rts.ae/about.php\">including Royal Technology Services (RTS) and Mauqah Technology</a>. RTS is a subsidiary of The Royal Group, that is ultimately headed by Sheikh Tahnoon bin Zayed Al Nahyan, the son of the founder of the UAE. This holdings group is responsible for some <a href=\"https://ihcuae.com/investor-relations/pdf/Annual-report-2020-web-version.pdf\">$26 billion worth of assets</a>, as part of the UAE’s <a href=\"https://ihcuae.com/about/index.html#Message\">International Holdings Group (IHC)</a>.</p>\n<p>These lines are key to understanding goals that MyWhoosh has, one of which is their <a href=\"https://mid-east.info/gov-games-organizing-committee-announces-my-whoosh-as-official-sponsor-of-2021-edition/\">stated goal to increase physical fitness and sports activity within the UAE</a>.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2022/07/IMG_1014_thumb.jpg\" /></p>\n<p>As for what’s in store for the event itself (presumably to be held next February)? Well, that’s still a bit unclear – but frankly that was the case each year with Zwift too, with details only released closer to the event. That said, MyWhoosh noted in their press release:</p>\n<blockquote><p>“We are committed to transforming Abu Dhabi into a truly world-class cycling hub, and look forward to providing athletes, fans, and enthusiasts with an immersive experience that combines the excitement of esports with the spirit of cycling. This collaboration signifies a transformative era for MyWhoosh and the realm of cycling esports, bringing all the benefits and excitement of competitive cycling into home across the world. We are also excited to welcome the cycling community to Abu Dhabi for the UCI Road World Championships in 2028 and UCI Track World Championships in 2029”.</p></blockquote>\n<p>It went on to say:</p>\n<blockquote><p>“With hosting rights secured, MyWhoosh will now finalize details for the three-year collaboration, aiming to transform the event into an immersive, engaging global event.”</p></blockquote>\n<p>Given that MyWhoosh as a platform has continued to grow over the last couple years, including adding new routes, as well as holding large-prize purse events, it wouldn’t surprise me to see more worlds focused on these specific World Championship events. After all, just a day prior on Wednesday they announced a new <a href=\"https://endurance.biz/2023/industry-news/belgium-is-first-european-virtual-cycling-world-from-mywhoosh/\">Belgium-flavored virtual world</a>. It’ll also be interesting to see if they end up with some form of in-person event for the World Championships, as has been trialed on a few different indoor cycling championships over the years, and I feel generally adds a bit more to the event, rather than just people <a href=\"https://www.youtube.com/watch?v=TVEGj6M_6Qg\">doing it from their living rooms</a>.</p>\n<p>But those are all details to be sorted out over the coming months.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"a56b219ee59d0d29d12167862e3477dd50e07620bf9a6fd9e0eac30ca31e7c65","category":"Cycling"}