{"title":"Elon Musk Is Watching His Back; His Security Guards Are Watching Him Poop","link":"https://www.bbc.com/news/technology-64804007","date":1678235920000,"content":"\n<p>Re: <a href=\"https://daringfireball.net/2023/03/thorleifsson_musk_twitter\">Halli Thorleifsson’s quip</a> about Elon Musk not going to the restroom by himself, the context is this report from Marianna Spring at BBC News, primarily about harassment and CSAM content moderation falling apart:</p>\n\n<blockquote>\n  <p>In San Francisco, the home of Twitter’s headquarters, I set out to\nlook for answers. What better place to get them than from an\nengineer — responsible for the computer code that makes Twitter\nwork. Because he’s still working there, he’s asked us to conceal\nhis identity, so we’re calling him Sam.</p>\n\n<p>“For someone on the inside, it’s like a building where all the\npieces are on fire,” he revealed. “When you look at it from the\noutside the façade looks fine, but I can see that nothing is\nworking. All the plumbing is broken, all the faucets,\neverything.” [...]</p>\n\n<p>The level of disarray, in his view, is because Mr Musk doesn’t\ntrust Twitter employees. He describes him bringing in engineers\nfrom his other company — electric car manufacturer Tesla — and\nasking them to evaluate engineers’ code over just a few days\nbefore deciding who to sack. Code like that would take “months” to\nunderstand, he tells me.</p>\n\n<p>He believes this lack of trust is betrayed by the level of\nsecurity Mr Musk surrounds himself with.</p>\n\n<p>“Wherever he goes in the office, there are at least two bodyguards — very bulky, tall, Hollywood movie-[style] bodyguards. Even when\n[he goes] to the restroom,” he tells me.</p>\n</blockquote>\n\n<p>Sounds like a fun job.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/07/musk-pooping\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a56b43a717fdfcb970a0d09b2be47efba713293830259a5c20799afceedb7964","category":"Tech"}