{"title":"Life Cycle Assessment and Prediction of Plug-in Hybrid Electric Vehicles Considering Different Vehicle Working Conditions and Battery Degradation Scenarios","link":"https://www.preprints.org/manuscript/202407.1054/v1","date":1720821942000,"content":"This study establishes life cycle assessment model to quantitively evaluate and predict material resource consumption, fossil energy consumption and environmental emissions of plug-in hybrid electric vehicles (PHEVs) by employing the GaBi software. the envi-ronmental impact of different vehicle working conditions, power battery degradation scenarios and mileage scenarios on the operation and use stage of PHEV, BEV and HEV is distinguished. The findings indicate that under urban, highway, and aggressive driving conditions, PHEVs' life cycle material resource and fossil fuel consumption exceed that of BEVs but are less than HEVs. Battery degradation leads to increased material resource consumption, energy use, and environmental emissions for both PHEVs and BEVs, en-vironmental emission of BEVs are more sensitive than those of PHEVs to the impact of power battery degradation. Among different-mileage scenarios, PHEVs demonstrate the least sensitivity to increased mileage regarding life cycle material resource consumption, with the smallest increase. Future projections for 2025 and 2035 suggest life cycle GWP of HEV, PHEV and BEV in 2035 is 1.21×104, 1.12×104 and 1.01×104 kg CO2-eq respectively, which is decreased by 48.7%, 30.9% and 36.1% compared with those in 2025. The out-comes of this study are intended to bolster data support for the manufacturing and de-velopment of PHEV, BEV and HEV under different scenarios and offer insights into the growth and technological progression of the automotive sector.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a56d5776b100561bb11fe10be40afb3bb23f640fb2c47507c2915505ed9b131a","category":"Interdisciplinary"}