{"title":"Trinity Test is front and center in trailer for Christopher Nolan’s Oppenheimer","link":"https://arstechnica.com/?p=1937376","date":1683561735000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Cillian Murphy plays the \"father of the atomic bomb\" in Christopher Nolan's new film <em>Oppenheimer</em>. </p></div>\n<p>Universal Studios has released another trailer for <a href=\"https://en.wikipedia.org/wiki/Christopher_Nolan\">Christopher Nolan</a>'s forthcoming film <a href=\"https://en.wikipedia.org/wiki/Oppenheimer_(film)\"><em>Oppenheimer</em></a>, which is based on the Pulitzer Prize-winning 2005 biography <a href=\"https://www.amazon.com/dp/0375726268/?tag=arstech20-20\"><em>American Prometheus</em></a> by Kai Bird and Martin J. Sherwin. Cillian Murphy stars as physicist J. Robert Oppenheimer, marking the sixth time Murphy has worked with Nolan. Universal Pictures describes the film as \"an epic thriller that thrusts audiences into the pulse-pounding paradox of the enigmatic man who must risk destroying the world in order to save it.\"</p>\n<p>Industry watchers will note that this is the first film Nolan has made without partnering with Warner Bros. since 2002's <a href=\"https://en.wikipedia.org/wiki/Insomnia_(2002_film)\"><em>Insomnia</em></a>. Chalk the falling out to the impact of the COViD-19 pandemic on Hollywood, notably Warner Bros.'s controversial decision to release all its 2021 films simultaneously in theaters and on HBO Max. The studio followed this strategy for Nolan's 2020 sci-fi thriller <a href=\"https://arstechnica.com/gaming/2020/09/dont-risk-your-health-to-see-tenet-which-is-uber-fun-but-still-just-a-movie/\"><em>Tenet</em></a>, which grossed just $365 million worldwide against its $200 million budget. While this technically made <em>Tenet</em> the fifth biggest film of 2020, by industry standards, it was a box office failure.</p>\n<p>Nolan was deeply unhappy with this arrangement, particularly since the studio hadn't conferred with him prior to making the decision about <em>Tenet</em>. So when he decided to write and direct <em>Oppenheimer</em>, the director approached several other studios about partnering with him on the project, eventually signing on with Universal.</p></div><p><a href=\"https://arstechnica.com/?p=1937376#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937376&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a57d86a311902f7bc837b71474e890aee9fe186832002eb22af8c13e8faa4feb","category":"Tech"}