{"title":"Apple เปิดตัว Final Cut Pro และ Logic Pro สำหรับ iPad","link":"https://www.blognone.com/node/133754","date":1683641568000,"content":"<div><div><div><p>วันนี้ทาง Apple ได้ประกาศนำ <strong>Final Cut Pro</strong> และ <strong>Logic Pro</strong> มาลงให้กับ iPad แล้ว ซึ่งทั้ง 2 แอปเป็นแอปฯ สำหรับตัดต่อวิดีโอ และการทำเพลงแบบมืออาชีพที่พัฒนาโดย Apple เอง โดยจะเปิดให้ดาวน์โหลดผ่าน App Store ในวันที่ 23 พฤษภาคมนี้ โดยคิดค่าบริการเป็นแบบรายเดือนที่ 199 บาท และรายปีที่ 1,990 บาท (เวอร์ชั่น Mac เป็นแบบซื้อขาด) โดยจะรองรับ iPad ที่ใช้ชิป <strong>M1</strong> ขึ้นไปเท่านั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/bb372c7bbf0245e30d129a5bc4a6edff.jpg\" /></p>\n<p><strong>Final Cut Pro for iPad</strong> เป็นแอปฯที่ออกแบบมาใหม่ทั้งหมดเพื่อให้เหมาะกับการสัมผัสด้วยปลายนิ้ว โดยฟีเจอร์จากเวอร์ชั่น MacOS มาอย่างครบถ้วนไม่ว่าจะเป็น Magnetic Timeline, Multicam Editing ซึ่งที่พิเศษกว่าเวอร์ชั่น MacOS คือสามารถใช้ร่วมกับ Apple pencil ในการวาดลงไปใน Footage แล้วสามารถทำ Animation ได้เลย อีกทั้งยังสามารถใช้กับการเกรดสีวิดีโอใน Reference Mode ได้ด้วย นอกเหนือจากนี้เรายังสามารถเอา Project จากใน iPad ไปทำต่อใน Mac ได้</p>\n<p><strong>Logic Pro for iPad</strong> ก็เป็นแอปฯทำเพลงแบบมืออาชีพที่ออกแบบใหม่ที้งหมดสำหรับการสัมผัสเช่นกัน โดยระบบการค้นหาเสียงแบบใหม่ที่จะช่วยให้นักทำเพลงสะดวกสบายยิ่งขึ้น รวมถึงมีเครื่องดนตรีมากกว่า 100 ชนิด และ รองรับ Plug-Ins เสริมอีกมากมาย แน่นอนว่าสามารถนำ Project จาก iPad ไปทำต่อใน Mac ได้เช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.apple.com/newsroom/2023/05/apple-brings-final-cut-pro-and-logic-pro-to-ipad/\">Apple</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/final-cut-pro\">Final Cut Pro</a></div><div><a href=\"/topics/logic-pro\">Logic Pro</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/ipad\">iPad</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a5870d58423aa9e291b052286f441a20130f6808853dc64d312109a4a5b3db32","category":"Thai"}