{"title":"Hemodynamic Changes in Supra Aortic Trunks after Transcatheter Aortic Valve Implantation at Duplex Ultrasound Examination","link":"https://www.preprints.org/manuscript/202408.0633/v1","date":1723190959000,"content":"The hemodynamic consequences of the aortic stenosis (AS) on supraortic trunks may have a po-tential role in the diagnosis of concomitant internal carotid artery (ICA) stenosis by dampening blood flow velocity. To investigate the effect of AS on ICA blood flow we evaluated carotid and vertebral blood flow velocity indexes in patients undergoing transcatheter aortic valve implanta-tion (TAVI).\n\nEighty-five patients admitted for endovascular treatment of a severe AS underwent supra-aortic Duplex ultrasound (DUS) examination prior and after TAVI to be enrolled in the study. Patients with other cardiac impairments that could configure a confounding factor were excluded. Pa-tients with symptomatic or severe ICA stenosis defined according to NASCET criteria were ex-cluded.\n\nForty-five patients of a median age of 80 years met the study inclusion criteria. The peak systolic velocity (PSV) of the assessed supraortic arteries increased after TAVI: respectively common ca-rotid artery (CCA) 64 ± 17 cm/s vs 78 ± 23 cm/s, p= 0,01; ICA 68 ± 23 cm/s vs 96 ± 35 cm/s, p= 0,01; vertebral artery (VA) 45 ± 14 cm/s vs 52 ± 15 cm/s, p=0,03. Similarly, the end diastolic velocity (EDV) increased after TAVI: respectively CCA 13 ± 6 cm/s vs 15 ± 7 cm/s, p=ns; ICA 20 ± 9 cm/s vs 24 ± 9 cm/s, p= 0,01; VA 9 ± 4 cm/s vs 11 ± 4 cm/s, p=0,01. Consistently, the mean acceleration time (AC) decreased after TAVI: respectively CCA 0,17 ± 0,05 s vs 0,12 ± 0,05 s, p= 0.01; ICA 0,1 8 ± 0,05 s vs 0,12 ± 0,04 s, p= 0,01; VA 0,16 ± 0,05 s vs 0,11 ± 0,05 s, p=0,02.\n\nSevere AS significantly affects supra-aortic arteries blood flow as assessed by duplex, by de-creasing both PSV and EDV and increasing AC. This study suggests that carotid ultrasound cri-teria to assess ICA stenosis severity should be re-evaluated in larger multicenter studies to vali-date their predictive values in patients with concomitant AS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a598e0bf6145ab0fa1a0af8aad599e6112e9e21aebbe2b13edb56f68a3f2bbaf","category":"Interdisciplinary"}