{"title":"Cardiac magnetic resonance imaging characterization of acute rejection in a porcine heterotopic heart transplantation model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304588","date":1717423200000,"content":"<p>by Michelle Mendiola Pla, Carmelo A. Milano, Carolyn Glass, Dawn E. Bowles, David C. Wendell</p>\r\n\r\nPreclinical disease models are important for the advancement of therapeutics towards human clinical trials. One of the difficult tasks of developing a well-characterized model is having a reliable modality with which to trend the progression of disease. Acute rejection is one of the most devastating complications that can occur following organ transplantation. Specifically in cardiac transplantation, approximately 12% of patients will experience at least one episode of moderate or severe acute rejection in the first year. Currently, the gold standard for monitoring rejection in the clinical setting is to perform serial endomyocardial biopsies for direct histological assessment. However, this is difficult to reproduce in a porcine model of acute rejection in cardiac transplantation where the heart is heterotopically transplanted in an abdominal position. Cardiac magnetic resonance imaging is arising as an alternative for serial screening for acute rejection in cardiac transplantation. This is an exploratory study to create and define a standardized cardiac magnetic resonance screening protocol for characterizing changes associated with the presence of acute rejection in this preclinical model of disease. Results demonstrate that increases in T1 mapping, T2 mapping, left ventricular mass, and in late gadolinium enhancement are significantly correlated with presence of acute rejection.","author":"Michelle Mendiola Pla","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a59807fa5b201df1a4e749114f60b7431d838cc5ea1210af511d107457a8cdf8","category":"Interdisciplinary"}