{"title":"Ecological-level factors associated with tuberculosis incidence and mortality: A systematic review and meta-analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003425","date":1729000800000,"content":"<p>by Alemneh Mekuriaw Liyew, Archie C. A. Clements, Temesgen Yihunie Akalu, Beth Gilmour, Kefyalew Addis Alene</p>\r\n\r\nGlobally, tuberculosis (TB) is the leading infectious cause of morbidity and mortality, with the risk of infection affected by both individual and ecological-level factors. While systematic reviews on individual-level factors exist, there are currently limited studies examining ecological-level factors associated with TB incidence and mortality. This study was conducted to identify ecological factors associated with TB incidence and mortality. A systematic search for analytical studies reporting ecological factors associated with TB incidence or mortality was conducted across electronic databases such as PubMed, Embase, Scopus, and Web of Science, from each database’s inception to October 30, 2023. A narrative synthesis of evidence on factors associated with TB incidence and mortality from all included studies, alongside random-effects meta-analysis where applicable, estimated the effects of each factor on TB incidence. A total of 52 articles were included in the analysis, and one study analysed two outcomes, giving 53 studies. Narrative synthesis revealed predominantly positive associations between TB incidence and factors such as temperature (10/18 studies), precipitation (4/6), nitrogen dioxide (6/9), poverty (4/4), immigrant population (3/4), urban population (3/8), and male population (2/4). Conversely, air pressure (3/5), sunshine duration (3/8), altitude (2/4), gross domestic product (4/9), wealth index (2/8), and TB treatment success rate (2/2) mostly showed negative associations. Particulate matter (1/1), social deprivation (1/1), and population density (1/1) were positively associated with TB mortality, while household income (2/2) exhibited a negative association. In the meta-analysis, higher relative humidity (%) (relative risk (RR) = 1.45, 95%CI:1.12, 1.77), greater rainfall (mm) (RR = 1.56, 95%CI: 1.11, 2.02), elevated sulphur dioxide (μg m–3) (RR = 1.04, 95% CI:1.01, 1.08), increased fine particulate matter concentration (PM2.5) (μg/ m<sup>3</sup>) (RR = 1.33, 95% CI: 1.18, 1.49), and higher population density (people/km<sup>2</sup>) (RR = 1.01,95%CI:1.01–1.02) were associated with increased TB incidence. Conversely, higher average wind speed (m/s) (RR = 0.89, 95%CI: 0.82,0.96) was associated with decreased TB incidence. TB incidence and mortality rates were significantly associated with various climatic, socioeconomic, and air quality-related factors. Intersectoral collaboration across health, environment, housing, social welfare and economic sectors is imperative for developing integrated approaches that address the risk factors associated with TB incidence and mortality.","author":"Alemneh Mekuriaw Liyew","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a59cd74a7e44cd8e4795562ce89bb6cd646c739616593112e22d55e80dd214b3","category":"Environment"}