{"title":"Single pulmonary nanopolystyrene exposure in late-stage pregnancy dysregulates maternal and fetal cardiovascular function","link":"https://academic.oup.com/toxsci/article/199/1/149/7609800?rss=1","date":1708128000000,"content":"<span><div>Abstract</div>Large-scale production and waste of plastic materials have resulted in widespread environmental contamination by the breakdown product of bulk plastic materials to micro- and nanoplastics (MNPs). The small size of these particles enables their suspension in the air, making pulmonary exposure inevitable. Previous work has demonstrated that xenobiotic pulmonary exposure to nanoparticles during gestation leads to maternal vascular impairments, as well as cardiovascular dysfunction within the fetus. Few studies have assessed the toxicological consequences of maternal nanoplastic (NP) exposure; therefore, the objective of this study was to assess maternal and fetal health after a single maternal pulmonary exposure to polystyrene NP in late gestation. We hypothesized that this acute exposure would impair maternal and fetal cardiovascular function. Pregnant rats were exposed to nanopolystyrene on gestational day 19 via intratracheal instillation. 24 h later, maternal and fetal health outcomes were evaluated. Cardiovascular function was assessed in dams using vascular myography <span>ex vivo</span> and in fetuses <span>in vivo</span> function was measured via ultrasound. Both fetal and placental weight were reduced after maternal exposure to nanopolystyrene. Increased heart weight and vascular dysfunction in the aorta were evident in exposed dams. Maternal exposure led to vascular dysfunction in the radial artery of the uterus, a resistance vessel that controls blood flow to the fetoplacental compartment. Function of the fetal heart, fetal aorta, and umbilical artery after gestational exposure was dysregulated. Taken together, these data suggest that exposure to NPs negatively impacts maternal and fetal health, highlighting the concern of MNPs exposure on pregnancy and fetal development.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"a59d852a8e06a7ba9f67baa55a9619b0f562c6bd6df93c95b41c04e82ee8cb55","category":"Environment"}