{"title":"Assessing the impact of COVID-19 on tuberculosis detection and treatment in healthcare facilities across Addis Ababa, Ethiopia: A comprehensive mixed-method, multi-center study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311408","date":1727964000000,"content":"<p>by Beshir Bedru Nasir, Oumer Sada Muhammed, Melaku Tileku Tamiru, Legese Chelkeba</p>\r\nBackground <p>Ethiopia faces a significant burden of Tuberculosis (TB), being one of the high-burden countries, and the emergence of the Coronavirus Disease 2019 (COVID-19) has become a dominant health concern, particularly in resource-limited settings. The repercussions of COVID-19 on TB care are evident, leading to a surge in undiagnosed TB cases, challenges in medication adherence, and an escalation of drug resistance. Consequently, a thorough assessment of the impact of COVID-19 on TB care becomes imperative to devise a tailored program for managing TB amidst future pandemics, natural disasters, and conflict crises.</p> Methods <p>A mixed-methods study design was utilized, encompassing a randomly selected 10 health centers (HCs) and 3 hospitals among government owned 98 HCs and 5 hospitals in Addis Ababa, Ethiopia. All TB patients who were on follow-up during the study period were included. The study period was from March 4, 2020, to December 4, 2020, with the corresponding period of March 4, 2019, to December 4, 2019, serving as the baseline for comparison. Quantitative data were gathered from TB patients’ medical registries, laboratory registries, and treatment follow-up charts. Complementary qualitative data were acquired through in-depth interviews. Both qualitative and quantitative data were collected from January 17, 2022 to May 13, 2022.</p> Results <p>Following the onset of the pandemic, there was a notable and statistically significant decline in both the detection of TB cases and the number of positive results across all study sites. Bacteriological TB tests reduced from 5837 to 2126 patients, and TB-positive cases decreased from 500 to 218, representing declines of 63.6% and 56.4%, respectively. The overall number of TB patients undergoing treatment also experienced a decrease from 1431 to 1051, marking a 26.6% reduction. Additionally, there was a 10% increase in the proportion of extra-pulmonary TB cases. The impact of the pandemic extended to TB treatment outcomes, with adverse effects on cure rates, death rates, loss of follow-up, and medication adherence. The apprehension of contracting COVID-19 and the implementation of isolation measures contributed to a decline in healthcare-seeking behaviors among patients, fostering negative perceptions and practices among healthcare workers. The challenges further exacerbated due to a shortage of personal protective equipment, a lack of rapid diagnostic test tools, clinical presentations resembling COVID-19, and a shift in government policies. These factors collectively posed significant obstacles to effective TB care during the pandemic.</p> Conclusion <p>The profound impact of COVID-19 on critical TB care service indicators, including TB detection, treatment initiation, and treatment outcomes, underscores the need for immediate and collaborative measures. It is imperative to implement strategies that ensure the resumption of all TB care services concurrently with efforts to control COVID-19. A comprehensive and coordinated approach is essential to mitigate the adverse effects of the pandemic on TB management and safeguard public health.</p>","author":"Beshir Bedru Nasir","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a59d590034dd782937c56028df8f916658b9a7f4c40b2f681b6485b6bb0845ef","category":"Interdisciplinary"}