{"title":"Using low‐cost, eco‐friendly natural and modified potato peels to effectively remove Mn(II) ions from aqueous solutions","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14496?af=R","date":1729164573000,"content":"<h2>Abstract</h2>\n<p>The objective of this investigation is to look into the potential use of trash potato peels and processed potato peels as a solution for effectively removing Mn(II) ions extracted from aqueous solutions. The optimal working circumstances for removing Mn(II) ions from aqueous solution in PP are an initial concentration of 300 mg/L, an adsorbent dose of 0.3 g, a contact time (CT) of 100 min, and a solution pH of 6.08. The optimal working conditions for MPP were established to be an initial concentration of 300 mg/L, an adsorbent dosage of 0.15 g, a CT of 100 min, and a solution pH of 6.08. Studies were conducted at various temperatures to better understand the removal capabilities of adsorbent compounds. The removal abilities of Mn(II) ions for PP were determined to be 10.787, 13.698, and 16.556 mg/g at varied temperatures (25, 35, and 45°C), respectively. Under the same conditions, the removal capacity of MPP was determined to be 34.246, 45.045, and 51.813 mg/g. Further investigation of the adsorption kinetics revealed that the experimental results suited the pseudo-second-order model for both PP and MPP adsorbents. Thermodynamic analyses demonstrated that the endothermic process of Mn(II) metal ion adsorption onto the adsorbents occurred spontaneously. The study found that both PP and MPP were very efficient and ecologically friendly adsorbents for removing Mn(II) ions from aqueous solutions. Their demonstrated performance highlights their potential value in sustainable wastewater treatment applications, which accord with environmentally conscious behaviors.</p>","author":"Canpolat Mutlu, \nYalçın Altunkaynak","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"a5a56f27b96a3ade2692dcb4372f30232c782dee4b1b20441bd8cb6a740d3525","category":"Environment"}