{"title":"Roscosmos seeks to obscure bidding process to evade US sanctions","link":"https://arstechnica.com/?p=2004535","date":1708439129000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1747243761-800x534.jpg\" alt=\"Russian President Vladimir Putin (L) and Roscosmos Space Corporation Chief Yuri Borisov peruse an exhibit while visiting the Korolev Rocket and Space Corporation Energia last October.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1747243761.jpg\">Enlarge</a> <span>/</span> Russian President Vladimir Putin (L) and Roscosmos Space Corporation Chief Yuri Borisov peruse an exhibit while visiting the Korolev Rocket and Space Corporation Energia last October. (credit: Contributor/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Russia's Duma, the lower house of the nation's federal legislature, passed a new law earlier this month that directs the Roscosmos State Corporation to make purchases through a closed bidding process.</p>\n<p><a href=\"https://www.interfax.ru/russia/946317\">According to the Interfax news agency</a>, the legislation expands the list of corporations, including Roscosmos subsidiaries and other \"legal entities,\" that must participate in the government contract procurement processes via a closed bidding process.</p>\n<p>Passage of the amendment by the Duma, which is dominated by President Vladimir Putin's \"United Russia\" political party, signals that it will almost certainly become the law of the land. Based on the Russian news report, translated for Ars by Rob Mitchell, the idea for the law came from Roscosmos, the sprawling corporation that operates the majority of the country's civil and military space programs.</p></div><p><a href=\"https://arstechnica.com/?p=2004535#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004535&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a5c06df9be469c581414cc6f78c807233e0ac7f4b0d14621cc248f73ff8c462e","category":"Tech"}