{"title":"Real-time resolution studies of the regulation of lactate production by hexokinases binding to mitochondria in single cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300150","date":1709906400000,"content":"<p>by Scott John, Guillaume Calmettes, Shili Xu, Bernard Ribalet</p>\r\n\r\nDuring hypoxia accumulation of lactate may be a key factor in acidosis-induced tissue damage. Binding of hexokinase (HK) to the outer membrane of mitochondria may have a protective effect under these conditions. We have investigated the regulation of lactate metabolism by hexokinases (HKs), using HEK293 cells in which the endogenous hexokinases have been knocked down to enable overexpression of wild type and mutant HKs. To assess the real-time changes in intracellular lactate levels the cells were also transfected with a lactate specific FRET probe. In the HKI/HKII double knockdown HEK cells, addition of extracellular pyruvate caused a large and sustained decrease in lactate. Upon inhibition of the mitochondrial electron transfer chain by NaCN this effect was reversed as a rapid increase in lactate developed which was followed by a slow and sustained increase in the continued presence of the inhibitor. Incubation of the HKI/HKII double knockdown HEK cells with the inhibitor of the malic enzyme, ME1*, blocked the delayed accumulation of lactate evoked by NaCN. With replacement by overexpression of HKI or HKII the accumulation of intracellular lactate evoked by NaCN was prevented. Blockage of the pentose phosphate pathway with the inhibitor 6-aminonicotinamide (6-AN) abolished the protective effect of HK expression, with NaCN causing again a sustained increase in lactate. The effect of HK was dependent on HK’s catalytic activity and interaction with the mitochondrial outer membrane (MOM). Based on these data we propose that transformation of glucose into G6P by HK activates the pentose phosphate pathway which increases the production of NADPH, which then blocks the activity of the malic enzyme to transform malate into pyruvate and lactate.","author":"Scott John","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a5c84c0b7ae2a458dbdac71e4b449514b4b40e810f814110742558532ef3f767","category":"Interdisciplinary"}