{"title":"Patient Outcomes in Resected Combined Hepatocellular Cholangiocarcinoma (cHCC-ICC) and Intrahepatic Cholangiocarcinoma: A Single Center Study","link":"https://www.preprints.org/manuscript/202406.1868/v1","date":1719400598000,"content":"Combined hepatocellular cholangiocarcinoma (cHCC-ICC) is a rare malignancy that involves a combination of features of hepatocellular carcinoma and intrahepatic cholangiocarcinoma (ICC). cHCC-ICC is generally considered to exhibit a more aggressive clinical course compared to ICC; however, its risk factors and outcomes remain largely undefined. A single-center retrospective study of 82 patients diagnosed with ICC or cHCC-ICC from June 2011 and January 2023, all of whom underwent surgical resection. Our analysis included 70 patients with resected ICC and 12 with resected cHCC-ICC. The overall survival (OS) for the entire cohort was 21.6 months, with a recurrence-free survival (RFS) of 11.8 months. The cHCC-ICC group had significantly higher levels of AST and ALT (AST median 206 vs. 46; ALT median 165.5 vs. 48; p=0.012 and p=0.013, respectively), whereas the ICC group had higher alkaline phosphatase (median 66 vs. 104; p=0.03). CA 19-9 values (p=0.02) were higher in the ICC group, while AFP values were higher in the cHCC-ICC group (p=0.0004). The cHCC-ICC group had a significantly higher rate of recurrence (83% vs. 47%, p=0.028) with a significantly decreased RFS (4.7 months vs. 12.4 months; log-rank p=0.007). cHCC-ICC is a rare entity that needs to be further studied to improve patient outcomes. Our study showed that RFS is lower in the cHCC-ICC group as compared to ICC patients alone. Further studies are warranted and possibly suggest the need for more aggressive initial treatment strategies in patients diagnosed with cHCC-ICC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a5cb03f3153c56bb90267dd2e5772462d5e3d1538826ac234c78593f2a4abf79","category":"Interdisciplinary"}