{"title":"Does wealth equate to happiness? an 11-year panel data analysis exploring socio-economic indicators and social media metrics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301206","date":1712757600000,"content":"<p>by Feng Huang, Huimin Ding, Nuo Han, Fumeng Li, Tingshao Zhu</p>\r\n\r\nThe Easterlin paradox questions the link between economic growth and national well-being, emphasizing the necessity to explore the impact of economic elasticity, income inequality, and their temporal and spatial heterogeneity on subjective happiness. Despite the importance of these factors, few studies have examined them together, thus ongoing debates about the impact of economics on well-being persist. To fill this gap, our analysis utilizes 11 years of panel data from 31 provinces in China, integrating macroeconomic indicators and social media content to reassess the Easterlin paradox. We use GDP per capita and the Gini coefficient as proxies for economic growth and income inequality, respectively, to study their effects on the subjective well-being expressed by citizens on social media in mainland China. Our approach combines machine learning and fixed effects models to evaluate these relationships. Key findings include: (1) In temporal relationships, a 46.70% increase in GDP per capita implies a 0.38 increase in subjective well-being, while a 0.09 increase in the Gini coefficient means a 1.47 decrease in subjective well-being. (2) In spatial relationships, for every 46.70% increase in GDP per capita, subjective well-being rises by 0.51; however, this relationship is buffered by unfair distribution, and GDP per capita no longer significantly affects subjective well-being when the Gini index exceeds 0.609. This study makes a synthetic contribution to the debate on the Easterlin paradox, indicating that economic growth can enhance well-being if income inequality is kept below a certain level. Although these results are theoretically enlightening for the relationship between economics and national well-being globally, this study’s sample comes from mainland China. Due to differences in cultural, economic, and political factors, further research is suggested to explore these dynamics globally.","author":"Feng Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a5d1588c42ce9a71ee063927d633c912b9ec537e600483dea4a27fb9c6238d00","category":"Interdisciplinary"}