{"title":"WhatsApp's End-to-End Encrypted Chat Backups Feature Now Rolling Out","link":"https://www.macrumors.com/2021/10/15/whatsapp-encrypted-chat-backups-rolling-out/","date":1634285371000,"content":"WhatsApp end-to-end encrypted backups are now rolling out for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users, Facebook has announced. Until now, WhatsApp let users back up their chat history to ‌‌<a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a>‌‌, but the messages and media contained in the backups weren't protected by WhatsApp's end-to-end encryption while in ‌‌Apple's cloud servers‌. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Whatsapp_E2EE_Backups.png.jpg\" />\r\n<br />\r\nSince Apple holds the encryption keys for ‌‌iCloud‌‌ Backup, a subpoena of Apple or an unauthorized ‌‌iCloud‌‌ hack could have potentially allowed access to WhatsApp messages backed up there. Apple was <a href=\"https://www.macrumors.com/2020/01/21/apple-dropped-end-to-end-icloud-encryption-report/\">reportedly pressured</a> to not add encryption to ‌‌iCloud‌‌ Backups after the FBI complained.\r\n<br />\r\n\r\n<br />\r\nGoing forward, however, users can create a password or 64-bit key to protect their backup in cloud-based storage, whether they're saved in ‌iCloud‌ or Google Drive.\r\n<br />\r\n\r\n<br />\r\nFacebook CEO Mark Zuckerberg <a href=\"https://www.facebook.com/zuck\">made the announcement</a>, saying that users can generate a password of their choice or a 64-digit encryption key that only they know in order to access their WhatsApp chat backups.\r\n<br />\r\n<blockquote>While end-to-end encrypted messages you send and receive are stored on your device, many people also want a way to back up their chats in case they lose their phone. Starting today, we are making available an extra, optional layer of security to protect backups stored on Google Drive or iCloud with end-to-end encryption. No other global messaging service at this scale provides this level of security for their users' messages, media, voice messages, video calls, and chat backups.\r\n<br />\r\n\r\n<br />\r\nYou can now secure your end-to-end encrypted backup with either a password of your choice or a 64-digit encryption key that only you know. Neither WhatsApp nor your backup service provider will be able to read your backups or access the key required to unlock it.</blockquote>The encrypted chat backups feature will gradually be rolled out to more than two billion users on Android and iOS, and will be available in every market where WhatsApp is operational, which could put the company at odds with some governments.\r\n<br />\r\n<ul><li><a href=\"https://www.macrumors.com/how-to/end-to-end-encrypt-whatsapp-chat-backups-in-icloud/\">How to End-to-End Encrypt Your WhatsApp Chat Backups in iCloud</a></li></ul>\r\n<br />\r\nNotably, Apple <a href=\"https://www.macrumors.com/2021/06/07/icloud-private-relay-unavailable-some-countries/\">is not making</a> its upcoming ‌‌iCloud‌‌+ Private Relay encrypted browsing feature available to users living under certain authoritarian regimes, including China, Belarus, Colombia, Egypt, Kazakhstan, Saudi Arabia, South Africa, Turkmenistan, Uganda, and the Philippines. According to Apple, \"regulatory reasons\" are preventing the Private Relay feature from launching in those countries.<div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/15/whatsapp-encrypted-chat-backups-rolling-out/\">WhatsApp's End-to-End Encrypted Chat Backups Feature Now Rolling Out</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapps-end-to-end-encrypted-chat-backups-feature-now-rolling-out.2317027/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=8nLSL3zMLok:Zjw-i7Rtpng:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=8nLSL3zMLok:Zjw-i7Rtpng:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/8nLSL3zMLok\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a5d7c9afe3f7f6fa29c1c56a182e2d0f393483ec9e502a5b78996c49d1eda9f9","category":"Apple"}