{"title":"Deepfake celebrities begin shilling products on social media, causing alarm","link":"https://arstechnica.com/?p=1972869","date":1696360949000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/tom_hanks_ai_hero_2-800x450.jpg\" alt=\"A cropped portion of the AI-generated version of Hanks that the actor shared on his Instagram feed.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/tom_hanks_ai_hero_2.jpg\">Enlarge</a> <span>/</span> A cropped portion of the unauthorized AI-generated version of Hanks that the actor warned about on his Instagram feed. (credit: Tom Hanks)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>News of AI deepfakes spread quickly when you're Tom Hanks. On Sunday, the actor <a href=\"https://www.instagram.com/p/Cx2MsH9rt7q/\">posted a warning</a> on Instagram about an unauthorized AI-generated version of himself being used to sell a dental plan. Hanks' warning spread in the media, including <a href=\"https://www.nytimes.com/2023/10/02/technology/tom-hanks-ai-dental-video.html\">The New York Times</a>. The next day, CBS anchor Gayle King <a href=\"https://www.instagram.com/p/Cx54IIFuozI/\">warned</a> of a similar scheme using her likeness to sell a weight-loss product. The now widely reported incidents have raised new concerns about the use of AI in digital media.</p>\n\n<p>\"BEWARE!! There’s a video out there promoting some dental plan with an AI version of me. I have nothing to do with it,\" wrote Hanks on his Instagram feed. Similarly, King shared an AI-augmented video with the words \"Fake Video\" stamped across it, stating, \"I've never heard of this product or used it! Please don't be fooled by these AI videos.\"</p>\n<p>Also on Monday, YouTube celebrity MrBeast <a href=\"https://twitter.com/MrBeast/status/1709046466629554577\">posted</a> on social media network X about a similar scam that features a modified video of him with manipulated speech and lip movements promoting a fraudulent iPhone 15 giveaway. \"Lots of people are getting this deepfake scam ad of me,\" he wrote. \"Are social media platforms ready to handle the rise of AI deepfakes? This is a serious problem.\"</p></div><p><a href=\"https://arstechnica.com/?p=1972869#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972869&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a5d8da9b4d009588a98fdb589f8bafa67d145ed7983268f934d2d6645e173fb3","category":"Tech"}