{"title":"Mark Zuckerberg ตอบคำถามนักวิเคราะห์ ย้ำยังไม่คิดเรื่องระบบโฆษณาใน Threads","link":"https://www.blognone.com/node/135022","date":1690416033000,"content":"<div><div><div><p>Mark Zuckerberg ซีอีโอ Meta ตอบคำถามนักวิเคราะห์ในช่วงแถลง<a href=\"https://www.blognone.com/node/135021\">ผลประกอบการไตรมาสล่าสุด</a> ซึ่งคาดเดาได้ ว่าจะมีหลายคำถามที่เกี่ยวกับ Threads แอปโซเชียลตัวใหม่ที่หวังแข่งกับ <s>Twitter</s> X</p>\n<p>เขาบอกว่าเป็นเรื่องประหลาดที่ในอุตสาหกรรมเทคโนโลยี ไม่มีแอปโซเชียลตัวหนังสือที่มีผู้ใช้งานระดับ 1 พันล้านคน ซึ่งย้ำถึง<a href=\"https://www.blognone.com/node/134715\">เป้าหมาย</a>ที่เขาเคยบอกก่อนหน้านี้ ส่วนแนวทางจากนี้ของ Threads คือการเพิ่มฟีเจอร์สำคัญที่ยังไม่มี ปรับปรุงให้คนใช้งานแอปสม่ำเสมอ</p>\n<p>เขามั่นใจว่า Meta สามารถเติมน้ำมันลงไปให้เพียงพอสำหรับการที่จะทำให้แอปโตไประดับนั้นในเวลาที่พร้อม รวมถึงบอกว่าตอนนี้ Threads ก็ยังไม่มีการใช้งบการตลาดหรือแคมเปญโปรโมตผ่าน Instagram หรือ Facebook เลยด้วยซ้ำ</p>\n<p>ในตอนหนึ่ง เขาพูดถึง <s>Twitter</s> X โดยยอมรับว่าที่ผ่านมาบริษัทไม่ค่อยประสบความสำเร็จในการสร้างแอปหรือบริการตัวใหม่ (Facebook สร้างเอง ส่วน Instagram กับ WhatsApp มาจากการซื้อกิจการ) ถ้ามองในมุมนักลงทุนแบบ VC ก็เหมือนการลงทุนหลากหลายธุรกิจ แล้วขอให้มีหนึ่งตัวที่ประสบความสำเร็จสูง เขามองว่าสถานการณ์ของ X ตอนนี้ ช่วยเร่งให้โอกาสใหม่ของ Meta เกิดขึ้น</p>\n<p>Zuckerberg ยังบอกว่าตอนนี้ยังไม่มีความคิดเรื่องระบบโฆษณาใน Threads สิ่งที่ทำตอนนี้เป็นการต่อยอดจากโอกาสที่ได้มา เพราะทุกคนที่ Meta ก็ไม่คิดว่าแอปจะได้รับความนิยมสูงรวดเร็ว เรื่องโฆษณาจึงยังเป็นทางอีกยาวไกลตอนนี้</p>\n<p>ที่มา: <a href=\"https://www.theverge.com/2023/7/26/23809080/mark-zuckerberg-meta-q2-earnings-threads-one-billion-users\">The Verge</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b42fe51abf7e5717efb1498b3806a0a0.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/threads\">Threads</a></div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/meta\">Meta</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a5f1f789ed947b596eb8c7811ea7697e6c32bd010994e7da7a04608c2e694c53","category":"Thai"}