{"title":"Patterns of riparian forest disturbance caused by tree dislodging on a subtropical river during large floods","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4298?af=R","date":1715315986000,"content":"<h2>Abstract</h2>\n<p>Riparian forests contribute to the resilience and biocomplexity of floodplains but may be catastrophically impacted by large floods. Forest disturbances will expose floodplains to stripping and pulses of large wood recruitment to the floodplain and channel. The widespread uprooting of trees follows hydrodynamic loading from floodwaters and the associated moments of these forces about the tree bases. A tree will uproot when the drag moment exceeds the anchorage resistance capacity. Alternatively, trunks will rupture when the tensile stresses caused by bending exceed the tensile strength of the outer trunk fibres. The likelihood and pattern of trees dislodging during floods on a subtropical river was investigated by developing a tree stability model. The modeling framework included development of a drag moment model and testing several potential formulations for anchorage resistance. Model parameters were calibrated to data collected in experiments and from observations in aerial photographs before and after a large flood in 2011. The prediction accuracy for the adopted tree stability model was 78%. Results from design flood simulations suggest that less than a third of the forest will dislodge even during the largest floods conceivable. This remarkable stability moderates the quantity of large wood recruited from riparian forests during extreme floods, which can impact infrastructure such as bridges and culverts downstream. Low rates of wood recruitment from dislodged floodplain trees in extreme floods suggests bank erosion is the dominant source of wood recruitment in these catchments.</p>","author":"Richard Sharpe, \nAndrew Brooks, \nJon Olley, \nJustine Kemp","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"a5f1e83b049afeff3ce85edd8d5b8d0473e26316078076c6dd19160c64800c14","category":"Environment"}