{"title":"Prenatal coparenting and attachment style in Japanese pregnant women: A cross-sectional survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309212","date":1724940000000,"content":"<p>by Yui Masui, Akemi Yamazaki</p>\r\n\r\nDeveloping prenatal coparenting is important for preparing couples for parenting immediately after childbirth, but knowledge of prenatal coparenting remains limited. Adult attachment style has been shown to be one of the factors during pregnancy that predict coparenting after childbirth, as well as a significant factor in the developmental process of the coparenting relationship. The present study mainly examines the relationship between prenatal coparenting as perceived by pregnant women and their attachment style. A cross-sectional survey was conducted at a tertiary emergency medical facility in Japan. Data from 181 pregnant women at 22–36 weeks’ gestation who completed a self-reported questionnaire consisting of the Prenatal Coparenting Scale (PCS), relationship-specific attachment styles, and characteristics were subjected to analysis. The mean age of the women in this study was 33.1 years (standard deviation = 5.2), 80 (44.2%) were expecting their first child, and 101 (55.8%) were expecting their second or subsequent child. Women’s attachment avoidance toward their mother (<i>r</i> = –.26), father (<i>r</i> = –.23), and partner (<i>r</i> = –.60) and attachment anxiety toward their partner (<i>r</i> = –.33) were significantly negatively correlated with PCS scores. When classified into two groups by fetal birth order, attachment avoidance and attachment anxiety toward the partner were significantly negatively correlated with PCS scores, regardless of fetal birth order. Unlike attachment style toward the partner, attachment avoidance toward the mother (<i>r</i> = –.33) and father (<i>r</i> = –.32) was significantly negatively correlated with PCS scores in the group of women expecting their second or subsequent child only. These results provide valuable insights into the relationship between prenatal coparenting and adult attachment style and deepen the understanding of prenatal coparenting. Future studies using longitudinal surveys and multivariate analyses could present relevant suggestions for specific types of support that promote the development of prenatal coparenting.","author":"Yui Masui","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a60b57ec9a3cc608dd2363d7d0bf889265fba7d1ee8b6f4b494e3c819a14cb95","category":"Interdisciplinary"}