{"title":"Opportunistic Pathogens in Malnourished African Children: A Scoping Review","link":"https://www.preprints.org/manuscript/202409.1135/v1","date":1726304131000,"content":"Understanding the interplay between infections and severe acute malnutrition is critical in attaining good clinical outcomes in managing malnourished children. However, review studies describing the profile of the associated pathogens in the malnourished African pediatric population are sparse in the literature. We aimed to identify the spectrum of pathogens from studies reporting infections in malnourished African children, as well as the antibiotic resistance pattern and clinical outcomes. A systematic literature of the PubMed database was conducted following PRISMA guidelines from January 2001 to June 2024. The search algorithm was ((marasmus) OR (kwashiorkor) OR (severe acute malnutrition) OR (protein energy malnutrition)) AND (Africa). For a more comprehensive retrieval, an additional search algorithm was deployed: (HIV OR tuberculosis) AND (severe acute malnutrition). We included 67 studies conducted between 2001 and 2024. Most of the studies were from East Africa (n=53, 79.1%) and Southern Africa (n=5, 7.4%). A total of 7,056 pathogens were identified comprising 3,030 Viruses, 2,381 bacteria, 1,452 parasites and 193 fungal pathogens. The predominant pathogens were HIV, Mycobacterium tuberculosis, and malaria parasites accounting for 42.5%, 25.2%, and 17.1% respectively. Antibiotic susceptibility testing was documented in only three studies. Fatality rates were reported in 49 studies and ranged from 2% to 56% regardless of the category of pathogen. This review affirms the deleterious effect of infections in malnourished patients and suggests a gross underdiagnosis as studies were found from only 17 (31.5%) African countries. Moreover, data on fungal infections in malnourished African children was nearly absent despite being at risk. There is also a need to prioritize research investigating African children with severe acute malnutrition for fungal infections besides other opportunistic pathogens and improve the availability of diagnostic tools and the optimized usage of antibiotics through the implementation of antimicrobial stewardship programmes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a60eeefa84287c846c378be84b848645217c515b64eb977b28450e2bd1797172","category":"Interdisciplinary"}