{"title":"Water Injection for Cloud Cavitation Suppression: Analysis on the Effects of Injection Parameters","link":"https://www.preprints.org/manuscript/202407.0650/v1","date":1720513147000,"content":"This study investigates cloud cavitation suppression around a model scale NACA66 hydrofoil using active water injection and explores the effect of multiple injection parameters. Numerical simulations and a mixed-level orthogonal test method are employed to systematically analyze the impact of jet angle αjet, jet location Ljet, and jet velocity Ujet on cavitation suppression efficiency and hydrofoil energy performance. The study reveals that jet location has the greatest influence on cavitation suppression, while jet angle has the greatest influence on hydrofoil energy performance. The optimal parameter combination (Ljet = 0.30C, αjet = +60 degrees, Ujet = 3.25 m/s) effectively balances energy performance and cavitation suppression, reducing cavitation volume by 49.34% and improving lift-drag ratio by 8.55%. The study found that the jet's introduction not only enhances vapor condensation and reduces the intensity of the vapor-liquid exchange process but also disrupts the internal structure of cavitation clouds and elevates pressure on the hydrofoil suction surface, thereby effectively suppressing cavitation. Further analysis shows that positive-going horizontal jet components enhance the lift-drag ratio, while negative-going components have a detrimental effect. Jet arrangements near the trailing edge negatively impact both cavitation suppression and energy performance. These findings provide valuable reference for selecting optimal injection parameters to achieve a balance between cavitation suppression and energy performance in hydrodynamic systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a61d6ce7a2c57eef981182f9941df77d7fe640ddb949d049e8137689d7550cdd","category":"Interdisciplinary"}