{"title":"279 Estimating the impact of genomic selection for thermotolerance and in utero heat stress on piglet body weight from birth to bacon","link":"https://academic.oup.com/jas/article/102/Supplement_3/199/7757444?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The maternal response to heat stress (HS) has detrimental effects on swine offspring in the form of in utero heat stress (IUHS). Long-term effects of IUHS include reduced postnatal growth performance and lean muscle deposition. As such, developing mitigation strategies that reduce IUHS is essential to maximize economic return. Therefore, the study objective was to investigate whether genomic selection for HS tolerance (TOL) or HS sensitivity (SEN) would impact the postnatal growth of IUHS and in utero thermoneutral (IUTN) pigs from birth to market. We hypothesized that the IUHS pigs born to TOL dams would have improved growth relative to IUHS pigs born to SEN dams, but overall, IUHS pigs would have reduced growth compared with IUTN pigs. Pregnant gilts (n = 15 TOL and 13 SEN) were exposed to thermoneutral (TN; 17-20ºC; n = 7 TOL and 6 SEN) or heat stress (HS; cycling 26 to 36ºC; n = 8 TOL and 7 SEN) conditions from d 6 to 70 of gestation, and then all gilts were exposed to TN conditions until farrowing. Thirty-six offspring (barrows) were selected to represent each possible treatment combination: TOL+IUTN (n = 9), TOL+IUHS (n = 9), SEN+IUTN (n = 9), and SEN+IUHS (n = 9). Barrows were group-housed and fed a corn-soybean based diet that was provided with water ad libitum. Body weight (BW) of all barrows was measured at d 1, 21, 28, 35, 42, 49, 56, 84, 105, 126, 147, 168, and 189 of life to evaluate growth from birth (d 1) to market (d 189). Data were analyzed using the PROC GLIMMIX procedure of SAS with pig as the experimental unit and random effects being pen and litter. Body weights for each treatment group were fitted to a generalized Michaelis-Menten (GMM) function using the Nonlinear MIXED procedure of SAS with pig specific random effects for mature BW. On d 1, 126, and 168, IUHS pigs tended to have reduced BW (<span>P</span> &lt; 0.10; 1.19 ± 0.07, 58.37 ± 4.94, 91.18 ± 7.26 kg, respectively) when compared with IUTN pigs (1.32 ± 0.07, 68.95 ± 4.94, 106.25 ± 7.26 kg, respectively). Overall, final BW was reduced (<span>P</span> = 0.04) for IUHS (111.08 ± 7.91 kg) versus IUTN (128.79 ± 7.91 kg) pigs, and estimated days to a market weight of 125 kg tended to be greater (<span>P</span> = 0.06) for IUHS (219.8 ± 10.8 d) versus IUTN (188.1 ± 10.21 d) barrows. The GMM model predicted that IUHS+TOL and IUTN+TOL barrows had different shaped BW growth curves with decreased age to achieve one-half of their predicted mature BW than IUHS+SEN and IUTN+SEN barrows. In conclusion, IUHS resulted in reduced growth rates overall; however, TOL improved some aspects of growth.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a620ff798881f48eb7ff548f45d298a24ece8b3406095ebf6066df1d793304c5","category":"Environment"}