{"title":"Mapping the evidence on factors related to postpartum contraception among sub-Saharan African immigrant and refugee women in the United States of America: A scoping review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304222","date":1716991200000,"content":"<p>by Comfort Z. Olorunsaiye, Mariam A. Badru, Augustus Osborne, Hannah M. Degge, Sanni Yaya</p>\r\nBackground <p>Postpartum contraception is essential to sexual and reproductive health (SRH) care because it encourages healthy spacing between births, helps women avoid unwanted pregnancies, and lessens the risks of health problems for mothers and babies. Sub-Saharan African immigrant and refugee populations are rapidly increasing in the United States, and they come from a wide range of cultural, linguistic, religious, and social origins, which may pose challenges in timely access to culturally acceptable SRH care, for preventing mistimed or unwanted childbearing. The objective of this scoping review is to assess the extent of the available literature on postpartum contraception among sub-Saharan African immigrant and refugee women living in the United States.</p> Methods <p>We developed preliminary search terms with the help of an expert librarian, consisting of keywords including birth intervals, birth spacing, contraception, postpartum contraception or family planning, and USA or America, and sub-Saharan African immigrants, or emigrants. The study will include the following electronic databases: PubMed/MEDLINE, PsycINFO, CINAHL, EMBASE, and the Global Health Database. The sources will include studies on postpartum care and contraceptive access and utilization among sub-Saharan African immigrants living in the US. Citations, abstracts, and full texts will be independently screened by two reviewers. We will use narrative synthesis to analyze the data using quantitative and qualitative methods. Factors associated with postpartum contraception will be organized using the domains and constructs of the PEN-3 Model as a guiding framework.</p> Conclusion <p>This scoping review will map the research on postpartum contraception among sub-Saharan African immigrant and refugee women living in the US. We expect to identify knowledge gaps, and barriers and facilitators of postpartum contraception in this population. Based on the findings of the review, recommendations will be made for advocacy and program and policy development toward optimizing interpregnancy intervals in sub-Saharan African immigrants living in the US.</p> Trial registration <p>Review registration Open Science Framework: https://osf.io/s385j.</p>","author":"Comfort Z. Olorunsaiye","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a621bce65cd98283598b0c234e4f854ac1b03fce0ede4284b8de344a411eb45d","category":"Interdisciplinary"}