{"title":"PSVI-18 Association between residual feed intake and reproductive-related traits in young bulls","link":"https://academic.oup.com/jas/article/102/Supplement_3/541/7757636?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Enhancement of feed efficiency (FE) along with reproductive performance is critical to maximize profitability of beef production systems. Residual feed intake (RFI) is a measure of FE, assessing differences between expected and actual feed intake. Published data suggest a negative impact of RFI on reproductive performance. The objective of this experiment was to establish the relationship between RFI and reproductive parameters related with puberty in young bulls. Growing, Brangus bulls (n = 58; 10 to 12 mo of age) were tested for FE over 56 d and ranked as low RFI (LRFI) and high RFI (HRFI). Scrotal circumference (SC) was measured at the greatest diameter of the testicles by the same operator using a scrotal measuring tape, and semen samples were collected by electroejaculation at the beginning and at the end of the test. Fresh semen was visually evaluated (VE) for visual motility (VM), morphology [major defects (MAD)], minor defects (MID), total defects (TD)], plasma membrane integrity (PMI) via Eosin-nigrosin stain and sperm concentration (Con). Sperm kinematics were objectively determined simultaneously via computer-assisted sperm analysis (CASA-IVOS II System, Hamilton Thorne, Beverly, MA) within 6 h of collection in a medium designed specifically for holding sperm. Statistical analysis included repeated measures to assess interactions between Group (LRFI, HRFI) and Time (0 and 56 d of RFI measurement). Results are presented as mean ± SEM in Table 1. The main effect of Group did not affect CASA derived traits, while MAD and TD were affected among VE traits. A Time effect was observed in the amplitude of lateral head displacement (ALH), beat cross frequency (BCF), curvilinear velocity (VCL) and linearity (LIN). A tendency was indicated for total motility (TM), and average path velocity (VAP) among CASA derived traits, while all VE traits were affected by Time except for visual motility (VM). Finally, an interaction effect (Group x Time) was observed in LIN and plasma membrane integrity (PMI). In conclusion, age at puberty as determined by VM, Con, and SC (Group: <span>P</span> = 0.12, Day: <span>P</span> &lt; 0.001, Group x Day: <span>P</span> = 0.79) was not associated with RFI. Overall, fertility-related measurements were not influenced by RFI, with time emerging as the primary influencing factor across evaluated parameters. Evaluation of reproductive parameters following d 56 FE testing may be a useful determinant for identifying differences in seminal characteristics of young bulls.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a6234086ee5914664f1f1fc68e8ba70129c4300975b1d8387b7e0d8bedce90fe","category":"Environment"}