{"title":"Towards an integrative understanding of British Columbia’s Nechako Watershed: Connecting knowledge systems to strengthen understanding of climate change, watershed security, health and well-being","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000263","date":1720620000000,"content":"<p>by Margot W. Parkes, Stephen J. Déry, Philip N. Owens, Ellen L. Petticrew, Barry P. Booth</p>\r\n\r\nUnderstanding of upstream and downstream dynamics of continental river basins demands attention to the influence of important tributaries and watersheds. This is exemplified by the 47,200 km<sup>2</sup> Nechako Watershed, the second largest sub-watershed of British Columbia’s Fraser River Basin. Although the Nechako (derived from the Indigenous Dakelh word meaning “big river”) is recognised for its ecological, societal and cultural importance, attention to this sub-watershed has often been overshadowed by a focus on the iconic Fraser River. This paper examines insights from a purposeful response to this gap, whereby a team of researchers has worked together to strengthen understanding of cumulative stressors and changes in the Nechako, focusing on climate change and water security, sediment sources and quality, and health and well-being dynamics within the Nechako Watershed. Lessons learned from a decade of this collaboration are presented, reflecting on the Nechako Watershed’s past, present, and future through the lens of a unique case study of interdisciplinary research. Emerging research and knowledge exchange partnerships are highlighted along with growing concerns for the Nechako’s keystone aquatic species including three species of Pacific salmon and the endangered Nechako white sturgeon. Drawing on the natural, social and health sciences, we examine strengths and challenges of connecting research across interrelated watershed security issues ranging from climate change, landcover disturbances (e.g., wildfires, mountain pine beetle outbreaks and forest harvesting), land use changes (e.g., expansion of Vanderhoof’s agricultural belt), and the far-reaching impacts of the damming of the Nechako River mainstem in the 1950’s. Our paper brings necessary attention to these and other influences on waterways, landscapes and communities of the Nechako Watershed, highlighting new research opportunities arising among diverse knowledges and disciplines, and the ongoing collaborative effort required to address emerging challenges for the Nechako and wider Fraser River Basin, with consequences for current and future generations.","author":"Margot W. Parkes","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"a625bc07a71ac0a321533e9f9f262fddb5ef1f879bf86d03744a38a131b897ea","category":"Environment"}