{"title":"Youngest Paris-Roubaix rider in 86 years Josh Tarling misses the cut off, rides solo to the velodrome","link":"https://www.cyclingtips.com/2023/04/youngest-paris-roubaix-rider-in-86-years-josh-tarling-misses-the-cut-off-rides-solo-to-the-velodrome/","date":1681116718000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1480974969.jpg?width=1200\" alt=\"Youngest Paris-Roubaix rider in 86 years Josh Tarling misses the cut off, rides solo to the velodrome\" /></figure><p>ROUBAIX, France (VN) — Nothing could stop Josh Tarling from getting to the Roubaix velodrome Sunday, not even a crash, two punctures, and a 120km solo ride.</p>\n<p>When the 19-year-old Ineos Grenadiers rider rolled out from Compiègne in the morning, he became the youngest rider in 86 years to ride the “Hell of the North.” He was the youngest rider since Paul Botquint took part in the 1937 event — he finished the 255km event just over seven minutes down on the winner.</p>\n<p>For Tarling, it was a slightly more tumultuous affair that saw him battling back from misfortune on several occasions. As the waiting journalists stood in the center of the Roubaix velodrome, it was unclear if he would make it.</p>\n<p>Riders continued to trickle onto the track, finishing in ones and twos with mud and relief on their faces. Eventually, Tarling rolled in and someone shouted “he’s here” as the Welshman began the lap and a half that would conclude his first Paris-Roubaix experience.</p>\n<p>In the end, Tarling would miss the time cut by just a few minutes and he was the last rider to cross the line with 37 riders pulling out of the race before the finish for a variety of reasons. It seems cruel after such a battle to not even register a time, but that is the history of the “Hell of the North.”</p>\n<p>“It was last man standing. It’s always hard, isn’t it,” Tarling said when asked how his ride had compared to his expectations in the morning. “My girlfriend would have shouted at me if I didn’t make it here. It’s Roubaix, you have to finish Roubaix.”</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/20230409_172901-scaled-1340x789.jpg?width=730\" alt=\"Josh Tarling at the finish of Paris-Roubaix\" width=\"1340\" height=\"789\" /><figcaption><span>Josh Tarling at the finish of Paris-Roubaix</span> (Photo: Sadhbh O’Shea)</figcaption></figure>\n<p>Tarling’s day started quite well and he worked to position his more experienced teammates onto the cobbles. Filippo Ganna was a pre-race favorite and it was important to make sure that the Italian was in the right places when the race hit the pavé.</p>\n<p>As they often do at Paris-Roubaix, things turned on their head very quickly and Tarling soon found himself at the other end of the race when he slid out on a corner and took his teammate Luke Rowe with him.</p>\n<p>Further mechanical problems further set him back and he was left to ride the final 120 kilometers alone, but he continued to plug on, determined to make it to the velodrome. While he looked largely unscathed by his crash, he was clearly exhausted by his efforts and his answers came in slow, laconic bursts.</p>\n<p>“It was long, but that’s what makes it so prestigious,” he said. “We led on the first two sectors and then I crashed with Luke, I got back to the front group with [Kasper] Asgreen and then I had two punctures, and I was on my own for about 120k. It was just a long day.”</p>\n<p>Though he didn’t make the time cut, Tarling can now classify himself as a Paris-Roubaix finisher, aged just 19. He will be hoping that his next experience of the “Hell of the North” will go a little better, but making it to the velodrome is nothing to be sniffed at.</p>\n<p>“100 percent,” Tarling replied when asked if it had been worth the effort to make it to the velodrome. “It was super cool, all the crowds were super cool and it was 100 percent worth it to get here. I’m tired, but I can always sleep tonight.”</p>","author":"Sadhbh O'Shea","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a63c1478e334956113deac7e94271ded2b4adeebbc764cee129b657fb6341f80","category":"Cycling"}