{"title":"Gee Atherton is Back with Breathtaking Ridgeline IV, and He’s Headed to Rampage?","link":"https://bikerumor.com/gee-atherton-ridgeline-iv-red-bull-rampage-2023/","date":1694699702000,"content":"<p><img width=\"8192\" height=\"5464\" src=\"https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216.jpg\" alt srcset=\"https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216.jpg 8192w, https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216-297x198.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216-800x534.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216-120x80.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216-768x512.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/09/DG_Gee_Atherton_Ridgeline_IV_The_Dolomites-216-1536x1025.jpg 1536w\" /></p>\n<p>Let’s be honest. Gee Atherton’s crash on the <a href=\"https://bikerumor.com/gee-atherton-shares-raw-crash-footage-from-multiple-angles-in-the-knife-edge/\" target=\"_blank\">Knife Edge</a> was bad enough to make just about anyone think about hanging it up. But once again, Gee Atherton is <a href=\"https://bikerumor.com/gee-atherton-comeback-red-bull-hardline/\" target=\"_blank\">proving he’s not just anybody</a>. Not only has Gee come back from an extremely physically traumatic event, Ridgeline IV proves that Gee’s mental game is back as well. </p>\n\n\n\n<h2>Gee Atherton at Red Bull Rampage</h2>\n\n\n\n<p>Filming is one thing, but it’s also been announced that Gee will also be competing at the 17th Edition of the Red Bull Rampage. Gee scored a Wildcard Invite to replace Brandon Semenuk who won’t be able to attend due to scheduling conflicts. This year’s event returns to the 2022 site just outside Virgin, Utah. This is the same spot that hosted the event from 2008 to 2013, and the location of Zink’s 360 off the Oakley Icon Sender in 2010, and Kelly McGarry’s incredible backflip over the 72-foot road gap in 2013. </p>\n\n\n\n<p>Wondering how to watch the 2023 Red Bull Rampage? Viewers outside of the U.S. will be able to catch all the action on Red Bull TV. For us here in the States, we’ll have to catch it on ESPN+.</p>\n\n\n\n<h2>2023 Red Bull Rampage Athletes</h2>\n\n\n\n<p><strong>Pre-qualified athletes:</strong></p>\n\n\n\n<ol>\n<li>Szymon Godziek (POL)</li>\n\n\n\n<li>Reed Boggs (USA)</li>\n\n\n\n<li>Thomas Genon (BEL)</li>\n\n\n\n<li>Carson Storch (USA)</li>\n</ol>\n\n\n\n<p><strong>Wildcard invites:</strong></p>\n\n\n\n<ol>\n<li>Adolf Silva (SPA)</li>\n\n\n\n<li>Alex Volokhov (CAN)</li>\n\n\n\n<li>Bienvenido Aguado Alba (SPA)</li>\n\n\n\n<li>Brendan Fairclough (GBR)</li>\n\n\n\n<li>Cam Zink (USA)</li>\n\n\n\n<li>Clemens Kaudela (AUT)</li>\n\n\n\n<li>DJ Brandt (USA)</li>\n\n\n\n<li>Emil Johansson (SWE)</li>\n\n\n\n<li>Jaxson Riddle (USA)</li>\n\n\n\n<li>Kurt Sorge (CAN)</li>\n\n\n\n<li>Kyle Strait (USA)</li>\n\n\n\n<li>Talus Turk (USA)</li>\n\n\n\n<li>Tom Van Steenbergen (USA)</li>\n\n\n\n<li>Gee Atherton (UK)</li>\n</ol>\n\n\n\n<h3>From Atherton Racing:</h3>\n\n\n\n<p><em>Gee Atherton releases the latest spectacular edit in the Ridgeline Series</em></p>\n\n\n\n<p>“Since the first hour of the first build for the original Ridgeline film it’s been the dream to take this concept to the most amazing places around the world. The potential to find awesome, remote mountain ranges where we can test ourselves to the limit…to really explore what’s possible on a bike and how to film the most stunning footage … it’s been like a running commentary throughout the entire project” Gee Atherton </p>\n\n\n\n<p>This film differs from its predecessors in that the team “didn’t move a rock”. It was about exploring with friends, an adventure into the mountains, where Gee would ride whatever they found, including some of the most unforgiving terrain of the series so far. And there’s pedalling, even if it’s at racing speed and inches from a ravine … </p>\n\n\n\n<p>Work started back in June with a site recce where it quickly became apparent to the team that they were “out mountained”. There was no way to shortcut long hikes up the mountain that may or may not lead to discovering a cool little section of singletrack with the kind of surrounding aspect that would make for a great shot. Long days in knee-deep snow were followed by nights poring over IGM maps and trying to fit in as much sleep and fuel as possible before another dawn rendez-vous…</p>\n\n\n\n<p>Filming took place this August in noticeably less hostile weather conditions, but access to riding spots involved four-hour hikes, roped climbs, ladders and abseils. The team were burdened with camera equipment, drones, food supplies and Gee’s bike, broken down to frame, bars and wheels in order to share the load. It was physically and mentally the most demanding week of the series so far, where a sense of adventure and genuine concern for their own survival drove the team onwards in search of some of the most incredible scenes they have ever filmed.</p>\n\n\n\n<p>Gee said that from the start he knew that he’d film this edit on board the Atherton AM.170, “It’s tough enough to withstand being bounced off cliff walls as it is hauled up a cliff on a rope, lighter to hike up the mountain than my DH bike, it pedals super-well and is “enough bike” to tackle every inch of the steep and rocky terrain.”</p>\n\n\n\n<p>He was accompanied by “right hand man” Jamie Robertson and photographer Dan Griffiths ( Moonhead Media) who have both been with the project from the beginning but in such perilous terrain they also involved  Brodie Hood a high altitude and adventure specialist. Brodie is one of the few filmers to fly drones to the top of Everest, an experienced climber and member of the Lochaber Mountain rescue team. </p>\n\n\n\n<p>Weirdly one of the most difficult aspects for the team to manage was that throughout the long days on the mountain they started to become numb to the exposure and to lose that “life-preserving fear” On day one of filming Gee would inch his way along an super-exposed track but by day three he was sprinting as if there wasn’t an 800 foot drop just inches to his left. Brodie and his fellow camera man Matt McCormick from Paddy Graham’s “Legs of Steel” Production crew brought a deep knowledge of the mountains that kept the team on the straight and narrow. </p>\n\n\n\n<p> As Gee put it “Having Brodie with us kept us alive! But it also meant that we could say yes to things that we wouldn’t have tackled alone… There’s a sequence at the end of the film where I ride down a ridge at sunset – it’s absolutely stunning, but it was so steep and exposed and the potential consequences were huge. Dan and Jamie had both been with me for the “Knife Edge” filming and its aftermath so I could see that they were really torn about encouraging me to work near the edge of the cliff, but Brodie devised a harness system that meant that I could practise controlling my speed while he let out the tension until I got comfortable. The section of the film where I’m riding the slowest, picking my way down the ridge was actually the most demanding of all. </p>\n\n\n\n<p>Gee summed up the trip by saying “Going to places that are bigger than us, where we have to perform at our absolute best is always cool – I think we’ve shown the potential to take this project global and I already can’t wait for what’s next.” </p>\n\n\n\n<p><em>In association with Atherton Bikes, Red Bull, FSA, and Prologo. </em></p>\n\n\n\n<p><a href=\"https://www.athertonbikes.com/bike/enduro-170.html\"><em>athertonbikes.com</em></a></p>\n<p>The post <a href=\"https://bikerumor.com/gee-atherton-ridgeline-iv-red-bull-rampage-2023/\">Gee Atherton is Back with Breathtaking Ridgeline IV, and He’s Headed to Rampage?</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Zach Overholt","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"a63efcc662f725357ae9a9560fa26f6381d09985be2bba43693d99593d05feee","category":"Cycling"}