{"title":"2021 Women’s Cycling Transfers To Watch","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-women-s-cycling-transfers-to-watch","date":1628768591000,"content":"\n      <p><span>It’s that time again, you’re finally accustomed to seeing your favourite riders in their team kit for this season, and bam! Another outfit change. The transfer season is cycling’s equivalent of musical chairs, people chop and change as some teams have a budget increase to sign more top riders, while others are forced to let their superstars go on to bigger and better contracts.</span></p>\n<div></div>\n<p><span></span><span>Despite some big races still to come in the 2021 season, team managers are always looking ahead at the next few years, intricately planning their rosters and keeping their eyes open for the next big talent. It’s not uncommon for riders to be approached almost a year in advance, with negotiations sometimes taking months to resolve.</span></p>\n<p><span>Teams such as Rally Cycling, Cofidis and Uno-X have announced their intentions of becoming women’s WorldTeams in 2022, making the most of the new UCI rule change that has recently come into force. Prior to 2021, a new team had to spend one year as Continental before making the jump to WorldTeam, with Jumbo Visma doing exactly that this year. Now, however, with 15 available licenses for WorldTeams on the women’s side, the UCI will allow new teams to apply for WorldTeam status straight away.</span></p>\n<p><span>That said, there’s plenty of changes to come in the women's WorldTour peloton as more teams are in the fight for the best riders. Here’s a few of the most interesting signings that have been announced so far:</span></p>\n<h4><b>Hannah Barnes / Canyon - SRAM Racing to Uno X</b></h4>\n<p><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327637443_1024x1024.jpg?v=1628757730\" /></span></em><span>After six years with Canyon, it was recently announced that former British national champion Hannah Barnes has signed for Uno X. The Norwegian team are launching their women’s programme in 2022 and have announced Barnes as one of the team leaders for the coming seasons.</span></p>\n<p><span>The British rider turned professional with UnitedHealthcare in 2014 and has an impressive palmarès, including wins in the Giro d’Italia Donne and Setmana Ciclista Valenciana. Although she has the ability to climb well, Barnes is also suited to the Classics and has had top-10 finishes at Omloop Het Nieuwsblad, Gent-Wevelgem and Liège-Bastogne-Liège. She could be described as an all rounder: not a pure sprinter or climber, but a rider who can excel on a multitude of terrain.</span></p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related – Women's WorldTour Calendar</a></em></strong></span></p>\n<p><span>“She will lead and guide the way as an experienced rider,” wrote Uno X when announcing the signing of Barnes. The leadership role could be exactly what she needs to have a successful season next year. At Canyon-SRAM, Barnes is normally in a support role for the team’s sprinters, or established climbers like Kasia Niewiadoma, but it looks like Uno X have a plan to build support around the British rider.</span></p>\n<p><span>Barnes has had a difficult season in 2021, expecting to go to the Tokyo Olympics with Lizzie Deignan, but eventually missing out on selection due to injury. She hasn’t secured an individual race win since 2018, despite showing the form to do so. It seems that a fresh start and opportunity to lead a team is a great choice for Barnes, and we’re excited to see what she will do in 2022.</span></p>\n<h4><b>Hannah Ludwig / Canyon - SRAM Racing to Uno X</b></h4>\n<p><span>Joining Barnes at Uno X will be her current Canyon-SRAM team-mate Hannah Ludwig. The young German rider joined Canyon in 2019 after some impressive results in the junior ranks, including a 2nd place in the junior European ITT Championships. Since then, she’s been learning the ropes of the WorldTour peloton but has got some big results along the way, winning the U23 ITT championships two years running.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1324885773_1024x1024.jpg?v=1628757111\" /></span></p>\n<p><span>The 21-year-old finished among the top climbers in Setmana Ciclista Valenciana earlier this season, showing impressive maturity in her riding style for someone so young. Ludwig seemed to be developing well with Canyon-SRAM, so her move to Uno X is slightly surprising. It could be that the German rider expects to get more leadership opportunities in her new team. She’s signed until 2023, so has two years to find her feet with Uno X. It will be interesting to see if her string of good results continues under the management of Uno X’s Director Sportif and former pro, Lars Bak.</span></p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related: \"We can change the culture of the sport\" – Iris Slappendel interview</a></em></strong></span></p>\n<h4><b>Lotte Kopecky / Liv Racing to SD Worx</b></h4>\n<p><span>Kopecky’s signing to SD Worx was, unusually, announced before the transfer window. In women’s cycling, unlike the men’s side of the sport, there is no official rule stating when transfers can be announced, but they are still not normally made public until later in the season. Perhaps SD Worx were simply too excited to announce Kopecky as part of the team for next year, and we don’t blame them. The Belgian rider is an exceptional talent with huge potential.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1324515433_4887ab84-427e-45ac-a9c2-8bf1d902e5f7_1024x1024.jpg?v=1628756825\" /></span></p>\n<p><span>She has only finished outside the top-10 on three occasions in the entire season so far, and that’s after 22 race days. Her consistency is largely unmatched in the peloton. If Kopecky starts a race, she will always attempt to win. She goes well on punchy, classic terrain, but also can climb strongly, proven in her 4th place at the Olympic Road Race. Currently riding for Liv Racing, Kopecky has shown excellent tactical nous this year, often getting results despite being the only one of her team-mates left in the front bunch.</span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance\">Related: Women's WorldTeam Salaries: a delicate balance</a></em></strong></p>\n<p>SD Worx have signed the Belgian to strengthen their roster for the Classics, and we expect her to do well again in the early part of the season next year. However, Kopecky is used to being a leader and rarely has to work for her team-mates, spending the last few seasons on smaller teams where she has been the strongest rider. Being part of SD Worx will be a completely different experience, as they have a number of big names. It’s going to be interesting to see how Kopecky adapts to this and how team manager Danny Stam organisers a team who will all want a shot at going for the win.</p>\n<h4><b>Grace Brown / BikeExchange to FDJ Nouvelle-Aquitaine Futuroscope</b></h4>\n<p><span>Australian rider Grace Brown has enjoyed a standout year on BikeExchange and she’s one of the most exciting riders in the women’s peloton. She won the first stage of the Vuelta Burgos Feminas and finished 2nd in semi-classic Nokere Koerse, proving her versatility. Backing this up with a 4th in the Olympic Games ITT, it seems there really isn’t anything Brown can’t do. We often expect to see her animating the front of races, never content with leaving things down to a bunch kick.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1319048552_4406192c-f2fd-4ae0-a34b-d98c060c7367_1024x1024.jpg?v=1628756856\" /></span></p>\n<p><span>FDJ Team manager Stephen Delcourt summed up Brown’s eye-catching racing style perfectly in the team’s press release: \"[Brown] represents everything there is to love about cycling: boldness, pushing limits, dedication,” he said. “In modern cycling, few cyclists dare to let their instincts express themselves as a priority, but Grace is one of them.”</span></p>\n<p><span>Riding alongside the likes of Cecile Uttrup Ludwig and Evita Muzic who also have an attacking style, it looks like Brown will fit well into the French outfit. FDJ are building a very strong team for 2022 and could be set to rival the dominance of SD Worx next season. Delcourt has been vocal about the team’s aim to win the first women’s Tour de France, and Brown looks like she could be a crucial part of the team’s journey to the yellow jersey.</span></p>\n<h4><strong>Leah Thomas / Movistar to Trek Segafredo</strong></h4>\n<p>After just one year with Movistar, Trek Segafredo have announced that Leah Thomas will join them for the 2022 season. The team stated that they had been in talks with the American rider last year, but didn’t have space available on their roster. With Ruth Winder, one of their star riders, set to retire at the end of this season, though, Thomas was a perfect choice to fill her shoes.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327105431_1024x1024.jpg?v=1628768308\" />Thomas has won the Tour of Scotland and Tour de Feminin, proving she has the ability to take victory on occasions when she can ride for her own result. She also is a formidable teammate, often in a support role for Annemiek van Vleuten at Movistar. Finishing 3rd in the American ITT Championships earlier this year, Thomas excels in time trial discipline and has stated she wants to refocus on this in 2022. </p>\n<p><span>Winners of the Team Time Trial at the Giro Donne, getting time trial abilities dialled is an important part of Trek’s approach to racing, one that looks like it will suit Leah Thomas well over the next two seasons she’ll spend with the team.</span></p>\n<h4><b>Susanne Andersen / Team DSM to Uno X</b></h4>\n<p><span>Norwegian rider Susanne Andersen is set to return to a team from her home country, leaving Team DSM to ride for Uno X. After a stellar season as a junior rider, Andersen is yet to secure her first professional win after 5 years in the professional ranks. But she is usually on lead-out duty for Team DSM’s star sprinter, Lorena Wiebes.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1325424169_1024x1024.jpg?v=1628757205\" />Andersen does a fantastic job on lead-outs and often holds on for a podium finish herself, having a strong sprint come the end of a race. Uno X noted the Norwegian rider’s ambition in their press release, something that makes us think she might not have been happy to continue to sacrifice her own chances at victory, often her role on Team DSM. Uno X are yet to sign any other established sprinters, so it looks like this could be Andersen’s chance to have her own lead-out squad, rather than doing the job herself. </span></p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-cyclists-alliance-new-three-step-mentor-program\">Related: The Cyclist's Alliance new three-step mentor programme</a></em></strong></span></p>\n<h4><b>Retiring</b></h4>\n<p><span>Next season will be very different without Anna van der Breggen in the women’s peloton. After an incredible career, she will move into a Director Sportif role at SD Worx in 2022, meaning this is her last season racing. SD Worx sprinter Jolien d’Hoore also will retire at the end of this year, perhaps a rider who Lotte Kopecky has been signed to replace. Karol-Ann Canuel is another SD Worx rider who will retire after this year.</span></p>\n<p><span>Trek Segafredo's Ruth Winder also has announced that this will be her last season racing, as have FDJ’s Lauren Kitchen and BikeExchange’s Janneke Ensing.</span></p>\n<p><em><span>Cover photo: Sean Hardy</span></em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a642a3f6099b97282ff3acae37167155deaa4e17dec40418d518876c39c5a76f","category":"Cycling"}