{"title":"A perspective on solar railway potential for the UK","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14488?af=R","date":1729136919000,"content":"<h2>Abstract</h2>\n<p>In the face of climate change challenges, energy demand is still increasing, and renewable energy is becoming increasingly necessary as a sustainable resource. Solar energy stands out as a promising renewable resource, yet its widespread adoption faces challenges, notably the substantial land requirements for photovoltaic (PV) panels. This conflict intensifies as land could be more efficiently utilized for agriculture and development. Conversely, railway infrastructure occupies expansive tracts of land, presenting an opportunity to integrate PV panels without disrupting rail operations. However, a comprehensive assessment of the solar potential along railway tracks on a national scale is lacking for different countries and the UK is one of them. This study addresses this gap by evaluating the feasibility of installing PV panels on railway tracks throughout the UK to generate electricity. Utilizing mathematical models tailored to five distinct solar panel technologies, the study incorporates various factors, including solar radiation levels across different months. Assumptions were made where necessary, with values for certain variables averaged to facilitate calculations. The findings reveal that solar energy harnessed from railways could satisfy up to 8% of the UK's total electricity demand, with a minimum contribution of 0.3%. This study provides valuable insights from a UK-centric perspective and offers a replicable framework for similar assessments in other countries with extensive railway networks, such as China and India. By leveraging existing infrastructure for renewable energy generation, such initiatives could contribute significantly to global sustainability efforts.</p>","author":"M. Braima, \nT. E. Butt, \nM. A. Maraqa, \nS. Goodhew, \nS. Sundaram, \nM. M. A. Mohamed","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"a644b1697671b7ef00901f215ad422995d419cecdbe0a51f21f162a249df77ff","category":"Environment"}