{"title":"Delayed Intra-operative Spinal Cord Monitoring Events in Paediatric and Young Adult Spinal Deformity Patients","link":"https://www.preprints.org/manuscript/202407.1948/v1","date":1721836339000,"content":"Introduction \nDelayed intra-operative neuro-monitoring (IOM) events can be defined as loss of responses, after baseline traces were present upon completion of instrumentation and deformity correction. This study reports this subgroup of events, assesses their incidence and evaluates potential causative factors. \nMethods\nWe reviewed 1881 consecutive patients who underwent spinal deformity correction between 2011 and 2021. Surgeries were performed using a standardised anaesthetic regimen and multimodal IOM protocol.\nResults\n44 patients (2.4%) had an IOM event. 9 patients (6F:3M) had a true positive delayed event after posterior segmental pedicle screw instrumentation. Mean age was 12.5 (2-17) years with mean thoracic Cobb angle of 78° (51-94°). Mean estimated blood loss was 28%. Titanium beam shaped rods were utilised in 3 patients and 5.5mm titanium rods in 5 patients. Motor evoked potentials were lost on average 18 (10-30) minutes after completion of instrumentation. 7 patients had bilateral loss and 2 patients had unilateral loss of MEP traces. Sensory evoked potential amplitude was preserved in all cases. There was a transient latency shift in one patient. MEPs returned within 20 minutes of rod release. The rod was re-contoured to incorporate more scoliosis in 1 patient. 2 patients had beam rods exchanged to 5.5mm titanium rods. 6 patients had rod removal with retention of pedicle screws and staged completion of instrumentation at mean 5 (1-7) days later. No patients had a postoperative neurological deficit.\nConclusion\nDelayed IOM loss represented 15% of all events. Increased cord tension and hypo-perfusion were considered likely mechanisms. Rod release restored MEPs in all cases. The timing of events emphasises the importance of continued monitoring for minimum 30 minutes after completion of spinal instrumentation or until wound closure.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a65a229611624cdde32e7d0e9e17d738eb0eac0984af573481e9a37ce723b250","category":"Interdisciplinary"}