{"title":"Instrumental Analysis of Aquatic Organic Pollutants and Its Association with the Spread of Multi-drug Resistant Bacteria","link":"https://www.preprints.org/manuscript/202404.1198/v1","date":1713420605000,"content":"The eutrophication of open water bodies, especially in coastal water area, has received intensive public focuses in recent years. Biological treatment of organic pollutants in industrial and domestic wastewater requires microbial flora to participate. The environmental impact of these microbes, particularly in regard to the spread of antibiotic resistance genes and pathogenicity in coastal water, remains largely unknown. We initiate studies to examine antibiotic resistance genes (ARGs) in microbial flora and study the mode of antibiotic spread in the coastal waters of Bohai Bay, North China by using high performance liquid chromatography-mass spectrum analysis and quantitative polymerase chain reaction. The metabolic features of bacteria related to the presence of ARGs in the coastal area showed the enrichment of Pseudomonadale species with triple resistance properties (ampicillin, kanamycin and gentamycin) at the estuary site locating adjacent to a coastal sewage treatment plant where both type I and type II polyketide synthase genes and b-lactam type antibiotics are detected. Pseudomonadale order is phylogenetically belonged to Proteobacteria Phylum, Gamma-proteobacteria Class and contains Pseudomonadaceae family and Pseudomonas genus. QPCR analysis suggests that the percent occupation of Pseudomonadale species to total Proteobacteria in the examined stations is close to several sampling stations close to sewage treatment plants, where consistent release of organic wastes occurred.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a67730fd68de05c0aa3e1db8e783d9a78af9882be544de7195cc5148e11ee1ff","category":"Interdisciplinary"}