{"title":"Economic contribution of U.S. aquaculture farms","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13091?af=R","date":1723104591000,"content":"<h2>Abstract</h2>\n<p>Economics is the study of the allocation of scarce resources to meet human wants and needs and has a critical role to play in addressing challenges related to environmental sustainability, community resilience, and food security. In the context of aquaculture, the key to such a discussion is understanding the linkages of aquaculture farming businesses with other economic sectors and how policy decisions that affect aquaculture result in economic ripples throughout local, regional, and national economies. The only previous national estimates of the economic contributions of U.S. aquaculture are nearly 30 years old. The current study was based on comprehensive data from detailed farm-level surveys (that captured 77% of the total value of U.S. aquaculture) supplemented by information from publications on the remaining aquaculture sectors. The economic contributions measured in this study were limited to those at the farm level and do not include subsequent impacts that occur as farmed products move through processing, distribution, food service, and retail sectors in the U.S. economy. Results showed that U.S. aquaculture farms contributed $4 billion annually and supported more than 22,000 jobs each year. Labor income and value-added contributions were $1 billion and $3 billion, respectively. Analysis of the linkages of U.S. aquaculture production activities with other economic sectors showed that nearly all (96%) economic sectors were supported to some degree by U.S. aquaculture farms. Foodfish farms generated the greatest contributions, followed by mollusk farms. Freshwater aquaculture farms contributed twice that of the contributions of marine aquaculture because of the greater size of the freshwater aquaculture sector. Growth of both freshwater and marine sectors would increase overall contributions to the economy. Constraints to growth of aquaculture include regulatory barriers that have restricted existing sectors from meeting current demand for their products. The lack of an adequate regulatory framework for offshore marine aquaculture has constrained its growth and development, especially with respect to the rest of the world. Streamlined regulations implemented in a more timely and efficient manner could result in substantially greater economic contributions from existing U.S. aquaculture farms. The total economic impact of U.S. aquaculture production is likely three to four times greater than the farm-level impacts estimated in this study as a result of impacts that occur as aquaculture products move downstream through various marketing channels. Additional research is needed to measure the impacts of U.S. aquaculture products in the processing, distribution, food service, supermarket, and restaurant levels of the marketing chain to fully capture the total economic contributions from U.S. aquaculture.</p>","author":"Ganesh Kumar, \nShraddha Hegde, \nJonathan van Senten, \nCarole Engle, \nNoah Boldt, \nMatthew Parker, \nKwamena Quagrainie, \nBenedict Posadas, \nFrank Asche, \nMadan Dey, \nSuja Aarattuthodi, \nLuke A. Roy, \nRussell Grice, \nQuentin Fong, \nMichael Schwarz","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"a678f1be46245124e4706cd0f79ee38c5683187a8a70216bdaf40b85dab0aa85","category":"Environment"}