{"title":"Ergonomic Analysis of Working Postures Using OWAS In Scaffold Activities and Recommendations at Refinery Construction","link":"https://www.preprints.org/manuscript/202405.0809/v1","date":1715579038000,"content":"Workers involved in scaffolding erection and dismantling activities are exposed to various physical risk factors. However, no existing study indicates that awkward working postures in scaffolding activities lead to musculoskeletal system disorders (MSDs). This study explores the ergonomic risks intrinsic to scaffolding tasks in refinery construction using the Ovako Working Posture Analysing System (OWAS).In the refinery, the utilized scaffolding encompasses an area of 319674 square meters and a volumetric extent of 603294 cubic meters. Observations were conducted on the postures of 500 scaffolding group workers across 5210 locations within the site, culminating in capturing 2000 photographic records. The mass of each scaffolding component was meticulously determined. After three months of observation, medical records were consulted for further insights. A statistical analysis employing the Pearson correlation technique was conducted to scrutinize the relationship between the ages of the scaffolding workers and the incidence of MSDs, alongside patterns of absenteeism. This analysis elucidated a robust and statistically significant correlation between the age of the workers and the prevalence of MSD associated with their occupational activities.As a result of the results of the OWAS ergonomic risk assessment, a number of regulatory changes were made to the scaffolding workforce, and then medical records were looked over again. This re-evaluation revealed a marked reduction in MSDs. The OWAS method's reliance on simple observational techniques holds substantial merit for its application within construction environments. Our research underscores the exposure of workers engaged in scaffolding tasks within continuous projects, such as refinery construction, to substantial ergonomic risks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a67858e49abeece2058f1beedda1cb12b082d537a8a9f5b22aef5d7b198c66d0","category":"Interdisciplinary"}