{"title":"The Impact of Ultra-Low Temperature Quenching Treatment on the Pore Structure of Natural Quartz Sand","link":"https://www.preprints.org/manuscript/202410.0805/v1","date":1728557756000,"content":"The effective removal of impurities from natural quartz is a very challenging subject, but there is no relevant study on the mesoscopic structure of quartz sand particles, and there is still a lack of direct evidence on the structure-activity relationship between mesoscopic structure and purification effect. In this paper, the effects of calcination temperature, calcination time, quenching frequency and grinding frequency on the formation of mesoscopic fractures in natural quartz sand were studied, and a linear regression model was established by fractal and differential methods. The results show that the cracked structure of quartz sand and its variation law have remarkable fractal characteristics, and thermal expansion and phase transformation are the main factors affecting the cracked structure and specific surface area of quartz sand. The non-phase change thermal expansion results in the formation of semi-closed wedge-shaped fractures in the open fractures of quartz sand, resulting in a significant decrease in the specific surface area of the cracked sand. On the contrary, the phase change expansion is conducive to the generation of more Me10 mesoporous fractures and the increase of the specific surface area of cracked sand. In addition, thermal stress and mechanical force are more likely to form Me50 and Me10 mesoporous cracks, where the average proportion of Me50 is higher than 75%. Based on this, the linear regression model between the fractal dimension and the pore volume distribution, SBET is further established, and the correlation coefficient R2 is mostly above 96%. In addition to offering insightful findings for the investigation of the structure-activity relationship between the purification effect and the mesoscopic structure of quartz sand, this also establishes the groundwork for the advancement of high purification technology for natural quartz sand.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a67e4ae3cce8f443e474c4da7ae9e64793f6790a0fe8622d79bbc867f6ae305e","category":"Interdisciplinary"}