{"title":"A new lineage nomenclature to aid genomic surveillance of dengue virus","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002834","date":1726495200000,"content":"<p>by Verity Hill, Sara Cleemput, James Siqueira Pereira, Robert J. Gifford, Vagner Fonseca, Houriiyah Tegally, Anderson F. Brito, Gabriela Ribeiro, Vinicius Carius de Souza, Isabela Carvalho Brcko, Igor Santana Ribeiro, Iago Trezena Tavares De Lima, Svetoslav Nanev Slavov, Sandra Coccuzzo Sampaio, Maria Carolina Elias, Vi Thuy Tran, Duong Thi Hue Kien, Tuyen Huynh, Sophie Yacoub, Idrissa Dieng, Richard Salvato, Gabriel Luz Wallau, Tatiana S. Gregianini, Fernanda M. S. Godinho, Chantal B. F. Vogels, Mallery I. Breban, Mariana Leguia, Suraj Jagtap, Rahul Roy, Chanditha Hapuarachchi, Gaspary Mwanyika, Marta Giovanetti, Luiz C. J. Alcantara, Nuno R. Faria, Christine V. F. Carrington, Kathryn A. Hanley, Edward C. Holmes, Wim Dumon, Alex Ranieri Jerônimo Lima, Tulio de Oliveira, Nathan D. Grubaugh</p>\r\n\r\nDengue virus (DENV) is currently causing epidemics of unprecedented scope in endemic settings and expanding to new geographical areas. It is therefore critical to track this virus using genomic surveillance. However, the complex patterns of viral genomic diversity make it challenging to use the existing genotype classification system. Here, we propose adding 2 sub-genotypic levels of virus classification, named major and minor lineages. These lineages have high thresholds for phylogenetic distance and clade size, rendering them stable between phylogenetic studies. We present an assignment tool to show that the proposed lineages are useful for regional, national, and subnational discussions of relevant DENV diversity. Moreover, the proposed lineages are robust to classification using partial genome sequences. We provide a standardized neutral descriptor of DENV diversity with which we can identify and track lineages of potential epidemiological and/or clinical importance. Information about our lineage system, including methods to assign lineages to sequence data and propose new lineages, can be found at: dengue-lineages.org.","author":"Verity Hill","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"a6934e443112090b20ce1fe62d600903e0b9a1ca7fcad2d18a5c09b51ff6072f","category":"Environment"}