{"title":"PSLBII-12 Cloning and analysis of target-specific CRISPR RNA and screening primers to create β-lactoglobulin knock-out goat fibroblast cell lines for nuclear transfer","link":"https://academic.oup.com/jas/article/102/Supplement_3/659/7757877?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Goat milk and meat are primary or additional source of income for small farmers in large parts of the world. Goat farming is increasing in southeastern United States, due to influx of ethnic populations. Goat milk is rich in health promoting nutrients compared with other livestock milk; however, its consumption results in allergenicity in humans due to presence of β-lactoglobulin protein in milk. Although some efforts have been made to eliminate allergenicity by modifying β-lactoglobulin gene, especially in Chinese goats, more research is needed to make it a reality. The objective of this study was to design, clone and characterize CRISPR RNA (crRNA) in a plasmid vector containing Cas 9 expression cassette as well as design and analyze PCR primers for efficient screening of edited genomes as a prelude to create and analyze β-lactoglobulin knock-out goats. Three crRNAs, two from exon 1 and one from exon 2 of goat β-lactoglobulin gene with 5 base hangovers were designed and cloned individually in GeneArt CRISPR Nuclease plasmid Vector. Sequence analysis of selected plasmid clones using U 6 promoter primer, upstream of the crRNA insert, confirmed that at least 3 clones of each crRNA had the right sequence. Additionally, 4 sets (forward and reverse) of primers to amplify 4 loci in β-lactoglobulin gene flanking the crRNA sequences in goat genome were designed. PCR amplification using genomic DNA isolated from goat blood as well as goat skin fibroblasts (GSF) confirmed expected single bands of 655, 812, 502 and 437 bps with respective primer sets. Transfection of 3 crRNA clones in GSF cells and their analysis for site-specific genome modification is in progress. In conclusion, we have designed, cloned, and tested crRNA in a plasmid vector along with 4 sets of PCR primers to screen for edited genomes which will be useful to create β-lactoglobulin edited goats to eliminate milk allergenicity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a6942027cafb4c47033ca9b701a443803e76c9f47c3fba51dbfa6fa351104b41","category":"Environment"}