{"title":"Growing UX Maturity: Finding A UX Champion And Demonstrating ROI (Part 1)","link":"https://smashingmagazine.com/2021/03/growing-ux-maturity-in-organizations-part-1/","date":1615557600000,"content":"<p>UX maturity is the presence and level of sophistication of UX in an organization. Organizational maturity goes beyond the skills of the individuals composing the UX roles on various teams, to the UX processes, philosophies, and tools underpinning the organization’s product development and business practices. As Chapman and Plewes (2014) state,</p>\n<blockquote><p>“Achieving great UX design is not just a function or talent of <strong>individuals</strong>, it is an organizational characteristic.”</p></blockquote>\n\n<p>Knowing this, means we must strive to understand and grow the maturity of UX practice within the organizations and product teams we work with. Simply being good at our own jobs isn’t enough. As UX practitioners, we are advocates and educators of our craft within the organizations we work for or with.</p>\n<p><strong>Note</strong>: <em>This article is the first in a three-part series covering six tactics UX practitioners and managers can adopt to facilitate the growth of UX maturity at their organization.</em></p>\n<p>Let’s take a quick look at the six tactics we’ll be covering and their relationship to UX maturity:</p>\n<ol>\n<li><a href=\"#tactic-1\"><strong>Finding and utilizing UX Champions</strong></a>\nBeginning stages: the UX champion will plant seeds and open doors for growing UX in an organization.</li>\n<li><a href=\"#tactic-2\"><strong>Demonstrating the ROI/value of UX</strong></a>\nBeginning stages justify more investment, later stages to justify continued investment.</li>\n<li><strong>Knowledge sharing/Documenting what UX work has been done</strong> (<a href=\"https://www.smashingmagazine.com/2021/03/growing-ux-maturity-in-organizations-part-2/\">Go to Part 2 →</a>)\nLess relevant/possible in the earliest stages of maturity when there is little UX being done. Creates a foundation and then serves to maintain institutional knowledge even when individuals leave or change roles.</li>\n<li><strong>Mentoring</strong> (<a href=\"https://www.smashingmagazine.com/2021/03/growing-ux-maturity-in-organizations-part-2/\">Go to Part 2 →</a>)\nMiddle and later stages of maturity. Grow individual skills in a two way direction that also exposes more people to UX and improves the knowledge transfer of more senior UX, should lead to a shared understanding of how UX looks and is implemented in the organization.</li>\n<li><strong>Education of UX staff on UX tools and specific areas of UX expertise</strong> (<em>coming up in Part 3</em>)\nAll stages of maturity require continued education of UX staff.</li>\n<li><strong>Education of non-UX staff on UX principles and processes</strong> (<em>coming up in Part 3</em>)\nAll stages of maturity benefit from education of non-UX staff.</li>\n</ol>\n<p>These tactics don’t build on the prior tactics — you can and should implement multiple tactics simultaneously. However, some tactics (e.g. mentoring) might not be possible in an organization with low UX maturity that lacks the support for a mentoring program.</p>\n<p><strong>UX is a skill</strong>, it can be practiced, grown, and improved. It can also languish and atrophy if not appropriately exercised. This is true for individuals and organizations. An organization’s UX maturity level impacts all aspects of how UX is prioritized and implemented throughout the organization and its products.</p>\n<p>If we wish to meaningfully improve our UX practice, it is critical we look for opportunities to help grow the maturity of UX across our organization. We face a larger challenge when it comes to growing UX in a way that has impact across an organization than we do with growing our own UX skills.</p>\n<p>In this article, I’ll briefly discuss some of the existing models you can use to provide a framework for thinking about an organization’s UX maturity. I’ll then explore two specific tactics for UX practitioners to make an impact to <strong>help grow UX maturity</strong> within their organizations when they are in the early stages of UX Maturity.</p>\n<h3>Defining UX Maturity</h3>\n<p>We don’t have one agreed upon model of what UX maturity looks like at different stages. Natalie Hanson has a <a href=\"https://nataliehanson.com/2017/02/13/ux-maturity-models/\">blog post</a> providing a collection and discussion of various UX Maturity models up to the point it was published in 2017.</p>\n<p>Chapman and Plewes define <strong>five stages of organizational UX Maturity</strong> from “Beginning” which is essentially no UX, to “Exceptional” where UX has been fully integrated into the business processes, resources are plentiful, leadership understands the value of UX and how it works, and the organization’s culture is supportive and promotes UX.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c1fb603e-d85f-4a91-8f3d-0b18202d7cc0/4-ux-maturity-organizations-part-1.png\" /></p>\n<p>Most of us probably work for organizations with some level of UX Maturity, meaning beyond Stage 1 where there are no resources. However, it’s also possible some of us work in organizations at the beginning or awareness stages. If you are in this situation, you might find yourself frustrated with the lack of support and understanding of UX within your organization and product teams. We should push to move our organizations and colleagues further along this UX maturity continuum if we wish for UX to grow as a field, increase opportunities to bring our peers into the fold, and ultimately to provide the <strong>best experiences for end users</strong> of the products or services our organizations offer.</p>\n<p>Frameworks and models are helpful for understanding how researchers and professionals have observed UX maturity growing in organizations. They allow us to understand where we are and where we are headed, if we create a strategy to get there. We need to <strong>move beyond theory</strong> and into the application of specific tactics if we want to push our organization to  grow in UX maturity. I’ll present two tactics for demonstrating the value of UX and documenting progress of UX in an organization that will help grow UX maturity in the section below.</p>\n<h3>What Can We Do To Grow Our Organization’s UX Maturity: Two Tactics</h3>\n<p>It can feel frustrating trying to make change in large organizations. Here are some tactics UX practitioners can consider applying to their situation. These two tactics are especially helpful for organizations with less mature UX, and more opportunity to grow:</p>\n<ul>\n    <li><a href=\"#tactic-1\">Finding and utilizing UX Champions</a>,</li>\n    <li><a href=\"#tactic-2\">Demonstrating the ROI/value of UX</a>.</li>\n</ul>\n\n<p>These tactics are meant to create a broad impact across the organization and plant the seeds of UX in potentially fertile fields. I’ll tie them back to Chapman and Plewes factors composing the stages of UX Maturity as relevant within the discussion of the specific tactic.</p>\n<h4>Tactic 1: Finding And Utilizing UX Champions</h4>\n\n<p>Champions are people who enthusiastically support the growth of an innovation or idea within an organization. Researchers have long found <a href=\"https://www.researchgate.net/profile/Christine_Shea4/publication/223761301_Champions_of_Product_Innovations_Defining_Developing_and_Validating_a_Measure_of_Champion_Behavior/links/59d779e9a6fdcc52acae7498/Champions-of-Product-Innovations-Defining-Developing-and-Validating-a-Measure-of-Champion-Behavior.pdf\">champions are a critical component of overcoming social and political barriers to innovation within organizations</a>. I would argue you cannot move a large organization out of Chapman and Plewes stage 1 without having a set of Champions. Champions do not need to be experts or practitioners of UX. However, we need to identify the correct people, in the right positions of power, who can advocate for UX as a concept, advocate growing UX, and push for UX resources in the form of budget and roles, if we wish to grow UX in organizations with low levels of UX maturity.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/87631e99-84a7-4ffe-8bc1-7539f9b3d4f9/5-ux-maturity-organizations-part-1.jpg\" /></p>\n<p>Effective champions display the following types of behaviors according to some researchers:</p>\n<ul>\n<li><a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.967.2440&amp;rep=rep1&amp;type=pdf\">Pursuing the idea</a></li>\n<li><a href=\"https://www.researchgate.net/profile/Christine_Shea4/publication/223761301_Champions_of_Product_Innovations_Defining_Developing_and_Validating_a_Measure_of_Champion_Behavior/links/59d779e9a6fdcc52acae7498/Champions-of-Product-Innovations-Defining-Developing-and-Validating-a-Measure-of-Champion-Behavior.pdf\">Expressing enthusiasm and confidence about the success of the innovation/idea</a></li>\n<li>Persisting under adversity</li>\n<li>Getting the right people involved</li>\n<li>Building networks</li>\n<li>Taking responsibility</li>\n</ul>\n<p>I’d add to these behaviors that champions need to be well educated on the idea or innovation (in this case UX) in order to maximize effectiveness. We cannot expect a champion to effectively convey the value of UX and to identify opportunities to get the right people involved if they do not have an understanding of how UX processes work, how to integrate them into existing processes, and what basic outputs and outcomes of UX work are expected. We are responsible for providing this education through conversation, examples, and providing resources supporting the champion in their learning.</p>\n<p>We can tie champions back to Chapman and Plewes factors of Leadership and Culture, as well as potentially the Timing of UX factor:</p>\n<ul>\n<li>Champions should be in a position to <strong>influence leadership and culture</strong> over time;</li>\n<li>Champions should be able to <strong>identify and advocate</strong> for the proper time to insert UX into existing process.</li>\n</ul>\n<p>Champions usually play this role in an <a href=\"https://web.njit.edu/~chakraba/champion-cmr.pdf\">informal capacity</a>. This makes sense when we think about an organization at the fledgling stage of implementing UX — it is unlikely you would immediately go from having little to no UX, to hiring a specific role for championing the cause. Champions therefore are promoting UX in the course of their other everyday activities.</p>\n<p>As a UX practitioner, your goal is to find the champions within your organization, educate them on the role and value of UX, provide them with real life examples of how UX is making a difference, and work with them to identify the opportunities to insert UX into other products or processes within an organization.</p>\n<p>We need to be purposeful when we look to <strong>invest time</strong> cultivating a champion. You can answer these questions when looking to identify and work with a champion:</p>\n<blockquote><p>Who are people willing to spend time and energy on ideas they believe in?<br /><br />Who might be most receptive to UX working on a product or service they are in charge of?<br /><br />Who has the ability to create and maintain networks?\n- Who would see an almost immediate benefit to having UX improve their product?<br /><br />Who has been expressing dissatisfaction with current design and development processes?<br /><br />Who can you develop a good and ongoing relationship with?<br /><br />Who believes in the organization or product and continuously pushes for both to grow and improve?</p></blockquote>\n\n<p>You can pick and choose which of these questions might apply most to the situations you are trying to find a champion, or you could use these questions as filters, start with the largest list of potential champions you can think of, then remove names when they don’t meet the qualifications. Your remaining names are the people you can pursue to become UX champions within your organization.</p>\n<h4>Case Study: Finding And Utilizing A UX Champion At A Large International Logistics Company</h4>\n<p>You might think it is a fairly daunting task to quickly identify an effective champion within your organization. This case study will show the opposite can be true. Within one month, I was able to identify UX champions in an organization I’d never worked with. Within three months, the champions had created meaningful change, identified more opportunities than we could handle with the resources we had, and set the course for a bright future for UX within the organization.</p>\n<p>A major logistics company serves as the example for this case study. The company had familiarity with UX and CX, even espousing that it was transforming itself into a customer first organization. Unfortunately, these words were not reflected in the <strong>UX integration</strong> throughout the company.</p>\n<p>I would classify the organization at Chapman and Plewes adopting stage in some products, however, it was clear other products or projects were only at the awareness stage (stage 2) in that there were no UX processes. This includes the project I was assigned to when I joined as a consultant. There were scattered products receiving some UX attention — one off efforts being run by small UX teams focusing on addressing <strong>key issues</strong> brought up by major clients. There was some legacy of having UX in the past, however, after many years of UX work being done in various pockets of the organization, there was still no true UX process identifiable across the company, UX was not required for products or workstreams, and when budgets contracted, UX titles were some for the first to be eliminated.</p>\n<p>The company was undergoing a complete backend technology transformation in order to move it’s many disparate entities onto the same technology platforms. When I became involved, I was brought in to see how to infuse UX into the process. I knew this was going to be challenging, as the ways of working had already been defined and the focus was on getting things quickly to production, with developers also doing the design based on requirements created by large groups of product owners and managers.</p>\n<p>I began by listening. I sat in on meetings for different groups involved in the project. I interviewed many client stakeholders to understand some of their habits and how we could integrate UX into the current ways of working. I mapped out relationships between products, projects, people, and outcomes/goals. There was a huge appetite for the UX work, but much less appetite to incorporate the process into the already break-neck pace of the development underway. We worked to find ways to contribute to the current development efforts through testing, and found we were able to get a foothold into some of the key areas the effort was focusing on.</p>\n<p>Specifically, what we did was take on a UX research and design project with a product owner who we’d identified as key to having as a champion during our preliminary interviews with stakeholders. This champion was ideal because they were highly motivated, well connected with people in powerful positions across the company, and perhaps most importantly, had a product that was <strong>key to the success</strong> of the endeavor and was in a position to immediately have us start conducting research that would lead to design.</p>\n<p>I want to note here that the champion was not an executive level employee. They did not have the power to make people do things just because they told them to. This champion had all of the traits referenced in research on the role of an innovation champion:</p>\n<ul>\n<li><strong>Pursuing The Idea</strong><br />Our champion traveled, spent time in meetings and workshops, reached out to countless others, educated themself, and spent time outside of their typical duties in order to push for UX to grow in the organization.</li>\n<li><strong>Expressing Enthusiasm And Confidence About The Success Of The Innovation/Idea</strong><br />Our champion maintained a positive attitude and was able to readjust without giving at multiple points during our time there.</li>\n<li><strong>Persisting Under Adversity</strong><br />The general conditions on the ground were adverse to UX — with the focus on production. However, there were other mountains that were in the way that our champion needed to overcome. One specific example was that there was immediate and then constant pushback from colleagues on the ability for the product to incorporate research and redesign. This was relentless, however our champion did not let it stop them.</li>\n<li><strong>Getting The Right People Involved</strong><br />Our champion was well connected and knew how to get the right people involved. They had been in the organization for a decade and had a stellar reputation. For example, they knew the right executives and could get them to attend meetings to make a statement on the need for UX, when they were facing the adversity referenced in the bullet above.</li>\n<li><strong>Building Networks</strong><br />Our champion introduced us to key people, set up meetings between people across products and teams, and had the ability to get the right people to network without the need of being present in every meeting themself.</li>\n<li><strong>Taking Responsibility</strong><br />Our champion assigned and delegated tasks as needed, but they also took it upon themselves to review all work, spend time learning UX processes and value, and advocate for UX.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/345cbef3-e1ca-4b44-b234-5e4c5ba58ff0/6-ux-maturity-organizations-part-1.jpg\" /></p>\n<p>This case study highlights the power and importance of a UX champion in growing UX in an organization. Thanks to the presence of our champion, we used our foothold to gain the ear of key executives as well as many champions who were able to advocate a need to “walk the talk” on saying we were customer focused. This allowed UX to define some key processes and contribute to the broader group.</p>\n<p>While our work there did not last beyond the end of this key workstream, when we left there had been an established library of reports, a defined process for UX to integrate with building technology, and a philosophy shift that not only did the words customer focused need to be stated, but the actions of <strong>customer-focused behavior</strong> needed to be reflected in what was being done.</p>\n<p>Additionally, the champion had secured a new UX resource as a permanent hire for their product, they had a backlog of UX projects to complete, and had created a larger network of UX practitioners across the organization than had previously existed.</p>\n<h4>Tactic 2: Demonstrating The ROI/Value Of UX</h4>\n\n<p>As UX practitioners, we often focus on the value our work provides through the lens of a more satisfactory, efficient, or enjoyable experience. We take pride in meeting our users’ needs.</p>\n<p>However, we work in settings where decisions are scrutinized based on their impact to the bottom line of profit and loss. We avoid reality if we don’t acknowledge the need to justify UX based on the return on investment a business or organization can expect. However, ROI can be more than a monetary calculation, with other metrics and key performance indicators useful for <strong>showing how UX impacts</strong> an organization or product.</p>\n<p>Nielsen Norman Group notes ROI encourages buy-in, which is key for growing UX in organizations less familiar with the value UX work brings. NNG also states there are <a href=\"https://www.nngroup.com/articles/three-myths-roi-ux/\">three myths</a> that tend to prevent us from moving forward with calculating UX:</p>\n<ul>\n<li>The ROI of UX is all about money;</li>\n<li>The ROI of UX has to be perfectly accurate;</li>\n<li>The ROI of UX has to account for every detail.</li>\n</ul>\n<p>You will need work to overcome these myths as they might exist within your organization as you start to measure UX ROI if you want to start increasing buy in for UX.</p>\n<p>You can use a number of different metrics to show ROI, as NNG notes, it isn’t limited to money. Your product and industry might best dictate what metrics or key performance indicators tell the story of the ROI of improving UX. Yes, if you design for an e-commerce site, increasing conversion and sales will be a story you’d want to tell. But this tale might focus on <strong>additional metrics</strong> such as speed to completing a task, cart abandonment, or ratings on an app store or review platform.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ea0c2093-48ba-423c-bb0f-8c70d887c1b8/1-ux-maturity-organizations-part-1.jpg\" /></p>\n<p>I do believe many executives, across industries, are looking for the financial benefit of the decisions they make. We do need to present a business case for anything we propose that will cost money or resources such as time, training, and tools.</p>\n<p>At face value return of investment is the increase in value or profit (return) an investment (in this case adding UX resources to a product) divided by cost (investment) in that resource (budget, UX software subscriptions, UX training, etc.). There isn’t a magic number, but you can assume you’d like the final number to be greater than 1, suggesting a <strong>positive return</strong> on the investment. You can potentially consider many items as part of what goes into the cost and return, depending on the product.</p>\n<p>Anders Hoff provides a <a href=\"https://www.smashingmagazine.com/2011/06/free-website-roi-calculator-google-spreadsheet/\">website roi calculator</a>. Human Factors International provides <a href=\"https://humanfactors.com/hfi_new/coolstuff/roi.asp\">six different calculators</a> depending on what you are trying to measure, from increased conversion to increased productivity, to reduced costs on formal training and reduced learning curve and more.</p>\n<p>Moving beyond the specific monetary return requires deeper research and/or collecting analytical data. You will use these metrics to tailor your conversation on the need to grow UX to a specific audience that might. In other words, for some of these metrics you might benefit from being currently low or less than desirable, as they bolster your case for improving an experience to <strong>enhance the return</strong>.</p>\n<p>Many product teams do collect analytics, even if they aren’t invested in UX, as this has become industry standard and easy to do. However, if you don’t know how to use these analytics, or haven’t had upfront conversations about what to collect, you’ll need to connect with the people in charge of collecting and reporting analytics to ensure the data you need will be available.</p>\n<ul>\n<li><p><strong>Finding information/navigating a site or application</strong><br />How long does it take a user to go through a typical workflow? Do they encounter errors? Do they drop before reaching a critical destination, but after starting down the path?</p>\n</li>\n<li><p><strong>Ratings on app store or industry rating platforms</strong><br />How are users rating the current experience? What qualitative information are they providing to support their ratings? Does any of this tie back to UX or would any of it be addressed with improved UX.</p>\n</li>\n<li><p><strong>Use/time spent</strong><br />Overall visits or time spent on an app or using your site. If you provide information or an experience that needs people to focus and pay attention this might be a number that is low and you think go up. However, if you are providing a way to apply for goods and services, or do something like pay a utility bill, you might want to focus on how time spent could be reduced as a good return for users.</p>\n</li>\n<li><p><strong>Service/support calls and the frequent topic of calls</strong><br />How frequently does your support receive calls or emails related to usability issues, or issues that could be easily resolved with an improved UX? My experience has suggested confusing login credentials and inability to self service basic account issues online are frequent reasons people contact support. These are UX issues with a direct cost — and most companies know the cost of their support center calls. How much would you save by reducing these calls with better UX?</p>\n</li>\n</ul>\n<p>These are all examples of ways you can communicate ROI to your stakeholders, as part of a justification to grow UX in your organization. You need to determine what metric might speak clearest to the audience you are hoping to sway.</p>\n<h4>Case Study: Demonstrating ROI/Value Of UX At A Medical Insurance Provider</h4>\n<p>A large medical insurance provider had acquired a number of small providers over the past decade. Each of these separate companies had different systems their agents used. The company undertook and effort to shift all agents onto the same, new to everyone, platform.</p>\n<p>The company planned the <strong>rollout in phases</strong> focusing on geographic regions. Initially, the company had no UX roles or processes, and they did not intend to account for any UX in their budget. Independent agents who were part of the first phase immediately stopped running policies through this provider. Exclusive agents flooded the call center with cries for help, needing to be walked through basic everyday tasks such as running quotes and binding policies. The provider pushed pause on subsequent releases while they determined how to best move forward.</p>\n<p>I was brought in, along with my colleagues, to form a usability workstream on this project. However, we knew that budget was tight and we would need to show our value. We immediately engaged end users in a series of interviews and usability testing. From there, we made design recommendations, from small tweaks to major overhauls. Some of them were adopted, others were not considered feasible. The project moved on to release the usability fixes to the phase one agents, and into the subsequent phases of release.</p>\n<p>The project leadership had to request any <strong>future budget for UX</strong> on the project from an executive committee. Project leadership knew what was meaningful to convince executives UX was making an impact, and therefore had a positive return on investment. We had a workshop with project leaders to determine key metrics. We landed on user satisfaction, calls to the call center requesting assistance, number of quotes run, and many other industry specific methods.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a6ec79a9-a927-4482-bfe6-f972d048ab86/2-ux-maturity-organizations-part-1.jpg\" /></p>\n<p>I need to note the importance of collecting benchmark metrics here. For example, We weren't able to speak to the increase or decrease in the number of quotes run, because this metric wasn’t being purposefully tracked during phase one. However, we set a line in the sand and from that point forward we created a benchmark that could then be compared in future updates and releases.</p>\n<p><strong>Using a combination</strong> of user surveys, interviews, and data analytics, we were able to create the case that phase 1 users had the lowest satisfaction, but was trending upward, with the recipients of the UX improved phase 2 showing higher initial satisfaction, that UX was making an impact on reducing calls to the call center, and as noted we started purposefully documenting specific analytics. Project leadership presented these findings to the executive committee as part of their ask for continued funding — which was approved.</p>\n<p>Fast forwarding a few years, UX remained onboard the project, with <strong>a budget for testing</strong> and revising designs prior to release, and was touted as a must have part of any future projects and digital products.</p>\n<h3>Conclusion</h3>\n<p>We all stand to benefit from increasing awareness and growing UX maturity in our organizations or on the product teams we work with. As practitioners, we are responsible for advocating UX to others.</p>\n<p>I’ve presented two tactics that are especially potent in less mature UX organizations, however, they could be useful in any organization — especially larger ones where UX might be more robust on some products or projects (and almost unknown on others). The tactics highlight the need to <strong>choose the right people</strong> to be persuasive in your organization and <strong>use data</strong> in supporting our arguments for UX to play an expanded role.</p>\n<p>The <a href=\"https://www.smashingmagazine.com/2021/03/growing-ux-maturity-in-organizations-part-2/\">next article</a> in this series will explore internal processes we can take to document and share UX work that has occurred, and mentorship needed to take UX maturity to higher levels. The final article will discuss education of both staff with UX roles and staff who do not have UX roles.</p>\n<p><strong>Author Note:</strong> <em>I want to thank my colleague Dana Daniels for assistance with background research on UX maturity models.</em></p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"a697458975fe92c5c5afcf15469c9f67490dde6f1018cc8c8a4935e128c86b89","category":"Tech"}