{"title":"5 ways pro mountain bikes are different from yours","link":"https://www.bikeradar.com/features/5-ways-pro-mountain-bikes-are-different-from-yours/","date":1695315650000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/AM9A8836-Edit-285f332.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Bernard Kerr's Prototype Pivot Phoenix at Hardline\" title=\"Bernard Kerr's Prototype Pivot Phoenix at Hardline\" />                                            <p>No matter how much you upgrade or tune your mountain bike, the chances are you’ll never have a bike like the professionals.</p>\n<p>Even with the deepest pockets, you’d be hard-pressed to procure the parts many pros use, from custom-tuned kit to prototype tech unreleased to the public.</p>\n<p>While we may never get our hands on the tech used by professionals, it doesn’t make it any less covetous.</p>\n<p>Here are five things that separate professional bikes from their showroom counterparts.</p>\n\n<h2>1. Suspension setup</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Matt Walker's Saracen Myst DH bike at Fort William\" title=\"Matt Walker's Saracen Myst DH bike at Fort William\" />\n\n</div><div><figcaption><span><i></i> Perfectly set up suspension is key to finding grip on downhill courses.</span></figcaption><span></span></div>\n<p>Many of us could only dream of having our suspension precisely set up for the trail we’re riding, rather than just <a href=\"https://www.bikeradar.com/advice/workshop/how-to-set-up-your-mountain-bike-suspension-video-guides-to-help-you-get-the-most-from-your-bike/\">setting it up</a> and forgetting about it when we buy a new bike.</p>\n<p>Professional riders have access to a variety of technical data that enables them to tune their bikes for the best possible performance on a specific race track.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jordan Williams' Specialized Demo DH bike\" title=\"2023080Jordan Williams' Specialized Demo DH bike4ftbillRadar 0002\" />\n\n</div><div><figcaption><span><i></i> Professional riders can rely on experienced engineers to set up their suspension correctly.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>They are also lucky enough to have access to mechanics and suspension engineers. Not only do the mechanics set up their suspension for them, but also employ their specialist knowledge to minimise friction by modifying parts and using specialist lubricants suited to certain conditions.</p>\n<p>Professional riders are able to test out various setups to see which offers the best traction and impact protection on the trails.</p>\n<p>This is especially the case in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/downhill-mountain-biking-explained/\">downhil racing</a>, where riders have dedicated mechanics who swap out coils, change air-can tunes and use telematic data to decipher where more grip can be achieved on the run.</p>\n<p>Spring rates on coil shocks can be difficult and expensive to fine-tune for us amateurs because the entire spring needs to be replaced each time a stiffer or softer setup is needed. The costs can soon add up when trialling different setups, or even setting the correct sag.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"YT Capra MX Core 4 full suspension mountain mullet bike\" title=\"YT Capra MX Core 4 Fox Float X2 Factory shock\" />\n\n</div><div><figcaption><span><i></i> Air shocks are a lot more tuneable than coil shocks but suffer from stiction.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>This is one of the reasons store-bought bikes come equipped with air shocks. Air shocks only require a shock pump to adjust and can be set up for a wide range of weights right on the shop floor.</p>\n<p>However, there are other reasons riders may choose between <a href=\"https://www.bikeradar.com/advice/buyers-guides/coil-vs-air/\">coil shocks and air shocks</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vali Höll's Trek Session downhill mountain bike for the 2022 UCI MTB World Championships in Les Gets, France\" title=\"Vali Höll's Trek Session downhill mountain bike for the 2022 UCI MTB World Championships in Les Gets, France\" />\n\n</div><div><figcaption><span><i></i> Some riders won’t be able to pick and choose their suspension setups.</span></figcaption><span> <i>Jack Tennyson / Our Media</i></span></div>\n<p>Professional riders are often contractually obliged to use only products supplied by their sponsors. So, depending on who is supplying their suspension, you may be able to match or even surpass their setups with off-the-shelf components.</p>\n<p>Either way, having a team of suspension specialists who will calibrate your bike to each track you ride is certainly out of the question for most people.</p>\n<h2>2. Lead weights</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Myriam Nicole at UCI World Championship\" title=\"Myriam Nicole at UCI World Championship\" />\n\n</div><div><figcaption><span><i></i> Lighter isn’t always faster.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>One thing burned into the collective mindset of all riders is the need to shave grams off your bike, with many of us searching for the lightest components, from the cockpit to the drivetrain.</p>\n<p>However, many pro racers have started adding strategically positioned weights to their <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\">downhill bikes</a> with the intention of improving the ratio of sprung to unsprung weight.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The latest Saracen Myst Team 29 comes with the new Fox 40 Factory forks, not the Fox 49 Factory on our older test bike.\" title=\"Saracen Myst Team 29 front end\" />\n\n</div><div><figcaption><span><i></i> Extra weight is not a problem if you don’t have to pedal to the top of the hill.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>Unsprung mass is the weight of the components that move with the undulations of the ground and aren’t supported by the suspension.</p>\n<p>Components that make up unsprung mass include the wheels, fork lowers, brake discs, brake calipers, and the derailleur and cassette on bikes with a traditional drivetrain.</p>\n<p>Conversely, the sprung mass of the bike is any weight that is isolated from the ground (or ‘suspended’) by suspension, consisting of the front triangle of the frame, the cranks and pedals, and the cockpit and fork uppers.</p>\n<p> </p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Thore Hemmerling at UCI World Championship Downhill\" title=\"Thore Hemmerling at UCI World Championship Downhill\" />\n\n</div><div><figcaption><span><i></i> A higher ratio will lead to smoother suspension through rough sections.</span></figcaption><span> <i>Andy Buchanan / Getty Images</i></span></div>\n<p>Increasing the ratio of sprung to unsprung weight makes the suspension work more effectively, improving traction and reducing rider fatigue.</p>\n<p>If you’ve ever ridden an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bike</a>, you will probably have noticed the stability and smoother ride on rough terrain, owing to the extra sprung mass from the weight of the battery and motor.</p>\n<p>Increasing rider weight doesn’t affect this ratio, because the rider is not connected rigidly to the bike. The rider still has to support their weight and use the muscles in their arms and legs to absorb inputs transmitted to them through the bike.</p>\n<p>The weights added to professional bikes are usually low down by the bottom bracket, to keep the centre of gravity of the bike low, aiding stability.</p>\n<p>If you’re a privateer downhill racer, then taping extra weight to your down tube may be a cheap way of finding extra time on steep, rough tracks.</p>\n<h2>3. Data acquisition</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lenzerheide Downhill Bike Tech 2023 Finlay Anderson 6\" title=\"Lenzerheide Downhill Bike Tech 2023 Finlay Anderson 6\" />\n\n</div><div><figcaption><span><i></i> Loïc Bruni’s prototype Specialized Demo has been spotted with an array of wires and sensors.</span></figcaption><span></span></div>\n<p>One of the main differences between professional and amateur bikes is the level of research that goes into setting the bikes up.</p>\n<p>Many casual riders will set their bikes up as close as possible to the parameters recommended by manufacturers, focusing mostly on sag settings and rebound.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The Shockwiz system was acquired by SRAM this summer and promises better suspension set-up through science\" title=\"shock-wiz-1474951130986-1f9rl1xf89uwm-da26418\" />\n\n</div><div><figcaption><span><i></i> Telematics data has been monitored for a few years now.</span></figcaption><span> <i>Courtesy</i></span></div>\n<p>Professional bikes are often spotted with an array of telematic sensors to accurately collect data from the bike.</p>\n<p>Sensors on the fork and shock can give mechanics insights into how the suspension should be set up. Riders run practice laps with the software recording their every move in order to eke out performance from their bike on specific tracks.</p>\n<p>Suspension movement isn’t the only measure recorded, with brake pressure also monitored, telling riders where they’re braking and how hard.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Brakeace calliper mounted sensor\" title=\"Brakeace calliper mounted sensor\" />\n\n</div><div><figcaption><span><i></i> BrakeAce measures the forces going through your brakes.</span></figcaption><span> <i>Brakeace</i></span></div>\n<p>Software such as this can be accessed by regular punters through companies such as Dialled Telemetry and sensors such as Quarq’s ShockWiz and BrakeAce PF2. However, professional riders’ secret weapon is their mechanics and suspension engineers, who analyse the data and make changes accordingly.</p>\n<h2>4. Prototype tech</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Gamux Sego prototype DH bike\" title=\"Gamux Sego prototype DH bike\" />\n\n</div>\n<p>Bikes such as the Gamux Sego prototype look a world away from showroom models.Prototype tech is one of the main differences between pro and amateur bikes. While consumer bikes and components aren’t far behind the product cycle, you’ll always be behind the professionals and their prototype tech.</p>\n<p>Downhill racing sees the latest and greatest tech innovations put to the test in the heat of competition.</p>\n<p>Many manufacturers are keen to tease new releases on their bikes, with sponsored riders being the first to receive revolutionary new tech.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lenzerheide Downhill Bike Tech 2023 – prototype Specialized Demo\" title=\"Lenzerheide Downhill Bike Tech 2023 – prototype Specialized Demo\" />\n\n</div><div><figcaption><span><i></i> Specialized has been more reserved with its Demo prototype.</span></figcaption><span> <i>Finlay Anderson / Our Media</i></span></div>\n<p>Sniffing through the pits of a UCI World Cup Downhill event offers a glimpse of the tech we can expect to see trickle down to the consumer market in the next couple of years.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bernard Kerr's PIvot Phoenix prototype DH bike\" title=\"Bernard Kerr's PIvot Phoenix prototype DH bike\" />\n\n</div><div><figcaption><span><i></i> Bernard Kerr’s Pivot Phoenix has been attracting plenty of attention throughout 2023. </span></figcaption><span></span></div>\n<p>Pivot has been kicking up a storm this year, with Bernard Kerr at the helm of its prototype Phoenix, which features a lugged carbon frame not dissimilar to Atherton Bikes.</p>\n<p>This technique enables changes to be made to the frame quickly, during the development process, without spending time creating a new mould for an entire carbon frame.</p>\n<p>Professional riders also get first refusal on production-ready products, with Kyle Strait seen using <a href=\"https://www.bikeradar.com/news/new-rockshox-boxxer-gets-burlier-38mm-stanchions-a-new-spring-and-highlights-from-its-single-crown-fork-range/\">RockShox’s new BoXXer fork</a> before it was released in July.</p>\n<h2>5. Quiet bikes are fast bikes</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Loic Bruni at UCI World Championships\" title=\"Loic Bruni at UCI World Championships\" />\n\n</div><div><figcaption><span><i></i> Pro bikes have to put up with a lot of abuse, so keeping them silent requires a lot of maintenance.</span></figcaption><span> <i>Andy Buchanan / AFP / Getty Images</i></span></div>\n<p>Professional bikes are set up carefully to remove any rattles or clunks that may take the rider’s attention away from the trail below.</p>\n<p>This is achieved through impeccable maintenance, with new components swapped out more regularly than on amateur bikes.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Box Two 7-speed groupset on a VPace Fred 26 downhill mountain bike for young riders on display at the 2022 Malverns Classic\" title=\"Malverns Classic tech 2022\" />\n\n</div><div><figcaption><span><i></i> Race mechanics will go to great lengths to silence the chain and gear cables.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Cables rattling against the frame can also be a leading source of bike noise, with many professional mechanics choosing mastic tape or Velcro tape to reduce noise and friction.</p>\n<p>There are ways of silencing your own bike, though this is a time-consuming process as you search for creaks and clangs, while constantly asking yourself, “What is that noise?”.</p>\n<p>Any silencing you do make will only make the squeaks of your friend’s bike worse on the fire-road climbs, and the squeal of their brakes unbearable on the descents.</p>","author":"Nick Clark","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a699ca70ad4ac82f13581c86cee9b45cfcb22f038a9dd67a50ac6e137287a8da","category":"Cycling"}