{"title":"Report: Apple Developing Custom Batteries for Launch in 2025","link":"https://www.macrumors.com/2023/11/06/apple-developing-custom-batteries-for-2025/","date":1699289888000,"content":"Apple is developing custom batteries with significantly improved performance that it aims to bring to its devices starting in 2025, <a href=\"https://m.etnews.com/20231106000233\"><em>ETNews</em></a> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/macbook-air-spacegray-purple-battery.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nApple's custom battery technology has reportedly been in the works since 2018, with the company actively seeking patents and hiring new personnel related to the project. The company is reportedly seeking to create an \"all-new\" kind of battery with significantly improved performance by becoming directly involved in its use of materials.\r<br />\n\r<br />\nApple is apparently curating the battery's cathode materials to determine its performance, energy density, output, and stability. The battery apparently uses a completely different composition from those that currently exist on the market, adopting a new composition of nickel, cobalt, manganese, and aluminum. \r<br />\n\r<br />\nThe company is considering the use of carbon nanotubes to improve the conductivity of battery materials, delivering better performance from lesser-used battery materials. Apple is also looking to increase its battery's silicon content, replacing graphite to increase capacity, and shorten charging and discharging times.\r<br />\n\r<br />\nThe result is expected to be an innovative battery type that has not yet been commercialized. A source familiar with Apple's plans suggested to <em>ETNews</em> that the Vision Pro headset has dramatically increased the company's need for high-performance batteries. The headset features just two hours of battery life. Other devices such as the Apple Watch and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> have been left with the same \"all-day\" battery life since their introduction.\r<br />\n\r<br />\nApple's custom battery project was reportedly co-developed with the company's <a href=\"https://www.macrumors.com/roundup/apple-car/\">electric vehicle project</a>, but the mobile applications are now the main target for the technology. It is expected to begin being added to Apple devices starting in 2025.<div>Tag: <a href=\"https://www.macrumors.com/guide/etnews-com/\">ETNews</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/06/apple-developing-custom-batteries-for-2025/\">Report: Apple Developing Custom Batteries for Launch in 2025</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-apple-developing-custom-batteries-for-launch-in-2025.2410051/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a69a8af621fbb28e66fbb4e89c2316d78162a1974ac2046ea2fdadf363a39249","category":"Apple"}