{"title":"90 Evaluating water- and feed-based arginine supplementation on newly weaned pig growth and gastrointestinal health","link":"https://academic.oup.com/jas/article/102/Supplement_2/249/7664983?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this experiment was to assess the influence of arginine (Arg) supplementation in water and/or feed on the growth performance and gastrointestinal health of newly weaned pigs. Pigs (n = 240; PIC 337 Χ 1050, Genus, Henderson, TN) were randomly allocated into 80 mixed-sex test pens and subjected to a 2 Χ 4 factorial design, with two levels of Arg supplementation in water (0% or 8% stock, dosed through a 1:128 proportioner) for the first phase (d 0-7), and four dietary arginine levels (0.85, 0.95, 1.05, and 1.15 standardized ileal digestible (SID) Arg to Lysine (Lys) ratios for the first two phases (d 0-7 and 7-21). All treatments were provided a common diet (0.96 SID Arg:Lys) for the last phase d 21- 42. One pig per pen underwent a dual sugar absorption test of lactulose at 500 mg/kg and mannitol at 50 mg/kg of body weight (BW) via gastric tube on d 7 and 21, with blood plasma collected 4 h post-administration. The pig tested on d 7 was subsequently euthanized for intestinal tissue collection. Pen growth performance and feed disappearance were evaluated for 3 phases; d 0-7, 7-21, and 21-42. The statistical analysis utilized generalized linear mixed model methods (SAS 9.4, Cary, NC) with the main effects of SID Arg:Lys in the feed and Arg level within the water, and the interaction between the two. Pen was the experimental unit. Orthogonal contrasts were tested for the linear and quadratic effects of the diet. Growth performance during the 1st period exhibited variability, reflected by negative gain to feed ratio (G:F), caused by health challenges of Rotavirus A. Consequently, data were analyzed separately for each phase. Increasing dietary SID Arg:Lys caused a significant linear effect (improvement; <span>P</span> = 0.04) on final BW (18.47 and 21.90 kg, for 0.85 and 1.15 SID Arg:Lys, respectively). However, discernible differences between dietary treatments were not observed (<span>P</span> &gt; 0.1). Similarly, a trend (<span>P</span> = 0.09) suggested a linear impact of dietary SID Arg:Lys on average daily gain during the third phase (d 21-42). In terms of intestinal absorption and morphology, Arg supplementation, whether through water or diet, had no effect on lactulose and mannitol absorption on both d 7 and d 21, nor did it impact villous height, crypt depth, or the villi:crypt ratio in ileum tissues collected on d 7 post-weaning. In conclusion, dietary supplementation with Arg increased final BW but had no clear impacts on intestinal health within the variables measured, potentially impacted by the rotavirus diagnosis in the first week post wean.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a6a36d6f2bfe3ef611a0b6cbb6ea564a5e3dad10d718ec3e60fc715197221f6a","category":"Environment"}