{"title":"Apple’s iOS 17 adds better autocorrect, journaling, clock-like StandBy, and more","link":"https://arstechnica.com/?p=1944252","date":1685985932000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Apple-WWDC23-iOS-17-iPhone-14-Pro-3-up-230605-1-800x533.jpg\" alt=\"Apple’s iOS 17 adds better autocorrect, journaling, clock-like StandBy, and more\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Apple-WWDC23-iOS-17-iPhone-14-Pro-3-up-230605-1.jpg\">Enlarge</a> (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CUPERTINO, Calif.—As has long been a tradition, Apple publicly announced the key features and other details of the next update to the iPhone's operating system. Apple's Craig Federighi said the new operating system would focus on \"communication, sharing, intelligent input, and new experiences.\"</p>\n<p>Beginning with communication: as a follow-up to iOS 16's customizable lock screens, iPhone users can now customize their own \"contact poster\" that appears on other phones when a call comes in. Posters will appear not just for calls placed via cellular or FaceTime, but with third-party VOIP services like Zoom or Skype as well.</p>\n<p>Apple is also adding features for people who like to leave voicemails—live transcription can render text on your phone as the other person is speaking, so you can decide whether to pick up even if you can't hear or aren't listening to what the person on the other end is saying. And FaceTime callers will be able to leave video messages, too.</p></div><p><a href=\"https://arstechnica.com/?p=1944252#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944252&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a6a3fd7a1164b3c5d8a176c0956c4c4f3de405694edbdaf9f629fb4c799b9251","category":"Tech"}