{"title":"Pre-Ordering Apple Vision Pro: What You Need to Know","link":"https://www.macrumors.com/how-to/apple-vision-pro-pre-order-need-to-know/","date":1705618885000,"content":"Apple has <a href=\"https://www.macrumors.com/2024/01/08/apple-announces-february-2-vision-pro-launch/\">announced</a> that its Vision Pro headset will officially launch in the United States on February 2, and that pre-orders will be open starting Friday, January 19, at 5:00 a.m. Pacific Time. Here's everything you need to know about pre-ordering your unit on Apple's online store.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/vision-pro-headset-1.jpg\" width=\"2698\" height=\"1518\" />\r<br />\n\r<br />\n<h2>When Will Pre-Orders Begin?</h2>\r<br />\nApple Vision Pro is initially launching only in the United States, with pre-orders beginning at 5:00 a.m. Pacific Time on Friday, January 19. For those in other U.S. time zones, here is the full list of pre-order times:\r<br />\n\r<br />\n<ul><li>8:00 a.m. Eastern Time</li>\r<br />\n<li>7:00 a.m. Central Time</li>\r<br />\n<li>6:00 a.m. Mountain Time</li>\r<br />\n<li>5:00 a.m. Pacific Time</li>\r<br />\n<li>4:00 a.m. Alaska Time</li>\r<br />\n<li>3:00 a.m. Hawaii–Aleutian Time</li></ul>\r<br />\n\r<br />\n<h2>Pre-Order Configuration Options</h2>\r<br />\nApple has yet to share full tech specs for the Vision Pro, so only limited details are available in terms of what configuration options you will be able to select during the pre-order process. \r<br />\n\r<br />\nThe headset starts from $3,499, and Apple has so far said the device is equipped with an M2 chip, an all-new R1 chip that processes camera and microphone input, and 256GB of base storage. Apple could offer models with up to 1TB of storage, but the existence of bigger capacities has not yet been confirmed. <em>MacRumors</em> has additionally discovered that the headset is equipped with 16GB of RAM, but this is likely to be a fixed amount of memory in all units. \r<br />\n\r<br />\n<h2>What's in the Box</h2>\r<br />\nApple says customers can expect the Vision Pro packaging to include the following:\r<br />\n<ul>\r<br />\n    <li>Polishing cloth</li>\r<br />\n    <li>Solo Knit Band</li>\r<br />\n    <li>Dual Loop Band</li>\r<br />\n    <li>Light Seal</li>\r<br />\n    <li>Two Light Seal cushions</li>\r<br />\n    <li>Vision Pro cover</li>\r<br />\n    <li>External battery pack</li>\r<br />\n    <li>USB-C charging cable</li>\r<br />\n    <li>Power adapter</li>\r<br />\n</ul>For customers who want to use the headset on the go without pockets or a backpack, Belkin will sell an accessory clip that allows the battery pack to be attached to clothing.\r<br />\n\r<br />\n<h2>Vision Pro Payment Options</h2>\r<br />\nApple customers will be able to purchase the Vision Pro online and at retail stores using Apple Card installments. Typically, Apple Card installments let customers spread the purchase over monthly payments with no interest. Mac and iPhone purchases can be made over 24 monthly payments, for example. \r<br />\n\r<br />\n<h2>Pre-Order Requirements</h2>\r<br />\n<ul>\r<br />\n    <li><b>Face ID Scan</b>: Ensure you have an iPhone or iPad with Face ID available. This is required to scan your face for a custom fit of the Light Seal and headbands.</li>\r<br />\n    <li><b>Apple Store App Update</b>: Update your Apple Store app to the latest version (released January 11) to support Vision Pro face scanning.</li>\r<br />\n</ul>\r<br />\n\r<br />\n<h2>Vision Correction Options</h2>\r<br />\n<ul>\r<br />\n    <li><b>Reading Lenses</b>: For an additional $99, attachable Zeiss readers are available for those with vision correction needs. Assuming no other configuration options are selected, for a Vision Pro with reading lenses, the combined outlay is $3,598.</li>\r<br />\n    <li><b>Prescription Lenses</b>: For $149, Zeiss prescription lenses that magnetically attach to the headset are offered. A valid prescription is required. Assuming no other configuration options are selected, for a Vision Pro with prescription lenses, the combined outlay is $3,648.</li>\r<br />\n    <li><b>Prescription Upload</b>: Post-checkout, you'll need to upload a valid, unexpired prescription from a U.S. eye-care professional. Note that the prescription lens options are only sold online.</li>\r<br />\n    <li><b>Health App Integration</b>: You can <a href=\"https://support.apple.com/en-us/HT213226\">store your vision prescription in the Health app</a> for convenient retrieval.</li>\r<br />\n</ul>\r<br />\n\r<br />\n<h2>Post Pre-Order Demos</h2>\r<br />\nFollowing pre-orders, the Vision Pro will launch in the U.S. on Friday, February 2. Starting at 8 a.m. local time that day, customers are invited to sign up for a demo of the headset at their local Apple Store, with slots to be available through the weekend on a first-come, first-served basis\r<br />\n\r<br />\n<h2>Vision Pro Availability Outside the U.S.</h2>\r<br />\nOrders are limited to the United States for the time being, but Apple is likely to launch the Vision Pro headset outside the U.S. before WWDC 2024 in June, with Canada and the United Kingdom tipped as the first two other countries in which the headset will be available.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Blue-Magenta.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<h2>Further Reading</h2>\r<br />\nFor more detailed insights and updates about the Apple Vision Pro after pre-orders open, stay tuned to our comprehensive Vision Pro coverage. It's also worth checking out our <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">dedicated Apple Vision Pro roundup</a>. The latter provides a deeper dive into the capabilities and features of the device, ensuring you're well-informed before making your purchase.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/apple-vision-pro-pre-order-need-to-know/\">Pre-Ordering Apple Vision Pro: What You Need to Know</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/pre-ordering-apple-vision-pro-what-you-need-to-know.2416727/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a6ac9adb0e4c6e788ac01ed990e8688c39a12e21360ef2938c24b42289a427f9","category":"Apple"}