{"title":"★ App Store: The Schiller Cut","link":"https://daringfireball.net/2021/06/app_store_the_schiller_cut","date":1623084019000,"content":"\n<p>The email evidence<sup><a href=\"#fn1-2021-06-07\">1</a></sup> in the Epic v. Apple trial has offered a cornucopia of insight into Apple’s internal deliberations over the last 14 years. Juicy stuff always comes to light in a big-money trial like this, but the discovery evidence in Epic v. Apple has struck me as particularly juicy.</p>\n\n<p>On the cusp of WWDC 2021, my thoughts remain focused on one in particular — a 28 July 2011 email from Phil Schiller to Steve Jobs and Eddy Cue. (Jobs, at the time, <a href=\"https://daringfireball.net/2011/08/resigned\">was a month away</a> from stepping down as CEO; I don’t know what to make of the fact that Tim Cook wasn’t included on the email.)</p>\n\n<p>The subject of Schiller’s email ostensibly was <a href=\"https://www.wsj.com/articles/BL-TEB-2920\">this Wall Street Journal story</a> positing that HTML5 was a threat to both Adobe Flash and Apple’s App Store. But, really, the email was about the future of the App Store itself. The entire email (from slide 44 of <a href=\"https://www.theverge.com/2021/5/3/22417725/apple-vs-epic-full-trial-slideshows-opening-arguments\">Epic’s Opening Demonstratives</a>:</p>\n\n<blockquote>\n  <p>From: Philip Schiller <br />\nSubject: HTML5 Poses Threat to Flash and the App Store <br />\nTo: Eddy Cue, Steve Jobs <br />\nDate: Thu, 28 Jul 2011 09:27:10-0700</p>\n\n<p>Food for thought:</p>\n\n<p>Do we think our 70/30 split will last forever? While I am a\nstaunch supporter of the 70/30 split and keeping it simple and\nconsistent across our stores, I don’t think that 70/30 will last\nthat unchanged forever. I think someday we will see enough\nchallenge from another platform or web based solutions to want to\nadjust our model (already Google has rolled out a web in app\npurchase model at 95/5).</p>\n\n<p>If someday down the road we will be changing 70/30, then I think\nthe question moves from “if” to “when” and “how”. I’m not\nsuggesting we do anything differently today, only that whenever we\nmake a change we do it from a position of strength rather than\nweakness. That we use any such change to our advantage if\npossible. And thinking about this long in advance can only help to\nlook at an eventual change as an opportunity (with developers,\npress, customers, etc).</p>\n\n<p>Just as one thought, once we are making over $1B a year in profit\nfrom the App Store, is that enough to then think about a model\nwhere we ratchet down from 70/30 to 75/25 or even 80/20 if we can\nmaintain a $1B a year run rate? I know that is controversial, I\njust tee it up as another way to look at the size of the business,\nwhat we want to achieve, and how we stay competitive. Again, just\nfood for thought.</p>\n\n<p><a href=\"https://www.wsj.com/articles/BL-TEB-2920\">https://www.wsj.com/articles/BL-TEB-2920</a></p>\n</blockquote>\n\n<p>This email is simultaneously not surprising — because he’s Phil Schiller, steward of the Apple brand, and because, of course, at some point surely some discussion was had within Apple about the permanence of 70/30 — but also shocking, because, my god, it spells out a game plan that would have kept Apple out of all this.</p>\n\n<p>Apple’s antitrust concerns around the world are almost entirely centered around the App Store. Some of those concerns are not about the 70-30 / 85-15 splits. Some of the concerns are simply about Apple’s total control over the platform — the lack of options for distributing native software from any sources other than the App Store; the fact that Apple can build features like Find My into the operating system while third parties like Tile cannot; the fact that Apple Music is installed by default and Spotify is not, etc. There are <em>some</em> serious complaints that would not go away if Apple were to unilaterally reduce the App Store commission to, say, 80/20 or even 90/10.</p>\n\n<p>But: an <em>awful</em> lot of the complaints about the App Store — legal objections from competitors, regulatory investigations from governments, and developer community frustrations — would not be on the table today if Apple had followed Schiller’s loose plan outlined in this email. A lot of it is about the money.</p>\n\n<p>Apple makes record-shattering amounts of revenue and profit. But they don’t make every bit of money they can from every single opportunity. To do so would be counterproductive — to squeeze too tightly on every possible source of revenue would dent the company’s brand. To name one seemingly inconsequential example: they do not sell t-shirts or other souvenir-type logo paraphernalia in their retail stores, other than at the visitor center at Apple Park. They choose to leave that money on the table.</p>\n\n<p>You cannot place a dollar value on many essential aspects of any company’s business. What is the Apple logo worth? Think about that. I’m not being coy to state flatly that the Apple logo is invaluable. It is literally priceless. The Apple logo means something very important to the company, but no dollar value can be placed on it. And they could squander some of that value by overusing (or misusing) it.</p>\n\n<p>The App Store, though, feels more and more like the one area of the company where they’ve committed to squeezing as much money as they can out of it. The damage this has caused to Apple’s third-party developer relations is immense.</p>\n\n<p>During Tim Cook’s testimony a few weeks ago, the most strident questions he faced came not from Epic’s attorneys (who, quite frankly, did not seem to have a coherent game plan) but from Judge Yvonne Gonzalez Rogers, who throughout the trial seemed rightly focused on App Store rules I’ve long objected to — anti-steering provisions. These are the rules that forbid apps from telling users they can sign up for accounts (or buy e-books or other digital content) at the company’s website. The <a href=\"https://daringfireball.net/2020/07/parsing_cooks_opening_statement\">rules against explaining the rules</a>, as I like to put it.</p>\n\n<p>But <a href=\"https://www.cnbc.com/2021/05/21/apple-ceo-tim-cook-testifies-in-epic-games-trial.html\">Gonzales Rogers also pointed to a survey suggesting 39 percent of developers are either “somewhat” or “very” unsatisfied with the App Store</a>:</p>\n\n<blockquote>\n  <p>Rogers also expressed doubt that Apple’s Small Business Program,\nwhich cut App Store fees in half for small developers, was made\nout of concern for small businesses during the Covid pandemic,\nas Cook testified on Friday. “That seemed to be the result of\nthe pressure accrued because of investigations, of lawsuits,”\nRogers said.</p>\n\n<p>Cook said that lawsuits were in the back of his head, but\nwhat triggered the program was worry over small businesses\nduring Covid.</p>\n\n<p>Rogers remarked that she had seen a survey that 39% of Apple\ndevelopers are dissatisfied with the App Store. “It doesn’t seem\nto me that you feel any pressure or competition to actually change\nthe manner in which you act to address the concerns of\ndevelopers,” Rogers said.</p>\n\n<p>Cook disagreed and said that Apple “turns the place upside down\nfor developers.”</p>\n</blockquote>\n\n<p>Most developers I know think that the only thing Apple turns upside down for developers is the proverbial couch, out of which Apple seemingly wants to shake every last nickel of spare change it can.</p>\n\n<p>Apple’s platforms have never been for <em>every developer</em>. (The closest, perhaps, was the Apple II era.) But post-Macintosh, for a certain type of developer, Apple’s platforms were <em>the show</em>. The big leagues. I stole that <a href=\"https://inessential.com/2002/09/19/why_i_develop_for_mac_os_x\">from a post by my friend</a> and <a href=\"https://daringfireball.net/search/vesper\">colleague</a> Brent Simmons:</p>\n\n<blockquote>\n  <p>I don’t think Joel is wrong about anything he says. It’s true, for\ninstance, that “if your Windows product appeals to 1 in 100\nWindows users, you have to appeal to 25 in 100 Mac users to make\nthe same amount of money.”</p>\n\n<p>On the other hand, it’s still true that if Joel sells 10,000\ncopies to <em>Windows</em> users of a $100 app, he makes the same\namount of money as I do if I sell 10,000 copies to <em>Mac</em> users\nof a $100 app.</p>\n\n<p>But whatever.</p>\n\n<p>One of the reasons I develop for OS X is that, when it comes to\nuser interface, this is the big leagues, this is <em>the show</em>.\nThat’s probably what Joel would call an “emotional appeal” — and\nto call it that, that’s fine by me.</p>\n</blockquote>\n\n<p>Brent wrote that 19 years ago.</p>\n\n<p>I’m talking about the sort of developer who, back then, chose to write Mac-exclusive software in the years when the Mac was languishing, or even during the rebound years of the early OS X era, when the Mac market was growing again but still small compared to Windows or the universal platform of the web.</p>\n\n<p>The sort of developers who today would prefer to create something iOS-specific — building on the frameworks and design idioms exclusive to Apple’s specific platforms, not to “mobile” as a general idea.</p>\n\n<p>The sort of developers who want to do what Apple does with software: make things that are delightful, exquisite, and <em>just right</em> for the platform.</p>\n\n<p>It’s these developers, who were once the most firmly committed to developing software exclusively for Apple’s platforms, whose criticisms of Apple’s App Store policies are the most <a href=\"https://marco.org/2021/06/03/developer-relations\">cogent and strident</a>.</p>\n\n<hr />\n\n<p>In my imagination, a world where Apple had used Phil Schiller’s memo above as a game plan for the App Store over the last decade is a better place for everyone today: developers for sure, but also users, and, yes, Apple itself. I’ve often said that Apple’s priorities are consistent: Apple’s own needs first, users’ second, developers’ third. Apple, for obvious reasons, does not like to talk about the Apple-first part of those priorities, but Cook made explicit during his testimony during the Epic trial <a href=\"https://www.theverge.com/2021/5/21/22448023/epic-apple-fortnite-antitrust-lawsuit-judge-tim-cook-app-store-questions\">that when user and developer needs conflict, Apple sides with users</a>. (Hence App Tracking Transparency, for example.) </p>\n\n<p>These priorities are as they should be. I’m not complaining about their order. But putting developer needs third doesn’t mean they should be neglected or overlooked. A large base of developers who are experts on developing and designing for Apple’s proprietary platforms is an incredible asset. Making those developers happy — happy enough to keep them <em>wanting</em> to work and focus on Apple’s platforms — is good for Apple itself. “Only on iPhone” is powerful.</p>\n\n<p>I’ve been deeply involved with the Apple developer community since the 1990s. There has always been conflict between developers and Apple. Over the balance of fixing bugs versus adding features to the platforms, over the quality of documentation, over the tools, over everything. But the relationship has clearly turned for the worse during the App Store era, and the reason, I think, is money.</p>\n\n<p>What’s weirdest about Apple’s antitrust and PR problems related to the App Store is that the App Store is a side hustle for Apple. Yes it’s earning Apple $10+ billion a year, and even for Apple that’s significant. But it’s not Apple’s main business by a longshot. To my knowledge no company in history has ever gotten into antitrust hot water over a side business so comparatively small to its overall business. Apple doesn’t need this.</p>\n\n<p>I think Apple’s senior leadership — Cook in particular — truly does believe that Apple has earned every dollar it generates from third-party software in the App Store, and that their policies in place are just and fair. That righteousness came out on the stand in the Epic trial. But even if Apple’s executives are correct — if the current rules and revenue splits could somehow be proven to be dialed in to a hypothetical Platonic ideal of fairness to all parties involved — that doesn’t change the fact that so many developers see it otherwise.</p>\n\n<p>I don’t think the developers are wrong, but even if they are wrong, it’s not good for Apple that they’re so unhappy, and feel so aggrieved. It’s not good for Apple that developers don’t see the App Store as a platform that works in their interests.</p>\n\n<p>Like the Apple logo, “developer goodwill” has no price tag. But Phil Schiller’s decade-ago idea to start dialing down the revenue split — in favor of developers — comes pretty close to assigning it one.</p>\n\n<div>\n<hr />\n<ol>\n\n<li>\n<p>It really has all been email, too. Unless I’m missing something, not one piece of communication entered into evidence — from either Apple or Epic — has been anything other than an email message. Not one message from iMessage or any other messaging service. I find that very surprising. Do Apple executives never use iMessage to discuss work? Nor Epic’s? If anyone with legal expertise can explain why this is, let me know. <a href=\"#fnr1-2021-06-07\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a6b5520d26e07b3b1337ece49b05ddd344d8deca1f10317265ce968adca750fa","category":"Tech"}