{"title":"Researcher builds anti-Russia AI disinformation machine for $400","link":"https://arstechnica.com/?p=1964237","date":1693403496000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/disinfo-800x415.jpg\" alt=\"Illustration of AI\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/disinfo.jpg\">Enlarge</a> (credit: James Marshall; Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In May, Sputnik International, a state-owned Russian media outlet, posted a series of tweets lambasting US foreign policy and attacking the Biden administration. Each prompted a curt but well-crafted rebuttal from an account called CounterCloud, sometimes including a link to a relevant news or opinion article. It generated similar responses to tweets by the Russian embassy and Chinese news outlets criticizing the US.</p>\n<p>Russian criticism of the US is far from unusual, but CounterCloud’s material pushing back was: The tweets, the articles, and even the journalists and news sites were crafted entirely by<a href=\"https://www.wired.com/tag/artificial-intelligence/\"> artificial intelligence</a> algorithms, according to the person behind the project, who goes by the name Nea Paw and says it is designed to highlight the danger of mass-produced AI disinformation. Paw did not post the CounterCloud tweets and articles publicly but provided them to WIRED and also produced<a href=\"https://www.youtube.com/watch?v=cwGdkrc9i2Y\"> a video</a> outlining the project.</p>\n<p>Paw claims to be a cybersecurity professional who prefers anonymity because some people may believe the project to be irresponsible. The CounterCloud campaign pushing back on Russian messaging was created using OpenAI’s text generation technology, like that behind<a href=\"https://www.wired.com/tag/chatgpt/\"> ChatGPT</a>, and other easily accessible AI tools for generating photographs and illustrations, Paw says, for a total cost of about $400.</p></div><p><a href=\"https://arstechnica.com/?p=1964237#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964237&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a6c36c2ce9e9013f7d154302845f5608a72694938490d49f5fdafd9ddf5db043","category":"Tech"}