{"title":"Facebook Adds New 'Most Recent' Timeline to Switch to Chronological Posts","link":"https://www.macrumors.com/2021/03/31/facebook-most-recent-timeline/","date":1617187692000,"content":"Facebook <a href=\"https://about.fb.com/news/2021/03/more-control-and-context-in-news-feed/\">today announced</a> a slew of new changes coming to its app on iOS and Android, making it easier for users to turn off the algorithmically-ranked News Feed, and new tools for controlling who can comment on posts.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/facebook-most-recent-timeline.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"aligncenter size-full wp-image-791660\" />\r\n<br/>\r\nFacebook previously rolled out a new Favorites timeline, allowing users to specify their favorite friends, family members, and pages, and access their posts in one place. Facebook's now building on that functionality with a new Most Recent mode that will show posts in chronological order instead of based on an algorithm. \r\n<br/>\r\n<blockquote>The Feed Filter Bar offers easier access to Most Recent too, making it simpler to switch between an algorithmically-ranked News Feed and a feed sorted chronologically with the newest posts first. Android app users can access the Feed Filter Bar when they scroll up on News Feed. The same functionality will be available in the iOS app in the coming weeks. Regardless of how often you use them, you can find Most Recent and Favorites in the Shortcuts menu. </blockquote>The new mode, or timeline, will be available on iOS in the coming weeks, but is already available on Android. Additionally, Facebook offers tools to turn off political ads, and the ability to \"Snooze\" a specific page or person to stop seeing their posts.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/facebook-suggested-for-you.jpg\" alt=\"\" width=\"890\" height=\"593\" class=\"aligncenter size-full wp-image-791661\" />\r\n<br/>\r\nOther changes coming to the Facebook timeline include the social-media giant offering users more context as to why they may be seeing a specific post. For content labeled \"Suggested for You,\" users can now learn what factors triggered Facebook's algorithm to suggest the post to you. Factors may include past related posts you've engaged with, topics that interest you, or your location.\r\n<br/>\r\n<blockquote>Related engagement: A post may be suggested for you if other people who interacted with the post also previously interacted with the same group, Page or post as you. \r\n<br/>\r\n\r\n<br/>\r\nRelated topics: If you've recently engaged with a certain topic on Facebook, we may suggest other posts that are related to that topic. For example, if you recently liked or commented on a post from a basketball Page, we could suggest other posts about basketball.\r\n<br/>\r\n\r\n<br/>\r\nLocation: You may see a suggested post based on where you are and what people near you are interacting with on Facebook.</blockquote>Lastly, following in the <a href=\"https://www.macrumors.com/2020/08/06/twitter-ios-users-can-now-limit-replies/\">footsteps of Twitter</a>, Facebook will now allow users to specify who can comment on their posts. Users can choose to have anyone be able to comment, just friends, or only profiles and pages mentioned in the post.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/31/facebook-most-recent-timeline/\">Facebook Adds New &#039;Most Recent&#039; Timeline to Switch to Chronological Posts</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/facebook-adds-new-most-recent-timeline-to-switch-to-chronological-posts.2290190/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=X_HVGHI399Y:Eqzlo-VDPnw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=X_HVGHI399Y:Eqzlo-VDPnw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/X_HVGHI399Y\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a6c56db4b7875df65cb3cc5c08a89b3106b500a1a59afb0c3f58e2945f295943","category":"Apple"}