{"title":"The Role of Line-Field Confocal Optical Coherence Tomography in Detecting Extramammary Paget Disease Recurrences: A Pilot Diagnostic Study","link":"https://www.preprints.org/manuscript/202407.0743/v1","date":1720591631000,"content":"Extramammary Paget disease (EMPD) is an uncommon adenocarcinoma of apocrine gland-rich areas, presenting significant diagnostic challenges due to its nonspecific clinical appearance and frequent misidentification as benign, inflammatory skin conditions. Traditional diagnostic methods such as biopsy are invasive and uncomfortable, often required repeatedly due to high recurrence rates. Dermoscopy and non-invasive imaging techniques have been used but provide limited diagnostic accuracy due to their constraints in depth penetration and resolution. Recent advancements in imaging technologies, such as line-field confocal optical coherence tomography (LC-OCT), show promise in enhancing diagnostic precision while minimizing invasive procedures. LC-OCT merges high-resolution imaging with deep penetration capabilities, capturing detailed horizontal and vertical skin images akin to histopathology. This study evaluated the diagnostic performance of LC-OCT in detecting EMPD and its recurrence in 17 clinically suspicious anogenital regions, belonging to 6 patients. Data were collected prospectively at patient bedside by an LC-OCT expert with poor training for EMPD; and, then, reviewed retrospectively by an independent LC-OCT expert with adequate training for EMPD and no concerns about time. The prospective examination yielded 64.7%-accuracy, 71.4%-sensitivity, and 33.3%-specificity. The retrospective analysis achieved 94.1%-accuracy, 100%-sensitivity, and 66.7%-specificity, with the only false positive case being a difficult-to-diagnose concomitant presentation of a lichen sclerosus et atrophicus. Despite the need for specialized training, our results suggest that LC-OCT represents a valuable tool for accurately identifying EMPD and improve its management by reducing unnecessary biopsies. Further studies are needed to standardize its clinical application.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a6c60f04a4c7d855d9b7cdfdca01a29a88927d76ed6c09e8e3d1983df0a09b0c","category":"Interdisciplinary"}