{"title":"Demographic change and loss of big trees in resprouting eucalypt forests exposed to megadisturbance","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13842?af=R","date":1717857277000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Increased tree mortality linked to droughts and fires is occurring across temperate regions globally. Vegetation recovery has been widely reported; however, less is known about how disturbance may alter forests structurally and functionally across environmental gradients. We examined whether dry forests growing on low-fertility soils were more resilient to coupled extreme drought and severe fire owing to lower tree mortality rates, higher resprouting success and persistence of juveniles relative to wetter forests on more fertile soils.</p>\n<h2>Location</h2>\n<p>Fire-tolerant eucalypt forests of temperate southeastern Australia.</p>\n<h2>Time period</h2>\n<p>2020–2023.</p>\n<h2>Major taxa studied</h2>\n<p><i>Eucalyptus</i>, <i>Corymbia</i>, <i>Angophora</i>.</p>\n<h2>Methods</h2>\n<p>Demographic surveys of tree mortality and regeneration in all combinations of dry/wet forest, fertile/less fertile substrates exposed to extreme drought and fire were conducted. We used Bayesian regression modelling to compare tree mortality, diameter, response traits, population structure and occurrence of fire scars between substrates/forest types.</p>\n<h2>Results</h2>\n<p>Overall mortality (20%–33%) and topkill (34%–41%) were within historically reported ranges for various forests and soil types. However, we observed an atypical trend of increased mortality and topkill in the largest trees, particularly when they had structural damage from past fires. Trees in wet forests on more fertile soils had the highest levels of mortality. Numbers of persistent resprouting juveniles were highest in dry forests on low-fertility soils. Dry forests growing on low-fertility soils appear more resilient to compound disturbances due to lower rates of mortality and higher rates of juvenile persistence. Wet forests on more fertile soils may experience greater demographic change due to higher mortality of small and large trees.</p>\n<h2>Main conclusions</h2>\n<p>Mesic forests on relatively fertile soils were found to be at relatively high risk of demographic change from compound disturbances. Combined, fire and drought are likely to reduce the number of large trees in affected areas, with consequences for forest carbon cycling and storage.</p>","author":"Eli R. Bendall, \nLuke C. Collins, \nKirsty V. Milner, \nMichael Bedward, \nMatthias M. Boer, \nBrendan Choat, \nRachael V. Gallagher, \nBelinda E. Medlyn, \nRachael H. Nolan","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"a6c8622252c5a50e62f7fcdfa636048084b11a46be0ebd41b8ba1b1b2d160c8b","category":"Environment"}