{"title":"Testing Activities for Technological and Normative Validation of Bio-Based Components in Facade System Modules","link":"https://www.preprints.org/manuscript/202403.1536/v1","date":1711437363000,"content":"In the construction sector, the integration of biobased materials has emerged as a pivotal aspect of EU policies, aimed at promoting sustainable practices throughout the value chain to mitigate resource consumption and carbon emissions. This paper explores the development and validation activities of a bio-based façade system within the Basajaun H2020 project, focusing on enhancing the utilization of biobased components within building envelopes to replace conventional solutions with eco-friendly alternatives. This paper reports the methodologies employed to detect requirements and outline the testing protocols undertaken to validate the façade system design devised within the project focusing on the original façade components as the bio composite profile. Vision and opaque façade modules are prototyped and tested following curtain wall standards standard for performance and acoustic assessments, to showcase the efficacy of the developed solution. The conducted tests demonstrate the feasibility of integrating bio-based components into building envelopes, aligning with project expectations, and prevailing standards for curtain wall façade solutions. Notably, the designed façade system meets technical conditions and project objectives. Nevertheless, the research underscores the need for further refinements to facilitate solution industrialization and explore broader market applicability. Future efforts will focus on addressing these improvements and assessing the scalability of the solution.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a6cebb606135fa321f052d2f0c6182d7a36cb6dbd8a0ff1e3e94cb0848c7cec2","category":"Interdisciplinary"}