{"title":"Do natural resource rents aid renewable energy transition in resource‐rich African countries? The roles of institutional quality and its threshold","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12430?af=R","date":1709808355000,"content":"<h2>Abstract</h2>\n<p>Transitioning to a carbon-neutral renewable energy (REN) option to decarbonize ecosystems and mitigate carbon dioxide (CO<sub>2</sub>) emissions and the negative impacts of climate change is consistent with United Nations Sustainable Development Goals 7 and 13. Scholars have identified natural resource wealth and institutions as critical factors in the REN transition in resource-rich countries. Financial barriers are arguably the most significant impediments to transitioning to REN, as it is more capital-intensive and costly to produce, invest in, and use than traditional fossil fuel-based energy. Meanwhile, weak institutions and corruption in most resource-rich countries culminate in the resource curse phenomenon and the mismanagement of natural resource wealth. It implies that institutions (weak or strong) modify the natural resource rent contribution to the REN transition. Previous research has paid little attention to the impact of the interplay between natural resources and institutional quality on the REN transition in resource-rich African countries. This study examines how institutions moderate the contribution of natural resource wealth to accelerating or inhibiting the REN switch in resource-rich African countries for the period 2000–2021, using fully modified ordinary least squares, a Driscoll–Kraay nonparametric covariance matrix, and moments-based quantile regression estimators. This study departs from earlier studies by determining the institutional quality threshold above which institutions significantly stimulate natural resource rents to accelerate Africa's REN transition. The findings indicate that institutions in resource-rich African countries breed inefficient bureaucracies and corruption in natural resource rent administration. These undermine the ability of natural resource incomes to facilitate a shift to renewable energy sources. The threshold analyses indicate that most resource-rich African countries operate below the institutional quality threshold. This finding corroborates that inefficient institutions abet natural resource rent mismanagement and hinder the channeling of resource income toward the REN transition. The findings' policy implications are robustly articulated and outlined.</p>","author":"Clement Olalekan Olaniyi, \nNicholas Mbaya Odhiambo","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"a6d22d1708747cdeadcf3caea423c97538c52601b497720aff39e69a4f940ae4","category":"Environment"}