{"title":"Identification of long‐preserved specimens reveals the historical geographic range of the Patagonian lamprey Geotria macrostoma (Burmeister, 1868) in southern South America","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15732?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>The lamprey genus <i>Geotria</i> Gray, 1851 currently includes only two species: <i>G. australis</i> and <i>G. macrostoma</i>. However, taxonomic relationships within the genus have traditionally been ambiguous and difficult to establish due to the extreme changes in morphology, dentition, and coloration that lampreys undergo during their life cycles, particularly during upstream migration and sexual maturation. Consequently, several lamprey specimens held in museum collections have remained unidentified, especially those from Argentina. In this study, a series of morphometric characters were subjected to discriminant function analysis (DFA) to identify the lamprey species collected during 1867–2004 from the de la Plata River and Patagonia. These specimens are housed at the Museo Argentino de Ciencias Naturales “Bernardino Rivadavia” in Buenos Aires, the Museo de Historia Natural de Montevideo, and the Naturhistoriska riksmuseet in Stockholm. Based on the proportions of the length of the oral disc, prebranchial, and pre-caudal body regions, and the depth of the trunk, DFA provided conclusive evidence that the specimens corresponded to the recently revalidated <i>G. macrostoma</i> (Burmeister, 1868), which was originally incorrectly named as <i>Petromyzon macrostomus</i> Burmeister, 1868, <i>Exomegas macrostomus</i> (Berg, 1899), <i>Geotria chilensis</i> (Berg, 1895), and <i>Geotria macrostoma</i> f. <i>gallegensis</i> Smitt, 1901, as well as other nontype museum individuals of uncertain taxonomic status. The identifications of these long-preserved museum specimens provided key information on the historical geographic range of Argentinian lampreys and suggest that the disappearance of the species reported from northern localities (the Pampean Region) can be attributed to the degradation of their critical habitats, primarily caused by anthropogenic impact and climate change.</p>","author":"Carla Riva Rossi, \nClaude B. Renaud, \nPamela Quiroga, \nCindy F. Baker, \nClaudio Baigún, \nIan C. Potter, \nFrancisco J. Neira, \nSantiago N. Morawicki, \nPatricio Solimano","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"a6dcfa5e22a579223482847311dbab794a286ce4d82d3c25ee339d73de276f18","category":"Environment"}