{"title":"93 Red clover as a functional feed: Effects on rumen microbiota of finishing ram lambs","link":"https://academic.oup.com/jas/article/102/Supplement_1/31/7617984?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Red clover (RC) contains bioactive isoflavones. Supplementing RC as a functional feed (as little as 7.5% of the total diet) has been shown to alter ruminal fermentation and improve feed efficiency in ram lambs fed high-concentrate finishing diets. The objectives of this study were to determine if reduced RC inclusion will produce similar rumen microbiological effects. It was hypothesized that RC supplementation below 7.5% RC will alter rumen microbial community composition during the finishing period. Sixteen individually housed Polypay ram lambs (age; 134 ± 2.5 d; initial body weight: 31 ± 0.53 kg) were used in a complete block design and fed one of four isocaloric and isonitrogenous diets (85:15 concentrate:roughage ratio; n = 4 rams diet<sup>1</sup>): a control diet in which the roughage component (15.0% wt/wt of total diet) consisted of orchardgrass hay, 2.5%-RC (roughage: 2.5% RC; 12.5% orchardgrass wt/wt), 5.0%-RC (roughage: 5.0% RC; 10% orchardgrass wt/wt), and 7.5%-RC (roughage: 7.5% RC; 7.5% orchardgrass wt/wt). Rumen fluid was collected via oral intubation at 0, 2, 4, 6, and 8 h post-feeding at the end of the adaptation period (14 d; all rams on control diet) and at 21-d intervals during the trial. Rumen functional bacterial guilds, including hyper-ammonia-producing bacteria (HAB), amylolytic, lactate-utilizing (LU), and cellulolytic bacteria were enumerated via serial dilution at 4 h post-feeding. Data were analyzed using PROC MIXED with repeated measures in SAS (v.9.4, SAS inst. Inc., Cary, NC). There were no differences between diets on d 0 for any variable (P &gt; 0.05). At d 21, all RC-containing diets exhibited a 10- to 100-fold reduction in ruminal HAB compared with the control (P &lt; 0.05). While suppression of HAB was no longer apparent by d 42 in 2.5%-RC, HAB had decreased 100-fold (10<sup>9</sup> to 10<sup>7</sup>) in lambs fed the 5.0%-RC and 7.5%-RC diets (P &lt; 0.01). No differences in amylolytic bacteria were detected on d 21 (P &gt; 0.05), but were 10-fold less in all diets containing RC by d 42 in comparison with control (10<sup>9</sup> to 10<sup>8</sup>; P = 0.08). In contrast, LU increased by d 21 and were 100-fold greater (10<sup>6</sup> to 10<sup>8</sup>) by d 42 when compared with the control for all levels of RC supplementation (P &lt; 0.05). Cellulolytic bacteria also increased across the study period in all lambs fed RC diets, with 100-fold greater cellulolytics (10<sup>6</sup> to 10<sup>8</sup>) by d 42 (P &lt; 0.05). Consistent with the hypothesis, supplementing RC at levels as low as 2.5% wt/wt of the total diet decreased protein-wasting HAB and amylolytic bacteria while coincidingly increasing LU and cellulolytic bacteria in the rumen. These results indicate that adding red clover to finishing diets has the potential to increase lamb growth and feed efficiency through a functional feed action.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a6dd33f103de49cd740d38a2000b2618b2e5189676da24d58f5d91a74743b98f","category":"Environment"}