{"title":"Assessment of Thermal Influence on an Orthodontic System by Means of the Finite Element Method","link":"https://www.preprints.org/manuscript/202409.0865/v1","date":1726034519000,"content":"The development of the finite element method (FEM) combined block polynomial interpolation with the concepts of finite difference formats and the variation principle. Because of this combination, FEM overcomes the shortcomings of traditional variation methods while maintaining the benefits of current variation methods and the flexibility of the finite difference method. As a result, FEM is an advancement above the traditional variation methods. The aim of the study is to experimentally determine the thermal behavior of two stomatognathic systems, one control and the other presenting orthodontic treatment by means of a fixed metallic orthodontic appliance, both being subjected to several thermal regimes. In order to carry out this experimental study, we examined the case of a female subject, who was diagnosed with Angle class I malocclusion. The patient underwent a bimaxillary CBCT investigation before initiating the orthodontic treatment. A three-dimensional model with fully closed surfaces was obtained by using the InVesalius and Geomagic programs. Like the tissues examined in the patient, bracket and tube-like components, as well as orthodontic wires, can be included to these models. Once it is finished and geometrically accurate, the model is exported to a FEM-using program, such as Ansys Workbench. The intention was to study the behavior of two stomatognathic systems (with and without a fixed metallic orthodontic appliance) subjected to very hot food (70 ⁰C) and very cold food (-18 ⁰C). From the analysis of the obtained data, it was concluded that, following the simulations carried out in the presence of the fixed metallic orthodontic appliance, significantly higher temperatures were generated in the dental pulp.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a6e19e001bb64c64768fca99af9bdc7df380ab1e616b965c06c90eaba7455ec1","category":"Interdisciplinary"}