{"title":"Musk refused to testify in Twitter stock probe, claimed SEC is harassing him","link":"https://arstechnica.com/?p=1973958","date":1696610297000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/getty-musk-sec-800x534.jpg\" alt=\"Elon Musk walks out of a federal courthouse and speaks to reporters as a member of the media holds a microphone.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/getty-musk-sec.jpg\">Enlarge</a> <span>/</span> Elon Musk leaves federal court in New York on Thursday, April 4, 2019 after a hearing in a case involving the SEC. (credit: Getty Images | Bloomberg)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US Securities and Exchange Commission sued Elon Musk yesterday, alleging that he refuses to appear for testimony in an investigation into whether he violated federal law with his purchases of Twitter stock. The SEC asked a federal court to force Musk to testify \"as required by the investigative subpoena.\"</p>\n<p>\"The subpoena with which Musk failed to comply relates to an ongoing nonpublic investigation by the SEC regarding whether, among other things, Musk violated various provisions of the federal securities laws in connection with (1) his 2022 purchases of Twitter stock, and (2) his 2022 statements and SEC filings relating to Twitter,\" the SEC alleged in its <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.419113/gov.uscourts.cand.419113.1.0.pdf\">lawsuit</a> in US District Court for the Northern District of California.</p>\n<p>The SEC told the court it \"seeks Musk's testimony to obtain information not already in the SEC's possession that is relevant to its lawful investigation. The SEC has followed all appropriate administrative steps required in seeking Musk's testimony. In the face of Musk's blatant refusal to comply with the SEC's subpoena, the SEC now asks the Court to intervene and compel Musk's compliance.\"</p></div><p><a href=\"https://arstechnica.com/?p=1973958#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973958&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a6ee91905f6b9aa3bc18978d7fef7d5dc16ccac22a97e2949b2878250c359665","category":"Tech"}