{"title":"Urinary metabolic profile and its predictive indexes after MSG consumption in rat","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309728","date":1725372000000,"content":"<p>by Manatsaphon Sukmak, Thin Su Kyaw, Kanokwan Nahok, Amod Sharma, Atit Silsirivanit, Worachart Lert-itthiporn, Deanpen Japrung, Somchai Pinlaor, Sirirat Anutrakulchai, Carlo Selmi, Carolyn M. Slupsky, Bruce D. Hammock, Ubon Cha’on</p>\r\n\r\nMonosodium glutamate (MSG) is a widely used food additive with conflicting evidence regarding its potential effects on human health, with proposed relevance for obesity and metabolic syndrome (MetS) or chronic kidney disease. As being able to accurately quantify the MSG dietary intake would help clarify the open issues, we constructed a predictive formula to estimate the daily intake of MSG in a rat model based on the urinary metabolic profile. Adult male Wistar rats were divided into groups receiving different daily amounts of MSG in drinking water (0.5, 1.5, and 3.0 g%), no MSG, and MSG withdrawal after 3.0% MSG treatment for 4 weeks. We then analyzed 24-hour urine samples for chemistries and metabolites using <sup>1</sup>H NMR spectrometry and observed a strong correlation between urine pH, sodium, bicarbonate, alpha-ketoglutarate, citrate, fumarate, glutamate, methylamine, N-methyl-4-pyridone-3-carboxamide, succinate, and taurine and the daily MSG intake. Following the multiple linear regression analysis a simple formula model based on urinary Na<sup>+</sup>, citrate, and glutamate was most accurate and could be validated for estimating daily MSG intake. In conclusion, we propose that the daily MSG intake correlates with urinary metabolites in a rat model and that this new tool for monitoring the impact of MSG on health measures.","author":"Manatsaphon Sukmak","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a6ef45a1e4ec2210a87442d115bddfd3bb2aa15ae2f643978868e50d11d84cd0","category":"Interdisciplinary"}