{"title":"Developing a hybrid model with multiview learning for acoustic classification of Atlantic herring schools","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10611?af=R","date":1715404866000,"content":"<h2>Abstract</h2>\n<p>Advances in active acoustic technology have outpaced the ability to process and analyze the data in a timely manner. Currently, scientists rely on manual scrutiny or limited automation to translate acoustic backscatter to biologically meaningful metrics useful for fisheries and ecosystem management. The National Oceanic and Atmospheric Administration Northeast Fisheries Science Center has monitored the Atlantic herring population in the Gulf of Maine and Georges Bank since 1999 due to the stocks' important economic and ecological role for the commercial lobster industry. Manual scrutinization to identify Atlantic herring schools from the water column sonar data is time-consuming and impractical for large-scale studies. To automate this process, a hybrid model with multiview learning was proposed for automatic Atlantic herring school detection, which consists of two steps: (1) region-of-interest (ROI) detection and (2) ROI classification. The ROI detection step was designed to detect school-like objects, and the ROI classification step was designed to distinguish Atlantic herring schools from other objects. The co-training algorithm was employed for multiview learning as well as semi-supervised learning. Within this framework, single-view vs. multiview learning and supervised vs. semi-supervised learning were evaluated and compared. Our results showed that multiview learning can improve the performance of the hybrid model in Atlantic herring school detection, and the utilization of unlabeled data is also helpful when the training set is small. The best-performed model achieved an <i>F</i>1-score of 0.804. This new framework provides an efficient and effective tool for automatic Atlantic herring school detection.</p>","author":"Yawen Zhang, \nCarrie C. Wall, \nJ. Michael Jech, \nQin Lv","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"a6f747a3688daae96ad0d11264c87abda02508fe393984dede6eb942786745e1","category":"Environment"}