{"title":"PayPal and Venmo Launch Tap to Pay on iPhone for U.S. Businesses","link":"https://www.macrumors.com/2024/03/07/tap-to-pay-on-iphone-paypal-venmo/","date":1709828128000,"content":"PayPal today <a href=\"https://investor.pypl.com/news-and-events/news-details/2024/Tap-to-Pay-on-iPhone-Now-Available-for-Venmo-and-PayPal-Zettle-Businesses-in-the-U.S/default.aspx\">announced</a> that Tap to Pay on iPhone is now widely available for businesses that use the Venmo and PayPal Zettle apps in the U.S., allowing them to accept contactless payments directly on an iPhone, with no additional hardware required.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/02/Apple-Tap-to-Pay-iPhone.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nMore details from the announcement:<blockquote>With Tap to Pay on iPhone, Venmo business profile and PayPal Zettle users in the U.S. can get set up in minutes and begin securely accepting contactless cards and digital wallets directly on their iPhones. They can also add taxes, accept tips, send receipts, and issue refunds. In addition, funds from sales will settle quickly into a business's Venmo or PayPal Zettle account, helping to streamline operations and manage cash flow.</blockquote>PayPal had already been testing Tap to Pay on iPhone with an early access program, and the feature is now available to all merchants.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/2022/02/08/apple-announces-tap-to-pay-iphone-feature/\">Launched in the U.S. in 2022</a>, Tap to Pay on iPhone allows for iPhone-to-iPhone contactless payments, with no additional point-of-sale hardware from companies like Square or Clover required. The feature allows customers to tap their iPhone or Apple Watch, credit card, or other contactless payment option on the merchant's iPhone. Payment is securely completed using the same NFC technology behind Apple Pay.\r<br />\n\r<br />\nApple has gradually expanded Tap to Pay on iPhone to additional countries, such as Australia, France, the Netherlands, Taiwan, and the U.K. Other popular payment platforms that support the feature include Square and Stripe.<div>Tag: <a href=\"https://www.macrumors.com/guide/tap-to-pay-on-iphone/\">Tap to Pay on iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/07/tap-to-pay-on-iphone-paypal-venmo/\">PayPal and Venmo Launch Tap to Pay on iPhone for U.S. Businesses</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/paypal-and-venmo-launch-tap-to-pay-on-iphone-for-u-s-businesses.2421297/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a6f923c7f9919cfac0ac1114d5e28af9d6402d4f65f42808eab85095abca972c","category":"Apple"}