{"title":"Report: Apple to begin overhaul of AirPods line next year","link":"https://www.macworld.com/article/2116343/report-apple-to-begin-overhaul-of-airpods-line-next-year.html","date":1698262505000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-10-25/apple-airpods-plans-4th-generation-low-end-3rd-generation-pro-and-usb-c-max&amp;xcust=1-1-2116343-1-0-0&amp;sref=https://www.macworld.com/feed\">new report from Mark Gurman at Bloomberg</a> gives some insight into Apple’s plans to revamp its AirPods line. According to the report, Apple plans to overhaul the entire AirPods line starting next year and continuing through 2025. AirPods were once viewed as just an accessory, but now sell tens of millions of units a year and bring in an estimated $15-20 billion in revenue. On their own, AirPods would be a Fortune 500 company.</p>\n\n\n\n<p>In 2024, the report says, Apple will revamp the entry-level AirPods, with a new earbud design, a new look for the cases, and improved audio quality. Apple would produce two new 4th-gen AirPods that would replace the 2nd-generation and 3rd-generation AirPods, which are both still currently sold. Apparently, the 3rd-gen model doesn’t sell very well, as most customers don’t see it as worth the higher price or else they opt to spend a little more for AirPods Pro. The two models of 4th-gen AirPods would have similar prices to the 2nd and 3rd-gen products, but greater differences between them.</p>\n\n\n\n<p>The new 4th-gen AirPods will look like a hybrid between the 3rd-gen AirPods and AirPods Pro, with short stems. The higher-end of the two models will get noise canceling and a case with a speaker for Find My alerts, much like AirPods Pro.</p>\n\n\n\n<p>Where does that leave AirPods Pro? Outside of replaceable tips, it would seem to offer little over the planned higher-end version of the 4th-gen AirPods. AirPods Pro are expected to get a new design and chip in 2025, with some new features related to hearing health.</p>\n\n\n\n<p>AirPods Max are said to get an update near the end of 2024. They’ll come in new colors and feature USB-C, but Gurman says they “won’t see many other changes.” It’s likely that Apple will incorporate the H2 processor found in the newer AirPods Pro, but AirPods Max needs a number of major improvements to keep up with other over-the-ear wireless headphones, including Apple’s own <a href=\"https://www.macworld.com/article/1999165/beats-studio-pro-review.html\">Beats Studio Pro</a>.</p>\n\n\n\n<p>All these new AirPods will switch from Lightning to USB-C, of course, as Apple transitions away from Lightning across its product line.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a6fb423340dcc41fca58929e4e10ae242b13f598db88fd0cef1e27fc158bcc21","category":"Apple"}