{"title":"Understanding the sources, fate and effects of microplastics in aquatic environments with a focus on risk profiling in aquaculture systems","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12941?af=R","date":1718783309000,"content":"<h2>Abstract</h2>\n<p>The upsurge in the usage of plastics on a global scale has led to the widespread occurrence of microplastics (MPs) in aquatic environments. This review starts by outlining the current global scenario of plastic production. It then delves into the various sources of plastics and their entry into aquatic systems, including their impact on fisheries and the aquaculture sector. The detailed analysis of plastic entry and various methods of degradation into small sized, MPs followed by their transport, uptake and trophic transference have been reviewed systematically. Besides, the review summarizes the current knowledge on impacts of MPs, their additives and associated contaminants on organisms living in the aquatic environment, particularly fish thriving in cultured conditions. The analysis of effects of MPs alone and in association with other contaminants like heavy metals, organic pollutants and leachates reveal serious effects such as cytotoxicity, immune response, oxidative stress, neurotoxicity, barrier attributes and genotoxicity among various aquatic species particularly, fish. In addition, the present review discusses MPs invasion into aquaculture systems, explores risk assessment both in terms of exposure risk and toxicological risks associated with biochemical nature, size, shape and concentration of MPs. Besides, risk management strategies and future prospective to control MPs associated hazards have also been highlighted. In summary, the present review outlines the various sources, fate, impact of MPs in aquatic environment highlighting the need to recognize MPs pollution as a serious threat to aquatic organisms and to formulate strategies including prevention, reduce, reuse and safe disposal of plastic material.</p>","author":"Naveed Nabi, \nIshtiyaq Ahmad, \nAdnan Amin, \nMohd Ashraf Rather, \nImtiaz Ahmed, \nYounis Ahmad Hajam, \nSaba Khursheed, \nMonisa Mehboob Malik, \nAdnan Abubakr","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"a6ff7d05d9f60bd2bfd284a4e4d9b5b80e1a8d85e3fc82a0af2a991a9c89694b","category":"Environment"}