{"title":"The combination of elevated CO2 and warmer temperature reduces photosynthetic capacity without diluting leaf N concentration in Amur linden (Tilia amurensis)","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae030/7655404?rss=1","date":1713571200000,"content":"<span><div>Abstract</div>Elevated CO<sub>2</sub> and warmer temperatures represent the future environmental conditions in the context of global change. A good understanding of plant response to their combined effects is, therefore, critically important for predicting future plant performance. This study investigated the photosynthetic acclimation of Amur linden (<span>Tilia amurensis</span>) seedlings (current year, about 60 cm tall), a shade-tolerant tree species in the temperate broadleaf deciduous forest, to the combination of current CO<sub>2</sub> concentration and temperature (CC) and the combination of the predicted future CO<sub>2</sub> concentration and temperature (FC). The results show that FC promoted aboveground growth, but reduced photosynthetic capacity (<span>V</span><sub>cmax</sub>: maximum rate of RuBP carboxylation and <span>J</span><sub>max</sub>: maximum photosynthetic electron transport rate). However, the photosynthetic rate measured under the corresponding growth CO<sub>2</sub> concentration was still higher under FC than under CC. FC depressed the photosynthetic limiting transition point (<span>C</span><sub>i-t</sub>, <span>A</span><sub>n-t</sub>) from Rubisco carboxylation to RuBP regeneration, i.e. <span>A</span><sub>n-t</sub> decreased without a change in <span>C</span><sub>i-t</sub>. FC did not change leaf N concentration but increased the total leaf N content per tree and photosynthetic nitrogen utilization efficiency. This suggests that N utilization, rather than photosynthetic capacity, may play an important role in the acclimation of the species to future climatic conditions. This study provides new insights into the photosynthetic acclimation of Amur linden and can be used to predict its possible performance under future climatic conditions.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"a6ffea629a5dbece0578d7323197bad71696c704780a0584f9c1f6de45fefced","category":"Environment"}