{"title":"Consistencies in the dietary and isotopic niche of spotted seatrout, Cynoscion nebulosus, across a salinity gradient within a coastal Louisiana estuary","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15810?af=R","date":1724066766000,"content":"<h2>Abstract</h2>\n<p>Estuaries are essential habitats for recreational and commercial fish that are shaped by both natural and anthropogenic processes. In Louisiana a combination of climate change and planned coastal restoration actions is predicted to increase freshwater introduction to coastal estuaries. As such there is a need to quantify the relationships between estuarine fish ecology and salinity to aid in predicting how species will respond to shifts in salinity. We investigated the relative abundance and dietary niches of adult (24.5 ± 5.4 cm standard length) spotted seatrout <i>Cynoscion nebulosus</i> across varying salinity regimes (oligohaline, mesohaline, and polyhaline) within Barataria Bay, Louisiana, using a combination of net sampling and gut content and stable isotopes analysis. We found that the relative abundance of <i>C. nebulosus</i> was lowest at the oligohaline site, translating to approximately five fewer fish captured for every single psu decrease in a site's average annual salinity. In contrast, we found that diets and, to a lesser extent, isotopic niches had a high degree of overlap across sites with differing salinity regimes. Fish and penaeid shrimp were the most common and important prey taxa recovered from guts at all sites. The small isotopic differences found among sites were likely due to spatial variation in hydrogeochemical baselines, and the observed isotopic overlap provides support for the idea that <i>C. nebulosus</i> move between adjacent salinity regimes and forage throughout Barataria Bay. Our results contribute to a greater understanding of the salinity preference and trophic ecology of <i>C. nebulosus</i> that can aid in predicting their responses to future salinity and habitat changes within Barataria Bay associated with predicted climate change and planned coastal restoration actions.</p>","author":"Pamela S. D. MacRae, \nMicah Russell, \nJames H. Cowan Jr, \nBrian Fry, \nSydney Moyo, \nMichael J. Polito","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"a701b58f128817777c8f71f282f17f43541292ca3704e45f6f52f47958157b2f","category":"Environment"}