{"title":"Photosynthetic processes in Antarctic sea ice during the spring melt","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12596?af=R","date":1721492582000,"content":"<h2>Abstract</h2>\n<p>High-latitude oceans experience strong seasonality where low light limits photosynthetic activity most of the year. This limitation is pronounced for algae within and underlying sea ice, and these algae are uniquely acclimated to low light levels. During spring melt, however, light intensity and daylength increase drastically, triggering blooms of ice algae that play important roles in carbon cycling and ecosystem productivity. How the algae acclimate to this dynamic and heterogeneous environment is poorly understood. Here, we measured <sup>14</sup>C-carbon fixation rates, photophysiology, and ribulose 1,5-bisphosphate carboxylase oxygenase (Rubisco) content of sea-ice algae in coastal waters near the western Antarctic Peninsula during spring, ranging from a low-light-acclimated, bottom community to a light-saturated bloom. Carbon fixation rates by sea-ice algae were similar to other Antarctic sea-ice measurements (2–49 mg C m<sup>−2</sup> d<sup>−1</sup>), and there was little phytoplankton biomass in the underlying water at the time of sampling. Net-to-gross ratios of carbon fixation were generally high and showed no relationship with ice type. We found algal photophysiology and Rubisco concentrations varied in relation to the different types of ice, altering the balance between the photochemical and biochemical processes that constrain carbon fixation rates. For algae inhabiting the bottom layers of sea ice, rates of carbon fixation were largely constrained by light availability whereas in surface seawater, interior and rotten/brash ice, carbon fixation rates could be calculated with reasonable accuracy from measurements of Rubisco concentrations. This work provides additional insight and means to evaluate carbon fixation rates as sea ice continues to change in future.</p>","author":"Jodi N. Young, \nSusan Rundell, \nZachary S. Cooper, \nHannah M. Dawson, \nShelly D. Carpenter, \nThomas Ryan‐Keogh, \nElden Rowland, \nErin M. Bertrand, \nJody W. Deming","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"a707d7fe2c0942c79a7ff5e280897b0e5a5fca69852ecd88edb8e9a68adc9efd","category":"Environment"}