{"title":"wcm.04.2024.454.460","link":"https://www.watconman.org/wcm-04-2024-454-460-2/","date":1727766217000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>WATER QUALITY AND BIOLOGICAL CHARACTERISTICS OF EZEAGU WATERFALL</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Celestine Chukwuebuka Eneh, Ifeanyi Oscar Aguzie, Elijah Chibueze Odii, Nelson Jehosephat Nwankwo, Joseph Onyekwere Okoro, Ifeanyi Maxwell Ezenwa</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.04.2024.454.460\">10.26480/wcm.04.2024.454.460</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Jordan, ranked as the world’s second most water-scarce country, faces severe water shortages. Treated wastewater (TWW) has become an essential part of Jordan’s water budget to bridge the gap between water supply and demand, primarily used for agricultural and industrial purposes. The construction sector, especially concrete production, consumes larg amounts of water. This study explores the feasibility of using TWW to partially or completely replace fresh water in concrete production. Concrete mixtures were prepared with varying TWW ratios (0%, 25%, 50%, 75%, and 100%) and tested for workability, compressive strength, microscopic properties (SEM-EDS), and interaction mechanisms (FTIR-ATR) to assess the impact of TWW on synergistic properties. The results showed that workability decreased proportionally with increasing TWW content. However, different TWW proportions did not affect the compressive strength of concrete or the 7-day to 28-day strength ratio. FTIR-ATR analysis revealed unique silicon-oxygen tetrahedral structures in calcium silicate hydrate, but no new bonds or components were produced by TWW. SEM-EDS microstructure testing indicated no chemical changes that could affect concrete properties. The study concludes that replacing fresh water with TWW in concrete production is feasible, conserving fresh water and supporting circular economy goals. Additionally, the study contributes to the development of low-cost concrete production and fresh water conservation.</div>\n<h3>Keywords</h3>\n<p><span>Concrete, workability, strength, wastewater, morphology.</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Jordan ranks as the second most water-scarce country in the world, with an annual per capita renewable water supply of less than 100 cubic meters, far below UNICEF’s severe water scarcity threshold of 500 cubic meters (MWI 2016). Given these water sector challenges, treated wastewater (TWW) became an integral part of the country’s water budget. In 2021, the amount of TWW reached 185.6 million cubic meters (Mm³), of which 88% was used for irrigation directly or after mixing with rainwater (MWI 2021).</p>\n<p>In 2021, approximately 531.1 million cubic meters (Mm³), representing 48.6% of Jordan’s water budget, was allocated for agricultural use, with 164 Mm³ coming from TWW. Jordan plans to expand sewer system coverage services from 65% to 80% by 2040, which is expected to increase the amount of TWW to 279 Mm³ by that year (MWI 2023). Besides agricultural use, TWW is feasible for use in the construction sector, such as in concrete production and stone cutting, to replace the huge amount of fresh water consumed in this sector. Around one billion tonnes of fresh water is used for washing aggregates, fresh concrete production, and concrete curing (Varshney et al., 2021; British Standards Institution 2013). Due to significant population growth caused by the influx of refugees over the past few decades, the construction sector in Jordan is experiencing rapid growth. Therefore, replacing fresh water with TWW in the construction sector, which can integrate various types of liquid and solid wastes into its processes, is of high importance, especially for a country like Jordan.</p>\n<p>Many studies have explored the incorporation of different types of solid wastes in the construction industry. Marble and granite sludge have been successfully reused as substitutes for raw materials in the ceramic industry and as fine aggregate in mortar and concrete (Al-Hamaiedeh 2010; Al-Hamaiedeh and Khushefati 2013; Al-Jarajreh, et al., 2023). He study investigated the partial replacement of fine aggregate with glass waste (Al-Awabdeh et al., 2022). Furthermore, the study achieved the successful incorporation of face masks into concrete mixtures (Al Swalqah et al., 2023). The feasibility of using TWW in concrete production has also been studied by many researchers, yielding varied and sometimes contradictory results. This analysis using secondary TWW in concrete production enhances compressive and flexural strength (Ahmad and Ayyad 2021). In analysis, found that using TWW as mix water decreases compressive strength and extends initial and final setting times demonstrated that using a mixture of 25% fresh water and 75% TWW as mixing water in concrete production yielded the highest compressive strength found that TWW does not adversely affect concrete quality (Al-Ghusain and Terro 2003; Bouaich et al., 2022; Yao et al., 2022). Their study showed a slight decrease in workability, an increase in compressive strength, and similar values of density, setting time, and porosity compared to control concrete. The result highlighted that using TWW in plain cement concrete production did not affect concrete quality in terms of desired strength (compressive, tensile, and flexural) (Muhammad et al., 2021). The study reported that using wastewater in brick production increased the strength of the bricks by 15–25%, while maintaining the physical and durability characteristics within the standard requirements (Ghafoor et al., 2022).</p>\n<p>It is expected that improving TWW quality will enhance concrete properties. Dilution with fresh water offers a cost-effective and environmentally friendly method for TWW quality improvement. This research aims to explore the effect of TWW quality when used as mixing water on the strength, workability, chemical properties, structure, and microscopic form (morphology) of the produced concrete.</p>\n<p><strong>2. RESEARCH METHODOLOGY</strong></p>\n<p>The study was conducted in Al-Karak governorate – Jordan. Samples of fresh water were collected from two sources, Ain-Sara spring and Al-Harbeya ground water well. Samples of TWW were collected from two wastewater treatment plants, Karak wastewater treatment plant (KWWTP), which located not far from Ain Sara spring and Mutah-Mazar treatment plants (MMWWTP) located near Al-Harbeya well. The collected fresh water FW and TWW samples were tested for BOD according to 5210 D standard method; COD according to 5220 D standard method; Dissolved Oxygen (DO) according to 4500 O standard method; pH according to 4500-H+B standard method; TSS according to 2540 D standard method; TDS according to 2540 C standard method; Turbidity according to 2130 A standard method; Escherichia coli (E. coli) according to 9223 B standard method and heavy metals according to 3111 B standard method to explore the quality of water.<br />\nDifferent mixtures comprising fresh water (FW) and treated wastewater (TWW) were prepared and used as mixing water in concrete mixtures. TWW from KWWTP was mixed with FW from Ain Sara, and TWW from MMWWTP was mixed with FW from Al Harbeya well in the following ratios:</p>\n<p>D0: 100% TWW and 0% FW.<br />\nD25: 75% TWW and 25% FW.<br />\nD50: 50% TWW and 50% FW.<br />\nD75: 25% TWW and 75% FW.<br />\nD100: 0% TWW and 100% FW.</p>\n<p>Ten concrete mixes were designed in accordance with the guidelines of BS 1881-125 [4] (Table 1). Five of these mixtures utilized a combination of treated wastewater (TWW) from the KWWTP and fresh water (FW) from the Ain Sara spring as the mixing water. The other five mixes employed a blend of TWW from the MMWWTP and FW from the Al-Harbeya well as the mixing water. The concrete mixtures comprised ordinary Portland cement with a grade of 42.5 N, limestone crushed aggregate with a maximum size of 25 mm, and silica sand with a maximum size of 4.75 mm, and were designed to achieve a compressive strength of 30 MPa.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"501\" height=\"170\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table1.jpg 501w, https://www.watconman.org/wp-content/uploads/2024/10/Table1-300x102.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The mixing process was performed using an electrically powered mixer in accordance with BS 1881-125:2013. Ten concrete mixes were prepared following the composition mentioned in each mixture was prepared using one dilution.</p>\n<p>The workability of each concrete mixture was assessed using a slump test, conducted in accordance with BS 1881-102:1983 as shown in Table 2. A total of 60 cubes were prepared and tested for this study. From each concrete mixture, 6 cubes were made, with three cubes tested at 7 days and three at 28 days. The average compressive strength of each set of three cubes was recorded, along with the standard deviation, as shown in Table 3. The composition of each concrete mixture was evaluated using attenuated total reflectance-fourier transform infrared spectroscopy (ATR-FTIR) analysis. Small samples from each mixture were ground into powder and placed inside a PerkinElmer Spectrum Two FT-IR device equipped with ATR. The analysis was conducted over a wavenumber range of 600 cm−1 to 4000 cm−1. Additionally, changes in the morphology of the concrete mixtures, as well as the bond between the aggregate and the cementitious matrix, were investigated using scanning electron microscopy (SEM) analysis. This technique was used to analyze the chemical elements present in the sample and their respective percentages, thereby determining the microscopic structure of the sample.</p>\n<p>The film samples were coated with platinum to a thickness of ~300 Å under an argon atmosphere using AGAR sputter coater machine (model AGB7340, UK) in a high-vacuum evaporator. SEM-EDS analysis performed on concrete samples at 28 days of curing from mixtures prepared with mix water containing (0%, 50%, and 100% TWW). The samples undergo a microstructure using electron beam to scan the surface for a three-dimensional image. EDS analysis was used to analyze the X-rays that are emitted when the sample interacts with the electron beam.</p>\n<p>One of the benefits of conducting this test is obtaining accurate structural details of the concrete sample, including the distribution and arrangement of particles, as well as identifying the chemical elements in the sample and ensuring that there are no unwanted chemical elements and compounds resulting from the interaction between the elements that make up the concrete mixture and the chemicals and organic materials present in the TWW.</p>\n<p><strong>3. RESULTS AND DISCUSSION</strong></p>\n<p><strong>3.1 Concrete Tests</strong></p>\n<p><strong>3.1.1 Slump Test Result</strong></p>\n<p>The slump test was performed on all prepared concrete mixtures. Table 2 shows the slump test results for concrete mixtures prepared with mixing water from KWWTP and Ain Sara, as well as those prepared with mixing water from MMWTP and Al-Harbeya well, using various dilution ratios. The results indicate that as the proportion of treated wastewater (TWW) increases, there is a corresponding decrease in slump values. Concrete mixtures prepared and cured with fresh water from Ain Sara spring and Al-Harbeya well exhibit higher slump values, suggesting greater workability. The reduction in workability is likely due to the higher solid concentrations in TWW. These findings are consistent with the observations made by (Aldossary et al., 2020).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"582\" height=\"310\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table4.jpg 582w, https://www.watconman.org/wp-content/uploads/2024/10/Table4-300x160.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.1.2 Compressive Strength</strong></p>\n<p>The concrete compressive strength was assessed at 7 days and 28 days of curing. For each mixture, three cubes were tested at 7 days and three cubes were tested at 28 days. Table 5 displays the mean compressive strength results and standard deviations for samples prepared using water from KWWTP and Ain Sara spring.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"583\" height=\"328\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table5.jpg 583w, https://www.watconman.org/wp-content/uploads/2024/10/Table5-300x169.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Table5-270x152.jpg 270w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"921\" height=\"569\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure1.jpg 921w, https://www.watconman.org/wp-content/uploads/2024/10/Figure1-300x185.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Figure1-768x474.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/10/Figure1-370x230.jpg 370w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results shown in Table 5 and Figure 1 demonstrate that the concrete strength at 7 days and 28 days remains unaffected by the proportions of (FW) from Ain Sara spring and treated wastewater (TWW) from KWWTP used in the mixing water. Similarly, the data presented in Table 6 and Figure 2 indicate that the compressive strength at both 7 days and 28 days is not influenced by the proportions of FW from Al-Harbeya well and TWW from MMWWTP.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"222\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table6-1024x222.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table6-1024x222.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/10/Table6-300x65.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Table6-768x167.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/10/Table6.jpg 1036w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"936\" height=\"566\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure2.jpg 936w, https://www.watconman.org/wp-content/uploads/2024/10/Figure2-300x181.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Figure2-768x464.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Figure 3 shows a scatter plot of the ratio of compressive strength at 7 days to the compressive strength at 28 days with different proportions of (TWW) and FW in mixing water.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"784\" height=\"495\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure3.jpg 784w, https://www.watconman.org/wp-content/uploads/2024/10/Figure3-300x189.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Figure3-768x485.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.1.2.1 Statistical Analysis Of The Compressive Strength Results</strong></p>\n<p>The data were analyzed using a univariate general linear model in SPSS, with dilution percentage treated as a covariate, and curing time and source of mixing water as factors. The analysis, as shown in Table 7, revealed that the effect of dilution percentage on strength was not significant. Increasing the percentage of treated wastewater did not adversely affect the compressive strength of concrete at either 28 days or 7 days. There was no significant difference in compressive strength between concrete prepared with undiluted treated wastewater (TWW) and that prepared with fresh water (FW). On average, the compressive strength at 7 days was approximately 7 MPa lower than at 28 days. A significant difference was observed between the compressive strength of concrete prepared using water from KWWTP and Ain Sara compared to that prepared using water from MMWWTP and Al-Harbeya. However, in both cases, the percentage of treated wastewater did not affect the compressive strength of the concrete.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"401\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table7-1024x401.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table7-1024x401.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/10/Table7-300x118.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Table7-768x301.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/10/Table7.jpg 1036w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The ratio of compressive strength at 7 days to that at 28 days was statistically analyzed to ascertain whether the utilization of treated wastewater influences the concrete’s curing rate. A deceleration in strength development is considered undesirable for concrete performance. As indicated in Table 8, the dilution rate does not significantly impact the rate of strength development. Additionally, the data reveal that the concrete on average reached approximately 79% of its 28-day compressive strength after 7 days of curing.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"238\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table8-1024x238.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table8-1024x238.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/10/Table8-300x70.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Table8-768x178.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/10/Table8.jpg 1039w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2.1 FTIR Result</strong></p>\n<p>The infrared spectra of fabricated harden cement specimens using different mixing water matrix are illustrated in Figure . The characteristic absorption bands of hardened cement specimen using fresh water are attributed to the hydroxyl groups (O-H) expanding at 3420 cm-1. The peak at 800-1050 cm−1 could be attributed to the antisymmetric stretching vibration of Si–O–Si and the stretching vibration of O–Si–O. In addition, the bands at 1640 cm−1 in the spectra of all samples belonged to the H–O–H vibration of the coordinated water. The absorption band at 1450 cm−1 was assigned to the C–OH bending vibrations. These bands embody the unique silicon–oxygen tetrahedral structure of CSH (Richardson, 2004). However, the intensity of these bands became weaker when CSH was prepared using TWW.</p>\n<p>The results demonstrated that the addition of TWW did not cause any new bonds to form within the concrete mixture, or new components to develop in the concrete.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"964\" height=\"693\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure4.jpg 964w, https://www.watconman.org/wp-content/uploads/2024/10/Figure4-300x216.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Figure4-768x552.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>S1: Concrete mixture made with 100% fresh water (FW) from Ain Sara spring.<br />\nS2: Concrete mixture made with a mix of 50% FW from Ain Sara spring and 50% treated wastewater (TWW) from KWWTP.<br />\nS3: Concrete mixture made with 100% TWW from KWWTP.<br />\nS4: Concrete mixture made with 100% FW from the Al-Harbeya well.<br />\nS5: Concrete mixture made with a mix of 50% FW from Al-Harbeya well and 50% TWW from MMWWTP.<br />\nS6: Concrete mixture made with 100% TWW from MMWWTP.</p>\n<p><strong>3.2.2 Scanning electron microscopy SEM coupled with EDS analysis</strong></p>\n<p>The surface morphology of fabricated hardened concrete specimens using different weight percentages of mixing water matrix were scanned under SEM-EDS. SEM images confirm the formation of main hardened CSH phases.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"385\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Table82-1-1024x385.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Table82-1-1024x385.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/10/Table82-1-300x113.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Table82-1-768x289.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/10/Table82-1.jpg 1038w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"718\" height=\"695\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure42.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Figure42.jpg 718w, https://www.watconman.org/wp-content/uploads/2024/10/Figure42-300x290.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/Figure42-40x40.jpg 40w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results of the SEM-EDs microstructure test show that adding TWW did not lead appreciable changes in the elemental composition of concrete samples, and did not lead to the appearance of new compounds resulting from the interaction of the constituents of TWW with the chemicals that make up the concrete mixture. This means that no chemical change occurred that might lead to a change in the properties of the concrete.</p>\n<p><strong>4.CONCLUSIONS</strong></p>\n<p>The study demonstrated the feasibility of using treated wastewater (TWW) as mixing water in concrete production. It examined the effects of TWW on the workability, compressive strength, chemical composition, and morphology of the resulting concrete. The findings were as follows:</p>\n<p>•Concrete workability decreased proportionally with increasing TWW content in the mixing water.</p>\n<p>•Different proportions of TWW did not affect the compressive strength of concrete or the ratio of 7-day to 28-day strength.</p>\n<p>•The chemical characteristics of the concrete samples were not influenced by TWW, and no new chemical compounds were detected in the concrete structure.</p>\n<p>•A significant amount of TWW can be utilized in concrete production, conserving fresh water and supporting circular economy goals. This study contributes to the development of low-cost concrete and fresh water conservation.</p>\n<p>The primary goal of the study was achieved, confirming the potential of replacing fresh water with TWW in concrete production. However, further research is needed to explore the impact of TWW on other concrete properties.</p>\n<p>This work was supported by the deanship of scientific research – Mutah University (grant numbers 704/2022).</p>\n<p><strong>REFERENCES</strong></p>\n<p>Ahmad, O.A. and Ayyad, S.M., 2021. Secondary treated wastewater as a concrete component and its impact on the basic strength properties of the material’, Archives of Civil Engineering, 67(1).</p>\n<p>Aldossary, M.H.A., Ahmad, S. and Bahraq, A.A., 2020. Effect of total dissolved solids-contaminated water on the properties of concrete’, Journal of Building Engineering, 32, Pp. 101496.</p>\n<p>Al-Ghusain, I. and Terro, M., 2003. Use of treated wastewater for concrete mixing in Kuwait’, Kuwait Journal of Science and Engineering, 30(1), Pp. 213–228.</p>\n<p>Al-Hamaiedeh, H.D., and Khushefati, W.H., 2013. Granite Sludge Reuse in Mortar and Concrete, Journal of Applied Sciences, 13(3), Pp. 444-450.<br />\nAl-Hamaiedh, H., 2010. Reuse of Marble Slime Sludge in Ceramic Industry, Jordan Journal of Civil Engineering, 4(3).</p>\n<p>Al-Jarajreh, S.S., Al-Hamaiedeh, H., Al-Khetan, M., Jwehan, Y., and Aljaafreh, T., 2023. Improvement of ornamental stones as sand replacement in concrete using silane coupling agent, Results in Engineering, DOI: 10.1016/j.rineng.101580.</p>\n<p>Al Swalqah, R.A., Al-Kheetan, M.J., Jweihan, Y.S., and Al-Hamaiedeh, H., 2023. Synergistic Effect of Treated Polypropylene-Based Disposable Face Masks on Durability and Mechanical Properties of Concrete’, Arabian Journal for Science and Engineering, Pp. 1-9.</p>\n<p>Al-Awabdeh, F.W., Al-Kheetan, M.J., Jweihan, Y.S., Al-Hamaiedeh, H., and Ghaffar, S.H., 2022. Comprehensive investigation of recycled waste glass in concrete using silane treatment for performance improvement’, Results in Engineering, 16, Pp. 100790.</p>\n<p>Bouaich, F.Z., Maherzi, W., El-Hajjaji, F., Abriak, N.E., Benzerzour, M., Taleb, M.and Rais, Z., 2022. Reuse of treated wastewater and non-potable groundwater in the manufacture of concrete: major challenge of environmental preservation’, Environmental Science and Pollution Research, 29, Pp. 146-157.</p>\n<p>British Standard Institution, 1983a. Testing concrete. Method for determination of slump’, BS Pp. 1881-102: 1983a.</p>\n<p>British Standards Institution. 2013. ‘BS 1881-125:2013: Testing Concrete Methods for Mixing and Sampling Fresh Concrete in the Laboratory’, London.</p>\n<p>Ghafoor, S., Hameed, A., Shah, S.A., Azab, M., Faheem, H., Nawaz, M.F. and Iqbal, F., 2022. Development of construction material using wastewater: an application of circular economy for mass production of bricks’, Materials, 15(6), Pp. 2256.</p>\n<p>MWI. 2016. National Water Strategy 2016–2025.</p>\n<p>MWI. 2021. The Annual Water Book – Water Year 2020-2021.</p>\n<p>MWI. 2023. National Water Strategy 2023-2040.</p>\n<p>Varshney, H., Khan, R.A. and Khan, I.K., 2021. Sustainable use of different wastewater in concrete construction: A review, Journal of Building Engineering, 41, Pp. 102411.</p>\n<p>Yao, X., Xu, Z., Guan, J., Liu, L., Shangguan, L. and Xi, J., 2022. Influence of wastewater content on mechanical properties, microstructure, and durability of concrete’, Buildings, 12(9), Pp. 1343</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>454-460</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>4</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8836\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/4wcm2024/4wcm2024-454-460.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Sani","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"a709d8a89768cc41c804fa66e1ef4baa951cf4f8a9078901d79a6ee54ad856da","category":"Environment"}