{"title":"ByteDance เริ่มแล้ว ห้ามทำงานเกิน 9 ชั่วโมง หยุดเสาร์-อาทิตย์ ต้องขออนุญาตหากทำเกินเวลา","link":"https://www.blognone.com/node/125612","date":1635820920000,"content":"<div><div><div><p>วัฒนธรรมการทำงานหนักในวงการเทคโนโลยีจีนหรือ 996 (ทำงานตั้งแต่ 9.00 – 21.00 น. 12 ชั่วโมงต่อวัน และ 6 วันต่อสัปดาห์) กำลังถูกตั้งคำถามเรื่องสิทธิแรงงาน หนึ่งในประเด็นที่รัฐบาลพยายามควบคุมบริษัทเทคโนโลยีจีน มีเรื่องการทำงานหนักนี้ด้วย</p>\n<p>ล่าสุด ByteDance เจ้าของแอป TikTok เริ่มกำหนดนโยบาย ห้ามพนักงานทำงานเกินวันละ 9 ชั่วโมง และหากต้องทำงานล่วงเวลา ต้องขออนุญาตล่วงหน้าอย่างน้อยหนึ่งวัน และจะได้รับค่าชดเชยสูงสุดสามเท่าของค่าจ้างปกติสำหรับการทำงานล่วงเวลาโดย ByteDance ถือเป็นบริษัทเทคโนโลยีจีนรายแรกๆ ที่ออกมาประกาศนโยบายลดเวลาการทำงาน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/66e4eb3e8828577c7e87aa1010d48b0f.jpeg\" /></p>\n<p>ช่วงต้นปีที่ผ่านมา Kuaishou Technology บริษัทโซเชียลมีเดียอีกแห่งของจีน ยกเลิกนโยบายให้พนักงานสลับวันหยุดที่พนักงานจะได้หยุดพักเพียงหนึ่งวันต่อสัปดาห์</p>\n<p>วัฒนธรรม 996 ได้รับการเชิดชูในหมู่ผู้นำเทคโนโลยีจีนอย่าง แจ็ค หม่า แห่งอาลีบาบา เขาเคย<a href=\"https://www.blognone.com/node/109158\">พูดปกป้องวัฒนธรรมนี้</a>เมื่อ 3 ปีก่อนว่า มีแต่คนที่ยอมจ่าย ด้วยการทำงานหนัก เท่านั้นที่จะได้รางวัลในท้ายที่สุด และคนที่จะมาทำงานอาลีบาบาต้องพร้อมที่จะทำงานวันละ 12 ชั่วโมง</p>\n<p>รัฐบาบจีนเองก็พยายามควบคุมบริษัทจีนในหลายด้าน <a href=\"https://www.blognone.com/node/123716\">หนังสือพิมพ์ CPPCC ของพรรคคอมมิวนิสต์จีนเผยแพร่บทความของ Ling Zhenguo</a> รองประธานกรรมาธิการด้านประชาชน, ทรัพยากร, และสิ่งแวดล้อม วิจารณ์ถึงแนวทางของบริษัทไอทีจีนที่มักใช้งานพนักงานอย่างหนัก ระบุว่าการใช้คนเยี่ยงเครื่องจักรนั้นไม่สอดคล้องกับแนวทางสังคมนิยมของจีน</p>\n<p>ที่มา - <a href=\"https://www.straitstimes.com/asia/east-asia/tiktok-owner-bytedance-limits-work-day-to-9-hours-in-blow-to-996-culture\">The Strait Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bytedance\">ByteDance</a></div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/china\">China</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a70b774858ce0f6ac15d0afe626a020ec8bdb8d71491f3cb678bfeecf42b1e83","category":"Thai"}