{"title":"เปิดตัว Windows 11 SE สำหรับภาคการศึกษา เน้นใช้เว็บ นักเรียนลงแอพเองไม่ได้","link":"https://www.blognone.com/node/125756","date":1636507993000,"content":"<div><div><div><p>ไมโครซอฟท์เปิดตัว Windows 11 SE ระบบปฏิบัติการรุ่นพิเศษที่จับตลาดการศึกษาโดยเฉพาะ สิ่งที่แตกต่างจาก Windows 11 รุ่นปกติมีด้วยกัน 2 เรื่องใหญ่ๆ</p>\n<p>อย่างแรกคือการปรับแต่งมาเพื่อพีซีสเปกต่ำ ราคาถูกระดับ 249 ดอลลาร์ เพื่อแข่งขันกับ Chromebook โดยมีบริษัทพีซีหลายเจ้าประกาศออกสินค้าที่เป็น Windows 11 SE เช่น Acer, ASUS, Dell, Dynabook, Fujitsu, HP, JP-IK, Lenovo, Positivo รวมถึง Surface Laptop SE ของไมโครซอฟท์เอง</p>\n<p>อย่างที่สองคือ เน้นการใช้งานเว็บเบราว์เซอร์เป็นหลัก (ซึ่งงานส่วนใหญ่ของโรงเรียนใช้ผ่านเว็บอยู่แล้ว) นักเรียนไม่สามารถลงแอพใดๆ เพิ่มได้เองเลย และแอดมินของโรงเรียนสามารถติดตั้งแอพเฉพาะที่ไมโครซอฟท์อนุญาตเท่านั้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a76645bed0bd4aabf33d5887b5f259fe.jpg\" /></p>\n<p>แนวทางนี้ต่างจากในอดีตที่ไมโครซอฟท์เคยพยายามทำ <a href=\"https://www.blognone.com/node/92061\">Windows 10 S ที่มี S Mode</a> รันได้เฉพาะแอพจาก Microsoft Store เท่านั้น (ซึ่งล้มเหลว) การกลับมารอบนี้ ไมโครซอฟท์ไม่มี Microsoft Store มาให้ แต่อนุญาตให้ติดตั้งแอพแบบเนทีฟ x86 ที่อยู่นอก Microsoft Store ได้ด้วย แต่เฉพาะใน 6 หมวดที่กำหนด ได้แก่</p>\n<ol>\n<li>Content-filtering apps</li>\n<li>Test-taking solutions</li>\n<li>Accessibility apps</li>\n<li>Effective classroom communication apps</li>\n<li>Essential diagnostics, management, connectivity, and supportability apps</li>\n<li>Browsers</li>\n</ol>\n<p>ตอนนี้ยังไม่มีรายชื่อแอพเป็นรายตัว แต่แอพที่ไมโครซอฟท์ระบุชื่อแล้วว่าทำได้แน่ๆ คือ Chrome และ Zoom (และยังมี Microsoft Office ติดตั้งมาให้แต่แรก)  เพราะมองว่าเป็นแอพที่จำเป็นสำหรับการใช้งานในห้องเรียน กระบวนการติดตั้งแอพและจัดการเครื่องจะต้องทำผ่าน Microsoft Intune for Education (ไมโครซอฟท์ระบุว่าถ้าอยากได้ฟีเจอร์ติดตั้งแอพตามปกติ ก็มี Windows 11 Pro Education ให้อยู่แล้ว)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/32bf118bd237c06cf5280b5c95d44996.jpg\" /></p>\n<p>การเปลี่ยนแปลงอื่นๆ คือ รองรับการเปิดแอพแบบเต็มหน้าจอ, ไม่มีฟีเจอร์ widget ของ Windows 11 มาให้ด้วย, Microsoft Edge รองรับส่วนขยายของ Chrome (ซึ่งโรงเรียนนิยมใช้กัน) เป็นค่าดีฟอลต์, เปิดใช้การเก็บไฟล์บน OneDrive โดยจะซิงก์ไฟล์ในเครื่องให้ทำงานออฟไลน์ได้</p>\n<p>Windows 11 SE เน้นขายตลาดภาคการศึกษา ไม่ขายปลีกสำหรับผู้ใช้ทั่วไป และไม่สามารถอัพเกรดจาก Windows 10 หรือ Windows 11 รุ่นปกติได้</p>\n<p>ที่มา - <a href=\"https://educationblog.microsoft.com/en-us/2021/11/imagining-a-new-era-of-education\">Microsoft</a>, <a href=\"https://www.microsoft.com/en-us/education/products/windows-11-se\">Microsoft</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/windows-11\">Windows 11</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div><div><a href=\"/topics/education\">Education</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a70c75d078e5792d6e5ac5e9b46ed46a13e76310d1c205f241bcdecf939d4ebc","category":"Thai"}