{"title":"Effect of exogenous melatonin on the cellular response of Holstein heifer calves during vaccination","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae028/7618084?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Despite rigorous vaccination protocols, calf morbidity is the primary contributor to economic loss in the calf sector of the dairy industry. Melatonin has modulated immune response in other mature animal species. We hypothesized that exogenous melatonin may improve the cellular response to vaccination in dairy calves. Our objective was to evaluate the effect of exogenous melatonin on polymorphonuclear leukocyte (<strong>PMN</strong>) function in Holstein heifer calves during immunization. Sixty neonatal Holstein heifers were enrolled by birth cohort (block) and randomized to one of four treatments: control (<strong>CON</strong>), vaccination of 0.5 mg ovalbumin on days 0 and 21 (<strong>VAC)</strong>, implantation of 24 mg melatonin on day 0 (<strong>MEL</strong>), or both melatonin and vaccine treatments (<strong>MVAC</strong>). Jugular blood was collected on days 0, 21, 42, and 63 to measure circulating melatonin, anti-ovalbumin immunoglobulin-G, and PMN function. Calves implanted with melatonin had greater circulating melatonin than non-implanted on day 21 (<span>P</span> &lt; 0.01). Anti-ovalbumin IgG was greater for vaccinated than non-vaccinated calves (<span>P</span> &lt; 0.01). Anti-ovalbumin IgG was greater for MVAC than VAC calves on day 63. Percent of cells and mean florescence intensity of cells performing oxidative burst decreased from day 0 to day 63 (<span>P</span> &lt; 0.01) but were not affected by treatment (<span>P ≥ </span>0.26). There was a tendency (<span>P</span> = 0.10) for an interaction of melatonin, vaccination, and day for the mean florescence intensity of cells performing phagocytosis where MVAC was greater than all other treatments on d 42. Exogenous melatonin may alter PMN function of calves during vaccination. Further research is needed to define the effect of melatonin on development of antigen-specific IgG during programmed vaccination protocols.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"a711b8f92532372ea8785feb4d9b97f9d2f3832da8d597d4b6b5c702ece26fce","category":"Environment"}