{"title":"Deciphering Acid Etching-Induced Anisotropic Shape Transformation of ZnO Nanorods via In Situ Liquid Cell TEM","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.842/7720138?rss=1","date":1721779200000,"content":"<span>Wet chemical etching of metals and ceramics is a significant technique that enables surface cleaning, micromachining, and engineering of various desired surface and bulk features [<a href=\"#ozae044.842-B1\">1</a>]. It is critical to control various etching parameters, such as etchant concentration, etching duration and temperature in order to achieve different shaped structures and devices. Nevertheless, the microscale shape and size evolution of semiconducting solids such as zinc oxide during wet etching process is less understood owing to the challenge of complex etching mechanism and the limited resolution for visualization in acidic liquid mediums. Recently, the <span>in situ</span> liquid cell transmission electron microscopy (LCTEM) has emerged as a powerful characterization method for directly observing the morphology evolution of nanocrystals in the liquid phase [<a href=\"#ozae044.842-B2\">2</a>]. Based on this state-of-the-art technique, many researchers have uncovered different types of shape transformations and etching mechanisms of metals and ionic compounds, such as oxidation etching, Galvanic replacement reaction, and electron beam irradiation [<a href=\"#ozae044.842-B2\">2-3</a>]. However, it is important to note that the LCTEM observation of acidic or basic etching may be influenced by the protons generated from water radiolysis due to the electron beam effect. Consequently, the evolution and mechanisms of acidic etching-induced ionic crystal nanostructure are less understood. Therefore, further investigation into the mechanisms underlying the shape transformation would facilitate better design and fabricate the ionic compound nanostructures.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"a712caab0f20cae27fd30d640cef021a87f4e8c4e040be99955cfa125cc2d937","category":"Environment"}