{"title":"High-intensity focused ultrasound ablation combined with immunotherapy for treating liver metastases: A prospective non-randomized trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306595","date":1720188000000,"content":"<p>by Xiyue Yang, Yao Liao, Lingli Fan, Binwei Lin, Jie Li, Danfeng Wu, Dongbiao Liao, Li Yuan, Jihui Liu, Feng Gao, Gang Feng, Xiaobo Du</p>\r\nPurpose <p>Given the unique features of the liver, it is necessary to combine immunotherapy with other therapies to improve its efficacy in patients of advanced cancer with liver metastases (LM). High-intensity focused ultrasound (HIFU) ablation is now widely used in clinical practice and can enhanced immune benefits. The study is intended to prospectively evaluate the safety and clinical feasibility of HIFU ablation in combination with systemic immunotherapy for patients with liver metastases.</p> Methods <p>The study enrolled 14 patients with LM who received ultrasound-guided HIFU ablation combined with immune checkpoint inhibitors (ICIs) such as anti-programmed cell death protein 1 (anti-PD-1 agents manufactured in China) at Mianyang Central Hospital. Patients were followed up for adverse events (AEs) during the trial, using the CommonTerminology Criteria for Adverse Events v5.0(CTCAE v5.0) as the standard. Tumour response after treatment was assessed using computerized tomography.</p> Results <p>The 14 patients (age range, 35–84 years) underwent HIFU ablation at 19 metastatic sites and systemic immunotherapy. The mean lesion volume was 179.9 cm3 (maximum: 733.1 cm3). Median follow-up for this trial was 9 months (range: 3–21) months. The study is clinically feasible and acceptable to patients.</p> Conclusion <p>This prospective study confirmed that HIFU combined with immunotherapy is clinically feasible and safe for treating liver metastases.</p>","author":"Xiyue Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a713c7e6c973fd8abda6999e6da2b91de1dca4752b81b527e7d2202f5aa61849","category":"Interdisciplinary"}