{"title":"Improving care pathways for children with severe illness through implementation of the ASPIRE mHealth primary ETAT package in Malawi","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002786","date":1714399200000,"content":"<p>by Nicola Desmond, Marc Y. R. Henrion, Mtisunge Gondwe, Thomasena O’Byrne, Pui-Ying Iroh Tam, Deborah Nyirenda, Louisa Pollock, Maureen Daisy Majamanda, Martha Makwero, Marije Geldof, Queen Dube, Chimwemwe Phiri, Chimwemwe Banda, Rabson Kachala, Prof Robert S. Heyderman, Clemens Masesa, Norman Lufesi, David G. Lalloo</p>\r\n\r\nProviding emergency care in low resource settings relies on delivery by lower cadres of health workers (LCHW). We describe the development, implementation and mixed methods evaluation of a mobile health (mHealth) triage algorithm based on the WHO Emergency, Triage, Assessment, and Treatment (ETAT) for primary-level care. We conducted an observational study design of implementation research. Key stakeholders were engaged throughout implementation. Clinicians and LCHW at eight primary health centres in Blantyre district were trained to use an mHealth algorithm for triage. An mHealth patient surveillance system monitored patients from presentation through referral to tertiary and final outcome. A total of 209,174 children were recorded by ETAT between April 2017 and September 2018, and 155,931 had both recorded mHealth and clinician triage outcome data. Concordance between mHealth triage by lower cadres of HCW and clinician assessment was 81·6% (95% CI [81·4, 81·8]) over all outcomes (kappa: 0·535 (95% CI [0·530, 0·539]). Concordance for mHealth emergency triage was 0.31 with kappa 0.42. The most common mHealth recorded emergency sign was breathing difficulty (74·1% 95% CI [70·1, 77·9]) and priority sign was raised temperature (76·2% (95% CI [75·9, 76·6]). A total of 1,644 referrals out of 3,004 (54·7%) successfully reached the tertiary site. Both providers and carers expressed high levels of satisfaction with the mHealth ETAT pathway. An mHealth triage algorithm can be used by LCHWs with moderate concordance with clinician triage. Implementation of ETAT through an mHealth algorithm documented successful referrals from primary to tertiary, but half of referred patients did not reach the tertiary site. Potential harms of such systems, such as cases requiring referral being missed during triage, require further evaluation. The ASPIRE mHealth primary ETAT approach can be used to prioritise acute illness and support future resource planning within both district and national health system.","author":"Nicola Desmond","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a7145ffc4c52d6797c09c88cb7e544caa48d57651428492210530ed7bcae555e","category":"Environment"}