{"title":"Calm, calm, carnage: the lucky and the unlucky at the Giro d'Italia","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/anything-can-happen-luck-giro-ditalia-2023-stage-two","date":1683483735000,"content":"\n      <p>For a maxim to really catch on, for it to really be used liberally and universally, its message has to contain a great deal of truth. And there’s no phrase more overused in Grand Tour bike racing than someone proclaiming that in order to win a three week long race you need to have luck on your side.</p>\n<div></div>\n<p>It’s a tired expression, one that every bike rider and commentator will repeatedly utter without often even realising they’re saying it, but on stage two of the Giro d’Italia it rang deafeningly true.</p>\n<p>For after 198km of serenity (better to say boredom?) a snoozy day’s ride south down the Adriatic Coast sparked into life with a crash near the front of the peloton that denied the race a bunch sprint with its two headline fast men, and had consequences, albeit minor, in the general classification standings.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-three-preview\"><strong><em>Read more: Giro d'Italia 2023 stage three preview - a complicated route south</em></strong></a></p>\n<p>Mark Cavendish and Mads Pedersen were held up behind the crash that saw Max Kanter of Movistar and Martijn Tusveld of DSM collide, but while they’ll have been no doubt seething with anger, they’ll get plenty more chances to win a stage.<br />Most significantly, Tao Geoghegan Hart, so excellent <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/will-the-2023-giro-ditalia-be-the-evenepoel-v-roglic-duel-we-all-expected\">in stage one’s time trial</a>, and Jay Vine, seventh overnight, won’t be able to make up the 19 seconds of time they lost in the GC fight so easily.</p>\n<p>Geoghegan Hart’s teammate Geraint Thomas, so often in the past the victim of such incidents, was alright, unscathed, and so too was the leader Remco Evenepoel and his expected main rival Primož Roglič. But Brandon McNulty, one of three options for UAE Team Emirates, was not quite as lucky, ceding 12 seconds.</p>\n<p>Time and time again in a three week race a crash that no one could foresee takes someone out. This time, the time losses were not so great, yet it is noteworthy that we witnessed one on just the second stage.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_2813.jpg?v=1683483580\" alt=\"Giro d'Italia stage two\" /></p>\n<p>But that’s bike racing. Turning up and performing is not luck, that comes down to preparation and an ability to produce when it matters, but avoiding a clip of the wheels or unexpected movement in the peloton often comes down to whether fortune is on your side or not.</p>\n<p>Evenepoel pointedly said in the aftermath that the peloton “knows who we can blame” for the crash, eventually revealing he meant Kaden Groves (Alpecin-Deceuninck) who it appeared deviated from his position in the bunch, thus eventually forcing the accident on the narrow stretch of road.</p>\n<p>But one man’s misfortune is another man’s golden chance, and while both Cavendish, Pedersen, Geoghegan Hart and co. were left furiously chasing the peloton, it opened up the door to others to have their moment of glory.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_2788.jpg?v=1683483697\" alt=\"Giro stage two\" /></p>\n<p>It was Jonathan Milan, just 22 and making his Grand Tour debut, who seized the chance, appearing late to win from Kaden Groves, the man who had been afforded a near-perfect leadout from his Alpecin-Deceuninck team-mates.</p>\n<p>On a day when the headline news was a crash, Bahrain-Victorious’ Milan wrote his first chapter in what could be a very successful Grand Tour career. For the others, it was just simply a reminder, a sobering one, that even on the most sleepy of days that seem designed to encourage fans at home to keep riding their own bikes instead of tuning in to watch the pros, that anything can happen in Grand Tour racing.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a71c17983cbb97e18735f932b4bbe7406efa2bbb78f2a404c39e3aac44202545","category":"Cycling"}