{"title":"Tour de la Provence underway, Vuelta a España route unveiled: Daily News","link":"https://cyclingtips.com/2021/02/tour-de-la-provence-underway-vuelta-a-espana-route-unveiled-daily-news/","date":1613083766000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Thursday brought the unveiling of the 2021 Vuelta a España route, which will conclude with a time trial for the first time in several years, and the start of the Tour de la Provence, where Davide Ballerini won the opening stage in a sprint.</p>\n\n\n\n<p>Away from the 2021 road calendar, Formula 1 star Fernando Alonso suffered a fractured jaw when he was hit by a car while out riding his bike.</p>\n\n\n\n<p>Until next time, readers.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Davide Ballerini wins Tour de la Provence opener</h3>\n\n\n\n<p>Davide Ballerini won the opening stage of the Tour de la Provence on Thursday.</p>\n\n\n\n<p>The 182.3 km day of racing from Aubagne to Six-Fours-les-Plages featured an intriguing final hour and a half of racing as Julian Alaphilippe, Gianni Moscon, and Giulio Ciccone jumped off the front and held on to within the last 2 km before they were caught. Arnaud Démare took an early lead in the ensuing sprint, but Ballerini closed him down and surged past to take the victory at the line.</p>\n\n\n\n<p>Démare settled for second with Nacer Bouhanni in third. Ballerini will take the leader&#8217;s jersey into Friday&#8217;s stage 2.</p>\n\n\n\n<h3>2021 Vuelta route unveiled</h3>\n\n\n\n<p>Vuelta a España organizers <a href=\"https://cyclingtips.com/2021/02/vuelta-a-espana-2021-route-revealed/\" target=\"_blank\" rel=\"noreferrer noopener\">revealed the route</a> of the 2021 edition of the race on Thursday, confirming that the Spanish Grand Tour will feature plenty of tough climbs, particularly in the final week, and conclude with a time trial.</p>\n\n\n\n<p>The race will get underway with a time trial in Burgos. Over the next three weeks, riders will tackle a total of 45 categorized climbs, with three special-category ascents, two of them mountaintop finishes in the last week. Stage 17 will finish atop the Lagos de Covadonga climb and the stage 18 will finish atop the Alto d’El Gamoniteiru. The race will head into Galicia for its finale, closing out with a 33.7 km time trial in Santiago de Compostela.</p>\n\n\n\n<h3>Fernando Alonso hit by car while riding his bike</h3>\n\n\n\n<p>Formula 1 star Fernando Alonso was <a href=\"https://cyclingtips.com/2021/02/formula-1-star-fernando-alonso-hit-by-a-car-while-riding/\" target=\"_blank\" rel=\"noreferrer noopener\">hit by a car while out riding his bike</a> on Thursday.</p>\n\n\n\n<p>Alonso&#8217;s Alpine F1 team said on Twitter that Alonso was conscious and &#8220;awaiting further medical examination&#8221; after he was hit while riding in Switzerland. La Gazzetta dello Sport reports that the 39-year-old Spaniard suffered a fractured jaw and damage to his teeth.</p>\n\n\n\n<h3>Strade Bianche announces women&#8217;s team selection</h3>\n\n\n\n<p>Strade Bianche organizers have announced the 23 teams that will race this year&#8217;s edition of the event, which will take place on March 6.</p>\n\n\n\n<p>Joining the nine WorldTour squads will be A.R. Monex, Aromitalia-Basso Bikes-Vaiano, Bepink, Born To Win G20 Ambedo, Ceratizit-WNT, Isolmant-Premac-Vittoria, Jumbo-Visma, Lotto Soudal, Massi-Tactic, Parkhotel Valkenburg, Servetto-Mahkymo-Beltrami TSA, Tibco-SVB, Top Girls Fassa Bortolo, and Valcar-Travel &amp; Service.</p>\n\n\n\n<h3>Matteo Trentin frustrated with rider response to rule updates</h3>\n\n\n\n<p>Several pros have said recently that they did not feel that they had a chance to be involved in the decision-making process that led to the UCI&#8217;s recent announcement that it would soon start sanctioning riders for taking certain positions on the bike, like the so-called &#8220;super tuck&#8221; position. Matteo Trentin, however, has told <a href=\"https://www.cyclingnews.com/news/trentin-hits-back-at-rider-criticism-of-uci-super-tuck-ban/\" target=\"_blank\" rel=\"noreferrer noopener\">Cyclingnews</a> that riders were given information about the proposed changes late last year.</p>\n\n\n\n<p>Trentin and Philippe Gilbert represented riders at UCI stakeholder meetings, and Trentin said that riders were sent messages informing them of the changes discussed during those meetings in November and December.</p>\n\n\n\n<p>“I’m sorry to say that they need to check their emails and download the new rules. To tweet that they were not informed is easy but emails were sent to over 800 riders and I can tell you that only 16 riders downloaded the information. If someone wanted to disagree when the proposals were made, they had many chances but there was very little response,&#8221; Trentin told Cyclingnews.</p>\n\n\n\n<p>“I’m quite angry about what is now being said. Previously we could have said that the communication wasn’t the best and that riders weren’t informed, but this time that’s not the case. This time it was all clear.&#8221;</p>\n\n\n\n<p>“I don’t know who they want to blame but it can’t be me, Phil (Gilbert) or the CPA. Not this time. Maybe riders should spend less time on TikTok and be more proactive when it comes to making their workplace a safer place.”</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>A beginner&#8217;s guide to choosing a road bike</h3>\n\n\n\n<p>Dave Rome has some advice on what to consider when <a href=\"https://cyclingtips.com/2021/02/a-beginners-guide-to-choosing-a-road-bike/\" target=\"_blank\" rel=\"noreferrer noopener\">selecting a new road bike</a>.</p>\n\n\n\n<h3>In the fight against climate change, should bikes be more like cars?</h3>\n\n\n\n<p>Ronan Mc Laughlin wonders whether the cycling industry could <a href=\"https://cyclingtips.com/2021/02/in-the-fight-against-climate-change-should-bikes-be-more-like-cars/\" target=\"_blank\" rel=\"noreferrer noopener\">look to the automotive industry</a> for ways to meet rising demands while managing environmental impact of increased supply.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/tour-de-la-provence-underway-vuelta-a-espana-route-unveiled-daily-news/\">Tour de la Provence underway, Vuelta a España route unveiled: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a72ddc3ecd9d5874d70ce1eb028e4de649328ad08d4f1173efcfd1c374fcbb49","category":"Cycling"}