{"title":"Giant’s 2024 road bike category explained: how to choose between the Defy, TCR and Propel","link":"https://www.bikeradar.com/advertising-feature/tcr-vs-defy-vs-propel/","date":1698667213000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Giant-Defy-Advanced-MY24-Defy-Advanced-SL-action-1-a707285.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Giant Defy Advanced SL in action\" title=\"Giant Defy Advanced MY24 - Defy Advanced SL action 1\" />                                            <p>Giant offers a wide range of performance road bikes to suit every cyclist’s ambitions.</p>\n<p>While they may look similar at first glance, each has been optimised to meet the needs of different riders.</p>\n<p>Whether you seek out the most challenging climbs, relish the thought of a flat sprint or see yourself as more of an all-rounder, you’ll find an option within the Giant road category for you and your preferred riding.</p>\n<p>In this guide, we’ll talk you through Giant’s performance <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a> category, introduce the three ranges, and delve into more detail on construction, aerodynamics, tyre clearance and specifications, before summing up which bike is right for you.</p>\n<h2>Introducing the Giant Defy, Propel and TCR</h2>\n<h3>Defy</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant Defy Advanced SL in action\" title=\"Giant Defy Advanced MY24 - Defy Advanced SL action 2\" />\n\n</div><div><figcaption><span><i></i> The Defy is Giant’s endurance road bike.</span></figcaption><span> <i>Giant</i></span></div>\n<p><a href=\"https://www.giant-bicycles.com/global/defy?utm_source=bikeradar&amp;utm_medium=affiliate&amp;utm_content=global-global-advertorial\" target=\"_blank\">The Defy</a> is Giant’s flagship endurance road bike range, designed to take on long days in the saddle with comfort and efficiency.</p>\n<p>Using a combination of compliant design and large tyre clearance, it’s designed to smooth out rough roads and minimise the fatigue brought on by big days in the saddle.</p>\n<p>It’s also lightweight, which could make it a perfect partner for your next sportive or endurance event.</p>\n<h3>Propel</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"2023 Giant Propel Advanced SL 0\" title=\"2023 Giant Propel Advanced SL 0\" />\n\n</div><div><figcaption><span><i></i> The Propel is the brand’s specialist aero bike.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p><a href=\"https://www.giant-bicycles.com/global/propel?utm_source=bikeradar&amp;utm_medium=affiliate&amp;utm_content=global-global-advertorial\" target=\"_blank\">The Propel</a> is Giant’s most aerodynamic road range. It’s for the sprinters, the racers and the riders who prioritise aerodynamic efficiency over all else.</p>\n<p>It’s intended to save every last watt of energy in the pursuit of maximum speed.</p>\n<h3>TCR</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley in BikeRadar kit riding a Giant TCR up a climb\" title=\"16-54-48_SNY0526\" />\n\n</div><div><figcaption><span><i></i> The TCR is Giant’s all-rounder platform, and its lightest bike.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p><a href=\"https://www.giant-bicycles.com/global/tcr?utm_source=bikeradar&amp;utm_medium=affiliate&amp;utm_content=global-global-advertorial\" target=\"_blank\">The TCR</a> is Giant’s legendary all-rounder race bike range. It’s been a staple within the pro peloton since its inception way back in 1998, aiding riders towards countless race wins.</p>\n<p>Whereas the Propel is intended to excel on the flattest and fastest courses, the TCR is designed to be as efficient across a range of terrain.</p>\n<p>The frame features what Giant claims to be class-leading stiffness-to-weight ratio, enabling it to excel in the mountains.</p>\n<p>Unlike the climbing bikes of yesteryear, the TCR is aerodynamically optimised too, so it’s no slouch on the flats.</p>\n<h2>Frame construction</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant Defy Advanced SL 0 road bike\" title=\"Giant Defy Advanced SL 0 - 11\" />\n\n</div><div><figcaption><span><i></i> The Defy, TCR and Propel are all carbon.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>All models in these three ranges use a full carbon composite construction in the frame and fork. All are available in three levels of composite construction: Advanced, Advanced Pro and Advanced SL.</p>\n<p>Giant’s Advanced level of construction features an in-house-built, full-composite frame and fork for outstanding stiffness-to-weight ratios and attainable pricing.</p>\n<p>The Advanced Pro series of all three ranges also features an in-house-built Advanced-level frame, but with the addition of a lighter-weight Advanced SL level fork.</p>\n<p>The top-of-the-line Advanced SL series of all three ranges features the extremely light and stiff, in-house-built, Advanced SL frame and fork – at a premium price.</p>\n<p>Giant doesn’t list official weights for its bikes, suggesting that visiting your local dealer and having them weigh your preferred size, colour and spec option is the best way to get an accurate number.</p>\n<h2>Aerodynamics</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Miachael Matthews' 2023 World Championships Giant Propel Advanced SL (4 of 14)\" title=\"Miachael Matthews' 2023 World Championships Giant Propel Advanced SL (4 of 14)\" />\n\n</div><div><figcaption><span><i></i> The Propel is Giant’s bike of choice for sprinters such as Michael Matthews.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The Propel is the most aerodynamic of the three ranges.</p>\n<p>It is designed to save every last watt of drag in order to give sprinters, such as Dylan Groenewegen and Michael Matthews, the competitive edge they need to excel in the world’s toughest races.</p>\n<p>Its frame is designed using a combination of computational fluid dynamics and wind tunnel testing.</p>\n<p>In the wind tunnel, Giant uses a dynamic mannequin to analyse the bike in combination with its rider, and claims drag improvements of 6.21 watts over the outgoing model. This equates to a significant saving of 27 seconds over 40km at 40kph.</p>\n<p>The TCR takes what Giant learnt through the design of the Propel, such as the truncated ellipse-shaped tubing, interface between the front brake caliper and fork, and the aerodynamically optimised bar and stem.</p>\n<p>However, it utilises these features within a lighter-weight package. This results in an aerodynamically efficient bike that retains its climbing prowess.</p>\n<p>By comparison, the Defy has been engineered with comfort and compliance first and foremost.</p>\n<p>Giant doesn’t make any claims about the aerodynamic performance of the Defy, though its hidden cables and sleek design suggest it’s likely to be faster in the wind tunnel than the endurance bikes of days gone by.</p>\n<h2>Tyre clearance</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant TCR Advanced Pro 2 Disc fork clearance\" title=\"20210412_SB_5DSR_MG_4072\" />\n\n</div><div><figcaption><span><i></i> The TCR has clearance for up to 32mm tyres.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>The tyre clearance of the three bikes aligns broadly with their intentions, with the Propel fitting a maximum of 30mm wide, the TCR 32mm and the Defy a chunky 38mm.</p>\n<p>With most racers opting for 28-30mm tyres, the Propel and TCR will have ample clearance for those seeking minimum rolling resistance. If you’re looking for a more plush ride to handle the longest days and roughest roads, the larger rubber of the Defy will be invaluable.</p>\n<h2>Specifications</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant Defy Advanced 3 road bike\" title=\"Giant Defy Advanced MY24 - Advanced 3\" />\n\n</div><div><figcaption><span><i></i> From entry-level builds to dream-spec models, Giant’s road bikes are available at a wide range of price points.</span></figcaption><span> <i>Giant</i></span></div>\n<p>The Propel is available in a wide range of build options, depending on your country of residence.</p>\n<p>Ranging from modest price points beginning at the Advanced level and reaching professional-level prices and performance at the Advanced SL level, all Propel models feature deeper-dish, 50mm rims, aerodynamic cable routing and a fully optimised aerodynamic frame and fork.</p>\n<p>The TCR range is available at an even wider price spectrum – with individual models available to suit different riders’ price points and performance needs. Every model features the lightest available component build for the respective price – each with wide-range capability on climbs, descents and sprints.</p>\n<p>The endurance-focused Defy range also offers a wide range of price options – each bringing a mix of comfort, efficiency and control – over the widest range of terrain. Giant D-Fuse handlebars and seatposts, featured across the range, provide a mix of comfort and efficiency to the all-day rider.</p>\n<h2>So, which bike is right for you?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant Defy Advanced SL 0 road bike\" title=\"Giant Defy Advanced SL 0 - 13\" />\n\n</div><div><figcaption><span><i></i> Deciding which bike is right for you depends on the type of riding you enjoy most.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Depending on the kind of riding you are most interested in, it should be a straightforward choice between the Propel, TCR and Defy.</p>\n<p>Looking for all-out speed and to save as many watts as possible? The Propel is the bike for you.</p>\n<p>Are your aims more endurance-based? If you’re less concerned with all-out speed and would rather cover the miles in comfort, consider the Defy.</p>\n<p>The venerable TCR fills the space between offering an all-round road package designed to excel across all terrain with speed and efficiency.</p>\n<p>Still struggling to choose? Take a look at our <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike buyer’s guide</a> for more information on road bike categories.</p>","author":"Rob Borek","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a736a0330cc25b661f5fea6e08fda629bcae5b8700c7d4717cfea66f41f4bd49","category":"Cycling"}