{"title":"อินเดียจ่อเก็บภาษี 28% กับบริษัทเกมที่ทำเกมออนไลน์","link":"https://www.blognone.com/node/134838","date":1689338052000,"content":"<div><div><div><p>อินเดียวางแผนจะเรียกเก็บภาษีจำนวนมากจากบรรดาบริษัทเกมออนไลน์ที่ได้รับรายได้มหาศาลจากเกมเมอร์ ซึ่งจะเป็นผลกระทบครั้งใหญ่ต่ออุตสาหกรรมเกมที่อินเดียที่กำลังเติบโตอย่างรวดเร็ว ซึ่งจะส่งผลให้เกิดหายนะ และขัดต่อรัฐธรรมนูญ</p>\n<p><strong>สภาภาษีสินค้า และบริการของอินเดีย (GST Council)</strong> ที่ประกอบไปด้วยรัฐมนตรีการคลังชั้นนำของรัฐบาลกลางกล่าวว่าได้ตกลงที่จะเรียกเก็บภาษี 28% จากเกมออนไลน์ประเภท คาสิโน และการแข่งม้า โดยสภามองไม่เห็นความต่างระหว่างเกมที่ใช้ทักษะ กับเกมที่ใช้การเสี่ยงดวง ซึ่งเป็นการปิดช่องโหว่ที่ทำให้เกมประเภทกีฬาแฟนตาซี ชอบอ้างว่าเกมของพวกเขาเป็นเกมที่ใช้ทักษะ</p>\n<p>เกมออนไลน์เป็นหนึ่งในธุรกิจที่เติบโตที่สุดในอินเดียเดีย ยกตัวอย่างเช่นบริษัท Dream Sports ที่ธุรกิจเกี่ยวกับเกมออนไลน์ประเภทกีฬาแบบแนตาซี ซึ่งได้รับการสนับสนุนจาก Tiger Global และ Alpha Wave Global มีมูลค่ามากกว่า 8 พันล้านดอลล่าร์สหรัฐ หรืออย่าง Mobile Premier League ที่ได้รับระดมทุนจำนวนหลายพันล้านจากผู้ใช้งานอินเตอร์เน็ตหลายรุ่นที่ติดการพนัน</p>\n<p>Nirmala Sitharaman รัฐมนตรีว่าการกระทรวงการคลังของอินเดียกล่าวในงานแถลงการนโยบายว่า GST จะทำงานอย่างใกล้ชิดกับกระทรวงไอทีในการแยกประเภทของเกมในหมวดหมู่เกมออนไลน์ เมื่อต้นปีที่ผ่านมาทางอินเดีย</p>\n<p>ทางด้าน Roland Landers ประธานเจ้าหน้าที่บริหารของ All India Gaming Federation ซึ่งเป็นองค์กรที่เป็นตัวแทนของบริษัทเกมออนไลน์ในอินเดีย ได้ออกมาตอบโต้ว่าการตัดสินใจของ GST นั้น ขัดต่อรัฐธรรมนูญ, ไร้เหตุผล และร้ายแรง โดย Roland Landers มองว่าการตัดสินใจครั้งนี้จะนำไปสู่การกวาดล้างอุตสาหกรรมเกมของอินเดีย และจะทำให้สูญเสียการจ้างงานนับแสนคน</p>\n<p><em>ภาพใช้สำหรับการประกอบข่าวเท่านั้น</em><br />\n<img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/63c0e0a2b0b6776ae671d98a11c40ed1.jpg\" /></p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2023/07/11/india-online-gaming-gst-tax/\">Tech Crunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/india\">India</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/online-gaming\">online gaming</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a743cb4275274bdb3bc6bb73234701a29c93a91a44904e1a686641e8ad380457","category":"Thai"}