{"title":"The Effects of Oxygen Supplementation Infrastructure on Farmed Atlantic Salmon (Salmo salar) Behavior Using Acoustic Telemetry","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6972744?af=R","date":1724680102000,"content":"<p>Climate change is leading to worldwide ocean temperature rise and increased occurrence of low oxygen events. Dissolved oxygen and water temperature play a crucial role in the growth and health of fish becoming determining factors of welfare. In order to counteract the effects of low oxygen events, farms worldwide have begun to experiment with oxygen supplementation systems. In this study, high-resolution, high-frequency acoustic tags were used to monitor the movement of Atlantic salmon (<i>Salmo salar</i>) at a commercial farm where an oxygen supplementation system was installed. A 2-month study period was selected, which allowed the characterization of fish movement during and after the oxygen supplementation project. The positioning of 15 fish was recorded using high temporal resolution (3 s). Fish movement was characterized by calculating four fish variables: velocity (ms<sup>−1</sup>), distance from the center of the cage (m), turning angle (°), and relative measurements of depth (m). During the oxygenation trial, all tagged individuals recorded slower swimming velocities than after the trial. Seventy-seven percent of the tagged population swam nearer to the cage edge during the trial than after, and 85% displayed straighter swimming patterns during the trial than after. Lastly, during the trial, 85% of the tagged population swam shallower than after the trial. Although causality cannot be related to the oxygen supplementation experiment due to the potential effect of confounding variables naturally occurring in the environment, this study highlights that increased farm technology can provide more insight into the effects of oxygenation systems on fish behavior.</p>","author":"Caitlin L. Stockwell, \nRamón Filgueira, \nJon Grant, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"a748994240896249bf1a9b3ccc3f4eddc723825518359cf0fdaf75f0031a705b","category":"Environment"}