{"title":"Towards zero extinction—A case study focusing on the plant genus Begonia in Thailand实现“零灭绝”——聚焦泰国秋海棠属植物的一个案例","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.67?af=R","date":1727440028000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d602bfd9-22fe-477d-bd84-d021a79f0207/inc367-gra-0001-m.png\" alt=\"Towards zero extinction—A case study focusing on the plant genus Begonia in Thailand 实现“零灭绝”——聚焦泰国秋海棠属植物的一个案例\" /><p>The study evaluates the conservation capacities for <i>Begonia</i> L. genus in Thailand, which is a vulnerable plant species. Results show that 78% of <i>Begonia</i> species in Thailand are classified as threatened, and the Northern floristic region is a hotspot for the genus. The study highlights the importance of evaluating current conservation capacities and implementing a multi-strategy approach to ensure their long-term viability and achieve the goal of zero species extinction.\n\n</p><br />\n<h2>Abstract</h2>\n<p>Plant species with small habitat ranges and specific edaphic requirements are highly vulnerable to extinction and thus require enhanced attention in biodiversity conservation. This study was designed to explore the challenges of protecting such plant species by evaluating the in situ and ex situ conservation capacities available for Thailand's species of the mega-diverse plant genus <i>Begonia</i> L. A comprehensive assessment of occurrence records across the country was conducted to evaluate the spatial distribution of <i>Begonia</i> diversity in Thailand, identify biodiversity hotspots, assess the extinction threats faced by the 60 <i>Begonia</i> species known in the country, and identify existing conservation capacities and potential gaps. The results show that 78% of <i>Begonia</i> species in Thailand are vulnerable to extinction, with the Northern floristic region identified as both a <i>Begonia</i> species hotspot and a region with major conservation gaps. While in situ conservation efforts have been successful in covering over 88% of the species, they have failed to provide the protection required to achieve zero extinction. Ex situ conservation capacities are poorly developed, with only 13% of species present in botanical gardens, and no seed banking or other related activities have been initiated. This evaluation presents a sharply contrasting message: on one hand, Thailand has assembled substantial capacities to protect these plants through established national parks and other protected areas, but on the other hand, essential capacities are still lacking to render the zero extinction target achievable. We advocate for the implementation of a multi-component conservation strategy to enable Thailand to move towards zero species extinction, even for plant species with narrow habitat ranges and high edaphic specialisation.</p>\n<h2>摘要</h2>\n<p>栖息地范围小且环境特异性高的植物物种面临极高的灭绝风险，因此需要在生物多样性保护方面给予更多关注。本研究的目的是通过评估就地和异地保护的能力，明确保护此类植物物种所面临的挑战，以保护泰国多样性极高的秋海棠属物种。为此，研究人员对泰国全国范围内的秋海棠物种出现记录进行了综合评估，以了解泰国秋海棠多样性的空间分布，确定生物多样性热点地区以及60个面临灭绝威胁的物种，并最终确定现有保护能力和保护的不足。结果表明，泰国78%的秋海棠物种濒临灭绝，而北部花卉区不仅是秋海棠物种的热点地区，也是主要的保护空白区。就地保护工作成功覆盖了88%以上的物种，但未能提供实现零灭绝所需的保护。异地保护能力很差，只有13%的秋海棠物种在植物园中展示，种子库及相关行动都尚未开展。本评估报告提供了一种“表里不一”的信息。一方面，泰国已经建立了国家公园和其他保护区，具备了保护这些植物的强大能力。另一方面，泰国仍然缺乏实现物种零灭绝目标的能力。在此，我们提倡实施多重保护的策略，进一步促使泰国实现物种零灭绝，即使是栖息地范围窄、环境特异性高的植物物种也不例外。【审阅:周聪】</p>","author":"Sirilak Radbouchoom, \nMarjorie D. delos Angeles, \nThamarat Phutthai, \nHarald Schneider","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"a748e999da00c48fccb342e1449f66e3a076307cfca00b6733e8c973c68db561","category":"Environment"}