{"title":"The next MacBook Air: Faster M2 chip might not arrive until 2022","link":"https://www.macworld.com/article/346119/2021-macbook-air-specs-colors-design-ports-magsafe-memory-m2-processor-price-release-date.html","date":1625575427000,"content":"\n<div>\n<section><div></div></section><p>Apple made some drastic changes when it launched the new MacBook Air in 2018, but other than the processor and the keyboard, there haven’t been any major improvements since. But if we can believe the latest rumors, that could be changing this year, as Apple prepared to launch a drastic overhaul to its cheapest notebook. Here’s everything we’ve heard about the new MacBook Air:</p>\n\n\n\n<h2>MacBook Air: The latest rumors</h2>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/dylandkt/status/1412089676220055555&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">Twitter user Dyan (@dylandkt) reports</a> that <strong>the MacBook Air will get the M2 chip</strong> rather than the heavily rumored M1X chip, which he says is “reserved for the Pro Mac devices.”</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-sd-card-reader-magsafe-price-release-date.html\">Supply chain reports suggest</a> Apple is focused on delivering the new 14-inch and 16-inch MacBook Pros in 2021 but rumors have dried up about a new MacBook Air. So it’s possible that <strong>the release date could slip to 2022</strong>.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman of Bloomberg</a> reported the “redesigned, higher-end MacBook Air” will have <strong>a new System on a Chip (SoC) that replaces the M1</strong>. The new SoC will be faster but have eight CPU cores (four performance cores, four efficiency cores) like the M1. The graphics cores will increase from seven or eight to nine or ten.</p>\n\n\n\n<p>In a previous report, Serial leaker Jon Prosser of Front Page Tech <a href=\"https://www.macworld.com/article/346093/the-next-macbook-could-have-white-bezels-to-match-the-imac.html\">heard</a> from “different sources” that <strong>Apple will release new laptops in various colors</strong> similar to that of the new <a href=\"https://www.macworld.com/article/344032/apple-24-inch-imac-display-m1-specs-storage-ports-ram-ethernet-colors-touch-id.html\">24-inch iMac</a>. Prosser reports that the keyboard will have full-sized function keys, a smaller trackpad, and two USB-C ports. Prosser didn’t report the size of the new laptop, though it will likely still be 13 inches. </p>\n\n\n\n<h2>MacBook Air: Name and price</h2>\n\n\n\n<p>We’re assuming for the sake of this article that Apple will stick with the MacBook Air name for the next revision, but Prosser noted that his sources haven’t confirmed that. So it’s possible that Apple reintroduces the MacBook, which was <a href=\"https://www.macworld.com/article/233004/apple-kills-macbook-non-touch-bar-macbook-pro-notebook-shakeup.html\">discontinued</a> in 2019 and <a href=\"https://www.macworld.com/article/350115/apple-designates-the-2015-macbook-as-vintage-as-rumors-swirl-about-its-return.html\">recently vintaged by Apple</a>. Apple sold the Air alongside the MacBook Air for a short time, so it’s also possible that the current Air either gets a price cut to make room for the new model at the $999 tier or sticks around at the same price as a cheaper option for a higher-priced MacBook.</p>\n\n\n\n<h2>MacBook Air: Design, and colors</h2>\n\n\n\n<p>It’s been reported for months that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-22/apple-aapl-plans-new-macbook-air-with-magsafe-macbook-pro-with-sd-card-slot&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">Apple is working on a lighter and thinner redesign</a> for the MacBook Air. More recently, serial leaker Jon Prosser reported on his Front Page Tech YouTube channel that the new MacBook Air will be switch to a flat design rather than the classic tapered look, but retain its incredible thinness. It could also have full-size function keys, which would make the trackpad slightly smaller.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/prosser-macbook-colors.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/RendersbyIan&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">@rendersbyian</a></div>\n\n\n\n<p>Apple will be making several colors for the MacBook Air, according to Prosser, likely in hues to match the new iMac, so green, blue, yellow, orange, pink, purple, and silver. Prosser also reports the bezels will be thinner and switch from black to white while the bottom will gain two rubber strips instead of the standard circular feet.</p>\n\n\n\n<p>We conducted a twitter poll about the white bezels and the majority of Macworld followers weren’t jazzed about it:</p>\n\n\n\n<figure><div>\n<blockquote><p>(see above)</p>— Macworld (@macworld) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macworld/status/1392184220496375809?ref_src=twsrc%5Etfw&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">May 11, 2021</a></blockquote></div></figure><h2>MacBook Air: Display</h2>\n\n\n\n<p>The 2021 MacBook Air will likely have the same 13.3-inch retina display as the current model. According to Mark Gurman at Bloomberg, Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-22/apple-aapl-plans-new-macbook-air-with-magsafe-macbook-pro-with-sd-card-slot&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">considered a larger 15-inch screen</a> for the MacBook Air, but the company decided to shelve that model for the time being. However, even if the new Air sticks with the same size screen, it still could be getting an upgrade. It has been rumored that the Mini LED <a href=\"https://www.macworld.co.uk/news/mini-led-macbook-air-2022-kuo-3802865/\">could be coming</a> to the MacBook Air, but that probably won’t arrive until 2022, with a debut in the MacBook Pro later this year. As seen in the new 12.9-inch iPad Pro, mini LED is a backlighting technology for displays, but as its name suggests, uses a higher concentration of smaller LEDs. This results in better control of the backlight, better image contrast, and greater dynamic range.</p>\n\n\n\n<h2>MacBook Air: MagSafe and ports</h2>\n\n\n\n<p>The new MacBook Air, which could be released later this year or in early 2022, could make the return of the MagSafe connector, according to Bloomberg’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-22/apple-aapl-plans-new-macbook-air-with-magsafe-macbook-pro-with-sd-card-slot&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman</a>. MagSafe was a magnetic power adapter connector that could easily disconnect from the laptop using non-axial force—tugs from angles other than straight away—that was introduced in 2016. Its implementation meant that if someone yanked or tripped over the cable, the connection would break but the laptop would be spared from <a href=\"https://www.macworld.com/article/225120/will-your-new-macbook-crash-to-the-ground-without-magsafe-yes.html\">flying off the work surface</a>. Apple retired MagSafe when it switched to USB-C connectors in 2016, which do not have a breakaway connector.</p>\n\n\n\n<p>Apple <a href=\"https://www.macworld.com/article/234834/best-magsafe-cases-chargers-accessories-iphone-12-12-pro-12-pro-max-12-mini.html\">reintroduced</a> the MagSafe brand as a magnetic charging system for the iPhone 12 and the new iMac has a magnetic power cord that doesn’t have the MagSafe branding. Presumably, any MagSafe-related technology for Apple’s laptops would be in a similar vein as its implementation starting in 2006 but will likely still use USB-C for charging.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/magsafe-macbook.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>MagSafe could be making a comeback in the next MacBook Air.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>As for connectivity ports, Apple has transitioned to Thunderbolt/USB 4 ports in its <a href=\"https://www.macworld.com/article/345721/m1-mac-macbook-imac-mac-mini-cpu-gpu-memory-storage-benchmarks-storage-ports-price.html\">M1 Macs</a>, and it’s a good bet that Apple will continue with this in the new MacBook Air. The question then becomes how many ports—traditionally, the MacBook Air has two ports on one side. In his <a href=\"https://www.macworld.com/article/346093/the-next-macbook-could-have-white-bezels-to-match-the-imac.html\">report</a> about the color offerings for a new MacBook Air or MacBook, Jon Prosser said that the new laptop will have two ports but with a better placement—one on each side rather than both on the left edge.</p>\n\n\n\n<h2>MacBook Air: Processor and memory</h2>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman of Bloomberg</a> reported that at the end of 2021, we could see a new MacBook Air with a new System on a Chip (SoC) that replaces the M1. The new SoC will be faster but have eight CPU cores (four performance cores, four efficiency cores) like the M1. The graphics cores will increase from seven or eight to nine or ten. While it was originally assumed that the chip would be the same M1X chip that’s rumored for the <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-sd-card-reader-magsafe-price-release-date.html\">MacBook Pro</a>, a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/dylandkt/status/1412089676220055555&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">rumor from Twitter user @dylandkt</a> says the MacBook Air might use the next-generation M2 chip instead.</p>\n\n\n\n<h2> MacBook Air: Release date</h2>\n\n\n\n<p>Apple released the current MacBook in November of 2020, so it’s likely that a new model will arrive at around the same time. Prosser said to expect the MacBook Air near “the end of 2021” and Bloomberg has reported it’s scheduled to arrive in the “second half of this year at the earliest.” Both have suggested that the New MacBook Air could slip to early 2022 as well and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/dylandkt/status/1412089676220055555&amp;xcust=1-1-346119-0-0-0&amp;sref=https://www.macworld.com/feed\">a report from Twitter user @dylandkt</a> also says the new laptop won’t arrive until 2022. Recently, rumors have suggested that Apple may be prioritizing the redesigned MacBook Pro models, so it’s looking more likely that the MacBook Air doesn’t launch until next year.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a74e3abed887a30d58852e0afb572d67fb75324be5d3d70787e701aa1ab98bb3","category":"Apple"}