{"title":"Households Willingness to Use Water from a Solar Water Disinfection Treatment System for Household Purposes","link":"https://www.preprints.org/manuscript/202410.0355/v1","date":1728048621000,"content":"The consumption of contaminated water contributes to the global burden of diarrhea and other water-borne diseases, especially among young children. While the decentralized solar water disinfection treatment system remains a viable option to have safe drinking water, our understanding of the effects of household water treatment before use on willingness to accept and adopt a decentralized solar water disinfection treatment system is limited. In this study, a complementary log-log regression analysis of the compositional and contextual factors that systematically vary with willingness to accept and adopt a decentralized solar water disinfection treatment system in the Sawla-Tuna-Kalba (STK) district of Ghana was carried out. Based on our findings, a greater proportion of households’ (97%) are willing to accept and adopt a decentralized solar water disinfection treatment system. Compositional and contextual factors such as age, marital status, education, religion, and geographical location significantly contribute to households’ willingness to accept and adopt a decentralized solar water disinfection treatment system in the STK district of Ghana. Households that treat their water before use (66%, P&amp;lt;0.05) are more likely to accept and adopt a solar water disinfection treatment system compared to those that do not treat their water before use. The findings therefore suggest that scaling up solar water disinfection systems in the STK district is sacrosanct, and highlight the necessity to analyze compositional and contextual factors influencing willingness to accept and adopt solar water disinfection systems. Our findings will inform policies and programs aimed at implementing solar water disinfection systems in the study area to improve the health of communities that must rely on poor quality drinking water sources.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a758ac4dd73d1f367c70874bd3a3a76a7f26430fae132a404b5318c0b068fbd0","category":"Interdisciplinary"}