{"title":"Nα-acetyltransferase NAA50 mediates plant immunity independent of the Nα-acetyltransferase A complex","link":"https://academic.oup.com/plphys/article/195/4/3097/7642292?rss=1","date":1712534400000,"content":"<span><div>Abstract</div>In humans and plants, 40% of the proteome is cotranslationally acetylated at the N-terminus by a single N<sup>α</sup>-acetyltransferase (Nat) termed NatA. The core NatA complex is comprised of the catalytic subunit N<sup>α</sup>-acetyltransferase 10 (NAA10) and the ribosome-anchoring subunit NAA15. The regulatory subunit Huntingtin Yeast Partner K (HYPK) and the acetyltransferase NAA50 join this complex in humans. Even though both are conserved in Arabidopsis (<span>Arabidopsis thaliana</span>), only <span>At</span>HYPK is known to interact with <span>At</span>NatA. Here we uncover the <span>At</span>NAA50 interactome and provide evidence for the association of <span>At</span>NAA50 with NatA at ribosomes. In agreement with the latter, a split-luciferase approach demonstrated close proximity of <span>At</span>NAA50 and <span>At</span>NatA <span>in planta</span>. Despite their interaction, <span>At</span>NatA/HYPK and <span>At</span>NAA50 exerted different functions in vivo. Unlike NatA/HYPK, <span>At</span>NAA50 did not modulate drought tolerance or promote protein stability. Instead, transcriptome and proteome analyses of a novel <span>At</span>NAA50-depleted mutant (<span>amiNAA50</span>) implied that <span>At</span>NAA50 negatively regulates plant immunity. Indeed, <span>amiNAA50</span> plants exhibited enhanced resistance to oomycetes and bacterial pathogens. In contrast to what was observed in NatA-depleted mutants, this resistance was independent of an accumulation of salicylic acid prior to pathogen exposure. Our study dissects the in vivo function of the NatA interactors HYPK and NAA50 and uncovers NatA-independent roles for NAA50 in plants.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"a75ab287cf8b7c5da8b15a0df6d47f7f3a509b36220669764e8aef93329cc1e5","category":"Environment"}