{"title":"Optimal Scheduling of Off-Site Industrial Production in the Context of Distributed Photovoltaic","link":"https://www.preprints.org/manuscript/202403.1869/v1","date":1711720558000,"content":"Reasonable allocation of production plans and saving the overall electricity cost are crucial for large manufacturing conglomerates, which is an effective way for conglomerates to realize open-source and cost-saving. This paper develops an optimization model of off-site industrial production scheduling for enterprises in response to the problems of high electricity costs due to the irrational allocation of production schedules on the demand side of China's electric power and the difficulty of promoting industrial and commercial distributed photovoltaic (PV) projects in China. The model makes full use of the conditions of different PV resources and different electricity prices in different places to optimize the scheduling of industrial production in different places. The model is embedded with two sub-models of the electricity price prediction model and distributed photovoltaic kWh cost model to complete the model parameters, in which the electricity price prediction model utilizes the LSTM neural network. The integrated model is then solved by the particle swarm algorithm. To verify the effectiveness of the model in solving the problem of off-site production scheduling on the demand side of electricity, the research team researched two off-site pharmaceutical factories belonging to the same large pharmaceutical company. Finally, the research data were substituted into the model for solving, and it was concluded that the optimization model could significantly reduce the cost of electricity consumption of the enterprise by about 7.9 %.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a75bbe4d3a4f337262cac24d553a3bc5b6e5f4836160e3313ceca0a572ee537e","category":"Interdisciplinary"}