{"title":"A Few Unique Builds from the 2021 Sedona Mountain Bike Festival – Josh Weinberg","link":"https://theradavist.com/2021/11/2021-sedona-mountain-bike-festival-rides/","date":1638190816000,"content":"<p>Unlike the bike expos and builder showcases we are fortunate to document on this site, such as the recent <a href=\"https://theradavist.com/tag/philly-bike-expo/\">Philly Bike Expo</a> and <a href=\"https://theradavist.com/2021/11/2021-bespoked-uk/\">Bespoked UK</a>, the <a href=\"https://theradavist.com/2021/11/2021-sedona-mtb-festival/#meta\">Sedona Mountain Bike Festival</a> is not typically the event to attend if you’re interested in encountering custom frames or ogling otherwise unique bike builds on display. Instead, group rides, production bike demos, and other community-building shenanigans are the focus.</p>\n<p>This year, however, there was much ogling to be done. <a href=\"https://www.bikethomson.com/\" target=\"_blank\">Thomson</a> featured two bikes from builders they often partner with – <a href=\"http://odditycycles.blogspot.com/\" target=\"_blank\">Oddity Cycles</a> and <a href=\"http://www.monebikes.com/\" target=\"_blank\">MONē Bikes</a> – in addition to a couple of their own Hooches available to demo; <a href=\"https://www.whycycles.com/\" target=\"_blank\">Why Cycles</a> had a booth connected their sister brand, <a href=\"https://www.revelbikes.com/\" target=\"_blank\">Revel Bikes</a>, offering demos in addition to showcasing two head-turning builds; <a href=\"https://celilocycles.com/\" target=\"_blank\">Celilo Cycles</a> had a collection of their handmade wooden bikes on display; and <a href=\"https://www.athertonbikes.com/\" target=\"_blank\">Atherton Cycles</a> sent a custom 3D printed enduro bike with a friend from the UK to show off at the event.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/SedonaMTB-85.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/SedonaMTB-41.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Atherton-12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Continue reading below for an in-depth look at these marvelous machines and be sure to scroll all the way through to the last one — it’s a trip!</p>\n<p><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Oddity.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Oddity Cycles Titanium All-Mountain Hardtail</strong></p>\n<p>If you follow Oddity’s <a href=\"https://www.instagram.com/oddity_cycles/\">social channels</a>, then you probably noticed Burnsey and crew went on a bit of a hiatus this year. They returned in September to announce a new shop space in their hometown of Fort Collins, CO, along with a steady stream of drops that included forks, bars, and news that they were once again building frames for customers (<a href=\"http://odditycycles.blogspot.com/\">although it looks like their queues are closed again</a>).</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Oddity-5.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Oddity-12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Burnsey sent this recently built “All-Mountain Hardtail” singlespeed (which can run gears as well) with Thomson to feature in their festival booth and was certainly an attention-getter. <a href=\"http://odditycycles.blogspot.com/\">Oddity</a> are known for their metal tube bending skills and creating some wildly-designed frames. They upped the ante with this one, evoking an 80s BMX cruiser that grew up to go on to art school and also does crossfit. The bike can accommodate a 150mm travel fork, which is a RockShox Pike  in this case, and the swoopy tubes comprising the large front triangle were designed to house touring luggage with mounts for oversized bottle cages and bolt-on top tube bag.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Oddity-4.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Short stays, long cockpit, slack heat tube, and steep seat tube are indented to provide a playful and confident descending platform while also inspiring confidence on precipitous climbs. The orange <a href=\"https://www.velocityusa.com/product/rims/blunt-ss-622\">Velocity Blunt SS</a> rims harmonize with the build’s other anodized details including hope brakes and gold-linked chain. The Thomson Covert dropper is internally routed, in addition to brake hoses, and the Thomson stem holds an Oddity ti <a href=\"http://odditycycles.blogspot.com/p/lowrizer-new.html\">Lowrizer handlebar</a>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Why-S7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>James’ </strong><strong>Why Cycles</strong><strong> </strong><strong> S7</strong></p>\n<p>Byke Ti-son, this aptly-named Why S7, is an artifact of what James considers to be his “lifelong love affair with the most beautiful metal in the world.” He sourced as many titanium parts as he could find to compliment the titanium frame, including the bottom bracket from Ed Mason of <a href=\"https://dward-design.co.uk/\">Dward Design</a> and the singlespeed cog/spacers from <a href=\"https://booneti.com/\">Boone Technologies</a>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Why-S7-5.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Why-S7-8.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>James is a Sedona local and works at Thunder Mountain Bikes. He considers the S7 one of his most ridden bikes and believes it to have influenced the growing popularity of titanium frames amongst the Sedona MTB community. Orange is James’ favorite color, which is unfortunately very difficult to anodize on titanium, so he chose oilslick accent colors wherever possible, including the titanium bolts throughout (made by <a href=\"https://betterbolts.com/\">Better Bolts</a>).</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Why-Jefe.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Matt’s Why Cycles El Jefe</strong></p>\n<p>John documented <a href=\"https://theradavist.com/2021/05/matts-why-cycles-el-jefe-singlespeed-29er-with-paul-components-30th-anniversary-bits/\">Matt’s El Jefe</a> back in May of this year when he visited the Revel/Why team in Carbondale, CO. Matt changed up a few things on the bike leading up to the festival in Sedona and, thus, I just had to photograph it again. The current state of the bike has Matt a few steps closer to the “deep custom” buildout of his dreams.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Why-Jefe-2.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Why-Jefe-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Matt’s goal with his El Jefe is to make it as comfortable as possible, while limiting potential failure points. The Paul Component Engineering 30th anniversary box set with pink cable housing remains the center of attention. Recently added bits – including the <a href=\"https://endlessbikes.com/\">Endless Bike Co.</a> 32t direct mount chainring, 19t rear cog, and singlespeed-specific <a href=\"https://onyxrp.com/\">Onyx hub</a> – round out the reliable singlespeed build. Matt has also added Cane Creek eeWings cranks and a <a href=\"http://odditycycles.blogspot.com/p/oddmone.html\">titanium Oddmonē handlebar</a>. A limited edition teal Brooks B17 saddle adorns the Why titanium seat post and – with its decals removed – the 130mm silver RockShox Pike harmonizes with the bike’s predominantly brushed titanium appearance.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Hooch.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Thomson’s “Hooch” Titanium Hardtail</strong></p>\n<p>Earlier this year Thomson released the limited edition <a href=\"https://www.bikethomson.com/product/the-hooch-titanium-hardtail-mtb-kit/#frame\">Hooch titanium frame</a>, which can be spec’d with components from across Thomson’s component collection. They had two builds on-hand in Sedona for riders to demo, hence the thin layer of sedimentary dust on the bike pictured below.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Hooch-15.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Hooch-4.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Hooch-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This particular bike features Thomson Elite parts – from dropper to stem and ti handlebars – along with a Shimano XT drivetrain. Wheels are <a href=\"https://www.noxcomposites.com/\">Nox Composites</a> rims laced to gold <a href=\"https://www.factorcomponents.com/\">Factor Hubs</a>, which are complimented by the gold stem faceplate and top cap. Cane Creek componentry holds down the bike’s front end with a Helm MKII fork and headset.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Atherton.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Atherton Bikes Enduro 29er</strong></p>\n<p>Founded by the renowned racing family – Dan, Gee, and Rachel Atherton –  in 2019, <a href=\"https://www.athertonbikes.com/\">Atherton Bikes</a> boasts an innovative design/build process consisting of 3D printing custom-sized titanium lugs and joining them to carbon tubes. I had heard of the UK-based brand but had never seen one of their bikes in person. When I noticed Tim walking the festival grounds with this beefy-lugged machine, I had to stop him for a quick chat and some photos. Tim doesn’t own the bike, but when he mentioned flying across the pond to check out the festival in Sedona, his friends at Atherton sent him with a bike.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Atherton-11.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Atherton-9.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Due to their 3D printing technology, the brand claims to have twenty-two stock frame sizes and the ability to further custom-fit frames “to the millimetre.” Each bike is designed and constructed to order based on individual customer measurements, which are be entered into a calculator on Atherton’s website. For more detailed info about the brand and their processes, check out their <a href=\"https://www.athertonbikes.com/technology\">website</a> and <a href=\"https://www.instagram.com/athertonbikes/?hl=en\">Instagram</a>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Celilo-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Celilo Cycles Wooden Tourer</strong></p>\n<p>One of the most distinctive bikes at the festival was this touring bike made from sustainably-sourced Oregon White Oak by Scott Campbell in Corvallis, OR under the moniker <a href=\"https://celilocycles.com/about-us\">Celilo Cycles</a>. Scott teaches courses in CAD/CAM and engineering at Oregon State University. He uses the university’s facilities to prototype and test his designs, often pulling in students for assistance, and then fabricates frames in his home garage space. Scott/Celilo had a wide variety of frame designs on display and available as full builds for demo at the festival, including mountain bikes, an e-bike, and this dirt tourer.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Celilo-9.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Celilo-8.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Scott made this touring bike for his daughter, Martha, who illustrated the company’s salmon logo and other graphics. Martha wanted something capable of carrying a load over long distances, so Scott designed this to essentially be a lightweight and narrow-tire mountain bike. The Jones Bars and double front chainring aid in the bike’s comfort and efficiency. Scott is currently working on a rack design to adorn Martha’s bike, which will be a composite single-piece structure.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Mone.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>MONē Bikes “Full Enjoy” Steel Full Suspension </strong></p>\n<p>Accompanying the Oddity All Mountain Hardtail at the Thomson booth was this head-turner/scratcher from Monē Bikes. Owner and proprietor of Monē Bikes, Cjell Monē, claims the blueprint for the “Full Enjoy” came to him in a psychedelic vision; a hallucinatory experience that foretold the fillet-brazed steampunk future earthlings have to look forward to.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Mone-14.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/Mone-5.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While clairvoyance bequeathed an etherial design, Cjell built the bike with terrestrial materials and parts of today – around a 140mm suspension and 29 x 2.6 wheel/tire size – to have “the perfect amount of anti-squat and progression.” To compliment the brazed four-bar transcendent transmission, the Full Enjoy features a weight weenie kit with <a href=\"https://canecreek.com/product/eewings/\">Cane Creek eeWings</a> cranks, <a href=\"https://trpcycling.com/product/dh-r-evo-gold/\">special addition TRP Evo brakes</a>, HiFi carbon rims, and Monē’s new carbon <a href=\"http://www.monebikes.com/store/light-bar\">Light Bar</a>. Thomson <a href=\"https://www.bikethomson.com/product/thomson-covert-black-dropper/\">Covert Dropper</a>, seatpost collar, and <a href=\"https://www.bikethomson.com/product/elite-x4-stems/\">shorty-forty X4 stem</a> round out the build with an extra dose of hot sauce. Cjell hopes to have Full Enjoy framesets available in bike shops worldwide by 2069.</p>\n<p>The next <a href=\"https://sedonamtbfestival.com/\">Sedona Mountain Bike Festival</a> is right around the corner in early March. Be sure to mark it on your calendar because there will likely be even more beautiful bikes on display!</p>\n<p>The post <a href=\"https://theradavist.com/2021/11/2021-sedona-mountain-bike-festival-rides/\">A Few Unique Builds from the 2021 Sedona Mountain Bike Festival</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Josh Weinberg","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"a75e46f0e4a24deed6d7611f671e3cc7b0875be54f1ce647448a7a1ffc5f79cc","category":"Cycling"}