{"title":"Conditional Caspase Expression in Zebrafish Ovaries Induces Sterility","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/7162078?af=R","date":1729254846000,"content":"<p>Biocontainment methods for aquaculture are in development and implementation to prevent farmed fish from breeding and thus invading the surrounding environment following an escape from open netpens. Current methods have not demonstrated 100% efficacy in achieving the desired sterility, highlighting the need for the development of novel biocontainment strategies to implement in aquaculture. Using zebrafish as a model organism, we determined the efficacy of the Cre-LoxP system to conditionally express the active form of caspase-3, an apoptosis-inducing cell-death protein, in the developing ovary. This was achieved through the use of two transgenic lines, <i>Tg</i>(<i>zpc:cre; cmlc2-mCherry</i>) and <i>Tg</i>(<i>ef1a:loxP:caspase3:loxP; cmlc2-EGFP</i>), that induce the expression of active caspases in the developing ovary of progeny containing both constructs. Fish positive for only one of the two constructs displayed wildtype (WT) gonadal tissue and bred successfully. However, 78.3% of progeny that carried both constructs did not breed successfully and possessed either little or no gonadal tissue compared to WT controls upon dissection. When combined with induced triploidy, fish that were transgenic for both constructs were 100%. Our results suggest that conditional expression of a cell-death-inducing protein could be used as part of a strategy for the confinement of fish species and demonstrates the utility of “stacking” containment approaches to enhance reproductive containment.</p>","author":"Stephanie McMillan, \nAmanda D’Attolico, \nVishal Saxena, \nRobert H. Devlin, \nMarc Ekker, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"a76436eeabe3a3971d29aea39587a3a8e07c37b0412c69de0dc082d56f56786d","category":"Environment"}