{"title":"Comparing methods for determining the metabolic capacity of lumpfish (Cyclopterus lumpus Linnaeus 1758)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15716?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>Lumpfish (<i>Cyclopterus lumpus</i>) mortalities have been reported during the summer at some North Atlantic salmon cage-sites where they serve as “cleaner fish.” To better understand this species' physiology and whether limitations in their metabolic capacity and thermal tolerance can explain this phenomenon, we compared the aerobic scope (AS) of 6°C-acclimated lumpfish (~50 g and 8.8 cm in length at the beginning of experiments) when all individuals (<i>N</i> = 12) were given a chase to exhaustion, a critical swim speed (U<sub>crit</sub>) test, and a critical thermal maximum (CT<sub>Max</sub>) test (rate of warming 2°C h<sup>−1</sup>). The U<sub>crit</sub> and CT<sub>Max</sub> of the lumpfish were 2.36 ± 0.08 body lengths per second and 20.6 ± 0.3°C. The AS of lumpfish was higher during the U<sub>crit</sub> test (206.4 ± 8.5 mg O<sub>2</sub> kg<sup>−1</sup> h<sup>−1</sup>) versus that measured in either the CT<sub>Max</sub> test or after the chase to exhaustion (141.0 ± 15.0 and 124.7 ± 15.5 mg O<sub>2</sub> kg<sup>−1</sup> h<sup>−1</sup>, respectively). Maximum metabolic rate (MMR), AS, and “realistic” AS (AS<sub>R</sub>) measured using the three different protocols were not significantly correlated, indicating that measurements of metabolic capacity using one of these methods cannot be used to estimate values that would be obtained using another method. Additional findings include that (1) the lumpfish's metabolic capacity is comparable to that of Atlantic cod, suggesting that they are not as “sluggish” as previously suggested in the literature, and (2) their CT<sub>Max</sub> (20.6°C when acclimated to 6°C), in combination with their recently determined IT<sub>Max</sub> (20.6°C when acclimated to 10°C), indicates that high sea-cage temperatures are unlikely to be the primary cause of lumpfish mortalities at salmon sea-cages during the summer.</p>","author":"Rachel M. Eisenberg, \nRebeccah M. Sandrelli, \nAnthony Kurt Gamperl","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"a7759740379d610dbf7e0f9446ceb3eb4b7c95d95c4363f0dedf08ecd7e4adbb","category":"Environment"}