{"title":"Breastfeeding practices and social norms in Kinshasa, Democratic Republic of the Congo: A qualitative study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0000957","date":1713276000000,"content":"<p>by Pélagie Babakazo, Lina M. Piripiri, Jean-Marie Mukiese, Nelly Lobota, Éric Mafuta</p>\r\nIntroduction <p>Breastfeeding has many benefits for both mothers and children. The World Health Organization recommends exclusive breastfeeding for the first six months of life. However, in the Democratic Republic of the Congo, slightly under half of children under six months are exclusively breastfed. This study aimed to describe breastfeeding practices and to explore perceived social norms regarding breastfeeding among mothers in Kinshasa.</p> Materials and methods <p>A qualitative descriptive study was conducted in Kinshasa from June to July 2013. This study purposively sampled 54 mothers of infants aged 6 to 12 months, who participated in six focus group discussions. Based on the Theory of Planned Behaviour, the discussion guide explored infant feeding in the first six months, knowledge of breastfeeding, perception of the feasibility of exclusive breastfeeding, and perception of the social norms with regard to exclusive breastfeeding. The content analysis approach was used to analyse data.</p> Results <p>Mothers had good breastfeeding knowledge; however, few of them had practised exclusive breastfeeding as recommended during the first six months. Exclusive breastfeeding was considered unfeasible in their context. Barriers to exclusive breastfeeding were reported as baby’s cries, social pressure, warm climate, and poor maternal diet. Social norms were supportive of breastfeeding but unfavourable to exclusive breastfeeding.</p> Conclusion <p>In Kinshasa, mothers have a good knowledge of breastfeeding. However, few practise exclusive breastfeeding. Social pressure plays an important role in the cessation of exclusive breastfeeding before six months. In order to improve the practice of exclusive breastfeeding in this context, social and behaviour change programmes should target the entire population rather than mothers only.</p>","author":"Pélagie Babakazo","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a778d053bc599b4586aa137028fc760796969edca72c3c3a8d94c6757edb473b","category":"Environment"}