{"title":"The Innovation Dilemma and Operating Efficiency of Manufacturing Enterprises: Evidence from China","link":"https://www.preprints.org/manuscript/202404.1214/v1","date":1713430292000,"content":"Under the background that the international technological innovation environment VUCA has been intensifying and the innovation situation of Chinese manufacturing enterprises has been impacted, the innovation dilemma faced by enterprises has attracted increasing attention, while the innovation dilemma is also one of the important factors affecting the operation efficiency of enterprises. Based on the micro-data of China’s A-share manufacturing listed enterprises, this paper empirically analyzes the impact of innovation dilemmas faced by enterprises on operational efficiency (innovation dilemmas are measured by the difference when actual innovation performance is lower than expected innovation performance). The results show that the innovation dilemma of manufacturing enterprises significantly inhibits the operational efficiency of manufacturing enterprises by reducing their risk tolerance, development ability expectation and profitability. After using a series of tests, such as instrumental variable method, propensity score matching method, DID (Differences-in-Differences) and changing variable measure method, the conclusion is still robust. In addition, the inhibitory effect of innovation dilemma on enterprise operation efficiency is more obvious for private enterprises, small and medium-sized enterprises, enterprises in the ascend or decline phase, high-tech enterprises and enterprises in the eastern region. Therefore, the government should strengthen the policy support for the manufacturing enterprises in the innovation dilemma, help the enterprises to overcome the innovation bottleneck. Manufacturing enterprises themselves should enhance their innovation capabilities and strive to get rid of the innovation dilemma in order to maintain a stable footing in the fierce market competition and improve the high-quality development of China’s manufacturing industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a780d5ef135a6e1015cdc6525779339f6c1ff49d3956e36db7139504699dd5a4","category":"Interdisciplinary"}