{"title":"Trend and determinants of minimum dietary diversity consumption change among children aged 6–23 months in Ethiopia from 2011 to 2019: A multivariate decomposition analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308349","date":1722607200000,"content":"<p>by Abel Endawkie, Lakew Asmare, Hiwot Tadesse Alemu, Demiss Mulatu Geberu, Asebe Hagos, Melak Jejaw, Kaleab Mesfin Abera, Misganawu Guadie Tiruneh, Kaleb Assegid Demissie, Yawkal Tsega, Adina Yeshambel Belay, Wubshet Debebe Negash, Amare Mesfin Workie, Lamrot Yohannes, Mihret Getnet, Nigusu Worku</p>\r\nBackground <p>Sustainable Development Goals 2 target 2.2 aimed to end all forms of malnutrition by 2030. However, the prevalence of inadequate minimum dietary diversity (MDD) is high in Ethiopia and the evidence of trends and determinants of MDD consumption change among children over time is limited. Therefore, this study aimed to determine trends and determinants of MDD consumption change among children aged 6 to 23 months in Ethiopia from 2011–2019 Demographic and Health Survey (DHS) data.</p> Method <p>The study used the data on nationally representative weighted samples of 6,971, 7,467, and 3,154 children aged 6–23 months from the 2011, 2016, and 2019 rounds of the DHS. Trend and Multivariate Decomposition analysis was conducted to determine MDD consumption change from 2011–2016, and 2016–2019 into two components: one that was explained by differences in the level of the determinants (endowment), and the other component was explained by differences in the effect of the covariates on the outcome (coefficient effects).</p> Result <p>The trends analysis showed that adequate MDD consumption significantly increased from 2% to 10.41% from 2011 to 2016 but decreased from 10.41% to 7.11% from 2016 to 2019 in Ethiopia. The compositional and behavioral change factors like maternal age, occupational status of parents, sex of the household head, wealth index, residence, and sex of child statistically contributed to changes in MDD consumption from 2011 to 2016, and from 2016 to 2019 at p-value &lt;0.05.</p> Conclusion <p>The trend of minimum dietary diversity consumption among children aged 6 to 23 months in Ethiopia increased from 2011–2016 and decreased from 2016–2019 in the last decade. The study revealed that the changes in behavioral response and population composition contributed to MDD consumption change among children in Ethiopia. The finding highlights the urgent need for targeted interventions and policies to address the issue of MDD consumption change among young children due to population structure changes like wealth status, residence, and behavioral response related to employment, household head, and sex of the child in Ethiopia. Therefore, efforts should be geared to reduce poverty and improve maternal employment status, particularly for women, by producing equitable economic opportunities.</p>","author":"Abel Endawkie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a78f8f3c4f7bd1291d844b33b202d05d22ab62e376b5763f99636269a98e4053","category":"Interdisciplinary"}