{"title":"PSXIII-22 Intake, digestibility, and ruminal parameters of Nellore cattle fed with amylolytic and fibrolytic enzymes in feedlot","link":"https://academic.oup.com/jas/article/102/Supplement_3/789/7757765?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>This study was carried out to evaluate the use of dietary exogenous enzyme (ENZ) products with amylolytic and fibrolytic activity on nutrient intake, digestibility, and ruminal volatile fatty acids production (VFA) of Nellore cattle in feedlot. Rumen-cannulated Nellore steers [n = 10; body weight (BW) = 543 kg ± 28.6 BW] were distributed in a replicated Latin-square design (5 × 5) in individual pens. The treatments consisted of a negative control (CON; without ENZ); Amylase (AML; Amaize, Alltech, 0.5 g/kg of DM); Xylanase (FBL, Fibrozyme, Alltech, 0.9 g/kg of DM); Half dose (HD; AML 0.25 g/kg of diet DM and FBL 0.45 g/kg of diet DM); and Full dose (FD; AML 0.5 g/kg of diet DM and FBL 0.90 g/kg of diet DM; Table 1). The experimental period lasted 19 d (14 d of adaptation and 5 d of collection). Between d 15 and 18, total fecal collection was performed and on d 19 rumen fluid was collected at 0, 4, 8, 12, and 16 h post-feeding for ammonia, VFA, and pH determination. The data were analyzed as orthogonal contrasts using SAS: (C1) CON vs. ENZ, (C2) AML vs. FBL, (C3) HD vs. FD, and (C4) AML + FBL vs. HD + FD. There were no C1 differences for nutrient digestibility, total VFA, or ruminal pH (<span>P</span> &gt; 0.10). However, a tendency effect in neutral detergent fiber (NDF) intake (<span>P</span> = 0.065) was observed, where animals fed ENZ had reduced values compared with animals kept in CON group. In the same way, ENZ reduced ther extract (EE) intake (<span>P</span> = 0.023), ruminal ammonia (<span>P</span> &lt; 0.001), and isovalerate proportion (<span>P</span> = 0.080) as well as increased proportion of acetate (<span>P</span> &lt; 0.001), valerate (<span>P</span> &lt; 0.001) and acetate:propionate ratio (<span>P</span> = 0.030). No differences were observed in nutrient intake between AML and FBL (<span>P</span> &gt; 0.10), but AML had greater organic matter (OM) digestibility (<span>P</span> = 0.097) and ruminal valerate (<span>P</span> = 0.039) and decreased butyrate proportion (<span>P</span> = 0.068). Animals that received FD had greater values of dry matter (DM; <span>P</span> = 0.009) and OM (<span>P</span> &lt; 0.001) digestibility than HD. The enzyme combination resulted in greater DM (<span>P</span> = 0.026), OM (<span>P</span> = 0.062), crude protein (<span>P</span> = 0.018), EE (<span>P</span> = 0.063) and NDF (<span>P</span> = 0.040) intake and reduced OM digestibility (<span>P</span> = 0.008) compared with AML and FBL alone. The addition of exogenous enzymes in feedlot diets affected nutrient utilization and ruminal fermentation of Nellore cattle fed a feedlot finishing diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a7a147fdd74fa872de5b6d83e13cb8e26a9b2bad2f06a49c07ad9152dba89ad2","category":"Environment"}