{"title":"Intel launches its next-generation neuromorphic processor—so, what’s that again?","link":"https://arstechnica.com/?p=1799694","date":1633024836000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Mike Davies, director of Intel's Neuromorphic Computing Lab, explains the company's efforts in this area. And with the launch of a new neuromorphic chip this week, he talked Ars through the updates. </p></div>\n<p>Despite their name, neural networks are only distantly related to the sorts of things you'd find in a brain. While their organization and the way they transfer data through layers of processing may share some rough similarities to networks of actual neurons, the data and the computations performed on it would look very familiar to a standard CPU.</p>\n<p>But neural networks aren't the only way that people have tried to take lessons from the nervous system. There's a separate discipline called <a href=\"https://arstechnica.com/science/2017/07/pocket-brains-neuromorphic-hardware-arrives-for-our-brain-inspired-algorithms/\">neuromorphic computing</a> that's based on approximating the behavior of individual neurons in hardware. In neuromorphic hardware, calculations are performed by lots of small units that communicate with each other through bursts of activity called spikes and adjust their behavior based on the spikes they receive from others.</p>\n<p>On Thursday, Intel released the newest iteration of its neuromorphic hardware, called Loihi. The new release comes with the sorts of things you'd expect from Intel: a better processor and some basic computational enhancements. But it also comes with some fundamental hardware changes that will allow it to run entirely new classes of algorithms. And while Loihi remains a research-focused product for now, Intel is also releasing a compiler that it hopes will drive wider adoption.</p></div><p><a href=\"https://arstechnica.com/?p=1799694#p3\">Read 36 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799694&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a7aa3ab7dc6a4d0271a85919a5841cd1a5855a4857ca5155bd00db2016f64b05","category":"Tech"}