{"title":"Alternative splicing in parallel evolution and the evolutionary potential in sticklebacks","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14157?af=R","date":1721986521000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/afce3cb4-2ef4-477d-a075-4b26e0a45c70/jane14157-toc-0001-m.png\" alt=\"Alternative splicing in parallel evolution and the evolutionary potential in sticklebacks\" />\n<p>The findings from this study provide novel insights into the role of contingency and determinism in adaptation to novel environments at splicing level, and underscore the value of splicing to affect the potential of wild populations to respond to environmental change.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nRepeatability of adaptation to similar environments provides opportunity to evaluate the predictability of natural selection. While many studies have investigated gene expression differences between populations adapted to contrasting environments, the role of post-transcriptional processes such as alternative splicing has rarely been evaluated in the context of parallel adaptation.\n\nTo address the aforementioned knowledge gap, we reanalysed transcriptomic data from three pairs of threespine stickleback (<i>Gasterosteus aculeatus</i>) ecotypes adapted to marine or freshwater environment. First, we identified genes with repeated expression or splicing divergence across ecotype pairs, and compared the genetic architecture and biological processes between parallelly expressed and parallelly spliced loci. Second, we analysed the extent to which parallel adaptation was reflected at gene expression and alternative splicing levels. Finally, we tested how the two axes of transcriptional variation differed in their potential for evolutionary change.\n\nAlthough both repeated differential splicing and differential expression across ecotype pairs showed tendency for parallel divergence, the degree of parallelism was lower for splicing than expression. Furthermore, parallel divergences in splicing and expression were likely to be associated with distinct <i>cis</i>-regulatory genetic variants and functionally unique set of genes. Finally, we found that parallelly spliced genes showed higher nucleotide diversity than parallelly expressed genes, indicating splicing is less susceptible to genetic variation erosion during parallel adaptation.\n\nOur results provide novel insight into the role of splicing in parallel adaptation, and underscore the contribution of splicing to the evolutionary potential of wild populations under environmental change.\n</p>","author":"Man Luo, \nJuntao Hu","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"a7ac90feb25c189a81a6c7f973c2bf110fac528e8fa35f95319db3c7e9277f4c","category":"Environment"}