{"title":"Integrating Immersive Learning Technologies and Alternative Reality Games for Sustainable Education: Enhancing the Effectiveness and Participation on Cultural Heritage Education of Primary School Students","link":"https://www.preprints.org/manuscript/202409.2419/v1","date":1727693022000,"content":"As traditional cultural heritage education gradually reduces students' exposure to the physical environment, it is more difficult to stimulate students' awareness of and interest in local culture. The concepts of cultural preservation and sustainable development have not yet been effectively integrated into teaching. Therefore, this study developed an alternative reality game (ARG) combined with a learning scaffold to enable students to gain a deeper understanding of the history and cultural heritage of Taiwan during the Japanese rule period through an immersive learning experience, and to explore and solve real-world problems in an interactive environment, which helped students understand the concepts of cultural preservation and sustainable development.\n\nThe results of the study showed that the experimental group of students using the ARG integrated learning scaffold significantly outperformed the control group in terms of learning effectiveness and engagement. Students in the experimental group not only had a deeper understanding of the curriculum content, but also showed higher behavioral and emotional engagement. In addition, students' awareness of cultural preservation and sustainable development increased, which indicates that the materials developed in this study are effective in promoting their deeper understanding of local educational development and cultural identity. This study confirms that the combination of innovative technology and gamified instruction not only enhances students' learning effectiveness, but also promotes their understanding of cultural heritage. Future research should further optimize the use of technology to reduce the impact of operational difficulties on students' learning experience and explore how alternative reality game (ARG) technology can be used in more subject areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a7ba9962bc8871cd5fba165ad102c7ede78dca045613b55c09083f630caca1d1","category":"Interdisciplinary"}