{"title":"Five big carmakers beat lawsuits alleging infotainment systems invade privacy","link":"https://arstechnica.com/?p=1982702","date":1699560674000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/getty-ford-infotainment-800x533.jpg\" alt=\"A Ford Escape infotainment system shows a list of messages.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/getty-ford-infotainment.jpg\">Enlarge</a> <span>/</span> Infotainment system in a 2016 Ford Escape. (credit: Getty Images | Todd Korol )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A federal appeals court rejected lawsuits that alleged five major carmakers violated a Washington state privacy law. The lawsuits centered on car infotainment systems that store text messages in a way that potentially allows the messages to be retrieved by law enforcement using specialized hardware and software. The rulings in the carmakers' favor came in cases against Ford, General Motors, Honda, Toyota, and Volkswagen.</p>\n<p>A three-judge panel at the US Court of Appeals for the 9th Circuit unanimously upheld US District Court rulings that dismissed the five class-action lawsuits, which were almost identical. The appeals court ruled in Ford's favor on October 27, then issued rulings upholding the dismissals of the other four cases on Tuesday this week.</p>\n<p>We'll cover the <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/ford-ruling.pdf\">Ford ruling</a> here since the other <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.ca9.338618/gov.uscourts.ca9.338618.40.1.pdf\">decisions</a> don't go into the same level of detail, and the arguments were similar in all five cases. The simple version is that the cases failed because the plaintiffs' data stayed in the car systems and apparently was never transmitted to law enforcement, Ford, or anyone else.</p></div><p><a href=\"https://arstechnica.com/?p=1982702#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1982702&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a7bf91d4434239d814542b08b81fddcf4c3a1aba38e571764a49ed3ff2512498","category":"Tech"}