{"title":"Apple Gearing Up for Launch of Vision Pro Developer Kits","link":"https://www.macrumors.com/2023/07/21/apple-gearing-up-vision-pro-developer-kits/","date":1689962860000,"content":"Apple is gearing up to provide developers with resources to create apps and experiences for the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> headset, and yesterday, the company pushed out new backend assets for the Vision Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/02/apple-vision-pro.jpeg\" alt width=\"1920\" height=\"1080\" />\r<br />\nCode for updating the battery pack that powers the Vision Pro has been introduced, along with other <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> assets needed for test versions of the device. Apple appears to have <a href=\"https://twitter.com/aaronp613/status/1682442696856686604?s=20\">three different model numbers</a> for Vision Pro batteries, including A2781, A2988, and A2697. It is not clear why there are three separate numbers when Apple has only announced two-hour battery life for the device, but there could be multiple battery packs in development or there could be additional battery options that will be used solely in Apple Stores for testing.\r<br />\n\r<br />\nThe code additions come ahead of when Apple plans to <a href=\"https://www.macrumors.com/2023/06/05/apple-vision-pro-developer-kits/\">introduce development kits</a> to select developers. Apple on its <a href=\"https://developer.apple.com/visionos/work-with-apple/\">developer website</a> says that it plans to introduce ‌Apple Vision Pro‌ developer kits and other developer tools starting in July, and there are less than two weeks left in the month.\r<br />\n\r<br />\n<div><blockquote><p>Apple has just pushed live the backend for the Vision Pro battery to receive firmware updates along with a few other visionOS assets. <br /><br />This comes as Apple is gearing up to send out Vision Pro developer kits sometime this month. <a href=\"https://t.co/tNiyN0nB7E\">pic.twitter.com/tNiyN0nB7E</a></p>— Aaron (@aaronp613) <a href=\"https://twitter.com/aaronp613/status/1682202910199824384?ref_src=twsrc%5Etfw\">July 21, 2023</a></blockquote> </div>\r<br />\nDeveloper kits will help developers bring their creations to life directly on Vision Pro, according to Apple, providing the tools to quickly build, iterate, and test apps. Developers will be able to apply to get a kit.\r<br />\n\r<br />\nApple last offered a developer kit ahead of the launch of Apple silicon chips in 2020. Apple provided developers with a <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> that had an A-series chip so that developers could transition from Intel to Apple silicon. The ‌Mac mini‌ machines were priced at $500, and the Apple Developer Kits will also likely require a payment from developers.\r<br />\n\r<br />\nAlong with ‌‌Apple Vision Pro‌‌ developer kits, Apple says that it will offer ‌‌Apple Vision Pro‌‌ compatibility evaluations for existing apps and opportunities for developers to visit a Vision Pro developer lab that provides demonstrations of ‌‌visionOS‌‌, iPadOS, and iOS apps running on the headset. Labs will be available in Cupertino, London, Munich, Shanghai, Singapore, and Tokyo.\r<br />\n\r<br />\nApple previously released the <a href=\"https://www.macrumors.com/2023/06/21/apple-releases-first-ever-visionos-beta/\">first visionOS beta</a> in June, and Unity earlier this week <a href=\"https://www.macrumors.com/2023/07/19/unity-tools-for-vision-pro-beta/\">released beta versions</a> of Vision Pro game development tools. Apple is partnering with Unity on the \"PolySpatial\" development platform for ‌visionOS‌ that will allow developers to create and port 3D experiences to the Vision Pro headset.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/21/apple-gearing-up-vision-pro-developer-kits/\">Apple Gearing Up for Launch of Vision Pro Developer Kits</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-gearing-up-for-launch-of-vision-pro-developer-kits.2396531/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a7c154ddf6886d609956f439cc9394354c3a8be43b06f5f1d51b28da9af8c392","category":"Apple"}