{"title":"Temporal mismatches in flight activity patterns between Pipistrellus kuhlii and Prays oleae in olive farms: Implications for biocontrol services potential","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14577?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/08c02de2-7f14-4d6e-afd4-1ddf43e6dbc6/jpe14577-toc-0001-m.png\" alt=\"Temporal mismatches in flight activity patterns between Pipistrellus kuhlii and Prays oleae in olive farms: Implications for biocontrol services potential\" />\n<p>Future research should consider mismatches between the temporal activity patterns of insectivorous bats and insect pests. Otherwise, the actual impact of agricultural intensification on bat-mediated biocontrol services as well as the economic impact of their loss on the agriculture industry might be underestimated. To enhance biocontrol services, we propose increasing the availability of suitable roosting and foraging sites as well as conserving areas of remnant native woodland and scattered hollow-bearing trees.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBiocontrol services are widely recognized to provide key incentives for bat conservation. However, we have virtually no information on whether and how disruptions in bat-mediated biocontrol services are driven by mismatches between the temporal activity patterns of insectivorous bats and insect pests.\n\nWe investigated the temporal relationship between the nightly activity patterns of the common pipistrelle bat (<i>Pipistrellus kuhlii</i>) and the olive fruit moth (<i>Prays oleae</i>). Temporal mismatches between species pairs were estimated as the time difference (expressed as a percentage of the night) at which <i>P. kuhlii</i> and <i>P. oleae</i> reached 50% of their abundance.\n\nThe study was carried out during spring, summer, and fall between 2017 and 2019 in 60 olive farms representing increasing levels of structural simplification (as a surrogate of agricultural intensification). Olive farms were classified as exhibiting high (i.e. HIGH olive farms; <i>n</i> = 27), intermediate (MID; <i>n</i> = 18), and low (LOW; <i>n</i> = 15) structural complexity.\n\nTemporal mismatches between the activity levels of <i>P. kuhlii</i> and <i>P. oleae</i> varied between seasons and types of olive farms, being comparatively lower in summer than in spring and fall. Furthermore, summer was the only season in which temporal mismatches between species pairs differed between types of olive farms, with higher temporal mismatches found in LOW than in HIGH and MID olive farms.\n\nOverall, our work demonstrates the existence of temporal mismatches between the nightly activity patterns of <i>P. kuhlii</i> and <i>P. oleae</i>. Furthermore, it demonstrates that the structural simplification of olive farms increases temporal mismatches between species pairs, particularly in summer when bat-mediated biocontrol services are most needed.\n\n<i>Synthesis and applications</i>. Future research should consider mismatches between the temporal activity patterns of insectivorous bats and insect pests. Otherwise, the actual impact of agricultural intensification on bat-mediated biocontrol services as well as the economic impact of their loss on the agriculture industry might be underestimated. To enhance biocontrol services, we propose increasing the availability of suitable roosting and foraging sites as well as conserving areas of remnant native woodland and scattered hollow-bearing trees.\n</p>\n<h2>Resumo</h2>\n<p>\n\nOs serviços de biocontrole são amplamente reconhecidos por providenciarem incentivos fundamentais para a conservação de morcegos. No entanto, não existe virtualmente nenhuma informação sobre se e como as disrupções nos serviços de biocontrole mediados por morcegos são causadas por divergências entre os padrões temporais de atividade de morcegos insetívoros e insetos-praga.\n\nInvestigámos a relação temporal entre os padrões de atividade noturna do morcego-de-kuhl (<i>Pipistrellus kuhlii</i>) e da traça-da-oliveira (<i>Prays oleae</i>). As divergências temporais entre pares de espécies foram estimadas como a diferença de tempo (expressa como percentagem da noite) em que <i>P. kuhlii</i> e <i>P. oleae</i> atingiram 50% de sua abundância.\n\nO estudo foi realizado durante a primavera, verão e outono entre 2017 e 2019 em 60 olivais representando níveis crescentes de simplificação estrutural (usada como um indicador da intensificação agrícola). Os olivais foram classificados como exibindo complexidade estrutural alta (HIGH; <i>n</i> = 27), intermédia (MID; <i>n</i> = 18) ou baixa (LOW; <i>n</i> = 15).\n\nAs divergências temporais entre os níveis de atividade de <i>P. kuhlii</i> e <i>P. oleae</i> variaram entre as estações do ano e tipos de olivais, sendo comparativamente menores no verão do que na primavera e outono. Além disso, o verão foi a única estação em que as divergências temporais entre pares de espécies diferiram entre tipos de olivais, com divergências temporais mais elevadas em olivais LOW do que em olivais HIGH e MID.\n\nNo geral, o nosso trabalho demonstra a existência de divergências temporais entre os padrões de atividade noturna de <i>P. kuhlii</i> e <i>P. oleae</i>. Além disso, demonstra que a simplificação estrutural dos olivais aumenta as divergências temporais entre pares de espécies, especialmente no verão, quando os serviços de biocontrole mediados por morcegos são mais necessários.\n\n<i>Síntese e aplicações</i>: Os trabalhos de investigação no futuro devem ter em conta as divergências entre os padrões temporais de atividade de morcegos insetívoros e insetos-praga. Caso contrário, o impacto real da intensificação agrícola nos serviços de biocontrole mediados por morcegos, bem como o impacto económico da sua perda na indústria agrícola, pode ser subestimado. Para incrementar os serviços de biocontrole, propomos o aumento da disponibilidade de abrigos e locais de alimentação, bem como a conservação de áreas de bosques nativos remanescentes e árvores dispersas.\n</p>","author":"José M. Herrera, \nAna Carvalho, \nSílvia Barreiro, \nGerardo Jiménez‐Navarro, \nNereida Melguizo‐Ruiz, \nPedro Beja, \nFrancisco Moreira, \nSasha Vasconcelos, \nRui Morgado, \nBruno Silva","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"a7d37ecc8b63ec26284c80457baa91a4ae6399e80c5ec954e7dd2bff526f930e","category":"Environment"}