{"title":"ทำหมันฟรอมโฮม COSO ไอเดียเครื่องอุ่นไข่ ทำหมันชายชั่วคราว ชนะรางวัล Dyson Awards","link":"https://www.blognone.com/node/125356","date":1634645047000,"content":"<div><div><div><p>นักวิทยาศาสตร์หญิงชาวเยอรมัน Rebecca Weiss ชนะรางวัลออกแบบ Dyson Awards ด้วยไอเดียเครื่อง COSO เครื่องอุ่นไข่เพื่อคุมกำเนิดชายชั่วคราว หลังเธอตรวจพบสารตั้งต้นของมะเร็งปากมดลูกที่อาจเกิดจากการใช้ยาคุมกำเนิดฝ่ายหญิงและปรึกษาว่าจะให้ฝ่ายชายคุมกำเนิดแทน</p>\n<p>เธอพบว่านอกจากถุงยางแล้ว ผู้ชายยังมีตัวเลือกการคุมกำเนิดที่จำกัดกว่าผู้หญิง ที่มียาคุมกำเนิดทั้งแบบทานปกติ แบบฉุกเฉิน และแบบฝัง เธอจึงอยากเพิ่มทางเลือกคุมกำเนิดให้ผู้ชาย และแบ่งเบาภาระการคุมกำเนิดที่ตกอยู่กับฝ่ายหญิง โดยออกแบบเครื่อง COSO ขึ้นมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/06b45657437666849900db91498f6523.jpg\" /></p>\n<p>COSO จะใช้น้ำอุ่นและคลื่นอัลตร้าซาวด์ ส่งความร้อนเข้าไปภายในถุงอัณฑะ เพื่อทำให้อสุจิไม่สามารถเคลื่อนไหวได้ชั่วคราว การใช้งานครั้งแรกต้องใช้ภายใต้การควบคุมของแพทย์ เพื่อตั้งค่าความร้อนให้เหมาะสมกับขนาดอัณฑะ หลังจากนั้นผู้ใช้ต้องรอเวลาสองสัปดาห์เพื่อให้กระบวนการได้ผลสูงสุด</p>\n<p>ครั้งที่สองและครั้งต่อๆ ไป ผู้ใช้สามารถใช้งานได้จากบ้านด้วยตัวเอง โดยแต่ละครั้งผู้ใช้ต้องแช่อัณฑะไว้ในเครื่องสามถึงสี่นาที ทำซ้ำทุก 2 เดือน หากไม่ต้องการคุมกำเนิดแล้ว อาจต้องรอให้ผลการคุมกำเนิดหายไปภายในระยะเวลาราว 6 เดือน หลังจากการใช้เครื่องครั้งสุดท้าย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2a2a55a13a9e736c02e1e9c85a712063.jpg\" /></p>\n<p>เครื่องนี้ยังไม่ได้จำหน่ายในวงกว้าง เพราะยังเป็นแค่ทฤษฎี ขาดเงินทุน และยังมี<a href=\"https://rbej.biomedcentral.com/articles/10.1186/1477-7827-10-7\">ผลวิจัยเบื้องต้น</a>ซึ่งทำในสัตว์เท่านั้น ใครที่สนใจอาจจะต้องรอผลวิจัยเพิ่มเติม หรือการปรับปรุงประสิทธิภาพเครื่องต่อไปอีกสักระยะ</p>\n<p>ที่มา - <a href=\"https://www.coso-contraception.de/\">COSO</a>, <a href=\"https://www.jamesdysonaward.org/2021/project/coso-the-new-way-of-male-contraception/\">The James Dyson Awards</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gadget\">Gadget</a></div><div><a href=\"/topics/innovation\">Innovation</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a7db4a5470cbc49fd63c348088fceaf19ea40bcc53b305ebcff45c8e93e38eed","category":"Thai"}