{"title":"Apple introduces new M3 chip lineup, starting with the M3, M3 Pro, and M3 Max","link":"https://arstechnica.com/?p=1979517","date":1698766847000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Apple-M3-chip-series_screen-800x450.jpeg\" alt=\"Apple is introducing three M3 performance tiers at the same time. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Apple-M3-chip-series_screen.jpeg\">Enlarge</a> <span>/</span> Apple is introducing three M3 performance tiers at the same time.  (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>NEW YORK—None of the new Macs that Apple is announcing at its \"Scary Fast\" product event today look very different from the ones they're replacing on the outside, but the inside is another story. This is the first batch of Macs to include Apple's next-generation M3-series chips, and unlike past years, Apple is introducing multiple M3 performance tiers all at the same time.</p>\n<p>The M3, M3 Pro, and M3 Max all share the same underlying CPU and GPU architectures, the same ones used in the iPhone 15 Pro's A17 Pro chip. Also like the A17 Pro, all M3 chips are manufactured using a new 3 nm process from Taiwan Semiconductor (TSMC). Let's dive into everything we know about the M3 family's capabilities, plus the differences between each performance tier.</p>\n<h2>Meet the Apple M3 family</h2>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Screenshot-2023-10-30-at-8.47.43%E2%80%AFPM-980x613.jpeg\" /></div>\n          <p>\n            Apple prioritized comparisons to the M1 generation, which is more likely to be relevant for upgraders. But in context with the M2 numbers, M3 looks like a typical year-over-year upgrade.                          [credit:\n                              Apple                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Apple says that the performance cores in any given M3 processor can run up to 30 percent faster than the M1's performance cores, and that the efficiency cores are up to 50 percent faster. Most of Apple's direct performance comparisons were to the M1 generation, which is useful insofar as M2 Mac owners aren't likely to want to spring for M3, but it has the added marketing benefit of making the performance increases sound larger than they are.</p></div><p><a href=\"https://arstechnica.com/?p=1979517#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979517&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a7e0c7d4a9ee25f387aca78189c5721afbcebcde904887411c5637aaef0c8004","category":"Tech"}