{"title":"วิธีการอ่านเลขรุ่นทีวีของ Sony ก่อนตัดสินใจซื้อ","link":"https://markpeak.net/sony-tv-model-numbers-explained/","date":1627443085000,"content":"<p>เล็งจะซื้อทีวีใหม่มาเป็นปีแล้ว ไม่ได้ซื้อสักที (ฮา) วนกลับมาดูใหม่เรื่อยๆ (บทความตอนเดิม <a href=\"https://markpeak.net/tv-buying-2020/\">ประสบการณ์ซื้อทีวีปี 2020</a>)</p>\n<p>ตอนนี้เปลี่ยน requirement ใหม่ว่าอยากได้ Android TV/Google TV ด้วยเหตุผลว่ารองรับ Google Cast ในตัว ทำให้ตัวเลือกลดลงเหลือไม่กี่ยี่ห้อ พอพูดถึงสมาร์ททีวีที่เป็น Android แล้ว ยี่ห้อที่เด่นที่สุดย่อมหนีไม่พ้น Sony</p>\n<p>แต่พอมาหาข้อมูลทีวีของ Sony ก็ถึงกับงงในระบบการเรียกชื่อรุ่น ต้องกลับมาตั้งหลักเพื่อให้เข้าใจระบบเลขรุ่นก่อน มาเจอเว็บนี้ทำไว้ค่อนข้างดีเลย</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.expertreviews.co.uk/sony/1405370/sony-2021-tv-model-numbers-every-new-sony-oled-and-lcd-explained\">\n\t\t\t\t\t<img src=\"https://cdn1.expertreviews.co.uk/sites/expertreviews/files/2021/07/sony_model_numbers_-_lead_image.jpg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.expertreviews.co.uk/sony/1405370/sony-2021-tv-model-numbers-every-new-sony-oled-and-lcd-explained\">\n\t\t\tSony 2021 TV model numbers: Every new Sony OLED and LCD explained\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.expertreviews.co.uk/sony/1405370/sony-2021-tv-model-numbers-every-new-sony-oled-and-lcd-explained\">\n\t\t\t<p>Bamboozled by all those similar-sounding Sony TV model numbers? Here's how to decipher them</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://cdn1.expertreviews.co.uk/sites/expertreviews/themes/expertreviews2/favicon.ico\" />\t\tExpert Reviews\t</div>\n</div>\n<p>อย่างแรกที่สุดคือ ต้องเข้าใจก่อนว่า เกรดหรือคลาสของทีวี เป็นเรื่องที่แยกจากขนาดหน้าจอ เราอาจเห็นทีวี 50″ ที่อยู่กันคนละคลาส คนละระดับราคาได้ ดังนั้นต้องเข้าใจเรื่องคลาสที่แยกย่อยโดยเลขรุ่นก่อน</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/07/sony-x90j.jpg\" /></p>\n<p>ถ้าเราไปดูข้อมูลผลิตภัณฑ์ตามเว็บช็อปปิ้งต่างๆ จะพบว่าเลขรุ่นทีวี Sony ปี 2021 จะใช้โครงสร้างดังนี้</p>\n<blockquote><p>XR-65X90J</p></blockquote>\n<p>เราถอดรหัสรุ่นออกมาได้ดังนี้</p>\n<ul>\n<li>XR = ตัวหน้าเป็นชื่อคลาสใหญ่ที่ไม่ต้องสนใจมากนัก รุ่นท็อปๆ ใช้ XR ส่วนรุ่นปกติใช้ KD</li>\n<li>65 = ขนาดหน้าจอ</li>\n<li>X = คลาสหลัก แยกตามเทคโนโลยีหน้าจอ\n<ul>\n<li>Z = ตัวแพงสุด ใช้จอ LED เป็น 8K แล้ว</li>\n<li>A = จอ OLED ความละเอียด 4K</li>\n<li>X = จอ LED ความละเอียด 4K</li>\n<li>W = สมาร์ททีวีตัวล่าง (เข้าใจว่าปีหลังๆ ไม่ทำแล้ว)</li>\n<li>R = ทีวีที่ไม่สมาร์ท (เข้าใจว่าปีหลังๆ ไม่ทำแล้ว)</li>\n</ul>\n</li>\n<li>90 = คลาสรอง ยิ่งเยอะยิ่งแพงตามฟีเจอร์ที่เพิ่มขึ้น บางครั้งอาจใช้เลขตัวเดียว เช่น 9 = 90 แต่ก็มีตัวย่อยอย่าง 80/85 ด้วย</li>\n<li>J = เลขรุ่นปีที่ออกสินค้า เรียงตามลำดับอักษรภาษาอังกฤษ\n<ul>\n<li>2019 = G</li>\n<li>2020 = H</li>\n<li>2021 = J (ข้ามตัว I)</li>\n</ul>\n</li>\n</ul>\n<p>ดังนั้น XR-65X90J แปลว่ามันคือ ทีวีซีรีส์ X (จอ LED) รุ่นท็อป (90) ผลิตปี 2021 (J) ขนาด 65 นิ้ว</p>\n<p>ถ้าเข้าเว็บ Sony อาจเห็นการใช้เฉพาะ 3-4 ตัวหลัง เช่น ทีวีท็อปสุดของปี 2021 คือ Z9J (LED) และ A90J (OLED) เป็นต้น โดยตัวท็อปสุดของทั้งสองไลน์จะมีคำว่า Master Series แปะมาด้วยให้ดูหรูหราขึ้นเวลาโฆษณา</p>\n<p>สำหรับคนทั่วๆ ไปที่ไม่ใช่คอเครื่องเสียงหรือโฮมเธียเตอร์ คิดว่าคลาส X ก็น่าจะพอเพียงกับความต้องการแล้ว</p>\n<p>พอเข้าใจโครงสร้างหลักของการไล่ซีรีส์ผลิตภัณฑ์แล้ว ตัวเลขที่เราควรสนใจคือคลาสรอง (95/90/85/80/75/70) ซึ่งตรงนี้จะเป็นรายละเอียดยิบย่อยแล้ว เช่น ต่างกันที่สเปกของซีพียู, ระบบเสียง หรือ ฟีเจอร์ refresh rate ฯลฯ ตรงนี้พอจำกัดสโคปของคลาสที่จะซื้อได้แล้ว ก็ค่อยเปรียบเทียบคุณสมบัติที่อยากได้ กับราคาที่รับไหวกันต่อไป</p>\n<p>สุดท้ายเป็นเรื่องของระบบปฏิบัติการ สมาร์ททีวีของ Sony เป็น Android TV เกือบหมดอยู่แล้ว แต่ในรุ่นปี 2021 (รหัส J) เป็นต้นมา <a href=\"https://www.blognone.com/node/118753\">กูเกิลออก OS ตัวใหม่ชื่อ Google TV ที่แตกต่างจาก Android TV เล็กน้อย</a> (ตัวแกน OS เหมือนกัน ใช้แอพตัวเดียวกัน แต่หน้าตาต่างออกไปหน่อย) ซึ่ง<a href=\"https://www.blognone.com/node/120434\">ทีวีของ Sony รุ่นปี 2021 เป็น Google TV ทั้งหมด</a>แทน</p>\n<p>ถ้าเลือกได้ผมคิดว่าซื้อ Google TV ไปเลยดีกว่า ไม่ต้องซื้อรุ่นเก่าของปี 2020 แล้วมาลุ้นว่าจะได้อัพเกรดหรือไม่ เว้นเสียแต่ว่ารุ่นเก่าปี 2020 มันลดราคาหนักจริงๆ ก็อีกเรื่องนึง</p>\n<p>นอกจาก Sony แล้ว <a href=\"https://www.blognone.com/node/120735\">ผู้ผลิตอีกแบรนด์ที่ประกาศทำ Google TV คือ TCL</a> โดยจะเปิดตัวช่วงเดือนสิงหาคม 2021 ถือเป็นอีกตัวเลือกที่น่าสนใจ (และราคาย่อมถูกกว่า Sony) ส่วนวิธีเรียกรหัสรุ่นของ TCL จะเป็นอย่างไร ก็ไว้เขียนถึงเมื่อโอกาสอำนวย</p>The post <a href=\"https://markpeak.net/sony-tv-model-numbers-explained/\">วิธีการอ่านเลขรุ่นทีวีของ Sony ก่อนตัดสินใจซื้อ</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"a7ea89e04a1b4f1887c5d02dd0c51358ca02ce9e0b9ee029be0bdd4c3bf00826","category":"Thai"}