{"title":"Apple warns billions of users of actively exploited zero-day vulnerability","link":"https://www.macworld.com/article/2160361/apple-devices-zero-day-ios-ipados-macos.html","date":1701452846000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In case you didn’t read the subhead, if you have an iPhone, iPad, or Mac, you need to update it right now. Apple has released <a href=\"https://www.macworld.com/article/2159452/ios-17-1-2-webkit-security-updates.html\">iOS and iPadOS 17.1.2</a>, <a href=\"https://www.macworld.com/article/2159458/apple-releases-macos-sonoma-14-1-2-to-fix-exploited-zero-day-webkit-flaws.html\">macOS Sonoma 14.1.2</a>, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT214033&amp;xcust=1-1-2160361-1-0-0&amp;sref=https://www.macworld.com/feed\">Safari 17.1</a> for macOS Monterey and macOS Ventura to patch two extremely critical WebKit flaws affecting Safari on the Mac and every browser on the iPhone and iPad.</p>\n\n\n\n<p>Apple reports that the zero-day (meaning it was previously unknown to users and security researchers) “may have been exploited against versions of iOS before iOS 16.7.1,” which <a href=\"https://www.macworld.com/article/2101467/ios-ipados-16-7-1-security-updates.html\">only arrived in November</a> to fix a separate zero-day flaw. It’s unclear whether any instances of the vulnerability being exploited on the Mac have been recorded. It’s the 20th zero-day patch issued by Apple in 2023.</p>\n\n\n\n<p>Apple is also working on watchOS 10.2 and tvOS 17.2, which will presumably arrive within a week or two and contain the same patch. Both fixes affect WebKit and were discovered by Clément Lecigne of Google’s Threat Analysis Group:</p>\n\n\n\n<p><strong>WebKit (CVE-2023-42916)</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing web content may disclose sensitive information. Apple is aware of a report that this issue may have been exploited against versions of iOS before iOS 16.7.1.</li>\n\n\n\n<li><strong>Description:</strong> An out-of-bounds read was addressed with improved input validation.</li>\n</ul>\n\n\n\n<p><strong>WebKit (CVE-2023-42917)</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been exploited against versions of iOS before iOS 16.7.1.</li>\n\n\n\n<li><strong>Description:</strong> A memory corruption vulnerability was addressed with improved locking.</li>\n</ul>\n\n\n\n<p>Earlier this week, Google also issued an <a href=\"https://www.macworld.com/article/2159446/chrome-mac-security-update-119-0-6045-199-exploit-in-the-wild.html\">emergency update for Chrome on Mac</a>, which patches seven security flaws, at least one of which has been known to have been exploited in the wild.</p>\n\n\n\n<p>To update your device, head over to Settings (iPhone or iPad) or System Settings (Mac), then General and Software Update. On older Macs, go to System Preferences, then Software Update.</p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a7f08b186051d3af0e70a5f4a7a7cfd360826b2e48963d30ea80d08b4200481b","category":"Apple"}