{"title":"96 Using greenhouse gas flux to estimate forage dry matter intake in ad libitum fed replacement heifers","link":"https://academic.oup.com/jas/article/102/Supplement_3/329/7757178?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>An accurate estimate of feed intake is a critical component in determining individual animal feed efficiency. However, existing feed intake measurement systems are not designed for unprocessed, dry forage diets. Open-circuit gas flux technology measures enteric gas emissions for cattle in a pasture-based setting. If a significant relationship exists between feed intake and gas emissions, this system could be used to rank grazing cattle for forage intake and forage utilization efficiency. Our objective was to develop prediction equations to estimate forage dry matter intake using gas flux and performance data. Angus and Angus x Hereford heifers [n = 71; initial body weight (BW) 329.5 ± 31.1 kg] were used over 3 yr to measure intake, gain, and gas flux. All heifers were subject to a 21-d adaptation and 71-d intake test using individual intake technology (SmartFeed; C-Lock Rapid City, SD) with a stocking rate of 3.3 heifers per feeder. Throughout the study, heifers were fed a long-stem, unprocessed, grass hay diet (≥ 10.8% CP, 2.0 Mcal ME, and 56% TDN) with ad libitum access to a salt/mineral supplement. The GreenFeed system (C-Lock Rapid City, SD) was used to monitor oxygen (O2) consumption (means ± SD; 3364.4 ± 374.8 g/d), methane (CH4; 181.4 ± 24.3 g/d) and carbon dioxide (CO2) production (4,965.3 ± 494.5 g/d). Body weights were collected every 14 d, and average daily gain (ADG) was calculated by regressing BW on day of study. The phenotypic correlations of forage DMI with CO2, CH4, O2, and heat production (HP) were 0.72, 0.66, 0.74, and 0.74, respectively. Average daily gain and midpoint metabolic BW combined with the estimate of daily HP, O2, or CO2 accounted for 60% of the variation in forage DMI. These results suggest that forage intake can be predicted using performance data in conjunction with the GreenFeed gas quantification system.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a7fec3b93d7d2277f6371959c769076521bca4cc37d7dcecc15bfc0b616c59c0","category":"Environment"}