{"title":"Ferrostatin-1 mitigates cellular damage in a ferroptosis-like environment in Caenorhabditis elegans","link":"https://academic.oup.com/toxsci/article/200/2/357/7675480?rss=1","date":1715817600000,"content":"<span><div>Abstract</div>Although iron (Fe) is the most biologically abundant transition metal, it is highly toxic when it accumulates as Fe<sup>2+</sup>, forming a labile Fe pool and favoring the Fenton reaction. This oxidative scenario leads to a type of caspase-independent programmed cell death, referred to as ferroptosis, where following processes take place: (i) Fe<sup>2+</sup> overload, (ii) glutathione peroxidase 4 inactivation, (iii) lipid peroxidation, and (iv) glutathione depletion. The present study sought to evaluate the consequences of Fe<sup>2+</sup> administration on ferroptosis induction in <span>Caenorhabditis elegans</span>. We demonstrated higher mortality, increased lipid peroxidation, reduced glutathione peroxidase activity, and morphological damage in dopaminergic neurons upon Fe<sup>2+</sup> overload. Pharmacological intervention at the level of lipid peroxidation with ferrostatin-1 (250 μM) mitigated the damage and returned the biochemical parameters to basal levels, revealing the potential of this therapeutical approach. Finally, to assess the relationship between ferroptosis and dopamine in a Parkinsonian background, we evaluated the UA44 worm strain which overexpresses the alpha-synuclein protein in cherry-labeled dopaminergic neurons. We demonstrated that Fe<sup>2+</sup> administration reduced lethality associated with similar alterations in biochemical and dopaminergic morphological parameters in wild-type animals. These experiments provide mechanistic-based evidence on the efficacy of a pharmacological approach to mitigate the physiological, biochemical, and morphological consequences of Fe<sup>2+</sup> overload. At the same time, they encourage further research on the impact of the combined effects resulting from the genetic background and dopamine signaling in a Parkinsonian phenotype. </span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"a80448427a33d2fb3ceafb932ee7807cdc12578612adf24a339f6270a2e1e88f","category":"Environment"}