{"title":"Thriving, smiling, and the art of not giving a f*** - Mads Pedersen is doing things his way","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mads-pedersen-thriving-and-aiming-for-a-monument-in-2024","date":1703232001000,"content":"\n      <p>In the space of 18 months, Mads Pedersen has gone from someone who, if you believe the narrative, was fortunate to become a world champion at 23, to now being a stage winner in all three Grand Tours and comfortably placed among the best bike riders on the planet.</p>\n<div></div>\n<div></div>\n<p>“To be honest,” he says, a smile forming, “I could stop tomorrow, sit down and say I am pretty fucking happy with what I’ve done already. But” – and there’s always a but for insatiable athletes like Pedersen – “if I just win one Monument, I can tick that off and stop. That would make me happy.”</p>\n<p>The Dane has come close: second on debut at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>, and third and eighth since; fourth at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a>; and twice he has finished sixth at Milan-Sanremo. But the Lidl-Trek man hasn’t quite found a way to the top step just yet. “If I look at my cycling career, it’s just the one thing that’s missing. Flanders is a really tough race, and I think it’s a race that really suits me the most. My dream would, of course, be to win Paris-Roubaix, but if it ends up being Sanremo and not Roubaix, I would still be pretty proud.”</p>\n<p>Pedersen, recently-turned 28, is still without a Monument victory, but he has won a stage in each of the last four Grand Tours he has participated in; it’s an enviable streak. In that time, he’s also won the points jersey at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> and led the same classification at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>. “As long as if I can look in the mirror, look at myself, and say, ‘OK, I am actually proud of the person I am and what I am doing’, then I am happy and I can wake up with a smile. And there’s been a lot of smiles this year.”</p>\n<p><img alt=\"Mads Pedersen\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-06843.jpg?v=1703175835\" /></p>\n<p>Even with Lidl coming on board to further bolster his team’s finances, a partnership that led to a slew of new signings <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/moving-forward-tao-geoghegan-harts-begins-new-chapter-at-lidl-trek\">including Pedersen’s long-time friend Tao Geoghegan Hart</a>, who he says is “a fucking good guy, a super good bike rider”, Pedersen remains the American squad’s standout leader. “I take that as a compliment. When I reach a position of leadership, it’s because I’ve worked hard enough to be one of the best. I’ve got there because I’m good at something.”</p>\n<p>Just don’t call him a poster boy. “I hate social media,” he says. “I only have it because we need to do it. I’m bad at it.” But, I remind him, last summer he went viral in the cyclosphere, bathing in a paddling pool and getting dry in a Lidl towel. “That was Jacob’s video!” he says of his team’s press officer. “I’m just the clown and he makes the rest. How the world is right now, you can make your name even bigger on social media, but I’m not good at it and don’t want to spend time on it. Of course, I’m watching reels of dogs doing stupid things like everyone else, but that’s pretty much it.”</p>\n<p>So that means he hasn’t been keeping up to date with the autumn and winter’s mergers, transfer sagas and rumblings over the OneCycling plans to restructure the sport, with potential investors from Saudi Arabia? “I don’t give a fuck about anything else,” he says, characteristically straight-talking. “I read the news once in a while but not everything. I can’t tell you who is going where, or rumours with this or that. I think it’s really healthy not to give a fuck, to concentrate on yourself, to eat from your own plate. Leave it like that. If you’re too busy with what the rest is eating, you’ll become crazy.”</p>\n<p>Downtime Mads Pedersen-style takes place in Switzerland these days, the country he relocated to in 2022. “My wife and I go to Zurich, take a hike in the mountains, take the dogs out, swim in the lakes. We pull the plug out, and just be us. Half of the time I’m not there, so my wife deserves that when I’m home, I’m fucking home. I spend time with her and I do what she likes to do.”</p>\n<p>Long-distance relationships are just a reality of cycling, but rarely are the challenges of it brought up in public. “She sacrifices even more than us riders do. Don’t tell me when she was 15 she had the dream of living my life. She deserves to be treated like a queen while I am leading this life.</p>\n<p><img alt=\"Mads Pedersen\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-06048.jpg?v=1703175865\" /></p>\n<p>“People ask how we do it. At least we have been together since we were really young, before I even turned professional, so it came in slowly. It’s hard, but I also think for the future it’s healthy as you learn to miss each other from a young age. I will maybe stop when I am 35, 36 maximum, and then I’ll still have a pretty long life in front of me. That’s when the rest of life begins.”</p>\n<p>But life in the present is also pretty good. “Everything is working out great: my private life is really good, my brother [Martin] just signed for the development team and my family is doing well. Everything's coming together right now. I’m proud, happy, it makes me smile.”</p>\n<p>Before he hangs his wheels up, however, he’s got plenty more wins to achieve, including an elusive Monument. “When I win races, I keep the day’s jersey with the number on. I don’t wash it, just dry it and hang it up. When I have a house that’s big enough – it won’t be in Switzerland as I can’t afford a big house there! – I want to put everything on a big wall. I’ll need space for all the custom bikes I keep too. I know what I want. I’m pretty fixed on my goal. When I have an idea in my mind, I know how I can make it happen. I just want to have a plan. It’s my way or no way.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a807f522b999e621877555eeac76a479cf9dcd759e662b321a6451a5519f883d","category":"Cycling"}