{"title":"Seeding roadsides is necessary but not sufficient for restoring native floral communities","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12364?af=R","date":1721209455000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/da899d7d-17d2-49eb-b063-ea9697b1612b/eso312364-toc-0001-m.png\" alt=\"Seeding roadsides is necessary but not sufficient for restoring native floral communities\" />\n<p>We performed floral surveys in revegetated roadside sites that were 2–20 years old, and were either seeded with diverse native grassland mixes or non-native mixes. We found that seeding native forbs is indeed necessary to have them establish. Both native and non-native sites had most of the floral diversity coming from colonising, non-native species. We highlight how refining the composition of seed mixes could benefit pollinators without increasing management costs.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe plant community in roadside right-of-ways is an important component of transportation infrastructure. Revegetation after construction is an opportunity to improve the plant community and create pollinator habitat. However, native seed mixes are substantially more expensive than those used in conventional roadside plantings, and transportation agencies often lack resources for management.\n\nHere, we compare the actively flowering plant community across a growing season in roadside plots seeded with native seed mixes versus non-native seed mixes in Minnesota, USA. Plots varied in age from 2 to 20 years old.\n\nWe demonstrate that native seeded plots had more native flowering forbs than non-native seeded plots, as native flowers were rare in the non-native seeded plots. However, despite some native species establishing well, many species in native seed mixes had poor or non-existent establishment. Furthermore, the native and non-native seeded plots converged in the makeup of their floral communities after a few years; part of this pattern is due to colonisation of species that were never seeded at either type of plot.\n\n<i>Practical implication</i>. If the goal of revegetation is to produce diverse, native dominated floral communities in roadsides, agencies must invest more in long-term management. Managers could also alter seed mixes to remove species that fail to establish, which would reduce the cost of the seed mix, but not the diversity of the plant community that ultimately establishes. The use of such streamlined seed mixes across more land area would increase the availability of pollinator habitat without substantially altering current budgets or management plans.\n</p>","author":"Timothy S. Mitchell, \nMichael R. Verhoeven, \nAshley L. Darst, \nCatherine H. Patterson, \nEmilie C. Snell‐Rood","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"a8098f625c69adaa8b226c13f7fb9f557f7233f034a24d5606002b0f76a3a167","category":"Environment"}