{"title":"Noninvasive, Drug Augmented, Ultra Low Intensity Transcranial Light Photodynamic Treatment of Glioblastoma: LIT-PDT","link":"https://www.preprints.org/manuscript/202407.1970/v1","date":1721898331000,"content":"This paper presents the rationale for using ultra low intensity transcranial light photodynamic treatment (LIT-PDT) for treating glioblastoma. Glioblastoma is currently treated with maximal safe resection, temozolomide and ionizing irradiation. Mortality in 2024 remains at over 80% within several years from diagnosis. 5-aminolevulinic acid (5-ALA) is a heme precursor that is selectively taken up preferentially by malignant cells, including glioblastoma. Photon energy can be transduced to molecular oxygen by a 5-ALA metabolite, PpIX, transforming oxygen to the singlet state, a reactive oxygen species (ROS) that destroys or damages vital glioblastoma cell structures. In PDT, light energy ~ 100 to 200 J / cm2, at 630 nm is delivered intraoperatively after resection and preoperative oral 5-ALA. This generates ROS cytotoxicity in residual glioblastoma cells within the resection cavity wall. 630 nm light poorly penetrates skin, skull, and brain tissue. That currently restricts PDT to a single intraoperative session using high flux light. LIT-PDT addresses some current shortcomings of 5-ALA PDT treatment. Part 1 analyzes published data indicating that continuous ultra low light flux, 17 μW / cm2, over 24 hours for a total delivery of 1.5 J / cm2, is effective for 5-ALA PDT treatment. That opens the way for repetitive, extracranial light to deliver enough energy for low flux, long duration PDT to any deep brain structure using less than 12 W total distributed over the entire scalp area. In Part 2, by analysis of 5-ALA and PpIX physiology, it became apparent that four non oncology drugs - ciprofloxacin, deferiprone, telmisartan and ziprasidone, will increase energy capture by GB cells, thereby increasing PDT treatment cytotoxicity. A phased pilot study of LIT-PDT treatment is being planned.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a812ce9b2a2135c418e8c999b710935ea42d291e3b666a6c5b7bb6607bedf960","category":"Interdisciplinary"}