{"title":"92 Utilizing buccal swabs as a substitute for ruminal fluid for characterizing the microbiome of Angus bulls","link":"https://academic.oup.com/jas/article/102/Supplement_3/330/7757177?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Gastrointestinal tract metagenomic sequencing has unveiled rumen microbiota influences on animal production and efficiency; however, ability to analyze the rumen non-invasively, amply, and cost-effectively is restricted, as specialized equipment is required to obtain ruminal samples. This study aimed to employ buccal swabs as a substitute for rumen sampling by exploiting rumination. Ruminal fluid contents and buccal swabs were collected from registered Angus bulls (n = 541) produced by five commercial feed testing centers located in Georgia, Iowa, and Montana. DNA was extracted and the 16S rRNA gene was sequenced to determine differences and similarities in microbial composition between the two sample types. Sequencing data were analyzed for taxonomic classification, and calculation of alpha and beta diversity indices. Microbial evenness (Pielou’s index), richness (number of amplicon sequence variants), and diversity (Shannon index) were all significantly greater (<span>P</span> &lt; 0.01) in the rumen, indicating distinct differences in alpha diversity between sample type. Beta diversity analysis (unweighted UniFrac distances) revealed the taxonomic profile of each sample type was also explicitly different (<span>P</span> &lt; 0.01). Both sample types were dominated by genera that are common members of each environment: <span>Streptococcus</span> in oral, and <span>Prevotella</span> in ruminal samples, and only three of the 30 most abundant genera for each sample type were shared in both environments. At the species level, only 33.1% out of 4,323 total microbial species occurred in both rumen and oral environments. Collectively, these results suggest substantial differences between oral and ruminal compartments, indicating that using the oral microbiome as a substitute for the rumen microbiome may not be a feasible strategy. Further research should be conducted to control for factors that could impact oral to rumen reflection, such as time since last feeding, rumination patterns, and water intake.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a8183744b42d644733aa33998bed4f25cd186b06f860ac65459ca540820565a6","category":"Environment"}