{"title":"Specialized’s next-gen Turbo ebikes can carry 240 blueberry muffins","link":"https://www.cyclist.co.uk/news/10113/specialized-turbo-vado-como","date":1632310083000,"content":"<span>\n      <span><a href=\"/authors/emma-cole\">Emma Cole</a></span>\n  </span><div>  \n  <div>      <div><span>22 Sep 2021</span></div>    </div></div><p>\nSpecialized's two new Turbo e-bikes are awash with savvy upgrades and smart security features</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/specialized_vado_2.jpeg?itok=xyDOS_He\" />  </div>\n<div>\n      <p> Specialized has launched two new versions of its most popular ebikes, the Turbo Vado and the Turbo Como.</p>\n<p>The models are the next generation of what Specialized calls ‘it’s you, only faster’ and have been updated with smart functionality.</p>\n<p>The Vado and Como include the MasterMind Turbo Display, a new integrated computer with enhanced security features such as the Turbo System Lock, which allows riders to disable the bike motor and activate the motion sensor alarm.</p>\n<p>When the bike is locked, only the owner can reactivate the motor.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/specialized_turbo_vado__0.jpg?itok=bCiy_2s9\" />  </div>\n</div>\n<p>The more expensive models also include rear-facing Garmin radar as standard, which detects vehicles approaching from behind.</p>\n<p>Additionally, Specialized’s Mission Control app allows riders to receive over-the-air software updates, meaning the bike’s functionality can be upgraded in the future if Specialized adds additional features.</p>\n<p>Both bikes feature 650b wheels with chunky 2.3in Pathfinder tyres for a comfortable ride, and have an upgraded cargo rack capacity of 27kg, up from 20kg, so you could carry up to 240 blueberry muffins, should the mood take you.</p>\n<p>With a suspension seatpost and a suspension fork with 80mm of travel, Specialized claims these e-bikes offer the ‘smoothest, quietest, most powerful, and most secure’ ride.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/specialized_turbo_como_0.jpg?itok=2apGjNKU\" />  </div>\n</div>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10098/who-are-the-favourites-for-the-elite-mens-road-world-championships-2021\">Who are the favourites for the elite men's road World Championships 2021?</a></div>      <div><a href=\"/in-depth/10104/who-are-the-favourites-for-the-elite-womens-road-world-championships-2021\">Who are the favourites for the elite women's road World Championships 2021?</a></div>      <div><a href=\"/news/10117/rgt-cycling-flanders\">Ride like a world champ on RGT sim's new Flanders course</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 118: on sale now!</a></div>    </div></div><h2>So which one should you choose?</h2>\n<p>The Vado is aimed at those wanting to try everything from adventures to commuting whilst the Como offers a more laid-back, upright position and the lowest step-through frame Specialized has ever designed, perfect for those looking for a confident, comfortable ride.</p>\n<p>That smart functionality doesn't come cheap of course, with prices for both the Vado and Como ranging from £3,200 to £5,000. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/bikes\">Bikes</a></div>    </div></div>","author":"ecole","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"a81e5bd2f2464c1ff4f33c7344058bfe47ac5ff352d89c406b3d4e06a957c8fb","category":"Cycling"}