{"title":"Impact of benzodiazepine use on the risk of occupational accidents","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302205","date":1713276000000,"content":"<p>by François-Olivier Baudot</p>\r\n\r\nBenzodiazepines (BZDs) are drugs commonly used for treating insomnia and anxiety. Although they are known to induce cognitive and psychomotor impairments, their effect on the risk of causing accidents at work remains understudied. The objective of this study is to estimate this risk by differentiating between the recommended use and overuse of these drugs (i.e., uninterrupted use for four months). The data come from the French National Health Data System, which provide a population composed of French people who had at least one work accident (WA) from 2017 to 2019 (approximately 2.5 million people). A linear probability model with two-way fixed effects is used to deal with time-constant heterogeneity and the time effect independent of individuals. The results show a reduction in the risk of WA after a short period of BZD use (one month) compared with no use at all, but the risk of WA increases when treatment exceeds the recommended duration. The intensity of use results in a greater risk of WAs: a 1% increase in BZD use (expressed as the amount reimbursed) leads to a 4.4% (p&lt;0.001) increase in the monthly risk of WAs. Moreover, we see an increase in risk in the month following the treatment discontinuation (+3.6%, p&lt;0.001), which could be due to rebounding and catch-up effects. Health professionals and BZD users should be made aware of the WA risk induced by the use of BZDs, particularly after prolonged use and after discontinuation of treatment. This study provides more evidence for the need to limit the duration of BZD treatment.","author":"François-Olivier Baudot","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a8265c7f60a31587cc3a6d97f1881c9ca303af06a6c758e31da91bba9823287e","category":"Interdisciplinary"}