{"title":"High‐speed escape jumps in haptophytes: Mechanism and triggering fluid signal","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12713?af=R","date":1729655436000,"content":"<h2>Abstract</h2>\n<p>Some planktonic organisms can remotely sense and evade predators by powerful escape jumps. Remote perception typically happens through the fluid disturbance generated by the approaching predator or its feeding current. In copepods and ciliates with mechanosensors, the perception and jump mechanisms are well understood. But how some flagellates perceive the fluid disturbance and achieve similar relative speeds with only two flagella is less explored. Here, we examined the ability of three haptophytes, <i>Chrysochromulina simplex</i>, <i>Prymnesium polylepis</i>, and <i>Prymnesium parvum</i>, to sense and evade the fluid disturbance generated by the feeding current of a copepod nauplius. <i>Chrysochromulina simplex</i> has a long haptonema (14 cell diameters), while the haptonema of the two other species are shorter (1 and 0.5 cell diameters). Only <i>C. simplex</i> responded to the fluid disturbance by fleeing at high speeds. The jump mechanism consists of two phases: the rapid coiling of the haptonema that pulls the cell about two cell diameters in the direction of the haptonema, followed by flagellar reversal and high-speed swimming (70 cell lengths per second) in the opposite direction. We rationalize cell displacements and escape speeds from haptonema and flagellar kinematics and fluid dynamics. Using a microfluidic channel, we demonstrate that the component of the fluid signal that triggers the jumps is the maximum deformation rate rather than the magnitude of deformation. High-speed escape jumps may be an avoidance mechanism evolved by haptophytes with long and coiling haptonema, while species with shorter haptonema may use other defense mechanisms, such as stealth and toxicity.</p>","author":"Federica Miano, \nSeyed Saeed Asadzadeh, \nFredrik Ryderheim, \nAnders Andersen, \nThomas Kiørboe","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"a82abed28d08ba1dc1ed9b469b7a85d3afc44820c83ceb40bbf173834de02ab5","category":"Environment"}