{"title":"Distribution‐Based Model Evaluation and Diagnostics: Elicitability, Propriety, and Scoring Rules for Hydrograph Functionals","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036710?af=R","date":1718799200000,"content":"<h2>Abstract</h2>\n<p>Distribution forecasts <i>P</i> over future quantities or events are routinely made in hydrology but usually traded for a (likelihood-weighted) mean or median prediction to accommodate error measures or <i>scoring functions</i> such as the mean absolute error or mean squared error. Case in point is the so-called KG efficiency (KGE) of Gupta et al. (2009, <a target=\"_blank\" href=\"https://doi.org/10.1016/j.jhydrol.2009.08.003\">https://doi.org/10.1016/j.jhydrol.2009.08.003</a>) and improvements thereof (Lamontagne et al., 2020, <a target=\"_blank\" href=\"https://doi.org/10.1029/2020wr027101\">https://doi.org/10.1029/2020wr027101</a>), which have rapidly gained popularity among hydrologists as alternative <i>scoring functions</i> to the commonly used Nash and Sutcliffe (1970, <a target=\"_blank\" href=\"https://doi.org/10.1016/0022-1694(70)90255-6\">https://doi.org/10.1016/0022-1694(70)90255-6</a>) efficiency, but are equally exclusive in how they quantify model performance using only single-valued output of the quantities of interest. This point-valued mapping necessarily implies a loss of information about model performance. This paper advocates the use of probabilistic watershed model training, evaluation and diagnostics. Distribution evaluation opens a mature literature on <i>scoring rules</i> whose strong statistical underpinning provides, as we will demonstrate, the theory, context and guidelines necessary for the development of robust information-theoretically principled metrics for watershed signatures. These so-called hydrograph functionals are scalar-valued mappings of major behavioral watershed functions embodied in a <i>strictly proper</i> scoring rule. We discuss past developments that led to the current state-of-the-art of distribution evaluation in hydrology and review scoring rules for dichotomous and categorical events, quantiles (intervals) and density forecasts. We are particularly concerned with elicitable functionals and scoring rule propriety, discuss the decomposition of scoring rules into a sharpness, reliability and entropy term and present diagnostically appealing <i>strictly proper</i> divergence scores of hydrograph functionals for flood frequency analysis, flow duration and recession curves. The usefulness and power of distribution-based model evaluation and diagnostics by means of scoring rules is demonstrated on simple illustrative problems and discharge distributions simulated with watershed models using random sampling and Bayesian model averaging. The presented theory (a) enables a more complete evaluation of distribution forecasts, (b) offers a statistically principled means for watershed model training, evaluation, diagnostics and selection using hydrograph functionals and/or extreme events and (c) provides a universal framework for metric development of watershed signatures, promoting metric standardization and reproducibility.</p>","author":"Jasper A. Vrugt","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"a82a5a9c2d2b9aed21542da07f4403e3b072813a9a09bc3c6ead80b0b228ea1b","category":"Environment"}