{"title":"Researchers figure out how to bypass the fingerprint readers in most Windows PCs","link":"https://arstechnica.com/?p=1986413","date":1701111127000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/IMG_0323-800x533.jpeg\" alt=\"The fingerprint sensor on a Lenovo ThinkPad X1 Carbon.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/IMG_0323.jpeg\">Enlarge</a> <span>/</span> The fingerprint sensor on a Lenovo ThinkPad X1 Carbon. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Since Windows 10 introduced Windows Hello <a href=\"https://arstechnica.com/information-technology/2015/03/windows-10-says-hello-to-logging-in-with-your-face-and-the-end-of-passwords/\">back in 2015</a>, most Windows laptops and tablets have shipped with some kind of biometric authentication device installed. Sometimes that means a face- or iris-scanning infrared webcam, and sometimes it means a fingerprint sensor mounted on the power button or elsewhere on the device.</p>\n<p>While these authentication methods are convenient, they aren't totally immune to security exploits. In 2021, researchers were able to fool some Windows Hello IR webcams with infrared images of users' faces. And last week, researchers at Blackwing Intelligence <a href=\"https://blackwinghq.com/blog/posts/a-touch-of-pwn-part-i/\">published an extensive document</a> showing how they had managed to work around some of the most popular fingerprint sensors used in Windows PCs.</p>\n<p>Security researchers Jesse D'Aguanno and Timo Teräs write that, with varying degrees of reverse-engineering and external hardware, they were able to fool the Goodix fingerprint sensor in a Dell Inspiron 15, the Synaptic sensor in a Lenovo ThinkPad T14, and the ELAN sensor in one of Microsoft's own Surface Pro Type Covers. These are just three laptop models from the wide universe of PCs, but one of these three companies usually does make the fingerprint sensor in every laptop we've reviewed in the last few years. It's likely that most Windows PCs with fingerprint readers will be vulnerable to similar exploits.</p></div><p><a href=\"https://arstechnica.com/?p=1986413#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986413&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a82e81ebffa86e2d589ce2d64bc7fa0812ce58e7cbf880c9389c86c1b22ba7e7","category":"Tech"}