{"title":"Peri-coronary fat attenuation index combined with high-risk plaque characteristics quantified from coronary computed tomography angiography for risk stratification in new-onset chest pain individuals without acute myocardial infarction","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304137","date":1716904800000,"content":"<p>by Xuelong Zhang, Zelong Cao, Jianan Xu, Xing Guan, Honghou He, Linan Duan, Lishuang Ji, Gang Liu, Qifeng Guo, Yang You, Mingqi Zheng, Mei Wei</p>\r\n\r\nThis study aims to evaluate the role of the peri-coronary Fat Attenuation Index (FAI) and High-Risk Plaque Characteristics (HRPC) in the assessment of coronary heart disease risk. By conducting coronary CT angiography and coronary angiography on 217 patients with newly developed chest pain (excluding acute myocardial infarction), their degree of vascular stenosis, FAI, and the presence and quantity of HRPC were assessed. The study results demonstrate a correlation between FAI and HRPC, and the combined use of FAI and HRPC can more accurately predict the risk of major adverse cardiovascular events (MACE). Additionally, the study found that patients with high FAI were more prone to exhibit high-risk plaque characteristics, severe stenosis, and multiple vessel disease. After adjustment, the combination of FAI and HRPC improved the ability to identify and reclassify MACE. Furthermore, the study identified high FAI as an independent predictor of MACE in patients undergoing revascularization, while HRPC served as an independent predictor of MACE in patients not undergoing revascularization. These findings suggest the potential clinical value of FAI and HRPC in the assessment of coronary heart disease risk, particularly in patients with newly developed chest pain excluding acute myocardial infarction.","author":"Xuelong Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a838212e584010eca1c309392b42687beb7d8766256cd7003d430a2b3bc7ac8b","category":"Interdisciplinary"}