{"title":"ชวนคนรุ่นใหม่แก้โจทย์ Cyber Security และ Subsea Machine Learning ในงาน ARV Hackathon 2021","link":"https://www.blognone.com/node/125045","date":1633086000000,"content":"<div><div><div><p>โอกาสสำหรับคนสายเทคโนโลยีและ Start-up ที่ต้องการลับคมตัวเองมาแล้ว กับงาน ARV Hackathon 2021 พร้อมโจทย์สุดท้าทายที่ผู้เข้าร่วมจะได้ใช้ทักษะ สร้างโซลูชั่นที่นำมาใช้จริงในอุตสาหกรรมพลังงาน</p>\n<p>AI and Robotics Ventures หรือ ARV มุ่งมั่นสู่การเป็นศูนย์กลางของธุรกิจเทคโนโลยีปัญญาประดิษฐ์ และหุ่นยนต์ (Artificial intelligence and Robotics) ที่ล้ำสมัยอย่างครบวงจร เพื่อสร้างธุรกิจให้เติบโตอย่างก้าว กระโดด และเป็นแหล่งรายได้ใหม่ให้กับ บริษัท ปตท.สำรวจและผลิตปิโตรเลียม จำกัด (มหาชน) หรือ ปตท. สผ. ซึ่งปีนี้ ARV ได้นำหัวข้อ Cyber Security  และ Subsea Machine Learning มาเป็นโจทย์หลักของงาน ARV Hackathon 2021  เฟ้นหาสุดยอดทีมนักพัฒนาที่อยากท้าทายตัวเอง และสนใจเทคโนโลยี ร่วมโชว์ศักยภาพสร้างสรรค์นวัตกรรมและพัฒนาโซลูชั่นใหม่ๆ ที่สามารถสร้างความปลอดภัยให้กับโลกไซเบอร์ ปกป้องข้อมูล และแก้ไขช่องโหว่ของระบบที่มีในปัจจุบัน ตลอดจนถึงการพัฒนาขีดความสามารถของปัญญาประดิษฐ์ เพื่อต่อยอดธุรกิจในทุกอุตสาหกรรมได้อย่างมีประสิทธิภาพ</p>\n<p>โดยครั้งนี้ เปิดโอกาสให้ผู้สมัครทุกอาชีพ ไม่ว่าจะเป็น นักศึกษา Start-up, Programmer, Innovator หรือบุคคลทั่วไปที่มีความสนใจ เข้ามาร่วมเป็นส่วนหนึ่งของโครงการ</p>\n<p>ทาง Blognone ได้พูดคุยกับ ดร.ธนา สราญเวทย์พันธุ์ ผู้จัดการทั่วไปของ ARV ถึงงาน Hackathonในปีนี้ และสิ่งที่ผู้เข้าแข่งขันจะได้เจอ รวมไปถึงประสบการณ์ที่จะได้รับกลับไปจากงานนี้</p>\n<h3>ทำความรู้จัก ARV กับโปรเจกต์สำคัญด้าน AI และ Robotics</h3>\n<p>AI and Robotics Ventures หรือ ARV เป็นบริษัทที่ดำเนินธุรกิจเกี่ยวกับเทคโนโลยีปัญญาประดิษฐ์และหุ่นยนต์ (Artificial intelligence and Robotics) สร้างสรรค์ พัฒนา และต่อยอดเทคโนโลยีด้านนวัตกรรม ครอบคลุมการใช้งานทั้งทางอากาศ ทางบก และทางทะเล เพื่อแก้ปัญหาที่มีความท้าทายในหลากหลายอุตสาหกรรม และมีเป้าหมายเพื่อสนับสนุนการนำเทคโนโลยี AI และ Robotics ไปใช้ประโยชน์ ได้ทั้งภาครัฐและเอกชน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/39ed38074ace7a7ee520705fbd05a392.jpeg\" /></p>\n<p>ARV มีจุดเริ่มต้นจากการเป็นชมรมวิจัยหุ่นยนต์ในบริษัท ปตท. สผ. ผลงานแรก ๆ ของชมรมคือ การสร้างโดรนตรวจสอบเพื่อซ่อมบำรุงปล่องเผาเชื้อเพลิงส่วนเกิน (Flare Stack) ที่ทีมงานช่วยกันพัฒนาขึ้นมาจากศูนย์ ไม่ได้นำโดรนยี่ห้อไหนมาดัดแปลงเลยแม้แต่น้อย อีกหนึ่งโครงการคือ การพัฒนาหุ่นยนต์ที่สามารถควบคุมได้จากระยะไกล มาใช้ในการตรวจสอบซ่อมบำรุงท่อใต้น้ำ ซึ่งเข้ามาช่วยลดค่าใช้จ่ายให้กับธุรกิจได้เป็นอย่างมาก</p>\n<p>เมื่อปี 2561 ชมรมหุ่นยนต์ได้รับความสนใจจากผู้บริหารของ ปตท. สผ. ที่เริ่มมองเห็นโอกาสทางธุรกิจ ทำให้ชมรมหุ่นยนต์ถูกจัดตั้งแยกออกมาเป็นบริษัทลูกที่มี ปตท. สผ. ถือหุ้น​​ทั้งหมดในชื่อบริษัท AI and Robotics Ventures (ARV)</p>\n<p>ARV มองเห็นว่าแนวโน้มของเทคโนโลยีด้าน AI และ Robotics กำลังเข้ามามีบทบาทในชีวิตประจำวันของผู้คนมากขึ้นเรื่อยๆ ซึ่งองค์กรในประเทศไทยเอง ก็เริ่มมีการนำเทคโนโลยีดังกล่าวมาปรับใช้ เพื่อให้การทำงานในด้านต่างๆ มีความสะดวก รวดเร็ว และมีประสิทธิภาพมากขึ้น โดยมีทั้งการนำเข้าเทคโนโลยีจากต่างประเทศ และการเริ่มพัฒนาด้วยตนเองภายในประเทศ</p>\n<p>สำหรับ ARV เพื่อตอบโจทย์ที่ท้าทาย และไม่ได้มีเทคโนโลยีสำเร็จรูปพร้อมใช้จึง จำเป็นต้องเลือกที่จะลงมือและพัฒนาเทคโนโลยีเหล่านี้เอง แม้ว่าจะมีความท้าทายในหลายๆ ด้าน แต่ ARV ก็มีความพร้อมเป็นอย่างมาก ทั้งในเรื่องของทีมงานที่มีประสบการณ์ ประสิทธิภาพ และ passion รวมถึง infrastructure ที่มีความพร้อมสำหรับการนำ prototype และโมเดลต่างๆ ไปทดลองใช้งานได้ในพื้นที่การทำงานจริง และที่สำคัญ ARV อาศัยการร่วมมือกับ พันธมิตร เพื่อช่วยกัน พัฒนา เทคโนโลยีให้เร็วยิ่งขึ้นเพื่อตอบสนองความ จำเป็น และ รวดเร็ว ของ ภาคธุรกิจ อีกทั้ง ARV ยังมีหล่งเงินทุนที่แข็งแรง จึงเป็นสิ่งที่ทำให้ ARV สามารถดำเนินการพัฒนา และส่งมอบเทคโนโลยีต่างๆ ได้อย่างมีประสิทธิภาพ<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/158a31f6b922ba355495d17c7c8367fb.jpeg\" /></p>\n<p>ปัจจุบัน ARV ในบทบาทของการเป็น Business Builder มี 4 ธุรกิจ ที่ถือเป็น New Business S-Curve ให้กับ ปตท.สผ. และเชื่อว่ามีศักยภาพที่สามารถ unlock valuation ไปถึงระดับยูนิคอร์น (Unicorn) ได้ คือ</p>\n<ul>\n<li><strong>Rovula</strong>: ธุรกิจ Subsea IRM สำหรับการตรวจสอบ ซ่อมแซม และบำรุงรักษาใต้ทะเลอย่างครบวงจร</li>\n<li><strong>Skyller</strong>: ธุรกิจการทำ Industrial Infrastructure Inspection Platform โดยการใช้หุ่นยนต์และปัญญาประดิษฐ์</li>\n<li><strong>Varuna</strong>: ธุรกิจเกษตรอัจฉริยะอย่างครบวงจรใน scale ระดับประเทศ</li>\n<li><strong>Cariva</strong>: ธุรกิจน้องใหม่ที่ยกระดับการดูแลรักษาสุขภาพ ให้แก่ ภาคธุรกิจและประชาชนไทย ผ่าน Platform เครือข่ายข้อมูล และบริการด้านสุขภาพ</li>\n</ul>\n<p>เป้าหมายของ ARV ในวันนี้คือเป็น Venture Studio ในการพัฒนาเทคโนโลยีร่วมกับพันธมิตรทางธุรกิจชั้นนำ ทั้งจากในประเทศและต่างประเทศ ภายใต้แนวคิด “Partner of Choice” เพื่อที่จะนำมาใช้แก้ปัญหา Pain Point ต่างๆ ทั้งของธุรกิจพลังงานที่เป็นธุรกิจหลักของ ปตท. สผ. รวมไปถึงธุรกิจอื่นๆ นอกกรอบอุตสาหกรรมพลังงานต้นน้ำ</p>\n<h3>ARV Hackathon 2021 งานที่ผู้เข้าแข่งขันจะได้คิดและลงมือทำ</h3>\n<p>ARV Hackathon 2021 ครั้งนี้ มีหัวข้อโจทย์ในการแข่งขัน จำนวน 2 Tracks คือ</p>\n<p><strong>Track I: Cyber Security</strong> ร่วมกันยกระดับความสามารถและขีดจำกัดของ Digital Wallet ให้สะดวก รวดเร็ว และปลอดภัยสำหรับผู้ใช้งาน</p>\n<p>●   จัดแข่งขัน Hackathon วันที่ 20-21 และ 27 พฤศจิกายน 2564</p>\n<p><strong>Track II: Subsea Machine Learning</strong> ร่วมออกแบบ Machine Learning Model ที่มีความสามารถในการตรวจจับและแยกแยะวัตถุใต้ท้องทะเล<br />\n●   จัดแข่งขัน Hackathon วันที่ 11-12 และ 18 ธันวาคม 2564</p>\n<p>ทั้งสอง Track เป็นธุรกิจที่ ARV กำลังพัฒนาอยู่ ดังนั้น Hackathon ครั้งนี้จึงเป็นโอกาสของผู้เข้าแข่งขัน ที่จะได้มาร่วมสร้างโซลูชั่นเพื่อใช้ในอุตสาหกรรมจริง และ Case Study จริง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b834a928a65cf40a4fa04ec80089d8e3.png\" /></p>\n<p>Hackathon ครั้งนี้มีเป้าหมายเพื่อค้นหาโซลูชั่นในการต่อยอด และพัฒนาเทคโนโลยีปัญญาประดิษฐ์ และหุ่นยนต์ ที่มีความสมบูรณ์แบบ ทดแทนการทำงานของมนุษย์ใต้ท้องทะเล เพื่อลดต้นทุนและค่าใช้จ่ายของธุรกิจคู่ค้าได้อย่างมีประสิทธิภาพยิ่งขึ้น</p>\n<p>นอกจากนี้ ARV ยังนำเรื่อง Cyber Security มาเป็นโจทย์เพื่อค้นหาแนวคิดและนวัตกรรมในการปกป้องข้อมูลของธุรกิจในเครืออื่นๆ ไม่ว่าจะเป็นด้าน Digital Wallet หรือในธุรกิจด้านการเกษตรและสุขภาพ ซึ่งมีข้อมูลที่ต้องบริหารและเก็บรักษาจำนวนมากโดยเฉพาะข้อมูลส่วนบุคคล</p>\n<p>การใช้โจทย์ AI ผสานรวมกับ Cyber Security ใน Hackathon ครั้งนี้ จะช่วยเสริมรากฐานความปลอดภัยในอุตสาหกรรมพลังงานรวมไปถึงธุรกิจในอุตสาหกรรมอื่นๆ ของประเทศไทย ให้แข็งแกร่งยิ่งขึ้น</p>\n<p>หากใครอยากท้าทายตัวเอง อยากลงมือปฏิบัติจริง เพื่อผลลัพธ์ที่เป็นรูปธรรมและจับต้องได้ ARV Hackathon 2021 คืองานที่ตอบโจทย์ความท้าทายของผู้เข้าร่วมได้เป็นอย่างดี</p>\n<h3>สมัครเข้าร่วมแข่งขัน ARV Hackathon 2021</h3>\n<p>ARV Hackathon 2021 เปิดประสบการณ์การแข่งขันแบบใหม่ ที่ใช้โจทย์จากปัญหาที่พบละต้องการแก้ไขจากอุตสาหกรรมจริง ซึ่งผู้เข้าแข่งขันจะได้รับประสบการณ์ที่ไม่สามารถหาได้จากการแข่งขันที่ไหนมาก่อน เปิดโอกาสให้ผู้เข้าร่วมได้แสดงศักยภาพ เพิ่มโอกาสในการพัฒนานวัตกรรมร่วมกับ ARV ในอนาคต</p>\n<p>เปิดรับสมัครผู้สนใจเข้าร่วมแข่งขันแล้ววันนี้ จนถึงวันที่ 31 ตุลาคม 2564 ที่ เว็บไซต์ <a href=\"https://www.arvhackathon2021.riseaccel.com/\">ARV Hackathon</a></p>\n<p>และหากมีความสนใจ ต้องการทราบข้อมูลเพิ่มเติม สามารถลงทะเบียนเข้าร่วมงาน Open House ในวันที่ 12 ตุลาคม 2564 เพื่อฟังรายละเอียดโครงการได้<a href=\"https://www.eventbrite.com/e/arv-hackathon-2021-open-house-tickets-172436280557\">ที่นี่</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/hackathon\">Hackathon</a></div><div><a href=\"/topics/cybersecurity\">Cybersecurity</a></div><div><a href=\"/topics/machine-learning\">Machine Learning</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a843d4fcb273a9a3d7b74839c0d983e4550513b9daffef1035ffd94eda17ec6c","category":"Thai"}