{"title":"Effects of  Phase and Annealing Twins on Mechanical Properties and Impact Toughness of L-PBF Inconel 718","link":"https://www.preprints.org/manuscript/202405.0684/v1","date":1715364325000,"content":"This study examines the effects of the δ phase and annealing twins on the hardness, Charpy impact toughness, and tensile properties of Inconel 718 fabricated using L-PBF. Two heat treatment methods, involving solid solution and precipitation hardening, were utilized. The δ phase was formed through solid solution heat treatment at 980C for 1 hour while annealing twins were generated at 1100C for 3 hours. After precipitation hardening, specimens with a higher concentration of  precipitates exhibited increased ultimate tensile strength (13%), yield strength (27%), and hardness (12%) compared to those with annealing twins. This can be attributed to the smaller grain size, subgrains, and δ precipitates, which contribute to the differences in mechanical strength. On the contrary, specimens with annealing twins showed significantly higher impact toughness (4 times) and ductility (twice) than those with δ precipitates. This is caused by the formation of  precipitates, which serve as sites for void formation and crack propagation, leading to a decrease in plasticity due to lattice mismatches with the matrix. Microstructural, compositional, phase, crystallographic, and fractographic analyzes were performed using OM, SEM, TEM and XRD techniques to identify the factors responsible for the variations in the measurements. The results demonstrate that the heat treatment method involving annealing twins significantly improves the ductility of Inconel 718 while maintaining the required mechanical strength.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a8438a28824669810359858fc9ff88482a141949145457ea411c662d5c090ace","category":"Interdisciplinary"}