{"title":"E3 Saxo Classic - route, contenders and predictions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/e3-saxo-classic-route-contenders-and-predictions","date":1679478317000,"content":"\n      \n<p>By the time the peloton departs from Harelbeke on Friday to take part in the 2023 E3 Saxo Classic, the cobbled classics season will be well under way. Held two days after Brugge-De Panne and two days before Gent-Wevelgem, the E3 is the second of the five so-called Flemish week races that culminates on Sunday 2nd April with the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>.</p>\n<div></div>\n<p><span>The Tour of Flanders is of course the main event that all these races are building up to, but the E3 Saxo Classic is not only a reliable barometer of form leading up to that race, but also a very prestigious race to win in its own right. That’s reflected in the calibre of riders who have triumphed here in the past: Tom Boonen holds the record with five victories here, closely followed by Rick Van Looy on four and Fabian Cancellara and Jan Raas on three each, while more recent editions have seen the likes of Peter Sagan, Greg Van Avermaet and Kasper Asgreen triumph. </span></p>\n<p>Last year, Wout van Aert continued a rich vein of form to take victory in a Jumbo-Visma one-two with Christophe Laporte. He’ll unite with Laporte along with opening weekend winners Dylan van Baarle and Tiesj Benoot to try and defend his title as part of a formidable Jumbo-Visma line-up, and will come up against the likes of Mathieu van der Poel (Alpecin-Deceuninck), Tadej Pogačar (UAE Team Emirates) and Filippo Ganna (Ineos Grenadiers), fresh from their enthralling battle at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a>.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_E3_Saxo2781.jpg?v=1679477646\" alt /></p>\n<h3>Route</h3>\n<p><span>The E3 Saxo Classic is the hardest and most selective of the cobbled classics leading towards the Tour of Flanders. There are 16 climbs in total over the course of the 204km race, which is more than enough to split the race to pieces — solo winners are often triumphant, and you have to go all the way back to the 2012 edition for the last time a group larger than five contested a finishing sprint. </span></p>\n<p><span>The similarities to the Tour of Flanders are emphasised by the inclusion of that race’s two most important climbs, the Oude Kwaremont and the Paterberg. As in that race, they are tackled in quick succession (albeit the other way around), with each posing a different test for the riders: the length of the Kwaremont, which lasts a relentless 2km, and the steepness and brutal cobbles of the Paterberg. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2023-03-22_at_09.11.28.png?v=1679476580\" alt /></span><em>(Route map provided by E3 Saxo Bank Classic)</em></p>\n<p><span>Whereas these climbs are the last tackled in the ‘Ronde’, here two more obstacles await the riders before heading to the finish in Harelbeke. First is the Karnemelkbeekstraat, a 1.4km effort averaging 5.7% climbed less than 10km after the Kwaremont. Then, 10km later, the Tiegemberg, a shorter (800m) and gentler (4.8%) berg that nevertheless can still provide a launchpad before the final 20km run-in to the finish. </span></p>\n<p><span>These final four climbs will likely be the most important, but there will be plenty of action beforehand. Aside from the early ascent of the Katerberg, all of the race’s climbs are squeezed within the final 116km, with recognisable tests such as the Taainberg and Eikenberg on the menu. </span></p>\n<h3><span>Contenders</span></h3>\n<p>Jumbo-Visma dominated last year’s race with <strong>Wout van Aert </strong>and <strong>Christophe Laporte </strong>riding away from the rest of the field to place first and second, and both riders return this year alongside <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop Het Nieuwsblad</a> winner <strong>Dylan van Baarle </strong>and Kuurne-Brussels-Kuurne winner <strong>Tiesj Benoot</strong>. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1247470766_ecc23a5a-7200-4b11-b9cd-17db391b9e8a.jpg?v=1679477025\" alt /><span>Although Van Aert is the team’s marquee name, all four of these riders have the potential to win. Expect Jumbo-Visma to make the most of their resources by riding an aggressive, multi-pronged race to try and engineer a numerical advantage.</span></p>\n<p><span>It will be difficult to overcome a team with so much quality, but if anyone can, you sense it might be </span><strong>Tadej Pogačar</strong><span>. Though his early-season winning streak was interrupted at Milan-Sanremo, the way he flew up the Poggio showed he still has great form, and his performance at last year’s Tour of Flanders suggests that the cobblestones won’t be a problem for him on what will be his E3 Saxo Classic debut. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/w-GettyImages-1474361575_77e52092-f4cf-4412-8eeb-5f0782670f2d.jpg?v=1679477080\" alt /></span><span>Fresh from his victory last weekend at Milan-Sanremo, there are no longer any questions about the form of </span><span><strong>Mathieu van der Poel</strong></span><span>, and worryingly for everyone else, the cobbles classics probably suit him even better than La Primavera. One concern is that his Alpecin-Deceuninck team don’t have the same strength in depth at Jumbo-Visma, although </span><strong>Søren Kragh Andersen </strong><span>did a great job to help the Dutchman win at the weekend.</span></p>\n<p><span>Soudal-QuickStep’s troubles continued at Milan-Sanremo, where they failed to place a rider in the top ten, and they will be under pressure to up their game in their home classics. </span><strong>Julian Alaphilippe </strong><span>will ride the cobbles for the first time this season having skipped opening weekend, and they’re hoping that former </span><strong>Kasper Asgreen </strong><span>can discover the form that saw him win the 2021 E3 Saxo Classic. </span></p>\n<p><strong>Stefan Küng </strong>was third here last year, and must again be counted among the favourites, and will line-up alongside <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> runner-up and Groupama-FDJ teammate<strong> Valentin Madouas</strong>. <strong>Matej Mohorič </strong>(Bahrain-Victorious) continued to look in great form at Milan-Sanremo even if he didn’t manage to defend his title, and should be in the mix again having been among the most impressive riders on the climbs during opening weekend. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_-00048_1447840a-b4f5-46c4-bf40-d1b5e33f4ba8.jpg?v=1679477198\" alt />Nobody will want to take any of <strong>Biniam Girmay </strong>(Intermarché–Circus–Wanty), <strong>Michael Matthews </strong>(Jayco-AlUla) or <strong>Mads Pedersen </strong>(Trek-Segafredo) in a group sprint finish; especially the latter given the way he’s started the season, with a stage win at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a> from a bunch sprint and sixth at Milan-Sanremo. And after what he did on the Poggio at the latter race, there will be great interest in how <strong>Filippo Ganna</strong> (Ineos Grenadiers) handles the cobblestones as he builds up towards Paris-Roubaix.</p>\n<h3><strong>Prediction</strong></h3>\n<p><span>As powerful as Van der Poel and Pogačar are, Jumbo-Visma’s strength-in-numbers will give them the edge. But it may not be Van Aert who is the triumphant rider for them. </span></p>\n<p><span>We’ve seen many times that the optimum tactic for teams as superior as Jumbo-Visma is for the rider everyone fears the most to hang back while their other riders attack. So it could be that Benoot, Laporte and Van Baarle attack while Van Aert sits back and marks, knowing that their rivals will be reluctant to chase if it means giving him a free ride. Van Aert will also be happy for one of his teammates to win this one, as his main goals are the Tour of Flanders and Paris-Roubaix. </span></p>\n<p><strong>Dylan van Baarle</strong><span> is exactly the kind of rider who flourishes when allowed up the road early and can to get his head down and ride his own race, so we’re backing him to add E3 Saxo Classic to his 2023 Het Nieuwsblad and 2022 Paris-Roubaix titles. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a84e2a3b027e95aabe6ef0abea57577e9faa984083a05192d82f2ac4503b2331","category":"Cycling"}