{"title":"The Potential Use of the Pelagic Seaweed Sargassum spp. as an Alternative Lignocellulosic Raw Material for Particleboards: Technical Viability and Life Cycle Assessment","link":"https://www.preprints.org/manuscript/202404.0856/v1","date":1712934044000,"content":"There have been beaching events of the marine alga pelagic sargassum in coastal regions of the Caribbean Sea, West African countries, and the north-northeast region of Brazil since 2011. Its presence has caused environmental and socioeconomic impacts while several studies were conducted in order to understand the causes of this phenomenon, as well as alternatives to mitigate its impacts. The objective of this research was to evaluate pelagic sargassum biomass as a raw material for the manufacture of medium-density multilayer particleboards. These are composed of 30% sargassum particles in their inner layer and 70% sugarcane bagasse particles on their outer layers which are bonded with castor oil-based polyurethane resin. A physical and chemical characterization was carried out in order to evaluate sargassum particles while physical and mechanical tests were carried out in order to evaluate the panels. Results were subsequently compared with indications from NBR 14810-2:2018 and ISO 16893:2016 standards. A life cycle assessment based on ISO 14040:2006 and 14044:2006 was carried out as to complement the feasibility study of these panels and to compare their different manufacturing processes. The multilayer panels met the minimum requirements for physical and mechanical properties established by regulations, indicating that the Sargassum spp. biomass can be used as filling. The life cycle assessment study indicates that sargassum panels produced in the Belém-PA-Brazil region present lower environmental impacts in four of seven evaluated categories when compared to conventional panels. As such, they constitute an alternative way to mitigate environmental impacts generated by beaching events.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a85d1ab5ffdc4443225d64d0d3e053833c6b3cc9deb20b3535dab8733180f5ce","category":"Interdisciplinary"}