{"title":"Variations in benthic coverage and diversity of shallow water coral reefs in Eastern coast of Sri Lanka: A combined analysis from Allen Coral Atlas and ground surveys","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12825?af=R","date":1720503466000,"content":"<h2>Abstract</h2>\n<p>Monitoring changes in coral reef ecosystems for their conservation and management is important as they are frequently subject to various natural and anthropogenic threats. However, in Sri Lanka, the attention in this regard is to be further concerned for their well-being. Therefore, this study focused on the selected shallow water (&lt;5 m) coral reefs as Pigeon Island (PIR), Adukkuparu (AR), Salli Beach (SBR), Kayankerni (KR), and Passikuda (PR) on the Eastern coast of Sri Lanka to estimate their changes over 2020, 2021, and 2022. The remote sensing demarcations with the composition of reef ecosystems were done through the analysis of the Allen Coral Atlas data followed by field surveys. Higher accuracy levels for corals were obtained for each site due to field verifying all individual polygons and omitting unmatched polygons of the initial maps from the Allen Coral Atlas. Then, the in-situ reef surveys were conducted over randomly selected permanent transects at each site. From 2020 to 2022, the live coral percentages have increased in PIR, AR, and SBR while reduced in KR and PR. Dead corals have facilitated the overgrowth of macroalgae. The combined area of live coral on all five reefs has slightly gone up. This increase is primarily due to the rise in live coral cover in AR and SBR. Also, prominent increments of coral diversity have resulted from those sites. Therefore, it is suggested that AR and SBR be designated as Marine Protected Areas to safeguard the newly emerging live corals.</p>","author":"E. P. D. N. Thilakarathne, \nS. C. Jayamanne, \nN. P. P. Liyanage","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"a861ce511d1df7bbf6894beb1a1d1888eb8358fdcbd06f4555c13f67ff8117d3","category":"Environment"}