{"title":"Active feeding of downstream migrating juvenile pink salmon (Oncorhynchus gorbuscha) revealed in a large Barents Sea river using diet and stable isotope analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15625?af=R","date":1710504692000,"content":"<h2>Abstract</h2>\n<p>The recent, rapid spreading of non-native pink salmon <i>Oncorhynchus gorbuscha</i> in the North Atlantic area has raised concerns about their possible negative impacts on native salmonid species. Potential interactions include competition for food resources during the short freshwater phase of juvenile <i>O. gorbuscha</i>, but little is known about their feeding behavior in the newly occupied North Atlantic rivers. Using stable isotope and stomach content analyses, patterns of freshwater feeding of non-native <i>O. gorbuscha</i> fry were studied in a large Fennoscandian river, the Teno, that discharges to the Barents Sea. Changes in stable isotope values (δ<sup>13</sup>C, δ<sup>15</sup>N, δ<sup>34</sup>S) and stomach contents from the period of emergence (April to mid-May) to estuarine entry (late May/June) were examined and provided both temporally integrated and short-term indicators of freshwater feeding dependency. In addition, the occurrence of juvenile <i>O. gorbuscha</i> and changes in their length and weight during their emergence/migration period were investigated. Juvenile <i>O. gorbuscha</i> were at the spawning grounds from April through to mid-May with abundance peaking in mid-May. Fish moved to the estuary by late May and their abundance decreased toward June, and their body size increased concurrently. Stomach analyses indicated no feeding activity in April–early May in the spawning areas, but the stomach fullness indices increased markedly in fish sampled in the estuary in May and June. The most important prey items in stomachs were Chironomidae and Ephemeroptera larvae. Significant changes in all analysed stable isotopes were detected among sample periods, with a peak in mid-May and June showing significantly lower values than other sample periods. A change from the higher values reflective of parental marine feeding to the lower values reflective of freshwater feeding indicated active in-river feeding by juveniles during the study period. The documented active freshwater feeding of non-native juvenile <i>O. gorbuscha</i> suggests potential resource competition with native fluvial fishes, particularly salmonids.</p>","author":"Jaakko Erkinaro, \nPanu Orell, \nMikko Kytökorpi, \nJan‐Peter Pohjola, \nMichael Power","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"a86fb271e0a7753bf662a5b0b1cba59ddd5af4d999892082198c7fcfccc70163","category":"Environment"}