{"title":"The Elite Rizer adds hills and steering to your indoor training","link":"https://www.bikeradar.com/news/elite-rizer/","date":1627315247000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Elite-Rizer3-91c8c2f.jpg?quality=45&amp;resize=620,413\" />                                            <p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">Smart trainer</a> maker Elite has added gradient simulation to its <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor training</a> range with the launch of the new Rizer, a smart fork mount that moves up and down to mimic the effects of climbing and descending.</p>\n<p>The Rizer, which will retail at £824.99, also incorporates steering support to take advantage of the latest features in training apps such as <a href=\"https://www.bikeradar.com/news/zwift-steering/\">Zwift</a>.</p>\n<p>Indoor training has soared in popularity in recent years with the availability of sophisticated smart trainers, and manufacturers are engaged in an arms race to add features to their systems that make using them a more immersive experience.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Elite Rizer adds both gradient and steering simulation to your indoor training.</span></figcaption><span> <i>Elite</i></span></div>\n<p>Gradient simulation isn’t a new idea – Wahoo has offered the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-climb-first-ride-review/\">Kickr Climb</a> for some years, for example – but we’re pretty sure the Rizer is the first device to combine gradient with the option of steering, the latter only previously available via the <a href=\"https://www.bikeradar.com/news/elite-sterzo-smart/\">Elite Sterzo</a> wheel stand.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The feet are adjustable and a carrying handle should make it easier to pick up and move.</span></figcaption><span> <i>Elite</i></span></div>\n<p>The Rizer consists of an upright that the fork mount moves up and down, and a platform supported by four spaced-out feet.</p>\n<p>It communicates wirelessly with your smart trainer and whatever device you’re running your training apps on, to offer real-time varying gradients.</p>\n<p>Elite says the Rizer simulates climbs up to +20 per cent and descents down to -10 per cent. That’s exactly the same range as the Wahoo Kickr Climb, incidentally.</p>\n<p>Elite also touts the device’s “newly patented” steering functionality, which will allow steering in apps that support it via Bluetooth and ANT+ FE-C.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The fork mount is designed to offer a realistic ride feel.</span></figcaption><span> <i>Elite</i></span></div>\n<p>The Rizer is also said to simulate the “micro movement” of your handlebar for a more realistic, immersive riding experience – your bar won’t be rigidly fixed in place.</p>\n<p>Elite’s new device can be controlled on a basic level using buttons on top of the upright, or you can use a dedicated app available for both Android and iOS devices.</p>\n<p>The Rizer is designed to be compatible with trainers that allow the bike to rotate upwards as you ‘climb’ and ‘descend’. In Elite’s own range these include the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/elite-direto-xr-smart-trainer-review/\">Direto XR</a>, Direto XR-T, <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/elite-suito-review/\">Suito</a>, Suito-T and <a href=\"https://www.bikeradar.com/news/elite-2020-smart-trainers/\">Tuo</a>.</p>\n<p>Elite says the Rizer will also work with those Wahoo trainers that are compatible with the Kickr Climb, including the latest <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-smart-trainer-2020-review/\">Wahoo Kickr v5</a>.</p>\n<p>The Rizer is designed to accept any road (or gravel) bike, and adaptors are included for quick-release skewers and the common 12mm and 15mm thru-axle sizes.</p>\n<p>Do you fancy riding up hills in your living room?</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a870f85ee4afd0601b153dbe66e787e9beb1edb0cc4c3f6fd52c4d2b93d48c64","category":"Cycling"}