{"title":"FlickType Pulling Apple Watch Keyboard App After Continued Rejection Issues","link":"https://www.macrumors.com/2021/08/16/flicktype-keyboard-app-store-rejection/","date":1629134036000,"content":"FlickType founder Kosta Eleftheriou, who has <a href=\"https://www.macrumors.com/2021/05/26/app-store-scam-app-required-a-good-review/\">been vocal</a> about scam apps on several occasions, today announced that his app <a href=\"https://apps.apple.com/us/app/flicktype-watch-keyboard/id1359485719\">FlickType Watch Keyboard</a> will be discontinued because of ongoing issues with Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> review team.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/flicktype-keyboard.jpg\" />\r\n<br />\r\nEleftheriou says that the FlickType team is no longer able to endure Apple's abuse after dealing with \"obstacle over obstacle\" over the years, culminating in a recent rejection last week.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>It's with a heavy heart today that we're announcing the discontinuation of our award-winning iPhone keyboard for blind users.<br /><br />Apple has thrown us obstacle after obstacle for years while we try to provide an app to improve people's lives, and we can no longer endure their abuse. <a href=\"https://t.co/cH1HCQzeP1\">pic.twitter.com/cH1HCQzeP1</a></p>— FlickType Watch Keyboard (@FlickType) <a href=\"https://twitter.com/FlickType/status/1427292830523744257?ref_src=twsrc%5Etfw\">August 16, 2021</a></blockquote> </div>\r\n<br />\r\nFlickType keyboard is a Apple Watch keyboard that can be used as an alternative to Apple's built-in Scribble feature. It allows for tap-based typing or swipe-based typing, and the app's description says that it's up to three times faster than the standard keyboard. There's also an Apple Watch and <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> keyboard component designed specifically for blind and low-vision VoiceOver users that features large keys, high-contrast colors, and VoiceOver feedback.\r\n<br />\r\n\r\n<br />\r\nAn update to FlickType with bug fixes and VoiceOver improvements was submitted last week. Though it added no new features, Apple rejected the app and said that it wouldn't work without full access, an issue that Eleftheriou says was addressed three years ago.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>We tried reaching out to Apple a total of 9 times last week, with no success. At this point they seem to be ignoring our attempts to contact them directly, despite previously explicitly telling us to \"feel free\" to contact them if we need \"further clarification\".</p>— FlickType Watch Keyboard (@FlickType) <a href=\"https://twitter.com/FlickType/status/1427292841676398596?ref_src=twsrc%5Etfw\">August 16, 2021</a></blockquote> </div>\r\n<br />\r\nAfter not being able to get in touch with Apple's ‌App Store‌ review team to get the issue resolved, the FlickType app is being discontinued. FlickType's developers wanted to keep the keyboard extension available as a TestFlight beta, but Apple rejected that idea. The long-term option is to provide the container typing app with a share button for exporting text, with no option to keep the functional keyboard around in its current form.\r\n<br />\r\n\r\n<br />\r\nEleftheriou previously <a href=\"https://www.macrumors.com/2021/03/18/apple-hit-with-lawsuit-from-developer/\">levied a lawsuit against</a> Apple in March over Apple's failure to get rid of copycat apps, and he today highlighted Apple's \"terrible\" third-party keyboard APIs as another reason for the App's discontinuation. Apple's keyboard APIs have reportedly been \"buggy, inconsistent, ever-changing, and broken\" since 2014.\r\n<br />\r\n\r\n<br />\r\nEleftheriou says that he hopes to one day return the app as a \"real\" keyboard app on the ‌iPhone‌ and the Apple Watch, \"hopefully outside of the ‌App Store‌\" in reference to current U.S. legislation that would require Apple to allow for <a href=\"https://www.macrumors.com/2021/08/11/antitrust-app-store-bill-apple-google/\">alternate third-party app stores</a> and sideloading.<div>Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/16/flicktype-keyboard-app-store-rejection/\">FlickType Pulling Apple Watch Keyboard App After Continued Rejection Issues</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/flicktype-pulling-apple-watch-keyboard-app-after-continued-rejection-issues.2307728/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=J1mRPgY1iZM:UeOnM9Y369k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=J1mRPgY1iZM:UeOnM9Y369k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/J1mRPgY1iZM\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a870f4f42e58d07b57d327b09c4640e87d7642afc4e444cfbbbdaa7998aab266","category":"Apple"}