{"title":"Even Google CEO Sundar Pichai doesn’t understand Google’s privacy controls","link":"https://arstechnica.com/?p=1978270","date":1698256195000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google-800x523.jpg\" alt=\"A large Google logo is displayed amidst foliage.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Sean+Gallup\">Sean Gallup | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>No one in the world seems to know how Google's privacy controls work, and the company probably likes it that way. The latest example is from <em>Rodriguez v. Google,</em> an ongoing 2021 class-action lawsuit over Google's infamous \"Web &amp; App Activity\" privacy check box. The box claims to stop Google from saving a user's \"activity\" to Google's servers, but the lawsuit says that isn't true. The interesting bit today comes from an expert witness called by the plaintiffs, who testified that even Google CEO Sundar Pichai incorrectly described how this check box works to Congress.</p>\n<p>Like a lot of Google court cases, this case has most of the records sealed so that <a href=\"https://arstechnica.com/tech-policy/2023/09/google-exec-said-users-get-hooked-on-search-engine-like-cigarettes-or-drugs/\">embarrassing</a> comments and testimony about the reality of Google's business don't reach the public. <a href=\"https://www.theregister.com/2023/10/24/google_privacy_button/\">The Register</a> noticed that a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.362381/gov.uscourts.cand.362381.344.0.pdf\">transcript</a> of the expert's video deposition is public, though, so we can see just a glimpse of what is going on in this case.</p>\n<p>The expert witness, Jonathan Hochman, called Google's \"Web &amp; App Activity\" check box \"a fake control, because it doesn't do—technically doesn't do what it seems it should do.\" Hochman later said, \"It looks like even Sundar Pichai is confused about how this control works because he testified in front of Congress and told them something that is just wrong from a technical perspective.\"</p></div><p><a href=\"https://arstechnica.com/?p=1978270#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1978270&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a8796743ddb218d59bf434fd2197cfea9050f812c6aae73e09c398d3bee8e1f3","category":"Tech"}