{"title":"The NES: How it began, worked, and saved an industry","link":"https://arstechnica.com/?p=305397","date":1639072781000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2013/07/Famicom-Console-Set-640x330.jpg\" />\n      <p>Nintendo's Family Computer, or Famicom, turns 30 today! (credit: <a href=\"https://en.wikipedia.org/wiki/File:Famicom-Console-Set.jpg\">Evan-Amos</a>)</p>  </figure>\n\n\n\n\n      <p><em><strong>Update, December 9, 2021:</strong> Masayuki Uemura, the lead architect for both the Famicom and Super Famicom, passed away on December 6 at the age of 78. Uemura worked at Nintendo from 1971 to 2004 and oversaw notable accessories like the Famicom Disk System and the Super Famicom's Satellaview modem accessory.\n\n<p>In honor of Uemura's career and his lasting impact on the game industry, we're republishing this 2013 piece we ran on the Famicom's 30th birthday, diving deep into the technical details of the system and exploring its history and legacy.</p></em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>We're right on the cusp of another generation of game consoles, and whether you're an <a href=\"http://arstechnica.com/gaming/2013/07/internet-petitioners-want-xbox-ones-digital-sharing-features-back/\">Xbox One fanperson</a> or a <a href=\"http://arstechnica.com/gaming/2013/06/analysis-the-one-two-combo-sony-used-to-knock-microsoft-out-of-e3-2013/\">PlayStation 4 zealot</a>, you probably know what's coming if you've been through a few of these cycles. The systems will launch in time for the holidays, each will have one or two decent launch titles, there will be perhaps a year or two when the new console and the old console coexist on store shelves, and then the \"next generation\" becomes the current generation—until we do it all again a few years from now. For gamers born in or after the 1980s, this cycle has remained familiar even as old console makers have bowed out (Sega, Atari) and new ones have taken their place (Sony, Microsoft).</p>\n<p>It wasn't always this way.</p></div><p><a href=\"https://arstechnica.com/?p=305397#p3\">Read 42 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=305397&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a8835fda23a5aee13ec971834eb9bf959c4391eeb776365df1cdd605548bd96d","category":"Tech"}