{"title":"PSV-16 Evaluation of upper respiratory and fecal microbiomes in neonatal beef calves","link":"https://academic.oup.com/jas/article/102/Supplement_3/524/7757700?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>There is a critical lack of information on the timing of colonization of bovine respiratory disease-related bacteria in the upper respiratory tract, potentially affecting calf health and disease onset. The objective of this study was to evaluate the upper respiratory tract and fecal microbiomes of neonatal beef calves during the first 24 h of life compared with their dams at the time of birth. Late-gestation commercial beef cows (n = 28) were assigned to individual, soil-surfaced pens (6.25 x 2.29 m) fitted with canvas tarps on shared fences to limit contact between unrelated pairs. Left nasal (LN), right nasal (RN), fecal, and vaginal swab samples were collected from cows at a single time point promptly after parturition. Swabs of the LN, RN, and rectum were collected from calves at birth (0 h), 6, 12, and 24 h post-parturition. Samples were flash-frozen and stored at -80°C until processing. DNA was extracted from swabs using Power Soil Pro kit. Extracted DNA was used to prepare DNA libraries for full-length 16S rRNA gene sequencing on a MinION Mk1C device. Sequenced reads were classified using Centrifuge and used in microbiome analyses conducted in R to estimate the changes in the microbiome according to animal type (cow versus calf), time of collection, and sample type (nasal, fecal, or vaginal). Upper respiratory microbiomes significantly differed (<span>P</span> &lt; 0.005) between cows and their offspring at birth. In nasal microbiomes, animal type explained 12.6% (<span>P</span> = 0.002) and 18.5% (<span>P</span> = 0.001) of variance in beta diversity in left and right cavities, respectively. Animal type explained 42.1% of the beta diversity variance in fecal microbiomes (<span>P</span> = 0.001). Nasal microbiomes at birth were significantly more dispersed in dams compared with their calves in both the LN (<span>P</span> = 0.03) and RN (<span>P</span> = 0.03). Similarly, fecal microbiomes of dams were significantly more dispersed (<span>P</span> &lt; 0.0001) than those of their offspring. There was a clear transition of the microbial communities associated with calf age in the upper respiratory and fecal niches. Calf age accounted for 2% (<span>P</span> = 0.02), 3.5% (<span>P</span> = 0.001), and 28% (<span>P</span> = 0.001) of the variance in the beta diversity of the LN, RN, and fecal microbiomes, respectively. After adjusting for calf age, the laterality of nasal microbiomes was not significantly (<span>P</span> = 0.682) associated with the composition of microbial communities. In conclusion, calf microbial communities were dissimilar to that of their dam at birth. Additionally, microbial community transition was evident with each subsequent sampling time point, potentially influenced by the presence of the dam.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a884104b8b09fa14b40d19d8d0e77cd3896b0e411eb9c81fd8e1428f29eb9a41","category":"Environment"}