{"title":"Comparative effectiveness of cervical vs thoracic spinal-thrust manipulation for care of cervicogenic headache: A randomized controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300737","date":1711720800000,"content":"<p>by Gopal Nambi, Mshari Alghadier, Mudathir Mohamedahmed Eltayeb, Osama R. Aldhafian, Ayman K. Saleh, Nesreen Alsanousi, Alaa Jameel A. Albarakati, Mohamed A. Omar, Mohamed Nagah Ahmed Ibrahim, Abdehamid A. Attallah, Mohammed Abdelgwad Ismail, Mohamed Elfeshawy</p>\r\nBackground <p>There is ample evidence supporting the use of different manipulative therapy techniques for Cervicogenic Headache (CgH). However, no technique can be singled as the best available treatment for patients with CgH. Therefore, the objective of the study is to find and compare the clinical effects of cervical spine over thoracic spine manipulation and conventional physiotherapy in patients with CgH.</p> Design, setting, and participants <p>It is a prospective, randomized controlled study conducted between July 2020 and January 2023 at the University hospital. N = 96 eligible patients with CgH were selected based on selection criteria and they were divided into cervical spine manipulation (CSM; n = 32), thoracic spine manipulation (TSM; n = 32) and conventional physiotherapy (CPT; n = 32) groups, and received the respective treatment for four weeks. Primary (CgH frequency) and secondary CgH pain intensity, CgH disability, neck pain frequency, neck pain intensity, neck pain threshold, cervical flexion rotation test (CFRT), neck disability index (NDI) and quality of life (QoL) scores were measured. The effects of treatment at various intervals were analyzed using a 3 × 4 linear mixed model analysis (LMM), with treatment group (cervical spine manipulation, thoracic spine manipulation, and conventional physiotherapy) and time intervals (baseline, 4 weeks, 8 weeks, and 6 months), and the statistical significance level was set at <i>P</i> &lt; 0.05.</p> Results <p>The reports of the CSM, TSM and CPT groups were compared between the groups. Four weeks following treatment CSM group showed more significant changes in primary (CgH frequency) and secondary (CgH pain intensity, CgH disability, neck pain frequency, pain intensity, pain threshold, CFRT, NDI and QoL) than the TSM and CPT groups (p = 0.001). The same gradual improvement was seen in the CSM group when compared to TSM and CPT groups (p = 0.001) in the above variables at 8 weeks and 6 months follow-up.</p> Conclusion <p>The reports of the current randomized clinical study found that CSM resulted in significantly better improvements in pain parameters (intensity, frequency and threshold) functional disability and quality of life in patients with CgH than thoracic spine manipulation and conventional physiotherapy.</p> Trial registration <p>Clinical trial registration: CTRI/2020/06/026092 trial was registered prospectively on 24/06/2020.</p>","author":"Gopal Nambi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a888d6e9085c9403f6c0f7fae20f9340596d7cda39c4b54c96ee5a5e87b9ff8e","category":"Interdisciplinary"}