{"title":"Qualitative Evaluation of a Quality Improvement Collaborative Implementation to Improve Acute Ischemic Stroke Treatment in Nova Scotia, Canada","link":"https://www.preprints.org/manuscript/202407.2211/v1","date":1722244167000,"content":"The Atlantic Canada Together Enhancing Acute Stroke Treatment (ACTEAST) project is a Modified Quality Improvement Collaborative (mQIC) designed to improve ischemic stroke treatment rates and time-based efficiency in Atlantic Canada. This study specifically evaluates the implementation of the mQIC in Nova Scotia using qualitative methods. The mQIC spanned six months and included two Learning Sessions, multiple webinars, and a per-site virtual visit. Each session was followed by an action planning period to guide implementation efforts over the following 2-4 months. The Consolidated Framework for Implementation Research (CFIR) was utilized to develop a pre-tested, semi-structured interview guide, which aimed to uncover barriers and facilitators to mQIC implementation. Interviews were conducted with 14 healthcare professionals, generating 454 references that were coded into 28 CFIR constructs. Notably, 84% of these references were positively framed as facilitators. Despite this, significant barriers were identified, including resource availability, competing priorities, communication challenges, and difficulties engaging key stakeholders. Some barriers were particularly prominent during specific phases of implementation. The study findings offer valuable insights into the implementation of quality improvement initiatives in stroke care. They underscore the importance of recognizing and addressing context-specific barriers, while also leveraging identified facilitators to drive successful implementation and ultimately improve patient outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a891423353cfe78d202b523ece17442646fe3ac0f92f8be356540d0d2aa9a29e","category":"Interdisciplinary"}