{"title":"Apple Asks Developers Whether They Would Attend In-Person WWDC Following Two Years of Digital Format","link":"https://www.macrumors.com/2021/06/11/apple-survey-for-in-person-wwdc/","date":1623435366000,"content":"As part of its annual survey given to developers at the end of WWDC, Apple is asking community members whether, following two years of the conference behind held in a digital format, they would be open to attending an in-person conference.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/06/esther-hare-wwdc.jpeg\" /> <div><em>Image Credit: <a href=\"https://www.axelboberg.se/\">Axel Boberg</a></em></div>\r\n<br />\r\nDue to the global health crisis, Apple has held its typically in-person Worldwide Developers Conference in an all-digital format for the past two years. The digital format, which includes a pre-recorded keynote from <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> and several sessions available online for free, has been loved by many in the community due to its openness and inclusiveness.\r\n<br />\r\n\r\n<br />\r\nUnlike the in-person conference, the online format has allowed Apple to reach millions more developers and users worldwide. Now, as the world begins to see the light at the end of the tunnel, Apple is possibly planning to return to an in-person conference next year while still retaining some aspects of a digital format. \r\n<br />\r\n\r\n<br />\r\nOne of the questions as part of this year's end of WWDC survey reads, \"How likely would you be to attend an in-person conference after experiencing an all-online event?\" \r\n<br />\r\n\r\n<br />\r\nWhile not totally indicative, it is worth noting that Apple is beginning to receive and collect feedback regarding the community's outlook towards possibly returning to the in-person conference. <em>Bloomberg's</em> Mark Gurman has <a href=\"https://www.macrumors.com/2021/03/31/apple-headset-next-several-months/\">previously noted</a> that Apple is contemplating the idea, and does plan to hold its first in-person event since the global health crisis began in the coming months. <br />This article, \"<a href=\"https://www.macrumors.com/2021/06/11/apple-survey-for-in-person-wwdc/\">Apple Asks Developers Whether They Would Attend In-Person WWDC Following Two Years of Digital Format</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-asks-developers-whether-they-would-attend-in-person-wwdc-following-two-years-of-digital-format.2300479/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KUEy1uXIsEk:C0_aoyCAF4E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KUEy1uXIsEk:C0_aoyCAF4E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/KUEy1uXIsEk\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a89136236d9063e6787829998872a6e2553d337ec98b21a584c357aba010c067","category":"Apple"}