{"title":"5 sorpresas que esperamos ver en el evento Wonderlust del iPhone 15","link":"https://www.macworld.com/article/2054441/sorpresas-evento-iphone-15-apple.html","date":1693905794000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Es oficial: el próximo evento de Apple tendrá lugar el 12 de septiembre. Las invitaciones ya han sido enviadas, y los expertos y expertas ya hemos analizado las ilustraciones y el eslogan (“Wonderlust”) en busca de pistas sobre los inminentes anuncios. No hay marcha atrás: el <em>hype</em> ya está aquí.</p>\n\n\n\n<p>Es casi seguro que el <a href=\"https://www.macworld.com/article/1474232/iphone-15-2.html\">iPhone 15</a> será presentado durante el <a href=\"https://www.macworld.com/article/2021726/evento-septiembre-apple-iphone-15.html\">evento de Apple</a> (la única vez que Apple retrasó el lanzamiento del iPhone a octubre fue en 2020, pero había razones concretas que lo justificaban). No obstante, las demás presentaciones siguen siendo un misterio.</p>\n\n\n\n<p>Estos son los cinco anuncios a largo plazo que encabezan nuestra lista de deseos optimistas.</p>\n\n\n\n<h2><strong>Apple Watch Ultra Series 2</strong></h2>\n\n\n\n<p>El <a href=\"https://www.macworld.com/article/1451002/review-del-apple-watch-ultra-un-reloj-para-expertos-casi-perfecto.html\">Apple Watch Ultra original</a> protagonizó un lanzamiento emocionante cuando fue presentado en otoño de 2022, dando a la gama Apple Watch su primera pequeña revolución en años. Daba la sensación de ser algo genuinamente nuevo, que atraía a excursionistas y entusiastas de los deportes extremos que nunca antes habían sido incluidos en el público objetivo de Apple, y daba un buen susto a fabricantes como Garmin y similares.</p>\n\n\n\n<p>Sin embargo, el patrón de los productos de Apple (y que los futuros clientes de las <a href=\"https://www.macworld.com/article/1945127/probamos-vision-pro-apple.html\">Vision Pro</a> deben tener en cuenta) marca que la segunda generación es la mejor. Y aunque nos gustó el primer Ultra, no hay duda de que se puede mejorar.</p>\n\n\n\n<p>La duración de la batería sigue estando muy por debajo de lo que ofrecen la mayoría de <em>smartwatches</em> resistentes, el botón Acción se activa por accidente con demasiada frecuencia (y es incómodo activarlo con guantes), y las correas originales son horribles. </p>\n\n\n\n<p>Todo esto podría arreglarse en una segunda generación, como ocurrió con el magnífico Apple Watch Series 2.</p>\n\n\n\n<p>Pero, ¿cuál es la sorpresa? Lo que realmente nos gustaría ver sería el prometido sistema de fijación magnética de las correas que se ha dicho que llegará el año que viene para el Apple Watch X. Dada la importancia de tener diferentes correas para hacer senderismo, bucear, etc., y el valor de meter una batería más grande dentro de su caja, el Ultra se beneficiaría enormemente de recibir esa actualización un año antes.</p>\n\n\n\n<h2><strong>AirPods Max 2</strong></h2>\n\n\n\n<p>Otro producto de Apple de primera generación que necesita las mejoras de la segunda generación, por no hablar de un rediseño completo de sus accesorios, son los <a href=\"https://www.macworld.com/article/1450823/review-de-los-airpods-max.html\">AirPods Max</a>. Son además bastante antiguos (salieron a la venta en diciembre de 2020) y se han quedado bastante atrás tecnológicamente (no pueden reproducir el audio sin pérdidas de Apple Music).</p>\n\n\n\n<p>No se espera que hagan acto de presencia en el evento de septiembre, pero deberían. Pero, con suerte, quizás si lo haga la funda Smart Case.</p>\n\n\n\n<h2><strong>AirTags</strong></h2>\n\n\n\n<p>Los <a href=\"https://www.macworld.com/article/1450855/review-del-apple-airtag-merece-la-pena.html\">AirTags</a>, el último de los productos de primera generación imperfectos, consiguieron uno de los logros clave de todo dispositivo de Apple: se convirtieron en un icono cultural y un punto de discusión. Ahora bien, fueron recibidos con críticas más serias que el iPhone original y los AirPods, por ejemplo, Apple no supo cómo no convertir los AirTags en un producto para el acoso tecnológico, situándose en la fina línea entre un producto antirrobo y un producto que invade la privacidad.</p>\n\n\n\n<p>La privacidad es un asunto complicado, y no hay nada que envidiar a los ingenieros que intentan encontrar la manera de que esto funcione. Pero Apple debería reconocer que hay un problema en el que deben trabajar, y sería una agradable sorpresa que la compañía eligiera este mes de septiembre para presentar la solución.</p>\n\n\n\n<h2><strong>iPad mini</strong> 7</h2>\n\n\n\n<p>Pobre iPad mini, tan a menudo olvidado cuando los otros iPads reciben atención. El mini actual salió a la venta en septiembre de 2021, antes de la actualización del Air en 2022, mientras que los iPad Pro y el iPad estándar se actualizaron en octubre de 2022. El <a href=\"https://www.macworld.com/article/1458700/ipad-mini-7.html\">nuevo iPad mini</a> está al caer.</p>\n\n\n\n<p>Dado que la sexta generación del iPad mini fue un rediseño relativamente importante, incluyendo la eliminación del botón de inicio y el paso a USB-C, en condiciones normales no esperaríamos que el nuevo modelo trajera cambios demasiados radicales. Pero han pasado dos años. Nos merecemos un iPad mini plegable.</p>\n\n\n\n<h2><strong>iPhone 15 mini</strong></h2>\n\n\n\n<p>Esto no va a ocurrir. En absoluto. Pero echamos mucho de menos el formato del iPhone mini.</p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/2045886/apple-wonderlust-event-surprises-apple-watch-ultra-airtag-ipad-mini-airpods-max.html\" target=\"_blank\">Macworld.com</a>.</em></p>\n\nApple Inc, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a895356d09ad028047bf2829d6d02d6ccc3ca594956b93e9192cae15dd4f9c64","category":"Apple"}