{"title":"CCleaner review: A flexible Mac utility for clearing clutter","link":"https://www.macworld.com/article/352988/ccleaner-review-macos.html","date":1628767800000,"content":"<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Impressive customization tools</li><li>Excellent control over storage</li></ul></div><div><h3>Cons</h3><ul><li>User interface is a little clunky</li></ul></div></div></div><h3>Our Verdict</h3><p>CCleaner achieves what it sets out to do: help clean up gigabytes of cache files, internet history files, and locate and purge large files on your Mac, all with an impressive level of control.</p>\n</div><h3>Price When Reviewed</h3><p>Free; $29.99 Pro version</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Piriform Software</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$0</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ccleaner.com/ccleaner-mac&amp;xcust=1-1-352988-2-352993-17689&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Piriform’s CCleaner, which was initially created to help clean up Registry files on Windows-based machines, made its way to the Mac in the Mac OS X 10.7 Lion days and hasn’t looked back. It’s been a techie staple on Macs, Windows PCs, and Android-based computers for years now, and rightfully so.</p>\n\n\n\n<p>Designed as freeware with an option to pay for a professional version and its appropriate annual license, CCleaner achieves what it sets out to do: help clean up gigabytes of cache files, internet history files, and locate and purge large files on your Mac, all with an impressive level of control. CCleaner may not be as flashy as its competitors but it gets the job done. </p>\n\n\n\n<p>You provide CCleaner with full hard disk access in the macOS Security and Privacy preference pane, and the software goes to work. A series of convenient modules (Mac OS X and Applications under the Cleaner tab, as well as Uninstall, Startup, Erase Free Space, Large File Finder, and Duplicate File Finder under the Options tab) provide easy access to specific tools. It’s easy to both analyze a hard drive to determine how much space certain files might be taking up, as well as view and organize a full list based on names and file sizes to see what’s been devouring your hard drive. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/CCleaner-Analysis.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>A CCleaner analysis report prior to running a final cleaning function.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>The Options tab lets you dive in and customize just about anything you want, including which cookies you want to save or purge and the deletion method to be used (“Normal file deletion,” which is faster or “Secure file deletion,” which is slower), Smart Cleaning preferences for files and specific web browser behavior, and user management so the professional version of CCleaner can be configured to specific users on your Mac. Per the professional version of CCleaner, your annual fee nets you active file monitoring, automatic updates in the background, full access for all users on your Mac, and premium tech support.</p>\n\n\n\n<p>Piriform seems to know what CCleaner’s strengths are and builds them out over time instead of jumping to the next shiny new feature which would change the software outright. It’s capable of an amazing amount of customization, configuration, and removes gigabytes of clutter at a time while functioning well, and no issues arose while testing it under macOS 11.5 Big Sur.</p>\n\n\n\n<h2>Windows look and feel</h2>\n\n\n\n<p>If there’s something to nitpick with CCleaner, it comes down to its user interface, which feels like a quick Windows port and carries that clunkiness with it. Where the Online Help link in the main menu takes you to a website with useful FAQ and community links, the Check for Updates link doesn’t perform a version check, instead taking you to a website to purchase a fully licensed copy. This isn’t what the user expects and is more problematic than it should be, especially if your goal was to locate, download, and work with the newest version of CCleaner. The user interface questions are probably a source of continuous debate, since CCleaner has had a similar look and feel for the better part of 20 years.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/CCleaner-Duplicates.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Reports from a Duplicate Finder report find multiple copies of underlying macOS system components.</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Bottom line</h2>\n\n\n\n<p>It may not be as eye-catching or as shiny as some of its competitors, but what CCleaner seeks to accomplish, it does well, and it’s actually fun to dive into this level of customization in the macOS. Pair this with your favorite Mac utilities and you have something that can truly help keep your Mac’s storage in order, a facet that is not to be underestimated. </p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a896da33e9b7cc42241e2ab6ee7fa56cefa14ee24983a06a5bf5abd29aa05bc0","category":"Apple"}