{"title":"California Senate passes warehouse workers bill, taking aim at Amazon","link":"https://arstechnica.com/?p=1793687","date":1631354422000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/amazon-warehouse-800x520.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/amazon-warehouse.jpg\">Enlarge</a> <span>/</span> Modern warehouse work sometimes unfolds within million-square-foot buildings, which some labor organizers say can make bathroom breaks “logistically impossible.” (credit: Jane Barlow | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Warehouse workers in California are one step closer to being able to pee in peace. Yesterday, the state Senate voted 26-11 to pass AB 701, a bill aimed squarely at Amazon and other warehousing companies that track worker productivity. The bill would prevent employers from counting health and safety law compliance—and yes, bathroom breaks—against warehouse workers’ productive time, which is increasingly governed by algorithms. The bill, which organizers call the first in the nation to address the future of algorithmic work, is now en route to Governor Gavin Newsom’s desk for signature.</p>\n<p>Although some observers expect Newsom to sign the bill given his record on other pro-worker legislation, <a href=\"https://arstechnica.com/tech-policy/2019/09/uber-and-lyft-vow-continued-fight-against-california-worker-rights-bill/\">such as AB 5,</a> he has thus far remained mum on AB 701. When asked about his intentions, Newsom’s office demurred, saying only, “The bill will be evaluated on its merits when it reaches the governor’s desk.” (The governor is currently fending off a <a href=\"https://www.wired.com/story/gavin-newsom-recall-election-silicon-valley-elite/\">recall election</a>, which takes place September 14.)</p>\n<p>AB 701’s passage came as welcome news to advocates like Yesenia Barerra, a former seasonal Amazon worker who traveled to Sacramento to campaign for the bill, helping stage a mock assembly line on the steps of the state capitol. Barrera staffed the company’s Rialto, California, fulfillment center for five months until her termination in 2019. When she was hired, she didn’t realize the rigidity of the productivity system or the extent of Amazon’s camera- and barcode-based employee tracking matrix. She assumed only slackers got fired.</p></div><p><a href=\"https://arstechnica.com/?p=1793687#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793687&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a89f5f28d3591c57f301457ad56107e9c3d5c98a5ecefa75233492f7da6605d6","category":"Tech"}