{"title":"ผลสำรวจพบผู้ใช้ Twitter ส่วนใหญ่ในสหรัฐฯ หยุดเล่น Twitter หลัง Musk เป็นซีอีโอ","link":"https://www.blognone.com/node/133891","date":1684393057000,"content":"<div><div><div><p>Pew Research Center ได้ทำการสำรวจจำนวนผู้ใช้งาน Twitter ในสหรัฐฯ หลังจาก Elon Musk เข้ามาเป็น CEO ได้ประมาณ 5 เดือน แล้วพบว่าคนส่วนใหญ่หยุดใช้งาน Twitter ในหนึ่งปีที่ผ่านมาและหนึ่งในสี่ยังบอกว่าอาจจะหยุดใช้ Twitter ในปีหน้าด้วย</p>\n<p>หกในสิบ (60%) ของคนสหรัฐฯ ที่ร่วมการสำรวจบอกว่า ได้หยุดใช้ Twitter มาหลายสัปดาห์หรืออาจจะมากกว่านั้น แต่ผู้ใช้อีกส่วนหนึ่งประมาณสี่ในสิบ (39%) บอกว่ายังคงใช้งาน Twitter อยู่ (การสำรวจในช่วงวันที่ 13-19 มีนาคม 2023 ที่ผ่านมา)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/54237e781cfc3dc2b4e6d7e189527a85.png\" /></p>\n<p>จากผลสำรวจยังระบุอีกว่า ความแตกต่างในเรื่องเพศ, เชื้อชาติ, สีผิว มีผลต่อแนวโน้มที่จะเลิกใช้ Twitter โดยพบว่าผู้หญิงมีแนวโน้มหยุดใช้มากกว่าผู้ชายในปีที่ผ่านมา (69% เทียบกับ 54%) และผู้ใช้ผิวสี (67%) มีแนวโน้มหยุดใช้มากกว่าคนผิวขาว (60%) หรือ Hispanic (54%)</p>\n<p>ผลสำรวจนี้มีขึ้นในขณะที่สื่อและคนทั่วไป รวมไปถึง Musk ก็ทวีตในประเด็นที่ว่า “Twitter กำลังจะตายหรือไม่?” เพราะบัญชีของคนดังที่มีผู้ติดตามเยอะ แต่กลับมีการเคลื่อนไหวน้อยมาก รวมไปถึงหลังจากที่ประกาศเปิดตัว Twitter Blue ก็มีคนดังบางส่วนออกมาบอกจะไม่สมัครสมาชิก</p>\n<p>การสำรวจยังถามถึงพฤติกรรมการใช้ Twitter ว่ามีแนวโน้มที่จะใช้มากน้อยแค่ไหนในหนึ่งปีจากนี้ ซึ่งคนส่วนใหญ่ 40% กล่าวว่ามีแนวโน้มที่จะใช้มาก (Extremely/Very) และ 35% ระบุว่ามีโอกาสที่จะใช้แค่ระดับหนึ่งเท่านั้น (Somewhat) ส่วนที่เหลือหนึ่งในสี่บอกว่าไม่มีแนวโน้มที่ใช้ Twitter (Not very/Not at all) หนึ่งปีจากนี้เลย</p>\n<p>และในกลุ่มของคนที่บอกว่าไม่ค่อยจะได้ใช้ Twitter พบว่าสัดส่วนของผู้หญิงมีมากกว่าผู้ชาย (30% เทียบกับ 20%) ในทางกลับกันกลุ่มของคนที่บอกว่ามีแนวโน้มที่จะใช้มาก พบสัดส่วนของผู้ชายมากกว่าผู้หญิง  (47% เทียบกับ 31%)</p>\n<p>การวิเคราะห์ยังพบความแตกต่างของความนิยมในการเลือกพรรคการเมืองระหว่างรีพับลิกันและเดโมแครต<br />\nเมื่อดูในกลุ่มของผู้ใช้ที่บอกว่ามีแนวโน้มที่จะไม่ค่อยได้ใช้ Twitter พบว่าพรรคเดโมแครตมีแนวโน้มที่จะไม่ใช้มากกว่าเมื่อเทียบกับพรรครีพับลิกัน (29% เทียบกับ 20%)</p>\n<p>ในทางกลับกันพรรครีพับลิกันมีแนวโน้มมากว่าเดโมแครตที่จะใช้ Twitter ในหนึ่งปีจากนี้ (45% เทียบกับ 36%) และนอกจากนี้ พรรครีพับลิกันมีแนวโน้มมากกว่าพรรคเดโมแครตที่จะบอกว่าพวกเขามีแนวโน้มอย่างมากที่จะใช้ Twitter ในขณะนี้ (25% เทียบกับ 17%)</p>\n<p>การสำรวจนี้ยังเจาะจงไปถึงความแตกต่างทางเพศของความนิยมในพรรคการเมืองทั้งสอง พบว่าในกลุ่มของคนที่นิยมพรรครีพับลิกัน ผู้ชายมีแนวโน้มมากกว่าผู้หญิงที่จะยังคงใช้ Twitter ในหนึ่งปีนับจากนี้ (51% เทียบกับ 35%) เช่นเดียวกับพรรคเดโมแครตที่ผู้ชายมีแนวโน้มมากกว่าผู้หญิง (42% เทียบกับ 29%)</p>\n<p>ผู้ใช้ปัจจุบันที่ไม่ได้หยุดใช้ Twitter มีโอกาสมากกว่า 2 เท่า (63%) เมื่อเทียบกับคนที่หยุดใช้ (26%) ที่ยังคาดการณ์ว่าจะยังคงใช้ Twitter อยู่อีกหนึ่งปีนับจากนี้ และมีเพียง 8% ของคนที่ไม่ได้หยุดใช้ Twitter บอกว่าไม่น่าเป็นไปได้ที่พวกเขาจะใช้ Twitter ในอีกหนึ่งปีจากนี้</p>\n<p>ที่มา: <a href=\"https://www.pewresearch.org/short-reads/2023/05/17/majority-of-us-twitter-users-say-theyve-taken-a-break-from-the-platform-in-the-past-year/\">pewresearch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/twitter-blue\">Twitter Blue</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a89fdbcf2ee15b0b0a92d5f5bd99bfd10ee58cb619abb3c1d75ea40cd64e6f43","category":"Thai"}