{"title":"Digital inclusive finance, industrial structure, and economic growth: An empirical analysis of Beijing-Tianjin-Hebei region in China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299206","date":1710856800000,"content":"<p>by Wenhai Zhou, Xiaoyu Zhang, Xiaomin Wu</p>\r\n\r\nAs a product of combining digital technology and traditional finance, digital inclusive finance plays a vital role in economic growth. This paper deeply analyzes the impact of digital inclusive finance on economic growth and the specific transmission path. This research selects the municipal panel data of Beijing-Tianjin-Hebei from 2011 to 2020 and empirically studies the impact of digital inclusive finance on economic growth. From the perspectives of industrial structure transformation speed, industrial structure upgrading, and industrial structure rationalization, this study analyzes the role of industrial structure in the impact of digital inclusive finance on economic growth and tests the heterogeneity of the impact of digital inclusive finance on economic growth. The results show that digital inclusive finance has a significant role in promoting economic growth. The depth of use of digital inclusive finance has the most significant impact, followed by the breadth of coverage, and the degree of digitization is the smallest. The industrial structure transformation speed and the industrial structure rationalization play a significant intermediary role in the economic growth effect of digital inclusive finance, and the industrial structure upgrading has no significant impact on the economic growth effect of digital inclusive finance; the promotion effect of digital inclusive finance on economic growth is bigger in the economically developed group, the higher digital inclusive finance group and the technologically developed group, and the promotion effect is smaller in the economically underdeveloped group, the lower digital inclusive finance group and the technologically underdeveloped group. The results provide a strong reference for policy formulation to promote the development of digital inclusive finance and economic growth.","author":"Wenhai Zhou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a8a0b9a2344812e605e41fdd06ba322a7a3c36d053d2dab3aa348e336d2806ef","category":"Interdisciplinary"}