{"title":"W/O/W Pickering emulsions stabilized by complex modified phycocyanin","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13727?af=R","date":1722847683000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>A water-in-oil-in-water (W/O/W) double emulsion can simultaneously load hydrophilic and hydrophobic substances due to its unique two-membrane, three-phase structure. However, thermodynamic instability greatly limits the application of double emulsions in food processing. Further development of Pickering emulsions based on proteins, etc., can improve the stability and loading capacity. It is of great significance to promote their practical application.</p>\n<h2>RESULTS</h2>\n<p>Herein, we prepared ultrasound pretreatment complex glycation-modified phycocyanin (UMPC) to stabilize a W/O/W Pickering emulsion for the codelivery of vitamin B12 (VB12) and vitamin E (VE). First, an inner water phase and oil phase containing polyglycerin polyricinoleate were homogenized to prepare a W/O emulsion. Subsequently, the W/O emulsion was homogenized with an outer water phase containing UMPC to obtain a W/O/W Pickering emulsion. A gel-like inner phase emulsion with excellent storage and thermal stabilities was obtained under the condition that the W/O emulsion volume ratio was 80% and the UMPC was stabilized by 10 g kg<sup>−1</sup>. The double emulsion after loading VB12 and VE showed good encapsulation effect during the storage period, the encapsulation rate could reach more than 90%, it also showed excellent protection effect under long-time storage and UV irradiation and the retention rate increased by more than 65%. In addition, the bioavailability of VB12 and VE significantly increased during simulated gastrointestinal digestion and reached 46.02% and 52.43%, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>These results indicate that the UMPC-stabilized W/O/W Pickering emulsion is an effective carrier for the codelivery of hydrophilic and hydrophobic bioactive molecules and also provides a means for useful exploration of an efficient and stable emulsion system stabilized by biological macromolecules. © 2024 Society of Chemical Industry.</p>","author":"Hongye Tian, \nZhong Zhang, \nWenjun Li, \nXiaolin Sun, \nLi Yuan, \nXingbin Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a8a50b8d64442e61fbec890fe2520341b62469d82612114ca7dd999f32ee3e57","category":"Environment"}