{"title":"Koalas, friends and foes—The application of airborne eDNA for the biomonitoring of threatened species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14784?af=R","date":1728878460000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e46d221f-f904-4dc3-be7d-c5d9c6583ba9/jpe14784-toc-0001-m.png\" alt=\"Koalas, friends and foes—The application of airborne eDNA for the biomonitoring of threatened species\" />\n<p>We demonstrate the potential of airborne eDNA for the detection of threatened terrestrial wildlife and their surrounding ecological community under natural conditions. With achievable optimisations we detail how airborne eDNA may be applied for the management and monitoring of threated species for enhanced conservation efforts.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCurbing global wildlife population declines will necessitate the protection of their habitat, and subsequent robust baseline information about wildlife that use and occupy it. Collating such information, however, remains a challenging and costly endeavour. Little did we know that traces of wildlife presence float in the air and can be detected through traces of DNA.\n\nHere, we deployed samplers to test the applicability of collecting airborne eDNA for the detection of a threatened species, the koala, and its co-occurring terrestrial mammalian community.\n\nWe develop a novel species specific qPCR assay to detect the presence of koalas and applied this in concert with a meta-barcoding approach to detect the co-occurring mammalian community.\n\nThrough sampling of airborne particles, we successfully detected koala presence accurately to habitat patch level, alongside 16 unique taxonomic assignments, successfully assigning 11 of these to species level including detections belonging to the wallaby, antechinus, members of possum family and invasive species such as foxes, domestic dogs and hares.\n\n<i>Synthesis and applications</i>: We demonstrate the potential of airborne eDNA for the detection of threatened terrestrial wildlife and their surrounding ecological community under natural conditions. With achievable optimisations we detail how airborne eDNA may be applied for the management and monitoring of threated species for enhanced conservation efforts.\n</p>","author":"Celine Frere, \nNicola Jackson, \nJarred Moreno, \nAlejandro Oliveros Sandino, \nSarah Ball, \nDaniel Powell","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"a8b1fc901b82528dd0ab2f7ea47cc6d9c4577dfec413fc53b54e7fc5ae530214","category":"Environment"}