{"title":"macOS 13 Ventura vs Monterey: Should you update to Ventura?","link":"https://www.macworld.com/article/783546/macos-13-vs-macos-12.html","date":1699605930000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>macOS <a href=\"https://www.macworld.com/article/678251/macos-13-ventura-beta-features-compatibility-how-to-update.html\">Ventura</a>, which launched on October 24 2022, has now been out for more than a year, and <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS Sonoma</a> is here. But not everyone <a href=\"https://www.macworld.com/article/1942421/macos-14-sonoma-compatibility-features.html\">can run Sonoma</a>. If your Mac is compatible with Ventura, but you haven’t yet updated, find out why you should in our Ventura vs Monterey comparison. </p>\n\n\n\n<p>Alternatively, you might not have upgraded to Ventura and be wondering whether to jump straight to macOS Sonoma, or take a smaller step up and run Ventura. In that case, you may want to read out <a href=\"https://www.macworld.com/article/1984389/macos-sonoma-vs-macos-ventura-should-you-update.html\">macOS Sonoma vs Ventura comparison</a>. If you do want to avoid the leap all the way to Sonoma to install Ventura on your Mac you will need to download the update from the Mac App Store, rather than using System Preferences &gt; Software Update, so we will explain how to do that below. </p>\n\n\n\n<p>In this article, we will run through how Ventura compares to Monterey and we will discuss the features it brings to your Mac. Before you get too excited about the new features coming in Ventura, a warning: Your Mac may not be able to run Ventura at all, or it may only be compatible with some of the features. See: <a href=\"https://www.macworld.com/article/782634/macos-ventura-compatibility.html\">macOS 13 Ventura compatibility</a> and <a href=\"https://www.macworld.com/article/784171/macos-13-ipados-16-apple-silicon-features.html\">Ventura features that only work on new Macs.</a> </p>\n\n\n\n<h2>How to update from Monterey to Ventura (not Sonoma)</h2>\n\n\n\n<p>If you are running Monterey on your Mac and can update to Sonoma you will only see the Sonoma update as an option. What if you want to update to Ventura instead? Here’s what to do: </p>\n\n\n\n<ol>\n<li>Click on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/macos-ventura/id1638787999?mt=12&amp;xcust=1-1-783546-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">this link</a> which will open the the Mac App Store on the page for Ventura. </li>\n\n\n\n<li>Click on Get. </li>\n\n\n\n<li>You will see a message: “Are you sure you want to download macOS Ventura”. Click on Download. </li>\n\n\n\n<li>Wait while your Mac downloads the installer. Once the installer is downloaded you will be able to install macOS Ventura on your Mac.</li>\n</ol>\n\n\n\n<p>For more advice on updating the macOS read: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://how%20to%20install%20macos%20sonoma%20on%20your%20mac/&amp;xcust=1-1-783546-1-0-0&amp;sref=https://www.macworld.com/feed\">How to update macOS on your Mac.</a></p>\n\n\n\n<h2>What’s new in Ventura compared to Monterey?</h2>\n\n\n\n<p>macOS has been through some serious revisions over the past few generations. Big Sur brought a redesigned interface, introducing new features like Control Center and the revamped Notification Center. This was built upon in macOS Monterey by the addition of new features in FaceTime such as Voice Isolation for improved sound and SharePlay to enjoy content with others on the call. Monterey also brought Continuity tools like AirPlay to Mac, which allowed other Apple devices to display on the larger screen. The headline feature – Universal Control – didn’t actually arrive until March 2022, now it’s here you can <a href=\"https://www.macworld.com/article/678411/how-to-share-a-mouse-and-keyboard-between-macs-and-ipads.html\">share a mouse and keyboard between Macs and iPads</a>.</p>\n\n\n\n<p>There are lots of new features that arrived in macOS Ventura that move beyond what we gained in Monterey and refine and improve some features that we have enjoyed for years. As usual, a lot of what the new version of macOS brings is better integration with your iOS and iPadOS devices, but there are some new features that only Mac users will enjoy.</p>\n\n\n\n<p>Here are the main ways macOS Ventura is different than macOS Monterey:</p>\n\n\n\n<h3>Stage Manager</h3>\n\n\n\n<p>One of the new design changes is Stage Manager. This makes it easier to move between the multiple apps we have open on our desktops. Think of it as an evolution of Spaces and Exposé – two useful features that have been on our Macs for a long, long time. If you use Stage Manager clusters of apps and window can be displayed to the left of your screen, so you can group together things you are working on, rather than cluttering your screen with everything you have open in a day. </p>\n\n\n\n<p>To the left of the app you’re working on you’ll see the various other open apps. If you have multiple windows for any of them, then those will be stacked together to keep things simple. Clicking on anything in the left column will immediately bring it to the fore to replace the one that you were working on, which is then added to the Stage Manager area.</p>\n\n\n\n<p>For an app with multiple instances open, clicking on the top one in the Stage Manager area will move it to the fore, then the stack will shuffle forward to show the next instance. Clicking on the stack will keep cycling through the open windows until you find the one you want.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"New Stage Manager feature in macOS 13\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Stage-Manager.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>Of course, you can do a lot of this on macOS Monterey (and several previous versions) via Spaces, which creates individual desktops where you can keep apps apart, cutting down on clutter. So, if you already work that way, then Stage Manager might not be that much of a step forward.</p>\n\n\n\n<p>Read about <a href=\"https://www.macworld.com/article/804389/how-to-macos-13-ventura-stage-manager.html\">How to use Stage Manager in Ventura</a>. </p>\n\n\n\n<h3>Spotlight improvements</h3>\n\n\n\n<p>Spotlight is already a powerful way to search for apps, files, and other content on macOS Monterey. In macOS Ventura, Apple improved Spotlight so it integrates better with the other Apple devices you own. For example, you’ll be able to easily find photos from your iCloud Photo Library as well as on your hard drive or the web. Need a picture of a lighthouse? Type it into Spotlight and you should be presented with plenty of images because of the way Spotlight uses Machine Learning to recognize the content of images. Spotlight in Ventura also supports the Live Text feature that was added in iOS 15, and will allow you to interact with and select the text in those images, which is pretty cool.</p>\n\n\n\n<p>Apple also beefed up the results pane, making it bigger, so you can get richer search results with more information about the subjects in question. You can also start timers from Spotlight too, which may be quite useful if you’re always fumbling around to find the Clock app on your iPhone since your Mac can’t set timers and alarms.</p>\n\n\n\n<p>Read about <a href=\"https://www.macworld.com/article/830589/how-to-macos-ventura-spotlight-search.html\">How Apple has improved Spotlight search in Ventura</a>. </p>\n\n\n\n<h3>Mail</h3>\n\n\n\n<p>Mail is one of the core apps that lags behind many third-party alternatives (see: <a href=\"https://www.macworld.com/article/668716/best-email-app-for-macs.html\">Best email app for Mac</a>). This changed in macOS Ventura, with Apple finally introducing some features that have been available in other offerings for quite a while.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"New features for Mail in macOS 13\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-MAIL.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>New features include the ability to Undo Send, which recalls any emails you may have sent in error. You’ll also be able to schedule emails so they go at specific times, plus Mail will monitor your sent messages and remind you if one hasn’t received a response yet so you can chase them up. There are also improvements to search, with more detailed results and clever software tweaks that help it find what you’re looking for even if the search term isn’t spelled correctly.</p>\n\n\n\n<p>See: <a href=\"https://www.macworld.com/article/809897/how-to-macos-ventura-undo-send-schedule-email.html\">How to unsend and schedule email in Apple Mail</a>.</p>\n\n\n\n<h3>Safari</h3>\n\n\n\n<p>In macOS Monterey, we saw the introduction of Tab Groups, which allows users to create a group of tabs that can be accessed separately to the normal ones you may open. This means you can create collections for certain things, like your news first thing in the morning, shopping for certain products, or gathering information for a project.</p>\n\n\n\n<p>In macOS Ventura, you’ll be able to take this a little further with the new Shared Tab Groups. This acts in a similar way, but allows you to share the Tab Groups with other people who can also add their own tabs to the collection. This could be very handy when planning trips together, working collaboratively on projects, or just making each other laugh with funny things you find online.</p>\n\n\n\n<p>Privacy is always a concern online and macOS Ventura takes this on via a feature called Passkeys. These are essentially locally generated alternatives to passwords for sites and apps, using Touch ID or Face ID for authentication. The best part is that the information never leaves your Mac, so it can’t be stolen from company web servers or phished in emails sent to you. It’s early days, but Apple’s aim is to do away with passwords altogether, and that is fine with us.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"New Passkeys feature in macOS 13\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Passkeys.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<h3>Continuity Camera</h3>\n\n\n\n<p>One of the stand-out features of macOS Monterey was Universal Control, which lets you use your keyboard, trackpad or mouse interchangeably on iPads and Macs, with the added advantage of dragging content between the two. This is all achieved via Continuity and Handoff. In macOS Ventura, Apple continues to make use of these technical abilities with a new feature called Continuity Camera. This instantly turns your iPhone into a webcam for your Mac. It’s well documented that Mac webcams are somewhat underwhelming, so being able to use the far superior rear cameras on your iPhone makes perfect sense.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Using Continuity Camera in macOS 13\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/06/macOS-13-vs-macOS-12-Continuity-Camera.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>It supports Center Stage and Portrait Lighting, and if your iPhone has an Ultra-Wide camera then it can also split the view between you and the contents of your desk. Very clever.</p>\n\n\n\n<p>Handoff also makes it easy to switch between FaceTime calls on your Mac, iPhone or iPad in Ventura as well, so you can take the call on your iPhone while walking to your desk, then switch it from your iPhone to the Mac.</p>\n\n\n\n<p>Find out <a href=\"https://www.macworld.com/article/817000/how-to-continuity-camera-iphone-webcam-for-your-mac.html\">How to use your iPhone as a Mac webcam using macOS Ventura’s Continuity Camera</a>.</p>\n\n\n\n<h2>Should I upgrade to macOS Ventura? </h2>\n\n\n\n<p>Alongside all these changes above, macOS Ventura also features improved gaming ability via Metal 3, updates to Notes, Dictation, Home, Reminders, Apple News, Weather, and even the Clock app. </p>\n\n\n\n<p>All of this makes macOS Ventura a worthy successor to macOS Monterey. But, now that Sonoma is here you may want to move straight to that version of macOS. Read our <a href=\"https://www.macworld.com/article/1984389/macos-sonoma-vs-macos-ventura-should-you-update.html\">macOS Sonoma vs Ventura comparison</a> for more information. </p>\n\n\n\n<p>Just bear in mind that Apple has announced that several Macs will not make the cut when it comes to upgrading to Ventura, so check out our guide to <a href=\"https://www.macworld.com/article/782793/every-iphone-ipad-mac-apple-watch-obsolete.html\">the Macs that will get macOS Ventura</a> to see if your device will be eligible. </p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a8b85626e8bb7006fc28779aea3ba2e59249e1fa18a5b199c6088d281e32ca5a","category":"Apple"}