{"title":"Breeders’ age, nest-site characteristics and climatic conditions but not density-dependent effects determine Bonelli’s Eagle breeding performance: A long-term study (2002–2021)","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad048/7273032?rss=1","date":1694563200000,"content":"<span><div>Abstract</div>The conservation of endangered species is a crucial topic in conservation biology due to the important ecological roles these species play in their respective ecosystems. Top predators are particularly vulnerable to the variation in environmental conditions. The Bonelli’s Eagle (<span>Aquila fasciata</span>) is a long-lived bird of prey that fulfills its role as a top predator in Mediterranean ecosystems, but its overall population has declined in the Iberian Peninsula in recent decades. As with other long-lived species, the Bonelli’s Eagle reaches its maximum fitness at maturity, highlighting the importance of assessing how intrinsic and extrinsic factors affect population dynamics over time. In this study, we conducted annual surveys of a Bonelli’s Eagle subpopulation in the eastern Iberian Peninsula from 2002 to 2021. Our results indicate that the large decline observed in the number of occupied territories, fledged chicks, and successful pairs is not due to negative density-dependent effects but rather influenced by various environmental and demographic factors. These factors include breeders’ age, nest-site characteristics, climatic conditions, and previous breeding costs. We found that productivity was higher in territories with high winter precipitation and temperatures, as well as in coastal areas, leading to earlier laying dates. Additionally, the presence of subadult individuals in the breeding pair decreased breeding performance. Interestingly, the variability in the number of fledglings in each territory was driven by previous breeding costs. Prioritizing efforts to mitigate adult mortality and conserve suitable habitats becomes imperative to halt the ongoing decline of this population and also to enhance productivity, ultimately facilitating the restoration of the species to previous population levels.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"a8c474f9082c134142c6fe558d576ef9635dd418b561d0fdcd9611c88901f8e8","category":"Environment"}