{"title":"Factors associated with uptake of breast and cervical cancer screening among Nepalese women: Evidence from Nepal Demographic and Health Survey 2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002971","date":1710165600000,"content":"<p>by Bipul Lamichhane, Bikram Adhikari, Lisasha Poudel, Achyut Raj Pandey, Sampurna Kakchhapati, Saugat Pratap K. C., Santosh Giri, Bishnu Prasad Dulal, Deepak Joshi, Ghanshyam Gautam, Sushil Chandra Baral</p>\r\n\r\nBreast cancer screening (BCS) and cervical cancer screening (CCS) are integral parts of initiatives to reduce the burden associated with these diseases. In this context, we aimed to determine factors associated with BCS and CCS uptake among Nepalese women aged 30 to 49 years using data from the Nepal Demographic Health Survey (NDHS) 2022. We performed a weighted analysis to account complex survey design of the NDHS 2022. We employed univariable and multivariable logistic regression to determine factors associated with the uptake of BCS and CCS and results were presented as crude odds ratio and adjusted odds ratio (AOR) along with 95% confidence interval (CI). The uptake of BCS and CCS among Nepalese women aged 30 to 49 years were 6.5% and 11.4% respectively. Women from Terai compared to mountain region (AOR = 0.54, 95%CI: 0.31, 0.93) and those engaged in agriculture compared to non-working (AOR = 0.59, 95%CI: 0.42, 0.82) women had lower odds of BCS uptake. Conversely, Dalit women compared to Brahmin/Chhetri (AOR = 2.08, 95%CI: 1.37, 3.16), and women with basic (AOR = 1.49, 95%CI: 1.04, 2.13), secondary (AOR = 1.96, 95%CI: 1.33, 2.88), and higher education (AOR = 2.80, 95% CI: 1.51, 5.19) compared to those with no education had higher odds of BCS uptake. Women from rural areas (AOR = 0.76, 95%CI: 0.61, 0.96), and those living in Bagmati (AOR = 2.16, 95% CI: 1.44, 3.23) and Gandaki (AOR = 2.09, 95%CI: 1.40, 3.14) provinces had higher odds of CCS uptake compared to their urban counterparts and those living in Koshi province, respectively. The odds of CCS increased with age (AOR = 1.06, 95%CI: 1.04, 1.08). Women with secondary education (AOR = 1.47, 95%CI: 1.06, 2.04) had higher odds of CCS uptake compared to those without education. Similarly, married women (AOR = 8.24, 95%CI: 1.03, 66.21), and those with health insurance (AOR = 1.41, 95%CI: 1.08, 1.83) had higher odds of CCS. In conclusion, the uptake of both BCS and CCS was relatively poor among Nepalese women indicating a need for targeted and tailored intervention to increase BCS and CCS uptake.","author":"Bipul Lamichhane","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a8d36508c981bfb45e0761515bd236a39c6605529bddd6a810607db34cf8d5c5","category":"Environment"}