{"title":"Tour de France rest day recap: Yellow jersey dead heat, podium and polka dots ramping up, Ineos and Bahrain victorious, Cofidis is buses","link":"https://www.cyclist.co.uk/news/tour-de-france-2023-week-2","date":1689611495000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/news/tour-de-france-2023-week-2\">Tour de France rest day recap: Yellow jersey dead heat, podium and polka dots ramping up, Ineos and Bahrain victorious, Cofidis is buses</a></p>\n\n<p>We’re two weeks into the 2023 <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> and still no one has any clue who will win the final yellow jersey. After 15 stages, <a href=\"https://www.cyclist.co.uk/tags/jonas-vingegaard\" target=\"_blank\">Jonas Vingegaard</a> and <a href=\"https://www.cyclist.co.uk/tags/tadej-pogacar\" target=\"_blank\">Tadej Pogačar</a> are separated by just 10 seconds overall and there are just three stages realistically left to fight it out on.</p>\n\n\n\n<p>The second week of the race was largely dominated by breakaways, with two for <a href=\"https://www.cyclist.co.uk/tags/bahrain-victorious\" target=\"_blank\">Bahrain Victorious</a>, one and a half for Ineos Grenadiers (Carlos Rodríguez did break away but it probably wasn’t a ‘breakaway’) and a second of the race for Cofidis after Jasper Philipsen bagged his fourth bunch sprint win.</p>\n\n\n\n<p>While the <a href=\"https://www.cyclist.co.uk/in-depth/history-of-the-tour-de-france-jerseys\" target=\"_blank\">yellow jersey</a> is firmly a one v one affair – and the white and green jerseys are all but secured by Pogačar and Philipsen respectively – the battle for the polka dot jersey has heated up, with EF Education-EasyPost’s Neilson Powless being usurped by Lidl-Trek’s big dog Giulio Ciccone. However Vingegaard and Pogačar (and Wout van Aert) lurk not far behind.</p>\n\n\n\n<p>While we prepare for what should be a thrilling final week of the men’s race, let’s recap week two.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-2023-climbs\">The climbs that will decide the 2023 men’s Tour de France</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes\">Tour de France Femmes 2023: Everything you need to know</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/how-to-watch-and-live-stream-the-tour-de-france\">How to watch and live stream the Tour de France 2023</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>1. Vingegaard and Pogačar battle for bonuses to set up closest Tour since 1989</h2>\n\n\n\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-970x646.jpg\" alt=\"crowds line roads on mountain with two cyclists in white and yellow riding through them\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-768x511.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-1140x759.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230715TDF0025-A.S.O._Pauline_Ballet.jpg 1500w\" /><figcaption>A.S.O./Pauline Ballet</figcaption></figure>\n\n\n\n<p>After a scintillating first week of back and forth between Jonas Vingegaard and Tadej Pogačar, the second week looks like a damp squib on paper, with the two inseparable on the road save for a meagre four seconds on the Stage 13 summit finish up Grand Colombier. The Slovenian attempted to attack on each mountain stage but his Danish counterpart was always able to hold on, the stickiest moment coming on Stage 14 on the Col de Joux Plane with Vingegaard just about managing to keep the elastic intact. </p>\n\n\n\n<p>And so the real contest came down to bonus seconds, and even then the spoils were tiny. On Grand Colombier those four seconds doubled thanks to the bonus seconds Pogačar picked up finishing in third, bringing the overall difference to nine seconds. On Stage 14 there were bonus seconds on offer both on top of the Joux Plane and on the finish line post-descent. With the pair leading the race Pogačar’s superior sprint looked to set him up to gain a second on the summit and a further four at the finish, which would’ve brought the gap down to just four seconds overall.</p>\n\n\n\n<p>Pogačar made his move but he was thwarted almost immediately by two motorbikes blocking the road, with fans filling the spaces either side. Attack wasted, the pair began a track sprint-style dance before Vingegaard caught Pogačar napping and powered to the line first, extending his lead by three seconds. </p>\n\n\n\n<p>Their antics gave Ineos Grenadiers’ Carlos Rodríguez the time to catch them and fly straight past on the short incline after the summit, attacking down the final descent into Morzine. Ten bonus seconds to Rodríguez for winning the stage left six and four to fight for. Pogačar’s teammate Adam Yates caught up but didn’t have the legs to contest the sprint and so six went to Pogačar and four to Vingegaard, taking Vingegaard’s total gains on the day to one single second. </p>\n\n\n\n<p>Pogačar would’ve been better off letting Yates roll past and sprinting Vingegaard for third place to gain four seconds rather than two, but you’d think Jumbo-Visma would’ve been wise to that detail. </p>\n\n\n\n<p>So on we go, one time-trial and two mountain stages to fight for and ten seconds between them.</p>\n\n\n\n<h2>2. The fight for the polka dot jersey is on, or is it?</h2>\n\n\n\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-970x646.jpg\" alt=\"man in red polka dot cycling jersey on podium\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-768x511.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-1140x759.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230716TDF0081-A.S.O._Charly_Lopez.jpg 1500w\" /><figcaption>A.S.O./Charly Lopez</figcaption></figure>\n\n\n\n<p>Twenty-one stages over three weeks on some of France’s biggest mountains to decide who wins the greatest jersey in cycling. That’s right, another polka dot jersey is up for grabs and so far it’s been the Neilson Powless show as the EF Education-EasyPost man has worn the jersey since the very start in Bilbao.</p>\n\n\n\n<p>However change is afoot. Bigger mountains and tired legs have given more contenders opportunities to get themselves into contention. Cue Lidl-Trek’s Giulio Ciccone. The talented Italian climber made his mark in week two, putting himself in the break and easily outclimbing Powless to haul himself into the polka dots on this rest day. Will the pair battle it out in the final week to decide who will wear the famous <em>maillot a pois </em>in Paris?</p>\n\n\n\n<p>It’s unlikely. Once again it would be a shock if the jersey doesn’t go to Vingegaard or Pogačar. With two mountain stages to go, including a huge 40 points on the Col de la Loze – this year’s Souvenir Henri Desgrange, aka the highest summit in the race – Vingegaard is four points down and Pogačar is ten points down. So it seems Pogačar’s quest for bonus seconds and Jumbo-Visma’s quest for a stage win will give one of the two the points required to overhaul Ciccone and Powless and win the jersey without even trying. </p>\n\n\n\n<p><em>Quel dommage</em>.</p>\n\n\n\n<h2>3. Big breakaway bonanza: <em>you</em> get a stage win, <em>you</em> get a stage win, <em>you</em> get a stage win!</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-970x647.jpg\" alt=\"man in embrace with eyes closed and dirty face\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20230711TDF0014-A.S.O._Pauline_Ballet.jpg 1500w\" /><figcaption>A.S.O/Pauline Ballet</figcaption></figure>\n\n\n\n<p>While the overall contenders drew out their stalemate, week two saw an abundance of breakaway joy and some very worthy winners to boot. It began with Bilbao, just like the Tour, as Bahrain Victorious’s Pello Bilbao sprinted to a hard-fought win amidst the chaos on Stage 10. Bilbao pledged before the Tour to donate €1 to <a href=\"https://basos.eus/crowdfunding/\" target=\"_blank\">an environmental charity</a> for every rider he finished ahead of on each stage and in the overall GC in honour of his late teammate Gino Mäder, who did the same at the 2021 Vuelta a España. Mäder named his dog Pello after his friend, so it’s safe to say Bilbao’s win was brimming with emotion.</p>\n\n\n\n<p>After a routine sprint win for Jasper Philipsen, his fourth of the race and this time without Mathieu van der Poel leading him out, it was another breakaway shootout on Stage 12. This time up stepped Ion Izagirre, beating out a host of worthy challengers to solo to Cofidis’s second win of the race after 15 years without a single one. </p>\n\n\n\n<p>Speaking of worthy challengers, Stages 13 and 15 saw victory for a pair of the peloton’s most talented riders who have given most of their careers to serving others. Michał Kwiatkowski is a former World Champion, Monument winner and a Tour de France stage winner in 2020 when he came across the line with teammate Richard Carapaz, and here he finally got his solo chance. After initially being dropped on Grand Colombier, Kwiatkowski fought back and jumped his breakaway rivals, holding off a rampaging UAE Team Emirates to a thrilling and much deserved win.</p>\n\n\n\n<p>Two days later it was the turn of his former teammate and now Bahrain Victorious man Wout Poels, a former Monument winner and technically former Grand Tour stage winner after his second place on Stage 15 of the 2011 Vuelta was upgraded following Juan José Cobo’s doping ban. Poels went clear on the climb to Saint Gervais Mont Blanc, coming in over two minutes ahead of fellow Wout, Van Aert. Sadly, France TV directors gave him but a split second of coverage as he crossed the line, so his day is the sun was actually slightly overcast.</p>\n\n\n\n<p>Who will triumph in week three? Will Cofidis get another? Will another former Team Sky domestique bag a win?</p>\n\n\n\n<h2>What’s next?</h2>\n\n\n\n<figure><img width=\"970\" height=\"631\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-970x631.jpg\" alt=\"tour_history_lemond_1\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-970x631.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-300x195.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-768x499.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-1536x998.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-750x488.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1-1140x741.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/07/07123612/tour_history_lemond_1.jpg 2000w\" /><figcaption>L'Équipe</figcaption></figure>\n\n\n\n<p>The final showdown/s. The action resumes with a much needed time-trial, just about the only way that should actually separate Tadej Pogačar and Jonas Vingegaard and also the only way Wout van Aert will actually get his stage win this year.</p>\n\n\n\n<p>Wednesday’s Stage 17 is the Queen Stage, with two Category 1 climbs, one Category 2 and one <em>hors catégorie </em>to split the yellow and polka dot jerseys. Watch that final climb on the Col de la Loze for Jumbo-Visma’s big attack.</p>\n\n\n\n<p>Stage 18 is a day for Philipsen to get his fifth stage win and Stage 19 could be his sixth before the final mountain stage in the Vosges mountains. With six categorised climbs there will be attacks by whoever sits in second overall, there will be a final showdown on the Col du Platzerwasel to decide the 2023 yellow jersey before Sunday’s roll into Paris (where Philipsen could end up with his seventh). </p>\n\n\n\n<p>In 1989 Greg LeMond won the Tour on the final time-trial, beating Laurent Fignon by just eight seconds overall. Since then the closest it has come is 2007, when Alberto Contador had 23 seconds on Cadel Evans. Could this year’s margin of victory be the closest in 34 years? Don’t count it out.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/news/tour-de-france-2023-week-2\">Tour de France rest day recap: Yellow jersey dead heat, podium and polka dots ramping up, Ineos and Bahrain victorious, Cofidis is buses</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"a8d40eb2d0d6669c88949bb0d68e58902a04031e7533512a9c1c46599c989e6b","category":"Cycling"}