{"title":"Ford boosts Mustang Mach-E range and drops price as profits grow 20%","link":"https://arstechnica.com/?p=1936301","date":1683125684000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/2021-Ford-Mustang-Mach-E-6-800x600.jpg\" alt=\"A Ford Mustang Mach-E seen from the front 3/4 angle\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/2021-Ford-Mustang-Mach-E-6.jpg\">Enlarge</a> <span>/</span> Like the FedEx arrow or the elephant in GM's new logo, once you see the bandito mustache, you'll never unsee it.  (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ford is reopening its order books for the <a href=\"https://arstechnica.com/cars/2021/02/ford-mustang-mach-e-review-the-peoples-pony-goes-electric/\">Mustang Mach-E</a> battery-electric vehicle, and it's cutting prices in the process. The automaker has also switched battery chemistry for the standard-range models, boosting their power and range in the process. The price drops were announced shortly after Ford's Q1 2023 financial results were published, and it was a good three months for the company, which saw profits grow 20 percent, year on year.</p>\n<p>\"We continue to find ways to improve the value of the Mustang Mach-E. Upgraded BlueCruise rolling out for new and existing Mustang Mach-E owners, increased range and faster DC charging times on standard range models show how we are relentlessly improving our products for our customers,\" said Marin Gjaja, chief customer officer at Ford Model e.</p>\n<p>Ford's switch to LFP (or lithium iron phosphate) batteries has been in the works for some time now. The cell chemistry has a lower energy density than the nickel cobalt manganese cells that are more common in US and European BEVs, but it's also much less susceptible to thermal runaway and requires much less crash protection as a result. Consequently, LFP battery packs can devote more volume to cells, and while cell energy density is worse than NCM, things don't look quite so bad at the pack level.</p></div><p><a href=\"https://arstechnica.com/?p=1936301#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1936301&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a8dea4f0fd277cc86f527daec9b1bcda7b70c8720a9d963466aab031ed24725f","category":"Tech"}