{"title":"Additive‐genetic relationships of growth and morphometrics to meat yield traits in Macrobrachium nipponense (De Haan, 1849)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13036?af=R","date":1699002370000,"content":"<h2>Abstract</h2>\n<p>Based upon mixed linear model and incomplete diallel cross between different strains of <i>Macrobrachium nipponense</i>, the additive-genetic correlations of growth and morphometrics with meat yield traits in <i>M. nipponense</i> were estimated using the minimum norm quadratic unbiased estimation procedure. Path analysis method was utilized to investigate the overall additive-genetic determinations of growth and morphometric traits on the meat yield traits. Results indicated that growth and morphometrics were genetically positively correlated with abdominal meat weight (<i>p</i> &lt; 0.01), but were not genetically correlated with abdominal meat percentage (<i>p</i> &gt; 0.05) in both sexes. Growth and morphometrics were genetically positively correlated (<i>p</i> &lt; 0.01). Abdominal meat weight was genetically positively correlated with abdominal meat percentage (<i>p</i> &lt; 0.01). In terms of the overall additive-genetic determination, body weight had the greatest impact on abdominal meat weight in both sexes. In contrast, abdominal meat weight, abdominal length, and body weight were most influential on abdominal meat percentage in both sexes. The genetic relationships of growth and morphometrics to meat yield traits were elucidated in <i>M. nipponense</i> for the first time, contributing to formulation of sound improvement plan for the meat yield traits in this commercially important prawn species.</p>","author":"Hui Wang, \nTianyu Guan, \nLong Wang, \nYi Zhang, \nQianqian Zhu, \nGuoliang Chang, \nNan Wu","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"a8e0fe585d1fda61d800052ebb39c7f92aec4762796bf85c5b8d50a0db660a59","category":"Environment"}