{"title":"A framework to examine the potential social influence of scientists and nongovernmental organizations in marine conservation分析科学家和非政府组织在海洋保护领域的潜在社会影响力的研究框架","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.59?af=R","date":1720940400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6e3549dd-3bee-41e6-a73a-dd4d8fa294db/inc359-gra-0001-m.png\" alt=\"A framework to examine the potential social influence of scientists and nongovernmental organizations in marine conservation 分析科学家和非政府组织在海洋保护领域的潜在社会影响力的研究框架\" /><p>This study contributes a novel framework of studying potential social influence of a person/organization in nature conservation. We demonstrated how to use this framework to understand potential social influence of Chinese scientists and nongovernmental organizations (NGOs) in the nation's marine conservation. We found both communication capability and annual funding had positive effects on the potential social influence of scientists and NGOs, although they worked via different pathways.\n\n</p><br />\n<h2>Abstract</h2>\n<p>Effective marine conservation requires science-based decisions and strong support from the public and local communities. Understanding the potential social influence of scientists and nongovernmental organizations (NGOs) in marine conservation is key, yet this aspect has been underexplored in conservation social science. In this study, we created a simple index of potential social influence (PSII) for scientists and NGOs, initiating an analytical framework to identify key variables correlated with the PSII and their underlying pathways. We illustrated this framework using China as a case study, where marine conservation advancement is urgently needed. Our results indicated that many of the variables we identified were correlated with the PSII, even though some are rarely mentioned in the related literature. Notably, both communication capability and annual funding positively impacted the potential social influence of scientists and NGOs, albeit through different pathways. This study provides valuable insights to enhance marine conservation efforts in China and addresses a critical research gap in assessing social influence on nature conservation.</p>\n<h2>摘要</h2>\n<p>保护我们的海洋需要以科学为基础的保护决策以及公众和当地社区的大力支持。为此，我们需要了解科学家和非政府组织（NGO）在海洋保护中的潜在社会影响力。但在保护社会科学领域中却鲜有这方面的研究。在此，我们分别为科学家和NGO创建了一个简单的潜在社会影响力指数（PSII），并构建了一个分析框架，以确定与 PSII 及其潜在路径相关的关键变量。我们以亟需推进海洋保护的中国为例，对这一框架进行了说明。结果表明，我们定义的许多变量都与 PSII 相关，尽管有些变量在文献中很少被提及。值得注意的是，传播能力和年资金量都对科学家和非政府组织的潜在社会影响力产生了积极影响，尽管它们的作用路径不同。我们的研究不仅为推动中国的海洋保护贡献了实用的知识，还填补了自然保护领域评估社会影响力的研究空白。【翻译:张雄】</p>","author":"Minhui Li, \nTien M. Lee, \nXiong Zhang","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"a8e7f1e34d46b955c0dfe4b1ffbfaf4c961166f59f885ed49971e3acf9f9e047","category":"Environment"}