{"title":"Variation in the Floral Morphology of Prosthechea karwinskii (Orchidaceae), a Mexican Endemic Orchid at Risk","link":"https://www.preprints.org/manuscript/202406.2063/v1","date":1719612965000,"content":"Prosthechea karwinskii is an orchid endemic to Mexico, threatened by the destruction of its habitat and the extraction of specimens to meet its demand for ornamental and religious use. Most of its populations, and the most locally abundant ones, are found in Oaxaca state. Variations in some floral traits have been observed in these populations. We implemented a morphometric analysis to assess their floral variation and identify the most significant characters in the morphological patterns of this orchid. Floral samples were collected from 17 populations of P. karwinskii in Oaxaca, as well as from specimens used as ornaments during Easter in a Oaxacan community (Zaachila), whose origin is unknown. Sampling of natural populations covered the environmental, geographic and morphological variation of the species. We performed an analysis of variance (ANOVA), principal component analysis (PCA), and canonical variate analysis (CVA), and cluster analysis including 185 individuals and 45 variables (13 of them were discarded in the multivariate analyzes due to high correlation). Characters of the column, lateral sepal, and labellum were most informative about the observed morphological patterns. Albarradas showed the greatest morphological differentiation, mainly due to the column. In general, individuals from the same locality tended to overlap more, especially the populations of Jaltianguis and Yahuiche, which were different from the geographically close population of Etla. Teposcolula presented the highest values in perianth characters, unlike Sola_Rancho Viejo. The specimens recovered from religious ornaments were morphologically more similar to those from the Mixtec region and surroundings of Etla. Our work encourages working on collaborative conservation strategies to ensure the long-term permanence of both the species and its traditional uses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a8ff52b8e0f4f4a70d134711204fd0ac73f5ebac5a938dbb1ee001e6aab58ca5","category":"Interdisciplinary"}