{"title":"Scientific Advances and Weather Services of the China Meteorological Administration’s National Forecasting Systems during the Beijing 2022 Winter Olympics","link":"http://link.springer.com/10.1007/s00376-023-3206-3","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Since the Beijing 2022 Winter Olympics was the first Winter Olympics in history held in continental winter monsoon climate conditions across complex terrain areas, there is a deficiency of relevant research, operational techniques, and experience. This made providing meteorological services for this event particularly challenging. The China Meteorological Administration (CMA) Earth System Modeling and Prediction Centre, achieved breakthroughs in research on short- and medium-term deterministic and ensemble numerical predictions. Several key technologies crucial for precise winter weather services during the Winter Olympics were developed. A comprehensive framework, known as the Operational System for High-Precision Weather Forecasting for the Winter Olympics, was established. Some of these advancements represent the highest level of capabilities currently available in China. The meteorological service provided to the Beijing 2022 Games also exceeded previous Winter Olympic Games in both variety and quality. This included achievements such as the “100-meter level, minute level” downscaled spatiotemporal resolution and forecasts spanning 1 to 15 days. Around 30 new technologies and over 60 kinds of products that align with the requirements of the Winter Olympics Organizing Committee were developed, and many of these techniques have since been integrated into the CMA’s operational national forecasting systems.</p>\n                    <p>These accomplishments were facilitated by a dedicated weather forecasting and research initiative, in conjunction with the preexisting real-time operational forecasting systems of the CMA. This program represents one of the five subprograms of the WMO’s high-impact weather forecasting demonstration project (SMART2022), and is also a part of their Regional Association (RA) II Research Development Project (Hangzhou RDP). Therefore, the research accomplishments and meteorological service experiences from this program will be carried forward into forthcoming high-impact weather forecasting activities. This article provides an overview and assessment of this program and the operational national forecasting systems.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"a90680a6d6d019e1217e66941977a4f64b80122f4cf99fa535686cfa887ea07f","category":"Environment"}