{"title":"Phylogeny of Land Plants: a Case Study of Deep-Time Reconstructions","link":"https://www.preprints.org/manuscript/202407.0135/v1","date":1719872533000,"content":"Relationships of the three bryophyte lineages (liverworts, mosses, and hornworts) to vascular plants is a pivotal question in the study of origin and evolution of land plants.  In recent decades, this question has been subject to intense phylogenetic analyses using morphological characters, multigene DNA sequences, and genome structural characters.  A tentative consensus reached ten years ago suggested that bryophytes are a paraphyletic group, with liverworts being sister to all other land plants and hornworts being sister to vascular plants.  However, several more recent nuclear phylogenomic studies have concluded that bryophytes represent a monophyletic group that is sister to vascular plants.  A discussion is presented here on strengths and weaknesses of different types of characters (morphological traits, nucleotide sequences, and genome structural arrangements), and their suitability for resolving deep phylogenetic relationships.  Moreover, several criteria for credible phylogenetic reconstruction are proposed.  Strong statistical support for reconstructed relationships should be derived from high quality, independent characters selected for suitability to the particular question being addressed.  The relationships inferred in a study should be congruent with those from as many other lines of phylogenetic evidence as possible.  Any incongruities should be explicable by well-understood biological mechanisms.  It is concluded that the relationships of the three bryophyte lineages to vascular plants should currently be viewed as unresolved.  This is a difficult phylogenetic problem; the land plants underwent a rapid radiation a long time ago.  Yet, further exploration of analytical methods and careful choice of characters should lead to eventual elucidation of diversification patterns among early land plants.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a90f8bb518c94024ea5a188256d2df478b7e9a68df015345ca23ccdedc6b6b31","category":"Interdisciplinary"}