{"title":"Microsoft Overtakes Apple as World's Most Valuable Company [Updated]","link":"https://www.macrumors.com/2024/01/11/microsoft-overtakes-apple-as-most-valuable-company/","date":1704986146000,"content":"Microsoft today overtook Apple as the world's most valuable public company by market value. Apple's share price dropped by just one percent, enabling Microsoft to narrowly pull ahead of Apple at a value of $2.87 trillion.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/12/aapl-logo-banner.jpg\" width=\"1600\" height=\"890\" />\r<br />\nMicrosoft has briefly overtaken Apple as the most valuable company since 2018, most recently in 2020 and 2021 when concerns about supply chain shortages dented Apple's stock price and a boom in remote working bolstered Microsoft. Over the past year, Microsoft's support for artificial intelligence tools by backing OpenAI has helped boost its value, while equivalent offerings from Apple have been noticeably absent.\r<br />\n\r<br />\nIn its <a href=\"https://www.macrumors.com/2023/11/02/apple-4q-2023-results/\">November earnings report</a>, Apple's sales results missed expectations as demand for iPads and wearables was lower than expected. Mac revenue also <a href=\"https://www.macrumors.com/2023/11/02/mac-revenue-down-m3-sales-improvements/\">saw a major drop</a> compared to the previous year. It is yet to be seen how responses to the Vision Pro headset will influence the market, but expectations are relatively low due to low sales forecasts and the device's high price point.\r<br />\n\r<br />\n<b>Update 1:40 pm</b>: By the close of the regular trading day, Apple had retaken the top spot in market capitalization at $2.89 trillion compared to Microsoft's $2.86 trillion, and the companies may swap places multiple times in the coming days and weeks as they remain close in value.<div>Tags: <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a>, <a href=\"https://www.macrumors.com/guide/aapl/\">AAPL</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/11/microsoft-overtakes-apple-as-most-valuable-company/\">Microsoft Overtakes Apple as World's Most Valuable Company [Updated]</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsoft-overtakes-apple-as-worlds-most-valuable-company-updated.2416064/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a91222137d61e2f8461401d8f89f3a8220f7eeba9bfde84186f684f7e6ad966a","category":"Apple"}