{"title":"Real-world performance of point-of-care vs. standard-of-care HIV viral load testing in western Kenya: Secondary analysis of Opt4Kids and Opt4Mamas studies","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003378","date":1719237600000,"content":"<p>by Jessica H. Giang, Garoma Basha, Katherine K. Thomas, Patrick Oyaro, Bhavna H. Chohan, Leonard Kingwara, Shukri A. Hassan, Nashon Yongo, James Wagude, Fredrick Oluoch, Francesca Odhiambo, Boaz Oyaro, Grace C. John-Stewart, Lisa L. Abuogi, Rena C. Patel</p>\r\n\r\nRoutine HIV viral load testing is important for evaluating HIV treatment outcomes, but conventional viral load testing has many barriers including expensive laboratory equipment and lengthy results return times to patients. A point-of-care viral load testing technology, such as GeneXpert HIV-1 quantification assay, could reduce these barriers by decreasing cost and turnaround time, however real-world performance is limited. We conducted a secondary analysis using 900 samples collected from participants in two studies to examine the performance of GeneXpert as point-of-care viral load compared to standard-of-care testing (which was conducted with two centralized laboratories using traditional HIV-1 RNA PCR quantification assays). The two studies, Opt4Kids (n = 704 participants) and Opt4Mamas (n = 820 participants), were conducted in western Kenya from 2019–2021 to evaluate the effectiveness of a combined intervention strategy, which included point-of-care viral load testing. Paired viral load results were compared using four different thresholds for virological non-suppression, namely ≥50, ≥200, ≥400, ≥1000 copies/ml. At a threshold of ≥1000 copies/mL, paired samples collected on the same day: demonstrated sensitivities of 90.0% (95% confidence interval [CI] 68.3, 98.8) and 66.7% (9.4, 99.2), specificities of 98.4% (95.5, 99.7) and 100% (96.5, 100), and percent agreements of 97.7% (94.6, 99.2) and 99.1% (95.0, 100) in Opt4Kids and Opt4Mamas studies, respectively. When lower viral load thresholds were used and the paired samples were collected an increasing number of days apart, sensitivity, specificity, and percent agreement generally decreased. While specificity and percent agreement were uniformly high, sensitivity was lower than expected. Non-specificity of the standard of care testing may have been responsible for the sensitivity values. Nonetheless, our results demonstrate that GeneXpert may be used reliably to monitor HIV treatment in low- and middle- income countries to attain UNAID’s 95-95-95 HIV goals.","author":"Jessica H. Giang","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a917bd79e318d1ed3a9496a40d465fc794f3023078e3b55bb4e7bf59e9bcaf0f","category":"Environment"}