{"title":"Cervelo Aspero 5 review: Lighter and sleeker","link":"https://cyclingtips.com/2021/04/cervelo-aspero-5-gravel-bike-review/","date":1618891323000,"content":"<p>The Cervelo Aspero is one of our <a href=\"https://cyclingtips.com/2020/05/our-favourite-bikes-from-the-2020-gravel-bike-field-test/\">favourite gravel race bikes</a>. And while the Aspero was designed with racing in mind, it has since proven to be a bike that comes wonderfully close to the unicorn that is the drop-bar quiver-killer. </p>\n\n\n\n<p>The <a href=\"https://cyclingtips.com/2019/07/cervelo-aspero-gravel-bike-first-ride-review/\">original Aspero was released in 2019</a> and marked Cervelo’s entry into the gravel space. Gravel has continued to boom since and the Aspero has been an undeniable success for Cervelo. There are numbers to prove it. As of March 2021, the Aspero, along with the fresh do-it-all Caledonia, made up approximately 60% of Cervelo’s global sales, a staggering fact given the company continues to be a leader in the triathlon world and is best known as a performance road brand.</p>\n\n\n\n<p>And with such strong demand comes a new version of the Aspero that sits above the pre-existing and continuing offering. Introducing the Cervelo Aspero 5. Having hidden the bike in clear sight for nearly two months, this not-just-a-first-ride review details what is and isn’t new. </p>\n\n\n\n<h2>Aspero versus Aspero 5</h2>\n\n\n    <div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What:</strong> A new premium option in Cervelo’s Aspero gravel bike range. </li>\n\t\t\t\t\t                        <li><strong>Key updates:</strong> Lighter frame, concealed cabling, matching cockpit components, fancier paint, a higher price. </li>\n\t\t\t\t\t                        <li><strong>Weight:</strong> 990 grams (painted 56 cm frame), 8.27 kg (as tested, 54 cm, no pedals). </li>\n\t\t\t\t\t                        <li><strong>Price:</strong> US$7,100 / £8,699 / €8,499 as tested. </li>\n\t\t\t\t\t                        <li><strong>Highs:</strong> Same Aspero but faster; dialled geometry; subtly improved ride quality;  surprisingly normal component fitments including round seatpost and external clamp; looks awesome; provided groupset and wheels. </li>\n\t\t\t\t\t                        <li><strong>Lows:</strong> Race focus means no fender mounts; stiff nature is not ideal for truly rough terrain; concealed cabling carries compromises; press-fit bottom bracket shell; flared handlebar not ideal for the all-road bike seekers; comes with a hefty price tag.</li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\t\n\n\n\n<p>To help explain the new Aspero 5 I’ll take a step back to Cervelo’s last big bike launch, for the Caledonia, a do-it-all road bike that’s available in two variants: the Caledonia and the Caledonia 5. The <a href=\"https://cyclingtips.com/2021/01/2021-cervelo-caledonia-ultegra-di2-review/\">Caledonia</a> is the more affordable offering which features simpler external cable routing and a heavier carbon construction. Then there is the premium <a href=\"https://cyclingtips.com/2020/07/cervelo-caledonia-5-first-ride-review/\">Caledonia 5</a> which features fully concealed cabling, a lighter carbon lay-up, and a D-shaped carbon seatpost. </p>\n\n\n\n<p>Up until now, Cervelo has only had one level of the <a href=\"https://cyclingtips.com/2020/04/cervelo-aspero-long-term-review/\">Aspero gravel bike</a>. It features exposed cabling between the handlebar and frame, offers a frame weight of 1,110 g (56 cm painted), and was one of our favourite bikes from our <a href=\"https://cyclingtips.com/tag/2020-cyclingtips-gravel-bike-field-test/\" target=\"_blank\">Gravel Bike Field Test</a> held in 2020. </p>\n\n\n\n<p>And that leads me to the Aspero 5. When Cervelo first told me there was a more premium version of the Aspero on the way I guessed we’d see three things: a lighter frame, concealed cabling, and a D-shaped seatpost. I was right about the first two, and otherwise this new model doesn’t change the proven recipe all that much. </p>\n\n\n\n<p>The exterior frame mould is a carbon copy, so to speak. Not only is it the same from an aesthetic point of view, the fast, racy-yet-stable geometry is also identical, right down to the longer front-centre and clever TrailMixer flip-chip that gives you two options for fork offset. </p>\n\n\n\n<p>The tyre clearance is unchanged at 44 mm for 700c, or 51 mm for 650B (with a 4 mm gap). And likewise, Cervelo says the stiffness profile in both torsional and vertical planes is unchanged, too. And the Aspero 5 keeps to a regular 27.2 mm round seatpost with an external seat collar just like the regular Aspero, a decision based on simplicity and wide-open compatibility. As a result the Aspero can be equipped with a dropper seatpost, and further comfort can be added with a more flexible (or pivoting) seatpost, too.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-33-1340x754.jpg\" /><figcaption>The Aspero 5 remains quite simple in certain places. And I like that. </figcaption></figure>\n\n\n\n<p>So what has changed? Well, firstly the Aspero 5 is lighter, secondly the cables have been fully concealed, and thirdly it’s more expensive.</p>\n\n\n\n<h2>Removing weight and nothing else </h2>\n\n\n\n<p>Cervelo effectively took the Aspero and gave it a wholly new material layup in order to create the Aspero 5.  </p>\n\n\n\n<p>“We left a bit on the table (with the original Aspero) because it was a departure for us as a brand,” said Cervelo’s head of engineering, Scott Roy, in an interview with CyclingTips. “I’m a little conservative [with] taking risks in that department, and I think it’s better to err on the side of caution when venturing into a new category. I always knew there was a little bit more (weight) in the frame that we could take out.”</p>\n\n\n\n<p>And that redesign wasn’t just a matter of using more premium materials, but rather it involved completely changing the shapes, sizes and number of the individual plys used, all in an effort to reduce unneeded material overlap. “If you look at individual plys, there’s anywhere from 65 to 200 plus individual plys and unique shapes in a single frame,” said Roy. “On heavier frames you can get away with broader shapes that cover more area in the tubes, but the more you refine the layup, the more you’re able to take and reshape those individual plys, and you may only be saving 2-3 grams per ply to reduce the overall surface area of that ply. You increase the number of plys, but you reduce the surface area of those plys.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-26-1340x754.jpg\" /><figcaption>Beyond the hidden cabling and this logo there’s no way of knowing this is different to the regular Aspero. </figcaption></figure>\n\n\n\n<p>All that work results in approximately 120 g saved for a claimed frame weight of 990 g for a painted 56 cm frame. The fork weight remains unchanged from the Aspero at 450 g (painted fork only, uncut steerer). Now that saving isn’t much in the grand scheme of things, but it’s worth noting that taking the weight off without touching the shape or impacting strength, durability, or stiffness is no easy task. </p>\n\n\n\n<p>Further weight is shaved through new paint options. For the performance-focussed there’s the Cervelo 5 in black which is a minimalist option that aims to add as little weight as possible. Or for an approximate 50-60 gram penalty there’s the subtle and stealthy Purple Sunset I tested. There’s also an equally subtle Lime Shimmer colour for the top model. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-47-1340x754.jpg\" /><figcaption>Paint can often add noticeable weight to a bike, but Cervelo achieves the rich personality seen here with only minimal weight gain by using a single paint mask (not multiple layers of varying colours), keeping it dark, and using water-transfer decals (including the gold details seen on the inside of the fork and chainstays).  </figcaption></figure>\n\n\n\n<p>With the same geometry and intended stiffness profiles you can expect the new Aspero 5 to behave much like the original Aspero – and that’s not a bad thing. </p>\n\n\n\n<div><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Cervelo-Aspero-5-geometry.jpg\" /><figcaption>No changes here. </figcaption></figure></div>\n\n\n\n<p>The Aspero 5 retains the “TrailMixer” feature in the fork which offers a 5 mm difference in fork offset (the forward position provides quicker handling; the rearward position slows it down). The original idea was that you could maintain a consistent trail figure (approx 62 mm) when swapping between 650B or 700C wheels, or even between skinny road tyres and fatter gravel treads. However the feature also provides customisation to the bike’s handling.</p>\n\n\n\n<p>Using the TrailMixer isn’t a 30-second job – it requires that you unbolt and flip the dropout inserts, but more importantly, you need to swap out the front brake adapter, too (provided). Cervelo did originally consider more complicated designs that would allow faster swapping of the fork offset, but such things add complexity to manufacturing and added weight. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-3-1340x754.jpg\" /><figcaption>Using the TrailMixer requires swapping out the brake mount, too. </figcaption></figure>\n\n\n\n<p>More impressively, Cervelo offers this adjustable offset feature while still producing three entirely different-offset forks ( 52/57 mm, 49/54 mm, and 46/51 mm) in order to hit consistent trail figures across the six frame sizes offered. </p>\n\n\n\n<p>“It’s a strategy that we believe in throughout our entire model line, paying attention to every size frame and not just the middle size,” said Cervelo product manager Maria Benson in relation to these different fork offsets. </p>\n\n\n\n<p>Like the original Aspero, the Aspero 5 remains extremely race-focussed. There are three locations for bidon cages (one under the down tube), and there’s optional mounting for a Bento-style bag on the top tube. And that’s it. There are no mounts on the fork blades or under the top tube, and there are no mounts for fenders, either (despite Cervelo showing it can be done cleanly with the Caledonia). </p>\n\n\n\n<p>Speaking of Bento bags, the Aspero 5 includes one. It’s a simple zippered item with a profile that closely mimics the top tube width and features an aluminium plate that gives it a rigid hold. I did find that harder objects tended to rattle against that plate and so you’re best to keep food and similar soft items inside. Cervelo supplies a simple plastic plug to cover the mounting holes if you wish to forego the bag. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-6-1340x754.jpg\" /><figcaption>Cervelo supplies a small top tube bag with the bike. </figcaption></figure>\n\n\n\n<p>As introduced with the Caledonia, Cervelo includes its new (optional) integrated computer and/or accessory mount that utilises the central hole in the stem faceplate. It’s an elegant solution with a good amount of adjustability and adaptability. </p>\n\n\n\n<p>The new Aspero 5 continues with Cervelo’s “BBRight” bottom bracket system, effectively a wider (79 mm width) and asymmetric version of PF30. And as with the <a href=\"https://cyclingtips.com/2021/01/2021-cervelo-caledonia-ultegra-di2-review/\">Caledonia</a>, this bike also employs a thread-together bottom bracket to use within that press-fit shell. </p>\n\n\n\n<p>The supplied BBRight 24 mm Shimano bottom bracket offers a machined aluminium construction, sits at a not-nothing 144 g, and lets the cranks spin with little friction. Cervelo still believes this is the lightest and stiffest combination available. According to Cervelo’s head of engineering, Scott Roy, it’s not so much a tyre or crank clearance issue that has Cervelo choosing this wider press-fit format, but rather the fact it allows a straight line from the bottom bracket shell through to the chainstays to maintain stiffness.</p>\n\n\n\n<p>That may be so, but I’d still rather have a threaded shell on a bike that’s likely to need semi-regular bottom bracket servicing. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-38-1340x754.jpg\" /><figcaption>The bottom bracket is a threaded solution for the press-fit shell. I experienced no creaks in my testing. </figcaption></figure>\n\n\n\n<p>“I don’t believe there is one bottom bracket standard that solves everything,” Roy said. “There are use cases that justify other bottom bracket standards, but what we wanted to keep true to this bike is the performance. This is not a bikepacking bike; it still needs to be that weight and still needs to be that stiffness.”</p>\n\n\n\n<h2>No cables to be seen </h2>\n\n\n\n<p>More obvious than the weight saved are the utterly clean lines offered by the Aspero 5’s fully concealed cable routing. This cable routing design is similar to that used in the Caledonia 5 and S3, and is based around a half-moon-shaped fork steerer tube. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-12-1340x754.jpg\" /><figcaption>Clean.</figcaption></figure>\n\n\n\n<p>Cervelo’s system sees the brake lines (and electronic wire, if applicable) guided along the outside of the handlebar, through the hollow centre of the stem, and then down along the front crevice of the proprietary steerer tube before heading through the top headset bearing. </p>\n\n\n\n<p>The aero-yet-flared carbon AB09f handlebar is new, too, and is Cervelo’s own creation. The overall design is based closely on what’s used on the S3, but Cervelo has added a gravel-trendy 16º flare to the drops (which adds 8 cm to the width at the drops). This bar features some pretty clever cable channelling that keeps the wires hidden from the wind without the struggle of routing them through the bars. This bar is claimed to weigh 289 g in a 400 mm width (measured at the hoods).</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-14-1340x754.jpg\" /><figcaption>The Aspero 5 shows its intentions with flared bars as stock.  </figcaption></figure>\n\n\n\n<p>The result is a bike with no visible cables at the front end, and along with the new handlebar, Cervelo claims this saves 35 g of drag, or 2-3 watts, at 48 km/h. That’s a pretty high speed for most people, especially given off-road speeds are typically far lower than on road, and so no doubt the main benefit here is one of cleaner aesthetics. The other benefit is that there are no cables to get in the way of running a bar bag, which ironically, would undo those aero savings.</p>\n\n\n\n<p>Ok, so concealed cabling unquestionably looks cool, but it’s never without compromise. Thankfully Cervelo’s system is pretty good in that sense. </p>\n\n\n\n<p>The truncated airfoil-shaped headset spacers are split for relatively simple stem height adjustments, while Cervelo’s matching ST32 alloy stem can be flipped for vertical or negative rise. The stem is available in lengths of 70-130 mm, and weighs a semi-portly 210 g in a 100 mm length.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-6-1340x754.jpg\" /><figcaption>A look inside. The hoses are run down the front face of the steerer tube. Click the arrows for more details. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-1-1340x754.jpg\" /><figcaption>Brake hoses and wires are guided along the base of the bar. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-2-1340x754.jpg\" /><figcaption>The bar offers deep channels into the stem. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-3-1340x754.jpg\" /><figcaption>Yep, the stem is trapped by the brake hoses. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-4-1340x754.jpg\" /><figcaption>There’s a special compression ring, but the bearings are a common size. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-5-1340x754.jpg\" /><figcaption>The headset spacers are split. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-7-1340x754.jpg\" /><figcaption>The stem is shaped for the steerer. </figcaption></figure></li></ul></figure>\n\n\n\n<p>While Cervelo’s handlebar does feature special channeling for the brake hoses and electronic wires, you’re not locked into having the handlebar at a set angle or even having to use the handlebar at all – any handlebar with similar channeling or internal routing (with an exit hole at the stem clamp) can in theory be used. </p>\n\n\n\n<p>Cervelo’s half-moon-shaped (aka, C-shaped) steerer tube is of a regular 1 1/8″ diameter and so the fork head tube can be kept to a normal size. Likewise, the headset bearings used here are a regular size, too. </p>\n\n\n\n<p>Of course things get tricky if you wish to change out the stem length, and for that you will need to undo (and likely cut) the brake lines. However, keeping those brake lines on the outside of the handlebar greatly eases the overall process.</p>\n\n\n\n<p>Furthermore, that hidden cabling feature can only be used with electronic drivetrains, and Cervelo will only be offering the Aspero 5 with either Shimano GRX Di2 or SRAM AXS wireless groupsets. That said, the Aspero 5 does feature the same down tube-based port as the regular Aspero, and so it is entirely possible to fit a mechanical groupset and/or wired dropper seatpost to this frame if you’re happy to have a visible cable or two. Similarly, you’ll need to ditch the hidden cabling feature if you wish to use a stem like the <a href=\"https://cyclingtips.com/2018/08/redshift-sports-shockstop-stem-review/\">Redshift ShockStop</a> (which will fit the C-shaped steerer tube). </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-20-1340x754.jpg\" /><figcaption>The Aspero 5 features the same down tube port as the regular Aspero. Here it’s used for a Shimano Di2 junction box, but it can instead be used for cables. </figcaption></figure>\n\n\n\n<p>Stem-swapping issues aside, one of our common complaints with concealed cable systems is the extensive mechanical labour required to replace a headset bearing. And given this bike is designed to be ridden in filth, it’s an issue well worth considering.</p>\n\n\n\n<p>Cervelo claims to have given careful attention to the shaping of the headset top cap in order to keep the elements out. Additionally Cervelo equips the bikes with good quality stainless steel bearings for improved longevity. Still, whether this feature is an advantage remains something worth careful consideration, especially if you’re the home mechanic type or are unwilling to pay the heftier service bill when that rare headset-service moment arrives. </p>\n\n\n\n<h2>Models, components and pricing </h2>\n\n\n\n<p>Pricewise, the Aspero 5 will start from US$6,900 / £8,199 / €7,999 / CAD$8,850 / AU$TBC for a complete bike with a SRAM Force eTap Wide group and go up to US$9,000 / £10,799 / €10,499 / CAD$11,550 / AU$TBC  for the “Ltd” model with SRAM Red eTap Wide (including a <a href=\"https://cyclingtips.com/2019/05/ceramicspeed-ospw-review-oversized-pulley-wheel-system/\" target=\"_blank\">CeramicSpeed OSPW</a>). I tested the middle version which sells for US$7,100 / £8,699 / €8,499 / CAD$9,100 / AU$TBC and features a full Shimano GRX Di2 2×11 drivetrain. For comparison, the regular Aspero complete bike range tops out at US$6,000. </p>\n\n\n\n<p>All Aspero 5 models feature <a href=\"https://cyclingtips.com/2020/06/santa-cruz-gets-into-the-road-wheelset-game-with-new-reserve-carbon-models/\">Cervelo’s own Reserve carbon wheels</a>, with DT Swiss 350 hubs (Star Ratchet-equipped) found on the two more expensive models, while the DT Swiss 370 hubs (three-pawl) are used on the base Force AXS model. Both SRAM-equipped bikes include a power meter, but unfortunately limited supply means the Shimano bike I tested didn’t have such a feature. </p>\n\n\n\n<p>There’s a frameset option (including cockpit components) with all three colour schemes available, too. Expect to pay US$4,300 / £TBC / €TBC / CAD$5,500 / AU$TBC for this. </p>\n\n\n\n<h2>The Aspero I knew, but smoother </h2>\n\n\n\n<p>With so much the same as the original Aspero it shouldn’t come as a surprise that this new bike felt extremely familiar, and in a good way. </p>\n\n\n\n<p>The handling manages to strike a marvellous balance between feeling fast without being nervous across a wide range of surfaces. Coming off the <a href=\"https://cyclingtips.com/2021/01/factor-ls-gravel-bike-review/\">Factor LS</a>, an even more road-leaning gravel bike, the Aspero 5 feels more stable off-road and with no fear of toe overlap (for the tested 54 cm).</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-18-1340x754.jpg\" /><figcaption>While it sits on the stiffer and quicker end of things, the Aspero 5 can still be a hoot to ride. </figcaption></figure>\n\n\n\n<p>Despite its off-road intentions, the Aspero 5 remains remarkably playful on tarmac with the steering quick enough to provide a thrill not too dissimilar to what a good road racer offers. I even managed a few road-focussed rides with the Aspero once it was set up with 30 mm tyres on aero wheels. While the wheelbase and gravel-focussed gearing are slightly compromised, you’re otherwise not missing much. </p>\n\n\n\n<p>The frame retains its stiff and snappy feeling under power, and while there are stiffer bikes out there, the Aspero provides more than enough in that department. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-29-1340x754.jpg\" /><figcaption>I switched the Aspero 5 into road mode for a few rides. It doesn’t miraculously become a road race bike, but it’s still pretty handy on the tarmac. </figcaption></figure>\n\n\n\n<p>Balancing stiffness in a gravel bike like this is surely a difficult feat. On the road you want the bike rigid and reactive, but as surfaces worsen that rigidity can directly lead to discomfort and fatigue. When James Huang and I <a href=\"https://cyclingtips.com/2020/04/cervelo-aspero-long-term-review/\" target=\"_blank\">reviewed the regular Aspero</a> a year ago, we felt Cervelo had leaned a little too far to the road side of that balance and the result was a bike that felt unforgiving on choppy terrain. And as noted in that previous review, the stock alloy handlebar and seatpost were certainly not helping the situation. </p>\n\n\n\n<p>The Aspero 5 frame is just as rigid as the Aspero, but a change of cockpit components means the bike’s ride quality is noticeably smoother. The provided SP19 27.2 mm carbon seatpost was initially designed to add some comfort to the R-series bikes, and while its flex is subtle, it’s certainly a welcomed upgrade in the seated comfort department. </p>\n\n\n\n<p>It’s a similar story for Cervelo’s new AB09f carbon handlebar. While stiff, it’s still more forgiving on the hands than a traditional round-shaped alloy model. The bar offers an aero shaping that subtly rises from the stem clamp area, and there’s a slight tilt to the tops (dependant on how you have the bars angled) that provide a comfortable platform to rest against or even push against when climbing.</p>\n\n\n\n<p>Equally, I like that the ergo top shaping only occurs forward of the round-shaped bar, meaning there’s no increased risk of knee contact with the bar when riding out of the saddle. However smaller riders should know that the ergo-shaped tops are rather girthy, and I could only just get my index finger and thumb to touch each other in a grip (for reference I wear a size nine/medium glove). </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-13-1340x754.jpg\" /><figcaption>The handlebars offer a comfortable shape up top. </figcaption></figure>\n\n\n\n<p>This bar features a 4º sweep, a shallow 121 mm drop and a fairly-standard 80 mm reach. All of that felt pretty natural to me, but I never truly fell in love with the 16º flare at the drops. That flare somewhat steals the show from the Aspero 5 feeling like a road racer with off-road capabilities, and I’d be lying if I said i didn’t miss having a more traditionally shaped dropbar when riding on the road or on smoother gravel. Once things get chunkier or even technical then the added 8 cm width at the drops adds stability and control to the bike, and the shape happens to align perfectly with the slanted Shimano GRX levers, too.</p>\n\n\n\n<p>I know plenty of people who love flared bars for all types of gravel riding, and I also know many who prefer gravel bikes to feel like road bikes. I lean toward the latter, and while I can see a benefit to Cervelo’s decision, I still don’t wholly agree with it. I think you’ll agree with me if you’re choosing the Aspero 5 to be your do-it-all dropbar bike (in place of a road bike), and you’ll say I’m wrong if you want this bike solely to be a fast-charging gravel-race-specialist (which was Cervelo’s mission). </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-28-1340x754.jpg\" /><figcaption>There’s no getting around it; those flared bars change how this bike feels on the road. </figcaption></figure>\n\n\n\n<p>Between the handlebar and seatpost the Aspero 5 just feels better at isolating my body from the bumps, and in turn I felt I could push the bike harder across rough terrain. At least to a point – this thing is still a pretty stiff bike. It’s worth noting that you can achieve this same improved ride quality from the regular Aspero with a few simple component changes, but it’s nice that the Aspero 5 is ready to go. </p>\n\n\n\n<p>I haven’t yet mentioned the ride experience of a lighter frame and more aero front-end, and frankly that’s because neither are noticeable. All things being equal, less weight is better, and in this regard, the Aspero 5 is about 110 points (if a point was a gram) better than the regular Aspero. And while I’m sure the streamlined front end is faster, it certainly can’t be felt in regular riding. What is noticeable though is the pure clean lines offered, and that in itself is surely worth some placebo-driven performance improvement.   </p>\n\n\n\n<p>My 54 cm tester tipped the scales at 8.27 kg without pedals but with a healthy amount of liquid sloshing in the tyres. Fitted with the gravel equivalent of Shimano Ultegra Di2 components, the bike could no doubt be made lighter, but in my testing I found no glaring weakness that made me want to make that change.</p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2019/05/shimano-grx-gravel-groupset-release-info-weights/\">Shimano GRX RX815</a> effectively merges the faultless shifting of Ultegra Di2 with improved ergonomics for off-road riding, better leverage at the brake levers, and more sensible gearing ratios. And while a 2x gearing system may be heavier than a 1x, I believe it’s a big benefit in helping this bike switch between road and off-road usage.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-31-1340x754.jpg\" /><figcaption>Even amongst the latest 12-speed options, in my opinion a bike like this remains more versatile with two chainrings. </figcaption></figure>\n\n\n\n<p>Cervelo has equipped an 11-speed <a href=\"https://cyclingtips.com/2018/03/shimano-ultegra-hg-800-11-34t-cassette-review/\">11-34T HG-800 cassette</a> out back matched with 48/31T chainrings. I really do love this gearing range that is equally comfortable for exploring steep gravel roads as it is for road cruising. </p>\n\n\n\n<p>The bike rolls on wheels from Cervelo’s sister wheel company, <a href=\"https://www.reservewheels.com/\">Reserve</a>. The Reserve name is perhaps best known as the carbon wheel brand connected with Santa Cruz Bikes, and recently the brand <a href=\"https://cyclingtips.com/2020/06/santa-cruz-gets-into-the-road-wheelset-game-with-new-reserve-carbon-models/\">expanded into 700c options</a>, too. These wheels (which in this case retail for US$1,800) tick a lot of boxes, including a modern 24 mm inner width, a semi-hooked rim design that works with pretty much all clincher and tubeless tyres, a respectable 1,563 g weight figure, and easy tubeless set-up.</p>\n\n\n\n<p>The rim shape also seems to do a good job of not pinching tyres when square-edge objects are hit at speed (oops) and there’s even a very generous lifetime replacement warranty that covers you when things go wrong. Better yet the DT Swiss 350 hubs – while not the lightest – are one of the most reliable options out there, and the build quality of the 24-spoked wheels is solid, too. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-32-1340x754.jpg\" /><figcaption>The Aspero 5 comes fitted with 38 mm rubber from Panaracer. I find the GravelKing SK a little lacking in tread for Sydney riding, but it remains a nice options for smoother, faster conditions.   </figcaption></figure>\n\n\n\n<p>Otherwise things are all pretty familiar with the Aspero 5 and I encourage you to read up on our <a href=\"https://cyclingtips.com/2020/04/cervelo-aspero-long-term-review/\">previous review of the Aspero</a> for more insight into the handling and ride quality. </p>\n\n\n\n<h2>Five stars for the Aspero 5 </h2>\n\n\n\n<p>We may no longer score bikes at CyclingTips, but if we did, the Aspero 5 would receive an incredibly high mark. And that makes sense given this is a sleeker-looking, smoother-riding and more premium version of a bike that we’ve previously sung the praises of. </p>\n\n\n\n<p>If the Aspero was one of our favourite road-leaning do-most-of-it-fast gravel bikes, then the Aspero 5 is certainly one of our favourite performance-focussed-yet-versatile machines available for those with a bigger budget.</p>\n\n\n\n<p>The Aspero 5 is one impressively well-mannered bike for tackling a wide range of terrain, fast. It also happens to look pretty gorgeous, in my eyes. I don’t believe a perfect quiver-killer exists (or is even possible), but if it did, it would probably look a lot like the Aspero 5.</p>\n\n\n\n<p>Yeah, I want one.</p>\n\n\n\n<h2>Gallery</h2>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-40-1340x754.jpg\" /><figcaption>The Aspero 5 RX 815 Di2 in stock form.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-8-1340x754.jpg\" /><figcaption>And this is how the bike looked through most of my testing.  </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-46-1340x754.jpg\" /><figcaption>Aspero 5 on a rock. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-25-1340x754.jpg\" /><figcaption>The stiff nature of the Aspero 5 encourages you to go all-out. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-27-1340x754.jpg\" /><figcaption>In certain light, the paint is quite spectacular. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-20-1340x754.jpg\" /><figcaption>At first, I thought the gold highlights were garish, but that opinion has since changed. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-19-1340x754.jpg\" /><figcaption>.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-14-1340x754.jpg\" /><figcaption>.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-11-1340x754.jpg\" /><figcaption>Shimano’s GRX Di2 just works. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-26-1340x754.jpg\" /><figcaption>.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-9-1340x754.jpg\" /><figcaption>.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-4-1340x754.jpg\" /><figcaption>The contents of a modern top tube bag. To be honest I don’t get on with such bags as I find my knees brush them when climbing out of the saddle. Cervelo isn’t forcing its use. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-1-1340x754.jpg\" /><figcaption>The Shimano GRX 2×11 gearing offers a generous range for stupidly steep stuff. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-Tim-Bardsley-Smith-2-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-43-1340x754.jpg\" /><figcaption>A closer look at the TrailMixer fork inserts. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-37-1340x754.jpg\" /><figcaption>There’s plenty of tyre clearance out back. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-36-1340x754.jpg\" /><figcaption>The pinch point is at the chainstays. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-35-1340x754.jpg\" /><figcaption>The Aspero’s seat tube hugs the rear wheel.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-29-1340x754.jpg\" /><figcaption>Clearly designed for going fast off-road, the Aspero 5 features a small down tube protector to ward off rock strikes. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-28-1340x754.jpg\" /><figcaption>Cervelo’s accessory solution is quite neat. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-8-1340x754.jpg\" /><figcaption>Cervelo provides a few different options with its modular mount. Garmin and Wahoo pucks are provided. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-9-1340x754.jpg\" /><figcaption>How the accessory mount attaches to the stem face plate. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-27-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-25-1340x754.jpg\" /><figcaption>DT Swiss 350 hubs aren’t the lightest option but they sure are reliable. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-22-1340x754.jpg\" /><figcaption>The GRX levers almost perfectly match the flare of the drops. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-19-1340x754.jpg\" /><figcaption>There are three bidon cage bolts on the down tube. Assuming you don’t need a second cage on the seat tube then the lower position here is the most aero. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/2022-Cervelo-Aspero-5-GRX-Di2-gravel-bike-review-cyclingtips-13-1340x754.jpg\" /><figcaption>The Aspero 5 is approved for UCI sanctioned event usage (such as CX racing). And yes, Cervelo has confirmed that a dedicated CX bike is near (how’s that for a hidden Easter egg?)  </figcaption></figure></li></ul></figure>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/cervelo-aspero-5-gravel-bike-review/\">Cervelo Aspero 5 review: Lighter and sleeker</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a92759bb13d42ec45dba94aa763b56d09f875583bb6db293a772f20fc9a4fec8","category":"Cycling"}