{"title":"Stimulation of small phytoplankton drives enhanced sinking particle formation in a subtropical ocean eddy","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12529?af=R","date":1713603156000,"content":"<h2>Abstract</h2>\n<p>Nutrient transfer into the sunlit surface ocean by cyclonic eddies is potentially crucial for sustaining primary productivity in the stratified subtropical gyres. However, the nature of productivity enhancements, including the flow of matter to higher trophic levels and its impact on carbon fluxes, remain poorly resolved. Here, we report a detailed assessment of the biogeochemical response to a cyclonic eddy in the subtropical Northwest Pacific via a combination of ship-based and autonomous platforms. Primary production was enhanced twofold within the eddy core relative to reference sites outside, whereas phytoplankton biomass even decreased. Pico-phytoplankton (&lt; 2 <i>μ</i>m) dominated (&gt; 80%) both phytoplankton biomass and primary production inside and outside the eddy. The stimulated primary production in the eddy core was accompanied by an approximately twofold increase in mesozooplankton abundance, an approximately threefold increase in particle formation in the deep chlorophyll maximum layer, as well as significantly enhanced surface oceanic CO<sub>2</sub> uptake and net community production. We suggest these observations carry important implications for understanding carbon export in the subtropical ocean and highlight the need to include such subtropical eddy features in ocean carbon budget analyses.</p>","author":"Haoran Liu, \nThomas J. Browning, \nEdward A. Laws, \nYibin Huang, \nLei Wang, \nYiwei Shang, \nXiaogang Xing, \nKuanbo Zhou, \nZong‐Pei Jiang, \nXin Liu, \nBangqin Huang, \nMinhan Dai","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"a92b366bacd5a4c7e48a4c06cfebdd45cf916ee6ffdcd2ce47b1d257a28ec5c4","category":"Environment"}