{"title":"ChatGPT M.D.: Is there any room for generative AI in neurology?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310028","date":1728482400000,"content":"<p>by Bernát Nógrádi, Tamás Ferenc Polgár, Valéria Meszlényi, Zalán Kádár, Péter Hertelendy, Anett Csáti, László Szpisjak, Dóra Halmi, Barbara Erdélyi-Furka, Máté Tóth, Fanny Molnár, Dávid Tóth, Zsófia Bősze, Krisztina Boda, Péter Klivényi, László Siklós, Roland Patai</p>\r\n\r\nChatGPT, a general artificial intelligence, has been recognized as a powerful tool in scientific writing and programming but its use as a medical tool is largely overlooked. The general accessibility, rapid response time and comprehensive training database might enable ChatGPT to serve as a diagnostic augmentation tool in certain clinical settings. The diagnostic process in neurology is often challenging and complex. In certain time-sensitive scenarios, rapid evaluation and diagnostic decisions are needed, while in other cases clinicians are faced with rare disorders and atypical disease manifestations. Due to these factors, the diagnostic accuracy in neurology is often suboptimal. Here we evaluated whether ChatGPT can be utilized as a valuable and innovative diagnostic augmentation tool in various neurological settings. We used synthetic data generated by neurological experts to represent descriptive anamneses of patients with known neurology-related diseases, then the probability for an appropriate diagnosis made by ChatGPT was measured. To give clarity to the accuracy of the AI-determined diagnosis, all cases have been cross-validated by other experts and general medical doctors as well. We found that ChatGPT-determined diagnostic accuracy (ranging from 68.5% ± 3.28% to 83.83% ± 2.73%) can reach the accuracy of other experts (81.66% ± 2.02%), furthermore, it surpasses the probability of an appropriate diagnosis if the examiner is a general medical doctor (57.15% ± 2.64%). Our results showcase the efficacy of general artificial intelligence like ChatGPT as a diagnostic augmentation tool in medicine. In the future, AI-based supporting tools might be useful amendments in medical practice and help to improve the diagnostic process in neurology.","author":"Bernát Nógrádi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a92d28611fa220020d4551b0bdf3b6687d6042a25fef83fca1de3c0918689ebd","category":"Interdisciplinary"}