{"title":"Methods to advance health equity and social justice in healthcare: Protocol for a scoping review on the utilisation of routinely collected data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306786","date":1720620000000,"content":"<p>by Katie Chadd, Anna Caute, Anna Pettican, Pam Enderby</p>\r\nBackground <p>Many areas of healthcare are impacted by a paucity of research that is translatable to clinical practice. Research utilising real-world data, such as routinely collected patient data, may be one option to efficiently create evidence to inform practice and service delivery. Such studies are also valuable for exploring (in)equity of services and outcomes, and benefit from using non-selected samples representing the diversity of the populations served in the ‘real world’. This scoping review aims to identify and map the published research which utilises routinely collected clinical healthcare data. A secondary aim is to explore the extent to which this literature supports the pursuit of social justice in health, including health inequities and intersectional approaches.</p> Method <p>This review utilises Arksey and O’Malley’s methodological framework for scoping reviews and draws on the recommended enhancements of this framework to promote a team-based and mixed methods approach. This includes searching electronic databases and screening papers based on a pre-specified inclusion and exclusion criteria. Data relevant to the research aims will be extracted from included papers, including the clinical/professional area of the topic, the source of data that was used, and whether it addresses elements of social justice. All screening and reviewing will be collaborative and iterative, drawing on strengths of the research team and responsive changes to challenges will be made. Quantitative data will be analysed descriptively, and conceptual content analysis will be utilised to understand qualitative data. These will be collectively synthesised in alignment to the research aims.</p> Conclusion <p>Our findings will highlight the extent to which such research is being conducted and published, including gaps and make recommendations for future endeavours for real-world data studies. The findings from this scoping review will be relevant for practitioners and researchers, as well as health service managers, commissioners, and research funders.</p>","author":"Katie Chadd","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a9318cc1c8ddbe1dd98af7773ebed1acb595c3908277edb37ea6d7ca671207d8","category":"Interdisciplinary"}