{"title":"Enabling LiNO3 in carbonate electrolytes by flame‐retardant electrolyte additive as a cosolvent for enhanced performance of lithium metal batteries","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202200096?af=R","date":1707196547000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f7d11f93-0d71-4108-9cf6-cea786dbaad7/appl202200096-gra-0001-m.png\" alt=\"Enabling LiNO3 in carbonate electrolytes by flame-retardant electrolyte additive as a cosolvent for enhanced performance of lithium metal batteries\" /><p>By simple addition of 10 wt.% solution containing 2M LiNO<sub>3</sub> in triethyl phosphate (TEP), cyling time of asymmetric Cu||Li cells was more than doubled in LP30 electrolyte. Deposition morphology shifted from dendritic, high-surface-area deposits to larger, rounded metal particles. TEP merely acts as cosolvent but does not contribute to improved cycling behaviour.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Most contemporary liquid Li-ion battery chemistries are based on carbonate electrolytes, however, these typically perform poorly with metallic lithium. Especially, when only a small reservoir of metal is present, cells fail quickly due to the complete consumption of electrochemically active Li. Electrolyte modification is, therefore, a commonly chosen strategy to increase cycling stability and prolong lifetime of the cell. At the same time, complete redevelopment of an electrolyte usually creates a new set of problems, as conductivity, suitable electrochemical stability window and compatibility to all components of the cell needs to be ensured. It is, therefore, a reasonable strategy to alter existing electrolytes slightly, as has been done for the aforementioned carbonate electrolytes by incorporating lithium nitrate salt with triethyl phosphate as cosolvent into the mixture. As the role of the organophosphate is not fully clarified, our study aims to investigate its effect onto cycling stability, morphology, and reversibility of Li metal cycling both with and without LiNO<sub>3</sub> salt. Using close-to-industrial conditions with limited excess of metallic Li at high current density, we are comparing cycling performance of the different electrolyte combinations. Contribution of the additive components to irreversible thickness growth due to the formation of inactive (“dead”) lithium and deposited lithium morphology is investigated by operando dilatometry and postmortem scanning electron microscopy. Finally, we are looking at modified solvent-salt ratios to see whether further improvements of cell lifetime and morphology can be achieved.</p>","author":"Eric Winter, \nMariano Briccola, \nThomas J. Schmidt, \nSigita Trabesinger","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"a93b4dc960940acaaaf32ca67b61972a6e4efdc0a7e429543775de27541b3334","category":"Environment"}