{"title":"Sex, flies and flower trap: Trapping trichomes and their function in pollination","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14633?af=R","date":1723276428000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b2fee66a-91a6-4f12-a932-ed1da7f876f9/fec14633-toc-0001-m.png\" alt=\"Sex, flies and flower trap: Trapping trichomes and their function in pollination\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/31/sex-flies-and-flower-trap-trapping-trichomes-and-their-function-in-pollination/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTrapping trichomes, a common trait found in protogynous trap flowers, are thought to enable interaction with pollinators, promoting both pollen removal and fruit set. However, this hypothesis has yet to be empirically confirmed.\n\nIn this study, we experimentally tested whether trapping trichomes favour male and female functions in trap flowers. Using protogynous South American <i>Aristolochia esperanzae</i> trap flowers, we observed the temporal variation in both sexual functions and associated them with the wilting of the flower and trapping trichomes. Next, we described the trapping trichomes features associated with the capture, entrapment and release of pollinators. Finally, we used manipulative experiments involving trapping trichome removal to quantify their influence on pollinator entrapment, pollen removal and fruit set.\n\nWhile flowers wilted after the end of the female phase, the trapping trichomes only wilted some hours after pollen presentation, promoting a delay in the exit of pollinators, so they carried pollen. Trapping trichomes features, such as a density gradient towards the interior of the tube, unidirectional orientation and epicuticular waxes, may be important in the capture and entrapment of pollinators. Trapping trichome removal decreased drastically the probability of pollinator entrapment and pollen removal, leading to no fruit set.\n\nThese results indicate that the evolution and maintenance of trapping trichomes in trap flowers probably occurred through selective pressures from both sexual functions and highlight their role in the functioning of this highly phenotypically specialized pollination system.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/31/sex-flies-and-flower-trap-trapping-trichomes-and-their-function-in-pollination/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nLos tricomas de captura son un rasgo común en las flores trampa protogínicas, se cree que estos permiten la interacción con los polinizadores, promoviendo tanto la remoción de polen como la fructificación. Sin embargo, esta hipótesis aún no ha sido confirmada empíricamente.\n\nEn este estudio, probamos experimentalmente si los tricomas de captura favorecen las funciones masculina y femenina en flores trampa. Utilizando las flores trampa protogínicas de la especie Sudamericana <i>Aristolochia esperanzae</i>, nosotros observamos la variación temporal en las funciones sexuales y las asociamos con el marchitamiento de la flor y los tricomas de captura. Luego, describimos las características de los tricomas de captura asociadas con la captura, atrapamiento y liberación de polinizadores. Finalmente, realizamos experimentos manipulativos que involucraron la remoción de tricomas de captura para cuantificar su influencia en el atrapamiento de polinizadores, remoción de polen y fructificación.\n\nMientras que las flores se marchitaron después del final de la fase femenina, los tricomas de captura solo se marchitaron algunas horas después de la presentación del polen, promoviendo un retraso en la salida de los polinizadores, lo que hacía que estos transportaran el polen. Las características de los tricomas de captura, como un gradiente de densidad hacia el interior del tubo, orientación unidireccional y ceras epicuticulares, pueden ser importantes en la captura y el atrapamiento de los polinizadores. La remoción de los tricomas de captura disminuyó drásticamente la probabilidad de atrapamiento de polinizadores y remoción de polen, lo que llevó a la ausencia de fructificación.\n\nEstos resultados indican que la evolución y el mantenimiento de los tricomas de captura en las flores trampa probablemente ocurrieron a través de presiones selectivas de ambas funciones sexuales y resaltan su papel en el funcionamiento de este sistema de polinización altamente especializado.\n</p>","author":"Carlos A. Matallana‐Puerto, \nVinicius L. G. Brito, \nVinícius C. Kuster, \nPaulo E. Oliveira, \nJoão C. F. Cardoso","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"a93b2b11415dc80053b87982b34cdb87e3943499912cde216f4be2358c9511c0","category":"Environment"}