{"title":"The Putative Role Of TIM-3 Variants In Polyendocrine Autoimmunity: Insights From a WES Investigation","link":"https://www.preprints.org/manuscript/202408.2202/v1","date":1725008372000,"content":"Autoimmune polyglandular syndrome (APS) comprises a complex association of autoimmune pathological conditions. APS Type 1 originates from loss-of-function mutations in the autoimmune regulatory (AIRE) gene. APS2, APS3, and APS4 are linked to specific HLA alleles within the major histocompatibility complex, with single nucleotide polymorphisms (SNPs) in non-HLA genes also contributing to disease. In general, variability in the AIRE locus and the presence of heterozygous loss-of-function mutations can impact self-antigen presentation in the thymus. In this study, Whole Exome Sequencing (WES) was performed on a sixteen-year-old female APS3A/B patient to investigate the genetic basis of her complex phenotype. The analysis identified two variants (p.Arg111Trp and p.Thr101Ile) of the hepatitis A virus cell receptor 2 gene (HAVCR2) encoding for the TIM-3 (T cell immunoglobulin and mucin domain 3) protein. These variants were predicted, through in silico analysis, to impact protein structure and stability, potentially influencing the patient’s autoimmune phenotype. While Confocal Microscopy analysis revealed no alteration in TIM-3 distribution between PBMCs isolated from the patient and those of a healthy donor, RT-qPCR showed reduced TIM-3 expression in the patient’s cells. A screening conducted on a cohort of thirty APS patients indicated that the p.Thr101Ile and p.Arg111Trp mutations were unique for the proband. This study opens the pathway for the search of TIM-3 variants possibly linked to complex autoimmune phenotypes, highlighting the potential of novel variant discovery in contributing to APS classification and diagnosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a9406ba1732d863fe9a795d0632d21ae85e873b63985e2b3a4a20513e255255d","category":"Interdisciplinary"}