{"title":"Google ships Android 12 for the Pixel 3 and up","link":"https://arstechnica.com/?p=1805787","date":1634751369000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Blogpost_hero_v05.max-1000x1000-800x333.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Blogpost_hero_v05.max-1000x1000.png\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Lost in the hubbub of yesterday's <a href=\"https://arstechnica.com/gadgets/2021/10/the-pixel-6-is-official-at-the-incredible-prices-of-599-and-899/\">Pixel 6 launch</a> is the fact that Android 12 shipped for older Pixel phones, too. Google took <a href=\"https://arstechnica.com/gadgets/2021/10/android-12-gets-a-source-code-release-but-not-a-pixel-release/\">the odd step</a> of releasing Android 12 to Google's AOSP (Android Open Source Project) repository on October 4, but it didn't ship any finished binaries for Pixel phones, which normally get day-one updates. During the Pixel 6 launch, Google's marketing department finally opened the floodgates with <a href=\"https://blog.google/products/android/android-12/\">a blog post</a>, <a href=\"https://www.android.com/android-12/\">a new website</a>, a <a href=\"https://www.android.com/android-12-ar-statue/\">virtual AR statue</a>, and builds for compatible devices.</p>\n<p>Officially, Android 12 is out for the Pixel 5, 5a, 4, 4a, 3, and 3a. Android 12 marks the first major update the Pixel 2 has missed out on, though it has been without security updates for a while. You have a few options to get Android 12. The easiest is to wait for the update to hit your device, which will happen sometime in the next month as it automatically rolls out to users. Another option is to head to developer.google.com and <a href=\"https://developers.google.com/android/ota\">download the OTA update</a> for your device. There are also full from-scratch system images that will wipe out your existing data. Applying either of those last two will require some light command line work and tools downloads, and Google has listed full instructions on its site.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/38.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/38-980x636.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/38.jpg\">Google used to make real-life Android statues, but now it does AR ones. This one hints at the internal codename for Android 12: \"Snow Cone.\"</a> (credit: Google)</p></div>\n<p>Android 12 is one of the biggest Android releases in recent memory, and it comes with a full user interface revamp called \"Material You.\" Every part of the UI is <a href=\"https://arstechnica.com/gadgets/2021/06/android-12s-beautiful-color-changing-ui-already-lives-up-to-the-hype/\">now color-coordinated</a> with your wallpaper, and Google is rapidly rolling out support for Material You themes to its biggest apps. There are a ton of changes to the notification panel, widgets, and system UI, and there are new privacy notifications for ongoing usage of the microphone or camera. Android 12 brings Android <a href=\"https://arstechnica.com/gadgets/2021/09/android-to-take-an-upstream-first-development-model-for-the-linux-kernel/\">closer to the Linux kernel</a> than ever, with fewer forks and less of a release delay between Android and Linux. There's an incremental file system for play-as-you-download games, new emojis, and plenty of other stuff.</p></div><p><a href=\"https://arstechnica.com/?p=1805787#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1805787&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a9432b8257737d295681d90b42180339553f2bd3359c9bde46458ed6b1ecc7c6","category":"Tech"}