{"title":"Surface Thermodynamic Properties of Styrene–Divinylbenzene Copolymer Modified by Supramolecular Structure of Melamine using Inverse Gas Chromatography","link":"https://www.preprints.org/manuscript/202407.1427/v1","date":1721213160000,"content":"The surface thermodynamic properties of polymers and copolymers modified by supramolecular structures are very used in several industrial processes, such as selective adsorption, paints, coatings, colloids, and adhesion applications. Background: Inverse gas chromatography at infinite dilution was proved to be the best technique to determine the surface properties of solid surfaces by studying the adsorption of some model polar and non-polar organic molecules adsorbed on solid surfaces by varying the temperature. Methods: The retention volume of adsorbed solvents is a precious parameter to obtain the London dispersive and polar free energies and the London dispersive surface energy of styrene–divinylbenzene copolymer modified by supramolecular structure of melamine using the Hamieh thermal model and our new methodology consisting in the separation of the two polar and dispersive free energy of interaction. This led to the determination of the polar acid and base surface energy, and the Lewis’s acid-base constants of the various solid materials. Results: all surface energetic properties of styrene–divinylbenzene copolymer modified by melamine at different percentages were determined as a function of temperature, following our new methodology. Conclusions: It was observed that the styrene–divinylbenzene copolymer exhibited the highest London dispersive surface energy which decreased when the melamine percentage increased. All materials presented higher Lewis’s basicity and this Lewis’s basicity increased with the percentage of melamine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a9457f0234af53b28a87651329d95056e07659228fdcabf7550927dcf2b95320","category":"Interdisciplinary"}