{"title":"Apple has already started testing macOS Ventura 13.4","link":"https://www.macworld.com/article/1674563/macos-ventura-13-4-beta-features-release-how-to-install.html","date":1680034443000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Just hours after the <a href=\"https://www.macworld.com/article/1515239/macos-ventura-13-3-release-candidate-features-install.html\">release of macOS 13.3</a>, Apple started the countdown to the next version with the release of the first 13.4 beta. As always, the first release is only for developers, but a public beta should follow within a day or two.</p>\n\n\n\n<h2>macOS Ventura 13.4 beta: New features</h2>\n\n\n\n<p>We’re not sure what’s in the 13.4 beta yet, but we aren’t waiting for any major new features. Of note, Apple Music Classical arrived for the iPhone on Tuesday without a Mac companion app, so it’s possible it arrives in macOS 13.4. Additionally, macOS 13.4 could contain the redesigned TV app with a sidebar that was previously rumored to arrive in macOS 13.3. </p>\n\n\n\n<h2>macOS Ventura 13.4: Release date</h2>\n\n\n\n<p>It usually takes about around six weeks for Apple to properly test new versions of its operating systems, but that timeline can change.</p>\n\n\n\n<h2>How to install the macOS Ventura 13.4 public beta</h2>\n\n\n\n<p>While Apple changed the beta process in iPhones and Macs to rely solely on Apple IDs, you still need to install a new profile on your Mac. As always, we recommend against running betas on your main machine for work since there could be bugs that cause serious issues.</p>\n\n\n\n<ol><li>Click Sign Up on the Apple Beta page and register with your Apple ID.</li><li>Log in to the Beta Software Program.</li><li>Click <em>Enroll your Mac</em>. (If you signed up for a previous version’s beta last year you may need to uninstall the profile for that and then re-enroll for the new one.)</li><li>Go to beta.apple.com/profile on your Mac.</li><li>Download and install the Beta Access Utility.</li><li>Head over to Software Update in System Settings to install the update. </li><li>Restart your Mac</li></ol>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a9555e9dba19e9f06d0ee4b847a4a22be8533753b881c5f778e1afab7f0a2a06","category":"Apple"}