{"title":"Data Is the New Sand","link":"https://markpeak.net/data-is-the-new-sand/","date":1630736974000,"content":"<p>ในฐานะที่อยู่ในวงการเทคโนโลยีมายาวนาน คำพูดหนึ่งที่ผมมีปัญหาเสมอคือ</p>\n<blockquote><p>“บริษัท x ให้เราใช้บริการนี้ฟรี เพราะจะทำเงินด้วยการนำข้อมูลของเราไปขาย”</p></blockquote>\n<p>คิดว่ากรอบความคิดแบบนี้มาจากกระแสความตื่นตัวเรื่อง data ในภาพรวม ทั้งในแง่วิชาชีพ data scientist/engineer, กระแสเห่อ big data ไปจนถึงความตื่นตัวเรื่อง data privacy (ซึ่งเป็นเรื่องดี)</p>\n<p>แต่สิ่งที่อยากบอกเสมอคือ “data ของคุณไม่ได้มีมูลค่าอะไรขนาดนั้น” เมื่อนำไปขาย</p>\n<p>ปัจจุบัน ข้อมูลบัตรเครดิตที่รั่วออกมาและขายตามเว็บใต้ดิน ซึ่งเราในฐานะเจ้าของข้อมูลรู้สึกว่าเป็นเรื่องคอขาดบาดตายมากๆ (ข้อมูลหลุดแล้ว โดนแฮ็กเกอร์ตามรอยได้ทุกอย่าง โลกแตก) มีราคาขายกันเพียงแต่ไม่กี่ดอลลาร์เท่านั้น (ข้อมูลจาก<a href=\"https://www.forbes.com/sites/emmawoollacott/2021/08/10/with-unprecedented-generosity-hackers-release-a-million-credit-cards-for-free/?sh=3887457f654e\">บทความ Forbes ปี 2021 บอกว่าเริ่มต้นที่ 0.30 ดอลลาร์เอง</a>) ด้วยเหตุผลว่าหลุดกันจนเบื่อแล้ว</p>\n<p>และนั่นคือข้อมูลทางการเงิน (financial data) ที่อาจนำไปใช้ประโยชน์ทางตรงได้ด้วยนะ (แฮ็กบัตรเราไปใช้จ่าย ซึ่งในทางปฏิบัติก็ไม่ง่าย เพราะระบบดัก fraud ยุคหลังก็เก่งขึ้นมาก)</p>\n<p>ถ้าเป็นข้อมูลเชิงพฤติกรรม (behavioral data) ที่ไม่สามารถนำไปใช้ประโยชน์ทางตรงได้มากนัก เช่น การรู้ว่าเราชอบรองเท้ายี่ห้อ A กินนมยี่ห้อ B การนำข้อมูลพวกนี้ไป “ขาย” กันตรงๆ ยิ่งเป็นไปได้ยากมากขึ้นไปอีกหลายแมกนิจูด</p>\n<p>วาทกรรมที่เราชอบพูดกันว่า “Data is the New Oil” เปรียบเสมือน “ขุมทรัพย์น้ำมัน” จึงค่อนข้าง misleading พอสมควร</p>\n<p>อย่างไรก็ตาม ผมไม่มีวิธีอธิบายเรื่องนี้ที่ดีมากนัก จนกระทั่งมาเจอกับบทความนี้ <a href=\"https://www.theinformation.com/articles/data-is-the-new-sand\">Data is the New Sand</a></p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.theinformation.com/articles/data-is-the-new-sand\">\n\t\t\t\t\t<img src=\"https://tii.imgix.net/production/articles/5340/bf4a6f7b-54c3-4e5e-ac11-53e7c5397d9b.jpg?w=1200&amp;fm=jpg&amp;auto=compress\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.theinformation.com/articles/data-is-the-new-sand\">\n\t\t\tData Is the New Sand\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.theinformation.com/articles/data-is-the-new-sand\">\n\t\t\t<p>The metaphors we use are like a map. They can guide us or lead us astray. When British mathematician Clive Humby said “Data is the new oil” back in 2006, he meant that data, like oil, must be refined and transformed to make it into useful products and services. Only then does it become valuable.…</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.theinformation.com/assets/favicon_prod%2Ffavicon-32x32.png\" />\t\tThe Information\t</div>\n</div>\n<p>ผู้เขียนบทความเรื่องนี้คือ Tim O’Reilly ผู้ก่อตั้งสำนักพิมพ์ O’Reilly ดังนั้นในแง่เครดิตความน่าเชื่อถือคงไม่มีใครกังขา</p>\n<p>อย่างไรก็ตาม บทความลงในเว็บ The Information ซึ่งต้องจ่ายเงินอ่าน ทำให้อ่านตัวเต็มได้ยากพอสมควร แต่จากที่ไปอ่านความเห็นที่คนอื่นๆ พูดถึงตัวเนื้อหาบทความของ O’Reilly ก็ค่อนข้างเห็นภาพประเด็นสำคัญที่เขาอยากสื่อ</p>\n<blockquote>\n<p>“Our individual data is just not that valuable. Data is not the new oil. It is the new sand. Like silicon, which makes up 28% of the earth’s crust, it is ubiquitous &amp; is only made valuable by an enormous set of industrial-scale processes.”<a href=\"https://twitter.com/timoreilly?ref_src=twsrc%5Etfw\">@timoreilly</a> nails it on data &amp; privacy <a href=\"https://t.co/RpUdZufR2T\">pic.twitter.com/RpUdZufR2T</a></p>\n<p>— Alec Stapp (@AlecStapp) <a href=\"https://twitter.com/AlecStapp/status/1364907677344792582?ref_src=twsrc%5Etfw\">February 25, 2021</a></p></blockquote>\n<p></p>\n<blockquote>\n<p>When you run the numbers, it’s obvious that an individual’s data just isn’t that valuable: <a href=\"https://t.co/xMQoFyyceZ\">pic.twitter.com/xMQoFyyceZ</a></p>\n<p>— Alec Stapp (@AlecStapp) <a href=\"https://twitter.com/AlecStapp/status/1365029389210185729?ref_src=twsrc%5Etfw\">February 25, 2021</a></p></blockquote>\n<p></p>\n<p>O’Reilly บอกว่าวาทกรรม “Data is the new oil” มีความหมายดั้งเดิมว่า มันต้องเอาไปกลั่นก่อนถึงใช้งานได้ แต่คนมักไปเข้าใจผิดว่าเป็นบ่อน้ำมันที่นำใส่ถังแล้วไปขายออกได้ทันที เหมือนในยุคตื่นน้ำมันในอดีต</p>\n<p>เขาจึงเสนอแนวคิดว่า “Data is the new sand” ขึ้นมาแทน เห็นภาพกว่า ทรายเป็นกองๆ อยู่แทบไร้ราคา จนกว่าเราจะนำไปหลอมมันเป็นแก้วถึงมีมูลค่าเกิดขึ้นตามมา</p>\n<p>ประเด็นอยู่ที่การหลอมทรายเป็นแก้ว หรือซิลิคอนที่มีมูลค่ามหาศาล ต้องผ่านกระบวนการผลิตขนาดใหญ่ที่มีราคาแพงมากด้วย</p>\n<p>ถ้าเทียบกลับมายัง data เราจึงเห็นว่าการสร้างมูลค่าจาก data จำเป็นต้องผ่านกระบวนการขนาดใหญ่ระดับกูเกิล (crawl หน้าเว็บหลักหลายพันล้านหน้า) หรือ เฟซบุ๊ก (มีผู้ใช้งานในระบบหลักพันล้านคน) ถึงเกิดเป็นมูลค่าขึ้นจาก data ที่เก็บไป</p>\n<p>และ “มูลค่ามหาศาล” ที่ว่านี้เป็นมูลค่าของทั้งบริษัทรวมกัน หากเราลองถอดตัวเลขกลับมาเป็นมูลค่าต่อคน ก็ไม่ได้มากมายสักเท่าไรอยู่ดี เช่น ถ้าดูตัวเลข ARPU (average revenue per user) ของเฟซบุ๊ก อยู่ที่ 29.25 ดอลลาร์ต่อปีเท่านั้น แถมตัวเลขนี้คือรายได้ที่ยังไม่ได้หักต้นทุนแล้ว</p>\n<div><img src=\"https://markpeak.net/wp-content/uploads/2021/09/facebook-arpu.png\" /><p>ตัวเลข ARPU ของ Facebook (รายไตรมาส)</p></div>\n<p>ถ้าลองประเมินดูว่าเฟซบุ๊กทำกำไรจากผู้ใช้เท่าไร (อิงจากอัตรากำไรหรือ margin ของเฟซบุ๊กที่ 26%) ก็อยู่ที่ 7.5 ดอลลาร์ต่อคนต่อปี</p>\n<p>หากเรากลับมาที่วาทกรรม “บริษัท x ให้เราใช้บริการนี้ฟรี เพราะจะทำเงินด้วยการนำข้อมูลของเราไปขาย”</p>\n<p>สมมติว่าบริษัท x เป็นสตาร์ตอัพไทยแห่งหนึ่ง มีลูกค้า 10 ล้านคน (ถือว่าใหญ่มากๆ แล้วสำหรับบริษัทไทย ระดับเดียวกับ online banking ของไทยแล้ว) นำข้อมูลลูกค้าไปขาย โดยประเมินว่ามีความสามารถทำเงินเก่งระดับเฟซบุ๊ก บริษัทจะมีรายได้จากการขายข้อมูลที่ประมาณ 300 ล้านดอลลาร์ต่อปี</p>\n<p>ถ้าประเมินแบบที่พอเป็นไปได้ขึ้นมาอีกหน่อย สตาร์ตอัพไทยมีลูกค้า 1 ล้านคนถือว่าโคตรเก่งแล้ว นำข้อมูลลูกค้าไปขายที่ความเก่งระดับ 1/3 ของเฟซบุ๊ก (ขายข้อมูลได้ชุดละ 10 ดอลลาร์ หรือ 300 บาท) จะมีรายได้ 10 ล้านดอลลาร์ต่อปี หรือ 300 ล้านบาท ถือว่าค่อนข้างพอใช้ได้อยู่</p>\n<p>ถ้าลองนำบริษัททั่วๆ ไปที่มีลูกค้าสัก 1 แสนราย ความเก่งสัก 1/10 ของเฟซบุ๊ก (ขายข้อมูลลูกค้าได้ชุดละ 3 ดอลลาร์หรือ 100 บาท) รายได้จากการขายข้อมูลจะอยู่ราว 3 แสนดอลลาร์ต่อปี หรือประมาณ 10 ล้านบาท จะเห็นว่าเริ่มไม่พอกินแล้วสำหรับบริษัทเทคโนโลยี ที่มีความคาดหวังเรื่องรายได้เยอะกว่านี้</p>\n<p>อันนี้คือประเมินตัวเลขคร่าวๆ เท่านั้นด้วย เพราะในโลกความจริงแล้วก็มีคำถามอื่นๆ อีกว่า ขายให้ใคร ใครคือผู้ที่จะนำข้อมูลที่ขายไปใช้ประโยชน์ได้ต่อ ซึ่งเป็นสิ่งที่ต้องตั้งคำถามอีกมาก</p>\n<p>โมเดลทำเงินในโลกนี้มีอยู่ไม่กี่แบบ ขายของเป็นชิ้น, ขายบริการที่จ่ายต่อเนื่อง, ให้ใช้ฟรีมีโฆษณา, ปล่อยกู้แล้วกินดอก ฯลฯ ทุกแบบสามารถทำเงินได้ทั้งหมดถ้าคุณเก่งจริงๆ (และแน่นอนว่ามีบริษัทไทยเก่งๆ หลายรายที่มีรายได้มากกว่านี้)</p>\n<p>โพสต์นี้ไม่ได้สื่อว่า data ไม่มีประโยชน์เลย เพราะเราสามารถนำ data ไปทำประโยชน์ “ทางอ้อม” ได้มากมาย เช่น ปรับปรุงคุณภาพของผลิตภัณฑ์หรือบริการ เพื่อให้ลูกค้ายอมเสียเงินให้เรา (ผ่านโมเดลการทำเงินอื่น) ได้ดีขึ้น</p>\n<p>แต่การไม่มีโมเดลทำเงินอื่นๆ แล้วหวังจะหารายได้จาก “การขาย data” เพียงอย่างเดียว ต้องบอกว่ามันคือจินตนาการของคนที่ไม่เคยทำธุรกิจจริงๆ</p>The post <a href=\"https://markpeak.net/data-is-the-new-sand/\">Data Is the New Sand</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"a9574b8a60fe5c18b35b27957e046649536b7a009d652b036a5aae375395e3bb","category":"Thai"}