{"title":"Dead by Daylight โดนด่ายับ หลังเตรียมขายโมเดลจาก DLC Hellraiser เป็น NFT","link":"https://www.blognone.com/node/125350","date":1634630939000,"content":"<div><div><div><p>Behaviour Interactive ทีมสร้าง Dead by Daylight และ Park Avenue Entertainment ผู้ถือลิขสิทธิ์ Hellraiser ปัจจุบัน ร่วมมือกับ Boss Protocol ทีมสร้าง NFT นำโมเดลตัวละครและลูกบาศก์ Lament Configuration จาก DLC Hellraiser มาขายเป็น NFT โดยเริ่มเปิดให้<a href=\"https://bossprotocol.io/\">ลงทะเบียนด้วยอีเมลในเว็บไซต์</a> และเตรียมเปิดขายในเร็วๆ นี้</p>\n<p>แฟนเกมหลายส่วนไม่พอใจเรื่องนี้ และพิมพ์ตอบโต้<a href=\"https://twitter.com/DeadByBHVR/status/1450160150753562624\">ในโพสต์โปรโมตของทีมงานในทวิตเตอร์</a> เนื่องจากปัจจุบัน การสร้างและแลกเปลี่ยน NFT ยังเป็นกระบวนการที่ใช้พลังงานสูง เพราะต้องใช้คอมพิวเตอร์จำนวนมากในการประมวลผลการทำธุรกรรมบนบล็อกเชน (ระบบ Proof of Work) และเป็นกระบวนการที่ส่งผลกระทบต่อสิ่งแวดล้อม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/05e49dec3d9fa5c547e9486550d6633d.jpg\" /></p>\n<p>นอกจากนี้ Clive Barker ผู้เขียน Hellraiser ต้นฉบับ ก็<a href=\"https://www.hollywoodreporter.com/business/business-news/hellraiser-writer-reclaiming-u-s-franchise-rights-after-lawsuit-settlement-4098688/\">เพิ่งจะชนะคดีลิขสิทธิ์</a>จาก Park Avenue Entertainment แต่ลิขสิทธิ์จะกลับไปอยู่กับเขาในเดือนธันวาคม ทำให้หลายคนมองว่านี่เหมือนเป็นการหากินเฮือกสุดท้ายของ Park Avenue Entertainment</p>\n<p>ตราบใดที่การสร้างและแลกเปลี่ยนโทเค่น NFT บนบล็อกเชนในปัจจุบัน ยังเป็นกิจกรรมที่ใช้พลังงานสูง และส่งผลกระทบต่อสิ่งแวดล้อม ผู้สร้างและแลกเปลี่ยน NFT คงไม่สามารถหนีคำวิจารณ์นี้ได้ จนกว่า NFT กระแสหลักจะปรับไปใช้ระบบอื่นที่ใช้พลังงานต่ำ และเป็นมิตรต่อสิ่งแวดล้อมมากกว่านี้</p>\n<p>ที่มา - <a href=\"https://kotaku.com/dead-by-daylight-is-selling-some-stupid-hellraiser-nfts-1847888652\">Kotaku</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dead-by-daylight\">Dead by Daylight</a></div><div><a href=\"/topics/nft\">NFT</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a959f346bbf44b0d629e26674a5566e84aef3517cf06d593c4a74cedf30b688c","category":"Thai"}