{"title":"Outcomes of Colonic and Gastric Tube Transplants after Caustic Esophageal Burn in Children: A 33-Year Review","link":"https://www.preprints.org/manuscript/202407.1175/v1","date":1721091191000,"content":"Background: Accidental caustic burns of the esophagus in children represent a significant global health challenge, often necessitating esophageal reconstruction. The aim of this study is to compare the efficacy and morbidity related to esophagus replacement with colonic and gastric tube transplants in a pediatric population followed for caustic stenosis. Method: This retrospective study was conducted at a tertiary pediatric surgery unit for children treated from January 1989 to December 2022. We compared colonic and gastric tube esophageal replacement. Short-term (within 30 days) and mid-term outcomes and complications were reviewed. Statistical evaluation was considered using a Chi-square test for categorical data analysis. Results: A total of 124 children with caustic esophageal burns were included. Among them, 23 (18.5%) had a gastric tube transplant for esophagus replacement and 101 (81.5%) a colonic transplant. During surgical intervention, we found a significantly higher risk of complications when using a colonic transplant (34%, p &lt; 0.001). There was no significant statistical difference in postoperative short-term and mid-term complications between the two techniques. Twenty-six (26%) of the children required a reoperation, with a higher risk in the gastric tube transplant group (p &lt; 0.001). Endoscopic dilatation after surgery was also performed on a higher number of children who had received a gastric tube transplant (p = 0.005). Overall, 97.6% recovered full normal oral feeding. Conclusions: We found that colonic and gastric tube replacement are both good options for pediatric esophageal replacement after a caustic injury and show effectiveness over time. Gastric tube transplants carried a slightly higher risk of reoperations and a higher number of dilatations post-surgery. However, our groups are not really comparable due to the much higher number of colonic transplants. Both surgical options have to be considered during surgery and the choice depends on the anatomy of the patient. Our future research will focus on assessing long-term quality of life and potential risk of neoplastic complications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a95bd34ab49421ebf00d16e09e7574de9e7c729e4ad537ca5e30a6031d22000d","category":"Interdisciplinary"}