{"title":"Scott Pilgrim Takes Off","link":"https://markpeak.net/scott-pilgrim-takes-off/","date":1701853537000,"content":"<p><em>[มีสปอยล์เนื้อเรื่อง]</em></p>\n<p>ในฐานะคนที่ติดตามวงการเกม-คอมิกของอเมริกา ย่อมเคยได้ยินชื่อซีรีส์ Scott Pilgrim มาบ้าง (ขวัญใจชาว PAX West) แต่ก็ไม่เคยได้สัมผัสมาก่อนเลย จนกระทั่ง Netflix ออกซีรีส์แอนิเมชัน Scott Pilgrim Takes Off ความยาวรวม 8 ตอนมาให้ดูกัน</p>\n<p>ต้องเล่าย้อนก่อนหน่อยว่า ซีรีส์ Scott Pilgrim มีทั้งหมด 4 เวอร์ชัน ในสื่อที่แตกต่างกันไป</p>\n<ul>\n<li><strong>คอมิกต้นฉบับ (2004-2010)</strong> วาดโดย Bryan Lee O’Malley นักวาดชาวแคนาดาผู้ให้กำเนิดซีรีส์</li>\n<li><strong>Scott Pilgrim vs. the World</strong> หนังคนแสดงปี 2010</li>\n<li><strong>Scott Pilgrim vs. the World: The Game</strong> วิดีโอเกมปี 2010</li>\n<li><strong>Scott Pilgrim Takes Off</strong> ซีรีส์แอนิเมชันปี 2023</li>\n</ul>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/12/scott-2.jpg\" width=\"800\" height=\"450\" srcset=\"https://markpeak.net/wp-content/uploads/2023/12/scott-2.jpg 800w, https://markpeak.net/wp-content/uploads/2023/12/scott-2-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/12/scott-2-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/12/scott-2-700x394.jpg 700w\" /></p>\n<p>โครงเรื่องทั้งหมดนั้นเหมือนกันตามฉบับคอมิก เนื้อเรื่องแบบย่อๆ คือ Scott Pilgrim วัยรุ่นหนุ่มอายุ 20 ต้นๆ ชาวโตรอนโต บังเอิญไปปิ๊งสาวอเมริกันที่เพิ่งย้ายมาชื่อว่า Ramona Flowers เลยไปตามจีบเธอ ชวนเธอไปดูวงดนตรีที่เขาเล่น แต่ก็ค้นพบว่า Ramona เคยมีแฟนมาแล้วทั้งหมด 7 คน ที่รวมตัวกันเป็นแก๊งชื่อว่า The League of Evil Exes ดังนั้นหาก Scott ต้องการเป็นแฟนกับ Ramona ก็จะต้องเอาชนะทั้ง 7 คนให้ได้ก่อน</p>\n<p>เรื่องนี้จึงเป็นการต่อสู้ของ Scott กับแฟนเก่าทั้ง 7 โดยอิงตามธีมวิดีโอเกมแนวต่อสู้ (พวก Street Fighter) มีกลิ่นอายของวัยรุ่นอเมริกันยุค 2000s ที่ได้อิทธิพลจากเกม ดนตรี อนิเมะญี่ปุ่น มีความเป็นการ์ตูน superpower สูง เพี้ยนหน่อยๆ (จริงๆ คือไม่หน่อย) แต่ก็ตลกดี ทำให้ซีรีส์ Scott Pilgrim กลายเป็น cult ที่มีคนติดตามเป็นจำนวนมาก</p>\n<p>เมื่อ Scott Pilgrim ถูกดัดแปลงเป็นซีรีส์แอนิเมชันอีกรอบ จึงมีโจทย์ว่าจะดัดแปลงอย่างไร? คำตอบที่ได้ถือว่าน่าตกใจทีเดียว</p>\n<p></p>\n<p>เบื้องหลังการสร้าง Scott Pilgrim Takes Off นั้นมี Bryan Lee O’Malley ผู้สร้างซีรีส์มาเป็นผู้เขียนบทและโปรดิวเซอร์ด้วย ตอนแรกนั้น O’Malley ไม่สนใจทำสักเท่าไรนัก เพราะเรื่องมันซ้ำเดิม แต่ภายหลังเขาได้ไอเดียใหม่ จึงไปนำเสนอ Netflix แล้วผ่าน ได้ทุนสร้างมา</p>\n<p><a href=\"https://www.netflix.com/tudum/articles/scott-pilgrim-takes-off-animation\">งานภาพทำโดยสตูดิโอฝั่งญี่ปุ่น Science Saru</a> ที่เคยทำงานฝั่งตะวันตกมาบ้าง (เช่น Adventure Time หรือ Star Wars Vision) โดยนักพากย์เสียงนั้นได้นักแสดง Scott Pilgrim vs. the World ฉบับปี 2010 กลับมาพร้อมหน้า เวลาผ่านมา 13 ปี หลายคนกลายเป็นนักแสดงชื่อดังหรือฮีโร่กู้โลกไปแล้ว เช่น Chris Evans ที่ให้เสียง Lucas Lee แฟนเก่าลำดับสอง ที่กลายเป็น Captain America หรือ Brie Larson ที่ให้เสียง Envy Adams กลายเป็น Captain Marvel</p>\n<p>เนื้อเรื่องของภาค Takes Off เริ่มต้นเหมือนเดิม Scott Pilgrim หนุ่มโตรอนโตไปปิ๊งสาว Ramona เลยชวนเธอไปดูเขาเล่นคอนเสิร์ต ระหว่างที่เล่นดนตรีอยู่บนเวทีก็เจอกับแฟนเก่าคนแรก Matthew  Patel บุกเข้ามาท้าสู้ แต่กลับกลายเป็นว่า Scott Pilgrim เป็นฝ่ายแพ้และสลายตัวไป</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/12/scott-3.jpg\" width=\"800\" height=\"450\" srcset=\"https://markpeak.net/wp-content/uploads/2023/12/scott-3.jpg 800w, https://markpeak.net/wp-content/uploads/2023/12/scott-3-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/12/scott-3-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/12/scott-3-700x394.jpg 700w\" /></p>\n<p>ตั้งแต่ตอนที่ 2 ในซีรีส์ จึงเป็นเรื่องในมุมมองของ Ramona ที่กลายเป็นนักสืบ ไปค้นหาว่า Scott ที่ดูเหมือนจะตายไปแล้ว กลับหายตัวข้ามมิติไปแทน เขาหายไปไหน แฟนเก่าคนไหนเป็นคนทำ มันจึงกลายเป็นเรื่องของ Ramona ที่ต้องกลับไปรื้อสัมพันธ์กับแฟนเก่าแต่ละคน (ที่ก็สุดเพี้ยนไปคนละทาง) แต่ละคนมี backstory มีความลึกที่แตกต่างกันออกไป</p>\n<p>จนกระทั่งในตอนที่ 7 ซีรีส์ถึงเฉลยว่า จอมบงการที่แท้จริงคือ Scott Pilgrim ในอนาคตสิบกว่าปีข้างหน้า ที่ได้แต่งงานกับ Ramona แล้วแต่สุดท้ายเลิกรากันไป ด้วยความเจ็บปวดจึงย้อนเวลากลับมาแก้ไขเหตุการณ์ในอดีต ให้ตัวเขาเองกับ Ramona ไม่ได้เป็นแฟนกัน (plot twisted จากการ์ตูนวัยรุ่นเพี้ยนๆ กลายเป็นหนังไซไฟดราม่าซะอย่างนั้น) <a href=\"https://www.netflix.com/tudum/articles/scott-pilgrim-takes-off-twist-explained\">Netflix มีบทความอธิบายตอนจบให้หากดูไม่เข้าใจ</a></p>\n<p>ทีมผู้สร้างแอนิเมชัน อธิบายว่านี่คือ alternate-reality sequel คือเป็นภาคต่อในโลกคู่ขนานอีกที เพื่อให้ทีมผู้สร้าง (ชุดเดิม) สามารถตีความตัวละครได้ใหม่ (<a href=\"https://variety.com/2023/tv/news/scott-pilgrim-takes-off-interview-spoilers-1235802924/\">บทสัมภาษณ์ใน Variety</a>)</p>\n<p>เนื่องจากไม่เคยดูภาพยนตร์ฉบับปี 2010 เลยไม่ได้มีความคุ้นเคยกับตัวละครอยู่ก่อน การมาดูเวอร์ชันตีความใหม่เลยทันทีอาจไม่อินมากนัก (คือรู้สึกว่าเออ เจ๋งดี แต่ไม่ถึงขนาดชอบสุดๆ) แต่ในด้านกลับ ก็มีแฟนๆ ฉบับภาพยนตร์จำนวนมากที่รับไม่ได้กับการเปลี่ยนแปลงในเวอร์ชันตีความใหม่เหมือนกัน (<a href=\"https://kotaku.com/scott-pilgrim-takes-off-netflix-ramona-backlash-1851043407\">สรุปใน Kotaku</a>)</p>\n<p>ภาพรวมคือดูได้สนุกดี เพลินๆ มีเพี้ยนๆ มาแทรกบ้าง งานภาพพยายามปรับดีไซน์ไปทุกตอน แถมความยาวไม่สั้นคือตอนละ 20 นาทีนิดๆ กำลังดี ดูได้ไม่เหนื่อยมากเกินไป</p>The post <a href=\"https://markpeak.net/scott-pilgrim-takes-off/\">Scott Pilgrim Takes Off</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"a962c5e8b179cbbd7ca323ef43c4a947e94f6194178c761a41f98123b9e51576","category":"Thai"}