{"title":"Pulse Oximetry Company Masimo Wants the Apple Watch Series 6 Banned","link":"https://www.macrumors.com/2021/06/30/masimo-apple-watch-series-6-itc-import-ban/","date":1625072104000,"content":"Medical device company Masimo is embroiled in an ongoing legal battle with Apple over several of the health capabilities available in the Apple Watch, and now Masimo wants the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a> banned, reports <em><a href=\"https://www.bloomberg.com/news/articles/2021-06-30/apple-watch-should-be-blocked-from-import-to-u-s-masimo-claims\">Bloomberg</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/09/apple-watch-series-6-blood-oxygen-monitoring-1.jpg\" />\r\n<br />\r\nMasimo today filed a new patent infringement lawsuit with the United States International Trade Commission, which asks the ITC to halt imports of the ‌Apple Watch Series 6‌. According to Masimo, the ‌Apple Watch Series 6‌ infringes on five Masimo patents related to blood oxygen monitoring.\r\n<br />\r\n\r\n<br />\r\nMedical grade pulse oximetry devices are what Masimo specializes in, and pulse oximetry is a feature that Apple added to the Apple Watch with the Series 6 model. The Apple Watch uses light to detect the amount of oxygen in the blood, with the feature joining heart rate monitoring and ECG capabilities.\r\n<br />\r\n\r\n<br />\r\nMasimo initially <a href=\"https://www.macrumors.com/2020/09/29/masimo-apple-delaying-lawsuit-apple-watch/\">sued Apple</a> in January 2020, accusing the Cupertino company of stealing trade secrets and improperly using Masimo inventions. Masimo's patents are now being examined by the U.S. Patent and Trademark Office because Apple said they do not cover new inventions, and the case is on hold until that process has been completed.\r\n<br />\r\n\r\n<br />\r\nMasimo has claimed that by getting the court to delay the legal proceedings until the patents are validated, Apple is attempting to sell more Apple Watches. The patent office delay has prompted Masimo to also file with the ITC, as the ITC will not delay the investigation.\r\n<br />\r\n\r\n<br />\r\nITC cases are completed in 15 to 18 months, and because of the speed at which cases are investigated, there won't be time for the patent office to weigh in should Apple also attempt to challenge these claims.\r\n<br />\r\n\r\n<br />\r\nIn the prior filing, Masimo claimed that Apple sneakily poached Masimo employees and used patented Masimo technology when developing the sensors used in the Apple Watch.\r\n<br />\r\n\r\n<br />\r\nMasimo told the ITC that banning the ‌Apple Watch Series 6‌ will not impact the public because the pulse oximetry functionality in the device is \"not essential to the public health or welfare,\" and the Apple Watch's blood oxygen monitoring is not a true medical device.<div>Tags: <a href=\"https://www.macrumors.com/guide/patent-lawsuits/\">Patent lawsuits</a>, <a href=\"https://www.macrumors.com/guide/masimo/\">masimo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/30/masimo-apple-watch-series-6-itc-import-ban/\">Pulse Oximetry Company Masimo Wants the Apple Watch Series 6 Banned</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/pulse-oximetry-company-masimo-wants-the-apple-watch-series-6-banned.2302830/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ytCi3HkBzRI:uV1VfYGFE20:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ytCi3HkBzRI:uV1VfYGFE20:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ytCi3HkBzRI\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a96429edc7d54abace36935369e3d59c33cce54e7d1d875d62d370e79488beb3","category":"Apple"}