{"title":"Exploring the Antidiabetic Potential of Neocarya macrophylla (Nm) Leaf Fractions: A Comprehensive Study on Hypoglycemic Activity, Body Mass Index, and Hematological Parameters in High-Fat Diet/ Streptozotocin-Induced Diabetic Rat","link":"https://www.preprints.org/manuscript/202405.1362/v1","date":1716276026000,"content":"The prevalence of diabetes mellitus (DM) continues to rise globally, posing significant health challenges and burdens. This metabolic disorder, characterized by elevated blood glucose levels, contributes to various complications including cardiovascular diseases, kidney failure, and stroke. While conventional diabetic drugs exist, they often come with adverse side effects, necessitating the exploration of safer and more cost-effective alternatives, particularly from natural sources like medicinal plants. This study investigates the potential of Neocarya macrophylla (Nm) Ethyl acetate leaf fraction in managing DM. Utilizing a high-fat diet/streptozotocin-induced diabetic rat model, the study explores several key aspects including effective dose determination, biological activity, impact on body mass index (BMI), and complete blood count. Statistical analysis was conducted using GraphPad Prism version 9.1. The determination of the minimum effective dose reveals that 120mg/kg of Ethyl acetate fraction of Nm reduced the blood glucose by 28.9% after 4 hours. In addition, ethyl acetate fraction (120 mg/kg) possessed the most hypoglycemic activity compared to the other fractions of Nm. The Ethyl acetate fraction of Nm at 120mg/kg significantly reduced fasting blood glucose levels compared to the diabetic control(p=0.001) and slightly decreased BMI. Furthermore, the fraction demonstrated significant improvement in the parameters of some of the blood count indices such as red blood cells (p&lt;0.001), total white cells (p&lt;0.01) and platelet (p&lt;0.001) compared to the diabetic control. These findings underscore the potential of Nm as a holistic therapeutic option for managing DM and its haematological complications. In conclusion, this study sheds light on the hypoglycemic potential of Nm Ethyl acetate leaf fraction, offering valuable insights into its effectiveness, safety, and broader physiological impacts. Further research into the mechanisms underlying its therapeutic effects is warranted to fully harness its therapeutic potential in diabetes management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a96805d4e745a20b97e1d9b030acbac8a76ef373505b459a197e0830981def8f","category":"Interdisciplinary"}