{"title":"PSVII-8 Survival analyses of the productive life in U.S. Katahdin ewes","link":"https://academic.oup.com/jas/article/102/Supplement_3/441/7757263?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Ewe productive life (PL), defined as the number of days between the first and last lambing, is a common indicator of longevity. This study aimed to analyze the PL of 10,276 Katahdin ewes, of which 69.3% were uncensored and 30.7% were right-censored records. Ewes were daughters of 1,188 sires and 6,312 dams, born between 1989 and 2021 in 58 flocks located across the U.S., and the National Sheep Improvement Program provided the data. Ewes with lambing interval and age at first lambing greater than 720 d and 1,095 d, respectively, were excluded. Moreover, flocks that did not report lambing records across at least 7 consecutive years or did not have an average of 20 or more lambing records over the year were also left out of the analyses. Survival functions were analyzed using the Kaplan-Meyer (KM) and Cox models, while the Hazard function was analyzed using the Cox model. For the Cox model, contemporary group (concatenation of flock, year, and season of ewe’s birth) was fitted as a random effect; the ewe’s BR class (combined effect of birth/rearing types: 1/1, 2/1, 2/2, 3/2, 3/3, with digit-3 including counts ≥ 3), ewe’s age class at first lambing (≤ 378d; 379 to 700d; and &gt; 700 d), and the ewe’s dam’s age class (A: &lt; 713 d; B: 713 to 1,486 d; C: &gt; 1486 d) were fitted as fixed effects. All survival analyses were performed using the Survival R-package. All factors included in the Cox model were highly significant (<span>P</span> &lt; 0.001), except dam age class (<span>P</span> &gt; 0.05). The proportional hazard assumption was checked using a graphical diagnostic based on the scaled Schoenfeld residuals, and there was no failure in the assumption. Moreover, there was no evidence of influential or outlier records in the graphical analysis of the residuals. The Cox survival curve overlapped with the KM survival curve (Figure 1), indicating a good survival prediction with the Cox model. The median PL was 1,036 d (95%CI: 1001 to 1,056 d) with the KM model and 1,056 d (95%CI: 984 to 1,078 d) with the Cox model. The hazard ratio indicated BR levels 2/2 and 3/3 showed less hazards than group 1/1 (Figure 2), and thereby longer PL; no significant difference was observed between 1/1 and the other two levels (2/1 and 2/3). Ewes that first lambed before 378 d had less hazard than those with the first lambing after this age (Figure 2). There was no significant difference between the dam age classes. In conclusion, over 50% of Katahdin sheep have less than 3 yr PL. Moreover, U.S. Katahdin ewes born from larger litters and having the first lambing before 378 d are likelier to have a greater PL.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a971fde414a318297e85a14890882d45e00c3b21e49a64d4de36ca55273ad96b","category":"Environment"}