{"title":"Apple's AR/VR Headset Display Specs: 5000+ Nits Brightness for HDR, 1.41-Inch Diagonal Display and More","link":"https://www.macrumors.com/2023/05/30/apple-ar-vr-headset-display-specs/","date":1685469884000,"content":"The AR/VR headset that Apple plans to introduce at the Worldwide Developers Conference next week has long been rumored to feature 4K micro OLED displays with an 8K total resolution, but notable display analyst Ross Young today <a href=\"https://twitter.com/DSCCRoss/status/1663595816521699331\">shared some additional specifications</a> that give some insight into how the headset will work.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/04/apple-ar-concept-2-ornange.jpg\" alt width=\"1280\" height=\"720\" /><em>Concept render by <a href=\"https://www.macrumors.com/guide/ian-zelbo/\">Ian Zelbo</a></em></div>\r<br />\nEach of the two displays will measure in at 1.41 inches diagonally, with Apple aiming for over 5000 nits of brightness and 4,000 pixels per inch. Unfortunately, AR/VR display specs used in headsets from competitors like Sony and Meta aren't generally advertised beyond resolution and pixels per inch, so it's difficult to make a direct comparison, but the information from Young does provide some context.\r<br />\n\r<br />\nWith ~5000 nits brightness or more, the AR/VR headset from Apple would support HDR or high dynamic range content, which is not typical for current VR headsets on the market. The Meta Quest 2, for example, maxes out around 100 nits of brightness and it does not offer HDR, and the HoloLens 2 offers 500 nits brightness. Sony's PSVR 2 headset has around 265 nits of brightness, and it <em>does</em> have an advertised HDR feature when connected to an HDR display.\r<br />\n\r<br />\n<div><blockquote><p>You want more, I will give you more: Micro OLED specs for Apple's AR/VR headset: <br />1.41\" in diagonal <br />4000 PPI <br />&gt;5000 nits of brightness</p>— Ross Young (@DSCCRoss) <a href=\"https://twitter.com/DSCCRoss/status/1663595816521699331?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote> </div>\r<br />\nAccording to Young, the 5000 nits likely refers to peak brightness, which means that it won't blind users, but will instead provide superior contrast, brighter colors, and better highlights than other headsets that are available today. For SDR displays, peak brightness is often a reference to how well a display will perform in rooms with bright lighting as it is akin to maximum brightness, but for HDR displays, it's a metric of how well a display depicts color and contrast.\r<br />\n\r<br />\nHigh-end TVs offer somewhere around 2,000 to 5,000 nits, for comparison. Samsung, for example, has a 98-inch TV that is able to reach 5,000 nits, along with <a href=\"https://www.samsung.com/us/tvs/neoqled-tv/\">Neo QLED TVs</a> that offer 4,000 nits peak brightness. Samsung advertises these TVs as having \"stunning, accurate color detail and an extraordinary range of contrast, creating a beyond-life-like experience.\"\r<br />\n\r<br />\nMeta CEO Mark Zuckerberg in 2022 <a href=\"https://www.facebook.com/zuck/videos/355247026677540\">showed off</a> a \"Starbursts\" VR headset prototype able to hit 20,000 nits of brightness, but it was enormous, not wearable on the head, and not technology that Meta is able to implement as of yet.\r<br />\n\r<br />\nIf Apple hits that 5000+ nits brightness target, its headset will offer a display experience that competitors are unable to match, and it will also set the stage for future AR glasses. Augmented reality glasses need high brightness to mitigate the light from the sun and other light sources. At lower brightness levels, the AR content that overlays the real world view can be washed out.\r<br />\n\r<br />\nMagic Leap 2, one of the more well-known augmented reality headsets, features brightness ranging from 20 nits to 2000 nits.\r<br />\n\r<br />\nThe 8K resolution offered by Apple's AR/VR headset will be superior to headsets from Meta and other companies, including Meta's highest-end Quest Pro 2. The Quest Pro 2 has a resolution of 1800 x 1920 pixels per eye and around <a href=\"https://displaydaily.com/quantum-dot-and-miniled-can-it-empower-ar-vr-mr-displays-part-1/\">1200 pixels per inch</a> as Meta is using LCD display technology. \r<br />\n\r<br />\nThe high-end displays that Apple has created for the AR/VR headset are rumored to be <a href=\"https://www.macrumors.com/2023/05/19/apple-headset-rumored-to-cost-1500/\">the most expensive component</a> and a major contributor to the expected ~$3,000 price. At $3,000, Apple's AR/VR headset will be one of the more expensive virtual reality headsets on the market, though it will be competitive in price with AR-based products like the Magic Leap 2 and the HoloLens 2.\r<br />\n\r<br />\nMore information on what to expect from Apple's AR/VR headset <a href=\"https://www.macrumors.com/roundup/ar-vr/\">can be found in our dedicated roundup</a>. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ross-young/\">Ross Young</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/30/apple-ar-vr-headset-display-specs/\">Apple's AR/VR Headset Display Specs: 5000+ Nits Brightness for HDR, 1.41-Inch Diagonal Display and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-ar-vr-headset-display-specs-5000-nits-brightness-for-hdr-1-41-inch-diagonal-display-and-more.2390915/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a977887def7b1a95d34eaea93d32ab2e67edfaf4eff07b007cb3b922596a5d44","category":"Apple"}