{"title":"Shayna Powless and 200 miles of Unbound gravel","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/shayna-powless-on-her-preparation-for-unbound-and-a-love-for-the-gravel-roads","date":1624526970000,"content":"\n      <p>“I like the opportunity to push my limits. There's just something about it that it kind of intrigues me.”</p>\n<p><span>Shayna Powless is finally on a rest week after a block of some extremely demanding racing. Her campaign ended with the US National Championships, where she rode all three events: the crit race, the time trial and the road race, bagging two top-15 spots. All of this was still with the fatigue of a top-5 finish in Unbound Gravel in her legs, something that should not be underestimated.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-tech-podcast-unbound-with-alison-tetrick\"><em><strong>Related – Rouleur Podcast: Unbound with Alison Tetrick</strong></em></a></p>\n<p><span>The event consists of 12 gruelling hours of racing in the blazing Kansas City heat, over technical gravel surfaces which required the utmost concentration. This puts riders under serious physical strain. “I think it was the most wrecked my body has felt after any day on the bike,” Shayna says.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00029_1024x1024.jpg?v=1624466855\" /></span></p>\n<p><em><span>Image: Wil Matthews</span></em></p>\n<p><span>But the 27-year-old Californian rider is no stranger to pushing herself to the limits. Growing up with a father who completed IronMan triathlons like they were going out of fashion, 15 in total, and a mother who represented Guam in the 1992 Barcelona Olympics for the marathon, sport is in her blood. She talks about how she and her brother – Neilson Powless, now a professional rider for EF Education first – grew up competing in every discipline under the sun. </span></p>\n<p><span>“We did everything from gymnastics to volleyball, basketball, we even did T-ball when we were really young,” she explains. “I did horseback riding for a couple of years and we did track and field cross country, and swim team, also track and mountain biking, plus a lot of soccer.”</span></p>\n<p><span>It’s clear that Shayna had a natural talent for physical activity and would probably have excelled in any sport she wished to pursue, but she talks about discovering her love for mountain biking in high school. She attended US talent camps and enjoyed travelling to Europe to race as a junior. She won the US U23 National Mountain Bike Championships in only her first year in the category, then discovered road racing when she joined her college cycling team at UCLA.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Shayna-Powless_1024x1024.jpg?v=1624525481\" /></span></p>\n<p><em><span>Twenty24 counts <a href=\"https://go.skimresources.com?id=173655X1642184&amp;xs=1&amp;url=https%3A%2F%2Flecol.cc%2F\" target=\"_blank\">Le Col</a> amongst their sponsors</span></em></p>\n<p><em><span>Image: </span></em><em><span><span>Barbara Kreisle</span></span></em></p>\n<p><span>“It wasn't until the end of college after I graduated that I transitioned from mountain biking primarily to primarily road racing,” she explains. “A big part of that reason was that I just wanted to try something new. I also am kind of infatuated with the teamwork aspect of road racing versus mountain biking. Mountain biking is still my first love, though.”</span></p>\n<p><span>Seeking out new challenges is clearly the part of the driving force behind Shayna’s pursuit of success. She speaks about racing in a way which conveys her passion for the sport, explaining how she loves every aspect of cycling, and will try out any discipline she can. Gravel racing was perhaps the perfect answer for the American cyclist, the rocky terrain harks back to her mountain biking days, but the use of gravel bikes likens it to road racing.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/shayna-MTB-lg_1024x1024.jpg?v=1624467761\" /></span></p>\n<p><span>“Unbound was something that I had never really considered doing before until late last year when our team started talking about maybe doing it if we could get in,” she says. “I knew it was going to be a crazy long day. I mean, I had never been on a bike for that long before. I did mountain biking from such a young age, so I feel like that definitely kind of helped me transition well from road to gravel this year.”</span></p>\n<p><span>When it was confirmed that Shayna’s team, Team Twenty24, would be racing Unbound, her training had to be optimised to prepare her for the 200-mile stint she would face in a few months time. Riding the full distance in a race stimulation in training was going to be difficult, so Shayna and her coach got creative with new ways to build up her endurance.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Le_Col_banner_9b5e3d00-9ae0-4178-a321-79a9d875c6a1_1024x1024.jpg?v=1624526804\" /></span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\">Discover Rouleur's women's newsletter</a></strong></em></p>\n<p><span>She talks about how she’d time her training for the hottest part of the day, aware that Unbound would be in intense heat. “For really heavy blocks, I would do a longer ride later in the day, like five hours or something like that and then wake up early and do another five hour ride, just to kind of minimize that recovery time.”</span></p>\n<p><span>Back in March this year, Shayna took victory in the True Grit Gravel race, something that was also key in her preparation. She explains that, at six hours in length, she thought that True Grit was the hardest day she would face on the bike, until the 12 hours at Unbound took the biscuit. The conditions at True Grit couldn’t have been further from those at Unbound: blizzards and freezing temperatures meant only 27 riders completed the event. Shayna finished 6th in the men’s race, as well as taking victory in the women’s category.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/shayna-true-grit-snow_1024x1024.jpg?v=1624467438\" /></span></p>\n<p><span>There were some crucial learnings to be taken away from True Grit into Unbound Gravel later that year, and Shayna was able to perfect her kit choices based on what had worked for her back in March. “I had three bags on my bike: the top two bags for my bars and my gels so it was super easy to just reach down and grab stuff out of there,” she explains.”The other thing that was different which I did for Unbound was having three bottle cages on the bike just because it was such a long race.”</span></p>\n<p><span>Fuelling strategy is an important part of any ultra-endurance event, and Shayna explains this was one of her biggest challenges. “It was just so hard to get stuff down,” she says. “I feel like I learned what was easier to eat than other things. So I think if I go back to do this event next year, I'll probably change my food, maybe I’d go from cheeseburgers and sandwiches to softer types of foods that would be easier to go down, but still have a good amount of substance to them.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00014_1024x1024.jpg?v=1624466995\" /></span></p>\n\n<p><span><em>Image: Wil Matthews</em></span></p>\n<p><span>Riders are expected to be mostly self-sufficient in Unbound Gravel, carrying their own tools and spares in case something goes wrong in between the two aid-stations situated on the route. Shayna explains she had a pretty smooth race, with no punctures and her only mechanical being her chain dropping. Such a trouble-free ride is relatively unheard of in Unbound, where riders are often seen repairing innertubes by the side of the track. She puts it down to plenty of thought behind her tire choices, opting for the Kenda Flintridge which has a bigger tread to deal with the rugged terrain.</span></p>\n<p><span>The high temperatures were also a crucial factor, hydration and clothing choice being important considerations when battling through the muggy heat. “We have <a href=\"https://go.skimresources.com?id=173655X1642184&amp;xs=1&amp;url=https%3A%2F%2Flecol.cc%2F\" target=\"_blank\">Le Col</a> kit, which I train in every day at home,” she explains. Being comfortable with her kit is imperative for a race of such distance. “It needs to fit super well and be very breathable during hot days.” Constantly drinking an electrolyte mix from her Camelbak ensured Shayna was taking on enough calories and salts.</span></p>\n<p><span>Fuelled by watermelon Sour Patch Kids sweets and mini peanut butter and jam sandwiches (“it’s crazy what your body can crave”). </span>“Crossing the finish line really was the most rewarding feeling I've ever had in a race before,\" Shayna says. That's partly because of the race's brutal parcours over the 12-hour race. “I think the amount of climbing during the race made it an extra challenge – there were no significantly long climbs but it was just like constant ups and downs and rolling hills,” she says. Naturally, she wants to return and better the result in an upcoming edition.</p>\n<p><span></span><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00387A_1024x1024.jpg?v=1624466781\" /></span></p>\n\n<p><em><span>Image: Wil Matthews</span></em></p>\n<p>The American rider’s love for personal challenge makes Team Twenty24 the perfect place for her to develop. It’s a team with a fresh and open approach to cycling, encouraging their riders to try every discipline, be it gravel, road, track or Zwift. </p>\n<p><span>“I really feel like we are such a diverse program,” Shayna explains. “Arguably more diverse than any other women's program in the US at the moment, so it is a very special team. It’s just super fun to mix it up throughout the year, especially with how COVID has been this past year and the lack of real life racing. It keeps fuel to the fire.”</span></p>\n<p><span>Shayna speaks about the future and the races her and the team have coming up: “I will be racing a couple of crit races, one in Boise, Idaho next month and then the weekend after in Salt Lake City, Utah,” she says. “Crits are actually one of my favorite types of races today just because they’re so fast and fun. After that, we have a couple more gravel races as well, maybe Steamboat and maybe Big Sugar.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1O8A1081_1024x1024.jpg?v=1624467873\" /></span></p>\n<p><span>The calendar is COVID -19 restrictions dependent, but Shayna hopes to do some stage races in both road and gravel too as the season continues. It already sounds like a pretty busy couple of months, with enough race days to make us mere mortals feel exhausted just thinking about it. </span></p>\n<p><span>We have a feeling that mental exhaustion isn't part of Shayna's repertoire, though. “I'm also hoping to get an invite to do some track camps at the Olympic Training Center in Colorado Springs later this year,” she explains, throwing yet another discipline into the fold. “Because yeah, who knows, I might try and go to the 2024 Olympics on the track.” </span></p>\n<p><span>When it comes to bikes, there really is no stopping her.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a9796ebe4e9234d994c53752e66c982e93c4684c5198a1720093ca9fe434a366","category":"Cycling"}