{"title":"Corellium Launching New Initiative to Hold Apple Accountable Over CSAM Detection Security and Privacy Claims","link":"https://www.macrumors.com/2021/08/17/corellium-new-initiative-apple-csam-claims/","date":1629189327000,"content":"Security research firm Corellium <a href=\"https://www.corellium.com/blog/open-security-initiative\">this week announced</a> it is launching a new initiative that will \"support independent public research into the security and privacy of mobile applications,\" and one of the initiative's first projects will be Apple's recently announced CSAM detection plans.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/10/appleprivacyad.jpg\" />\r\n<br />\r\nSince its announcement earlier this month, Apple's plan to scan <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users' photo libraries for CSAM or child sexual abuse material has received considerable backlash and criticism. The majority of concerns revolve around how the technology used to detect CSAM could be used to scan for other types of photos in a user's library, possibly at the request of an oppressive government.\r\n<br />\r\n\r\n<br />\r\nApple will check for CSAM photos on a user's photo library by comparing the hashes of a user's pictures to a database of known CSAM images. The company has firmly pushed back against the idea that it will allow governments to add or remove images to that database, refuting the possibility that embodiments other than CSAM may get flagged if found in a user's <a href=\"https://www.macrumors.com/guide/icloud-photo-library/\">iCloud Photo Library</a>.\r\n<br />\r\n\r\n<br />\r\nIn <a href=\"https://www.macrumors.com/2021/08/13/federighi-confusion-around-child-safety-details/\">an interview</a> with <em>The Wall Street Journal</em>, Apple's senior vice president of software engineering, Craig Federighi, said that the on-device nature of Apple's CSAM detection method, compared to others such as Google who complete the process in the cloud, allows security researchers to validate the company's claim that the database of CSAM images is not wrongly altered.\r\n<br />\r\n<blockquote>Security researchers are constantly able to introspect what's happening in Apple's software, so if any changes were made that were to expand the scope of this in some way—in a way that we had committed to not doing—there's verifiability, they can spot that that's happening.</blockquote> Corellium's new initiative, called the \"Corellium Open Security Initiative,\" aims to put Federighi's claim to the test. As part of the initiative, Corellium will award security researchers a $5,000 grant and free access to the Corellium platform for an entire year to allow for research.\r\n<br />\r\n\r\n<br />\r\nCorellium believes that this new initiative will allow security researchers, hobbyists, and others to validate Apple's claims over its CSAM detection method. The security research firm, which just recently <a href=\"https://www.macrumors.com/2021/08/11/apple-corellium-lawsuit-settlement/\">settled its long-lasting dispute with Apple</a>, says it applauds Apple's \"commitment to holding itself accountable by third-party researchers.\"\r\n<br />\r\n<blockquote>We hope that other mobile software vendors will follow Apple's example in promoting independent verification of security and privacy claims. To encourage this important research, for this initial pilot of our Security Initiative, we will be accepting proposals for research projects designed to validate any security and privacy claims for any mobile software vendor, whether in the operating system or third-party applications. </blockquote>Security researchers and others interested in being part of the initiative have until October 15, 2021, to apply. More details can be found <a href=\"https://www.corellium.com/blog/open-security-initiative\">on Corellium's website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-child-safety-features/\">Apple child safety features</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/17/corellium-new-initiative-apple-csam-claims/\">Corellium Launching New Initiative to Hold Apple Accountable Over CSAM Detection Security and Privacy Claims</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/corellium-launching-new-initiative-to-hold-apple-accountable-over-csam-detection-security-and-privacy-claims.2307781/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=rL0dzDwhODM:B9Yf3LC93BA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=rL0dzDwhODM:B9Yf3LC93BA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/rL0dzDwhODM\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a9890ffadab5cfb95a213a02d65613953254a47328f4f75b97a5ec8242a04df9","category":"Apple"}