{"title":"Huawei officially replaces Android with HarmonyOS, which is also Android","link":"https://arstechnica.com/?p=1769115","date":1622671551000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/chrome_DkLHHq7vhY-980x551.png\" /></div>\n        <p>\n          The Huawei iPad Pro.                       [credit:\n                        <a href=\"https://www.huawei.com/us/\">Huawei </a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>This morning in a livestream, Huawei officially kicked off the launch of Harmony OS, its in-house operating system and (among other things) its replacement for Android. The company announced a new watch, a new tablet, and a new phone powered by HarmonyOS. The company also said it would be updating a massive list of 100 different Huawei Android phone models to Harmony OS over the next year.</p>\n<p>With today's announcement, Huawei looks like it has two completely different operating systems that it calls \"HarmonyOS.\" First is the IoT and smartwatch version of HarmonyOS, which is based on Huawei's LiteOS and is <a href=\"https://openharmony.gitee.com/\">open source.</a> The second version of Harmony OS is for phones and tablets and is a fork of Android and uses the Linux kernel (Huawei is very reluctant to admit this). Having what seems like two totally different operating systems share the same brand name leads to a lot of confusion, and you can make a lot of claims about the IoT version of HarmonyOS that don't apply to the phone version.</p>\n<p>For instance, <a href=\"https://techcrunch.com/2021/06/02/huawei-officially-launches-android-alternative-harmonyos-for-smartphones/\">TechCrunch</a> spoke to Huawei and reported \"Huawei denied speculations that HarmonyOS is a derivative of Android and said no single line of code is identical to that of Android. A spokesperson for Huawei declined to say whether the operating system is based on Linux, the kernel that powers Android.\" This statement is true of the IoT version but untrue of the phone version. Meanwhile, the company said the complete opposite thing to the German site ComputerBase, which quotes Huawei's software president as saying \"To make sure our existing users can still enjoy the experiences that they are familiar with in our phones and tablets, Huawei uses the open source code from AOSP in HarmonyOS on the condition of complying with open source license rules and fulfilling related responsibilities and obligations.\"</p></div><p><a href=\"https://arstechnica.com/?p=1769115#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769115&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a98cde45e4efa70c54670ce748b97dad29d37573eadf2d5b4986b8fbe723b94f","category":"Tech"}