{"title":"$5,000 Google Jamboard dies in 2024—cloud-based apps will stop working, too","link":"https://arstechnica.com/?p=1972006","date":1695939071000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/1-980x456.webp\" alt /></div>\n          <p>\n            The Google Jamboard was a big, red touchscreen.                       </p>\n        </div>\n      </li>\n      </ul>\n\n<p><a href=\"https://arstechnica.com/gadgets/2023/09/this-weeks-dead-google-products-google-podcasts-basic-gmail-and-more/\">Even more</a> Google products are getting the ax this week. Next up is Google Jamboard, a $5,000 digital whiteboard (and its $600-a-year fee) and software ecosystem marketed to schools and corporations. Google has a new post detailing the <a href=\"https://workspace.google.com/blog/product-announcements/next-phase-digital-whiteboarding\">\"Next phase of digital whiteboarding for Google Workspace</a>,\" and the future for Jamboard is that there is no future. In \"<span>late 2024,\" the whole project will shut down, and we don't just mean the hardware will stop being for sale; the cloud-based apps will stop working, too.</span></p>\n<p>Most people probably haven't ever heard of Jamboard, but this was a giant <a href=\"https://static.googleusercontent.com/media/workspace.google.com/en//files/Jamboard_Specs.pdf\">55-inch, 4K touchscreen</a> on a rolling stand that launched in 2016. Like most Google touchscreens, this <a href=\"https://www.pcmag.com/reviews/google-jamboard#:~:text=Jamboard%20combines%20Google%20G%20Suite,Marshmallow%20operating%20system%20(OS).\">ran Android</a> with a locked-down, custom interface on top instead of the usual phone interface. The digital whiteboard could be drawn on using the included stylus or your fingers, and it even came with a big plastic \"eraser\" that would remove items. The SoC was an Nvidia Jetson TX1 (a quad-core Cortex-A57 CPU attached to a beefy Maxwell GPU), and it had a built-in camera, microphone, and speakers for video calls. There was HDMI input and Google cast support, and it came in whimsical colors like red, gray, and blue (it feels like Google was going for an <a href=\"https://www.youtube.com/watch?v=awZv4Ok4rlc\">iMac rainbow</a> and quit halfway).</p>\n<p>Google's secret sauce here was that Jamboard was heavily integrated with Google Workspace, so it could pull in items from Google Docs, Sheets, and Slides, and all your whiteboard work was saved in a filetype called \"Jams\" in the usual Google storage. Like the other Workspace apps, this all worked live over the Internet. People not in front of the touchscreen could launch the \"Jamboard app\" instead, letting them get in on the whiteboard action remotely, complete with live handwriting.</p></div><p><a href=\"https://arstechnica.com/?p=1972006#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972006&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a98e80e19a81a542c2599a2e8a9211d3a4c328c050d3f3a3f75b6126ddf8b2d5","category":"Tech"}