{"title":"Antiviral discovery in toxic cyanobacteria: Low hanging fruit in the age of pandemics","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13425?af=R","date":1704355200000,"content":"<h2>Abstract</h2>\n<p>The power of novel vaccination technologies and their rapid development were elucidated clearly during the COVID-19 pandemic. At the same time, it also became clear that there is an urgent need to discover and manufacture new antivirals that target emerging viral threats. Toxic species of cyanobacteria produce a range of bioactive compounds that makes them good candidates for drug discovery. Nevertheless, few studies demonstrate the antiviral potential of cyanobacteria. This is partly due to the lack of specific and simple protocols designed for the rapid detection of antiviral activity in cyanobacteria and partly because specialized facilities for work with pathogenic viruses are few and far between. We therefore developed an easy method for the screening of cyanobacterial cultures for antiviral activity and used our private culture collection of non-pathogenic virus isolates to show that antiviral activity is a prominent feature in the cyanobacterium <i>Microcystis aeruginosa.</i> In this proof-of-concept study, we show that <i>M. aeruginosa</i> extracts from three different cyanobacterial strains delay infection of diatom-infecting single-stranded DNA and single-stranded RNA viruses by up to 2 days. Our work shows the ease with which cyanobacteria from culture collections can be screened for antiviral activity and highlights the potential of cyanobacteria as an excellent source for the discovery of novel antiviral compounds, warranting further investigation.</p>","author":"Sally Zheng, \nVictoria Lee, \nIsaac Meza‐Padilla, \nJozef I. Nissimov","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"a99199d2bd11885528e52b5d36fa5b5e919a2f1ec7bc038530ee192f3711f0b3","category":"Environment"}