{"title":"What Do You Want to See From Apple in 2024?","link":"https://www.macrumors.com/guide/what-do-you-want-to-see-from-apple-2024/","date":1704125021000,"content":"Last Friday, we shared our <a href=\"https://www.macrumors.com/guide/apple-what-to-expect-2024/\">annual What to Expect Guide</a> that covers everything we're expecting to see from Apple in 2024, based on current rumors and historical product release information.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/What-to-Expect-from-Apple-in-2024-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nWe're going to see the launch of the Vision Pro early in the year, followed by new <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\">OLED iPad Pro</a> models, a new version of the AirPods, an <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> in a new size, an Apple Watch that has blood pressure monitoring and sleep detection, and of course, refreshed <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> models with a host of new features.\r<br />\n\r<br />\nWhile we know what we're expecting to see from Apple in 2024, we want to hear from the <em>MacRumors</em> community. What are you hoping to see Apple release this year?\r<br />\n\r<br />\nAre you looking forward to generative AI? Crossing your fingers for new <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> features? What would you like to see in <a href=\"https://www.macrumors.com/roundup/ios-18/\">iOS 18</a>? Will you buy Apple's Vision Pro headset?\r<br />\n\r<br />\nLet us know your thoughts in the comments, and take a look at our What to Expect Guide to see an overview of the current rumors. We'll be hearing a lot more about Apple's 2024 product plans in the coming months, and we'll have in-depth coverage at MacRumors.com.\r<br />\n\r<br />\nIf you want to discuss Apple's upcoming products, <a href=\"https://forums.macrumors.com\">our <em>MacRumors</em> forums</a> are an excellent resource, plus they're a great place to get help on current Apple products, software, and so much more.\r<br />\n\r<br />\nWe'd like to thank our readers and our forum members for making <em>MacRumors</em> the number one source for Apple news, rumors, and advice. <em>MacRumors</em> celebrated its 23rd birthday this year, and that's thanks to our dedicated supporters. We are looking forward to another year of rumors and product launches in 2024. Happy New Year!<br />This article, \"<a href=\"https://www.macrumors.com/guide/what-do-you-want-to-see-from-apple-2024/\">What Do You Want to See From Apple in 2024?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-do-you-want-to-see-from-apple-in-2024.2415161/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a997e84705e979016b028eb34f8224cf60757d4583233811edc5ecc6da35da08","category":"Apple"}