{"title":"A Novel Theoretical Method for Upscaling Permeability in Hydrate‐Bearing Sediments","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037729?af=R","date":1728455744000,"content":"<h2>Abstract</h2>\n<p>The accurate prediction of Darcy-scale permeability (absolute permeability and gas-water relative permeability) of hydrate-bearing sediments (HBS) plays a crucial role in assessing reservoir potential and optimizing recovery strategies. However, the challenges of field coring, the rigorous conditions encountered in laboratory permeability tests, and the multi-scale pore structure characteristics of HBS complicate the understanding of the relationship between pore structures and Darcy-scale permeability of HBS. In this study, we propose an innovative upscaling method that integrates flow properties of typical regions, such as coarse, medium, and fine regions, to predict the Darcy-scale permeability of HBS from the pore-scale. This method considers two hydrate habits (pore-filling and grain-coating hydrates), heterogeneity and anisotropy of HBS, and multi-scale pore structures. Taking the absolute permeability of hydrate-free sediments in the <i>y</i> direction for example, the permeability values for the fine region, the medium region, the coarse region, and the equivalent HBS are 9.43 D, 13.59 D, 18.87 D, and 14.06 D, respectively. Thus, the predicted permeability (14.06 D) is much closer to the experimental data (15.44 D), which validates the efficacy of our upscaling method in estimating Darcy-scale permeability. Moreover, the characteristics of our predicted Darcy-scale permeability align with those reported in previous literature. This approach introduces a groundbreaking perspective for predicting permeability in HBS from pore-scale to Darcy-scale. It offers essential insights into predicting permeability in HBS while effectively preserving the impact of pore-scale structural variations caused by local heterogeneity and facilitating numerical simulations of gas production from hydrate reservoirs.</p>","author":"Xiwei Gao, \nGang Lei, \nYingjie Zhao, \nQinzhuo Liao, \nFulong Ning","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"a9b4e3b8436ccede55ec3b2e0736e24d70c1d8d8b3edf33fc9f797ef67f7a5d1","category":"Environment"}