{"title":"Meta-Analysis of the Fisheries, and Life History for Trichiurus. Japonicas, T. brevis and T. nanhaiensis, in the Northwest of Pacific Ocean","link":"https://www.preprints.org/manuscript/202409.1859/v1","date":1727171882000,"content":"Aquatic environments are generally heterogeneous in space and time, and the marine organisms have their ways response to those environmental heterogeneities. Cutlassfish (Trichiurus spp.) once is one of the “Chinese Four Major Marine Fish Species” along the coast of northwest Pacific Ocean. There are some comments on the cutlassfish (T. spp.) name identification. In this study, three cutlassfish species, namely, the largehead hairtail (T. japonicas) in East China Sea (ECS), Chinese short-tailed hairtail (T. brevis), and South China Sea (SCS) cutlassfish (T. nanhaiensis), have been identified in the northwest Pacific Ocean. This work integrated 115 studies in cutlassfish population dynamics from 24 sites across 8 countries in the world. The biomass distribution of T. japonicas in the ECS and T. nanhaiensis in SCS, was found to be highly correlated with water temperature and salinity. Spatiotemporal heterogeneity of cutlassfish is found to correlate with both genetic and environmental characteristics in the northwest Pacific Ocean (e.g., density dependency, primary productivity and climate ocean oscillation). Closely related species coexisting in the same shelf region (e.g., T. japonicus and T. nanhaiensis in ESC) often differ in diet and microhabitat. The difference of skull phenology between T. nanhaiens and T. brevis is found to correlate with species separation and environmental heterogeneity. With the implications for the design of ecological research programs on cutlassfish, our study found that the effect of temporal changes outweighs (to some extent) the effect of spatial changes on cutlassfish in those shelf regions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a9b7e12322777a5abe34a340d8c35b39aabd3bdfd00a7bfa6f82ff6258cfc70b","category":"Interdisciplinary"}