{"title":"A comparative analysis of 24-hour movement behaviors features using different accelerometer metrics in adults: Implications for guideline compliance and associations with cardiometabolic health","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309931","date":1726581600000,"content":"<p>by Iris Willems, Vera Verbestel, Dorothea Dumuid, Patrick Calders, Bruno Lapauw, Marieke De Craemer</p>\r\nBackground <p>Movement behavior features such as time use estimates, average acceleration and intensity gradient are crucial in understanding associations with cardiometabolic health. The aim of this study was to 1) compare movement behavior features processed by commonly used accelerometer metrics among adults (i.e. Euclidian Norm Minus One (ENMO), Mean Amplitude Deviation (MAD) and counts per minute (CPM)), 2) investigate the impact of accelerometer metrics on compliance with movement behavior guidelines, and 3) explore potential variations in the association between movement behavior features and cardiometabolic variables depending on the chosen metric.</p> Methods <p>This cross-sectional study collected movement behavior features (Actigraph GT3X+) and cardiometabolic variables. Accelerometer data were analyzed by four metrics, i.e. ENMO, MAD, and CPM vertical axis and CPM vector magnitude (GGIR). Intraclass correlations and Bland‒Altman plots identified metric differences for time use in single movement behaviors (physical activity, sedentary behavior), average acceleration and intensity gradient. Regression models across the four metrics were used to explore differences in 24-hour movement behaviors (24h-MBs; compositional variable) as for exploration of associations with cardiometabolic variables.</p> Results <p>Movement behavior data from 213 Belgian adults (mean age 45.8±10.8 years, 68.5% female) differed according to the metric used, with ENMO representing the most sedentary movement behavior profile and CPM vector magnitude representing the most active profile. Compliance rates for meeting integrated 24h-MBs guidelines varied from 0–25% depending on the metric used. Furthermore, the strength and direction of associations between movement behavior features and cardiometabolic variables (body mass index, waist circumference, fat% and HbA1c) differed by the choice of metric.</p> Conclusion <p>The metric used during data processing markedly influenced cut-point dependent time use estimates and cut-point independent average acceleration and intensity gradient, impacting guideline compliance and associations with cardiometabolic variables. Consideration is necessary when comparing findings from accelerometry studies to inform public health guidelines.</p>","author":"Iris Willems","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a9c9380b1420461b097e7e424159a71426ffaf77ec011e5984e8f6e7cf69917a","category":"Interdisciplinary"}