{"title":"Bayesian model selection for COVID-19 pandemic state estimation using extended Kalman filters: Case study for Saudi Arabia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003467","date":1721916000000,"content":"<p>by Lamia Alyami, Saptarshi Das, Stuart Townley</p>\r\n\r\nQuantifying the uncertainty in data-driven mechanistic models is fundamental in public health applications. COVID-19 is a complex disease that had a significant impact on global health and economies. Several mathematical models were used to understand the complexity of the transmission dynamics under different hypotheses to support the decision-making for disease management. This paper highlights various scenarios of a 6D epidemiological model known as SEIQRD (Susceptible-Exposed-Infected-Quarantined-Recovered-Deceased) to evaluate its effectiveness in prediction and state estimation during the spread of COVID-19 pandemic. Then we investigate the suitability of the classical 4D epidemiological model known as SIRD (Susceptible-Infected-Recovered-Deceased) in the long-term behaviour in order to make a comparison between these models. The primary aim of this paper is to establish a foundational basis for the validity and epidemiological model comparisons in long-term behaviour which may help identify the degree of model complexity that is required based on two approaches viz. the Bayesian inference employing the nested sampling algorithm and recursive state estimation utilizing the Extended Kalman Filter (EKF). Our approach acknowledges the potential imperfections and uncertainties inherent in compartmental epidemiological models. By integrating our proposed methodology, these models can consistently generate predictions closely aligned with the observed data on active cases and deaths. This framework, implemented within the EKF algorithm, offers a robust tool for addressing future, unknown pandemics. Moreover, we present a systematic methodology for time-varying parameter estimation along with uncertainty quantification using Saudi Arabia COVID-19 data and obtain the credible confidence intervals of the epidemiological nonlinear dynamical system model parameters.","author":"Lamia Alyami","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a9ca51a7e387335176bb0907486ad0445da6e5da563abedbe8d2eca3db371fca","category":"Environment"}