{"title":"WSJ แฉ Facebook จัดการ Hate Speech ได้แค่ 5% ด้าน Facebook แย้ง จัดการได้เกือบครึ่ง","link":"https://www.blognone.com/node/125320","date":1634523937000,"content":"<div><div><div><p>Wall Street Journal ออกรายงานแฉ Facebook อีกครั้ง บอกว่าจริงๆ แล้ว Facebook ประสบความสำเร็จน้อยมากในการจัดการเนื้อหาที่มีความเกลียดชัง รูปภาพที่มีความรุนแรง ตลอดจนเนื้อหาอันตรายอื่นๆ ล่าสุด Facebook นำโดย Guy Rosen รองประธานฝ่าย Integrity ของ Facebook เขียนบล็อกคัดค้านว่า เนื้อหาแสดงความเกลียดชังหรือ Hate Speech ลดลงเกือบ 50% ในช่วงสามไตรมาสที่ผ่านมา</p>\n<p>WSJ รายงานโดยอ้างอิงเอกสารภายในว่า ช่วงสองปีที่ผ่านมา Facebook ลดเวลาคนทำงานตรวจตา Hate Speech และพยายามสร้างภาพลักษณ์ใหม่ว่า AI มีประสิทธิภาพลด Hate Speech บนแพลตฟอร์มได้จริง นอกจากนี้ ทีมงาน Facebook ยังพบด้วยว่า ช่วงเดือนมีนาคมระบบอัตโนมัติของ Facebook สามารถลบโพสต์ Hate Speech ได้เพียง 3-5% เท่านั้น และน้อยกว่า 1% ของเนื้อหาทั้งหมดที่ละเมิดกฎแพลตฟอร์มโดยรวม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/adacdd722e2c12d075890e382da1fc97.jpg\" /></p>\n<p>นอกจากนี้ ยังพบด้วยว่า เนื้อหารุนแรงบางส่วนสามารถรอดพ้นจากการตรวจจับของ Facebook ได้ เช่นภาพความรุนแรงของอุบัติเหตุรถชน การข่มขู่คุกคามเด็ก เป็นต้น</p>\n<p>ด้าน Guy Rosen รองประธานฝ่าย Integrity ของ Facebook แย้งว่า การเน้นไปที่การลบเนื้อหาเพียงอย่างเดียวคือวิธีที่ผิด แต่ Facebook เน้นที่ความแพร่หลายหรือการกระจายตัวของเนื้อหา  Hate Speech มากกว่า ซึ่งตามรายงานการบังคับใช้มาตรฐานชุมชนฉบับล่าสุดของ Facebook พบว่าความชุกหรือความแพร่หลายของเนื้อหานั้นอยู่ที่ 0.05% ของการดูเนื้อหา หรือเทียบเท่าได้กับ 5 การมองเห็น ใน 10,000 การมองเห็น ซึ่งลดลงเกือบ 50% ในช่วงสามไตรมาสที่ผ่านมา</p>\n<p>Rosen เล่าย้อนด้วยว่าในปี 2016 การดูแลเนื้อหาอาศัยการรายงานจากผู้ใช้เป็นหลัก Facebook จึงสร้างเทคโนโลยีเพื่อระบุเนื้อหาที่ละเมิดในเชิงรุกก่อนที่ผู้คนจะรายงานเข้ามา และค้านรายงานจาก WSJ ด้วยว่า ข้อมูลที่ดึงมาจากเอกสารที่รั่วไหลถูกใช้เพื่อสร้างเรื่องเล่าว่าเทคโนโลยีของ Facebook นั้นไม่สามาาถจัดการ Hate Speech ได้ ถือเป็นการจงใจบิดเบือน</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/10/17/22731214/facebook-disputes-report-artificial-intelligence-hate-speech-violence?scrolla=5eb6d68b7fedc32c19ef33b4\">The Verge</a>, <a href=\"https://www.wsj.com/articles/facebook-ai-enforce-rules-engineers-doubtful-artificial-intelligence-11634338184?st=fdxfcqdeo7a0g8a&amp;reflink=desktopwebshare_twitter\">WSJ</a>, <a href=\"https://about.fb.com/news/2021/10/hate-speech-prevalence-dropped-facebook/\">Facebook</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/wall-street-journal\">Wall Street Journal</a></div><div><a href=\"/topics/hate-speech\">Hate Speech</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a9d1a47818758bb1849270b285ce29b20732c1d50cdb411190a2cf52f3aeb816","category":"Thai"}