{"title":"A retrospective study of congenital anomalies and associated risk factors among children admitted at a tertiary hospital in northwestern Tanzania","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003177","date":1714572000000,"content":"<p>by Wango Chaulo, Elias C. Nyanza, Moses Asori, Deborah S. K. Thomas, Florentina Mashuda</p>\r\n\r\nCongenital anomalies in Sub-Sahara Africa (SSA) are understudied despite the significant pediatric health burden. This retrospective longitudinal hospital-based study evaluated the records of 326 inpatient children under the age of two years with congenital anomalies at Bugando Medical Centre, a tertiary referral hospital in northwestern Tanzania. Classical logistic regression was used in the analysis of congenital malformation of muscles, gastrointestinal malformation, oral facial clefts, neural tube defects, and skeletal malformations. A modified poisson regression was used to model risk factors for Central Nervous System (CNS) hydrocephalus and congenital heart disease (CHD). A majority (78.8%) of children included in the study were less than six months of age. Nearly half (48.8%) were diagnosed with CHD followed by CNS hydrocephalus (10.4%) and congenital malformation of muscles (8.9%). Babies whose mothers missed periconceptual folic acid supplementation had 83% higher risk of hydrocephalus (aPR = 1.83, 95% CI = 1.11–1.96) and 78% higher for CHD (aPR = 1.78, 95% CI = 1.31–1.94). Male children had 1.67 higher odds of muscular congenital malformations (aOR = 1.67, 95% CI = 1.23–1.89). Less than 37 gestational age had a 1.86 higher odds of muscular congenital malformations (aOR = 1.86, 95% CI = 1.53–3.66). Our study highlights the critical need for folic acid supplementation and establishes a need for a registry and the potential for mapping.","author":"Wango Chaulo","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a9f927294f72dd738c296a2c688e92809c96d5db47d0051dd62495f4ea387a1f","category":"Environment"}