{"title":"HBO drops full trailer for new sci-fi period drama The Nevers","link":"https://arstechnica.com/?p=1751618","date":1616538321000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div class=\"video\"><div class=\"wrapper\" style=\"display:block\" type=\"text/html\" width=\"980\" height=\"550\" src=\"https://www.youtube.com/embed/gs-ODufnJ8Y?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen></div><p class=\"caption\" style=\"font-size:0.8em\">Laura Donnelly stars as Amalia True and Ann Skelly stars as Penance Adair, two Victorian women who mentor gifted orphans in HBO's new original series, <em>The Nevers</em>. </p></div>\n<p>An inexplicable event confers supernatural powers on a select group of people in Victorian London, who must battle prejudice and those who would exploit their abilities in <a href=\"https://en.wikipedia.org/wiki/The_Nevers\"><em>The Nevers</em></a>, a new original series coming to HBO next month.</p>\n<p>HBO won a fierce bidding war and approved a straight-to-series order in 2018, with Joss Whedon (<em>The Avengers</em>, <em>Cabin in the Woods</em>, etc.) as writer, director, executive producer, and showrunner. Whedon brought Douglas Petrie and Jane Espenson—both of whom worked with Whedon on <em>Buffy the Vampire Slayer</em>—on board as additional writers/executive producers. He <a href=\"https://www.ign.com/articles/2018/07/21/joss-whedon-explains-title-of-his-hbo-series-the-nevers-comic-con-2018\">said the following</a> about the series title during Comic-Con in 2018:</p>\n<blockquote><p>They, themselves are not called that [<em>The Nevers</em>] in the show. It's a phrase that's meant to evoke a sort of reaction to their oddity, to what is considered unnatural. The idea that you should never be like this, you should never have existed. Something is not the way it should be, and you don't have the right to have whatever weird power or ability that you have. And that idea, that some people are not of the natural order, is fascinating to me. I don't agree with it. But to me, it's one of those things where you take something negative, and you wear it as a badge of honor, basically. Certain things could never happen—they're happening. And the people they're happening to are taking their place in the world.</p></blockquote>\n<p>Last November, Whedon announced he was quitting the project, citing exhaustion and the \"physical challenges of making such a huge show during a global pandemic.\" (Whedon has been embattled in recent months by accusations of workplace harassment—both from <a href=\"https://variety.com/2020/film/news/ray-fisher-joss-whedon-justice-league-1234695831/\">Ray Fisher</a>, aka Cyborg, during <a href=\"https://arstechnica.com/gaming/2021/03/justice-leagues-snyder-cut-review-no-longer-whedonesque-and-all-the-better/\"><em>Justice League</em></a> reshoots, and from <a href=\"https://deadline.com/2021/02/sarah-michelle-gellar-abuse-claims-response-charisma-carpenter-joss-whedon-buffy-1234691481/\">several <em>Buffy</em> cast members</a>—but HBO <a href=\"https://www.thewrap.com/joss-whedon-the-nevers-hbo-no-complaints-exit/\">has said</a> there were no similar reports about Whedon during production of <em>The Nevers</em>.)</p></div><p><a href=\"https://arstechnica.com/?p=1751618#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1751618&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aa0048adc52b0a6f6763bed167ad26d2b65b56eaf24664445fd0723e09668082","category":"Tech"}