{"title":"Genotypic and phenotypic profiling of 127 <i>Legionella pneumophila</i> strains: Insights into regional spread","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307646","date":1721397600000,"content":"<p>by Andrea Colautti, Marcello Civilini, Renzo Bortolomeazzi, Marinella Franchi, Antonella Felice, Stefano De Martin, Lucilla Iacumin</p>\r\n\r\nGiven the recent global surge in Legionnaires’ disease cases, the monitoring of <i>Legionella pneumophila</i> becomes increasingly crucial. Epidemiological cases often stem from local outbreaks rather than widespread dissemination, emphasizing the need to study the characteristics of this pathogen at a local level. This study focuses on isolates of <i>L</i>. <i>pneumophila</i> in the Italian region of Friuli Venezia Giulia to assess specific genotype and phenotype distribution over time and space. To this end, a total of 127 <i>L</i>. <i>pneumophila</i> strains isolated between 2005 and 2017 within national surveillance programs were analysed. Rep-PCR, RAPD, and Sau-PCR were used for genotypic characterization, while phenotypic characterization was conducted through fatty acids analysis. RAPD and Sau-PCR effectively assessed genetic characteristics, identifying different profiles for the isolates and excluding the presence of clones. Although Sau-PCR is rarely used to analyse this pathogen, it emerged as the most discriminatory technique. Phenotypically, hierarchical cluster analysis categorized strains into three groups based on varying membrane fatty acid percentages. However, both phenotypic and genotypic analyses revealed a ubiquitous profile distribution at a regional level. These results suggest an absence of correlations between strain profiles, geographical location, and isolation time, indicating instead high variability and strain dissemination within this region.","author":"Andrea Colautti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"aa05b26690d190a98029bc2e5c3fae27c2241e9d46fa70dd5dfc2926adfc32cf","category":"Interdisciplinary"}