{"title":"Rocket Report: Two small launchers fail in flight; Soyuz crew flies to ISS","link":"https://arstechnica.com/?p=1970355","date":1695380406000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/53193245961_88f2a67330_k-800x515.jpg\" alt=\"NASA Astronaut Loral O'Hara, Russian commander Oleg Kononenko, and cosmonaut Nikolai Chub prepare for launch September 15 at the Baikonur Cosmodrome in Kazakhstan.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/53193245961_88f2a67330_k.jpg\">Enlarge</a> <span>/</span> NASA Astronaut Loral O'Hara, Russian commander Oleg Kononenko, and cosmonaut Nikolai Chub prepare for launch September 15 at the Baikonur Cosmodrome in Kazakhstan. (credit: <a href=\"https://www.flickr.com/photos/nasahqphoto/53193245961/\">NASA/Victor Zelentsov</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.12 of the Rocket Report! Two of the world's most successful small satellite launchers suffered failures this week. We've seen many small launch companies experience failures on early test flights, but US-based Rocket Lab and China's Galactic Energy have accumulated more flight heritage than most of their competitors. Some might see these failures and use the \"space is hard\" cliché, but I'll just point to this week as a reminder that rocket launches still aren't routine.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Rocket Lab suffers launch failure</strong>. Rocket Lab's string of 20 consecutive successful launches ended Tuesday when the company's Electron rocket failed to deliver a small commercial radar imaging satellite into orbit, <a href=\"https://arstechnica.com/space/2023/09/rocket-labs-electron-launch-vehicle-fails-for-fourth-time-in-41-missions/\">Ars reports</a>. The problem occurred on the upper stage of the Electron rocket about two and a half minutes after liftoff from the Mahia Peninsula in New Zealand. This was the fourth time a Rocket Lab mission has failed in 41 flights. A small commercial radar surveillance satellite from Capella Space was destroyed when the rocket crashed.</p></div><p><a href=\"https://arstechnica.com/?p=1970355#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970355&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aa08b04abbb89b65f08a6b1b936bc9a7ab4d2bc45fe0593aa519ae434fd3c9eb","category":"Tech"}