{"title":"Contrasting biomass allocations explain adaptations to cold and drought in the world’s highest-growing angiosperms","link":"https://academic.oup.com/aob/article/134/3/401/7614204?rss=1","date":1708905600000,"content":"<span><div>Abstract</div><div>Background and Aims</div>Understanding biomass allocation among plant organs is crucial for comprehending plant growth optimization, survival and responses to the drivers of global change. Yet, the mechanisms governing mass allocation in vascular plants from extreme elevations exposed to cold and drought stresses remain poorly understood.<div>Methodology</div>We analysed organ mass weights and fractions in 258 Himalayan herbaceous species across diverse habitats (wetland, steppe, alpine), growth forms (annual, perennial taprooted, rhizomatous and cushiony) and climatic gradients (3500–6150 m elevation) to explore whether biomass distribution adhered to fixed allometric or optimal partitioning rules, and how variations in size, phylogeny and ecological preferences influence their strategies for resource allocation.<div>Key Findings</div>Following optimal partitioning theory, Himalayan plants distribute more biomass to key organs vital for acquiring and preserving limited resources necessary for their growth and survival. Allocation strategies are mainly influenced by plant growth forms and habitat conditions, notably temperature, water availability and evaporative demands. Alpine plants invest primarily in below-ground stem bases for storage and regeneration, reducing above-ground stems while increasing leaf mass fraction to maximize carbon assimilation in their short growing season. Conversely, arid steppe plants prioritize deep roots over leaves to secure water and minimize transpiration. Wetland plants allocate resources to above-ground stems and below-ground rhizomes, enabling them to resist competition and grazing in fertile environments.<div>Conclusions</div>Himalayan plants from extreme elevations optimize their allocation strategies to acquire scarce resources under specific conditions, efficiently investing carbon from supportive to acquisitive and protective functions with increasing cold and drought. Intraspecific variation and shared ancestry have not significantly altered biomass allocation strategies of Himalayan plants. Despite diverse evolutionary histories, plants from similar habitats have developed comparable phenotypic structures to adapt to their specific environments. This study offers new insights into plant adaptations in diverse Himalayan environments and underscores the importance of efficient resource allocation for survival and growth in challenging conditions.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"aa0de0371ae903fba7feff18680fc3f8a30763cbf5a96e415b64249e154ab6bb","category":"Environment"}