{"title":"Apple ออกรายงานการปรับปรุง iOS ให้รองรับกฎหมาย DMA ของ EU แต่ก็ย้ำว่าความปลอดภัยในการใช้งานจะลดลง","link":"https://www.blognone.com/node/138500","date":1709350706000,"content":"<div><div><div><p>แอปเปิล<a href=\"https://developer.apple.com/security/complying-with-the-dma.pdf\">ออกรายงานเรื่องการปรับปรุง iOS</a> ให้เป็นไปตามกฎหมาย DMA (Digital Markets Act) ของ EU ซึ่งคาดว่าจะออกอัพเดตมาใน iOS 17.4 สัปดาห์หน้า มีประเด็นสำคัญคือ ต้องเปิดให้สามารถดาวน์โหลดแอปจากสโตร์ภายนอกได้ และมีรายละเอียดอื่นเพิ่มเติม</p>\n<p>ในรายงานนี้แอปเปิลพยายามย้ำประเด็นหลักคือ แม้มีการเปลี่ยนแปลงตามข้อกำหนดของ EU แต่แอปเปิลก็พยายามทุกทางเพื่อปกป้องความเป็นส่วนตัวและความปลอดภัยของผู้ใช้งานในกลุ่ม EU อย่างไรก็ตามด้วยข้อกำหนดที่ออกมา ระดับความปลอดภัยที่เกิดขึ้นของผู้ใช้งานใน EU ก็จะน้อยกว่าผู้ใช้งานอื่นในโลก</p>\n<p>แอปเปิลบอกว่าได้สร้าง API เพิ่มเติมมากกว่า 600 รายการ และเครื่องมือสำหรับนักพัฒนา เพื่อรองรับการเปลี่ยนแปลงนี้สำหรับกลุ่มประเทศ EU</p>\n<p>มีประเด็นน่าสนใจคือแอปเปิลได้นำตัวอย่างอีเมล ที่แสดงความกังวลจากหน่วยงานรัฐบาลและผู้ใช้งาน เมื่อ iOS ในกลุ่ม EU สามารถโหลดแอปภายนอกหรือ sideloading ได้ โดยเฉพาะหน่วยงานด้านความมั่นคง ธนาคาร และบริการฉุกเฉิน ซึ่งทางแก้ไขของแอปเปิลคือแม้สามารถดาวน์โหลดแอปจากสโตร์ภายนอกได้ แต่แอปก็ต้องผ่านการตรวจสอบจากแอปเปิลด้วยเช่นกัน ซึ่งสามารถป้องกันปัญหาที่อาจเกิดได้ในระดับหนึ่ง</p>\n<p>ทั้งนี้แอปเปิลยกตัวอย่างแนวทางของกูเกิลเรื่อง <a href=\"https://www.blognone.com/node/96344\">Advanced Protection Program</a> ที่จำกัดการลงแอปเฉพาะ Play Store เท่านั้น จากที่ Android ปกติสามารถลงแอปผ่านช่องทางอื่นได้ด้วย สะท้อนว่าการเปิดกว้างก็มาพร้อมความเสี่ยงนั่นเอง</p>\n<p>รายละเอียดดังกล่าว <a href=\"https://www.blognone.com/node/138499\">เป็นส่วนหนึ่ง</a>ที่ทำให้บริษัทและองค์กรไอทีของยุโรปออกมาร้องเรียนให้ EU สอบสวนท่าทีของแอปเปิลนี้ด้วย</p>\n<p>ที่มา: <a href=\"https://9to5mac.com/2024/03/01/apple-on-eu-ios-changes-dma-makes-users-less-safe/\">9to5Mac</a> และ <a href=\"https://www.reuters.com/technology/number-agencies-have-concerns-about-sideloading-iphone-apple-says-2024-03-01/\">Reuters</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cdf8910a02440ccc217f02ad0ad74a6a.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/ios\">iOS</a></div><div><a href=\"/topics/ios-17\">iOS 17</a></div><div><a href=\"/topics/eu\">EU</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"aa21d05d0cd5d68cd6e9eada7adf1bf0a439618f74e3ca15dde102ff78926182","category":"Thai"}