{"title":"PSI-28 Effect of supplementing a Bacillus spp.-based probiotic on intestinal tight junction proteins expression and abundance of selected microorganisms in heat stressed pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/688/7757601?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The maintenance of small intestine epithelial barrier function, depending in part on tight junction proteins (TJP), prevents the system from invasion of undesired materials but may become altered in heat stressed pigs. Heat stress (HS) also appears to modify the composition of intestinal microbiota that, combined with a weak barrier, may cause health deterioration of pigs. Probiotics, in contrast, can help animals to maintain a healthy intestinal environment. A study, conducted with pigs [n = 80; body weight (BW) = 21.6 ± 3.4 kg], analyzed the effect of HS and the supplementation of a <span>Bacillus spp</span>-based probiotic on gene expression of the TJP occludin, claudins, and TJP1 in jejunum and ileum. Abundance of <span>Lactobacillus sp.</span>, <span>Bifidobacterium sp.</span>, <span>Bacillus subtilis</span> and <span>E. coli</span> in ileal content was also analyzed. Treatments were thermal neutral (TN) pigs fed a control diet without probiotic (TN-C) or with 0.05% probiotic (TN-P), and HS pigs fed a control without probiotic (HS-C) or with 0.05% probiotic (HS-P). The control diet was based on wheat and soybean meal, added with free Lys, Thr, Met, and Val. Feed and water were freely available during the 21-d study. At termination, six pigs per treatment were sacrificed and samples from jejunum and ileum tissue were collected to analyze TJP gene expression; ileal content was collected to analyze abundance of intestinal microorganisms. Ambient temperature inside TN and HS rooms ranged from 19 to 25°C and 30 to 38.5°C, respectively. In jejunum, claudin2 expression was greater in TN-P than in TN-C (<span>P</span> = 0.05) but there was no effect of HS. In ileum, HS increased claudin3 but decreased occludin gene expression (<span>P</span> &lt; 0.05). HS did not affect TJP1gene expression (<span>P</span> &gt; 0.10). Probiotic supplementation did not affect gene expression of TJP (<span>P</span> &gt; 0.10). Relative to TN-C pigs, abundance of <span>Lactobacillus sp.</span> and <span>Bifidobacterium sp.</span> tended to decrease in HS-C pigs (<span>P</span> &lt; 0.10), and that of <span>Bifidobacterium sp.</span> decreased in HS-P pigs (<span>P</span> &lt; 0.05). Abundance of <span>E. coli</span> tended to be greater (<span>P</span> &lt; 0.10) in both HS-C and HS-P pigs, than in the TN-C pigs. Abundance of <span>Bacillus sp.</span> was greater (<span>P</span> &lt; 0.01) in HS pigs fed the diet supplemented with the probiotic, compared with the TN-C (<span>P</span> &lt; 0.01) and HS-C (<span>P</span> &lt; 0.05) pigs. In conclusion, these data indicate that HS affects TJP gene expression and composition of intestinal microbiota, but supplementing 0.05% of a probiotic based on <span>Bacillus spp.</span> did not affect the abundance of measured microbiota except for <span>Bacillus</span> sp. under HS conditions.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aa2c88d43a49e290cfa8f9238a94e07be2b64d80987da8e9a97838653cede0ac","category":"Environment"}