{"title":"An Experimental Study Conducted on Material Properties Used in a FDM Printer for Medical Models","link":"https://www.preprints.org/manuscript/202407.2481/v1","date":1722388064000,"content":"3D Printing /Additive manufacturing holds a promising future in healthcare as it aids in visualizing things and making 3D objects which is very important in different areas of medicine. The concept of one size fits all has failed the quality of care delivered by us in healthcare which demands customised needs for patient care to create 3D printed tissues, make personalized prosthetics, implants and physical models of the human body. The materials used for printing models and other healthcare devices for medical education, patient needs, and prototyping are increasing. The application of different materials for use in healthcare is not studied. New materials are also available for the various applications in healthcare industry. This experimental study was conducted to review the nine distinct 3D printing filament materials like PETG, PA, ABS, PLA, HIPS, PMMA, Ceramic, Carbon Fiber, and (PLA + Metal Composite) with the help of a 3D printed physical model of T-12 thoracic vertebrae using all the abovementioned materials. The evaluation of materials was based on diverse mechanical properties, applications across medical fields, performance metrics, costs, accuracy, and quality. The assessment This study also focuses on comparison of mechanical properties such as tensile strength, compressive strength of the abovementioned materials with human bone. The study also reviews the 3D printing process and explores its utilization in biomedical applications. The Insights about the application of various materials holds a promising future for development of newer materials for healthcare industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aa2d069e74fefe09e425448844e5c6ee31fe67d1938445eb286e9e4d00be7337","category":"Interdisciplinary"}