{"title":"Examining Crop Yield Losses in Igdır Plain Irrigation Systems in Turkiye amidst Water Constraints","link":"https://www.preprints.org/manuscript/202404.1473/v1","date":1713859536000,"content":"Turkiye, located in the Mediterranean Basin, has started to experience the impacts of climate change, primarily manifesting in severe droughts that significantly affect agricultural output. Water stands as a crucial component in agricultural production. This study aims to propose water efficiency measures essential for climate change adaptation. By accessing pertinent data, partic-ularly in agriculturally reliant developing nations, this research endeavours to analyse yield losses in major crops within agricultural regions using the most suitable methodologies. Furthermore, it seeks to ascertain the financial ramifications of such losses. The methodological framework de-vised for this purpose was implemented in Türkiye's Iğdır Plain, selected as the study site. In 2022, the Iğdır province received 40% less precipitation than its usual levels. This study anticipates substantial losses in agricultural yield due to water scarcity resulting from prolonged drought conditions. Analysis reveals that among the crops cultivated in the region, clover belonging to the field crops category exhibits the highest water dependency, while apricot demonstrates the least reliance on water resources. In light of these considerations, the recommended crop rotation for the Iğdır Plain under water constraints comprises wheat, watermelon, maize, melon, apple, and apricot. Emphasizing enhanced water transmission and utilization efficiency, particularly in ir-rigation zones, prioritizing water stress-resistant crops within basin crop patterns, and favouring alternative crops over those demanding excessive water will foster sustainable water resource management. This approach encourages farmers to actively engage in the adaptation process to climate change and drought conditions while minimizing the agricultural sector's vulnerability to the impacts of climate change, which heavily relies on water consumption","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aa2f5d859aade393cfdfb969c5832d680dcb9b010641aa968b66d1e76e498faa","category":"Interdisciplinary"}