{"title":"Energy‐Efficient Clustering in Wireless Sensor Networks Using Grey Wolf Optimization and Enhanced CSMA/CA","link":"https://www.preprints.org/manuscript/202407.2221/v1","date":1722333310000,"content":"Survivability is a critical concern in WSNs, heavily influenced by energy efficiency. Addressing severe energy constraints in WSNs requires solutions that meet application goals while prolonging network life. This paper presents an energy optimization approach (EOAMRCL) for WSNs, integrating the Grey Wolf Optimization (GWO) for enhanced performance. EOAMRCL aims to enhance energy efficiency by selecting the optimal duty-cycle schedule, transmission power, and routing paths. The proposed approach employs a centralized strategy using a hierarchical network architecture. During the cluster formation phase, an objective function, augmented with GWO, determines the ideal cluster heads (CHs). The routing protocol then selects routes with minimal energy consumption for data transmission to CHs, using transmission power as a metric. In the transmission phase, the MAC layer forms a duty-cycle schedule based on cross-layer routing information, enabling nodes to switch between active and sleep modes according to their network allocation vectors (NAV). This process is further optimized by an enhanced CSMA/CA mechanism, which incorporates sleep/activate modes and pairing nodes to alternate between active and sleep states. This integration reduces collisions, improves channel assessment accuracy, and lowers energy consumption, thereby enhancing overall network performance. EOAMRCL was evaluated in a MATLAB environment, demonstrating superior performance compared to EEUC, DWEHC, and CGA-GWO protocols, particularly in terms of network lifetime and energy consumption. This highlights the effectiveness of integrating GWO and the updated CSMA/CA mechanism in achieving optimal energy efficiency and network performance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aa3229a265dcce2bfbf124d3277773ce7f9114f436323df22e9f2fb7e13f3e1d","category":"Interdisciplinary"}