{"title":"Fate of perfluoroalkyl and polyfluoroalkyl substances (PFAS) through two full‐scale wastewater sludge incinerators","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11009?af=R","date":1709711375000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/2436e448-07f9-4f22-9a8f-6159b3457a69/wer11009-toc-0001-m.png\" alt=\"Fate of perfluoroalkyl and polyfluoroalkyl substances (PFAS) through two full-scale wastewater sludge incinerators\" />\n<p>PFAS concerns are challenging wastewater treatment practices, including processing solids, often referred to as sludge. This research documents PFAS through two wastewater sludge incinerators (WSIs). Quantifiable PFAS emitted from the stacks represented significant reductions and shorter chain compounds compared with that entering the WSIs via the sludge.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Perfluoroalkyl and polyfluoroalkyl substances (PFAS) are an emerging issue in wastewater treatment. High-temperature thermal processes, incineration being time-tested, offer the opportunity to destroy and change the composition of PFAS. The fate of PFAS has been documented through wastewater sludge incinerators, including a multiple hearth furnace (MHF) and a fluidized bed furnace (FBF). The dewatered wastewater sludge feedstock averaged 247- and 1280-μmol targeted PFAS per sample run in MHF and FBF feed, respectively. Stack emissions (reportable for all targeted PFAS from MHF only) averaged 5% of that value with shorter alkyl chain compounds comprising the majority of the targeted PFAS. Wet scrubber water streams accumulated nonpolar fluorinated organics from the furnace exhaust with an average of 0.740- and 0.114-mol Fˉ per sample run, for the MHF and FBF, respectively. Simple alkane PFAS measured at the stack represented 0.5%–4.5% of the total estimated facility greenhouse gas emissions.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe MHF emitted six short chain PFAS from the stack, which were shorter alkyl chain compounds compared with sludge PFAS.\nThe FBF did not consistently emit reportable PFAS from the stack, but contamination complicated the assessment.\nFive percent of the MHF sludge molar PFAS load was reported in the stack.\nMHF and FBF wet scrubber water streams accumulated nonpolar fluorinated organics from the furnace exhaust.\nUltra-short volatile alkane PFAS measured at the stack represented 0.5%–4.5% of the estimated facility greenhouse gas emissions.\n</p>","author":"Lloyd J. Winchell, \nMartha J. M. Wells, \nJohn J. Ross, \nFarokh Kakar, \nAli Teymouri, \nDana J. Gonzalez, \nKy Dangtran, \nScott M. Bessler, \nShane Carlson, \nXavier Fonoll Almansa, \nJohn W. Norton Jr, \nKatherine Y. Bell","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"aa36f16f3bf60407ad81da1558766e17baebae5b76d293b2654bcadd7fa73069","category":"Environment"}