{"title":"Petroleum System of the Middle Jurassic Khatatba Formation in the Imhotep Field, Northwestern Egypt, Based on Multi-approach Analyses","link":"https://www.preprints.org/manuscript/202405.0957/v1","date":1715677779000,"content":"This study investigates the petroleum potential of the Middle Jurassic Khatatba Formation (Fm) in the Matruh Basin, northwestern Egypt. This formation shows in situ dual source and reservoir characteristics, where alternations of fine and coarse clastics were deposited during semi-arid and semi-humid conditions due to climate changes and Tethyan sea level fluctuations. The organic-rich shales and argillaceous siltstones are fair to very good/excellent (TOCm wt%: 0.91–3.07) source rocks. They are rich in late mature to early postmature mostly gas-prone organic facies C, which sourced the juxtaposing intraformational coarse clastics of the Lower Safa Member with gas and condensates. The source rocks show poor to fair gas generation potential (S2: 0.38–1.96, mg HC/g rock). The middle part of the Lower Safa Member shows excellent organic richness (TOCm wt%: 5.39 and 22.90) of early postmature gas-prone carbonaceous material and coal deposits. These coaly shale layers exhibit fair to excellent wet gas and condensate generation potential (S2: 4.51–27.43, mg HC/g rock). Maturation of the source rocks was related to the Late Jurassic–Early Cretaceous Tethyan rifting. The onset of oil generation occurred in the Early Cretaceous (~ 116 Ma ago), while the onset of gas generation occurred in the Oligocene (~ 24 Ma ago). Shales of the Lower Cretaceous Alam El Bueib Fm are primary sealing rocks, while carbonates and shales of the Khatatba Fm are secondary sealing rocks. Trap types are structural, formed during the Late Jurassic and Early Cretaceous rifting of the Matruh Basin. Sandstones of the Upper Safa Member show upward increases in kaolinite and exhibit low-quality tight sandstone reservoirs. The Lower Safa Member sandstones show better gas reservoir quality with lower shale volumes. Operationally, the Lower Safa sandstone reservoirs in the Imhotep W-1X well are not suitable for gas production because they are ductile and show a high decline in production and pressure. Overall, the petroleum system of the Khatatba Fm shows mainly fair hydrocarbon potential in the study area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aa375f6129346c340bed1837ca1b91046adb991faa2c20f6fe3deb9020cf385f","category":"Interdisciplinary"}