{"title":"The naringenin-dependent regulator FdeR can be applied as a NIMPLY gate controlled by naringenin and arabinose","link":"https://academic.oup.com/synbio/article/doi/10.1093/synbio/ysae001/7558354?rss=1","date":1705363200000,"content":"<span><div>Abstract</div>The FdeR regulator has been reported as a transcriptional activator dependent on the interaction with naringenin. Previously, FdeR and its cognate promoter were used to construct naringenin-sensitive sensors, though no correlation was associated between the FdeR level of expression and outputs. Therefore, to understand this correlation, we constructed a circuit with FdeR expression adjusted by the arabinose concentration through an AraC-P<span>BAD</span> system and the FdeR-regulated promoter controlling the expression of GFP. We observed a significant reduction in the activity of the target promoter by increasing FdeR expression, indicating that although FdeR has been primarily classified as a transcriptional activator, it also represses transcription. Leveraging the bifunctional feature of FdeR, acting as both transcriptional activator and repressor, we demonstrated that this genetic circuit, when previously switched on by naringenin, can be switched off by inducing an increased FdeR expression level. This engineered system functioned as a NIMPLY gate, effectively decreasing GFP expression by 50% when arabinose was added without removing naringenin from the medium. Exploiting FdeR versatility, this study demonstrates an innovative application of this transcriptional factor for developing novel NIMPLY gates activated by a molecule with low toxicity and nutraceutical properties that may be important for several applications.<strong>Graphical Abstract</strong>  </span>","author":"","siteTitle":"Synthetic Biology Current Issue","siteHash":"41b19f195cf64174f01d8c36945485e6398e3496f8a7213d6905a0e36713ba3c","entryHash":"aa378977d5f2394184a8e626b232d6b45c021236bd735a570d0f72c4e3029ee4","category":"Environment"}