{"title":"PSIX-10 Effects of Bacillus subtilis ATCC PTA-122264 on macronutrient digestibility and fecal characteristics, metabolites, and microbiota of healthy adult dogs subjected to an abrupt diet change","link":"https://academic.oup.com/jas/article/102/Supplement_3/579/7757517?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Probiotic use in dogs is increasing, with spore-forming <span>Bacillus</span> species gaining interest due to their viability during processing, storage, and in the gastrointestinal tract. <span>B. subtilis</span> is known for its adaptable metabolism that may be useful in pets subjected to abrupt dietary changes. The objective of this study was to determine dietary apparent total tract macronutrient digestibility (ATTD) and fecal characteristics, metabolites, and microbiota of healthy adult dogs supplemented with <span>B. subtilis</span> ATCC PTA-122264. All procedures were approved by the University of Illinois IACUC prior to experimentation. Dogs [n = 12; 6 ± 1 yr; 8.71 ± 0.91 kg body weight (BW)] were used in a replicated 3x3 Latin square design (n = 12/group) and fed to maintain BW. In each 42-d experimental period, dogs were allotted to one of three treatments: Control (kibble diet only), Low [kibble diet + 1×10<sup>9</sup> colony-forming units (CFU) of <span>B. subtilis</span>], and High (kibble diet + 5×10<sup>9</sup> CFU of <span>B. subtilis</span>). After a 22-d adaptation phase, a 5-d fecal collection phase was followed by a blood collection phase. On d 28, dogs were abruptly changed to a canned diet and fed for 14 d, with fecal samples collected on d 30 (2 d post change), 34 (6 d post change), 38 (10 d post change), and 42 (14 d post change). Fecal microbiota data were evaluated using QIIME2. All other data were analyzed using the Mixed Models procedure of SAS, with <span>P</span> &lt; 0.05 being considered significant. <span>B. subtilis</span> supplementation of the kibble diet did not influence food or energy intake, fecal output, ATTD, most serum metabolites, hematology, fecal characteristics, fecal bacterial alpha and beta diversity indices, and dysbiosis index, demonstrating the safety of the strain in dogs. However, fecal <span>Streptococcus</span> and <span>Blautia</span> abundances were higher in High dogs than Low or Control dogs, while E. coli abundance was less in Low dogs than High and Control dogs. The abrupt change to a canned diet led to significant alterations in fecal characteristics, dysbiosis index, and bacterial abundances, which were not influenced by <span>B. subtilis</span> supplementation. Bacterial alpha diversity measures were affected, with observed ASV (amplicon sequence variants) and the Fisher Index reducing, and the Shannon Index increasing by dietary change. The abrupt dietary change caused a distinct shift in microbial communities, as evidenced by principal coordinates analysis plots. The relative abundances of various fecal bacterial taxa, including <span>Bifidobacterium</span>, <span>Faecalibaculum</span>, <span>Turicibacter</span>, and <span>Lactobacillus</span> were decreased, while <span>Collinsella</span>, <span>Ruminococcus gnavus</span> group, and <span>Escherichia-Shigella</span> were increased with the dietary change. Our data support the notion that daily supplementation of 1 – 5×10<sup>9</sup> CFU of <span>B. subtilis</span> ATCC PTA-122264 in healthy dogs is safe and does not affect markers of general health and fecal characteristics, warranting further exploration.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aa4341bb4e3244a55ccacbc0ce1a26dc010b740ceaadb68e424badf70a25e219","category":"Environment"}