{"title":"How To Boost Your Design Workflow With Setapp","link":"https://smashingmagazine.com/2023/05/boost-design-workflow-setapp/","date":1683813600000,"content":"<p>This article is a sponsored by <a href=\"https://setapp.com/de?utm_campaign=banner&amp;utm_medium=article&amp;utm_source=smashing\">Setapp</a></p>\n<p>As someone who wears multiple hats, it is challenging to balance a full-time job, freelance projects, and all sorts of creative endeavors.</p>\n<p>This is how I started off: By day, I’m a full-time product designer. By night, I juggle all sorts of freelance work and creative projects.</p>\n<p>I am currently self-employed. However, there are challenges that come with being my own boss: Working with clients, sales and negotiation, invoicing, building a personal brand, crafting a content strategy, time tracking, project management… The list goes on.</p>\n<p>Trying to keep up with everything used to be tough. No matter how hard I tried, my to-do list always seemed never-ending. I was constantly feeling overwhelmed.</p>\n<p>I thought to myself, “There’s got to be a better way.”</p>\n<p>After analyzing my workflow, I realized that many tasks could be simplified or automated so that I could save time, focus on high-value tasks, and work fewer hours.</p>\n<p>After years of trial and error, I discovered a range of tools and strategies that helped me save time and stay organized to focus on what <em>really</em> matters.</p>\n<p>The apps mentioned in this guide are available on <a href=\"https://setapp.com/?utm_source=smashing&amp;utm_medium=article\">Setapp</a>. Whether you’re a Mac user or not, these hacks will help you get more done in less time and improve your quality of life. I hope you find value in this guide.</p>\nStreamline Your Workflow With the Best Apps\n<p>You can use <strong>Setapp</strong> to access 240+ apps on your Mac and iPhone under a single monthly subscription.</p>\n<p>Personally, I use Setapp to do <strong>three things</strong>:</p>\n<ol>\n<li>Try out apps that could help save time. Some of these apps cost more than Setapp’s subscription, so it’s a relief that I do not need to pay for each one individually.</li>\n<li>For apps that I only need to use occasionally, I can quickly install and uninstall them as needed, with no extra cost. This saves me precious space on my Mac and ensures that I’m not cluttering up my system with unnecessary apps.</li>\n<li>Since Setapp’s library is updated regularly, I always get to try out new apps to further enhance my workflow.</li>\n</ol>\nTrack Time &amp; Eliminate Distractions\n<p>As a freelance designer, I need to track how much time I spend on each project to calculate my billable hours. I used to manually create events on my calendar and calculate the hours spent on each project. It’s a waste of time, and sadly, it is inaccurate.</p>\n<p>To solve this problem, you can use <a href=\"https://setapp.com/apps/timemator\">Timemator</a> to track your time accurately and minimize distractions.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/1-timemator-interface.jpg\" /></p>\n<p>With Timemator, you can set up auto time-tracking rules for specific apps, files, or websites. For example, you can set rules so that the timer starts tracking when you work on a specific project on Figma or Adobe Photoshop.</p>\n<p>The timer runs quietly in the background so that you can stay focused without any interruptions. You no longer need to manually start or pause the timer.</p>\n<p><strong>Pro tip:</strong> <em>Use it to reduce distractions! Set up auto-tracking to track how much time you spend on meetings, talking to teammates or clients on Slack, or watching Netflix.</em></p>\n<p>To help you identify where you’ve spent your time, Timemator gives detailed reports and analytics so you can reduce or eliminate time-wasting activities and get more done in less time.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/2-timemator-reports.png\" /></p>\nThe Only Font Manager You Need\n<p>As designers, we all know that font selection can make or break a creative project.</p>\n<p>I was frustrated with Font Book (the default font manager on MacOS). It wasn’t user-friendly. Searching and comparing fonts was a chore.</p>\n<p>I found <a href=\"https://setapp.com/apps/typeface\">Typeface</a> to be useful — especially when you need to quickly browse through your font collection, customize the preview text and size <strong>in real-time</strong>, and compare to see how different fonts look side-by-side.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/3-typeface-fonts.png\" /></p>\n<p>Over the years, I have saved up a huge font library. Typeface is able to load all my fonts quickly and <strong>remove duplicate fonts</strong> that bloat up my computer. It supports variable fonts and OpenType font features and has robust features for the busy designer.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/4-typaface-remove-duplicate-fonts.png\" /></p>\n<p>For fonts you don’t use often, you can choose to <strong>activate them only when necessary</strong>. This way, your computer stays clean and fast.</p>\n<p>As a bonus, you can also easily organize fonts into custom collections or tags.</p>\nFastest Way To Create Device Mockups\n<p>When designing, we often need to create high-quality, professional-looking phone, tablet, and computer mockups to showcase our designs.</p>\n<p>I used to spend hours searching for device mockup templates and launch Adobe Photoshop in order to use those templates. The whole process was time-consuming, so I switched to a tool called <a href=\"https://setapp.com/apps/mockuuups-studio\">Mockuuups Studio</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/5-mockuuups-studio.png\" /></p>\n<p>All you need to do is drag and drop a screenshot of your website or app into it, pick a scene, and it will generate thousands of mockups. It’s pretty neat.</p>\n<p>You can filter through scenes, models, and devices to find the perfect mockup for your digital product. Then, add hands, overlays, realistic shadows, or backgrounds to your device mockups. In the example above, I have filtered ‘iPhone’ mockups only.</p>\n<p>Since it’s cloud-based, you can access it anywhere and collaborate with your teammates in real time too.</p>\n<p>To further speed up your workflow, you can use their Figma, Sketch, or Adobe XD plugin. This is their Figma plugin:</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/6-mockuuups-studio-figma-plugin.png\" /></p>\nCreate Screenshots &amp; Screen Recordings, Fast\n<p>When presenting designs (especially when working remotely), I take screenshots and screen recordings for my clients every day.</p>\n<p>But instead of using the default Mac screenshot tool, <a href=\"https://setapp.com/apps/cleanshot\">CleanShot X</a> is a better solution. This is an essential tool for every Mac user.</p>\n<p>To quickly take a screenshot, use this shortcut key on your Mac: Command + Shift + 4.</p>\n<p>This tool gives you the convenience to record MP4 or GIF with your desktop icons hidden, capture scrollable content, and annotate, highlight, or blur screenshots to hide sensitive personal information.</p>\n<p>An example of how I annotate my screenshots:</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/7-cleanshotx.png\" /></p>\n<p>I’ve used this tool for years with zero complaints. This tool will make your life easier when sharing screenshots with clients or on social media.</p>\n<p>A cool feature you’ll also love: You can capture and copy any text, so you’ll never have to manually retype it again!</p>\n<p>Your workflow will become much more streamlined and efficient since you no longer get bogged down in the technical details.</p>\nNever Waste Time Searching For Meeting Links Again\n<p>It’s challenging to keep track of various meetings, their details, and attendees, especially when switching between Google Meet, Zoom, your email inbox, and calendars.</p>\n<p>To solve this problem, you can use <a href=\"https://setapp.com/apps/meeter\">Meeter</a> to schedule or join meetings with one click right from the menu bar on your Mac.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/8-meeter.png\" /></p>\n<p>It supports Google Meet, Zoom, and Microsoft Teams. When you want to join a meeting, you no longer have to waste time searching for meeting links, then copy and paste the link into the browser. Instead, you can now focus on being present in every meeting.</p>\n<p>The tool allows you to directly call your FaceTime contacts and phone numbers and jump into recurring calls from the menu bar too. Pretty simple!</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/9-meeter-calls.png\" /></p>\nSave Time With Spotlight On Mac\n<p>When working with multiple files and apps on your Mac, you need to be able to quickly find and access them instead of navigating through different folders.</p>\n<p>With <a href=\"https://support.apple.com/guide/mac-help/search-with-spotlight-mchlp1008/mac\">Spotlight</a>, you can do these things quickly. While this is not an app, it’s one of the most powerful features on Mac that can save you plenty of time.</p>\n<p>To open Spotlight, simply hit Command + Spacebar on your keyboard and start typing.</p>\n<p>Then, try these on Spotlight:</p>\n<ul>\n<li><strong>Perform quick calculations.</strong><br />No need to open a calculator app. Simply type in your calculation in Spotlight and hit enter. It’s that easy.</li>\n<li><strong>Search for apps.</strong><br />Quickly find any app on your Mac.</li>\n<li><strong>Search the internet.</strong><br />Type your search term, and it will launch your default browser with the search results. You’ve just saved a few clicks.</li>\n<li><strong>Find files or folders.</strong><br />Type in the name of the file or folder, and you have it.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/10-spotlight-find-files-folders.png\" /></p>\n<ul>\n<li><strong>Check the weather.</strong><br />Type “weather” followed by your location, and it will give you up-to-date information on the current weather conditions and forecast.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/11-spotlight-weather.png\" /></p>\n<p>Cool, right? Learning how to use Spotlight effectively is a game-changer. Give it a try, and see how much time you can save.</p>\nDesign Accessible Interfaces\n<p>As a product designer who also builds websites for clients, it’s a challenge to find and create the perfect color palettes while working on multiple projects at once. In the past, I've had to rely on a combination of tools like swatch libraries and notes to keep track of my palettes.</p>\n<p>If you’re a designer or a developer, you’ll love <a href=\"https://setapp.com/apps/sip\">Sip</a> — a powerful color picker that can help you design beautiful and accessible interfaces easily.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/12-setapp-sip-color-picker.png\" /></p>\n<p>With Sip, you can quickly grab colors right from the Mac menu bar and drop them into any design or development tool, including Adobe Photoshop, Figma, and Sketch. This makes it easy to create custom color palettes that match the client’s brand.</p>\n<p>You can create and save custom color palettes, and the quick access menu that floats on the side of your desktop gives you quick access to your color palettes.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/13-setapp-sip-color-palette.png\" /></p>\n<p>Currently, it supports 24 of the most popular color formats in the industry, like Android XML, CSS hex, RGB, and CMYK.</p>\n<p>Now, my favorite feature is Sip’s Contrast Checker. In the example below, you can use the color picker to check the contrast between the gray text and white background, ensuring that it meets accessibility standards and is legible for all users.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/14-setapp-sip-contrast-checker-tool.png\" /></p>\n<p><strong>Tip</strong>: <em>Always make sure the contrast between the text and background is greater than or equal to <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/contrast-minimum.html\">4.5:1 for small text and 3:1 for large text</a>. If the color contrast fails, click on the ‘FIX’ button to improve it!</em></p>\nDeclutter Your Mac’s Menu Bar\n<p>If you have a bunch of apps running on your Mac, your menu bar may be cluttered with all sorts of icons and notifications.</p>\n<p>Just like physical clutter, digital clutter takes up mental space and affects your focus, too! To solve this problem, you can use <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/contrast-minimum.html\">Bartender</a>.</p>\n<p>Bartender allows you to organize your menu bar icons into neat and tidy groups or hide them completely — as simple as that. You can collapse your menu bar icons into a customizable dropdown menu so it remains clutter-free.</p>\n<p><img src=\"https://files.smashing.media/articles/boost-design-workflow-time-saving-tools-setapp/15-setapp-bartender.png\" /></p>\n<p>In the above example, most of my menu icons are hidden, except Figma and the battery level indicator.</p>\n<p>After using it for over a month, I am able to focus better. It’s one of those subtle quality-of-life improvements that can have a big impact on your productivity and mindset.</p>\nWrapping Up\n<p>I wish I had discovered these tools sooner!</p>\n<p>The apps I’ve shared above are available on <strong>Setapp</strong>. With a single monthly subscription, you get access to 240+ Mac and iPhone apps. They offer a <a href=\"https://setapp.com/?utm_source=smashing&amp;utm_medium=article\"><strong>free 7-day trial</strong></a>, so you can try it out and decide if it’s right for you.</p>\n<p>These tools have completely transformed my workflow and helped me become more productive and less stressed. I hope that these tools will do the same for you so you can make the most of your time. After all, time is a limited resource, and it's up to us to use it wisely.</p>\n<p>Thank you for reading. Have a productive day!</p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2023/01/top-frontend-tools-2022/\">Top Front-End Tools Of 2022</a>, Louis Lazaris</li>\n<li><a href=\"https://www.smashingmagazine.com/2022/12/optimizing-design-workflow-tools/\">Boosting Productivity For Designers With Efficient Tools</a>, Ashish Bogawat</li>\n<li><a href=\"https://www.smashingmagazine.com/2022/07/overcoming-imposter-syndrome-developing-guiding-principles/\">Overcoming Imposter Syndrome By Developing Your Own Guiding Principles</a>, Luis Ouriach</li>\n<li><a href=\"https://www.smashingmagazine.com/2022/04/productivity-tips-tools/\">Productivity Tips And Tools For A More Efficient Workflow</a>, Cosima Mielke</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"aa4ea8d10ff288e8b83db997496398415ef665261192926c6608882c3c749d5e","category":"Tech"}