{"title":"The endemic kelp Lessonia corrugata is being pushed above its thermal limits in an ocean warming hotspot","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13434?af=R","date":1712751025000,"content":"<h2>Abstract</h2>\n<p>Kelps are in global decline due to climate change, which includes ocean warming. To identify vulnerable species, we need to identify their tolerances to increasing temperatures and determine whether tolerances are altered by co-occurring drivers such as inorganic nutrient levels. This is particularly important for those species with restricted distributions, which may already be experiencing thermal stress. To identify thermal tolerance of the range-restricted kelp <i>Lessonia corrugata</i>, we conducted a laboratory experiment on juvenile sporophytes to measure performance (growth, photosynthesis) across its thermal range (4–22°C). We determined the upper thermal limit for growth and photosynthesis to be ~22–23°C, with a thermal optimum of ~16°C. To determine if elevated inorganic nitrogen availability could enhance thermal tolerance, we compared the performance of juveniles under low (4.5 μmol · d<sup>−1</sup>) and high (90 μmol · d<sup>−1</sup>) nitrate conditions at and above the thermal optimum (16–23.5°C). Nitrate enrichment did not enhance thermal performance at temperatures above the optimum but did lead to elevated growth rates at the thermal optimum. Our results indicate <i>L. corrugata</i> is likely to be extremely susceptible to moderate ocean warming and marine heatwaves. Peak sea surface temperatures during summer in eastern and northeastern Tasmania can reach up to 20–21°C, and climate projections suggest that <i>L. corrugata's</i> thermal limit will be regularly exceeded by 2050 as southeastern Australia is a global ocean-warming hotspot. By identifying the upper thermal limit of <i>L. corrugata</i>, we have taken a critical step in predicting the future of the species in a warming climate.</p>","author":"Cody James, \nCayne Layton, \nCatriona L. Hurd, \nDamon Britton","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"aa544cb08ad429cae20ec7cd8ab91387ed0aba6baa7871bf2da78b88728b1cfc","category":"Environment"}