{"title":"Principles of amyloplast replication in the ovule integuments of Arabidopsis thaliana","link":"https://academic.oup.com/plphys/article/196/1/137/7687005?rss=1","date":1717372800000,"content":"<span><div>Abstract</div>Plastids in vascular plants have various differentiated forms, among which amyloplasts are crucial for starch storage and plant productivity. Despite the vast knowledge of the binary-fission mode of chloroplast division, our understanding of the replication of non-photosynthetic plastids, including amyloplasts, remains limited. Recent studies have suggested the involvement of stromules (stroma-filled tubules) in plastid replication when the division apparatus is faulty. However, details of the underlying mechanism(s) and their relevance to normal processes have yet to be elucidated. Here, we developed a live analysis system for studying amyloplast replication using Arabidopsis (<span>Arabidopsis thaliana</span>) ovule integuments. We showed the full sequence of amyloplast development and demonstrated that wild-type amyloplasts adopt three modes of replication, binary fission, multiple fission, and stromule-mediated fission, via multi-way placement of the FtsZ ring. The <span>minE</span> mutant, with severely inhibited chloroplast division, showed marked heterogeneity in amyloplast size, caused by size-dependent but wild-type modes of plastid fission. The dynamic properties of stromules distinguish the wild-type and <span>minE</span> phenotypes. In <span>minE</span> cells, extended stromules from giant amyloplasts acquired stability, allowing FtsZ ring assembly and constriction, as well as the growth of starch grains therein. Despite hyper-stromule formation, amyloplasts did not proliferate in the <span>ftsZ</span> null mutant. These data clarify the differences between amyloplast and chloroplast replication and demonstrate that the structural plasticity of amyloplasts underlies the multiplicity of their replication processes. Furthermore, this study shows that stromules can generate daughter plastids via the assembly of the FtsZ ring.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"aa6128b1693475261329114f501373ecb468bbf8a7f59b23fab72bfa2fe88851","category":"Environment"}