{"title":"[ลือ] Google อาจย้ายการผลิต Pixel ในจีนไปยังอินเดีย","link":"https://www.blognone.com/node/134472","date":1687344287000,"content":"<div><div><div><p>ก่อนหน้านี้มีข่าวลือที่ <a href=\"https://www.blognone.com/node/130768\">Apple เริ่มลดการผลิตสินค้าในจีนเและกระจายการผลิตไปยังอินเดีย</a> ดูเหมือนว่า Google เองก็กำลังจะตามรอย Apple ไปเช่นกัน สำนักข่าว Bloomberg รายงานอ้างแหล่งข่าวระบุว่า Google กำลังเจรจากับบริษัทต่าง ๆในอินเดีย เช่น Lava International Ltd. Dixon Technologies India Ltd. และ  Bharat FIH (หน่วยงานของ Foxconn Technology Group ในอินเดีย)  เพื่อผลิตสมาร์ทโฟน Pixel และกระจายการผลิตออกจากประเทศจีน</p>\n<p>ด้าน Narendra Modi นายกรัฐมนตรีของอินเดีย ก็ได้เสนออินเดียเป็นทางเลือกสำหรับศูนย์กลางการผลิต เนื่องจากบริษัทจำนวนมากเริ่มกระจายการผลิตสินค้าในจีนไปยังประเทศอื่น หลังนโยบายปิดเมืองในช่วงโควิดระบาดหนักที่จีน รวมถึงปัญหาขัดแย้งทางการค้าระหว่างสหรัฐฯ และจีน</p>\n<p>เมื่อเดือนที่แล้ว Ashwini Vaishnaw รัฐมนตรีว่าการกระทรวงเทคโนโลยีของอินเดียได้พบกับ Sundar Pichai ซีอีโอของ Google ที่สำนักงานใหญ่ใน Mountain View รัฐแคลิฟอร์เนีย เพื่อเจรจาเกี่ยวกับการผลักดันการผลิตในอินเดียของ Modi และการผลักดันเทคโนโลยีที่รัฐสนับสนุน และในเดือนนี้ผู้บริหารกลุ่มสำคัญของ Google ก็ไปเยือนอินเดียเพื่อพูดคุยเรื่องความร่วมมือ</p>\n<p>อินเดียนั้นถือเป็นตลาดสำคัญในส่วนบริการของ Google แต่ในส่วนตลาดโทรศัพท์นั้น Google ยังเป็นรองโทรศัพท์ของจีนซึ่งมีราคาต่ำ ดังนั้นการผลิตในอินเดียจะช่วยเพิ่มยอดขายให้ Pixel ได้ และหากประสบความสำเร็จ Google อาจย้ายการผลิตฮาร์ดแวร์อื่น ๆ เช่น ลำโพง มายังอินเดียเช่นกัน</p>\n<p>อย่างไรก็ตามการเจรจาระหว่าง Google และทางอินเดียนั้นยังไม่แน่ชัด ดังนั้นบริษัทอาจเลือกที่จะไม่ผลิต Pixel ในอินเดียก็เป็นได้</p>\n<p>ที่มา : <a href=\"https://www.bloomberg.com/news/articles/2023-06-20/google-seeks-suppliers-to-move-some-pixel-production-to-india#xj4y7vzkg\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fbbe2b0f980558280940cc87fcbdf69e.jpg\" alt /></p>\n<blockquote><p>Met <a href=\"https://twitter.com/sundarpichai?ref_src=twsrc%5Etfw\">@sundarpichai</a> at the <a href=\"https://twitter.com/Google?ref_src=twsrc%5Etfw\">@Google</a> HQ. Good discussion on India Stack and Make in India program. <a href=\"https://t.co/Ul36NFA0CG\">pic.twitter.com/Ul36NFA0CG</a></p>\n<p>— Ashwini Vaishnaw (@AshwiniVaishnaw) <a href=\"https://twitter.com/AshwiniVaishnaw/status/1655891165844230144?ref_src=twsrc%5Etfw\">May 9, 2023</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/google-pixel\">Google Pixel</a></div><div><a href=\"/topics/india\">India</a></div><div><a href=\"/topics/china\">China</a></div></div></div>","author":"ydk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"aa76874fdf6c97f4c2b01c940edf822b3103a610e40a02215a7acbc86c48b091","category":"Thai"}