{"title":"These scientists are probing secrets of squid camouflage by hacking human cells","link":"https://arstechnica.com/?p=1927218","date":1680023931000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/squidskin2CROP-800x532.jpg\" alt=\"Certain squid have the ability to camouflage themselves by making themselves transparent and/or changing their coloration. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/squidskin2CROP.jpg\">Enlarge</a> <span>/</span> Certain squid have the ability to camouflage themselves by making themselves transparent and/or changing their coloration.  (credit: <a href=\"https://www.youtube.com/watch?v=0wtLrlIKvJE\">YouTube/KQED Deep Look</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Certain cephalopods like cuttlefish, octopuses, and squid have the ability to camouflage themselves by making themselves transparent and/or changing their coloration. Scientists would like to learn more about the precise mechanisms underlying this unique ability, but it's not possible to culture squid skin cells in the lab. Researchers at the University of California, Irvine, have discovered a viable solution: replicating the properties of squid skin cells in mammalian (human) cells in the lab. They <a href=\"https://www.eurekalert.org/news-releases/982709\">presented their research</a> at a meeting of the American Chemical Society being held this week in Indianapolis, Indiana.</p>\n<p>\"In general, there's two ways you can achieve transparency,\" UC-Irvine's Alon Gorodetsky, who has been fascinated by squid camouflage for the last decade or so, said <a href=\"https://www.youtube.com/watch?v=uU4wrA4QeF8&amp;list=PL-qHxGvFeZV1z1m5cYt9Wky8ai4fv7R-p&amp;index=6\">during a media briefing</a> at the ACS meeting. \"One way is by reducing how much light is absorbed—pigment-based coloration, typically. Another way is by changing how light is scattered, typically by modifying differences in the refractive index.\" The latter is the focus of his lab's research.</p>\n<p>Squid skin is translucent and features an outer layer of pigment cells called <a href=\"https://en.wikipedia.org/wiki/Chromatophore\">chromatophores</a> that control light absorption. Each chromatophore is attached to muscle fibers that line the skin's surface, and those fibers in turn are connected to a nerve fiber. It's a simple matter to stimulate those nerves with electrical pulses, causing the muscles to contract. And because the muscles are pulling in different directions, the cell expands, along with the pigmented areas, changing the color. When the cell shrinks, so do the pigmented areas.</p></div><p><a href=\"https://arstechnica.com/?p=1927218#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927218&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aa7f770e4de8ce2f40e5f129d23864791f83c0b434c530f658fc0f2446216e80","category":"Tech"}