{"title":"Evidence for dual targeting control of Arabidopsis 6-phosphogluconate dehydrogenase isoforms by N-terminal phosphorylation","link":"https://academic.oup.com/jxb/article/75/10/2848/7615057?rss=1","date":1708992000000,"content":"<span><div>Abstract</div>The oxidative pentose-phosphate pathway (OPPP) retrieves NADPH from glucose-6-phosphate, which is important in chloroplasts at night and in plastids of heterotrophic tissues. We previously studied how OPPP enzymes may transiently locate to peroxisomes, but how this is achieved for the third enzyme remained unclear. By extending our genetic approach, we demonstrated that Arabidopsis isoform 6-phosphogluconate dehydrogenase 2 (PGD2) is indispensable in peroxisomes during fertilization, and investigated why all PGD–reporter fusions show a mostly cytosolic pattern. A previously published interaction of a plant PGD with thioredoxin <span>m</span> was confirmed using Trx<sub><span>m2</span></sub> for yeast two-hybrid (Y2H) and bimolecular fluorescent complementation (BiFC) assays, and medial reporter fusions (with both ends accessible) proved to be beneficial for studying peroxisomal targeting of PGD2. Of special importance were phosphomimetic changes at Thr6, resulting in a clear targeting switch to peroxisomes, while a similar change at position Ser7 in PGD1 conferred plastid import. Apparently, efficient subcellular localization can be achieved by activating an unknown kinase, either early after or during translation. N-terminal phosphorylation of PGD2 interfered with dimerization in the cytosol, thus allowing accessibility of the C-terminal peroxisomal targeting signal (PTS1). Notably, we identified amino acid positions that are conserved among plant PGD homologues, with PTS1 motifs first appearing in ferns, suggesting a functional link to fertilization during the evolution of seed plants.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"aa90bb0501d8246c2836514df078e41ced44ed11bcac284f10a6c8f2dc621949","category":"Environment"}