{"title":"103 Integration of omics studies identifies molecular signatures associated with uterine function in beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/273/7757442?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Reproductive inefficiency is a major cause for economic loss in cattle operations. However, the mechanisms underlying their ethology are still unknown. Herein, we aimed to identify genes and genetic variants underlying the uterine function and their role in female fertility. To this end, we performed a multi-tiered approach to identify endometrial differentially expressed genes (DEGs) from beef heifers classified as fertile (n = 7) or sub-fertile (n = 5). Further, we used public RNA-Seq data from uterine luminal epithelial cells from beef cows (n = 43) to identify genetic variants affecting the expression of genes (expression quantitative trait loci - eQTLs) involved with pregnancy outcomes. We identified 798 DEGs underlying pathways important for pregnancy establishment, including inflammatory response and G-protein coupled receptor (GPCR) signaling (<span>P</span>-value ≤ 0.01). Based on the eQTL mapping analysis, we identified 4,676 cis and 7,682 trans eQTLs (FDR ≤ 0.05). Interestingly, some of the eQTLs overlapped with 13 reproduction-related traits from the CattleQTLdb (FDR ≤ 0.05), including daughter pregnancy rate and non-return rate. Additionally, these eQTLs were modulating the expression of transcription factors and DEGs previously associated with pregnancy outcomes in beef cows. The integration of gene lists from both studies resulted in 16 common genes, including F2 and P2RX5. The F2 gene encodes for a coagulation factor that plays a role in smooth muscle contraction and is modulated by a unique family of GPCRs. The expression of purinergic receptors, such as P2RX5, have been proposed to be major facilitators of attachment and implantation through calcium ions. Functional over-representation analysis highlighted metabolism, immune response, and hormone (estrogen and GnRH) signaling pathways affected by eQTL-regulated genes (<span>P</span>-value &lt; 0.01). Immune cells and regulatory pregnancy hormones, such as interferon tau and progesterone, are tightly regulated by each other and work cooperatively. GPCR signaling involves key regulatory hormones of the estrous cycle, specifically GnRH, LH, and FSH. Improper immune cell signaling, cyclicity, hormonal signaling, and smooth muscle contractions all affect the endometrium function, with potential downstream effects on pregnancy establishment and fertility. Dysregulation of these signaling pathways due to genetic variants could have detrimental effects, ultimately leading to failed pregnancy. Our findings provide novel insights into the genetic basis of reproductive processes in beef cattle. The molecular features and over-represented pathways could be used for identification of potential biomarkers for predicting pregnancy success. However, the underlying causal mechanisms modulating the expression of uterine genes warrant further investigation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aa9724d07f94dd5f36868faa97c7fc40c07506ad8f26055e9fa5663d6d27e496","category":"Environment"}