{"title":"TIL my iPhone is an extremely versatile QR code scanner","link":"https://www.macworld.com/article/1968269/how-to-scan-qr-codes-iphone-camera-siri.html","date":1692702900000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>QR or Quick Response codes are one of the most popular ways to access information on the go. Invented in 1994 and once considered the wave of the future, part of the QR code revival that started in 2017 with Apple’s iOS 11 update that included a QR code reader as part of its built-in Camera app.</p>\n\n\n\n<p>These square barcodes can house URLs, Wi-Fi passwords, contact information, restaurant menus, home sale walkthroughs, videos, App Store downloads, and just about anything you’d like.</p>\n\n\n\n<p>QR codes are easy to use if you know how to access the information they contain and have an internet connection. Here are a few ways to access QR code information using your iPhone with iOS 16.</p>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li>Tools required: iPhone</li><li>Materials required: iOS 16 or later</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Camera app</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/QR-Code-with-Camera-app.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS QR Code camera setting\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The easiest way to read a QR code is to use the good old Camera app on your iPhone. Here’s what to do.</p>\n\n\n\n<ol>\n<li>Make sure you have enabled the QR code settings for the Camera by going to Settings<em> &gt; Camera &gt; Scan QR Codes </em>and toggle the switch on.</li>\n\n\n\n<li>Launch the Camera app and position the QR code in the camera lens so that it focuses on the code.</li>\n\n\n\n<li>Tap the featured link (yellow notification) and that will send you to the website with the information you seek via a link in Safari.</li>\n</ol>\n\n\n\n<p>In the upcoming <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a> release, Apple has tweaked the Camera app’s QR Code interface. The link button automatically appears at the bottom of the Camera interface directly above the shutter button, rather than floating within the viewfinder as you focus on the code. It’s a small but significant refinement that will make it much easier to access the code’s information.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Code Scanner in the Control Center</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/QR-code-control-center.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16 QR Code Code Scanner\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If you add a QR Code control to the iPhone’s Control Center, the Code Scanner automatically opens the link in the proper app (Mail or Safari for example) without your having to tap on it. First, make sure it’s properly set up in the Settings app.</p>\n\n\n\n<ol>\n<li>Launch the Settings app, scroll down to <em>Code Scanner</em>, and tap the green <em>Plus</em> button. This adds the Code Scanner control to the bottom of the Control Center.</li>\n\n\n\n<li>Open the <em>Control Center</em> by swiping down from the top-right corner of your iPhone’s screen and then tap the <em>Code Scanner</em> icon to launch the scanning interface.</li>\n\n\n\n<li>Point your iPhone’s screen at a QR code (which appears with white brackets) and it will open the correct app or associated link automatically.</li>\n</ol>\n\n\n\n<p>Opening a QR code link with the Code Scanner is a more secure option than using the Camera app because the link opens in a sandboxed view rather than a URL.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Siri</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/QR-code-Siri.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16 Siri QR Code\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Using Siri is a super quick way to access the QR Code Scanner.</p>\n\n\n\n<ol>\n<li>Make sure you have Siri enabled via Settings<em> &gt; Siri &amp; Search</em>.</li>\n\n\n\n<li>Say: “Hey Siri, Scan a QR Code” or “Open QR Code Scanner.”</li>\n\n\n\n<li>The Control Center interface opens with an alert telling you to Find a code to scan.</li>\n</ol>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Third-party QR code apps</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/qr-code-ios-apps.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS QR code apps\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Why use a separate app? The iPhone’s native QR code readers offer bare-bones, read-only features, but if you want to create your own QR codes, you’ll need to turn to a third-party app. Some apps are completely free while others may offer only a free trial or require payment. Here are a few highly rated QR Code readers we found.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/qr-reader-for-iphone/id368494609&amp;xcust=1-1-1968269-1-0-0&amp;sref=https://www.macworld.com/feed\">QR Reader for iPhone</a> lets you scan QR codes, barcodes, puzzles, databases, business cards, and documents. You can also create, share, and export QR codes and approve referral websites before opening them.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/id1509675463&amp;xcust=1-1-1968269-1-0-0&amp;sref=https://www.macworld.com/feed\">QR Tiger QR Code Generator</a>, an ad-free QR code scanner, and creator, lets you create QR codes with images for links, URLs, contacts, text, Wi-Fi, business cards, applications, and social accounts. A dynamic option lets you edit codes, track data, change patterns, and colors, and add a logo.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/qr-barcode-scanner-for-iphone/id1322234579&amp;xcust=1-1-1968269-1-0-0&amp;sref=https://www.macworld.com/feed\">QR, Barcode Scanner for iPhone</a> lets you use your iPhone camera to automatically scan and recognize many types of QR code or barcode data, supports all major code formats, and includes a 2FA authenticator, the ability to create and share codes, and batch scanning. You can also view and save usage history, apply an app lock, and customize colors for the QR codes you create.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"aa98653fedc35bee6c81a46e0f66ba97e8cada7d82660aed58361eedc0cef15d","category":"Apple"}