{"title":"Stability and Hazard Assessment of the Progressive Zero Landslide in the Kalimpong Region of Darjeeling Himalaya, India","link":"http://link.springer.com/10.1007/s10706-023-02641-z","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Landslides pose serious hazards for mountainous communities. Therefore, slope stability and hazard assessments are imperative for Landslide Disaster Risk Reduction (LDRR). In this study, a progressive landslide, locally known as “Zero landslide” is investigated. This landslide was first initiated on July 16, 2014, and since then its repetitive recurrence has affected a total area of 1<span>\n                      \n                      <span>\\(\\times\\)</span>\n                      \n                    </span>10<sup>5</sup> m<sup>2</sup>. Field investigation revealed that different risk elements including a school, residential buildings, and nearby roads are threatened by this landslide. Hence, an attempt has been made for LDRR by incorporating geospatial, engineering geological, and geotechnical approaches. Further, to evaluate the stability of the present slope, finite element modelling (FEM) is used. The multi-temporal satellite image analysis reveals the retrogressive progression of this landslide. Kinematic analysis, Rock Mass Rating (RMR), Geological Strength Index (GSI), and Slope Mass Rating (SMR) methods derived results (RMR = 45, GSI = 25, SMR = 38.2) indicate that the in-situ geological condition favors the sliding process and has weaker rock mass. In the static loading condition, the FEM based stability analysis predicted lower Factor of Safety (FoS) values i.e., marginally stable in the dry condition (FoS = 1.07) and unstable in the wet condition (FoS = 0.78). The findings of the present study highlight the need to design and implement landslide risk mitigation measures prior to any major event at this particular location.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"aa9c57b2e28d1de6da963488d6bbe26a9623d0c81dbf8bdac00326e0915aae6f","category":"Environment"}