{"title":"Spotify CEO Daniel Ek on Apple's EU Changes: 'They Think the Rules Don't Apply to Them'","link":"https://www.macrumors.com/2024/01/26/spotify-on-apple-eu-app-changes/","date":1706307372000,"content":"Spotify CEO Daniel EK <a href=\"https://newsroom.spotify.com/2024-01-26/apples-proposed-changes-reject-the-goals-of-the-dma/\">today wrote a blog post</a> criticizing the app ecosystem changes that Apple implemented in the European Union under the Digital Markets Act, accusing Apple of putting forward \"a new plan that is a complete and total farce\" under \"the false pretense of compliance and concessions.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/08/General-Spotify-Feature.jpg\" width=\"2500\" height=\"1407\" />\r<br />\nEk says that Apple doesn't \"think the rules apply to them,\" and he believes that most app developers are not going to be able to adopt Apple's new terms.\r<br />\n\r<br />\nThe 0.50 euro Core Technology Fee collected per install per year (after 1 million installs) is \"extortion,\" according to Ek. Combined with the reduced commission through the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> (10-20% depending on options selected), Ek claims that developers of popular apps will pay \"the same or even more to Apple\" than with the prior rules.\r<br />\n\r<br />\n<div><blockquote><p>After sitting with our legal team to parse through the fine print of Apple's DMA announcement (that took a while), which is, at best vague and misleading, I wanted to share my thoughts.  <br /><br />While Apple has behaved badly for years, what they did yesterday represents a new low, even…</p>— Daniel Ek (@eldsjal) <a href=\"https://twitter.com/eldsjal/status/1750988499518362089?ref_src=twsrc%5Etfw\">January 26, 2024</a></blockquote> </div>\r<br />\nAccording to Ek, Spotify is facing \"an untenable situation.\" With Apple's new terms, Spotify would have to pay 0.50 euros per user along with a 17 percent commission, which is the same or worse as under the old rules. Ek claims that an alternative app store offering could potentially increase customer acquisition costs tenfold because of the need to pay the fee even for non-subscribers.<blockquote>And if we managed to remove our app from the App Store and only existed in the Alternative App Store, that would still not work. With our EU Apple install base in the 100 million user range, this new tax on downloads and updates could skyrocket our customer acquisition costs, potentially increasing them tenfold. This, as we have to pay on every install or update to our free or paid app, even for those who no longer use the service.</blockquote>Ek concludes that Apple is \"forcing developers to stay with the status quo,\" which \"negates the goal of the DMA.\" The future that Spotify <a href=\"https://www.macrumors.com/2024/01/24/spotify-shares-vision-iap-eu-regulation/\">outlined earlier this week</a> promising a better experience for users in the EU is \"less clear,\" according to Ek, and he calls on European Commissioners to reject Apple's \"blatant disregard\" of the DMA.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> CEO Tim Sweeney, another outspoken Apple critic, <a href=\"https://www.macrumors.com/2024/01/25/fortnite-returning-to-ios-in-europe/\">shared similar thoughts yesterday</a>. He said that the ‌App Store‌ changes are a \"devious new instance of malicious compliance\" aimed at thwarting the Digital Markets Act.\r<br />\n\r<br />\nSweeney said that while Fortnite will return to iOS through a planned ‌Epic Games‌ app marketplace on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, Epic will continue to \"argue to the courts and regulators that Apple is breaking the law.\"\r<br />\n\r<br />\nIn a statement to <em>MacRumors</em>, Apple said that it is happy to support the success of all developers, and that under the new business terms, more than 99 percent of developers will pay the same amount or less to Apple.<blockquote>We’re happy to support the success of all developers — including Spotify, which has the most successful music streaming app in the world. The changes we’re sharing for apps in the European Union give developers choice — with new options to distribute iOS apps and process payments. Every developer can choose to stay on the same terms in place today. And under the new terms, more than 99% of developers would pay the same or less to Apple.</blockquote><div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/26/spotify-on-apple-eu-app-changes/\">Spotify CEO Daniel Ek on Apple's EU Changes: 'They Think the Rules Don't Apply to Them'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-ceo-daniel-ek-on-apples-eu-changes-they-think-the-rules-dont-apply-to-them.2417538/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"aaa818164d8d30a8a7a543fde2ab69b9ad4c98eef199de98acdf6cc876bf3647","category":"Apple"}