{"title":"Genetic Characterization and Population Structure of Drug Resistant Mycobacterium tuberculosis Isolated from Brazilian Patients Using Whole-Genome Sequencing","link":"https://www.preprints.org/manuscript/202404.1209/v1","date":1713419461000,"content":"The present study aimed to determine the genetic diversity of isolates of Mycobacterium tuberculosis (Mtb) from presumed drug resistant tuberculosis patients from several states of Brazil. The isolates had been submitted to conventional drug susceptibility testing for first- and second-line drugs. Multidrug-resistant (MDR-TB) (54.8%) was the most frequent phenotypic resistance profile, in addition to an important high frequency of pre-extensively resistant (p-XDR-TB) (9.2%). Using whole-genome sequencing (WGS), we characterized 298 Mtb isolates from Brazil. Besides analysis of genotype distribution and possible correlations between molecular and clinical data, we determined the performance of an in-house WGS pipeline with other online pipelines for Mtb lineages and drug resistance profile definition. Sub-lineage 4.3 (52%) was the most frequent genotype and the genomic approach revealed a p-XDR-TB level of 22.5%. We detected 20 novel mutations in three resistance genes, and six of these were observed in eight phenotypically resistant isolates. Cluster analysis of 170 isolates showed that 43.5% of the TB patients belonged to 24 genomic clusters, suggesting considerable ongoing transmission of DR-TB, including two interstate transmissions. The in-house WGS pipeline showed the best overall performance in drug-resistance prediction, presenting the best accuracy values to five of nine drugs tested. Significant associations were observed between suffering from fatal disease and genotypic p-XDR-TB (p = 0.03) and either phenotypic (p = 0.006) and genotypic (p = 0.0007) ethambutol resistance. The use of WGS analysis improved our understanding of the population structure of MTBC in Brazil, genetic and clinical data correlations and demonstrating its utility for surveillance efforts for spread of DR-TB, hopefully helping to avoid the emergence of even more resistant strains and to reduce TB incidence and mortality rates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aab45a5a65c2ee3104ed1c6cda9bfcb57caf463b3c76467897dbc641ef98e387","category":"Interdisciplinary"}