{"title":"New data tracks failure rates of 13 SSD models, going back up to 4 years","link":"https://arstechnica.com/?p=1923511","date":1678735121000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1410783528-800x450.jpg\" alt=\"SSD M2 disk close up on dark background\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1410783528.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/disk-close-up-on-dark-background-royalty-free-image/1410783528?phrase=ssd&amp;adppopup=true\">Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Backblaze, a San Mateo, California-based backup and cloud storage firm, on Thursday shared data giving us a unique look at the reliability of SSDs over up to four years of use. Looking at the 2,906 SSDs in its possession, the company tracked the failure rates of mostly consumer-grade SSDs, which it started using as boot drives at the start of Q4 2018.</p>\n<p>Backblaze has long shared data on the <a href=\"https://arstechnica.com/gadgets/2023/02/new-data-illustrates-times-effect-on-hard-drive-failure-rates/\">reliability of hard disk drives</a> (HDDs), but this latest report provides fresh perspective on HDDs' speedier, pricier cousins. As detailed by Backblaze's <a href=\"https://www.backblaze.com/blog/ssd-edition-2022-drive-stats-review/\">blog post</a>, the company uses SSDs for booting storage servers, as well as reading, writing, and deleting log and temporary files made by said storage servers. Backblaze said all SSDs analyzed have \"similar\" workloads.</p>\n<p>Before we get into Backblaze's first table, which depicts annualized failure rates (AFRs) for 13 different SSDs models, it's important to note the limited sample size of 2,906 drives and differing number of drives for each model. Some drives have seen way more active use than others, with active days ranging from 104 days up to 724,240. So while these aren't apples-to-apples comparisons of SSD models, the table provides a broad glimpse at SSD reliability that the average person can't replicate on their own.</p></div><p><a href=\"https://arstechnica.com/?p=1923511#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923511&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aabe0fab782c0a97316c23bc09d4127a3b8058bbb3ddc3132040bed45e2ad3b2","category":"Tech"}