{"title":"The influence of health awareness on university students’ healthy lifestyles: The chain mediating role of self-esteem and social support","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311886","date":1728568800000,"content":"<p>by Zeqing Zhang, Haslinda Abdullah, Akmar Hayati Ahmad Ghazali, Jeffrey Lawrence D’Silva, Ismi Arif Ismail, Zerui Huang</p>\r\n\r\nAs university students face increasing pressures in a highly competitive society, unhealthy lifestyles have become a common phenomenon. Health awareness is considered a critical factor in promoting healthy behaviors, yet its mechanism of action on university students’ healthy lifestyles, influenced by self-esteem and social support, remains unclear. This study aims to explore the relationship between health awareness (HA) and healthy lifestyles (HL) and to examine the mediating roles of self-esteem (SE) and social support (SS) in this relationship. Based on social cognitive theory, this study initially constructs a theoretical model of the impact of health awareness on healthy lifestyles among university students, introducing self-esteem and social support as mediating variables to further build a chain mediation model. A total of 1,169 participants (554 males and 615 females) completed an online survey. Participants completed the Health Awareness Scale (HAS), the Diet and Healthy Lifestyle Scale (DEVS), the Rosenberg Self-Esteem Scale (RSES), and the Oslo Social Support Scale (OSSS-3). The results show that high levels of health awareness positively influence self-esteem, which in turn positively influences social support, ultimately having a positive impact on healthy lifestyles. Specifically, self-esteem and social support play significant mediating roles in the relationship between health awareness and healthy lifestyles. The findings reveal the pathway by which health awareness influences healthy lifestyles through self-esteem and social support, enriching the theoretical explanation of health behaviors within the framework of social cognitive theory, particularly in the context of university students. Furthermore, the results provide practical guidance, suggesting that in designing interventions to promote healthy lifestyles, emphasis should be placed on enhancing university students’ health awareness, self-esteem, and social support systems. This could include mental health education, establishing supportive communities, and fostering activities that promote self-esteem.","author":"Zeqing Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"aac5ed11fc737f75858ad4f3fedd2c757192e78bbcd7fe01f62408c187a5085f","category":"Interdisciplinary"}