{"title":"เผยแม้ Apple ให้โหลดแอปนอก App Store ได้ในยุโรป แต่แอปยังต้องถูกตรวจสอบ และหักค่าธรรมเนียม","link":"https://www.blognone.com/node/137849","date":1706107084000,"content":"<div><div><div><p>ตามที่กฎหมาย Digital Markets Act (DMA) ที่รัฐสภายุโรปออกมาเพื่อควบคุมการผูกขาดของแพลตฟอร์มออนไลน์ จะเริ่มมีผลบังคับใช้ในวันที่ 7 มีนาคมนี้ และแอปเปิลก็ต้องปฏิบัติตามโดย<a href=\"https://www.blognone.com/node/137682\">เพิ่มทางเลือก</a>ให้ผู้ใช้งานในกลุ่มประเทศ EU โหลดแอปผ่านช่องทางอื่นนอกเหนือจาก App Store ได้ด้วย ตอนนี้มีรายละเอียดเกี่ยวกับวิธีที่แอปเปิลจะเปิดให้ใช้งาน</p>\n<p>The Wall Street Journal อ้างแหล่งข่าวที่เกี่ยวข้องถึงวิธีการของแอปเปิล ซึ่งตอนนี้ยังไม่ประกาศออกมาเป็นทางการ ว่าแอปเปิลได้เจรจากับหน่วยงานกำกับดูแลของ EU ในช่วงที่ผ่านมา โดยย้ำว่าการดาวน์โหลดผ่าน App Store นั้น ทำให้ผู้ใช้งาน iPhone ปลอดภัยเพราะแอปเปิลได้ตรวจสอบแอปก่อน แต่เมื่อผู้ใช้งานจะสามารถโหลดแอปผ่านช่องทางอื่นได้ แอปเปิลก็ควรรีวิวตรวจสอบแอปเหล่านั้นได้ด้วย</p>\n<p>รายงานบอกว่านอกจากตรวจสอบแอปแล้ว แอปเปิลยังหารือในขั้นตอนที่จะทำให้แอปเปิลสามารถเก็บส่วนแบ่งค่าธรรมเนียมเหล่านั้นได้อีกด้วย</p>\n<p>ถึงตอนนี้ยังไม่มีข้อมูลว่าแล้วแอปเปิลจะไปควบคุมสโตร์เหล่านั้นอย่างไร แต่ส่วนของการคิดค่าธรรมเนียมนั้น อาจอ้างจากแนวทางล่าสุดที่แอปเปิลยอมให้นักพัฒนาสามารถจ่ายเงินนอกสโตร์ได้ในสหรัฐอเมริกา ซึ่งแอปเปิลจะ<a href=\"https://www.blognone.com/node/137709\">เก็บค่าธรรมเนียมที่ 27%</a></p>\n<p>ที่มา: <a href=\"https://www.wsj.com/tech/apple-plans-new-fees-and-restrictions-for-downloads-outside-app-store-f464f426\">The Wall Street Journal</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d59daae034059540b9158af97e68877c.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/eu\">EU</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"aac8fb62d5ededb0cb859248f4a56d4f6c6f24ba44dd1b67720c5e5333a47871","category":"Thai"}