{"title":"Constraints and solutions for development and uptake of integrated pest management in the UK","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12896?af=R","date":1710486000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5fdd32ae-a9bd-4e23-91a8-635a517508fc/aab12896-toc-0001-m.png\" alt=\"Constraints and solutions for development and uptake of integrated pest management in the UK\" />\n<p>Integrated pest management (IPM) yields agricultural improvements that support environmental aims. The IPM innovation system develops exciting products but encounters significant challenges in bringing them to market. This article reports the nine key recommendations emerging from an Association of Applied Biologists conference ‘<i>Bringing Biocontrol and IPM to Market</i>’, at which delegates from four key agricultural industry sectors discussed how to establish an effective IPM innovation system that links multiple stakeholders.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Agricultural improvements that reduce conventional pesticide use and support environmental aims are a priority. Current approaches develop promising alternative products but meet significant challenges in bringing them to market. This article reports findings of an Association of Applied Biologists event at which delegates from relevant industry sectors discussed the establishment of an effective integrated pest management innovation system linking multiple stakeholders. Interrelated recommendations were agreed upon, focused on structured gap analysis, co-design processes reflecting the complete innovation system, the approval process, application equipment, enhancing grower confidence, integrating knowledge exchange activities, promulgation of public good information and the need for an overarching national action plan and supporting legislation.</p>","author":"Keith F. A. Walters, \nGeraint Parry, \nJoshua Burnstone, \nKristina Grenz, \nRosemary Collier, \nToby Bruce","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"aad0e5f355b951002d0cf57003650332fb7c56a4754576db69923c5e51f6ab56","category":"Environment"}