{"title":"Temporal and Spatial Response of Ecological Environment Quality to Land Use Transfer in Nanling Mountain Region, China Based on RSEI","link":"https://www.preprints.org/manuscript/202404.0206/v1","date":1712190325000,"content":"Nanling Mountain region is a typical southern hilly region, which plays an important ecological and environmental protection role in China's overall land protection pattern. Based on the remote sensing image data of Longnan City in Nanling Mountain in 2013, 2018 and 2023, this paper interpreted the land use type and analyzed the land use transfer situation by using Land use transfer flow, and Land use transfer matrix. At the same time, based on the remote sensing Ecological index (RSEI) model, the ecological environment quality of Longnan City from 2013 to 2023 was retrieved. The temporal and spatial response model of ecological environment quality to land use transfer in Longnan City from 2013 to 2023 was discussed based on Spatial autocorrelation and Geographic detector. The results show that from 2013 to 2023, the decrease of forest land (16.23km²) and the increase of construction land (13.25km²) were the main land use transfer in Longnan City. The ecological environment index of Longnan City in 2013, 2018 and 2023 was 0.789, 0.917 and 0.872, respectively, showing a trend of \"first rising and then decreasing\". The ecological environment quality in the north of Longnan City was significantly lower than that in the south, and the poor ecological quality area appeared in and around the northern main urban area, showing a trend of \"inward contraction\". Forest land, garden land, grassland, cultivated land and water area have a positive impact on ecological environment quality, while traffic land, construction land and other land have a negative impact on ecological environment quality. The response of ecological environment quality to different land use transfer modes is related to the change of the overall ecological environment quality. The interaction between LUCC and other factors had a great impact on the evolution of ecological environment quality in Longnan City.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aad724b4094b644091038aa0f3f21f41525e107d073c3c9bb0ae9e2d290b601a","category":"Interdisciplinary"}