{"title":"The Cyclists’ Alliance focuses on athlete health with its new Duty of Care Framework","link":"https://cyclingtips.com/2021/10/the-cyclists-alliance-focuses-on-athlete-health-with-its-new-duty-of-care-framework/","date":1633540972000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/ceratizit1-650x418.jpg\" /></div><h2>The Cyclists' Alliance focuses on athlete health with its new Duty of Care Framework</h2><p>\n</p><p>One of the key goals for The Cyclists’ Alliance (TCA) is for all riders to reach the start line as healthy athletes. Since its inception in 2017, the Alliance has offered educational webinars and advice to riders on the subject of health, wellbeing, and nutrition. Now, they aim to formalise this with their new ‘Duty of Care Framework’ in partnership with Supersapiens. </p>\n\n\n\n<p>“We all decided to come together and think about how we could actually develop this further. So it’s not just information that’s presented on an ad-hoc basis, but actually try and set a minimum standard for female professional athletes,” says TCA representative Lexi Brown. </p>\n\n\n\n<p>“What the TCA can do is create the resources, facilitate it, and educate everyone to enable riders to make more informed decisions. And then what we need to do is advocate and collaborate with the UCI and the teams to bring in these regulations.” </p>\n\n\n\n<p>One of the key figures behind the initiative is Judith Haudum, a nutritionist with 15 years of experience working alongside professional cyclists. She has been involved with TCA for three years and will be available as part of the Framework to consult with riders on their nutritional needs. Haudum, as well as Drops-Le Col team doctor and retired rider Claire Rose and retired pro and advocate for female athlete health Nikki Brammeier pioneered the Framework. </p>\n\n\n\n<p>“It’s important that we’ve got such key experts and ex riders involved in facilitating this programme,” says Brown. “So it’s asked for by the riders, and then it’s being implemented also by them. So this is truly something that the peloton wants. It’s quite a tough sport to be involved in, and by putting these minimum requirements in place, it will just ensure that everyone is still competing at the highest level, but in the safest manner.”</p>\n\n\n\n<p>Riders are not the only ones that the Framework will hope to educate, however. “A lot of the surveys that we’ve done, we’ve seen that riders have been pressured into racing when maybe they’ve got an injury – whether that’s a concussion, or a physical injury – or even they’re struggling with mental health as well,” says Brown. </p>\n\n\n\n<p>“You actually need to educate team managers, the coaches, the sports directors. We were looking at the requirements to be a sports director, and from a UCI perspective, they only need to take a driving test. Shouldn’t these qualifications also require an element of female health and physiology? Even the medical checklists that the UCI has for the minimum requirement for WorldTour teams doesn’t include many female-specific conditions.” </p>\n\n\n\n<p>This is, in part, where Supersapiens CEO Phil Southerland hopes his energy management tool will come in. In addition to financially supporting the initiative, Supersapiens are also hoping to contribute to valuable research into female athlete health. “One thing we’ve started to see with the data is just the changes in glucose response to foods and training at different stages of the menstrual cycle,” Southerland says. “I think the access to the glucose data and helping women understand when their bodies need more carbs, when they need more fats and proteins based on different stages of the cycle can help to alleviate some of the mental burden that comes from trying to be at race weight.” </p>\n\n\n\n<p>For Haudum, the aim of the framework is simple: “Our goal is for sure to have healthy riders on the startline, but it would need to be backed up by the UCI,” she says. Currently, the UCI only mandates such minimum requirements for WorldTeams, leaving Continental squads vulnerable, but Haudum and her TCA colleagues are hoping for a trickle-down effect: “I think if you start on the road at the WorldTour level, you may get everyone else really buy into it because in the end you see the benefit if you have a healthy rider they are performing.”</p>\n\n\n\n<p>In practise, Brown explains, the Framework will take the form of an online platform where riders can access all of the information and services they need. However: “Our ideal vision is that this is a conference in person before the start of every season, but then we need the UCI on board,” she says. “There’s ongoing discussions there about how that roadmap will come to life and trying to get their buy-in – so that will be interesting.”</p>\n\n\n\n<p>Talks between TCA and The UCI on the implementation of the Framework are ongoing, but the hope is that the governing body will implement the suggestions and use the information that TCA gather from running the initiative to create a better environment for female pros. “Ideally, we want the UCI to back this and understand that being healthy on the start line is important and not to advocate these unhealthy situations that many riders find themselves in,” says Brown. </p>\n\n\n\n<p>“By launching this initiative now, with the help of Supersapiens and having the press talking about it and key stakeholders in the sport involved, we can take it to The UCI and try and work on a roadmap with them. … We’re launching this ourselves first because we can definitely kick-start the first element of the educational resources for riders. And then we will try and get the UCI on board if there is a clear appetite for it.”</p>\n\n\n\n<p>More information on The Cyclists Alliance Duty of Care Framework can be found on the Alliance’s website.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/the-cyclists-alliance-focuses-on-athlete-health-with-its-new-duty-of-care-framework/\">Read More</a>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"aad83a20c3efeb6425180f84a2cbdda37001d774c7639dccec8fbd27adf83bf2","category":"Cycling"}