{"title":"What physics can teach us about Pamplona’s annual running of the bulls","link":"https://arstechnica.com/?p=1820956","date":1639743317000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Physicists from Argentina and Spain have studied the pedestrian dynamics at the annual running of the bulls in Pamplona. </p></div>\n<p>In his first and arguably most famous novel, <a href=\"https://en.wikipedia.org/wiki/The_Sun_Also_Rises\"><em>The Sun Also Rises</em></a>, <a href=\"https://en.wikipedia.org/wiki/Ernest_Hemingway\">Ernest Hemingway</a> wrote tersely but lovingly about the annual <a href=\"https://en.wikipedia.org/wiki/Running_of_the_bulls\">running of the bulls</a> in Pamplona, Spain, during the seven-day <a href=\"https://en.wikipedia.org/wiki/Festival_of_San_Ferm%C3%ADn\">Festival of San Fermín</a>. \"One man fell, rolled to the gutter and lay quiet,\" the protagonist, Jake, observes while watching from a balcony. \"But the bulls went right on and did not notice him. They were all running together.\" A new analysis of the physics behind the dynamics of the crowds running from the bulls takes the probability of falling into account, according to <a href=\"https://www.pnas.org/content/118/50/e2107827118\">a recent paper</a> published in the Proceedings of the National Academy of Sciences.</p>\n<p>Local legend holds that the running of the bulls dates back to northeastern Spain it the early 14th century. Cattle herders at the time found that hurrying the beasts through the streets was an efficient way to move livestock from fields or barges to the market—or the bullfighting ring. Young men started racing in front of the charging bulls, competing to see who could make it safely to the bull pens without being overtaken (or worse, trampled and gored). The race eventually became part of the San Fermín festival and is now the festival's most popular event.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/bullrunTOP.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/bullrunTOP-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/bullrunTOP.jpg\">Revelers run with Nunez del Cuvillo's fighting bulls during the eighth day of the San Fermin Running of the Bulls festival on July 13, 2017, in Pamplona, Spain.</a> (credit: Gari Garaialde/Getty Images)</p></div>\n<p>Per official records, 15 people have died during the running of the bulls in Pamplona since 1910, usually from being gored. Sometimes bystanders can be injured or killed, too, especially if they're trying to capture live footage of the event with their smartphones. That happened during a different bull run, this time in Villaseca de la Sagra, Spain. In 2015, a 32-year-old man was <a href=\"https://arstechnica.com/tech-policy/2015/08/spaniard-fatally-gored-while-trying-to-film-bull-run-on-smartphone/\">gored from behind</a> while attempting to share his experience by way of a smartphone recording. The victim died of neck and thigh wounds. Hot tip: maybe running away from charging bulls isn't the best time to try to <a href=\"http://www.cnn.com/2014/07/14/travel/spain-pamplona-selfie/\">snap a selfie</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1820956#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820956&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aad8cb769224937b7c4ca1205bd85263ce77d5e9368451dae141ae3ee28d7c71","category":"Tech"}