{"title":"Green innovation for a sustainable environment: Modeling the new green knowledge production function for OECD countries","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12552?af=R","date":1724660350000,"content":"<h2>Abstract</h2>\n<p>The world community faces serious challenges such as climate change, biological loss, and environmental degradation. Developing ecological technologies is vital for coping with these unreversible crises. This study proposed a modified green knowledge production function to achieve sustainable development goals and generate policies for promoting environmental technologies. It examined the impact of market demands, environmental research and development expenditures, human capital, and environmental protection policies on the production of green environment technologies. Panel data included 16 OECD countries from 1990 to 2019. Data analysis strategies included the Gengenbach, Urbain, and Westerlund panel co-integration test, fully modified least squares, mean group dynamic least squares, and estimators such as feasible generalized least squares and panel-corrected standard errors for robust checks. A novel panel causality test via a half-panel jackknife estimator was also applied for causality analyses. The findings showed that human capital, market size, and environmental policy stringency played significant roles in producing environmental technologies and innovations. Although environmental expenditures made by the government positively affected the supply of green innovation, no statistically significant results were observed. The study highlights the importance of enhancing environmental innovation factors by promoting policies, including human capital development, environmental sanctions, and market demands for a sustainable environment.</p>","author":"Ferhat Özbay","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"aade62849885a9eefead5bf2063fd2b18c7afcb8bc18b9c251899873174c29ab","category":"Environment"}