{"title":"SlugAtlas, a histological and 3D online resource of the land slugs <i>Deroceras laeve</i> and <i>Ambigolimax valentianus</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312407","date":1729605600000,"content":"<p>by Carlos Lozano-Flores, Jessica Trujillo-Barrientos, Diego A. Brito-Domínguez, Elisa Téllez-Chávez, Rocío Cortés-Encarnación, Lizbeth D. Medina-Durazno, Sergio Cornelio-Martínez, Alejandro de León-Cuevas, Alejandro Ávalos-Fernández, Wilbert Gutiérrez-Sarmiento, Aldo Torres-Barrera, Fernando Javier Soto-Barragán, Gabriel Herrera-Oropeza, Ramón Martínez-Olvera, David Martínez-Acevedo, Luis C. Cruz-Blake, Vanessa Rangel-García, Gema Martínez-Cabrera, Jorge Larriva-Sahd, Reinher Pimentel-Domínguez, Remy Ávila, Alfredo Varela-Echavarría</p>\r\n\r\nDue to their distinctive anatomical characteristics, land slugs are appealing research subjects from a variety of angles, including stem cell biology, regeneration, embryonic development, allometry, and neurophysiology. Here we present SlugAtlas, an anatomical and histological online resource of the land slugs <i>Deroceras laeve</i> and <i>Ambigolimax valentianus</i>. The atlas is composed of series of histological sections on the horizontal, sagittal, and transversal planes for both species with 3D viewing tools of their major organs. The atlas was used in this work for a comparative analysis of the major organs and tissues of these two species. We provide a comprehensive histological description of them and an explanation of novel findings of unique features of their anatomy. For <i>D</i>. <i>laeve</i>, we additionally studied its ability for degrowth and regrowth, a feature that characterizes animals with high regeneration potential and obtained initial results on the study of the regeneration of its tail. SlugAtlas is a resource that is also built to accommodate future growth and, along with the experimental techniques that we have developed, will provide the foundation for research projects in a variety of biological domains.","author":"Carlos Lozano-Flores","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"aae3c7c8842d6b0c90f0f44f14169bcb4f0876238c6f84c119a4ebddc0611718","category":"Interdisciplinary"}