{"title":"PSLBI-27 Rumen microbiome dynamics in feedlot steers receiving free-choice garlic-infused mineral supplements","link":"https://academic.oup.com/jas/article/102/Supplement_3/650/7757681?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Garlic (<span>Allium sativum</span>) in its dehydrated or distillate (garlic oil) form has been used as a feed additive owing to its insecticidal, antimicrobial, and organoleptic properties. Commercial mineral mixtures have been formulated to contain a low proportion of dehydrated garlic powder as a strategy to deter pest flies and increase mineral intake in cattle. As an antimicrobial, garlic powder has the potential to alter the rumen microbiome, with possible implications for feed digestibility and the growth performance of beef cattle. This study evaluated the effect of short-term feeding of a garlic-mineral mixture in feedlot steers receiving high-grain diets. Four groups of twenty steers [total = 80, ~14 mo old, body weight (BW) = 599 ± 32 kg] were randomly assigned to either a 5% garlic-mineral (5DGP) or plain mineral supplement (MS). The individual feed and mineral intakes of the steers were measured with an automatic feeding system. Feed and mineral supplements were tracked in different bunks for each group. Baseline rumen fluid samples were collected from all steers at the end of an acclimatization period before administering the trial supplements. Rumen samples were later collected from 10 steers in each group with the greatest mineral supplement intake over the trial period. Total DNA and RNA were extracted from all rumen samples and subjected to metagenomic and metatranscriptomic sequencing, respectively. None of the bacterial species with an overall relative abundance of greater than 0.1% were differentially abundant between the two supplement treatments, nor did the rumen microbial community structures differ between the two groups (PERMANOVA: R<sup>2</sup> = 0.02, <span>P</span> = 0.43). Regardless of the dietary supplement, the rumen microbiome of the steers was dominated by uncultured <span>Prevotella spp.</span> (in addition to <span>Prevotella lacticifex</span>) as well as the uncharacterized UBA2810 sp900317945 and UBA2810 sp002351705. Overall, these results show that a 5DGP can be effectively administered to cattle without significantly disrupting the rumen microbiome.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aae47c904123e350aebb390e0cacdb5ceb9a983b4ede8ad19ae84cdad88ac7dc","category":"Environment"}