{"title":"RE:Village เวอร์ชั่นแคร็ก รันลื่นกว่าของแท้, ทีมแคร็กระบุ DRM ทำเกมกระตุก","link":"https://www.blognone.com/node/123726","date":1626335665000,"content":"<div><div><div><p>Digital Foundry เว็บไซต์ทดสอบประสิทธิภาพฮาร์ดแวร์และเกมชื่อดัง ทำการทดสอบประสิทธิภาพเกม RE:Village หลังผู้เล่นหลายคนประสบปัญหาเฟรมเรตตกในบางช่วง แต่กลับไม่พบปัญหาเดียวกันในเวอร์ชั่นแคร็ก โดยแฮกเกอร์ที่แคร็กเกมระบุว่าปัญหาเฟรมตกเหล่านั้นมาจากระบบ DRM ของ Capcom รวมกับ Denuvo</p>\n<p>Digital Foundry จึงนำตัวเกมเวอร์ชั่นของแท้ และแบบแคร็กแล้วมาทดสอบเปรียบเทียบ พบว่าตัวเกมแท้เกิดอาการเวลาในการเรนเดอร์เฟรม (frame time) พุ่งสูง และเฟรมเรตตก ในจังหวะที่ศัตรูขยับตัวบางแบบเมื่อถูกยิง และกระตุกหนักสุดเมื่อฝูงแมลงของ The Maiden ปรากฎในฉาก แต่เวอร์ชั่นที่แคร็กแล้ว ไม่มีปัญหานี้ และเฟรมเรตรันได้อย่างเสถียรกว่ามาก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d579f84906e3eb74df635ddc6b43a5ee.png\" /></p>\n<p>Digital Foundry มองว่าความเป็นไปได้มีสองแบบ คือถ้าแฮกเกอร์พูดจริง และตัวเกมกระตุกเพราะ DRM จริง คงเป็นเรื่องแย่ที่ลูกค้าที่จ่ายเงินเต็มราคา กลับได้สินค้าคุณภาพต่ำกว่า และ Capcom ควรแก้ไขเรื่องนี้ หรือถ้าแฮกเกอร์โกหก ก็แปลว่าตัวเกมมีปัญหาอื่นที่ Capcom ไม่แก้ หรือแก้ไม่ได้ แม้เกมออกมาหลายเดือนแล้ว แต่กลุ่มแฮกเกอร์กลับแก้ได้ ซึ่งก็แย่พอกัน</p>\n<p>Digital Foundry เน้นย้ำว่าวิดีโอนี้เป็นการชี้ให้เห็นถึงปัญหาของเกมที่ยังไม่ได้รับการแก้ไขเท่านั้น ไม่สนับสนุนการแคร็กเกม และแนะนำให้ผู้เล่นลองใช้ <a href=\"https://github.com/praydog/REFramework/\">mod ปรับเฟรมเรตตัวนี้</a> แทนลงแคร็ก พร้อมบอกว่าแม้ทีมงานทดสอบ mod ตัวนี้แล้วพบว่าปัญหายังอยู่เหมือนเดิม แต่ก็มีคอมเม้นต์จากหลายๆ คนว่าใช้แล้วเฟรมเรตดีขึ้น</p>\n<p>ที่มา - <a href=\"https://www.youtube.com/watch?v=UXZGCwAJpbM\">Digital Foundry</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/resident-evil\">Resident Evil</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/drm\">DRM</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"aaf08825c43b4acf5c86116996e74d3af7d3804a98bb9cda7147b48d13c742b0","category":"Thai"}