{"title":"Application of telemetry‐based fish habitat models to predict spatial habitat availability and inform ecological restoration","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15899?af=R","date":1724222724000,"content":"<h2>Abstract</h2>\n<p>Conservation decisions surrounding which fish habitats managers choose to protect and restore are informed by fish habitat models. As acoustic telemetry has allowed for improvements in our ability to directly measure fish positions year-round, so too have there been opportunities to refine and apply fish habitat models. In an area with considerable anthropogenic disturbance, Hamilton Harbour in the Laurentian Great Lakes, we used telemetry-based fish habitat models to identify key habitat variables, compare habitat associations among seasons, and spatially identify the presence distribution of six fish species. Using environmental data and telemetry-based presence–absence from 2016 to 2022, random forest models were developed for each species across seasons. Habitat variables with the highest relative importance across species included fetch, water depth, and percentage cover of submerged aquatic vegetation. The presence probability of each species was spatially predicted for each season within Hamilton Harbour. Generally, species showed a spatial range expansion with greater presence probability in the fall and winter to include parts of the harbor further offshore, and a range contraction in the spring and summer toward the nearshore, sheltered areas, with summer having the most limited habitat availability. Greater habitat suitability was predicted in western Hamilton Harbour for the majority of species, whereas the east end was less suitable and may benefit from habitat restoration. These types of fish habitat models are highly flexible and can be used with a variety of data, not just telemetry, and should be considered as an additional tool for fish habitat and fisheries managers alike.</p>","author":"Sarah M. Larocque, \nPaul A. Bzonek, \nJacob W. Brownscombe, \nGillian K. Martin, \nJill L. Brooks, \nChristine M. Boston, \nSusan E. Doka, \nSteven J. Cooke, \nJonathan D. Midwood","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"aaf9178255d03704c1ff8c90d29de51715f97b76a8dba9944c79722487be7c6d","category":"Environment"}