{"title":"PSVII-5 Heat shock protein 70 gene expression and association with morphometric and heat tolerance traits in three plumage colors of Noiler chicken exposed to acute heat stress","link":"https://academic.oup.com/jas/article/102/Supplement_3/443/7757759?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Heat stress is one of the most difficult climatic conditions chickens faces and is a direct result of climate change. It is important to research poultry thermotolerance because it may help find genetic lines resistant to heat stress. This study investigated the influence of plumage colors on heat shock protein 70 gene expression in Noiler chickens exposed to acute heat stress. Noiler is a dual-purpose breed developed for smallholder poultry production in Nigeria. A total of 150 birds of three plumage colors (black, brown and white) of mixed sexes were used for the experiment. The birds were raised in deep litter house separated into six groups of 25 birds each and fed with commercial broiler diets from 0-8 wk and broiler finisher diets from 8 to 12 wk old. The birds were shared into treatments in 3 x 2 x 2 factorial arrangements with 3 plumage colors (black, brown, white), two temperature regimens (Control/thermoneutral, Heat stress) and sex of birds (male, female). The heat stressed birds were exposed to 41<sup>o</sup>C for 8 h from 0600 h to 1400 h for 7 d while control group maintained a thermoneutral temperature range of 30 <sup>o</sup>C to 32 <sup>o</sup>C for the same period. At 13 wk old, two birds were selected per treatment, slaughtered and the spleen removed and stored in RNA later for heat shock protein (HSP) 70 gene expression. Data collected were analyzed with Microsoft excel code for fold expression of HSP70 gene while GLM procedure in SAS was used to determine difference in expression of gene. The relative expression of HSP70 brown plumage was greater, upregulated compared with black and white. White plumage birds in control/thermoneutral group were significantly greater in HSP70 expression than other plumage colors and heat stressed birds. Association of HSP70 delta threshold cycle (DCT) values with morphometric and heat tolerance traits were investigated (Figure 1). High negative correlations emerged between HSP70DCT expression and body weight (-0.65), body temperature (-0.73) with moderate positive correlation for rectal temperature (0.55) in black birds (Table 1). HSP70 DCT positively correlated with body weight (0.70), breast/leg circumferences but negatively with wing length, suggesting reduced surface area during heat stress and a supportive role in maintaining protein integrity (Figure 2). For white Noiler birds, HSP70DCT associated negatively with body weight (-0.94) and positively with rectal temperature during heat stress (Table 2). Thermoneutral birds were positively correlated with heat tolerance traits except temperature while heat stressed birds showed low positive correlation with respiratory and pulse rates and very low positive relationship with body and rectal temperatures (Table 4). Sex-based differences emerged, with potential compromise between HSP70-mediated growth/composition in males versus muscle maintenance in females, although leg length/circumference showed shared developmental regulation (Figure 3, Table 3). These findings highlight HSP70’s versatile roles in systemic heat tolerance mechanisms influenced by plumage color, temperature regime and sex.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aafa8e9f0a3615d9fabbf6a42074f7ef22ff341995e27f36bb0c017a69eb7046","category":"Environment"}