{"title":"PSII-3 Evaluation of a microneedle patch for the delivery of meloxicam in a veterinary application","link":"https://academic.oup.com/jas/article/102/Supplement_2/260/7664739?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>In the livestock industry, animals undergo painful procedures such as castration and these practices have received increased scrutiny and concern regarding animal welfare. Nonsteroidal anti-inflammatory drugs (NSAIDs) have been used to treat pain and inflammation in livestock. Novel administration routes such as transdermal drug delivery using polymeric biodegradable microneedle patches that are being developed to deliver drugs in a less stressful method. Therefore, the objective of this study was to evaluate meloxicam plasma concentrations when drug was delivered using a microneedle patch. Nursing pigs (n <span>= 7;</span> body weight = 3.69 ± 1.12 kg) from 1 litter were stratified into 1 of 3 treatment groups. Treatments were: 1) 0.5 mg of meloxicam/kg of body weight via oral drench (n = 2; oral); 2) a patch devoid of meloxicam (n = 1; placebo); or 3) 2.5 mg of meloxicam/kg of body weight delivered via microneedle patch (n = 4; patch). During the study, pigs remained in the crate with the sow and littermates. Blood was collected via jugular venipuncture for plasma analysis at 0, 8, 24, 48, and 72 h. An Estrotect Breeding Indicator strip was used to adhere the microneedle patch on the ear of the pigs. Briefly, the strip was cut to the size of the ear, a microneedle patch was placed at the center, and these were applied on the pinna of the ear after blood collection at 0 h. Statistical analyses were performed using the MIXED procedure of SAS 9.4 (Cary, NC) to assess the effects of treatment, time, and treatment × time interaction. Statistical significance was determined at <span>P</span> ≤ 0.05, with tendencies at 0.05 <span>&lt; P</span> ≤ 0.1. There was a treatment × time interaction (<span>P</span> = 0.0074), with the pigs that received oral meloxicam having greater meloxicam plasma concentrations at 8 h compared with pigs that received a placebo patch or a patch containing meloxicam (<span>P</span> &lt; 0.0001). There were no differences in plasma meloxicam concentrations between pigs receiving a placebo patch or a patch containing meloxicam (<span>P</span> = 0.9). Plasma levels of meloxicam were detectable but low in pigs that received a microneedle patch (0.91 ng/mL). Research is continuing to determine the ideal microneedle patch polymer and structure that would deliver meloxicam to achieve desired plasma concentrations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aafd64bf6f10f56c2454bf38660505e566807a77d7415d9acf58387c67b1ded5","category":"Environment"}