{"title":"Did the COVID-19 pandemic delay treatment for localized breast cancer patients? A multicenter study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304556","date":1717164000000,"content":"<p>by Ke Zhou, Marie Robert, Valérie Seegers, Audrey Blanc-Lapierre, Stéphane Savouroux, Frédéric Bigot, Jean-Sébastien Frenel, Mario Campone, Thierry Conroy, Frédérique Penault-Llorca, Jean-Luc Raoul, Martine M. Bellanger</p>\r\nBackground <p>Longer times between diagnosis and treatments of cancer patients have been estimated as effects of the COVID-19 pandemic. However, relatively few studies attempted to estimate actual delay to treatment at the patient level.</p> Objective <p>To assess changes in delays to first treatment and surgery among newly diagnosed patients with localized breast cancer (BC) during the COVID-19 pandemic.</p> Methods <p>We used data from the PAPESCO-19 multicenter cohort study, which included patients from 4 French comprehensive cancer centers. We measured the delay to first treatment as the number of days between diagnosis and the first treatment regardless of whether this was neoadjuvant chemotherapy or surgery. COVID-19 pandemic exposure was estimated with a composite index that considered both the severity of the pandemic and the level of lockdown restrictions. We ran generalized linear models with a log link function and a gamma distribution to model the association between delay and the pandemic.</p> Results <p>Of the 187 patients included in the analysis, the median delay to first treatment was 42 (IQR:32–54) days for patients diagnosed before and after the start of the 1<sup>st</sup> lockdown (N = 99 and 88, respectively). After adjusting for age and centers of inclusion, a higher composite pandemic index (&gt; = 50 V.S. &lt;50) had only a small, non-significant effect on times to treatment. Longer delays were associated with factors other than the COVID-19 pandemic.</p> Conclusion <p>We found evidence of no direct impact of the pandemic on the actual delay to treatment among patients with localized BC.</p>","author":"Ke Zhou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab0277a954c891173f45f0b870a71a6883b755479a7f9a5a373753e0cfd6bd80","category":"Interdisciplinary"}