{"title":"Determinants of Neonatal Mortality at the David Bernardino Paediatric Hospital in Angola: A Case-Control Study Using Theoretical Frameworks","link":"https://www.preprints.org/manuscript/202410.0434/v1","date":1728294725000,"content":"Neonatal mortality rates in developing countries are influenced by a complex array of factors. Despite advancements in healthcare, Angola has one of the highest neonatal mortality rates in sub-Saharan Africa, with significant contributors including premature birth, intrapartum events, tetanus, and sepsis. This study aimed to identify the primary causes and contributing factors of neonatal mortality among infants admitted to the Neonatology Service at DBPH in Luanda from May 2022 to June 2023. A retrospective matched case-control design was employed, pairing each neonatal death with two surviving neonates based on age and sex. The analysis included 318 newborns, of whom 106 experienced hospital deaths. A stepwise binary logistic regression model was used to examine associations between variables and neonatal mortality. Variables with p &lt; 0.25 in bivariate analysis were included in the multivariate model. Significant factors associated with neonatal mortality included: a low Apgar score at 1 minute (&lt; 7) (OR 2.172; 95% CI: 1.436–4.731); maternal age under 20 years (OR 3.746; 95% CI: 2.172–6.459); home delivery (OR 1.769; 95% CI: 1.034–3.027); and a short hospital stay of ≤ 48 hours (OR 2.791; 95% CI: 1.183–6.587). Addressing these issues requires urgent interventions, including improving Apgar score management through enhanced training for healthcare professionals, supporting young mothers with intensified maternal education, ensuring deliveries occur in appropriate healthcare settings, and improving universal health coverage and referral systems. These measures could be crucial for enhancing neonatal care and reducing mortality.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ab03bba7b1d0fa4931cf09dacddce1c7104b577bebdc91608ecea50116795fef","category":"Interdisciplinary"}