{"title":"What caused the volcanic tsunami that devastated a Greek island 373 years ago?","link":"https://arstechnica.com/?p=1979226","date":1698434994000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/kolumbo5-800x523.jpg\" alt=\"This view from an international volcano monitoring system shows the Kolumbo volcanic crater on the seafloor.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/kolumbo5.jpg\">Enlarge</a> <span>/</span> This view from an international volcano monitoring system shows the Kolumbo volcanic crater on the seafloor. (credit: SANTORY )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1650 CE, the Greek island of <a href=\"https://en.wikipedia.org/wiki/Santorini\">Santorini</a> was devastated by the eruption of an underwater volcano called <a href=\"https://en.wikipedia.org/wiki/Kolumbo\">Kolumbo</a>. People first noticed the water boiling and changing color and a cone poking out of the surface of the sea. Next came ejected glowing rocks, fire and lightning, fumes of thick smoke, falling pumice and ash, earthquakes, and a powerful tsunami with waves as high as 20 meters. All this eruptive activity killed around 70 people and hundreds of cattle.</p>\n<p>These details are based on contemporary accounts compiled by French geologist <a href=\"https://en.wikipedia.org/wiki/Ferdinand_Andr%C3%A9_Fouqu%C3%A9\">Ferdinand A. Fouqué</a> in 1879. A team of German and Greek scientists has now combined that historical knowledge with 3D seismic mapping and computer simulations to determine why the volcano's violent eruption triggered a tsunami. According to a <a href=\"https://www.nature.com/articles/s41467-023-42261-y\">new paper</a> published in the journal Nature Communications, the tsunami resulted from a landslide followed by the volcanic explosion.</p>\n<p>Located some 8 kilometers northeast of Santorini, Kolumbo also erupted <a href=\"https://en.wikipedia.org/wiki/Minoan_eruption\">around 1630 BCE</a> with catastrophic consequences for ancient Minoan culture. Today, the volcano boasts sulfide-sulfate hydrothermal vents that are home to some rare species of microorganisms typically not found elsewhere near hydrothermal vents. And it <a href=\"https://news.agu.org/press-release/surprise-magma-chamber-growing-under-mediterranean-volcano/#:~:text=Using%20a%20new%20method%2C%20researchers,underwater%20volcano%20near%20Santorini%2C%20Greece.&amp;text=Submarine%20volcanic%20activity%20along%20a,observed%20with%20SANTORY%20monitoring%20equipment.\">remains active</a> and potentially dangerous: A previously unknown magma chamber was <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2022GC010475\">discovered last year</a> and is growing at a rate of around 4 million cubic meters per year. At that rate, the chamber will reach the same volume as the amount of magma ejected in the 1650 eruption within the next 150 years.</p></div><p><a href=\"https://arstechnica.com/?p=1979226#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979226&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ab08af63ad5d22428c14664539d442bc4867b1ef1c23cd21b6ebfd25fb04a1c6","category":"Tech"}