{"title":"Twitter Has Begun Paying a Select Group of ‘Creators’","link":"https://help.twitter.com/en/using-twitter/creator-ads-revenue-sharing","date":1689479940000,"content":"\n<p>Twitter:</p>\n\n<blockquote>\n  <p>To be considered eligible for creator ads revenue sharing\nyou must:</p>\n\n<ol>\n<li>Be subscribed to Twitter Blue or Verified Organizations</li>\n<li>Have at least 5M impressions on your posts in each of the last\n3 months.</li>\n<li>Pass human review for Creator Monetization Standards.</li>\n</ol>\n</blockquote>\n\n<p>The idea is that this will turn Twitter into a YouTube-like platform for high-profile accounts. Seems like it might be a sham at this point though — there’s no open enrollment, and the people who are getting paid now seem hand-selected by Elon Musk. <a href=\"https://www.washingtonpost.com/technology/2023/07/13/twitter-creators-payments-right-wing/\">Taylor Lorenz, writing for The Washington Post</a>:</p>\n\n<blockquote>\n  <p>Former Twitter staffers who worked on creator-focused products\nexpressed skepticism over the rollout, with several calling it a\nPR stunt. One former Twitter executive who worked on creator\npartnerships and who spoke on the condition of anonymity to avoid\nretaliation, said that “any kind of content monetization we’ve\ndone in the past was based on a revenue model. This just feels\npulled out of thin air for a specific subset of creators that he\nwanted to placate.”</p>\n\n<p>The former Twitter executive also cast doubt on Twitter’s revamped\nmetrics, including impressions. “The numbers are totally and\ncompletely bogus. It’s all completely made up. It really feels\nlike they’re arbitrarily writing checks to people they like, which\nis not a sustainable creator strategy.”</p>\n</blockquote>\n\n<p>It’s worth taking quotes from anonymous “former Twitter staffers” with a grain of salt (and, perhaps, taking Lorenz’s byline <a href=\"https://www.noahpinion.blog/p/dont-be-a-doomer\">with its own grain of salt</a>), but it’s worth taking new Twitter initiatives with a truckload of salt. I really doubt this is going to prove sustainable. Would be kind of awesome, though, for someone to eventually be able to declare themselves a professional tweeter.</p>\n\n<p>But it kind of smells like a scam: First you sign up to pay Twitter $8/month. Then you wait and see if you get selected to participate. Then they <em>might</em> start paying you. It’s like Amway-style multi-level marketing for social media.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/15/twitter-paying-creators\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ab0d7ee6e167b877ea46a2aaecd52c96c07356a4c937b4843c47ca945616b0bf","category":"Tech"}