{"title":"Flag of the Netherlands","link":"https://markpeak.net/flag-of-the-netherlands/","date":1627918462000,"content":"<p>ภาพประกอบ <a href=\"https://commons.wikimedia.org/wiki/File:Dutch-flag-DSC_0037.jpg\">Wouter Engler / Wikipedia</a></p>\n<p>เขียนเรื่อง<a href=\"https://markpeak.net/flag-of-france/\">ธงชาติฝรั่งเศส</a>ไปแล้ว วันนี้มาดูเรื่อง <a href=\"https://en.wikipedia.org/wiki/Flag_of_the_Netherlands\">ธงชาติเนเธอร์แลนด์</a> ที่เป็นต้นฉบับของธง 3 สี (tricolor) ของธงในยุคปัจจุบันกันบ้าง</p>\n<p>เหตุการณ์ต้องย้อนไปไกลถึงปี 1568 ที่กลุ่มประเทศ Low Countries (เนเธอร์แลนด์ เบลเยียม ลักเซมเบิร์ก ซึ่งตอนนั้นยังไม่เป็นประเทศ) ลุกฮือขึ้นสู้กับการปกครองของจักรวรรดิสเปนยุคราชวงศ์ Habsburg ที่ปกครองพื้นที่แถบนั้น</p>\n<p>แกนนำของฝ่ายเนเธอร์แลนด์คือ <a href=\"https://en.wikipedia.org/wiki/William_the_Silent\">William of Orange</a> หรือ William the Silent เจ้าชายแห่งแคว้น Orange (ปัจจุบันอยู่แถวๆ ตอนใต้ของฝรั่งเศส) ที่เป็นหนึ่งในข้าราชการของข้าหลวงแห่งเนเธอร์แลนด์ แต่ตอนหลังก็มาเข้ากับฝ่ายเนเธอร์แลนด์จนกลายเป็นผู้นำ ซึ่งฝ่ายเนเธอร์แลนด์ก็ชนะและปลดแอกจากสเปนได้ ลูกหลานของ William ก็กลายเป็นกษัตริย์ปกครองเนเธอร์แลนด์ต่อมา (William จึงถือเป็นผู้ก่อตั้งประเทศเนเธอร์แลนด์ แม้ไม่ได้เป็นกษัตริย์ก็ตาม)</p>\n<p>กองทัพของ William ใช้สัญลักษณ์สี “ส้ม-ขาว-น้ำเงิน” ที่ในเวลาถัดมากลายเป็นธงของกองเรือ จึงได้ชื่อว่า <a href=\"https://en.wikipedia.org/wiki/Prince%27s_Flag\">Prince’s Flag</a> หรือธงของเจ้าชาย William</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/Prinsenvlag.svg_.png\" /></p>\n<p>ธงนี้ถูกใช้งานนับจากนั้นมา เวลาผ่านมาถึงราวๆ ปี 1630 สีส้มของธงเพี้ยนกลายเป็นสีแดง โดยคาดกันว่าน่าจะเป็นเพราะสีส้มผสมยาก สีเหลืองซีดง่ายกว่า ใช้นานๆ ไปจะกลายเป็นสีแดงไปเอง แต่ไม่ว่าด้วยเหตุผลใดก็ตาม ส้มกลายเป็นแดง</p>\n<p>ในเวลาต่อมาเมื่อเนเธอร์แลนด์กลายเป็นสาธารณรัฐ ธงนี้จึงเปลี่ยนชื่อมาเป็น <a href=\"https://en.wikipedia.org/wiki/Statenvlag\">Statenvlag</a> (States Flag) โดยได้ชื่อใหม่อย่างเป็นทางการในปี 1664</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/Statenvlag.svg_.png\" /></p>\n<p>ธง Statenvlag กลายเป็น “แรงบันดาลใจ” ให้กับธงของรัฐยุคใหม่อื่นๆ เช่น ฝรั่งเศส และ รัสเซีย โดยมีการเปลี่ยนแปลงเรื่องสีเล็กน้อย คือเปลี่ยนจากน้ำเงินอ่อนมาเป็นน้ำเงินเข้มในภายหลัง</p>\n<p>ส่วนธง Prince’s Flag ฉบับดั้งเดิมยังถูกใช้งานต่อในอดีตอาณานิคมของดัทช์หลายแห่ง เช่น หลายเขตในนิวยอร์ก (ที่เดิมคือคือ นิวอัมสเตอร์ดัม) ก็ยังใช้ธงน้ำเงิน ขาว ส้ม จนถึงปัจจุบัน</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/Flag_of_the_Netherlands.svg_.png\" /></p>The post <a href=\"https://markpeak.net/flag-of-the-netherlands/\">Flag of the Netherlands</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ab120e209bc3c697652619c54dd94147fcc2d7820ce982e34f322ff817c6e3bd","category":"Thai"}