{"title":"Flower/testa colour associations with grain yield, quality and tolerance to seed weevil in grass pea phenotypes","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12880?af=R","date":1707891301000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1fc87230-937c-45ba-854c-a803b3e04057/aab12880-toc-0001-m.png\" alt=\"Flower/testa colour associations with grain yield, quality and tolerance to seed weevil in grass pea phenotypes\" />\n<p>Three phenotypes of <i>Lathyrus sativus</i> L. differing in flower and testa colouration differed only in the number of seeds per pod. The phenotype with white flower and testa had the lowest seed number per pod. In this phenotype, bruchid- and parasitoid-damaged seeds had low germination and gave malformed plants which yielded comparably to plants emerged from intact seeds.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Grass pea (<i>Lathyrus sativus</i> L.) is considered an orphan/underutilised grain legume with high yield and nutritive potential. It is variable in flower and seed coat (testa) colour and this variation could possibly be used as a biomarker in phenotypic selection for yield and quality traits. Three phenotypes differing in flower/testa colour (white flower-white to creamy testa and white hilum [T<sub>W</sub>H<sub>W</sub>], slightly blue banner and wing colouration-white to creamy testa and coloured halo around hilum [T<sub>W</sub>H<sub>C</sub>] and blue banner and wing colouration-spotted testa and coloured halo around hilum [T<sub>S</sub>H<sub>C</sub>]) were tested over two growing seasons, under rainfed, Mediterranean conditions. They differed only in the number of seeds per pod; the phenotype T<sub>W</sub>H<sub>W</sub> had the lowest number (2.2 seeds pod<sup>−1</sup>). The seed yield per plant (SY) was highly correlated with the number of pods per plant and was higher under wetter and warmer conditions during the reproductive period (April–May). The three phenotypes showed no difference in tolerance against bruchid (<i>Bruchus tristiculus</i>) infection (<i>F</i>\n<sub>2,8</sub> = 0.14, <i>p</i> &gt; .05), which was higher in the most productive growing season (6.44%, <i>F</i>\n<sub>1,4</sub> = 14.8, <i>p</i> &lt; .05). In the phenotype T<sub>W</sub>H<sub>W</sub>, three seed classes (intact, bruchid-damaged, parasitoid-damaged seeds) were tested for SY, quality traits and tolerance to bruchids. Though insect damaged seeds showed significant reduction in emergence rates (from −57% up to −91%), there were no differences in SY (19.11–24.53 g plant<sup>−1</sup>, <i>F</i>\n<sub>2,8</sub> = 0.86, <i>p</i> &gt; .05) and yield components (seeds per pod, 1000-seed weight, number of pods per plant). However, seeds of plants derived from parasitoid-damaged seeds had higher concentration of the neurotoxin ODAP (4.92 mg g<sup>−1</sup>, <i>F</i>\n<sub>2,8</sub> = 8.76, <i>p</i> &lt; .01). On the other hand, seeds of plants derived from bruchid-damaged seeds showed higher percentage of damaged seeds by the endoparasitoid <i>Triaspis thoracica</i> (2.25% vs. 0.67%–1.00%, <i>F</i>\n<sub>2,8</sub> = 5.47, <i>p</i> &lt; .05). Concluding, flower and testa colour cannot be used as biomarkers of seed yield and quality in grass pea, but it seemed that a tripartite interaction (grass pea–bruchid–endoparasitoid) may occur that affects ODAP concentration and the susceptibility of seeds to insect damages.</p>","author":"Ioannis T. Tsialtas, \nMaria Irakli","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"ab26f581458d124888f6ada64f821b756765f23a9dcdb681537cb9b1d9109573","category":"Environment"}