{"title":"เกม Like a Dragon: Infinite Wealth กั๊กโหมด New Game+ ไว้ให้คนซื้อ Deluxe และ Ultimate เท่านั้น","link":"https://www.blognone.com/node/137789","date":1705906179000,"content":"<div><div><div><p>Sega เปิดเผยรายละเอียดเกม <a href=\"https://www.blognone.com/node/134292\">Like a Dragon: Infinite Wealth</a> แต่ละเวอร์ชันที่เตรียมวางจำหน่ายในวันที่ 26 มกราคมนี้ ผ่านเว็บไซต์อย่างเป็นทางการ ซึ่งเผยให้เห็นว่าตัวเกมเวอร์ชัน Standard ไม่มีโหมด New Game+ ในขณะที่คนที่ซื้อเกมเวอร์ชัน Deluxe และ Ultimate จะได้ส่วนเสริมชื่อ Master Vacation Pack ซึ่งมีโหมด New Game+ รวมอยู่ในนั้นด้วย</p>\n<p>ใน Master Vacation Pack ผู้เล่นจะได้รับดันเจี้ยนพิเศษ, เครื่องแต่งกายเพิ่มเติม, ซูจิม่อนแบบพิเศษ, แขกบนรีสอร์ท และโหมด New Game+ ที่สามารถเริ่มเกมใหม่ โดยยังมีไอเทม, สถานะ และความสามารถของตัวละครจากรอบที่แล้วมาเล่นต่อได้</p>\n<p>นอกจากนี้เกมเวอร์ชัน Ultimate จะได้ส่วนเพิ่มอีก 3 ตัวคือ Assorted Outfit Bundle, Sujimon &amp; Resort Bundle และ Yakuza CD Collection Set ซึ่งส่วนใหญ่จะเป็นเครื่องแต่งกาย, ซูจิม่อน, แขกรีสอร์ท และเพลงในคาราโอเกะเพิ่มเติม ไม่มีผลในแง่เกมเพลย์แบบโหมด New Game+</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4411f2cb6d9c6fcd8775e564853f0f7c.jpg\" /></p>\n<p>ปกติแล้วโหมด New Game+ มักมีอยู่ในตัวเกมอยู่แล้ว หรือบางเกมผู้พัฒนาอาจอัปเดตเพิ่มเข้ามาภายหลัง นโยบายนี้ของ Sega ทำให้แฟน ๆ ในแถบสหรัฐอเมริกาเริ่มไม่พอใจ เนื่องจากเกมเวอร์ชัน Standard ขายราคา 69.99 ดอลลาร์ ในขณะที่เกมเวอร์ชัน Deluxe และ Ultimate ขายราคา 84.99 และ 109.99 ดอลลาร์ตามลำดับ</p>\n<p>ส่วนในไทย PlayStation Store และ Steam ตัวเกม Standard ขายอยู่ที่ 1,790 บาท ในขณะที่ Deluxe และ Ultimate ขายราคา 1,990 บาท และ 2,390 บาทตามลำดับ ซึ่งถือว่าราคาถูกกว่าสหรัฐพอควร</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8e49627f8df59e9a8bb67292bce28957.png\" /></p>\n<p>ที่มา - <a href=\"https://infinitewealth.sega.com/?lang=en\">Sega</a> via <a href=\"https://gamingbolt.com/like-a-dragon-infinite-wealths-new-game-plus-mode-is-locked-behind-its-deluxe-and-ultimate-editions\">Gamingbolt</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/like-a-dragon\">Like a Dragon</a></div><div><a href=\"/topics/sega\">Sega</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ab2709c9da91fb60383e081df18407b7bb0dacf790a482ac57ead58ab9ad4add","category":"Thai"}