{"title":"ELISA with recombinant antigen Lb6H validated for the diagnosis of American tegumentary leishmaniasis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304268","date":1717596000000,"content":"<p>by Ruth Tamara Valencia-Portillo, José Angelo Lindoso, Beatriz Julieta Celeste, Amanda Azevedo Bittencourt, Maria Edileuza Felinto de Brito, Malcolm Scott Duthie, Jeffery Guderian, Jorge Guerra, Ana Lúcia Lyrio Oliveira, Steven Reed, Mussya Cisotto Rocha, Nicolle Tayná Santos, Fernando Tobias Silveira, Hiro Goto, Maria Carmen Arroyo Sanchez</p>\r\n\r\nAmerican tegumentary leishmaniasis (ATL) diagnosis is an open question, and the search for a solution is urgent. The available tests that detect the etiological agent of the infection are specific for ATL diagnosis. However, they present disadvantages, such as low sensitivity and the need for invasive procedures to obtain the samples. Immunological methods (leishmanin skin test and search for anti-<i>Leishmania</i> antibodies) are good alternatives to the etiological diagnosis of ATL. Presently, we face problems with disease confirmation due to the discontinuity in the production of leishmanin skin test antigen, particularly in resource-poor settings. Aiming to diagnose ATL, we validated rLb6H-ELISA for IgG antibodies using 1,091 samples from leishmaniasis patients and healthy controls, divided into four panels, living in 19 Brazilian endemic and non-endemic states. The rLb6H-ELISA showed a sensitivity of 98.6% and a specificity of 100.0%, with the reference panel comprising 70 ATL patient samples and 70 healthy controls. The reproducibility evaluation showed a coefficient of variation of positive samples ≤ 8.20% for repeatability, ≤ 17,97% for reproducibility, and ≤ 8.12% for homogeneity. The plates sensitized with rLb6H were stable at 4°C and -20°C for 180 days and 37°C for seven days, indicating 12 months of validity. In samples of ATL patients from five research and healthcare centers in endemic and non-endemic areas, rLb6H-ELISA showed a sensitivity of 84.0%; no significant statistical difference was observed among the five centers (chi-square test, p = 0.13). In samples of healthy controls from four areas with different endemicity, a specificity of 92.4% was obtained; lower specificity was obtained in a visceral leishmaniasis high endemicity locality (chi-square test, p&lt;0.001). Cross-reactivity was assessed in 166 other disease samples with a positivity of 13.9%. Based on the good diagnostic performance and the reproducibility and stability of the antigen, we suggest using ELISA-rLb6H to diagnose ATL.","author":"Ruth Tamara Valencia-Portillo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab31d30847150c7c5e5922d1d419877818285af2b167bdcf246456af268ce061","category":"Interdisciplinary"}