{"title":"PSV-19 Impact of precision feeding and bump feeding strategy during gestation on the performance of post-weaning pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/313/7664795?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the post-weaning growth performance of piglets from sows of parities 1 to 3 fed with 4 different feeding programs during gestation; Flat feeding (FF, constant concentration and feed intake), Bump feeding (BF, constant concentration and variable feed intake), precision feeding by parity (PFP, variable concentration and variable feed intake using the average weight per parity), individual precision feeding (PFI, variable concentration and variable feed intake using the weight of each sow at breeding). At weaning of each parity, five litters from each of the dietary treatments were selected and five average piglets from each of these litters were transferred to a nursery building with 20 pens. All pens received the same feeding program in 3 phases of 14 d each. Piglets were weighed at the beginning and end of each feeding phase. The quantity of feed was noted for each phase. At the end of phases 1 and 3, one piglet per pen was scanned on the DXA to assess its body lean, fat, and bone mineral composition. During phase 1, average daily gain (ADG) was greater for piglets from parity 1 sows than those from parity 2 and 3 while average daily feed intake (ADFI) and feed conversion (FC) were greater for piglets from parity 3 sows (<span>P</span> &lt; 0.05; Table). Dietary treatments during gestation did not affect performances in phase 1. In phase 2, ADG and ADFI were greater while FC was decreased for piglets from sows of parity 2 and 3 (<span>P</span>&lt; 0.001). Piglets from FF treatment had a greater ADG and a lesser FC (<span>P</span> &lt; 0.05) than piglets from BF, piglets from PFP and PFI being intermediate. In phase 3, piglets from parity 2 sows and those from FF treatment had greater ADG and ADFI than piglets from PFI treatment, piglets from PFP and BF treatments being intermediate (<span>P</span> &lt; 0.005). For all post-weaning period, piglets from parity 2 sows had greater ADG, ADFI and body weight at 42 d (<span>P</span> &lt; 0.001) while piglets from the FF treatment had better ADG and weight at 42 d (<span>P</span> &lt; 0.05) than those from BF and PFI (<span>P</span> &lt; 0.05), PFP being intermediate. The lean ADG was greater for piglets from FF treatment (<span>P</span> &lt; 0.021) than piglets from PFI, piglets from BF and PFP being intermediate. Piglets from sows of parity 2 and 3 had also greater lean ADG (<span>P</span> &lt; 0.001). Fat ADG was also higher for piglets from parity 2 sows (<span>P</span> &lt; 0.010) than piglets from parity 1 sows, piglets from parity 3 sows being intermediate. Piglets from parity 2 sows clearly had better post-weaning performances. The FF treatment during gestation led to better post-weaning performance, suggesting that energy or nutrient intake in early gestation affects offspring growth and development in post-weaning period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ab32b5d39e099bfb522f80366a4a4d0cd434ae7f637ef6e6d03bdf99016c5535","category":"Environment"}