{"title":"Venus’ clouds too dry, acidic for life","link":"https://arstechnica.com/?p=1776833","date":1624909344000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/01/Venus_Clouds_br.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/01/Venus_Clouds_br.jpg\">Enlarge</a> <span>/</span> Venus' thick atmosphere was photographed in ultraviolet light in 1979 by the Pioneer Venus Orbiter. (credit: <a href=\"https://nssdc.gsfc.nasa.gov/photo_gallery/\">NSSDCA Photo Gallery</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Last year, a study made waves by suggesting that a chemical that had been proposed as a potential indicator of life was <a href=\"https://arstechnica.com/science/2020/09/unexpected-chemical-found-in-venus-upper-atmosphere/\">present in the atmosphere of Venus</a>. While the hellish conditions on the planet's surface preclude the existence of any sort of life there, it remained possible that a milder environment existed in the planet's clouds, high above its surface. So the prospect that the chemical was indicating life couldn't be immediately discounted.</p>\n<p>In the months following, other researchers <a href=\"https://arstechnica.com/science/2021/02/scientific-community-on-report-of-a-strange-chemical-at-venus-probably-not/\">cast doubt</a> on the claim that the chemical was present at all. And today, a paper is being released the suggests that the conditions in Venus' clouds are in no way compatible with life even remotely similar to that on Earth. Although the temperatures in the clouds are indeed milder, there's nowhere near enough water to support life, and most of what's present is in droplets that are mostly composed of sulfuric acid.</p>\n<h2>Setting limits</h2>\n<p>In a press conference announcing the results, John Hallsworth of Queen's University Belfast said that the new work was inspired by the apparent detection of phosphine in Venus' atmosphere. He and his collaborators realized that two areas of research had combined to create other ways to examine the prospects of life on Venus. One was a study of life in extreme conditions on Earth, driven in part by a NASA effort to determine how best to protect Mars from contamination by the probes we were sending there.</p></div><p><a href=\"https://arstechnica.com/?p=1776833#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1776833&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ab3aa4f22e45d78cda7dfd11bfb39be093fcf4172b96aac51a568275efd461b0","category":"Tech"}