{"title":"Alphabet and Sony","link":"https://markpeak.net/alphabet-and-sony/","date":1632500571000,"content":"<p><a href=\"https://brandinside.asia/launch-scbx-mother-company/\">ข่าวการเปลี่ยนแปลงโครงสร้างของ SCB มาเป็น SCBX</a> สร้างความน่าตื่นเต้นให้วงการธุรกิจไทย และมีคนหลังไมค์มาคุยกับผมหลายคนว่าคิดเห็นอย่างไร</p>\n<p>เนื่องจากงานการปัจจุบันเป็นธุรกิจที่แข่งขันกับ SCB โดยตรง ตามมารยาทแล้วก็คงไม่สามารถให้ความเห็นตรงๆ ต่อแผนการของ SCB ได้</p>\n<p>แต่คิดว่าสามารถให้ความเห็นรวมๆ ต่อการปรับโครงสร้างของบริษัทอื่นๆ ในต่างประเทศที่มีลักษณะคล้ายๆ กันได้ คือเป็นบริษัทแม่ที่มีบริษัทลูกในหลากหลายธุรกิจ แต่แกนหลักอยู่ที่เทคโนโลยี</p>\n<p>ผมคิดว่ามีสองบริษัทที่น่ากล่าวถึงคือ Alphabet และ Sony</p>\n<h2>Alphabet</h2>\n<p>Alphabet เป็นบริษัทแม่ของ Google <a href=\"https://www.blognone.com/node/71206\">ที่มีประกาศนี้ในปี 2015</a> ด้วยเหตุผลแบบเดียวกันว่า เพื่อให้ธุรกิจใหม่ๆ มีความคล่องตัวมากขึ้น มีการแยกบัญชีอย่างชัดเจนระหว่างธุรกิจของ Google เดิมที่เป็น cash cow ทำกำไรมหาศาลและค่อนข้างอยู่ตัวแล้ว กับธุรกิจใหม่ๆ ที่เรียกว่า “Other Bets “เป็นการเดิมพันเพื่ออนาคต ไม่มีรายได้ในอนาคตอันใกล้ และยอมรับการขาดทุนได้</p>\n<p>Other Bets ประกอบด้วยธุรกิจที่น่าตื่นตาตื่นใจ มีตั้งแต่บริษัทหุ่นยนต์ AI IoT โดรน บอลลูน คอนแทคเลนส์วัดเบาหวาน สมาร์ทโฟนถอดประกอบได้ รถยนต์ไร้คนขับ บริษัทชีวภาพ ฯลฯ เท่ซะไม่มี เป็นภารกิจที่ยิ่งใหญ่ของมนุษยชาติระดับ moonshot mission</p>\n<p>ผมจำได้ว่าตอนที่ตั้ง Alphabet ใหม่ๆ คนตื่นเต้นกันมาก ถึงขั้นมีสื่อฝรั่งบางรายเปรียบเทียบว่านี่เป็นจุดเริ่มต้นของ New East India Company บริษัทที่ใหญ่ที่สุดในประวัติศาสตร์โลกอีกรอบเลยทีเดียว ถือเป็นการเปรียบเทียบที่อหังการมาก (ลองหาลิงก์ย้อนหลังก็หาไม่เจอแล้ว)</p>\n<p>นับจากการตั้ง Alphabet ในปี 2015 ตอนนี้ผ่านมา 6 ปีแล้ว ถ้าให้ประเมินผลกันแบบตรงไปตรงมา ก็คงต้องบอกว่า “ยังไม่เข้าเป้า” จากหลายปัจจัยที่แตกต่างกันไป</p>\n<p>เราเห็นบริษัทดังๆ ในเครือต้องถูกยุบกลับไปรวมกับ Google เช่น <a href=\"https://www.blognone.com/node/99685\">Nest</a> ไปจนถึงโครงการถูกยุบอย่าง <a href=\"https://www.blognone.com/node/89108\">Titan</a> / <a href=\"https://www.blognone.com/node/120753\">Loon</a> ต้องปลดพนักงานอย่าง <a href=\"https://www.blognone.com/node/86667\">Google Fiber</a> หรือขายทิ้งไปเลยอย่าง <a href=\"https://www.blognone.com/node/93074\">Boston Dynamics</a> (ไม่ว่าหุ่นจะเท่ขนาดไหนก็ตาม เสียดาย)</p>\n<p>ในอีกด้าน เราก็ปฏิเสธไม่ได้ว่าบริษัท AI อย่าง DeepMind สร้างนวัตกรรมทะลุโลกได้จริงๆ (รายได้อีกเรื่อง) บริษัทรถยนต์ไร้คนขับ Waymo ก็ทำผลงานได้ดี แม้รถยนต์ไร้คนขับ Level 5 จะมาถึงช้ากว่าที่คาด</p>\n<p>และยังมีกลุ่มบริษัทที่เปิดตัวมาแล้วเงียบหายไปเลย ไม่ปรากฏโฉมต่อโลกอีกเช่น <a href=\"https://www.blognone.com/node/48793\">Calico</a> บริษัทไบโอเทคที่ตั้งมานาน 8 ปีแล้วยังไม่มีผลงานอะไรออกมาเลย</p>\n<p>ความล้มเหลวของบริษัทในเครือ Alphabet คงเป็นเรื่องปกติที่คาดเดาได้ (เพราะมันคือ “bet”) แต่เวลาผ่านมา 6 ปีแล้วมีใครกาชื่อ Alphabet ทิ้งไปไหม ก็คงไม่มีใครทำอะไรแบบนั้น ที่ยกตัวอย่างมาทั้งหมดคือการแสดงให้เห็นว่าต่อให้ยุทธศาสตร์เท่ขนาดไหน ผลลัพธ์จริงๆ มันไม่ง่ายขนาดนั้น</p>\n<p>อีกประเด็นที่น่าสนใจคือ ถึงแม้ Google สร้างรายได้มหาศาล แต่ก็ไม่สามารถ “ถมเงิน” ไปกับโครงการของเล่นไฮเทคกลุ่ม Other Bets ได้ตลอดไป เพราะที่สุดแล้ว Alphabet หรือ GOOG ก็มีสถานะเป็นบริษัทมหาชน ที่ต้องตอบโจทย์ผู้ถือหุ้นเรื่องกำไรอยู่ดี</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/09/alphabet.png\" /></p>\n<p>จากตัวเลขผลประกอบการไตรมาสล่าสุดของ Alphabet (Q2/2021) จะเห็นว่า Other Bets ยังขาดทุนไตรมาสละเป็นพันล้านดอลลาร์ (แม้ Google มีกำไรเยอะกว่ามากกว่านั้นมากๆ ก็ตาม)</p>\n<p>ในทางการเงิน CFO ย่อมถูกกดดันให้ต้องลดการขาดทุนตรงนี้ลง ซึ่งในปี 2016 Bloomberg ก็<a href=\"https://www.bloomberg.com/news/features/2016-12-08/google-makes-so-much-money-it-never-had-to-worry-about-financial-discipline\">เคยมีบทความพูดถึง Ruth Porat</a> ซึ่งเป็น CFO ของ Alphabet (ก่อนหน้านั้นเป็น CFO Morgan Stanley มาก่อน) ที่บีบมาตรการลดค่าใช้จ่ายอย่างหนัก จนคนข้างในเรียกกันว่า “Ruthless Ruth” เลยทีเดียว</p>\n<blockquote><p>within the Other Bets, Porat’s tenure has been controversial, earning her an unflattering nickname: Ruthless Ruth. “She’s a hatchet man,” says a former senior Alphabet executive. “If Larry isn’t excited about something,” the executive continues, referring to CEO Page, “Ruth kills it.”</p></blockquote>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.bloomberg.com/news/features/2016-12-08/google-makes-so-much-money-it-never-had-to-worry-about-financial-discipline\">\n\t\t\t\t\t<img src=\"https://assets.bwbx.io/s3/javelin/public/javelin/images/social-default-a4f15fa7ee.jpg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.bloomberg.com/news/features/2016-12-08/google-makes-so-much-money-it-never-had-to-worry-about-financial-discipline\">\n\t\t\tGoogle Makes So Much Money, It Never Had to Worry About Financial Discipline—Until Now\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.bloomberg.com/news/features/2016-12-08/google-makes-so-much-money-it-never-had-to-worry-about-financial-discipline\">\n\t\t\t<p>Alphabet’s CFO Ruth Porat wants to bring focus to Mountain View. Can the moonshot factory adapt?</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://assets.bwbx.io/s3/javelin/public/javelin/images/favicon-black-63fe5249d3.png\" />\t\tBloomberg.com\t</div>\n</div>\n<p>หมายเหตุ: เคยเห็นคอมเมนต์บางท่านยกกรณี Microsoft มาอ้างอิง แต่จริงๆ แล้ว Microsoft ไม่เคยแยกกิจการเลย แม้ข้างในจัดเป็น BU ที่ค่อนข้างเอกเทศก็ตาม แต่ในเชิงโครงสร้างทางการ ไม่เคยใช้ท่าบริษัทแม่-บริษัทลูกเลย เพิ่งมาทำกับกิจการที่ซื้อมาในช่วงหลังๆ บางตัวอย่าง LinkedIn เท่านั้น</p>\n<h2>Sony</h2>\n<p>ถ้าเราย้อนไปไกลกว่านั้น การตั้งบริษัท conglomerate ที่ทำธุรกิจหลายๆ อย่างไม่ใช่เรื่องใหม่ เพราะบริษัทญี่ปุ่นทำกันมานานตั้งแต่ยุค 70s 80s 90s แล้ว</p>\n<p>ตัวอย่างที่ชัดเจนที่สุดหนีไม่พ้น Sony</p>\n<p>ถ้าเล่าเรื่องยาวให้สั้น Sony สร้างตัวมาจากสินค้าอิเล็กทรอนิกส์ จากนั้นขยายตัวไปยังธุรกิจอื่นๆ เช่น ธุรกิจบันเทิง (Sony Music และ Sony Pictures) ซึ่งเกิดจากมุมมองของผู้บริหารในยุคนั้นที่มองว่ามีฮาร์ดแวร์แล้วต้องมีซอฟต์แวร์ด้วย ไปจนถึงธุรกิจการเงิน (Sony Financial Services) ที่มีทั้งธนาคารและประกันชีวิต แต่ก็อยู่เฉพาะในญี่ปุ่นเท่านั้น</p>\n<p>ในยุคสมัยที่ Sony เกรียงไกรที่สุด ธุรกิจเหล่านี้ถือเป็น “ธุรกิจข้างเคียง” มีไว้ประดับประดา รายล้อมอาณาจักรอิเล็กทรอนิกส์ที่ยิ่งใหญ่ที่สุดในโลก</p>\n<p>แต่ในทศวรรษ 2000s เป็นต้นมา ที่ Sony โดนตีเข้าตรงกลางใจ ธุรกิจอิเล็กทรอนิกส์ที่ยิ่งใหญ่กลับแข่งขันไม่ได้อีก เพราะบริษัทเกาหลี ไต้หวัน (ภายหลังคือจีน) สามารถทำผลิตภัณฑ์ทัดเทียมกันได้ ในราคาที่ถูกกว่ามาก</p>\n<p>ยุทธศาสตร์มีไข่หลายใบในหลายตะกร้า กลับช่วยพยุงให้ Sony อยู่รอดได้ ยามที่ธุรกิจหลักขาดทุนมหาศาล ก็มีเงินจากธุรกิจหนังเพลง-การเงินนี่ล่ะมาช่วยเอาไว้ (โดยเฉพาะธุรกิจการเงินที่เป็นโรงงานผลิตเงิน เคยมีคนพูดกันว่า ถ้าไม่มี Sony Financial นี่ Sony คงเจ๊งไปนานแล้ว) ช่วยซื้อเวลา ก่อนที่ <a href=\"https://brandinside.asia/sony-fy2019/\">Sony จะคัมแบ็คกลับมาได้</a>จากโครงสร้างใหม่ที่มี PlayStation และธุรกิจเซ็นเซอร์กล้องเป็นแกนกลางแทนทีวี (ผมเคยเขียนเรื่องการคัมแบ็คของโซนี่ไว้หลายรอบ แปะลิงก์ไว้เผื่อใครอยากอ่าน <a href=\"https://brandinside.asia/sony-come-back/\">2016</a>, <a href=\"https://brandinside.asia/sony-q2-2017/\">2017</a>, <a href=\"https://brandinside.asia/sony-fy2019/\">2018</a>)</p>\n<p>หมายเหตุ: บริษัทญี่ปุ่นอื่นๆ ก็มีแนวทางคล้ายกัน เช่น Panasonic ที่โครงสร้างคล้าย Sony มาก เคยเป็นเจ้าของค่ายหนัง Universal ด้วยแต่สุดท้ายก็ต้องขายออกไป รายละเอียดเรื่องนี้แนะนำให้อ่านในการ์ตูนเรื่อง ชิมะ โคซาคุ ที่เขียนไว้ละเอียดมาก สนุกมาก</p>\n<p>บทเรียนสำคัญจาก Sony คงเป็นว่า การกระจายความเสี่ยงช่วยให้อยู่รอดได้ในระยะยาว และธุรกิจไหนจะรุ่งจะดับ มีขึ้นมีลง ย่อมขึ้นกับบริบทของยุคสมัยด้วยเช่นกัน</p>The post <a href=\"https://markpeak.net/alphabet-and-sony/\">Alphabet and Sony</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ab3a738e9dbda032647248c00002d34eb65b9e525c0cff3a099d398f8b8bb7a3","category":"Thai"}