{"title":"Effects of short inter-pregnancy/birth interval on adverse perinatal outcomes in Asia-Pacific region: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307942","date":1722434400000,"content":"<p>by Tahir Ahmed Hassen, Melissa L. Harris, Desalegn Markos Shifti, Tesfalidet Beyene, Md Nuruzzaman Khan, Tesfaye Regassa Feyissa, Catherine Chojenta</p>\r\nBackground <p>Short inter-pregnancy or birth interval is associated with an increased risk of adverse perinatal outcomes. However, some emerging evidence questions this association and there are also inconsistencies among the existing findings. This study aimed to systematically review the evidence regarding the effect of short inter-pregnancy or birth intervals on adverse perinatal outcomes in the Asia-Pacific region.</p> Methods <p>A comprehensive search of five databases was conducted targeting studies published between 2000 to 2023. Studies that reported on short inter-pregnancy or birth interval and examined adverse perinatal outcomes, such as low birthweight (LBW) preterm birth (PTB), small for gestational age (SGA), and neonatal mortality were included and appraised for methodological quality using the Joanna Briggs Institute critical appraisal tools. Three reviewers independently screened the studies and performed data extraction. Narrative synthesis and meta-analyses were conducted to summarise the key findings.</p> Results <p>A total of 41 studies that fulfilled the inclusion criteria were included. A short-interpregnancy interval was associated with an increased risk of low birthweight (odds ratio [OR] = 1.65; 95%CI:1.39, 1.95), preterm birth (OR = 1.50; 95%CI: 1.35, 1.66), and small for gestational age (OR = 1.24; 95%CI:1.09, 1.41). We also found elevated odds of early neonatal mortality (OR = 1.91; 95%CI: 1.11, 3.29) and neonatal mortality (OR = 1.78; 95%CI: 1.25, 2.55) among women with short birth intervals.</p> Conclusion <p>This review indicates that both short inter-pregnancy and birth interval increased the risk of adverse perinatal outcomes. This underscores the importance of advocating for and implementing strategies to promote optimal pregnancy and birth spacing to reduce the occurrence of adverse perinatal outcomes. Reproductive health policies and programs need to be further strengthened and promote access to comprehensive family planning services and increase awareness about the importance of optimal pregnancy and birth spacing.</p>","author":"Tahir Ahmed Hassen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab3d9f586eb741e5c74c116341b6c386e9eed6754c8579cf1cfbe8c1956a6ce3","category":"Interdisciplinary"}