{"title":"Tracking aquatic animals for fisheries management in European waters","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12706?af=R","date":1712766503000,"content":"<h2>Abstract</h2>\n<p>Acoustic telemetry (AT) has emerged as a valuable tool for monitoring aquatic animals in both European inland and marine waters over the past two decades. The European Tracking Network (ETN) initiative has played a pivotal role in promoting collaboration among AT researchers in Europe and has led to a significant increase in the number of tagged and observed aquatic animals in transboundary European waters. While AT benefits decision-making and delivers essential data to management bodies, its potential for management decision-making mechanisms has yet to be fully harnessed. We reviewed existing research, studies, and organisational initiatives related to aquatic animal tracking and their utility in fisheries management in European waters. We found that AT has already contributed to many aspects of fisheries management, such as improved understanding of stock dynamics, identification of critical habitats, assessment of migration routes, and evaluation of the effectiveness of conservation measures. However, broader utilisation of tracking technologies is needed. By leveraging the full potential of AT, managers can make more informed decisions to protect, restore, and sustainably manage European waters and creatures that live therein.</p>","author":"Aytaç Özgül, \nKim Birnie‐Gauvin, \nDavid Abecasis, \nJosep Alós, \nKim Aarestrup, \nJan Reubens, \nJon Bolland, \nAltan Lök, \nJena E. Edwards, \nPolona Pengal, \nMarie Prchalová, \nMilan Říha, \nRenanel Pickholtz, \nKnut Wiik Vollset, \nPedro Afonso, \nJan Grimsrud Davidsen, \nRobert Arlinghaus, \nVahdet Ünal, \nRobert J. Lennox","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"ab437107f74775d429f834ed1ee6f94a8c7fb83d20d6f2ccf9933ea4739803e7","category":"Environment"}