{"title":"Chain forming diatoms use different strategies to avoid diffusion limited N assimilation","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12677?af=R","date":1729618018000,"content":"<h2>Abstract</h2>\n<p>Formation of large colonies by phytoplankton is considered a disadvantage during low nutrient and non-turbulent conditions because of diffusion limitation and competition by neighboring cells. This is assumed by diffusion models and not empirical measurements. Here, we measured cell-specific dissolved inorganic carbon (DIC) and nitrate (NO3−) assimilation in two chain-forming <i>Skeletonema marinoi</i> strains by combining secondary ion mass spectrometry with stable isotopic tracer incubations. The pelagic strains were recently germinated from resting stages and thus not adapted to high nutrient regimes of laboratory cultures. During the exponential phase, the cells assimilated excess NO3− relative to DIC. The DIC and NO3− assimilation varied with chain length or the position of the cell within chains but did not follow any consistent trend. Solitary cells were rare and did not exceed 6% of all cells. During the nitrogen-limited stationary phase, NO3− assimilation was lower than modeled by mass transfer theory at diffusion limitation. NO3− assimilation rates were apparently limited by the biological uptake rate at nitrate concentrations &lt; 0.46 <i>μ</i>mol L<sup>−1</sup>. We conclude that <i>S. marinoi</i> is adapted to high nutrient concentrations and may seldom be diffusion limited in coastal waters with ambient NO3− concentrations &gt; 0.46 <i>μ</i>mol L<sup>−1</sup>. These findings contrast those previously reported in larger chain forming diatoms, for example, <i>Chaetoceros</i>, which appear to circumvent diffusion limitation at low ambient NO3− concentrations and succeed <i>S. marinoi</i> during spring blooms.</p>","author":"Rickard Stenow, \nMalin Olofsson, \nMartin J. Whitehouse, \nHelle Ploug","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"ab45afc8a04441a032f134bca3072876d71214078bbb6d0d6306c71e3c2679d7","category":"Environment"}