{"title":"Apple Likely Filed for 'xrProOS' Trademark Last Week via Shell Company","link":"https://www.macrumors.com/2023/05/21/xrproos-trademark-application/","date":1684718697000,"content":"Just a few weeks ahead of WWDC, it appears that Apple continues to secretly apply for trademarks related to its rumored AR/VR headset.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-headset-underside-render-by-marcus-kane.jpg\" alt width=\"2674\" height=\"1500\" /><div><em>Apple headset concept by <a href=\"https://www.behance.net/Konso1e\">designer Marcus Kane</a></em></div>\r<br />\nDelaware-based shell company \"Deep Dive LLC\" submitted a <a href=\"https://www.tmdn.org/tmview/welcome#/tmview/detail/AR500000004245245\">trademark application for \"xrProOS\"</a> stylized in Apple's SF Pro font on May 18 in Argentina, Turkey, and the Phillippines, according to online records. The same company applied for an <a href=\"https://www.macrumors.com/2023/05/16/apple-registers-xros-headset-wordmark/\">\"xrOS\" trademark in SF Pro in New Zealand</a> earlier this month, and it is very likely that Apple is behind both filings as the company moves early to protect its headset-related intellectual property.\r<br />\n\r<br />\nDeep Dive LLC also applied for xrProOS in Australia, New Zealand, and the UK on May 18, but without SF Pro styling. The company first applied for the trademark in Jamaica on April 27, according to the records. Jamaica is often where Apple first applies for trademarks related to future products, as the country lacks a searchable online trademark database, helping the company to maintain secrecy.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/xrProOS.jpeg\" alt width=\"453\" height=\"151\" /><div><em>xrProOS image included in Argentina trademark application</em></div>\r<br />\nThis is the first time that the xrProOS name has been reported, and it's unclear how Apple plans to use the name, if at all. <em>Bloomberg</em>'s Mark Gurman said Apple's headset operating system <a href=\"https://www.macrumors.com/2022/12/01/apple-headset-operating-system-xros/\">will be named xrOS</a>, so it remains to be seen how the xrProOS name might fit into Apple's plans. Gurman did <a href=\"https://www.macrumors.com/2022/09/04/apple-reality-pro-to-be-first-of-three-headsets/\">float \"Reality Pro\" as a potential name</a> of Apple's headset, and xrProOS would mirror the \"Pro\" branding if it is used in some way. It's also very possible Apple is simply covering all of its bases here and has no current plans to use xrProOS.\r<br />\n\r<br />\nOther previously-reported trademark applications with potential ties to Apple's headset include <a href=\"https://www.macrumors.com/2022/08/29/apple-ar-vr-headset-trademark-reality-one/\">Reality One</a>, <a href=\"https://www.macrumors.com/2022/08/29/apple-ar-vr-headset-trademark-reality-one/\">Reality Processor</a>, <a href=\"https://twitter.com/markgurman/status/1566567112797171713\">Optica</a>, and <a href=\"https://www.macrumors.com/2023/05/16/apple-deep-screen-trademark-application/\">Deep Screen</a>, but it's unclear if any of these names will actually be used. Some of the applications were filed by a separate shell company named \"Immersive Health Solutions LLC.\"\r<br />\n\r<br />\nApple is expected to unveil the AR/VR headset and related developer tools during its <a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">WWDC keynote on June 5</a>, and it will likely be released to the public later this year. The device is expected to offer a mix of virtual reality and augmented reality features that can be controlled with hand and eye tracking. The headset is estimated to cost around $3,000 in the United States, and it will reportedly have an external battery pack. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/trademark/\">Trademark</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/21/xrproos-trademark-application/\">Apple Likely Filed for 'xrProOS' Trademark Last Week via Shell Company</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-likely-filed-for-xrproos-trademark-last-week-via-shell-company.2390153/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ab488ddf56449efdfff7794bf9850ce9daf7281384bf908d61dac0e7d8e97b40","category":"Apple"}