{"title":"Blood-Based Biomarkers in Alzheimer&#039;s Disease: Advancing Non-Invasive Diagnostics and Prognostics","link":"https://www.preprints.org/manuscript/202409.1701/v1","date":1727142612000,"content":"Alzheimer's disease (AD) is the most prevalent form of dementia. With the global aging population, the incidence of AD and related dementias is projected to rise dramatically, posing significant public health challenges. Traditionally, the diagnosis of AD has relied on the detection of amyloid-beta (Aβ) plaques and neurofibrillary tangles of hyperphosphorylated tau in the brain, assessed through invasive cerebrospinal fluid (CSF) analysis and costly positron emission tomography scans. However, these methods are not feasible for widespread screening or use in low-resource settings. Recent advances in blood-based biomarkers offer a promising alternative for the early detection and monitoring of AD. These biomarkers provide a minimally invasive, cost-effective means of tracking the pathological progression of AD before the onset of clinical symptoms, potentially enabling earlier and more accurate diagnosis. Blood-based biomarkers, including those related to Aβ, phosphorylated tau, and neurofilament light polypeptide, have demonstrated significant potential in reflecting the underlying neuropathology of AD and correlating with traditional CSF and imaging biomarkers. This review synthesizes the latest research on blood-based biomarkers in AD, highlighting their role in the disease's etiopathogenesis, diagnostic accuracy, and prognostic value. We discuss the emerging evidence on proteinopathies, neuroinflammation, vascular pathology, and bioenergetic profiles, emphasizing the clinical applicability of these biomarkers. Furthermore, we explore the integration of blood-based biomarkers with advanced neuroimaging techniques and their potential to revolutionize the diagnostic landscape of AD, particularly in resource-limited settings. We have integrated protein-protein interaction (PPI) and miRNA network analyses to enhance the analysis. By incorporating these, we can explore the interactions and relationships between different proteomic, genomic, and epigenomic biomarkers, potentially unveiling new insights into the underlying biological mechanisms of AD. The continued development and validation of these biomarkers could lead to more accessible and equitable AD diagnostics, ultimately improving patient outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ab4b11e5888be9b226184bc11c5ea52386802e735d782d83f59c02ffe8139508","category":"Interdisciplinary"}