{"title":"These iOS 15 Features Aren't Available on the iPhone X or Older","link":"https://www.macrumors.com/2021/09/20/ios-15-features-not-on-iphone-x-or-older/","date":1632161134000,"content":"Apple <a href=\"https://www.macrumors.com/2021/09/20/ios-15-now-available/\">released iOS 15 today</a> following over three months of beta testing, but not all of the new features are available on older iPhones.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/iOS-15-General-Feature-Red-ORange.jpg\" />\r\n<br />\r\nAccording to the <a href=\"https://www.apple.com/ios/ios-15/features/\">iOS 15 features page</a> on Apple's website, the following features require an iPhone with an A12 Bionic chip or newer, which means the features listed below aren't available on the iPhone X or any older models.\r\n<br />\r\n\r\n<br />\r\nYou'll need an iPhone XS, iPhone XS Max, iPhone XR, or newer for these iOS 15 features:<ul><li>Portrait mode in FaceTime, which blurs your background and puts the focus on you.</li>\r\n<br />\r\n<li>Spatial audio in FaceTime, which makes voices sound like they're coming from the direction in which the people are positioned on the call.</li>\r\n<br />\r\n<li>Voice Isolation mode in FaceTime, which uses machine learning to block out ambient noises like a leaf blower outside or a dog barking in the next room during calls.</li>\r\n<br />\r\n<li>Wide Spectrum mode in FaceTime, which amplifies ambient noises during calls.</li>\r\n<br />\r\n<li>An interactive 3D globe of Earth in the Maps app.</li>\r\n<br />\r\n<li>Immersive walking directions with step-by-step directions shown in augmented reality in the Maps app.</li>\r\n<br />\r\n<li>More detailed maps in cities like San Francisco, Los Angeles, New York, and London in the Maps app.</li>\r\n<br />\r\n<li>Live Text for copying and pasting, looking up, or translating text within photos.</li>\r\n<br />\r\n<li>On-device speech processing of Siri requests.</li>\r\n<br />\r\n<li>The ability to make Siri requests offline without an internet connection for timers, alarms, phone calls, messaging, sharing, launching apps, controlling audio playback, and opening settings.</li>\r\n<br />\r\n<li>The ability to swipe up or down while taking a QuickTake video to zoom in or out.</li>\r\n<br />\r\n<li>The ability to add home, hotel, and car keys to the Wallet app.</li>\r\n<br />\r\n<li>On-device keyboard dictation that performs all processing completely offline.</li>\r\n<br />\r\n<li>Continuous keyboard dictation, rather than a limit of 60 seconds per instance.</li>\r\n<br />\r\n<li>New animated backgrounds in the Weather app that more accurately represent the sun position, clouds, and precipitation.</li></ul>Apple does not indicate why these features require an iPhone with an A12 Bionic chip or newer, but at least some of the limitations likely relate to the need for Apple's second-generation Neural Engine or newer for optimal performance.\r\n<br />\r\n\r\n<br />\r\niOS 15 is <a href=\"https://www.macrumors.com/2021/06/07/ios-15-iphone-ipad-compatibility/\">compatible with all devices that can run iOS 14</a>, including older devices like the original iPhone SE and the iPhone 6s.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/20/ios-15-features-not-on-iphone-x-or-older/\">These iOS 15 Features Aren't Available on the iPhone X or Older</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/these-ios-15-features-arent-available-on-the-iphone-x-or-older.2312063/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kRtCGjVhil8:PAwggB-gfMc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kRtCGjVhil8:PAwggB-gfMc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/kRtCGjVhil8\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ab51de712898fbe61fd4a2bf6a8c5a7ba0ec6d0d56243d008c06ceff6aa2389a","category":"Apple"}