{"title":"Nicolas Roche on WorldTour retirement, finding a new lease of life in gravel and what it will take to win","link":"https://www.bikeradar.com/features/opinion/nicolas-roche-on-gravel-racing/","date":1678557637000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Nicolas-Roche-gravel-racing-7f30789.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Nicolas Roche gravel racing at the Belgian Waffle Ride Arizona\" title=\"Nicolas Roche gravel racing at the Belgian Waffle Ride Arizona\" />                                            <p><em>After completing 24 Grand Tours during his 17-year career, Nicolas Roche has launched a new gravel team – NR GRVL. Mark Bailey sat down with the two-time Irish road champion to discuss finding glory in gravel racing.</em></p>\n<hr /><p>Getting into gravel racing has been a totally fresh experience. I love it so much that I have now set up my own gravel team (NR GRVL).</p>\n<p>A lot of professional riders quit cycling in their 30s. Stop. Done. But I was 37 when I retired (in October 2021) and that is young. What if you still want to race a bike?</p>\n<p>I was not tired of cycling; I was just tired of the road. I had done the same programme – Paris-Nice, Volta a Catalunya, the Classics, Tour de Romandie, altitude camp, Tour de France, Clásica de San Sebastian, Vuelta a Espana – for 10 to 12 years. But I still like to race a bike.</p>\n<p>When Moto GP racers retire, they might become a test pilot, or ride in World Superbikes. But traditionally, road cyclists haven’t had much else to do. Now Vincenzo Nibali is getting into mountain biking, and I want to show that road riders can race gravel, too.</p>\n<p>I got into gravel last year. A lot of people have a winter bike in Ireland, so it made sense to have a gravel bike. I did the TV show <em>Dancing with the Stars</em>, and afterwards my brother Alexis was telling me about this Gravel World Series race in France. He said: “Why don’t we race it?” I said: “Well, I haven’t trained in four months!” But I thought: ‘I will just have fun on a boys’ weekend with my brother’.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Nicolas Roche rode for seven teams across a 17-year WorldTour career, before turning to gravel.</span></figcaption><span> <i>Kenzo Tribouillard / Getty Images</i></span></div>\n<p>Of course, as I am competitive, there was no way I was doing it just for fun. I was fighting for top 10, but I got a double flat with 15km to go. But I thought: ‘I like this thing!’. I then went to the Nova Eroica in Italy and finished second. I enjoyed the whole vibe and I wanted more.</p>\n<p>When I was doing commentary at the Tour de France, I took my bike and did three-hour rides every day. Then in August, I went to race in Sweden at the Gravel Grit ‘n’ Grind – and I loved it.</p>\n<p>I wanted to head to the States, so I spoke to my sponsors, like Bianchi, Assos and Ekoi, to see if they could help, and then took part in races like the Belgian Waffle Ride and Big Sugar.</p>\n<p>It was great to have a ‘mid-life crisis’ by racing gravel bikes, rather than doing laps of a race car circuit. It scratched an inch and it’s an excuse to stay fit. I also went to the UCI Gravel World Championships in October, which taught me there’s a lot of work to be done.</p>\n<p>Now that we have our team, with other non-cycling sponsors like Straightline Consulting and Prezioso Watches Parma, I am committing to 12 races in the US, eight in Europe and one in Australia. Our team is just me, my brother Alexis, and a French racer called Justine Dupenloup.</p>\n<p>In May, I will do six destinations in six weeks: just me, my suitcase and my bike. I will be going from Denmark to Australia to Texas to Vancouver to Kansas to Finland. I am then back for the Ekoi Stone Circle, organised by Hotchillee. I’m really excited.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Roche completed 24 Grand Tours during his career. This year, he’s targeting the top step of a gravel podium.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>I like training on my gravel bike, but over winter I also smashed a few (road) hours with my mates from Monaco, like Wout Poels, Eddie Dunbar and Sam Bennett.</p>\n<p>But the challenge for me is those bad downhills on gravel. On the road, I was someone who could handle my bike, but I did find my limits last year, where other guys just go full-on over loose roads.</p>\n<p>Gravel is fun, but at big races the 150 guys who are racing to win are in bed early. It’s the other 4,000 who are going to cowboy concerts and drinking local IPA beers! Last year, racing felt like a holiday, so I had fun. But when you are doing a 6-7 hour ride at 300-plus watts normalised, it’s not easy. And if you start at 7am, you get up at 4am, which is new to me.</p>\n<p>But this is a totally fresh environment and I love it. My aim this year is to win a race in the US. I’d be over the moon. Winning is difficult, of course, but I want to put out a marker. Not in a pretentious way – but to show other road riders, this is a cool way to keep racing and having fun.</p>\n<hr /><p><em>Nicolas Roche will be at The Cycle Show at Alexandra Palace, London, on 21-23 April. Visit <a href=\"https://www.cycleshow.co.uk/\">cycleshow.co.uk</a></em></p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ab58d7c809b3a08c5fe5a3b08f4f7a5cff767f3f1b5f692c79aadf89f2001517","category":"Cycling"}