{"title":"Effect of Flow Interference Between Cylinders Subjected to a Cross Flow Over a Cluster of Three Equally Spaced Cylinders","link":"https://www.preprints.org/manuscript/202406.1067/v1","date":1718678195000,"content":"Flow over a cluster of three equally spaced circular cylinders was studied by numerical simulation on base of the turbulent mode k-kl-ω for two incidence angles β=0° and 60°, at different Reynolds number,in this paper, flow interference pattern characteristics between cylinders, characteristics of force parameters and Strouhal number of each cylinder with different spacing ratios ranging from 1.5 to 4 at Re 8×104, 2×105and 2×106 had been obtained. At incidence angle β=0° and 60°, the wake was nearly symmetric if S/D≥2.0; at β=60°,S/D=1.5 and Re=2×105, the asymmetric periodic flow pattern occurred in the wake region which leaded to the significant effect on the surface mechanical parameters and Strouhal number which was found for the first time; the periodic flow regime of the wake region also occurred at S/D=1.35 and 1.5, without the same phenomenon at S/D=1.7 and 2.0; the phenomenon of periodic flow regime of the wake region was intrinsic and related to Reynolds number and space ratio. in addition, characteristics of force parameters of three cylinders mainly were affected by the interference between cylinders, at 1.5&amp;lt;S/D&amp;lt;4, which leaded to that the drag coefficient of three cylinders reduced with different Reynolds numbers. At incidence angle 60°, in subcritical and critical regime, the Strouhal numbers of the upstream cylinders were more than that of single cylinder, and with the enlargement of spacing ratio, the Strouhal number decreased; for the downstream cylinder , the Strouhal number is far less than that of single cylinder and with the enlargement of spacing ratio, the Strouhal number increases, which were another prominent flow inference influence. The results indicated the effect of flow interference between cylinders subjected to a cross flow over a cluster of three equally spaced cylinders on the flow pattern,surface mechanical parameters and Strouhal number.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ab5ccb624df977bace17fd9f5c4945111d7c2a0e72b5e27b475d03dd6171dd0b","category":"Interdisciplinary"}