{"title":"The Problem With ‘The Problem With Jon Stewart’","link":"https://www.wsj.com/articles/jon-stewart-apple-tv-the-problem-11632935715","date":1633362530000,"content":"\n<p>John Jurgensen, writing for The Wall Street Journal (<a href=\"https://apple.news/AfqRcaffRQ2SnH1URFnyYsA\">News+</a>):</p>\n\n<blockquote>\n  <p>Now he’s attempting to re-engage with a show that offers fewer\njokes and a more earnest agenda. With his new biweekly series,\n“The Problem With Jon Stewart,” his first challenge is getting\npeople to notice it at all. Apple TV+ is decidedly more plush but\nless entrenched than basic cable.</p>\n\n<p>Fans will find aspects of “The Problem With Jon Stewart” familiar.\nIn front of an audience, he sits at a table for an opening\nmonologue (now wearing a T-shirt and bomber jacket instead of a\nsuit and tie). He twirls his pen, pauses for deadpan stares into\nthe camera, stifles giggles behind his fist and makes\nself-deprecating cracks like, “I am what’s left of Jon Stewart.”</p>\n\n<p>Breaking from his previous format, the show includes unscripted\nsegments in the show’s writers’ room, where Mr. Stewart and his\nstaff banter over each episode’s topic (expanded on in a weekly\ncompanion podcast). A separate panel discussion captures the\nshow’s sober tone.</p>\n</blockquote>\n\n<p>I watched the first episode and was bored to tears. I certainly sympathize with the plight of U.S. veterans who’ve been gravely harmed by the burning of toxic waste, but the show itself felt like a droll hour-long lecture — not a good sign when the show was in fact only 40 minutes long. Strong “<em>When is this going to be over?</em>” vibes. It was like being stuck back in school.</p>\n\n<p>I’m not saying Stewart can or should only do comedy. I like serious issue-based shows, too, but the good ones, like <em>60 Minutes</em>, move along at a fast clip. John Oliver’s <em>This Week Tonight</em> devotes itself to the most serious issues in the world today, but the show is entertaining, fast-paced, and funny as hell. It moves. The premiere of <em>The Problem With Jon Stewart</em> can only be described as “plodding”. I’ll give it another shot this week, but one more like last week’s and I’m out.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/10/04/the-problem-with-the-problem-with-jon-stewart\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ab6022aea0e902eb0fe9b1f647e71688bd71caee94455f59a7ba4181a089cb2e","category":"Tech"}