{"title":"68 Wildfire smoke simulations and the effects of smoke exposure on cattle acute phase protein response","link":"https://academic.oup.com/jas/article/102/Supplement_3/311/7757427?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The incidence of and acreage burned by wildfires are globally increasing, with predictions of more devastating fires in the future. The impacts of wildfire smoke exposure on have been of research interest over the years, although the scope of the literature is limited. Evaluating the effects of wildfire smoke exposure is challenging because of the unpredictability of fires, limiting the ability of researchers to evaluate this phenomenon. For this study, a wildfire smoke simulation was created to evaluate the effects of smoke exposure on beef cattle health, performance, and behavior. Heifers [n = 8 Angus x Hereford; body weight (BW) = 532 kg; 8 mo of age) were acclimated to individual pens in a completely closed barn for 7 d (d -7 to -1). Heifers were maintained in the barn for 36 d and exposed to wildfire smoke simulation for 7 consecutive days (d 0 to 7) while inside the barn. Heifers were individually fed alfalfa hay ad libitum, and feed intake was recorded daily. Health scores were collected daily from each heifer by 4 trained technicians, and blood samples were collected weekly for evaluation of acute phase proteins, cytokines, hormones, and hematology. Heifer behavior was recorded continuously using 4 cameras for the length of the study. Air quality was monitored daily every 1 min, using 2 air quality monitors. Preliminary data were analyzed using MIXED procedure of SAS. Heifers were considered the experiment unit serving as its own control, where variables were analyzed over time. Significance was set at <span>P</span> ≤ 0.05. Air quality, assessed with PM<sub>2.5</sub>, changed over time (<span>P</span> &lt; 0.0001), reaching a daily average of 159 µg/m<sup>3</sup> during the smoke simulation period. Although the air quality daily average was above the EPA standard (35 µg/m<sup>3</sup>), the smoke dissipated during the day, leading to wide variation in the 24 h-cycle (7.60 to 433 µg/m<sup>3</sup>; <span>P</span> &lt; 0.0001), which might not truly represent air quality conditions during wildfires. Regardless, heifer plasma ceruloplasmin concentration increased over time (<span>P</span> = 0.05), reaching a peak during smoke exposure (29 mg/mL), which was maintained (<span>P</span> = 0.39; 27 mg/mL) for 1 wk post-smoke exposure before returning to nadir (23 mg/mL). An increase in acute phase proteins stimulated by smoke exposure has been observed in cattle naturally exposed to wildfires. Therefore, exposure to wildlife smoke might elicit an inflammatory response, potentially leading to reduced cattle performance, which could be accompanied by changes in behavior. This research was supported by the intramural research program of the USDA-NIFA, Award #2023-68008-39173.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ab690ef132f918f9828c3cd5f0a260b1f07b61634bd447df25e46ba1c4080c95","category":"Environment"}