{"title":"A panel data study on the effect of climate change on life expectancy","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000339","date":1705586400000,"content":"<p>by Amit Roy</p>\r\n\r\nThe life and health of billions of people is endangered by climate change today. Life expectancy is generally used as the best metric for assessing the population health status of a nation. Against this backdrop, this paper investigates the effect of climate change on life expectancy using the panel data model. To do so, imprimis, this paper develops a conceptual framework linking direct and indirect pathways by which climate change affects health. The direct pathways are through weather variables and natural disasters. The indirect pathways are mediated through economic systems and ecosystems. Then this paper estimates the effect of climate change on life expectancy using cross-national data from 191 countries covering the period 1940–2020 and employing the fixed-effect method. The finding of this study suggests that if the annual average temperature increases by 1°C, then the life expectancy at birth will decline by 0.44 years. Moreover, the temperature rise will further negatively impact life expectancy by interacting with the rainfall cycle. If the composite climate change index, an index of the geometric mean of temperature and rainfall, increases by 10 points, the life expectancy at birth will decline by 0.50 years. Moreover, climate change will disproportionately reduce the life expectancy of females more than the life expectancy of males. A negative relationship between a composite climate change index and life expectancy underscores the urgency of addressing climate change as a public health crisis. Mitigation efforts to reduce greenhouse gas emissions and adapt to changing conditions are essential to minimize the health risks associated with climate change. Thus, countries should come forward with prompt initiatives to contain global temperature rise and protect the health of the population on the verge of climate change.","author":"Amit Roy","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"ab69ccf29c129a288c88d1c41f3295a3cc3dbbebf4b92bb0af0de1cbdb9f8047","category":"Environment"}