{"title":"จัดการข้อมูลสำรองอย่างเต็มรูปแบบด้วย Veeam Backup for Microsoft 365 จาก CSL","link":"https://www.blognone.com/node/125224","date":1634034604000,"content":"<div><div><div><p>สถานการณ์โควิด-19 ส่งผลให้พนักงานในองค์กรทั้งรัฐบาลและเอกชน ต้องทำงานที่บ้านเพื่อความปลอดภัย แพลตฟอร์มหลักๆ ที่ใช้กันก็หนีไม่พ้น Microsoft 365 บริการคลาวด์ของ Microsoft เพราะรวมเครื่องมือการทำงานที่จะช่วยให้พนักงานทำงานประสานกันได้อย่างราบรื่นแม้ไม่ได้เข้าไปทำงานที่สำนักงาน เครื่องมือของ Microsoft 365 มี หลากหลายตั้งแต่ อีเมล การประชุมออนไลน์ผ่าน Microsoft Teams หรือการเก็บข้อมูลบนOneDive และ อื่นๆเห็นได้จากสถิติผู้ใช้ที่เติบโตขึ้นถึงร้อยละ 22 ในปีที่ผ่านมา และในตอนนี้มีผู้ใช้ทั่วโลกเกิน 50 ล้านคน</p>\n<p>ในขณะเดียวกัน WFH อาจกลายเป็นช่องโหว่ขนาดใหญ่ของความปลอดภัย โดยเฉพาะเรื่องข้อมูลสูญหาย ยิ่งเราอยู่ในยุคที่ข้อมูลองค์กรมีค่ามหาศาลเช่นนี้ การสำรองข้อมูลจึงเป็นนโยบายหลักขององค์กรที่ต้องทำ เพราะเหตุที่อาจทำให้เกิดข้อมูลสูญหายที่อาจเกิดขึ้นได้เช่น</p>\n<ul>\n<li>การเผลอลบ ข้อมูลโดยไม่ได้ตั้งใจ หรือการลบข้อมูลเนื่องจากพนักงานคนนั้นลาออกโดยกด Permanent Delete</li>\n<li>การลบข้อมูลตามเงื่อนไขระยะเวลา (นโยบายบริษัทกำหนดให้เก็บข้อมูล 1 ปี 2 ปี)</li>\n<li>ข้อมูลสูญหายจาก Ransomware ซึ่งมาพร้อมกับเทรนด์ BYOD (Bring Your Own Device) พนักงานองค์กรบางรายใช้งานอุปกรณ์ของตนเอง ไม่ได้อัพเดตแพตช์ ป้องกันมัลแวร์เหมือนอุปกรณ์ขององค์กรชิ้นอื่นๆ</li>\n<li>ข้อมูลสูญหาย จากการถ่ายโอนข้อมูลให้พนักงานใหม่</li>\n</ul>\n<p>ทั้งนี้เมื่อการทำงานผ่านแพลตฟอร์ม Microsoft 365 ถูกใช้เป็นช่องทางหลักในการดำเนินกิจกรรมในองค์กร การสำรองข้อมูล (Backup) จึงควรต้องครอบคลุมข้อมูลที่ถูกส่งผ่าน Tool ต่างๆของ Microsoft 365 ด้วย ดังเช่นแนวโน้มของการใช้งาน Microsoft Teams ในช่วง WFH พบว่ามีผู้ใช้งานสูงขึ้น 50% โดยในเวลาเพียง 6 เดือน มียอดผู้ใช้งานรายวัน 115 ล้านราย ซึ่งในการประชุมแต่ละครั้งจะมีการรับส่งข้อมูลสำคัญกันใน Teams ตลอดเวลา</p>\n<p><strong>Veeam Backup for Microsoft 365 ตัวช่วยสำรองข้อมูล ทั้งช่วยเก็บและกู้คืนได้อย่างทันท่วงที</strong></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ea61733629615c57ecb56d07a32b7e56.png\" /></p>\n<p>โดยทั่วไปแล้ว บริการคลาวด์แม้มีบริการดูแล สำรองข้อมูล เป็นอย่างดีแล้ว แต่ก็มีข้อจำกัดเรื่องการปรับแต่งเงื่อนไขการเก็บข้อมูลไม่ได้มากนัก หรือไม่มีเครื่องมือช่วยเหลือสำหรับการกู้ข้อมูลอย่างรวดเร็ว ทำให้องค์กรพบกับความลำบากกับการจัดการข้อมูลสำรองที่มีความซับซ้อนขึ้น ทั้งการวางนโยบายสำรองข้อมูลให้เป็นไปตามเวลาและเงื่อนไขที่กำหนด หรือการกู้ข้อมูลกลับมาใช้งานเมื่อถูกร้องขอทำได้ช้าไม่ทันการใช้งาน</p>\n<p>จากการศึกษาของ Veeam พบว่า องค์กรจะรู้ตัวว่าข้อมูลสูญหายหลังจากเกิดเหตุไปแล้วเฉลี่ย 140 วัน การใช้ระบบป้องกันข้อมูลสูญหายที่มากับ Microsoft 365 เพียงอย่างเดียวจึงไม่เพียงพอต่อการจัดการข้อมูลในองค์กรจำนวนมาก และอาจจะทำให้เกิดความเสี่ยงเรื่องข้อมูลสูญหายไปได้ในโดยไม่มีโอกาสกู้คืนได้ทันเวลา</p>\n<p>Veeam Backup for Microsoft 365 มีฟีเจอร์ที่สนับสนุนการทำงานร่วมกันแม้พนักงานอยู่นอกสำนักงาน จัดการข้อมูลสำรองอย่างเต็มรูปแบบ ไม่ว่าจะเป็น</p>\n<ul>\n<li>สำรองข้อมูลอีเมลจาก Exchange ได้ทั้งบน Microsoft 365 และการติดตั้งแบบ On-Premise</li>\n<li>สำรองข้อมูลได้จากทั้ง SharePoint และ OneDrive</li>\n<li>รองรับ Microsoft Teams ในตัว มาพร้อมหน้าจอ GUI สามารถค้นหาข้อมูลเฉพาะใน Teams ได้</li>\n<li>ใช้งานกับระบบสตอเรจได้หลากหลาย จากผู้ให้บริการคลาวด์หลายราย ช่วยลดค่าใช้จ่าย เพิ่มทางเลือกให้องค์กรในระยะยาว</li>\n<li>มาพร้อมกับเครื่องมือค้นหาข้อมูล ช่วยให้ดึงข้อมูลสำรองกลับมาใช้งานได้ทันท่วงที โดยไม่ต้องค้นตามเวลาแบบเดิมๆ</li>\n<li>ขยายระบบตามการใช้งานขององค์กรได้ตลอดเวลา</li>\n</ul>\n<p>ฟีเจอร์เหล่านี้ช่วยให้องค์กรสามารถกำหนดเงื่อนไขการสำรองไฟล์ได้ตามต้องการ สามารถค้นหาไฟล์ต่างๆ เพื่อกู้กลับขึ้นมาเมื่อผู้ใช้ร้องขอได้อย่างรวดเร็ว สามารถสำรองข้อมูลอย่างละเอียด เช่น การโอนอีเมลจากพนักงานที่ลาออกไปยังบัญชีของพนักงานที่มารับงานต่อ โดยยังสามารถใช้งานจากแอปพลิเคชันต่างๆ ในบริการ Microsoft 365 ได้เหมือนเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/deeb58c497b3f007e06f3d344dcc17ff.png\" /></p>\n<p><strong>ดูแลข้อมูลที่สำคัญขององค์กรอย่างเต็มรูปแบบ เลือกบริการ Veeam Backup for Microsoft 365 และ Backup as a Service จาก CSL</strong></p>\n<p>ดูแลข้อมูลการทำงานบนแพลตฟอร์ม Microsoft 365 ด้วยบริการ Veeam Backup for Microsoft 365 และดูแลข้อมูลขององค์กรแบบเต็มรูปแบบขึ้นอีกขั้น ด้วยบริการ Backup as a Service บริการดูแล จัดเก็บ สำรองข้อมูลแบบครบวงจร โดยผ่าน Veeam Backup Software จาก CSL และ AIS Business บริการซึ่งเกิดจากความร่วมมือมาอย่างยาวนานกับ Veeam พันธมิตรทีมีความเชียวชาญเรื่องโซลูชันการดูแลข้อมูลที่มีชื่อเสียงระดับโลก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b8a62489c3080143d9f86cabc47afebd.png\" /></p>\n<p>ให้บริการที่มีความยืดหยุ่นเพราะออกแบบบริการมาหลากหลายให้ตอบโจทย์ เหมาะความต้องการขององค์กรที่แตกต่างกันไป ทั้งความต้องการสำรองข้อมูลภายในศูนย์ข้อมูลภายในองค์กรเอง หรือสำรองข้อมูลมายังศูนย์ข้อมูลมาตรฐานสากลของ CSL และ AIS พร้อมการให้บริการแบบจ่ายตามปริมาณการใช้งานจริง (Pay per use)ทำให้สะดวกและคุ้มค่า <strong>เพื่อให้องค์กรมั่นใจได้ว่าจะสามารถดูแล สำรองข้อมูล กู้คืน และนำข้อมูลกลับมาใช้ได้อย่างคล่องตัว แม้เกิดเหตุการณ์ไม่คาดคิด</strong> พร้อมกันนี้ CSL และ AIS Business ยังมีบริการแบบครบวงจรอื่นๆ อีกมากมายเพื่อช่วยให้องค์กรสามารถก้าวผ่านทุกข้อจำกัดเรื่องเทคโนโลยีได้อย่างมีประสิทธิภาพ</p>\n<p>ศึกษารายละเอียดเพิ่มเติมเกี่ยวกับ Veeam Backup for Microsoft 365 จาก CSL ได้ที่ <a href=\"https://www.csl.co.th/Web/Promotion-Detail.aspx?c=50\">https://www.csl.co.th/Web/Promotion-Detail.aspx?c=50</a></p>\n<p>CSL พาร์ทเนอร์ที่ช่วยตอบโจทย์ทุกเรื่อง IT ที่คุณมั่นใจ<br />\n \"Your Trusted Smart Digital Partner\"</p>\n<p>ปรึกษาและวางแผนพัฒนาเทคโนโลยี เพื่อรองรับการทำงานและต่อยอดธุรกิจกับ CSL</p>\n<p>Email : <a href=\"mailto:business@ais.co.th\">business@ais.co.th</a></p>\n<p>Web : https://www.csl.co.th/</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/csl\">CSL</a></div><div><a href=\"/topics/veeam\">Veeam</a></div><div><a href=\"/topics/microsoft-365\">Microsoft 365</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ab6d37a10b28628c0edeb049345ae44d238ff2aeba9d35029f86dc459129064d","category":"Thai"}