{"title":"Quantification of sediments and delineation of their sources in Nyabugogo Stream, RWANDA: Relationship with economic development activities","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.75?af=R","date":1708316889000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/002d7ef0-e2ce-4b3e-94e7-6c32b495e90c/rvr275-gra-0001-m.png\" alt=\"Quantification of sediments and delineation of their sources in Nyabugogo Stream, RWANDA: Relationship with economic development activities\" /><p>The main sources of sediments are delineated, while corresponding loads are also quantified. After the analysis of those sediments in different periods, the relationship between economic development activities and sediment loads in Nyabugogo Stream were also determined.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Nyabugogo Stream receives sediment loads from practiced economic activities along its path, these sediment loads affect the composition of the water by changing its natural state, and lead to its deterioration and riverine wetland ecosystem. In this study the main sources of sediments are delineated, while corresponding loads are also quantified. After the analysis of those sediments in different periods, the relationship between economic development activities and sediment loads in Nyabugogo Stream were also determined. The findings revealed that the top most economic activities impacting the quantity of sediment load in Nyabugogo Stream were found to be mining followed by poor agricultural practices, deforestation, untreated sewages, and clay mining/fabrication of bricks respectively. Analysed samples showed in laboratory that at point A situated in Rutare sector have the lowest value of sediment loads of 3.29 × 10<sup>6</sup> tons/year while at point C situated in Kigali sector have the highest value of 141.35 × 10<sup>6</sup> tons/year, these results showed to be increased as the stream flows from Lake Muhazi to Nyabarongo River as the Stream continue to be experiencing the increase of economic activities practiced in the its catchment which also have been delineated using ArcMap, this showed the relationship between economic activities and sediment loads generated in the stream. The researchers recommend to impose the enforcement of regulations, policies and guidelines for different economic activities so that they cannot pollute natural water bodies and disturb aquatic ecosystem.</p>","author":"Jules Turatsinze, \nPancras Ndokoye","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"ab7ca170bda14707984cb9855e4640a466bc99b62d2de838a6e0db06d41fa12b","category":"Environment"}