{"title":"Improving the performance of mutation-based evolving artificial neural networks with self-adaptive mutations","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307084","date":1721052000000,"content":"<p>by Motoaki Hiraga, Masahiro Komura, Akiharu Miyamoto, Daichi Morimoto, Kazuhiro Ohkura</p>\r\n\r\nNeuroevolution is a promising approach for designing artificial neural networks using an evolutionary algorithm. Unlike recent trending methods that rely on gradient-based algorithms, neuroevolution can simultaneously evolve the topology and weights of neural networks. In neuroevolution with topological evolution, handling crossover is challenging because of the competing conventions problem. Mutation-based evolving artificial neural network is an alternative topology and weights neuroevolution approach that omits crossover and uses only mutations for genetic variation. This study enhances the performance of mutation-based evolving artificial neural network in two ways. First, the mutation step size controlling the magnitude of the parameter perturbation is automatically adjusted by a self-adaptive mutation mechanism, enabling a balance between exploration and exploitation during the evolution process. Second, the structural mutation probabilities are automatically adjusted depending on the network size, preventing excessive expansion of the topology. The proposed methods are compared with conventional neuroevolution algorithms using locomotion tasks provided in the OpenAI Gym benchmarks. The results demonstrate that the proposed methods with the self-adaptive mutation mechanism can achieve better performance. In addition, the adjustment of structural mutation probabilities can mitigate topological bloat while maintaining performance.","author":"Motoaki Hiraga","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab7f7b504e77204c28b3af41ba7d8850a4ae98298378f9311ed7ba6e4e5afad2","category":"Interdisciplinary"}