{"title":"Apple Requires Only a Subpoena to Turn Over Push Notification Tokens to Law Enforcement; Google Requires a Court Order","link":"https://www.washingtonpost.com/technology/2023/12/06/push-notifications-surveillance-apple-google/","date":1701897701000,"content":"\n<p>Drew Harwell, reporting for The Washington Post:</p>\n\n<blockquote>\n  <p>Apple said in a statement that “the federal government had \nprohibited us from sharing any information” about the requests and \nnow that the method had become public, it was updating its \nupcoming transparency reports to “detail these kinds of requests.” </p>\n\n<p>Apple’s <a href=\"https://www.apple.com/legal/privacy/law-enforcement-guidelines-us.pdf\">Law Enforcement Guidelines</a>, the company’s rules \nfor how police and government investigators should seek user \ninformation, now note that a person’s Apple ID, associated with a \npush-notification token, can be “obtained with a subpoena or \ngreater legal process.” </p>\n\n<p>Neither Wyden nor Apple detailed how many notifications had been \nreviewed, who had been targeted, what crimes were being \ninvestigated or which governments had made the requests. </p>\n</blockquote>\n\n<p>Law enforcement agents can issue subpoenas on their own, so there’s no oversight here. Google, on the other hand, requires a court order:</p>\n\n<blockquote>\n  <p>For U.S. requests of push notifications and other non-content \ninformation, Google said it requires a court order, not just a \nsubpoena, that is subject to judicial oversight. With such orders, \nfederal officials must persuade a judge that the requested data is \nrelevant and material to an ongoing criminal probe. </p>\n</blockquote>\n\n<p>Score one for Google here.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/06/apples-updated-law-enforcement-guidelines\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ab836f6d3d57d228a5fdada54e31113441c6983166408317f3d5b45b1b5d1be4","category":"Tech"}