{"title":"<i>Prochlorococcus marinus</i> responses to light and oxygen","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307549","date":1721656800000,"content":"<p>by Mireille Savoie, Aurora Mattison, Laurel Genge, Julie Nadeau, Sylwia Śliwińska-Wilczewska, Maximilian Berthold, Naaman M. Omar, Ondřej Prášil, Amanda M. Cockshutt, Douglas A. Campbell</p>\r\n\r\n<i>Prochlorococcus marinus</i>, the smallest picocyanobacterium, comprises multiple clades occupying distinct niches, currently across tropical and sub-tropical oligotrophic ocean regions, including Oxygen Minimum Zones. Ocean warming may open growth-permissive temperatures in new, poleward photic regimes, along with expanded Oxygen Minimum Zones. We used ocean metaproteomic data on current <i>Prochlorococcus marinus</i> niches, to guide testing of <i>Prochlorococcus marinus</i> growth across a matrix of peak irradiances, photoperiods, spectral bands and dissolved oxygen. MED4 from Clade HLI requires greater than 4 h photoperiod, grows at 25 μmol O<sub>2</sub> L<sup>-1</sup> and above, and exploits high cumulative diel photon doses. MED4, however, relies upon an alternative oxidase to balance electron transport, which may exclude it from growth under our lowest, 2.5 μmol O<sub>2</sub> L<sup>-1</sup>, condition. SS120 from clade LLII/III is restricted to low light under full 250 μmol O<sub>2</sub> L<sup>-1</sup>, shows expanded light exploitation under 25 μmol O<sub>2</sub> L<sup>-1</sup>, but is excluded from growth under 2.5 μmol O<sub>2</sub> L<sup>-1</sup>. Intermediate oxygen suppresses the cost of PSII photoinactivation, and possibly the enzymatic production of H<sub>2</sub>O<sub>2</sub> in SS120, which has limitations on genomic capacity for PSII and DNA repair. MIT9313 from Clade LLIV is restricted to low blue irradiance under 250 μmol O<sub>2</sub> L<sup>-1</sup>, but exploits much higher irradiance under red light, or under lower O<sub>2</sub> concentrations, conditions which slow photoinactivation of PSII and production of reactive oxygen species. In warming oceans, range expansions and competition among clades will be governed not only by light levels. Short photoperiods governed by latitude, temperate winters, and depth attenuation of light, will exclude clade HLI (including MED4) from some habitats. In contrast, clade LLII/III (including SS120), and particularly clade LLIV (including MIT9313), may exploit higher light niches nearer the surface, under expanding OMZ conditions, where low O<sub>2</sub> relieves the stresses of oxidation stress and PSII photoinhibition.","author":"Mireille Savoie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab846dac4f593547803eb8650b58b2b23ef4673b6e372e3577c06d83bef9ab73","category":"Interdisciplinary"}