{"title":"Garmin’s Connect IQ Platform Updates: A Round-Up","link":"https://www.dcrainmaker.com/2021/10/garmins-connect-iq-system-5-platform-updates-a-round-up.html","date":1634229719000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-27.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-27.png\" /></a></p>\n<p>Yesterday Garmin held their <a href=\"https://developer.garmin.com/gdvc/overview/\">annual developer conference</a>, officially called the Garmin Developer Virtual Conference (GDVC). This event is the successor to the Garmin Connect IQ Summit, which in turn is somewhat the Garmin-focused sibling to the once ANT+ Symposium. Albeit, there was an ANT+ section included this year in the Garmin Developer Conference.</p>\n<p>The conference is traditionally an event where Garmin makes their 3rd party developer-focused announcements, but rarely new product announcements. Instead, these announcements  – when viewed with just the right lens – give insight into what’s ahead on Garmin’s product roadmap for the next year. Sometimes that insight is overwhelmingly clear, like <a href=\"https://www.dcrainmaker.com/2014/09/garmin-connect-iq-apps.html\">in the early days of Connect IQ</a>. And other times, it’s a bit fuzzier. This year is closer to the fuzzier end of the spectrum, but there are clear hints on where things are going.</p>\n<p>As with most years, Garmin did not announce any new consumer products this week. As noted, that rarely happens. And if/when it does, it’s more just a case of coincidence timing with other events occurring the week of the conference (such as the cycling-focused Sea Otter in the past). In terms of products remaining for 2021, looking at the history here, we’re likely past the chance of anything new occurring. Garmin has only once in the last 5 years released a watch after this point in the calendar (the <a href=\"https://www.dcrainmaker.com/2017/10/garmins-descent-mk1-diving-gps.html\">Descent MK1 in 2017</a>, to coincide with a scuba industry event). But at the same time, everyone is running behind this year, so…shrug.</p>\n<p>In any event, this post is mostly geeky. Except the future-looking tidbits that aren’t.</p>\n<p>And for those looking for my annual <em>State of Sports Tech 2021 Keynote </em>that I delivered as part of the event, DCR Supporters now have early access to that right now, following which I’ll release it to everyone else. <a href=\"https://www.dcrainmaker.com/exclusives\">Supporters can find that here</a>, as well as the ability to sign-up.</p>\n<h3><span>What’s New in Connect IQ:</span></h3>\n<p>First up, at a high level for those not familiar – Garmin’s Developer platforms are basically two components. The first piece is the web API platform piece. This is for doing things like pushing structured workouts (think Training Peaks) or routes (think Strava/Komoot) to Garmin devices. Or for apps that want to pull data (like your workouts) to their apps (like Strava or Today’s Plan). Last year Garmin did a big consolidation effort for all these platforms to put it under one API roof (both technically as well as process/logistically). They noted that the legacy Garmin Connect API will have support ending soon, and to convert to the new platform.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-28.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-28.png\" /></a></p>\n<p>Over the past few months, Garmin has made three new sets of data available for developers via the API (meaning platforms can receive this automatically from users accounts, if authorized by the user):</p>\n<p><strong>Sleep Scores:</strong> This is now available via the Health API (including sleep score and quality of sleep)</p>\n<p><strong>Health Snapshot:</strong> This <a href=\"https://support.garmin.com/en-US/?faq=PB1duL5p6V64IQwhNvcRK9\">two-minute manually triggered snapshot</a> includes the snapshot data including heart rate, HRV, Pulse Ox, respiration rate, and stress.</p>\n<p><strong>Pregnancy Tracking:</strong> This has been included within the larger Women’s Health API, allowing apps to receive that detailed <a href=\"https://connect.garmin.com/features/pregnancy-tracking/\">pregnancy tracking information</a> if the user authorizes it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-29.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-29.png\" /> </a><a href=\"https://media.dcrainmaker.com/images/2021/10/image-30.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-30.png\" /> </a><a href=\"https://media.dcrainmaker.com/images/2021/10/image-31.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-31.png\" /></a></p>\n<p>Next, we get into the Garmin Connect IQ platform changes. Connect IQ are the bits that run apps on your watch or other Garmin device, such as a Garin Edge. This is where the bulks of the updates were centered this year, though, I wouldn’t consider this a major update year. That was last year. Like most developer platforms, the more mature they get (in terms of size and user base), the less significant the changes get each year. Most developers appreciate stability, as it makes long-term planning easier.</p>\n<p>For this year, it was the announcement of Garmin Connect IQ System 5. This follows with the annual incrementing of the system each year (just like iOS or watchOS increments once per year).</p>\n<p><strong>Improved App Settings:</strong> This allows app developers to do far more in terms of allowing users to configure their app settings. Meaning, if you’ve got a Connect IQ app, now the app can have more detailed app settings like groups and toggles. This is applicable across GCM, Garmin Express, and the CIQ App.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-32.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-32.png\" /></a></p>\n<p><strong>Revamped CIQ Device Simulator:</strong> This allows developers to playback a .FIT file workout, and now developers can specify an exact point in the workout using the skimmer, and control the data field events.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-33.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-33.png\" /></a></p>\n<p>Display Improvements: If there’s any line item here that gives you insight into the future, it’s this one. Garmin is essentially creating a new class of devices that have greater allowances/tolerances for the always-on watch faces. At the moment, that’s only the Venu 2 devices. However, the exact wording used in the event was “On the Venu 2 series, and future AMOLED devices, we are loosening the rules for making always-active watch faces to make it easier to make watch faces on AMOLED”.</p>\n<p>Specifically, Garmin will now allow Venu 2 series (and future unannounced AMOLED units) to skip the per-pixel burn detector, as long as less than 10% of the pixels are on. Garmin noted that the Venu 2 has different hardware than the Venu 1, which makes this possible without concern of burn-on on those displays. I asked for a bit more clarity on this, and rather than re-write everything, here’s the notable bits from Garmin’s CIQ lead, Nicholas Kral on how this differs from the original Venu:</p>\n<blockquote><p>“The ultimate goal is to allow the user to have always-on watch faces, keep high battery life, and protect the lifetime of the AMOLED display.</p>\n<p>With [the original] Venu, when a watch face went into always on mode we change the watch face update rate to once-a-minute and have two rules:</p>\n<ol>\n<li>You can only have 10% of the total pixels enabled (not black)</li>\n<li>You can only have a pixel on for up to four minutes</li>\n</ol>\n<p>If the developer violates one of those rules at runtime we turn off always on mode, and we provide tools in our SDK to validate a Venu watch face can meet the rules. Rule #1 is meant to maximize the amount of disabled pixels. Rule #2 is meant to prevent static elements from staying on for extended periods. What we find in practice it can be difficult to implement simple things like always on analog minute hands when even something of a single pixel width can take more than four minutes to turn off.”</p></blockquote>\n<p>I know this sounds geeky, and it is – but it seems like Garmin may be settling on AMOLED as the technology going forward for higher end displays. That’s somewhat notable because Garmin also flirted with LCD screens, in their <a href=\"https://www.dcrainmaker.com/2020/09/garmin-venu-sq-in-depth-review.html\">Venu SQ units last year</a>.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-34.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-34.png\" /></a></p>\n<p><strong>Adding New Profiler:</strong> This new profiler will help developers measure app performance, and works in both the simulator and the device. This means that developers can start to dig into what calls are taking the longest, and figure out out to fix them.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-35.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-35.png\" /></a></p>\n<p><strong>Updated documentation:</strong> Garmin says they’ve updated the documentation to help developers try and make more native looking apps, giving details on how each of the different Garmin product ranges and models have their own “personality” (their words, not mine). My watch has it’s own personality too, especially when it thinks I’m lazy. I’d call that sassy.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-36.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-36.png\" /></a></p>\n<p><strong>Expanded CIQ data metrics:</strong> Connect IQ apps can now access Body Battery, Stress, Recovery Time, VO2Max, and Activity History. However, at this time neither Training Load or Training Status are included unfortunately. I note that specifically, as I think it’d be great to have that accessible for watch faces, as that’s a core reason why I use the FR745 over the higher end watches (I like the Training Load default watch face). In addition, they’ve added support for accessing gyroscope (plus the previous magnetometer and accelerometer support).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-37.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-37.png\" /></a></p>\n<p><strong>Deeper App Store Analytics:</strong> Developers can now get further details about which devices are downloading their apps, including % based charts. This is going to be super useful for devlopers to figure out where to spend time. It’s also of course pretty much waaaaay overdue. But hey, better late than never.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-38.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-38.png\" /></a></p>\n<p>Before we get to the last item, here’s which platforms are getting Connect IQ System 5, though as with before, there are certain features within the family that only apply to certain hardware (such as the fancier display bits and features on the Venu 2)</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-39.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-39.png\" /></a></p>\n<p><strong>New On-Device Connect IQ Store:</strong> This is the second ‘Poke your ears up’ item, which is that Garmin is launching a Connect IQ store on device itself. This will have recommended apps from Garmin, which are then downloaded and updated via BLE and now also WiFi. This will be fairly basic at launch, for example you won’t be able to search for apps yet, rather, it’s just Garmin’s suggestion of new things to grab, or apps that you might want to update. Historically apps have only updated over BLE, so the expansion to WiFi is notable.</p>\n<p>Of course we’ve seen app stores come on-device to both Wear OS and watchOS, so this is a natural evolution for Garmin as well. However note, this will <strong>only be available for devices launched in 2022</strong>. Meaning, <strong>devices that aren’t announced yet</strong>, but not current devices.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-40.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-40.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/10/image-41.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-41.png\" /></a></p>\n<p>Phew. Got all that? Good.</p>\n<p>Wait, no? Well, then go read the <a href=\"https://forums.garmin.com/developer/connect-iq/b/news-announcements/posts/welcome-to-connect-iq-system-5\">developer documents here</a>. which dive into it in more details than my ice cream imposed timeline allows.</p>\n<h3><span>ANT+ Changes:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-42.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-42.png\" /></a></p>\n<p>There’s been a handful of minor changes to three ANT+ device profiles, they are:</p>\n<p><strong>ANT+ Bike Lights:</strong> The profile documentation has been updated, and certification has been made easier. Further, SimulANT now supports this – part of making the certification easier.<br />\n<strong><br />\nANT+ Heart Rate Device Profile:</strong> Improves performance for the profile in dense gym environments<br />\n<strong><br />\nANT+ E-C Profile:</strong> This isn’t a ANT+ thing per se, but they noted that Garmin now includes rowing machine support with selected wearables</p>\n<p>Generally speaking, there’s nothing as a consumer that you’ll need to know about these. Companies will these changes in to products and sensors over time. For example, on some random day in the future you might see your Garmin device say it has an update for your heart rate sensor. It’ll take a few mins, and that’ll be that.</p>\n<p>It’s been a while since we’ve seen any sweeping ANT+ device profile changes (such as when they introduced ANT+ FE-C). In some ways, stability is good. But as I discuss in my State of Sports Tech Keynote, numerous companies have noted the lack of fitness-specific device profile standards innovation/movement from both ANT+ &amp; Bluetooth has caused erosion of standards following. We’ve seen plenty of evidence of this especially within the indoor training space over the 1-2 years.</p>\n<p>Further, in their section of the presentation, ANT+ noted that the there was activity in the shifting &amp; control TWG’s (Technical Working Group). They said that one could find the exact schedule within the <a href=\"http://www.thisisant.com\">thisisant.com</a> site, though I was unable to find it. This may be because while I was logged in, it wasn’t as an annual (paid) member, and instead as a non-paid member. Either way, I could see value in at least having the schedule available, so smarter/startup companies could decide if it was worthwhile to upgrade their ANT+ membership to join those TWG’s (meaning, to know those TWG’s are actually still alive and doing something).</p>\n<p>Finally, the Nordic Semiconductor team had a section discussing their products, including that ANT+ is coming to the NRF5340 in 2022H1. Historically speaking Nordic and Texas Instruments had been pretty involved in the previous ANT+ Symposium. Also, all the most outlandish ANT+ Symposium moments were spawned by the Nordic crew. If it involved getting lost in the woods with Viking hats and beer, or perhaps on a horse with a dress…then the Nordic crew was involved. Anyway – if you’re at the chipset level, you probably have this information from Nordic directly.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-43.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-43.png\" /></a></p>\n<p>Ok – there ya go, a complete wrap-up of things. Gamin also had live developer breakouts, which they say should be posted shortly <a href=\"https://developer.garmin.com/gdvc/overview/\">to the developer conference page</a>. And then my State of Sports Tech 2021 keynote will also be released shortly as well – though as noted is now available for DCR Supporters in <a href=\"http://www.dcrainmaker.com/exclusives\">early access here</a>.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"ab8808e48e9e24364a5ea4f611db5c1f0595c7aac57646f073f22c6c2d72aa6c","category":"Cycling"}