{"title":"Optimizing Processing Parameters for NR/EBC Thermoplastic Vulcanizates: A Comprehensive Full Factorial Design of Experiments (DOE) Strategy","link":"https://www.preprints.org/manuscript/202406.0746/v1","date":1718174280000,"content":"This research explores the development of thermoplastic vulcanizate (TPV) blends derived from natural rubber (NR) and ethylene-butene copolymer (EBC) using a specific blend ratio and melt mixing technique. A comprehensive full factorial design of experiments (DOE) methodology is employed to optimize the processing parameters. TPVs are produced through dynamic vulcanization, combining rubber crosslinking and melt blending within a thermoplastic matrix under high temperatures and shear. The physico-mechanical properties of these TPVs are then analyzed. The objective is to enhance the mechanical performance by assessing the influence of blend ratio, mixing temperature, rotor speed, and mixing time on crucial properties, including tensile strength, elongation at break, compression set, tear strength, and hardness. Analysis of variance (ANOVA) identifies the optimal processing conditions that significantly improve material performance. Validation is achieved through atomic force microscopy (AFM), confirming the phase-separated structure and thus a success of dynamic vulcanization. Rubber process analyzer (RPA) and dynamic mechanical analyzer (DMA) assessments provide insights into the viscoelastic behavior and dynamic mechanical responses. Deconvolution analysis of temperature-dependent tanδ peaks reveals intricate microstructural interactions influencing the glass transition temperature (Tg). The optimized TPVs exhibit enhanced stiffness and effective energy dissipation capabilities across a wide temperature range, making them suitable for applications demanding thermal and mechanical load resistance. This study underscores the pivotal role of precise processing control in tailoring the properties of NR/EBC TPVs for specialized industrial uses. It highlights the indispensable contribution of the DOE methodology to TPV optimization, advancing material science and engineering, particularly for industries requiring robust and flexible materials.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ab8c98df1dd5d73a642b2bb9d2371e1ab522acaabb570725cc70bb5df0f0ed99","category":"Interdisciplinary"}