{"title":"Female proportion has a stronger influence on dispersal than body size in nematodes of mountain lakes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303864","date":1715954400000,"content":"<p>by Guillermo de Mendoza, Birgit Gansfort, Jordi Catalan, Walter Traunspurger</p>\r\n\r\nNematodes disperse passively and are amongst the smallest invertebrates on Earth. Free-living nematodes in mountain lakes are highly tolerant of environmental variations and are thus excellent model organisms in dispersal studies, since species-environment relationships are unlikely to interfere. In this study, we investigated how population or organism traits influence the stochastic physical nature of passive dispersal in a topologically complex environment. Specifically, we analyzed the influence of female proportion and body size on the geographical distribution of nematode species in the mountain lakes of the Pyrenees. We hypothesized that dispersal is facilitated by (i) a smaller body size, which would increase the rate of wind transport, and (ii) a higher female proportion within a population, which could increase colonization success because many nematode species are capable of parthenogenetic reproduction. The results showed that nematode species with a low proportion of females tend to have clustered spatial distributions that are not associated with patchy environmental conditions, suggesting greater barriers to dispersal. When all species were pooled, the overall proportion of females tended to increase at the highest elevations, where dispersal between lakes is arguably more difficult. The influence of body size was barely relevant for nematode distributions. Our study highlights the relevance of female proportion as a mechanism that enhances the dispersal success of parthenogenetic species, and that female sex is a determining factor in metacommunity connectivity.","author":"Guillermo de Mendoza","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab91a75b316cd2611f5222eba5255a6671d2677ace9a94e94be1ab201a8c65b5","category":"Interdisciplinary"}