{"title":"Dexamethasone inhibited angiotensin II and its receptors to reduce sepsis-induced lung and kidney injury in rats","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308557","date":1724421600000,"content":"<p>by Zhuqin Zhan, Zhulan Lian, Haitao Bai</p>\r\nObjectives <p>To investigate the effect of dexamethasone (DXM) on acute lung and kidney injury with sepsis and its possible mechanism.</p> Methods <p>Control (NC), lipopolysaccharide (LPS) and lipopolysaccharide + dexamethasone (LPS+DXM) treated groups were established by random assignment of 72 Wistar rats. The NC rats were injected with physiological saline, while the LPS group was injected with LPS (5 mg/kg) and LPS+DXM group was injected with LPS(5 mg/kg) first and followed by DXM (1 mg/kg). Serum tumor necrosis factor-α (TNF-α) and serum macrophage inflammatory protein 1α (MIP-1α) were measured by ELISA. Lung wet/dry weight ratio, serum creatinine(SCR) and blood urea nitrogen(BUN) were determined at various time points. Hematoxylin Eosin staining (HE) for pathological changes in the lung and kidney. Radioimmunoassay was used to detect the levels of angiotensin II (Ang II) in plasma, lung and kidney tissues. Immunohistochemistry and western blot (WB) were used to detect angiotensin II receptor type 1 (AT1R) protein and angiotensin II receptor type 2 (AT2R) protein in lung and kidney tissues. The level of nitric oxide (NO) in serum, lung and kidney were detected using nitrate reductase method.</p> Results <p>Compared with control group, serum TNF-α, MIP-1α, SCR, BUN, lung W/D, Ang II level in plasma, lung and kidney, lung and kidney AT2R protein, NO level in serum, lung and kidney were significantly elevated(P&lt;0.05) and pathological damage of lung and kidney tissues were showed in LPS group rats (P&lt;0.05), whereas DXM down-regulated the above indexes and alleviate pathological damage of lung and kidney tissues. However, the expression of the lung and kidney AT1R protein was opposite to the above results.</p> Conclusions <p>Sepsis can cause acute lung and kidney injury and changes RAAS components in circulating, lung and renal. DXM can improve acute lung and kidney injury in septic rats, and the mechanism may be related to the down-regulation of inflammatory factors, AngII, AT2R, NO and up-regulation of AT1R expression by DXM.</p>","author":"Zhuqin Zhan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ab957d2083bf1546aa3403f7d5a0d73d26208953b35fdb83fb9ce9e4ed965eb3","category":"Interdisciplinary"}