{"title":"2022 Giant Revolt Advanced bucks the trend, going longer, lower, and steeper","link":"https://cyclingtips.com/2021/11/2022-giant-revolt-advanced-bucks-the-trend-going-longer-lower-and-steeper/","date":1636041613000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-1-650x366.jpg\" /></div><h2>2022 Giant Revolt Advanced bucks the trend, going longer, lower, and steeper</h2><p>    </p><div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What it is:</strong>Giant’s second-generation Revolt gravel family.</li>\n\t\t\t\t\t                        <li><strong>Frame features:</strong>Carbon fiber or aluminum construction, clearance for 700×53 mm tires, adjustable rear dropouts, D-Fuse seatpost and stem, PF86 press-fit bottom bracket, front and rear fender mounts, rear rack mounts, six bottle mounts.</li>\n\t\t\t\t\t                        <li><strong>Weight:</strong>8.11 kg (17.88 lb), without pedals or accessories, set up tubeless.</li>\n\t\t\t\t\t                        <li><strong>Price:</strong> US$6,200 / AU$6,700 / £TBC / €TBC.</li>\n\t\t\t\t\t                        <li><strong>Highs:</strong>Super comfortable ride, low weight, progressive-enough frame geometry, strong track record for quality frame construction.</li>\n\t\t\t\t\t                        <li><strong>Lows:</strong>Questionable headset and spacer shaping, polarizing bar bend, questionable tire choice, could be stiffer up front.</li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\n\n\n\n<h2>Settling in</h2>\n\n\n\n<p>It’s been interesting to watch the evolution of mainstream gravel bikes over the past few years – which is a funny thing to say in and of itself given gravel has only been “mainstream” for a few years as it is. Giant’s first carbon gravel bike, the Revolt Advanced, debuted barely three years ago, but there’s now a second-generation version that incorporates some of what Giant has learned about this rapidly evolving segment since then.</p>\n\n\n\n<p>Not surprisingly, Giant has extended the reach of the new Revolt Advanced, but not by any extreme amount. It stretches just 5-8 mm depending on size, although it’s worth noting the previous version was already on the longer side for the time, and Giant has never been known to be terribly progressive (often for the better).</p>\n\n\n\n<p>As usual, the aim of pushing that front wheel further out in front of the rider is added stability, which is further enhanced by the lower bottom bracket. Whereas the previous Revolt Advanced had 70 mm of drop, this new one is now 10 mm further below the hub axles to lower the center of gravity. </p>\n\n\n\n<p>Should you want even more stability, you also now have the option of lengthening the chainstay. The short position is the same as it was before at 425 mm. However, flipping the aluminum dropout inserts not only extends that figure by 10 mm, but also slackens the head tube angle by 0.5° to further tone down the handling. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-geometry-1340x689.jpg\" /><figcaption>The geometry for the 2022 Giant Revolt Advanced and Advanced Pro carbon gravel bikes is moderately progressive. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-geometry-2-1340x680.jpg\" /><figcaption>Frame geometry on the aluminum versions is only slightly different. Photo: Giant.</figcaption></figure></li></ul></figure>\n\n\n\n<p>Interestingly, Giant hasn’t paired that longer front triangle with a slacker head tube angle as is currently the trend. In fact, the new Revolt is actually 0.5-1° steeper than it was before, with the exception of the XS size, which slackens by 0.5° (seat tube angles carry over). Trail figures are several millimeters shorter than before as a result for more steering responsiveness, although the total range is now greater. Whereas trail dimensions on the previous Revolt ranged from 71 to 74 mm, they now go from 65-78 mm in the short chainstay position, or 68-82 mm in the long one — a good indication that Giant has put in some work to more finely tune the handling for all rider sizes.</p>\n\n\n\n<p>Interestingly, those longer reach dimensions are canceled out by shorter stem lengths across the board, so the total effective reach is actually a touch shorter than before.</p>\n\n\n\n<h2>Free to choose</h2>\n\n\n\n<p>Once again, Giant has prioritized ride comfort on this new generation of the Revolt, with particularly prominent tube shaping on the carbon fiber models. The top tube is wide, but very thin, and the seatstays are once again very slender and prominently dropped to help promote seat tube flex on bumps. </p>\n\n\n\n<p>Aside from that, though, the frame is pretty straightforward, with trademark Giant features like the “PowerCore” wide and rectangular-profile down tube, and the PF86 press-fit bottom bracket shell (which, it should be mentioned, Giant has a history of doing quite well). There are no obvious doodads or mechanisms to be found in the frame or fork that are designed to boost ride quality. Instead – as it’s done in the past – Giant has shifted much of that burden to the seatpost and handlebar. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-6-1340x754.jpg\" /><figcaption>The top half of the Giant Revolt Advanced Pro frame is an odd mix of shapes.</figcaption></figure>\n\n\n\n<p>D-shaped cross-sections are used in both to help specifically promote downward flex without making anything feel too spongy in other directions. But yet despite the non-round profiles, you’re not locked into using either one. The seat tube bore is actually a round 30.9 mm diameter, so you can run a round seatpost if you prefer just by removing the aluminum wedge insert (or even an internally routed dropper). And although the tops of the “D-Fuse” handlebar have that distinctive profile, it’s a conventional 31.8 mm round section at the stem clamp. Speaking of which, it’s worth noting that the stem clamps to a standard 1 1/8-to-1 1/4″ round steerer tube, too, with external cable routing up front. Aside from the profiled-to-match upper headset cover and spacers, it’s all gloriously normal stuff.</p>\n\n\n\n<h2>Versatility is baked right in</h2>\n\n\n\n<p>Although Giant’s marketing materials clearly position the carbon Revolt Advanced models as being higher-performance options well-suited for gravel racing, that performance hasn’t completely come at the expense of practicality. </p>\n\n\n\n<p>Three bottle mounts are included on the main triangle – two inside as usual, and one under the down tube – there are additional bottle mounts on the fork blades, and also a feed bag mount (which can be used for another bottle) on the top tube. More impressive are the hidden front and rear fender mounts that don’t require any unusual hardware, and Giant has even devised a way to attach a conventional rear rack should you decide to run some traditional panniers.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-14-1340x754.jpg\" /><figcaption>Conventional fender mounts are located front and rear.</figcaption></figure>\n\n\n\n<p>Tire clearance is generous, too. </p>\n\n\n\n<p>The fork can clear 700c tires up to 53 mm-wide, and the rear can do the same when the dropout is set in the long position. In the short position, clearance drops to 700×45 mm. Giant didn’t provide official clearances with fenders installed, though, so expect all of those figures to drop a bit if you want to run mudguards.</p>\n\n\n\n<h2>Models and availability</h2>\n\n\n\n<p>Giant is again offering the Revolt in both carbon fiber and aluminum variants, with the fancier carbon fiber blend in the top-end Revolt Advanced Pro and its lighter Advanced SL fork lopping off 200 g (7 oz) in total from the standard Revolt Advanced. </p>\n\n\n\n<p>Giant will offer up to two models of the Revolt Advanced Pro, up to four models of the Revolt Advanced, and up to three models of the aluminum Revolt, depending on region. Giant says that “some” bikes will be available at the end of November (of 2021, just to be clear).</p>\n\n\n\n<p>Brief model specifications and pricing is as follows:</p>\n\n\n\n<ul><li>Revolt Advanced Pro 0: Shimano GRX Di2 2×11 electronic groupset, Giant CXR 1 Carbon Disc wheels; US$6,200 / AU$6,700 / £5000 / €TBC.</li><li>Revolt Advanced Pro 1: SRAM Rival eTap AXS electronic groupset, Giant CXR 1 Carbon Disc wheelset; US$5,000 / AU$n/a / £4,300 / €TBC.</li><li>Revolt Advanced 0: Shimano GRX 800 2×11 mechanical groupset, Giant CXR 2 Carbon Disc wheelset; US$4,200 / AU$5,200 / £3,500 / €TBC.</li><li>Revolt Advanced 1: SRAM Rival eTap AXS 1×12 electronic groupset, Giant P-X2 Disc wheelset; US$3,900 / AU$5,000 / £3,000 / €TBC.</li><li>Revolt Advanced 2: Shimano GRX 600/800 2×11 mechanical groupset with FSA Omega AGX crankset, Giant P-X2 Disc wheelset; US$2,800 / AU$3,600 / £2,400 / €TBC.</li><li>Revolt Advanced 3: Shimano GRX 400 2×10 mechanical groupset with FSA Omega Adventure crankset, Giant P-X2 Disc wheelset; US$2,300 / AU$n/a / £2,200 / €TBC</li><li>Revolt 0: Shimano 105 2×11 mechanical groupset with FSA Omega AGX crankset, Giant S-X2 Disc wheelset; US$n/a / AU$n/a / £TBC / €TBC.</li><li>Revolt 1: Shimano GRX 400 2×10 mechanical groupset with FSA Omega Adventure crankset, Giant S-X2 Disc wheelset; US$n/a / AU$2,200 / £TBC / €TBC.</li><li>Revolt 2: Shimano Sora 2×9 mechanical groupset with FSA Vero Pro crankset and Tektro MD-C550 mechanical disc-brake calipers, Giant S-X2 Disc wheelset; US$1,400 / AU$1,700 / £TBC / €TBC.</li></ul>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-1-1340x754.jpg\" /><figcaption>I dare say Giant will sell a fair number of these things. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-0-1-1340x754.jpg\" /><figcaption>The Giant Revolt Advanced 0 uses the same frame shape as the Revolt Advanced Pro, but a different carbon blend adds 200 g to the total weight. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-0-3-1340x754.jpg\" /><figcaption>Giant is bucking the trend by continuing to use external cable routing up front on the new Revolt series. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-0-4-1340x754.jpg\" /><figcaption>Most of the Revolt series features Shimano componentry. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-0-5-1340x754.jpg\" /><figcaption>Giant hasn’t bothered to incorporate a storage compartment in the down tube. While some may see those sorts of things as gimmicks, the reality is that they’re awfully handy. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-2-1-1340x754.jpg\" /><figcaption>The entry-level Giant Revolt 2 features a Shimano Sora drivetrain. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-1-1-1340x754.jpg\" /><figcaption>The Giant Revolt Advanced 1 looks quite nice in green, don’t you think? Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-2-1-1340x754.jpg\" /><figcaption>The 2022 Giant Revolt Advanced 2 gets a mix of Shimano GRX and FSA bits. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-1-2-1340x754.jpg\" /><figcaption>The Giant Revolt 1’s aluminum frame cuts a similar profile to the more expensive carbon versions. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/MY22-Revolt-1_Color-A-Grenadine_D2-1340x754.jpg\" /><figcaption>Giant doesn’t even bother running the rear derailleur housing through the chainstay on the aluminum Revolt models. This looks a tad clumsy, but it’s a lot easier to work on. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/MY22-Revolt-1_Color-A-Grenadine_D3-1340x754.jpg\" /><figcaption>Aggressive hydroforming gives the aluminum frames some impressive-looking shapes. Photo: Giant.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/MY22-Revolt-Advanced-1_Color-A-Phantom-Green-1340x777.jpg\" /><figcaption>Giant is even outfitting some Revolt models with dropper seatposts right from the factory. Photo: Giant.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Ride report</h2>\n\n\n\n<p>Giant supplied for testing a flagship (of course) Revolt Advanced Pro 0, built with a complete Shimano GRX Di2 2×11 electronic groupset, Giant’s new CXR 1 hookless carbon gravel wheelset, and Giant’s own D-Fuse SLR carbon seatpost, Contact SLR XR D-Fuse carbon handlebar, Contact forged aluminum stem, and Approach SL saddle with stainless steel rails.</p>\n\n\n\n<p>Actual weight for my small-sized sample is 8.11 kg (17.88 lb), without pedals or accessories, set up tubeless.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-3-1340x754.jpg\" /><figcaption>The chainstays are dropped, but in a subtle way that doesn’t make the change all that obvious.</figcaption></figure>\n\n\n\n<p>Having not previously ridden any of Giant’s first-generation carbon Revolt Advanced gravel bikes, I honestly wasn’t sure what to expect here. But after riding this thing for about 2 1/2 weeks now, it seems like I’ve been missing out a little.</p>\n\n\n\n<p>What’s most noticeable to me about the Revolt Advanced Pro 0 is its supremely smooth ride. It’s well damped and rather muted, and the amount of vertical flex is tangible and substantial. With the stock 40 mm-wide Maxxis Receptor tires set at a decidedly average 32/33 psi front/rear, the bike laughs off washboard and stutter bumps, but yet never feels soft or sloppy in the process. It’s easily one of the most comfortable gravel bikes I’ve ridden in recent memory.</p>\n\n\n\n<p>More impressive is how the bike still manages to be efficient when you put down the power. It doesn’t seem to do so by being super stiff like I find with many top-tier road racing bikes, though, like it’s channeling your input at the pedals into anger at the rear wheel. There’s an odd subtlety to how the Revolt Advanced Pro 0 goes about that business, and feedback is a little lacking. It’s more like one of those bikes that just strangely floats forward as you accelerate and somehow just manages to feel lighter than it is. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-27-1340x754.jpg\" /><figcaption>Kudos to Giant for allowing both its own D-shaped seatpost and round 30.9 mm-diameter ones fit in the same frame. All you need to do is add or remove a spacer.</figcaption></figure>\n\n\n\n<p>The bike <em>is </em>light, but not unusually so – it’s no Specialized S-Works Crux in that sense – and it’s stiff, but it doesn’t seem to be <em>that </em>stiff. That said, the swing weight is noticeably low, which perhaps contributes to that wispy sensation when it comes time to sprint or climb. </p>\n\n\n\n<p>Whatever it is, I like it.</p>\n\n\n\n<p>Handling-wise, it’s an interesting scenario. In typical Giant fashion, the new Revolt may be longer than the old one, but it’s in no way outrageously long. It’s pleasantly stable and confidence-inspiring at higher speeds or on loose ground, but yet you don’t have to readjust how you shift your weight when attacking corners like you sometimes have to do on more progressive gravel bikes with even longer front-centers. It’s a good middle ground that I suspect most riders will find to be reassuring without being radical. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-13-1340x754.jpg\" /><figcaption>The thinness of the top tube is quite obvious when viewed in contrast with the head tube and down tube.</figcaption></figure>\n\n\n\n<p>I also find it noteworthy that this combination of a longer reach and quicker steering geometry is one that’s being adopted by a growing number of brands, such as on the <a href=\"https://cyclingtips.com/2021/04/cervelo-aspero-5-gravel-bike-review/\" target=\"_blank\">Cervelo Aspero</a> and <a href=\"https://cyclingtips.com/2021/09/2022-trek-checkpoint-gravel-bike-review/\" target=\"_blank\">Trek Checkpoint</a>. As it turns out, it’s a pretty good way to provide that calmness off-road without making the bike handle like a barge.</p>\n\n\n\n<p>That said, I question Giant’s decision to shorten the stem lengths. Normally, those shorter stem lengths are used to help counteract the inherent slowness of a very long trail dimension by physically reducing how much you need to move the bars to initiate a turn. But on this Giant, the trail dimension isn’t all that long, so at least to me, the front of the bike ends up feeling like it wants to stray off-center just a tad at lower speeds. I didn’t have time to try this out, but my guess is that bumping the stem length up by 10 mm or so would make for a more natural steering feel. </p>\n\n\n\n<p>Speaking of 10 mm, I’ll admit that I didn’t have a chance to try out the adjustable rear dropout before the release date (partially because, due to a miscommunication, I thought I had a week more to write this than I actually did). That said, I’ve tried a nearly identical setup on other bikes in the past and have no reason to think it doesn’t do what Giant says it does. Were I loading up for a multi-day loaded trip and needed to max out the clearance and tone down the handling, it’s good to have the option. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-9-1340x754.jpg\" /><figcaption>The cutout in the back of the seat tube helps with tire clearance.</figcaption></figure>\n\n\n\n<p>However, I wish Giant had devised a more elegant way of doing the switch. Whereas some other bikes with adjustable geometry pair the dropout and brake mount together (like what Otso does on <a href=\"https://cyclingtips.com/2017/10/otso-warakin-frameset-review-all-packed-up-and-everywhere-to-go/\" target=\"_blank\">the Warakin</a> and several other models), they’re separate bits on the Revolt and there’s more adjustment required. This setup likely saves a few grams as compared to a more cleverly engineered one-piece mechanism, but personally, I’d rather save the headache instead.</p>\n\n\n\n<p>Handling precision could perhaps be a touch better, too. While the front end of the bike is remarkably comfy, it seems to have eaten into the front triangle’s torsional stiffness a hair in the process. It’s something I only noticed when I was really giving it the beans, and I’ll admit that I never found it particularly objectionable or distracting. However, keep in mind that I’m of decidedly average height and smaller frames are generally stiffer than bigger ones, so I’d be curious to hear from any taller riders who end up on one of these if they notice the same thing.</p>\n\n\n\n<h2>Spec notes</h2>\n\n\n\n<p>Giant has been making its own wheelsets for quite a long time now, but it seems that it’s only recently the brand is starting to hit its stride in that arena. I didn’t have a chance to get an actual weight on these revamped CXR 1 carbon wheels, but claimed weight is just under 1,400 g. They feel light and snappy, the 25 mm internal width provides excellent casing support for larger tires, and build quality is excellent with even spoke tensions all around. Thanks to the proven DT Swiss 54-tooth Star Ratchet internals, freehub engagement is pleasantly quick without being too loud and buzzy, either, and it’s good to see conventional straight-pull bladed stainless spokes and external nipples for a gravel wheelset. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-35-1340x754.jpg\" /><figcaption>The new Giant CXR 1 carbon wheels are thoroughly modern, with a 25 mm internal width and a hookless profile.</figcaption></figure>\n\n\n\n<p>I went into this review rather skeptical of the 40 mm-wide Maxxis Receptor tires Giant chose to wrap around those wheels, though. They’re alarmingly devoid of tread aside from a sparse row of shoulder blocks on either edge, and fully expected them to be akin to running on a skating rink in wooden clogs. But in reality, they’re actually quite decent – at least on hard-packed dirt and moderate gravel. </p>\n\n\n\n<p>“With a revised focus on racing, we specified much of the Revolt range with fast-rolling, speed oriented, Maxxis Receptor tires in 700x40c,” explained Giant global product marketing manager Andrew Juskaitis. “While riders might sacrifice in rougher conditions (i.e. loose or mud), we wanted to give the owner some of the fastest-rolling tires on the market.”</p>\n\n\n\n<p>In those situations, they’re as fast as you’d expect, they ride great, and offer a surprising amount of grip. They’ll still bite you back pretty hard if you foolishly dive into a corner too hot or if the ground suddenly gets loose underneath you, and I ultimately swapped out the front for a Maxxis Rambler before I lost too much skin. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-49-1340x754.jpg\" /><figcaption>The Giant Approach SL saddle was a comfy place to spend some time.</figcaption></figure>\n\n\n\n<p>Up top, the Giant-branded seatpost and saddle were quite good, too, the former comfortable and supportive, and the latter easy to adjust and creak-free. The stem did the job, and kudos to Giant for sticking to a standard 1 1/8″ steerer diameter. However, I could do without the profiled-to-match headset cover and spacers as it unnecessarily limits your stem choices while adding questionable aesthetic benefit.</p>\n\n\n\n<p>I had more misgivings about the bar. It undoubtedly adds to the bike’s overall comfort – even just pushing down on the ends quickly reveals how much downward flex is available – but between the rearward sweep of the tops and that stubby stem, I found myself regularly smacking my knees into it whenever I was out of the saddle. That rearward sweep makes the stem feel even shorter than it actually is, too, and at least for me, the bend of the drops felt a little awkward. As always with this sort of thing, though, YMMV.</p>\n\n\n\n<p>As for the Shimano GRX Di2 groupset, I’m not sure I have anything to add that hasn’t already been said. Though I’d like to see Shimano offer a wide range 1×12 option here, the 2×11 setup does offer a very wide range, and with pleasantly small gaps between individual gears, albeit with the added complication of two chainrings and another derailleur. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-48-1340x754.jpg\" /><figcaption>The ultra-short stem is somewhat offset by the extra length of the GRX Di2 lever bodies.</figcaption></figure>\n\n\n\n<p>Nevertheless, shift quality is truly superb, the pulley cage clutch does an excellent job of keeping the chain from rattling around (and as a bonus, it’s adjustable <em>and </em>serviceable), and the levers are very comfortable with a secure hold for your hands. I still prefer to program the shift buttons to more closely emulate how SRAM’s eTap levers operate, however, and while the pronounced texture on the lever hoods is great for grip, it’s also brutal on your hands. I’d advise wearing gloves.</p>\n\n\n\n<p>All of this runs admirably quietly, too. Although the Revolt Advanced Pro 0 comes equipped with a PF86 bottom bracket shell, Giant historically has done a very good job of maintaining tight tolerances. My test sample hasn’t started creaking yet, and I suspect it’ll stay that way.</p>\n\n\n\n<h2>Final thoughts</h2>\n\n\n\n<p>As the gravel market has matured, we’ve seen the inevitable hyper-segmentation of what was originally a somewhat homogenous niche. But now we’ve got gravel bikes that are basically just ‘cross racing bikes with fatter tires, gravel bikes that are masquerading as mountain bikes with suspension forks and dropper seatposts, and everything in between, with all sorts of crazy variations in geometry and features.</p>\n\n\n\n<p>Sitting somewhere in that middle ground is this Revolt Advanced Pro 0. True to form, Giant isn’t trying to break any new ground here, and history has demonstrated there’s wisdom in staying the conservative course. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-4-1340x754.jpg\" /><figcaption>Giant is aiming at the heart of the gravel market with its latest Revolt range.</figcaption></figure>\n\n\n\n<p>It’s not the lightest, or the stiffest, or the most anything-est, but it nevertheless strikes me as a wonderful partner for an all-day adventure, and especially so if you’re trying to get somewhere quickly and in comfort. </p>\n\n\n\n<p>So in other words, yeah, I like it.</p>\n\n\n\n<p>More information can be found at <a href=\"https://www.giant-bicycles.com/global/revolt\" target=\"_blank\">www.giant-bicycles.com</a>.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-2-1340x754.jpg\" /><figcaption>Giant has seemingly prioritized ride comfort above all else on the latest Revolt Advanced Pro.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-5-1340x754.jpg\" /><figcaption>I’m not sure many people would refer to the new Revolt Advanced Pro frame as elegant or beautiful, but it’s nevertheless pretty distinctive.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-7-1340x754.jpg\" /><figcaption>The abrupt angle between the seat tube and chainstays presumably aids in comfort.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-8-1340x754.jpg\" /><figcaption>Giant’s “PowerCore” concept pushes the down tube, seat tube, and chainstays to the full width of the PF86 press-fit bottom bracket shell.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-10-1340x754.jpg\" /><figcaption>The chainstays are tall, but not outlandishly so.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-11-1340x754.jpg\" /><figcaption>The all-carbon fork is fairly svelte.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-12-1340x754.jpg\" /><figcaption>There’s a hint of some aero shaping here, but it seems unlikely to have much of a measurable benefit.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-15-1340x754.jpg\" /><figcaption>No weird hardware required here!</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-16-1340x754.jpg\" /><figcaption>In case you need to haul some extra water, there are bottle mounts on each fork leg.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-17-1340x754.jpg\" /><figcaption>Giant uses interchangeable inserts for the internal routing ports.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-18-1340x754.jpg\" /><figcaption>The seatpost is secured by a wedge-type internal binder. It seemed to work just fine.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-19-1340x754.jpg\" /><figcaption>This rubber cover should fit far more tightly and securely than it does in reality. It’s a disappointingly sloppy fit.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-21-1340x754.jpg\" /><figcaption>The front derailleur mount is removable should you decide you prefer a 1x setup.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-22-1340x754.jpg\" /><figcaption>Braided reinforcement layers are visible under the tinted clearcoat.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-23-1340x754.jpg\" /><figcaption>Giant says the new Revolt will handle 700×53 mm tires front and rear (when the rear dropouts are set in the long position).</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-24-1340x754.jpg\" /><figcaption>Even in the short position, there’s room to spare around these 700×40 mm Maxxis Receptor tires.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-25-1340x754.jpg\" /><figcaption>The adjustable dropout system isn’t as refined as I’d prefer, with too many little parts and too many separate pieces.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-26-1340x754.jpg\" /><figcaption>Always good to see that carbon fiber sheen in the sun.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-28-1340x754.jpg\" /><figcaption>160 mm-diameter rotors are specified front and rear.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-29-1340x754.jpg\" /><figcaption>Would a fully integrated and internal setup clean things up in this area? Yes, it would. But it’d also be a huge pain in terms of adjustment, service, and maintenance.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-30-1340x754.jpg\" /><figcaption>Giant provides some flexibility in where you put your bottle cages, presumably to make it easier to fit a frame bike inside the main triangle.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-31-1340x754.jpg\" /><figcaption>Top tube mounts for more stuff.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-32-1340x754.jpg\" /><figcaption>The D-Fuse handlebar works as advertised. All you need to do is push on the ends to see how much the thing moves.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-33-1340x754.jpg\" /><figcaption>I could do without the backswept tops.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-34-1340x754.jpg\" /><figcaption>This bend wasn’t my favorite, but then again, that’s a matter of personal preference.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-36-1340x754.jpg\" /><figcaption>Giant obviously went for speed when specifying these Maxxis Receptor tires.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-38-1340x754.jpg\" /><figcaption>Giant uses 2-to-1 spoke lacing to even out the tension between both sides.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-39-1340x754.jpg\" /><figcaption>The rear hub engages fairly quickly, and doesn’t sound objectionably buzzy.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-40-1340x754.jpg\" /><figcaption>I don’t know about you, but these profiled headset spacers don’t really do much for me.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-41-1340x754.jpg\" /><figcaption>The GRX hydraulic disc brakes were outstanding, as usual.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-42-1340x754.jpg\" /><figcaption>The two-bolt head is easy to adjust and holds tight.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-43-1340x754.jpg\" /><figcaption>Shimano’s 2×11 GRX drivetrain works extremely well, but the company would still do itself a favor by coming out with a wider-range 1×12 setup.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-44-1340x754.jpg\" /><figcaption>The 11-34T cassette keeps the individual jumps smaller than wider-range clusters.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-45-1340x754.jpg\" /><figcaption>Shimano’s pulley cage clutch can be switched on and off, and it’s also adjustable and serviceable.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-46-1340x754.jpg\" /><figcaption>I would have rather seen a genuine Shimano chain here, but this KMC one will do.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Giant-Revolt-Advanced-Pro-0-review-47-1340x754.jpg\" /><figcaption>The 35 mm depth presumably makes these wheels somewhat aero, but it’s unlikely most buyers will really care much about that.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/11/2022-giant-revolt-advanced-bucks-the-trend-going-longer-lower-and-steeper/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ab977c3ce0e2f68c4cdafa588270ebede0c0946a03304c7e809e1460229e82c2","category":"Cycling"}