{"title":"Clinical Trial on the Use of Biofeedback Prior to Robotic Prostate Surgery","link":"https://www.preprints.org/manuscript/202410.0327/v1","date":1728048112000,"content":"Background and Objective: Prostate cancer is the leading cancer affecting males. The treatment is radical prostatectomy, with its main complications being urinary incontinence and erectile dysfunction. Various studies demonstrate that exercises targeting the pelvic floor muscles help improve these complications, although sometimes, these exercises are not performed correctly, rendering the effort ineffective. To avoid this circumstance, a study comparing a group with biofeedback‐guided learning led by a nurse expert in the technique against another without this learning method is designed. Methods: Randomized clinical trial with two arms; the study group underwent two biofeedback sessions prior to surgery for the identification of the muscles to work on, compared to another group where no prior learning of the muscles was done. These fifteen‐minute sessions involved the placement of electromyography sensors for muscle contraction detection. Both groups followed the same care process where the protocol for reinforcing the perineal muscles after the removal of the urinary catheter was explained. Data were collected through validated questionnaires. Key Findings and Limitations: The results obtained show a clear improvement in the prevalence of urinary incontinence and erectile dysfunction in patients who underwent two biofeedback sessions prior to surgery, as well as a high rate of adherence and satisfaction with the care received in both the control group and the study group, regardless of whether they experienced urinary incontinence and/or erectile dysfunction. Conclusions and Clinical Implications: Biofeedback is a safe method that helps reduce complications after prostatectomy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aba461f69ef7db7c6a9ca88d2460766f11488f0102f736e3e60770b545ec5b19","category":"Interdisciplinary"}