{"title":"Genome-wide investigation of SQUAMOSA promoter binding protein-like genes in Liriodendron and functional characterization of LcSPL2","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae008/7611074?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>The plant-specific SQUAMOSA promoter-binding protein-like (SPL) transcription factors play a pivotal role in various developmental processes, including leaf morphogenesis and vegetative to reproductive phase transition. <span>Liriodendron chinense</span> and <span>Liriodendron tulipifera</span> are widely used in landscaping due to their tulip-like flowers and peculiar leaves. However, the <span>SPL</span> gene family in <span>Liriodendron</span> has not been identified and systematically characterized. We systematically identified and characterized the <span>SPL</span> family members in <span>Liriodendron</span>, including phylogeny, gene structure and syntenic analyses. Subsequently, we quantified the expression patterns of <span>LcSPLs</span> across various tissue sites through transcription-quantitative polymerase chain reaction (RT-qPCR) assays and identified the target gene, <span>LcSPL2</span>. Finally, we characterized the functions of <span>LcSPL2</span> via ectopic transformation. Altogether, 17 <span>LcSPL</span> and 18 <span>LtSPL</span> genes were genome-widely identified in <span>L. chinense</span> and <span>L. tulipifera</span>, respectively. All the 35 <span>SPLs</span> were grouped into 9 clades. Both species had three <span>SPL</span> gene pairs arising from segmental duplication events, and the <span>LcSPLs</span> displayed high collinearity with the <span>L. tulipifera</span> genome. RT-qPCR assays showed that <span>SPL</span> genes were differentially expressed in different tissues, especially. Because <span>LcSPL2</span> is highly expressed in pistils and leaves, it was selected to describe the <span>SPL</span> gene family of <span>L. chinense</span> by ectopic expression. We showed that overexpression of <span>LcSPL2</span> in <span>Arabidopsis thaliana</span> resulted in earlier flowering and fewer rosette leaves. Moreover, we observed that overexpression of <span>LcSPL2</span> in <span>A. thaliana</span> up-regulated the expression levels of four genes related to flower development. This study identified <span>SPL</span> genes in <span>Liriodendron</span> and characterized the function of <span>LcSPL2</span> in advancing flower development.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"aba8c9051b46bcbd8347bfa0b090fb5b0b4d722b62fdc1e0b655618953ba621c","category":"Environment"}