{"title":"Join the club with Rouvy","link":"https://www.cyclist.co.uk/sponsored/rouvy-augmented-reality-indoor-training","date":1678461471000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/sponsored/rouvy-augmented-reality-indoor-training\">Join the club with Rouvy</a></p>\n\n<p>Women’s pro cycling is on the rise. From British legends such as Lizzie Deignan and Laura Kenny to European powerhouses Marianne Vos and Annemiek van Vleuten, women are becoming household names to rival the likes of Chris Froome and Tadej Pogačar on the men’s side. </p>\n\n\n\n<p>Very soon you will be watching Vos, Van Vleuten and a host of others tackle the cobbles of Flanders and Paris-Roubaix before they head to France for the second edition of the Tour de France Femmes, and that is only serving to inspire more women to take up cycling.</p>\n\n\n\n<p>Old prejudices are crumbling fast, and where indoor cycling was perhaps once seen as a male preserve – the man in his ‘pain cave’ – the landscape is changing in 2023. And Rouvy can show you how.</p>\n\n\n\n<h2>What is Rouvy?</h2>\n\n\n\n<p>Rouvy is an indoor cycling app that allows you to travel the world and ride iconic cycling routes from the comfort of your own home. The routes use immersive high-quality video with augmented reality, and include some of the world’s most famous cycling hotspots, such as Italy’s legendary Passo dello Stelvio, the mighty Col du Tourmalet in France and the stunning Sa Calobra in Mallorca. </p>\n\n\n\n<p>It’s an ideal way to train on routes that you plan to ride in the future, or simply to visit far-flung locations that you might never get to see in real life.</p>\n\n\n\n<p>There are more than 700 augmented reality routes in total, covering more than 15,000km of roads. All you need to do is link the app to your device – whether a monitor, phone, tablet or Apple TV – and connect it to a smart bike or even your own favourite road bike via any type of interactive indoor trainer.</p>\n\n\n<div>\n<figure><img loading=\"lazy\" width=\"970\" height=\"786\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-970x786.jpg\" alt srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-970x786.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-300x243.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-768x623.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-750x608.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2-1140x924.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/03/rouvy-advertorial-2.jpg 1184w\" /><figcaption></figcaption></figure></div>\n\n\n<h2>What’s in it for you?</h2>\n\n\n\n<p>Rouvy is the  ideal training partner whether you’re new to the sport or looking to up your fitness game. Group rides allow you to connect and enjoy time with like-minded cyclists from around the world, plus you can compete in races and take part in challenges to win prizes. You can choose to take it easy and enjoy the scenery and a chat while you ride, or use one of the structured workouts from Rouvy’s extensive library, which also offers access to training plans from TrainingPeaks. </p>\n\n\n\n<p>There’s a five-week training plan for beginners, and the app even offers real-time feedback on your ride effort. Like cycling itself, Rouvy is open to all, and there is a growing female contingent recognising the benefits of structured indoor training.</p>\n\n\n\n<p>Rouvy also now includes Strava Live Segments to increase your connection with the outdoor world. On Rouvy, your segment ride will show up next to two avatars: your own best result on the segment (PR) and the fastest rider overall for the segment – the King or Queen of the Mountain.</p>\n\n\n\n<h2>Up the career ladder</h2>\n\n\n\n<p>Most people do like to ride outdoors as well, and the good news is that you can count your cycling efforts in the great outdoors towards your Rouvy Career. If you’re inspired by the new generation of young riders making their way up the cycling ladder – think Road Race Junior World Champion Zoe Bäckstedt, or her big sister Elynor at the Trek-Segafredo Women’s WorldTour team – this mode allows you to follow in their wheeltracks and progress in your own career.</p>\n\n\n\n<p><strong>• Want to find out more and join the club? Simply visit <a href=\"//www.rouvy.com\" target=\"_blank\">rouvy.com</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/sponsored/rouvy-augmented-reality-indoor-training\">Join the club with Rouvy</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Martin James","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"aba822473f392c6b25b44238ab18598e80c7b168ef56eabe6458de871b3736eb","category":"Cycling"}