{"title":"D3 Publisher เปิดตัวเกม Custom Mech Wars เกมบังคับหุ่นยนต์มุมมองบุคคลที่ 3 ชูจุดเด่นปรับแต่งหุ่นได้ดั่งใจ","link":"https://www.blognone.com/node/135510","date":1693384555000,"content":"<div><div><div><p>D3 Publisher ประกาศเปิดตัว Custom Mech Wars เกมบังคับหุ่นยนต์มุมมองบุคคลที่ 3 ให้กับเครื่อง PS5 และ PC โดยจะวางขายในช่วงฤดูหนาวปีนี้พร้อมกันทั่วโลก และจะเปิดให้ทดลองเล่นภายในงาน Tokyo Game Show 2023 ที่จะจัดขึ้นในวันที่ 21 ถึง 24 กันยายนนี้ ณ เมืองชิบะ ประเทศญี่ปุ่น</p>\n<p>ตัวเกมชูจุดเด่นก้านการปรับแต่งหุ่นยนต์ ที่สามารถปรับแต่งได้อย่างอิสระในชื่อระบบ Omega Customization System ซึ่งสามารถปรับแต่งได้แม้กระทั่งใส่ส่วนประกอบของหุ่นยนต์ได้มากกว่า 1 ไม่ว่าจะเป็น หัว, แขน, ขา หรือจะปรับให้เป็นรูปแบบสัตว์หรือสิ่งของอื่น ๆ ก็ได้ (ในคลิปมีหุ่นยนต์ที่หน้าตาเหมือนแฮมเบอร์เกอร์)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ff290ac6d2af68e22a4af5fe965c2d14.jpg\" /></p>\n<p>ส่วนระบบการเล่นคร่าว ๆ ตัวเกมเป็นเกมยิงมุมมองบุคคลที่ 3 ที่จะให้เราตลุยภารกิจกำจัดศัตรูในแต่ละด่านเพื่อเก็บชิ้นส่วนต่าง ๆ เพื่อนำมาปรับแต่งหุ่นยนต์ของเรา อีกทั้งยังรองรับระบบออนไลน์ที่สามารถเล่นแบบ Co-op ได้ที่สูงสุด 4 คนในโหมดเนื้อเรื่องได้จนจบเกมอีกด้วย</p>\n<p>แม้ว่าคอนเซปต์จะดูคล้าย ๆ กับเกม Armored Core VI ที่เพิ่งวางจำหน่ายไป แต่ Custom Mech Wars นั้นดูเป็นเกมที่เน้นการเสริมสร้างจิตนาการสานฝันวัยเด็กของสาวกการ์ตูนหุ่นยนต์มากกว่าจะเป็นการท้าทายขีดจำกัดความสามารถด้านการเล่นเกมแบบ Armored Core ตรงจุดนี้อาจมองได้ว่าเกมนี้อาจจะคล้ายกับ Game Breaker แต่เปิดกว้างกว่าในด้านการปรับแต่งหุ่นยนต์ก็ว่าได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5a009c08a4a94548b2866e70dc9329c6.jpg\" /><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/18e813bb25c642d69ba4990f1e61f0c6.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.gematsu.com/2023/08/d3-publisher-announces-mecha-third-person-shooter-custom-mech-wars-for-ps5-pc\">Gematsu</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/custom-mech-wars\">Custom Mech Wars</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/ps5\">PS5</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"abb890208d2f9d114efafc317b2fe76e187ea82e5b259cfda73560ee11050267","category":"Thai"}