{"title":"Incidence and risk factors of SARS-CoV-2 breakthrough infection in the early Omicron variant era among vaccinated and boosted individuals in Chicago","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302338","date":1722866400000,"content":"<p>by Fabiola Moreno Echevarria, Mathew Caputo, Daniel Camp, Susheel Reddy, Chad J. Achenbach</p>\r\nBackground <p>SARS-CoV-2 vaccines are safe and effective against infection and severe COVID-19 disease worldwide. Certain co-morbid conditions cause immune dysfunction and may reduce immune response to vaccination. In contrast, those with co-morbidities may practice infection prevention strategies. Thus, the real-world clinical impact of co-morbidities on SARS-CoV-2 infection in the recent post-vaccination period is not well established. This study was performed to understand the epidemiology of Omicron breakthrough infection and evaluate associations with number of comorbidities in a vaccinated and boosted population.</p> Methods and findings <p>A retrospective clinical cohort study was performed utilizing the Northwestern Medicine Enterprise Data Warehouse. Our study population was identified as fully vaccinated adults with at least one booster. The primary risk factor of interest was the number of co-morbidities. The primary outcome was the incidence and time to the first positive SARS-CoV-2 molecular test in the Omicron predominant era. Multivariable Cox modeling analyses to determine the hazard of SARS-CoV-2 infection were stratified by calendar time (Period 1: January 1 –June 30, 2022; Period 2: July 1 –December 31, 2022) due to violations in the proportional hazards assumption. In total, 133,191 patients were analyzed. During Period 1, having 3+ comorbidities was associated with increased hazard for breakthrough (HR = 1.16 CI 1.08–1.26). During Period 2 of the study, having 2 comorbidities (HR = 1.45 95% CI 1.26–1.67) and having 3+ comorbidities (HR 1.73, 95% CI 1.51–1.97) were associated with increased hazard for Omicron breakthrough. Older age was associated with decreased hazard in Period 1 of follow-up. Interaction terms for calendar time indicated significant changes in hazard for many factors between the first and second halves of the follow-up period.</p> Conclusions <p>Omicron breakthrough is common with significantly higher risk for our most vulnerable patients with multiple co-morbidities. Age plays an important role in breakthrough infection with the highest incidence among young adults, which may be due to age-related behavioral factors. These findings reflect real-world differences in immunity and exposure risk behaviors for populations vulnerable to COVID-19.</p>","author":"Fabiola Moreno Echevarria","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"abd65546e2147ac6a2cdac1d3b4bb40353001e373c9c0ad939609dc7e5d3002a","category":"Interdisciplinary"}