{"title":"Assured Evenepoel and wide open sprints: Talking points from the UAE Tour 2023","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/in-review-how-the-2023-uae-tour-unfolded","date":1677445009000,"content":"\n      \n<p>All eyes were on world champion Remco Evenepoel as he returned to WorldTour racing for the first time since winning the rainbow jersey and the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> at the end of last season. And the Belgian duly delivered, expertly navigating the disruptive crosswinds of the opening stages to move into the overall lead, and defending the red jersey comfortably on the final mountain stage. </p>\n<div></div>\n<p><span>In what was a great race for Soudal - Quick-Step all round, Tim Merlier won two sprints, and the team pulled off a narrow victory in the team time trial. In the absence of their star man and defending champion Tadej Pogačar, the home team UAE Team Emirates’ race was more of a mixed bag, but they still managed to win two stages despite not providing much of a challenge to Evenepoel’s overall title. </span></p>\n<h3><span>Evenepoel triumphant</span></h3>\n<p><span>Although Evenepoel was hot favourite for the title, there were doubts about his form leading into the race. During his first race of the season, at Vuelta a San Juan in Argentina last month, he had made a costly mistake, overestimating his strength by attacking early on the decisive summit finish, only to pay for his effort and wind up being caught and dropped. </span></p>\n<p><span>However, this time his tactics were on point, and he was already firmly in control of the race as early as day three. </span></p>\n<p><span>His major coup came on the very first day of the race, when, aided by his powerful Soudal - Quick-Step team-mates Tim Merlier and Bert Van Lerberghe, he got into a 13-man group that went clear in an echelon amid windy conditions. In terms of GC rivals, this group featured only Luke Plapp (Ineos Grenadiers) and Pello Bilbao (Bahrain-Victorious), and ultimately arrived a whole 51 seconds ahead of the peloton.</span></p>\n<p><span>That advantage of 51 seconds over most of his rivals grew even more when Soudal - Quick-Step won the team time trial the following day, and when Evenepoel took the overall lead the next by sprinting for some bonus seconds in the large group that reached the finish together on the stage three summit finish at Jebel Jais, his lead felt virtually insurmountable.</span></p>\n<p>There were a few scares to come. For a brief moment about 20km from the finish during stage five he was caught on the wrong side of a split caused by the wind, but quickly recovered. Then Adam Yates (UAE Team Emirates) put him under pressure with a vicious acceleration on the ascent of Jebel Hafeet, dropping him 3km from the top. A significant gap opened up immediately, but, with an advantage of 1-14 over Yates on GC, Evenepoel didn’t need to panic, and went up the climb at his own pace to seal second place on the stage, and victory in the overall classification. He looks well on course to arrive at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> in top form, ahead of his first target of the season of winning the pink jersey. </p>\n<h3><span>A mixed bag for UAE Team Emirates</span></h3>\n<p><span>In the previous two editions of the UAE Tour, it was the home team UAE Team Emirates who instead enjoyed the kind of dominance achieved by Soudal - Quick-Step this year, with Tadej Pogačar taking the overall victory both times. Without their Slovenian talisman, however, things were more complicated. </span></p>\n<p><span>The first few days were especially bad. First they were caught out entirely by the crosswinds on the opening stage, failing to place a single one of their riders in the 13-man group that went clear, all while GC candidate Jay Vine crashed (and abandoned a few days later). Then they underperformed in the team time trial, only just reaching the line with the requisite number of four riders, and posting a time that was only the eighth fastest.</span></p>\n<p><span>Their race was partially redeemed by an unlikely source of stage four. Despite being up against a number of stellar line-ups, many of whom had teams built around targeting the bunch finishes, Juan Sebastián Molano got the better of them all to claim the team a stage win. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469709232.jpg?v=1677442796\" alt /></span></p>\n<p><span>Then on stage seven, the final day of the race, Adam Yates was unleashed. The team set him up by setting a fierce pace on the Jebel Hafeet, before Yates made his move 6km from the finish. Only Evenepoel could follow, and even he was dropped when Yates accelerated again 3km from the top. He reached the top to claim victory by ten seconds, in what turned out to be the quickest ever ascent of Jebel Hafeet. </span></p>\n<p><span>It was not enough to overturn all of the time he had lost in the crosswinds and the team time trial, but it was just about enough to take a podium finish on GC, three seconds ahead of an unfortunate Pello Bilbao (Bahrain-Victorious), who had to settle for fourth. </span></p>\n<p><span>Yates may lament not taking full advantage of what may be a rare chance to ride for himself at UAE Team Emirates, but he certainly seems at home at his new team. </span></p>\n<h3><span>Luke Plapp holds on for second</span></h3>\n<p><span>At Ineos Grenadiers, Luke Plapp is one of the young riders tasked with stepping up to help make up for the loss of departed riders like Adam Yates, and he excelled as their GC candidate at the UAE Tour. He rode smartly in the crosswinds to make the lead group on stage one, then moved into the red jersey after the team time trial. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469675592.jpg?v=1677443060\" alt /></span></p>\n<p><span>He didn’t have the legs to stay with Evenepoel and Yates on Jebel Hafeet, and looked in trouble when Pello Bilbao also dropped him on the climb. But he dug deep and paced himself, and ultimately made it back up to Bilbao, and limited his losses just enough to secure second place overall, just one second behind his former teammate Yates. The 22-year-old can expect more leadership opportunities in the future. </span></p>\n<h3><span>Wide open bunch sprints sprints</span></h3>\n<p><span>One of the early themes of the 2023 season has been just how open the bunch sprints have been, and the trend continued on the wide open roads that hosted several bunch sprints this week in the UAE. </span></p>\n<p><span>Tim Merlier ultimately came out on top by winning the final bunch sprint on stage six, taking his overall tally of stage wins to two having claimed the win from the small group that sprinted for stage two. But prior to that, different riders were excelling in each sprint.</span></p>\n<p><span>On stage four it was Juan Sebastián Molano who took the honours, followed by young guns Olav Kooij (Jumbo-Visma) and Sam Welsford (DSM), while the better established Merlier, Sam Bennett (Bora-Hansgrohe), Fernando Gaviria and Caleb Ewan (Lotto-Dstny) were nowhere to be seen. Then the next day those same younger riders were missing in action while Dylan Groenewegen (Jayco-Alula) expertly surfed wheels in the finale to take victories, followed closely behind by Gaviria and Bennett. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469160853.jpg?v=1677442933\" alt /></span></p>\n<p><span>And whereas Groenewegen was simply too fast for that day for Merlier to follow, the next day Merlier the opposite was true as the Belgian romped to victory despite having his nose in the wind for longer.</span></p>\n<p><span>This closeness was also reflected in the number of photo finishes. Molano edged out Kooij and Welsford in what was virtually a three-way photo finish. And Merlier defeated Caleb Ewan (Lotto-Dstny) by the barest of margins on stage two, undetectable to the naked eye. It took the commissioners an age to confirm who the winner was, and Ewan can count himself very unlucky having already been narrowly denied a first WorldTour of the season at the opening stage of the Tour Down Under.</span></p>\n<p><span>Most sprinters will therefore be able to take some heart from how the race went. Ewan and Mark Cavendish (Astana Qazaqstan), however, will be frustrated at failing to get in the mix after placing second and third on the opening stage, while Arnaud Demare (Groupama-FDJ) was not up to speed yet in what was his first race of the season. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"6dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"abd988b6da1a29d92fa1df1ef3c160a3081c8be8e7b7d67643982d","category":"Cycling"}