{"title":"Nasal High-Frequency Oscillatory Ventilation Use in Romanian Neonatal Intensive Care Units &ndash; Results of a Recent Survey","link":"https://www.preprints.org/manuscript/202406.0453/v1","date":1717741498000,"content":"Nasal high-frequency oscillatory ventilation (nHFOV) has emerged as an effective initial and rescue noninvasive respiratory support mode for preterm infants with respiratory distress syndrome (RDS). Multiple noninvasive respiratory support modes are currently available in Romania, but little is known about nHFOV use in Romanian neonatal intensive care units (NICUs). We aimed to identify the usage extent and clinical application of nHFOV in Romania. A structured web-based questionnaire was designed to find the rate of nHFOV use and knowledge of this new method of noninvasive respiratory support in Romanian level III NICUs. The questionnaire was addressed to the leaders of all level III Romanian NICUs. Using multiple-choice, open-ended, and yes/no questions, we collected information on the NICU’s size, noninvasive respiratory support modes used, nHFOV use, indications, settings, nasal interfaces, secondary effects, and equipment used. Descriptive statistics and comparisons were performed using IBM SPSS Statistics 26.0. A total of 21/23 (91.3%) leaders from level III NICUs (median [IQR] number of beds of 10 [10-17.5]) responded to the survey. The most frequently used noninvasive ventilation modes were CPAP mode on mechanical ventilators (76.2%), followed by NIPPV (76.2%), heated, humidified high flow nasal cannula (HHHFNC) (61.9%), and nHFOV (11/21 units; 52.4%); 5/11 units reported frequent nHFOV use (in 2 or more newborns/month) in both term and preterm infants. The main indications reported for nHFOV use were CPAP failure (90.9%), hypercapnia (81.8%), and bronchopulmonary dysplasia (72.7%). 10/11 units reported setting a mean airway pressure (MAP) equal to the CPAP level plus 1-2 cmH2O on rescue nHFOV after CPAP failure. Both dedicated equipment (45.5%) and hybrid ventilators (63.6%) were used for nHFOV delivery, with face/nasal masks and short binasal prongs being the most commonly used nasal interfaces (90.9% and 72.7%, respectively). Air leaks at the interface level (90.9%), thick secretions (81.8%), and airway obstruction (63.6%) were the most frequently mentioned adverse effects of nHFOV; none of the units mentioned pneumothorax as an adverse effect. Only 3 of the  NICUs had a written protocol for nHFOV use. Initial, minimum, and maximum amplitude and initial and minimum MAP settings used were significantly higher with hybrid ventilators as compared to dedicated equipment (p&lt;0.05). Most units not yet using nHFOV cited lack of equipment, experience, training, or insufficient information and evidence for the clinical use and outcome of nHFOV use in neonates as the main reasons for not implementing this noninvasive respiratory mode. Our survey showed that nHFOV is already used in more than half of the Romanian level III NICUs to support term and preterm infants with respiratory distress despite a lack of consensus regarding indications and settings during nHFOV. A need for training for nHFOV use was identified, and efforts are needed at the national level to develop courses and training sessions, including using simulation workshops, to offer more information on optimal nHFOV use in clinical practice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"abdf3b866b555b574e842ec89def85f89e37ba24c86603ef4bcf1a737aefee8d","category":"Interdisciplinary"}