{"title":"From data to decision: Machine learning determination of aerobic and anaerobic thresholds in athletes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309427","date":1724940000000,"content":"<p>by Michał Tomaszewski, Anna Lukanova-Jakubowska, Edyta Majorczyk, Łukasz Dzierżanowski</p>\r\n\r\nLactate analysis plays an important role in sports science and training decisions for optimising performance, endurance, and overall success in sports. Two parameters are widely used for these goals: aerobic (AeT) and anaerobic (AnT) thresholds. However, determining AeT proves more challenging than AnT threshold due to both physiological intricacies and practical considerations. Thus, the aim of this study was to determine AeT and AnT thresholds using machine learning modelling (ML) and to compare ML-obtained results with the parameters’ values determined using conventional methods. ML seems to be highly useful due to its ability to handle complex, personalised data, identify nonlinear relationships, and provide accurate predictions. The 183 results of CardioPulmonary Exercise Test (CPET) accompanied by lactate and heart ratio analyses from amateur athletes were enrolled to the study and ML models using the following algorithms: Random Forest, XGBoost (Extreme Gradient Boosting), and LightGBM (Light Gradient Boosting Machine) and metrics: R<sup>2</sup>, mean absolute error (MAE), mean squared error (MSE) and root mean square error (RMSE). The regressors used belong to the group of ensemble learning algorithms that combine the predictions of multiple base models to improve overall performance and counteract overfitting to training data. Based on evaluation metrics, the following models give the best predictions: for AeT: Random Forest has an R<sup>2</sup> value of 0.645, MAE of 4.630, MSE of 44.450, RMSE of 6.667; and for AnT: LightGBM has an R<sup>2</sup> of 0.803, the highest among the models, MAE of 3.439, the lowest among the models, MSE of 20.953, and RMSE of 4.577. Outlined research experiments, a comprehensive review of existing literature in the field, and obtained results suggest that ML models can be trained to make personalised predictions based on an individual athlete’s unique physiological response to exercise. Athletes exhibit significant variation in their AeT and AT, and ML can capture these individual differences, allowing for tailored training recommendations and performance optimization.","author":"Michał Tomaszewski","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"abedc380bf4613ec9a2cb542a57d67a17a7f5a2f6dec0fcfb12f2323f309cf05","category":"Interdisciplinary"}