{"title":"Engineers figured out how to cook 3D-printed chicken with lasers","link":"https://arstechnica.com/?p=1797021","date":1632408503000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Creative Machines Lab at Columbia Engineering has developed a system of software-controlled lasers to cook food with precision, retain moisture with the final-cooked product, brown food within its original packaging, and create an entirely new meal creation process for a consumer. </p></div>\n<p>Who hasn't dreamt of coming home after a long day and simply pressing a few buttons to get a hot, home-cooked 3D-printed meal, courtesy of one's digital personal chef? It might make microwaves and conventional frozen TV dinners obsolete. Engineers at Columbia University are trying to make that fantasy a reality, and they've now figured out how to simultaneously 3D-print and cook layers of pureed chicken, according to <a href=\"https://www.nature.com/articles/s41538-021-00107-1%C2%A0\">a recent paper</a> published in the journal <a href=\"https://www.nature.com/npjscifood/?gclid=CjwKCAjwy7CKBhBMEiwA0Eb7anc4rlrpkNtrvjQ8DSfXqhKyhVRld72oWShQKtJzplr8h7GuQy3LShoCD7YQAvD_BwE\">npj Science of Food</a>. Sure, it's not on the same level as the <a href=\"https://en.wikipedia.org/wiki/Replicator_(Star_Trek)\"><em>Star Trek</em> replicator,</a> which could synthesize complete meals on demand, but it's a start.</p>\n<p>Co-author Hob Lipson runs the Creative Machines Lab at Columbia University, where the research was conducted. His team first introduced <a href=\"https://repositories.lib.utexas.edu/handle/2152/80223\">3D printing of food items</a> back in 2007, using the Fab@Home personal fabrication system to create multimaterial edible 3D objects with cake frosting, chocolate, processed cheese, and peanut butter. However, commercial appliances capable of simultaneously printing and cooking food layers don't exist yet. There have been some studies investigating how to cook food using lasers, and Lipson's team thought this might be a promising avenue to explore further.</p>\n<p>\"We noted that, while printers can produce ingredients to a millimeter-precision, there is no heating method with this same degree of resolution,\" <a href=\"https://www.eurekalert.org/news-releases/928846\">said co-author Jonathan Blutinger</a>. \"Cooking is essential for nutrition, flavor, and texture development in many foods, and we wondered if we could develop a method with lasers to precisely control these attributes.\" The researchers used a blue diode laser (5-10 W) as the primary heating source but also experimented with lasers in the near- and mid-infrared for comparison, as well as a conventional toaster oven.</p></div><p><a href=\"https://arstechnica.com/?p=1797021#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797021&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"abee27b71bc4c80df72cc7560ba6bef9590cb35851369b6846388b0b1283be22","category":"Tech"}