{"title":"Tinea Incognito: Challenges in Diagnosis and Management","link":"https://www.preprints.org/manuscript/202403.1368/v1","date":1711103832000,"content":"Tinea incognito is a kind of skin infection that is caused by a fungus which has been changed by the use of topical or systemic steroids or other immunosuppressive medications. This alteration in the typical clinical presentation of the infection makes it difficult to diagnose for general practitioners and dermatologists. Delayed diagnosis, spread of the infection to critical body surfaces, resistance to antifungal drugs, and increased costs due to prolonged hospitalization and multiple treatment regimens often complicate tinea incognito. This condition can affect individuals of all ages and genders, but it is more common in children. Tinea incognito is a type of fungal skin infection that can present with various and non-specific clinical features, such as sudden onset of itching in an area that was previously unaffected, making it challenging to differentiate from other diseases such as eczema, seborrheic dermatitis, lupus erythematosus, psoriasis, or other non-fungal skin conditions. The treatment of tinea incognito usually involves stopping the use of topical steroids or other immunosuppressive medications. Preventive measures and management of the underlying fungal infection are necessary and can be achieved with antifungal drugs. Patients should wear loose cotton clothes, use boiling water for laundry, and iron their clothing before wearing them. Additionally, they should avoid sharing bed linens, towels, clothes, and shoes. This review aims to raise awareness of tinea incognito among health practitioners, provide tips for suspecting the disorder, include it in the differentials, and evaluate the available diagnostic procedures. The therapy utilized in published studies is also reviewed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ac047ce91982ab721a11bb4204f04c008f77c49b4662afa1c1b6c0043489aa3b","category":"Interdisciplinary"}