{"title":"Water snakes have a high diversity of parasites in anthropized environments","link":"http://link.springer.com/10.1007/s11252-024-01528-y","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>Because of their host's energetic exhaustion, parasites are among the first species to be influenced by environmental changes. The change in habitats caused by human activities can negatively influence ecosystems, reducing the resistance of host species to parasite attacks. There is little information on the role of urban disturbance in altering diversity and parasitic interactions in aquatic snakes. In this study, the diversity and structure of the parasite community in the water snake <em>Helicops angulatus</em> were investigated. The snakes were collected in three habitat areas (urban, periurban, and forest) in three municipalities on the north coast of the state of Paraíba, Brazil. Forty of the 158 watersnakes analyzed (25.3%) were infected. In total, 137 helminths were collected, representing an overall mean infection intensity of 3.58 ± 2.0. Considering both habitats environments (urban, peri-urban and forest), six Nematoda taxa (<em>Oswaldocruzia mazzai</em>, <em>Brevimulticaecum</em> sp., <em>Eustrongylides</em> sp., <em>Physaloptera</em> sp., Filariidae larva, and an unidentified Nematoda larva), four trematodes (<em>Infidum</em> aff. <em>similis</em>, <em>Travtrema</em> aff. <em>stenocotyle</em>, <em>Heterodiplostomum helicopsis,</em> and encysted metacercariae), two Acanthocephala (Centrorhynchidae gen. sp. and Oligacanthorhynchidae gen. sp.), and one Pentastomida (<em>Sebekia oxycephala</em>) were found, all of which represent the first record for <em>H. angulatus</em> with the exception of <em>S. oxycephala.</em>. The species diversity of endoparasites in <em>H. angulatus</em> was greater in urbanized habitats. Regarding interaction networks, there was low modularity and no nesting. This result may be linked to anthropization, indicating changes in the parasite-host relationship due to urbanization. In the forest areas there was a significant difference in the number of individuals, which was due to a single species of parasite (<em>Physaloptera</em> sp., 21 individuals) where it infected a single female. <em>Physaloptera</em> was the most abundant endoparasite present in the three areas. There were no significant differences in the size and sex of the snakes with parasite infection. This study provides important information about the relationships between parasites, hosts, and the habitat. It also shows that the increase in parasite diversity and new records are linked to habitat degradation.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"ac153b6c47b7466a182aa85e15b61872370058f26bf9659170c5e65043109e10","category":"Environment"}