{"title":"Profiling flavor characteristics of cold brew coffee with GC‐MS, electronic nose and tongue: effect of roasting degrees and freeze‐drying","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13437?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Roasting is an important process in the formation of coffee flavor characteristics, which determines the quality of coffee and consumer acceptance. However, the influence of roasting degree on the flavor characteristics of cold brew coffee has not been fully described.</p>\n<h2>RESULTS</h2>\n<p>In the present study, the flavor characteristics of cold brew coffee with different roasting degrees were compared in detail by using chromatographic and electronic sensory approaches, and the flavor changes induced by freeze-drying were investigated. Pyrazine and heterocyclic compounds were the main aroma compounds in coffee, and gradually dominated with the increase of roasting. Pyridine was consistently present in cold brew coffees of different roasting degrees and showed significant gradient of quantity accumulation. Aroma compounds such as pyrazine, linalool and furfuryl acetate were the main contributors to coffee roasting, floral and fruity flavor. Freeze-drying preserved the fruity and floral aromas of medium-roasted cold brew coffee, whereas reducing the bitterness, astringency and acidity properties that are off-putting to consumers.</p>\n<h2>CONCLUSION</h2>\n<p>The higher consumer acceptance and enjoyment in medium roast cold brew coffee may be related to its stronger floral and fruity aroma. The aroma profile qualities of freeze-drying processed medium roasted cold brewed coffee were more dominant and more suitable for freeze-drying processing than medium dark roasting. Application of freeze-drying for cold brew coffee will promote the convenience of drinking. The present study provides valuable technical guidance in improving the flavor and quality of cold brew coffee, and also promotes its commercialization process. © 2024 Society of Chemical Industry.</p>","author":"Donghao Zhang, \nMin Gao, \nYanpei Cai, \nJihong Wu, \nFei Lao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ac1b993f0102b7386a034b7c4f87bb92f8db4be6ce3ed8ef2c49b733675b256c","category":"Environment"}