{"title":"Droughts reshape apex predator space use and intraguild overlap","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14192?af=R","date":1728101685000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/7bef0d09-1896-49d7-a767-5220ab66283c/jane14192-toc-0001-m.png\" alt=\"Droughts reshape apex predator space use and intraguild overlap\" />\n<p>Our study shows that drought has a clear signature on the space use of sympatric large carnivores, which can alter spatiotemporal partitioning between competitors. Large carnivore conservation may require protected area expansion or revised human-carnivore coexistence strategies to accommodate the likely increased space demands of large carnivores under projected drought intensification.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDroughts are increasing in frequency and severity globally due to climate change, leading to changes in resource availability that may have cascading effects on animal ecology. Resource availability is a key driver of animal space use, which in turn influences interspecific interactions like intraguild competition. Understanding how climate-induced changes in resource availability influence animal space use, and how species-specific responses scale up to affect intraguild dynamics, is necessary for predicting broader community-level responses to climatic changes.\n\nAlthough several studies have demonstrated the ecological impacts of drought, the behavioural responses of individuals that scale up to these broader-scale effects are not well known, particularly among animals in top trophic levels like large carnivores. Furthermore, we currently lack understanding of how the impacts of climate variability on individual carnivore behaviour are linked to intraguild dynamics, in part because multi-species datasets collected at timescales relevant to climatic changes are rare.\n\nUsing 11 years of GPS data from four sympatric large carnivore species in southern Africa—lions (<i>Panthera leo</i>), leopards (<i>Panthera pardus</i>), African wild dogs (<i>Lycaon pictus</i>) and cheetahs (Acinonyx jubatus)—spanning 4 severe drought events, we test whether drought conditions impact (1) large carnivore space use, (2) broad-scale intraguild spatial overlap and (3) fine-scale intraguild interactions.\n\nDrought conditions expanded space use across species, with carnivores increasing their monthly home range sizes by 35% (wild dogs) to 66% (leopards). Drought conditions increased the amount of spatial overlap between lions and subordinate felids (cheetahs and leopards) by up to 119%, but only lion-cheetah encounter rates were affected by these changes, declining in response to drought.\n\nOur findings reveal that drought has a clear signature on the space use of multiple sympatric large carnivore species, which can alter spatiotemporal partitioning between competing species. Our study thereby illuminates the links between environmental change, animal behaviour and intraguild dynamics. While fine-scale avoidance strategies may facilitate intraguild coexistence during periodic droughts, large carnivore conservation may require considerable expansion of protected areas or revised human-carnivore coexistence strategies to accommodate the likely long-term increased space demands of large carnivores under projected increases in drought intensity.\n</p>","author":"Leigh West, \nKasim Rafiq, \nSarah J. Converse, \nAlan M. Wilson, \nNeil R. Jordan, \nKrystyna A. Golabek, \nJ. Weldon McNutt, \nBriana Abrahms","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"ac296a9339a44cf292a214d76eba79a0e96859fbf987e2ad6fca9ced2c82a5e5","category":"Environment"}