{"title":"Tech gallery: 2021 Enve Builder Roundup, part one","link":"https://cyclingtips.com/2021/07/tech-gallery-2021-enve-builder-roundup-part-one/","date":1625531940000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/2021-Enve-Builder-Roundup-Prova-Cycles-feature-1-650x366.jpg\" /></div><h2>Tech gallery: 2021 Enve Builder Roundup, part one</h2><p>\n</p><p>Need a break from the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a>? Enve recently held its third Builder Roundup, a sort of mini handmade show that’s starting to become not-so-mini.</p>\n\n\n\n<p>Enve is one of the most prolific suppliers to the handmade community, and while the event is ostensibly designed to be a showcase of the company’s wares, it’s evolved into a reputable event in its own right, with builders from around the world descending upon Ogden, Utah, with their best and brightest.</p>\n\n\n\n<p>There are far too many bikes to display in one go, so we’ve split the gallery into three parts. Enjoy part one today, and stay tuned for parts two and three in the days to come.</p>\n\n\n\n<h2>Prova Cycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Australian builder Prova set hearts racing with this incredible titanium and carbon fiber machine.</figcaption></figure></li><li><figure><img /><figcaption>The paint is so deep and lustrous that it almost seems like you could reach your hand right into it.</figcaption></figure></li><li><figure><img /><figcaption>The one-piece Enve front end is beautifully integrated into the rest of the frame.</figcaption></figure></li><li><figure><img /><figcaption>Prova uses 3D printing to achieve such complex shapes in titanium.</figcaption></figure></li><li><figure><img /><figcaption>Cut. It. Out.</figcaption></figure></li><li><figure><img /><figcaption>The Enve Builder Showcase wasn’t meant to be a competition, but if there was a prize to be awarded, this Prova likely would have taken it home.</figcaption></figure></li><li><figure><img /><figcaption>It’s a shame that not more bikes aren’t built with painted-to-match cockpits.</figcaption></figure></li><li><figure><img /><figcaption>The titanium upper headset cover was 3D-printed since the necessary shape didn’t already exist. Prova also 3D-printed the upper part of the head tube.</figcaption></figure></li><li><figure><img /><figcaption>Everywhere you look, there are more incredible details.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Naked Bicycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>This titanium machine from Naked is a bit of a mash-up, combining the ethos of the old Repack cruisers from the early days of mountain bikes, together with modern mountain bike geometry and bikepacking utility.</figcaption></figure></li><li><figure><img /><figcaption>Raise your hands if you think this looks like a good time!</figcaption></figure></li><li><figure><img /><figcaption>You get one guess where Naked builder Sam Whittingham lives and works.</figcaption></figure></li><li><figure><img /><figcaption>This seems like an awfully complicated mitering problem.</figcaption></figure></li><li><figure><img /><figcaption>The custom frame bag attaches with dedicated hard points so there are no straps required.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Allied Cycleworks</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Allied’s new Echo looks resplendent in this color.</figcaption></figure></li><li><figure><img /><figcaption>The key feature on the new Allied Echo is the adjustable geometry. Note the ovoid aluminum inserts at the end of the fork.</figcaption></figure></li><li><figure><img /><figcaption>Look, ma, no cables!</figcaption></figure></li><li><figure><img /><figcaption>This seat cluster shaping has become a trademark design feature on Allied frames.</figcaption></figure></li><li><figure><img /><figcaption>Allied’s internal routing design doesn’t require a special headset.</figcaption></figure></li><li><figure><img /><figcaption>Allied frames perhaps aren’t true one-offs, but they are built to order in Bentonville, Arkansas.</figcaption></figure></li><li><figure><img /><figcaption>The concealed cabling might be a royal pain to set up, but the advent of electronic shifting and hydraulic brakes means that you’ll almost never have to re-run the lines.</figcaption></figure></li><li><figure><img /><figcaption>Enve forks are popular amongst the custom crowd, but Allied makes its own.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>English Cycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Portland-based builder Rob English never fails to impress, and this steel aero road bike is chock full of clever touches.</figcaption></figure></li><li><figure><img /><figcaption>This is a handy place for an additional water bottle.</figcaption></figure></li><li><figure><img /><figcaption>By feeding the lines into the frame behind the headset, English avoids the pitfalls that often come with running hoses and wires through the upper headset bearing.</figcaption></figure></li><li><figure><img /><figcaption>This is certainly an interesting way to manage the rear brake hose!</figcaption></figure></li><li><figure><img /><figcaption>This image is obviously intended to showcase the tanwall Enve tire, but what I’m more interested to learn about is that lower headset cup.</figcaption></figure></li><li><figure><img /><figcaption>How aero is this thing compared to modern carbon stuff? That’s impossible to say just from a few images, but it sure looks good regardless.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Enve</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Enve may have served as the host for the Builder Showcase, but this year, it also had a frame of its own after the debut of its Custom Road model earlier this year.</figcaption></figure></li><li><figure><img /><figcaption>Show bikes are usually built with nothing but flagship components. Shimano Ultegra Di2 is unquestionably fantastic stuff, but that it’s here instead of Dura-Ace speaks to the shortages that are impacting the industry.</figcaption></figure></li><li><figure><img /><figcaption>The carbon seatmast topper uses the same clamp hardware as Enve’s standard seatpost.</figcaption></figure></li><li><figure><img /><figcaption>Blast off!</figcaption></figure></li><li><figure><img /><figcaption>The frame itself doesn’t necessarily break any new ground in terms of things like weight, stiffness, or aerodynamics. Instead, it’s the availability of fully custom geometry while still combining excellent performance in all of those categories that makes this bike more interesting.</figcaption></figure></li><li><figure><img /><figcaption>If only these were actual buttons …</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Pursuit Cycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Pursuit Cycles is the carbon offshoot of longtime titanium builder Carl Strong, together with composites specialist Bill Cochran. Each frame is fully molded in Bozeman, Montana.</figcaption></figure></li><li><figure><img /><figcaption>Campagnolo Ekar has proven to be a hit among custom builders.</figcaption></figure></li><li><figure><img /><figcaption>The matching saddle is icing on the cake.</figcaption></figure></li><li><figure><img /><figcaption>Pursuit is quickly earning a reputation for wild paint jobs like this one.</figcaption></figure></li><li><figure><img /><figcaption>These frames are far from inexpensive, and will almost certainly appeal to a very specific type of buyer.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Festka </h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Festka’s new Scout is meant for heavier-duty use than the company’s existing Rover gravel bike, with more generous tire clearance and a “sturdier build”.</figcaption></figure></li><li><figure><img /><figcaption>Brands are resorting to all sorts of interesting solutions for hiding cabling, though I’m not sure some of the more half-hearted approaches are worth the effort.</figcaption></figure></li><li><figure><img /><figcaption>Rotor’s 1×13 hydraulic groupset is a rare sight.</figcaption></figure></li><li><figure><img /><figcaption>It’s only the carbon builders who are supremely confident in their handiwork that are usually willing to leave everything exposed for inspection.</figcaption></figure></li><li><figure><img /><figcaption>The paint finish was created by transferring acrylic paints floating on top of water on to the frame.</figcaption></figure></li><li><figure><img /><figcaption>This is lovely stuff.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Chumba Bikes</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Chumba is a small outfit based in Austin, Texas. This plus titanium hardtail looks absolutely lovely.</figcaption></figure></li><li><figure><img /><figcaption>One gear, no worries.</figcaption></figure></li><li><figure><img /><figcaption>The titanium singlespeed sprocket is made by Boone Titanium.</figcaption></figure></li><li><figure><img /><figcaption>The blasted finish looks practically bulletproof.</figcaption></figure></li><li><figure><img /><figcaption>Shiny.</figcaption></figure></li><li><figure><img /><figcaption>The 3D-printed titanium chainstay yoke will supposedly clear a 29×2.6″ tire.</figcaption></figure></li><li><figure><img /><figcaption>This sort of shaping would either just be impossible using conventional methods, or at least harder to execute well.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Retrotec Cycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Retrotec seemingly used all the colors on this one.</figcaption></figure></li><li><figure><img /><figcaption>Anodized logos … yum.</figcaption></figure></li><li><figure><img /><figcaption>While some builders prefer straight 44 mm-diameter head tubes, Retrotec goes with the externally tapered option.</figcaption></figure></li><li><figure><img /><figcaption>This is what happens when COVID-induced parts shortages make even matched pairs of grips hard to find.</figcaption></figure></li><li><figure><img /><figcaption>Retrotec’s calling card is the curved double top tube treatment.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Scarab Cycles</h2>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Scarab Cycles made the trip to Utah all the way from Colombia, bringing along its Apüna steel all-road bike.</figcaption></figure></li><li><figure><img /><figcaption>The Jungla paint scheme is “an interpretation of the density, diversity, and deepness of the Chocoan jungle.”</figcaption></figure></li><li><figure><img /><figcaption>Very pretty.</figcaption></figure></li><li><figure><img /><figcaption>Cable routing is a mix of internal and external.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/07/tech-gallery-2021-enve-builder-roundup-part-one/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ac2ad5ddb3cc2a4e060a50b00ae5c3da0c699bc1f0491e59309af279df516d93","category":"Cycling"}