{"title":"Designing Age-Inclusive Products: Guidelines And Best Practices","link":"https://smashingmagazine.com/2023/07/designing-age-inclusive-products-guidelines-best-practices/","date":1689681600000,"content":"<p>Why is it so important to take into account older adults? One person in eight on the planet is over 60, and they are more online than ever. Approximately <a href=\"https://www.statista.com/statistics/265759/world-population-by-age-and-region/\">one billion people aged 60+</a> are alive today. Most of them are healthy and active and have discretionary income. Moreover, it is growing faster than any other age group and is projected to be 20% of the world’s population (~2 billion people) by 2050. They are also the <a href=\"https://www.researchgate.net/publication/351664620_Older_Adults_Shopping_Online_A_Fad_or_a_Trend\">fastest-growing category of e-commerce shoppers</a>.</p>\n<p>Older people today are <a href=\"https://www.pewresearch.org/internet/2021/09/01/navigating-technological-challenges/\">adopting technology more than ever before</a>. From the use of the Internet, smartphones, tablets, and wearables to smart TVs and speakers, a growing number of older people are users. Ownership of smartphones, for example, increased from 70% to 77% among the 50+ population in the United States between 2017 and 2021. Moreover, during the Covid-19 pandemic, there was a significant rise in older adults’ motivation to use digital technology. </p>\n<p>However, many older people still lack sufficient Internet connectivity or technological skill to use devices and consume digital services. It is estimated that <a href=\"https://www.aarp.org/content/dam/aarp/research/surveys_statistics/technology/2021/2022-technology-trends-older-americans.doi.10.26419-2Fres.00493.001.pdf\">two in five feel technology is not designed for them</a> (pdf).</p>\n<h3>Opportunity To Integrate Older people Into The Digital World</h3>\n<p>More and more aspects of life are conducted on digital platforms: interpersonal communication, banking, healthcare, personal consumption, and exercising one’s rights are just some of them. Therefore, digital platforms that are challenging to use for older people have a <strong>negative impact on their quality of life</strong>. It prevents them from accessing essential services and integrating equally into society.</p>\n<p>According to the inclusive design approach, one should take into account the needs of as many users as possible without stigmatizing or excluding a specific group by designing niche products.</p>\n<p>If you adopt this principle, you can design a digital platform that serves a wide range of people, not just those aged 65+. Usually, a service that meets the needs of people aged 65+ will serve other audiences as well.</p>\n<h3>Adopting Age-appropriate Navigation And Orientation Practices</h3>\n<p>Advancing age can also bring with it a decrease in the rate of information processing, whether in understanding, thinking, or remembering. Plus, the ability to ignore distractions, focus on one stimulus, and perform several complex actions simultaneously also decreases.</p>\n<p>Additionally, due to their age, some suffer from a decrease in executive functions that enable planning, executing, and delaying reactions. Therefore, there is a higher chance they will perform random actions such as clicking on unintended places, closing pages, or making errors when using apps. Some may have difficulty understanding that icons carry the same meaning across different apps or in dealing with situations that do not correspond with their expectations of the digital world. Despite such difficulties, it is essential to stress that the <strong>ability to learn from feedback</strong> — for example, via affirmations — <strong>does not diminish with age</strong>.</p>\nWhat Should We Do If We Want To Increase Their Engagement?\n<p>Here are a few guidelines to help you design a more inclusive product. Those guidelines can increase the usage of younger users but are highly crucial for older users:</p>\n<h3>Minimize The Number Of Required Actions And Create Shortcuts</h3>\n<p>Some people over 65 find it challenging to cope with information overload and multiple options.</p>\n<p>Proper information architecture and hierarchy will indicate what is important to the user and require less effort. We should ensure that the required actions appear immediately and easily so that the user does not have to search for them. Some important ones to mention are white space, content placement, space, language, number of actions, and others. Below are these and some others listed with explanations: </p>\n<ul>\n<li><strong>White space</strong><br />Reducing the number of elements on a screen, increasing the spacing between them, and retaining whitespace will make the screen feel less crowded and, therefore, clearer and more inviting. The added value is in the feeling of simplicity it creates. This improves the user’s sense of competence and ability to focus. Clear typography following one of the established typographic scales is relevant for websites, apps, and complex data systems.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/1-bank-america-website.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/2-homepage-silicon-valley-bank-website.png\" /></p>\n<ul>\n<li><strong>Dialog box</strong><br />A limited number of options prevents cognitive overload. Therefore, conduct a careful mapping of the digital platform, distilling out the most important actions and contents.</li>\n<li><strong>Central placement</strong><br />The most important themes should be positioned at the center of the screen.</li>\n<li><strong>Large &amp; spacious</strong><br />The most important buttons should be enlarged and positioned prominently to allow immediate recognition.</li>\n<li><strong>Clear language</strong><br />Topics should be clearly labeled, and the labels should be verified in usability testing. Complicated terms should be avoided since they might not be familiar to the target audience.</li>\n<li><strong>Limited number of actions</strong><br />The number of steps (clicks and scrolls) necessary to achieve a goal should be minimized.</li>\n<li><strong>Shortcuts and multiple/redundant paths</strong><br />Make it easy for users to reach their goals by providing multiple options, such as Quick Links, as seen in the example below. </li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/3-google-search-result-quick-links.png\" /></p>\nWhat To Know About Navigation &amp; Orientation?\n<p>Some people aged 65+ can experience <a href=\"https://journals.sagepub.com/doi/pdf/10.1177/070674370805300603\">a decline in memory recall</a>. Some are also unfamiliar with the principles of the digital world. Therefore, to enhance their sense of control, the following principles should be adopted: rely on recognition, not memory; allow going back; design clear navigation keys; be consistent in design and operation; and provide indicators. Below we will discuss several principles to facilitate navigation. </p>\n<ul>\n<li><strong>Recognition, not memory</strong><br />This principle means creating an interface where users do not have to use their memory to recall information. Instead, they will be asked to identify familiar and prominent components, such as quick access to previously visited pages or actions. The illustration below is an example of how Korea’s post office presents the main tasks on the main screen in a way that doesn’t require memory but recognition. Additional support is the use of color to help the users recognize how to navigate the site once they return to it.  </li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/4-koreas-post-office-website.png\" /></p>\n<ul>\n<li><strong>Indicators and feedback</strong>:<ul>\n<li>Emphasize the performed actions: Use breadcrumbs to indicate which links or buttons the user has clicked on and their location.</li>\n<li>Create a conspicuous and permanent back icon that takes the user to a previous page/stage. This is in addition to the browser’s back and homepage icons.</li>\n<li>Clear and prominent navigation buttons: Emphasize navigation buttons and add text to explain their function.</li>\n</ul>\n</li>\n<li><strong>Consistency</strong><br />Create an ongoing, consistent user experience using recurring items. Allow the users to learn the interface, generating a sense of success and building anticipation for the next stage. Pay attention to the location and design of fixed buttons that have the same function.</li>\n<li><strong>Progress</strong><br />Create obvious hints, such as a progress bar, that help users to understand where they are in the process.</li>\n<li><strong>Success &amp; mistakes</strong><br />Highlight progress and successful actions. Additionally, indicate errors clearly and provide ways for easy recovery.</li>\n<li><strong>Contact Us</strong><br />Choose a prominent location for the help options. Provide contact information using various channels, e.g., telephone number and email address.</li>\n</ul>\n<p>Choosing components with an age-inclusive mindset can change our day-to-day decisions and allow us to create an easy-to-operate interface.</p>\n<p>The following guidelines relate to changes in motor functions.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/5-example-hmo-website.png\" /></p>\nCreating An Interface That Is Easy To Operate\n<p>As age increases, it may be accompanied by difficulty in touching a specific spot accurately, regulating a click’s intensity, or performing quick actions, such as double-clicking. Therefore, the following principles should be ensured: space out the keys, avoid the need for a high degree of precision, avoid gestures requiring sensory regulation, and enable users to progress at their own pace.</p>\n<ul>\n<li><strong>Large &amp; spacious</strong><br />Design large and well-spaced elements.</li>\n<li><strong>Individual pace</strong>:<ul>\n<li>When creating pop-up/toast messages, allow users to initiate closing or at least leave the messages visible for longer for slower readers.</li>\n<li>Avoid menus that open on hover. Always use click-tap menus instead.</li>\n</ul>\n</li>\n<li><strong>Indication</strong><br />Provide clear scroll indicators (e.g., side arrows). Reduce the need for precision: Avoid small clicking areas, mouse hovering, and double-clicking.</li>\n<li><strong>Ensure that the interface is responsive on all screens.</strong><br />For touch screens:<ul>\n<li>Click actions should not rely on touch intensity or precision.</li>\n<li>Avoid, as much as possible, long strokes and drag gestures, and reduce scroll options. At the very least, provide clear indication and instruction, and offer alternatives, such as an arrow or button directing to specific places.</li>\n<li>Avoid the need for very precise actions, such as in small clicking areas, and try to keep to the minimum size for comfortable tapping/clicking of at least 44x44 px.</li>\n<li>Avoid actions requiring fine motor regulation such as spread, pinch, and rotate.</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/6-example-login-forms-login-guide.png\" /></p>\n<p>Let’s examine the homepage of three famous e-commerce websites in the eyes of an older user without going into details.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/7-aliexpress-website.png\" /></p>\n<p>Aliexpress website, as seen in the image above, is a good example of an “unfriendly” website — it suffers from visual overload. Too many buttons and tags are emphasized, which makes it hard to focus older user attention. Moreover, given the visual overload, the side menu is easy to ignore, and many users will be required to use the search bar, which needs to be more dominant and rely on their recall of items, not recognition.</p>\n<p>On the Amazon website (see the image below), the size of each category image may be distracting, requiring the user to scroll a lot and challenging his ability to navigate.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/8-amazon-website.png\" /></p>\n<p>In contrast with these previous sites, eBay does better regarding visual overload; the dominance of the search bar and even the menu placement make it easier for older users to navigate.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-age-inclusive-products-guidelines-best-practices/9-ebay-website.png\" /></p>\nWrapping Up\n<p>Every designer would probably state that they want their website and app to be inclusive, easy to navigate, and user-friendly. Yet, as we have seen in our examples above, we need to create awareness to integrate details that would make it easier for older users to navigate the Internet. As we age, all of us will experience longer reaction times, changes in selective attention, attention-splitting, and changes in our motor functions. Therefore, designing for an older audience will achieve the goals of having an inclusive, easy-to-navigate, and user-friendly for our future selves as well. </p>\n<p>To sum up, in order to create an easy operation and orientation of an interface, we should pay attention to the following: </p>\n<ul>\n<li>Large, spaced-out objects;</li>\n<li>Operation does not require fine gestures and precision;</li>\n<li>A minimum number of actions to achieve goals;</li>\n<li>The user should  control the rate of progress;</li>\n<li>Reassuring notifications upon successful actions;</li>\n<li>Consistency of design and operation;</li>\n<li>Minimizing the number of choices the user must make;</li>\n<li>Highlighting the actions performed by the user.</li>\n</ul>\n<p><em>The article is based on one of the chapters of the <a href=\"https://www.thejoint.org.il/en/log-in-guidebook/\">Log In guide</a>. The guide was created within the framework of the National Initiative to Promote Digital Literacy Among Older Adults, which is a partnership between the <a href=\"https://www.gov.il/en/departments/national-digital-agency/govil-landing-page\">Israel National Digital Agency</a> and <a href=\"https://www.thejoint.org.il/en/\">JDC-ESHEL</a>.</em></p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2019/11/online-environments-older-users/\">Creating Online Environments That Work Well For Older Users</a>,” Barry Rueger</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/02/keys-accessibility-mindset/\">Keys To An Accessibility Mindset</a>,” Daniel Yuschick</li>\n<li><a href=\"https://www.smashingmagazine.com/2022/12/useful-accessibility-usability-examples-help-improve-your-designs/\">“Useful Accessibility And Usability Examples To Help Improve Your Designs</a>,” Thomas Bohm</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/09/unconscious-biases-inclusive-design/\">Unconscious Biases That Get In The Way Of Inclusive Design</a>,” Trina Moore Pervall</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"ac2a4c8802348e10da695c2d0decfd6a416cc2bca447d0852c7c2056d2effbc5","category":"Tech"}