{"title":"Google Maps finally has dark mode and home screen widgets","link":"https://www.macworld.com/article/352556/google-maps-finally-has-dark-mode-and-home-screen-widgets.html","date":1628017314000,"content":"<div>\n<section><div></div></section><p>With just weeks to go before iOS 15 arrives, Google is finally getting on board with some of the best features of iOS 13 and iOS 14. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.google/products/maps/widgets-dark-mode-3-updates-google-maps-ios/&amp;xcust=1-1-352556-1-0-0&amp;sref=https://www.macworld.com/feed\">The company announced Tuesday</a> that it is bringing dark mode and home screen widgets to the Google Maps app.</p>\n\n\n\n<p>Dark mode is basically what you expect it to be: dressing the entire app in an optional black wrapper. You can choose whether to turn dark mode on in the settings and it will presumably follow the system-wide options as well. </p>\n\n\n\n<p>Also new are a pair of widgets that can be added to the home screen. The Nearby Traffic widget is a small 2-by-2 widget that shows an updated view of the traffic conditions around your current location. The second is a large 4-by-4 Search widget that lets you “search for your favorite places or navigate to your frequent destinations with just a quick tap.”</p>\n\n\n\n<p>Along with the new color and widgets, Google is also expanding its integration with Messages. iPhone users will be able to tap on the Google Maps Messages app and share their location for up to three days with friends. There will also be a stop button in the message to instantly disable it.</p>\n\n\n\n<p>Google says the update will be available “in the coming weeks,” but the Messages app is already available to try out by tapping the App Store icon in Messages and scrolling until you see the Google Maps logo.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ac2e4d66fa4ce6e358182b6f0cd5873d9ad8b95a0d780ff64c29f084955d1e5b","category":"Apple"}