{"title":"เนื่องในวันสตรีสากล กูเกิลมอบเงินทุน 25 ล้านเหรียญเพื่อสนับสนุนผู้หญิงจากภาวะยากลำบาก","link":"https://www.blognone.com/node/121584","date":1615211670000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>เนื่องในวันสตรีสากล กูเกิลเปิดตัวโครงการ Google.org Impact Challenge for Women and Girls มอบเงินทุนรวมมูลค่า 25 ล้านดอลลาร์สหรัฐให้องค์กรไม่แสวงหาผลกำไรและองค์กรทางสังคมในประเทศไทยและทั่วโลกที่กำลังดำเนินการเพื่อพัฒนาขีดความสามารถทางเศรษฐกิจของสตรีและเด็กผู้หญิง</p>\n<p>เปิดให้คนที่มีมีโครงการที่มุ่งสนับสนุนสตรีและเด็กผู้หญิงในประเทศไทย หรือองค์กรใดก็ตามที่มีแนวคิดดังกล่าว สามารถเข้าไปที่ g.co/womenandgirlschallenge เพื่อสมัครและดูข้อมูลช่องทางรับเงินทุน สามารถส่งแนวคิดของตนเองเข้ามาได้จนถึงวันเสาร์ที่ 10 เมษายน เวลา 06.59 น. ตามเวลาในประเทศไทย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/597fd238f50d3df6c8aa13279f19e595.png\" ></p>\n<p>กูเกิลอ้างอิงข้อมูลจาก Women Will องค์กรสนับสนุนผู้หญิง เพื่อท้าวความที่มาถึงการเปิดตัวโครงการระบุว่า ก่อนสถานการณ์โควิด-19 การมีส่วนร่วมของผู้หญิงในตลาดแรงงานต่ำกว่าผู้ชายอยู่แล้วถึง 26% เมื่อเดือนกันยายน ปี 2563 ได้มีการคาดการณ์ไว้ว่าภาวะโรคระบาดอาจกระทบต่อการจ้างแรงงานผู้หญิงมากกว่าผู้ชายถึง 19% และคาดว่าจะมีจำนวนผู้หญิงที่ต้องตกอยู่ในภาวะยากจนมากกว่าผู้ชายถึง 11 ล้านคนในปี 2573</p>\n<p>นอกจากนี้ ผู้หญิงยังต้องแบกรับภาระงานบ้านในปริมาณที่มากเกินเหตุโดยไม่ได้รับค่าตอบแทน และคาดว่าจะมีเด็กผู้หญิงประมาณ 20 ล้านคนทั่วโลกที่อาจจะไม่ได้กลับไปเรียนอีก การเลิกจ้าง การสูญเสียรายได้ และการขาดโอกาสในการเข้าถึงการศึกษาล้วนเป็นอุปสรรคต่อความก้าวหน้าทางเศรษฐกิจของสตรีและเด็กผู้หญิงหลายต่อหลายรุ่น โดยเฉพาะผู้ที่มาจากชุมชนด้อยโอกาส</p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/google\">Google</a></div><div class=\"field-item odd\"><a href=\"/topics/women\">Women</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ac41d331e49482c0cfdc7ee4e68a96c9c6189c6731806eefdf9925473a136aa8","category":"Thai"}