{"title":"Texas law requiring age verification on porn sites ruled unconstitutional [Updated]","link":"https://arstechnica.com/?p=1964840","date":1693510677000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/texas-peach-800x450.jpg\" alt=\"Texas law requiring age verification on porn sites ruled unconstitutional [Updated]\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/texas-peach.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The day before a Texas antiporn law that requires age verification to access adult websites was set to take effect, the state's attorney general, Angela Colmenero, has been at least temporarily blocked from enforcing the law.</p>\n<p>US District Judge David Alan Ezra granted a <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Free-Speech-Coalition-v-Angela-Colmenero-8-31-2023-order-granting-preliminary-injunction.pdf\">preliminary injunction</a> temporarily blocking enforcement after the Free Speech Coalition (FSC) joined adult performers and sites like Pornhub in a lawsuit opposing the law. Today, they convinced Ezra that Texas' law violates the First Amendment and would have \"a chilling effect on legally-protected speech,\" FSC said in a press release.</p>\n<p>“This is a huge and important victory against the rising tide of censorship online,” Alison Boden, FSC's executive director, said. “From the beginning, we have argued that the Texas law, and those like it, are both dangerous and unconstitutional. We’re pleased that the court agreed with our view that [the law's] true purpose is not to protect young people, but to prevent Texans from enjoying First Amendment protected expression. The state’s defense of the law was not based in science or technology, but ideology and politics.”</p></div><p><a href=\"https://arstechnica.com/?p=1964840#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964840&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ac4326a8f6dee30526a05d67e05dfbdc5d052f47f129dfe8afa8f50391bf64b9","category":"Tech"}