{"title":"Vuelta a España 2023 stage five preview - sprint or a break?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-five-preview","date":1693325409000,"content":"\n      <p><b>Distance: </b>186.5km<b><br /></b><b>Start location: </b>Morella<b><br /></b><b>Finish location: </b>Burriana<b><br /></b><b>Start time:</b> 13:11 CEST<b><br /></b><b>Finish time (approx): </b>17:30 CEST</p>\n<p>Every six years, a festival known as Sexenni takes place in the town of Morella, commemorating the victims of a plague that ravaged the town during the 17th century. It’s said that the plague only subsided after citizens brought into town a statue of the Virgin Mary from the nearby sanctuary of Vallivana, and ever since, the locals have practised a tradition of organising processions through town carrying the statue, accompanied by traditional dance, music and costumes.</p>\n<div></div>\n<p>The next Sexenni isn’t due until 2024, but the riders stopping off at Morella for the start of stage five of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> may want their own method of keeping at bay the plague our age. Although the Covid pandemic has become more controlled, its spectre still hangs over the peloton as an ever-present threat, as defending Vuelta champion Remco Evenepoel knows too well – back in May, his first major goal of the season came to an abrupt halt after he tested positive for the virus while leading the race. The possibility of catching Covid has become yet another thing for the overall contenders to worry and fret about during the tense early stages of a Grand Tour, along with crashes, other illnesses, and a mechanical at the worst possible moment. Any one of these misfortunes could strike at any moment, and waste months of preparation in an instant. </p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_five.png?v=1691573595\" /></p>\n<p><i>Stage five profile sourced via the Vuelta website</i></p>\n<p>Aside from Covid and these other hazards, there’s little for the overall contenders to worry about today. The race heads out of Catalonia for the first time and into the region of Valencia for a finish in Burriana, the coastal city where American writer James A. Michener first set foot in Spain while collecting the local oranges as part of a merchant vessel crew, the beginning of a journey that inspired him to write the travel book <em>Iberia</em> recounting his experiences.</p>\n<p>The region may be different, but the parcours is similar, and like stage four, the big question is whether this will be a sprint, or if there’s enough scope for the breakaway to survive. The terrain is perhaps more conducive for those getting up the road, with some early uncategorised rises making it easier for strong climbers to form the day’s break. But most important of all will be the stage’s only official climb, the category two Collado de la Ibola, which is arguably the hardest climb the riders have faced so far outside of stage three's venture into the Pyrenees. Its official average gradient of 3.9% is a little misleading, as it's skewed by a downhill section; the second half of its 11.4km are much steeper, and enough to potentially see attackers get a significant gap. Still, there’s a whole 50km still to ride after it's completed, and most sprinters' teams will still be at full strength this early into the race, so should back themselves to bring everything back together for a sprint. </p>\n<h3>Contenders</h3>\n<p><span>Following a chaotic bunch sprint that saw <strong>Kaden Groves</strong> (Alpecin-Deceuninck) claim victory on stage four, a similar scenario is anticipated to unfold on stage five of the race. The limited number of fast finishers participating in this year's Vuelta is a consequence of the challenging mountain stages that dominate this Grand Tour. Despite the presence of slightly more elevation in this stage, it is unlikely to deter the sprinters' teams from allowing a definitive breakaway to establish.</span></p>\n<p><span>If the stage is decided again in a sprint finish, Groves is expected to be a key contender once again. He was well positioned in the run-in to the line, and secured a comfortable win, despite a moment of uncertainty in the final metres. Can the Australian rider achieve a back-to-back triumph?</span></p>\n<p><span><strong>Juan Sebastián Molano</strong> (UAE Team Emirates) had aspirations of clinching the stage victory on the fourth stage, and while it appeared he might succeed, Molano's timing was slightly premature, leading to his defeat by Groves. Eager for redemption, Molano will be determined to execute his sprint strategy flawlessly in this second opportunity. </span></p>\n<p><span><strong>Edward Theuns</strong> of Lidl-Trek demonstrated his prowess in bunch sprints by securing third place in stage four, showcasing his strength as a contender for a stage victory. Similarly, <strong>Milan Menten</strong> (Lotto-Dstny) positioned himself well in the final metres, narrowly missing out on the podium with a fourth-place finish. <strong>Alberto Dainese</strong> (Team DSM-Firmenich) was caught up in the crash towards the end of stage four, impacting his chances for the stage. Consequently, he will be another rider motivated to make the most of this second chance and hope for a better outcome. </span></p>\n<p><span>French rider <strong>Bryan Coquard</strong> (Cofidis) could potentially contend for the stage victory. However, Coquard indicated prior to stage four that he was suffering with an injury sustained during the opening team time trial. He was also caught up in a serious crash in stage four which eliminated him from the final sprint. Whether Coquard will have fully recovered and be at his best to compete for the win remains uncertain.</span></p>\n<h3>Prediction</h3>\n<p>We think <strong>Juan Sebastián Molano </strong>﻿will be disappointed from his missed opportunity and will clinch the stage win in this second sprint. </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ac441924ccd61a57c176c4514388b349415f1a7e21c11cce56a7fd7ffc3979b6","category":"Cycling"}