{"title":"The synergistic evolution of supply-demand composite system for airport green development: A case study in Guangzhou Baiyun International Airport, China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302303","date":1714485600000,"content":"<p>by Lili Wan, Yangyang Lv, Zhan Wang, Yong Tian</p>\r\n\r\nGiven the pressing requirements for sustainable development in civil aviation, conducting a synergistic evolution analysis of the supply and demand aspects in the airport green development holds great significance. This analysis helps achieve sustainable airport development and facilitates the green transformation of civil aviation development. Taking a collaborative learning approach and utilizing historical data from Guangzhou Baiyun International Airport spanning 2008 to 2019, the supply-demand composite system for airport green development was deconstructed into two subsystems—demand and supply—and relevant evaluation index systems were established in this paper. A screening and optimization model of supply and demand synergy indicators for airport green development was constructed, and it was solved using a simulated annealing genetic algorithm. The Haken model was constructed to analyze the synergistic evolutionary relationship of the composite system of supply and demand for green airport development in two stages. The results indicate a shift in the order parameter of the co-evolution of the supply-demand composite system at Guangzhou Baiyun International Airport, moving from the demand subsystem in the first stage (2008–2015) to the supply subsystem in the second stage (2016–2019). The co-evolution of the airport supply-demand composite system has entered a new stage, but has not reached a high level of synergy. The study not only contributes theoretically by explaining the interaction mechanism between supply and demand for airport green development, but also offers targeted suggestions for achieving high-quality synergistic evolution of supply and demand for airport green development.","author":"Lili Wan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ac47152e6122066fcdbb6c796e84476b4cff001ee359effa078a5ca059829242","category":"Interdisciplinary"}