{"title":"Assessment of Socio-Economic and Environmental Impacts of Timber Harvesting in Sierra Leone; Empirical Evidence from a Time Series Data","link":"https://www.preprints.org/manuscript/202410.1605/v1","date":1729510691000,"content":"This study assesses the social, economic, and environmental effects of harvesting timber from the Kambui Hills forest reserve in Sierra Leone, a part of the Gola rain forest, a biodiversity hotspot along the upper Guinea forest zone that stretches through the Manor River Union basin of the Republics of Guinea, Sierra Leone and Liberia. The study area covers an area of 40 kilometers in length and five kilometers in breadth (20,348 hectares of land), with a population of 45,562 residents [1]. A ten-year time series data from 2010 to 2021 is used for this research. The data is processed using EViews 10 statistical software package in a regression analysis. The data set is collected from Food and Agriculture Organization Statistics of the United Nations (FAOSTAT); International Timber Trade Organization (ITTO); and Statistical Office of the European Union (EUROSTAT). A set of specified variables such as primary literacy Level, carbon emissions, inflation, unemployment, Gross Domestic Product (GDP), Exports, and natural resource rent are used to determine the socio-economic and environmental impacts of harvesting timber within the study area. The environmental impacts results from the regression analysis confirmed that R² or the coefficient of determination is 0.5734, which shows that 57 % of the dependent variable is significantly explained by the independent variables in the model. Similarly, the economic impact shows an R² of 0.8596, which indicates that 86 % of the dependent variable is explained by the independent variables in the model. In the same vein, the social impacts showed an R-square of 0.9667. This is statistically significant as 97 % of the dependent variable is explained by the independent variables in the model. Thus, the regression models confirmed the socio-economic effects of harvesting timber and its environmental impact on the residents of the forest area investigated. This study will conclude with recommendations to the relevant stakeholders in Sierra Leone.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ac4eef14ab084692b51d373f73a74cabd674c0797619449b6f667d6aec913962","category":"Interdisciplinary"}