{"title":"Preview: What you need to know about stage 5 of the 2021 Tour de France","link":"https://cyclingtips.com/2021/06/preview-what-you-need-to-know-about-stage-5-of-the-2021-tour-de-france/","date":1625004899000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/TDF21_PROFILS-ETAPES-SANS-RAVITO_ETP05-650x301.jpeg\" /></div><h2>Preview: What you need to know about stage 5 of the 2021 Tour de France</h2><p>\n</p><p><strong>Date: </strong>Wednesday June 30<br /><strong>Start:</strong> Changé<br /><strong>Finish:</strong> Laval<br /><strong>Distance:</strong> 27.2 km (ITT)</p>\n\n\n\n<p>The first of two individual time trials. This is the longest first-week ITT the Tour has had since 2008 (a Tour which, incidentally, also started in Brest).</p>\n\n\n\n<p>The course features a few small lumps but nothing that should stop the powerhouse TTers having their day. It’s not a hugely technical course but there are a bunch of corners in the last few kilometres, including a U-turn with just over 2 km to go, and three sharpish corners in the final 500 metres.</p>\n\n\n\n<p><strong>What to watch for:</strong> Yellow should change hands here. It’ll be a real chance to see who’s looking strong among the GC contenders, and a real test for some of those big names that hit the deck in the crashes that derailed so many in the peloton over the first few stages.</p>\n\n\n\n<p><strong>Who’s it for:</strong> TT specialists.</p>\n\n\n\n<p><strong>Dane Cash’s picks: </strong><em>It’s not usually this hard to name favorites for a time trial, but there is no overly dominant TT specialist among the many strong candidates here. Wout van Aert looks like the best bet to win the time trial of anyone in this race. Stefan Küng and Kasper Asgreen are other contenders to watch. Primož Roglič, Geraint Thomas, and Tadej Pogačar are all in with a shot as well, although there will be question marks about how well Roglič and Thomas will perform considering their recent run-ins with the ground.</em> </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<figure><img /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/06/preview-what-you-need-to-know-about-stage-5-of-the-2021-tour-de-france/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ac519ab15070174025b89d1c845d44b9371fd05389cb15bb45a801bc11f570c3","category":"Cycling"}