{"title":"Cyanotoxin Occurrence and Diversity in 98 Cyanobacterial Blooms From Swedish Lakes and the Baltic Sea","link":"https://www.preprints.org/manuscript/202404.0297/v1","date":1712201862000,"content":"The Drinking Water Directive (EU) 2020/2184 includes the parameter microcystin-LR, a cyanotoxin, which drinking water producers need to analyze if the water source has potential for cyanobacterial blooms. In light of the increasing occurrences of cyanobacterial blooms worldwide and given that more than 50 percent of the drinking water in Sweden is produced from surface water, both fresh and brackish, the need for improved knowledge about cyanotoxin occurrence and cyanobacterial diversity has increased. In this study a total of 98 cyanobacterial blooms were sampled in 2016-2017 and identified regarding their toxin production and taxonomical compositions. The surface water samples from freshwater lakes throughout Sweden including brackish water from 8 east coast locations along the Baltic Sea were analyzed for their toxin content with LC-MS/MS and taxonomic composition with 16S rRNA amplicon sequencing. Both the extracellular and the total toxin content was analyzed. Microcystin´s prevalence was highest with presence in 82% of blooms, of which as free toxins in 39% of blooms. Saxitoxins were found in 36% of blooms in which the congener decarbamoylsaxitoxin (dcSTX) was detected for the first time in Swedish surface waters at four sampling sites. Anatoxins were most rarely detected, followed by cylindrospermopsin, which were found in 6% and 10% of samples, respectively. As expected, nodularin was detected in samples collected from the Baltic Sea only. The cyanobacterial operational taxonomic unit (OTU) with the highest abundance and prevalence could be annotated to Aphanizomenon NIES-81 and the second most profuse cyanobacterial taxon to Microcystis PCC-7914. In addition, two correlations were found, one between Aphanizomenon NIES-81 and saxitoxins and another between Microcystis PCC-7914 and microcystins. This study is of value to drinking water management and scientists involved in recognizing and controlling toxic cyanobacteria blooms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ac51374047017a08acf7b4b1b86b0c824ca2e3d5e6533415585f2e61dcf98825","category":"Interdisciplinary"}