{"title":"Diagnostic ability of Peptidase S8 gene in the Arthrodermataceae causing dermatophytoses: A metadata analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306829","date":1720533600000,"content":"<p>by Apoorva R. Kenjar, Juliet Roshini Mohan Raj, Banavasi Shanmukha Girisha, Indrani Karunasagar</p>\r\n\r\nAn unambiguous identification of dermatophytes causing dermatophytoses is necessary for accurate clinical diagnosis and epidemiological implications. In the current taxonomy of the Arthrodermataceae, the etiological agents of dermatophytoses consist of seven genera and members of the genera <i>Trichophyton</i> are the most prevalent etiological agents at present. The genera <i>Trichophyton</i> consists of 16 species that are grouped as clades, but the species borderlines are not clearly delimited. The aim of the present study was to determine the discriminative power of subtilisin gene variants (SUB1-SUB12) in family Arthrodermataceae, particularly in <i>Trichophyton</i>. Partial and complete reads from 288 subtilisin gene sequences of 12 species were retrieved and a stringent filtering following two different approaches for analysis (probability of correct identification (PCI) and gene gap analysis) conducted to determine the uniqueness of the subtilisin gene subtypes. SUB1 with mean PCI value of 60% was the most suitable subtilisin subtype for specific detection of <i>T</i>.<i>rubrum</i> complex, however this subtype is not reported in members of <i>T</i>. <i>mentagrophytes</i> complex which is one of the most prevalent etiological agent at present. Hence, SUB7 with 40% PCI value was selected for testing its discriminative power in <i>Trichophyton</i> species. SUB7 specific PCR based detection of dermatophytes was tested for sensitivity and specificity. Sequences of SUB7 from 42 isolates and comparison with the ITS region showed that differences within the subtilisin gene can further be used to differentiate members of the <i>T</i>. <i>mentagrophytes</i> complex. Further, subtilisin cannot be used for the differentiation of <i>T</i>. <i>benhamiae</i> complex since all SUB subtypes show low PCI scores. Studies on the efficiency and limitations of the subtilisin gene as a diagnostic tool are currently limited. Our study provides information that will guide researchers in considering this gene for identifying dermatophytes causing dermatophytoses in human and animals.","author":"Apoorva R. Kenjar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ac51df769710b02a9a12755971d81262b1a6d6b0b3dbcdffb04dff874cff75ab","category":"Interdisciplinary"}