{"title":"Association between illness perception and social alienation among maintenance hemodialysis patients: The mediating role of fear of progression","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301666","date":1712066400000,"content":"<p>by Beisha Zhu, Hang Wu, Siyu Lv, Yulan Xu</p>\r\nPurpose <p>This study aimed to investigate the mediating role of fear of progression on illness perception and social alienation among maintenance hemodialysis (MHD) patients.</p> Background <p>MHD is frequently accompanied by increased pain and complications such as itchy skin, chronic fatigue, and muscle spasms. Cardiovascular disease rates are also elevated among MHD patients, which can heighten their anxiety regarding prognosis and treatment discomfort. This chronic fear may severely impact social functioning, leading patients to withdraw from interpersonal interactions and experience heightened helplessness and loneliness. Further investigation is necessary to understand the factors behind the high level of social alienation in MHD patients and their underlying mechanisms.</p> Design <p>A cross-sectional study guided by the STROBE.</p> Methods <p>A convenience sample of 230 MHD patients were enrolled from January to May 2023. Data including demographic and clinical characteristics, illness perception, fear of progression, and social alienation were collected. Descriptive analysis and Pearson correlations were conducted using IBM SPSS version 25.0. The mediating effect was analyzed using Model 4 of the PROCESS macro for SPSS, with the Bootstrap method employed to assess its significance.</p> Results <p>The score of social alienation in MHD patients was high, with illness perception and fear of progression both significantly correlated with social alienation. In the mediating effects model, illness perception can predict social alienation in MHD patients, and fear of progression use plays a part in mediating the process by which illness perception affects social alienation. The Kappa Squared (κ<sup>2</sup>) value of 21.9%, suggests a medium effect size.</p> Conclusions <p>Illness perception directly predicts social alienation in MHD patients and exerts an indirect effect through the mediating role of fear of progression. Suggests that healthcare professionals should concentrate on MHD patients with high negative illness perceptions to alleviate their fear of progression, thereby decreasing the level of social alienation and enhancing their integration into society.</p>","author":"Beisha Zhu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ac58947d371e89dbdfb8b168a44a27172ecc255148a69281052bf5ae437e7120","category":"Interdisciplinary"}