{"title":"Effects of acidification by traditional jiaozi starter and neutralization with alkali (Na2CO3) on whole wheat dough properties","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13441?af=R","date":1709721071000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Whole wheat steamed bread has been recommended for its potential nutritional benefits to human health. Given the positive role of both organic acid and alkali in improving dough development and product quality, the effects of neutralization by addition of alkali (Na<sub>2</sub>CO<sub>3</sub>) after dough acidification with traditional Jiaozi starter on the properties of whole wheat dough were investigated in this study.</p>\n<h2>Results</h2>\n<p>The population of yeast and lactic acid bacteria (LAB) and the acidification level of the dough increased significantly after fermentation with Jiaozi. Incorporation of alkali greatly improved the leavening capacity of the remixed dough and the quality of steamed bread. Jiaozi fermentation and alkali addition changed the water distribution patterns (<i>T</i>\n<sub>2</sub>) and affected the secondary structures of gluten protein, starch crystallinity and pasting properties. The storage modulus (<i>G</i>') of the dough increased significantly with the alkali addition, which could be attributed to the promoted cross-linking of the gluten structure and the altered hydration state of the macromolecules.</p>\n<h2>Conclusion</h2>\n<p>The results indicated that a combination of Jiaozi fermentation and alkali addition could improve the technological properties of whole wheat dough and the quality of steamed bread. This study will help us to further explore the potential application of moderate acidification and alkali addition in the production of leavened whole wheat products.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Zhijian Li, \nYu Cao, \nMengmeng Zhou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ac5f1f7eb378b88c1f19af5af943acc79ed32f74e885747053a00875a1ec48bd","category":"Environment"}