{"title":"Videos: Apple Vision Pro Tested for Work, Gaming, Flying, and Sports","link":"https://www.macrumors.com/2024/02/05/vision-pro-videos-for-work-gaming-flying-more/","date":1707145719000,"content":"Apple Vision Pro <a href=\"https://www.macrumors.com/2024/02/02/apple-vision-pro-launch-day/\">launched in the U.S. on Friday</a>, and there are already several YouTube videos that demonstrate using the headset for remote work, gaming, in-flight entertainment, watching sports, and more. We have rounded up these videos below.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Vision-Pro-Airplane.jpeg\" width=\"1280\" height=\"720\" />\r<br />\nIf you want to experience the Vision Pro for yourself, you can <a href=\"https://www.apple.com/retail/instore-shopping-session/?topic=visionpro\">book an appointment for a free Vision Pro demo</a> at any Apple Store in the U.S. on Apple's website. During the demo, which can take up to 30 minutes, you will learn how to navigate the visionOS operating system, and explore built-in apps such as Apple TV, Photos, and Safari.\r<br />\n\r<br />\n<h2>Working at Home</h2>\r<br />\nHimels Tech demonstrated using the Vision Pro at home for work, entertainment, and more:\r<br />\n\r<br />\n<div></div>\r<br />\nIn the video, he walks around and shows off several visionOS app windows pinned at his desk, in the living room, and in the kitchen.\r<br />\n\r<br />\nVision Pro can be used as an external display for <a href=\"https://www.macrumors.com/2024/02/03/apple-vision-pro-can-display-intel-macs/\">any Mac compatible with macOS Sonoma</a>.\r<br />\n\r<br />\n<h2>Gaming</h2>\r<br />\nWynnsanity tested gaming on the Vision Pro:\r<br />\n\r<br />\n<div></div>\r<br />\nMost controllers that are compatible with the iPhone or iPad also work with the Vision Pro, including wireless PlayStation and Xbox controllers.\r<br />\n\r<br />\n<h2>Traveling on Airplane</h2>\r<br />\nGravel took the Vision Pro on an airplane and used the headset as a virtual seat-back screen:\r<br />\n\r<br />\n<div></div>\r<br />\nVision Pro <a href=\"https://www.macrumors.com/guide/vision-pro-travel/\">features a Travel Mode</a> that adapts to the \"unique motion and environment of commercial air travel\" to give you the \"best experience while traveling on an airplane,\" according to Apple. Travel Mode can be turned on in Control Center.\r<br />\n\r<br />\nApple says the Vision Pro should not be worn during taxiing, takeoff, and landing, and while a flight has turbulence. Apple also says to avoid looking out an airplane's windows, as this could affect the headset's ability to track your surroundings.\r<br />\n\r<br />\n<h2>Watching Sports</h2>\r<br />\nIn his excellent Vision Pro review last week, Brian Tong showed what it is like to use the NBA app:\r<br />\n\r<br />\n<div></div>\r<br />\nWith the NBA app and an NBA League Pass subscription, you can watch up to five basketball games live or on demand at once. You can also view real-time player stats, game scores, and other information at a glance.\r<br />\n\r<br />\n<h2>In Public</h2>\r<br />\nCasey Neistat wore the Vision Pro on the New York City subway and at Times Square:\r<br />\n\r<br />\n<div></div>\r<br />\n<a href=\"https://www.youtube.com/watch?v=1KZ2Ejg3mWA\">Many</a> <a href=\"https://www.youtube.com/watch?v=P161APUiLCk\">other</a> <a href=\"https://www.youtube.com/watch?v=JJ4R0yJ9-vg\">YouTubers</a> also used the Vision Pro in public.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/05/vision-pro-videos-for-work-gaming-flying-more/\">Videos: Apple Vision Pro Tested for Work, Gaming, Flying, and Sports</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/videos-apple-vision-pro-tested-for-work-gaming-flying-and-sports.2418518/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ac6ab2cf71c31755d8b694203d353bd6597c902d9fb52d71cfdec9ce914fa1cb","category":"Apple"}