{"title":"The Need of Chloride-37 Enrichment for Molten Salt Fast Reactors","link":"https://www.preprints.org/manuscript/202408.0677/v1","date":1723422905000,"content":"The use of natural chloride in the salt fuel has been sometimes promoted for the chlorine based molten salt fast reactor using for example NaCl-UCl4- UCl3. Most of the chemistry based R&amp;D has been carried out on natural chloride, while in reactor physics most of the calculations are based on enriched chloride-37. In any case, the use of natural chloride (75.77% 35Cl and 24.23% 37Cl) induces specific ecological and neutron economical issues. An ecological issue is the production of 36Cl by neutron activation of 35Cl. Chlorine-36 is a soluble long live nuclide that makes it a ‘first’ nuclide in the safety assessment of the repository. We explore the build-up of 36Cl with burnup for various 37Cl (activation product) enrichment. The neutron economical aspect is gained by achieving reactor criticality with a lower amount of fissile material achieved through the use of enriched chloride-37. The criticality (k) of a core is much larger for enriched chloride than for the natural one. The reactor with 99% 37Cl would have a k99/knat of 1.04346 which would allow to reduce the required uranium enrichment and thus the fuel cost. This reactivity gain is evaluated for various 37Cl enrichment factors to estimate uranium enrichment gain achievable through 37Cl enrichment. However, from economical point of view it could be of interest to use as some kind of compromise solution natural NaCl, which will be analysed, too. Production/enrichment of 37Cl can be performed by physical separation e.g. gas centrifugation of 1H35/37Cl or by chemical separation using anion partitioning and elution of 23Na35/37Cl on solid adsorbent columns or in liquid – liquid extraction systems. These techniques require however extensive investigations including chemical thermodynamics and hydrodynamics. Comparisons are suggested on the basis of the separation factor α. Recommendations are finally given for utilising 37Cl in the fast molten salt reactor. The enrichment work for 37Cl is smaller than the work needed for 235U enrichment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ac6e14518920a0444be9c9d4e257ed3bb6377339e9b090891557633c90216fdd","category":"Interdisciplinary"}