{"title":"Organ transformation by environmental disruption of protein integrity and epigenetic memory in <i>Drosophila</i>","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002629","date":1716904800000,"content":"<p>by Orli Snir, Michael Elgart, Yulia Gnainsky, Moshe Goldsmith, Filippo Ciabrelli, Shlomi Dagan, Iris Aviezer, Elizabeth Stoops, Giacomo Cavalli, Yoav Soen</p>\r\n\r\nDespite significant progress in understanding epigenetic reprogramming of cells, the mechanistic basis of “organ reprogramming” by (epi-)gene–environment interactions remained largely obscure. Here, we use the ether-induced haltere-to-wing transformations in <i>Drosophila</i> as a model for epigenetic “reprogramming” at the whole organism level. Our findings support a mechanistic chain of events explaining why and how brief embryonic exposure to ether leads to haltere-to-wing transformations manifested at the larval stage and on. We show that ether interferes with protein integrity in the egg, leading to altered deployment of Hsp90 and widespread repression of Trithorax-mediated establishment of active H3K4me3 chromatin marks throughout the genome. Despite this global reduction, Ubx targets and wing development genes preferentially retain higher levels of H3K4me3 that predisposes these genes for later up-regulation in the larval haltere disc, hence the wing-like outcome. Consistent with compromised protein integrity during the exposure, the penetrance of bithorax transformations increases by genetic or chemical reduction of Hsp90 function. Moreover, joint reduction in <i>Hsp90</i> and <i>trx</i> gene dosage can cause bithorax transformations even without exposure to ether, supporting an underlying epistasis between <i>Hsp90</i> and <i>trx</i> loss-of-functions. These findings implicate environmental disruption of protein integrity at the onset of histone methylation with altered epigenetic regulation of developmental patterning genes. The emerging picture provides a unique example wherein the alleviation of the Hsp90 “capacitor function” by the environment drives a morphogenetic shift towards an ancestral-like body plan. The morphogenetic impact of chaperone response during a major setup of epigenetic patterns may be a general scheme for organ reprogramming by environmental cues.","author":"Orli Snir","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"ac73763771cf5f8b4ec589b3ebd0b866f3f323214f2f7cd23a8189823f0e8f3b","category":"Environment"}