{"title":"Quantitative analysis of hydropower potential in the upper Beas basin using geographical information system and MIKE 11 Nedbor Afrstromnings Model (NAM)","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2618?af=R","date":1721273930000,"content":"<h2>Abstract</h2>\n<p>The present study aims to identify potential locations for small-scale hydroelectric power (HEP) stations in hilly regions for the purpose of generating renewable energy. A rainfall-runoff (R-R) model of the Beas River catchment was established using the MIKE 11 NAM to estimate the available discharge. The model was calibrated and validated over the period of June-2015–May-2018 and June-2018–May-2020, respectively, using daily observed discharge data at the Pandoh Dam site. The model exhibited good performance with a coefficient of determination (<i>R</i>\n<sup>2</sup>) of 0.82 during calibration and 0.70 during validation and a water balance of −0.01% and −18%, respectively. However, L<sub>max</sub>, CK<sub>1</sub>, CK<sub>2</sub> and CQOF are found most sensitive parameters during the calibration. Further, thirteen major streams of order five or higher were selected for the assessment of hydropower potential, resulting in the identification of 131 potential run-of-river (ROR) hydropower sites. The hydropower potential at two proposed sites, Bhang SHEP (9 MW) and Raison SHEP (18 MW), was estimated to be 11 and 15 MW, respectively, using 90% dependable flow. The results demonstrate the effectiveness of using Digital Elevation Model (DEM) and Geographic Information System (GIS) techniques for determining hydropower potential in ungauged basins in the Himalayas.</p>","author":"Mohit Kumar, \nReet Kamal Tiwari, \nKamal Kumar, \nKuldeep Singh Rautela, \nSabia Safi","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"ac74dc272fcb628d9ad4f9aada6b3cdaa8c87c27135302fa6b94ffaba9c21461","category":"Environment"}