{"title":"Apple Considering Shift Away From Sony for Micro-OLED Displays in Future Vision Pro Headsets","link":"https://www.macrumors.com/2023/08/29/shift-away-from-sony-in-future-vision-pro-headsets/","date":1693317280000,"content":"Apple is considering switching production of micro-OLED displays for future versions of the Vision Pro headset from Sony to Chinese manufacturers like BOE and SeeYa amid supply chain challenges, <a href=\"https://www.theinformation.com/articles/apple-hopes-chinese-suppliers-can-solve-vision-pros-display-challenges\"><em>The Information</em></a> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-expanded.jpg\" alt width=\"2949\" height=\"1659\" />\r<br />\nSony, the current supplier of micro-OLED displays for Vision Pro, has apparently shown reservations about expanding its production capabilities for the components amid Apple's effort to ramp up mass production of the headset. Chinese technology firms BOE Technology and SeeYa Technology, on the other hand, are showing significant commitment to the technology, supported by local government initiatives. Apple is currently testing displays from these two suppliers for both a next-generation Vision Pro model and a future low-cost mixed-reality headset device.\r<br />\n\r<br />\nIf BOE and SeeYa can meet Apple's rigorous quality standards, there is the potential for them to outright replace Sony as the principal Vision Pro display supplier in the future. Even so, Apple's increased engagement with Chinese entities presents different potential operational challenges, evidenced by recent legal issues between Samsung and BOE, as well as various labor concerns.\r<br />\n\r<br />\nRegardless, Chinese companies are already deeply integrated in Apple's current production processes for Vision Pro, with firms like Lens Technology and Genius Electronic Optical being key contributors to the headset's production. Likewise, Luxshare Precision Industry has replaced Taiwan's Pegatron as the primary assembler for the device.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/theinformation-com/\">The Information</a>, <a href=\"https://www.macrumors.com/guide/boe/\">BOE</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/29/shift-away-from-sony-in-future-vision-pro-headsets/\">Apple Considering Shift Away From Sony for Micro-OLED Displays in Future Vision Pro Headsets</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-considering-shift-away-from-sony-for-micro-oled-displays-in-future-vision-pro-headsets.2399924/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ac76a2cdf651bffd3fab10bbf40e8a53d18785c1544920709018228e27722f64","category":"Apple"}