{"title":"Pharmacokinetic‐Pharmacodynamic Analysis of Cephalexin against Streptococcus parauberis in Olive Flounder (Paralichthys olivaceus: Temminck and Schlegel)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/5718802?af=R","date":1697526000000,"content":"<p>Olive flounders are susceptible to annual outbreaks of streptococcosis, which accounts for approximately 10% of all fish farm diseases and is associated with high mortality rates. The development of an antibiotic therapy against streptococcosis is thus necessary. This study determined the therapeutic effects of varying cephalexin concentrations in <i>Streptococcus parauberis</i>-infected olive flounders and evaluated its histopathological toxicity and residual concentration in the fish. Compared with the control group, the 200 and 800 mg/kg cephalexin groups showed significant mean survival rates of approximately 10% and 30%, respectively, and the 400 mg/kg group showed the highest survival rate of approximately 40%. The average residual cephalexin concentration in muscle samples on day 1 post-cephalexin administration was 13.21 <i>µ</i>g/kg, showing a rapid decrease. At the optimum water temperature (25°C), cephalexin was rapidly metabolized within 24 hr of its administration being terminated, and most of it was excreted from the bodies of the fish. A histopathological analysis showed that the oral administration of cephalexin did not lead to specific inflammatory lesions, and there were no significant differences between the treatment and control groups. Our novel findings suggest that cephalexin is a promising candidate for treating streptococcosis outbreaks in fish farms.</p>","author":"Hee-Jae Choi, \nJi-Hoon Lee, \nDa-Yeon Choi, \nJi-Eun Lee, \nSaran Hori, \nKyu Seok Cho, \nJun-Hwan Kim, \nSeong Hee Choi, \nYue Jai Kang, \nPravesh Kumar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"ac77fd225232980855165140176571f706410963ccc2719859e1f279fa324eca","category":"Environment"}