{"title":"Apple รายงานภาพรวม App Store 2022 มีการใช้จ่ายผ่านแอปรวมกว่า 1.1 ล้านล้านดอลลาร์","link":"https://www.blognone.com/node/134108","date":1685576049000,"content":"<div><div><div><p>แอปเปิลเปิดเผยตัวเลขภาพรวมของ App Store ในด้านรายได้ของผู้พัฒนาแอป โดยให้บริษัทวิจัยตลาดภายนอก Analysis Group เป็นผู้สำรวจข้อมูล พบว่ามีการใช้จ่ายเงินผ่านแอปรวมทุกแบบมากกว่า 1.1 ล้านล้านดอลลาร์ เฉพาะปี 2022</p>\n<p>โดยตัวเลขนี้แบ่งเป็น 9.1 แสนล้านดอลลาร์ จากการขายสินค้าและบริการที่จับต้องได้ (Physical) ผ่านแพลตฟอร์ม 1.09 แสนล้านดอลลาร์ จากโฆษณาในแอป และ 1.04 แสนล้านดอลลาร์ จากการขายสินค้าและบริการที่เป็นดิจิทัล ทั้งนี้แอปเปิลบอกว่า 9.1 แสนล้านดอลลาร์ ของการขายสินค้าแบบจับต้องได้ ซึ่งคิดเป็น 90% ของเงินใช้จ่ายรวม รายได้ทั้งหมดตรงไปที่ผู้พัฒนาแอป โดยแอปเปิลไม่ได้ส่วนแบ่งค่าธรรมเนียม</p>\n<p>การใช้จ่ายที่เพิ่มขึ้นถึง 29% ส่วนหนึ่งเป็นผลจากการเปิดเมืองหลังการระบาดของโควิด 19 โดยแอปที่เกี่ยวกับการท่องเที่ยวมีการใช้จ่ายมากขึ้น 84% แอปเรียกรถโดยสารเพิ่มขึ้น 45% ขณะเดียวกันนิวนอร์มัลก็สร้างพฤติกรรมใหม่ โดยแอปซื้อของใช้มีการใช้จ่ายมากขึ้น 3.5 เท่า นับตั้งแต่ปี 2019 ก่อนการระบาด แอปสั่งอาหาร เพิ่มขึ้น 2.3 เท่าจากปี 2019</p>\n<p>สุดท้ายแอปเปิลพูดถึงตัวเลขที่ App Store จ่ายให้กับนักพัฒนา โดยจ่ายไปแล้วกว่า 3.2 แสนล้านดอลลาร์ จากยอดขายสินค้าดิจิทัล ในตลอด 15 ปี ที่ให้บริการ App Store ตั้งแต่ปี 2008 จำนวนแอปถูกดาวน์โหลดรวม 3.7 แสนล้านแอป จำนวนแอปเพิ่มขึ้น 123 เท่า จากปีแรกที่ให้บริการ App Store</p>\n<p>ที่มา: <a href=\"https://www.apple.com/newsroom/2023/05/developers-generated-one-point-one-trillion-in-the-app-store-ecosystem-in-2022/\">แอปเปิล</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/314056326398789170ecbec93027ea0f.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/developer\">Developer</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ac8585c340fd7e3bd3cb8bb2afcfe338d8958aaad74eab484a235332e34d60cc","category":"Thai"}