{"title":"Disentangling the variability of symbiotic nitrogen fixation rate and the controlling factors","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17206?af=R","date":1709715637000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bb87d594-474b-40f5-a1a9-eebb193f1db3/gcb17206-toc-0001-m.png\" alt=\"Disentangling the variability of symbiotic nitrogen fixation rate and the controlling factors\" />\n<p>It remains unclear what determines the variability of SNF rate. This study found that SNF rates varied significantly from 3.69 to 12.54 g N m<sup>−2</sup> year<sup>−1</sup> across host plant taxa. The traits of host plant (e.g. biomass characteristics and taxa) far outweighed climatic and edaphic factors in explaining the variability of SNF rate. The suite of parameters for SNF lends support to improve N fixation module in earth system models.</p>\n<br />\n<h2>Abstract</h2>\n<p>Symbiotic nitrogen (N) fixation (SNF), replenishing bioavailable N for terrestrial ecosystems, exerts decisive roles in N cycling and gross primary production. Nevertheless, it remains unclear what determines the variability of SNF rate, which retards the accurate prediction for global N fixation in earth system models. This study synthesized 1230 isotopic observations to elucidate the governing factors underlying the variability of SNF rate. The SNF rates varied significantly from 3.69 to 12.54 g N m<sup>−2</sup> year<sup>−1</sup> across host plant taxa. The traits of host plant (e.g. biomass characteristics and taxa) far outweighed soil properties and climatic factors in explaining the variations of SNF rate, accounting for 79.0% of total relative importance. Furthermore, annual SNF yield contributed to more than half of N uptake for host plants, which was consistent across different ecosystem types. This study highlights that the biotic factors, especially host plant traits (e.g. biomass characteristics and taxa), play overriding roles in determining SNF rate compared with soil properties. The suite of parameters for SNF lends support to improve N fixation module in earth system models that can provide more confidence in predicting bioavailable N changes in terrestrial ecosystems.</p>","author":"Yanzhong Yao, \nBingbing Han, \nXunzhuo Dong, \nYunyao Zhong, \nShuli Niu, \nXinping Chen, \nZhaolei Li","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"ac8b8e0efa209dcace0a7a0feb5170df33cd0eb9c618fbd9d5ffd09cb8af16a5","category":"Environment"}