{"title":"A review of Appalachian Dasycerus Brongniart and the recognition of cryptic diversity within Dasycerus carolinensis (Coleoptera: Staphylinidae: Dasycerinae)","link":"https://academic.oup.com/isd/article/doi/10.1093/isd/ixae009/7648262?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>Previous analyses have revealed deep divergences among populations of the relictual and enigmatic rove beetle, <span>Dasycerus carolinensis</span> Horn. New data from additional populations, molecular markers, and morphology unambiguously reveal this “species” to represent a complex of closely related species, distinguishable by characters of the male genitalia and corresponding closely to geographically coherent clades discovered by molecular analyses. Calibrated dating analyses show Appalachian <span>Dasycerus</span> to have been diverging in the region for more than 10 million years, yet largely respecting important biogeographic barriers in the region, such as the French Broad and Little Tennessee River drainages. In addition to discussing finer scale biogeographic patterns in the group, we formally recognize 9 new species from within what was formerly known as <span>Dasycerus carolinensis</span>: <span>Dasycerus virginiensis</span> sp. nov., <span>Dasycerus tuckasegee</span> sp. nov., <span>Dasycerus pacolet</span> sp. nov., <span>Dasycerus chattooga</span> sp. nov., <span>Dasycerus itseyi</span> sp. nov., <span>Dasycerus unicoi</span> sp. nov., <span>Dasycerus nikwasi</span> sp. nov., <span>Dasycerus egwanulti</span> sp. nov., and <span>Dasycerus gadalutsi</span> sp. nov. It was not, however, possible to assign all samples to one of these species, and specimens from some sparsely sampled outlying areas, northern Alabama and central Tennessee in particular, may represent additional species.</span>","author":"","siteTitle":"Insect Systematics and Diversity Current Issue","siteHash":"d4d59e2090793e303021830a9c164d689828dc5448b6052be7ec32e87f45cab0","entryHash":"ac8baa703ef4d761a51106db9962a6e81a7f1fda98d63a2ce2f93428430aeecf","category":"Environment"}