{"title":"Turtles and tortoises losing the race: Ecology and conservation of Testudines in Indawgyi Lake, Myanmar“输了比赛”的龟:缅甸印多吉湖的龟鳖类生态与保护“ြမန်မာနိုင်ငံ၊ အင်း‌ေတာ်ြကီးကန်သဘာဝ ‌ေဘးမဲ့‌ေတာအတွင်းရှိ သဘာဝ‌ေရချိုလိပ်နှင့် ကုန်းလိပ်များ၏ ‌ေဂဟစနစ်ယိုယွင်းမှုနှင့် ထိန်းသိမ်း‌ေစာင့်‌ေရှာက်ြခင်းသု‌ေတသနစာတမ်း\"","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.44?af=R","date":1712731215000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/643412a4-fe9d-4289-9766-07f67ef740ac/inc344-gra-0001-m.png\" alt=\"Turtles and tortoises losing the race: Ecology and conservation of Testudines in Indawgyi Lake, Myanmar “输了比赛”的龟:缅甸印多吉湖的龟鳖类生态与保护 “ြမန်မာနိုင်ငံ၊ အင်း‌ေတာ်ြကီးကန်သဘာဝ ‌ေဘးမဲ့‌ေတာအတွင်းရှိ သဘာဝ‌ေရချိုလိပ်နှင့် ကုန်းလိပ်များ၏ ‌ေဂဟစနစ်ယိုယွင်းမှုနှင့် ထိန်းသိမ်း‌ေစာင့်‌ေရှာက်ြခင်းသု‌ေတသနစာတမ်း&quot;\" /><p>Despite global recognition for its ecological importance, our assessment in the Indawgyi Lake Wildlife Sanctuary revealed that turtles and tortoises are nesting in suboptimal conditions to avoid humans' disturbance. Local communities identified hunting, fishing, and deforestation as the main threats, along with a lack of effective conservation efforts from authorities and NGOs. The discovery of a previously undescribed species of Amyda highlights the urgent need for increased enforcement and conservation efforts to support the recovery of turtle and tortoise populations and to protect the lake's exquisite wildlife.\n</p><br />\n<h2>Abstract</h2>\n<p>Testudines (turtles and tortoises) rank among the most threatened vertebrates globally, with species in Asia particularly vulnerable due to exploitation, unregulated trade, habitat loss, and degradation. This study aimed to understand the ecology and conservation status of turtles and tortoises in the Indawgyi Lake basin. We conducted surveys along 47 transects, each 1–2 km in length, across four sampling periods (total distance covered = 74.9 km). Additionally, we also deployed four traps at three different locations to capture turtles during two of these sampling periods. In addition, we analyzed 14 soil samples collected from five locations to determine the nesting conditions of soft-shell turtles. Finally, we identified conservation concerns through semi-structured interviews with 146 local households, including fishermen and hunters, to gather local ecological knowledge (LEK) on the abundance, habitats, and breeding ecology of turtles and tortoises, as well as local conservation perspectives. Seven turtle and tortoise species were identified within the Indawgyi Lake basin. To our knowledge, two of these species, the Myanmar brown leaf turtle (<i>Cyclemys fusca</i>) and Oldham's leaf turtle (<i>Cyclemys oldhamii</i>), have yet to be officially documented in this area. Furthermore, an <i>Amyda</i> sp. (collected on 10 March 2019), known by the vernacular name “Late Par Tate,” is hitherto undescribed and is likely a newly discovered species. Our results showed disturbance (SW = 1.0) and higher organic matter (SW = 0.52) as the main estimators explaining the difference in nest observation frequency. Animal grazing areas had more nests than other sites affected by greater human disturbances. The local community identified hunting (44%), fishing (28%), and deforestation (13%) as the main activities threatening turtle and tortoise populations. The majority of turtles hunted were either consumed (over 43%) or sold to middlemen, who at times sold them on to foreign traders (less than 51%). Alarmingly, 99% of those interviewed expressed a notable deficiency in protection and conservation efforts by the Nature and Wildlife Conservation Division and NGOs. We advocate for enhanced conservation efforts, mainly through stronger enforcement, increased awareness, and the establishment of protection zones with restricted human access to facilitate the recovery of these populations, especially at nesting sites.</p>\n<h2>摘要</h2>\n<p>龟鳖类是全球受威胁最严重的脊椎动物之一，亚洲的龟鳖类物种尤其容易受到开发、非法贸易、栖息地丧失和退化的影响。本研究旨在了解因道支湖流域龟鳖类的生态和保护现状。我们在四个采样期沿着47个样带进行了调查，每个样带长1-2千米（总覆盖距离=74.9千米）。此外，我们还在其中两个取样时段的三个不同地点布设了四个诱捕器，以捕捉水龟。此外，我们还分析了从五个地点采集的14份土壤样本，以确定水龟的筑巢条件。最后，我们通过对146户当地家庭（包括渔民和猎人）进行半结构式访谈，收集了有关龟鳖类的数量、栖息地和繁殖生态的当地生态知识（LEK），以及当地的保护观点，从而确定了保护问题。在因道支湖流域发现了 7 种龟鳖类。据我们所知，其中两个物种，即灰舌摄龟（<i>Cyclemys fusca</i>）和欧氏摄龟（<i>Cyclemys oldhamii</i>），尚未在该地区得到正式记录。此外，一种方言名称为 \"Late Par Tate\"的亚洲鳖属物种（<i>Amyda</i> sp.) (采集于2019年3月10日），迄今尚未被描述，很可能是一个新发现的物种。我们的研究结果表明，干扰（SW=1.0）和较高的有机质（SW=0.52）是解释巢观察频率差异的主要估计因素。动物放牧区的巢穴数量多于受人类干扰较大的其他地点。当地社区认为，狩猎（44%）、捕鱼（28%）和砍伐森林（13%）是威胁水龟和陆龟种群的主要活动。大部分被猎杀的水龟和陆龟要么被食用（超过 43%），要么被卖给从事非法贸易的中间商（不到 51%）。令人震惊的是，99% 的受访者表示，自然与野生动物保护部和非政府组织在保护和保育工作方面存在明显不足。我们主张加强保护工作，主要是通过加强执法、提高意识和建立限制人类进入的保护区，以促进这些种群的恢复，尤其是在筑巢区。【审阅:Ong Lisa】</p>\n<h2>သုတေသနအကျဉ်းချုပ်</h2>\n<p>Testudines သည်&amp;;ကမ္ဘာပေါ်တွင် ခြိမ်းခြောက်မှုအရှိဆုံး ကျောရိုးရှိသတ္တဝါများဖြစ်ကြပီး အာရှနိုင်ငံများ တွင် ဖမ်းဆီးသတ်ဖြတ်ခြင်း၊ တင်ပို့ရောင်းချခြင်းနှင့် နေထိုင်ကျက်စားမှုများ ဆုံးရှုံးရခြင်းတို့ကြောင့် ထိခိုက်လွယ်သည့် အဆင့်သို့ သတ်မှတ်ခြင်းခံထားရသည်။ ဤလေ့လာမှုသည် အင်းတော်ကြီးကန် မြစ်ဝှမ်းရှိ ရေချိုလိပ်များနှင့်ကုန်းတွင်းလိပ်များ၏ ဂေဟစနစ်နှင့် ထိန်းသိမ်းရေးအခြေအနေများကို နားလည်စေရန် ရည်ရွယ်ပါသည်။ စစ်တမ်းနမူနာကောက်ယူသည့်ကာလ လေးခုအတွင်း ၁-၂ ကီလိုမီတာရှည်သော transects ၄၇ ခုတစ်လျှောက် (စုစုပေါင်းအကွာအဝေး = 74.9 ကီလိုမီတာ) ကို စစ်တမ်းကောက်ယူခဲ့သည်။ ထို့အပြင် အဆိုပါစစ်တမ်းနမူနာကာလနှစ်ခုအတွင်း လိပ်များကိုဖမ်းယူရန် ထောင်ချောက်လေးခုကို နေရာသုံးခုတွင် ဖြန့်ကျက်ချထားခဲ့သည်။ မြေနမူနာ ၁၄ ခုကိုလည်း နေရာ ငါးခုမှကောက်ယူပြီး အခွံပျော့လိပ်များ၏ အသိုက်အခြေအနေများကို ဆုံးဖြတ်ရန် သုတေသနပြုလုပ်ခဲ့ ပါသည်။ တံငါသည်များနှင့် မုဆိုးများပါဝင်သည့် ဒေသခံအိမ်ထောင်စု ၁၄၆ စုဖြင့် ရေချိုလိပ်နှင့် ကုန်းတွင်းလိပ်များ ပေါများကြွယ်ဝမှု၊ နေထိုင်ကျက်စားမှုနှင့် မျိုးပွားခြင်းများအတွက် ဒေသခံများ၏ ဂေဟစနစ်ဆိုင်ရာ အသိပညာများ စုဆောင်းရန်အတွက် ထိန်းသိမ်းရေးဆိုင်ရာ အတွေးအမြင်များကို ဖော်ထုတ်တွေ့ရှိခဲ့သည်။ အင်းတော်ကြီးကန်အတွင်း၌ ရေချိုလိပ်နှင့် ကုန်းတွင်းလိပ်မျိုးစိတ် ခုနစ်မျိုး တို့ကို ဖော်ထုတ်တွေ့ရှိခဲ့သည်။ ကျွန်ုပ်တို့ သိရှိနားလည်ထား သည့်အတိုင်း အဆိုပါမျိုးစိတ် နှစ်ခုဖြစ်သည့် Myanmar Brown Leaf Turtle (<i>Cyclemys fusca</i>) နှင့် Oldham's leaf turtle (<i>Cyclemys oldhamii</i>) တို့သည် ဤဒေသတွင် တရားဝင် မှတ်တမ်းတင်ခြင်း မရှိသေးပေ။ ထို့အပြင် <i>Amyda</i> sp. (၂၀၁၉ ခုနှစ် မတ်လ ၁၀ ရက်) တွင် စုဆောင်းထားသော ဒေသအမည် “Late Par Tate” သည် ယခုအချိန်အထိ ဖော်ပြခြင်းမပြုရသေးဘဲ အသစ်တွေ့ရှိထားသော မျိုးစိတ်တစ်ခုဖြစ်ဖွယ်ရှိသည်။ ကျွန်ုပ်တို့၏ရလဒ်များသည် disturbance (SW = 1.0) နှင့် ပိုမိုမြင့်မားသော organic matter (SW = 0.52) တို့သည် အသိုက်တွေ့ရှိမှုအကြိမ်ရေ ကွာခြားမှုကို အဓိကညွှန်းဆိုပေးသော အရာများဖြစ်ခဲ့ပါသည်။ တိရစ္ဆာန်စားကျက်နေရာများတွင် လူသားများနှောင့်ယှက်မှုဒဏ်ခံရသော အခြားနေရာများထက် အသိုက်ပိုများပါသည်။ အမဲလိုက်ခြင်း (၄၄%)၊ ငါးဖမ်းခြင်း (၂၈%) နှင့် သစ်တောပြုန်းတီးမှု (၁၃%) တို့ကို ရေချိုလိပ်နှင့်ကုန်းတွင်းလိပ်များကို ခြိမ်းခြောက်သည့် အဓိကလုပ်ဆောင်မှုများအဖြစ် ဒေသခံ အသိုင်းအဝိုင်းက သတ်မှတ်ခဲ့သည်။ အမဲလိုက် လိပ်အများစု (၄၃%) ကျော်ကို စားသုံးခြင်း သို့မဟုတ် ပွဲစားများထံ ရောင်းချခဲ့ပြီး တစ်ခါတစ်ရံတွင် ၎င်းတို့ကို နိုင်ငံခြားကုန်သည်များထံ ရောင်းချခြင်း (၅၁%) အောက်သာ ရှိခဲ့သည်။ ထိတ်လန့်စရာကောင်းသည်မှာ တွေ့ဆုံမေးမြန်းခံရသူများ၏ ၉၉% သည် သဘာဝနှင့် တောရိုင်းတိရစ္ဆာန်ထိန်းသိမ်းရေးဌာနနှင့် NGO များ၏ ကာကွယ်ရေးနှင့် ထိန်းသိမ်းရေး ကြိုးပမ်းမှုတွင် သိသိသာသာချို့တဲ့နေကြောင်း ဖော်ပြခဲ့သည်။ အဓိကအားဖြင့် ဥပဒေစိုးမိုးခြင်း၊ အသိ ပညာမြှင့်တင်ခြင်းနှင့် ဒေသခံများဝင်ရောက်ရန် ကန့်သတ်ထားသော အကာအကွယ်ဇုန်များ တည်ထောင်ခြင်းဖြင့် အသိုက်မြေနေရာများတိုးမြှင့်ထိန်းသိမ်းရန် လိုအပ်ပါသည်။</p>","author":"Ei Mon Kyaw, \nLisa Ong, \nNay Htet Naing, \nThet Myat Oo, \nKyaw Htet Naing, \nLa Minn Ko Ko, \nThinn Su Tin, \nYe Yint Htun, \nXiao‐Yong Chen","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"ac8dd241e9546c0870c928675225f8fc9b3cf07538277dac32d84d9d16445e27","category":"Environment"}