{"title":"Artificial Intelligence in Wound Care: A Narrative Review of the Currently Available Mobile Apps for Automatic Ulcer Segmentation","link":"https://www.preprints.org/manuscript/202410.1244/v1","date":1729060237000,"content":"Introduction: Chronic ulcers significantly burden healthcare systems, requiring precise measurement and assessment for effective treatment. Traditional methods, such as manual segmentation, are time-consuming and error-prone. This review evaluates the potential of artificial intelligence (AI)--powered mobile apps for automated ulcer segmentation and their application in clinical settings. Methods: A comprehensive literature search was conducted across PubMed, CINAHL, Cochrane and Google Scholas databases. The review focused on mobile apps that use fully automatic AI algorithms for wound segmentation. Apps requiring additional hardware or needing more technical documentation were excluded. Vital technological features, clinical validation, and usability were analysed. Results: Ten mobile apps were identified, showing varying levels of segmentation accuracy and clinical validation. However, many apps did not publish sufficient information on the segmentation methods or algorithms used, and most lacked details on the databases employed for training their AI models. Additionally, several apps were unavailable in public repositories, limiting their accessibility and independent evaluation. These factors challenge their integration into clinical practice despite promising preliminary results. Discussion: AI-powered mobile apps offer significant potential for improving wound care by enhancing diagnostic accuracy and reducing the burden on healthcare professionals. Nonetheless, the lack of transparency regarding segmentation techniques, unpublished databases, and limited availability of many apps in public repositories remain substantial barriers to widespread clinical adoption. Conclusion: AI-driven mobile apps for ulcer segmentation could revolutionise chronic wound management. However, overcoming limitations related to transparency, data availability, and accessibility is essential for their successful integration into healthcare systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ac96e46752bc8498043b1d83d498bddc3aabe03a151636ddd2c84b02af2ab254","category":"Interdisciplinary"}