{"title":"41 Is there anything we can do to lessen the severity of PRRSv?","link":"https://academic.oup.com/jas/article/102/Supplement_2/235/7665032?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Veterinarians and the swine industry continue to battle PRRS virus (v), as demonstrated by both the MSHMP (Morrison Swine Health Monitoring Project) and the SDRS (Swine Disease Reporting System). Both systems depict a continued increase in PRRSv prevalence and percentage of positive cases. The PRRSv variants that are circulating today seem to be more severe, especially in the last 2 to 3 yr, with more significant health and production losses in the nursery and finishing phases for prolonged periods of time. The best thing that can be done is to avoid having the virus with a good bioexclusion plan and if sites become infected, a strong biocontainment plan to avoid contaminating more sites should be considered. Realizing that bioexclusion is not always possible and sites will become infected, there are methods to help to reduce the impact of the virus. With the concerns of recombination pushing the virus evolution along faster, more producers are working toward eliminating field viruses from their systems. The use of filtration both on sow farms and nurseries has become more common as well as an additional method of bioexclusion. In the face of an outbreak, obtaining an accurate diagnosis is still one of the most important things that we do. In farrow to wean farms, serum samples are generally used when clinical signs (e.g., abortions, off feed) are observed to target testing to specific animals that are more likely to allow for early detection. In nursery and finishing sites, the use of oral fluid has worked very well as a screening tool when there are clinical signs or problems within a group or flow. Fortunately, there are differential tests that can be used to identify field infection and vaccines strains (since most wean to finish pigs are vaccinated in pig dense areas). With severe strains, depopulation and repopulation strategies have become more popular as a control method, but the majority of herd would use a herd closure. However, the amount of time required for these closures is extending, which lengthens the impacts on sow farms. Among wean to finish systems, the use of depopulating and cleaning up the site is used most, with only routine down times. Anti-inflammatories can also be administered in the acute phase of the outbreak in addition to the use of antibiotics to control secondary bacterial infections, as well as providing a good environment to allow the pigs to better deal with the disease. It’s best to keep the virus out of the herd with a good bioexclusion program. However, when we do have outbreaks, anti-inflammatory and antibiotics to help the pigs through it are important to utilize as we work to eliminate the field virus from the herd.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ac9a4eb17549973bed55ea878b959af9673ba96838283f57cc91d971ca3036e4","category":"Environment"}