{"title":"Modeling human activity-related spread of the spotted lanternfly (<i>Lycorma delicatula</i>) in the US","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307754","date":1723644000000,"content":"<p>by Daniel Strömbom, Autumn Sands, Jason M. Graham, Amanda Crocker, Cameron Cloud, Grace Tulevech, Kelly Ward</p>\r\n\r\nThe spotted lanternfly (<i>Lycorma delicatula</i>) has recently spread from its native range to several other countries and forecasts predict that it may become a global invasive pest. In particular, since its confirmed presence in the United States in 2014 it has established itself as a major invasive pest in the Mid-Atlantic region where it is damaging both naturally occurring and commercially important farmed plants. Quarantine zones have been introduced to contain the infestation, but the spread to new areas continues. At present the pathways and drivers of spread are not well-understood. In particular, several human activity related factors have been proposed to contribute to the spread; however, which features of the current spread can be attributed to these factors remains unclear. Here we collect county level data on infestation status and four specific human activity related factors and use statistical methods to determine whether there is evidence for an association between the factors and infestation. Then we construct a network model based on the factors found to be associated with infestation and use it to simulate local spread. We find that the model reproduces key features of the spread 2014 to 2021. In particular, the growth of the main infestation region and the opening of spread corridors in the westward and southwestern directions is consistent with data and the model accurately forecasts the correct infestation status at the county level in 2021 with 81% accuracy. We then use the model to forecast the spread up to 2025 in a larger region. Given that this model is based on a few human activity related factors that can be targeted, it may prove useful to incorporate it into more elaborate predictive forecasting models and in informing management efforts focused on interstate highway transport and garden centers in the US and potentially for current and future invasions elsewhere globally.","author":"Daniel Strömbom","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ac9fbd4b5e624aa75e44e7628d1e6cdb4094c7492dbf1eb8307c080caebcd62b","category":"Interdisciplinary"}