{"title":"Impact of alexithymia, speech problems and parental emotion recognition on internalizing and externalizing problems in preschoolers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310244","date":1725976800000,"content":"<p>by Irina Jarvers, Eva Kormann, Daniel Schleicher, Angelika Ecker, Stephanie Kandsperger, Romuald Brunner</p>\r\nBackground <p>Alexithymia, characterized by difficulty identifying and describing emotions and an externally oriented thinking style, is a personality trait linked to various mental health issues. Despite its recognized importance, research on alexithymia in early childhood is sparse. This study addresses this gap by investigating alexithymia in preschool-aged children and its correlation with psychopathology, along with parental alexithymia.</p> Methods <p>Data were analyzed from 174 parents of preschoolers aged 3 to 6, including 27 children in an interdisciplinary intervention program, all of whom attended regular preschools. Parents filled out online questionnaires assessing their children’s alexithymia (Perth Alexithymia Questionnaire–Parent Report) and psychopathology (Strengths and Difficulties Questionnaire), as well as their own alexithymia (Perth Alexithymia Questionnaire) and emotion recognition (Reading Mind in the Eyes Test). Linear multivariable regressions were computed to predict child psychopathology based on both child and parental alexithymia.</p> Results <p>Preschool children’s alexithymia could be predicted by their parents’ alexithymia and parents’ emotion recognition skills. Internalizing symptomatology could be predicted by overall child alexithymia, whereas externalizing symptomatology was predicted by difficulties describing negative feelings only. Parental alexithymia was linked to both child alexithymia and psychopathology.</p> Conclusions <p>The findings provide first evidence of the importance of alexithymia as a possible risk factor in early childhood and contribute to understanding the presentation and role of alexithymia. This could inform future research aimed at investigating the causes, prevention, and intervention strategies for psychopathology in children.</p>","author":"Irina Jarvers","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"aca20d2b6e1d63bb7685d1ab46965009d0e4b5c69551e25aeb466392f4d3ed47","category":"Interdisciplinary"}