{"title":"A Great Gender Divergence","link":"https://markpeak.net/a-great-gender-divergence/","date":1706427241000,"content":"<p>เมื่อสัปดาห์ที่ผ่านมา มีบทความใน Financial Times สร้างแรงกระเพื่อมไม่น้อยในหมู่นักคิด คนดัง โลกตะวันตกที่ติดตามอยู่ใน Twitter</p>\n\n\n\n<p>บทความนี้ชื่อว่า <a href=\"https://www.ft.com/content/29fd9b5c-2f35-41bf-9d4c-994db4e12998\">A new global gender divide is emerging</a> เขียนโดย John Burn-Murdoch หัวหน้าฝ่ายข้อมูล (chief data reporter) ของ FT</p>\n\n\n\n<p>ตัวบทความต้องจ่ายเงินค่าสมาชิกเพื่ออ่าน แต่ใน Twitter ของ Burn-Murdoch เองก็สรุปใจความสำคัญไว้ครบถ้วนแล้ว (จริงๆ มีรายละเอียดเยอะกว่าในบทความด้วยซ้ำนะ) ตามไปอ่านกันได้ใน Twitter</p>\n\n\n\n<figure><div>\n<blockquote><p>NEW: an ideological divide is emerging between young men and women in many countries around the world.<br /><br />I think this one of the most important social trends unfolding today, and provides the answer to several puzzles. <a href=\"https://t.co/kG4qQReqfT\">pic.twitter.com/kG4qQReqfT</a></p>— John Burn-Murdoch (@jburnmurdoch) <a href=\"https://twitter.com/jburnmurdoch/status/1750849189834022932?ref_src=twsrc%5Etfw\">January 26, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>Burn-Murdoch อ้างงานศึกษาของ <a href=\"https://www.draliceevans.com/\">Alice Evans</a> อาจารย์ด้าน gender history ที่ King’s College London ซึ่งศึกษาเกี่ยวกับเรื่องความแตกต่างทางความคิด อุดมการณ์ทางการเมือง (an ideological gap) ของคนรุ่นใหม่ Gen Z เพศชายและเพศหญิง ที่มุมมองเรื่องเหล่านี้กำลังเริ่มถ่างออกเรื่อยๆ ซึ่งภาวะนี้เกิดขึ้นทั่วโลก ไม่ว่าจะเป็นอเมริกา ยุโรปหรือเอเชีย</p>\n\n\n\n<p>ถ้าให้สรุปสั้นๆ คงเป็นเหมือนชื่อหนังสือเล่มหนึ่งที่ตั้งเป็นภาษาไทยว่า “ผู้หญิงเลี้ยวซ้าย ผู้ชายเลี้ยวขวา” นั่นคือ สาวรุ่นใหม่มีความเป็นซ้าย (liberalism) มากขึ้น ในขณะที่หนุ่มรุ่นใหม่กลับเป็นขวา (conservativism) แทน</p>\n\n\n\n<p>ผู้หญิงสมัยใหม่มีความเป็นเสรีนิยม เฟมินิสต์ ยืนหยัดด้วยตัวเองไม่ต้องพึ่งพาเพศชาย เป็นสิ่งที่พอเข้าใจได้ แต่ผู้ชายรุ่นใหม่เป็นขวา หน้าตาเป็นอย่างไร ผมคิดว่า Paul Graham นักลงทุนสตาร์ตอัพชื่อดังที่ quote เรื่องนี้เอาไว้ สรุปไว้เข้าใจง่ายดี (เห็นภาพ)</p>\n\n\n\n<blockquote>\n<p>“now the boys are at home playing shooter games”</p>\n<cite><a href=\"https://twitter.com/paulg/status/1750881800174420216\">Paul Graham</a></cite></blockquote>\n\n\n\n<p>ต้นฉบับทวีต</p>\n\n\n\n\n<figure><div>\n<blockquote><p>This trend has a boringly obvious explanation. Boys and girls used to hang out together more. The girls made the boys more liberal and the boys made the girls more conservative. But now the boys are at home playing shooter games, and the girls are at home posting on Instagram. <a href=\"https://t.co/MS61vFjh2f\">pic.twitter.com/MS61vFjh2f</a></p>— Paul Graham (@paulg) <a href=\"https://twitter.com/paulg/status/1750881800174420216?ref_src=twsrc%5Etfw\">January 26, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>ด้วยความที่สนใจเรื่องนี้เป็นทุนเดิมอยู่แล้ว ผมจึงตามไปอ่าน<a href=\"https://www.ggd.world/p/what-prevents-and-what-drives-gendered\">โพสต์ฉบับเต็มของ Alice Evans</a> ที่อธิบายงานศึกษาของเธอไว้ละเอียดกว่าในบทความของ FT</p>\n\n\n\n<p>เธออธิบายว่ามีปรากฏการณ์ทางสังคม 2 ทางที่ทำให้ความแตกต่างระหว่างเพศ (gender divide) ลดลงและเพิ่มขึ้น</p>\n\n\n\n<p>เริ่มจากสิ่งที่ช่วยทำให้ช่องว่างระหว่างเพศลดลง</p>\n\n\n\n<p><strong>What suppresses a gender divide</strong></p>\n\n\n\n<ul>\n<li><strong>สังคมแบบปิด เน้นศาสนา</strong> ตัวอย่างที่เห็นชัดคือ สังคมมุสลิมตะวันออกกลาง และฮินดูในอินเดีย (ผมขอเสริมเองว่า ไทยพุทธแบบดั้งเดิมก็ใช่) ที่มองครอบครัวเป็นสิ่งสำคัญที่สุด เครือญาติ ศาสนา ต้องเชิดชูเอาไว้ สังคมแบบนี้จะ “กด” ผู้หญิงไว้ให้ทำตามบรรทัดฐานของสังคมนั้นๆ ทำให้เราเห็นความแตกต่างทางความคิดระหว่างเพศได้ยาก (Evans ยกตัวอย่างเพื่อนหญิงชาวโมร็อคโกของเธอ ที่รักชอบผู้หญิงด้วยกันเอง แต่อยู่บ้านไม่กล้าแสดงออกอะไร และต้องขวนขวายไปทำงานต่างประเทศ เพื่อได้แสดงออกแบบที่ตัวเองต้องการ)</li>\n\n\n\n<li><strong>สังคมที่เพศตรงข้ามมีโอกาสคุยกันแบบออฟไลน์</strong> ในโลกตะวันตกที่ไม่ได้เคร่งศาสนาเท่า เยาวชนรุ่นก่อนที่ต่างเพศกัน ยังมีโอกาสได้เจอกัน เป็นเพื่อนกัน เล่นด้วยกัน มีกิจกรรมร่วมกันแบบออฟไลน์ (mixed gender friendship) ไม่ว่าจะเป็นการเล่นสนามเด็กเล่น เล่นวิดีโอเกมหน้าทีวีด้วยกัน จัดปาร์ตี้ที่บ้าน ฯลฯ ชาย-หญิง มีโอกาสได้เรียนรู้ความคิดของเพศตรงข้าม ว่าชอบอะไร ไม่ชอบอะไร สิ่งไหนควรพูดและไม่ควรพูด</li>\n</ul>\n\n\n\n<p>ในทางกลับกัน โลกยุคใหม่มีปัจจัยที่ทำให้ช่องว่างระหว่างเพศเพิ่มขึ้น</p>\n\n\n\n<p><strong>What Fosters a Gender Divide</strong></p>\n\n\n\n<ul>\n<li><strong>Cultural liberalisation</strong> เพศหญิงที่ถูกกดขี่มานาน (ในหลายสังคม) มีช่องทางในการพูดคุยกัน และแสดงออกถึงความต้องการของตัวเองมากขึ้น ปรากฏการณ์ #MeToo ที่เกิดขึ้นในหลายประเทศเป็นตัวอย่างที่ชัดเจน ถ้าดูจากชาร์ทของ FT จะเห็นว่าในเกาหลีใต้ที่มีค่านิยมกดขี่ทางเพศมายาวนาน เมื่อเกิดการ liberalisation ทำให้มุมมองทางการเมืองของชาย-หญิงฉีกออกอย่างชัดเจนที่สุดใน 4 ประเทศที่ยกมา</li>\n\n\n\n<li><strong>Social media filter bubbles</strong> การสื่อสารทางโซเชียล-สมาร์ทโฟน ทำให้เกิด filter bubble กับทุกเรื่อง (ไม่ใช่แค่เรื่องเพศ) อย่างในจีน ผู้ชายส่วนใหญ่ไปอยู่กันใน Baidu Tieba ส่วนผู้หญิงเข้าแอพชื่อ Little Red Book (กรณีของไทย ผมตั้งข้อสังเกตว่าผู้หญิงมักอยู่ใน Twitter ส่วนผู้ชายอยู่ในกลุ่มปิด เช่น Discord/Facebook Group)</li>\n\n\n\n<li><strong>Economic resentment</strong> ปัจจัยเรื่องเศรษฐกิจเป็นอีกส่วนที่สำคัญ ตัวอย่างที่ชัดเจนคือในโลกที่การหางานมีการแข่งขันสูงขึ้นมาก เมื่อผู้ชายหางานไม่ได้ หรือได้งานที่ค่าตอบแทนไม่ดีพอ ก็จะมองว่า “เป็นเพราะ XXX มาแย่งงานของฉันไป” (zero-sum mentalities) ซึ่ง XXX เป็นได้ทั้ง “ผู้หญิง” และ “ผู้อพยพต่างชาติ” ซึ่งผู้ชายที่มีมุมมองไปทาง conservative ก็จะไม่ชอบทั้งสองอย่าง</li>\n\n\n\n<li><strong>Cultural entrepreneurs</strong> หมายถึงดารา ไอคอน หรือผู้นำทางความคิดเชิงวัฒนธรรมชายเป็นใหญ่ เช่น Andrew Tate ที่แสดงออกเรื่องมุมมองทางเพศอย่างชัดแจ้ง และกลายเป็นไอดอลของผู้ชายรุ่นใหม่ๆ ไปเลย</li>\n</ul>\n\n\n\n<p>ปัญหา gender divergence ตามมาด้วยอัตราการเดต การแต่งงาน การมีลูกที่ตกต่ำลง ยังไม่รวมถึงการทะเลาะ ถกเถียงกันในเชิงความคิดที่คุกรุ่นต่อไปยังประเด็นอื่นๆ (เช่น woke, vegan, ผู้อพยพเข้าเมือง, สมรสเท่าเทียม, สีผิว) ลามไปถึงผลกระทบในเชิงการเมืองภาพใหญ่ (มีผลต่อการโหวตลงคะแนนเลือกตั้งตามอุดมการณ์ของพรรคการเมือง) อีกมาก</p>\n\n\n\n<figure><div>\n<blockquote><p>What’s causing all of this?<br /><br />One theory is negative polarisation.<br /><br />In the wake of the <a href=\"https://twitter.com/hashtag/MeToo?src=hash&amp;ref_src=twsrc%5Etfw\">#MeToo</a> movement, young women have both become more progressive and more vocal about their views.<br /><br />Many young men feel threatened and have reacted by taking the opposite position.</p>— John Burn-Murdoch (@jburnmurdoch) <a href=\"https://twitter.com/jburnmurdoch/status/1750849216589529255?ref_src=twsrc%5Etfw\">January 26, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>เรื่องนี้เป็นเรื่องที่ยาก ใหญ่ และใหม่ เราคงต้องค่อยๆ ศึกษาและทำความเข้าใจมันไปอีกสักพักใหญ่ๆ แน่นอน</p>The post <a href=\"https://markpeak.net/a-great-gender-divergence/\">A Great Gender Divergence</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"acaa9010129cc446156c87759c29423904ad0934dbfeac2c8d1410b364f0b491","category":"Thai"}