{"title":"Toddler dies of Ebola after 3 suspicious deaths in DRC; 148 contacts identified","link":"https://arstechnica.com/?p=1803225","date":1633989636000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1151531250-800x533.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1151531250.jpeg\">Enlarge</a> <span>/</span> A World Health Organization worker decontaminates the house of a pastor who tested positive for Ebola in Beni, Democratic Republic of Congo. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/world-health-organization-worker-belinda-landu-news-photo/1151531250?adppopup=true\">Getty | Sopa images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Health officials in the Democratic Republic of the Congo are racing to investigate a potential Ebola outbreak after a 3-year-old boy died of the disease on October 6. Researchers confirmed the toddler's infection with the deadly viral disease on October 8, according to a report by the World Health Organization.</p>\n<p>The boy's death closely follows the suspicious deaths of three of his neighbors, a father and his two daughters. One of the daughters died on September 14, followed by the father's death on September 19 and the other daughter's death on September 29. The family displayed symptoms consistent with Ebola but were not tested for the virus. The two daughters, however, had tested positive for malaria.</p>\n<p>The family's deaths, along with the toddler's, occurred in the Butsili Health Area, which is close to Beni city, one of the epicenters of the 2018–2020 Ebola outbreak in DRC's North Kivu Province. <a href=\"https://www.who.int/news/item/25-06-2020-10th-ebola-outbreak-in-the-democratic-republic-of-the-congo-declared-over-vigilance-against-flare-ups-and-support-for-survivors-must-continue\">That outbreak</a> led to 3,470 cases and 2,287 deaths. Additionally, North Kivu experienced a smaller Ebola outbreak earlier this year, between February and May, that involved 12 cases and six deaths.</p></div><p><a href=\"https://arstechnica.com/?p=1803225#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1803225&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"acad9832be713fa16f4f00efc133ea448d49bb551fe6f7cb711afc51d1994178","category":"Tech"}