{"title":"Spatial prioritisation for crested newt conservation in Luxembourg: Insights from population genetics and species distribution modelling","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12310?af=R","date":1709621205000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6a27ec8f-c38d-43cf-98ba-c8de393186d4/eso312310-toc-0001-m.png\" alt=\"Spatial prioritisation for crested newt conservation in Luxembourg: Insights from population genetics and species distribution modelling\" />\n<p>This study aims at identifying priority areas of conservation for the northern crested newt (<i>Triturus cristatus</i>) in Luxembourg. Employing a multidisciplinary approach, including population genetics and species distribution modelling, we develop a spatial prioritisation framework for creating and restoring breeding ponds. Findings reveal spatial clustering in genetic structure, highlighting five sites for targeted conservation efforts, while also identifying habitat predictors and optimal habitat restoration areas in southwest Luxembourg.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe intensification of agriculture and urbanisation has precipitated the decline of numerous species, including the northern crested newt (<i>Triturus cristatus</i>). To mitigate the impacts of habitat degradation and loss, restoration initiatives depend on evidence-based decision-making to identify priority sites for conservation efforts. Here, we employed a multidisciplinary approach, drawing on population genetics, species distribution modelling (SDMs) and landscape genetics to develop a spatial prioritisation framework for the creation and/or restoration of crested newt breeding ponds in Luxembourg.\n\nFor the genetic analyses, more than 1000 crested newts from 98 ponds across Luxembourg were genotyped at 15 microsatellite loci to assess genetic diversity and spatial clustering. The relationship between newt presence and environmental variables was evaluated using SDMs. Priority restoration areas were identified with PRIORITZR, integrating genetic diversity, habitat suitability and connectivity.\n\nThe population genetic structure was characterised by spatial clustering, which followed an isolation-by-distance pattern. Five sites were identified as significantly differentiated from the remaining populations, warranting targeted conservation efforts.\n\nStanding water bodies and proximity to the nearest occupied pond were the most important predictors of crested newt presence. The highest gain in habitat suitability through the creation of new ponds was predicted to occur in southwest Luxembourg.\n\nBased on the country-wide predicted occurrence of crested newts and gains in habitat suitability, areas of highest restoration potential were identified in close proximity to existing crested newt populations. The produced maps of priority restoration areas should inform future conservation efforts of the crested newt in Luxembourg.\n\nWhile the importance of preserving genetic diversity is widely recognised, the theory-practice gap frequently precludes the incorporation of genetic aspects into in situ conservation measures or management policies. This case study demonstrates the integration of multidisciplinary analyses within an evidence-based framework to guide species conservation efforts.\n</p>","author":"Anna Schleimer, \nLisette Cantú‐Salazar, \nAmanda Luttringer, \nAlain C. Frantz","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"acbd9c82db460a73df2d6703e9abb8775f6a9eed84b77c3137037d1804a4a963","category":"Environment"}