{"title":"Challenges and Trends in Green Finance in the Context of Sustainable Development - A Bibliometric Analysis","link":"https://www.preprints.org/manuscript/202406.0232/v1","date":1717577552000,"content":"Green finance in the context of sustainable development sits within the broader discourse of environmental economics and sustainable finance. Their integration has become imperative in addressing global challenges, aiming to understand how financial mechanisms can be aligned with sustainability goals, investigating the role of green finance in promoting environmentally friendly investments and fostering sustainable development. This bibliometric analysis explores the evolution, trends, and challenges in green finance research. It examines 436 articles published between 2016 and 2024, revealing insights into influential publications, authors, journals, institutions, and countries engaged in green finance for sustainability. The study identifies China, the UK, and Pakistan as leaders in research output and citation impact. Furthermore, it highlights the interdisciplinary nature of green finance, reflected in diverse publication outlets spanning environmental, social, and economic domains. The analysis underscores the increasing global interest in green finance, as evidenced by the growing citation rates over time. Key findings include the pivotal role of green finance in energy efficiency, renewable energy development, and the promotion of sustainable economic growth. Overall, this research provides valuable insights for policymakers, researchers, and practitioners, emphasizing the importance of interdisciplinary collaboration and continued research efforts in advancing sustainable finance agendas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"acbe523956afed0c2894effbad8e71927ec5f88373bcd3c62f2ea254171d7107","category":"Interdisciplinary"}