{"title":"Lael Wilcox on the women’s Komoot Torino-Nice Rally: ‘An invitation to show up and do something hard’","link":"https://www.cyclist.co.uk/news/10161/lael-wilcox-torino-nice","date":1633443273000,"content":"<span>\n      <span><a href=\"/authors/emma-cole\">Emma Cole</a></span>\n  </span><div>  \n  <div>      <div><span>5 Oct 2021</span></div>    </div></div><p>\nA successful women-specific challenge with a stellar route</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/2021_womens_komoot_torino_nice_rally_-_rugile_kaladyte_.jpeg?itok=Cvd3myCf\" />  </div>\n<div>\n      <p> Ultra-endurance rider Lael Wilcox completed the self-supported Torino-Nice Rally last Friday along with 25 other women. The group cycled 700km with 15,000m of climbing through the Italian and French Alps over seven days.</p>\n<p>Wilcox, who is from Alaska and was the first American to win the Trans Am Bike Race in 2016, had wanted to ride the route for years and after speaking to a friend at route-planning service Komoot, organised the week-long challenge in just a month.</p>\n<p>‘It was a total success for the first year and the route was stellar,’ says Wilcox. ‘Everyone was up for it and we had got a brilliant group of women together, some of whom had never done anything like this before.’</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/2021_womens_komoot_torino_nice_rally_-_rugile_kaladyte_-_026.jpeg?itok=u1micFpd\" />  </div>\n</div>\n<h3>The route</h3>\n<p>Designed by James Olsen, the route took in a total of 10 climbs, with the first climb Colle del Colombardo being the hardest followed by the <a href=\"/in-depth/7548/classic-climbs-colle-delle-finestre\">better-known Colle delle Finestre</a>.</p>\n<p>‘Colle del Colombardo was really steep and loose,’ says Wilcox. ‘I was the first one to go up and then everyone was thinking are we actually going to be able to do this as it seems crazy. It was the first mountain pass and the hardest, but everyone made it and it was good to get it over with.’</p>\n<p>The group started with 21 riders and ended with 26 as five more women joined the event.</p>\n<p>They split into smaller groups over the course of the route leap-frogging each other along the way.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/tom_gibbs_torino_nice_1.jpeg?itok=uQzZIp24\" />  </div>\n</div>\n<p>Half the riders rode gravel bikes, whilst the others rode mountain bikes which Wilcox said worked well, as some of the descents required anything between a gravel and a full suspension MTB.</p>\n<p>Wilcox opted for a <a href=\"/8155/specialized-diverge-2020\">Specialized Diverge</a> with Revelate Designs bikepacking bags.</p>\n<p>The group only suffered minor mechanical problems like flat tyres and worn-out brake pads. As a self-supported event, however, the bikepacking bags were necessary not only for spares, with riders choosing whether to bring a tent or bivvy, to sleep out or opt for a refuge.</p>\n<h3>Why only women?</h3>\n<p>The main crux of the challenge was that it was specifically geared towards women as Wilcox wanted show that there is a place for women in endurance cycling.</p>\n<p>‘Like a lot of bikepacking races or in the community overall, there aren’t that many women,’ explains Wilcox. ‘If I show up to a race, I am usually the only woman or we represent 10% of the field, which is encouraging to see, but there is no reason why more women shouldn't be on the start line as they're totally capable.</p>\n<p>‘Especially in endurance, we're seeing more and more positive results where women win the entire field but there's just not that many on the start line.</p>\n<p>‘It was an invitation to show up and do something hard.’</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/tom_gibbs_torino_nice.jpeg?itok=WVQde7A2\" />  </div>\n</div>\n<p>In Wilcox’s view, a lot of women-specific events are geared towards an introductory or beginner level.</p>\n<p>She wanted to organise a more serious challenge to show other women that they too can get involved in more challenging rides and enjoy themselves.</p>\n<p>‘You should take it on if you feel a little scared but also to show yourself what you're capable of,’ she says. ‘That’s when you learn new things about yourself, and then you also feel so much more empowered to do more the next time.</p>\n<p>‘It doesn't have to be harder, but you just have that bank of experience for whatever comes next.’</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/rugile_torino_nice.jpeg?itok=9LF-sQ0B\" />  </div>\n</div>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/10117/rgt-cycling-flanders\">Ride like a world champ on RGT sim's new Flanders course</a></div>      <div><a href=\"/news/7897/indoor-training-platform-rgt-goes-completely-free-in-response-to-coronavirus\">Indoor training platform RGT goes completely free in response to coronavirus</a></div>    </div></div><h3>So what does come next?</h3>\n<p>Since completing the Torino-Nice Rally, Wilcox has had many messages from others wanting to get involved.</p>\n<p>She plans to hold the event again next year and also hopes to add another route somewhere else.</p>\n<p>It has been a high-profile few days for women’s cycling, with <a href=\"/news/10151/joss-lowden-breaks-hour-record\">Joss Lowden breaking the Hour Record</a> and Lizzie Deignan winning the inaugural <a href=\"/in-depth/10156/why-paris-roubaix-femmes-means-more\">Paris-Roubaix Femmes</a>, which Wilcox really appreciates.</p>\n<p>‘I’m super excited about all that and I feel the more women get together and share ideas with one another, the more positive energy is going to get out there,’ explains Wilcox. ‘It just proves that women are capable of anything.’</p>\n<p>On Thursday Wilcox will be speaking at an <a href=\"https://ti.to/rapha-london/laelwilcox-emilychappell\">event organised by Rapha</a> with fellow Torino-Nice Rally cyclist Emily Chappell and it will also be live streamed on Instagram.</p>\n<p>Wilcox is hoping to take on the Across Andes event at the end of November and the Race Around Rwanda in January.</p>\n<p>Check out the full Torino-Nice Rally route on <a href=\"http://komoot.com/tour/466623423\">Komoot</a>.</p>\n<p><em>Image credits: Tom Gibbs and Rugile Kaladyte</em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"ecole","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"acc839013eeae140fb04703edfb61f9924020679ffc956cf01ffbf5de8942c09","category":"Cycling"}