{"title":"Going to the archives: Combining palaeoecological and contemporary data to support river restoration appraisals","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4366?af=R","date":1725530025000,"content":"<h2>Abstract</h2>\n<p>River restoration practices are being increasingly implemented to help offset the global degradation of freshwater ecosystems. The ecological success of such projects is typically determined via post-project appraisals comparing restored conditions against specified baselines (e.g., pre-project and/or non-restored data), but such approaches can overlook broader ecosystem recovery patterns. Using freshwater macroinvertebrate communities, this study examined ecological responses to river restoration that are seldom assessed: (i) sub-annual temporal trajectories and (ii) palaeoecological versus contemporary community comparisons. Palaeoecological samples contained assemblages that existed prior to major anthropogenic pressures, which were collected from a sinuous palaeochannel that was restored and reconnected during the study; after which contemporary macroinvertebrate samples were collected. The restored channel initially supported an impoverished community, but taxonomic richness and densities were comparable to non-restored conditions after 13-months. The freshwater shrimp (<i>Gammarus pulex</i>) and non-native New Zealand mud snail (<i>Potamopyrgus antipodarum</i>) proliferated 7-months post-restoration, and follow-up biomonitoring highlighted their dominance prevailed 5-years later. Such evidence indicates how ecosystem dynamics in the aftermath of restoration can shape longer-term recovery. Palaeoecological communities exhibited higher biodiversity and conservation values compared with contemporary samples. This highlights that escalating anthropogenic pressures since the mid-20th Century degraded macroinvertebrate communities, notably constraining marginal-dwelling and lentic specialists. With palaeochannel reconnections being widely applied worldwide, this study demonstrates the value in collecting palaeoecological data before restoration works to provide valuable baseline information. As the global anthropogenic footprint increasingly degrades suitable “reference” river environments, palaeoecological data can better characterize biodiversity losses and potentially provide target conditions informing effective restoration activities.</p>","author":"J. C. White, \nE. Seddon, \nM. J. Hill, \nK. L. Mathers, \nM. Bridger, \nD. M. Hannah, \nP. J. Wood","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"acd287791608055bb2b19107da73905275b9f21e7f12b3467763a54311ab3c9f","category":"Environment"}