{"title":"Intelligibility Sound Therapy Enhances the Ability of Speech-in-Noise Perception and Pre-perceptual Neurophysiological Response","link":"https://www.preprints.org/manuscript/202409.1109/v1","date":1726291869000,"content":"Aural rehabilitation with hearing aids can decrease the attentional requirements of cognitive resources by amplifying the deteriorated-frequency sound in hearing loss patients and improve the auditory discrimination ability like speech-in-noise perception. As aural rehabilitation with an intelligible-hearing sound also can be hopeful, the aim of this study was to evaluate the effectiveness of the aural rehabilitation with intelligible-hearing sound for hearing loss patients. Adult native Japanese speakers (17 males and 23 females, 68.43±9.23 years) showed over 30 dB at 125, 250, 500, 1000, 2000, 3000, 4000, 8000, 10000, and 12000Hz on any side, were recruited and underwent Mini-Mental State Examination Japanese. we conducted self-evaluation questionnaire for hearing problems of voice, gap detection test, fast speech test, and speech-in-noise test, pure tone audiogram, speech perception test using Japanese 67-S, cortical auditory evoked fields, and magnetic mismatch negativity before and after the non-intelligible-hearing (N=20) and intelligible-hearing (N=20) sound therapy with listening to music for one hour a day for 35 days. Better hearing ear was defined using a four-frequency pure-tone average at the thresholds of 500, 1000, 2000 and 4000 Hz. After the sound therapy, speech-in-noise test with signal to noise ratio +10 in better hearing ear showed significant improvement (p&amp;lt;0.05), and N1m-P2m amplitudes showed the significant increase in Lt superior temporal gyrus at the stimulus from better hearing ear (p&amp;lt;0.05). The significant enhancement of the magnetic mismatch negativity amplitude at Lt superior temporal gyrus was exhibited after the sound therapy (p&amp;lt;0.01). Intelligible-hearing sound therapy can improve the ability of speech-in-noise perception in better hearing ear and the enhancement of central cortex response, which reflect the ability of working memory, was proved by cortical auditory evoked fields and magnetic mismatch negativity. Intelligible-hearing sound therapy can be a valuable aural rehabilitation method for sensory neural hearing loss as same as hearing aids.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"acd35e52a40172cbd8d4e6057ce7ccfe4876d6b35c1a4748b813c1eb079badff","category":"Interdisciplinary"}