{"title":"PKI hosting: Cloud-based PKI vs. self managed","link":"https://www.hashicorp.com/blog/pki-hosting-cloud-based-pki-vs-self-managed","date":1697526720000,"content":"<p>Many organizations are leveraging SaaS solutions for public key infrastructure (PKI) to protect their workloads in the cloud. However, PKI running in self-managed environments also remains a popular choice, and is a requirement for some highly regulated industries. </p>\n\n<p>There are important factors organizations need to consider before deciding which option is the best choice for their requirements, but the advantages of cloud-based PKI versus an on-premises approach are not always well understood. This blog explores the factors organizations should consider when deciding how to host their PKI environment.</p>\n\n<h2>PKI explained</h2>\n\n<p>PKI is the standard process for provisioning and maintaining digital certificates for authentication and encryption of digital identities associated with users, devices, and applications. Common PKI use cases include:</p>\n\n<ul>\n<li>SSL and TLS certificates</li>\n<li>Device and endpoint certificates</li>\n<li>Code signing certificates</li>\n<li>Digital signatures</li>\n<li>Securing access to APIs</li>\n<li>Certificate-based VPNs</li>\n</ul>\n\n<p>Below is a simplified illustration of the core PKI process:</p>\n<img src=\"https://www.datocms-assets.com/2885/1697504081-pki-process.png\" alt=\"PKI\" /><p>Public key cryptography is the foundation of PKI. It is a strong encryption mechanism that relies on public and private key pairs. The keys are used together to encrypt and decrypt messages based on cryptographic algorithms, helping to protect identities and data from unauthorized use.</p>\n\n<h2>Cloud PKI and HCP Vault</h2>\n\n<p>In the context of this post, cloud PKI refers to a service or hosting model in the cloud where a service provider hosts and manages the infrastructure and the customer is responsible for the certificate authority (CA), as well as the PKI environment for provisioning and managing certificates. </p>\n\n<p>With self-managed PKI, workloads may be hosted in a cloud environment or a more traditional on-premises datacenter. With a self-managed approach, the organization is responsible for maintaining the PKI infrastructure and operations. </p>\n\n<p>A look into the delivery models for <a href=\"https://www.hashicorp.com/products/vault\">HashiCorp Vault</a> can help make it clear what options are available and which one might be best for your organization.</p>\n\n<p>HashiCorp’s cloud PKI functionality resides in <a href=\"https://developer.hashicorp.com/hcp/docs/vault\">HashiCorp Cloud Platform (HCP) Vault</a>. HCP Vault is a fully managed implementation of Vault operated by HashiCorp, allowing organizations to get up and running quickly. </p>\n\n<p>If an organization chooses to allow a public connection, the HCP Vault cluster will have an associated public address where clients can directly connect to Vault. (Most organizations disable the public connection for security reasons.) The organization can then establish a peering connection between its cloud provider and a HashiCorp virtual network (HVN). This ensures that only trusted clients (users, applications, containers, etc.) running in the peered public cloud provider can connect to Vault and stops systems outside of the selected network from attempting to connect.</p>\n<img src=\"https://www.datocms-assets.com/2885/1697504191-pki-infrastructure.png\" alt=\"PKI\" /><h2>Benefits of PKI on HCP Vault</h2>\n\n<p>Running PKI on HCP enables users to secure, store, and tightly control access to tokens, passwords, certificates, and encryption keys within one unified cloud-based platform.</p>\n\n<p>Key benefits of running cloud PKI on HCP Vault include:</p>\n\n<ul>\n<li><strong>Reduced operational overhead:</strong> Push-button deployment as well as fully managed upgrades and backups mean organizations can focus on adoption and integration instead of operational overhead.</li>\n<li><strong>Increased security across clouds and machines:</strong> HCP Vault allows organizations to secure their globally diverse infrastructure and applications through a single management interface, to restrict access to sensitive data.</li>\n<li><strong>Control costs:</strong> Reduced operating costs due to HashiCorp's engineers running and maintaining the underlying infrastructure for you.</li>\n<li><strong>Reliability:</strong> HashiCorp has experience supporting thousands of commercial Vault clusters and HCP Vault brings that expertise directly to users.</li>\n<li><strong>Ease of use:</strong> HCP Vault is built around making onboarding its cloud security automation simple. </li>\n</ul>\n\n<h2>Benefits of self-managed PKI</h2>\n\n<p>A managed product like HCP Vault brings many benefits, but organizations should also consider their particular needs when choosing how and where to host their PKI environment. Frequently, those needs are driven by compliance and regulatory requirements associated with specific industries, where self-managed hosting may be appropriate. Self-managed Vault comes in two editions: A free community edition for small use cases, and Vault Enterprise for larger organizations or organizations with stricter security requirements. </p>\n\n<p>The benefits of a running a self-managed PKI environment with Vault include:</p>\n\n<ul>\n<li><strong>Control:</strong> The certificate provisioning, revocation, and rotation process is within your control, and you are not limited when accessing the cloud. </li>\n<li><strong>Flexibility:</strong> On-premises management can be more flexible in terms of customization based on the requirements and capacity of the business.</li>\n<li><strong>Self-reliance:</strong> Since critical data is kept in-house, configuration changes can be done on-premises and on your schedule.</li>\n<li><strong>Security and compliance:</strong> Cloud service providers don’t always support the compliance and standards required for particular industries. Self-managed environments allow organizations to customize their environments for their specific compliance needs.</li>\n</ul>\n\n<h2>HashiCorp and PKI</h2>\n\n<p>Clearly, both cloud-based and self-managed PKI solutions have their pros and cons. That’s why HashiCorp offers multiple ways to address your PKI needs. </p>\n\n<p>Cloud PKI offers agility, ease of use, and reduced operational overhead, whereas self-managed PKI offers more options to customize and meet specific security and compliance requirements. HashiCorp can meet your organization’s needs for not only both types of PKI, but both cloud-based or self-managed certificate lifecycle management platforms (CLM), which is a broader effort to secure identity information and implement data protection to secure your users, devices, and applications.</p>\n\n<p><a href=\"https://www.hashicorp.com/contact-sales?interest=vault\">Contact HashiCorp sales to learn more</a> about how HCP Vault and Vault Enterprise can help with your PKI requirements.</p>\n\n<p>Want to learn more about HashiCorp Vault PKI?</p>\n\n<ul>\n<li><strong><a href=\"https://www.hashicorp.com/blog/what-is-acme-pki\">What is PKI ACME:</a></strong> Learn about the ACME protocol for PKI, the common problems it solves, and why it should be part of your certificate management roadmap.</li>\n<li><strong><a href=\"https://www.hashicorp.com/blog/certificate-management-with-vault\">X.509 certificate management with Vault:</a></strong> Al look at practical public key certificate management in HashiCorp Vault using dynamic secrets rotation.</li>\n<li><strong><a href=\"https://www.hashicorp.com/blog/vault-1-15-brings-ui-updates-pki-enhancements-new-betas-and-more\">CIEPS availability with Vault 1.15</a>:</strong> HashiCorp Vault 1.15 contains a range of updates from UI updates and PKI enhancements to betas for Vault Enterprise secrets sync, Vault Enterprise seal high availability, and event monitoring.</li>\n</ul>\n","author":"Rich Dubose","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"ace1dbbc2b8ee533cb4c5dfd42735461e882fca6ef9e74f7d4dafb48f0a81489","category":"Tech"}