{"title":"Scarlett Johansson ฟ้องแอป AI ฐาน เอาชื่อ หน้าและเสียงไปใช้ในโฆษณา","link":"https://www.blognone.com/node/136544","date":1698923222000,"content":"<div><div><div><p>ตามรายงานจาก Variety คุณ Scarlett Johansson ดาราฮอลิวู้ดกำลังดำเนินคดีทางกฎหมายกับนักพัฒนาแอป AI ที่ใช้ชื่อและภาพเหมือนของเธอในโฆษณาออนไลน์ ซึ่งเป็นโฆษณาสำหรับโปรแกรมแก้ไขรูปภาพ AI ชื่อ Lisa AI: 90s Yearbook &amp; Avatar ซึ่งบรรยายโดยใช้เสียงของ Scarlett Johansson ในเวอร์ชันที่ AI สร้างขึ้น</p>\n<p>โฆษณาความยาว 22 วินาทีนี้แสดงให้เห็นภาพเบื้องหลังของ Scarlett Johansson ที่กำลังถ่ายทำหนังเรื่อง Black Widow แล้วพูดเชิญให้คนดูเข้ามาใช้แอป แล้วโฆษณาก็เปลี่ยนหน้า Scarlett Johansson ออกในขณะที่เสียงของเธอที่สร้างโดย AI ยังอยู่ แล้วกล่าวต่อว่า แอปนี้ไม่เพียงแต่สร้างอวตารได้เท่านั้น แต่ยังสามารถสร้างรูปภาพพร้อมข้อความ และแม้แต่วิดีโอ AI ของผู้ใช้งานได้อีกด้วย แล้วบอกว่าคนที่ดูอยู่ไม่ควรพลาด โดยที่มีข้อความจาก Convert Software ผู้พัฒนาแอประบุว่า “รูปภาพที่ผลิตโดย Lisa AI ไม่เกี่ยวอะไรกับคนนี้”</p>\n<p>ตัวแทนของ Scarlett Johansson บอกกับ Variety ว่าตัว Scarlett ไม่เคยเป็นโฆษกให้กับแอปนี้เลย ส่วน Kevin Yorn ทนายของ Scarlett บอกว่าจะจัดสถานการณ์นี้ความสามารถทางกฎหมาย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e1c106583a82d8b9e2624e57b76f5d77.png\" /></p>\n<p>กรณีของการนำเสียง และหน้าตาของนักแสดงไปให้ AI สร้างนั้นเป็นประเด็นอยู่เรื่อย ๆ ซึ่งก่อนหน้ามีทั้งเรื่องที่ครอบครัวยินยอมอย่างในกรณีของ Cyberpunk 2077 <a href=\"https://www.blognone.com/node/136223\">ใช้ AI สร้างเสียงนักพากย์เกมที่เสียชีวิตไปแล้ว</a>, ลูกสาว Robin Williams นักแสดงผู้ล่วงลับ <a href=\"https://www.blognone.com/node/136053\">วิจารณ์การใช้ AI ที่สร้างเสียงของพ่อเธอขึ้นมาใหม่ว่า “มันรบกวนจิตใจ”</a> และ Tom Hanks โพสต์เตือนว่า<a href=\"https://www.blognone.com/node/136051\">มีคนทำวิดีโอใช้ AI Deepfake หน้าเหมือนเขา โปรโมตแผนทันตกรรม</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/40b750476c48dd1583b53b68c991bf3d.png\" /></p>\n<p>ที่มา - <a href=\"https://variety.com/2023/digital/news/scarlett-johansson-legal-action-ai-app-ad-likeness-1235773489/\">Variety</a> via <a href=\"https://www.theverge.com/2023/11/1/23942557/scarlett-johansson-ai-app-developers-lawsuit\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/hollywood\">Hollywood</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ace1aff6f1a6f665b4b8e000cdbc1fcd6846669e40bc219ca5522b6e0594e47f","category":"Thai"}