{"title":"iOS and Android Activations Now Split Evenly in the U.S., Research Shows","link":"https://www.macrumors.com/2021/07/19/ios-and-android-activations-now-split-evenly-in-the-u-s-research-shows/","date":1626701160000,"content":"Activations of iOS and Android devices are now evenly split in the United States, with little sign of movement toward either platform dominating over the past two years, according to data sourced by <a href=\"https://www.cirpllc.com\">Consumer Research Intelligence Partners</a> (CIRP).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/11/iPhone-12-v-Android-2020.jpg\" />\r\n<br />\r\nCIRP estimates that iOS and Android each had 50 percent of new smartphone activations in the year ending this quarter. iOS's share of new smartphone activations climbed from 2017 to 2020, but has now remained at its peak level for a second consecutive year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/cirp-2021-ios-android-activations-share.jpg\" />\r\n<br />\r\nCIRP Partner and Co-Founder Josh Lowitz said that the finding is significant because for several years, Android smartphones \"had a significant edge, with over 60 percent of customers opting for an Android phone in most quarters. In the past couple of years, though, iOS has closed the gap, and now splits the market with Android.\"\r\n<br />\r\n\r\n<br />\r\nBoth Android and iOS users have had a high level of loyalty historically. Android loyalty has varied very slightly, in a narrow range of 90 to 93 percent in the past four years. iOS loyalty, on the other hand, has gradually increased over the past four years, from a low of 86 percent in early 2018 to 93 percent in the most recent quarter ending in June 2021.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/cirp-2021-ios-android-loyalty.jpg\" />\r\n<br />\r\nLoyalty and tendency to switch platforms may explain some of the change in the share of new smartphone activations, where iOS has gained loyalty in a market with a limited amount of switching. CIRP Partner Mike Levin explained:<blockquote>In the most recent quarter, Apple had an edge in loyalty, with 93 percent of prior <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> owners upgrading to a new ‌iPhone‌, compared to 88 percent of Android owners staying with Android. Over several years, iOS gained about five percentage points in loyalty, while Android remained flat. This allowed Apple to steadily increase the iOS share of new smartphone activations.</blockquote>CIRP's latest data was based on a survey of 500 U.S. subjects that activated a new or used smartphone in the period from April to June this year. Given the small sample size, there is certainly some margin of error to these numbers, but the data provides a reliable look at activations and loyalty over time as it uses the same survey each quarter.<div>Tags: <a href=\"https://www.macrumors.com/guide/cirp/\">CIRP</a>, <a href=\"https://www.macrumors.com/guide/android/\">Android</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/19/ios-and-android-activations-now-split-evenly-in-the-u-s-research-shows/\">iOS and Android Activations Now Split Evenly in the U.S., Research Shows</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-and-android-activations-now-split-evenly-in-the-u-s-research-shows.2304739/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=s8lTpaylSfI:nh95T6l5SqM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=s8lTpaylSfI:nh95T6l5SqM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/s8lTpaylSfI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ace2b242cbe5fdf2fa686582df1812c83808e046e69abf4008a138c302559655","category":"Apple"}