{"title":"The Prevalence and Risk Analysis of Cerebral Palsy in Children with Low Birth weight in Taiwan: A Nationwide Population-Based Cohort Study","link":"https://www.preprints.org/manuscript/202404.0691/v1","date":1712746194000,"content":"This study aimed to evaluate the early-childhood comorbidities of cerebral palsy (CP) in children with low birth weight (LBW) and assess the impact of maternal bio-psychosocial factors on the risk of CP in preterm infants across varying birth weights. Data for 15,181 prematurely born infants from 2009 to 2013 and 151,810 matched controls from Taiwan's National Health Insurance Research Database were analyzed. Period prevalence of CP, and comorbidities of LBW were verified, and odds ratios (ORs) were calculated. Results confirmed that increasing prematurity and low birth weight (LBW) rates in Taiwan. LBW was associated with higher CP prevalence. Maternal age extremes (&amp;lt;20 and &amp;gt;40 years) were significant risk factors of CP in LBW infants. LBW infants showed higher risks of respiratory, circulatory, and nervous system and psycho-developmental comorbidities compared to controls. Infants with the lowest birth weights had even higher ORs for these comorbidities. However, gastrointestinal and nutritional comorbidities were less prevalent in premature infants. Maternal factors such as family income, number of hospital admissions, and length of hospital stay were significantly correlated with birth weight and subsequent complications. Each additional gestational week significantly reduced the risk of complications in premature infants. Additionally, maternal bio-psychosocial factors were associated with birth weight and related outcomes in premature infants, emphasizing the importance of addressing these factors in prenatal care and interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ace990ce9fe253b2d528b951b7812f11fee276fd449577dc168bb574cc7a9025","category":"Interdisciplinary"}