{"title":"Project Alaska: Apple's Second-Generation Vision Pro Headset","link":"https://www.macrumors.com/2023/11/10/project-alaska-second-generation-vision-pro/","date":1699653623000,"content":"Over the last several months, we've heard reports that Apple is <a href=\"https://www.macrumors.com/2023/10/09/vision-pro-2-focusing-on-size-weight-lenses/\">working on a second-generation AR/VR headset</a>, although there have been few details shared about the device. <em>MacRumors</em> has now received new information about the project, giving us some insight into the design and hardware of the successor to the Vision Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Orange.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe second-generation <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> headset, known internally under the codename Project Alaska and device identifier N109, bears striking resemblance to the first-generation Vision Pro announced at WWDC 2023. While the device maintains the curved aesthetic and button placement of the first Vision Pro, the speaker placement is expected to be different. \r<br />\n\r<br />\nEarly designs of the second-generation Apple headset do not include the rounded areas that house the speakers on the first-generation model. Instead, the headset features temples that are flat and uniform throughout their entire length. Documentation related to the Alaska project contains references to a non-descript audio accessory, possibly an external speaker. At one point in development, there were two different design configurations for the top vents – one being the same as the vents on the first-generation ‌Apple Vision Pro‌, and the latter featuring two clusters of tiny speaker-type holes.\r<br />\n\r<br />\nAnother key difference has to do with the rear straps. The second-generation headset features straps that are simpler in design and appearance, being somewhat reminiscent of the flat straps commonly found on laptop bags or backpacks. Prior rumors have suggested that the next Apple headset could be cheaper than the Vision Pro, and the design of the rear straps on the second-generation headset lends some credence to this theory. More streamlined straps would presumably be easier to mass produce, perhaps resulting in a lower overall price for end consumers. \r<br />\n\r<br />\nAlong with the possibility of an audio accessory, information from our sources suggests that Apple has plans for an external battery pack, similar to the battery pack used for the first-generation ‌Apple Vision Pro‌.\r<br />\n\r<br />\nIn terms of hardware, the second-generation Vision Pro will continue to include an array of cameras and sensors similar to those in the first headset. To be more specific, the device will feature a compass, ambient light sensor, magnetometer, and gyroscope, all of which are already present in the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. For connectivity, the second generation Apple headset will support Wi-Fi, Bluetooth 5, and ultra-low latency audio (ULLA).\r<br />\n\r<br />\nKey hardware components of the second-generation Apple headset:\r<br />\n\r<br />\n<ul>\r<br />\n<li>2 micro-OLED displays</li>\r<br />\n<li>1 TrueDepth camera</li>\r<br />\n<li>4 computer vision (CV) cameras</li>\r<br />\n<li>2 RGB cameras</li>\r<br />\n<li>2 low light infrared illuminators</li>\r<br />\n<li>Semi-automatic interpupillary distance (IPD) adjustment</li>\r<br />\n<li>Compass, ambient light sensor, magnetometer, accelerometer, gyrocope</li>\r<br />\n</ul>\r<br />\n\r<br />\nCurrent information indicates that the second-generation Apple headset is scheduled for the product validation testing (PVT) stage of development in 2025, suggesting a release date of late 2025 or early 2026. The information we've shared comes from a reliable source that has provided us with details about Apple's plans in the past, but it is worth noting that this is pre-production information and Apple's plans could change before final mass production begins on the second-generation headset. \r<br />\n\r<br />\nFor more information on the current ‌Apple Vision Pro‌, check out our <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">dedicated Vision Pro roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/10/project-alaska-second-generation-vision-pro/\">Project Alaska: Apple's Second-Generation Vision Pro Headset</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/project-alaska-apples-second-generation-vision-pro-headset.2410615/\">Discuss this article</a> in our forums<br /><br />","author":"Marko Zivkovic","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"acf27a73e478166dcb46e1653e991b204f4473f2957cc134d50dfb930e32d258","category":"Apple"}