{"title":"Virgin Galactic’s president explains how VSS Unity is now flying frequently","link":"https://arstechnica.com/?p=1963698","date":1693308644000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/Second_Spaceflight_Rocket_Motor_Burn-800x420.jpg\" alt=\"A rocket launches.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/Second_Spaceflight_Rocket_Motor_Burn.jpg\">Enlarge</a> <span>/</span> In February 2019, Virgin Galactic's SpaceShipTwo reached space for the second time in 10 weeks. (credit: <a href=\"https://www.virgingalactic.com/\">Virgin Galactic</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, Virgin Galactic <a href=\"https://press.virgingalactic.com/virgin-galactic-announces-flight-window-for-third-commercial-spaceflight\">announced</a> that it will conduct its next commercial spaceflight, Galactic 03, as early as September 8. This will be the company's third commercial spaceflight, and it will carry three as-yet-unnamed passengers who bought their tickets on the company's space plane back in the early 2000s.</p>\n<p>Should the flight occur in early September, it will mark the company's fourth spaceflight in four months, an impressive cadence after a fairly long downtime. Such a flight would also cement Virgin Galactic's leadership in the suborbital space tourism race with Blue Origin, which has been grounded for nearly a year after a launch accident with its New Shepard System <a href=\"https://arstechnica.com/science/2023/03/blue-origin-provides-a-detailed-analysis-of-its-launch-failure/\">nearly a year ago</a>.</p>\n<p>To understand why there was such a long downtime after Sir Richard Branson's flight on Virgin Galactic in 2021 and to learn how the company has reached a monthly flight cadence, I recently had a long interview with Mike Moses, the company's chief of operations and president. Moses came to Virgin Galactic in 2011 from NASA, where he worked as a flight director and then as a senior leader of the Space Shuttle program.</p></div><p><a href=\"https://arstechnica.com/?p=1963698#p3\">Read 44 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1963698&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"acf4b344647eb908821ea101048c4200439edc292ba885802774b65422803587","category":"Tech"}