{"title":"Transcriptional factor MdESE3 controls fruit acidity by activating genes regulating malic acid content in apple","link":"https://academic.oup.com/plphys/article/196/1/261/7675983?rss=1","date":1715904000000,"content":"<span><div>Abstract</div>Acidity is a key factor controlling fruit flavor and quality. In a previous study, combined transcriptome and methylation analyses identified a P<sub>3A</sub>-type ATPase from apple (<span>Malus domestica</span>), MdMa11, which regulates vacuolar pH when expressed in <span>Nicotiana benthamiana</span> leaves. In this study, the role of MdMa11 in controlling fruit acidity was verified in apple calli, fruits, and plantlets. In addition, we isolated an APETALA2 domain-containing transcription factor, designated MdESE3, based on yeast one-hybrid (Y1H) screening using the <span>MdMa11</span> promoter as bait. A subcellular localization assay indicated that MdESE3 localized to the nucleus. Analyses of transgenic apple calli, fruits, and plantlets, as well as tomatoes, demonstrated that MdESE3 enhances fruit acidity and organic acid accumulation. Meanwhile, chromatin immunoprecipitation quantitative PCR, luciferase (LUC) transactivation assays, and GUS reporter assays indicated that MdESE3 could bind to the ethylene-responsive element (ERE; 5สน-TTTAAAAT-3สน) upstream of the <span>MdMa11</span> transcription start site, thereby activating its expression. Furthermore, <span>MdtDT</span>, <span>MdDTC2</span>, and <span>MdMDH12</span> expression increased in apple fruits and plantlets overexpressing <span>MdESE3</span> and decreased in apple fruits and plantlets where <span>MdESE3</span> was silenced. The ERE was found in <span>MdtDT</span> and <span>MdMDH12</span> promoters, but not in the <span>MdDTC2</span> promoter. The Y1H, LUC transactivation assays, and GUS reporter assays indicated that MdESE3 could bind to the <span>MdtDT</span> and <span>MdMDH12</span> promoters and activate their expression. Our findings provide valuable functional validation of <span>MdESE3</span> and its role in the transcriptional regulation of <span>MdMa11</span>, <span>MdtDT</span>, and <span>MdMDH12</span> and malic acid accumulation in apple.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"acf6320588ca75a0d589c26568c6425fd9af6b3c23e4af102e66ede1db6ba65c","category":"Environment"}