{"title":"170 Understanding how zinc and manganese interact with the hormones found in anabolic implants to alter growth of bovine satellite cells","link":"https://academic.oup.com/jas/article/102/Supplement_3/210/7757481?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>It has been well established in both in vitro and in vivo models that the hormones found in anabolic implants [estradiol (E2) and trenbolone acetate (TBA)] positively impact skeletal muscle growth. Previous research has demonstrated that treating primary bovine satellite cells (BSC) with E2 or TBA results in increases in proliferation and protein synthesis and decreases in protein degradation, leading to enhanced skeletal muscle growth. This improved skeletal muscle growth occurs through partially defined pathways, but many unknowns remain. More recently, research has emerged demonstrating that strategic supplementation of specific trace minerals (TM) may further augment the positive effects of E2 and TBA on skeletal muscle growth. There are many ways through which the complex signaling pathways induced by the hormones found in anabolic implants may interact with TM to further enhance skeletal muscle growth. Zinc (Zn) and manganese (Mn) are two of the TM that we have recently investigated. Zinc is the most utilized metal in biological processes and supports animal growth through critical roles in the functions of IGF-1, GH, and DNA synthesis. Manganese is an essential TM providing catalytic activity to enzymes involved in protein glycosylation, nitrogen metabolism, and antioxidant capacity. However, additional research is needed to determine if hormones and TM interact to impact growth of skeletal muscle, specifically. As such, the goal of recent research that has been conducted by our group is to utilize an in vitro primary BSC model to determine whether hormones and TM interact to alter differentiation and protein synthesis. Preliminary research from our group assesses the impacts of varying, physiological concentrations of Zn or Mn on differentiation and protein synthesis of primary BSC cultures that have also been treated with or without the hormones found in anabolic implants. These preliminary findings demonstrate that while there seems to be no interaction between Zn and hormones in differentiating BSC, supplemental Zn on the higher end of physiologically relevant concentrations has a positive effect on signaling pathways involved in growth, protein turnover, skeletal muscle differentiation, and mineral transporters. However, it appears that Zn and Mn each interact with hormones to positively augment protein synthesis in primary BSC cultures. A deeper understanding of the relationship these TM and others may have with hormones will allow for more strategic supplementation practices that can potentially improve skeletal muscle growth.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"acfa3416251804daf1cb8e4254992bd7deba3267ede3800208481280df10e17b","category":"Environment"}