{"title":"Sports Tech Tidbits: Whoop’s Adds Strength Training, Garmin eBike Varia eRTL615 Radar, Wahoo’s RGT Elite Sterzo Support","link":"https://www.dcrainmaker.com/2023/04/sports-tech-tidbits-whoops-adds-strength-training-garmin-ebike-varia-ertl615-radar-wahoos-rgt-elite-sterzo-support.html","date":1682586689000,"content":"<p>We’ve got three tidbits of sports tech coming in today, from three very different realms. First up is the oft-rumored and finally here addition of Strength Training to the Whoop platform. Then there’s Garmin launching a wired version of their Varia cycling radar for eBikes, and then finally out of left field we’ve got Wahoo’s RGT cycling platform adding support for the Elite Sterzo Smart, which allows turning within the game.</p>\n<p>So let’s jump straight into it.</p>\n<h3><span>Whoop Adds Strength Training:</span></h3>\n<p>Whoop has added a huge new suite focused on strength training to their app, which includes guided step-by-step elements, as well as tracking of those elements into the app. Previously, when you did a strength training workout, it was basically just a heart rate graph. Now, each portion of the set is fully categorized. There’s also small videos for each movement, showing how to complete them. There’s also pre-built routines to follow.</p>\n<p>You’ll access the strength portion via the ‘Coaching’ tab at the bottom, and then ‘Strength Trainer’. From there you can choose a pre-canned routine or build your own:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3407.png\"><img title=\"IMG_3407\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3407_thumb.png\" alt=\"IMG_3407\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3406.png\"><img title=\"IMG_3406\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3406_thumb.png\" alt=\"IMG_3406\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3408.png\"><img title=\"IMG_3408\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3408_thumb.png\" alt=\"IMG_3408\" width=\"237\" height=\"510\" /></a></p>\n<p>The builder seems to offer a lot of movements, and the UI itself looks pretty good. However, there isn’t an easy way to quickly add repeating sets without doing a lot of search/rinse/repeat.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3415.png\"><img title=\"IMG_3415\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3415_thumb.png\" alt=\"IMG_3415\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3423.png\"><img title=\"IMG_3423\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3423_thumb.png\" alt=\"IMG_3423\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3410.png\"><img title=\"IMG_3410\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3410_thumb.png\" alt=\"IMG_3410\" width=\"237\" height=\"510\" /></a></p>\n<p>The app will then try and give you a breakdown of both your muscular load and your cardio load. One of the big complaints of Whoop (somewhat ironically given the biggest supporters of Whoop are gym-based folks) is can’t really account for non-cardio load very well (lifting where the HR lags or doesn’t spike). This aims to account for that.</p>\n<p>Speaking of which, I’ve been travelling the past two days, so I haven’t had a chance to dig into this as deeply – however, <a href=\"https://www.youtube.com/watch?v=je1V8RVDM2Q\">FitGearHunter</a> has, and I generally find his opinions pretty on-point when it comes to tech bits in the strength/gym realm. Check out this long-form video where he dives into the feature in quite a bit of depth:</p>\n<p></p>\n<p>Certainly, some of this is coming from some of the acquisitions that Whoop has made in this space. But I think there’s also an element here where Whoop is realizing it has to create more value for the rather high monthly price of the subscription. We saw them <a href=\"https://www.dcrainmaker.com/2023/02/subscription-features-lifetime.html\">recently reduce prices</a> (at a time when everyone else is increasing prices). As usual, there are two basic ways to increase perceived value in a product: Reduce prices, or increase functionality/feature. Whoop has selected both.</p>\n<h3><span>Garmin eBike Varia eRTL615 Radar:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/20221219_Social_FIT_5997.jpg\"><img title=\"20221219_Social_FIT_5997.jpg\" src=\"https://media.dcrainmaker.com/images/2023/04/20221219_Social_FIT_5997_thumb.jpg\" alt=\"20221219_Social_FIT_5997.jpg\" width=\"720\" height=\"480\" /></a></p>\n<p>Next up, Garmin has just announced/released an always-powered Varia radar designed for eBike. This new unit is designed to be compatible with various existing bike power systems, allowing relatively easy integration for eBike manufactures. Varia radar is Garmin’s cycling-focused radar that’s been around a number of years, and alerts cyclists to overtaking vehicles (or mopeds, or even an airplane in the right circumstances). Anything overtaking the cyclist is alerted.</p>\n<p>Garmin’s new Varia eRTL615 radar uses power from the eBike battery system, via wires. This is roughly similar to the Varia radar system that Garmin made in conjunction with Cannondale for <a href=\"https://www.dcrainmaker.com/2023/02/cannondale-smartsense-synapse-1-rle.html\">Cannondale’s SmartSense series of connected bikes</a>. In that scenario, the power for the Varia radar came from a much smaller USB-like battery bank on the frame that also powered front and rear bike lights. Most e-bikes already have front and rear bike lights that are powered via the larger battery. From a power standpoint, the Varia radar is a trivial power draw compared to the beastly power draw of the motor on a typically large large eBike battery.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1001.jpg\"><img title=\"Varia-eRTL615_HR_1001\" src=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1001_thumb.jpg\" alt=\"Varia-eRTL615_HR_1001\" width=\"237\" height=\"237\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1004.jpg\"><img title=\"Varia-eRTL615_HR_1004\" src=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1004_thumb.jpg\" alt=\"Varia-eRTL615_HR_1004\" width=\"237\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1000.jpg\"><img title=\"Varia-eRTL615_HR_1000\" src=\"https://media.dcrainmaker.com/images/2023/04/Varia-eRTL615_HR_1000_thumb.jpg\" alt=\"Varia-eRTL615_HR_1000\" width=\"237\" height=\"237\" /></a></p>\n<p>Like many things eBike, there tends to be a price premium just because. In this case, the prices are as follows:</p>\n<p>– No cable included*: $299<br />\n– Bosch cable included: $329<br />\n– Shimano cable included: $329<br />\n– USB-A cable included: $329</p>\n<p>That’s essentially double the price of Garmin’s battery-included <a href=\"https://www.dcrainmaker.com/2020/05/garmin-rtl515-rvr315-cycling-radar-review.html\">Varia RTL-515 light/radar combo unit</a> (which is list price $199, but often just $149). I’m not entirely sure how a battery version is somehow cheaper than a non-battery version…but Garmin also probably knows consumers will almost never buy this unit outright. Instead, it’ll just come on their bike, like in the Cannondale scenario.</p>\n<p><em>(*This no-cable model appears exactly like what Garmin did with their newish <a href=\"https://www.dcrainmaker.com/2022/07/garmin-edge-explore-2-in-depth-review.html#edge-power-mount-bundle\">Edge power mount</a>, and is actually compatible directly out of the box with the Cannondale canbus system. It’s not terribly clear to me what other platforms use the same wiring system as-is.)</em></p>\n<p>Speaking of which, while most road bike users of Garmin’s Varia radar tend to use dedicated cycling GPS units/watches (like a Garmin Edge GPS, Wahoo ELEMNT, etc…), in an e-bike scenario, most users are probably going to be using either their phone with an app, or a built-in display. Garmin has a Varia radar app already, along with 3rd party access on both the ANT+ &amp; Bluetooth Smart side. Meaning that companies can easily utilize the ANT+ spec to connect to the radar as many do today already. Or, they can use Garmin’s more proprietary Bluetooth Smart option within an app.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/20221219_Social_FIT_5863.jpg\"><img title=\"20221219_Social_FIT_5863.jpg\" src=\"https://media.dcrainmaker.com/images/2023/04/20221219_Social_FIT_5863_thumb.jpg\" alt=\"20221219_Social_FIT_5863.jpg\" width=\"720\" height=\"480\" /></a></p>\n<p>As the owner of two cargo eBikes (<a href=\"https://www.dcrainmaker.com/2022/06/cargo-bike-amsterdam-race-report-power.html\">that we also race…</a>), I’d definitely be open to giving this a whirl. I don’t typically cycle the cargo bikes with a dedicated bike GPS computer, I do have a phone mount there. In theory there should be an extra power port available on the Bosch power system that Urban Arrow uses, so it should be technically possible. Would be a fun experiment.</p>\n<p>Obviously, within the city of Amsterdam, cycling radar doesn’t tend to be super useful in relation to cars – mainly because so much of my day-to-day cargo biking tends to be on dedicated paths.  While mopeds are allowed on some bikes paths, and do overtake, you generally hear them coming, and some non-majority portion of the time they’re even polite about  the pass.</p>\n<p>In any case, perhaps more to come!</p>\n<h3><span>Wahoo RGT gets Elite Sterzo Smart Support:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/EliteSterzoSmart.jpg\"><img title=\"EliteSterzoSmart\" src=\"https://media.dcrainmaker.com/images/2023/04/EliteSterzoSmart_thumb.jpg\" alt=\"EliteSterzoSmart\" width=\"720\" height=\"480\" /></a></p>\n<p>This last one will be a quickie! Wahoo has quietly added support for the <a href=\"https://www.dcrainmaker.com/2020/08/zwift-steering-elite-sterzo-smart.html\">Elite Sterzo Smart turning block/platform</a> to RGT. You’ll remember back a number of months ago they released their own <a href=\"https://www.dcrainmaker.com/2023/02/wahoo-kickr-steer-in-depth-review.html\">Wahoo KICKR STEER handlebar turning system/hardware</a> for RGT. While technically a fine piece of sorta-pricey hardware, many (including myself) questioned why Wahoo didn’t just leverage existing hardware options on the market. Or at least provide compatibility.</p>\n<p>So, they’ve answered those calls (or complaints as it were), and done just that. In their latest app update, you’ll notice a line-item mentioning Elite Sterzo Smart support:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_3401.jpg\"><img title=\"IMG_3401\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_3401_thumb.jpg\" alt=\"IMG_3401\" width=\"357\" height=\"770\" /></a></p>\n<p>I haven’t had a chance to give it a whirl as I’m travelling this week, but I presume it works in the same way it would on Zwift – or equally, the same way Wahoo’s steering works on RGT. If you do have a chance to try it out, drops some comments down below on how it all works.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"ad07ca071bcbfa18d93e177879ace1259121351d4e8640490eb467e68dd9d3ee","category":"Cycling"}