{"title":"Model-informed classification of broadband acoustic backscatter from zooplankton in an in situ mesocosm","link":"https://academic.oup.com/icesjms/article/81/7/1371/7460294?rss=1","date":1701907200000,"content":"<span><div>Abstract</div>Classification of zooplankton to species with broadband echosounder data could increase the taxonomic resolution of acoustic surveys and reduce the dependence on net and trawl samples for ‘ground truthing’. Supervised classification with broadband echosounder data is limited by the acquisition of validated data required to train machine learning algorithms (‘classifiers’). We tested the hypothesis that acoustic scattering models could be used to train classifiers for remote classification of zooplankton. Three classifiers were trained with data from scattering models of four Arctic zooplankton groups (copepods, euphausiids, chaetognaths, and hydrozoans). We evaluated classifier predictions against observations of a mixed zooplankton community in a submerged purpose-built mesocosm (12 m<sup>3</sup>) insonified with broadband transmissions (185–255 kHz). The mesocosm was deployed from a wharf in Ny-Ålesund, Svalbard, during the Arctic polar night in January 2022. We detected 7722 tracked single targets, which were used to evaluate the classifier predictions of measured zooplankton targets. The classifiers could differentiate copepods from the other groups reasonably well, but they could not differentiate euphausiids, chaetognaths, and hydrozoans reliably due to the similarities in their modelled target spectra. We recommend that model-informed classification of zooplankton from broadband acoustic signals be used with caution until a better understanding of <span>in situ</span> target spectra variability is gained.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"ad0b5dc290eb1466e1ba5a0235d015b71901283a214375c6de406c5da49b8308","category":"Environment"}