{"title":"Leveraging the genetic diversity of trout in the rivers of the British Isles and northern France to understand the movements of sea trout (Salmo trutta L.) around the English Channel","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13759?af=R","date":1721631600000,"content":"<h2>Abstract</h2>\n<p>Populations of anadromous brown trout, also known as sea trout, have suffered recent marked declines in abundance due to multiple factors, including climate change and human activities. While much is known about their freshwater phase, less is known about the species' marine feeding migrations. This situation is hindering the effective management and conservation of anadromous trout in the marine environment. Using a panel of 95 single nucleotide polymorphism markers we developed a genetic baseline, which demonstrated strong regional structuring of genetic diversity in trout populations around the English Channel and adjacent waters. Extensive baseline testing showed this structuring allowed high-confidence assignment of known-origin individuals to region of origin. This study presents new data on the movements of anadromous trout in the English Channel and southern North Sea. Assignment of anadromous trout sampled from 12 marine and estuarine localities highlighted contrasting results for these areas. The majority of these fisheries are composed predominately of stocks local to the sampling location. However, there were multiple cases of long-distance movements of anadromous trout, with several individuals originating from rivers in northeast England being caught in the English Channel and southern North Sea, in some cases more than 1000 km from their natal region. These results have implications for the management of sea trout in inshore waters around the English Channel and southern North Sea.</p>","author":"R. Andrew King, \nCharlie D. Ellis, \nDorte Bekkevold, \nDennis Ensing, \nThomas Lecointre, \nDaniel R. Osmond, \nAdam Piper, \nDylan E. Roberts, \nSophie Launey, \nJamie R. Stevens","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"ad0b8349103f1963fca7949f01adf4e1ff4f0362aa7c114ae39487ebee5dffc4","category":"Environment"}