{"title":"Identification and Expression Analysis of Long Noncoding RNAs in Response to Infection with VHSV in Rainbow Trout","link":"https://www.preprints.org/manuscript/202405.0899/v1","date":1715679469000,"content":"Viral contamination in the aquaculture industry is a significant challenge that requires further research. Emerging evidence suggests that long noncoding RNAs (lncRNAs) play a role in regulating various biological processes, including immunity. However, most studies have focused on model organisms, and little is known about non-coding RNAs in the immune response to viral hemorrhagic septicemia (VHS) in rainbow trout. In this study, we investigated the listing of non-coding RNAs (ncRNAs) in rainbow trout challenged with VHS virus. We explored their potential role in defense-like responses based on transcriptomic analysis of the virus-treated and control groups. As a result of this research, 4207 lncRNAs were identified, of which 182 lncRNAs were differentially expressed between treated and untreated samples. Among 7753 lncRNA transcripts, 1920 were novel intergenic (class code “u”), and 3748 transcripts were potentially novel isoform of lncRNAs. Gene ontology analysis revealed biological pathways associated with the stress response and immune signaling. Pairs of genes such as TP63-MSTRG.62, IL10-MSTRG.9783, IL10-MSTRG.9784, TK1-MSTRG.22826, and MSTRG.17881-GLI1 showed cis interactions, while DOCK10-MSTRG.30015, MSTRG.36357-LOC101268921, and MSTRG.34190-ENPP2 showed trans interactions. In this study, the role of lncRNAs in regulating the expression of the target genes was clearly identified. This finding is consistent with the regulatory processes of immune system responses mediated by cytokines, as well as the regulation of oxygen levels in response to viral infection. The information presented here highlights the various regulatory mechanisms of lncRNAs in the expression of immune system genes in fish treated with VHS virus.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ad0e1d5d5991adf20251ca55efe841d5dd1bc82c4a210b457cb4407357871381","category":"Interdisciplinary"}