{"title":"Everything the iPhone 15’s USB-C port can do (and what you’ll need to do it)","link":"https://www.macworld.com/article/2084068/what-can-iphone-15-usb-c-port-do.html","date":1695899700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’ve bought one of Apple’s late 2023 phones (and gone through our list of the first 7 things to do with it) you’re probably wondering about the new port at the bottom. The Lightning port, which arrived on the iPhone 5 in 2012, has finally been replaced by the non-proprietary USB-C standard, which means it’s compatible with a wider range of cables, chargers, and other accessories.</p>\n\n\n\n<p>But what specifically can the new USB-C port be used for? What are its charging and data transfer speeds? What other products is it compatible with, and does it perform better with official Apple-certified accessories? In this article, we outline the capabilities and limitations of USB-C in the 15-series iPhones.</p>\n\n\n\n<h2>Charging</h2>\n\n\n\n<p>By far the most common use of your iPhone’s USB-C port will be for wired charging, which is faster and more power-efficient than charging wirelessly. MagSafe is capped at 15W, whereas charging via a USB-C cable should be able to achieve 20W or more (depending on your iPhone model and other bottlenecks).</p>\n\n\n\n<p>You’ll need a USB-C cable and a compatible power adapter. (The 15-series iPhones each come with a cable with USB-C on both ends, but no power adapter. You’ll need to <a href=\"https://www.macworld.com/article/675381/which-power-adapter-do-i-need-to-charge-my-iphone.html\">provide that yourself</a>.) The new iPhones are capable of fast charging–or what Apple describes as fast charging, there being no widely agreed standard for what that means–but you’ll need a power adapter rated at 20W or higher. If you can set that up, Apple claims the iPhone 15 and 15 Pro will charge up to 50 percent capacity in 30 minutes, and the iPhone 15 Plus and 15 Pro Max in 35 minutes.</p>\n\n\n\n<p>In fact, Macworld testing (using the bundled cable and a high-powered 67W MacBook power adapter) suggests Apple is being somewhat modest about the charging speed limit: our sample iPhone 15 Plus had reached 64 percent charge after the specified 35 minutes. It took 92 minutes to completely charge from empty.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Iphone 15 pro usb c\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?quality=50&amp;strip=all 2274w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?resize=300%2C225&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?resize=768%2C576&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?resize=1200%2C900&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?resize=1536%2C1152&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Iphone-15-pro-usb-c.jpg?resize=2048%2C1536&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"900\" /><figcaption><p>The iPhone 15’s USB-C cable can do a lot more than the older Lightning models.</p></figcaption></figure><p>Petter Ahrnstedt</p></div>\n\n\n\n<h2>Reverse charging</h2>\n\n\n\n<p>This is a new capability for the iPhone line: the 15-series handsets can themselves charge up other, smaller devices. Connect your iPhone 15 to an Apple Watch, an AirPods case, or another compatible product, and power will flow in the other direction. (So make sure the iPhone has enough charge to absorb the hit.)</p>\n\n\n\n<p>For this function, you probably won’t need to buy any extra cables. Current and recent Apple Watch models come with charging pucks that have USB-C on the other end, and you can easily charge your AirPods using either USB-C to USB-C or USB-C to Lightning, depending on which case you’ve got.</p>\n\n\n\n<p>On a technical level, reverse charging is slower than regular charging. Apple says you’ll need the small device to support USB Power Delivery at up to 4.5W. But with such devices, even a relatively small transfer of charge can make all the difference. In testing, we found that just 15 minutes of reverse charging was enough to bump an Apple Watch Series 8 from 53 percent to 68 percent, while the connected iPhone 15 Plus dropped from 100 percent to 97 percent. You’re gaining about a point per minute, while the losses on the iPhone side are proportionately far smaller.</p>\n\n\n\n<h2>Connect to iPad, Mac, or PC</h2>\n\n\n\n<p>Data transfer, like charging, is quicker if you use a cable. AirDrop may be more convenient, but when batch-transferring photos and videos from your iPhone to your Mac, for example, we’d advise plugging them in. Most modern Macs and all current iPads have at least one USB-C port, so you can connect your iPhone using the USB-C cable from the box, though your mileage may vary with PCs.</p>\n\n\n\n<p>Transfer speeds vary depending on whether you paid extra for a Pro model. The iPhone 15 and 15 Plus support the USB 2 standard, which has a theoretical limit of 480Mbps. The 15 Pro and 15 Pro Max, meanwhile, support USB 3 and, assuming you’ve got a USB 3-compatible cable to take advantage of this, speeds of up to 10Gbps. (The cable supplied by Apple tops out at 480Mbps.)</p>\n\n\n\n<p>As an added bonus, your iPhone will charge while connecting to one of these larger devices.</p>\n\n\n\n<h2>Connect to an external storage device</h2>\n\n\n\n<p>Like transferring files to an iPad or Mac, the iPhone 15 can also connect to <a href=\"https://www.macworld.com/article/668458/best-external-ssd-for-mac.html\">external storage drives</a>. In fact, if you have a 128GB iPhone 15 Pro, you have to record directly to an external drive in order to record 4K ProRes videos, which take up oodles of gigabytes. Higher configurations don’t have this limitation and can save ProRes video directly to the device.</p>\n\n\n\n<h2>Connect to displays and TVs</h2>\n\n\n\n<p>The USB-C standard makes it much easier to connect your iPhone to a TV, monitor or other display, and view your photos and videos on a larger screen. But it isn’t necessarily as straightforward as plugging in a cable.</p>\n\n\n\n<p>If it’s a USB-C display, of course, you can use a standard USB-C cable to connect the iPhone to the display. (Apple says the 15-series iPhones use DisplayPort to support up to 4K and 60Hz on compatible displays.) If you want to benefit from high resolutions, however, you’ll want to use a cable that supports USB 3.1 or higher. A USB-C display <em>may</em> also charge a connected iPhone, but this varies from model to model.</p>\n\n\n\n<p>If the display or TV is based on HDMI, you’ll need some sort of adapter (such as Apple’s own USB-C Digital AV Multiport Adapter – <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2084068-1-0-0&amp;u=https://www.apple.com/us/shop/product/MUF82AM/A/usb-c-digital-av-multiport-adapter\" target=\"_blank\">US store link</a>/<a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2084068-1-0-0&amp;u=https://www.apple.com/uk/shop/product/MUF82ZM/A/usb-c-digital-av-multiport-adapter\" target=\"_blank\">UK store link</a>) or a USB-C to HDMI cable. Provided your cable/adapter supports HDMI 2.0, the iPhone will be able to output video at 4K and 60Hz.</p>\n\n\n\n<p>Either way, when you connect to an external display the iPhone will default to showing what is on its own screen. The exception is when you’re using an app that features a “second screen” mode, but those are much more common on the iPad.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4338975_original.jpg?quality=50&amp;strip=all\" alt=\"Apple verliert den Überblick: Studio Display-Update scheitert\" loading=\"lazy\" /><figcaption><p>The iPhone 15 can hook up to an Apple Studio DIsplay with just a USB-C cable.</p></figcaption></figure><p>Willis Lai/Foundry</p></div>\n\n\n\n<h2>Connect to audio devices</h2>\n\n\n\n<p>The iPhone 15 can connect to a wide range of audio accessories that are compatible with USB-C, whether input devices (such as microphones) or output (such as speakers or headphones). For some audio devices, you may need to get a USB-C to 3.5mm jack adapter.</p>\n\n\n\n<h2>Connect to other devices</h2>\n\n\n\n<p>The USB-C standard is astonishingly prevalent, and you may be surprised by the range of accessories you can now connect to your iPhone 15 without having to pay the “Apple Tax” for a Lightning-compatible or Apple-certified version. This includes external battery packs, SD adapters and hence SD cards, ethernet adapters, and even cars (although they still need to be CarPlay-compatible). In all of these cases, bear in mind that data transfer, if applicable, will be faster if you use an iPhone 15 Pro or Pro Max, and a cable/adapter/accessory that supports USB 3.0.</p>\n\n\n\n<p>You can even connect Lightning accessories to your iPhone 15… although in that case, you’ll need a <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2084068-1-0-0&amp;u=https://www.apple.com/shop/product/MUQX3AM/A/usb-c-to-lightning-adapter\" target=\"_blank\">dongle</a>. Plus ça change.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ad0ffa8ceb7bfa692e035ba16676677fd48e714c11df66ceae52a4f39f8719f6","category":"Apple"}