{"title":"Virtual prizes for virtual races: RGT Cycling to offer victors NFTs","link":"https://www.cyclist.co.uk/news/10207/rgt-cycling-becomes-first-virtual-platform-to-offer-nfts-as-prizes","date":1634917197000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>22 Oct 2021</span></div>    </div></div><p>\nNFT’s created as awards for men’s and women’s winners in pro, hand cycling and community races.</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/nft.jpeg?itok=WPeRBIBG\" />  </div>\n<div>\n      <p> Virtual platform RGT Cycling has announced it will be awarding NFTs, or non-fungible tokens, to victors in the Echelon Racing League.</p>\n<p>The league begins on the 20th November 2021 and will see 40 teams and 240 riders compete in the eight-round pro event on the free to use virtual cycling platform.</p>\n<p>Teammates will work together to compete across a variety of digital parcours. Races emulate those during the in-real-life Echelon events, including those from the US premier calendar.</p>\n<p>NFTs are unique digital assets that can be used to represent easily-reproducible items such as photos, videos and audio with blockchain technology validating proof of ownership.</p>\n<p>They have come under fire this year for their potential to <a href=\"https://www.theverge.com/2021/3/15/22328203/nft-cryptoart-ethereum-blockchain-climate-change\" target=\"_blank\">contribute to climate change</a>, although the scale of their impact varies and there have been moves to make them more sustainable.</p>\n<p>Eric Hill of Project Echelon said; ‘Issuing NFTs adds to the prizes and as they are awarded equally for winners of each series, we hope they will serve to introduce a new path for supporting and rewarding athletes’.</p>\n<p>Last year the event attracted teams such as Rally Cycling, Canyon eSports, Tibco Silicon Valley Bank Pro Cycling and the USA National Team.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/10117/rgt-cycling-flanders\">Ride like a world champ on RGT sim's new Flanders course</a></div>      <div><a href=\"/news/7897/indoor-training-platform-rgt-goes-completely-free-in-response-to-coronavirus\">Indoor training platform RGT goes completely free in response to coronavirus</a></div>    </div></div><p>\nThe Echelon Racing League will also be inclusive of Community events and a first of its kind para-cycling series, which is being developed in collaboration with the Paralyzed Veterans of America and USA Paracycling. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"ad141aa3d4784522acec0a0f1236fc82fea97788c71a77e4a0303516a55cb00e","category":"Cycling"}