{"title":"Quantum effects of D-Wave’s hardware boost its performance","link":"https://arstechnica.com/?p=1933111","date":1681933964000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/10/Screen-Shot-2019-10-01-at-12.13.03-PM.png\" alt=\"Image of large, black metal boxes that house D-Wave hardware.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/10/Screen-Shot-2019-10-01-at-12.13.03-PM.png\">Enlarge</a> <span>/</span> The D-Wave hardware is, quite literally, a black box. (credit: D-Wave)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Before we had developed the first qubit, theoreticians had done the work that showed that a sufficiently powerful gate-based quantum computer would be able to perform calculations that could not realistically be done on traditional computing hardware. All that is needed is to build hardware capable of implementing the theorists' work.</p>\n<p>The situation was essentially reversed when it came to <a href=\"https://docs.dwavesys.com/docs/latest/c_gs_2.html\">quantum annealing</a>. D-Wave started building hardware that could perform quantum annealing without a strong theoretical understanding of how its performance would compare to standard computing hardware. And, for practical calculations, the hardware has sometimes been outperformed by more traditional algorithms.</p>\n<p>On Wednesday, however, a team of researchers, some at D-Wave, others at academic institutions, is releasing a paper comparing its quantum annealer with different methods of simulating its behavior. The results show that actual hardware has a clear advantage over simulations, though there are two caveats: errors start to cause the hardware to deviate from ideal performance, and it's not clear how well this performance edge translates to practical calculations.</p></div><p><a href=\"https://arstechnica.com/?p=1933111#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933111&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ad1da7ed028e5017c2409d6079ac1dc880a2c74382b0a29425b4bc763d1cc985","category":"Tech"}