{"title":"A Farnesyl Pyrophosphate Synthase from Apostichopus japonicus Is Involved in Saponin Biosynthesis and Regulated by Immune Processes","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8849584?af=R","date":1723479529000,"content":"<p><i>Apostichopus japonicus</i> is one of the few animals that can synthesize saponins. Present understanding of saponin biosynthesis is often limited to genome analysis, leaving the precise mechanism still unclear. This study examined the potential role of a gene annotated as farnesyl pyrophosphate synthase (<i>FPS</i>) in saponin biosynthesis of <i>A. japonicus</i>. We amplified its complete cDNA (denoted as <i>AjFPS</i>) and produced its recombinant protein (rAjFPS) through rapid amplification of cDNA ends (RACE) and <i>Escherichia coli</i> expression system, respectively. RNA interference and correlation analysis of <i>AjFPS</i> transcriptional expression level and saponin content were conducted to evaluate the role of <i>AjFPS</i> in saponin biosynthesis. A pull-down assay was used to preliminarily explore its regulatory role in saponin biosynthesis. The complete cDNA sequence of <i>AjFPS</i> was shown to be 3,006 bp in length. The inferred amino acid sequence harbored two conserved aspartate-rich sites (DDXXD). Analysis of the amino acid sequence using phylogenetics showed that <i>AjFPS</i> was more similar to <i>FPS</i>s found in saponin-producing marine organisms rather than those in non-saponin-producing ones or plants. The knockdown of <i>AjFPS</i> resulted in a remarkable decline in saponin content. The temporal expression of <i>AjFPS</i> was significantly correlated with the variation in saponin content after <i>Vibrio splendidus</i> challenge. The pull-down analysis illustrated that AjFPS interacted directly or indirectly with diverse immune-related factors associated with pathogen recognition and destruction and protection against oxidative stress. Combined, these results suggested that <i>AjFPS</i> is involved in saponin synthesis, and this process in <i>A. japonicus</i> is likely modulated by immune processes, with <i>AjFPS</i> serving as a regulatory node. These findings will promote a deeper understanding of saponin synthesis and immune regulation as well as contribute to the improvement of saponin quality traits in cultured <i>A. japonicus</i>.</p>","author":"Pingzhe Jiang, \nZhong Chen, \nShan Gao, \nFeifei Zhang, \nLi Li, \nYujun Liu, \nPeipei Li, \nYao Xiao, \nYing Dong, \nGuiying Liu, \nJingwei Jiang, \nZunchun Zhou, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"ad22a80c36eb97d0e49c1af71f007a05736c963a4a9e75ba777626eb241aae9a","category":"Environment"}