{"title":"Reviving the Past for a Healthier Future: Ancient Molecules and Remedies as a Solution to the Antibiotic Crisis","link":"https://www.preprints.org/manuscript/202405.0208/v1","date":1714976220000,"content":"Available options to combat bacterial infections are getting scarce. We require innovative and imaginative approaches to enhance the identification and discovery of effective antimicrobials capable of combating bacteria resistant to multiple or all available drugs. These methods should either directly eliminate the resistant bacteria or influence their viability indirectly by inhibiting their virulence or reducing their resistance to antibacterial agents. One interesting approach is to analyze ancient remedies presumably used to treat bacterial infections, try formulating them, and test them against modern microbes. The field was recently named ancientbiotics. This approach allows us to take advantage of centuries of accumulated empirical knowledge, from several traditional medicines of various ancient cultures across the world.  The strategy has already resulted in promising formulations to combat the ESKAPE group of nosocomial pathogens. Moreover, molecular de-extinction consists of genome analysis of extinct species in the search for useful antimicrobials, such as peptides. The de-extinction of simple organisms such as bacteriophages may eventually become a resource for novel tools to combat multidrug-resistant bacteria. In this review, we summarize and discuss the reported antimicrobial effects of ancient remedies and de-extinct molecules known to modern science, and discuss possible new strategies to further harness the potential of past remedies and molecules to help us fight the rise of superbugs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ad253bd5dd10d570eb5b0c647ba991fd7a53092174f98cb794196dd8b6b23d57","category":"Interdisciplinary"}