{"title":"Microsoft Not Planning on Xbox Cloud Gaming App for iOS Because There's 'Not Room' for Monetization","link":"https://www.macrumors.com/2024/02/15/xbox-cloud-gaming-ios-microsoft/","date":1708041066000,"content":"Microsoft does not plan to bring an Xbox Cloud Gaming app to iOS at this time because there's no opportunity for monetization, Microsoft Gaming CEO Phil Spencer said in an interview with <em><a href=\"https://www.theverge.com/24073666/microsoft-gaming-phil-spencer-interview-ps5-switch-games\">The Verge</a></em>. When asked whether Apple's recent app ecosystem changes in the European Union make \"room\" for Xbox Cloud Gaming on iOS, Spencer said that monetization was an issue, and that the Digital Markets Act forcing Apple's updates does not \"go far enough to open up competition.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/09/App-Store-and-XCloud.jpg\" width=\"2250\" height=\"1266\" />\r<br />\n<blockquote>There's not room for us to monetize Xbox Cloud Gaming on iOS. I think the proposal that Apple put forward -- and I thought Sarah Bond's comments on this were right on -- doesn't go far enough to open up. In fact, you might even say they go the opposite direction in some way, but they definitely don't go far enough to open up competition on the world's largest gaming platform.\r<br />\n\r<br />\nWe will continue to work with regulators, and Apple and Google, to create a space for alternative storefronts. I'm a big fan of how Windows works, and you've got a Microsoft Store on Windows, you've got Steam, you've got the Epic Games Store, you've got GOG. You have alternatives, and I think alternative ways for people to buy things creates goodness for consumers and creators. I think the largest platform for gamers, which is mobile, should have the same.</blockquote>\r<br />\nSpencer said that earlier comments <a href=\"https://twitter.com/BondSarah_Bond/status/1752083596318593238\">from Xbox President Sarah Bond</a> were \"right on.\" Back in January, Bond said that Apple's policy is a \"step in the wrong direction.\" According to Spencer, Microsoft plans to continue to work with regulators to \"create a space for alternative storefronts.\"\r<br />\n\r<br />\nIn the European Union, the Digital Markets Act requires Apple to allow for alternative app marketplaces and alternative payment methods, but Apple is requiring developers who opt to use an alternative app marketplace to agree to new business terms that include a Core Development Fee of .50 euros per user. Companies like <a href=\"https://www.macrumors.com/2024/01/26/spotify-on-apple-eu-app-changes/\">Spotify</a> and <a href=\"https://www.macrumors.com/2024/01/25/fortnite-returning-to-ios-in-europe/\">Epic Games</a> have criticized Apple's implementation of the DMA's requirements. Spotify CEO Daniel Ek said that Apple's plan is a \"complete and total farce,\" while <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> CEO Tim Sweeney said Apple's implementation is a \"devious new instance of malicious compliance.\"\r<br />\n\r<br />\nAlongside the changes in the European Union under the DMA, Apple also changed its <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> policies around cloud gaming apps. Apple now allows streaming game apps on the ‌App Store‌ worldwide, with the apps able to offer a selection of games from within a single app. Previously, cloud gaming services were only available via a web interface.<br />This article, \"<a href=\"https://www.macrumors.com/2024/02/15/xbox-cloud-gaming-ios-microsoft/\">Microsoft Not Planning on Xbox Cloud Gaming App for iOS Because There's 'Not Room' for Monetization</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsoft-not-planning-on-xbox-cloud-gaming-app-for-ios-because-theres-not-room-for-monetization.2419572/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ad266236422d050f4d7a4980fca463361d8a012e5a646e2dd8e0a0003e9a8f1d","category":"Apple"}