{"title":"PLEIOTROPIC REGULATORY LOCUS1 maintains actin microfilament integrity to regulate pavement cell morphogenesis","link":"https://academic.oup.com/plphys/article/195/1/356/7560171?rss=1","date":1705363200000,"content":"<span><div>Abstract</div>Actin dynamics are critical for plant cell morphogenesis, but the underlying signaling mechanisms regulating these dynamics are not well understood. Here, we established that PLEIOTROPIC REGULATORY LOCUS1 (PRL1) modulates leaf pavement cell (PC) morphogenesis in Arabidopsis (<span>Arabidopsis thaliana</span>) by maintaining the dynamic homeostasis of actin microfilaments (MF). Our previous studies indicated that PC shape was determined by antagonistic RHO-RELATED GTPase FROM PLANTS 2 (ROP2) and RHO-RELATED GTPase FROM PLANTS 6 (ROP6) signaling pathways that promote cortical MF and microtubule organization, respectively. Our genetic screen for additional components in ROP6-mediated signaling identified <span>prl1</span> alleles. Genetic analysis confirmed that PRL1 plays a key role in PC morphogenesis. Mutations in <span>PRL1</span> caused cortical MF depolymerization, resulting in defective PC morphogenesis. Further genetic analysis revealed that <span>PRL1</span> is epistatic to <span>ROP2</span> and <span>ROP6</span> in PC morphogenesis. Mutations in <span>PRL1</span> enhanced the effects of ROP2 and ROP6 in PC morphogenesis, leading to a synergistic phenotype in the PCs of <span>ROP2 prl1</span> and <span>ROP6 prl1</span>. Furthermore, the activities of ROP2 and ROP6 were differentially altered in <span>prl1</span> mutants, suggesting that <span>ROP2</span> and <span>ROP6</span> function downstream of <span>PRL1</span>. Additionally, cortical MF depolymerization in <span>prl1</span> mutants occurred independently of ROP2 and ROP6, implying that these proteins impact PC morphogenesis in the <span>prl1</span> mutant through other cellular processes. Our research indicates that PRL1 preserves the structural integrity of actin and facilitates pavement cell morphogenesis in Arabidopsis.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"ad3265c772f3b07bc771aef2d4fcf0444d15d37e084c95d4afa97359bd3f5058","category":"Environment"}