{"title":"How to import a number as a text field into Numbers","link":"https://www.macworld.com/article/2173827/import-number-as-text-field-in-numbers.html","date":1703235600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The import feature in Numbers for iOS, iPadOS, and macOS can take data in the common comma-separated values (CSV) and tab-separated values (TSV) formats and parse that right into a spreadsheet’s fields. However, you may have encountered a problem if you bring in data that was exported from elsewhere or formatted by hand that shouldn’t be interpreted as a number but, rather, as plain text.</p>\n\n\n\n<p>For instance, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://faq.usps.com/s/article/ZIP-Code-The-Basics&amp;xcust=1-1-2173827-1-0-0&amp;sref=https://www.macworld.com/feed\">United States Postal Service Zip code </a>system is one of the most common uses of leading or padding zeroes in numbers you deal with every day. In a zip code like 04843, the initial zero is a necessary part of the Zip code—but if you import a CSV or TSV file with 04843 in a field by itself, Numbers (like Excel) automatically treats it like a number. The column applies numeric formatting automatically and trims off that zero when converting it to a pure number: 4843.</p>\n\n\n\n<p>The error is silent, too. If you’re not paying attention, the first time you know something is wrong is when the post office rejects an address, or you encounter similar validation problems with less commonly occurring numbers that have leading zeroes or other formatting that triggers Numbers interpreting the field as a number.</p>\n\n\n\n<p>There’s an easy way to work around this, one that people using Excel have used for years, but it’s oddly not a standard option in any tool I’ve used that exports CSV or TSV files. In the CSV or TSV file, instead of formatting a number by itself like <code>,04843,</code> or <code>&lt;tab&gt;04843&lt;tab&gt;</code> you add an equals sign and enclose the number in quotation marks, like:</p>\n\n\n\n<p><code>=\"04843\"</code></p>\n\n\n\n<p>Numbers (and Excel) reads this as straight text. After importing, you can select the column and explicitly set it to text via the <em>Format Inspector</em> &gt; <em>Cell</em> &gt; <em>Data Format</em>, where you choose <em>Text</em>.</p>\n\n\n\n<p>Now, what if you can’t control how your CSV or TSV is made? Add a processing step before you open or import the file into Numbers. In an app like <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.barebones.com/products/bbedit/&amp;xcust=1-1-2173827-1-0-0&amp;sref=https://www.macworld.com/feed\">BBEdit</a> (including its free version), use Find and Replace. Here are the instructions for BBEdit after making a backup copy of your file:</p>\n\n\n\n<ol>\n<li>Open the CSV or TSV file in BBEdit.</li>\n\n\n\n<li>Choose <em>Search &gt; Find</em> or press Command-F.</li>\n\n\n\n<li>Make sure the checkboxes in the Find dialog are set as follows: “Case sensitive” and “Entire word” are deselected and “Grep” and “Wrap around” are selected.</li>\n\n\n\n<li>In the Find field for a CSV file, enter <code>,(\\d+?),</code>; for TSV, <code>\\t(\\d+?)\\t</code> (I’ll repeat these below for clarity).</li>\n\n\n\n<li>In the Replace field for a CSV file, enter <code>,=\"\\1\",</code>; for TSV, <code>\\t=\"\\1\"\\t</code>. (Ditto.)</li>\n\n\n\n<li>Click <em>Replace All</em>.</li>\n\n\n\n<li>Choose <em>File &gt; Save</em> or <em>File &gt; Save As</em>.</li>\n\n\n\n<li>Open the CSV or TSV file in Numbers. Note the leading zeroes!</li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-bbedit-tsv-replacement-pattern-bordered.png?w=1200\" alt=\"BBEdit find replace\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-bbedit-tsv-replacement-pattern-bordered.png?quality=50&amp;strip=all 1336w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-bbedit-tsv-replacement-pattern-bordered.png?resize=300%2C161&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-bbedit-tsv-replacement-pattern-bordered.png?resize=768%2C412&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-bbedit-tsv-replacement-pattern-bordered.png?resize=1200%2C643&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"643\" /><figcaption><p>BBEdit (shown here with a TSV replacement) and other text-editing programs can let you easily fix a CSV or TSV file to prevent the loss of leading zeroes.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Those patterns above say “find any number between commas (CSV) or tabs (CSV) and replace the number with <code>=”number”</code>. While this forces all imported numbers to be treated like tet, you can use the Format Inspector to change the cell formatting for any column you like to have Numbers act on those columns’ values as numbers.</p>\n\n\n\n<p>For additional clarity for step 4 and 5, here’s what you copy and paste in each field for CSV:</p>\n\n\n\n<ul>\n<li>Find in CSV: <code>,(\\d+?),</code></li>\n\n\n\n<li>Replace in CSV: <code>,=\"\\1\",</code></li>\n</ul>\n\n\n\n<p>And for TSV:</p>\n\n\n\n<ul>\n<li>Find in TSV: <code>\\t(\\d+?)\\t</code></li>\n\n\n\n<li>Replace in TSV: <code>\\t=\"\\1\"\\t</code></li>\n</ul>\n\n\n\n<p>Note that those are straight quotation marks in the replacement patterns for CSV and TSV, not curly or typographers’ quotes.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nPersonal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ad33fc18993522d0b6acf6489f08adc0cbcbab41b65274867f544fea43b27892","category":"Apple"}