{"title":"Apple Designing More Functional Products Since Jony Ive's Departure, Argues Bloomberg Reporter","link":"https://www.macrumors.com/2021/10/20/apple-product-design-jony-ive-opinion/","date":1634753198000,"content":"Apple's product design has improved since former design chief Jony Ive left the company in 2019, according to an opinion column by <a href=\"https://www.bloomberg.com/news/articles/2021-10-19/apple-s-product-design-has-improved-since-jony-ive-left\"><em>Bloomberg</em> reporter Alex Webb</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/jony-ive-tim-cook-steve-jobs-theater.jpg\" />\r\n<br />\r\nWebb believes that Apple has reemphasized function over form since Ive's departure. For example, while the design of the previous Siri Remote for the Apple TV made it easy to pick up the remote upside down by accident, <a href=\"https://www.macrumors.com/2021/05/24/hands-on-apple-tv-4k-siri-remote/\">a new Siri Remote was released in May</a> with an improved design and added power and mute buttons for a TV.\r\n<br />\r\n\r\n<br />\r\nThere's also the new 14-inch and 16-inch MacBook Pro models this week, which feature the <a href=\"https://www.macrumors.com/2021/10/18/14-and-16-inch-macbook-pro-ports/\">return of several ports</a> that Apple had removed in 2016, including an HDMI port, an SD card slot, and MagSafe. Function over form certainly applies here, as the new MacBook Pro models are <a href=\"https://www.macrumors.com/2021/10/18/new-16-inch-macbook-pro-vs-previous-generation/\">slightly thicker and heavier</a> than the previous-generation models, but gain back expanded connectivity that many professional users appreciate having.\r\n<br />\r\n\r\n<br />\r\nWebb argued that the flat edges on the iPhone 12 and iPhone 13 models also prioritizes function over form, arguing that the curved edges on previous iPhones made the display prone to cracking if the devices were dropped on their sides.\r\n<br />\r\n\r\n<br />\r\n\"There is merit in sometimes listening to your customers, particularly when the pendulum has swung too far away from function and towards form,\" wrote Webb. \"After all, you're liable to lose professional customers – architects, musicians, film-makers – if they can't plug their laptops into external monitors. And professional users can afford to pay for the top-of-the-range devices that are more profitable to Apple.\"\r\n<br />\r\n\r\n<br />\r\nWebb acknowledges that perhaps at least some of these design changes would have happened under Ive, but he ultimately feels there has been a change of philosophy.\r\n<br />\r\n\r\n<br />\r\nWe also think it's worth noting that Ive might have had a hand in designing some of the aforementioned products before his departure, and possibly even after given that Apple announced it <a href=\"https://www.macrumors.com/2019/06/27/jony-ive-leaving-apple/\">would remain a primary client</a> of Ive's independent design firm LoveFrom. Apple said that Ive was <a href=\"https://www.macrumors.com/2021/05/29/jony-ive-involved-in-24-imac/\">involved with the design of the colorful 24-inch iMac</a> released last April, well over a year after he departed the company.\r\n<br />\r\n\r\n<br />\r\nOf course, as Webb notes, Apple would not be the same today without Ive, a highly-respected creative who helped design some of the company's most iconic products, ranging from the iMac and iPod to the iPhone and iPad.<div>Tag: <a href=\"https://www.macrumors.com/guide/jony-ive/\">Jony Ive</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/20/apple-product-design-jony-ive-opinion/\">Apple Designing More Functional Products Since Jony Ive's Departure, Argues Bloomberg Reporter</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-designing-more-functional-products-since-jony-ives-departure-argues-bloomberg-reporter.2318264/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CpQICElHiAM:Xk45j7HST7g:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CpQICElHiAM:Xk45j7HST7g:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/CpQICElHiAM\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ad3af096cf9eef73df2430092424c29a94c87a1d5f5efbcc17dad79493f60085","category":"Apple"}