{"title":"Effect mechanism of capsaicin and dihydrocapsaicin in chili on the oxidative stability of myoglobin in duck meat","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13508?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Myoglobin (Mb) in duck meat is commonly over-oxidized when heated at high temperatures, which may worsen the color of the meat. Enhancing the oxidative stability of Mb is essential for improving the color of duck meat. Capsaicin and dihydrocapsaicin (CA-DI) in chili exhibit antioxidant properties. This study investigated the effects of CA-DI on the structure and oxidative damage of Mb by fluorescence spectroscopy, differential scanning calorimetry analysis and particle size in duck meat during heat treatment.</p>\n<h2>RESULTS</h2>\n<p>When the ratio of CA-DI to Mb was 10:1 g kg<sup>−1</sup> and heat-treated for 36 min, oxymyoglobin significantly increased, and metmyoglobin significantly decreased compared with the control group (<i>P</i> &lt; 0.05). In parallel, the carbonyl content of Mb in the CA-DI group decreased by 43.40 ± 0.10%, the sulfhydryl content increased by 188 ± 0.21%, and the free radical scavenging activity of Mb was significantly enhanced (<i>P</i> &lt; 0.05). Moreover, the addition of CA-DI resulted in a significant decrease in the particle size of the Mb surface (<i>P</i> &lt; 0.05). When the ratio of CA-DI to Mb was 10:1 g kg<sup>−1</sup>, CA-DI enhanced the thermal stability and significantly increased the thermal denaturation temperature of Mb. The molecular docking results indicated that hydrophobic interactions and hydrogen bonds were involved in the binding of CA-DI to Mb.</p>\n<h2>CONCLUSION</h2>\n<p>CA-DI could combine with Mb and improve the oxidation stability of Mb in duck meat. This suggested that CA-DI could be a potential natural antioxidant that improves the color of meat products. © 2024 Society of Chemical Industry.</p>","author":"Ruifang Wu, \nYuqing Xie, \nLingling Zhao, \nCaiqi Fu, \nWenjie He, \nDanjun Guo, \nWei Xu, \nYang Yi, \nHongxun Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ad3aa531b3b34e8617080797af35bb0487cc22312565813743ff4d9073b93519","category":"Environment"}