{"title":"Spotify Attacks Apple’s ‘Outrageous’ 27 Percent Commission From External Links","link":"https://www.bbc.com/news/technology-68018618","date":1705793202000,"content":"\n<p>Tom Gerken, writing for BBC News:</p>\n\n<blockquote>\n  <p>On Wednesday, Apple announced it would permit app developers to \nsell products in places other than its own store — but only if \nthey still paid commission. Spotify said that was “outrageous” and \naccused Apple of “stopping at nothing” to protect its profits. It \nis urging the British government to prevent similar fees being \nlevied in the UK. [...] </p>\n\n<p>Spotify has reacted with fury, saying the policy “flies in the \nface” of the US court’s attempt to enable greater competition. \n“Once again, Apple has demonstrated that they will stop at nothing \nto protect the profits they exact on the backs of developers and \nconsumers under their app store monopoly,” it said in a statement. </p>\n</blockquote>\n\n<p>I can see why Spotify doesn’t like this, but I’m not sure why Spotify doesn’t qualify under the “reader” app category that can link to external web pages without paying Apple any commission at all. Also, I think Spotify is barking up the wrong tree while complaining about Apple’s compliance with this U.S. court order under the guise of Apple abusing a monopoly — Judge Gonzales specifically ruled that the App Store <a href=\"https://www.cnbc.com/2021/09/10/epic-games-failed-to-prove-apple-is-a-monopolist-rules-judge.html\">does not constitute a monopoly</a>.</p>\n\n<p>Here’s a simple thought I had today regarding whether Apple’s new External Purchase Links entitlement policy is a good faith compliance with Judge Gonzales’s order: Will any developers actually choose to use it? Remember, to use this entitlement, developers must:</p>\n\n<ul>\n<li><em>Still</em> offer in-app purchases through Apple’s system, alongside external payment links.</li>\n<li>Pay Apple a 27/12 percent commission on sales through external links.</li>\n<li>Report monthly sales to Apple and submit to audits on demand.</li>\n<li>Track users who follow those links so they can determine which sign-ups they owe Apple commission payments for.</li>\n<li>Follow Apple’s <a href=\"https://developer.apple.com/support/storekit-external-entitlement-us/\">strict design guidelines</a> for presenting those links.</li>\n</ul>\n\n<p>Or, they could just stick to using IAP exclusively. I’m curious whether any developers at all will consider the new External Payment Links worth implementing. If not, how could it be a reasonable policy? It may well be <em>legal</em>, but bad faith and spite aren’t illegal.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/20/spotify-app-store-outrage\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ad3d2b28d4e34f169284a274ba1df46f10bbde6ed915e156f8ba14c5995bfd7c","category":"Tech"}