{"title":"Antimicrobial Susceptibility of Commensal Neisseria spp. in Parents and Their Children in Belgium: A Cross-Sectional Survey","link":"https://www.preprints.org/manuscript/202406.0249/v1","date":1717583797000,"content":"Background: Commensal Neisseria species are part of the oropharyngeal microbiome and important for health, but also serve as a reservoir for antimicrobial resistance. Little is known about the prevalence of these species in the general population, how this varies by age and how antimicrobial susceptibility varies between species. Methods: We assessed the prevalence and antimicrobial susceptibility of commensal Neisseria species in the parents (n=38) and children (n=50) of 35 families in Belgium.Results: Various commensal Neisseria (n=5) could be isolated from the participants. Most abundant were N. subflava and N. mucosa. N. subflava was detected in 77 of 88 (87.5%) individuals and N. mucosa in 64 of 88 (72.7%). N. mucosa was more prevalent in children (41/50 [82%]) than parents (23/38 [60.5%]; P&lt;0.05), while N. bacilliformis was more prevalent in parents (7/36 [19.4%]) than children (2/50 [4%]; P&lt;0.05). N. bacilliformis showed high ceftriaxone minimum inhibitory concentrations (MICs; median MIC 0.5mg/L; IQR 0.38-0.75) and these high MICs explained the higher ceftriaxone MICs of all Neisseria isolates from the parents than the children. The median azithromycin MIC of all Neisseria isolates per individual was positively correlated with the median family MIC (rho=0.24; P=0.033). The same association was found for the analysis limited to N. subflava (rho=0.36; P=0.004) and N. mucosa (rho=0.30; P=0.027).  Interpretation: The most abundant commensal Neisseria species found in this population were N. subflava and N. mucosa, of which the prevalence of N. mucosa varied by age. The prevalence of N. bacilliformis also varied by age and showed concerningly high ceftriaxone MICs which warrant further investigation. We found evidence of clustering of azithromycin, but not ceftriaxone, MIC by family.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ad48ca80755405a49630d8f746ff4a4c9907e66c0c37f54909ce5d3aff6514ba","category":"Interdisciplinary"}