{"title":"Effect of traditional roughage-based or limit-fed, high-energy diets on growth performance and digestion in newly received growing cattle and subsequent implications on feedlot growth performance and carcass characteristics","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae082/7666940?rss=1","date":1715126400000,"content":"<span><div>Abstract</div>The objective was to determine the effects of ad libitum-fed roughage-based diets or limit-fed high-energy diets on growth performance, behavior, health, and digestion in newly received growing cattle and subsequent implications on feedlot growth performance and carcass characteristics. In experiment 1, 409 crossbred heifers (initial body weight [BW] = 279 ± 24 kg) in 32 pens were used in a randomized block design. Heifers were fed one of two dietary treatments: a total mixed ration with 0.99 Mcal net energy for gain (NE<sub>g</sub>)/kg dry matter (DM) fed ad libitum (0.99AL) or 1.32 Mcal NE<sub>g</sub>/kg DM limit-fed at 85% of intake of heifers fed 0.99AL (1.32LF85%). Both diets contained 40% DM as a branded wet corn gluten feed. In experiment 2, 370 crossbred heifers (initial BW = 225 ± 20 kg) were used in a randomized block design and were fed a diet formulated to contain 0.99 Mcal of NE<sub>g</sub>/kg DM for ad libitum intake or a diet formulated to contain 1.32 Mcal of NE<sub>g</sub>/kg DM and fed at 2.2% of BW daily (DM basis; 1.32LF2.2). For experiments 1 and 2, treatment integrity was maintained through the finishing phase where cattle were fed a common diet. Cattle were sorted by BW into heavy and light groups prior to finishing, with light cattle fed longer than heavy cattle to reach similar harvest BW. In experiment 3, eight ruminally cannulated heifers (average BW = 305 ± 23 kg) were used in a 2-period cross-over design and fed treatments from experiment 1 to assess digestibility and ruminal fermentation characteristics. Gain:feed was 47% and 35% greater (<span>P</span> &lt; 0.01) in experiments 1 and 2, respectively, for limit-fed heifers compared with 0.99AL heifers. Rumination time was greater (<span>P</span> &lt; 0.01) for 0.99AL compared with limit-fed treatments in experiments 1 and 2. Activity was greater (<span>P</span> &lt; 0.01) for 1.32LF2.2 than for 0.99AL in experiment 2. In experiment 1, more (<span>P</span> = 0.03) carcasses from light-sort heifers than carcasses from heavy-sort heifers had livers with large, active abscesses. In experiment 2, finishing phase morbidity was greater (<span>P</span> &lt; 0.01) for 1.32LF2.2 than for 0.99AL. Light-sort groups had fewer (<span>P</span> &lt; 0.01) edible livers than heavy-sort groups, suggesting that greater number of days on feed may increase the risk of liver abscess prevalence and condemnation. In experiment 3, apparent total-tract DM and organic matter digestibilities were greater (<span>P</span> &lt; 0.01) for 1.32LF85% than for 0.99AL. Overall, dietary treatments during the growing phase had little carryover effect on feedlot growth performance, carcass characteristics, or liver abscesses prevalence at harvest.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"ad4c5ed0f149b3a4ddfd7fd0093dc1feac265a9f5d4279646a2eecf3eaca64ee","category":"Environment"}