{"title":"Metabolic and Transcriptional Analysis Reveals Flavonoid Involvement in the Drought Stress Response of Mulberry Leaves","link":"https://www.preprints.org/manuscript/202405.1734/v1","date":1716798835000,"content":"Abiotic stress, especially drought stress poses a significant threat to the terrestrial plant growth, development, and productivity. Although mulberry have great genetic diversity and extensive stress tolerant traits in agroforestry systems, only a few reports offer preliminary insight into biochemical responses of mulberry leaves under drought conditions. In this study, we performed a comparative metabolomic and transcriptomic analysis on the “drooping mulberry” (Morus alba var. Pendula Dippel) under PEG-6000-simulated drought stress. Our research revealed that drought stress significantly enhanced flavonoid accumulation and up-regulated the expression of phenylpropanoid biosynthetic genes. Furthermore, the activities of superoxide dismutase (SOD), catalase (CAT) and malondialdehyde (MDA) content were elevated. In vitro enzyme assays and fermentation tests indicated the involvement of flavonol synthase/flavanone 3-hydroxylase (XM_010098126.2) and anthocyanidin 3-O-glucosyltransferase 5 (XM_010101521.2) in the biosynthesis of flavonol aglycones and glycosides, respectively. The recombinant MaF3GT5 protein was found to recognize kaempferol, quercetin, and UDP-glucose as substrates, but not 3-/7-O-glucosylated flavonols and UDP-rhamnose. MaF3GT5 is capable of forming 3-O- and 7-O-monoglucoside, but not di-O-glucosides, form kaempferol. This implies its role as a flavonol 3, 7-O-glucosyltransferase. The findings from this study provided insights into the biosynthesis of flavonoids and could have substantial implications for the future diversified utilization of mulberry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ad53859db04da351a9af03b92687c3cd131c103c94d8fd35fdd99631ccffc59d","category":"Interdisciplinary"}