{"title":"Construction and characterization of a hypervesiculation strain of <i>Escherichia coli</i> Nissle 1917","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301613","date":1712066400000,"content":"<p>by Tomomi Sawabe, Yoshihiro Ojima, Mao Nakagawa, Toru Sawada, Yuhei O. Tahara, Makoto Miyata, Masayuki Azuma</p>\r\n\r\nOuter membrane vesicles (OMVs) are produced by Gram-negative bacteria and deliver microbial molecules to distant target cells in a host. OMVs secreted by probiotic probiotic strain <i>Escherichia coli</i> Nissle 1917 (EcN) have been reported to induce an immune response. In this study, we aimed to increase the OMV production of EcN. The double gene knockout of <i>mlaE</i> and <i>nlpI</i> was conducted in EcN because the Δ<i>mlaE</i>Δ<i>nlpI</i> of experimental strain <i>E</i>. <i>coli</i> K12 showed the highest OMV production in our previous report. The Δ<i>mlaE</i>Δ<i>nlpI</i> of EcN showed approximately 8 times higher OMV production compared with the parental (wild-type) strain. Quick-freeze, deep-etch replica electron microscopy revealed that plasmolysis occurred in the elongated Δ<i>mlaE</i>Δ<i>nlpI</i> cells and the peptidoglycan (PG) had numerous holes. While these phenomena are similar to the findings for the Δ<i>mlaE</i>Δ<i>nlpI</i> of K12, there were more PG holes in the Δ<i>mlaE</i>Δ<i>nlpI</i> of EcN than the K12 strain, which were observed not only at the tip of the long axis but also in the whole PG structure. Further analysis clarified that the viability of Δ<i>mlaE</i>Δ<i>nlpI</i> of EcN decreased compared with that of the wild-type. Although the amount of PG in Δ<i>mlaE</i>Δ<i>nlpI</i> cells was about half of that in wild-type, the components of amino acids in PG did not change in Δ<i>mlaE</i>Δ<i>nlpI</i>. Although the viability decreased compared to the wild-type, the Δ<i>mlaE</i>Δ<i>nlpI</i> grew in normal culture conditions. The hypervesiculation strain constructed here is expected to be used as an enhanced probiotic strain.","author":"Tomomi Sawabe","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ad5712bedc29e2ef6e2b24e01ee7e3ef3fbfd40b4d705176a0aa735945dbf976","category":"Interdisciplinary"}