{"title":"Proportion of Nonindustrial Private Forest Lands That Potentially Can Be Leased to Bioenergy Enterprises to Grow Short Rotation Woody Crops","link":"https://academic.oup.com/forestscience/article/70/1/37/7471348?rss=1","date":1702339200000,"content":"<span><div>Abstract</div>Determining how much nonindustrial private forest (NIPF) land could potentially be allocated to growing short rotation woody crops (SRWCs) is critical for estimating the future supply of woody biomass for biofuels and overall bioenergy production. This study estimated the proportion of the land NIPF landowners would be willing to allocate to SRWC cultivation. In view of the bounded nature of the dependent binary variable [0,1] and model performance, a fractional logit regression model was used to estimate model parameters. The estimated proportion of land allocated to SRWCs was positively influenced by the rental rate per acre, owning land for investment or fee-access hunting purposes, and the landowner’s age. In contrast, size of the ownership, owning land for the production of agricultural products, and residing on the land negatively influenced the proportion of land allocated to SRWCs. Lease contract duration, location of the largest tract owned, owning land for personal recreation or ecosystem services, and landowner familiarity with the concept of alternative fuels production did not influence the proportion of land allocated to SRWCs. These results will contribute to a better understanding of SRWC biomass supply from NIPF land and provide important benchmark information for conducting feasibility analyses of biofuel and biopower manufacturing in Mississippi and other states with abundant woody feedstocks.<strong>Study Implications</strong>: To achieve targeted levels of bioenergy production and carbon dioxide (CO<sub>2</sub>) emission reductions and diversify NIPF landowner income, participation of NIPF landowners in woody biomass feedstock production will be critical, because they own a majority of forestland in the region. Moreover, they have diverse reasons for owning land which has extensive implications not only in terms of incentive types or monetary compensation levels they might require for cultivating SRWCs but also policies related to the development of the bioenergy sector in Mississippi, the location of individual bioenergy processing facilities, and feedstock types that will be developed. Thus, forest managers and biomass procurement foresters might need to decide whether to focus their efforts on maximizing the land area allocated to growing SRWCs or considering a mix of SRWCs at lower lease rates per acre and material obtained from thinnings, which might be more amenable to landowners who value environmental amenities.</span>","author":"","siteTitle":"Forest Science Current Issue","siteHash":"05e2fee9ae6a27cd288c89ae75adf607539d339849a171c4fab1eaa2f11b4162","entryHash":"ad6ee6d5f4cc1a96ec05564c57d83dea66caf63adb8cb20332724b687c24e4fa","category":"Environment"}