{"title":"Is Pinarello’s new Dogma F the next Tour de France winning bike? (And yes, you can still have rim brakes)","link":"https://www.bikeradar.com/news/pinarello-dogma-f/","date":1624543217000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Dogma-F-Roberto-Bragotto-Photographer-7-ee05214.jpg?quality=45&amp;resize=620,413\" />                                            <p>Italian bike maker Pinarello has announced the latest generation of its flagship Dogma race bike, calling it the Dogma F.</p>\n<p>It’s an all-new superbike available in both disc and rim brake options, both boasting a long list of refinements over the previous Dogma F12.</p>\n<p>Claimed to be lighter, stiffer, and more aerodynamic, the Dogma F will be the bike of choice for Ineos Grenadiers, and we’re expecting it to appear at the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">2021 Tour de France</a>.</p>\n<p>The Dogma F will retail at £5,400 for a frameset, £11,000 for a complete bike with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9170-first-ride-review/\">Shimano Dura-Ace Di2</a>, and £12,000 / $14,500 for one with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">SRAM Red eTap AXS</a>. Other international pricing is to be confirmed.</p>\n<p>Pinarello says it dropped the numerical naming system because “a Pinarello Dogma is an icon, it goes beyond a number or superficial classifications”. The idea seems to be to introduce a kind of timelessness to the platform.</p>\n<p>Pinarello doesn’t differentiate between aero and lightweight for its <a href=\"https://www.bikeradar.com/features/pro-bike/tour-de-france-bikes/\">Tour de France bikes</a> and so, like the Venge-killing <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-tarmac-sl7-review/\">Specialized Tarmac SL 7</a>, the Dogma F is intended to be the best possible race bike for all riders.</p>\n<section><div>\n        <h3>Pinarello Dogma F – key details at a glance</h3>\n<ul><li>All new full-carbon frameset designed to be stiffer, lighter and more aero than Dogma F12</li>\n<li>Available in rim and disc brake versions</li>\n<li>Disc frame kit (frame, fork, seatpost, cockpit) claimed to save 256g over Dogma F12</li>\n<li>Accepts electronic groupsets only</li>\n<li>Clearance for 28mm tyres</li>\n<li>Frameset priced at £5,400</li>\n<li>Complete bikes from £11,000</li>\n<li>Available from December 2021</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Pinarello Dogma F: stiffer, lighter and more aero</h2>\n\n<p>At a glance, you could be forgiven for thinking the bike has barely changed.</p>\n<p>The overall look is very similar to that of the F12, with the signature Onda (wave) fork and very muscular curves. However, the Dogma F is entirely new.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Team Ineos Grenadiers, pictured here on a training ride ahead of the Tour de France, will be using the new Pinarello Dogma F in the 2021 race.</span></figcaption><span> <i>Chris Graythen/Getty Images</i></span></div>\n<p>Like previous Dogmas, its back end is distinctly asymmetrical to match asymmetrical pedalling forces, and Pinarello says the new bike is 12 per cent stiffer at the <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a>.</p>\n<p>This is the bike we spotted under Richard Carapaz at the Tour de Suisse a couple of weeks back and, at the time, we noted a new down tube design, as well as tweaked seatstays.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> While outwardly similar to the F12, the Dogma F’s frameset is entirely new.</span></figcaption><span> <i>Roberto Bragotto / Pinarello</i></span></div>\n<p>The Dogma F is a fully integrated design with cables almost entirely hidden from view and a one-piece proprietary cockpit that sits on an exceptionally beefy, straight 1.5in fork steerer (the majority of modern road bike fork steerers are tapered from 1 ½in to 1 ⅛in).</p>\n<p>Where previously the top of the down tube stepped down twice, the new version steps down and back up again.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The new down tube steps down and then back up again, whereas the Dogma F12’s down tube stepped down twice.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>At the back end, the seatstays extend away from the seat tube before heading towards the <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-axle-standards/\">rear axle</a>, rather than taking a direct line.</p>\n<p>This is all to do with the aerodynamic development Pinarello has carried out and the brand says that while the F12 was already pretty darned aero, the F makes further savings, with the disc and rim brake models being 4.8 per cent and 3.2 per cent “more aero” than their respective predecessors.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The seatstays have been tweaked for the new design and now extend away from the seat tube before heading for the axle.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>For the Dogma F Disc, this translates to a 1.3-watt saving at 40km/h and a 2.6-watt saving at 50km/h.</p>\n<p>While the press materials for the new bike are keen to stress that “on the road, it’s responsiveness and comfort that matter more than shaving off a few grams”, weight savings get a lot of attention.</p>\n<p>Pinarello says the Dogma F Disc’s frame kit (frame, fork, seatpost, cockpit) is 265g lighter in total, with key savings at the seatpost, headset, fork.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A new 3D-printed titanium seat clamp saves weight and looks pretty neat too.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>The brand quotes weight reductions of 27g for the seat tube and 25g for the <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-headsets/\">headset</a>, along with a 35g saving thanks to a new SLM (Selective Laser Melting, i.e. 3D printed) titanium seat clamp, and 40g for the new Most Talon Ultrafast cockpit that replaces the previous Talon Ultra.</p>\n<p>The new rim brake fork is said to be 58g lighter than previously, while on the disc model a new thru-axle design saves 20g.</p>\n<p>There is a slight question mark over the weight of the frame itself. While there’s a weight savings theme to the whole launch, the claimed figures of 865g for an unpainted 53cm Dogma F Disc and 860g for the rim brake version are actually slightly higher than the figures of 840g and 820g Pinarello published with the release of the <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f12-price-weight-details/\">Dogma F12</a> back in 2019.</p>\n<p>We’ve asked for clarification, but it appears possible that while the complete package has got lighter, the frame itself has gained a tiny bit of weight in exchange for aero gains – not necessarily a bad thing when aero almost invariably trumps weight for the purposes of racers.</p>\n<p>In any case, Pinarello says a 53cm disc frameset built up with SRAM Red eTap AXS and DT Swiss ARC 1400 wheels will weigh 6.9kg without pedals, while one with Dura-Ace R9100 will be 6.8kg.</p>\n<p>Adding pedals will likely push those over the 7kg mark, but that’s not unusual for a bike with significant aero features and discs. Rim brake models will apparently dip under the 6.8kg UCI minimum weight with ease.</p>\n<p>On a practical note, Pinarello hasn’t gone big with tyre clearances, and they’re officially limited to 28mm for both rim and disc brake variants. The brand has also stuck – dogmatically, one might say – with an <a href=\"https://www.bikeradar.com/features/what-is-the-difference-between-an-italian-and-bsa-bottom-bracket/\">Italian threaded bottom bracket</a>, presumably for reasons of tradition.</p>\n<h2>No “t-shirt” sizing</h2>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>Nominal size (mm)</th><th>Seat tube (mm)</th><th>Horizontal top tube (mm)</th><th>Seat angle (°)</th><th>Head angle (°)</th><th>Chainstay (mm)</th><th>Head tube (mm)</th><th>BB drop (mm)</th><th>Reach (mm)</th><th>Stack (mm)</th></tr></thead><tbody><tr><td>430</td><td>425</td><td>500</td><td>74,40</td><td>69,50</td><td>406</td><td>97</td><td>67</td><td>351.4</td><td>502.4</td>        </tr><tr><td>465</td><td>450</td><td>515</td><td>74,40</td><td>70,50</td><td>406</td><td>104</td><td>72</td><td>364.8</td><td>517.6</td>        </tr><tr><td>500</td><td>465</td><td>525</td><td>74,00</td><td>71,40</td><td>406</td><td>109</td><td>72</td><td>372.1</td><td>525.4</td>        </tr><tr><td>515</td><td>485</td><td>535</td><td>73,70</td><td>72,00</td><td>406</td><td>114</td><td>72</td><td>378.0</td><td>532.3</td>        </tr><tr><td>530</td><td>500</td><td>545</td><td>73,70</td><td>72,50</td><td>406</td><td>123</td><td>72</td><td>383.3</td><td>542.6</td>        </tr><tr><td>540</td><td>510</td><td>550</td><td>73,40</td><td>72,80</td><td>408</td><td>131</td><td>72</td><td>385.0</td><td>551.2</td>        </tr><tr><td>550</td><td>520</td><td>557</td><td>73,40</td><td>72,80</td><td>408</td><td>142</td><td>72</td><td>388.8</td><td>561.6</td>        </tr><tr><td>560</td><td>525</td><td>565</td><td>73,00</td><td>73,20</td><td>408</td><td>149,5</td><td>72</td><td>390.7</td><td>570.2</td>        </tr><tr><td>575</td><td>540</td><td>575</td><td>73,00</td><td>73,70</td><td>408</td><td>163</td><td>72</td><td>396.7</td><td>584.8</td>        </tr><tr><td>595</td><td>560</td><td>587</td><td>72,40</td><td>73,40</td><td>408</td><td>199</td><td>67</td><td>393.3</td><td>613.3</td>        </tr><tr><td>620</td><td>600</td><td>620</td><td>72,00</td><td>73,40</td><td>411</td><td>239</td><td>67</td><td>410.1</td><td>651.7</td>        </tr></tbody></table></div>\n\n<p>Pinarello says “we will never use t-shirt sizes to measure our bikes”, offering the Dogma in 11 different sizes from 43cm to 62cm.</p>\n<p>That’s pretty unusual in the age of moulded carbon and it’s something to be applauded – moulds are expensive, so there’s a strong incentive for manufacturers to try and cover a range of rider heights with fewer sizes.</p>\n<p>The Dogma F’s numbers are pretty standard for racy <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road bike geometry</a> – a nominal 54cm frameset has 385mm of reach and 551mm of stack, while the angles are suitably steep and racy.</p>\n<p>While Pinarello is generous with its frame sizes, riders are limited to a choice of 16 different variants of the Most Talon Ultrafast cockpit.</p>\n<p>That might sound like plenty but, as it’s a one-piece design, that covers all available stem lengths and bar widths. Stems range from 90mm to 140mm, while bar widths cover 420mm to 460mm.</p>\n<p>Given how focussed Pinarello is on aerodynamics, we were a little surprised not to see narrower bar options on offer – <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">going narrower</a> is one of the easiest aerodynamic gains you can make on a road bike.</p>\n<p>However, Pinarello apparently measures it’s bars outside-to-outside, rather than the more common centre-to-centre, so a 420mm bar will measure up more like a conventional 380mm-wide one, which is reasonably narrow.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Luke Rowe (back of shot) appears to be riding the Pinarello Dogma F with a traditional handlebar.</span></figcaption><span> <i>Chris Graythen / Getty Images</i></span></div>\n<p>These details are worth paying attention to – on a more everyday bike, you could simply look to the aftermarket for alternatives if the stock option doesn’t work for you, but the Dogma F’s non-standard 1.5in steerer means that’s not a simple option.</p>\n<p>It will be interesting to see if any Ineos riders are given options not offered to the buying public.</p>\n<p>We’ve spotted Luke Rowe riding the new Dogma F on a training ride ahead of the Tour de France and he appears to be using a standard handlebar. Rowe has typically used an alloy, classic bend on the old Dogma F12, so it’s likely Pinarello may be offering the option for Ineos riders once again.</p>\n<h2>Colour options and availability</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/P22_DOGMA_F_B611_CAMPAGNOLO_CAMPAGNOLO_ORE3-5be4936.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Pinarello Dogma F in Eruption Red.</span>\n    </figcaption><span>\n                    <i>Pinarello</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/P22_DOGMA_F_B610_RED_DTSWISS_ORE3-799637c.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Pinarello Dogma F in Plutonium Flash.</span>\n    </figcaption><span>\n                    <i>Pinarello</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/P22_DOGMA_F_B615_RED_FULCRUM_ORE3-7c3356b.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Pinarello Dogma F in Black on Black.</span>\n    </figcaption><span>\n                    <i>Pinarello</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nAt launch, the Dogma F will be available in three paintjobs called Plutonium Flash, Eruption Red and Black on Black.\n<p>Availability is from December this year, with Pinarello’s custom MyWay paint options to follow later.</p>\n<h2>Is this the next Tour-winning bike?</h2>\n<p>Is this the next Tour de France winning bike? With Ineos Grenadiers’ record, that’s entirely possible.</p>\n<p>Whatever you think of the Dogma F, it’s certainly not boring – Pinarellos are arguably the most distinctive <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour bikes</a> in the pro peloton.</p>\n<p>We’d love to hear what you think of the new Dogma F, so let us know your thoughts in the comments.</p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ad8583a37790ba23f120a4684ea877670649460a9f0552171ee5073bc3b6facb","category":"Cycling"}