{"title":"Apple pushes new Rapid Security Response updates to patch zero-day exploits on iPhones and Macs","link":"https://www.macworld.com/article/1986514/rapid-security-response-ios-ipados-16-5-1-macos-13-4-1-update-webkit-zero-day.html","date":1689011900000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Following the release of iOS 16.5.1, iPadOS 16.5.1, and macOS 13.4.1 in June, Apple has now pushed an (a) update to each under its Rapid Security Response system. there are no new features and the update seemingly contains just a single patch. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT213823&amp;xcust=1-1-1986514-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple’s security page</a> describes the flaw:</p>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul>\n<li><strong>Available for:</strong> iOS 16.5.1 and iPadOS 16.5.1 and macOS Ventura 13.4.1</li>\n\n\n\n<li><strong>Impact:</strong> Processing web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.</li>\n\n\n\n<li><strong>Description:</strong> The issue was addressed with improved checks.</li>\n\n\n\n<li><strong>CVE-2023-37450:</strong> an anonymous researcher</li>\n</ul>\n\n\n\n<p>In other words, there’s a way for bad actors to create web content that can make your iPhone, iPad, or Mac run whatever they want. And this flaw seems to have already been used in the wild, hence the emergency need for the patch.</p>\n\n\n\n<p>Apple pushed its <a href=\"https://www.macworld.com/article/1922298/ios-macos-rapid-security-response-webkit-flaw-safari-zero-day.html\">first Rapid Security Response update</a> in May for iOS 16.4, iPadOS 16.4, and macOS 13.3, though it didn’t divulge the contents until a couple of weeks later. So it’s possible that this update contains other fixes that Apple isn’t declaring yet.</p>\n\n\n\n<p>To update your device, go to the Settings app on your iPhone or iPad, tap <em>General</em>, then <em>Software Update</em>, and then <em>Download and Install</em>. On your Mac, head over to <em>System Settings</em>, then select <em>General</em> and <em>Software Update</em>.</p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ad894a222d4369dbe23a22a0b4d4f601611dcb15e1751074d0ddd4c0a87eaff2","category":"Apple"}