{"title":"A new generation of storm chasers takes on Mother Nature in Twisters trailer","link":"https://arstechnica.com/?p=2002700","date":1707789497000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Daisy Edgar-Jones, Anthony Ramos, and Glen Powell star in <em>Twisters</em>, a standalone film inspired by the 1996 classic. </p></div>\n<p>Like so many others, I adored the 1996 film <a href=\"https://en.wikipedia.org/wiki/Twister_(1996_film)\"><em>Twister,</em></a> now a classic in the \"disaster porn\" genre and still in frequent weekend and holiday rotation on broadcast and cable networks nearly 30 years later. We're finally getting a follow-up with <em><a href=\"https://en.wikipedia.org/wiki/Twisters_(film)\">Twisters</a>,</em> directed by Lee Isaac Chung (<em>Minari</em>). Universal Pictures dropped the official trailer during the Super Bowl on Sunday.</p>\n<p><strong>(Some spoilers for the original film below.)</strong></p>\n<p><em>Twister</em> rocked the 1996 box office, racking up $495 million worldwide and snagging an Oscar nomination for special effects. Critics' reactions were more mixed. The film earned well-deserved praise for its special effects and sheer entertainment value.  Who can forget the flying cows, the jaw-dropping CGI twisters, and that classic scene when a tornado suddenly rips through a drive-in movie screen in the middle of <em>The Shining</em>? But others criticized the thin character development and dismissed the film as \"loud,\" \"dumb,\" and \"a triumph of technology over storytelling and the actor's craft.\"</p></div><p><a href=\"https://arstechnica.com/?p=2002700#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2002700&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ad8fa8036ca8c11e2d74a2e2242e8acf0be1d2a2a897d34f6096d62f250ac0c2","category":"Tech"}