{"title":"ประวัติศาสตร์ของเลขอารบิก","link":"https://markpeak.net/arabic-numerals/","date":1615107530000,"content":"<p>ได้รับคำถามที่น่าสนใจ (แต่ดันตอบไม่ได้) ว่าทำไมเราต้องใช้ &#8220;เลขอารบิก&#8221; เลยต้องไปค้นข้อมูลเพิ่ม และพบว่า</p>\n<ul>\n<li>ปัจจุบันเราเรียกมันว่า &#8220;เลขอารบิก&#8221; (<a href=\"https://en.wikipedia.org/wiki/Arabic_numerals\">Arabic numerals</a>) แต่จริงๆ แล้วมันเกิดขึ้นในอินเดียก่อนต่างหาก ชื่ออย่างเป็นทางการในทางวิชาการจึงเรียกว่า Hindu-Arabic numerals</li>\n<li>คุณลักษณะสำคัญของ &#8220;เลขฮินดู-อารบิก&#8221; คือมีคอนเซปต์ของเลขศูนย์ (0) ซึ่งไม่มีในระบบเลขของโรมัน</li>\n<li>หลังจากนั้นก็ตามชื่อ คือ เลขฮินดูอารบิกก็แพร่หลายเข้ามายังโลกอาหรับ และขยายตัวตามศาสนาอิสลาม มายังแอฟริกาเหนือ</li>\n<li>จุดเปลี่ยนสำคัญจริงๆ ที่โลกตะวันตกหันมาใช้เลขอารบิก มาจากนักคณิตศาสตร์ชื่อดังชาวอิตาเลียน Fibonacci (คนเดียวกับที่ทำอนุกรมฟิโบนัคคีนี่แหละ) ในวัยเยาว์ ติดตามพ่อไปทำงานที่แอลจีเรีย และค้นพบระบบเลขอารบิกที่เหนือกว่าเลขโรมันที่ยุโรปใช้กัน</li>\n<li>หนังสือของ Fibonacci ที่เขียนในปี 1202 จึงใช้เลขอารบิก เมื่อบวกกับเทคโนโลยีการพิมพ์ของยุโรปที่ก้าวหน้าขึ้นในยุคหลัง ทำให้ยุโรปหันมาใช้เลขอารบิกแทนเลขโรมัน ในระยะเวลาอีกประมาณ 300 ปีให้หลัง</li>\n<li>แน่นอนว่า วิธีการเขียนเลขฮินดู-อารบิกในยุคแรกๆ แตกต่างจากเลขอารบิกในยุคหลังอย่างมากแล้ว (ดูภาพประกอบ) แต่เราก็ยังเห็นร่องรอยบางอย่างในวิธีการเขียนอยู่ เช่น เลข 2-3 ที่ยังคล้ายของเดิมมาก หรือเลข 6-7-9 ที่ยังพอมีเค้าของเดิมอยู่</li>\n</ul>\n<p>ประวัติศาสตร์ของเลขอารบิกยังอธิบายกำเนิดของ<a href=\"https://en.wikipedia.org/wiki/Thai_numerals\">ระบบเลขไทย</a> เขมร และลาว ได้ด้วย เพราะสืบเนื่องมาจากระบบเลขแบบฮินดูเหมือนกัน (แค่เดินทางไปคนละฝั่งทวีป) แล้วกลายพันธุ์ไปอีกทาง (ตัวเลขเขมรโบราณพัฒนาตามอักษรแบบเทวนาครี Devanagari ที่ใช้เขียนภาษาสันสกฤต ซึ่งเป็นแขนงหนึ่งของฮินดู-อารบิก)</p>\n<p>ปัจจุบัน เรายังเห็นร่องรอยของการนับแบบฮินดี-สันสฤตอยู่มากในภาษาไทย เช่น คำว่า ศูนย์-สุญ หรือ เอก-โท-ตรี เป็นต้น</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2198\" src=\"https://markpeak.net/wp-content/uploads/2021/03/thai-khmer-numerals.jpg\" alt=\"\" width=\"910\" height=\"409\" srcset=\"https://markpeak.net/wp-content/uploads/2021/03/thai-khmer-numerals.jpg 910w, https://markpeak.net/wp-content/uploads/2021/03/thai-khmer-numerals-300x135.jpg 300w, https://markpeak.net/wp-content/uploads/2021/03/thai-khmer-numerals-768x345.jpg 768w, https://markpeak.net/wp-content/uploads/2021/03/thai-khmer-numerals-700x315.jpg 700w\" sizes=\"(max-width: 910px) 100vw, 910px\" /></p>\n<p>ในภาพรวมแล้ว <a href=\"https://en.wikipedia.org/wiki/List_of_numeral_systems\">ระบบเลขในโลก</a>แบ่งออกเป็นตระกูลใหญ่ๆ คือ</p>\n<ul>\n<li><strong>ฮินดู-อารบิก:</strong> ยุโรป ตะวันออกกลาง อินเดีย เอเชียตะวันออกเฉียงใต้</li>\n<li><strong>เอเชียตะวันออก:</strong> จีน ญี่ปุ่น เกาหลี เวียดนาม</li>\n<li><strong>เลขที่เป็นตัวอักษร:</strong> กรีก โรมัน ฮิบรู (ยุโรปก่อนได้อิทธิพลเลขอารบิก)</li>\n<li>อื่นๆ: ระบบเลขโบราณที่ไม่มีใครใช้แล้วในปัจจุบัน เช่น อียิปต์ บาบีโลน หรือในอเมริกาอย่าง มายัน แอซเท็ค</li>\n</ul>\n<p>ภาพประกอบจาก <a href=\"https://en.wikipedia.org/wiki/File:The_Brahmi_numeral_system_and_its_descendants.png\">Wikipedia</a></p>The post <a href=\"https://markpeak.net/arabic-numerals/\">ประวัติศาสตร์ของเลขอารบิก</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ad97b85ee9a0b1d555fa33028c272f8c7e2af00b60c0d90d31ee58ed85640575","category":"Thai"}