{"title":"The Challenges of Sustainability in Urban Planning (The Metropolis of Tehran)","link":"https://www.preprints.org/manuscript/202405.1935/v1","date":1716961376000,"content":"The population growth of major cities in Iran and the lack of attention to scientific and managerial principles in urban planning in recent years have created numerous issues for citizens and urban planners, pushing cities towards instability. Tehran, as the capital of Iran, is among the cities facing numerous urban challenges. It appears that these factors will present serious challenges to the city's future sustainability. Many articles have assessed and analyzed indicators of sustainability in cities, but less attention has been paid to indicators of instability and real issues that pose challenges to urban planning sustainability. In this regard, the present study aims to identify the challenges of sustainability in urban planning by re-evaluating indicators related to urban sustainability and assessing indicators of instability in urban planning from a realistic perspective. The results indicate that the major indicators of urban planning instability have been summarized into three economic, social, and environmental indices. In the economic index, the unstable components in urban planning include uncertainty in economic policies, housing prices, non-standard housing, income, employment, unemployment, cost of living, and female-headed households. In the environmental index, the unstable components in urban planning consist of climate change, heat islands, floods, transportation management, energy security, noise and air pollution, urban traffic, water quality and quantity, waste disposal quality, urban green infrastructure, environment as an aesthetic issue, and changing the approach to the environment with changes in individuals. In the social index, the unstable components in urban planning encompass social interaction, access to facilities and services, access to social harms services, sense of identity and belonging, neighborly relations, social segregation, public participation in city affairs, and security and welfare.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ad97318a8d7dbc958e7ec52634e95c5d2e5183891d7026fca37e423e5a4bf94c","category":"Interdisciplinary"}