{"title":"iOS 17: How to Set and Label Multiple Timers","link":"https://www.macrumors.com/how-to/use-label-multiple-timers-ios/","date":1695046687000,"content":"It's taken this long, but in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, Apple has added support for multiple timers, and has also made it easy to manage several timers on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> with the introduction of labels. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/set-multiple-timers-ios.jpg\" alt=\"timers\" width=\"1920\" height=\"1080\" />\r<br />\nThat's right. Believe it or not, iPhones have not included the ability to set multiple ongoing timers until now. In ‌iOS 17‌, the Clock app finally enables several timers to be set that will run down at the same time, allowing you to keep track of more than one thing, which is handy when cooking a meal that includes several dishes, for example.\r<br />\n\r<br />\nNot only can you have several timers counting down at the same time, you can also label timers, which helps you identify each one in your timer list. That way, you'll always know which timer relates to what, and you can save custom timers without having to remember what they were set up for.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/siri-suggestion-set-a-timer.jpg\" alt=\"siri\" width=\"1339\" height=\"725\" />\r<br />\nTo quickly set a timer on ‌iPhone‌, swipe down on the Home screen, search \"timer,\" and tap the <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> Suggestion, or to set a timer with a name, say \"‌Siri‌, set a timer called [name] for [duration].\" Alternatively, open the Clock app and tap the Timers tab. In the timer setup options, select a duration, then tap the Label field and type in what you want to call it. \r<br />\n\r<br />\nChoose a distinct alert for the timer if it helps you recognize it. Note that in ‌iOS 17‌, you also have the option of selecting one of several preset durations in the setup screen. When a timer is set, it will be added to your editable list of timers. For added convenience, the list will also include any recently completed timers that you used. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/set-multiple-timers.jpg\" alt width=\"4137\" height=\"2716\" />\r<br />\nIf your ‌iPhone‌ has a <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a>, the last timer you set will appear inside it when you are doing other things on your device. The most recently set timer will also appear as a Live Activity on the Lock Screen, and you can tap to expand it and see any other timers that are running concurrently. <br />This article, \"<a href=\"https://www.macrumors.com/how-to/use-label-multiple-timers-ios/\">iOS 17: How to Set and Label Multiple Timers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-how-to-set-and-label-multiple-timers.2402991/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ad9b313a320654066afbe7f64c52a70cc098bb744a48e2583523f2a698feedc1","category":"Apple"}