{"title":"GoPro Announces Firmware to Address Hero 10 Overheating, New Enduro Battery Announced","link":"https://www.dcrainmaker.com/2021/10/gopro-announces-firmware-to-address-hero-10-overheating-new-enduro-battery-announced.html","date":1635169967000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/DSC_6204.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/DSC_6204_thumb.jpg\" /></a></p>\n<p>Over the weekend GoPro semi-quietly announced that they plan to issue a firmware update that’ll give users more control over how the <a href=\"https://www.dcrainmaker.com/2021/09/gopro-hero-10-black-in-depth-review.html\">Hero 10</a> handles no-airflow conditions, enabling upwards of a 154% increase over recording times. For those that had too much time on their hands, you might remember my GoPro Hero 10 Overheating test, where I put the Hero 10 through more than <a href=\"https://www.youtube.com/watch?v=DypcZJtUNDA\">40 different tests</a> to figure out precisely where it overheated, and where it didn’t. In short, it overheated at 60FPS or higher in any scenario where there was zero airflow (such as inside statically mounted). Except in a fridge, then it did just fine. Same with a freezer, also fine. Also fine in a dive case too underwater (<a href=\"https://www.youtube.com/watch?v=DypcZJtUNDA\">I detail all that in the video</a>).</p>\n<p>As part of this testing I super-heated my bathroom up to a spicy 104°F (40°C), and what I found was that basically – no matter the temperature, as long as you had some airflow, then the Hero 10 was just fine (even the lightest of breezes). But if you had no airflow, at higher frame rates, the camera would eventually overheat and shut down (gracefully, with no loss of data). While many would argue that an action cam should be used for action, the reality is many people (including myself) use GoPros all the time in static scenarios as extra cameras, or even perhaps inside a race car dash window, etc…</p>\n<h3><span>GoPro Video Performance Modes:</span></h3>\n<p>Thus, to address this, GoPro has announced that by the end of the month a new firmware will drop that’ll fix this.  Following exactly what other camera companies do, GoPro will be introducing three new “Video Performance Modes” that the camera can be operated in. Here’s how they describe them:</p>\n<blockquote><p><strong>1. Maximum Video Performance –</strong> Maximum video resolution and frame rates for the very best image quality and ultra slow motion.</p>\n<p><strong>2. Extended Battery –</strong> Optimal video resolutions and frame rates for maximizing recording times and extending battery life.</p>\n<p><strong>3. Tripod / Stationary Video –</strong> Optimized for recording long video clips at the highest resolutions and frame rates when the camera is stationary without motion or airflow to cool the camera. GPS and HyperSmooth video stabilization are turned OFF in this mode.</p></blockquote>\n<p>This actually mirrors a lot of what I suspected would likely occur – specifically that turning off certain features that are unneeded in a static airflow environment (namely GPS and HyperSmooth), could be used to address this. Of course, only GoPro really has the data to know what that massive matrix of features would be in terms of component heat contribution.</p>\n<p>When it comes to increases in battery life, here’s specifically what they said:</p>\n<blockquote><p>“The following is what users can expect to achieve, on average, in Tripod/Stationary Video mode recording a single continuous clip at a temperature of 77F/25C in static situations without movement or airflow to cool the camera:</p>\n<ul>\n<li>5.3K60 – 47% more runtime than previous for an average of 29 minute-long clips</li>\n<li>5.3K30 – 11% more runtime than previous for an average of 44 minute-long clips</li>\n<li>4K120 – 52% more runtime than previous for an average of 26 minute-long clips</li>\n<li>4K60 – 154% more runtime than previous for an average of 63 minute-long clips</li>\n<li>4K30 – 35% more runtime than previous for an average of 50 minute-long clips</li>\n</ul>\n<p>A future firmware update will enable even longer clip lengths in 5.3K30 and 4K30. And if important for your use case, 2.7K and 1080p will enable significantly longer single clip recording times in either Extended Battery or Maximum Video Performance modes.”</p></blockquote>\n<p>Their % increase numbers roughly match the baseline metrics that I captured as part of the wide-ranging tests. Certainly, I’ll be putting things to the test again, albeit this time in a slightly more targeted manner to focus on the scenarios that failed last time (since I’ve identified countless scenarios that are just fine, namely airflow ones.</p>\n<p>Now it’s worth noting that this might not address all use cases. For example, earlier on I noted the race case inside dash scenario. In that case, turning off HyperSmooth is going to result in relatively crappy footage on bumpier surfaces. And even on regular highways, turning off all stabilization can be a buzzkill in terms of footage.</p>\n<p>Of course, if you’re mainly using a GoPro to record the inside or outside view of a car on a highway, there’s virtually zero need to do 60FPS (which is for slowing video down for slow motion later). Thus, using the 30FPS mode will handle that just fine for many hours (or, as long as the battery lasts. Speaking of which…</p>\n<h3><span>GoPro Enduro Battery:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-52.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-52.png\" /></a></p>\n<p>Next, somewhat unrelated to the Hero 10 overheating update, GoPro has also announced a new battery called the ‘Enduro’, which is specifically designed for cold-weather usage. This new battery costs slightly more than the existing one ($24.99 instead of $19.99), and is compatible with both the Hero 9 and Hero 10. The new battery will increase cold weather performance, but also regular conditions too – in that case by upwards of 40%. Which is pretty incredible if true.</p>\n<p>In their testing, with the *battery temp* at 14F/-10C, with the new battery they got on average</p>\n<p><strong>– 5.3K 60FPS:</strong> 56 mins<br />\n<strong>– 4K 120FPS:</strong> 50 mins<br />\n<strong>– 4K 60FPS:</strong> 76 mins<br />\n<strong>– 1080p 30FPS:</strong> 115 mins</p>\n<p>GoPro noted though that the claims are for the *battery temp*, and that the actual outside temperature can be colder, as the battery will heat up the camera further as you start recording.</p>\n<p>When it comes to more normal temperatures, GoPro says that during outdoor activities at 77F/25C, the new Enduro battery will do:</p>\n<p><strong>– 5.3K 60FPS:</strong> 60 mins (28% increase over standard battery)<br />\n<strong>– 4K 120FPS:</strong> 51 mins (40% increase)<br />\n<strong>– 4K 60FPS:</strong> 71 mins (13% increase)<br />\n<strong>– 1080p 30FPS:</strong> 120 mins (same as before)</p>\n<p>In any case, I’ll test the new battery with my usual real world testing, expect that review in November when the battery starts shipping. And again, this new battery is good for both the Hero 9 and Hero 10 (as they share the same battery).</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"ad9cd3d61e48340a37ed3cc014e035bd244e9490ef9a7bc391c61dbebbefc3e8","category":"Cycling"}