{"title":"The Diverse Mechanisms that Animals Use to Resist Toxins","link":"https://new.annurev.org/content/journals/10.1146/annurev-ecolsys-102320-102117?TRACK=RSS","date":1698883200000,"content":"<div><p>Biological toxins are entrenched within ecosystems. Thus, animals are often exposed to such toxins, and how they adapt can be a key determinant of their evolutionary trajectories. In this review, we provide an overview of the diversity of toxin resistance mechanisms, with a focus on animals that sequester toxins from their diet and their natural predators and parasites. We propose a structured framework in which to study toxin resistance by recategorizing and reorganizing known mechanisms into avoidance, metabolism, and target categories. Then, using this framework, we review evidence regarding how animals resist four widely studied compounds: tetrodotoxin, batrachotoxin, cardiotonic steroids, and pyrrolizidine alkaloids. Based on the available data, we conclude that toxin resistance and sequestration are interrelated from both ecological and evolutionary perspectives. To conclude, we highlight open questions regarding toxin resistance and review its importance as a field.</p>\n<p>En los ecosistemas las toxinas de origen biológico son componentes intrínsecos. Por esta razón, los animales se ven expuestos frecuenciamente a dichas toxinas y la forma en que se adaptan puede ser un factor que determina su trayectoria evolutiva. Esta revisión ofrece una visión general de la diversidad de mecanismos de resistencia a toxinas, centrándose en animales que secuestran toxinas de su dieta y en sus depredadores y parásitos naturales. En este texto se propone un marco estructural para estudiar la resistencia a toxinas mediante la recategorización y reorganización de mecanismos conocidos en categorías de: evación, metabolismo y moléculas diana. A continuación, utilizando este marco, revisamos la literatura científica en busca de evidencia sobre cómo los animales resisten a cuatro compuestos ampliamente estudiados: tetrodotoxina, batracotoxina, esteroides cardiotónicos y alcaloides de pirrolizidina. A partir de los datos disponibles, llegamos a la conclusión de que la resistencia y la retención de toxinas están interrelacionadas tanto desde el punto de vista ecológico como evolutivo. Por último, destacamos algunas preguntas abiertas en torno a la resistencia a las toxinas y resaltamos su importancia como campo de estudio en el futuro.</p></div>","author":"Rebecca D. Tarvin, Kannon C. Pearson, Tyler E. Douglas, Valeria Ramírez-Castañeda and María José Navarrete","siteTitle":"Annual Reviews: Annual Review of Ecology, Evolution, and Systematics: Table of Contents","siteHash":"4393f11c6731666e5a43e0d4d3b46e15accb72a7005c6d439b2c6eed671f7b97","entryHash":"ad9d5bda0ee7533850a7abb506a60bd0637bf162377699ad6500f43ed073aad2","category":"Environment"}