{"title":"Raingauge vs IMERG Precipitation Data: Balancing Accuracy and Cost for a Reliable Hydrological Observatory in a Tropical River Basin","link":"https://www.preprints.org/manuscript/202405.1004/v1","date":1715754953000,"content":"Reliable hydrological monitoring is crucial for effective water resource management, but establishing observatories in remote areas with extreme weather presents significant challenges. This study aimed at identifying cost-effective methods for streamflow estimation in such environments. We evaluated the performance of the Soil and Water Assessment Tool (SWAT) model using various precipitation data sources: ground-based rain gauge networks with different densities (one-gauge (1RG), two-gauge (2RG), and five-gauge (5RG) configurations) and satellite-derived Integrated Multi-satellite Retrievals for GPM (IMERG) data. The study focused on the Sahafihitry catchment, a 200 km² area in northeastern Madagascar. The results demonstrated that denser rain gauge networks (5RG and 2RG) captured the spatial variability of rainfall more effectively than a single gauge or IMERG data. This translated into superior SWAT model performance. Denser networks achieved higher statistical metrics (R², slope of regression a, Nash-Sutcliffe efficiency NSE, root mean square error RMSE, Kling-Gupta efficiency KGE) indicating a better fit between simulated and observed streamflow. Specifically, 5RG: R² = 0.84, a = 0.92, NSE = 0.83, RMSE = 3.33, KGE = 0.82; 2RG: R² = 0.85, a = 0.95, NSE = 0.83, RMSE = 3.36, KGE = 0.88; 1RG: R² = 0.73, a = 0.80, NSE = 0.72, RMSE = 4.28, KGE = 0.88; IMERG: R² = 0.48, a = 0.63, NSE = 0.37, RMSE = 6.46, KGE = 0.66. Furthermore, rain gauge data outperformed IMERG in simulating both flood events and low-flow periods. While IMERG offers low cost, readily available data, its lower performance introduces significant uncertainty into hydrological modeling. In contrast, the two-gauge network (2RG) achieved satisfactory streamflow simulations and represents the most cost-effective option for establishing reliable observatories within the specific characteristics of this study area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ada0ffe30e4af85291fc42b0f0bd4a47e11cfbd9feed67d43d0d586f5e26a6cd","category":"Interdisciplinary"}