{"title":"Stronger together: A workflow to design new fish polycultures","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12903?af=R","date":1718694827000,"content":"<h2>Abstract</h2>\n<p>Polyculture is a relevant practice for improving the sustainability of aquaculture, which raises interest in implementing it in a variety of production systems. However, polyculture is a complex approach that can result not only in complementarity among species but also competition among them and animal welfare issues. Potential polyculture benefits can be expected provided that compatibility and complementarity occur among the combined species. This places a premium on identifying the best species combinations for a given aquaculture system. Here, we developed a conceptual integrative workflow to standardise and plan the development of new fish polycultures. This workflow is designed to screen all possible combinations in a set of species based on three successive steps of assessment. Overall, these steps consider the compatibility and complementarity of co-farmed species as well as stakeholder demands, sustainability and fish welfare. Step 1 consists of selecting the most promising compatible species combinations (i.e., ‘prospective combinations’) as a function of stakeholder opinion and expectations using databases and surveys. Step 2 validates the effectiveness of prospective combinations based on bioassays by considering species complementarity and animal welfare. Step 3 implements the best species combination(s) in aquaculture production, during which prototyping allows the sustainability of the resulting commercial production system to be studied. In conclusion, the workflow aims at being a valuable tool to innovate in aquaculture by exploiting the opportunities and the strengths of polyculture.</p>","author":"Thomas Lecocq, \nNellya Amoussou, \nJoël Aubin, \nGrégoire Butruille, \nSébastien Liarte, \nAlain Pasquet, \nMarielle Thomas","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"adb30d6e987233225816d82b6c0c77e5d46f6e463d145bf1d712e8855e314aaf","category":"Environment"}