{"title":"Spatial distribution and abundance of non-native barnacles of the genus Amphibalanus Pitombo, 2004 (Cirripedia: Balanidae) in southern Iraq","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae048/7749660?rss=1","date":1725494400000,"content":"<span><div>Abstract</div>Invasions of non-native species have been occurring across the globe, mostly due to human activities or climate change. Although most introduced species fail to expand or have slight impact on their new ecosystems, the large number of true invasive species has led to serious economic and ecological problems. Knowledge of the fundamental drivers shaping the current distribution and abundance of invasive species of barnacles of the genus <span>Amphibalanus</span><a href=\"#CIT0022\">Pitombo, 2004</a> in Iraq are still poorly understood. We collected samples of barnacles from 21 sites from the lower reaches of the Shatt Al-Arab with salinities of 20–24 ppt to the upper part of the Shatt Al-Arab, and northwest to the Al-Hammar marshes and the Euphrates River with salinities of 0.9–2.8 ppt. <span>Amphibalanus amphitrite</span> (<a href=\"#CIT0003\">Darwin, 1854</a>) was widely distributed, occurring at most sites. With the exception of a few sites close to the mouth of the Shatt Al-Arab, <span>A. improvisus</span> (<a href=\"#CIT0003\">Darwin, 1854</a>) was restricted to sites with salinities of 22–37 ppt. <span>Amphibalanus subalbidus</span> (<a href=\"#CIT0007\">Henry, 1973</a>) had an oligohaline distribution, occurring in moderately saline water. Redundancy analysis (RDA) revealed that the spatial distribution and abundance of all three species were influenced by salinity and temperature. Overall, our results confirm the importance of mapping the spatial distribution and abundance of invasive species in order to assess and manage the risks these species pose to native ecosystems.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"adb7297ad928bd853adb22160104f35d0ea4141f89920b926ced1b97cb0d6756","category":"Environment"}