{"title":"Amazon คุมเข้ม ปิดบัญชีร้านค้าจีนที่ซื้อรีวิว กว่า 50,000 บัญชี มูลค่ากว่า 15.4 พันล้านดอลลาร์","link":"https://www.blognone.com/node/124307","date":1629356049000,"content":"<div><div><div><p>หนึ่งในบริการของ Amazon ที่มีผู้ใช้งานมากที่สุดคือระบบร้านขายของ Fulfillment by Amazon หรือ FBA ที่เป็นตลาดขายสินค้าจากผู้ขายรายย่อย แต่ Amazon จะเป็นผู้ดูแลสต็อก การจัดส่งในสหรัฐฯ และการคืนสินค้า ปัจจุบันผู้ใช้งาน FBA เป็นร้านค้ารายย่อยจากจีนกว่าครึ่งหนึ่ง เพราะเป็นบริการที่ช่วยให้ร้านค้าในจีนขยายมาตีตลาดสหรัฐฯ ได้ง่าย</p>\n<p>Amazon เคยอนุญาตให้ผู้ขายสามารถมอบของฟรี, บัตรของขวัญ ประกันเสริม หรือสิ่งตอบแทนอื่นแลกกับรีวิวได้ เพราะอยากให้มีผู้รีวิวบนแพลตฟอร์มมากขึ้น แต่หลังจากปี 2016 เป็นต้นมาก็เริ่มห้ามผู้ขายไม่ให้ทำ เนื่องจากการแจกของฟรีหรือเงินแลกกับรีวิว ทำให้เกิดรีวิวที่ไม่สะท้อนคุณภาพจริงของสินค้าได้</p>\n<p>ก่อนหน้านี้ Amazon ยังไม่ได้บังคับใช้ระเบียบนี้อย่างจริงจังนัก โดยเฉพาะกับร้านค้าในประเทศจีน ที่บ่อยครั้งผู้บริโภคในสหรัฐฯ ไม่สามารถเอาผิดทางกฎหมายได้ แม้พบสินค้าไม่ได้คุณภาพจากรีวิวปลอมก็ตาม แถมก่อนหน้านี้ <a href=\"https://www.blognone.com/node/124129\">The Wallstreet Journal ยังพบร้านค้ามีพฤติกรรมส่งอีเมลซ้ำๆ</a> ให้ลูกค้าลบรีวิวที่คะแนนไม่ดีออกอีกด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a7b74bad2ba37c1043cab86a4e2e13d1.jpg\" /></p>\n<p>ล่าสุดดูเหมือน Amazon จะเอาจริงเอาจังกับข้อห้ามนี้มากขึ้น โดยสมาคมธุรกิจอีคอมเมิร์ซระหว่างประเทศแห่งเซิ่นเจิ้น (Shenzhen Cross-Border E-Commerce Association) พบว่านับตั้งแต่ไตรมาสที่สองของปีนี้เป็นต้นมา มีร้านค้าจีนกว่า 50,000 ร้านที่ถูกปิด และสินค้าถูกยึดไว้ที่โกดังของ Amazon สูญเงินไปแล้วกว่า 15.4 พันล้านดอลลาร์ หรือราว 515 พันล้านบาท</p>\n<p>แม้ Amazon จะระบุว่าการปิดร้านค้าครั้งนี้ทำโดยเท่าเทียมกัน ไม่เกี่ยวว่าจะเป็นร้านค้าจากจีนหรือสหรัฐฯ แต่ข้อมูลจากเว็บไซต์วิเคราะห์ตลาดอีคอมเมิร์ซ Marketplace Pulse ระบุว่าบัญชีร้านค้าที่เพิ่งถูกปิดทั้งหมด เป็นร้านค้าจากประเทศจีน</p>\n<p>การปิดร้านค้านี้ทำให้หลายธุรกิจเช่น Qianhai Patozon Network &amp; Technology Co. เจ้าของแบรนด์หูฟัง Mpow และร้านค้าอื่นๆ จากจีนประสบปัญหาด้านธุรกิจหนัก พนักงานหลายคนตกงาน และหลายแบรนด์เกือบจะต้องปิดกิจการไป แต่ส่งผลดีกับร้านค้าในอเมริกาที่เคยเสียยอดขายให้กับแบรนด์จีน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/762eaed8cbaca32f28bb680153b6cafb.png\" /></p>\n<p>นอกจากนี้ Amazon ยังเตรียมเปิด<a href=\"https://www.bloomberg.com/news/articles/2021-08-10/amazon-to-pay-up-to-1-000-for-injuries-caused-by-sellers-goods\">โปรแกรมจ่ายเงินชดเชยสูงสุด 1,000 ดอลลาร์</a> ให้กับผู้บริโภคที่บาดเจ็บจากสินค้าไม่ได้คุณภาพในเดือนกันยายน โดย Amazon จะไปติดตามปัญหากับผู้ขายเอง หลังก่อนหน้านี้ผู้บริโภคต้องฟ้องผู้ขายโดยตรงอย่างเดียวเท่านั้น</p>\n<p>ดูเหมือน Amazon จะกำลังปรับปรุงแพลตฟอร์มของตัวเองขนานใหญ่ในช่วงปีนี้ หลังจากปล่อยให้ร้านค้าที่ทำผิดระเบียบลอยนวลมานาน ร้านค้าของจีนเองก็น่าจะต้องปรับระบบการขายในสหรัฐฯ และลดการพึ่งพา Amazon ลง แม้คู่แข่งบริการ FBA อย่าง Walmart Fulfillment Services จะยังดีสู้ Amazon ไม่ได้ก็ตาม</p>\n<p>ที่มา - <a href=\"https://www.bloomberg.com/news/articles/2021-08-18/amazon-amzn-cracks-down-on-fake-reviews-hitting-chinese-retailers\">Bloomberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/e-commerce\">E-commerce</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"adbbdfb26f7c1aa01b812aeedcea7d52507ceff22cd544b507cd73e87824f219","category":"Thai"}