{"title":"Ammonites from the lower and middle Toarcian (Jurassic) in the Cantabrian Range (Asturian and Basque-Cantabrian basins, Northern Spain). Chronostratigraphy, biotic events and correlations with other Iberian basins","link":"http://link.springer.com/10.1007/s41513-024-00252-y","date":1728432000000,"content":"<h3>Abstract</h3>\n                  <p>The present paper studies the ammonite associations from the terminal Pliensbachian (Spinatum Zone, Hawskerense Subzone) and from the lower-middle Toarcian (Tenuicostatum to Variabilis zones) in two areas of the Cantabrian Range, situated in the Asturian Basin (AB) and in the Basque-Cantabrian Basin (BCB). The lower boundary of the Toarcian was accurately established with the first record of the genus <em>Dactylioceras</em> in both basins. In the Cantabrian Range, we characterised all the standard zones and subzones of the Toarcian Stage. In order to establish the chronostratigraphic horizons, we considered the evolution of the Dactylioceratidae (Dactylioceratinae) in the Tenuicostatum Zone, of the Hildoceratidae (Harpoceratinae) in the Serpentinum Zone, of the Hildoceratidae (Hildoceratinae) from the last horizon of the Falciferum Subzone to the end of the Bifrons Zone, and of the Phymatoceratidae (Phymatoceratinae) in the Variabilis Zone. We identified the following main regional or global biotic events: (1) the mass extinction of the Amaltheidae Family in the upper part of the Hawskerense Subzone; (2) the expansion of the Dactylioceratinae Subfamily as from the base of the Tenuicostatum Zone; (3) the extinction of practically all the late Arieticeratinae (<em>Emaciaticeras</em>, <em>Canavaria</em>, <em>Tauromeniceras</em>), of the <em>Lioceratoides</em> and of the <em>Dactylioceras</em> (<em>Eodactylites</em>) in the boundary between the Paltum/Mirabile and Semicelatum subzones; (4) the final extinction of the aforementioned groups, and of the <em>Neolioceratoides</em>, <em>Protogrammoceras</em> (<em>Paltarpites</em>) and almost all the <em>Dactylioceras</em> (<em>Orthodactylites</em>) in the boundary between the Tenuicostatum and Serpentinum zones, coinciding with the final stage of the Jenkyns Event. When the factors that caused this event came to an end, at regional or global scale there occurred a recovery of the Dactylioceratinae, Harpoceratinae and Hildoceratinae within a short time interval, with significant radiations of these subfamilies. The Phymatoceratinae subsequently radiated from the Bifrons Zone.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"adeabe09e505a7c1b8e8048b189139cea3f7eb442621e7c355893c9d32cc2f36","category":"Environment"}