{"title":"Automated Cloud Shadow Detection from Satellite Orthoimages with Un-corrected Cloud Relief Displacements","link":"https://www.preprints.org/manuscript/202408.0409/v1","date":1722930635000,"content":"The presence of cloud and cloud shadows in satellite images affects the accuracy of land cover classification and object detection. Therefore, their existence is considered noise and a target for removal by many researchers. This paper focuses on precise cloud shadow detection from ortho-rectified images. The directions of cloud shadows in original satellite images are determined by the sensor and sun illumination directions. However, those in ortho-rectified images have not been studied explicitly. This study proposes that the directions of cloud shadow in ortho-rectified images are also determined by both sensor and sun directions. This is because relief displacements due to cloud height above ground are not corrected through ortho-rectification processes. This study also proposed to detect cloud shadows by shifting a bounding box of a cloud region through the cloud shadow direction and identifying dark pixels within the shifted box. This study utilized Rapideye images acquired in various viewing angles and viewing directions. The proposed method improved the accuracy of estimating cloud shadow directions and extracting cloud shadow regions greatly. The outcomes of this study are expected to be utilized as precise cloud shadow detection and correction. As a future work, there is a need to enhance accuracy of cloud shadow detection through post-processing methods such as watershed algorithm. Additionally, an interesting future study would be to check whether the findings of this study are applicable to other objects in ortho- or unmanned aerial vehicle (UAV) images with uncorrected relief displacements, such as high-rise buildings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"adf400323992847a02cc4801e366196b23f4a4479123fa8610764f552c723925","category":"Interdisciplinary"}