{"title":"Confluent, JFrog, and ServiceNow Integrations Highlight Additions to the Vault Ecosystem","link":"https://www.hashicorp.com/blog/confluent-jfrog-servicenow-integrations-highlight-additions-vault-ecosystem","date":1638810000000,"content":"<p>We continue to see strong growth in the HashiCorp Vault Partner ecosystem as a dozen additional self-managed (open source Vault) and <a href=\"http://cloud.hashicorp.com\">HashiCorp Cloud Platform</a> (HCP) <a href=\"https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations\">Vault verified integrations</a> were completed this past quarter. These integrations are in addition to the <a href=\"https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners\">more than 100 integrations</a> with 75 partners. The program has seen 300% growth since 2019.</p>\n<h2><a href=\"#new-vault-integrations\">»</a><a></a>New Vault Integrations</h2>\n<p>We are pleased to announce a pair of new HCP Vault verified integrations as well as ten self-managed Vault integrations. The two new HCP Vault integrations have gone through our verification process and earned the “HCP Vault Verified” badge.</p><img src=\"https://www.datocms-assets.com/2885/1638804356-new-hcp-vault-verified-badge.png\" /><img src=\"https://www.datocms-assets.com/2885/1638804363-vault-integrations-logos-12-21.png\" /><h2><a href=\"#new-hcp-vault-verified-integrations\">»</a><a></a>New HCP Vault Verified Integrations</h2>\n<p>HCP Vault is a fully managed platform that is operated by HashiCorp, allowing organizations to get Vault up and running quickly. We are pleased to announce the following existing integrations have now been verified to work with HCP Vault as well as self-managed Vault:</p>\n<h3><a href=\"#denodo\">»</a><a></a>Denodo</h3>\n<p><a href=\"https://www.hashicorp.com/partners/tech/denodo-technologies-inc#all\">Denodo’s</a> Virtual DataPort, a global solution for heterogeneous and dispersed data source integration in real time, provides support to obtain credentials from HCP Vault to avoid storing credentials in Denodo for the service accounts of your JDBC data sources.</p>\n<h3><a href=\"#servicenow\">»</a><a></a>ServiceNow</h3>\n<p>ServiceNow MID servers can use the <a href=\"https://www.hashicorp.com/partners/tech/servicenow#vault\">Vault Credential Resolver</a> to consume secrets directly from HCP Vault for the purpose of performing discovery. Joint customers are now able to use HCP Vault to securely retrieve credentials necessary for agentless discovery and service mapping to ensure complete visibility of their estate. Additionally, credentials from HashiCorp Vault can be utilized in automating workflows to third-party systems. See how the Vault Credential Resolver works with ServiceNow and HCP Vault in this recent webinar: <a href=\"https://www.hashicorp.com/events/webinars/using-hashicorp-vault-as-a-centralized-credential-resolver-from-servicenow\">Using HashiCorp Vault as a Centralized Credential Resolver from ServiceNow</a>.</p>\n<h2><a href=\"#new-hashicorp-vault-integrations\">»</a><a></a>New HashiCorp Vault Integrations</h2>\n<p>We also saw ten new Vault integrations this quarter:</p>\n<h3><a href=\"#cribl\">»</a><a></a>Cribl</h3>\n<p>Cribl’s LogStream routes observability data to where it has the most value. The <a href=\"https://www.hashicorp.com/partners/tech/cribl#vault\">integration</a> between Cribl LogStream and HashiCorp Vault was added in LogStream version 3.0 and allows customers to offload management of secrets used by Cribl LogStream to Vault. The key management service (KMS) feature can be used to improve the security posture of your LogStream deployment.</p>\n<h3><a href=\"#confluent\">»</a><a></a>Confluent</h3>\n<p>Confluent’s Apache Kafka-based platform is a full-scale data streaming platform that enables you to easily access, store, and manage data as continuous real-time streams. The <a href=\"https://www.hashicorp.com/partners/tech/confluent#all\">Vault and Confluent Operator integration</a> leverages Vault with Kubernetes to provide only the necessary credentials to Confluent Platform to minimize operational toil and the potential exposure of credentials.</p>\n<h3><a href=\"#elastic\">»</a><a></a>Elastic</h3>\n<p>The Vault and Elastic Monitoring platform <a href=\"https://www.hashicorp.com/partners/tech/elastic#vault\">integration</a> is powered by Elastic Agent to collect logs and metrics from Vault so that they can be monitored within Elastic Observability. Three data streams are sent to the Elastic Stack for different types of monitoring scenarios: audit, logs, and metrics.</p>\n<h3><a href=\"#jfrog\">»</a><a></a>JFrog</h3>\n<p>JFrog has completed two <a href=\"https://www.hashicorp.com/partners/tech/jfrog#vault\">Vault integrations</a>. The Vault &amp; Artifactory secrets plugin talks to JFrog Artifactory server (5.0.0+) and dynamically provisions access tokens with specified scopes. The backend can be mounted multiple times to provide access to multiple Artifactory servers. Artifactory is used for automating, managing, securing, distributing, and monitoring all types of binaries.</p>\n<p>The second integration between the JFrog Platform (used to give customers an end-to-end pipeline to control the flow of binaries from build to production) and Vault enables administrators to configure an external Vault connection for centralized secrets management. You can store JFrog Platform GPG keys, RSA keys, and trusted keys as secrets in Vault.</p>\n<h3><a href=\"#micro-focus\">»</a><a></a>Micro Focus</h3>\n<p>Micro Focus has completed two <a href=\"https://www.hashicorp.com/partners/tech/micro-focus#all\">Vault integrations</a>. The first is an integration between Vault and ConnectedMX, a secure, cloud-based endpoint data protection solution, where Vault is an external key management server providing encryption keys for encrypting data at rest. The second integration uses Vault as an external credential store to provide credentials to UCMDB (Universal Configuration Management Database) for discovery.</p>\n<h3><a href=\"#opsera\">»</a><a></a>Opsera</h3>\n<p><a href=\"https://www.hashicorp.com/partners/tech/opsera#all\">Opsera's</a> continuous orchestration platform can integrate with Vault to store secrets, passwords, keys, and certificates and retrieve them for seamless use in DevOps CI/CD pipelines.</p>\n<h3><a href=\"#securosys\">»</a><a></a>Securosys</h3>\n<p><a href=\"https://www.hashicorp.com/partners/tech/securosys-sa#vault\">Vault integrates</a> with the Securosys HSM via the PKS#11 cryptography standard for customers who need hardware-backed security. The integration supports auto unseal and seal migration, cryptographic key generation and management, and external entropy.</p>\n<h3><a href=\"#thales\">»</a><a></a>Thales</h3>\n<p>Thales CipherTrust Manager (CTM) is an enterprise key-management solution whose recent <a href=\"https://www.hashicorp.com/partners/tech/thales#all\">Vault integration</a> lets customers use CTM to wrap Vault’s master key via PKS#11 and trigger auto unseal for Vault.</p>\n<h2><a href=\"#learn-more\">»</a><a></a>Learn More</h2>\n<p>The <a href=\"https://www.vaultproject.io/docs/partnerships\">HashiCorp Vault Integration Program</a> allows for partners to integrate their products to work with HashiCorp Vault (both the open source or Enterprise versions) or <a href=\"https://cloud.hashicorp.com/\">HashiCorp Cloud Platform</a> (HCP) Vault. Learn more at <a href=\"https://www.vaultproject.io/docs/partnerships\">https://www.vaultproject.io/docs/partnerships</a>.</p>\n<p>As a fully managed service, HCP Vault is the easiest way to secure, store, and tightly control access to tokens, passwords, certificates, encryption keys, and other sensitive data. For more information about HCP Vault and pricing, please visit the <a href=\"https://cloud.hashicorp.com/\">HCP product page</a> or <a href=\"https://portal.cloud.hashicorp.com/sign-up\">sign up</a> through the <a href=\"https://portal.cloud.hashicorp.com\">HCP portal</a>.</p>\n<p><strong>More Information on Earlier Vault Integrations:</strong></p>\n<ul>\n<li><a href=\"https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners\">HashiCorp Vault Surpasses 100 Integrations with 75 Partners</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/hashicorp-vault-integrates-with-servicenow-for-credential-management\">HashiCorp Vault Integrates with ServiceNow for Credential Management</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations\">GitHub, F5, and Okta Among New HCP Vault Integrations</a></li>\n<li><a href=\"https://www.globenewswire.com/news-release/2021/04/07/2206128/0/en/HashiCorp-Releases-Identity-based-Security-as-a-Service-on-the-HashiCorp-Cloud-Platform.html\">HashiCorp Releases Identity-based Security as a Service on the HashiCorp Cloud Platform</a></li>\n</ul>","author":"Karen Hui","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"adf55b369b89be851656150b6b0135c53f06eb52f04b46c9c968338a729b090c","category":"Tech"}