{"title":"A historic Falcon 9 made a little more history Friday night","link":"https://arstechnica.com/?p=1981177","date":1699056670000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/f9star626-800x533.jpg\" alt=\"A Falcon 9 rocket lifts off from Cape Canaveral Space Force Station on Friday night.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/f9star626.jpg\">Enlarge</a> <span>/</span> A Falcon 9 rocket lifts off from Cape Canaveral Space Force Station on Friday night. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CAPE CANAVERAL, Florida—In three-and-a-half years of service, one of SpaceX's reusable Falcon 9 boosters stands apart from the rest of the company's rocket inventory. This booster, designated with the serial number B1058, has now flown 18 times. For its maiden launch on May 30, 2020, the rocket <a href=\"https://arstechnica.com/science/2020/05/todays-the-day-weather-permitting-america-is-returning-to-space/\">propelled NASA astronauts Doug Hurley and Bob Behnken</a> into the history books on SpaceX's first mission to send people into orbit.</p>\n<p>This ended a nine-year gap in America's capability to launch astronauts into low-Earth orbit and was the first time a commercial spacecraft achieved this feat. At that time, the rocket was fresh from SpaceX's factory in Southern California, glistening white in color, with a bright red NASA \"worm\" logo emblazoned on the side.</p>\n<p>Over the course of its flights to space and back, that white paint has darkened to a charcoal color. Soot from the rocket's exhaust has accumulated, bit by bit, on the 15-story-tall cylinder-shaped booster. The red NASA worm logo is now barely visible.</p></div><p><a href=\"https://arstechnica.com/?p=1981177#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1981177&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"adf819767524446c604859d03e7f01a7e27c5e9b6ef3efc23f0c3bd6aa1eb13f","category":"Tech"}