{"title":"The Universe in a lab: Testing alternate cosmology using a cloud of atoms","link":"https://arstechnica.com/?p=1987861","date":1701461045000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/image-1-800x450.jpeg\" alt=\"Multicolored waves spread out within a pill-shaped area.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/image-1.jpeg\">Enlarge</a> <span>/</span> Density waves in a Bose-Einstein condensate. (credit: <a href=\"https://svs.gsfc.nasa.gov/cgi-bin/details.cgi?aid=11479\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In the basement of Kirchhoff-Institut für Physik in Germany, researchers have been simulating the Universe as it might have existed shortly after the Big Bang. They have created a tabletop quantum field simulation that involves using magnets and lasers to control a sample of potassium-39 atoms that is held close to absolute zero. They then use equations to translate the results at this small scale to explore possible features of the early Universe.</p>\n<p>The work done so far shows that it’s possible to simulate a Universe with a different curvature. In a positively curved universe, if you travel in any direction in a straight line, you will come back to where you started. In a negatively curved universe, space is bent in a saddle shape. The Universe is currently flat or nearly flat, according to Marius Sparn, a PhD student at Kirchhoff-Institut für Physik. But at the beginning of its existence, it might have been more positively or negatively curved.</p>\n<h2>Around the curve</h2>\n<p>“If you have a sphere that's really huge, like the Earth or something, if you see only a small part of it, you don't know—is it closed or is it infinitely open?” said Sabine Hossenfelder, member of the Munich Center for Mathematical Philosophy. “It becomes a philosophical question, really. The only things we know come from the part of the Universe we observe. Normally, the way that people phrase it is that, for all we know, the curvature in this part of the Universe is compatible with zero.”</p></div><p><a href=\"https://arstechnica.com/?p=1987861#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987861&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ae0ab4c5000fb1ff9e73e31ec0d7800df02983f46e8ce702ebd181cb6892a4e3","category":"Tech"}