{"title":"Increased tree water use with the development of a dense understory layer in a North American hardwood forest","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2648?af=R","date":1722317571000,"content":"<h2>Abstract</h2>\n<p>The formation of a single species, recalcitrant understory vegetation layer can limit tree regeneration and, in the long term, modify the composition of forests. Few studies have investigated how recalcitrant vegetation influences competition for water resources although the formation of a dense understory is likely to modify the forest water balance. In eastern North American hardwood forests, the development of a dense understory layer of American beech (<i>Fagus grandifolia</i>) has been observed in stands dominated by sugar maple (<i>Acer saccharum</i>), a phenomenon that shares many characteristics associated with recalcitrant vegetation. Given that water availability is generally negatively correlated with stand density, we hypothesized that the formation of a dense understory beech layer increased competition for water resources, thus leading to reduced water use by sugar maple trees in beech-dominated stands. Using thermal dissipation sensors, we measured sap flux density (<i>F</i>\n<sub>\n   <i>d</i>\n</sub>) of two sugar maple trees at three beech-dominated sites and three control sites. During the growing season, <i>F</i>\n<sub>\n   <i>d</i>\n</sub> of sugar maple trees was significantly larger at beech-dominated sites compared to control sites, indicating a greater rate of water use by sugar maples in stands with a dense understory beech layer. We provide two hypotheses to explain our results at the tree scale: (i) reduced cover by forest floor vegetation could limit transpiration by this layer, thus allowing increased water availability to supply transpiration by overstory trees, or (ii) increased tree transpiration rate could be a mechanism to satisfy nutrient requirements in beech-dominated stands often associated with lower soil fertility.</p>","author":"Arielle Rasoanaivo, \nClaudele Ghotsa Mekontchou, \nPascal Rochon, \nPhilippe Nolet, \nAudrey Maheu","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"ae0c3bb73bf666a2014c7a400eaa0de6f5777858c375fc506ede8fd3293ba907","category":"Environment"}