{"title":"Obtaining and Characterizing the Industrially Important Thermostable &alpha;-Amylases from B. amyloliquefaciens and B. subtilis, Which Are Extracellularly Expressed by Bacillus Cells and Capable of Generating Different End Products after Starch Hydrolysis","link":"https://www.preprints.org/manuscript/202408.0218/v1","date":1722807392000,"content":"The production of recombinant enzymes, mainly used for obtaining pure and functional target molecules, holds significant importance in modern biotechnology. This study aimed to produce recombinant α-amylases (Amy3500 and Amy1974), derived from B. amyloliquefaciens MDC1974 and B. subtilis MDC3500 respectively, using the pBE-S shuttle vector, and to characterize them. \nBoth α-amylase genes were molecularly cloned into the E. coli/B. subtilis pBE-S shuttle vector, both with (Amy1974sig and Amy3500sig) and without their own signal peptides (Amy1974 and Amy3500), along with a signal peptide originating from the plasmid, and tested in flask fermentations. For recombinant Amy3500, the amylase variants resulted in similar levels of volumetric activity (700-750 U/mL). In contrast, the expression of Amy1974 nearly doubled compared to Amy1974sig with double signal peptides, reaching 2000 U/mL. The SDS-PAGE estimated the molecular weight of Amy1974 α-amylase to be 54.6 kDa, which was in accordance with the theoretical molecular mass calculations. However, the estimated molecular weight of Amy3500 amylase was significantly reduced when exiting the producer cells. \nCa2+ had no significant activating effect on the activities of Amy1974 amylase and Amy3500 amylase, likely due to its tight binding to the protein scaffold. Both enzymes exhibited broad activity peaks between 45-70°C, with a maximum at 65°C. The Amy1974 and Amy3500 α-amylases demonstrated broad pH optima and pH-dependent thermostability, with optimum pH values at 6.5 and 5.8, and thermal stability peaks at pH 7.6 and 5.9, respectively. Both α-amylases displayed high relative activity against various starches, including corn amylopectin and potato amylose, while showing comparatively lower activity towards cyclodextrins. The Amy1974 amylase converts starch to dextrins of varying lengths, whereas Amy3500 almost entirely converts starch into glucose.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae16c1ba014121076697382ffb313aae8d496625317d701c3046a69e28917980","category":"Interdisciplinary"}