{"title":"ผู้อำนวยการ iLaw ยื่นฟ้องหน่วยงานรัฐใช้ Pegasus เรียกค่าเสียหายจากการถูกแฮก","link":"https://www.blognone.com/node/134476","date":1687361121000,"content":"<div><div><div><p>ยิ่งชีพ อัชฌานนท์ ผู้อำนวยการโครงการอินเทอร์เน็ตเพื่อกฎหมายประชาชน (iLaw) และอานนท์ นำภา ทนายความสิทธิมนุษยชน ยื่นฟ้องหน่วยงานรัฐ 9 หน่วยงาน โดยระบุว่าหน่วยงานทั้ง 9 หน่วยนี้เป็นหน่วยงานที่อาจมีส่วนเกี่ยวข้องกับการใช้มัลแวร์ Pegasus เจาะโทรศัพท์เหยื่อทั่วโลก <a href=\"https://www.blognone.com/node/125993\">รวมถึงนักกิจกรรมในประเทศไทย</a></p>\n<p>Pegasus เป็นมัลแวร์ที่มีประสิทธิภาพสูงและถูกออกแบบมาเป็นอย่างดี กระบวนการแฮกโทรศัพท์สามารถเจาะ iOS ได้โดยใช้เพียงหมายเลขโทรศัพท์ปลายทาง และเหยื่อไม่ต้องคลิกรับข้อความใดๆ แต่สามารถ<a href=\"https://www.blognone.com/node/126338\">ส่งข้อความเข้า iMessage และแฮกโทรศัพท์ได้ทันที</a> ความร้ายแรงของ Pegasus และการที่มันถูกใช้งานเป็นวงกว้างทำให้<a href=\"https://www.blognone.com/node/125978\">บริษัทไอทีจำนวนมากออกมาฟ้อง NSO Group ผู้พัฒนา ตั้งแต่ช่วงปี 2019 ถึง 2021</a></p>\n<p>ทาง iLaw ระบุว่ามีการใช้ Pegasus ในไทยมาตั้งแต่ช่วงเดือนพฤษภาคม 2014 ช่วงเดียวกับการรัฐประหารโดยพลเอกประยุทธ์ จันทร์โอชา โดเมนที่ใช้ส่งสปายแวร์ เช่น SIAMHA[.]INFO, THTUBE[.]VIDEO, และ THAINEWS[.]AISA</p>\n<p>คำฟ้องขอให้ศาลปกครองมีคำสั่งให้หน่วยงานที่ใช้ Pegasus กับคุณยิ่งชีพ อัชฌานนท์ และคุณอานนท์ นำภา ระงับใช้งานมัลแวร์นี้, เปิดเผยข้อมูลการใช้งานและข้อมูลที่ได้ไปให้กับเจ้าของข้อมูล และลบข้อมูลออกจากฐานข้อมูล รวมถึงเรียกค่าเสียหายจากการถูกมัลแวร์เจาะระบบ</p>\n<p>ข้อมูลทางการที่แสดงให้เห็นว่ารัฐบาลไทยซื้อซอฟต์แวร์รูปแบบเดียวกับ Pegasus มาใช้งานจริง ออกมาจากพรรคก้าวไกลเมื่อปีที่แล้วที่<a href=\"https://www.blognone.com/node/129539\">ใส่ไว้ในงบประมาณประจำปี</a> แสดงให้เห็นว่า กองบัญชาการตำรวจปราบปรามยาเสพติด (ป.ป.ส.)  ขอซื้อซอฟต์แวร์นี้ในวงเงิน 350 ล้านบาท ผู้เสนอราคาตัว Pegasus คือ บริษัท เอ็นจิเนียริ่ง รีวอร์ด (ประเทศไทย) จำกัด แต่ก็ไม่มีข้อมูลว่าการใช้งานในช่วงปี 2014 นั้นเป็นการจัดซื้อโดยหน่วยงานใด</p>\n<p>ที่มา - <a href=\"https://freedom.ilaw.or.th/node/1194\">iLaw</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8245b8958c3b70581d50bdbc50578aca.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ilaw\">iLaw</a></div><div><a href=\"/topics/nso-group\">NSO Group</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ae17620bc6498b83f91cb0fc86a7606c7dcd493494405462c5a72f5fefd5a885","category":"Thai"}