{"title":"A case of transdisciplinarity and collaborative decision making: the co‐construction of Gendered Food Product Profiles","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13460?af=R","date":1710399600000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Crop breeding in sub-Saharan Africa has made considerable gains; however, post-harvest and food-related preferences have been overlooked, in addition to how these preferences vary by gender, social difference and context. This context is changing as participatory approaches using intersectional gender and place-based methods are beginning to inform how breeding programs make decisions. This paper presents an innovative methodology to inclusively and democratically prioritise food quality traits of root, tuber and banana crops based on engagement with food systems actors and transdisciplinary collaboration. The outcome of the methodology is the Gendered Food Product Profile (GFPP) – a list of prioritised food quality characteristics - to support breeders to make more socially inclusive decisions on the methods for trait characterization to select genotypes closer to the needs of food system actors.</p>\n<h2>Results</h2>\n<p>This paper reviews application of the methodology in fourteen GFPPs, presents illustrative case studies and lessons learned. Key lessons are that the transdisciplinary structure and the key role of social scientists helped avoid reductionism, supported co-learning, and the creation of GFPPs that represented the diverse interests of food system actors, particularly women, in situ.</p>\n<h2>Conclusions</h2>\n<p>The method partially addressed power dynamics in multidisciplinary decision making; however, effectiveness was dependent on equitable team relations and supportive institutions committed to valuing plural forms of knowledge. Actions to address power asymmetries that privilege particular types of knowledge and voices in decision making are crucial in techno-science projects, along with opportunities for co-learning and long-term collaboration and a transdisciplinary structure at higher level.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Lora Forsythe, \nDeborah Olamide Olaosebikan, \nBéla Teeken, \nGérard Ngoh Newilah, \nSarah Mayanja, \nAnn Ritah Nanyonjo, \nPaula Iragaba, \nBenjamin Okoye, \nPricilla Marimo, \nAkankwasa Kenneth, \nLaurent Adinsi, \nCedric Kendine, \nAdetonah Sounkoura, \nSamuel Edgar Tinyiro, \nAlexandre Bouniol, \nDominique Dufour, \nNoel Akissoé, \nTessy Madu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ae171baadbcaaca91da55ef2c7ac8fae60b9141f8fcfab4bf859a8920aa96eb7","category":"Environment"}