{"title":"Proximal Origin of Epidemic Highly Pathogenic Avian Influenza H5N1 Clade 2.3.4.4b and Spread by Migratory Waterfowl","link":"https://www.preprints.org/manuscript/202406.0060/v1","date":1717401246000,"content":"We investigate the possible laboratory origins of the highly pathogenic avian influenza (HPAI) H5N1 clade 2.3.4.4b genotype B3.13, currently affecting various animal species and causing sporadic human infections. The first detection of HPAI H5N1 clade 2.3.4.4b in the Netherlands in 2020 raises concerns about earlier gain-of-function research. The proximal origins of HPAI H5N1 Clade 2.3.4.4b may be the USDA Southeast Poultry Research Laboratory (SEPRL) in Athens, Georgia and the Erasmus Medical Center in Rotterdam, the Netherlands. Genetic analysis indicates that genotype B3.13 emerged in 2024 and exhibits genetic links to genotype B1.2, which was identified to have originated in Georgia in January 2022 after the start of serial passage research with H5Nx clade 2.3.4.4 in mallard ducks at the USDA Southeast Poultry Research Laboratory (SEPRL) in Athens, Georgia in April 2021. Genotype B1.2 was found in a bottlenose dolphin (Tursiops truncatus) in March 2022 in Florida, indicating sudden new adaptations to different animal species. The NP gene of H5N1 clade 2.3.4.4b (genotype B3.13), which is causing outbreaks in cattle, was reported to have likely originated from an avian influenza A virus derived from mallard ducks. Significant mutations found in recent human cases, including PB2 E627K and PB2 M631L, also suggest links to serial passage experiments. However, further investigation is urgently needed to confirm these findings and to identify all H5N1 laboratory leaks that may have occurred with a focus on mallard ducks and other migratory waterfowl, which have the potential to infect a large number of poultry and livestock facilities around the world. A moratorium on gain-of-function research including serial passage of H5N1 is indicated to prevent a man-made influenza pandemic affecting animals and humans.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae1f3c55b58df28feee0beff6730d1aa2c0e806d41c40f276a5da941b30f3ae8","category":"Interdisciplinary"}