{"title":"PSXI-14 Effects of diets with high and low inclusion of corn with or without high concentration of amylase on in vitro fermentative parameters and gas production","link":"https://academic.oup.com/jas/article/102/Supplement_3/753/7757633?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The study aimed to evaluate the effects of corn hybrids and the level of inclusion in the diet on in vitro fermentative parameters, DM disappearance, total gas and methane production. A 3 × 2 factorial design study was carried out to evaluate the Tropical Flint corn (TFC), Enogen Flint corn (EFC) and Enogen Dent corn (EDC), and the corn inclusion content in the diet (H: 71%; L: 42.5% of DM). The experiment was carried out using automatic gas pressure detection modules (ANKOM, RF). Rumen fluid was collected from two animals fitted with a rumen cannula and fed a diet containing 60% forage. The ruminal liquid was combined with buffer in a 1:4 ratio respectively and each bottle received 150 mL of this mixture plus 1.5 g of DM corn sample. Gas production was evaluated at the end of 24 h of incubation and a gas sample was taken for methane analysis. Furthermore, the pH of the liquid was measured at the end of 24 h and a sample was obtained for analysis of short chain fatty acids (SCFA), ammonia concentration and the final residue was used to determine de DM disappearance. The data were analyzed using Proc Mixed of SAS (9.4). There was an interaction between corn hybrid and inclusion level for the variable total SCFA (H-TFC: 70.5; H-EFC: 41.5; H-EDC: 40.7; L-TFC: 43.7; L-EFC: 38.8; L-EDC: 39.7 mM; <span>P</span> = 0.02) and proportion of butyrate (H-TFC: 9.25; H-EFC: 5.53; H-EDC: 6.01; L-TFC: 5.80; L-EFC: 5.41; L-EDC: 5.99 mM/100mM; <span>P</span> = 0.02), with greater values observed for the inclusion of TFC in relation to the other treatments. The inclusion of Enogen corn (Flint or Dent) increased propionate (TFC: 32.1; EFC: 36.3; EDC: 36.7 mM/100mM; <span>P</span> &lt; 0.01) and reduced acetate (TFC: 56.7; EFC: 55.1; EDC: 54.8 mM/100mM; <span>P</span> = 0.02) and the acetate:propionate ratio (TFC: 1.83; EFC: 1.56; EDC: 1.53; <span>P</span> &lt; 0.01). On the other hand, greater inclusion of corn in the diet increased propionate (H: 36.8; L: 33.3 mM/100mM; <span>P</span> &lt; 0.01) and reduced acetate (H: 53.5; L: 57.6 mM/100mM; <span>P</span> &lt; 0.01), acetate:propionate ratio (H: 1.50; L: 1.77; <span>P</span> &lt; 0.01), and fluid pH (H: 6.39; L: 6.46; <span>P</span> &lt; 0.01). Corn hybrids with Enogen technology increased the DM disappearance (TFC: 70.5; EFC: 73.3; EDC: 74.3%; <span>P</span> &lt; 0.01), without affecting the production of gases and methane. Furthermore, greater inclusion of corn in the diet increased the DM disappearance (H: 74.1; L: 71.2%; <span>P</span> &lt; 0.01) and gas production (H: 193.8; L: 160.5 mg/24 h; <span>P</span> &lt; 0.01), without effect on methane production. Enogen technology and increasing corn in the diet improve fermentation and increase degradation of dry matter; however, methane production increases with greater corn inclusion in the diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ae1ff4fd24e93e4e54a9b874f7d89dceb9e79f34eadc8f3e4abe07c7ed5fb809","category":"Environment"}