{"title":"Hspb1 and Lgals3 in spinal neurons are closely associated with autophagy following excitotoxicity based on machine learning algorithms","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303235","date":1715349600000,"content":"<p>by Lei Yan, Zihao Li, Chuanbo Li, Jingyu Chen, Xun Zhou, Jiaming Cui, Peng Liu, Chong Shen, Chu Chen, Hongxiang Hong, Guanhua Xu, Zhiming Cui</p>\r\n\r\nExcitotoxicity represents the primary cause of neuronal death following spinal cord injury (SCI). While autophagy plays a critical and intricate role in SCI, the specific mechanism underlying the relationship between excitotoxicity and autophagy in SCI has been largely overlooked. In this study, we isolated primary spinal cord neurons from neonatal rats and induced excitotoxic neuronal injury by high concentrations of glutamic acid, mimicking an excitotoxic injury model. Subsequently, we performed transcriptome sequencing. Leveraging machine learning algorithms, including weighted correlation network analysis (WGCNA), random forest analysis (RF), and least absolute shrinkage and selection operator analysis (LASSO), we conducted a comprehensive investigation into key genes associated with spinal cord neuron injury. We also utilized protein-protein interaction network (PPI) analysis to identify pivotal proteins regulating key gene expression and analyzed key genes from public datasets (GSE2599, GSE20907, GSE45006, and GSE174549). Our findings revealed that six genes—Anxa2, S100a10, Ccng1, Timp1, Hspb1, and Lgals3—were significantly upregulated not only in vitro in neurons subjected to excitotoxic injury but also in rats with subacute SCI. Furthermore, Hspb1 and Lgals3 were closely linked to neuronal autophagy induced by excitotoxicity. Our findings contribute to a better understanding of excitotoxicity and autophagy, offering potential targets and a theoretical foundation for SCI diagnosis and treatment.","author":"Lei Yan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae2147b985d134069732c63ca45228d0378385d67a8020778239e8c919a35201","category":"Interdisciplinary"}