{"title":"Fabrication of Graphene Oxide and Conductive Polymer on Cotton Fabric with Ultrasonic (US) Assisted Dyeing for Washable E-Textiles","link":"https://www.preprints.org/manuscript/202406.1920/v1","date":1719478840000,"content":"The graphene based highly conductive and flexible devices has received momentous attraction and growth in recent years for potential multifunctional uses. The development of flexible and washable textile sensors, actuators, energy storage and energy harvesting systems. Textile fabrics coated with graphene and conductive polymers have been used for wearable self-powered e-textiles, such as tribo-electric, piezoelectric, and Thermoelectric. Herein this research, 100% woven cotton fabric is Fictionalized with graphene oxide (GO) using industrial-scale cold pad batch dyeing technique for the development of low-grade body heat into self-powered wearable e-textiles. The conductive polymer PEDOT: PSS was coated using layer by layer approach. The study demonstrates that the resultant textile electrodes showed reduced electrical sheet resistance from 2.5 MΩ to 15KΩ, with a reduced graphene oxide and further reduced to (2.5 -12.5 Ω) for conductive polymer. The sheet resistance was decreased with the number of dyeing cycles (10-15) and increased with 20 washing cycles vice versa. The study demonstrates that the sensor response and performance were improved with increasing the content percent of rGO and PEDOT: PSS. The tensile strength of as coated fabric electrodes was improved from (25.0-85.5 mPa) and fabric thickness was increased to (26-38µm) without compromising or influencing the air permeability. The resultant textile electrodes may potentially be used in smart textiles for self-powered flexible wearable generators, sensors, and energy storage. The study demonstrates that the cold pad batch dyeing method is a suitable and effective method for the fabrication of graphene-based textiles.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae24108ae4a43efe1e31a417b41bfbcb8e99e18aadd4976df4dbaed044a30a8a","category":"Interdisciplinary"}