{"title":"Regional trends, spatial patterns and determinants of health facility delivery among women of reproductive age in Nigeria: A national population based cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312005","date":1729087200000,"content":"<p>by Tope Olubodun, Olorunfemi Akinbode Ogundele, Turnwait Otu Michael, Oluyemi Adewole Okunlola, Ayodeji Bamidele Olubodun, Semiu Adebayo Rahman</p>\r\nBackground <p>Globally, about 810 women die daily from pregnancy and childbirth complications, and the burden is highest in Africa. The United Nations sustainable development goal has a maternal mortality ratio (MMR) target of 70 per 100,000 live births by 2030. Nigeria, the largest country in Africa, has an MMR of 512 per 100,000 live births, thus there is need for intensified efforts to reduce maternal deaths in the country. Proper utilisation of maternal health services including health facilities for delivery is crucial to achieving this. This study assesses the regional trends, spatial patterns and determinants of health facility delivery among women of reproductive age in Nigeria.</p> Methods <p>This is a weighted secondary analysis of the Nigerian Demographic and Health Survey (NDHS). The sample included women who had a live birth in the preceding 5 years of the NDHS 2008, 2013 and 2018. Bivariate analysis and multilevel logistic regression were carried out to assess the determinants of health facility delivery. Trends analysis was done using bar graphs and spatial analysis showed the distribution of health facility delivery by State.</p> Results <p>Forty-one percent of women delivered their last child in a health facility. The proportion of women who delivered at a health facility increased from 2008 to 2018 for all regions, with exception of the South-south region. Determinants of facility-based delivery include; ethnicity, level of education, wealth index, exposure to mass media (AOR 1.34; 95% CI 1.20–1.50), number of childbirths, number of antenatal visits (AOR 4.03; 95% CI 3.51–4.62), getting a companion to go the health facility (AOR 0.84; 95% CI 0.72–0.98), community level poverty, community level of female education, community distance to health facility, and geographical region.</p> Conclusion <p>There is an urgent need to deploy appropriate strategies and programme to improve health facility delivery in Nigeria.</p>","author":"Tope Olubodun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae2e7951e4a1bd4d70f024bd91585bdbd70fccb5314b1966e8f4b845700a43e4","category":"Interdisciplinary"}