{"title":"Chitosan-TPP encapsulated quercetin nanoparticles: amplified protection mechanisms unveiled against Ethion-induced developmental toxicity through comprehensive in-vivo and in-silico elucidation","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae074/7675699?rss=1","date":1715904000000,"content":"<span><div>Abstract</div><div>Aim</div>The study investigated Ethion-induced developmental toxicity in Wistar albino rats and the potential ameliorative effects of quercetin and nano-quercetin co-administration. Further, In-silico docking of Ethion and quercetin with MCL-1 was conducted.<div>Methodology</div>Quercetin nanoparticles were synthesized by ionic-gelation method. The encapsulated quercetin nanoparticles were characterized for Zeta size, UV-Vis spectroscopy, encapsulation efficiency, and TEM studies. Male rats were administered Ethion (high/low dose), quercetin, and nano-quercetin alone or in combination for 60 days. Female rats were introduced for mating on the 61st day, and pregnant females were observed for 20 gestational days. On GD 20, rats were sacrificed and evaluated for body/organ weight, reproductive indices, fetal morphology, skeletal, and visceral deformities.In silico binding energies of ethion and quercetin with MCL-1 were determined.<div>Results</div>Nanoparticle size was 363.2 ± 1.23 nm on day 0 and 385.63 ± 1.53 nm on day 60, with PDI of 0.247 and charge of 22.9 mV. Absorbance maxima were at 374 nm, with encapsulation efficacy of 85.16 ± 0.33%. EHD male crossed females showed decreased body/organ weights, reduced fertility, hematoma, cleft palate, tail curling, and absence of extremity. Nano-quercetin co-administration normalized parameters comparable to controls. Both Ethion and quercetin interacted with MCL-1, with quercetin exhibiting stronger binding energy.<div>Conclusion</div>Nano-quercetin demonstrated stronger antioxidant properties than quercetin, counteracting ethion-induced maternal/fetal abnormalities.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"ae30f5b36dfd25c5edc34df30e52e140150d797c3e4b938bb5b893e2c502ef51","category":"Environment"}