{"title":"Stochastic Modeling of Thin Mud Drapes Inside Point Bar Reservoirs With ALLUVSIM‐GANSim","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035989?af=R","date":1718806534000,"content":"<h2>Abstract</h2>\n<p>Modeling inclined fine-scale mud drapes inside point bars, deposited on accretion surfaces during stages of low energy or slack water, is critical to modeling fluid flow in complex sedimentary environments (e.g., fluvial and turbidity flows). These features have been modeled using deterministic or geostatistical modeling tools (e.g., object-, event-, and pixel-based). However, this is a non-trivial task due to the need to preserve geological realism (e.g., connectivity within sedimentary features and facies hierarchy), while being able to condition the generated models to point data (e.g., well data). Generative Adversarial Networks (GAN) have been successfully applied to reproduce several large-scale scenarios (e.g., braided rivers and carbonate reservoirs), yet their potential for capturing small-scale and hierarchical features remains largely unexplored. Here, we propose a geo-modeling workflow for fast modeling of small-scale conditional mud drapes based on ALLUVSIM and GANSim. Initially, improved ALLUVSIM produces realistic unconditional models of mud drapes along accretionary surfaces, serving as GAN training data. GANSim is then employed to achieve conditioning to well data and probability maps derived from geophysical modeling. Finally, temporal pressure data observed in wells are further conditioned via a Markov chain Monte Carlo sampling method. The proposed geo-modeling workflow is validated in a two-dimensional synthetic example as the pre-trained generator extracts mud-drapes-features and generates multiple facies realizations conditioned to diverse information. A field application example in a modern meandering river verifies the effectiveness and practicability of the proposed workflow in real case application examples. The application examples illustrate the potential of the proposed method to predict mud drapes inside point bar reservoirs.</p>","author":"Xun Hu, \nSuihong Song, \nJiagen Hou, \nYanshu Yin, \nMingqiu Hou, \nLeonardo Azevedo","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"ae307000a09548a2c214b1b394fc9cd7c195274b01ef7eac5662fd0f9e8dd620","category":"Environment"}