{"title":"Computational Model of the Effect of pH on Calcium Carbonate Precipitation by Sporosarcina pasteurii","link":"https://www.preprints.org/manuscript/202409.0815/v1","date":1725969519000,"content":"Utilising the metabolic processes (urease activity) of certain microorganisms that result in the precipitation of calcium carbonate (CaCO3) as a sustainable method for manufacturing self-healing cementitious materials for use in the construction, soil stabilization, and wind-induced erosion industries has garnered considerable attention over the last twenty years. Despite extensive efforts for experimental characterization of the effect of numerous influential factors such as the bacteria type, nutrition type and quantity, and environmental conditions governing this phenomenon, computational modeling of this biochemical process has not advanced significantly due to its complexity and intertwined involved parameters. Among these parameters, pH is of special significance since the initial pH level has an immediate effect on the bacteria's urease activity, which then influences the rate at which calcium carbonate precipitates. Furthermore, during the CaCO3 precipitation process, pH changes due to the generation of byproducts such as ammonium, which alters the velocity of the bacteria's urease activity continuously.The present study proposes a computational model for calcium carbonate precipitation by urease activity of Sporosarcina pasteurii using COMSOL Multiphysics®. The theoretical background on governing parameters and chemical reactions involved in the process are discussed. The model takes into account the impact of calcium and urea concentrations, as well as the initial pH level and pH variations caused by the production of by-products during the process. The capability of the model to foresee CaCO3 concentration and ultimate pH level is evaluated by comparing the computational outcomes with empirical data obtained from established literature sources. The influence of the initial pH of the environment on the pH variation of the system during the precipitation process was simulated and compared to actual data available in the literature, suggesting that the model can accurately predict the kinetic. Finally, a parametric analysis is performed to identify the ideal initial environmental pH for calcium carbonate precipitation by the S. pasteurii bacterium.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae31545c038e2ae58faee743b2356e27a78593e58c581f26826c6b4c9e2ab8d5","category":"Interdisciplinary"}