{"title":"Methyltransferase TaSAMT1 mediates wheat freezing tolerance by integrating brassinosteroid and salicylic acid signaling","link":"https://academic.oup.com/plcell/article/36/7/2607/7635927?rss=1","date":1711497600000,"content":"<span><div>Abstract</div>Cold injury is a major environmental stress affecting the growth and yield of crops. Brassinosteroids (BRs) and salicylic acid (SA) play important roles in plant cold tolerance. However, whether or how BR signaling interacts with the SA signaling pathway in response to cold stress is still unknown. Here, we identified an SA methyltransferase, TaSAMT1 that converts SA to methyl SA (MeSA) and confers freezing tolerance in wheat (<span>Triticum aestivum</span>). <span>TaSAMT1</span> overexpression greatly enhanced wheat freezing tolerance, with plants accumulating more MeSA and less SA, whereas <span>Tasamt1</span> knockout lines were sensitive to freezing stress and accumulated less MeSA and more SA. Spraying plants with MeSA conferred freezing tolerance to <span>Tasamt1</span> mutants, but SA did not. We revealed that BRASSINAZOLE-RESISTANT 1 (TaBZR1) directly binds to the <span>TaSAMT1</span> promoter and induces its transcription. Moreover, TaBZR1 interacts with the histone acetyltransferase TaHAG1, which potentiates <span>TaSAMT1</span> expression via increased histone acetylation and modulates the SA pathway during freezing stress. Additionally, overexpression of <span>TaBZR1</span> or <span>TaHAG1</span> altered <span>TaSAMT1</span> expression and improved freezing tolerance. Our results demonstrate a key regulatory node that connects the BR and SA pathways in the plant cold stress response. The regulatory factors or genes identified could be effective targets for the genetic improvement of freezing tolerance in crops.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"ae38ab1eeae7627c7afb31d8724a41a14a44abcbbe717393d566957619d8876c","category":"Environment"}