{"title":"Child-related factors associated with depressive symptoms among mothers of school-going children in urban Bangladesh: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304480","date":1716991200000,"content":"<p>by Sharmin Sultana, Faisal Muhammad, A. B. M. Alauddin Chowdhury, Sabuj Kanti Mistry</p>\r\nObjective <p>This study aimed to identify the child-related factors associated with depressive symptoms among mothers of school-going children in Dhaka city of Bangladesh.</p> Methods <p>The study followed a cross-sectional design and was conducted between June and December 2019 among mothers of school-going children from Dhaka City, Bangladesh. A multistage sampling technique was adopted, and a total of 324 mothers of school-going children studying in the same school for at least six months were selected. Depressive symptoms of mothers were measured using a 20-item Self-Rating Depression Scale weighted to 100 percent, with 25–49 categorized as no depression and ≥ 50 as having depression. A binary logistic regression model was executed to identify the child-related factors associated with depressive symptoms among mothers. All statistical analyses were performed using the statistical software, Stata (Version 14.0).</p> Results <p>More than half of the participants (54.3%) were aged 40 years or above and had up to HSC level education (52.5%). The majority of the participants were homemakers (67.0%), mothers of a girl child (53.1%), and had a family income of 50,000 BDT or more (52.8%). Adjusted analyses revealed that the mother’s depressive symptoms were associated with their child’s frequent complaints of headaches or stomach aches (aOR = 13.19, 95% CI 3.03–57.37), having an injury (aOR = 4.05, 95% CI 1.44–11.41), and unfriendly relationship with mothers (aOR = 21.46, 95% CI 5.04–91.28).</p> Conclusion <p>The present study highlighted several child-related factors that are associated with depressive symptoms among mothers that need to be considered while designing any intervention to address depressive symptoms among mothers of school-going children. It is also important to counsel mothers and fathers of the children about the importance of having a sound mother-child relationship while addressing depressive symptoms among mothers.</p>","author":"Sharmin Sultana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae3921fb7c801c25cdcdb5f52a5426cb97b27bb44590c5b98f1f61d232ed0d60","category":"Interdisciplinary"}