{"title":"Enhancing long COVID care in general practice: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306077","date":1719410400000,"content":"<p>by John Broughan, Emīls Sietiņš, Ka Yuet Emily Siu, Nia Clendennen, Claire Collins, Ronan Fawsitt, John S. Lambert, Stefano Savinelli, Stephanie Skeffington, Geoff McCombe, Walter Cullen</p>\r\nIntroduction <p>Research suggests that general practice can play an important role in managing long COVID. However, studies investigating the perspectives of general practitioners (GPs) and patients are lacking and knowledge regarding optimal long COVID care in general practice is therefore limited.</p> Aim <p>To investigate GPs’ and patients’ perspectives on the topic of long COVID and its management in general practice.</p> Methods <p>Brief questionnaires (GP n = 11, Patient n = 7) and in-depth semi-structured interviews (GP n = 10, Patient n = 7) were conducted with GPs and patients from Irish general practices during July 2022-January 2023. Interviews were conducted via telephone and audio recordings were transcribed. A phenomenological analysis involving reflexive thematic analysis and constant comparison techniques was adopted.</p> Results <p>Analysis of interviews with GPs (male = 7, female = 3; median age = 50yrs (IQR = 39.5–56)) and patients (males = 2, female = 5; median age = 58yrs (IQR = 45-62yrs) generated four themes. These were (1) Complex presentations (2) the value of standardising care, (3) choosing the right path, and (4) supportive and collaborative doctor-patient relationships. Strong agreement was observed among GPs and patients regarding the need for holistic and integrated multidisciplinary care. Supportive and collaborative doctor-patient relationships were largely well received by GPs and patients also. GPs strongly endorsed standardising long COVID care operations.</p> Conclusion <p>GPs and patients indicated that structured, integrated, and collaborative care can help optimise long COVID management in general practice. GPs are advised to incorporate these elements into their long COVID care practices going forward. Future research examining stakeholder’s perspectives using larger and longitudinal samples is advised to enhance the generalisability of evidence in this area.</p>","author":"John Broughan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae4dbcfd048f0f46ae77ba534597da22ef263965c4df7af8db6410fbef222554","category":"Interdisciplinary"}