{"title":"Opening day at the Taipei Cycle Show 2023","link":"https://www.cyclingtips.com/2023/03/opening-day-at-the-taipei-cycle-show-2023/","date":1679515725000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/p5pb24423317.jpeg?width=1200\" alt=\"Opening day at the Taipei Cycle Show 2023\" /></figure><p>Four years have elapsed since <i>CyclingTips</i> set foot in the hallowed grounds of the Taipei Cycle Show.<span> </span></p>\n<p>That’s an eternity in the world of cycling gear, especially after the tumultuous time cycling has had since the 2020 show became one of the first high-profile COVID-19 cancellations.</p>\n<p>Based in one of cycling’s major manufacturing hubs, Taipei Cycle is one of the rare remaining cycling trade shows where important industry business predominates.</p>\n<p>If brands need to meet with factories or OEM manufacturers, it is likely happening here. Closed-door meetings and important business are happening all around these halls overflowing with new gear. Flashing a press badge here won’t open many doors — in fact, it sometimes slams them right in your face.<span> </span></p>\n<p>But nevertheless, amongst the overwhelming sea of vendors, there are cutting-edge ideas and products left and right, a glimpse into the next big things in cycling — alongside plenty of products that will never see the light of day.</p>\n<p>What treasures and trends does this show hold in a vastly changed landscape?<span> </span></p>\n<p>We went to find out.<span> </span></p>\n<h2>Topeak Fezā CAGE R10S ultra lightweight bottle cage</h2>\n<figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505896-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /></figure>\n</figure>\n<p>I don’t think it’s possible for a bottle cage to be any more minimalist than the Topeak Fezā, an ultralight kevlar and carbon design with one continuous line that weighs just 10 grams in the R10S road version. There are also gravel and mountain bike models available that presumably offer more grip on the bottle. Those weigh 12 and 15 grams, respectively.</p>\n<h2>The Air Atlas sets a new benchmark for Limar aero helmets</h2>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/p5pb24423317.jpeg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption>(Image: Brian Park)</figcaption></figure></figure>\n<p>Airplane wings and raindrops: what do they have in common? That’s right, they’re the aero inspo for Limar’s new benchmark aerodynamic helmet, besting the Limar Air Revolution. It does this with the help of a removable piece called the “UFO” that takes the helmet’s aerodynamics to another level; Limar claims the new lid to be the fastest tested. Developed with Team Astana, the helmet has been designed to still be breathable, too, so that it’s, you know, actually wearable. Available in both Mips and non-Mips versions.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/p5pb24423314.jpeg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption><span>The Air Atlas with the “UFO” cover. (Image: Brian Park)</span></figcaption></figure>\n<h2>Tioga Weeny minimalist saddle</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505864-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /></figure>\n<p>In the immortal words of Jeff Goldblum: “your scientists were so preoccupied with whether or not they could, they didn’t stop to think if they should.” There’s minimalist, and then there’s the Tioga Weeny. This 80-gram saddle does away with everything superfluous, such as any rails at all — that’s right, it uses a direct bolt-on system instead.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505862-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /><figcaption><span>Normal minimal saddles for reference.</span></figcaption></figure>\n<h2>The ITM 50-CR cockpit has a built-in computer mount</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/IMG_8263-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /></figure>\n<p>Italian brand ITM has a clever solution to mounting accessories to an aero one-piece bar/stem: integrate the mount within the handlebar itself. The ITM 50-CR cockpit puts your computer right above your stem and also allows you to run a light, camera, or other accessories below the bar. Coupled with its internal routing, it makes for a super clean look.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/IMG_8265-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/IMG_8264-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /></figure>\n<h2>ReadyGo Lumis saddle accessory system</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505757-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /></figure>\n<p>As my home in California has gotten an onslaught of rain this winter, I’ve had to come to terms with riding in the wet…. sometimes. It turns out that shoving a fender, bag and light under a saddle can be a hassle. The ReadyGo Lumis saddle storage system offers a clever solution that lets you clip on accessories as needed, all designed to work with one another. Bag, fender, and light all at once? No problem.</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505756-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /><figcaption>You can modify the system as needed.</figcaption></figure></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505755-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /><figcaption>The light works in conjunction with the fender.</figcaption></figure></figure>\n<h2>Skwiki’s super clever CO2 inflation tool</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/IMG_8237-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /></figure>\n<p>Of all the things I saw today, none made me want to pull out my wallet more than this clever Preset CO2 Inflator from Skwiki. The head screws onto a standard CO2 cartridge and lets you set your desired tire pressure (+/- 5 PSI tolerance). After reaching that pressure, the air is bypassed from entering the tire. It also works in reverse as well, so you can deflate a tire to a desired pressure.</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/IMG_8239-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption>The top dial can be set to a desired air pressure. No more over-inflating tires during roadside flat fixes.</figcaption></figure></figure>\n<h2>New SRAM Force on display</h2>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505891-1340x892.jpg?width=730\" alt width=\"1340\" height=\"892\" /><figcaption>Trickle up ergonomics.</figcaption></figure></figure>\n<p>This one isn’t exactly brand new at the show, but it was interesting to see the brand new Force levers, which have the same ergonomics as the Rival AXS levers, alongside the Red levers, which have yet to be upgraded. It’s an unusual case of trickling up design from the lower tier to the top in reverse order.</p>\n<p>Stick around all week for daily coverage from Taipei!</p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ae4fd62645eb526553992aec29dacda7f2f7b818769d26dadc6b64673de7953f","category":"Cycling"}