{"title":"House committee approves bill that could break up Amazon, Apple, and Google","link":"https://arstechnica.com/?p=1776055","date":1624567237000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-monopoly-800x519.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-monopoly.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images | MichaelJay</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The House Judiciary Committee approved antitrust legislation that could prohibit platform operators like Amazon, Apple, Google, and Facebook from favoring their own products and services, and the legislation could even break up industry giants by forcing them to eliminate or sell certain divisions. Companies could also face fines of 15 percent of their annual revenue.</p>\n<p>Bills introduced by Democrats were approved in a <a href=\"https://judiciary.house.gov/calendar/eventsingle.aspx?EventID=4601\">hearing</a> that began Wednesday morning, recessed at 5 am EDT Thursday, reconvened late Thursday morning, and finished around 3 pm. The final and most controversial bill approved was the <a href=\"https://docs.house.gov/meetings/JU/JU00/20210623/112818/BILLS-117-HR3825-N000002-Amdt-6.pdf\">Ending Platform Monopolies Act</a>, which \"eliminates the ability of dominant platforms to leverage their control over across multiple business lines to self-preference and disadvantage competitors in ways that undermine free and fair competition,\" a <a href=\"https://cicilline.house.gov/press-release/house-lawmakers-release-anti-monopoly-agenda-stronger-online-economy-opportunity\">press release</a> from Antitrust Subcommittee Chairman David Cicilline (D-R.I.) on June 11 said.</p>\n<p>The 21-20 vote went mostly along party lines, but Republicans Ken Buck (R-Colo.) and Matt Gaetz (R-Fla.) supported the bill. Democrats who opposed it were Zoe Lofgren (D-Calif.); Eric Swalwell (D-Calif.); Lou Correa (D-Calif.); and Greg Stanton (D-Ariz.).</p></div><p><a href=\"https://arstechnica.com/?p=1776055#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1776055&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ae5dbb0a36b3d7b2fe35716404f85fe64f88e03dfd15e4c4105c83db92ed8fdd","category":"Tech"}