{"title":"Apple Has Increased Use of Cargo Ships and Private Jets to Minimize Shipping Delays Amid Pandemic","link":"https://www.macrumors.com/2021/02/08/apple-measures-to-minimize-shipping-delays/","date":1612795116000,"content":"<a href=\"https://www.theinformation.com/articles/inside-apples-mad-dash-to-avoid-shipping-delays-amid-pandemic\"><em>The Information</em>'s Wayne Ma</a> today shared an overview of the \"unorthodox and costly steps\" that Apple has taken to avoid product shipping delays amid the pandemic, including the increased use of container ships, private jet charters, and more.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/Apple_iphone12-iphone12pro-ipadair-availability-louisville-kentucky-01_10222020_big.jpg.large_2x.jpg\" alt=\"\" width=\"1960\" height=\"1284\" class=\"aligncenter size-full wp-image-766256\" />\r\n<br/>\r\nThe report claims that Apple began shipping some AirPods by sea for the first time last year:<blockquote>For example, last year Apple began shipping some AirPods by sea for the first time. In the third quarter of last year, the company greatly increased ocean freight for older model iPhones, whose delivery is less time sensitive, to free up air cargo space for the new iPhone 12, according to an analysis of vessel manifest data and the person with direct knowledge of Apple's logistics operations.</blockquote>Apple has occasionally faced some issues with shipping products by sea rather than air. In late November, for example, the report claims that a large container ship headed from China to California tipped over, spilling around 1,800 of its containers into the ocean, and at least one of those containers was holding Beats headphones.\r\n<br/>\r\n\r\n<br/>\r\nApple also chartered more than 200 private jets to ship devices in 2020, a single-year record for the company, according to the report:<blockquote>Apple frequently turned to pricier private jet charters to ship its products out of Asia because its delivery partners had run out of capacity in the cargo holds of passenger planes. Last year, Apple chartered more than 200 planes for these shipments, setting a single-year record for the company, according to the person with direct knowledge of its logistics operations. To put that in perspective, ahead of the launch of the iPhone 7 in 2016, Apple chartered just three planes for the devices after it used up passenger plane capacity, a different person involved in its shipments said.</blockquote>To further speed up deliveries, the report claims that Apple has accelerated a plan to use its retail stores across the United States and Canada as \"small distribution centers,\" allowing Apple's courier partners like FedEx and UPS to collect products from an Apple retail store and deliver them to customers within close proximity of the store. The plan was <a href=\"https://www.macrumors.com/2020/10/09/apple-stores-faster-product-deliveries/\">first reported by <em>Bloomberg</em>'s Mark Gurman</a> in October.\r\n<br/>\r\n\r\n<br/>\r\nAll in all, most Apple products took only a few days longer than average to be delivered in 2020, according to a source cited in the report.<br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/08/apple-measures-to-minimize-shipping-delays/\">Apple Has Increased Use of Cargo Ships and Private Jets to Minimize Shipping Delays Amid Pandemic</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-has-increased-use-of-cargo-ships-and-private-jets-to-minimize-shipping-delays-amid-pandemic.2283820/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kl-BKa_644A:8zQqm_AXcYY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kl-BKa_644A:8zQqm_AXcYY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/kl-BKa_644A\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ae611a91f72312643ff1d36c52567c4466937588feb360b65e60f2eb88bb1f3b","category":"Apple"}