{"title":"Recurrent Lower Urinary Infection in Diabetic and Non Diabetic Patients: Retrospective Analysis on the Effect of a Multi-Strain Probiotic (vsl#3) plus Rifaximin as Prophylaxis","link":"https://www.preprints.org/manuscript/202409.2426/v1","date":1727699403000,"content":"Lower urinary tract infections (L-UTIs) represent a significant clinical concern, particularly in outpatient follow-up settings within internal medicine and infectious disease practices. L-UTIs have been shown to correlate with elevated glycate-haemoglobin levels in patients with diabetes, highlighting the need for targeted interventions in this population. We hypothesized that the incidence of L-UTIs could be reduced through a prophylactic regimen combining probiotics and rifaximin, both known for their potential benefits in maintaining gut health and controlling bacterial overgrowth.\nIn a retrospective cohort study involving 350 patients, including 155 individuals with diabetes (Group A) and 195 without diabetes serving as a control group (Group B), we evaluated the effectiveness of prophylaxis strategy. Over an 18-month follow-up period, we observed that the use of rifaximin combined with a multi-strain probiotic was associated with a statistically significant reduction in L-UTI episodes in both groups. Notably, this reduction was more pronounced in diabetic patients (Group A), suggesting that this population may benefit more from the prophylaxis regimen due to their higher baseline risk of infection.\nThese findings support the potential efficacy of rifaximin and probiotics as a preventive strategy against L-UTIs, particularly in diabetic patients who are more susceptible to these infections. Further research is warranted to better understand the underlying mechanisms and to refine this approach, but these initial results indicate a promising avenue for reducing L-UTI burden in at-risk populations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae63021893d6cbbad5bab921d2d9aa2fdb5317694a37b707fbf7140de6347e73","category":"Interdisciplinary"}