{"title":"An Empirical Study on ERP Travel, Trade, and Tourism Systems","link":"https://www.preprints.org/manuscript/202409.2217/v1","date":1727571274000,"content":"In this paper, we present findings from a recently completed research about the use of enterprise resource planning (ERP) in travel, trade, and tourism businesses. Initially, we selected twelve existing travel, trade, and tourism ERP systems and preform practical analysis and testing of these systems via JMETER and Google chrome Lighthouse tools. In addition to that, an online survey was conducted (with an e-mail invitation and telephone call reminder) to collect data from three Pakistani Travel, Trade, and Tourism organizations. Furthermore, we adopted qualitative research practices by going through various research papers and research studies from journals, books, and internet, etc. This study is constructed on only secondary statistics. The goal of this article is to look at ERP systems in terms of their concept and use, as well as how they affect the modern travel business. An ERP system is a business system that integrates several corporate processes into a single database, such as supply chain management, manufacturing, financial management, and project management. ERP systems are utilized in a variety of businesses around the world, including in the manufacturing and service industries. Across a range of industries, service firms have recently spent significant resources on the implementation of Enterprise Resource Planning (ERP) systems to improve the efficiency, cost-effectiveness, and quality of service operations. To assist them to build their businesses, the travel, trade, and tourist industries all rely on an integrated information network. The work focuses on only one industry i-e Travel, Trade, and Tourism. This may limit the applicability of its broad conclusions to other industries or industries. The findings of this study compare and contrast the ERP implementation challenges faced by existing organizations of travel, trade, and tourism companies. This is the first empirical study on the difficulties surrounding ERP installation in travel, trade, and tourism companies. It is also the first study to compare ERP adoption in multiple companies in the areas of travel, trade, and tourism.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae657fe299c6c0115f917388f8af4ed7c10f0087216bc47a1e866a9219158f5a","category":"Interdisciplinary"}