{"title":"The effectiveness and impact of disinfection with chlorine on embryos and early hatchlings of two Western Pacific octopus species","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13074?af=R","date":1714619978000,"content":"<h2>Abstract</h2>\n<p>Replicating maternal care and incubating octopus embryos artificially is advantageous to improve access to embryonic stages, split and share broods, and reduce the required space to culture large quantities of embryos. However, without female care and adequate rearing systems, the risk of bacterial and fungal infections can be high. This study evaluated the potential effects of low-concentration sodium hypochlorite (NaOCl) as a disinfectant on embryonic survival, hatchling survival, and growth. Embryos of a holobenthic octopus, <i>Amphioctopus fangsiao</i>, and of a merobenthic octopus, <i>Octopus sinensis</i>, were disinfected with 0.004% NaOCl for 3 min either once at the start (IB), at the start and halfway point (RB), and without disinfection (control). Survival of <i>A. fangsiao</i> embryos differed among treatments initially, but the final number of hatchings did not differ among treatments. No differences in the final survival for <i>O. sinensis</i> embryos were observed among the three treatments. Wet weight and growth for <i>A. fangsiao</i> juveniles did not differ among treatments at any point. In contrast, initial and final dry weight for <i>O. sinensis</i> paralarvae from the control treatment were heavier compared to the IB and RB treatments. These results suggest that NaOCl used as disinfectant has a species-specific effect on early hatchlings depending on the octopus life history.</p>","author":"Stefan Spreitzenbarth, \nYuto Ureshino, \nMisato Soma, \nAyako Shimba, \nYoshinori Kamei, \nShigeki Dan","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"ae6bfe67303916e409313ea2d567bf6f1603c62284fda7b549277892993cc441","category":"Environment"}