{"title":"Stationary stable cross-correlation pattern and task specific deviations in unresponsive wakefulness syndrome as well as clinically healthy subjects","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300075","date":1710511200000,"content":"<p>by David E. Apablaza-Yevenes, María Corsi-Cabrera, Antonieta Martinez-Guerrero, Georg Northoff, Caterina Romaniello, Marina Farinelli, Erik Bertoletti, Markus F. Müller, Zeidy Muñoz-Torres</p>\r\n\r\nBrain dynamics is highly non-stationary, permanently subject to ever-changing external conditions and continuously monitoring and adjusting internal control mechanisms. Finding stationary structures in this system, as has been done recently, is therefore of great importance for understanding fundamental dynamic trade relationships. Here we analyse electroencephalographic recordings (EEG) of 13 subjects with unresponsive wakefulness syndrome (UWS) during rest and while being influenced by different acoustic stimuli. We compare the results with a control group under the same experimental conditions and with clinically healthy subjects during overnight sleep. The main objective of this study is to investigate whether a stationary correlation pattern is also present in the UWS group, and if so, to what extent this structure resembles the one found in healthy subjects. Furthermore, we extract transient dynamical features via specific deviations from the stationary interrelation pattern. We find that (i) the UWS group is more heterogeneous than the two groups of healthy subjects, (ii) also the EEGs of the UWS group contain a stationary cross-correlation pattern, although it is less pronounced and shows less similarity to that found for healthy subjects and (iii) deviations from the stationary pattern are notably larger for the UWS than for the two groups of healthy subjects. The results suggest that the nervous system of subjects with UWS receive external stimuli but show an overreaching reaction to them, which may disturb opportune information processing.","author":"David E. Apablaza-Yevenes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae6cf7d9310b0764b584800dbb2ee26cf79e459e5e56b8faded9b8192339adb7","category":"Interdisciplinary"}