{"title":"The Whole Genome Sequence of Pseudomonas fernandeno sp. nov. from Soil and the Agricultural Discovery Pipeline","link":"https://www.preprints.org/manuscript/202404.0566/v1","date":1712581592000,"content":"The purpose of this study was to identify candidate novel species performing beneficial ecological functions from soil. The hypothesis was that novel culturable species with antibiotic production potential could be readily found from soil in the Nature Canyon at Los Angeles Pierce College. 137 bacterial isolates from soil were grown on nutrient agar, ISP-6 medium, or LB agar and partial 16S was ascertained using the Sanger platform for regions V1-V4. One of the potentially novel isolates, Pseudomonas sp. 21-C3-ER, was isolated on nutrient agar from fallow soil in an agricultural nature preserve in Los Angeles. The soil conditions were 3.7% moisture, clay texture by touch, 13.37% organic matter, pH=6.63, TDS=638, 150 ppm nitrogen, 114 ppm phosphate, and 42 ppm potash. Whole genome sequencing was performed on the DNBseq platform and species identification was performed with TRUEBacID; the closest relative was Pseudomonas brassicacearum subsp. neoaurantiaca which was 92.05% similar by genomic evidence. 197 virulence factors were identified including flagellar biosynthesis, motor proteins, Beta-lactamase, Fosfomycin, copper, and sulfur drug resistance. Gram stain of strain 21-C3-ER revealed gram negative rods. Rods were visualized with scanning electron microscopy, revealing individuals approximately 1 µm in length. Secondary metabolite analysis using antiSMASH showed a variety of post-translationally modified proteins and a promysalin analog. The qualitative test for pyoverdine siderophore production using UV light was positive. Metabolic analysis using RAST indicated genes were present for pyoverdine production, antimicrobial resistance, and ammonification. The nitrate reduction test was positive. Denitrifying bacteria may prevent leaching of nitrates from soil, since ammonia has a higher affinity to soil and organic matter than nitrate. We propose Pseudomonas fernandeno as a novel species. The type stain is 21-C3-ER.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae6e662328693ea9de6a3a6fe4f7c32c360de318aa2cc1322d642b29cc97121f","category":"Interdisciplinary"}