{"title":"Efficient species identification for Pacific salmon genetic monitoring programs","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13680?af=R","date":1710831600000,"content":"<h2>Abstract</h2>\n<p>Genetic monitoring of Pacific salmon in the Columbia River basin provides crucial information to fisheries managers that is otherwise challenging to obtain using traditional methods. Monitoring programs such as genetic stock identification (GSI) and parentage-based tagging (PBT) involve genotyping tens of thousands of individuals annually. Although rare, these large sample collections inevitably include misidentified species, which exhibit low genotyping success on species-specific Genotyping-in-Thousands by sequencing (GT-seq) panels. For laboratories involved in large-scale genotyping efforts, diagnosing non-target species and reassigning them to the appropriate monitoring program can be costly and time-consuming. To address this problem, we identified 19 primer pairs that exhibit consistent cross-species amplification among salmonids and contain 51 species informative variants. These genetic markers reliably discriminate among 11 salmonid species and two subspecies of Cutthroat Trout and have been included in species-specific GT-seq panels for Chinook Salmon, Coho Salmon, Sockeye Salmon, and Rainbow Trout commonly used for Pacific salmon genetic monitoring. The majority of species-informative amplicons (16) were newly identified from the four existing GT-seq panels, thus demonstrating a low-cost approach to species identification when using targeted sequencing methods. A species-calling script was developed that is tailored for routine GT-seq genotyping pipelines and automates the identification of non-target species. Following extensive testing with empirical and simulated data, we demonstrated that the genetic markers and accompanying script accurately identified species and are robust to missing genotypic data and low-frequency, shared polymorphisms among species. Finally, we used these tools to identify Coho Salmon incidentally caught in the Columbia River Chinook Salmon sport fishery and used PBT to determine their hatchery of origin. These molecular and computing resources provide a valuable tool for Pacific salmon conservation in the Columbia River basin and demonstrate a cost-effective approach to species identification for genetic monitoring programs.</p>","author":"Zachary L. Robinson, \nJeff Stephenson, \nKim Vertacnik, \nStuart Willis, \nRebekah Horn, \nJesse McCane, \nD. Katharine Coykendall, \nShawn R. Narum","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"ae6fe8ddc66a4562163685e62133c2be50bba682752d415db0ae4bd8007aa11d","category":"Environment"}