{"title":"Nutrient Utilization, Requirements and Nutrigenomics in Sheep and Goats","link":"https://www.preprints.org/manuscript/202405.1956/v1","date":1716977813000,"content":"The most recent National Research Council Nutrient Requirements for Sheep and Goats was published in 2007, one of the most consequential nutrient requirement recommendations for sheep and goats in the world.  It is pertinent to continue the refinement and discussion of nutrient utilization and requirements for the purposes of enhancing the efficiency of production systems, maximizing resource economy, and minimizing the carbon footprint, among others. Progress has been made in the estimation of energy and protein requirements in sheep and goats, mainly utilizing empirical feeding experimentation, comparative slaughter technique and minimum endogenous loss method. In sheep, newer estimates of energy and protein requirements for maintenance and growth and partial efficiencies had been reported since 2007.  There were suggestions that energy and protein requirements could have been affected by breed, wool growth, gender and size; with these reported values being similar or lower than the recommended values in international feeding systems such as NRC, ARC, INRA and AFRC.  In goats, energy and protein requirements for growing goats were reported to be either higher or lower than the established recommendations, depending upon meat or dairy breeds. Effect of gender on energy requirement appeared to be related to the stage of growth or degree of maturity. Newer data also suggested that the guidelines of the major feeding systems for the entire growth phase may not be adequate for non-pregnant and non-lactating pubertal females. In multiparous pregnant goats, energy and protein requirements for maintenance did not appear to be affected by days of pregnancy, but efficiencies of metabolizable energy and metabolizable protein utilization for pregnancy were.  There were suggestions that that metabolizable protein synthesis in the rumen can be predicted from energy intake using combined equations that encompass both sheep and goats, but more data on goats were called for to account for specific differences in nutrition. In addition to sulfur, there has been progress made on the estimation of maintenance and growth requirements of calcium, phosphorus, potassium and magnesium in goats, with suggestions on the consideration of gender and breed differences. Species, level of Intake, genotype, mature size, age, gender, body composition, use of tissue energy, activity, season, and acclimatization continue to be important considerations for the estimation of nutrient requirements in sheep and goats, with emerging factors such as climate change, heat stress, parasitism and secondary plant compounds.  Model equations and partial efficiencies used by NRC to predict energy and protein requirements for maintenance, growth, lactation, and fiber have been highlighted and discussed for the purpose of a more focus discussion and refinement for the future. Potential and limitation of both traditional and emerging methodologies in determining the nutrient requirements in sheep and goats were discussed. To justify the research investment, emerging methodologies such as nutrigenomics will have to be linked more directly to the improvement of production efficiency via more precise prediction of nutrient requirement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae82be76397c830dcdf3ac9864b66023186bfb4e77ad0538df5bd0e9b769059c","category":"Interdisciplinary"}