{"title":"Today Marks 20 Years Since Mac OS X First Launched","link":"https://www.macrumors.com/2021/03/24/mac-os-x-launch-20th-anniversary/","date":1616569204000,"content":"On March 24, 2001, a Saturday, Apple began allowing customers to <a href=\"https://www.apple.com/newsroom/2001/03/21Mac-OS-X-Hits-Stores-This-Weekend/\">purchase Mac OS X</a>, the successor to the classic Mac OS. The first version of Mac OS X, \"Cheetah,\" was famous for its \"Aqua\" interface with a water bubble-style design for everything from windows to buttons.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/mac-os-x.jpg\" alt=\"\" width=\"800\" height=\"600\" class=\"aligncenter size-full wp-image-790524\" />\r\n<br/>\r\nToday, March 24, 2021, marks 20 years since Mac OS X went on sale, and Apple's Mac software has gone through many changes over the course of the last two decades, but it was with Mac OS X that Apple took one of the first steps toward transforming from a company on the brink of failure into one of the world's most successful companies. Mac OS X preceded the launch of the first iPod and heralded what was in store under Jobs' leadership.\r\n<br/>\r\n\r\n<br/>\r\nMac OS X <a href=\"https://www.apple.com/newsroom/2000/01/05Apple-Unveils-Mac-OS-X/\">was introduced</a> at the January 2000 Apple keynote at the Macworld Expo. Steve Jobs at the time said that Mac OS X would \"delight consumers with its simplicity and amaze professionals with its power.\" He also said it was the \"most important software\" from Apple since the original 1984 Macintosh operating system.\r\n<br/>\r\n\r\n<br/>\r\nThe Aqua interface introduced the now well-known Dock for easy access to applications and documents, plus it included Apple's revamped Finder for file management. And, of course, Aqua was most well-known for its iconic look, which included translucent scroll bars and buttons.\r\n<br/>\r\n\r\n<br/>\r\nOther features included advanced power management to let iBooks and PowerBooks wake from sleep instantly, dynamic memory management, and Apple's Quartz 2D graphics engine for \"stunning graphics\" and broader font support. It came with QuickTime 5, iMovie 2, iTunes, and AppleWorks (Apple's productivity software at the time).\r\n<br/>\r\n\r\n<br/>\r\nThe new software, which was built on Apple's \"Darwin\" operating system core, had support for many existing Mac OS apps, but developers were required to \"tune-up\" their apps, so Apple ultimately rolled it out over a 12 month beta period before putting it up for sale.\r\n<br/>\r\n\r\n<br/>\r\nAt launch, Mac OS X was priced at &#36;129, and its launch was at a time when Apple was still charging Mac users for upgrades. Mac updates got less expensive over the years, and Apple ultimately stopped charging for them in 2013.\r\n<br/>\r\n\r\n<br/>\r\nThe debut of Mac OS X was far from perfect, and it had some major stability issues that Apple needed to work out. Apple followed it up with Mac OS X 10.1 \"Puma\" just six months later, and since then, has continued iterating on that original 2001 release.\r\n<br/>\r\n\r\n<br/>\r\nMac OS X became OS X in 2012 with the release of Mountain Lion, an operating system that introduced a more minimal design that transitioned away from the skeuomorphic designs Apple had used under the leadership of Scott Forstall. OS X Mountain Lion accompanied iOS 7, which is known to be one of the biggest design overhauls to the iPhone operating system.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2012/02/os_x_mountain_lion_macs.jpg\" alt=\"\" width=\"560\" height=\"344\" class=\"aligncenter size-full wp-image-336623\" />\r\n<br/>\r\nApple introduced another major name overhaul in 2013 with the launch of OS X Mavericks, the first version of Mac OS X that wasn't named after a big cat. Apple used big cats from Mac OS X 10.0 (Cheetah) to 10.8 (Mountain Lion).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2013/06/mavericks.jpg\" alt=\"\" width=\"800\" height=\"484\" class=\"aligncenter size-full wp-image-376744\" />\r\n<br/>\r\nThe last significant change came in 2016 when Apple dropped the X and introduced macOS 10.12 Sierra, with the macOS name meant to better match with iOS. We've had several versions of macOS, culminating in the current release version of the software, <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2016/08/012-macos-sierra-970-80.jpg\" alt=\"\" width=\"956\" height=\"537\" class=\"aligncenter size-full wp-image-516905\" />\r\n<br/>\r\nmacOS Big Sur brought Apple's biggest design update to macOS since the days of Mac OS X, revamping everything from the curvature of window corners to colors and dock icon designs. Apple designed it to feel fresh and familiar at the same time, including less obtrusive menu bars, a more translucent dock, a uniform squircle shape for app icons, and entirely revamped system sounds.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/06/big-sur-macbook-pro.jpg\" alt=\"\" width=\"1694\" height=\"1018\" class=\"aligncenter size-full wp-image-747117\" />\r\n<br/>\r\nThe update also revamped the Notification Center to add quick access Control Center toggles, plus it has important updates to Safari, Messages, Photos, Maps, and more, with details available <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">in our roundup</a>. Later this year, we're <a href=\"https://www.macrumors.com/roundup/macos-12/\">expecting to see macOS 12</a>, and while it likely won't be the design overhaul that Big Sur was, Apple likely has useful new features in store.<br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/24/mac-os-x-launch-20th-anniversary/\">Today Marks 20 Years Since Mac OS X First Launched</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/today-marks-20-years-since-mac-os-x-first-launched.2289420/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ne1DnH4a4IM:ocggD5mfe5w:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ne1DnH4a4IM:ocggD5mfe5w:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ne1DnH4a4IM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ae8567a36a4f856d5a955b5ce2c767d9fe1078f24fa25c82cab369eaa90ff4b1","category":"Apple"}