{"title":"Apple made it easier to install betas just in time for iOS 17","link":"https://www.macworld.com/article/1669875/ios-16-4-beta-installation-process-profile.html","date":1680001200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Starting with the release of iOS 16.4, Apple will be revising the interface for participating in iOS/iPadOS betas. This is in part to help reduce the prevalence of non-registered users downloading beta releases (which will help reduce the unwanted spread of iOS 17 later this summer), but also to make participating in the beta easier for everyday users.</p>\n\n\n\n<p>The days of downloading and activating profiles are gone, and in their place is an online check of your Apple ID and some simple beta participation menus. Here’s how beta works in iOS 16.4 (or iPadOS 16.4) or later.</p>\n\n\n\n<h2>Say goodbye to the profile</h2>\n\n\n\n<p>Prior to iOS 16.4, you had to register your Apple ID and device for the beta, download a beta profile (either from the developer or public beta site), activate it, reboot, and then download the beta. it wasn’t a terribly intuitive process and likely scared away many users who would have considered testing betas.</p>\n\n\n\n<p>With iOS 16.4, Apple gives you a straightforward interface and removes the profile requirement. Instead, Apple will simply check your Apple ID to see if you’re enrolled in the public beta (or a registered developer) and allow you to select beta participation as desired. This makes it easier for everyone to control their beta participation and helps Apple crack down on third-party sites distributing developer betas or profiles for those that are not registered developers.</p>\n\n\n\n<p>To get started in the beta process, whether you’re a developer or a curious user, start by visiting the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram&amp;xcust=1-1-1669875-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Beta Software Program site</a> and enroll in the iOS public beta program. You’ll have to sign in with your Apple ID and agree to some terms and conditions.</p>\n\n\n\n<p>Then go to Settings &gt; <em>General</em> &gt; <em>Software Update</em> and you’ll see a new tab for <em>Beta Updates</em>. Tap it and you’ll see three options: <em>Off</em>, <em>Developer Beta</em>, and <em>Public Beta</em>. Select the one you want and return to the previous screen. If there’s a beta available, it will now appear and you can then download and install it. Future updates will appear in <em>General</em> &gt; <em>Software Updates</em> unless <em>Off</em> is selected.</p>\n\n\n\n<p>You must be logged in to the Apple ID that is enrolled in the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-1669875-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Developer Program</a>, which costs $99 a year. If you have a personal Apple ID you wish to use for all your iOS activities and services, but a separate Apple ID registered as a developer, you use your regular Apple ID on your iPhone and select Apple ID on the Beta Updates page to supply your registered developer ID just for beta access.</p>\n\n\n\n<p>If you wish to stop getting iOS beta updates, just go to Settings &gt; <em>General</em> &gt; <em>Software Update</em> &gt; <em>Beta Updates</em> and select <em>Off</em>. This will <em>not</em> downgrade you to the last major public release. You’ll stay on the current version of the beta you have, without getting any further updates, until the next major public release arrives, which you can then install over the beta.</p>\n\n\n\n<p>Remember, if you uncover bugs or have suggestions, use the Feedback app (which is automatically installed with the beta) to report them!</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ae8721ea3db731d08e87203238e697044fb692af9d354dade8106cce8e5422b5","category":"Apple"}