{"title":"Can resistance prehabilitation training bring additional benefits in valvular cardiac surgery? protocol for a randomized controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303163","date":1715090400000,"content":"<p>by Jorge Montero-Cámara, Francisco José Ferrer-Sargues, María José Segrera Rovira, Adrián Sarria Cabello, David Cuesta Peredo, Juan Antonio Margarit Calabuig, Noemí Valtueña-Gimeno, María Luz Sánchez-Sánchez</p>\r\nIntroduction <p>Cardiovascular diseases (CVD) are a group of illnesses that include coronary heart disease, cerebrovascular disease, congenital heart disease and deep vein thrombosis. Major surgery is often chosen as the treatment of choice for CVD. The concept of fast-track rehabilitation after surgery appeared in the 1970s. Participation in these exercise-based prehabilitation programmes may decrease postoperative complications and length of hospital stay. The primary aim of the present study is to evaluate whether the implementation of an additional resistance training (RT) prehabilitation protocol within cardiac exercises based prehabilitation can reduce intensive care unit (ICU) length of stay, postoperative complications and hospital length of stay (LOS).</p> Methods <p>A protocol of a prospective, parallel, randomised clinical trial includes 96 adult patients diagnosed with valvular pathology and who have been scheduled for surgery. The participants will be randomly assigned to two groups of 48. Control group will be treated with ventilatory and strengthening of respiratory muscles, and aerobic exercise. Experimental group, in addition, will be treated with RT of peripheral muscles. Both hospital stay and ICU stay will be assessed as main variables. Other secondary variables such as exercise capacity, quality of life and respiratory values will also be assessed. Quantitative variables will be analysed with a T-Test or ANOVA, or Mann Witney if the distribution is non-parametric.</p> Results and conclusion <p>This will be the first controlled clinical study focused on adding strength exercise as an additional treatment during prehabilitation. The results of this study will focus on helping to improve rehabilitation and prehabilitation protocols, considering that it is essential to maintain pulmonary training, as well as the inclusion of peripheral exercises that help people with heart disease to be in a better physical condition in order to increase their participation and sense of quality of life.</p>","author":"Jorge Montero-Cámara","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ae924c6433aa1af9dae4c07ad1e38144f8a99b0179e1604e1bb0892b75e86c25","category":"Interdisciplinary"}