{"title":"Dramatic Wound Closing Effect of a Single Application of iBTA-Induced Autologous Biosheet on Severe Diabetic Foot Ulcers Involving Heel Area","link":"https://www.preprints.org/manuscript/202404.0110/v1","date":1711976402000,"content":"Introduction: Chronic wounds caused by diabetes or lower-extremity artery disease are intractable because the wound healing mechanism is no longer effective due to the poor environment of the wound bed. Biosheet obtained using in-body tissue architecture (iBTA) is a collagen-based membranous tissue that is created within the body and autologously contains various growth factors and somatic stem cells including pluripotent stem cells. When applied to a wound, granulation formation can be promoted and even epithelialization may be achieved. Hearin, we report our clinical treatment experience with seven cases of intractable diabetic foot ulcers. Cases: From 46- to 93-year-old 7 patients had large foot ulcers including heel area, which was failed to heal with standard wound treatment. Methods:  Two or four Biosheet-forming molds were implanted subcutaneously in the chest or abdomen, and after 3 to 6 weeks, the molds were removed. Biosheets that formed inside the mold were obtained and applied directly to the wound surface. Results: In all cases, there were no problems with the mold embedding and removal procedures, and Biosheets were formed without any infection or inflammation during the implantation period. The Biosheets were simply applied to the wounds, and in all cases, they adhered within one week, did not fall of, and became integrated with the wound surface Complete wound closure was achieved within 8 weeks in two cases and within 5 months in two cases. One patient was lost due to infective endocarditis from septic colitis. One case required lower leg amputation due to the wound recurrence, and one case achieved wound reduction and wound healing in approximately 9 months. Conclusion: Biotube obtained via iBTA promoted wound healing and were extremely useful for intractable diabetic foot ulcers involving heel area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ae921b5c132b61341e7d68e7584c91991ce675681d0a3f0c89d89e1a55c3e4fe","category":"Interdisciplinary"}