{"title":"Q&A: Jack Haig on Tour de France leadership, racing for Bahrain, and more","link":"https://cyclingtips.com/2021/06/qa-jack-haig-on-tour-de-france-leadership-racing-for-bahrain-and-more/","date":1624582699000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Kramon_Dauphiné2021_st8_08783-650x436.jpeg\" /></div><h2>Q&amp;A: Jack Haig on Tour de France leadership, racing for Bahrain, and more</h2><p>\n</p><p><em>It’s been a good year for Jack Haig so far. After moving from Mitchelton-Scott (now BikeExchange) to Bahrain Victorious in the offseason, the 27-year-old Aussie has posted a number of strong results. He was seventh overall at the Tour de la Provence, likewise at Paris-Nice, and most recently he finished fifth overall at the Critérium du Dauphiné.</em></p>\n\n\n\n<p><em>Now, Haig is about to lead a team at a Grand Tour for the first time. On the eve of the 2021 <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a>, CyclingTips caught up with Haig to talk about his expectations for the Tour, life as a new father, how he’s finding things at Bahrain Victorious, and more. When we spoke, Haig had just finished a whirlwind morning that included doping control, a COVID test, and a recon ride of stage 1, all after arriving in Brest late the previous night.</em></p>\n\n\n\n<hr />\n\n\n\n<p><strong>CyclingTips: You’ve just come back from checking out stage 1 of the Tour. What’s your impression of it?</strong></p>\n\n\n\n<p>Jack Haig: We saw the last maybe 10 kilometres of it. The final climb is actually pretty hard! Quite a bit harder than I expected. I think it really suits [Mathieu] van der Poel and [Julian] Alapahilippe. I’m currently rooming with Wout Poels and he’s just pointing at himself but he’s definitely not going to get up the climb, that’s for sure.</p>\n\n\n\n<p><strong>It’s a cool start to the race with those <a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\" target=\"_blank\">two uphill finishes</a>!</strong></p>\n\n\n\n<p>Yeah. I think we’re probably going to see some time gaps already – just a couple of seconds here or there. Nothing that will dramatically change the race, but something that’s going to be annoying for one or two riders.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CQg8XhoB47P/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CQg8XhoB47P/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Jack Haig (@jack_haig)</a></p></div></blockquote> \n\n\n\n<p><strong>How are you feeling on the eve of the Tour?</strong></p>\n\n\n\n<p>Me and Wout were both saying it doesn’t really feel like we’re at the Tour. I don’t know what it is, but I don’t really have that same excitement as I’ve had other years. But I’m not sure if that’s just because with COVID there hasn’t been as much media attention around it. I dunno.</p>\n\n\n\n<p>I’m obviously quite excited to get it underway. I’ve put a lot more effort [in] this year trying to prepare as well as I can for the race, knowing that I have a bit more of a leadership role, which has sort of meant having a few more sacrifices [in] my home life.</p>\n\n\n\n<p>So I’m a bit more nervous personally about my performance because I’m kind of hoping that all the sacrifices I made at home are worth it and eventuate in something quite good.</p>\n\n\n\n<p><strong>What sort of sacrifices?</strong></p>\n\n\n\n<p>Just more time away. We now have a baby at home and I’ve maybe not 100% been there with my wife Anna and the kid, knowing that I have to really take care of myself and look after my recovery. At the moment we’re not sleeping together in the same room – she’s having to wake up in the middle of the night to feed him and that disrupts the recovery.</p>\n\n\n\n<p>All the small little things like that where I wish maybe I could be a bit more part of the family life rather than making all these sacrifices and saying “Actually, you know what, I can’t really come to lunch with you today and have a bit of a date lunch or a date night.”</p>\n\n\n\n<p><strong>Yeah, that’s rough. Your job is so much more than just time on the bike, isn’t it?</strong></p>\n\n\n\n<p>Yeah, exactly. And having a child’s made me more aware of this maybe than [I was] previously.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/COprlYyBPue/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/COprlYyBPue/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anna Botterweg (@annabotterweg)</a></p></div></blockquote> \n\n\n\n<p><strong>This is the first Grand Tour you start with a leadership role, right?</strong></p>\n\n\n\n<p>Yeah. I’ve always gone into all my other Grand Tours with Mitchelton or BikeExchange as the first helper for one of the Yates brothers. I always did Vuelta or Giro looking after Simon or Adam or [Esteban] Chaves. </p>\n\n\n\n<p><strong>How are you feeling about that? What are you expecting out of that leadership role?</strong></p>\n\n\n\n<p>I guess there’s not much pressure at all from the team. It’s mainly internal pressure <em>[from himself – ed.]</em> because the team we have brought to the Tour de France is a really good team for racing aggressively. And I think the biggest goal for the team is to try and get some stage wins.</p>\n\n\n\n<p>With Sonny [Colbrelli, new Italian champion] and Matej [Mohorič, new Slovenian champ] who obviously showed really good condition with their national championships, and then Wout and Pello [Bilbao] are also going to have really good opportunities once we get to the mountains … I think the team that we have here, if we didn’t win a stage, I think it would be quite a disappointment. I think maybe [we have] the possibility to win more than one.</p>\n\n\n\n<p><strong>What about for you personally? What would you be happy to achieve in the Tour?</strong></p>\n\n\n\n<p>I kind of said to myself – and maybe I haven’t actually spoken about this to anyone else – I really just want to wait and see til after the <a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\" target=\"_blank\">stage 5 time trial</a> and see what happens. Because where we’re starting now, in Bretagne, the roads are quite technical and it’s quite easy for something to go wrong – just a small little accident or a lapse of concentration or just bad luck. So I think once we get through the stage 5 time trial, [I’ll] see how my performance is there.</p>\n\n\n\n<p>I have a bit of confidence in the TTs now after doing a good time trial in Dauphiné. I’ve put a bit of focus on making sure that I keep trying to improve there. And then [I’ll] just kind of reassess and see where I’m at. If I’m still somewhat in contention for trying to be top 10 in GC, I’ll keep going down that route, but if I’ve had some bad luck, or something’s just not quite gone the correct way, then I would probably try to lose some time and try and go on more of an aggressive way of racing and get into the breaks, or attack a little bit earlier.</p>\n\n\n\n<p>I think a lot of riders are seeing the advantage now of having that attacking style in the Tour de France. I think one standout rider from last year that really showed this works was Marc Hirschi. He wasn’t doing anything on GC, but he was one of the more talked-about riders of the Tour because of the way he was racing.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00033188-153-1340x861.jpeg\" /><figcaption>Haig on his way to 11th in the Dauphiné ITT.</figcaption></figure>\n\n\n\n<p><strong>Assuming everything does go right in terms of GC and you get through that first time trial and everything’s going well, would you be happy to finish top 10 on GC?</strong></p>\n\n\n\n<p>Of course. I’d be super happy with that. I mainly just want to test myself and see how it goes. And if it finishes with a top 10 then I’d be happy for sure.</p>\n\n\n\n<p><strong>You mentioned the time trial at the Dauphiné specifically but you must have been happy with your ride there overall …</strong></p>\n\n\n\n<p>Yeah, definitely. I’ve slowly been performing relatively well throughout the season, starting with [Tour de la] Provence and Paris-Nice. Then I had a bit of a shocker at [Tour de] Romandie – I just got way too cold there. And then going to Dauphiné I was super happy with my performance. I felt like I was climbing with the Ineos team at the head there, and Jumbo-Visma team, and really being part of the race which is something that’s also quite important for me. To feel like you actually can make a difference in the race rather than just hanging on and then getting dropped and kind of being a bit anonymous.</p>\n\n\n\n<p>So I certainly took some confidence out of Dauphiné and realised maybe something can happen in the Tour. Maybe it’s not that unrealistic. </p>\n\n\n\n<p><strong>Were you surprised that Mark Padun wasn’t selected for the Tour team? I think a lot of people were surprised by that.</strong></p>\n\n\n\n<p>Yes, I obviously asked the question when I got told what the team was. I was a little bit surprised to see that he didn’t come here, but also I don’t really want to comment too much on it – I actually have no idea what happened and why he didn’t go. But I was also a bit like “Oh, I wonder why he’s not here.” I think the team wants him to focus on the Vuelta and probably Olympics.</p>\n\n\n\n<p><strong>His ride at the Dauphiné was <a href=\"https://cyclingtips.com/2021/06/who-is-the-dauphines-breakout-star-mark-padun/\" target=\"_blank\">quite something</a>.</strong></p>\n\n\n\n<p>Yeah, the last two stages were super impressive with what he did there and he was climbing with some of the best. But also the team was maybe a little bit disappointed that he wasn’t quite there in the first couple of stages when Sonny really needed an extra teammate to help bring back the breakaway. He probably could have had the opportunity to win three more stages if the break hadn’t stayed away.</p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/CORVOS_00033200-094.jpeg\" /><figcaption>Mark Padun was one of the breakout stars of the Dauphiné, but he wasn’t selected to Bahrain Victorious’s Tour team.</figcaption></figure>\n\n\n\n<p><strong>So the period between the Dauphiné and the Tour, what did that look like for you? I assume there was an altitude camp in there?</strong></p>\n\n\n\n<p>There was no team-organised camp so I just went back home to Andorra. I normally live in the village of La Massana, which is at about 1,200 metres. Again, just trying to do everything possible this year, I actually decided to rent an apartment that was at 2,000 metres in Andorra. I moved my family up there and we spent 10 days between Dauphiné and here just a little bit higher in Andorra. It makes it quite easy being still half an hour, 40 minutes from home, so if you ever forget anything or need anything, we can just go home – it’s super easy.</p>\n\n\n\n<p>I took a couple of days recovery and then went from the 10th to the 20th [of June] up to altitude, did a good seven, eight days of training, and then a little bit of recovery [before] coming to the race now.</p>\n\n\n\n<p><strong>How have you found the new team this year? What have been the biggest differences coming to a new setup?</strong> </p>\n\n\n\n<p>Well, I guess one of the biggest things I had to overcome was when I was speaking with the team and signed with the team, it was still with [team principal] Rod Ellingworth and McLaren. And obviously that all <a href=\"https://cyclingtips.com/2020/12/rod-ellingworth-is-leaving-bahrain-mclaren/\" target=\"_blank\">changed towards the end of last year</a> and it ended up turning into a team that was quite different to what I’d signed for. Two of the major reasons why I joined the team was Rod and McLaren. So that was a bit of an initial shock and I was a little bit unsure, definitely in the beginning of the year, how it was going to work.</p>\n\n\n\n<p>I think also with Rod’s departure, the whole management also needed to change. We needed to have a new manager [and] that all kind of happened a bit last-minute. So for sure the January-February period was a bit up and down. But definitely now as we’re getting further into the year, I’m more and more happy with the team.</p>\n\n\n\n<p>And I think like a lot of teams this year, we missed a lot of that organisation time where you normally have a November or December training camp. And all that stuff is kind of trickling in now. And now I’m becoming actually really happy with the team and really enjoying being with them.</p>\n\n\n\n<p>They have a really good group of staff, all the equipment that we have is all really good. The Merida bikes: I’m actually quite impressed with [them]. All the basic stuff for success is there. And I think you’re starting to see that now as the team is doing more and more results in the past couple of months. The team is now starting to gel and work a bit better together.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CKs7L5VF3qp/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CKs7L5VF3qp/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Jack Haig (@jack_haig)</a></p></div></blockquote> \n\n\n\n<p><strong>You mentioned this before, but it does seem like you’re getting more opportunities now than you did with Mitchelton-Scott. That must be satisfying for you?</strong></p>\n\n\n\n<p>Yeah, it is. I really enjoy the ability to have a bit more pressure and have a bit more responsibility and take an opportunity in the races. I think that’s also elevated my performance, having that extra pressure and that extra responsibility. That was kind of what I was looking for a little bit when I decided to try and change teams.</p>\n\n\n\n<p>I obviously still miss the BikeExchange guys a lot and I find myself always riding up to the bus and having a bit of a chat to the staff and riders there. But I’m also really enjoying my time out here [at Bahrain Victorious].</p>\n\n\n\n<p><strong>What do you think will be the key moments in the Tour over the next few weeks? What stages stand out to you?</strong></p>\n\n\n\n<p>Well, like I said before, making it through these first four stages here in Bretagne is going to be pretty critical. I think it’s not that unrealistic to see maybe one to two riders that were in the hunt for a GC position more or less eliminated either from the race or from general classification just through some bad luck or a crash.</p>\n\n\n\n<p>There’s really not that many hilltop finishes this year, and I think we saw in Dauphiné it was a little bit similar. I feel like it kind of neutralises the racing a little bit. So I feel like the time trials maybe have a bigger importance this year than previous years. A lot of time gaps are going to be made in the time trials. It will be very interesting to see where everyone’s stacks up after stage 5.</p>\n\n\n\n<p>And then obviously Ineos having four leaders … it will be interesting to see when they make the decision of how the hierarchy there works. Because if they go there with just one leader, they obviously have one of the best teams in the Tour de France and the ability to control almost any situation, like we saw in Dauphiné on that final stage. I attacked just after [Miguel Ángel] López was brought back and it was G [Geraint Thomas], <a href=\"https://cyclingtips.com/2021/06/qa-richie-porte-on-his-dauphine-win-and-his-tour-de-france-prospects/\" target=\"_blank\">Richie [Porte]</a> and Tao [Geoghegan Hart]. You’ve got two riders who’ve won Grand Tours and one of the best week-long stage racers in the world, ever. And then you can’t really get too far, can you?</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CPvgRMphgKz/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CPvgRMphgKz/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Jack Haig (@jack_haig)</a></p></div></blockquote> \n\n\n\n<p><strong>You’ve been <a href=\"https://cyclingtips.com/2021/05/australian-road-team-revealed-for-tokyo-olympics/\" target=\"_blank\">selected for the Aussie Olympic team</a>. Have you thought much about that or has it all been about the Tour lately?</strong></p>\n\n\n\n<p>There’s obviously been a lot of Olympic stuff going on in the background. I may be more excited about the Olympics than the Tour de France. It’s maybe not a race where I have a lot of freedom – it’s a super-small team from Australia going there. But it’s the Olympics. There was a lot of people um-ing and ah-ing about whether to do Olympics or Vuelta, but to be able to say when I finish my career, or hopefully after I’ve been to the Olympics this year, that I’m an Olympian is something quite special and something that everyone recognises.</p>\n\n\n\n<p>I’m kind of a little bit worried that maybe the COVID situation will put a bit of a downer on the whole Olympic experience but I’m super-excited about it. I can’t wait to go and be with the Australian team. I enjoy doing world championships every year and representing Australia there, so to be able to maybe do it on a bigger stage, at the Olympics, is something I’m super-excited about.</p>\n\n\n\n<p></p>\n\n\n\n<p><strong>Is there anything else you wanted to add before we wrap it up? Anything we’ve missed?</strong></p>\n\n\n\n<p>I did <a href=\"https://www.sbs.com.au/guide/video/1909637699529/Jack-Haig-takes-leadership-role-into-Tour-de-Franc\" target=\"_blank\">an interview with [Aussie Tour broadcaster] SBS</a> just thanking everyone in Australia for staying up at night watching the races. I [haven’t] come back to Australia at all really, recently, and I never do [Tour] Down Under or Nationals or any of this, but to know that everyone is still following the racing it’s pretty cool. Obviously to all of Australia and all the people that have helped me in Australia to get where I am now … [I want to] just say a big thank you.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/qa-jack-haig-on-tour-de-france-leadership-racing-for-bahrain-and-more/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ae94e286af18415f11d18756576653fad8e4cb980ddd7a54b0f816067545656b","category":"Cycling"}