{"title":"This is the slightly sportier, slightly more efficient 2022 Honda Civic","link":"https://arstechnica.com/?p=1761031","date":1619658957000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/01-2022-Honda-Civic-Sedan-Touring-980x621.jpg\" /></div>\n        <p>\n          This is the 2022 Honda Civic sedan, the 11th generation of the car to bear the Civic nameplate.                       [credit:\n                        <a href=\"https://www.honda.com/\">Honda</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>In the past, I have been guilty of comparing the Honda Civic's looks to <a href=\"https://arstechnica.com/cars/2019/12/the-2020-honda-civic-a-strong-all-rounder-in-the-sub-30000-market/\">starfighters</a> and <a href=\"https://arstechnica.com/cars/2020/06/if-you-think-a-golf-gti-is-too-refined-you-may-love-the-honda-civic-si/\">Gundams</a>. For that I'm sorry, and it definitely won't happen anymore. That's because there's a new Honda Civic on the way, the 11th generation to bear the nameplate. And this one looks more grownup and less like it might transform into a robot, at least based on the photos of the Civic sedan that Honda has shared with us.</p>\n<p>The new vehicle is a complete redesign of Honda's bestseller, which dare I say looks Audi-like from some angles? Honda exhorts that the key to the new Civic's looks is the fact that the A pillars have moved about two inches rearward, which extends the hood while also visually connecting the pillar to the front wheel hub. The new body shell is stiffer than before, which makes it handle and ride better, with less road and wind noise.</p>\n<p>The interior is similarly all new, with a strip of honeycomb mesh across the dash that cleverly conceals the air vents. As with the previous Civic, Honda has opted for a traditional transmission lever as opposed to the push buttons that you'll find in many of its other vehicles.</p></div><p><a href=\"https://arstechnica.com/?p=1761031#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761031&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ae9bed299cb69bc08de138a8b774b8066cd87fdd7a31476d2e777252cff13d3a","category":"Tech"}