{"title":"Stainless Steel 316 L Deposited on the AISI 1018 Steel Substrate Using an Additive Manufacturing Technique","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.304/7720418?rss=1","date":1721779200000,"content":"<span>Low-carbon steel, is a choice of material in automotive, construction, and transportation sectors owing to its superior strength-to-cost ratio. This attribute stems from the microstructural refinement achieved through careful alloying and heat treatment processes, ensuring optimal mechanical properties. Furthermore, in the plastic industry, mold materials such as P20 or AISI 1018 steel are preferred due to their well-established reputation for exhibiting moderate mechanical strength properties. These materials are chosen for their ability to withstand the rigors of molding processes while maintaining dimensional stability and integrity, essential factors for ensuring high-quality plastic components. However, when it comes to corrosion resistance, low-carbon steel does have its limitations. In neutral, acidic, or saline environments, its usage is restricted, and its service life is compromised, leading to eventual replacement after a certain period of use [<a href=\"#ozae044.304-B1\">1</a>]. On the other hand, stainless steel is renowned for its remarkable corrosion resistance and can serve as a preferable alternative despite its higher price. This makes them a reliable choice in applications where corrosion resistance is crucial. Manufacturers can ensure the desired mechanical strength and superior corrosion resistance by opting for stainless steel, making them an investment worth considering. Considering the previous issues, there are infinite opportunities that could help create inexpensive material capable of withstanding corrosion using coatings. It can be produced through cladding as a composite material with a resilient outer layer resistant to corrosion, all while preserving the necessary mechanical properties. A remarkable example is the application of 316L stainless steel cladding onto a substrate composed of low-carbon steel such as 1018 steel [<a href=\"#ozae044.304-B1\">1</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"ae9c9853aa938f80f4442f2c26794fbf77449e6a91dc74bddb9e69ba16903713","category":"Environment"}