{"title":"Functions of extracellular polymeric substances in partitioning suspended and sinking particles in the upper oceans of two open ocean systems","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12554?af=R","date":1716913718000,"content":"<h2>Abstract</h2>\n<p>Marine particle dynamics and carbon export, involving extracellular polymeric substances (EPS) like transparent exopolymer particles (TEP) and Coomassie Brilliant Blue-stained particles (CSP), are poorly understood. Although TEP adhesive properties may enhance carbon export by facilitating aggregate formation, their low density can also enhance particle suspension. Factors influencing TEP regulation of particle dynamics remain unclear. To investigate EPS contributions to particle dynamics, we investigated ratios of TEP to particulate organic carbon (POC) and of CSP to POC in suspended and sinking particles collected with marine snow catchers. Samples were collected in a subarctic region near Hokkaido during a spring phytoplankton bloom and in the oligotrophic, subtropical Kuroshio region. At Hokkaido, the mean TEP : POC ratio of sinking particles (0.075 <i>μ</i>g Xeq. : <i>μ</i>g C) was &gt; 30× lower than in suspended particles (2.3), consistent with a model prediction of selective retention of buoyant TEP-rich particles in the upper water column. In the Kuroshio region, sinking particles also contained fewer TEP than suspended particles; however, the TEP : POC ratio of sinking particles (1.0) was &gt; 10× higher than at Hokkaido, suggesting that TEP constitute a significant carbon component of sinking particles. These findings indicate that TEP facilitate aggregation of high-density particles and particle sinking in the Kuroshio region. Distributions of CSP : POC ratios between suspended and sinking particles resembled TEP : POC ratios in both regions, implying a significant contribution of CSP to particle dynamics. We propose that EPS have divergent effects on suspension and sinking of marine particles, which vary with particle composition and biogeochemical conditions.</p>","author":"Yosuke Yamada, \nAkiko Ebihara, \nHideki Fukuda, \nShigeyoshi Otosaka, \nSatoshi Mitarai, \nToshi Nagata","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"aea2475b76df0452108a3aec31372d7f72aaae30600dc2a4bf9d4112e530f2de","category":"Environment"}