{"title":"Google Pay’s disastrous year continues, promised bank account feature is dead","link":"https://arstechnica.com/?p=1800077","date":1633178723000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/flushing-google-play-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/flushing-google-play.jpg\">Enlarge</a> <span>/</span> Google Pay continues to circle the drain.  (credit: <a href=\"https://arstechnica.com/author/aurich-lawson/\">Aurich Lawson / Ars Technica</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Google's grand plan to launch Google Bank Accounts is dead. As part of its big relaunch this past year, the Google Pay division promised to launch \"Plex,\" a digital banking service from Google. After a disastrous year for Google Pay that included a botched app revamp and an <a href=\"https://arstechnica.com/gadgets/2021/08/google-pay-team-reportedly-in-major-upheaval-after-botched-app-revamp/\">employee exodus</a> from the division, though, a report from <a href=\"https://www.wsj.com/articles/google-is-scrapping-its-plan-to-offer-bank-accounts-to-users-11633104001\">the Wall Street Journal</a> now says Google's bank account plans are dead.</p>\n<p>Plex was officially announced almost two years ago and heavily promoted on the Google Pay website and app, complete with a waitlist users could sign up for. The service would have been a \"mobile first\" banking app with physical cards, less fees, and lots of spending visualizations. I want to say something like, \"I can't imagine anyone wanting a Google Bank Account\" given the privacy concerns and how unstable new Google products can be, but the Wall Street Journal reports that there were 400,000 people on the waitlist.</p>\n<p>Google was partnering with Citigroup, Stanford Federal Credit Union, and a few other banks for the service, and not all of them were apparently in on the plan to cancel Plex. The Wall Street Journal report closes with a rather sad paragraph:</p></div><p><a href=\"https://arstechnica.com/?p=1800077#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1800077&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aea3227d4e3b6a1b554eb4203807ff3a46453199298dadf56c342b1a982179c5","category":"Tech"}