{"title":"Integrating the patient’s voice into the research agenda for treatment of chemosensory disorders","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae020/7676373?rss=1","date":1715990400000,"content":"<span><div>Abstract</div>World-wide some 658 million people were infected with coronavirus disease 2019 (COVID-19) and millions suffer from chemosensory impairment associated with long COVID. Current treatments for taste and smell disorders are limited. Involving patients has the potential to catalyze the dynamic exchange and development of new ideas and approaches to facilitate biomedical research and therapeutics. We assessed patients’ perceptions of the efficacy of treatments for chemosensory impairment using an online questionnaire completed by 5,815 people in the US Logistic regression determined variables predictive of reported treatment efficacy for patients aged 18 to 24, 25 to 39, 40 to 60, and 60+ yrs. who were treated with nasal steroids, oral steroids, zinc, nasal rinse, smell training, theophylline, platelet-rich plasma, and Omega 3. The most consistent predictor was age, with the majority of those 40 to 60 and 60+ reporting that nasal steroids, oral steroids, zinc, nasal rinse, and smell training were only slightly effective or not effective at all. Many of these treatment strategies target regeneration and immune response, processes compromised by age. Only those under 40 reported more than slight efficacy of steroids or smell training. Findings emphasize the need to include patients of all ages in clinical trials. Older adults with olfactory impairment are at increased risk for Alzheimer’s disease (AD). We speculate that olfactory impairment associated with long COVID introduces the potential for a significant rise in AD. Long COVID-associated chemosensory impairment increases the urgency for translational and clinical research on novel treatment strategies. Suggestions for high-priority areas for epidemiological, basic, and clinical research on chemosensory impairment follow.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"aea966fd0bda2795ea82cdea450742619c1fbd3e86dc15a572d8ce33402eb24b","category":"Environment"}