{"title":"Transcriptomic Analysis of the Effects of Changes in Temperature and Flow Velocity on Reproductive Ability of Coreius guichenoti","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2721?af=R","date":1726311258000,"content":"<h2>ABSTRACT</h2>\n<p>The establishment of reservoirs, which alter water temperature and flow dynamics, significantly affects the indigenous fish population, yet the underlying molecular mechanisms remain unclear. To investigate effects of the changing water temperature and flow rate on fish ovaries, we subjected female <i>Coreius guichenoti</i> to the combination of different water temperatures (17°C, 20°C and 23°C denoted as L, N and H, respectively) and flow velocities (0 and 0.5 m/s denoted as S and V, respectively). After 30-day experiment period, we identified 393, 545, 300 and 657 differentially expressed transcripts in HV versus NV, LV versus NV, HS versus NV and LS versus NV, respectively. The transcriptome results showed that both environmental factors could significantly influence oogenesis, with water temperature exerting a more pronounced effect than flow velocity. In particular, the higher temperature (HV and HS) led to a tendency towards masculinization and even infertility in females, which were consistent with the histopathology results. By contrast, the lower temperature (LV and LS) promoted the progression of desirable female attributes, where static water conditions (LS) had a greater effect compared with flowing water (LV). These findings were of great significance for the adaptive operation of reservoirs to create reasonable and precise ecological flows for managing fish reproduction.</p>","author":"Yuqing Lin, \nTing Li, \nQiuwen Chen, \nRuxia Qiao, \nShufeng He, \nTao Feng, \nJun Wang","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"aeb47b2c8065ee0a9b3c54b6f6c6f9a320e28fbe73a286093b59f4322abff6ff","category":"Environment"}