{"title":"Nutritional attributes and microbial metagenomic profile during solid‐state fermentation of soybean meal inoculated with Lactobacillus acidophilus under non‐sterile conditions","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13657?af=R","date":1718361559000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Soybean meal (SBM) is used widely in animal feed but it contains anti-nutritional factors (ANFs) such as protease inhibitors – immunogenic proteins that limit its utilization. Fermentative processes could help to reduce these ANFs. The aim of this study was to evaluate the nutritional attributes, bacterial community dynamics, and microbial metagenomic profile during the solid-state fermentation of SBM using a strain of the bacterium <i>Lactobacillus acidophilus</i> with or without pre-autoclaving treatment.</p>\n<h2>RESULTS</h2>\n<p>Following fermentation, there was a reduction in the pH and a concurrent increase in the population of lactic acid bacteria. Fermentation also resulted in an increase in both crude and soluble protein levels. Trypsin inhibitor levels decreased after fermentation, particularly in fermented SBM that had not been pre-autoclaved, with an inactivation rate higher than 90%. Moreover, high-molecular-weight peptides (44–158 kDa), specifically some polypeptides from the soybean immunogen glycinin and <i>β</i>-conglycinin, underwent degradation during the fermentation process. Bacterial community analysis revealed the dominance of the <i>Lactobacillus</i> genus in all samples, regardless of the treatments applied. Metagenomic profiling identified <i>L. acidophilus</i> as the dominant species in inoculated SBM, irrespective of whether pre-autoclaving was conducted or not.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrates the feasibility of solid-state fermentation with <i>L. acidophilus</i> under non-sterile conditions to inactivate trypsin inhibitor and increase protein concentration and hydrolysate immunogen proteins into low-molecular-weight peptides in SBM. <i>Lactobacillus acidophilus</i> inoculum also inhibited the growth of undesirable bacteria. This knowledge contributes to our understanding of the potential applications of solid-state fermentation with <i>L. acidophilus</i> in improving the nutritional quality of SBM. © 2024 Society of Chemical Industry.</p>","author":"Ricardo Pérez–Velasco, \nBruno Gómez‐Gil, \nEmmanuel Martínez‐Montaño, \nAarón Fernando González‐Córdova, \nCrisantema Hernández","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"aebb5c162538d7bb8231a026b946532a19ef3d61610ba68747b53fc0655a0eba","category":"Environment"}