{"title":"From extremely acidic to alkaline: Aquatic invertebrates in forest mining lakes under the pressure of acidification","link":"https://onlinelibrary.wiley.com/doi/10.1002/iroh.202102121?af=R","date":1693390175000,"content":"<h2>Abstract</h2>\n<p>Human activities, including the mining industry, have considerably degraded water habitats worldwide. Acidification has severely affected aquatic environments and biodiversity by altering food webs and reducing species richness. The study area in southern Poland is unique in addressing the effects of mining-related acidification on biodiversity in freshwater ecosystems along a broad pH gradient (2.4–9.6) in mining lakes. Study was designed to test for effect of human induced acidification. Using multivariate ordination techniques, we analyzed how variations in invertebrate composition are related to environmental factors. The results indicated that pH, hardness, total dissolved solids, and the content of ammonia and calcium were significantly associated with the distribution of invertebrates in the studied mining lakes. The highest iron content, relatively high values of conductivity, and chlorides were found in the extremely acidic mining lakes. A clear trend in decreasing density with decreasing pH was observed for taxa such as Oligochaeta, Chironomidae, Glossiphonidae, and certain taxa of snails. However, the density of other taxa such as Lestidae, Libellulidae, Caenidae, Sialidae, Helodidae, Hydrophilidae, and Polycentropodidae increased with decreasing pH. Specific communities were found with increasing acidity. Therefore, a further increase in acidity will probably cause a stronger decline in most of taxa and their density, and on water chemistry (e.g., calcium concentration, nitrites, and hardness). The data yielded offer an opportunity to fill knowledge gaps on acidic stress concerning less-studied environments such as mining lakes and link environmental pollution with communities, which is especially important, because aquatic forest habitats are especially exposed to different climatic factors and threats.</p>","author":"Aneta Spyra, \nAnna Cieplok, \nNatalia Kaszyca‐Taszakowska","siteTitle":"Wiley: International Review of Hydrobiology: Table of Contents","siteHash":"c09ce30dd438b9d413c661995ac13a60a951328672586b3a80c41cbb2203224a","entryHash":"aec990ba7067c27257602f613ed0fef03968a4a936805059976ab532e67d491e","category":"Environment"}