{"title":"Christmas Bird Count data are a reliable harvest-independent index for Ruffed Grouse monitoring in the eastern United States","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae011/7754279?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>Using data from the mid-1990s to the present, we assessed correlations of Ruffed Grouse (<span>Bonasa umbellus</span>) hunter cooperator reports from seven states to Breeding Bird Survey, Christmas Bird Count, and eBird data to determine which program’s trends best reflected patterns seen in hunter-sourced data that has historically been used for monitoring purposes. Christmas Bird Count data most closely reflected state-wide long-term trends in cooperator flush rates. Using an analytical approach that accounts for sources of bias and examines abundance at a finer spatial scale, we observed a pattern of decline across our study area. In recent decades, Ruffed Grouse populations in the eastern United States are thought to have suffered persistent declines due to a combination of young forest habitat loss and West Nile virus mortality. Declining hunter participation in much of the species’ range has highlighted the need to identify harvest-independent indices of grouse abundance to enable continued monitoring of regional long-term trends. Recent analytical methods can better capture complex trends in population dynamics, account for biases inherent to community-sourced data, and potentially inform designs of future survey efforts aimed at fulfilling priority monitoring and research needs. Comparable results across varying statistical methodologies suggest that our inferences are robust, demonstrating that Christmas Bird Count data can be used to inform regional monitoring efforts for grouse and other cryptic game bird populations, but require careful consideration of program designs and protocols to identify and implement data appropriately.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"aeca9d0845b8badc9ba33a53da08536731bcbbf6cc87a74e6bd7a514019de3e3","category":"Environment"}