{"title":"How to pause QuickTime Player while recording audio or video on a Mac","link":"https://www.macworld.com/article/2232626/how-to-pause-quicktime-player-while-recording-audio-or-video-on-a-mac.html","date":1708678800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>QuickTime Player is a convenient way to record audio and video from your Mac. You can select sources for audio that include any real or virtual microphones or sound inputs and from video sources that include nearby iPhones, iPads, and Apple TVs.</p>\n\n\n\n<p>After you press the Record button, you might not realize you have an option other than clicking the button again, now in the form of the Stop button. Clicking <em>Stop</em> ends the recording, and you’re prompted to save the resulting file.</p>\n\n\n\n<p>However, there’s a hidden option you can’t access from any menu: hold down Option and the Stop icon changes to a Pause one. Press the <em>Pause</em> icon, and it, as expected, pauses.</p>\n\n\n\n<p>While paused, the button appears again like the red Record button. Press it to continue. You can also hold down Option, and the button changes to Stop. Click that to finish the recording.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-quicktime-pause-bordered.png\" alt=\"QuickTime Player Pause button\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-quicktime-pause-bordered.png?quality=50&amp;strip=all 578w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-quicktime-pause-bordered.png?resize=300%2C126&amp;quality=50&amp;strip=all 300w\" width=\"578\" height=\"242\" loading=\"lazy\" /><figcaption><p>Hold down Option to reveal a Pause button.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Unfortunately, this Option feature is available only for audio and video recordings. You cannot use it while recording the screen on your Mac. You need third-party screen recording software for that, or to use iMovie or a similar editing program to stitch screen recordings together.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Keifer.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"aecb555375a61e68d52a492a944edefaf01e25a11c4105b1e4b32eccc680e577","category":"Apple"}