{"title":"Semiconductor firms can’t find enough workers, worsening chip shortage","link":"https://arstechnica.com/?p=1797738","date":1632411407000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1312588600-800x543.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1312588600.jpg\">Enlarge</a> <span>/</span> Don't expect cheaper chips anytime soon. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/coronavirus-preparedness-tent-set-up-outside-hospital-news-photo/1225590830?adppopup=true\">Tommy/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The semiconductor chip shortage that has so vexed the auto industry looks set to continue for quite some time, <a href=\"https://emails.ipc.org/links/0921Current-Sentiment-GEMSC.pdf\">according to a new industry survey</a>. More than half of the companies that were surveyed by IPC said they expected the shortage to last until at least the second half of 2022. And right now, the chip shortage is being exacerbated by rising costs and a shortage of workers.</p>\n<p>According to the survey, 80 percent of chip makers say that it's become hard to find workers who have to be specially trained to handle the highly toxic compounds used in semiconductor manufacturing. The problem is worse in North America and in Asia, where more companies are reporting rising labor costs compared to those in Europe.</p>\n<p>But only a third of Asian chip makers say they are finding it harder to find qualified workers, compared to 67 percent of North American companies and 63 percent of European companies. That may well explain why fewer Asian semiconductor companies (42 percent) are reporting increasing order backlogs, compared to 65 percent of North American and 60 percent of European companies.</p></div><p><a href=\"https://arstechnica.com/?p=1797738#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797738&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"aeccb1aca006a8626ce34dff77b1da2042ff325a2bb9f9ce6de593b2468ea3cc","category":"Tech"}