{"title":"iPadOS 15: Better multitasking, the best of iOS 14 on the tablet","link":"https://www.macworld.com/article/348175/ipados-15-multitasking-widgets-app-library-compatilibity-release-beta-how-to-install.html","date":1623094147000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple on Monday <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/06/apple-previews-new-ipad-productivity-features-with-ipados-15/&amp;xcust=1-1-348175-0-0-0&amp;sref=https://www.macworld.com/feed\">unveiled the next generation of iPadOS</a>. It will bring a lot of the changes we got with iOS 14 on the iPhone along with a few new features geared toward power users. Here are the top features Apple is bringing to our iPads with iPadOS 15.</p>\n\n\n\n<h2>Widgets</h2>\n\n\n\n<p>Apple introduced a completely redesigned Home Screen with widgets in iOS 14 and it’s finally bringing them to the tablet. They function <a href=\"https://www.macworld.com/article/234393/how-to-add-remove-and-customize-widgets-in-ios-14.html\">much as they do on the iPhone</a>, offering small boxes that live among the icons on your screen and provide at-a-glance information to things like weather, photos, and stocks. Apple is making them even more powerful on the iPad, however, with support for larger-format widgets with much more information and interaction for things like gaming, media, photos, and files.</p>\n\n\n\n<h2>App Library</h2>\n\n\n\n<p>Another iOS 14 feature that didn’t make it to iPadOS 14 is <a href=\"https://www.macworld.com/article/234405/how-to-use-the-app-library-in-ios-14.html\">App Library</a>, and now it’s coming to iPadOS 15. Apple is letting users delete and reorganize app pages just like they do on the iPhone, as well as see an overview of all of your apps by swiping past the rightmost screen. To make it even easier to get to the App Library, Apple is also building a shortcut right in the dock, so you’ll be able to access your apps no matter what screen or app you’re in.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipadOS-15-home-screen.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Multitasking</h2>\n\n\n\n<p>Multitasking on the iPad has been somewhat confusing since it launched in iOS 12, and Apple is simplifying things in a big way in iPadOS 15. For starters, a new multitasking menu makes it easier for iPad users to discover multitasking and use Split View or Slideover. Instead of a complicated and somewhat opaque gesture system, you’ll be able to access the various modes at a tap.</p>\n\n\n\n<p>When you want to use two apps at the same time, Apple has also made it easier to get apps into the multitasking views. Now, when you select Split View, the current app will reveal the rest of the apps on your iPad so you can quickly select the one you want. There are also new keyboard shortcuts that help quickly access the menu.</p>\n\n\n\n<p>There will also be a new Shelf that floats above the current to quickly jump between your open windows and paired apps. And finally, you’ll be able to drag app windows on top of each other in the overview screen to quickly open them in Split View.</p>\n\n\n\n<h2>Notes</h2>\n\n\n\n<p>Apple has given Notes on iPad a massive overhaul, with a focus on collaboration and organization on the larger screen. Notes will now support tags for easy filtering, and users in shared documents will automatically get a notification when they’re mentioned in a document.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/iPadOS-15-quick-notes.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>Perhaps the best feature in the Notes app on iPadOS 15 is Quick Note. Accessible from anywhere, users can swipe from the bottom right corner of the screen with an Apple Pencil or their finger to quickly bring up a floating not that you can quickly write on and then swipe away. Because it’s contextually aware, it will pin itself to the app you’re using and also be available to access and edit across all of your devices.</p>\n\n\n\n<h2>Swift playgrounds</h2>\n\n\n\n<p>Developers have been clamoring for the Xcode on the iPad ever since the iPad Pro launched, and they kind-of-sort-of got their wish in iPadOS 15. While Apple stopped short of bringing an Xcode version to the iPad, it will let developers build apps on your iPad in Swift UI using the Swift Playgrounds app. Apple says code will be reflected in real-time and you’ll have a complete library of UI components to choose from. You’ll also be able to submit apps for review to the App Store right on your iPad.</p>\n\n\n\n<h2>Universal Control</h2>\n\n\n\n<p>OK, this is technically a Mac feature, but it’s too cool not to talk about. Apple is bringing the ability to work between your devices with the same input device. With Universal Control you’ll be able to work with a single mouse and keyboard and move your cursor and content between your Mac and iPad for a seamless experience, with no setup required.</p>\n\n\n\n<h2>Availability and compatibility </h2>\n\n\n\n<p>iPadOS 15 will be available this fall as a free software update for iPad mini 4 and later, iPad Air 2 and later, iPad 5th generation and later, and all iPad Pro models.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"aed1b93fab71a9db5be7115144e6a506c0398c937968d3af2239c25f3d661501","category":"Apple"}