{"title":"Common dolphin (Delphinus delphis) mitochondrial genomes from Senegal reveal geographic structure across the North Atlantic but provide no support for global long‐beaked clade","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13144?af=R","date":1718004604000,"content":"<h2>Abstract</h2>\n<p>The common dolphin (<i>Delphinus delphis</i>) is a widely distributed species exhibiting extensive morphological diversity, with previous taxonomies recognizing multiple <i>Delphinus</i> species primarily based on relative beak length. We sequenced mitochondrial genomes of <i>D. delphis</i> morphotypes from multiple regions, calculated mitogenome nucleotide diversity (π = 0.00504), dated <i>Delphinus</i> mitogenome diversification to 1.27 mya, and conducted phylogenetic and population-level analyses focusing on morphotype and geographic origin. We present the first <i>Delphinus</i> sequencing data from Senegal, at the edge of where long- and short-beaked dolphins co-occur in the Atlantic, but only recovering stranded dolphins with long or indeterminate beak lengths. While we detected little genetic structure across most of the North Atlantic, fixation indices demonstrate that Senegalese dolphins are distinct. Geography did not reliably predict phylogeny, with few monophyletic localities, but we do infer a monophyletic group of long-beaked dolphins from California, Peru, and possibly China. However, neither Senegalese long-beaked dolphins nor long-beaked <i>D. d. tropicalis</i> are closely related to Pacific long-beaked dolphins, providing no support for a worldwide long-beaked clade (formerly <i>D. capensis</i>). Our findings reveal a distinctive Senegal <i>Delphinus</i> population and provide a foundation for global genomic analyses to further investigate the evolution of <i>Delphinus</i> morphotypes.</p>","author":"Madeleine A. Becker, \nKatherine R. Murphy, \nFrederick I. Archer, \nThomas A. Jefferson, \nLucy W. Keith‐Diagne, \nCharles W. Potter, \nM. Fernanda Urrutia‐Osorio, \nIbrahima Ndong, \nMichael R. McGowen","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"aed7f81d4b2abb63b5dbbf16e331e7b18ac78e68cf58633c1718868f8adc1813","category":"Environment"}