{"title":"The Entourage Effect in Cannabis Medicinal Products: A Comprehensive Review","link":"https://www.preprints.org/manuscript/202409.1225/v1","date":1726482348000,"content":"This study explores the complementary or synergistic effects of medicinal cannabis constituents, particularly terpenes, concerning their therapeutic potential, known as the entourage effect. A systematic review of the literature on cannabis entourage effects was conducted using the PRISMA model. Two research questions conducted the review: (1) What are the Physiological Effects of Terpenes and Terpenoids found in Cannabis? (2) What are the proven Entourage Effects of Terpenes in Cannabis? The initial approach involved an exploratory search in electronic databases using predefined keywords and Boolean phrases across PubMed/MEDLINE, Web of Science, and EBSCO databases, using Medical Subject Headings (MeSH). Analysis of published studies shows no evidence of neuroprotective or anti-aggregatory effects of α-pinene and β-pinene against β-amyloid-mediated toxicity, however, modest lipid peroxidation inhibition by α-pinene, β pinene, and terpinolene may contribute to the multifaceted neuroprotection properties of these C. sativa-prevalent monoterpenes and their triterpene friedelin. Myrcene demonstrated anti-inflammatory proprieties topically, however, in combination with CBD did not show significant additional differences. Exploratory evidence suggests various therapeutic benefits of terpenes, such as myrcene for relaxing; linalool as sleep aid, exhaustion relief and mental stress; D-limonene as an analgesic; caryophyllene for cold tolerance and analgesia; valencene for cartilage protection, borneol for antinociceptive and anticonvulsant potential; and eucalyptol for muscle pain. While exploratory research suggests terpenes as influencers in the therapeutic benefits of cannabinoids, the potential for synergistic or additive enhancement of cannabinoid efficacy by terpenes remains unproven. Further clinical trials are needed to confirm these constituents' individual and combined effects.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"aee0caf9ac4c592a0cff643bfc2bc61850a92552c7abc10f5797e248d2a632a6","category":"Interdisciplinary"}