{"title":"Traversing the land‐sea interface: A climate change risk assessment of terrestrially breeding marine predators","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17452?af=R","date":1724137200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a913c355-cbd5-4dce-82c5-deaefaf7324e/gcb17452-toc-0001-m.png\" alt=\"Traversing the land-sea interface: A climate change risk assessment of terrestrially breeding marine predators\" />\n<p>We developed a framework to assess climate change risk for 56 seabird and seal species breeding in Australian territories and Antarctica. Extreme weather, changes in habitat suitability, and prey availability were key climate hazards, with species such as shy albatross, Australian fur seals, southern rockhopper penguins, and Australian sea lions facing high climate urgency. Our research highlights the need for focused studies on at-risk species and filling knowledge gaps to create effective conservation and management strategies for these iconic marine predators.</p>\n<br />\n<h2>Abstract</h2>\n<p>Terrestrially breeding marine predators have experienced shifts in species distribution, prey availability, breeding phenology, and population dynamics due to climate change worldwide. These central-place foragers are restricted within proximity of their breeding colonies during the breeding season, making them highly susceptible to any changes in both marine and terrestrial environments. While ecologists have developed risk assessments to evaluate climate risk in various contexts, these often overlook critical breeding biology data. To address this knowledge gap, we developed a trait-based risk assessment framework, focusing on the breeding season and applying it to marine predators breeding in parts of Australian territory and Antarctica. Our objectives were to quantify climate change risk, identify specific threats, and establish an adaptable assessment framework. The assessment considered 25 criteria related to three risk components: vulnerability, exposure, and hazard, while accounting for uncertainty. We employed a scoring system that integrated a systematic literature review and expert elicitation for the hazard criteria. Monte Carlo sensitivity analysis was conducted to identify key factors contributing to overall risk. We identified shy albatross (<i>Thalassarche cauta</i>), southern rockhopper penguins (<i>Eudyptes chrysocome</i>), Australian fur seals (<i>Arctocephalus pusillus doriferus</i>), and Australian sea lions (<i>Neophoca cinerea</i>) with high climate urgency. Species breeding in lower latitudes, as well as certain eared seal, albatross, and penguin species, were particularly at risk. Hazard and exposure explained the most variation in relative risk, outweighing vulnerability. Key climate hazards affecting most species include extreme weather events, changes in habitat suitability, and prey availability. We emphasise the need for further research, focusing on at-risk species, and filling knowledge gaps (less-studied hazards, and/or species) to provide a more accurate and robust climate change risk assessment. Our findings offer valuable insights for conservation efforts, given that monitoring and implementing climate adaptation strategies for land-dependent marine predators is more feasible during their breeding season.</p>","author":"Milan Sojitra, \nStuart Corney, \nMark Hemer, \nSheryl Hamilton, \nJulie McInnes, \nSam Thalmann, \nMary‐Anne Lea","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"aee185a3ef38f72805c2db7f0c0e7ab37a808b31604987ac2f8875a9c7136deb","category":"Environment"}