{"title":"WhatsApp Launches Instant Cryptocurrency Payments in the US","link":"https://www.macrumors.com/2021/12/09/whatsapp-cryptocurrency-payments-us/","date":1639051366000,"content":"WhatsApp has launched a cryptocurrency payment feature for a small number of users in the United States, thanks to Novi integration, a digital wallet owned by Facebook (now Meta).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/Novi-WhatsApp.jpg\" />\r\n<br />\r\nThe pilot program lets users of the encrypted messaging app send and receive money \"instantly, securely, and with no fees\" using the Paxos Dollar (USPD) stablecoin, whose value is linked to the US dollar.\r\n<br />\r\n\r\n<br />\r\nThe way the payments work in WhatsApp is similar to sending regular attachments in a conversation. Users tap the plus (+) icon and then select Payment from the menu that appears. Users who are paid this way receive USDP, which can be withdrawn to a bank account in its equivalent value in US dollars.\r\n<br />\r\n\r\n<br />\r\nThere's no cap on the number of times the Novi system can be used to send and receive money through WhatsApp. Regardless of frequency of use, there are no fees associated with keeping a balance in a Novi account or withdrawing it to a bank account. In addition, the inclusion of Novi in the chat platform has no effect on the end-to-end encryption of personal messages.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>There's a new way to try the <a href=\"https://twitter.com/novi?ref_src=twsrc%5Etfw\">@Novi</a> digital wallet. Starting today, a limited number of people in the US will be able to send and receive money using Novi on <a href=\"https://twitter.com/WhatsApp?ref_src=twsrc%5Etfw\">@WhatsApp</a>, making sending money to family and friends as easy as sending a message. 💸💬 <a href=\"https://t.co/dGz3lejri7\">pic.twitter.com/dGz3lejri7</a></p>— Stephane Kasriel (@skasriel) <a href=\"https://twitter.com/skasriel/status/1468722859648307201?ref_src=twsrc%5Etfw\">December 8, 2021</a></blockquote> </div>The small pilot program is available to some users in the US from today. For more information about the WhatsApp integration, check out the <a href=\"https://www.novi.com/WhatsApp\">Novi website</a>.\r\n<br />\r\n\r\n<br />\r\nThe pilot is one outcome of Meta's <a href=\"https://www.bloomberg.com/news/articles/2018-12-21/facebook-is-said-to-develop-stablecoin-for-whatsapp-transfers\">cryptocurrency plans</a>, which have changed since they were officially announced in 2019. Back then, the plan was to develop a cryptocurrency called Libra that would be linked to a Facebook digital wallet called Calibra. \r\n<br />\r\n\r\n<br />\r\nHowever, Libra has since become Diem, and Calibra has become Novi, and instead of using Diem, Novi has adopted the Paxos stablecoin in partnership with Coinbase, which is the custody partner that holds the funds for the pilot. \r\n<br />\r\n\r\n<br />\r\nWhatsApp already offers payment systems in India and Brazil, but these used traditional fiat currencies rather than crypto.\r\n<br />\r\n\r\n<br />\r\n<em>(Via <a href=\"https://wabetainfo.com/whatsapp-is-announcing-the-novi-pilot-program-in-the-us/\">WaBetaInfo</a>.)</em><div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/cryptocurrency/\">cryptocurrency</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/09/whatsapp-cryptocurrency-payments-us/\">WhatsApp Launches Instant Cryptocurrency Payments in the US</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-launches-instant-cryptocurrency-payments-in-the-us.2326804/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=E4vIoktocEw:B4cws54kYqs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=E4vIoktocEw:B4cws54kYqs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"aee781e358bacc348a8801a3721f55cf2b3fe533edce2d9269209677b879b200","category":"Apple"}