{"title":"At the biggest WWDC ever, wearables will finally steal the show","link":"https://www.macworld.com/article/1935863/wwdc-2023-what-to-expect-headset-watchos-macbook-ios-macos.html","date":1685630387000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After months of rumors and speculation, Apple’s annual Worldwide Developers Conference is imminent. In just a few short days, all that rumor and speculation will finally be answered, and we can make way for…new rumors and speculation. (At least then it will be based on things we’ve actually <em>seen</em>.)</p>\n\n\n\n<p>But as we enjoy our last hurrah before the hurricane of news and updates hits, it’s time to compile a look at what exactly we might be expecting when Apple executives appear (in a no doubt slickly compiled video) at Apple Park next week, and what isn’t likely to make the cut.</p>\n\n\n\n<h2>Heads up</h2>\n\n\n\n<p>They say that where there’s smoke there’s fire, and if that’s true then the Apple mixed-reality headset must be molten lava. (And not just because its processors are likely putting off a lot of heat.) This will be the first major new platform introduced by the company since the Apple Watch in 2014, and arguments about what it will look like, how much it will cost, whether it will be able to succeed where others fail, and even what Apple will call it have all run rampant.</p>\n\n\n\n<p>But setting that aside for a moment, I think it’s worth noting that a new platform from Apple is actually a pretty rare thing. Yes, the company has introduced them at a rapid clip over the past 15 or so years–the iPhone, the iPad, the Apple TV, the Apple Watch—but it doesn’t happen every year or even every couple of years. Apple only puts this much weight behind something that it believes has a chance in the market. This isn’t a company that’s gotten where it is by launching products willy-nilly.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3814084/iphone-14-dernier-smartphone-apple-encoche.jpg?quality=50&amp;strip=all\" alt=\"iPhone 14\" loading=\"lazy\" /><figcaption><p>Apple’s mixed reality headset won’t replace the iPhone immediately, but that’s the goal.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Also important is that Apple can afford, perhaps more than any other tech company, to play the long game. In fact, in some ways, it can’t afford to <em>not</em> play the long game: the iPhone is a blockbuster product, and there may very well be nothing else like it in my lifetime, but in case there <em>is</em>, Apple needs to be there. Sooner or later something will succeed the iPhone, and if Apple isn’t the one to develop it, then a huge chunk of its revenue will disappear.</p>\n\n\n\n<p>It will be very interesting, come next week, to see how Apple pitches its headset; keep a close eye on whether, in a rare step, it talks about where the puck is headed with this product rather than just where it is now.</p>\n\n\n\n<h2>Watch and learn</h2>\n\n\n\n<p>Rumor has it that Apple’s <em>last</em> big new platform is due for a refresh after almost a decade on the scene. There’s an expectation that watchOS will get a significant overhaul at this year’s WWDC, and it does seem like it’s time (no pun intended) for the company to take another crack at this most personal of wearables.</p>\n\n\n\n<p>After nine years of data seeing how people use the smartwatch, it’s a reasonable opportunity to explore how to improve the experience. One rumor suggests that watchOS 10 will take a widget-focused approach, using some of the same technology that supports existing widgets on iOS and iPadOS.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3816616/apple_watch_series_314.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Series 3\" loading=\"lazy\" /><figcaption><p>Apple Watch could get a new look, thanks to watchOS 10.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>That idea isn’t exactly <em>new</em> to the Apple Watch: early on in the product’s life, the company had a concept called Glances that was envisioned to be for very simple one-screen “apps”. While the feature ultimately fell by the wayside, the recent adoption of widgets on Apple’s other platforms might make that a more attractive option on the watch as well, allowing developers to easily port work they’ve done on iOS and iPadOS to the smartwatch. As someone who only uses a few apps (few of which require anything more than a single screen), this could really help streamline using the Apple Watch.</p>\n\n\n\n<h2>The best of the rest</h2>\n\n\n\n<p>With a big chunk of the keynote likely devoted to the headset and watchOS, it’s anybody’s guess as to how much time the rest of Apple’s platforms will get. Don’t expect them to be ignored completely, though: WWDC is Apple’s chance to talk about the year ahead for all of its products.</p>\n\n\n\n<p>What seems most likely, given the trajectory of the last few years of WWDC presentations, is that we’ll see more about new features that are coming simultaneously across Apple devices–say, for example, an Apple journaling app–as well as a few capabilities specific to each device.</p>\n\n\n\n<p>That might include features like lock screen widgets coming to iPadOS 17 or a new rumored “status board” iOS 17 lock screen capability. There’s been little out there for either macOS or tvOS, though, suggesting that it might be a quiet year for some of Apple’s smaller platforms.</p>\n\n\n\n<p>Finally, there’s always the question of hardware. Setting aside the headset for the moment–even if demoed at WWDC is unlikely to go on sale for the next several months–there are two Mac models that might make an appearance at the event: a 15-inch MacBook Air, which is likely to be just a larger version of the existing 13-inch version, and the Apple silicon-based Mac Pro, which Apple teased back in March 2022 but has yet to unveil.</p>\n\n\n\n<p>The latter would seem a particularly appropriate announcement for a developer-centric audience, but given the dearth of rumors in the supply chain, it seems unlikely to ship in the near future. The 15-inch Air, by comparison, is supposedly ready to go but seems a less exciting product on which to spend a significant chunk of the keynote.</p>\n\n\n\n<p>And, of course, Apple always leaves room for surprises. Personally, I’ve got my fingers crossed for small announcements that improve the quality of life across Apple’s devices: using any emoji for tapbacks in Messages, or improving autocorrect, or even just making Mail more responsive. If it’s a smaller year for Apple’s other platforms, the company could do worse than making little tweaks that can make a big difference.</p>\n\nApple Watch, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"aeeb8047686ba0ba5a3dad93336409e5b7f70bbf870b57fab53f03c9b699c6ba","category":"Apple"}