{"title":"SPOT-RASTR—A cryo-EM specimen preparation technique that overcomes problems with preferred orientation and the air/water interface","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae284/7727607?rss=1","date":1722902400000,"content":"<span><div>Abstract</div>In cryogenic electron microscopy (cryo-EM), specimen preparation remains a bottleneck despite recent advancements. Classical plunge freezing methods often result in issues like aggregation and preferred orientations at the air/water interface. Many alternative methods have been proposed, but there remains a lack a universal solution, and multiple techniques are often required for challenging samples. Here, we demonstrate the use of lipid nanotubes with nickel NTA headgroups as a platform for cryo-EM sample preparation. His-tagged specimens of interest are added to the tubules, and they can be frozen by conventional plunge freezing. We show that the nanotubes protect samples from the air/water interface and promote a wider range of orientations. The reconstruction of average subtracted tubular regions (RASTR) method allows for the removal of the nanotubule signal from the cryo-EM images resulting in isolated images of specimens of interest. Testing with β-galactosidase validates the method's ability to capture particles at lower concentrations, overcome preferred orientations, and achieve near-atomic resolution reconstructions. Since the nanotubules can be identified and targeted automatically at low magnification, the method enables fully automated data collection. Furthermore, the particles on the tubes can be automatically identified and centered using 2D classification enabling particle picking without requiring prior information. Altogether, our approach that we call specimen preparation on a tube RASTR holds promise for overcoming air–water interface and preferred orientation challenges and offers the potential for fully automated cryo-EM data collection and structure determination.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"aef1858efdcfbe46c562618e440c3c650b85fe6893a6745311518ae957187b50","category":"Interdisciplinary"}