{"title":"60 Effects of phase feeding rolled hybrid rye on feedlot performance in backgrounded beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_2/202/7664789?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effects of phase-fed rolled hybrid rye on feedlot performance and carcass characteristics of finishing steers. Backgrounded steers [n = 110; initial shrunk (4% of body weight; BW) = 391 ± 1.3 kg] were assigned to 1 of 14 pens at the Southeast Research Farm, Beresford, SD in a randomized complete block design. Pens were blocked by location with four blocks of dirt-surfaced, outside pens (8 pens; 10 steers/pen) and three blocks of concrete-surfaced, partially covered pens (6 pens; 5 steers/pen). Pens were randomly assigned to one of two dietary treatments (7 pens/treatment): dry rolled corn (DRC) included at 66% diet dry matter (DM) or rolled hybrid rye (RRYE) included at 66% diet DM for the initial 46 d of the experiment followed by the DRC diet from d 47 to trial completion on d 144. One steer was removed from the study because of lameness. During the rye feeding period (d1 to d 46), RRYE decreased average daily gain (ADG) by 13% (<span>P</span> = 0.01; 1.59 and 1.83 kg, respectively) and DMI by 18% (<span>P</span> = 0.01; 8.45 and 10.30 kg, respectively) with no effect (<span>P</span> = 0.15) on gain to feed ratio (G:F) compared with DRC. Negative effects of RRYE were more pronounced during the first 20 d of the experiment with ADG reduced by 29% (<span>P</span> = 0.01; 1.13 and 1.60 kg, respectively), DMI by 15% (<span>P</span> = 0.01; 8.20 and 9.61 kg, respectively), and G:F by 17% (<span>P</span> = 0.01; 0.139 and 0.167, respectively). Dietary net energy values for RRYE were increased (<span>P</span> ≤ 0.03) from d 1 to 46. Feeding rye reduced BW on d 46 by 10 kg compared with DRC (<span>P</span> = 0.01; 474 and 464 kg, respectively). From d 47 to 144 when all steers were fed a common diet there were no differences (<span>P</span> ≥ 0.38) in any growth performance responses or measures of dietary net energy utilization. When measured over the entire experiment, DMI tended to be less (<span>P</span> = 0.08) for RRYE compared with DRC with no effect on ADG or G:F (<span>P</span> ≥ 0.19). Final BW was numerically reduced in the RRYE treatment compared with DRC (<span>P</span> = 0.21; 614 and 623 kg, respectively). Cumulative observed-to-expected ratios for NEm and NEg were increased (<span>P</span> = 0.05) for RRYE compared with DRC. Dietary treatments did not affect (<span>P</span> ≥ 0.29) carcass characteristics, distribution of USDA yield or quality grades, or liver abscess incidence or severity. Feeding rolled rye decreased ADG, DMI, and G:F during the first 46 DOF with similar growth performance when fed a DRC-based diet for the final 98 d.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"aef73da9c05fdec02e8a13d3a5b93f00f5cce1d322a6615f9436e30298988f0c","category":"Environment"}