{"title":"Cloning and function of the cyclin‐dependent kinase 9 gene in ovarian development of the ridgetail white prawn, Exopalaemon carinicauda","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16073?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>To investigate the key genes affecting ovarian development in the ridgetail white prawn, <i>Exopalaemon carinicauda</i>, we cloned the full-length cDNA of the <i>CDK</i>9 gene and discussed its role in ovarian development. Our results show that the gene has an open reading frame of 1155 bp, encoded 383 amino acids, and it has a conserved cyclin binding motif S_TKc. The open reading frame of <i>CDK</i>9 was expressed as a 43.96 Kda molecular weight protein. The phylogenetic tree analysis showed that the <i>CDK</i>9 gene has the highest homology with the <i>CDK</i>9 genes of <i>Penaeus vannamei</i> and <i>Penaeus japonicus</i>. The results of qRT-PCR show that the <i>CDK</i>9 gene was also expressed in the eye stalk, stomach, heart, gill, intestine, muscle, ovary, hepatopancreas and ventral cord. The expression level was highest in the ovary, which was significantly different from the other tissues (<i>p</i> &lt; 0.05). In the five stages of ovarian development, the expression level of the <i>CDK</i>9 gene was highest in stage I, which was significantly different from the other stages (<i>p</i> &lt; 0.05). In situ hybridization tests showed strong expression signals in the membrane, cytoplasm and nucleus of oocytes and previtellogenic oocytes. Nevertheless, following the proliferation of oocytes, the expression signals became much stronger in the oocyte membrane and in the whole follicular cells located in the interstitial space. The RNA interference results show that the expression of the <i>CDK</i>9 gene significantly affects the expression of the <i>Vg</i> and <i>VgR</i> genes. Our findings suggest that <i>CDK</i>9 plays an important role in the synthesis and transportation of vitellin.</p>","author":"Pan Zhang, \nYongchuang Li, \nDuwei Zheng, \nSongsong Hua, \nChongyang Song, \nZhengmin Li, \nTingting Shi, \nPanpan Wang, \nBinlun Yan, \nJitao Li, \nHuan Gao","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"af005590fe74b10e8a8d60d9b46b35a8f239a15ec1369cfdceb8855c134e68d2","category":"Environment"}