{"title":"Shimano recalls 760,000 Hollowtech road cranks due to 4,519 incidents of ‘separation or delamination’","link":"https://www.bikeradar.com/news/shimano-crankset-recall/","date":1695304571000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Broken Shimano crankset\" title=\"Broken Shimano crankset\" />                                            <p>Shimano has issued a recall of more than 760,000 road cranksets sold in the US and Canada over an 11-year period.</p>\n<p>The recall has been issued after a reported 4,519 incidents of cranksets separating. This has resulted in six injuries, “including bone fractures, joint displacement and lacerations” according to the recall statement.</p>\n<p>The recall affects the following models:</p>\n<ul>\n<li>Ultegra FC-6800</li>\n<li>Dura-Ace FC-9000</li>\n<li>Ultegra FC-R8000</li>\n<li>Dura-Ace FC-R9100</li>\n<li>Dura-Ace FC-R9100P</li>\n</ul>\n<p>The recall affects “about 680,000” cranksets sold in the USA, manufactured prior to July 2019 and sold from January 2012 through August 2023. It covers a further 80,000 sold in Canada.</p>\n<p>The recall affects both cranksets specced on complete bikes and aftermarket.</p>\n<p>BikeRadar has previously reported on <a href=\"https://www.bikeradar.com/features/shimano-crank-failure/\">Shimano road cranksets delaminating</a>. However, this is the first time Shimano has acknowledged a widespread issue with its Hollowtech cranksets.</p>\n<p>Owners in the USA and Canada are invited to contact an authorised Shimano dealer. Only owners of cranksets showing signs of “bonding separation or delamination during the inspection will be provided a free replacement crankset and installation”.</p>\n<p>The “safety and inspection and replacement programme” also affects riders in the EU. <a href=\"https://bike.shimano.com/en-EU/information/customer-services/corrective-actions/important-safety-notice-11-speed-hollowtech-road-cranksets-inspection-program.html\" target=\"_blank\">A statement published on the Shimano website</a> says “the timing of the inspection and other details will be announced on this website in the near future”.</p>\n<p>In the meantime, Shimano has set up an official helpline to assist consumers affected by the recall. International customers can call +31 792 077 017 between the hours of 9am and 9pm CET Monday to Friday, and from 9am to 5pm CET on Saturdays. The helpline is not open on Sundays.</p>\n\n<section>\n    <div>\n        <p></p>\n<h2>United States Consumer Product Safety Commission recall statement </h2>\n<p>The recall description listed on the United States Consumer Product Safety Commission site reads:</p>\n<p>“This recall involves Shimano Ultegra FC-6800, Dura-Ace FC-9000, Ultegra FC-R8000, Dura-Ace FC-R9100 and FC-R9100P 11-Speed Bonded Hollowtech Road Cranksets manufactured prior to July 2019 sold individually and on bicycles sold by other manufacturers such as Trek and Specialized. </p>\n<p>“A crankset is the component of the bicycle that the chain and pedals attach to for pedaling. The recalled models have printed ‘Ultegra’ or Dura Ace’ logos on the arm. </p>\n<p>“The affected models are pre-July 2019 production and have the following two letter production code on backside of the crank arm where the pedals are attached: KF, KG, KH, KI, KJ, KK, KL, LA, LB, LC, LD, LE, LF, LG, LH, LI, LJ, LK, LL, MA, MB, MC, MD, ME, MF, MG, MH, MI, MJ, MK, ML, NA, NB, NC, ND, NE, NF, NG, NH, NI, NJ, NK, NL, OA, OB, OC, OD, OE, OF, OG, OH, OI, OJ, OK, OL, PA, PB, PC, PD, PE, PF, PG, PH, PI, PJ, PK, PL, QA, QB, QC, QD, QE, QF, QG, QH, QI, QJ, QK, QL, RA, RB, RC, RD, RE, and RF.”</p>\n<p>The USCPSC site list says consumers with an affected crankset “should immediately stop using the cranksets manufactured before July 1, 2019, and contact an authorized Shimano dealer to schedule a free crankset inspection. </p>\n<p>“Only consumers whose cranksets show signs of bonding separation or delamination during the inspection will be provided a free replacement crankset and installation.”</p>\n<p> </p>\n<p>\n\n    </p></div>\n    </section>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"af075204bc9d81701cc88367cb594607cfa287fedf7af7870aa0f99815e12730","category":"Cycling"}