{"title":"Whey Cheeses Containing Probiotic and Bioprotective Cultures Produced With Ultrafiltrated Cow’s Whey","link":"https://www.preprints.org/manuscript/202403.0767/v1","date":1710319430000,"content":"Bovine whey cheese (WC) is a product from southern European countries that presents some challenges: their elaboration process involves high energy inputs, the yield is low and WC has a short shelf-life. The application of ultrafiltration to bovine whey before its manufacture and the employment of protective cultures can reduce these disadvantages. The aim of this work was to manufacture whey cheeses using ultrafiltrated (UF) concentrated bovine cheese whey with added probiotics or probiotics plus protective cultures. Three types of WC were produced: control, without any addition (C); with the addition of the probiotic Lactobacillus acidophilus (LA5); with the addition of Lactobacillus acidophilus plus a protective culture containing Lactobacillus paracasei and Lactobacillus rhamnosus (LA5FQ4). The WCs were stored under refrigerated conditions for 28 days. The products with added cultures presented a lower pH and a higher titratable acidity when compared to the control. Sample LA5 presented the lowest pH and the highest titratable acidity while LA5FQ4 presented intermediate values. Slight differences were observed between products regarding color parameters, chiefly as a result of storage time. The samples with added cultures were firmer when compared to the control, showing LA5 cheeses the highest values at the end of the storage. Lactobacilli and lactococci counts were of the order of log 8-9 CFU/g for the products with added cultures. Lower levels of yeasts and moulds were detected on the sample with the protective culture (LA5FQ4), that by the end of storage presented counts one log cycle lower than C and LA5. Hence, it is evident the beneficial impact of the protective culture on the shelf life of the product. In what concerns to sensory evaluation, LA5FQ4 cheeses obtained the highest scores regarding all parameters evaluated. It could be concluded that the use of UF associated to the addition of protective cultures can be very useful to reduce the energy consumption of the process, prolong the shelf life of WC, and to improve its sensory properties.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"af113f232d5598b4f937f98617913735c23b0d83de6335dee75f87f5c054a7cf","category":"Interdisciplinary"}