{"title":"Varying Performance of Low-Cost Sensors During Seasonal Smog Events in Moravian-Silesian Region","link":"https://www.preprints.org/manuscript/202410.0258/v1","date":1727947694000,"content":"This study examines the varying performance of low-cost sensors during seasonal smog events, particularly those resulting from solid fuel combustion linked to residential or industrial heating and other pollution sources. A prototype low-cost sensor node developed within this work was collocated for several months with reference equipment at an air quality monitoring station in the city of Ostrava (Moravian-Silesian region, Czech Republic). Deterioration of air quality during a pair of smog alert events, namely wintertime \"Polish smog\" episode and springtime \"Saharan dust storm\", which occurred through the extended period of co-location, was characterized quantitatively based on particulate matter and carbon monoxide concentrations measured by the low-cost sensors. These datasets were compared with reference data and model predictions provided by the Copernicus Atmospheric Monitoring Service. Selected low-cost sensors demonstrated linear response during Polish smog episode with highly correlated time series of carbon monoxide and particulate matter concentrations. However, when compared to reference data, the Sensirion SPS30 sensor is found to overestimate coarse particle (PM10) concentrations by the factor of two during winter evaluation period. On the other hand, oppositely biased PM10 response (underestimation by the factor of five) was determined from co-location measurement during Saharan dust storm event. This observation was attributed to combination of specific detection efficiency of the given low-cost sensor and shifts in particle size distribution due to seasonal change of ambient conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"af293e5fc5949224ef924fae66225408d2c959140d1f180f1b44dc9e5239bba6","category":"Interdisciplinary"}