{"title":"Does the Metabolic Syndrome and Its Components Have Prognostic Significance for Renal and Cardiovascular Outcomes in IgA Nephropathy?","link":"https://www.preprints.org/manuscript/202404.0980/v1","date":1713185622000,"content":"Background: Cardiovascular (CV) morbidity and mortality are many times higher in chronic kidney disease (CKD), as well as IgA nephropathy (IgAN), than in the general population. The occurrence of metabolic syndrome (MetS) and metabolic risk factors are independent risk factors for CV disease and renal progression. The study aimed to determine the prognostic role of metabolic profiles in a homogenous group of CKD patients.\nMethods: One hundred and forty-five IgA nephropathy patients (92 male, 53 female, age 54.7 ± 13 years) with CKD stage 1-4 were investigated and followed for a median of 190 months. The composite (CV and renal) endpoints included all-cause mortality and any CV event such as stroke, myocardial infarction, revascularization (CV), end-stage renal disease, and renal replacement therapy (renal).\nResults: Patients with MetS had significantly more endpoint events (16/27 patients vs. 15/98 patients, p = 0.001) compared to the nonMetS group. Of the secondary endpoints (CV or renal separately), the rate of the renal and CV endpoints was significantly higher in the MetS group (p = 0.001 and p = 0.029). The primary endpoint independent predictors of survival were dyslipidemia, eGFR, hemoglobin, urine albuminuria, and diabetes mellitus, as determined by Cox regression analysis. Independent predictors of secondary renal endpoint were dyslipidemia, hemoglobin, urine albumin, and eGFR. Predictors of secondary cardiovascular endpoints were gender, BMI, and diabetes. Kaplan-Meier curves showed significant differences in MetS and non-MetS when examined at the combined endpoints (CV and renal) or at each endpoint separately. The primary endpoint rate increased significantly with the increased number of MetS components (MetS comp. 0 vs. MetS comp. 2+, primary endpoints, p = 0.012).\nConclusion: Our results showed that the metabolic profile has a prognostic role not only for renal endpoints but also for CV endpoints in IgAN. BMI, hyperuricemia, hypertension, and diabetes have a predictive value for the prognosis of IgA nephropathy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"af3f2859d1c2bb9f0d03c885b646ffd7782c505c8925deebe6853d89fecbd269","category":"Interdisciplinary"}