{"title":"Repair effect of human umbilical cord mesenchymal stem cell‐derived small extracellular vesicles on ovarian injury induced by cisplatin","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24303?af=R","date":1720839998000,"content":"<h2>Abstract</h2>\n<p>Small extracellular vesicles (sEVs) secreted by human umbilical cord have therapeutic effects on various degenerative diseases. However, the characteristics and potential functions of human umbilical cord mesenchymal stem cells (huMSCs)-derived sEVs, especially the role of premature ovarian failure (POF), are poorly understood. Here, we isolated and characterized huMSCs and their sEVs. huMSCs highly expressed CD73, CD90, and CD105. huMSC-sEVs showed typical exosomal features, highly expressing CD9, TSG101, and CD63. It was shown that huMSC-sEVs could be taken up by granulosa cells (GCs) and damaged ovarian tissue, which increased the levels of hormone secretion and reduced GCs apoptosis. We further confirmed that the levels of follicle-stimulating hormone in rat serum decreased dramatically, while the levels of estrogen (E<sub>2</sub>）and anti-mullerian hormone (AMH) increased significantly with the treatment of huMSC-sEVs. Meanwhile, huMSC-sEVs treatment greatly reduced cell apoptosis and autophagy, while increased the phosphorylation levels of p-PI3K and p-Akt. Therefore, treatment with huMSC-sEVs significantly inhibited GCs apoptosis, improved ovarian morphology, promoted follicular development, inhibited follicular over-atresia, and improved ovarian reserve capacity in POF rats. Our study verified that activation of PI3K/Akt signaling pathway and regulation of cellular autophagy, thus reducing GCs death, are the mechanisms by which huMSC-sEVs restore ovarian tissue function.</p>","author":"Bianling Xu, \nWei Guo, \nXiaojing He, \nZijie Fu, \nHongxu Chen, \nJun Li, \nQingya Ma, \nShengjun An, \nXiaodong Li","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"af4c6b8506a04f027dc38024d16c331990e56b5df586d5a980551609d5c09a97","category":"Environment"}