{"title":"Assessing Current Coastal Subsidence at Continental Scale: Insights From Europe Using the European Ground Motion Service","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004523?af=R","date":1723548679000,"content":"<h2>Abstract</h2>\n<p>Beside climate-change-induced sea-level rise (SLR), land subsidence can strongly amplify coastal risk in flood-prone areas. Mapping and quantifying contemporary vertical land motion (VLM) at continental scales has long been a challenge due to the absence of gridded observational products covering these large domains. Here, we fill this gap by using the new European Ground Motion Service (EGMS) to assess the current state of coastal VLM in Europe. First, we compare the InSAR-based EGMS Ortho (Level 3) with nearby global navigation satellite systems (GNSS) vertical velocity estimates and show that the geodetic reference frame used to calibrate EGMS strongly influences coastal vertical land velocity estimates at the millimeter per year level and this needs to be considered with caution. After adjusting the EGMS vertical velocity estimates to a more updated and accurate International Terrestrial Reference Frame (ITRF2014), we performed an assessment of VLM in European low elevation coastal flood plains (CFPs). We find that nearly half of the European CFP area is, on average, subsiding at a rate faster than 1 mm/yr. More importantly, we find that urban areas and populations located in the CFP experience a near −1 mm/yr VLM on average (excluding the uplifting Fennoscandia region). For harbors, the average VLM is even larger and increases to −1.5 mm/yr on average. This demonstrates the widespread importance of continental-scale assessments based on InSAR and GNSS to better identify areas at higher risk from relative SLR due to coastal subsidence.</p>","author":"Rémi Thiéblemont, \nGonéri Le Cozannet, \nRobert J. Nicholls, \nJérémy Rohmer, \nGuy Wöppelmann, \nDaniel Raucoules, \nMarcello de Michele, \nAlexandra Toimil, \nDaniel Lincke","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"af4f34958dd36e6e9d26100dc6dcf708eb5a01cbdb9129f4390ef9ae7b08ce6a","category":"Environment"}