{"title":"RETRACTION: Serum Cadmium Positively Correlates With Inflammatory Cytokines in Patients With Chronic Obstructive Pulmonary Disease","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24421?af=R","date":1726469285000,"content":"<p>RETRACTION: Y.-L. Jiang, J. Fei, P. Cao, C. Zhang, M.-M. Tang, J.-Y. Cheng, H. Zhao, and L. Fu, “Serum Cadmium Positively Correlates With Inflammatory Cytokines in Patients With Chronic Obstructive Pulmonary Disease,” Environmental Toxicology 37, no. 1 (2022): 151–160, <a target=\"_blank\" href=\"https://doi.org/10.1002/tox.23386\">https://doi.org/10.1002/tox.23386</a>.</p>\n<p>The above article, published online on 15 October 2021 in Wiley Online Library (<a target=\"_blank\" href=\"http://wileyonlinelibrary.com\">wileyonlinelibrary.com</a>), has been retracted by agreement between the authors; the journal Editor-in-Chief, Paul B. Tchounwou; and Wiley Periodicals LLC.</p>\n<p>The retraction has been agreed upon following concerns raised by a third party regarding the data presented in the article. The authors collaborated on the investigation into the raised concerns and provided the underlying raw data for the presented study. An independent evaluation of the dataset revealed inaccuracies in the statistical analysis, which affected the interpretability of the results. Accordingly, the absence of demonstrated associations between age and chronic conditions, such as diabetes, hypertension, and metabolic disease, in the study's subjects raises serious doubts about the validity of the findings. Consequently, the editors have deemed the article's conclusions unreliable. The authors acknowledged the mistakes made during manuscript preparation and apologize for the inconvenience caused.</p>","author":"","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"af53ce2f59cb9dc966d761a9db072da552dc18fa771bd63d2bfa2ebc44f443d2","category":"Environment"}