{"title":"Spatial Risk Estimation of Parasitic Infestations of Pond and Cage Cultured Nile Tilapia (Oreochromis niloticus) in the Lake Victoria Crescent, Uganda","link":"https://www.preprints.org/manuscript/202409.1833/v1","date":1727162399000,"content":"A study was conducted to determine the estimated parasitic infestation and associated risk factors (Water quality, Farm management practices and External factors such as Intermediate hosts and Wild fish entry) of farmed Nile tilapia in Pond grow-out, Cage grow-out (lake), Cage grow-out (reservoir) farms and Hatcheries in the Lake Victoria Crescent, Uganda. Sixteen parasite genera and 65% (418/640) infestation rate were obtained. However, Pond grow-out farms and Hatcheries did not only constitute 81% and 63% of the parasite genera, but also had the highest mean number of parasite genera per farm of 1 to 7 and 4 to 8 respectively. Cage grow-out (reservoir) farms and Hatcheries had the highest mean prevalence of &gt;0.7. Water quality parameters, farm management practices and external factors varied across the 4 farming systems, with Cage grow-out farms (lake) with the best water quality parameters, farm management practices and control over intermediate hosts and wild fish entry. Using Spatial Areal Unit Modelling with Conditional Autoregressive Priors, out of 16 risk factors, only Intermediate hosts had a significant effect on estimated parasitic infestation. Estimated parasitic infestation of 0.28 (low) or 0.55 (high) prevalence was obtained. All Cage grow-out (reservoir) farms and Hatcheries, and 78% (14/18) of Pond grow-out farms had high estimated parasitic infestation despite their locations, while 75% (3/4) of Pond grow-out farms that had low estimated parasitic infestation were located in Masaka (an area with many minor and less polluted rivers). Fifty-six percent (5/9) of Cage grow-out (lake) had low estimated parasitic infestation and were located in the Southern part of Wakiso, Southern part of Mukono and Southern part of Jinja but far from the Napoleon Gulf. The Cage grow-out farms with high estimated parasitic infestation were found in the Southeastern part of Buikwe (an area with sugar cane plantations and factories) and Southern part of Jinja in the polluted Napoleon Gulf. Therefore, the type of farming system and its location (spatial component) need to be given at-most importance when coming up with management and sanitary control strategies to encounter parasite infestation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"af5cca98587b73722925c0477e64d9f5973830788a9efea1fdfd7887b36128ff","category":"Interdisciplinary"}