{"title":"Eurasian aspen (<i>Populus tremula</i> L.): Central Europe’s keystone species ‘hiding in plain sight’","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301109","date":1711548000000,"content":"<p>by Antonín Kusbach, Jan Šebesta, Robert Hruban, Pavel Peška, Paul C. Rogers</p>\r\n\r\nKnowledge of Eurasian aspen’s (<i>Populus tremula</i> L.) ecological and growth characteristics is of high importance to plant and wildlife community ecology, and noncommercial forest ecosystem services. This research assessed these characteristics, identified aspen’s habitat optimum, and examined causality of its current scarce distribution in central Europe. We analyzed a robust database of field measurements (4,656,130 stands) for forest management planning over 78,000 km<sup>2</sup> of the Czech territory. Our analysis we used GIS techniques, with basic and multivariate statistics such as general linear models, ordination, and classification. Results describe a species of broad ecological amplitude that has heretofore attracted little research attention. Spatial analysis showed significant differences between aspen and other forest non-forest cover types. Additionally, we found significant association between the proportion of aspen in a stand, the size of forest property, and the forest category. The results demonstrate historic reasons for aspen’s widespread presence, though contemporary occurrence is limited. This study advances the concept of a quantitatively based aspen ecological optimum (niche), which we believe may be beneficial for numerous aspen associates in the context of anticipated warming. Irrespective of local ecology (i.e., the realized aspen niche), the study confirms that profit-driven policy in forestry is chiefly responsible for historic aspen denudation in central Europe. Even so, we demonstrate that ample habitat is present. Further solutions for improving aspen resilience are provided to support these keystone systems so vital to myriad dependent flora and fauna.","author":"Antonín Kusbach","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"af644c944d2b103848f2614c01dbe83b7f4a4c81291cc1cd227bc7c86b491f27","category":"Interdisciplinary"}