{"title":"Use anomaly detection with AWS Glue to improve data quality (preview)","link":"https://aws.amazon.com/blogs/aws/use-anomaly-detection-with-aws-glue-to-improve-data-quality-preview/","date":1701028853000,"content":"<p>We are launching a preview of a new <a href=\"https://aws.amazon.com/glue/features/data-quality/\">AWS Glue Data Quality</a> feature that will help to improve your data quality by using machine learning to detect statistical anomalies and unusual patterns. You get deep insights into data quality issues, data quality scores, and recommendations for rules that you can use to continuously monitor for anomalies, all without having to write any code.</p> \n<p><span><strong>Data quality counts</strong></span><br /> AWS customers already build data integration pipelines to extract and transform data. They set up data quality rules to ensure that the resulting data is of high quality and can be used to make accurate business decisions. In many cases, these rules assess the data based on criteria that were chosen and locked in at a specific point in time, reflecting the current state of the business. However, as the business environment changes and the properties of the data shift, the rules are not always reviewed and updated.</p> \n<p>For example, a rule could be set to verify that daily sales are at least ten thousand dollars for an early-stage business. As the business succeeds and grows, the rule should be checked and updated from time to time, but in practice this rarely happens. As a result, if there’s an unexpected drop in sales, the outdated rule does not activate, and no one is happy.</p> \n<p><span><strong>Anomaly detection in action</strong></span><br /> To detect unusual patterns and to gain deeper insights into data, organizations try to create their own adaptive systems or turn to costly commercial solutions that require specific technical skills and specialized business knowledge.</p> \n<p>To address this widespread challenge, Glue Data Quality now makes use of machine learning (ML).</p> \n<p>Once activated, this cool new addition to Glue Data Quality gathers statistics as fresh data arrives, using ML and dynamic thresholds to learn from past patterns while looking outliers and unusual data patterns. This process produces observations and also visualizes trends so that you can quickly gain a better understanding of the anomaly.</p> \n<p>You will also get rule recommendations as part of the Observations, and you can easily and progressively add them to your data pipelines. Rules can enforce an action such as stopping your data pipelines. In the past, you could only write static rules. Now, you can write Dynamic rules that have auto-adjusting thresholds and <strong>AnomalyDetection</strong> Rules that grasp recurring patterns and spot deviations. When you use rules as part of data pipelines, they can stop the data flow so that a data engineer can review, fix and resume.</p> \n<p>To use anomaly detection, I add an <strong>Evaluate Data Quality</strong> node to my job:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/he_nodes_1.png\" width=\"417\" height=\"382\" /></p> \n<p>I select the node and click <strong>Add analyzer</strong> to choose a statistic and the columns:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/he_stats_1.png\" width=\"600\" height=\"361\" /></p> \n<p>Glue Data Quality learns from the data to recognize patterns and then generates observations that will be shown in the <strong>Data quality</strong> tab:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/he_obs_1-1.png\" width=\"899\" height=\"161\" /></p> \n<p>And a visualization:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/he_data_oops_1.png\" width=\"899\" height=\"182\" /></p> \n<p>After I review the observations I add new rules. The first one sets adaptive thresholds that check the row count is between the smallest of the last 10 runs and the largest of the last 20 runs. The second one looks for unusual patters, for example <strong>RowCount</strong> being abnormally high on weekends:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/he_ruler_1.png\" width=\"505\" height=\"500\" /></p> \n<p><span><strong>Join the preview</strong></span><br /> This new capability is available in preview in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), and Europe (Ireland). To learn more, read Data Quality Anomaly Detection]].</p> \n<p>Stay tuned for a detailed blog post when this feature launches!</p> \n<p><span><strong>Learn more</strong></span></p> \n<p><a href=\"https://docs.aws.amazon.com/glue/latest/dg/data-quality-anomaly-detection-gs.html\">Data Quality Anomaly Detection</a></p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"af68b9a6b2a9ca4b63904150567374212d466c89ad5d2c5c7b40460d9fea3a5b","category":"Tech"}