{"title":"Xbox เพิ่มฟีเจอร์คนพิการ ระบุว่าเกมไหนซัพพอร์ตบ้าง, ฟิลเตอร์ตาบอดสี ใช้กับเกมเก่าได้","link":"https://www.blognone.com/node/125068","date":1633233116000,"content":"<div><div><div><p>ไมโครซอฟท์เป็น<a href=\"https://www.blognone.com/node/122543\">บริษัทที่มีผลงานโดดเด่นด้านการเข้าถึงของคนพิการ (accessibility)</a> ในช่วงหลังๆ โดยเฉพาะฝั่ง Xbox อย่าง <a href=\"https://www.blognone.com/node/102375\">คอนโทรลเลอร์ Xbox Adaptive Controller</a> หรือ <a href=\"https://www.blognone.com/node/122679\">การทำ speech-to-text ในการคุยกันระหว่างเล่นเกม</a></p>\n<p>ล่าสุด Xbox ประกาศเพิ่มฟีเจอร์ด้าน accessibility อีกชุดใหญ่ดังนี้</p>\n<ul>\n<li>หน้า Microsoft Store ของ Xbox เพิ่มข้อมูล metadata ว่าเกมนี้รองรับฟีเจอร์สำหรับคนพิการด้านใดบ้าง (game accessibility feature tags) เพื่อให้ผู้เล่นรู้ก่อนตัดสินใจซื้อหรือดาวน์โหลดเกม ไมโครซอฟท์บอกว่ามีชุมชนที่สนใจเรื่องนี้ช่วยทดสอบและใส่แท็กให้เกมต่างๆ อย่างถูกต้องด้วย</li>\n<li>เพิ่มหน้า Accessibility spotlight รวมเกมที่มีฟีเจอร์เพื่อคนพิการครบถ้วน เพื่อให้ช่วยตัดสินใจเลือกเล่นเกมได้ง่ายขึ้น แยกฟิลเตอร์รายชื่อเกมตามฟีเจอร์ที่ต้องการได้ เช่น ด้านเสียง ด้านตาบอดสี</li>\n<li>ตัว Xbox OS เพิ่มฟีเจอร์ Quick Settings เพื่อให้เปิดหรือปิดฟีเจอร์คนพิการได้ง่ายๆ โดยไม่ต้องออกจากเกม เหมาะสำหรับบ้านที่มีผู้เล่นหลายคน ใช้คอนโซลร่วมกัน</li>\n<li>Xbox Series X|S จะเพิ่ม Color Filters สำหรับคนตาบอดสี ใช้ได้กับเกมเก่าๆ ที่ไม่มีฟีเจอร์นี้มาให้ในตัวด้วย</li>\n<li>Night Mode Display ลดความสว่างของจอลง สำหรับการใช้งานในที่มืด หรือสำหรับคนที่มีปัญหาอ่อนไหวต่อแสง</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4440ae7eed2e59cdce35b78ff7a84ed9.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bf6635cade33b5d5bd8fdce6454a330a.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/53e32df5ef19e876317941a59c8b3fec.jpg\" /></p>\n<p>เกมของไมโครซอฟท์เองที่กำลังจะออกอย่าง Halo Infinite ก็มีฟีเจอร์ accessibility แบบจัดเต็ม ตั้งแต่การปรับขนาดฟอนต์ได้แทบทุกส่วน มีตัวช่วยนำทางเมนู ตัวเลือกปรับสีของศัตรูได้หลากหลาย ฟีเจอร์ด้าน text-to-speech และ speech-to-text เป็นต้น</p>\n<p>ช่วงหลังๆ มานี้ ประเด็นเรื่อง accessibility ได้รับความสนใจเพิ่มขึ้นมากในอุตสาหกรรมเกม บริษัทอื่นที่มีผลงานโดดเด่นเช่นกันได้แก่ <a href=\"https://www.blognone.com/node/124412\">EA ที่ใจกว้าง เปิดสิทธิบัตรด้านนี้ให้คนอื่นใช้งานได้ฟรี</a> และ <a href=\"https://www.blognone.com/node/117242\">โซนี่ที่สร้างมาตรฐานไว้ดีเยี่ยมในเกม The Last of Us Part 2</a></p>\n<p>ที่มา - <a href=\"https://news.xbox.com/en-us/2021/10/01/xbox-announces-accessibility-updates/\">Xbox</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/accessibility\">Accessibility</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"af6b815564b36958f2a8fddc0148529ed6e77b0e3af481748eb5663a93527a9d","category":"Thai"}