{"title":"Apple's Global Security Chief Cleared of Bribery Charges Following Accusation of Scheme to Trade iPads for Gun Permits","link":"https://www.macrumors.com/2021/06/02/apple-security-chief-cleared-bribery-charges/","date":1622615505000,"content":"Apple's global security chief, Thomas Moyer, has been cleared by a California judge of bribery charges following accusations that the security chief participated in a scheme to donate 200 iPads worth $75,000 to the Santa Clara County Sheriff's Office in exchange for concealed gun permits, <a href=\"https://www.reuters.com/technology/judge-dismisses-charges-against-apple-security-chief-gun-permit-probe-2021-06-01/\"><em>Reuters</em> reports</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/06/apple-park-drone-june-2018-2.jpg\" />\r\n<br />\r\nAccording to the <a href=\"https://www.macrumors.com/2020/11/25/apple-global-security-ipad-gun-permit-bribes/\">charges brought forward in November</a>, Moyer agreed to donate 200 iPads to the Sheriff's office in exchange for concealed gun permits for Apple's security team at a 2019 meeting. Furthermore, according to prosecutors, Moyer acted upon the request of Santa Clara County Undersheriff Rick Sung, who allegedly threatened to withhold the permits unless the iPads were donated. \r\n<br />\r\n\r\n<br />\r\nUltimately, a California judge believed that the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> donations offered by Moyer came as a misunderstanding. According to the judge, by the time Moyer had offered the iPads, he was under the belief that the permits were already issued, rather than the iPads being a requirement for their issuance. \r\n<br />\r\n<blockquote>Judge Eric S. Geffon of the Superior Court of Santa Clara County found on Tuesday that Moyer had been in talks with the Sheriff's Office about permits for more than a year by the time of the 2019 meeting. By then, Geffon wrote, the evidence suggests Moyer believed the permits were already approved and would be issued soon.</blockquote>Judge Eric S. Geffon also further noted that the argument against Moyer is \"pure speculation\" and \"not supported by the evidence presented to the grand jury.\" Moyer, in a statement, thanked the court for \"giving this case such careful consideration, and for allowing me to move forward with my life.\"  \r\n<br />\r\n<br />This article, \"<a href=\"https://www.macrumors.com/2021/06/02/apple-security-chief-cleared-bribery-charges/\">Apple's Global Security Chief Cleared of Bribery Charges Following Accusation of Scheme to Trade iPads for Gun Permits</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-global-security-chief-cleared-of-bribery-charges-following-accusation-of-scheme-to-trade-ipads-for-gun-permits.2298869/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_joukB9Y_BI:YRPJiRZfLLo:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_joukB9Y_BI:YRPJiRZfLLo:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/_joukB9Y_BI\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"af78826473ad5f3e033c063328c490ae18bf993485aa4bfa59c072bdd3bee536","category":"Apple"}