{"title":"Picrasidine I Regulates Apoptosis in Melanoma Cell Lines by Activating ERK and JNK Pathways and Suppressing AKT Signaling","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24404?af=R","date":1724851536000,"content":"<h2>ABSTRACT</h2>\n<p>World Health Organization data indicate a continuous increase in melanoma incidence, with metastatic melanoma characterized by poor prognosis and drug resistance. The exploration of therapeutics derived from natural products remains an active area of in vitro research. The aim of this study was to determine the antitumor effects of picrasidine I, a natural compound extracted from <i>Picrasma quassioides</i>, against two melanoma cell lines. We selected two metastatic melanoma cell lines, HMY-1 and A2058, for molecular studies, including Western blotting, 4′,6-diamidino-2-phenylindole staining, and flow cytometry. Picrasidine I demonstrated cytotoxic effects against the HMY-1 and A2058 melanoma cell lines. It induced cell cycle arrest in the sub-G1 phase and downregulated cell cycle–related proteins (e.g., cyclin A2, D1, cyclin-dependent kinases 4, and 6). In the intrinsic apoptosis pathway, picrasidine I activated proapoptotic proteins (e.g., Bax, Bak, t-Bid, BimL/S) and suppressed the expression of antiapoptotic proteins (e.g., Bcl-2, Bcl-xL), with an observed increase in the quantity of depolarized cells. In addition, the apoptotic effects of picrasidine I were linked to the activation of the c-Jun <i>N</i>-terminal kinase and extracellular signal-regulated kinase pathways and the inhibition of the protein kinase B signaling pathway. A human apoptosis array indicated claspin inhibition upon picrasidine I treatment, suggesting the potential involvement of picrasidine I in apoptosis and cell cycle regulation. Our findings suggest that picrasidine I has potential as a candidate for treating advanced melanoma, and thus these findings warrant further investigation. The modulation of claspin expression by picrasidine I could be investigated further as a potential biomarker to predict its efficacy in related to advanced stages of melanoma.</p>","author":"Mu‐Kuei Shieu, \nChia‐Chieh Lin, \nHsin‐Yu Ho, \nYu‐Sheng Lo, \nYi‐Ching Chuang, \nMing‐Ju Hsieh","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"af874c004307dc857e7d18936149a41b2f5435fc59c0d3a868a225ee0db48dfe","category":"Environment"}