{"title":"Amazon CloudWatch Logs now offers automated pattern analytics and anomaly detection","link":"https://aws.amazon.com/blogs/aws/amazon-cloudwatch-logs-now-offers-automated-pattern-analytics-and-anomaly-detection/","date":1701027586000,"content":"<p>Searching through log data to find operational or business insights often feels like looking for a needle in a haystack. It usually requires you to manually filter and review individual log records. To help you with that, <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> has added new capabilities to automatically recognize and cluster patterns among log records, extract noteworthy content and trends, and notify you of anomalies using advanced machine learning (ML) algorithms trained using decades of Amazon and AWS operational data.</p> \n<p>Specifically, CloudWatch now offers the following:</p> \n<ul> \n <li>The <strong>Patterns</strong> tab on the <strong>Logs Insights</strong> page finds recurring patterns in your query results and lets you analyze them in detail. This makes it easier to find what you’re looking for and drill down into new or unexpected content in your logs.</li> \n <li>The <strong>Compare</strong> button in the time interval selector on the <strong>Logs Insights</strong> page lets you quickly compare the query result for the selected time range to a previous period, such as the previous day, week, or month. In this way, it takes less time to see what has changed compared to a previous stable scenario.</li> \n <li>The <strong>Log Anomalies</strong> page in the <strong>Logs</strong> section of the navigation pane automatically surfaces anomalies found in your logs while they are processed during ingestion.</li> \n</ul> \n<p>Let’s see how these work in practice with a typical troubleshooting journey. I will look at some application logs to find key patterns, compare two time periods to understand what changed, and finally see how detecting anomalies can help discover issues.</p> \n<p><span><strong>Finding recurring patterns in the logs<br /> </strong></span>In the <a href=\"https://console.aws.amazon.com/cloudwatch\">CloudWatch console</a>, I choose <strong>Logs Insights</strong> from the <strong>Logs</strong> section of the navigation pane. To start, I have selected which log groups I want to query. In this case, I select a log group of a Lambda function that I want to inspect and choose <strong>Run query</strong>.</p> \n<p>In the <strong>Pattern</strong> tab, I see the patterns that have been found in these log groups. One of the patterns seems to be an error. I can select it to quickly add it as a filter to my query and focus on the logs that contain this pattern. For now, I choose the magnifying glass icon to analyze the pattern.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns.png\" alt=\"Console screenshot.\" width=\"2216\" height=\"1286\" /></a></p> \n<p>In the <strong>Pattern inspect</strong> window, a histogram with the occurrences of the pattern in the selected time period is shown. After the histogram, samples from the logs are provided.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-inspect.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-inspect.png\" alt=\"Console screenshot.\" width=\"2372\" height=\"1020\" /></a></p> \n<p>The variable parts of the pattern (such as numbers) have been extracted as “tokens.” I select the <strong>Token values</strong> tab to see the values for a token. I can select a token value to quickly add it as a filter to the query and focus on the logs that contain this pattern with this specific value.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-token-values.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-token-values.png\" alt=\"Console screenshot.\" width=\"2372\" height=\"1116\" /></a></p> \n<p>I can also look at the <strong>Related patterns</strong> tab to see other logs that typically occurred at the same time as the pattern I am analyzing. For example, if I am looking at an <strong>ERROR</strong> log that was always written alongside a <strong>DEBUG</strong> log showing more details, I would see that relationship there.</p> \n<p><span><strong>Comparing logs with a previous period<br /> </strong></span>To better understand what is happening, I choose the <strong>Compare</strong> button in the time interval selector. This updates the query to compare results with a previous period. For example, I choose <strong>Previous day</strong> to see what changed compared to yesterday.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare.png\" alt=\"Console screenshot.\" width=\"2250\" height=\"668\" /></a></p> \n<p>In the <strong>Patterns</strong> tab, I notice that there has actually been a 10 percent decrease in the number of errors, so the current situation might not be too bad.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare-results.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare-results.png\" width=\"2636\" height=\"1196\" /></a></p> \n<p>I choose the magnifying glass icon on the pattern with severity type <strong>ERROR</strong> to see a full comparison of the two time periods. The graph overlaps the occurrences of the pattern over the two periods (now and yesterday in this case) inside the selected time range (one hour).</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare-inspect.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-compare-inspect.png\" alt=\"Console screenshot.\" width=\"2372\" height=\"1146\" /></a></p> \n<p>Errors are decreasing but are still there. To reduce those errors, I make some changes to the application. I come back after some time to compare the logs, and a new <strong>ERROR</strong> pattern is found that was not present in the previous time period.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/cloudwatch-patterns-compare-new-pattern.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/cloudwatch-patterns-compare-new-pattern.png\" alt=\"Console screenshot.\" width=\"2854\" height=\"576\" /></a></p> \n<p>My update probably broke something, so I roll back to the previous version of the application. For now, I’ll keep it as it is because the number of errors is acceptable for my use case.</p> \n<p><span><strong>Detecting anomalies in the log<br /> </strong></span>I am reassured by the decrease in errors that I discovered comparing the logs. But how can I know if something unexpected is happening? Anomaly detection for CloudWatch Logs looks for unexpected patterns in the logs as they are processed during ingestion and can be enabled at log group level.</p> \n<p>I select <strong>Log groups</strong> in the navigation pane and type a filter to see the same log group I was looking at before. I choose <strong>Configure</strong> in the <strong>Anomaly detection</strong> column and select an <strong>Evaluation frequency</strong> of <strong>5 minutes</strong>. Optionally, I can use a longer interval (up to 60 minutes) and add patterns to process only specific log events for anomaly detection.</p> \n<p>After I activate anomaly detection for this log group, incoming logs are constantly evaluated against historical baselines. I wait for a few minutes and, to see what has been found, I choose <strong>Log anomalies</strong> from the <strong>Logs</strong> section of the navigation pane.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/cloudwatch-patterns-anomalies-new.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/cloudwatch-patterns-anomalies-new.png\" alt=\"Console screenshot.\" width=\"2412\" height=\"1424\" /></a></p> \n<p>To simplify this view, I can suppress anomalies that I am not interested in following. For now, I choose one of the anomalies in order to inspect the corresponding pattern in a way similar to before.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-anomalies-inspect.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/30/cloudwatch-patterns-anomalies-inspect.png\" alt=\"Console screenshot.\" width=\"2452\" height=\"888\" /></a></p> \n<p>After this additional check, I am convinced there are no urgent issues with my application. With all the insights I collected with these new capabilities, I can now focus on the errors in the logs to understand how to solve them.</p> \n<p><span><strong>Things to know<br /> </strong></span><a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> automated log pattern analytics is available today in all commercial <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regions_az/\">AWS Regions</a> where Amazon CloudWatch Logs is offered excluding the China (Beijing), the China (Ningxia), and Israel (Tel Aviv) Regions.</p> \n<p>The patterns and compare query features are charged according to existing Logs Insights query costs. Comparing a one-hour time period against another one-hour time period is equivalent to running a single query over a two-hour time period. Anomaly detection is included as part of your log ingestion fees, and there is no additional charge for this feature. For more information, see <a href=\"https://aws.amazon.com/cloudwatch/pricing/\">CloudWatch pricing</a>.</p> \n<p><a href=\"https://aws.amazon.com/cloudwatch/\"><strong>Simplify how you analyze logs with CloudWatch automated log pattern analytics.</strong></a></p> \n<p>— <a href=\"https://twitter.com/danilop\">Danilo</a></p>","author":"Danilo Poccia","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"af8a0d111db695db37d6c4096ec15852f0789af36357701804a1dc254fccb380","category":"Tech"}