{"title":"Biomineralization and biomechanical trade-offs under heterogeneous environments in the eastern oyster Crassostrea virginica","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae033/7794757?rss=1","date":1727654400000,"content":"<span><div>ABSTRACT</div>Accurate biological models are critical to reliably predict vulnerability of marine organisms and ecosystems to rapid environmental changes. Current predictions on the biological impacts of climate change and human-caused disturbances primarily stem from controlled experiments but lack assessments of the mechanisms underlying biotic variations in natural systems, especially for habitat-forming, climate-sensitive species with key ecological roles. This study aimed to characterize and quantify spatial patterns of shell biomineralization and biomechanical properties in a key reef-building oyster, <span>Crassostrea virginica</span>, collected from restored reefs along natural estuarine gradients in the Hudson River Estuary (NY, USA). We characterized patterns of oyster shell deposition, structure, composition and mechanical performance at the macro- and microscale. Eastern oysters show a strong capacity for adjustments in shell biomineralization and biomechanics to maintain shell production and protective functions. We reveal salinity as a key predictor of oyster shell structure, mechanical integrity and resistance to dissolution, and describe the functional role of chalky calcite in shaping shell mechanical performance. Changes in shell production along salinity gradients indicate formation of shells with (1) high mechanical resistance but increased vulnerability to dissolution under marine conditions and (2) lower structural integrity but higher protection from dissolution under brackish conditions. Our work illustrates that biomineralization and biomechanical trade-offs may act as mechanisms in eastern oysters to maintain overall performance under heterogeneous estuarine environments and could represent a cornerstone for calcifying organisms to acclimate and maintain their ecological functions in a rapidly changing climate.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"af98942560ccf56ef5da00b0ed326a8207f2c919a5a981c295347e22d2ba417b","category":"Environment"}