{"title":"Prevalence, regional patterns and socio-demographic factors associated with poly-tobacco use in India: A secondary data analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002999","date":1710511200000,"content":"<p>by Priyanka Bantwal, Muralidhar M. Kulkarni, Veena G. Kamath, Ashwath K. Naik, Andrew W. Fogarty, Murali Dhar, Anand S. Ahankari</p>\r\nBackground <p>Tobacco use is associated with early, intermediate and long-term complications throughout the life course. With an influx of newer products containing nicotine, poly-tobacco use is slowly emerging as a public health concern, that is defined as existing tobacco users currently using two or more tobacco or nicotine products. While many studies have investigated single use tobacco, there is a paucity of research on regional patterns and socio-demographic factors associated with poly-tobacco use in India.</p> Objectives <p>To assess prevalence of poly-tobacco use and determine the socio-demographic factors associated with poly-tobacco use in India.</p> Methods <p>Data from the Global Adult Tobacco Survey 2 (GATS, 2016–17) was analysed, which included information on tobacco use among people aged &gt;15 years. The pattern of current tobacco status was described using descriptive statistics. Multiple logistic regression models were estimated to determine factors associated with poly-tobacco use.</p> Results <p>The prevalence of poly-tobacco use in India was found to be 9.8%. Among the current tobacco users, the prevalence was 33%. Significant socio-demographic factors associated with poly-tobacco use included younger age, male gender, religion and backward caste. North-eastern region reported highest prevalence of poly-tobacco use in the country, followed by the central region.</p> Conclusion <p>The number of poly-tobacco users in India is considerably high and a matter of concern, more so in north east and central regions of the country. There is a need to create awareness about dangerous effects of all types of tobacco products and strengthen implementation of tobacco control policies with special focus on regions with high burden.</p>","author":"Priyanka Bantwal","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"afa5b39915c6ee2552a999b9a30b92eb5ddf8b48b1abb0ce1152ae74a8ff8709","category":"Environment"}