{"title":"Women's Tour de France: Is ASO backing or slacking?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/womens-tour-de-france-backing-or-slacking","date":1620991000000,"content":"\n      <p>The much-fêted revival of a women’s Tour de France seemed to be one more (barely-perceptible) baby-step closer to reality this week after race director Christian Prudhomme confirmed to The Guardian that: “It will take place next year, that’s certain.”</p>\n<div></div>\n<p>That the event will take place was just about the only information that Prudhomme gave away about the race itself. The Frenchman took a nebulous line, coming out with vague promises such as, “I can tell you there will be links with the past, with the present, and perhaps the future”, which sounds more like a dodgy palm-reading than a proposal for a stage race.</p>\n<p>Rather than give detail-starved women’s cycling fans anything solid to tide them over to the promised route announcement in October, Prudhomme was instead keen to highlight the economic risk that putting on women’s races presents insisting that “all the women’s races that we organise lose us money\". His motive seemed to be to lay the foundations for failure before the race has even begun, as if to paint women’s cycling as some kind of Ouroboros intent on destroying its own growth.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200829LCB0004-A.S.O._Alex_Broadway_1024x1024.jpg?v=1620831513\" /></p>\n<p><em>Photo credit: Alex Broadway/SWPix.com</em></p>\n<p>Online, amateur economists were keen to highlight the prevalence of loss-making races across the sport, but it doesn’t take an MBA to discern that very few business ventures are immediately profitable. Even so, Prudhomme seemed determined to position this new venture as a charitable act of benevolence towards the women’s peloton on behalf of ASO, pointing out that although “all” of the women’s races run by the organisation lose money they go ahead and put them on regardless.</p>\n<p>That many women’s races — and men’s — are not profitable appears to be the truth of the matter, but more than anything it is Prudhomme’s attitude, which speaks to an apparent indifference towards women’s racing, that has caused a stink.</p>\n<p>In contrast, Flanders Classics CEO Tomas van den Spiegel — who drew the ire of equality campaigners after his event, Omloop het Nieuwsblad, was revealed to be offering exponentially less prize money for the women than men — waded in (albeit after some prompting). In a <a href=\"https://twitter.com/tomasvds/status/1392226762583683072\">Tweet</a>, van den Spiegel also put forward the fact that putting on women’s races is not lucrative, yet his phrasing was drastically different to Prudhomme’s: “We believe in women’s cycling so instead of calling it losing money I rather call it investing. We are almost at the tipping point where broadcasters and sponsors are wanting in on women’s cycling.” Semantics matter.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200829LCB0001-A.S.O._Alex_Broadway_5716ff49-ffc8-4457-918a-5e9c71af9974_1024x1024.jpg?v=1620831584\" /></div>\n<p>Photo credit: Alex Broadway/SWPix.com</p>\n<p>Whilst fielding outrage in the wake of Prize Money-Gate in March, Van den Spiegel pointed would-be haters to his organisation’s ‘Closing the Gap’ initiative for developing their women’s offering. A crucial facet of this programme involves starting the women’s races directly after the men’s on the same day in order to boost engagement and interest, which — once achieved — would allow them to run as standalone events.</p>\n<p>Tellingly, the one additional nugget of information provided by Monsieur Prudhomme in his Guardian interview was that the women’s Tour de France would take place only after the three week circus of the men's Tour has finished — and presumably most of those following it have gone home.</p>\n<p>As much as some might wish that the progress of women’s racing was not beholden to organisations like ASO — who have shown very little regard for advancing the case of women’s racing (La Course, anyone?) — it’s almost impossible to decouple the sport as a whole from the Tour de France brand.</p>\n<p>The race is a sporting behemoth, and an instantly recognisable name that transcends cycling. The exposure and prestige attached to the Tour de France is such that it’s not uncommon for sponsors to back teams purely based on the chance of riders serving as billboards for three weeks in July. Indeed, many — mainly French— teams such as Cofidis have already announced their intention to launch women’s squads in the wake of news of a women’s Tour de France.</p>\n<p>Given all of that, it’s obvious that a women’s stage race under the ‘Tour de France’ banner would elevate the profile of women’s racing exponentially. For all of the arguments highlighting the pitfalls inherent in women’s cycling treading an identical path to the men’s, there is no doubt that the Tour de France Effect would bring it a much-needed boost.</p>\n<p>If the event is worthy of the increasingly-capable women’s peloton, it could have an untold impact on the progress of women’s cycling. But when the director is already warning that “it mustn’t lose money or it will end up like the Tour in the 80s and it will die” then how can those involved put their faith in the race— and in ASO?</p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"afa8410543032805869382550cb83fec0dc515a92b3044528092a5caa01b2197","category":"Cycling"}