{"title":"When to Expect Final Cut Pro and Logic Pro to Launch on iPad Tomorrow","link":"https://www.macrumors.com/2023/05/22/final-cut-pro-for-ipad-release-timing/","date":1684805174000,"content":"As previously announced, Apple will be launching Final Cut Pro and Logic Pro for select iPad models on Tuesday, May 23. Apple says the apps are optimized for the iPad's touch-first interface, and more details are available <a href=\"https://www.macrumors.com/2023/05/09/apple-announces-final-cut-pro-and-logic-pro-for-ipad/\">in our earlier coverage</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-iPad-Final-Cut-Pro-Logic-Pro-hero-feature-1.jpg\" alt width=\"2499\" height=\"1406\" />\r<br />\nFinal Cut Pro and Logic Pro for iPad will likely be released on the App Store around 1 p.m. Eastern Time, based on our analysis of Apple's regional websites. Some media outlets and YouTubers received early access to the apps, and Apple's embargo for reviews will be lifting tomorrow, providing a closer look at the apps in action.\r<br />\n\r<br />\nWhile the apps have one-time pricing on the Mac, the iPad versions will have subscription-based pricing only. Both apps will be priced at $4.99 per month or $49 per year in the U.S. after a one-month free trial. Final Cut Pro is compatible with iPad models equipped with the M1 chip or later, and Logic Pro will be available for iPad models equipped with the A12 Bionic chip or later. Both apps require iPadOS 16.4 or later.\r<br />\n\r<br />\n<div></div>\r<br />\n\"Final Cut Pro for iPad introduces a powerful set of tools for video creators to record, edit, finish, and share, all from one portable device,\" said Apple's announcement from earlier this month. \"Logic Pro for iPad puts the power of professional music creation in the hands of the creator — no matter where they are — with a complete collection of sophisticated tools for songwriting, beat making, recording, editing, and mixing.\"\r<br />\n\r<br />\nApple has dedicated <a href=\"https://www.apple.com/final-cut-pro-for-ipad/\">Final Cut Pro for iPad</a> and <a href=\"https://www.apple.com/logic-pro-for-ipad/\">Logic Pro for iPad</a> pages with more details, and we will have our own hands-on coverage of the apps soon.<div>Tags: <a href=\"https://www.macrumors.com/guide/logic-pro/\">Logic Pro</a>, <a href=\"https://www.macrumors.com/guide/final-cut-pro/\">Final Cut Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/22/final-cut-pro-for-ipad-release-timing/\">When to Expect Final Cut Pro and Logic Pro to Launch on iPad Tomorrow</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/when-to-expect-final-cut-pro-and-logic-pro-to-launch-on-ipad-tomorrow.2390252/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"afad72957de43dd6e55ca53561f514eef90a2e84d4b2dd1c6b07a58673a26183","category":"Apple"}