{"title":"Sorry doubters, Starship actually had a remarkably successful flight","link":"https://arstechnica.com/?p=1985350","date":1700496983000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/starship-1-800x450.jpg\" alt=\"Starship launched on Saturday with all 33 Raptor engines burning nominally.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/starship-1-scaled.jpg\">Enlarge</a> <span>/</span> Starship launched on Saturday with all 33 Raptor engines burning nominally. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>SOUTH PADRE ISLAND, Texas—Starship launches are clarifying events. Pretty quickly after liftoff you find out who understands the rocket business, and who are the casual observers bereft of a clue.</p>\n<p>Before I had even left the launch viewing area in South Padre Island on Saturday morning headlines started to fill my news feed. The Wall Street Journal led with, “SpaceX second Starship test flight ends in another explosion.” Bloomberg was still more dour, “SpaceX Starship and Super Heavy Booster Launch and Failure.” Perhaps, after consultation with their beat reporters, editors subsequently changed these online headlines. And the stories themselves better reflected the reality. Nevertheless, much of the media coverage of the launch delivered a harsh verdict: Another failure for Elon Musk and SpaceX.</p>\n<p>I mean, yes. The first stage of the Starship rocket, Super Heavy, did explode. And the upper stage, Starship, had a failure that caused its flight termination system—explosives on board in case a vehicle begins flying off course—to detonate. But that was to be expected on such an experimental, boundary-pushing test flight.</p></div><p><a href=\"https://arstechnica.com/?p=1985350#p3\">Read 31 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1985350&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"afb0914a5f0e4a6fb18bcf8cd8ff8b87b4e45454c05b4248f57305066230a903","category":"Tech"}