{"title":"The moderating roles of healthcare expenditure in the fossil fuel consumption‐ mortality rate conflicts in fossil fuel‐dependent sub‐Saharan African countries","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12494?af=R","date":1719366845000,"content":"<h2>Abstract</h2>\n<p>This current study contributes to the extant literature by providing the first empirical evidence on the functional relationship between fossil fuel consumption, environmental pollution, and mortality rate in selected fossil fuels-dependent nations in sub-Saharan African countries with the moderating role of healthcare expenditures from 1982 to 2021. The empirical evidence relies on a battery of techniques comprising fully modified ordinary least squares, dynamic ordinary least squares, and panel quartile regression estimators. In order to establish sturdy empirical insights, fossil fuel is proxy by four indices including oil, coal, natural gas (at the disaggregated level), and fossil fuel (at the aggregated level). Mortality rate is also disaggregated into mortality rate, adult male, mortality rate, adult female, and infant mortality rate. Based on this disaggregation, the findings from the study reveal the following: First, the indicators for fossil fuel consumption have positive statistically significant impact on all three measures of mortality rate. Second, environmental pollution positively impacts the three indicators of mortality rate. Third, healthcare expenditure significantly reduces mortality rate, while its interaction with fossil fuel consumption moderates their unfavorable impacts on mortality rate. Fourth, with the exception of natural gas, the indicators of fossil fuel consumption and environmental pollution exert unfavorable impacts on mortality rate across all the quartiles. Emerging from these empirical findings, the study recommends promotion of cleaner sources of energy while at the same time improving healthcare expenditure as an interim measure pending full transition to renewable energy towards the attainment of a good health outcome in sub-Saharan Africa countries.</p>","author":"Olatunde Julius Omokanmi, \nRidwan Lanre Ibrahim, \nOlumide Olusegun Olaoye","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"afb95f00624c7d5f09e2ce4034652dab82565635c2a68aca7db903e25d9f2a2b","category":"Environment"}