{"title":"Rocket Report: SpinLaunch spins up, Falcon Heavy to return big time in 2022","link":"https://arstechnica.com/?p=1812132","date":1636718416000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/crew3-800x522.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/crew3.jpg\">Enlarge</a> <span>/</span> As the Crew-3 mission ascends, a Falcon 9 rocket with a Starlink payload awaits its turn on a nearby launch pad in Florida. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 4.23 of the Rocket Report! After a one-week hiatus, this report returns with a superfluity of news. There's a lot to cover, from exciting news in the New Mexico desert to busy times for the Space Coast in Florida as SpaceX gets busy with crewed missions.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>SpinLaunch completes first test flight</strong>. The California-based startup uses kinetic energy to launch payloads, and its test projectile reached \"tens of thousands\" of feet during its first launch, <a href=\"https://www.cnbc.com/2021/11/09/spinlaunch-completes-first-test-flight-of-alternative-rocket.html\">CNBC reports</a>. The company's method uses a vacuum-sealed centrifuge to spin the rocket to a velocity several times the speed of sound before it is released. \"It's a radically different way to accelerate projectiles and launch vehicles to hypersonic speeds using a ground-based system,\" SpinLaunch CEO Jonathan Yaney said.</p></div><p><a href=\"https://arstechnica.com/?p=1812132#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1812132&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"afbd77bb106ed60ae6f157c0ab65b903af401e888cafaf9f65b56390343bef20","category":"Tech"}