{"title":"Secret military space programs can be a little less secret, Pentagon says","link":"https://arstechnica.com/?p=1998729","date":1706139062000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/220415-X-VE588-1030-800x533.jpg\" alt=\"A delegation of French military officers visited the Combined Space Operations Center in 2022 at Vandenberg Space Force Base, California.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/220415-X-VE588-1030.jpg\">Enlarge</a> <span>/</span> A delegation of French military officers visited the Combined Space Operations Center in 2022 at Vandenberg Space Force Base, California. (credit: <a href=\"https://www.safia.hq.af.mil/News/Photos/igphoto/2002981639/\">US Space Force/Tech. Sgt. Luke Kitterman</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Late last year, Deputy Secretary of Defense Kathleen Hicks signed a memo to overhaul a decades-old policy on how the Pentagon keeps sensitive military space programs secret. However, don't expect defense officials to openly discuss everything they're doing to counter China and Russia in orbit.</p>\n<p>John Plumb, assistant secretary of defense for space policy, revealed the policy change in a roundtable with reporters on January 17. For many years, across multiple administrations, Pentagon officials have lamented their inability to share information with other countries and commercial partners. Inherently, they argued, this stranglehold on information limits the military's capacity to connect with allies, deter adversaries, and respond to threats in space.</p>\n<p>In his statement last week, Plumb said this new policy \"removes legacy classification barriers that have inhibited our ability to collaborate across the US government and also with allies on issues related to space.\"</p></div><p><a href=\"https://arstechnica.com/?p=1998729#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998729&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"afc3271a360ef3a970121beca3b78694a3c1b54a9e9239f6ae819a4de2a6e6f5","category":"Tech"}