{"title":"Biological degradation of leachate from household and similar waste pre‐treated by electro‐Fenton process","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12902?af=R","date":1707382863000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/28592518-be68-4ecb-8961-5d0cfc6614f5/wej12902-toc-0001-m.png\" alt=\"Biological degradation of leachate from household and similar waste pre-treated by electro-Fenton process\" />\n<p>Coupling of biological process (activated sludge) to the electro-fenton process for optimal removal of organic matter in landfill leachate.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study's purpose is to confirm the feasibility and performance of the combination between ‘electro-Fenton’ process and the ‘activated sludge’ biological process, in order to remove the organic matter contained in ‘intermediate’ leachates from technical landfill centre of Hamici (Algiers). This leachate was initially electrochemically pre-treated until the ratio of BOD<sub>5</sub>/chemical oxygen deman (COD) = 0.41, then an optimization of the parameters significantly influencing the biological degradation was carried. The results obtained after 13 h of biological treatment show the removal of 97% of the initial COD, with a mixed liquor composed of 700 mL of pre-treated leachate and 300 mL of activated sludge, a dissolved oxygen concentration of 3.5 mg O<sub>2</sub>/L and a pH of 7, which allows the effluent to discharge directly into the environment. The conclusions of this work are promising because it was demonstrated that if the operating parameters are well controlled concerning these treatments, its sequence and the referred pre-treatment, the treatment efficiency is very high to the point of direct discharge of the leachate. However, in future studies, the combination of the both processes should be more explored in order to reduce the treatment time and to scale-up the process.</p>","author":"Athir Boukhrissa, \nLina Mounia Rouidi, \nRita Maurício, \nHamid Ait‐Amar","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"afd70d77ada894860e03463e71a7c22a9b9a59dd81386957ad97684830701f2a","category":"Environment"}