{"title":"87% of classic games are out of print. That’s a problem for gaming history.","link":"https://arstechnica.com/?p=1952784","date":1689092026000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/retro-game-treasure-800x450.jpg\" alt=\"87% of classic games are out of print. That’s a problem for gaming history.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/retro-game-treasure.jpg\">Enlarge</a> (credit: Aurich Lawson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Anyone with a passing interest in retro games knows the bulk of classic video game history is effectively \"out of print,\" with legitimate copies limited to defunct hardware platforms and secondhand physical copies (if you're lucky). Now, in <a href=\"https://gamehistory.org/study-explainer/\">a first-of-its-kind study</a>, the Video Game History Foundation has determined the full extent of this issue, finding that a full 87 percent of games released in the US before 2010 are no longer commercially available.</p>\n<p>This vast expanse of out-of-print games isn't exactly \"lost,\" of course; libraries, archives, and even software pirates have helped ensure the games will continue to be accessible in some form. But the VGHF argues persuasively that the poor market availability of reissued games highlights how the game industry is not doing a sufficient job of preserving access to its own history.</p>\n<p>\"The industry has done a great job re-commercializing a wide catalog of [popular] titles, but for the vast majority of games, we can't rely on the commercial market to solve this,\" VGHF Library Director and study author Phil Salvador told Ars in a recent interview. \"We need to give libraries and archives more tools to get the job done.\"</p></div><p><a href=\"https://arstechnica.com/?p=1952784#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952784&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"afd8e76f5899b6fe94a48640dbf2286c539ea181d6f4b41afb8d607027cfc1c3","category":"Tech"}