{"title":"Exploring the Volatile Profile of Vanilla planifolia after Fermentation at Low‐Temperature with Bacillus isolates","link":"https://www.preprints.org/manuscript/202407.1601/v1","date":1721379473000,"content":"Vanilla planifolia is grown as a high-value orchid spice for its odor and savor attributes that increase due to the curing process associated with microbial colonization. This tends to influence the aromatic properties of vanilla. Hence, 11 Bacillus sp. strains were isolated from V. planifolia and identified with 16S rRNA gene sequencing. The liquid culture (1 mL of 107 CFU mL-1) of selected Bacillus vallismortis NR_104873.1:11-1518, B. velezensis ZN-S10, and B. tropicus KhEp-2 effectively fermented green-blanched vanilla pods kept at 10 ℃ during the sweating stage. GC-MS analysis showed that the methanol extract of non-coated, and B. vallismortis treated vanilla detected three (3) volatile compounds, whereas seven (7) components were obtained in B. tropicus and B. velezensis treatment. 4H-pyran-4-one, 2,3-dihydro-3,5-dihydroxy-6-methyl was found in B. velezensis ZN-S10, B. tropicus KhEp-2, B. vallismortis while it was not present in the control samples. This ketone compound suggested a Maillard reaction resulting in brown-increased aroma pods. Linoleic acid and Hexadecanoic acid ethyl esters were detected only in ZN-S10 strain-coated vanilla. A novel 3--Deoxy-d-mannoic lactone was detected only in B. vallismortis treated vanilla characterized as a new compound in V. planifolia which suggested that the new compound can be altered with the coating of bacteria in vanilla during fermentation. Thus, the Bacillus strains improved the volatile profile and exhibited a new aroma and flavor profile of vanilla owing to bacteria fermentation during the curing process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"afde4c52c60c3c5585fb5e97f2076c0764d847b176a76e049ebf7f7d3c63b3a8","category":"Interdisciplinary"}