{"title":"Thermoregulation enhances survival but not reproduction in a plant‐feeding insect","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14546?af=R","date":1710477601000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8b9f83ea-bfe7-414d-90a0-62b98d950a12/fec14546-toc-0001-m.png\" alt=\"Thermoregulation enhances survival but not reproduction in a plant-feeding insect\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/hotter-temperatures-imperil-insect-reproduction-more-than-insect-survival/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTemperature influences nearly all aspects of fitness. However, reproduction is often more thermally sensitive than survival. Thermoregulation must maintain performance in both components of fitness to buffer populations from environmental change.\n\nWe assessed the fitness benefits of thermoregulation in <i>Enchenopa binotata</i> treehoppers. Under realistic mesocosm conditions, we quantified fine-scale microclimates using 3D-printed operative temperature models. We then compared operative temperatures to treehopper body temperatures and translated patterns of thermoregulation into variation in survival and reproduction. We also assessed two thermoregulatory mechanisms: precise microclimate choice and heat-escape behaviours. Finally, we applied our results to evaluate if arthropod thermoregulation is accurately characterized by two theoretical models commonly used to simulate responses to environmental change.\n\nWe found substantial thermal variation at fine spatial scales relevant to insects: at a single point in time, temperatures within 30-cm-tall plants spanned ranges up to 19°C (23–42°C).\n\nLethal operative temperatures were common when air temperatures were high. However, heat escapes allowed treehoppers to almost entirely avoid lethal temperatures.\n\nBy contrast, individuals thermoconformed in the absence of lethal operative temperatures. This finding suggests that precise microclimate choice imposes high costs due to thermal uncertainty at fine spatial scales. Furthermore, given the narrow range of temperatures in which reproduction occurs, thermoregulation is unlikely to maintain reproduction.\n\nThermoregulation was most effective in the lowest-quality and most spatially variable thermal habitats. Treehopper thermoregulation therefore more closely follows cost–benefit models of thermoregulation compared to models that account for inhibited movement at extreme temperatures.\n\nOverall, even if thermoregulation can prevent lethal heat stress, it may have limited capacity to buffer arthropods and other small ectotherms from environmental change if it cannot maintain reproductive performance.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/hotter-temperatures-imperil-insect-reproduction-more-than-insect-survival/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Noah T. Leith, \nEm A. Miller, \nKasey D. Fowler‐Finn","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"afe303b7e1bc698a88429c5c18b1f110853908f1e0e6cdc1c75d2c900016ef0f","category":"Environment"}