{"title":"Antimicrobial Effects of Antibiotics in Combination with Oregano Essential Oil against Staphylococcus aureus","link":"https://www.preprints.org/manuscript/202408.1155/v1","date":1723771896000,"content":"The antimicrobial resistance to clinically approved antibiotics is rapidly increasing worldwide. Staphylococcus aureus is a critical contributor to deaths associated with antibiotic resistance. In this regard, the search for natural compounds is quite active, that alone or in combination with other agents can be effective as new antibacterial agents. The antibacterial activity of essential oils has presented an increasing interest during the last years and was effective even on multidrug-resistant strains. The present study aims to investigate the interaction effects of oregano essential oil (OEO) with some conventional antibiotics against Staphylococcus aureus tested by agar methods. For this purpose, we selected S. aureus ATCC 29213 and five clinical isolates representative of the species. The essential oil was analyzed using gas chromatography coupled with mass spectrometry (GC-MS). The analysis of the Oregano essential oil revealed the main component to be carvacrol (81,20%). Concentration 2.5% (v/v) OEO was combined with drugs proposed by EUCAST, 2024, specifically penicillin, cefoxitin, erythromycin, gentamycin and tetracycline. The research results showed that the combination of OEO with penicillin, cefoxitin, erythromycin, and tetracycline enhanced the antimicrobial activity of the antibiotics against S. aureus in almost all cases. The area of suppression remained identical (but not smaller) in the unaffected cases. When comparing the effects of the GEN-OEO combination and GEN against most S. aureus strains, a decrease in antimicrobial activity was reported by the diffusion agar method.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b0051e2dee4d37c7d77f04850f7763c7edb7781813274e27f0713dd031c93bac","category":"Interdisciplinary"}