{"title":"[ลือ] เตือนไม่ฟัง! Microsoft เปิดตัว Bing Chat แม้ OpenAI เตือนว่ายังไม่พร้อม","link":"https://www.blognone.com/node/134377","date":1686906410000,"content":"<div><div><div><p>Wall Street Journal (WSJ) รายงานถึงความไม่ลงรอยกันระหว่าง Microsoft และ OpenAI จากแหล่งข่าวไม่เปิดเผยตัวที่ที่ใกล้ชิดกับเรื่องนี้ ระบุว่า OpenAI เตือน Microsoft ถึงความเสี่ยงในการนำเทคโนโลยีของ OpenAI เข้าไปใน Bing Chat ทั้งที่ยังไม่ได้เทรนเพิ่มเติม ซึ่งอาจทำให้แชตบอต Bing ตอบไม่ตรงคำถามหรือตอบผิดไป แต่ Microsoft ไม่สนใจคำเตือนนี้</p>\n<p>ซัตยา นาเดลลา CEO Microsoft เคยให้สัมภาษณ์กับ Wired ว่าการเทรนแชตบอตของ Microsoft ให้ตอบสนองต่อคำสั่งจริงๆ ไม่สามารถฝึกจากการทดลองได้ทั้งหมด ถ้าต้องการให้ AI เข้ากับการใช้งานได้จริง จำเป็นต้องฝึกในสถานการณ์จริงไม่ใช่การจำลอง นี่จึงเป็นเหตุผลว่าทำไม Microsoft เร่งรีบในการเปิดตัว Bing</p>\n<p>ตอนนี้ ChatGPT ถือว่าเป็น AI แชตบอตที่ดึงดูดฐานผู้ใช้ได้เติบโตรวดเร็วที่สุด ในขณะที่ Bing ที่เปิดตัวตามมากลับไม่ได้รับความนิยมเท่าที่ควร มีรายงานวิเคราะห์จาก YipitData ระบุว่า ChatGPT มีปริมาณผู้ใช้เมื่อนับตาม session โดยเฉลี่ยเกือบสองเท่า เมื่อเทียบกับ Bing โดยในเดือนมีนาคม ChatGPT มีผู้ใช้งานถึง 200 ล้านคนขณะที่ Bing มีผู้ใช้งาน 100 ล้านคน</p>\n<p>รายงานของ WSJ ยังพูดถึงถึงปัญหาพนักงานทีม AI ของ Microsoft ที่ออกมาบ่นเรื่องงบประมาณที่ลดลงและผิดหวังที่ไม่สามารถเข้าถึงการทำงานภายในของเทคโนโลยี OpenAI ได้ ทั้งๆ ที่มีหน้าที่ต้องรวมเทคโนโลยีเข้ากับผลิตภัณฑ์ของ Microsoft และทีมขายของ OpenAI และ Microsoft ก็ยังเคยเสนอลูกค้ารายเดียวกันอีกด้วย</p>\n<p>ซัตยา นาเดลลายังพูดถึงเหตุผลที่ Microsoft เข้าไปลงทุนใน OpenAI ทั้งๆ ที่ก็ลงทุนใน AI ของตัวเองมานาน ซึ่งซัตยา กล่าวว่า ทางบริษัทได้เห็นว่า OpenAI กำลังดำเนินตามเป้าหมายเดียวกับทาง Microsoft จะดีกว่าถ้าร่วมมือกับ OpenAI เพื่อสร้างรากฐานเดียวกัน ซึ่งทั้งสองบริษัทสามารถทำตามเป้าได้อย่างดี</p>\n<p>ถึงแม้จะมีรายงานถึงปัญหาความขัดแย้งออกมา แต่ทั้งสองบริษัทก็ยังคงทำงานร่วมกันอย่างใกล้ชิด ซัตยาเองก็ระบุว่าทั้งสองฝ่ายต่างลงทุนต่อกัน และซัตยาเชื่อว่าทั้งสองฝ่ายจะเป็นพันธมิตรที่ดีต่อกันได้ในระยะยาว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7f97ee8f7c54239a0b37ad2ea01506a1.jpg\" alt /></p>\n<p>ที่มา: <a href=\"https://arstechnica.com/tech-policy/2023/06/report-microsoft-launched-bing-chatbot-despite-openai-warning-it-wasnt-ready/\">Arstechnica</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/bing\">Bing</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b006f5fd3a4f2262bfdae253d9195c4dc8b6099b8f00162f6f04fb5b4ebcf0dd","category":"Thai"}