{"title":"Anti-Inflammatory Role of the Klotho Protein and Relevance to Aging","link":"https://www.preprints.org/manuscript/202408.0213/v1","date":1722843158000,"content":"The α-Klotho protein (hereafter Klotho) is an obligate coreceptor for fibroblast growth factor 23 (FGF23). It is produced in the kidneys, brain and other sites. Klotho insufficiency causes hyperphosphatemia and other anomalies. Importantly, it is associated with chronic pathologies (often age-related) that have an inflammatory component. This includes atherosclerosis, diabetes and Alzheimer’s disease. Its mode of action in these diseases is not well understood, but it inhibits or regulates multiple major pathways. Klotho has a membrane form, and a soluble form (s-Klotho). Cytosolic Klotho is postulated but not well characterized. s-Klotho has endocrine properties that are incompletely elucidated. It binds to the FGF receptor 1c (FGFR1c) that is widely expressed (including endothelial cells). It also attaches to soluble FGF23, and FGF23/Klotho binds to FGFRs. Thus, s-Klotho might be a roaming FGF23 coreceptor, but it has other functions. Notably, Klotho (cell-bound or soluble) counteracts inflammation, and appears to mitigate related aging (inflammaging). It inhibits NF-κB and the NLRP3 inflammasome. This inflammasome requires priming by NF-κB, and produces active IL-1β, membrane pores and cell death (pyroptosis). In accord, Klotho countered inflammation and cell injury induced by toxins, damage-associated molecular patterns (DAMPs), cytokines, and reactive oxygen species (ROS). s-Klotho also blocks the TGF-β receptor and Wnt ligands, which lessens fibrotic disease. Low Klotho is associated with loss of muscle mass (sarcopenia), as occurs in aging and chronic diseases. s-Klotho counters the inhibitory effects of myostatin and TGF-β on muscle, reduces inflammation, and improves muscle repair following injury. Inhibition of TGF-β and other factors may also be protective in diabetic retinopathy and age-related macular degeneration (AMD). This review examines Klotho functions especially as related to inflammation, and potential applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b0069c5e45ee1d2a267997184ea9e20d9ff0bf497184a008e0e2831fb880a10b","category":"Interdisciplinary"}