{"title":"If Apple wants to fix its App Store problem, it should allow sideloading","link":"https://www.macworld.com/article/349841/macalope-app-store-sideloading-malware-profiles-payment-system-developers.html","date":1624960800000,"content":"\n<div>\n<section><div></div></section><p>As the winds of fortune get set to buffet the company with the cruel gales of antitrust inquiry, Apple is making its side of the story known. To wit, the company has posted <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/privacy/docs/Building_a_Trusted_Ecosystem_for_Millions_of_Apps.pdf&amp;subid1=1-1-349841-0-0-0\">a white paper</a> (PDF) detailing the dangers of doing drugs.</p>\n\n\n\n<p>No, wait. Sideloading. The dangers of sideloading.</p>\n\n\n\n<p>The Macalope knew it was something about protecting the children.</p>\n\n\n\n<p>Indeed, the opening image is of a father and daughter looking at an iPad in an Apple-approved way that keeps them safe and assures the company of a 30 percent cut of app sales and possibly some services revenue on the side, assuming they actually want to back up the device.</p>\n\n\n\n<p>This, of course, is why the little girl is smiling.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/apple-dangers-sideloading-1.jpg?quality=50&amp;strip=all\" /></figure><p>Apple</p></div>\n\n\n\n<p>It should be noted that the iPad is orange, a color not currently available so ORANGE IPAD CONFIRMED.</p>\n\n\n\n<p>The drawings in the white paper also heavily feature a fox in a black and white striped prison outfit with a mask on. The fox is seen licking his chops, his eyes replaced with dollar signs. The Macalope has a lot of questions about this fox. Is he related to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mcdonalds.fandom.com/wiki/Hamburglar&amp;xcust=1-1-349841-0-0-0&amp;sref=https://www.macworld.com/feed\">Hamburglar</a>? Did he escape from prison? What prison is dressing foxes in early-to-mid 20th century stereotypical prison garb? Why a mask? Most people couldn’t tell one fox from another if you paid them. The rest of the characters in the drawings are humans. Why is it a fox that’s trying to steal their money? Seems foxist. The Macalope knows a lot of mythical beasts but he does not know this fox. Is he in the guild?</p>\n\n\n\n<p>So many questions.</p>\n\n\n\n<p>Apple touts the inherent security of only being able to install apps from the App Store and, for the most part, the Macalope agrees. Although, it’s not just through the magic of the App Store that Apple has made what’s almost unarguably the most secure computing platform in existence, it’s also through a host of technologies as the company outlines. And none of it has much to do with it taking 15 to 30 percent of app sales.</p>\n\n\n\n<blockquote><p>Today, it is extremely rare for any user to encounter malware on iPhone.</p></blockquote>\n\n\n\n<p>Scamware, sure. Malware, no.</p>\n\n\n\n<p>If you’re getting scammed on iOS, rest assured that it’s through Apple’s approved payment system. All is well.</p>\n\n\n\n<p>John Gruber has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daringfireball.net/2021/06/annotating_apples_anti-sideloading_white_paper&amp;xcust=1-1-349841-0-0-0&amp;sref=https://www.macworld.com/feed\">his own take on this paper</a> in which he notes:</p>\n\n\n\n<blockquote><p>No app you install can entrench invisible background agents that act like system software.</p></blockquote>\n\n\n\n<p>No <em>app</em> you install can do that, but users can install profiles that do that and can install them just by visiting a webpage. Indeed, this is another point against side-loading. Ask a parent who’s had a child install a profile on a device because it promised the ability to install Minecraft mods or dangled some other shiny object. There is no means of stopping the installation of these profiles other than Apple revoking the developer license, which the company has gotten more serious about in recent years but is kind of like closing the barn door after the cartoon fox convict has stolen your cows’ app coins. Many of these add-ons were malware, which lends credence to the company’s assertions about sideloading. (But Apple should really add a Screen Time preference to lock the ability to install profiles.)</p>\n\n\n\n<p>As Gruber notes, the security aspects of the App Store do not necessitate all the associated rules of the App Store, many of which are simply designed to enrich the company. It’s not unreasonable for Apple to want to get something in return for its labor, but the company has created an platform that is close to a necessity as a target for development and at the same time that platform makes it difficult for developers to reap the rewards of their own labor.</p>\n\n\n\n<p>The Macalope has long shied away from making pronouncements about what Apple should do to improve the App Store experience for developers because, well, he’s not a developer. But this situation has reached such a head that it will soon come before Congress, a body with many members who are probably less qualified to determine remedies than a cartoon human/Mac/antelope hybrid in a suit. So here goes.</p>\n\n\n\n<p>First, drop the rate to at least 15 percent across the board. 10 percent would be the Macalope’s stretch goal for Apple. Would the company even notice the difference? The Windows Store is not really comparable because the company is struggling to get consumer apps, but it’s worth noting that Microsoft has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://stratechery.com/2021/the-lightness-of-windows/&amp;xcust=1-1-349841-0-0-0&amp;sref=https://www.macworld.com/feed\">reduced its cut to 15 percent</a> and is allowing developers to use outside payment mechanisms if they don’t want to give Microsoft any cut at all.</p>\n\n\n\n<p>Second, allow developers to point to places outside the app where users can purchase licenses. Most users won’t bother because it’s just easier to use Apple’s payment mechanism, but not even allowing a link comes across as incredibly petty.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Finally, allow sideloading in some way, with a hurdle large enough that ordinary users aren’t going to consider it worth the cost. Gruber suggests making it part of the $100 developer license. That hurdle seems about the right level of difficulty to the Macalope if it’s not necessarily the right mechanism.</p>\n\n\n\n<p>It is, of course, easy for the Macalope to make these suggestions. It’s ridiculously easy. The hardest part is typing with hooves. Which, still, is harder than it looks. When the App Store debuted, 30 percent seemed not generous but reasonable. But that was 13 years ago. The world was very different then. You still had that Flock Of Seagulls haircut. Not sure why you changed it to a Duran Duran haircut, seems like kind of a lateral move, but we all make our own grooming decisions. Except the Macalope. The little birds that live on his back do that for him.</p>\n\n\n\n<p>Apple has the largest market cap of any company, is incredibly wealthy by any measure and has created a platform that is effectively essential for developers. This is how the antitrust concerns start to make sense even when the platform actually has smaller market share than its main competitor. For many reasons the Macalope bristles at comparisons between Apple now and Microsoft just before its antitrust case more than 20 years ago. But the one thing both have in common, seemingly, is a belief that sticking to their guns is the right move. That’s an assumption that’s to be tested at Apple’s peril.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b00621af6bbea8e68d58df85699a76710b7334713c54eb7bce6381378b642843","category":"Apple"}