{"title":"105 Fetal hypothyroidism dysregulates local hepatic and renal renin-angiotensin systems in a temporal manner","link":"https://academic.oup.com/jas/article/102/Supplement_3/272/7757443?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The renin-angiotensin system (RAS) is an essential endocrine system with roles in electrolyte balance, blood volume, and blood pressure. While the canonical RAS exerts systemic vasoregulatory effects through steps involving hepatic, renal, and pulmonary-derived compounds, there is also evidence of localized, independently acting RAS in organs such as the liver and kidney. Further, modulations in RAS resulting from fetal hypothyroidism have previously been documented, although the temporal specificity of this endocrine interaction is not well-characterized. Thus, the objective of the current study was to examine the time-dependency of modulations in local hepatic and renal RAS in a porcine model of fetal hypothyroidism. To achieve this, pregnant gilts (n = 24) were divided evenly into either a control (CON) or methimazole (MMI) treatment group, with the MMI group receiving 5 mgּ kg<sup>-1</sup>ּ d<sup>-1</sup> of oral MMI treatment and the CON group receiving an equivalent sham carrier. Each group was further divided into four timepoints (n = 3/treatment at each timepoint), with treatment beginning on d 34, 45, 55, or 65 of gestation. After 21 d of treatment, and at d 55, 66, 76, and 86, respectively, the gilts were humanely euthanized, blood samples taken from all fetuses (n = 340), and thyroid, liver (LVR), and kidney (KID) collected from a subset of four fetuses per litter (n = 96). Confirmation of fetal hypothyroidism in the MMI group was accomplished via histological assessment of the thyroid and measurement of circulating thyroxine (T4) concentrations. Each MMI-treated fetus (n = 96) subset showed evidence of goitrous thyroid histology, with the absence of healthy eosinophilic colloid indicating successful disruption of the fetal hypothalamic-pituitary-thyroid axis. T4 assays performed on a similar subset of n = 96 fetuses showed that MMI treatment significantly reduced T4 concentrations within each timepoint relative to CON (<span>P</span> &lt; 0.001 at all timepoints). Following confirmation of hypothyroidism, RNA was extracted from the fetal LVR and KID samples to allow for gene expression analysis by qPCR. Ct values were normalized, fold changes calculated using the 2<sup>-∆∆Ct</sup> method, and differences within timepoint determined using a Wilcoxon signed-rank test. AGT, the precursor to all bioactive RAS peptides, was significantly downregulated in LVR at d 66 (<span>P</span> = 0.014) and 76 (<span>P</span> &lt; 0.001). ACE was significantly upregulated at d 76 in both LVR (<span>P</span> = 0.037) and KID (<span>P</span> = 0.005). No significant changes were observed for ACE2 in either tissue, or for renal REN. Finally, AGTR1, the receptor that mediates RAS effects, was significantly downregulated at d 55 in KID (<span>P</span> &lt; 0.001) and d 76 in LVR (<span>P</span> = 0.023), while also being upregulated at d 86 in LVR (<span>P</span> = 0.033). Collectively, these results show that fetal hypothyroidism modulates RAS function in a gestational age-dependent manner, which may alter fetal development and subsequent postnatal physiology.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b018004e197e020ddaeffeb912c7f6d72cf97b866fddf7857cf8e573dd6e0295","category":"Environment"}