{"title":"Immune cells and checkpoints in pancreatic adenocarcinoma: Association with clinical and pathological characteristics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305648","date":1719928800000,"content":"<p>by Maria Auxiliadora de Paula Carneiro Cysneiros, Magno Belém Cirqueira, Lucas de Figueiredo Barbosa, Ênio Chaves de Oliveira, Lucio Kenny Morais, Isabela Jubé Wastowski, Vitor Gonçalves Floriano</p>\r\nIntroduction <p>Pancreatic adenocarcinoma is an extremely aggressive neoplasm, with many challenges to be overcome in order to achieve a truly effective treatment. It is characterized by a mostly immunosuppressed environment, with dysfunctional immune cells and active immunoinhibitory pathways that favor tumor evasion and progression. Thus, the study and understanding of the tumor microenvironment and the various cells subtypes and their functional capacities are essential to achieve more effective treatments, especially with the use of new immunotherapeutics.</p> Methods <p>Seventy cases of pancreatic adenocarcinoma divided into two groups 43 with resectable disease and 27 with unresectable disease were analyzed using immunohistochemical methods regarding the expression of programmed cell death ligand 1 (PD-L1), programmed cell death ligand 2 (PD-L2), and human leukocyte antigen G (HLA-G) molecules as well as the populations of CD4+ and CD8+ T lymphocytes, regulatory T cells (Tregs), and M2 macrophages (MM2). Several statistical tests, including multivariate analyses, were performed to examine how those immune cells and immunoinhibitory molecules impact the evolution and prognosis of pancreatic adenocarcinoma.</p> Results <p>CD8+ T lymphocytes and M2 macrophages predominated in the group operated on, and PD-L2 expression predominated in the unresectable group. PD-L2 was associated with T stage, lymph node metastasis, and clinical staging, while in survival analysis, PD-L2 and HLA-G were associated with a shorter survival. In the inoperable cases, Tregs cells, MM2, PD-L1, PD-L2, and HLA-G were positively correlated.</p> Conclusions <p>PD-L2 and HLA-G expression correlated with worse survival in the cases studied. Tumor microenvironment was characterized by a tolerant and immunosuppressed pattern, mainly in unresectable lesions, where a broad positive influence was observed between immunoinhibitory cells and immune checkpoint proteins expressed by tumor cells.</p>","author":"Maria Auxiliadora de Paula Carneiro Cysneiros","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b02050ee2c29f06b9e478c65ce231b5be92e54ba0d9cab7d0481b8cfc5984174","category":"Interdisciplinary"}