{"title":"Cartilage Collagen Neoepitope C2C Expression in the Articular Cartilage and Its Relation with Joint Tissue Damage in Patients with Knee Osteoarthritis","link":"https://www.preprints.org/manuscript/202403.1246/v1","date":1711027024000,"content":"Pathological cleavage of collagen type II (Col2) and generation of Col2 neoepitopes can be good molecular markers of progression of osteoarthritis (OA). One of such potential biomarkers is collagen type II neoepitope C2C. The aim of this study was to correlate the degree of articular cartilage damage in OA patients with C2C expression in histological samples of tissues removed during total knee replacement. Cartilage samples were obtained from 27 patients aged from 55 to 66. In each patient medial and lateral tibia plateau samples were analyzed according to the OARSI histopathology grading system. C2C expression was evaluated on histological slides by semi-quantitative analysis using ImageJ Fiji software. Spearman´s rank correlation analysis showed significant positive correlation (rho=0.289, P=0.0356) between the histological grade of tissue damage and the percentage of C2C staining. In addition, highly significant positive correlation (rho=0.388, P=0.0041) was found between osteoarthritis score (combining the histological grade of damage with the OA macroscopic stage) and the percentage of C2C staining in the samples. The C2C expression was found in all the regions of the articular cartilage (i.e. the superficial zone, mid zone, deep zone and tidemark area and the zone of calcified cartilage). Our study suggests that local expression of C2C correlates with the cartilage damage in the knee affected by OA. This further assures that C2C can be a perspective marker for evaluation of pathological processes in OA course and OA clinical trials.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b0237cba088f8557e3c1b46bf2e9a91cad6b8f6d74b3409e920d202a0e660782","category":"Interdisciplinary"}