{"title":"Regulatory Threshold of Soil and Water Conservation Measures on Runoff and Sediment Processes in the Sanchuan River Basin","link":"https://www.preprints.org/manuscript/202406.1991/v1","date":1719569237000,"content":"Researches on the runoff and sediment reduction effects of soil and water conservation measures are being on the rise, which is of great significance for carrying out strategic on soil and water conservation in the Yellow River Basin. Through the analysis of various soil and water conserva-tion measures, runoff, sediment, and rainfall datas in the Sanchuan River Basin from 1960 to 2019, we use the lagrange multiplier method to determining the threshold year of soil and water con-servation measures on runoff and sediment processes. The preliminary conclusion is as follows: The trend of flood season rainfall and annual rainfall in the Sanchuan River Basin is consistent. The 10-year average rainfall in each periods indicates that before 2000, it gradually decreased and then significantly increased. The 10-year average runoff showed a gradual decrease before 2010, followed by a sudden increase, while the 10-year average sediment has shown a decreasing trend years by years, especially after the centralized treatment period. Terrace and dam measures show a trend of first decreasing, then increasing, and then approaching stability during different treat-ment periods, while the trend of forest and grass measures is slightly decreasing and then in-creasing rapidly. The runoff and sediment reduction effects of various soil and water conservation measures during different treatment periods indicate that the runoff reduction effect reached its peak in 2005, while the sediment reduction benefit reached its best in 2015. Based on the compre-hensive benefits of runoff and sediment regulation, 2015 are considered as the threshold year for various soil and water conservation measures, with each measure areas being 4.86 × 104, 17.91 × 104, 1.20 × 104, and 0.83 × 104hm2, respectively. The research results will have certain reference significance for the high-quality development of soil and water conservation in the Yellow River Basin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b026c0eb89358edb2a4608a28d86ce48fff23f2547bdeeea68b9e80a424b3f20","category":"Interdisciplinary"}