{"title":"Synergistic Dual Targeting of Thioredoxin and Glutathione Systems Irrespective of p53 in Glioblastoma Stem Cells","link":"https://www.preprints.org/manuscript/202409.0790/v1","date":1725954635000,"content":"Glioblastoma (GBM) is an incurable primary brain cancer characterized by increased reactive oxygen species (ROS) production. The redox-sensitive tumor suppressor gene TP53, wildtype (wt) for 70% of patients, regulates redox homeostasis. Glioblastoma stem cells (GSCs) increase thioredoxin (Trx) and glutathione (GSH) antioxidant systems as survival redox-adaptive mechanisms to maintain ROS below the cytotoxic threshold. Auranofin, an FDA-approved anti-rheumatoid drug, inhibits thioredoxin reductase 1 (TrxR1). L-buthionine sulfoximine (L-BSO) and the natural product piperlongumine (PPL) inhibit the GSH system. We evaluated the cytotoxic effects of Auranofin alone and in combination with L-BSO or PPL in GBM cell lines and GSCs with known TP53 status. The Cancer Genome Atlas/GBM analysis revealed a significant positive correlation between wtp53 and TrxR1 expression in GBM. Auranofin induced ROS-dependent cytotoxicity within a micromolar range in GSCs. Auranofin decreased TrxR1 expression, AKT(Ser-473) phosphorylation, increased p53, p21 and PARP-1 apoptotic cleavage in wtp53-GSCs, while mutant-p53 was decreased in a mutant-p53 GSC line. p53-knockdown in a wtp53-GSC line decreased TrxR1 expression and significantly increased sensitivity to auranofin, suggesting the role of wtp53 as a negative redox-sensitive mechanism in response to auranofin in GSCs. Auranofin and L-BSO combination synergistically increased ROS, decreased IC50s and induced long-term cytotoxicity irrespective of p53 in GBM cell lines and GSCs. Intriguingly, Auranofin increased expression of glutathione S-transferase pi-1 (GSTP-1), a target of PPL. Combination of auranofin with PPL synergistically decreased IC50s to a nanomolar range in GSCs, supporting the potential to repurpose auranofin and PPL in GBM.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b02c0814801460d680b784921716d811d4d978ca6f79d380343740fc55b744e1","category":"Interdisciplinary"}