{"title":"How to connect two Macs without a network","link":"https://www.macworld.com/article/698765/how-to-connect-two-macs-without-a-network.html","date":1685604600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A network is great, but what if you just want to connect two Macs and transfer gobs of information as fast as you can? Using a gigabit ethernet cable or a Mac with 802.11ac (Wi-Fi 5) or later wireless networking hardware, you can transfer data between two devices at gigabit per second rates—but you can do better than that!</p>\n\n\n\n<p>Apple offers four built-in methods in macOS, none of which are obvious to set up. Each of them has different requirements, advantages, and tradeoffs. Once connected, you use the same tools to transfer information between two Macs as you would if they were connected to a network:</p>\n\n\n\n<ul><li><strong>SMB file sharing:</strong> In the Finder, choose <em>Go &gt; Connect to Server</em> (Command-K) and click Browse. If the Mac doesn’t appear in the Network window, go back to Connect to Server, enter <code>smb://</code> followed by the other device’s network-assigned or self-assigned IP address, and click Connect. (A self-assigned address means the computer couldn’t find a DHCP server, which assigns out addresses and provides a path to the Internet.)</li><li><strong>Bonjour:</strong> A Mac connected with any method below should be discoverable via apps that support Bonjour.</li><li><strong>Direct app support:</strong> Some apps build in their own network services and should simply identify another Mac running client or peer-to-peer software.</li></ul>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-self-assigned-IP-bordered.png\" alt width=\"633\" height=\"540\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-self-assigned-IP-bordered.png?quality=50&amp;strip=all 844w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-self-assigned-IP-bordered.png?resize=300%2C256&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-self-assigned-IP-bordered.png?resize=768%2C655&amp;quality=50&amp;strip=all 768w\" /><figcaption>A self-assigned network starts with 169.254., but you can still connect to it from the Network browser.</figcaption></figure></div>\n\n\n\n<p>Here are the four methods, from fastest to slowest.</p>\n\n\n\n<h2>Connect via Thunderbolt</h2>\n\n\n\n<p>Thunderbolt has long included a computer-to-computer mode that allows a 10Gbps connection. While that’s a fraction of its current 40Gbps data path for drives, peripherals, and displays, it’s speedy enough! (This method works with Windows and other computers that have Thunderbolt support, too.)</p>\n\n\n\n<p>In my testing using a Thunderbolt 4 cable between two M1 Macs, I was able to get 4Gbps of sustained writes and 8Gbps of sustained reads using a speed-testing app, and 5Gbps in copying large files from one Mac to the other. Both rates are far above gigabit ethernet.</p>\n\n\n\n<p>It’s vitally important that you have a USB-C to USB-C cable designed for Thunderbolt 3 or 4. Buy it from a company that has a good track record, such as <a href=\"https://www.amazon.com/Anker-Thunderbolt-Supports-Transfer-Certified/dp/B095KSL2B9?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Anker</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.belkin.com/us/cables/data/connect-thunderbolt-4-cable/p/p-inz002/&amp;xcust=1-1-698765-1-0-0&amp;sref=https://www.macworld.com/feed\">Belkin</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.caldigit.com/thunderbolt-4-usb-4-cable/&amp;xcust=1-1-698765-1-0-0&amp;sref=https://www.macworld.com/feed\">CalDigit</a>, and <a href=\"https://www.dpbolvw.net/click-100470607-11911660?sid=1-1-698765-1-0-0&amp;url=https://eshop.macsales.com/shop/owc-thunderbolt-4-cables\">Other World Computing</a>, to name four of many. If you already own a USB-C cable, check that it has a lightning bolt symbol on plugs at both ends; it should also bear a 3 or 4, though Apple omits that, oddly enough. You don’t want a USB-C charge-only cable (typically unmarked ends) or a USB 3-only cable (typically a USB symbol and SuperSpeed+ or SS+, SS 10, or SS 20 label).</p>\n\n\n\n<p>If you have one or two older Macs with Thunderbolt 2, you can use a Thunderbolt 2 to Thunderbolt 2 cable or a Thunderbolt 3 or 4 USB-C cable with <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-698765-1-0-0&amp;u=https://www.apple.com/shop/product/MMEL2AM/A/thunderbolt-3-usb-c-to-thunderbolt-2-adapter\">a Thunderbolt 2 adapter</a> on one end.</p>\n\n\n\n<p>Here’s how to set it up:</p>\n\n\n\n<ol><li>Connect the two computers with a cable via any of their Thunderbolt ports.</li><li>Check network settings:<ul><li>In Monterey or earlier: Open  &gt; <em>System Preferences</em> &gt; <em>Network</em>. Make sure Thunderbolt Bridge appears in the list of interfaces at left on both Macs. If not, click the + (plus) and select Thunderbolt Bridge to add it, click Create, and click Apply.</li><li>In Ventura: Go to  &gt; <em>System Settings &gt; Network</em> and make sure Thunderbolt Bridge appears in the list of interfaces at center. If not, click the More (…) icon at the bottom of the interface list and choose Add Service. Choose Thunderbolt Bridge from the Interface popup menu. Name it and click Create.</li></ul></li><li>With the bridge interface in place and the two Macs connected, you should see a yellow dot and Self-Assigned IP appear under the interface name.</li><li>Note the address of each computer, which will be something that starts <code>169.254.</code> like <code>169.254.14.103</code>. You’ll need that for SMB connections as described above.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-thunderbolt-self-assigned-bordered-1.png?w=1200\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-thunderbolt-self-assigned-bordered-1.png?quality=50&amp;strip=all 1279w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-thunderbolt-self-assigned-bordered-1.png?resize=300%2C84&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-thunderbolt-self-assigned-bordered-1.png?resize=768%2C216&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-thunderbolt-self-assigned-bordered-1.png?resize=1200%2C337&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"337\" /><figcaption>The Thunderbolt-to-Thunderbolt connection will appear with a yellow dot and Self-Assigned-IP in the Network preference pane.</figcaption></figure></div>\n\n\n\n<p>To disconnect, simply unplug the Thunderbolt cable.</p>\n\n\n\n<h2>Connect via 1Gbps to 10Gbps ethernet</h2>\n\n\n\n<p>macOS can also automatically configure a network connection over ethernet between two Macs with the same outcome above: a self-assigned IP address. Some Macs—like the Mac Pro and Studio Mac—have built-in 10Gbps ethernet. Macs released in the last decade have 1Gbps ethernet, known as plain “gigabit ethernet.” To use 1Gbps ethernet, you need a cable rated as Category 5E (or Cat5E) or higher; for 10Gbps, at least Cat6. (If you want to use 10Gbps on a local network, you can get a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.owcdigital.com/products/thunderbolt-3-10g-ethernet-adapter&amp;xcust=1-1-698765-1-0-0&amp;sref=https://www.macworld.com/feed\">10 Gbps ethernet adapter for Thunderbolt 3 or 4</a> for a whopping $199.)</p>\n\n\n\n<p>Open <em>System Preferences</em>/<em>Settings</em> &gt; <em>Network</em> and make sure Ethernet appears in the list of interfaces. If not, follow the steps above for Thunderbolt to add an Ethernet interface. Connect the two Macs with the cable, and you’ll wind up as in step 4 above for a Thunderbolt cable.</p>\n\n\n\n<p>You can connect with computers running other operating systems, as they generally also automatically create a self-assigned IP address and allow SMB and other networking services.</p>\n\n\n\n<p>Performance should be up to 1Gbps with gigabit ethernet and match Thunderbolt performance with 10Gbps ethernet.</p>\n\n\n\n<h2>Create a Wi-Fi hotspot with your Mac</h2>\n\n\n\n<p>If there’s no Thunderbolt or ethernet cable handy and no Wi-Fi network nearby, you can use your Mac to create a Wi-Fi hotspot, once called a <em>software base station</em>. (Apple began including this feature decades ago.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-wifi-symbols.png\" alt width=\"273\" height=\"68\" /><figcaption>Apple’s special wireless iconography (left to right): Internet sharing hotspot, self-assigned IP address (no network), and computer-to-computer networking.</figcaption></figure></div>\n\n\n\n<p>Read “<a href=\"https://www.macworld.com/article/234236/how-to-share-a-wi-fi-connection-via-macos.html\">How to share a Wi-Fi connection via macOS</a>” on how to configure one Mac to offer such a network. You use <em>System Preferences</em> &gt; <em>Sharing</em> rather than the Network preference pane. (Visit the Network preference pane and it shows Internet Sharing: On as the Network Name for the Wi-Fi adapter.) Your Mac also shows an upward-pointing arrow inside the Wi-Fi fan to indicate network sharing.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-wifi-hotspot-mac-bordered.png\" alt width=\"904\" height=\"660\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-wifi-hotspot-mac-bordered.png?quality=50&amp;strip=all 904w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-wifi-hotspot-mac-bordered.png?resize=300%2C219&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-wifi-hotspot-mac-bordered.png?resize=768%2C561&amp;quality=50&amp;strip=all 768w\" /><figcaption>You can create a secure Wi-Fi network managed by your Mac in the Sharing preference pane.</figcaption></figure></div>\n\n\n\n<p>Once created, the Mac’s Wi-Fi network can be selected by any device with Wi-Fi. That includes Macs, gaming systems, Android phones, and anything else. Because this is a shared connection, the machine connected to your Mac will be assigned an IP address by your Mac.</p>\n\n\n\n<p>With my Macs—an M1 MacBook Air and M1 Mac mini—I achieved between 100 and 200Mbps of throughput, about half what I could manage via a Wi-Fi network to a gigabit internet connection.</p>\n\n\n\n<p>A Mac-created Wi-Fi hotspot is good in a pinch when no other network or cables are available, but an 802.11ac (Wi-Fi 5) or later Wi-Fi router can offer more throughput, often making it a better choice.</p>\n\n\n\n<p>Disable the Wi-Fi hotspot by unchecking the Internet Sharing service in the left-hand list in System Preferences &gt; Sharing.</p>\n\n\n\n<h2>Create a computer-to-computer wireless network</h2>\n\n\n\n<p>As the last resort, you can revert to an older wireless method once known as <em>ad hoc</em>. It’s out of date and lacks Wi-Fi security. Still, it has very little overhead because it’s a peer-to-peer connection—just make sure nobody is in range who could sniff your unencrypted wireless data.</p>\n\n\n\n<p>Your maximum throughput will be relatively low. I measured below 100Mbps, even lower on average than with a Mac-created Wi-Fi hotspot.</p>\n\n\n\n<p>Follow these steps:</p>\n\n\n\n<ol><li>On both Macs, go to <em>System/Settings Preferences</em> &gt; <em>Network</em>, select your Wi-Fi adapter, and click Advanced.</li><li>Check or enable “Show legacy networks and options” and click OK or Done. In Monterey or earlier, click Apply if the Apply button appears.</li><li>In the Wi-Fi menu on the Mac on which want to create the network, select Create Network.</li><li>Name the network and choose a high-numbered channel (36 or above), as that allows higher throughput, and click <em>Create</em>.</li><li>When warned about creating an unsecure network, click Create.</li><li>The icon in the Wi-Fi menu changes to show a tiny display within a Wi-Fi fan shape. Click the icon, and you see the network listed under Device.</li><li>From the other computer, click the Wi-Fi menu and click Other Networks. The sharing Mac’s network appears under Device. Select it. (This may work with some non-Mac computers and mobile devices, too.)</li><li>The connected Mac’s Wi-Fi icon will also change to the display-within-a-fan.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-ad-hoc-items.png?w=1200\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-ad-hoc-items.png?quality=50&amp;strip=all 1459w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-ad-hoc-items.png?resize=300%2C123&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-ad-hoc-items.png?resize=768%2C315&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/05/mac911-network-ad-hoc-items.png?resize=1200%2C492&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"492\" /><figcaption>To create the network, you name and pick a channel (left, as in step 4), and then confirm the creation (step 5).</figcaption></figure></div>\n\n\n\n<p>To disconnect, click the Wi-Fi symbol to the left of the network’s name on the Mac that’s sharing. Turn off the network on the Mac that’s sharing by clicking that Wi-Fi symbol under Device.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b033088d023c26151a06549abc744c56df189a579555822fc3e91966abf6bda3","category":"Apple"}