{"title":"Relationship between Occupational Exposure to Noise and Vibrations, and Vertigo: A Case-Control Study","link":"https://www.preprints.org/manuscript/202407.2072/v1","date":1721910697000,"content":"Background/Objectives: It is known that balance disorders involve occupational hazards. However, the inverse relationship (between certain occupations and an increased incidence of vertigo or dizziness) has been scarcely studied. The objective of this work was to analyze the occupation of a group of patients with vertigo, compared to economically active general population, and to evaluate the prevalence of occupational noise and/or vibration-exposure in both groups. Methods: A cross-sectional, observational, case-control study was carried out including 461 patients (220: Meniere’s disease; 73: vestibular migraine; 28: vestibular neuritis; 140: BPPV) (310 women and 151 men). These patients were compared to a control group from the general population, obtained from 6th EWCS-Spain (2015). Possible differences regarding sex, age, occupation, exposure to noise, and exposure to mechanical vibrations were analyzed. Results: Differences in distribution of occupations between patients with vertigo and general population were observed (Chi-square, p=6.142 e-30). Patients with vertigo were significantly more exposed to noise (p=8.19 e-12; OR=2,127, CI95% (1.720;2.630)) and vibrations (p=1.11 e-12; OR=2.288, CI95% (1.835;2.853)) than the control group. These differences were observed both between men and women. Conclusions: A relationship between occupational exposure to noise and/or vibrations and the presence of vertigo was observed. Protective and preventive measures could help prevent the occurrence of some diseases involving vertigo.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b040ceff07fb7174bfdfd39143faa66f46d91ccc9470ad4a3c8bc28024f9d643","category":"Interdisciplinary"}