{"title":"PHOSPHATASE 2A dephosphorylates PHYTOCHROME-INTERACTING FACTOR3 to modulate photomorphogenesis in Arabidopsis","link":"https://academic.oup.com/plcell/article/36/10/4457/7712989?rss=1","date":1720742400000,"content":"<span><div>Abstract</div>The phytochrome (phy) family of sensory photoreceptors modulates developmental programs in response to ambient light. Phys also control gene expression in part by directly interacting with the bHLH class of transcription factors, PHYTOCHROME-INTERACTING FACTORS (PIFs), and inducing their rapid phosphorylation and degradation. Several kinases have been shown to phosphorylate PIFs and promote their degradation. However, the phosphatases that dephosphorylate PIFs are less understood. In this study, we describe 4 regulatory subunits of the Arabidopsis (<span>Arabidopsis thaliana</span>) protein PHOSPHATASE 2A (PP2A) family (B′α, B′β, B″α, and B″β) that interact with PIF3 in yeast 2-hybrid, in vitro and in vivo assays. The <span>pp2ab</span>″<span>αβ</span> and <span>b</span>″<span>αβ/b</span>′<span>αβ</span> mutants display short hypocotyls, while the overexpression of the B subunits induces longer hypocotyls compared with the wild type (WT) under red light. The light-induced degradation of PIF3 is faster in the <span>b</span>″<span>αβ/b</span>′<span>αβ</span> quadruple mutant compared with that in the WT. Consistently, immunoprecipitated PP2A A and B subunits directly dephosphorylate PIF3-MYC in vitro. An RNA-sequencing analysis shows that B″α and B″β alter global gene expression in response to red light. <span>PIFs</span> (<span>PIF1</span>, <span>PIF3</span>, <span>PIF4</span>, and <span>PIF5</span>) are epistatic to these B subunits in regulating hypocotyl elongation under red light. Collectively, these data show an essential function of PP2A in dephosphorylating PIF3 to modulate photomorphogenesis in Arabidopsis.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"b0514353ff3ed538ca3a962e52338c2525dd99a04bb74e97c1e57a6fdd322dde","category":"Environment"}