{"title":"FBI ใช้ซอฟต์แวร์ตรวจจับใบหน้า ค้นหาและจับกุมผู้ชุมนุมที่ทำร้ายเจ้าหน้าที่รัฐสภาได้ จากรูปบน IG ของแฟนสาว","link":"https://www.blognone.com/node/122289","date":1619008865000,"content":"<div><div><div><p>Huffington Post เปิดเผย<a href=\"https://www.documentcloud.org/documents/20665075-41f45c66-98d7-46c3-b08e-ae4b81a1f8c1\">บันทึกการจับกุม</a> จากเจ้าหน้าที่สำนักงานสอบสวนกลางของสหรัฐฯ หรือ FBI กรณีจับกุม Stephen Chase Randolph ผู้ชุมนุมที่ก่อเหตุทำร้ายเจ้าหน้าที่ตำรวจรัฐสภาสหรัฐฯ (USCP) เมื่อวันที่ 6 มกราคม 2021 โดยใช้ซอฟต์แวร์ตรวจจับใบหน้า เทียบภาพจากเหตุการณ์กับภาพบนอินเทอร์เน็ต จนพบรูปเขาบน IG ของแฟนสาว ก่อนจะสืบสวนและเข้าจับกุมได้ในที่สุด</p>\n<p>ในรายงานระบุว่าเจ้าหน้าที่รวบรวมภาพเหตุการณ์จากวิดีโอบน Instagram แสดงเหตุการณ์ชายหนุ่มสวมหมวกสีเทาคนหนึ่ง เข้าทำร้ายเจ้าหน้าที่โดยการผลักรั้วกั้นไปกระแทกจนเจ้าหน้าที่ล้มหัวฟาดบันได และหมดสติ ในการชุมนุมวันที่ 6 มกราคม 2021 ก่อนนำภาพใบหน้าชายสวมหมวกสีเทาจากแอคเคาท์ <a href=\"https://twitter.com/SeditionHunters\">@SeditionHunters</a> แอคเคาท์ทวิตเตอร์ที่เผยแพร่ใบหน้าผู้ชุมนุมรัฐสภาสหรัฐฯ มาเทียบ และพบว่าเป็นชายหนุ่มคนเดียวกับในวิดีโอ</p>\n<p>เจ้าหน้าที่ FBI จึงใช้ซอฟต์แวร์ตรวจจับใบหน้าแบบ open source เพื่อเทียบใบหน้าของเขากับรูปภาพบนอินเทอร์เน็ต ก่อนจะพบภาพ Stephen สวมหมวกสีเทาแบบเดียวกับในวันชุมนุม บนโพสต์ Instagram ที่เปิดเป็นสาธารณะของแฟนสาวเขา และต่อยอดการสืบไปจนพบชื่อจริงของเขาจากบัญชี Facebook คนในครอบครัว และตรวจสอบยืนยันอีกครั้งจากใบขับขี่ของรัฐ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/70d6f952fc3dd9dac5b841edd4007ebc.png\" /><em>ภาพ Stephen Chase Randolph บน Instagram ของแฟนสาว จากบันทึกการจับกุมของ FBI</em></p>\n<p>จากนั้น FBI จึงส่งเจ้าหน้านอกเครื่องแบบไปเฝ้าดูหน้าที่ทำงานของเขา และทำทีเข้าไปชวนพูดคุยเพื่อถามถึงเหตุการณ์การชุมนุม จน Stephen หลุดปากพูดว่าเข้าร่วมการชุมนุมจริง บอกว่ามันสนุกมาก และยอมรับว่าเห็นเจ้าหน้าที่ถูกผลักจนหัวฟาดนอนกองอยู่กับพื้น และหลังจากนั้นเขาจึงถูกตำรวจรัฐเคนทัคกี้เข้าจับกุมในที่สุด</p>\n<p>ในบันทึกการจับกุมไม่มีการเปิดเผยชื่อซอฟต์แวร์ตรวจจับใบหน้า open source ที่ FBI ใช้ แต่หน่วยงานของสหรัฐอเมริกา เริ่มมีความนิยมใช้ซอฟต์แวร์ตรวจจับใบหน้าทั้ง open source และแบบต้องจ่ายเงินใช้งานมากขึ้นเรื่อยๆ โดยหนึ่งในซอฟต์แวร์ที่ได้รับความนิยมคือ Clearview AI ซึ่ง <a href=\"https://www.buzzfeednews.com/article/ryanmac/clearview-ai-local-police-facial-recognition\">Buzzfeed เคยรายงานว่า</a> มีหน่วยงานที่รับงบประมาณจากรัฐกว่า 1,803 หน่วยงาน รวมถึงตำรวจท้องถิ่นและตำรวจรัฐ ได้ทดลองใช้งานซอฟต์แวร์นี้ไปแล้วเมื่อช่วงปี 2018 จนถึงเดือนกุมภาพันธ์ ปี 2020 และมีความเป็นไปได้ว่าเทคโนโลยีตรวจจับใบหน้านี้ อาจถูกนำมาใช้เพื่อสืบสวนและจับกุมผู้ต้องสงสัยมากขึ้นเรื่อยๆ ในอนาคต</p>\n<p>ที่มา - <a href=\"https://www.huffingtonpost.co.uk/entry/facial-recognition-capitol-defendants_n_607f34c0e4b0df3610c17614?ri18n=true\">Huffington Post</a> via <a href=\"https://www.theverge.com/2021/4/21/22395323/fbi-facial-recognition-us-capital-riots-tracked-down-suspect\">The Verge</a>, <a href=\"https://www.documentcloud.org/documents/20665075-41f45c66-98d7-46c3-b08e-ae4b81a1f8c1\">บันทึกการจับกุมของ FBI</a>, <a href=\"https://www.buzzfeednews.com/article/ryanmac/clearview-ai-local-police-facial-recognition\">Buzzfeed</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/fbi\">FBI</a></div><div><a href=\"/topics/united-states\">United States</a></div><div><a href=\"/topics/facial-recognition\">Facial Recognition</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b0547ee2ec1762d12854dc05136f12ffff383dec5cc789bf67c27add9db209c4","category":"Thai"}