{"title":"Women's 2021 World Championship time trial: Debrief","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/womens-2021-world-championship-time-trial-debrief","date":1632239825000,"content":"\n      <p><span>Defending champion Anna van der Breggen did not take to the startline in Knokke-Heist yesterday, having decided “a long time ago” that she wouldn’t be contesting the rainbow stripes again. With one nailed-on favourite absent, all eyes were on the pure time trialists of the peloton. </span></p>\n<div></div>\n<p><span>The pan-flat 30.3km time trial between Knokke-Heist and Bruges looked to have Ellen van Dijk’s name written all over it. A course for raw powerhouses with the threat of wind added to the mix meant that all eyes were on van Dijk and Olympic silver medalist Marlen Reusser. Annemiek van Vleuten is never a rider to be overlooked, but the flat course did not lend itself to her strengths.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-uci-road-world-championships-preview-and-schedule\">World Championships 2021 Guide</a></strong></em></p>\n<p><b>Dominant van Dijk </b></p>\n<p><span>Ellen van Dijk’s 2021 season got off to a rocky start. The Trek-Segafredo rider struggled with a case of Covid-19 which put her on the sideline for the majority of the Classics. It wasn’t until June that the Dutchwoman’s form started to return, taking a win in the prologue and a series of top-10s on stages of the Healthy Ageing Tour. After a series of strong performances in stage races throughout August, van Dijk took the European road race title in Trento earlier this month.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Le_Col_banner_652974d6-d573-4f55-9a4d-9687e52252c1_1024x1024.jpg?v=1632239261\" /></span></a></p>\n<p><span><em>Sign up to our <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\">women's racing newsletter</a>, in association with Le Col</em></span></p>\n<p><span>On Monday, Van Dijk set her winning time early on in the race, heading down the starting ramp earlier than most of the favourites at 15:07 local time, just under an hour earlier than Reusser and van Vleuten. She knew her biggest rival was the Swiss rider Marlen Reusser: “Marlen was better than me the last few weeks. I had to do something extra compared to the last few weeks,” she said after the race. In the end, however, van Dijk’s time of 36:05 </span><span>—</span> with an average speed of 50.383km/h<span>—</span> held for the rest of the day. </p>\n<p><span>The 34-year-old described how she had been chasing this second world title since 2013: “I’ve been chasing this second title since 2013. Every medal I ever won at championships has a story. There’s always frustration if you don’t win so now there’s a lot of relief because I won.”</span></p>\n<p><span>Van Dijk will also ride the mixed relay alongside van Vleuten and Riejanne Markus. </span></p>\n<p><b>Reusser rues the day</b></p>\n<p><span>On her 30th birthday, Swiss national champion and Olympic silver medalist Marlen Reusser would have hoped for the ultimate birthday gift in the form of the rainbow stripes. Reusser, who recently signed a two-year deal with SD Worx, has been on incredible form of late </span><span>—</span> taking the European ITT title and winning stages of both the Simac Ladies Tour and Ceratizit Challenge by La Vuelta. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1341503205_1024x1024.jpg?v=1632238876\" /></p>\n<p><span>With van Dijk even admitting that she had been worried about her, Reusser had every right to be confident going into the race. At the first and second intermediate splits Reusser was ahead of van Dijk by a few seconds, however come the finish she was flagging, eventually crossing the line 10 seconds down on van Dijk. </span></p>\n<p><span>The birthday girl didn’t hide her disappointment at another silver medal: \"It's really bitter for me, but to see Ellen win and that she's so happy it makes it a little bit better,” she said after the race. “I'm disappointed.”</span></p>\n<p><b>Annemiek’s average power</b></p>\n<p><span>Looking at the flat course it was clear that Annemiek van Vleuten would have her work cut out if she wanted to take her third individual time trial world title. Despite recently being crowned Olympic champion in the discipline, the 38-year-old Dutch rider usually prefers a hill or two on time trial courses. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/against-the-clock-joss-lowden-of-drops-le-col-s-b-tempur\">Related – Against the Clock: Joss Lowden on the Hour</a></strong></em></p>\n<p><span>Still, a third place finish on a course like the one in Belgium is a strong result for van Vleuten, and she has the power numbers to show for it. “I've never averaged power numbers as high as today,” she said in a post-race press conference -- which is some statement for the former world champion and Olympic silver medalist to make. </span></p>\n<p><b>Amazing Amber Neben </b></p>\n<p><span>That Amber Neben even took to the startline at the time trial in Flanders was an impressive feat in itself. Not only did the two-time ITT world champion start the race exactly one month after being hit by a driver leaving her with a fractured pelvis, the 46-year-old American rider put in a phenomenal ride to finish fourth with a time of 37 minutes, just 1:24 behind van Dijk.  </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-womens-road-race-world-championships?\">Related – World Championships Women's Road Race Preview</a></strong></em></p>\n<p><b>Lowden’s looking good</b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1341467614_1024x1024.jpg?v=1632238906\" /></span></p>\n<p><span>Great Britain’s Joss Lowden is a time trial specialist in the way that only British riders can be. The 33-year-old has achieved success in the discipline at both national and international level and lined up on Monday as a strong outside bet. </span></p>\n<p><span>Lowden, who recently signed a two-year contract with the new Uno-X women’s team, will travel to Switzerland later this month to attempt to break the hour record, and with her 8th place finish in Flanders things are looking good for the British rider. </span></p>\n<p><span>Before then, however, she will line up alongside Anna Henderson, Alice Barnes, Alex Dowsett, John Archibald and Dan Bigham for Wednesday’s mixed relay as well as the road race on Saturday where she will ride in support of Lizzie Deignan. </span></p>\n<p><b>The need for U23</b></p>\n<p><span>Looking at the results from the women’s individual time trial, the need for a women’s U23 category was in stark evidence. 22-year-old Juliette Labous was the only U23 rider in the top-10 after finishing 6th with Emma Norsgaard next in 12th position. Further down the results sheet, there were only two U23 riders in the top 20 and only five of the top 25 finishers were U23. </span></p>\n<p><span>Based on the day’s results, the unfair disadvantage that young female riders face at world championship level is clear, showing the need for a separate category for U23 riders to fairly compete.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b0595b980e8b7051c0fde56d67969d9dff96f1792f57effb7cc9eb6c17811f9a","category":"Cycling"}