{"title":"DC โชว์เกมเพลย์ Suicide Squad: Kill The Justice League, เทรลเลอร์ใหม่ Gotham Knights","link":"https://www.blognone.com/node/125308","date":1634444715000,"content":"<div><div><div><p>ในงาน DC Fandome 2021 ของค่าย DC เมื่อคืนนี้ นอกจากการโชว์เทรลเลอร์หนังและซีรีส์ในจักรวาล DC แล้ว ยังมีอัพเดตความคืบหน้าของเกม DC ที่เปิดตัวในปี 2020 สองเกมคือ <a href=\"https://www.blognone.com/node/118079\">Suicide Squad: Kill The Justice League</a> และ <a href=\"https://www.blognone.com/node/118078\">Gotham Knights</a></p>\n<p>เกมแรกคือ <strong>Suicide Squad: Kill The Justice League</strong> ผลงานใหม่ของสตูดิโอ Rocksteady ในเครือ WB Games ที่มีผลงานพัฒนาเกมตระกูล Batman: Arkham ภาคหลักทั้ง 3 ภาค</p>\n<p>เนื้อเรื่องของเกม Suicide Squad ภาคนี้ยังอยู่ในจักรวาลเดียวกับ Arkham แต่เหตุการณ์อยู่ที่เมือง Metropolis ของ Superman โดยแก๊งวายร้าย 4 คนคือ  Harley Quinn,  Captain Boomerang, Deadshot, King Shark ถูกปล่อยออกจากเรือนจำ และพบว่าโลกภายนอกถูกเอลี่ยนรุกราน ซึ่งเอเลี่ยนเหล่านี้ได้เข้ามาควบคุมจิตใจของเหล่าฮีโร่ เช่น Superman, The Flash, Green Lantern, Wonder Woman ให้กลายเป็นฝ่ายวายร้ายไปแทน</p>\n<p>เกมลง PS5, Xbox Series X|S และพีซี กำหนดขายคร่าวๆ ปี 2022</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/19d51951f9ed87af3ca98b512ce46dff.jpg\" /></p>\n<p>เกมที่สอง <strong>Gotham Knights</strong> เป็นเกม Batman ในจักรวาลใหม่ที่ไม่เกี่ยวกับ Arkham (ในซีรีส์ Arkham มีเกม Arkham Knight ที่ออกปี 2015 ชื่อคล้ายๆ แต่ไม่เกี่ยวกัน) พัฒนาโดย WB Games Montréal อีกสตูดิโอในสังกัด WB Games ที่เคยมีผลงานพัฒนาเกม Batman: Arkham Origins มาก่อน</p>\n<p>เนื้อเรื่องของเกม Gotham Knights คือเมือง Gotham ที่ Batman ตายไปแล้ว ผู้เล่นจึงต้องรับบทเป็นผู้ช่วยของ Batman 4 คนคือ  Nightwing, Batgirl, Robin, Red Hood มาช่วยกันกอบกู้สันติภาพของเมืองกลับคืนมา</p>\n<p>เดิมทีเกมมีกำหนดออกปี 2021 แต่เลื่อนเป็นปี 2022 เรียบร้อยแล้ว</p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/gotham-knights-story-trailer-release-date-batman-game\">IGN</a>, <a href=\"https://www.ign.com/articles/suicide-squad-kill-the-justice-league-first-gameplay-footage-the-flash-green-lantern-wonder-woman\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dc\">DC</a></div><div><a href=\"/topics/warner-bros\">Warner Bros.</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/batman\">Batman</a></div><div><a href=\"/topics/suicide-squad\">Suicide Squad</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b05cf73c8bfeca2948c965d8f6ae6156d2e6cace62aec33f7f6cb43c0d721678","category":"Thai"}