{"title":"The relationship of milk expression pattern and lactation outcomes after very premature birth: A cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307522","date":1722261600000,"content":"<p>by Ilana Levene, Mary Fewtrell, Maria A Quigley, Frances O’Brien</p>\r\nIntroduction <p>Mothers of very premature infants often have difficulties expressing breastmilk, which can cause distress and potential negative impact on infant health. Clinical recommendations on breastmilk expression are extrapolated from term infants’ breastfeeding patterns. This study’s objective was to analyse the association of expressing pattern with lactation outcomes after very premature birth.</p> Methods <p>132 participants were recruited after birth between 23+0 and 31+6 weeks’ gestation. Participants recorded the milk expressed in several 24-hour periods in the three weeks after birth.</p> Results <p>Expressing frequency was positively associated with 24-hour milk yield, with an adjusted 30.5g increase per expressing session on day four (95% CI 15.7 to 45.3) and 94.4g on day 21 (95% CI 62.7 to 126.2). Expressing ≥8 times per day was associated with higher adjusted milk yield than expressing &lt;6 times (on day four, 146.8g, 95% CI 47.4 to 246.1), but not in comparison to expressing 6–7 times (on day four, 82.1g, 95% CI –25.9 to 190.1). Participants with six months or more prior breastmilk feeding experience had a higher adjusted milk yield than others (on day four, 204.3g, 95% CI 125.2 to 283.3). Night-time (2300–0700 hours) expressing sessions were not associated with increased milk yield after adjustment for time since the prior session. On average, participants who had a longest gap between expressions of less than six hours achieved the UK target of 750g breastmilk, whereas those with a longer gap did not.</p> Conclusion <p>Expressing frequency was an important determinant of milk yield. Clinical recommendations to express ≥8 times per day were supported but for some, 6–7 times was sufficient. This was particularly likely for those with six months or more of prior breastmilk feeding experience. A need to express during the night-time hours appeared to be related to minimising the gap between expressions rather than an inherent value of night-time expression.</p>","author":"Ilana Levene","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b05f2d6062d2acfdaf588193daee92d3b245949136898e7e1af935fc89daac07","category":"Interdisciplinary"}