{"title":"Unpaid environmental damages from fossil fuels are a $600B annual subsidy","link":"https://arstechnica.com/?p=1751472","date":1616507639000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231733860-800x534.jpg\" alt=\"Image of a mine with a power plant in the background.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231733860.jpg\" class=\"enlarge-link\" data-height=\"683\" data-width=\"1024\">Enlarge</a> (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.gettyimages.com/detail/news-photo/the-open-cast-mine-is-seen-near-the-coal-fired-power-news-photo/1231733860?adppopup=true\">Ina Fassbender/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Arguments about our shift to renewable power often focus on the raw economics of the change—the cost of the power itself and, in some cases, the cost of managing its intermittency. Those factors are often compared to the costs of producing electricity with fossil fuels, but the calculation ignores one of the major reasons we're switching to renewables in the first place—namely, that they help us avoid environmental costs.</p>\n<p>Burning fossil fuels exacts a number of costs on society as a whole, including a growing collection of costs associated with climate change. But there are other forms of environmental damage from mining and waste left behind when coal is burned, and particulates and toxic materials in coal exhaust cause significant health damages. These factors are termed \"externalized costs,\" or simply externalities, since they are a cost of doing business which is not internalized into the cost of doing business that we account for.</p>\n<p>While people have calculated the magnitude of these externalized costs, Yale's Matthew Kotchen has now figured out what they mean for the companies in the fossil fuel market. And the results are substantial, with the externalized costs acting as a $62 billion subsidy each year in the US. In fact, Kotchen finds that much of the coal industry might go completely bust if it weren't for this subsidy.</p></div><p><a href=\"https://arstechnica.com/?p=1751472#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1751472&comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b06aff922a604d3092e41d3b19d2de3dee9bc96c6bb57e5088c4dfe649d1523c","category":"Tech"}