{"title":"Restored Vermeer painting finally reveals hidden Cupid in background","link":"https://arstechnica.com/?p=1791079","date":1632220256000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/vermeerTOP-800x516.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/vermeerTOP.jpg\">Enlarge</a> <span>/</span> A new restoration of Johannes Vermeer's <em>Girl Reading a Letter at an Open Window</em> has revealed a Cupid in the background. The restored painting will be the centerpiece of a new exhibition at the Gemäldegalerie Alte Meister in Dresden, Germany, from September 10, 2021, through January 2, 2022. (credit: <a href=\"https://www.skd.museum\">Gemäldegalerie Alte Meister, SKD</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Since 1979, art historians have known that Johannes Vermeer's <em>Girl Reading a Letter at an Open Window</em> (circa 1657-1659) featured an <a href=\"https://en.wikipedia.org/wiki/Overpainting\">overpainted</a> figure of a Cupid in the background. Most assumed Vermeer himself had painted over the figure. Now, thanks to a major restoration by the <a href=\"https://www.artnews.com/t/staatliche-kunstsammlungen-dresden/\">Staatliche Kunstsammlungen Dresden</a> in Germany, the overpainting has a been removed to reveal the Cupid. That process also revealed that someone else painted over the Cupid in the 18th century, after the artist's death, causing a <a href=\"https://bigthink.com/high-culture/found-hidden-painting-johannes-vermeer/\">rethinking of how</a> the painting should be interpreted. The fully restored canvas is now on view to the public for the first time at the Gemäldegalerie Alte Meister, one of many galleries that form the Staatliche Kunstsammlungen Dresden.</p>\n<p>The use of various X-ray imaging techniques—especially synchrotron radiation—has become a powerful tool for the nondestructive analysis of great works of art. For instance, <a href=\"https://blogs.scientificamerican.com/cocktail-party-physics/x-rays-reveal-what-lies-beneath/#googDisableSync\">European scientists in 2008</a> used <a href=\"https://www.theguardian.com/artanddesign/2008/jul/31/2\">synchrotron radiation to reconstruct</a> the hidden portrait of a peasant woman painted by <a href=\"http://en.wikipedia.org/wiki/Vincent_van_Gogh\">Vincent van Gogh</a>. The artist (known for reusing his canvases) had painted over it when he created 1887's <em>Patch of Grass</em>. The synchrotron radiation excites the atoms on the canvas, which then emit X-rays of their own that can be picked up by a fluorescence detector. Each element in the painting has its own X-ray signature, so scientists can identify the distribution of each in the many layers of paint.</p>\n<p>In 2019, <a href=\"https://arstechnica.com/science/2019/02/scientists-solve-the-mystery-of-rembrandts-impasto-paint-recipe/\">we reported</a> on the work of a team of Dutch and French scientists who used high-energy X-rays <a href=\"https://arstechnica.com/science/2019/02/scientists-solve-the-mystery-of-rembrandts-impasto-paint-recipe/\">to unlock</a> Rembrandt's secret recipe for his famous <em>impasto</em> technique, believed to be lost to history. And in 2020, an international team of scientists <a href=\"https://arstechnica.com/science/2020/05/x-rays-reveal-the-key-to-preserving-edvard-munchs-the-scream/\">used synchrotron radiation</a> to determine the cause of alarming signs of degradation to Edvard Munch's famous painting <em>The Scream</em>. <a href=\"https://advances.sciencemag.org/content/6/20/eaay3514\">The team's analysis</a> revealed that the damage is not the result of exposure to light, but humidity—specifically, from the breath of museum visitors, perhaps as they lean in to take a closer look at the master's brushstrokes.</p></div><p><a href=\"https://arstechnica.com/?p=1791079#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791079&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b06df80fc7146554f62fe15f7d36b101c744dd39b3598487477c8bd4d94c172c","category":"Tech"}