{"title":"Resveratrol protects mesangial cells under high glucose by regulating the miR‐1231/IGF1/ERK pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24103?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Diabetic nephropathy (DN) is one of the complications of diabetes mellitus and the main cause of end-stage renal disease (ESRD), which is a serious threat to human health. In DN, mesangial cells (MCs) are a critical target cell that perform a variety of key functions, and abnormal proliferation of MCs is a common and prominent pathological change in DN. In recent years, the investigation of Chinese medicine interventions for DN has increased significantly in recent years due to the many potential adverse effects and controversies associated with the treatment of DN with Western medicines. In this study, we evaluated the protective effect of resveratrol (RES), an active ingredient known as a natural antioxidant, on HMCs under high glucose and explored its possible mechanism of action. We found that RES inhibited the proliferation of human mesangial cell (HMC) under high glucose and blocked cell cycle progression. In the high glucose environment, RES upregulated miR-1231, reduced IGF1 expression, inhibited the activity of the extracellular signal-regulated kinase (ERK) signaling pathway and reduced levels of the inflammatory factors TNF-α and IL-6. In addition, we found that miR-1231 mimics were synergistically inhibited with RES, whereas miR-1231 inhibitor attenuated the protective effect of RES on HMCs. Thus, our results suggest that the protective effect of RES on HMCs under high glucose is achieved, at least in part, through modulation of the miR-1231/IGF1/ERK pathway. The discovery of this potential mechanism may provide a new molecular therapeutic target for the prevention and treatment of DN, and may also bring new ideas for the clinical research in DN.</p>","author":"Ming Zhang, \nYingli Jin, \nXuerui Guo, \nWanxin Shan, \nJinlong Zhang, \nAoxue Yuan, \nYan Shi","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"b0701909cd50354e999f6de8b94fe4310b168db1e061026ea2701e1e87ebb4d9","category":"Environment"}