{"title":"Current Advances in Radioactive Iodine Refractory Differentiated Thyroid Cancer","link":"https://www.preprints.org/manuscript/202406.1075/v1","date":1718606052000,"content":"Background: Differentiated thyroid cancer (DTC) patients have an outstanding overall long-term survival rate, certain subsets of DTC patients have a very high likelihood of disease recurrence. Radioactive iodine therapy is a cornerstone in DTC management, but sometimes it became useless when cancer cells develop refractoriness. Radioactive Iodine Refractory DTC (RAIR-DTC) is a condition defined by ATA 2015 guidelines when DTC cannot concentrate RAI ab initio or loses RAI uptake ability after the initial therapy. RAIR condition implies that RAI cannot reveal new met-astatic foci, so RAIR-DTC metabolic imaging needs new tracers. 18F-FDG PET/CT has been widely used, it has a demonstrated prognostic value, but 18F-FDG DTC avidity may remain low. FA-Pi, PSMA, SSTR tracers have been proposed as theragnostic agents in experimental settings and Arg-Gly-Asp (RGD) peptides in diagnostic trial field. Multi-targeted tyrosine kinase inhibitors are relatively new drugs approved in RAIR-DTC therapy. Despite the promising targeted setting, they relate to frequent adverse event onset. Sorafenib and trametinib have been included in re-differentiation protocols aimed to re-induce RAI accumulation in DTC cells. Results appeared promising, despite not excellent. Conclusions: RAIR-DTC yet represent a challenging nosological entity. There are still controversies on RAIR-DTC definition and post-RAI therapy evaluation with post-therapy whole body scan (PT-WBS) is the only validated criterion of response. The recent introduction of multiple diagnostic and therapeutic agents oblige physicians to pursue a multidisciplinary approach aiming to correct drug introduction and timing choice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b074248284c732eafeafe5d1c7beac3cc30b4828959764d655d881d45d59c993","category":"Interdisciplinary"}