{"title":"Uncertainty in tuberculosis clinical decision-making: An umbrella review with systematic methods and thematic analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003429","date":1721743200000,"content":"<p>by Francesca Wanda Basile, Sedona Sweeney, Maninder Pal Singh, Else Margreet Bijker, Ted Cohen, Nicolas A. Menzies, Anna Vassall, Pitchaya Indravudh</p>\r\n\r\nTuberculosis is a major infectious disease worldwide, but currently available diagnostics have suboptimal accuracy, particularly in patients unable to expectorate, and are often unavailable at the point-of-care in resource-limited settings. Test/treatment decision are, therefore, often made on clinical grounds. We hypothesized that contextual factors beyond disease probability may influence clinical decisions about when to test and when to treat for tuberculosis. This umbrella review aimed to identify such factors, and to develop a framework for uncertainty in tuberculosis clinical decision-making. Systematic reviews were searched in seven databases (MEDLINE, CINAHL Complete, Embase, Scopus, Cochrane, PROSPERO, Epistemonikos) using predetermined search criteria. Findings were classified as barriers and facilitators for testing or treatment decisions, and thematically analysed based on a multi-level model of uncertainty in health care. We included 27 reviews. Study designs and primary aims were heterogeneous, with seven meta-analyses and three qualitative evidence syntheses. Facilitators for decisions to test included providers’ advanced professional qualification and confidence in tests results, availability of automated diagnostics with quick turnaround times. Common barriers for requesting a diagnostic test included: poor provider tuberculosis knowledge, fear of acquiring tuberculosis through respiratory sampling, scarcity of healthcare resources, and complexity of specimen collection. Facilitators for empiric treatment included patients’ young age, severe sickness, and test inaccessibility. Main barriers to treatment included communication obstacles, providers’ high confidence in negative test results (irrespective of negative predictive value). Multiple sources of uncertainty were identified at the patient, provider, diagnostic test, and healthcare system levels. Complex determinants of uncertainty influenced decision-making. This could result in delayed or missed diagnosis and treatment opportunities. It is important to understand the variability associated with patient-provider clinical encounters and healthcare settings, clinicians’ attitudes, and experiences, as well as diagnostic test characteristics, to improve clinical practices, and allow an impactful introduction of novel diagnostics.","author":"Francesca Wanda Basile","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"b07713830de62940f8edc68f34f9b0997f802b20aa39b098a2866bde29280ef7","category":"Environment"}