{"title":"Development of a prognostic risk score to predict early mortality in incident elderly Japanese hemodialysis patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302101","date":1712844000000,"content":"<p>by Hirokazu Okada, Atsushi Ono, Koji Tomori, Tsutomu Inoue, Norio Hanafusa, Ken Sakai, Ichiei Narita, Toshiki Moriyama, Yoshitaka Isaka, Kei Fukami, Seiji Itano, Eiichiro Kanda, Naoki Kashihara</p>\r\nBackground <p>Information of short-term prognosis after hemodialysis (HD) introduction is important for elderly patients with chronic kidney disease (CKD) and their families choosing a modality of renal replacement therapy. Therefore, we developed a risk score to predict early mortality in incident elderly Japanese hemodialysis patients.</p> Materials and methods <p>We analyzed data of incident elderly HD patients from a nationwide cohort study of the Japanese Society for Dialysis Therapy Renal Data Registry (JRDR) to develop a prognostic risk score. Candidate risk factors for early death within 1 year was evaluated using multivariate logistic regression analysis. The risk score was developed by summing up points derived from parameter estimate values of independent risk factors. The association between risk score and early death was tested using Cox proportional hazards models. This risk score was validated twice by using an internal validation cohort derived from the JRDR and an external validation cohort collected for this study.</p> Results <p>Using the development cohort (n = 2,000), nine risk factors were retained in the risk score: older age (&gt;85), yes = 2, no = 0; sex, male = 2, female = 0; lower body mass index (&lt;20), yes = 2, no = 0; cancer, yes = 1, no = 0; dementia, yes = 3, no = 0; lower creatinine (&lt;6.5 mg/dL), yes = 1, no = 0; lower albumin (&lt;3.0 g/dL), yes = 3, no = 0; normal or high calcium (≥8.5 mg/dL), yes = 1, no = 0; and higher C reactive protein (&gt;2.0 mg/dL), yes = 2, no = 0. In the internal and external validation cohorts (n = 739, 140, respectively), the medium- and high-risk groups (total score, 6 to 10 and 11 or more, respectively) showed significantly higher risk of early death than the low-risk group (total score, 0 to 5) (p&lt;0.001).</p> Conclusion <p>We developed a prognostic risk score predicting early death within 1 year in incident elderly Japanese HD patients, which may help detect elderly patients with a high-risk of early death after HD introduction.</p>","author":"Hirokazu Okada","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b08de0048aebbdc00d7d28be2158dec350f973f7eae11338526c732e85095a33","category":"Interdisciplinary"}