{"title":"The iPhone 15 might not arrive until October–and be hard to find","link":"https://www.macworld.com/article/2001923/iphone-15-release-delayed-october-2023.html","date":1689951373000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While we’re busy collecting exciting iPhone 15 rumors ahead of the expected launch this September, we read some news today you might not like. According to an analyst at Bank of America, the iPhone 15 will arrive a little late this year. And due to issues with the new displays, it may be harder than usual to find one to buy.</p>\n\n\n\n<p>Wamsi Mohan, a global securities analyst at Bank of America, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/07/20/iphone-15-delay/&amp;xcust=1-1-2001923-1-0-0&amp;sref=https://www.macworld.com/feed\">claims in an investors note</a> that the iPhone 15 won’t launch until the fourth quarter, which begins October 1. Mohan says that Apple’s usual supply chain checks indicate that production is running a “few weeks” behind schedule, and the launch could slip into the fourth quarter.</p>\n\n\n\n<p>Mohan was among the people to predict back in early 2020 that <a href=\"https://www.macworld.com/article/674725/apple-confirms-delay-to-iphone-12-release.html\">the iPhone 12 would be delayed</a> due to the impact of Covid-19 and was correct. That year, the iPhone 12 and 12 Pro shipped on October 23 and the iPhone 12 mini and 12 Pro Max didn’t arrive until November.</p>\n\n\n\n<p>The reason for the delay is unclear, though <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theinformation.com/articles/apple-struggling-with-manufacturing-larger-screen-for-iphone-15-pros&amp;xcust=1-1-2001923-1-0-0&amp;sref=https://www.macworld.com/feed\">a report in The Information</a> claims that the Phone 15 Pro and Pro Max will be constrained due to production issues stemming from the phones’ skinny bezels. The publication reports that LG is struggling to product the displays under the new manufacturing process. Even if they arrive on time, The Information says that the phones will be constrained at launch.</p>\n\n\n\n<p>Another possibility for the delay is the <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-cpu-gpu-ram.html\">A17 processor</a>. Apple is reportedly shifting to a new 3nm process for the Pro chip, and manufacturer TSMC has been slow to ramp production due to technical hurdles. The delay could also be related to any number of other issues, including displays, batteries, and design. Mohan doesn’t say whether all the iPhone 15 models would be delayed or just the Pro or Plus versions.</p>\n\n\n\n<p>It’s also not clear whether Apple will delay the iPhone event, which is expected to be held in early September, or just the ship date. Apple traditionally ships the new iPhone a week and a half after the announcement, but it’s not uncommon for there to be delays. For example, the iPhone 14 Plus didn’t ship until October 7.</p>\n\n\n\n<p>We’re expecting a number of upgrades in the iPhone 15, including an expansion of the Dynamic Island to the non-Pro models, a better zoom camera in the Pro Max, and longer battery life. Follow along with our <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 roundup</a> for all of the latest news.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b08eafd4ea77836640e8806b9d5601c2453102c919d6c4ea5efdd4d97b213165","category":"Apple"}