{"title":"128 Bromoform metabolites from Asparagopsis taxiformis: Formation and impact on in vitro rumen fermentation parameters and microbial composition dynamics","link":"https://academic.oup.com/jas/article/102/Supplement_3/340/7757074?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The aim of the experiment was to study the formation and impact of bromoform metabolites from <span>Asparagopsis taxiformis</span> on in vitro rumen fermentation parameters and microbial composition over time. Rumen fluid from three rumen fistulated lactating Holstein-Friesian dairy cows was collected and after buffering used as inoculum. Cows were fed a total mixed ration of grass silage, corn silage and concentrate. In total 0.5 g dry matter (DM) of substrate was incubated, consisting of either 0.3 g DM grass silage and 0.2 g DM corn silage (Control) or 0.295 g DM grass silage, 0.195 g DM corn silage and 0.01 g DM <span>A. taxiformis</span> (ASP). Substrates were incubated for 72 h. Total gas production (TGP) was measured continuously and methane (CH<sub>4</sub>) at 0, 1, 2, 4, 8, 12, 24, 36, 48, 60 and 72 h. After 72 h, volatile fatty acids (VFA), ammonia (NH<sub>3</sub>), and pH were determined. Substrates (Table 1) and contents of additional bottles at specific timepoints were analyzed for bromoform (CHBr<sub>3</sub>), dibromomethane (CH<sub>2</sub>Br<sub>2</sub>), bromomethane (CH<sub>3</sub>Br), dibromochloromethane (CHBr<sub>2</sub>Cl), arsenic (As), bromine (Br) and iodine (I). RNA was isolated and sequenced with specific primers for bacteria, archaea and protozoa. Data were averaged per inoculum and analyzed with an ANOVA to test for differences between treatments. Preliminary results revealed no difference between Control and ASP in TGP (mL/g organic matter; OM) after 72 h (<span>P</span> = 0.102), whereas CH<sub>4</sub> (mL/g OM) was 78% less in ASP than in Control (<span>P</span> = 0.005). Total VFA (tVFA) did not differ between Control and ASP (<span>P</span> = 0.435). Acetate (% tVFA) was lower in ASP (49.2 vs 56.6; <span>P</span> = 0.011), and branched VFA (% tVFA) greater in ASP than in Control (5.8 vs 3.8; <span>P</span> = 0.001). At 72 h, NH<sub>3</sub> (mg/L) and pH did not differ between ASP and Control (<span>P</span> = 0.183 and 0.519, respectively). After 1 h of incubation CHBr<sub>3</sub> concentration was 118 ng/mL, rapidly decreasing below detection limit by 8 h of incubation. At 1 h of incubation CH<sub>2</sub>Br<sub>2</sub> concentration was 22 ng/mL, reaching 40 ng/mL at 4 h of incubation and remained relatively stable thereafter. At any timepoint, CH<sub>3</sub>Br concentration was below detection limit. At 12 h of incubation CHBr<sub>2</sub>Cl concentration was 3.7 ng/mL and remained relatively stable. Mineral concentrations (As, I, Br) were constant throughout incubation. Addition of 2% DM <span>A. taxiformis</span> effectively reduced CH<sub>4</sub> production without negative effects on TGP and tVFA in vitro. While CHBr<sub>3</sub> disappeared quickly and CH<sub>2</sub>Br<sub>2</sub> concentration increased, substantial formation of CH<sub>3</sub>Br in hydrogenation reactions by methanogens seemed absent. Levels of Br did not change, suggesting no substantial Br vaporization through secondary metabolites. Microbial composition data are pending analyses and will be presented at the symposium.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b09b484a88ebb44fb674c4b53e6d9053bcd76fff2646b1164145dd940d4320a3","category":"Environment"}