{"title":"Researchers demonstrate complete solar-powered hydrocarbon production","link":"https://arstechnica.com/?p=1810057","date":1635969037000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/A-photo-of-the-solar-fuel-system.image-jpeg-800x450.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/A-photo-of-the-solar-fuel-system.image-jpeg.jpeg\">Enlarge</a> <span>/</span> Either of two reaction chambers (bottom) can be targeted by concentrated sunlight. (credit: ETH Zurich)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Carbon capture. Hydrogen production. Synthetic fuels. All of these technologies have been proposed as potential resources for dealing with the crises created by our carbon dioxide emissions. While they have worked in small pilot demonstrations, most of them haven't demonstrated that they can scale to provide the economical solutions we need.</p>\n<p>In the meantime, a group of European researchers sees the methods as part of a single coherent production platform, one that goes from sunlight and air to kerosene. Thanks to a small installation on the roof of a lab in Zurich, the team has been producing small amounts of different fuels using some mirrors and a handful of reaction chambers. While the full production process would also need to demonstrate that it can scale, the researchers calculate that the platform could fuel the entire commercial aircraft industry using a small fraction of the land in the Sahara.</p>\n<h2>The process</h2>\n<p>There are only three steps involved in the process of turning air into fuels. The first is separating out the raw ingredients, specifically carbon dioxide and water. This is done using a small commercial unit from a spinoff of ETH Zurich; the device uses a heating/cooling cycle and amines that absorb both CO<sub>2</sub> and H<sub>2</sub>O at environmental temperatures, releasing them when they are heated. Critically, the supplied water is highly pure and doesn't compete with the many other uses we have for clean water.</p></div><p><a href=\"https://arstechnica.com/?p=1810057#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1810057&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b0a30db5dbd4017da9d760d45f68441e6f759a0b1bba3c322ff226c9577629c6","category":"Tech"}