{"title":"Here’s how much Hyundai’s cool, new Ioniq 5 EV will cost","link":"https://arstechnica.com/?p=1820124","date":1639429256000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Hyundai-Ioniq-5-1-800x600.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Hyundai-Ioniq-5-1.jpg\">Enlarge</a> <span>/</span> A slightly grimy Hyundai Ioniq 5 on an unusually wet and gray day in Southern California.  (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The car I've been most excited about in 2021 is <a href=\"https://arstechnica.com/cars/2021/02/this-crisp-looking-crossover-is-hyundais-next-ev-the-ioniq-5/\">the Hyundai Ioniq 5</a>. The Korean automaker has impressed with each new model we've tried, and its smaller electric vehicles are some of the few that can rival Tesla in terms of range efficiency.</p>\n<p>The Ioniq 5 is the first product from Hyundai Motor Group—which includes Kia and Genesis—to use the new 800 V E-GMP platform, which was designed from the ground up to produce pure battery EVs. I spent a day driving one last week, but I can't say more about that until later this week. What I can tell you, now that Hyundai has finalized pricing, is how much the Ioniq 5 will cost.</p>\n<p>The cheapest way to get an Ioniq 5 will be the 125 kW (168 hp) rear-wheel drive SE Standard Range model with the smaller 58 kWh battery pack. This will cost $39,700 before the IRS 30D tax credit and any local incentives. However, as is nearly always the case with a new car regardless of OEM, if you want the cheapest one, you need to be prepared to wait, as it will only become available in spring 2022. (That is still an improvement over Hyundai's <a href=\"https://arstechnica.com/cars/2021/05/hyundai-reveals-us-specs-for-ioniq-5-electric-crossover/\">original plan of not bringing the car to the US at all</a>.)</p></div><p><a href=\"https://arstechnica.com/?p=1820124#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820124&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b0a43807c117a2d4aeec1c0382af94554efd122708ff9270c37c5dbe9b9ee2c0","category":"Tech"}