{"title":"Pro race history: Jacques Anquetil, King of the Nations","link":"https://www.cyclist.co.uk/in-depth/jacques-anquetil-grand-prix-des-nations","date":1702484581000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/jacques-anquetil-grand-prix-des-nations\">Pro race history: Jacques Anquetil, King of the Nations</a></p>\n\n<p>‘Monsieur Chrono’ they called him. Or Maître Jacques. Utterly dominant when riding alone against the clock, Jacques Anquetil was his era’s time-trial king, often catching riders who had been sent on their way minutes before and with the <em>Arrivée</em> banner still nowhere to be seen. A passage from Paul Fournel’s book <em>Anquetil, Alone</em>, describing a scene from a 68km time-trial between Bourgoin and Lyons during the 1962 Tour de France, encapsulates perfectly the demoralising effect this must have had on his rivals.</p>\n\n\n\n<p>‘Raymond Poulidor, who set off three minutes before Anquetil, is about to be caught,’ Fournel writes. ‘His trainer Antonin Magne ignores the regulations and pulls alongside him. Instead of shouting at him he simply says, “Move over Raymond, and watch the Caravel as it sails by.” And the two men watch the Caravel go by. “I couldn’t see him pedalling,” Poulidor confirms. “He was gliding along.”’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tom-simpson-bordeaux-paris-1963\">Pro race history: Tom Simpson wins Bordeaux-Paris in 1963</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/il-lombardia-history\">Remembering the first Il Lombardia in 1905</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/diot-paris-brest-paris-1951\">Race history: Diot outsprints Muller to claim Paris-Brest-Paris in 1951</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>Nowhere was Anquetil’s supremacy against the clock demonstrated more than in the Grand Prix des Nations, a race the seeds of which had been sown back in 1931. That year the Road Race World Championship, still in its infancy, had been held as a 172km time-trial rather than a mass-start race. Reporting on the event in Copenhagen were two writers from <em>Paris-Soir</em>, a newspaper looking to introduce a new race to help boost circulation.</p>\n\n\n\n<p>After watching Italian Learco Guerra win the rainbow jersey by more than four minutes, the idea of a long time-trial in early autumn began to take hold. And so it was that a little more than 12 months later, 25 riders assembled for cycling’s newest event: a 142km time-trial, from Versailles to the Buffalo Stadium on the southern reaches of Paris, called the Grand Prix des Nations.</p>\n\n\n\n<h2>You’ve seen nothing yet</h2>\n\n\n\n<p>That first race, won by France’s Maurice Archambaud by more than six minutes, was claimed by <em>Paris-Soir</em> to be an unprecedented success, with hundreds of thousands of fans flocking to the roadsides. The race would quickly grow in popularity and would go on to be considered the unofficial time-trial world championship.</p>\n\n\n\n<p>Anquetil’s first appearance at the race came in 1953, having attracted the interest of Francis Pélissier, head of the La Perle team. Pélissier had been scouring race reports looking for France’s next big champion and in Anquetil – talented, enigmatic and good-looking – he thought he might have found his man.</p>\n\n\n\n<p>When a 19-year-old Anquetil destroyed the field during a time-trial organised by the <em>Paris–Normandie</em> newspaper in August 1953, winning by nearly nine minutes to claim the paper’s season-long <em>maillot des as</em> (ace jersey), Pélissier was convinced. Earlier that year <em>Paris–Normandie</em> had run a cartoon of a young Anquetil under the headline ‘Jacques Anquetil – the young French Coppi’. Early hype though that may have been, Pélissier now knew that Anquetil was the real deal and he promptly snapped him up.</p>\n\n\n\n<p>And so on Sunday 27th September 1953, Anquetil entered the Grand Prix des Nations for the first time. Twenty-one editions of the race had been held and some greats of the sport already graced the race’s palmarès. In Paul Howard’s biography, <em>Sex, Lies and Handlebar Tape</em>, we learn that the young Anquetil was uncharacteristically nervous the night before.</p>\n\n\n\n<p>‘I couldn’t stop thinking about it,’ Anquetil is quoted as later writing. ‘Although by nature relaxed, I couldn’t get to sleep. I reread the list of winners: Archambaud, Magne, Coppi, Koblet, Bobet… I tried to reassure myself, to rid myself of a curious feeling of fear.’</p>\n\n\n<div>\n<figure><a href=\"https://store.cyclist.co.uk/subscriptions\" target=\"_blank\"><img width=\"970\" height=\"343\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1536x543.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-2048x724.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-750x265.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1140x403.jpg 1140w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>Pélissier, meanwhile, seemingly had no such concerns: ‘Winning a race with somebody like Coppi is child’s play,’ he said. ‘This time I’m going to make a kid win the Grand Prix des Nations.’</p>\n\n\n\n<p>What happened that day stunned the cycling world. It was overcast and windy and Anquetil later recounted that ‘on the start line, I watched the wind blow the spectators’ hair on end like in the horror movies’. Still, he had prepared well, riding the course several times in the weeks before, and when the flag dropped he quickly set about his work.</p>\n\n\n\n<p>Despite an early puncture he was soon posting the best times at the checkpoints along the way. By the time he crossed the finish line he was nearly seven minutes up on the second-placed rider. French cycling writer Pierre Chany wrote, ‘We truly did not know Jacques Anquetil before we had seen him on the slopes of Saint-Rémy-lès-Chevreuse or of Châteaufort. In this sector he massacred all of his rivals.’</p>\n\n\n\n<p>Later Anquetil would stand on <em>Paris-Normandie</em>’s balcony in Rouen while below the public hailed their new champion. The sports journal <em>Le Miroir Sprint</em> put him on the cover, celebrating a moment dubbed Anquetil’s first <em>coup d’éclat</em>. For Jacques Goddet meanwhile, writing in <em>L’Équipe</em>, it was the moment a ‘Child Champion was born’.</p>\n\n\n\n<p>Between 1953 and 1966 Anquetil would win all nine editions of the event that he entered – a record haul. In 1965 he took his penultimate victory after a three-year absence at a reported staggering 46.843kmh over the near-74km long course.</p>\n\n\n\n<p>‘Anquetil, in superb form, rode at the pace of the Hour record,’ ran <em>L’Équipe</em>’s headline.</p>\n\n\n\n<p>Anquetil is often quoted as once saying that to prepare for a race there ‘is nothing better than a good pheasant, some champagne and a woman’, but the Grand Prix des Nations was a unique test and, in the weeks before the race, Anquetil would spend hour after hour riding behind the moped of the man who was his first trainer – André Boucher. This was a rider who, according to Paul Fournel, ‘knew how to suffer more than anyone else’.</p>\n\n\n\n<p>‘Sometimes it was terrible,’ Fournel quotes Anquetil. ‘I pedalled to the limits of my strength in training; I learned to pace my efforts in the second half of the race, and to go flat out at the end without running the risk of cracking.’ </p>\n\n\n\n<p>Back on that September day in 1953 when Anquetil exploded onto the scene, Pierre Chany described Pélissier watching on as admirers crowded around his rider at the finish line. Chany writes that, with a cigarette dangling from the corner of his mouth, Pélissier murmured, ‘You have not seen anything yet. It is just beginning.’ Regardless of whether those words really fell from Pélissier’s lips, a truer statement has never been uttered.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/jacques-anquetil-grand-prix-des-nations\">Pro race history: Jacques Anquetil, King of the Nations</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"b0a9d1b5c4e160d57f0517daffcb9163fcf36e866931562cd0e9adb8074da3de","category":"Cycling"}