{"title":"Evaluating Public Library Services Through User-Generated Content: Social Network Analysis of Google Maps Reviews","link":"https://www.preprints.org/manuscript/202405.0619/v1","date":1715340023000,"content":"This study explores the public library service evaluation domain through user-generated content on Google Maps, highlighting digital feedback's significant yet underexplored potential in understanding public library patronage across Taiwan's six major cities. Utilizing a mixed-methods research design, this study integrates Google Maps review content analysis with Social Network Analysis to delineate public perceptions and identify areas for service enhancement in public libraries. It innovatively leverages personal experiences extracted from over 60,000 Google Maps reviews to evaluate public library services in cities such as Taipei, New Taipei, Taoyuan, Taichung, Tainan, and Kaohsiung. The research taps into the National Library of Taiwan's National Library Statistics System to provide a robust analysis of library performance and user satisfaction, offering a novel perspective by emphasizing user-centric feedback from Google Maps as a primary data source. This approach provides quantitative data on library usage and geographic distribution and enriches our understanding of the qualitative experiences of library users. In analyzing the keywords from Google Maps reviews of public libraries, we categorize and interpret these under the three core LibQUAL+ dimensions—Affect of Service, Information Control, and Library as Place. The findings expose variances in perceived service quality among the cities, with Kaohsiung and Taichung receiving the highest accolades for service satisfaction. Simultaneously, the study identifies potential areas for improvement, particularly in cities with lower satisfaction ratings like Taipei. This personalized feedback illustrates the intimate relationship between public libraries and their communities, offering invaluable insights for policymakers and library management to enhance service delivery and user experience.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b0ac92e61e932de2597c29b17044ca45f765729ba3611e28a0662b80617cb6ee","category":"Interdisciplinary"}