{"title":"COROS Rolls Out Strava Routes Sync","link":"https://www.dcrainmaker.com/2021/10/coros-rolls-out-strava-routes-sync.html","date":1634196787000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/COROS-Strava-Routes.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/COROS-Strava-Routes_thumb.jpg\" /></a></p>\n<p>When COROS announced their maps-laden Vertix 2 this past summer, one of the biggest criticisms from virtually every reviewer was that getting planned navigational routes onto the unit was cumbersome and time-consuming (at best). That was because it required you to do a manual exporting of .GPX or .FIT files from other 3rd party routing platforms, and then a two-step tango getting them into the COROS app.</p>\n<p>But as of today, the company has taken the first step in eliminating that overhead, by enabling Strava Routes Sync. This means that when you create a new route in Strava, it’ll get halfway to your watch. You’ll still need to open up the COROS App and then manually toggle the route to end up on your watch, but this gets you pretty close.</p>\n<p>Note that this is available for the following watches, with the latest version of the COROS App (<strong>get that updated first</strong>!):</p>\n<p>– COROS Vertix 2<br />\n– COROS Vertix 1<br />\n– COROS APEX Pro<br />\n– COROS APEX</p>\n<p>It is not available on the COROS Pace 1 or Pace 2, as neither of those support routes navigation. Let’s dive into how it works.</p>\n<h3><span>Getting it setup:</span></h3>\n<p>The entire process is super easy, and somewhat similar to what you do on other platforms. However, you do need to re-authenticate with Strava again (just once), as COROS is now leveraging extended bits (the Routes), so they have to get your permission for that. When you open up the <strong>*updated app* </strong>for the first time, it’ll actually ask you to do this. Or, if you’ve never connected Strava to the COROS app before, then it’ll just do it automatically when you do that.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image00112.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image00112_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image00114.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image00114_thumb.png\" /></a></p>\n<p>That takes approximately 1.8 seconds, or 2.3 seconds if you haven’t had your coffee yet. 5.8 seconds if you’re still on dial-up. And 2 minutes if you’re taking screenshots and get distracted halfway through.</p>\n<p>From there, jump into Strava like normal. That could be either desktop website or mobile app, doesn’t matter. Go about creating a new route, or, favoriting a new route. In my case I’ll go ahead and create a route for today’s run on Strava, using either the desktop site or the mobile app:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-24.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-24.png\" /></a></p>\n<p>Ensure that the Favorite star is selected, which tells Strava to push it to 3rd party apps/partners, you’ll see that confirmed again when you tap to save it to your routes:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-25.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-25.png\" /></a></p>\n<p>Now zip back over to the COROS app, and within that, tap the third tab that looks like a badge, and down to ‘Navigation Routes Library’. This is where all your routes are, including your previous COROS app routes, but now *ALL* of your Strava routes (to my surprise, it pulled everything in, which…umm…is a lot of routes over the years). In any case, here they are – including my October Lunch Runaround one:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image001-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image001_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image0016-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image0016_thumb-1.png\" /></a></p>\n<p>From there you’ll tap to sync it to the watch. This is the bit that takes the human touch, as it won’t automatically sync to the watch. Right now COROS watches only allow 10 stored routes on them. The syncing of routes only takes a few seconds.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image0018.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image0018_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/10/clip_image00110.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/clip_image00110_thumb.png\" /></a></p>\n<p>Obviously, in an ideal world, there’d be no reason to do this step. If I’ve flagged a new route in Strava, it should show up. That’s kinda the point of flagging a route in Strava, to show up. On most other platforms, the route will automatically sync end to end from Strava to watch, without any user intervention. Hopefully this is something COROS can do going forward.</p>\n<p>In any case, back on the watch, you can crack open the navigation like normal:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/DSC_6467.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/DSC_6467_thumb.jpg\" /></a></p>\n<p>And you’ll also get the elevation profile from Strava too, in this case, with the pancake like elevation that is my home:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/DSC_6468.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/DSC_6468_thumb.jpg\" /></a></p>\n<p>Now in my testing, all of this worked mostly fine. Two minor caveats to be aware of:</p>\n<p><strong>A) As noted earlier, it synced in *ALL* of my routes.</strong> That’s officially a crap-ton of routes for me. Though, the COROS app does at least allow you to sort by the distance. It also allows you to sort by date created, but that seemed a bit inconsistent for me. It does not allow you to sort by route type (cycling or running), it just pulls in everything.</p>\n<p><strong>B) It does not update modified routes. </strong>If you notice up above (a few scrolls/swipes) on my Strava route example, shortly after making that screenshot I realized I screwed up and misplaced one turn, as a result, it did this short out and back that you see at the very bottom of the map. So I went back to the route on Strava and eliminated that. But it didn’t update on the COROS app, despite repeated sync attempts. Even after deleting the route from the COROS app, and toggling the favorite icon on Strava a few times over a number of minutes – nothing happened. Eventually, when I changed the title of the route (temporarily), it then pushed a new version over.</p>\n<p><strong>C) This won’t change any re-routing aspects on the watches themselves.</strong> No COROS watches are capable of re-routing on the fly today. Meaning that just like before, if you go off-route, it’ll just point you back in the compass direction of the route. But it won’t tell you to turn left on Maple Street and Right on Main Street. That’s on you to figure out. I know that’s probably obvious for some, but just wanted to confirm it.</p>\n<p>I’m sure there will be other nuances people discover over time, just like there are other nuances on Wahoo, Garmin, and Hammerhead’s Strava Routes sync capabilities.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/DSC_6469.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/DSC_6469_thumb.jpg\" /></a></p>\n<p>This is in my mind a solid first step for COROS. With the <a href=\"https://www.dcrainmaker.com/2021/08/coros-vertix-2-in-depth-review.html\">Vertix 2 having mapping</a> (and COROS also re-confirming today that Topo maps are coming to the Vertix 1 and APEX Pro as previously announced), getting clean routes and navigation workflow is important. This makes it far easier now, and reduces the hurdles to basic navigation.</p>\n<p>As noted, I’d like to see COROS remove the 10-route limit, as well as remove the requirement to manually toggle/load routes onto the watch. I just want that to ‘simply happen’ automatically as it does on most other platforms. But in the grand scheme of COROS’s software implementations, I’ve gotta imagine those are pretty minor to accomplish.</p>\n<p>Now almost lastly, because I’m not really a mountain climber, but because I know 6 of my readers are, there’s two things of note here:</p>\n<p>A) COROS has implemented a huge slate <a href=\"https://support.coros.com/hc/en-us/articles/4405798535060\">of new Multi-Pitch climbing modes</a>. I can’t even begin to try and explain all these modes, but on paper (literally) it looks really impressive – and not something we’ve seen elsewhere. Their <a href=\"https://support.coros.com/hc/en-us/articles/4405798535060\">support article does a solid job of explaining it all</a>.</p>\n<p>B) Doubling down on that, COROS has created a new hardware accessory, the Vertix 2 Carabiner – basically it’s like a strap for your watch, but built out of a carabiner instead. It’s kinda awesome looking.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/COROS-caribniner.gif\"><img src=\"https://media.dcrainmaker.com/images/2021/10/COROS-caribniner_thumb.gif\" /></a></p>\n<p>Seriously – how is it that COROS manages to make the coolest accessories each time? First there was the <a href=\"https://www.dcrainmaker.com/2021/05/coros-keychain-charger.html\">nifty keyring charger</a>, and now there’s this. Super smart.</p>\n<p>Also, last but not least (ok, it’s least, else realistically, it wouldn’t be last) – the Vertix 2 now gets a shortcut button, where you can customize a shortcut to a given watch function, based on holding the back button.</p>\n<p>Now, finally, with that – my work here is done.</p>\n<p>Thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you're shopping for the COROS Vertix 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Adventure-Frequency-Diamond-Like-Sapphire-TrainingPeaks/dp/B09CLR9V32?dchild=1&amp;keywords=COROS+Vertix+2&amp;qid=1631273288&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f6946f1b5d1b58281fe231b7b41189e6&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/08/COROS-Vertix2-Black-Transparnet.png\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2021/08/coros-vertix-2-in-depth-review.html\" target=\"_blank\">COROS Vertix 2</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Adventure-Frequency-Diamond-Like-Sapphire-TrainingPeaks/dp/B09CLR9V32?dchild=1&amp;keywords=COROS+Vertix+2&amp;qid=1631273288&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f6946f1b5d1b58281fe231b7b41189e6&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$700</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F204384%2Fcoros-vertix-2\"><span>REI</span> <span></span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"b0bc3978d3c15a41cc295542bf382e6296c73158f1a507787246ef5d6fe33d7e","category":"Cycling"}