{"title":"Effect of Environmental Reporting on Firm Value of Listed Manufacturing Companies in Nigeria: Moderating Role of Information Asymmetry","link":"https://www.preprints.org/manuscript/202407.2173/v1","date":1722005565000,"content":"This study investigates the moderating role of information asymmetry in shaping the effect of environmental sustainability reporting on the firm value of listed manufacturing companies in Nigeria. Utilizing an ex-post facto research design, the study draws on a stratified sample of 29 manufacturing firms from a population of 43 listed on the Nigerian Exchange as of December 31, 2022. Spanning from 2007 to 2022, the study collects secondary data from annual reports, Nigerian All Share Index reports, meristem securities and register platform Admin platform and sustainability reports. Employing descriptive and inferential statistics, along with multiple regression techniques, the analysis considers Firm value as the dependent variable, Environmental sustainability reporting as independent variables, Information asymmetry (IA) as the moderating variable and Equity ratio, Return on asset and Leverage as control variables. Results indicate that information asymmetry shows a negative and significant effect on the relationship between environmental sustainability reporting and firm value. The study concluded that information asymmetry impacts firm value despite environmental disclosure efforts. The study recommends that Nigerian manufacturing companies should engage in comprehensive disclosure practices to enhance transparency and address information asymmetry through adequate stakeholder engagement. The study’s findings emphasized the need for Nigerian policy makers to enhance regulations on environmental sustainability reporting. By implementing stricter disclosure laws and standards, policy can reduce information asymmetry and foster a more transparent business environment. This could attract foreign investment and demonstrate Nigeria’s commitment to sustainable practices. Furthermore, the study also highlights the importance of transparency in maintaining stakeholder trust. Improved disclosure practices can increase public trust in the manufacturing sector, promoting corporate responsibility. This heightened transparency benefits investors and the broader community, ensuring companies are accountable for their environmental impacts, ultimately leading to better environmental stewardship and community welfare.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b0c41ff65ddd9a655d28c194daff93e2c7cad5f3025898c7298cf487a0eb4334","category":"Interdisciplinary"}