{"title":"Differential transcript usage analysis incorporating quantification uncertainty via compositional measurement error regression modeling","link":"https://academic.oup.com/biostatistics/article/25/2/559/7115316?rss=1","date":1681171200000,"content":"<span><div>Summary</div>Differential transcript usage (DTU) occurs when the relative expression of multiple transcripts arising from the same gene changes between different conditions. Existing approaches to detect DTU often rely on computational procedures that can have speed and scalability issues as the number of samples increases. Here we propose a new method, <span>CompDTU</span>, that uses compositional regression to model the relative abundance proportions of each transcript that are of interest in DTU analyses. This procedure leverages fast matrix-based computations that make it ideally suited for DTU analysis with larger sample sizes. This method also allows for the testing of and adjustment for multiple categorical or continuous covariates. Additionally, many existing approaches for DTU ignore quantification uncertainty in the expression estimates for each transcript in RNA-seq data. We extend our <span>CompDTU</span> method to incorporate quantification uncertainty leveraging common output from RNA-seq expression quantification tool in a novel method <span>CompDTUme</span>. Through several power analyses, we show that <span>CompDTU</span> has excellent sensitivity and reduces false positive results relative to existing methods. Additionally, <span>CompDTUme</span> results in further improvements in performance over <span>CompDTU</span> with sufficient sample size for genes with high levels of quantification uncertainty, while also maintaining favorable speed and scalability. We motivate our methods using data from the Cancer Genome Atlas Breast Invasive Carcinoma data set, specifically using RNA-seq data from primary tumors for 740 patients with breast cancer. We show greatly reduced computation time from our new methods as well as the ability to detect several novel genes with significant DTU across different breast cancer subtypes.</span>","author":"","siteTitle":"Biostatistics Current Issue","siteHash":"d3a47065211a18721436d2ad1f713237ccbb15b7790ebb347bb018c26cfcb04f","entryHash":"b0cbf7177d2fc2fe9c3f895f1b499021a9349dd724a0ed780fda190f07bd6aef","category":"Environment"}