{"title":"Effect of spironolactone on survival in patients undergoing maintenance hemodialysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301458","date":1711720800000,"content":"<p>by Seok Hui Kang, Bo Yeon Kim, Eun Jung Son, Gui Ok Kim, Jun Young Do</p>\r\nBackground <p>Previous studies have reported inconsistent results regarding the advantages or disadvantages of spironolactone use in patients undergoing hemodialysis (HD). This study aimed to evaluate survival according to the use of spironolactone in a large sample of patients undergoing maintenance HD.</p> Methods <p>This retrospective study used laboratory and clinical data from the national HD Quality Assessment Program and claims data. The participants of the quality assessment program were patients who had been undergoing maintenance HD for ≥ 3 months, patients undergoing HD at least twice a week. Patients with no spironolactone prescription during the assessment periods were designated as the control group. Patients with one or more prescriptions of spironolactone during the assessment periods were assigned to the SPR group.</p> Results <p>The number of patients in the control and SPR groups were 54,588 and 315, respectively. The 5-year survival rates were 69.1% and 59.1% in the control and SPR groups, respectively (<i>P</i> &lt; 0.001). Cox regression analyses showed that the hazard ratio in the SPR group was 1.34 (<i>P</i> &lt; 0.001) in univariate analysis and 1.13 (<i>P</i> = 0.249) in multivariable analysis. Univariate Cox-regression analysis showed a better patient survival rate in the control group than in the SPR group; however, multivariable analyses showed similar patient survival rates between the two groups.</p> Conclusion <p>This study showed no difference in survival between patients undergoing HD with and without spironolactone use.</p>","author":"Seok Hui Kang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b0dd6c31dcadddc9967e9a06386812c5633e209e2367b1d27582b05d84f91338","category":"Interdisciplinary"}