{"title":"Biogenic silica dynamics in coastal wetland sediments: A key driver of silicon and carbon biogeochemical cycling","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12717?af=R","date":1729648107000,"content":"<h2>Abstract</h2>\n<p>Biogenic silica (biogenic Si) is a bioactive component crucial for the biogeochemical cycling of Si in terrestrial and aquatic ecosystems. Its formation and dissolution dynamics are intricately linked to carbon (C) cycling. However, knowledge about the source, composition, and factors controlling the distribution of biogenic Si in coastal wetland sedimentary environments is still limited. To address this lack of knowledge, we introduced a suite of geometric models for biogenic Si biovolume calculation and investigated biogenic Si assemblages, along with biogenic Si and biogenic Si-occluded C contents, in sediments from representative coastal wetlands along the west coast of Bohai Bay. Our analysis showed that sedimentary biogenic Si predominantly derived from phytoliths (78.1% ± 5.8%), diatoms (18.2% ± 4.8%), and sponge spicules (3.7% ± 2.9%). Notably, phytolith assemblages were primarily composed of forms derived from the Poaceae family. The biogenic Si-occluded C content (0.035–1.870 g kg<sup>−1</sup>) within these wetland sediments was consistent across both sites, accounting for 0.97–5.71% of the total organic C pool. Structural equation modeling indicated that total organic C, pH, and amorphous aluminum oxides either directly or indirectly influenced the biogenic Si content in coastal wetlands sediments. These results demonstrate the critical role that biogenic Si plays in the Si biogeochemical cycle and provide valuable information that advances our understanding of the biogeochemical interactions between Si and C in coastal wetland ecosystems.</p>","author":"Xiangwei Zhao, \nZhaoliang Song, \nYuntao Wu, \nLukas Van Zwieten, \nLaodong Guo, \nChangxun Yu, \nZimin Li, \nLele Wu, \nXiaomin Yang, \nXiangbin Ran, \nJun Sun, \nYuqiu Wei, \nYidong Wang, \nPeng Yuan, \nJianping Zhang, \nXiaole Sun, \nXinxin Zuo, \nTony Vancov, \nCong‐Qiang Liu, \nHailong Wang","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"b0de1e39c87a5ed22acf9ccb44d6e4996f25df509bb0ed87a52feee0e1f7b6d2","category":"Environment"}