{"title":"The highs and lows of Peter Sagan's career","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-highs-and-lows-of-peter-sagans-cycling-career","date":1696248000000,"content":"\n      \n<div>\n<p>Peter Sagan rounded off his glittering road racing career at Tour de Vendée on Sunday, taking one last top-10 finish. He <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/peter-sagan-announced-retirement\">announced at the start of this year at the Vuelta a San Juan</a> that he would be retiring at the end of the season, stepping away from the WorldTour for good and instead focussing on mountain biking as he aims for one last hurrah at the 2024 Olympics in Paris.<span> </span></p>\n<p>Following the recent farewells of similarly heralded greats, Vincenzo Nibali, Alejandro Valverde Philippe Gilbert and Tom Dumoulin, a real changing of the guard is taking place in the men’s peloton, and Sagan, like the others, has struggled to keep up with the pace being set by the new, younger stars of cycling.</p>\n</div>\n<div>\n<p><span>Problems with illnesses have certainly contributed to his dwindling form, but even at full fitness he's been at best an outside favourite in the races he used to dominate, behind the likes of Wout van Aert and Mathieu van der Poel. And is there a clearer tell-tale sign that someone’s getting old than when they start bemoaning the younger generation for ‘lacking respect’, as Sagan did last year? </span></p>\n<p>And while he started his final season off strong with a podium place on stage four of the Vuelta a San Juan, looking set to sign off his career with a stellar season, he only saw the podium one more time at the National Championships in Slovakia. Now, with his final race done, we reflect on his career as a whole, and where exactly he stands in relation to the all-time greats.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-03294.jpg?v=1675088554\" alt /></span><em>Sagan during stage one of the 2022 Tour de France (Image by Zac Williams/SWPix.com)</em></p>\n<p><span>In the straightforward, crude measurement of total career wins, few have bettered him. Sagan has 121 to his name, which, according to ProCyclingStats’ data, puts him 19th on the all-time list, just one win behind Tom Boonen. That’s a huge tally for a rider perhaps more venerated for his consistency of high placings rather than ruthless winning streaks, and someone who early in their career was renowned for runner-up finishes and near misses. It’s easy to forget just how prolific a winner he’s been; in only one season between his second year as a pro in 2011 to 2017 did he manage less than 10 wins. </span></p>\n<p>Still, above all it’s been his consistency that has set the Slovakian apart from arguably every other rider to have preceded him. That’s reflected in his record-breaking total of seven green jersey titles at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a>, a record that looks unlikely to be beaten for a long time, if ever. To return year after year at the same exceptionally high level, never crashing out, getting ill or suffering a slump in form, showed remarkable resilience and commitment. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200905TDF1065-A.S.O._Pauline_Ballet.jpg?v=1675088099\" alt /><em>Sagan at the 2020 Tour de France (Image by ASO/Pauline Ballet via SWPix.com)</em></p>\n<p><span>Even more impressively, he accumulated all of these titles during what was a golden era for great bunch sprinters, yet neither Mark Cavendish, André Greipel or Marcel Kittel ever managed to get anywhere near him. As dominant as they could be in the bunch sprints, there was simply nothing they or anyone else could do to combat Sagan’s astonishing all-round ability and immunity to pressure. </span></p>\n<p><span>As well as green, another jersey became synonymous with Sagan: the rainbow jersey. By winning the World Championships in 2015, 2016 and 2017, he equalled the record of three titles, and became the only rider to do so successively. For three glorious seasons he wore the rainbow jersey, and, far from suffering from its fabled curse, enjoyed the peak years of his career.</span></p>\n<p><span>That first Worlds title in 2015 was a watershed moment in his career. Prior to that result, there were growing concerns that, despite his exceptional talent, he lacked a necessary cutting edge to win the very biggest races. He’d failed to win a Classic that spring, had gone two Tours de France without a stage, and was still yet to win a Monument of any kind. </span></p>\n<p>Such doubts were comprehensively answered during his first season in the rainbow jersey, an <em>annus mirabilis</em> in which he landed that longed-for Monument victory at the Tour of Flanders, won three Tour stages and his fifth consecutive green jersey, and defended his World title. The wins kept coming in 2017 and 2018, including a heroic Paris-Roubaix from a 50km attack that might have been his masterpiece. The wins have dried up since then, but another green jersey title was delivered in 2019 and a first points classification at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> in 2021.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-943382874.jpg?v=1675088934\" alt /><em>Sagan crossing the finish line at the 2018 Paris-Roubaix (Image by Jeff Pachoud/AFP via Getty Images)</em></p>\n<p><span>If there is a criticism that can be levelled at Sagan’s palmarès, it’s that it doesn’t include enough Monument titles. He hasn’t added another since that Paris-Roubaix triumph, keeping his total at two, which pales in comparison to the seven each managed by his predecessors, Fabian Cancellara and Tom Boonen. Like them, he suffered from being a marked man in these races, and never quite managed to figure out a way to overcome the tactical dilemmas this posed. Perhaps that’s why the World Championships, where he was able to fly under the radar as a representative of the relatively modest nation of Slovakia, was his most fruitful one-day race?</span></p>\n<p><span>All this said, anyone who loves cycling will know how there was so much more to Sagan’s greatness than just his results. His technique on the bike was jaw-droppingly good, and he could do just about anything on a bike; not just. Above all, his personality transcended the sport, and he has an infectious sense of fun that makes him easy to love. What with the haircuts, extravagant celebrations, and pop culture pastiche videos, there was never a dull moment.</span></p>\n<p><em>*Cover image by Michael Steele/Getty Images</em></p>\n<div></div>\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b0e4d2ac8b22931fb105dbf2c325ae44ad0ce14b04a835756374be43ead11178","category":"Cycling"}