{"title":"Protective effect of phospholipids in lipoproteins against diabetic kidney disease: A Mendelian randomization analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302485","date":1714572000000,"content":"<p>by Tongyi Li, Liangliang Geng, Yunjiao Yang, Guannan Liu, Haichen Li, Cong Long, Qiu Chen</p>\r\nBackground <p>The etiology of diabetic kidney disease is complex, and the role of lipoproteins and their lipid components in the development of the disease cannot be ignored. However, phospholipids are an essential component, and no Mendelian randomization studies have yet been conducted to examine potential causal associations between phospholipids and diabetic kidney disease.</p> Methods <p>Relevant exposure and outcome datasets were obtained through the GWAS public database. The exposure datasets included various phospholipids, including those in LDL, IDL, VLDL, and HDL. IVW methods were the primary analytical approach. The accuracy of the results was validated by conducting heterogeneity, MR pleiotropy, and F-statistic tests. MR-PRESSO analysis was utilized to identify and exclude outliers.</p> Results <p>Phospholipids in intermediate-density lipoprotein (OR: 0.8439; 95% CI: 0.7268–0.9798), phospholipids in large low- density lipoprotein (OR: 0.7913; 95% CI: 0.6703–0.9341), phospholipids in low- density lipoprotein (after removing outliers, OR: 0.788; 95% CI: 0.6698–0.9271), phospholipids in medium low- density lipoprotein (OR: 0.7682; 95% CI: 0.634–0.931), and phospholipids in small low-density lipoprotein (after removing outliers, OR: 0.8044; 95% CI: 0.6952–0.9309) were found to be protective factors.</p> Conclusions <p>This study found that a higher proportion of phospholipids in intermediate-density lipoprotein and the various subfractions of low-density lipoprotein, including large LDL, medium LDL, and small LDL, is associated with a lower risk of developing diabetic kidney disease.</p>","author":"Tongyi Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b0f25824b668e4674eb776e802d86115b8b74c8dcf6ff018315aa17c88a25558","category":"Interdisciplinary"}