{"title":"Multidrug-Resistant Acinetobacter baumannii: Infection-Related Factors and Predictors of Mortality in a Tertiary Care Teaching Hospital","link":"https://www.preprints.org/manuscript/202407.1748/v1","date":1721650928000,"content":"Background and objectives: Due to resistance and lack of treatment options, hospital-acquired Acinetobacter baumannii (A. baumannii) infections are associated with high mortality. The aim of this study was to identify the characteristics and outcomes of patients with infections caused by multidrug resistant A. baumannii in a tertiary-care teaching hospital and to determine the risk factors for in-hospital mortality. Materials and methods: A retrospective cohort study including 196 patients with A. baumannii strains isolated from different clinical specimens in the Hospital of the Lithuanian University of Health Sciences in 2016, 2017 and 2020, 2021 was conducted. Data on patients’ characteristics, comorbid diseases, treatment, length of hospital and ICU stay, outcome were collected. To determine risk factors for in-hospital mortality, logistic regression analysis was performed. Results: There were 60 (30.6%) women 136 (69.4%) men with a mean age of 61.7 ± 16.6 years (range, 52–74). More than three-fourths (76.5%, n = 150) of the patients had at least one comorbid disease. The highest number of A. baumannii strains were isolated from patients hospitalized in ICUs (43.4%, n = 85). A. baumannii strains producing three types of β-lactamases were more frequently isolated from women than men (77.8 % vs. 22.2%, p = 0.006). Infections caused by A. baumannii strains producing two types of β-lactamases were significantly more often treated with combination therapy than infections caused by strains producing one type of β-lactamase (78.9% vs. 60.0%, p = 0.019). Patients with A. baumannii strains producing two different types of β-lactamases (AmpC plus KPC, AmpC plus ESBL, or ESBL plus KPC) stayed significantly shorter at the ICU compared to patients with A. baumannii strains not producing β-lactamases (median of 9, IQR 2–18, vs. median of 26, IQR 7–38, p = 0.022). Death occurred in 58.7% (n = 115) of patients. Logistic regression analysis showed that combination therapy, length of hospital stay of &lt; 10 days after A. baumannii infection, age of &gt; 58 years, and absence of co-infection were independent predictors of in-hospital mortality. Conclusions: Patients with infection caused by A. baumannii strains producing two different types of β-lactamases were more frequently treated with combination therapy. Mortality of patients with multidrug resistant A. baumannii infection was high, and it was associated with patient’s age, length of hospital stay after the diagnosis of A. baumannii infection, absence of co-infection, and combination treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b1114f9dd1e13f7a85bfaa7ece576bfa5d681e58ca97e387a1d6236914bcc302","category":"Interdisciplinary"}