{"title":"Laser-Induced Decomposition and Mechanical Degradation of CFRP Subjected to a High-Energy Laser with Continuous Wave Power Up to 120 kW","link":"https://www.preprints.org/manuscript/202408.2201/v1","date":1724987334000,"content":"Carbon fiber-reinforced polymer (CFRP), noted for its outstanding properties including high specific strength and superior fatigue resistance, is increasingly employed in aerospace and other demanding applications. This study investigates the interactions between CFRP composites and high-energy lasers (HEL), with continuous wave laser powers reaching up to 120 kW. A novel automated sample exchange system, operated by a robotic arm, minimizes human exposure while enabling a sequence of targeted laser tests. High-speed imaging captures the rapid expansion of a plume consisting of hot gases and dust particles during the experiment. The research significantly advances empirical models by systematically examining the relationship between laser power, perforation times, and ablation rates. It demonstrates scalable predictions for the effects of high-energy laser radiation. Detailed examination of the damaged samples, both visually and via micro-focused computed X-ray tomography, offers insights into heat distribution and ablation dynamics, highlighting the anisotropic thermal properties of CFRP. Compression-after-impact (CAI) tests further assess the residual strength of the irradiated samples, enhancing the understanding of CFRP’s structural integrity post-irradiation. Collectively, these tests improve the knowledge of the thermal and mechanical behavior of CFRP under extreme irradiation conditions. The findings not only contribute to predictive modeling of CFRP's response to laser irradiation but also enhance the scalability of these models to higher laser powers, providing robust tools for predicting material behavior in high-performance settings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b1154e5e16cc551c46047a45668b6246a4f9b2b467632150884f9fdf633414f9","category":"Interdisciplinary"}