{"title":"235 Evaluation of an exogenous fibrolytic enzyme combination in forage-based growing diets fed to growing beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_2/212/7664836?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Crossbred steers [n = 73; 287±19 kg initial body weight (BW)] were used in an 84-d growing study to investigate the effects of feeding an exogenous xylanase and cellulase combination product (EFE) and wheat straw (WS) inclusion level on the growth performance of growing beef cattle. Treatments were arranged as a 2 × 2 factorial with two levels of WS, either 5% (low; LS) or 15% (high; HS) of diet dry matter, and two inclusion rates of exogenous fibrolytic enzymes, 0 (none; N) or 750 g/ton (enzyme; E; Bovizyme CX; Danisco Animal Nutrition and Health; Wilmington, DE) of diet. Body weights and blood samples were collected every 28 d. Individual intake data were collected using an automated feeding system (Insentec Roughage Intake Control, Hokofarm B.V., Marknesse, The Netherland). Average daily gain (ADG), dry matter intake (DMI), gain to feed ratio (G:F), plasma glucose (GLU), plasma non-esterified fatty acids (NEFA), and plasma urea nitrogen (PUN) were analyzed using PROC MIXED (SAS Ins. Inc., Cary, N.C.). Animal was the experimental unit and fixed effects included blocks of body weight (n = 3) and original source of steers (n = 2). The model included the level of WS (LS, HS), level of EFE (N or E), and WS × EFE interactions. There were no WS × EFE interactions (<span>P</span> ≥ 0.31) for all measured traits. Supplementing EFE resulted in no differences (<span>P</span> ≥ 0.16) for ending BW, ADG, DMI, G:F, NEFA, and PUN. However, within HS diet, inclusion of E numerically increased ADG by 0.05 kg/d compared with N (1.29 vs. 1.24 kg/d; HSE vs. HSN, respectively; <span>P</span> &gt; 0.31). Steers consuming E diets tended to have greater GLU compared with N (4.92 vs. 4.80 µmol/L, respectively; <span>P</span> = 0.10). Between levels of straw inclusion, ending BW was greater for steers consuming LS diet compared with HS diet (413 vs. 393 kg, respectively; <span>P</span> &lt; 0.0001). Resulting in greater ADG for steers consuming LS diet compared with HS diet (1.49 vs. 1.26 kg, respectively; <span>P</span> &lt; 0.01). Dry matter intake was greater for steers consuming LS diet than HS diet (9.06 vs. 8.33 kg, respectively; <span>P</span> &lt; 0.01). Therefore, G:F was improved for steers consuming LS diet compared with HS diet (0.165 vs. 0.151, respectively; <span>P</span> &lt; 0.01). Steers consuming LS diet had decreased NEFA compared with HS diet (311 vs. 376 µmol/L, respectively; <span>P</span> &lt; 0.01). Results from this study indicate that regardless of the inclusion level of WS, supplementing growing steers with EFE did not influence growth performance. However, replacing ten percent of corn silage with WS reduced the energy concentration of the diet, decreasing growth performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b11a6eaf58882f3031821a34bed8429b433b251307b955fa399f44887a3c7525","category":"Environment"}