{"title":"Impact of years of grazing exclusion on surface soil temperature and hydrothermal relations in arid and semi‐arid grasslands","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2603?af=R","date":1705476137000,"content":"<h2>Abstract</h2>\n<p>Soil temperature (Ts) and hydrothermal processes are determinants of grassland vegetation growth in arid and semi-arid area. Implementation of grazing exclusion in grazed grasslands is bound to change the state of vegetation and soil, with consequent effects on Ts and hydrothermal relations. To investigate the differences in the response of Ts and hydrothermal variation to different durations of grazing exclusion, this study conducted a 4-year fencing exclusion experiment from 2019 to 2022 in Eritu Ranch, Xilingole League, Inner Mongolia. Soil water content (SWC), Ts and precipitation were continuously observed under grazing and different years of grazing exclusion. Statistical correlation analysis was used to assess changes in Ts and moisture after 1 and 4 years of grazing exclusion, and to investigate the differences in Ts response to the same rainfall events and changes during freeze–thaw periods under different grazing exclusion durations. The results show that after 1 year of grazing exclusion, the summer surface Ts decreased by 0.23°C, while the winter surface Ts increased by 0.55°C. After 4 years of grazing exclusion, the summer surface Ts decreased further by 1.18°C, while the winter surface Ts decreased by 0.39°C. This suggests that grazing exclusion has differential effects on seasonal Ts dynamics. Compared with grazing grassland (GG), Ts in grazing exclusion grassland (GEG) shows less response to rainfall. During the freeze–thaw period, soil moisture in GEG is more sensitive to precipitation than in GG. Regression analysis revealed that the correlation between Ts and moisture during the freezing phase was weaker in GEG than in GG. Furthermore, the difference in correlation between 1 and 4 years of grazing exclusion was smaller than expected. During the melting phase, the relationship between Ts and SWC in the soil differed less after 1 year of grazing exclusion compared with GG. However, after 4 years of grazing exclusion, the correlation between Ts and SWC was generally greater in the GEG, suggesting that grazing exclusion may lead to changes in soil moisture dynamics that affect Ts. The results indicate that after 4 years of grazing exclusion, Ts and SWC conditions are better than those after 1 year of grazing exclusion. These findings have significant implications for understanding the impact of grazing-induced soil warming and drying processes on ecosystems.</p>","author":"Xingyu Zhao, \nHongbin Zhao, \nShengwei Zhang, \nYing Zhou, \nRuishen Li, \nXi Lin, \nMinmin Liu, \nShuai Wang","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"b126c3bb96ac906be34479194eba1793fb7361b59bac46e1ebe0d1e1c45a55d4","category":"Environment"}