{"title":"Muskrat (Ondatra zibethicus) predation on unionid mussels in the Salmon and Little Salmon rivers in northern New York","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4368?af=R","date":1723782563000,"content":"<h2>Abstract</h2>\n<p>Muskrat (<i>Ondatra zibethicus</i>) predation on unionid mussels has been documented since the late 1800s. More recent studies have examined size-specific predation and potential effects of predation on mussel populations. This study was part of a larger endeavor that examined the effects of dam removal in the Salmon and Little Salmon rivers in northern New York. Muskrat middens were searched for from 2005 through 2012 and all mussel shells were identified, measured, and evaluated for evidence of muskrat predation. Ten species of consumed mussels were collected from 37 middens. Three species of living mussels that were in low abundance were not found in middens. Distribution of middens was uneven in both rivers and few middens were used in more than 1 year. Muskrats did not consume mussels &lt;37 mm shell length in the Salmon River (SR) and &lt;28 mm in the Little Salmon River (LSR). Shell length distribution of living mussels was similar to that of mussels in middens. Shell length of living SR mussels (based on mean ranks) were significantly longer than living mussels in the LSR as were consumed mussels. Size-selection may be indicated for <i>Elliptio complanata</i> and <i>Lampsilis radiata</i> but relative abundance might also be a factor. Dry empty shell weight and thickness were not significantly correlated to percent predation marks. The muskrat population in these rivers could be small as few middens were used in more than 1 year and there was no evidence of muskrat trapping. If so, muskrat predation would have a limited effect on the unionid population.</p>","author":"John E. Cooper","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"b12af9f0cb6893e0e47beadf95d0edabcc14f2a860a3d14e69ea2bcc93b35b50","category":"Environment"}