{"title":"Disease Conditions and Health Information Needs among Injecting Drug Users: Engendering Research to Policy and Interventions Initiatives","link":"https://www.preprints.org/manuscript/202410.0285/v1","date":1727965837000,"content":"Background:  \nInjecting drug use is a global public health challenge with multifaceted consequences, not only for Injecting Drug Users (IDUs) but also for society at large. Their vulnerability necessitates a deeper exploration of their health information needs, aiming to leverage evidence-based research to shape effective interventions for their well-being.\nMethod:  \nThis study employed a qualitative method to gain insights into disease conditions and  health information needs of IDUs. Through purposive sampling, 71 in-depth interviews were conducted and thematically analyzed.\nResults:  \nThe study included 43 males and 28 females, predominantly aged 26-35 (59.2%) who had poor socioeconomic status. The most commonly reported disease conditions varied and included malaria, infections and diabetes. Findings revealed a complex understanding of their disease conditions and management practices. Participants emphasized a critical need for access to reliable and comprehensive health information, while also highlighting the significant barriers they face in obtaining this information. Additionally, their preference for receiving health information in video formats, written articles, and through outreach programs underscored their desire for knowledge to make informed decisions. As co-creators and stakeholders in their health, participants expressed a clear demand for sustainable and free healthcare, mosquito nets, and regular outreach programs.\nConclusions:  \nWhile drug use presents a significant public health issue, effective interventions for IDUs require a multifaceted approach that begins with understanding their perspectives and actively involving them as co-creators of their health solutions. Abandoning this population contradicts the Sustainable Development Goals' mandate to ensure no one is left behind. Thus, all stakeholders must prioritize inclusive and participatory approaches to address the complex health information needs of IDUs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b12c11bfd097ce903e86b4fe817e98e1df70be211c7c4bf269f1b82894820e15","category":"Interdisciplinary"}