{"title":"Apple Music Classical and 5 other reasons to switch from Spotify to Apple Music","link":"https://www.macworld.com/article/1673016/apple-music-spotify-switch-classical-sing-interface-homepod-audio.html","date":1680356819000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re a music fan, there are basically two options: Spotify and Apple Music. Sure there are others music streaming services–<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://tidal.com/tiers/hifi&amp;xcust=1-1-1673016-1-0-0&amp;sref=https://www.macworld.com/feed\">Tidal</a>, <a href=\"http://amazon.com/music/unlimited?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Amazon Music</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.qobuz.com/us-en/discover&amp;xcust=1-1-1673016-1-0-0&amp;sref=https://www.macworld.com/feed\">Qobuz</a>–but if you want access to as much music as possible, Spotify and Apple Music are head and shoulders above the rest.</p>\n\n\n\n<p>But just because they’re the two best services doesn’t mean one doesn’t have advantages over the other. Apple Music might have gotten off to a rocky start, but if you haven’t checked it out in a while, there are plenty of reasons to consider dropping your Spotify Premium account and signing up for Apple Music. Here are six of them:</p>\n\n\n\n<h2>Apple Music Classical</h2>\n\n\n\n<p>The newest Apple Music feature is actually a whole new app dedicated to classical music. Included free with Individual and Family subscriptions, the <a href=\"https://www.macworld.com/article/1674013/apple-music-classical-iphone-shuffle-library-download.html\">Apple Music Classical</a> app includes more than 5 million classical music tracks, with “hundreds of Essentials playlists, insightful composer biographies, deep-dive guides for many key works, and intuitive browsing features.” If classical music is your jam, you won’t find anything on Spotify that even comes close.</p>\n\n\n\n<h2>Album and song descriptions</h2>\n\n\n\n<p>For years Spotify was the best place to discover new artists, but Apple Music has come a long way. From radio stations to playlists, Apple Music is a fantastic place to both find new music and learn a little ore about the music you love. Click inside an album and you’ll find an informative description that adds context to the recording, information about the artist, and a track-by-track breakdown for some albums. It’s a fantastic way to get to know a new artist beyond the songs you’re listening to and helps gain an appreciation of the work as you explore their music.</p>\n\n\n\n<h2>A friendlier interface</h2>\n\n\n\n<p>Just like music, user interfaces are in the eye of the beholder, but Apple Music does an excellent job of putting new music, old favorites, and related artists all in a great interface that’s easy to navigate at a glance. Spotify, on the other hand, is going through something of an identity crisis with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://newsroom.spotify.com/2023-03-08/new-home-page-scroll-clips-previews/&amp;xcust=1-1-1673016-1-0-0&amp;sref=https://www.macworld.com/feed\">a recent UI overhaul</a> that brings “a more active experience with advanced recommendations, a spotlight on visual canvases, and a completely new and interactive design.” Some might like it, but it definitely needs some work. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Spotify interface redesign\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/03/spotify-interface-redesign.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>Spotify</p></div>\n\n\n\n<p>Apple Music, on the other hand, has slowly refined its interface into one that’s smart and sensible. Music I definitely want to hear, probably want to hear, and might want to hear is all accessible without getting in the way. The Listen Now tab does an excellent job of collecting artists and genres I like, and the Browse tab has an excellent mix of playlists, new releases, and events I might have missed. For example, the Monday after Taylor Swift’s Eras Tour kicked off, there was an official playlist of her entire setlist as soon as I launched the app. Plenty of people have made similar playlists on Spotify, but you have to go searching for them.</p>\n\n\n\n<h2>Apple Music Sing</h2>\n\n\n\n<p>Back in December, Apple launched a new feature called <a href=\"https://www.macworld.com/article/1427242/apple-music-sing.html\">Apple Music Sing</a> that basically turns your iPhone or Apple TV into a karaoke machine with real-time animated lyric cues and the incredible ability to adjust the vocals to make it a solo or a duet. Considering high-quality machines cost hundreds of dollars, this is probably reason enough to switch if you’re into karaoke.</p>\n\n\n\n<h2>HomePod</h2>\n\n\n\n<p>Now that <a href=\"https://www.macworld.com/article/1509062/homepod-2023-review.html\">the full-sized HomePod is back</a>, so is the best way to listen to Apple Music. While you can listen to Spotify on any number of smart speakers, HomePod offers Apple Music subscribers a fully integrated, stylish speaker with incredible sound that you can’t get anywhere else.</p>\n\n\n\n<h2>Audio quality</h2>\n\n\n\n<p>Back in 2021, Apple introduced <a href=\"https://www.macworld.com/article/346837/apple-music-lossless-hi-res-lossless-spatial-dolby-atmos-iphone-airpods-android-homepod-dac.html\">high-resolution lossless audio </a>to Apple Music, making nearly every track available in a maximum resolution of 24-bit/192kHz versus 24-bit/48kHz for ALAC (Apple Lossless Audio Codec) and 16-bit/44.1kHz (CD Quality). While it’s promised a similar service for years, Spotify offers nothing that comes close to that quality, topping off at 320kbps for Premium subscribers. Maybe your ears won’t be able to tell the difference, but we’d still rather spend our money on the service that’s delivering the best possible quality.</p>\n\n\n\n<p>Speaking of money, <a href=\"https://www.macworld.com/article/225687/apple-music-faq-plans-prices-features.html\">Apple Music costs</a> $10.99/£10.99 a month for an individual subscription or $16.99/£16.99 a month for a family subscription with up to six people. There’s also a student plan for $5.99/£5.99 and a limited Voice option for $4.99/£4.99. Apple also offers several <a href=\"https://www.macworld.com/article/675739/how-to-get-apple-music-for-free-2.html\">ways to get Apple Music for free</a> if you want to try it our before giving up your Spotify subscription.</p>\n\nStreaming Media</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b12e535271f2d50870f55e09e0d4060b0c0ecf5345f8dbe1f8a179c3d5ea5b4a","category":"Apple"}