{"title":"Apple May Be Planning to Discontinue All of Its Silicone Accessories","link":"https://www.macrumors.com/2023/09/10/apple-planning-to-discontinue-silicone-accessories/","date":1694371702000,"content":"Apple may be planning to discontinue its silicone rubber and fluoroelastomer accessories, replacing them with ones made of more eco-friendly next-generation materials, <em>MacRumors</em> has been told.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-14-and-14-Plus-New-Silcone-Case-Colors-Feature.jpg\" alt width=\"2056\" height=\"1156\" />\r<br />\nThe move is expected to include accessories such as the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> Silicone Case with <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, Sport Band, Solo Loop, and AirTag Loop. The rumor comes from Apple device collector and leaker known as \"<a href=\"https://www.macrumors.com/guide/kosutami/\">Kosutami</a>,\" who has previously shared information about the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>'s <a href=\"https://www.macrumors.com/2023/08/21/iphone-15-could-come-with-color-matched-cables/\">braided USB-C cable</a>, various prototypes such as the <a href=\"https://www.macrumors.com/2023/05/30/apple-planned-magsafe-charger-color-options/\">MagSafe chargers</a> and <a href=\"https://www.macrumors.com/2023/05/30/apple-prototyped-airpods-in-five-color-options/\">AirPods</a> in different color options, and more.\r<br />\n\r<br />\nApple is widely expected to <a href=\"https://www.macrumors.com/2023/08/17/apple-may-not-offer-leather-cases-for-iphone-15/\">discontinue</a> its leather ‌iPhone‌ cases following the introduction of the ‌iPhone 15‌ lineup, replacing them accessories made with a premium material marketed as \"<a href=\"https://www.macrumors.com/2023/09/03/finewoven-cases-may-match-new-watch-band/\">FineWoven</a>.\" The discontinuation of silicone accessories is not expected to be imminent, instead taking place via a more gradual transition whereby existing models are not refreshed with new color options. For example, Sport Band may not be refreshed with new color options following the launch of the <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a>, being available until supplies of the current units run out. Apple is expected to release new accessory designs, such as a <a href=\"https://www.macrumors.com/2023/08/09/new-apple-watch-magnetic-band/\">\"FineWoven\" Apple Watch band</a> with a magnetic buckle, to replace its outgoing products.\r<br />\n\r<br />\nThe discontinuation of all leather and silicone Apple accessories is believed to be part of a wider move to transition to more environmentally friendly materials. While Apple's silicone rubber accessories have a lower carbon footprint than their leather counterparts, they are not made with any recycled materials. Materials like fluoroelastomer are also difficult to recycle due to their heat-resistant properties and strong, crosslinked structure.\r<br />\n\r<br />\n\"FineWoven\" is expected to be the first next-generation material used by Apple, replacing leather in the immediate term, but it could also displace some silicone accessories at some point. There will likely also be other new, more eco-friendly materials introduced on other accessories in the future.<div>Tags: <a href=\"https://www.macrumors.com/guide/iphone-cases/\">iPhone Cases</a>, <a href=\"https://www.macrumors.com/guide/apple-watch-bands/\">Apple Watch Bands</a>, <a href=\"https://www.macrumors.com/guide/silicone-case/\">Silicone Case</a>, <a href=\"https://www.macrumors.com/guide/kosutami/\">Kosutami</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/10/apple-planning-to-discontinue-silicone-accessories/\">Apple May Be Planning to Discontinue All of Its Silicone Accessories</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-may-be-planning-to-discontinue-all-of-its-silicone-accessories.2400974/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b13d34dc44bd9e23487619d390576c73f1f554ce85253533df35883fe2a3c01f","category":"Apple"}