{"title":"Diverse Strategies for Modulating Insulin Resistance: Causal or Consequential Inference on Metabolic Parameters in Treatment-Na&iuml;ve Subjects with Type 2 Diabetes","link":"https://www.preprints.org/manuscript/202405.1925/v1","date":1716961422000,"content":"The objective of this study is to investigate how different therapies modulating insulin resistance, either causally or consequently, affect metabolic parameters in treatment-naive subjects with T2DM. A total of 212 subjects were assigned to receive either a tight Japanese diet (n=65), pioglitazone at doses ranging from 15-30 mg/day (n=70), or canagliflozin at doses ranging from 50-100 mg/day (n=77) for a duration of three months. Correlations and changes (Δ) in metabolic parameters relative to insulin resistance were investigated. Across these distinct therapeutic interventions, ΔHOMA-R exhibited significant correlations with ΔFBG and ΔHOMA-B, while demonstrating a negative correlation with baseline HOMA-R. However, other parameters such as ΔHbA1c, ΔBMI, ΔTC, ΔTG, Δnon-HDL-C, or ΔUA displayed varying patterns depending on the treatment regimens. Participants were stratified into two groups based on the median value of ΔHOMA-R: the lower half (X) and upper half (Y). Group X consistently demonstrated more pronounced reductions in FBG compared to Group Y across all treatments, while other parameters including HbA1c, HOMA-B, TC, TG, HDL-C, non-HDL-C, TG/HDL-C ratio, or UA exhibited distinct regulatory responses depending on the treatment administered These findings suggest that 1) regression to the mean is observed in the changes of insulin resistance across these therapies. 2) modulation of insulin resistance with these therapies, either causally or consequentially, results in differential effects on glycemic parameters, beta-cell function, specific lipids, body weight or UA.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b1441250c3ad483f29012a29ed67c3b01d0b373d0cfd19b6493b0f63885a2b68","category":"Interdisciplinary"}