{"title":"Eternally five years away? No, batteries are improving under your nose","link":"https://arstechnica.com/?p=1761885","date":1621854900000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/mrfusion_scrn-800x433.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/mrfusion_scrn.jpg\">Enlarge</a> <span>/</span> What year, again, does Mr. Fusion show up to compete with Tesla et al? (credit: Universal Pictures)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>It’s hard to write about battery research around these parts without hearing certain comments echo before they’re even posted: <em>It’ll never see the market. Cold fusion is eternally 20 years away, and new battery technology is eternally five years away.</em></p>\n<p>That skepticism is understandable when a new battery design promises a revolution, but it risks missing the fact that batteries <em>have</em> gotten better. Lithium-ion batteries have reigned for a while now—that’s true. But “lithium-ion” is a <em>category</em> of batteries that includes a wide variety of technologies, both in terms of batteries in service today and the ones we've used previously. A lot can be done—and a lot <em>has</em> been done—to make a better lithium-ion battery. In fact, gains in the amount of energy they can store have been on the order of five percent per year. That means that the capacity of your current batteries is over 1.5 times what they would have held a decade ago.</p>\n<p>Lithium-ion batteries have evolved, whether you noticed or not. Here's how.</p></div><p><a href=\"https://arstechnica.com/?p=1761885#p3\">Read 45 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761885&amp;comments=1\">Comments</a></p>","author":"Scott K. Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b15a39eb251d91c0b3d34be213bfd1ff5c619b01286ef9c80e6d4c26ffd17210","category":"Tech"}