{"title":"A Craniometric Analysis of the Subfamily Cervinae (Cervidae, Mammalia)","link":"https://www.preprints.org/manuscript/202403.0537/v1","date":1709912527000,"content":"This study employs Principal Component Analysis to examine cranial measurements obtained from both extant and fossil specimens spanning 38 species and comprising over 300 individuals within the subfamily Cervinae. Our findings elucidate craniometric distinctions among cervids characterized by varying body sizes and certain evolutionary adaptations. While our results generally corroborate previous assertions regarding the limited craniometric variability among plesiometacarpal deer, they also unveil specific cranial adaptations within certain genera and species. The Principal Component Analysis of craniometric data revealed that giant and large-sized deer display significantly broader ecomorphological diversity in cranial shape compared to small-sized deer. Secondly, small-sized deer exhibit greater uniformity in their cranial shape, appearing densely clustered on the factorial map. Thus, we conclude that body size imposes ecological constraints, limiting the available niches due to eco-physiological factors. The study demonstrates that endemic insular deer do not evolve consistent craniometric features attributable to insular isolation, while the cranial proportions of medium-to-small sized deer delineate a ubiquitous morphological archetype characteristic of numerous cervid taxa spanning diverse phylogenetic lineages and sharing comparable body sizes. This group of \"Dama-like\" deer, characterized by similar body size, metabolic rates, ecological needs, and cranial morphometry, is referred to here as the fundamental eco-physiological type, typical of warm regions within the Palearctic and Oriental biogeographic realms..","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b16895fab4adbc595be79631029d71ea93251f4b1ae5adaf3ba578b38645ae57","category":"Interdisciplinary"}