{"title":"Drivers, performance evaluation and influencing factors of water resources utilisation—based on the theory of sustainable development","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12475?af=R","date":1720153491000,"content":"<h2>Abstract</h2>\n<p>Water constitutes an important natural and strategic resource, crucial to sustainable development, as well as the social stability and  wellbeing of every economy. The coordinated development of water resource utilisation and economic growth  is currently the focus of attention of social scientists and other representatives of the scholarly community, being one of the key factors for the long-term development of a country. Based on theories of sustainable development and water resource utilisation, this paper examines the ‘quantity’ and ‘quality’ of water resource utilisation in 19 provinces, municipalities directly under the Central Government, and autonomous regions in the Yangtze River basin from 2006 to 2021, and explores the internal interaction mechanism. First, the decoupling model is used to explore the decoupling relationship between water resource use and economic growth in the Yangtze River Basin, and the LMDI additive index model is used to analyse the corresponding four driving factors. After discovering the interaction between the ‘quantity’ of water resources and economic growth, the ‘quality’ of water resources in the Yangtze River basin was explored, and after measuring the utilisation rate of water resources in the Yangtze River basin, the Tobit model was applied to introduce the explanatory and control variables to deeply analyse the influencing factors of water resources, and the two regulating variables of the digital economy and water endowment are introduced to further analyse the regulating mechanism. The results demonstrate that there is a corresponding ‘weak decoupling-strong decoupling-strong decoupling’ stage of development between water resource use and economic growth in the Yangtze River basin, with the corresponding technology effect factor being the most important driver. There is also a corresponding positive regulation impact of the digital economy on the relationship between the two, while water resources endowment has a corresponding negative regulation mechanism, as well as the role of corresponding influencing factors. Relevant recommendations for water resources use have been suggested.</p>","author":"Wenjing Wang, \nXin Zhao, \nJunwei Xu, \nShenjie Zhou","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"b1686cee869411d9a20137492645eb05fed3ec980ec38668281b818447d50e86","category":"Environment"}