{"title":"The hijacked plane, the dictator, and the cycling championship","link":"https://cyclingtips.com/2021/05/the-hijacked-plane-the-dictator-and-the-cycling-championship/","date":1622174622000,"content":"<p><em>What happens when you cross track cycling, authoritarian regimes and bomb hoaxes? You get a messy situation, that’s what. </em></p>\n\n\n\n<hr />\n\n\n    <div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What’s happening?</strong> The European Track Championships, after increasing calls for them to be removed from Minsk, have finally been cancelled by the event organiser.</li>\n\t\t\t\t\t                        <li><strong>Why?</strong> Alexander Lukashenko, the dictator in charge of Belarus, orchestrated the hijacking of a commercial flight with a bomb hoax. This was widely seen as a ploy to arrest an opposition journalist.</li>\n\t\t\t\t\t                        <li><strong>Then what happened?</strong> The international community (quite rightly) understood that this was a Very Bad Thing, introducing sanctions. Multiple cycling federations across Europe followed suit by boycotting the upcoming continental track championships. </li>\n\t\t\t\t\t                        <li><strong>What was the UEC’s stance?</strong> For months they have been bullish in continuing with the Minsk event, despite increasing Belarusian instability and offers from alternative hosts. </li>\n\t\t\t\t\t                        <li><strong>What next?</strong> We wait and see whether the countries that put their hand up to take the championships off Belarus – all of which were declined by the UEC – end up getting the nod. </li>\n\t\t\t\t\t                        <li><strong>Surely this is a very weird, unsettling one-off?</strong> Nope. The Track World Championships are scheduled to be held in Ashgabat, Turkmenistan, in October. Which is another dictatorship. </li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\t\n\n\n\n<p>Over the past few months, there have been growing calls for the European Cycling Union (UEC) to reconsider the location of its continental track championship, slated to be held in Minsk, Belarus in late June. Until Thursday, the UEC was unwavering in the face of widespread criticism. </p>\n\n\n\n<p>After a UEC management committee meeting was convened on Thursday morning, however, the call was finally made to cancel the event citing “the current international situation” which has “developed into an international debate”.</p>\n\n\n\n<p>So: what was that situation? What was the debate? How did we end up here? </p>\n\n\n\n<p>That’s a long, complicated and juicy story, involving dictators, air piracy, and track cycling.</p>\n\n\n\n<h2>Chapter 1: The flight</h2>\n\n\n\n<p>Ryanair flight FR4978, from Athens to Vilnius, was perfectly ordinary until it wasn’t. </p>\n\n\n\n<p>When the plane entered Belarus’ airspace, shortly before it began its descent to Vilnius to land, air traffic controllers from the capital Minsk contacted the pilot, telling him “for your information, we have information from special services that you have bomb on board and it can be activated over Vilnius.” </p>\n\n\n\n<p>According to some, Belarus threatened to shoot the passenger plane down. According to others, two members of Belarus’ secret police, the KGB, were on the flight and responsible for triggering the alert. </p>\n\n\n\n<p>What isn’t in contention is what happened next: Belarus’ air force, acting under the direct instruction of Belarusian president Alexander Lukashenko, scrambled a MiG29 fighter jet to guide the passenger plane to Minsk airport where it landed. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Belarus-flight-diversion.png\" /></figure>\n\n\n\n<p>On board the plane was a Belarusian opposition journalist, Roman Protasevich, who was removed in Minsk. There was no bomb discovered on the plane, because the threat is widely understood to have been a Belarusian ploy to capture Protasevich, who had been exiled in Lithuania since 2019. </p>\n\n\n\n<p>As a terrified Protasevich was removed from the flight in Minsk, according to witnesses, he “turned to people and said he was facing the death penalty”. His Russian girlfriend, Sofia Sepaga, was also arrested. The two are currently confined in jail, and have provided video statements since their arrest – presumably under considerable duress, and possibly following torture – admitting responsibility for a number of crimes against Belarus. </p>\n\n\n\n<p>Belarus, which has been ruled by Lukashenko for 27 years and is considered Europe’s last dictatorship, has increasingly been regarded as a pariah since last year’s election, which saw Lukashenko returned to power despite allegations of vote-rigging. Opposition figures were forced to flee the country, and violent crackdowns – which included beatings, torture and concentration camps – were launched. A political activist who died last week in a penal colony revealed, prior to his death, that political prisoners were marked by yellow tags sewn onto their clothes – a revelation with some uncomfortable echoes from history. </p>\n\n\n\n<p>Belarus’ citizenry is under attack, too: a steady escalation of repression of dissent in the months since the election has seen citizens arrested for such innocuous acts as wearing the opposition colours, white and red. </p>\n\n\n\n<p>The United States and European Union no longer recognise the Lukashenko regime as legitimate, with sanctions imposed on Belarus from those governments as well as major sporting bodies such as the International Olympic Committee. </p>\n\n\n\n<p>The hijacking of Ryanair flight FR4978 has further inflamed tensions. Firstly, it represents a <a href=\"https://www.lawfareblog.com/belarus-and-hijacking-ryanair-flight-fr4978-preliminary-international-law-analysis\">major breach of international aviation law</a>, with Ryanair boss Michael O’Leary describing it as “a case of state-sponsored hijacking … state-sponsored piracy.” Secondly, observers note that it’s not just an attack on law, but on the entire European Union: “Lukashenko is now an international threat, and not just a threat to his own people,” <a href=\"https://www.cnbc.com/2021/05/25/russias-defense-of-belarus-hijack-shows-its-growing-influence.html\">said Nigel Gould-Davies</a>, a former UK ambassador to Belarus. </p>\n\n\n\n<p>Where does cycling come into this mess? Great question.</p>\n\n\n\n<h2>Chapter 2: The track cycling championships</h2>\n\n\n\n<p>Belarus, like many oppressive regimes, has a history of using sporting events to legitimise and promote itself to the international community. In the aftermath of the <a href=\"https://www.latimes.com/opinion/story/2020-10-26/belarus-election-fraud-mass-protests\" target=\"_blank\">stolen election</a> last year, however, many sporting bodies moved to distance themselves from the country. The IOC imposed sanctions, and then strengthened them. International championships in ice hockey and pentathlon, slated to be held in Minsk this year, were relocated. </p>\n\n\n\n<p>There was just one major hold-out: the European Track Cycling Championships, scheduled for late June.</p>\n\n\n\n<p>Since February, CyclingTips has been in contact with the event organiser, the UEC (European Cycling Union), asking whether there were any concerns about holding the event in Belarus. At first, the UEC said it was keeping an attentive eye on the situation, then stated that there were no alternative venues available to host the event, and finally, refused to make any political judgment against member federations. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-027-1340x893.jpg\" /><figcaption>A Belarusian flag flies over the Minsk velodrome.</figcaption></figure>\n\n\n\n<p>However, it has since emerged that there were in fact three offers – from the Netherlands, Lithuania and Denmark – to host the event in lieu of Belarus. Denmark’s governing sporting body, the Danish Sports Federation, even offered to indemnify the UEC for any costs associated with moving the event. </p>\n\n\n\n<p>All of these offers were refused by the UEC, with UEC President Enrico Della Casa telling Danish outlet Berlingske earlier this month that “the event in Minsk has been confirmed and we do not want to change the location. In addition, the various national teams, TV teams and technical assistants have already booked flights and hotels.”</p>\n\n\n\n<p>But then, Lukashenko hijacked a plane.</p>\n\n\n\n<p>Until the bomb hoax on Ryanair flight FR4978, the cycling federations of Europe were mostly mute to the injustices taking place in Belarus. After this very public act of international piracy, however, it was more difficult for neutrality to be deemed an acceptable response. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-1340x893.jpg\" /><figcaption>Military police outside the Minsk velodrome, 2013.</figcaption></figure>\n\n\n\n<p>Over the past week, several of the largest European cycling federations withdrew from Minsk, and presumably played a role in eventually forcing the UEC’s hand. </p>\n\n\n\n<p>On May 25, the German Cycling Federation (BDR) <a href=\"http://www.bdr-medienservice.de/nachrichten/bdr-setzt-klares-zeichen\">took the plunge</a> “and made it clear that under these circumstances, the German national track cycling team would not be able to participate in the European Championships in Minsk / Belarus.”</p>\n\n\n\n<p>Later that day, the Netherlands followed suit, citing a desire to protect “the safety and well-being of the riders” instead of taking a “political” stance. </p>\n\n\n\n<p>Lithuania – Belarus’ neighbour to the north – followed the Netherlands and Germany by boycotting Belarus, with Gabrielius Landsbergis – Lithuania’s Minister of Foreign Affairs – again <a href=\"https://twitter.com/GLandsbergis/status/1397593066303856644\">offering its velodrome</a> as a venue for the UEC Championships. </p>\n\n\n\n<p>Finally, just prior to the UEC’s announcement of the event cancellation, Belgium said it too would boycott the event. </p>\n\n\n\n<p>Beyond the four federations that took a stand, there were logistical challenges that would have proved challenging to overcome for any remaining squads. </p>\n\n\n\n<p>Sanctions imposed since the hijacking have led to a ban on EU flights over and into Belarus – meaning that any athletes travelling to the championship would have had to transit by land, or via Russia – which itself is no easy feat, seeing as <a href=\"https://www.theguardian.com/world/2021/may/27/world-aviation-body-to-launch-inquiry-into-belarus-hijacking\">Russia is now refusing European flights</a> as an expression of solidarity with its ally Belarus. A senior member of British Cycling, Performance Director Stephen Park, tweeted prior to the UEC announcement that there can “surely be no way the UEC can continue to deliver the Track Euros in Minsk next month.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Image-from-iOS.png\" /><figcaption>Belarus is now effectively an island in the middle of a continent.</figcaption></figure>\n\n\n\n<p>Swirling around in this milieu were legitimate concerns for the safety of athletes and fans competing in Minsk. For one, Belarus has been lacklustre in its efforts to curb COVID-19, with Lukashenko at various points suggesting vodka, driving tractors, and ice-hockey as tonics to ward it off (truly). </p>\n\n\n\n<p>Chillingly, there are also suggestions that the virus has been weaponised by Lukashenko’s regime, with <a href=\"https://apnews.com/article/belarus-coronavirus-pandemic-only-on-ap-prisons-802ce0309de3df0df64d82d4deaa0ab9\">allegations</a> of political prisoners being deliberately infected, with treatment then purposefully withheld. </p>\n\n\n\n<p>Athletes and fans travelling to Minsk for the championships may also have faced harassment there – most notably those from countries like Austria, Denmark, and Poland, which have white and red uniforms and flags that would have left them <a href=\"https://www.rferl.org/a/flag-wars-woman-in-white-and-red-flees-belarus/31015574.html\" target=\"_blank\">exposed to persecution from Belarusian police</a>. </p>\n\n\n\n<h2>Chapter 3: The cancellation</h2>\n\n\n\n<p>As the boycott announcements came through, CyclingTips made numerous requests for comment, and provided a number of questions to contacts at the UEC in the lead-up to Thursday’s management committee meeting. These went unanswered, and the UEC eventually released a statement that “no … comments will be published before this date.”</p>\n\n\n\n<p>On Thursday morning, the <a href=\"http://www.uec.ch/en/actu/166/enrico-della-casa-new-uec-president\">UEC’s management committee</a> – which comprises six members, including one from Belarus – finally made the call to cancel the event: more than three months since CyclingTips began asking whether the event would be relocated, six months since the IOC imposed sanctions, and nine months since Lukashenko stole an election and escalated his reign of terror. </p>\n\n\n\n<figure><blockquote><p><em>“We have recently been monitoring the situation with the Belarus Cycling Federation which has now developed into an international debate and today during the Management Board meeting, we have decided to cancel the event in Minsk. I would like to thank the Belarus Cycling Federation and its President and Management Board member, Natallia Tsylinskaya, who has worked with great dedication to help prepare the event and for the important initiatives planned to develop the sport of cycling in Belarus with a programme of additional activities during the European Championships. We are already working on finding an alternative solution to enable the riders from our 50 National Federations to compete in this season’s continental event.” </em></p><cite>Enrico Della Casa, UEC President.</cite></blockquote></figure>\n\n\n\n<h2>Chapter 4: So, what next? </h2>\n\n\n\n<p>That’s not entirely clear. One of the reasons originally cited by the UEC for proceeding with the event in Minsk was a lack of competition and selection opportunities in the lead-up to the Tokyo Olympics, so it’s a little surprising that the UEC has announced the event’s “cancellation”, as opposed to “relocation”. Maybe that’s just a matter of semantics.</p>\n\n\n\n<p>As noted, we know that three countries were mooted as providing possible alternative venues: the Netherlands, Denmark, and Lithuania.  </p>\n\n\n\n<p>A representative from Libéma – the operators of the Apeldoorn velodrome in the Netherlands – confirmed to CyclingTips after the UEC’s announcement that “so far we have <strong>not </strong>been in touch with the UEC to take over UEC Track Championships 2021 from Minsk.”</p>\n\n\n\n<p>Denmark previously made an offer to cover the costs of relocating the event and assume hosting rights. Notably, this came via the country’s National Olympic Committee (DIF), forcing the hand of the Danish Cycling Federation – whose president, Henrik Jess Jensen, is a vice-president of the UEC. However, Poul Broberg of the DIF told CyclingTips that “we have not been in contact with UEC about a relocation of the European Track Championships to Denmark [since] before the decision to cancel the event was made.”</p>\n\n\n\n<p>As for Lithuania – improbably enough, the country’s Prime Minister (!) made a direct offer to host the event via Twitter (!!) which the UEC responded to, again via Twitter. So, hope lives …?</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-28-at-12.38.42-pm.png\" /></figure>\n\n\n\n<h2>A precedent, or a blip?</h2>\n\n\n\n<p>Since CyclingTips began reporting on the strange, contentious case of the Minsk European Track Championships, the regime in Belarus has become increasingly erratic and pressure on the UEC has continued to mount. With Lukashenko’s blatant escalation of last weekend, this continental-level track cycling event was ensnared in an international diplomatic incident – and suddenly, fell under the gaze of mainstream media. </p>\n\n\n\n<p>With the announcement of boycotts by several of the continent’s most prominent cycling federations, there was less and less wiggle room for the UEC. Ultimately, the correct decision was made, as challenging as it was. The UEC has been fond of taking an apolitical stance through the past few months, but by Lukashenko’s actions it was painted into a corner. </p>\n\n\n\n<p>The European Track Championships may happen – although who knows where, or when – and the eyes of the cycling world move on, because the uncomfortable reality of sport being used to legitimise a tyrannical regime will fall back below the surface. For now. </p>\n\n\n\n<p>In October, the UCI World Track Championships will head to Ashgabat, the capital of Turkmenistan. There, a dictator rules the country with an iron fist. COVID-19 is not acknowledged. Press freedom is the second worst in the world, fractionally better than just North Korea. Homosexuality is illegal, ethnic and religious minorities are persecuted, free elections don’t exist, and censorship and surveillance is widespread.</p>\n\n\n\n<p>Now cycling has to decide: is what has just happened with Minsk a precedent, or is it a blip?</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/the-hijacked-plane-the-dictator-and-the-cycling-championship/\">The hijacked plane, the dictator, and the cycling championship</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b169d5b1991384d28d70c34bd6c24ef23849bbab8bd3fd61052c054258a70d4c","category":"Cycling"}