{"title":"The fake eyes have it: Apple’s Vision needs some refinement","link":"https://www.macworld.com/article/1950051/apple-vision-pro-eyesight-spatial-computing-reaction.html","date":1686652200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Apple Vision Pro has been here for only a week (disclaimer: not actually here at all) and the general reactions seem to be a mix of awe, desire, fear, and sadness. Let’s see what we can unpack.</p>\n\n\n\n<p>Apple seems to believe that it has found a way to solve the isolation problem presented by every headset product to date. The Macalope thinks it’s a fine solution for the headset wearer. It’s less of a solution for people who have to interact with that person, however.</p>\n\n\n\n<p>As a mythical creature who has been guilty of claiming to be paying perfect attention to a conversation while playing a video game–in the past, of course, surely this hasn’t happened while playing “Tears of the Kingdom” over the past few weeks, why, who have you been talking to, it’s the Macalope’s spouse, isn’t it–the Macalope has found that people would often prefer that you not try to have your cake and eat it, too. Particularly right in front of them all while denying you have any cake at all.</p>\n\n\n\n<p>“Look, my fake eyes show I’m paying attention to you!” is not the convincing message you think it is. “We’re really connecting now!” No, we’re not, Kent! Take the headset off!</p>\n\n\n\n<p>It’s not all fake eyeballs and another promise that Apple is getting into gaming (this time for sure), though. This is still an amazing product and what’s particularly amazing about it is not that it will play games or show you movies on the side of Mt. Hood (it should have been a drive-in), or let you creepily relive precious family moments when no one saw your actual face (yeah, yeah, how’s that different from <em>any</em> family moment?). It’s the thing they led with: spatial computing.</p>\n\n\n\n<p>There are a <em>lot</em> of reasons why the Vision Pro is seven times as much as most headsets you can buy today. Cameras, nits, motors, number of processors… It will clearly run circles around the other devices at the things they currently do. But probably the biggest is the thing that none of them can do: be a spatial computer.</p>\n\n\n\n<p>Okay, all computing takes place in space (and time!). But, since the dawn of computing, users have been restricted by screens. Sure, if you’re a cartoon villain you’ve got dozens of screens set up in your subterranean layer, but that’s a half solution at best and…</p>\n\n\n\n<p>Well, it’s a weird look, Kent. We’re just gonna say it. You think it looks ominous, we think it just makes you look lonely.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>Also, eating a “high gluten” diet doesn’t make you a villain. It just doesn’t. You’re not hurting anyone but yourself. And, really, no one even knows what you mean by that so we don’t even know if you are hurting yourself.</p>\n\n\n\n<p>Anyway, imagine a screen with no edges. There. Apple’s multi-year investment in making bezels smaller had a huge breakthrough when they were able to make them with a negative width so they wrapped all the way around you. Honestly, the Macalope is quite looking forward to being able to put distracting apps behind him so he has to turn completely around to see them. He might actually get something done.</p>\n\n\n\n<p>The Vision Pro is just the beginning of spatial computing. A very expensive beginning. Yes, after months of hearing that Apple’s headset would be $3,000 while many speculated Apple would do what it did with the iPad and undercut the rumored price, it is actually <em>more</em> than that. So, while this device is both amazing and troubling, it’s clearly not for everyone.</p>\n\n\n\n<p>This rollout reminded the horny one of the Apple Watch rollout. First, both had an early announcement. Of course, Apple’s done that in the past, the iPhone being the most notable case, but in the case of both the Watch and Vision Pro, these are devices that look less likely to gain wide early adoption. Their announcements also featured an emphasis on personal touches that kind of fell flat: a man reliving a family moment by himself and sending a heartbeat to someone. That awkwardness didn’t affect the Watch’s long-term success and the Macalope doubts it will affect the Vision Pro’s.</p>\n\n\n\n<p>Apple has plenty of time to refine its message around this product. Heck, it has time before it even ships. But even when it does ship, it’s not going to ship to that many people. This is a tantalizing first look at a rather radical breakthrough in computing. And while some of it may have been rough around the edges and unintentionally painted a bleak future of humans sitting by themselves reliving memories of when they used to interact with their families…</p>\n\n\n\n<p>Jeez, now the Macalope’s depressed himself so much he forgot what he was going to say.</p>\n\n\n\n<p>Anyway, it’ll probably all work out.</p>\n\nApple, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b16e1793d0a9beb3c83726e34e96bb55f70ee942d8f0c949faa7c1ee64ec8a18","category":"Apple"}