{"title":"Molecular delimitation of cryptic Australian squid species of the genus Uroteuthis Rehder, 1945 (Cephalopoda: Loliginidae), provides a baseline of diversity to resolve classification challenges throughout the Indo-Pacific","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae028/7731339?rss=1","date":1723420800000,"content":"<span><div>ABSTRACT</div>This study provides a comprehensive molecular phylogenetic analysis of <span>Uroteuthis</span> squid from the Indo-Pacific region. The main aim was to increase sample coverage from northern and eastern Australian waters to resolve the identity and distribution of <span>Uroteuthis</span> species taken by local fisheries. Two mitochondrial regions, cytochrome <span>c</span> oxidase subunit I (COI) and 16S ribosomal RNA (16S rRNA), were sequenced from 220 new specimens and analysed with a further 51 sequences from GenBank to create a combined phylogeny for the genus. Three nuclear regions, 18S ribosomal DNA (18S rDNA), 28S ribosomal DNA (28S rDNA) and rhodopsin, were also sequenced from representatives of each species. Based on the mitochondrial phylogeny plus distance and tree-based delimitation models, a COI species barcode gap of 4–5% is proposed for discriminating <span>Uroteuthis</span> species. Applying this gap partitioned many described species into species complexes; for example, <span>U. duvaucelii, U. noctiluca</span> and <span>U. edulis</span> resolved into 10 species. Although more conserved, mitochondrial 16S rRNA sequences differentiated all new species clades, whereas none of the nuclear markers resolved the closest species. Results confirm that neither <span>U. chinensis</span> nor <span>U. edulis</span> occurs in Australian waters. Five undescribed species are identified from northern and eastern Australia, of which four are consistent with earlier allozyme studies (and two align with existing DNA sequences). One is a new southeastern, deeper shelf species differentiated in this study, along with a sixth undescribed species from Indonesian waters. Results of the molecular analysis are now being used to inform complementary morphometric analyses for new species descriptions, and genetic stock structure assessments of these important fisheries resources.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"b17bdd81baf6ffbcf757c026c982c22dbb96ed18a390fe6def2d800f1c684c89","category":"Environment"}