{"title":"Guardrails for Amazon Bedrock helps implement safeguards customized to your use cases and responsible AI policies (preview)","link":"https://aws.amazon.com/blogs/aws/guardrails-for-amazon-bedrock-helps-implement-safeguards-customized-to-your-use-cases-and-responsible-ai-policies-preview/","date":1701191404000,"content":"<p>As part of your responsible artificial intelligence (AI) strategy, you can now use <a href=\"https://aws.amazon.com/bedrock/guardrails/\">Guardrails for Amazon Bedrock</a> (preview) to promote safe interactions between users and your generative AI applications by implementing safeguards customized to your use cases and responsible AI policies.</p> \n<p>AWS is committed to developing generative AI in a responsible, people-centric way by focusing on education and science and helping developers to integrate responsible AI across the AI lifecycle. With Guardrails for Amazon Bedrock, you can consistently implement safeguards to deliver relevant and safe user experiences aligned with your company policies and principles. Guardrails help you define denied topics and content filters to remove undesirable and harmful content from interactions between users and your applications. This provides an additional level of control on top of any protections built into foundation models (FMs).</p> \n<p>You can apply guardrails to all large language models (LLMs) in Amazon Bedrock, including fine-tuned models, and Agents for Amazon Bedrock. This drives consistency in how you deploy your preferences across applications so you can innovate safely while closely managing user experiences based on your requirements. By standardizing safety and privacy controls, Guardrails for Amazon Bedrock helps you build generative AI applications that align with your responsible AI goals.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-amazon-bedrock-guardrails-01.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-amazon-bedrock-guardrails-01.png\" alt=\"Guardrails for Amazon Bedrock\" width=\"1737\" height=\"1118\" /></a></p> \n<p>Let me give you a quick tour of the key controls available in Guardrails for Amazon Bedrock.</p> \n<p><strong><u>Key controls<br /> </u></strong>Using Guardrails for Amazon Bedrock, you can define the following set of policies to create safeguards in your applications.</p> \n<p><strong>Denied topics –</strong> You can define a set of topics that are undesirable in the context of your application using a short natural language description. For example, as a developer at a bank, you might want to set up an assistant for your online banking application to avoid providing investment advice.</p> \n<p>I specify a denied topic with the name “Investment advice” and provide a natural language description, such as “Investment advice refers to inquiries, guidance, or recommendations regarding the management or allocation of funds or assets with the goal of generating returns or achieving specific financial objectives.”</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-amazon-bedrock-guardrails-07.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-amazon-bedrock-guardrails-07.png\" alt=\"Guardrails for Amazon Bedrock\" width=\"1359\" height=\"1182\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-amazon-bedrock-guardrails-08.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-amazon-bedrock-guardrails-08.png\" alt=\"Guardrails for Amazon Bedrock\" width=\"1360\" height=\"1179\" /></a></p> \n<p><strong>Content filters –</strong> You can configure thresholds to filter harmful content across hate, insults, sexual, and violence categories. While many FMs already provide built-in protections to prevent the generation of undesirable and harmful responses, guardrails give you additional controls to filter such interactions to desired degrees based on your use cases and responsible AI policies. A higher filter strength corresponds to stricter filtering.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-amazon-bedrock-guardrails-11.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-amazon-bedrock-guardrails-11.png\" alt=\"Guardrails for Amazon Bedrock\" width=\"1022\" height=\"1024\" /></a></p> \n<p><strong>PII redaction (in the works) –</strong> You will be able to select a set of personally identifiable information (PII) such as name, e-mail address, and phone number, that can be redacted in FM-generated responses or block a user input if it contains PII.</p> \n<p>Guardrails for Amazon Bedrock integrates with <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a>, so you can monitor and analyze user inputs and FM responses that violate policies defined in the guardrails.</p> \n<p><b><u>Join the preview<br /> </u></b>Guardrails for Amazon Bedrock is available today in limited preview. Reach out through your usual AWS Support contacts if you’d like access to Guardrails for Amazon Bedrock.</p> \n<p>During preview, guardrails can be applied to all large language models (LLMs) available in Amazon Bedrock, including Amazon Titan Text, Anthropic Claude, Meta Llama 2, AI21 Jurassic, and Cohere Command. You can also use guardrails with custom models as well as Agents for Amazon Bedrock.</p> \n<p>To learn more, visit the <a href=\"https://aws.amazon.com/bedrock/guardrails/\">Guardrails for Amazon Bedrock</a> web page.</p> \n<p>— <a href=\"https://www.linkedin.com/in/antje-barth/\" target=\"_blank\">Antje</a></p>","author":"Antje Barth","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"b17eb42023526f4834537515538bd999ab40baab6adf9a364a9ce2acdbd8eb99","category":"Tech"}