{"title":"Novel Insights Into the Architecture of Macro and Microstructures in Cattle Ossa Cordis","link":"https://academic.oup.com/mam/article/30/3/574/7688378?rss=1","date":1717545600000,"content":"<span><div>Abstract</div><span>Ossa cordis</span>, bones located within the heart trigones, are often classified as heterotopic or ectopic bones. Despite their high prevalence in cattle and some other bovids, little is known about their structure or development. Scanning electron microscopy, X-ray microtomography, gross dissections, and measurements showed the anatomical locations, prevalence, shapes, and measurements of the cardiac bones in both Egyptian Baladi cattle and Holstein-Friesians. All cattle (<span>n</span> = 12) had an <span>Ossa cordis dextrum</span> (average = 50.70 × 20.91 × 5.40 mm). Additionally, 80% Egyptian Baladi and 57% Holstein-Friesian had a smaller <span>Ossa cordis sinistrum</span> (average = 24.94 × 12.75 × 4.12 mm). Egyptian Baladi <span>Ossa cordis</span> were smaller than observed in Holstein-Friesians. Energy-dispersive X-ray analysis showed the elemental constitution (carbon, oxygen, calcium, nitrogen, phosphorus, sodium, and magnesium) of <span>Ossa cordis</span> and <span>Cartilago cordis</span>. These imaging techniques, plus four histological stains (hematoxylin and eosin, Crossman's trichrome, Alcian blue with Van Gieson, and Sirius Red) and microscopy, demonstrated osteoblasts, osteocytes, osteoclasts, astrocytes, blood vessels, bone marrow, lamellar and woven bone, cortical bone, trabeculations with pores and canaliculi, and fibrous components including collagen in the <span>Ossa cordis dextrum</span> and <span>sinistrum</span>. Hyaline cartilage and fibrocartilage (chondrocytes and cartilage matrix) were found within and surrounding the <span>Ossa cordis</span>. These findings were additionally compared against other cattle breeds and species.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"b1899959a75a18ae1cdaadcdb21ca5695e0e15f93424f0a3ac2aa7bed7d38bf6","category":"Environment"}