{"title":"Integrating indoor and outdoor breeding systems to achieve year‐round seed production in Pearlspot cichlid, Etroplus suratensis","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16125?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>Pearlspot, <i>Etroplus suratensis</i> naturally thrives in the estuarine reaches of Southern peninsular India and Srilanka. The relative ease of adaptation to diverse habitats makes it a promising candidate for climate-resilient aquaculture. This potential remains underexplored due to limitations in the current seed production practices. The present study focused on sustainable seed production of this species in the freshwater environment. Brooders were simultaneously maintained inside the hatchery and also in outdoor cement tanks. The breeding tanks were devoid of bottom substrate and planter pots were kept for egg attachment. The indoor fibreglass tank had an internal airlift filtration and outdoor tanks had an external filter connected to the filter bed. The modified captive breeding approaches employed were successful in obtaining 178 spawning from 44 pairs in 2 years. The indoor facility yielded 56 spawning from 15 pairs and the outdoor system yielded 122 spawning from 29 pairs. Pearlspot was found to spawn throughout the year with two distinct peaks, a minor peak in July–August and a major peak during December–January. Subsequently, spawning declined from February to June with an intermittent spurt in March. The peak spawning period distinctly differed between the breeding systems employed. The interval between successive spawning ranged from 10 to 308 days, with 46% of repetitive spawning occurring within 10 to 30 days. Pairs exhibited parental care by cleaning the substratum, protecting territory, caring for eggs and young ones. The clutch size varied from 347 to 2548, depending on the size, spawning frequency and inter-spawning interval. The indoor tank gave an average egg count of 1104 ± 192 (mean ± SD) and that was 747 ± 21 (mean ± SD), in the outdoor system. The hatching rate with ex-situ incubation was 88.6% ± 2% for outdoor and 77.4% ± 4.6% for indoor breeding tanks. The eggs hatch in about 66 to 72 h post spawning at a water temperature of 26 to 30°C. The water temperature and photoperiod are found to be important physical factors influencing spawning in Pearlspot. The water temperature of 27 to 30°C with a shorter day length of 11:30 to 12:00 are ideal for getting continuous spawning. Adopting an integrated breeding approach can achieve year round production cost effectively.</p>","author":"Binu Varghese, \nGrace George, \nSoundararajan Thiruvarasu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"b18caee8f7f23904ce200645f931430ef802f7bc3181bd04400357523f0dece9","category":"Environment"}