{"title":"Amino acid‐specific nitrogen stable isotope analysis reveals the trophic behavior of Icelandic fin whales in winter and suggests variable feeding strategies","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13097?af=R","date":1719897016000,"content":"<h2>Abstract</h2>\n<p>Fin whales (<i>Balaenoptera physalus</i>) aggregate west of Iceland during summer, where they feed mostly on krill, but their winter distribution is poorly known. This study investigates the winter behavior of fin whales that summer off Iceland by analyzing amino acid-specific nitrogen isotope ratios in the baleen plates. This technique is increasingly used in large marine vertebrates to discriminate between changes in trophic position and changes in isotopic baseline levels, while ruling out the effect of fasting on these patterns. Analyses were conducted on samples extracted from two baleen plate segments: one corresponding to winter, another to summer. The trophic position was higher and slightly more variable in winter (3.6 ± 0.7) than in summer (3.0 ± 0.4), which indicates that during winter fin whales tend to feed on fish and are more generalist in feeding habits. Interestingly, the δ<sup>15</sup>N<sub>Phe</sub> values were not lower in winter than in summer (winter: 5.2‰ ± 2.4‰; summer: 4.0‰ ± 2.1‰). This was unexpected because baseline δ<sup>15</sup>N values (e.g., zooplankton) tend to be lower at low latitudes, where fin whales are believed to spend the winter. Fin whales may remain in relatively high latitudes during winter or visit low-latitude areas with locally higher than average δ<sup>15</sup>N values, such as upwelling areas.</p>","author":"Diego Rita, \nAsunción Borrell, \nDirk Wodarg, \nGísli Víkingsson, \nRaquel García‐Vernet, \nAlex Aguilar, \nNatalie Loick‐Wilde","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"b18db3e118c2aefa5c65de246c96ab1f0618f8e22a097fc1ffba45230b423079","category":"Environment"}