{"title":"It seemed like a good idea at the time: 9 car designs that went nowhere","link":"https://arstechnica.com/?p=1972779","date":1696419345000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Amphicar-color-800x450.jpg\" alt=\"It seemed like a good idea at the time: 9 car designs that went nowhere\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Amphicar-color.jpg\">Enlarge</a> (credit: Michael Reinhard | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ford Motor Company had a better idea, <a href=\"https://www.youtube.com/watch?v=c5NcVB9udRA\">as it once advertised</a>, producing such iconic cars as the Mustang, Bronco, Thunderbird, and Model T. But it also built the ill-fated Edsel. Ford wasn't alone, either; many inventors and engineers have produced cars that seemed like a good idea until they actually acted on it. Here are a few examples.</p>\n<h2>1899 Horsey Horseless</h2>\n<p>Kellogg's cereal wasn't the only product to emanate from Battle Creek, Michigan. The Horsey Horseless also came from there, although it's unknown whether this vehicle was ever actually built. Still, it was a solution to a common problem in the early days of motoring, when automobiles were still uncommon and scared horses. Uriah Smith thought that sticking a horse head on the front of a horseless carriage would prevent horses from getting upset upon seeing one.</p>\n<p>\"It would have all the appearance of a horse and carriage and hence raise no fears in any skittish animal,\" he wrote. \"Before he could discover his error and see that he had been fooled, the strange carriage would be passed, and then it would be too late to grow frantic and fractious.\"</p></div><p><a href=\"https://arstechnica.com/?p=1972779#p3\">Read 42 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972779&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b18e115f518afeb89013917448a393f90e8422d0239d72069d30b13c0fc2a5d2","category":"Tech"}