{"title":"Investigating the effect of host plant identity on instar number in fall webworm, a common generalist herbivore","link":"https://academic.oup.com/ee/article/53/1/188/7516436?rss=1","date":1704931200000,"content":"<span><div>Abstract</div>For herbivorous insects with a broad diet breadth, host plant identity can influence larval development by either accelerating or delaying growth. For some species of Lepidoptera, the number of larval instars varies depending on the host plant’s identity. Fall webworm (<span>Hyphantria cunea</span>, Drury) is a polyphagous herbivore that feeds on over 450 host plants worldwide. Of the 2 morphotypes (red- and black-head) of fall webworm, the number of instars for the red-head fall webworms has not been characterized. Given its broad diet breadth, fall webworm developmental stages may vary with plant identity. We investigated whether host plant identity affected the number of instars observed during red-head fall webworm development. We measured the head capsules of over 6,000 fall webworm larvae reared on 6 different plants commonly eaten by fall webworms in Colorado. We modeled head capsule widths as Gaussian mixture models, with a Gaussian distribution that corresponded to each instar. We show that our red-head fall webworms varied in number of instars depending on the identity of their host plant upon which they fed. We found that red-head fall webworm exhibited 7 instars on 5 of the host plants and 8 instars on 1 host plant that we studied. Our results for the number of instars for red-head fall webworm are consistent with reports of the number of instars for black-head fall webworm. Our research provides insight into the influence of host plant identity on fall webworm development, which can be used to advance lab and field research of this species.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"b1905af68d22fa0714687978319b95bf56e4970a2b6f2c1868d82de34c4c36fc","category":"Environment"}