{"title":"รวมรีวิว Like A Dragon: Infinite Wealth คะแนน 90/100 เกม J-RPG เนื้อเรื่องเข้มข้นมีอะไรให้ทำเยอะ","link":"https://www.blognone.com/node/137845","date":1706102711000,"content":"<div><div><div><p>บรรดาสื่อเกมต่าง ๆ ได้ปล่อยบทวิจารณ์เกม Like A Dragon: Infinite Wealth เกม J-RPG โดย Ryu Ga Gotoku Studio ผู้พัฒนาเกม Yakuza ตัวเกมได้คะแนนเฉลี่ย 90/100 จากทั้ง Metacritic และ Opencritic เว็บไซต์ที่รวบรวมคะแนนรีวิวจากหลายสำนัก ส่วนใหญ่บอกไปทางเดียวกันว่าเป็นมาตรฐานใหม่ของซีรี่ส์ เกมมีเนื้อเรื่องเข้มข้น, ระบบการเล่นที่หลากหลาย พร้อมกับปริมาณคอนเทนท์ที่มีอะไรให้ทำเยอะ แต่มีข้อสังเกตคือเนื้อเรื่องเสริมสนุกกว่าเนื้อเรื่องหลัก โดยมีตัวอย่างคำจารณ์จากสื่อดังนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4411f2cb6d9c6fcd8775e564853f0f7c.jpg\" /></p>\n<p><a href=\"https://www.videogameschronicle.com/review/like-a-dragon-infinite-wealth/\">VGC</a> 10/10 : Like a Dragon: Infinite Wealth เป็นหนึ่งในเกม RPG ที่ดีที่สุดในรอบหลายปี ระบบต่อสู้ที่ยอดเยี่ยม ตัวละครที่น่ามหัศจรรย์ พร้อมความแปลกเฉพาะตัวที่เราไม่อยากให้คุณพลาด ไม่เพียงแค่นั้น แต่เกมยังเต็มไปด้วยกิจกรรมให้ทำมากมาย ทีมงานอาจต้องใช้เวลาอีก 3 สัปดาห์กับเกมนี้ แต่คิดว่าคงยังเก็บทุกอย่างไม่ครบอยู่ดี</p>\n<p><a href=\"https://gamingtrend.com/feature/reviews/like-a-dragon-infinite-wealth-review-double-the-hero-infinite-times-the-fun/\">GamingTrend</a> 95/100 : เกม Like a Dragon: Infinite Wealth เป็นชัยชนะและเป็นความต่อเนื่องที่คุ้มค่าของแฟรนไชส์ Like a Dragon ผู้พัฒนา RGG Studio ปรับปรุงกลไกการเล่นและคุณสมบัติของเกมภาคก่อนแทบทุกทาง ในขณะเดียวกันก็รักษาคุณภาพการเล่าเรื่อง และเอกลักษณ์ที่ตลกขบขันของซีรีส์นี้ไว้อย่างครบถ้วน แม้เกมจะมีข้อบกพร่องอยู่บ้าง แต่จุดแข็งของเกมกลับกลบข้อบกพร่องเหล่านั้นได้ เกมนี้สมควรได้รับการยกย่องในด้านความทะเยอทะยาน และนวัตกรรม ไม่ต้องสงสัยเลยว่า Infinite Wealth เป็นเกมช่วงต้นปีที่ไม่ควรพลาด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/70c736355621776b1b158a7e2b6c913d.jpg\" /></p>\n<p><a href=\"https://www.psu.com/reviews/like-a-dragon-infinite-wealth-review-ps5/\">PlayStation Universe</a> 9/10 : แม้จะเปลี่ยนชื่อแฟรนไชส์ให้เข้ากับโลกตะวันตก แต่ Like a Dragon: Infinite Wealth ทำให้เราหลงรักซีรี่ส์นี้มากกว่าเดิม เกมมีเนื้อหาที่หลากหลายมากมายให้เจาะลึก, เรื่องราวที่ทะเยอทะยาน และน่าให้กำลังใจ ช่วยทำให้เกมภาคนี้กลายเป็นสิ่งที่แฟน ๆ ของซีรีส์นี้จะต้องชื่นชอบอย่างแน่นอน RGG Studios ได้ขัดเกลารากฐานของระบบการต่อสู้ RPG ใหม่ให้โดดเด่นขึ้น และผลลัพธ์ที่ได้คือเกมที่เต็มไปด้วยจิตวิญญาณที่มอบประสบการณ์ที่สนุกสนานตั้งแต่ต้นจนจบ เป็นการกระโดดอย่างทะเยอทะยานไปสู่ขอบเขตใหม่ของแฟรนไชส์และจะดีกว่านี้ ถ้าคุณติดตามเรื่องราวของ Like A Dragon มาตลอด</p>\n<p><a href=\"https://www.gamespew.com/2024/01/like-a-dragon-infinite-wealth-review/\">GameSpew</a> 8/10 : เป็นเกมที่มีขนาดใหญ่ที่สุดในซีรี่ส์ ใครซื้อมาเล่นไม่ผิดหวังแน่นอน แม้ว่าเนื้อเรื่องหลักมักถูกขัดขวางหรือถูกเบี่ยงเบนอยู่บ่อยครั้ง เพื่อแนะนำกลไกใหม่ของเกมหรือเนื้อเรื่องเสริมใหม่ ๆ แต่ก็ยังมีอะไรอีกมากมายที่ให้คุณจับต้องได้ และระบบต่อสู้สนุกแบบเทิร์นเบสทำให้เกมสนุกขึ้นมากเมื่อเทียบระบบที่เป็นเกมแอคชั่น เกมมีเนื้อเรื่องยาวที่เต็มไปด้วยการหักมุมที่น่าประหลาด และกระตุ้นอารมณ์ได้หลากหลาย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/31ab44a932a8aedbe0c3e11dc2a54fb9.png\" /></p>\n<p><a href=\"https://noisypixel.net/like-a-dragon-infinite-wealth-review/\">Noisy Pixel</a> 8/10 : Like a Dragon: Infinite Wealth เป็นตัวอย่างของความท้าทายในการตอบสนองความคาดหวังที่หลากหลายของแฟน ๆ ได้ เกมสร้างความสมดุลระหว่างมรดกและนวัตกรรมได้อย่างเชี่ยวชาญ แต่บางครั้งเกมก็สะดุด ด้วยการเว้นจังหวะเล่าเนื้อเรื่องหลักไปเล่าเรื่องอื่น และบทสรุปของเรื่องที่ไม่สมบูรณ์ แม้จะมีข้อบกพร่อง แต่ระบบต่อสู้ และกิจกรรมเสริมที่มีฉากหลังเป็นฮาวายและญี่ปุ่นสร้างประสบการณ์ที่น่าสนใจ สำหรับผู้ชื่นชอบซีรีส์นี้ Infinite Wealth อาจไม่ถูกใจทั้งหมด แต่นี่เป็นการแสดงความเคารพอย่างจริงใจต่อเรื่องราวที่ยืนยาวของแฟรนไชส์นี้ โดยนำเสนอภาพรวมของอนาคตที่น่าตื่นเต้น</p>\n<p>Like A Dragon: Infinite Wealth จะวางจำหน่ายวันที่ 26 มกราคมนี้บนเครื่อง PS4, PS5, Xbox One, Xbox Series X/S และ PC</p>\n<p>ที่มา - <a href=\"https://www.metacritic.com/game/like-a-dragon-infinite-wealth/\">Metacritic</a>, <a href=\"https://opencritic.com/game/15906/like-a-dragon-infinite-wealth\">Opencritic</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/like-a-dragon\">Like a Dragon</a></div><div><a href=\"/topics/sega\">Sega</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b1a157f993306b6b27a1027408ae1f831d5da229b316cac4935294dc9c027b0b","category":"Thai"}