{"title":"Reddit’s teach-the-controversy stance on COVID vaccines sparks wider protest","link":"https://arstechnica.com/?p=1790901","date":1630432636000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-reddit-logo-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-reddit-logo.jpg\">Enlarge</a> (credit: Getty Images | SOPA Images )</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Over 135 subreddits have gone dark this week in protest of Reddit's refusal to ban communities that spread misinformation about the COVID pandemic and vaccines.</p>\n<p>Subreddits that went private include two with 10 million or more subscribers, namely r/Futurology and r/TIFU. The PokemonGo community is one of 15 other subreddits with at least 1 million subscribers that went private; another 15 subreddits with at least 500,000 subscribers also went private. They're all listed in a post on <a href=\"https://www.reddit.com/r/N8theGr8/comments/pelle1/subs_going_dark/\">r/VaxxHappened</a> which has been coordinating opposition to Reddit management's stance on pandemic misinformation. More subreddits are being added as they join the protest.</p>\n<p>\"Futurology has gone private to protest Reddit's inaction on COVID-19 misinformation,\" a message on that <a href=\"https://www.reddit.com/r/futurology\">subreddit</a> says. \"Reddit won't enforce their policies against misinformation, brigading, and spamming. Misinformation subreddits such as NoNewNormal and r/conspiracy must be shut down. People are dying from misinformation.\"</p></div><p><a href=\"https://arstechnica.com/?p=1790901#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790901&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b1a3f632c9191b88fbb178b7aa46bd6951159a4ddd6877a716da9869ce5fff1b","category":"Tech"}