{"title":"Sweeping “Green Deal” promises to revamp EU economy, slash carbon pollution","link":"https://arstechnica.com/?p=1780181","date":1626282521000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1041010420-800x597.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1041010420.jpg\">Enlarge</a> <span>/</span> Industrial climber Torsten Kuehne repairs a wind turbine about 60 meters high in Wulkow, Germany. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/industrial-climber-torsten-kuehne-repairs-a-wind-turbine-news-photo/1041010420?adppopup=true\">Patrick Pleul/picture alliance</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The European Union today unveiled a dozen pieces of legislation that would overhaul the bloc’s economy in an effort to slash carbon emissions.</p>\n<p>The sweeping “<a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_21_3541\">Green Deal</a>” proposal would cut carbon pollution 55 percent below 1990 levels by leaning heavily on renewable energy and electric vehicles while also introducing a border carbon adjustment on imports and taxing aviation and maritime fuels. Together, the reforms signal the beginning of the end of fossil fuels in the EU. “The fossil fuel economy has reached its limits,” said European Commission President Ursula von der Leyen.</p>\n<p>Europe has already begun the transition away from fossil fuels, but it became clear to leaders that it wasn’t happening quickly enough. “We’re not just faced with an industrial revolution; we’re also faced with an existential threat, which is the climate crisis,” Frans Timmermans, European Commission executive vice president<span> </span>for the European Green Deal, said during a news briefing. “You don’t have the luxury to say, 'Let’s very smoothly develop toward this change.' We have to do it quite radically.”</p></div><p><a href=\"https://arstechnica.com/?p=1780181#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780181&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b1aa646fc9477a5397b538e8657109eb5740aad3a7035f2273b095a416cb5498","category":"Tech"}