{"title":"Bing Censors Image Search for ‘Tank Man’, Even in U.S.","link":"https://www.vice.com/en/article/qj8v9m/bing-censors-tank-man","date":1622839050000,"content":"\n<p>Joseph Cox, writing for Vice:</p>\n\n<blockquote>\n  <p>Bing, the search engine owned by Microsoft, is not displaying\nimage results for a search for “Tank man,” even when searching\nfrom the United States. The apparent censorship comes on the\nanniversary of China’s violent crackdown on protests in Tiananmen\nSquare in 1989. […]</p>\n\n<p>Bing displays ordinary, non-image search results for “tank man”\nwhen searching from a U.S. IP address; the issue only impacts the\nImages and Videos tabs. Google, for its part, displays both when\nconnecting from the same IP address.</p>\n\n<p>Motherboard verified that the issue also impacts image searches on\nYahoo and DuckDuckGo, which both use Bing. Neither company\nimmediately responded to a request for comment.</p>\n</blockquote>\n\n<p>George Orwell, <em>1984</em>:</p>\n\n<blockquote>\n  <p>In the walls of the cubicle there were three orifices. To the\nright of the speakwrite, a small pneumatic tube for written\nmessages, to the left, a larger one for newspapers; and in the\nside wall, within easy reach of Winston’s arm, a large oblong slit\nprotected by a wire grating. This last was for the disposal of\nwaste paper. Similar slits existed in thousands or tens of\nthousands throughout the building, not only in every room but at\nshort intervals in every corridor. For some reason they were\nnicknamed memory holes. When one knew that any document was due\nfor destruction, or even when one saw a scrap of waste paper lying\nabout, it was an automatic action to lift the flap of the nearest\nmemory hole and drop it in, whereupon it would be whirled away on\na current of warm air to the enormous furnaces which were hidden\nsomewhere in the recesses of the building.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/04/bing-tank-man\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b1af4f5de03e29e1b7a3ec23e52028e35577b680664aa5d3d9d278e08a163e33","category":"Tech"}