{"title":"Valve’s move to drop macOS High Sierra and Mojave could affect some Steam games","link":"https://www.macworld.com/article/2160254/valve-steam-end-support-macos-10-13-high-sierra-10-14-mojave.html","date":1701445422000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Earlier this year, Valve’s Steam ended support for macOS 10.11 and 10.12, which came and went with few people noticing. But next year, Steam is making a change that more Mac users are likely to notice.</p>\n\n\n\n<p>According to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://help.steampowered.com/en/faqs/view/743F-2E0E-C9A5-C375&amp;xcust=1-1-2160254-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Steam Support blog</a>, on February 15, Steam will stop supporting macOS 10.13 (High Sierra) and 10.14 (Mojave), which were released in 2017 and 2018 respectively. What’s notable about macOS Mojave is that it was the <a href=\"https://www.macworld.com/article/232735/how-to-check-if-mac-software-is-32-or-64-bit.html\">last version of macOS to run 32-bit apps</a>. From Catalina onward, all apps need to be 64-bit so they can be optimized and run more efficiently. So once it drops support for Mojave, Steam will also “stop considering games that offer only 32-bit macOS binaries to be Mac compatible at the end of 2023.”</p>\n\n\n\n<p>Valve blames the move on the use of an embedded version of Google Chrome, which no longer functions on older versions of macOS. Consequently, future versions of Steam will require macOS features and security updates only available in macOS 10.15 Catalina and above.</p>\n\n\n\n<p>That means any 32-bit games in your Steam library might not work anymore. Steam notes that more than 98 percent of Steam customers on Mac are already running macOS 10.15 or newer, so most users shouldn’t see a change in their day-to-day gameplay. But anyone who has a favorite 32-bit game hanging around should get a few final runs in before it stops working.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b1af9ba06cb610c54feaa4449c7a4cb3298c1bec5066902e2a7c1078951b1e2c","category":"Apple"}