{"title":"274 Socialization of piglets during suckling enhanced feed intake after weaning but did not alter their response to dietary amino acid concentration","link":"https://academic.oup.com/jas/article/102/Supplement_2/165/7664719?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The present study hypothesized that pre-weaning socialized piglets would reduce damaging behavior and when fed an increased dietary standardized ileal digestible (SID) Lys (and amino acids) to net energy (NE) ratio post-weaning would increase early post weaning feed intake (FI) and growth performance, and in nursery pigs. Socializing included two groups of five sows and their litters for which farrowing pen walls were removed allowing piglets to co-mingle for 10 d before weaning (S) whereas traditionally housed piglets pertained to housing a single sow with her litter (T; n = 15). At weaning, 120 mixed-gender piglets [7.2 ± 0.7 kg body weight (BW)] were allocated based on litter origin, sow parity, and piglet BW to 12 pens equipped with single-space electronic feeding stations with 10 pigs/pen for a 41-d study. In this 2 × 2 factorial arrangement, factors were litter background (socialized vs. traditional) and dietary SID Lys: NE (High 1.32 vs. Low 1.15 SID Lys:NE MJ/kg). Daily individual FI and BW and skin injuries at different timepoints after weaning were determined. Wheat-barley based diets were isoenergetic (10.6 MJ/kg) and offered in two phases (i.e., d 0-14 and d 14-41). The day after weaning, socializing reduced the proportion of piglets with more than five skin injuries from 45.7% to 3.0% compared with traditional housing (<span>P</span> &lt; 0.05). Early post-weaning, daily FI was 50% greater for S-LowLys:NE pigs than S-HighLys:NE on d1, then, T-LowLys:NE was greatest (~25% above other treatments) during d 3-6 (all <span>P</span> &lt; 0.05). The trend maintained during d 6-8 with T-LowLys:NE and S-HighLys:NE being similar each other (<span>P</span> &gt; 0.05). The average number of visits per day during the first 10 d was greater (<span>P</span> &lt; 0.01) for S-HighLys:NE and T-LowLys:NE (33 visits each) compared with T-HighLys:NE (24 visits). Overall, S-HighLys:NE pigs tended (<span>P</span> &lt; 0.10) to have a greater end BW (23.8 vs. 22.1 kg) and a greater d 0-41 average daily gain (ADG) than T-HighLys:NE (530 vs. 472 g/d). For d22-29, the average daily gain (ADG), average daily feed intake (ADFI), and feed efficiency (FE), were greater for S-HighLys:NE and T-LowLys:NE compared with S-LowLys:NE and T-HighLys:NE (P &lt; 0.05). No other meaningful interactions were observed between socializing and Lys:NE on growth performance. However, looking at main factors, socializing increased ADG during d 29-41 by 9% (<span>P</span> = 0.01) coinciding with a 4% greater FE (<span>P</span> = 0.09). The data suggest that traditionally housed piglets fed a HighLys:NE diet post-weaning had lower daily FI and growth performance compared with T-LowLys:NE and socialized piglets irrespective of the Lys:NE contrast. In conclusion, the present study led to a better understanding of nutritional requirements and FI in situations with different pre-weaning housing schemes of piglets. In the present conditions, pre-weaning socialization of pigs may stimulate feed intake earlier post-weaning and allow a better transition independently from the Lys (and amino acid) to NE ratio.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b1b76f02b926577c9d7a8d8f72019fef7a1a35e836d4b325235ef5b1b47d0c26","category":"Environment"}