{"title":"Phylogenetics and taxonomy of the Indo-Australian genus Ulonemia sensu Drake (Hemiptera: Tingidae), with the recognition of new genera and species collected from Proteaceae in Australia","link":"https://academic.oup.com/zoolinnean/article/200/2/360/7252982?rss=1","date":1693180800000,"content":"<span><div>Abstract</div>Tingid classification has been problematic since the recognition of the family. The exaggerated ornamentation of many tingids has caused confusion in morphology-based phylogenies due to convergence. Also, some genera, like <span>Ulonemia</span>, lack exaggerated structures and their diagnoses rely on reduced morphology, making identification difficult. The relationship between these genera is of great interest, as several species of <span>Ulonemia</span> have recently become pests of <span>Macadamia</span>, and several of these genera are found on other Proteaceae.We used 16S, <span>COI</span>, 18S, and 28S to determine genus-level relationships of <span>Ulonemia</span> and other Australian Tingidae using maximum likelihood (ML) and Bayesian inference. We also analysed a morphological dataset using maximum parsimony. The parsimony analysis yielded numerous morphological homoplasies, and most deep clades lacked support. The ML and Bayesian analyses had strong support and returned a paraphyletic <span>Ulonemia</span> with three strongly supported clades. Two new genera, <span>Cercotingis</span> gen. nov. and <span>Proteatingis</span> gen. nov., are erected and <span>Ulonemia</span> redescribed to account for the observed phylogenies. Three new species of <span>Cercotingis</span> (<span>C</span>. <span>croajingolong</span> sp. nov., <span>C</span>. <span>namadgi</span> sp. nov., and <span>C</span>. <span>tasmaniensis</span> sp. nov.) and four new species of <span>Proteatingis</span> (<span>Pr</span>. <span>astibosetes</span> sp. nov., <span>Pr</span>. <span>howardi</span> sp. nov., <span>Pr</span>. <span>minuta</span> sp. nov., and <span>Pr</span>. <span>xouthos</span> sp. nov.) are described, with keys to species of <span>Cercotingis</span> and <span>Proteatingis</span>.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"b1ba2d5442d55bfef22844d6b7fb06368479fc725b6c7a5337e02c13087d90f8","category":"Environment"}