{"title":"Tidal pumping and intertidal groundwater springs create pronounced spatiotemporal thermal variability in a coastal lagoon","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12661?af=R","date":1729618018000,"content":"<h2>Abstract</h2>\n<p>Intertidal groundwater springs provide thermally stable, nutrient-rich freshwater that causes fine-scale variability in water temperature and salinity and promotes biodiversity in coastal estuaries and lagoons. In this study, we combined three thermal sensing techniques to elucidate summer water temperature patterns at the mouths of intertidal groundwater springs and the ambient coastal lagoon in Prince Edward Island, Canada. Thermal infrared imagery captured the spatiotemporal variability in relative temperatures of the lagoon channel and cold-water plumes from the springs. Thermal anomalies due to the springs were detected at the surface throughout a tidal cycle, suggesting that the thermal plumes were buoyant. Fiber-optic distributed temperature sensing paired with temperature loggers near the spring outlets recorded groundwater temperatures at low tide (~ 7°C) but ambient lagoon temperatures (up to 26°C) at high tide due to the vertical thermal gradient in the stratified water column. Calculated estuarine Richardson numbers throughout the study confirm intertidal spring buoyancy due to salinity differences. The fiber-optic distributed temperature sensing results revealed pronounced variations in temperature as evidenced by spatial (3.7°C) and temporal (5.5°C) standard deviations over the cable length during the study and lower mean lagoon bed water temperatures at high tide (22.5°C) than low tide (24.3°C) due to heat advection from tidal pumping. Lagoon temperatures fluctuate at diurnal (solar) and semi-diurnal (tidal) frequencies. The findings emphasize the efficacy of a multi-technology approach to reveal fine-scale and dynamic thermal processes that drive temperature patterns and habitat distribution in coastal lagoon ecosystems and highlight the thermal influence of intertidal springs.</p>","author":"Kathryn A. Smith, \nJeffrey M. McKenzie, \nBarret L. Kurylyk","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"b1c06e23c62d84ca3329239c553303f8b371b0f9101fa5fcc2164a7cc7ea76f4","category":"Environment"}