{"title":"Nomad Launches New Glow in the Dark Sport Band for Apple Watch","link":"https://www.macrumors.com/2023/08/08/nomad-glow-in-the-dark-apple-watch-band/","date":1691510400000,"content":"Nomad today released a limited edition <a href=\"https://nomadgoods.com/products/sport-band-glow\">Glow in the Dark Sport Band</a> that is designed for the Apple Watch. The band, priced at $60, is compatible with the 49mm, 45mm, 44mm, and 42mm Apple Watch models.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/nomad-glow-band.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nLike Nomad's other Sport Band options, the Glow in the Dark model is made from FKM fluoroelastomer rubber, and it is waterproof, so it can be worn when swimming, in the ocean, and during sweaty activities. The material is stiffer than Apple's version of the Sport Band, but it is comfortable on the wrist.\r<br />\n\r<br />\nThere's a pin-and-tuck mechanism to close the band for a secure closure, and interior ventilation channels add breathability to keep the watch band from getting too moist underneath, similar to Apple's Nike bands. In our testing, the Sport Band does indeed glow in the dark as advertised, though the glow is a bit more subtle than depicted in Nomad's photos. The band needs to have light exposure before it is able to glow in the dark, and the brightness will depend on the amount of light that it gets.\r<br />\n\r<br />\nDuring the day, the band is an unassuming white color, but when the lights go out, it glows green.\r<br />\n\r<br />\nNomad has been releasing multiple limited edition versions of the Sport Band, so the new model joins Blaze, Atlantic Blue, Electric Blue, and High Volta.\r<br />\n\r<br />\nThe Glow in the Dark Sport Band can be <a href=\"https://nomadgoods.com/products/sport-band-glow\">purchased from the Nomad website</a> for $60.<div>Tag: <a href=\"https://www.macrumors.com/guide/nomad/\">Nomad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/08/nomad-glow-in-the-dark-apple-watch-band/\">Nomad Launches New Glow in the Dark Sport Band for Apple Watch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nomad-launches-new-glow-in-the-dark-sport-band-for-apple-watch.2398080/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b1c24d4227426de6ab4f865f8bf11abc4549a633fd158f66beafc20c9f92c9f8","category":"Apple"}