{"title":"The anterior cingulate cortex controls the hyperactivity in subthalamic neurons in male mice with comorbid chronic pain and depression","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002518","date":1708610400000,"content":"<p>by Ying-Di Wang, Shu-Ting Bao, Yuan Gao, Jin Chen, Tao Jia, Cui Yin, Jun-Li Cao, Cheng Xiao, Chunyi Zhou</p>\r\n\r\nNeurons in the subthalamic nucleus (STN) become hyperactive following nerve injury and promote pain-related responses in mice. Considering that the anterior cingulate cortex (ACC) is involved in pain and emotion processing and projects to the STN, we hypothesize that ACC neurons may contribute to hyperactivity in STN neurons in chronic pain. In the present study, we showed that ACC neurons enhanced activity in response to noxious stimuli and to alterations in emotional states and became hyperactive in chronic pain state established by spared nerve injury of the sciatic nerve (SNI) in mice. In naïve mice, STN neurons were activated by noxious stimuli, but not by alterations in emotional states. Pain responses in STN neurons were attenuated in both naïve and SNI mice when ACC neurons were inhibited. Furthermore, optogenetic activation of the ACC-STN pathway induced bilateral hyperalgesia and depression-like behaviors in naive mice; conversely, inhibition of this pathway is sufficient to attenuate hyperalgesia and depression-like behaviors in SNI mice and naïve mice subjected to stimulation of STN neurons. Finally, mitigation of pain-like and depression-like behaviors in SNI mice by inhibition of the ACC-STN projection was eliminated by activation of STN neurons. Our results demonstrate that hyperactivity in the ACC-STN pathway may be an important pathophysiology in comorbid chronic pain and depression. Thus, the ACC-STN pathway may be an intervention target for the treatment of the comorbid chronic pain and depression.","author":"Ying-Di Wang","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"b1d17fc21deb4d94469c05f935cdc9ee218db54b661ea228bd0fdeea90f7f412","category":"Environment"}