{"title":"Surface Characteristics of Activated Carbon Sorbents Obtained from Biomass for Cleaning Oil-Contaminated Soils","link":"https://www.preprints.org/manuscript/202407.1469/v1","date":1721285496000,"content":"This study investigates the characteristics of activated carbons derived from biomass plant residues: rice husk (OSL) of the genus Oryza, reed stalks (PhAC) of the genus Phragmites, pine sawdust (PSL) of the genus Pinus, and wheat straw (TAL) of the genus Triticum. Activation was carried out using potassium hydroxide, employing a two-stage pyrolysis under air. The study examined the influence of activation temperature, duration, concentration of the impregnating agent, and impregnation time. Characteristics such as sorbent porosity, bulk density, and hydrocarbon sorption capacity were determined. Adsorption capacity was assessed using BET analysis and the iodine number determination method, with the highest iodine number achieved being 2809 mg/g, indicating high adsorption capability. The structural morphology of the activated carbons was evaluated by SEM, and their chemical surface characteristics were identified by IR spectroscopy. Computational analysis of the nitrogen sorption isotherms using the Barrett-Joyner-Halenda (B-J-H) method and the Dubinin-Radushkevich (D-R) equation showed that activated carbon samples from rice husk and pine sawdust possess a developed specific surface area and contain micro- and mesopores. The Dubinin-Astakhov (D-A) approach was used to study the pore diameter of activated carbon, revealing significant findings on pore structure. The maximum micropore volume was found in activated carbon samples from pine sawdust (PSL), measuring 0.46 cm³/g. All activated carbon samples of plant origin were tested under field conditions for the remediation of oil-contaminated areas near the “Zhanatalap” oil field in the Atyrau region. By the 16th day, the oil-contaminated soil treated with rice husk activated carbon was cleaned by 67.1%.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b1d5f26b9d3fca02573a91ebe258d16fd0929553c9dc2364e40b912cc345e69c","category":"Interdisciplinary"}