{"title":"What Leonardo Da Vinci Can Teach Us About Web Design","link":"https://smashingmagazine.com/2023/03/leonardo-da-vinci-teach-web-design/","date":1678809600000,"content":"<p>Exhaustive, sometimes bizarre notes… wireframes… mind-bending blends of art and science. Is it a GitHub repository? No, it’s the life of a Renaissance genius. With the right lessons, we can all write some da Vinci code.</p>\n<p>Web development is a pretty big tent. It encompasses color, mathematics, accessibility, typography, photography, copywriting, ethics, and the list goes on and on. The web is a near-infinite world which — for all its relentless innovation and disruption — inherits many of its most beautiful qualities from old ways. </p>\n<p>It is in that spirit that we’ll be looking at the Italian polymath Leonardo da Vinci, the latest in a rather eclectic lineup of old maestros I’ve had the pleasure of writing about: </p>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2019/11/newspapers-teach-web-design/\">What Newspapers Can Teach Us About Web Design</a>”</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/02/saul-bass-teach-web-design/\">What Saul Bass Can Teach Us About Web Design</a>”</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/06/vitruvius-web-design/\">What Vitruvius Can Teach Us About Web Design</a>”</li>\n</ul>\n<p>Perhaps more than any other person in history, da Vinci showed the kind of magic that can happen in the overlap between art and science, where much of web development lives. His methods and outlooks are as applicable today as they were in Renaissance Italy.</p>\nDocument Your Thoughts, Ideas, And Work\n<p>Da Vinci was a fastidious writer, producing tens of thousands of pages of notes and sketches during his life. Their content ranged from mundane to genius, and that was part of their value. One day it’s <a href=\"https://www.rct.uk/about/news-and-features/leonardo-da-vincis-to-do-list-revealed#/\">a shopping list</a>, another it’s flying machines. There was no filter, no preciousness, only expression and exploration.  </p>\n<p>This exhaustive documentation was valuable for a number of reasons. They were of benefit to him as an outlet for his thoughts, ambitions, and experiences and as points of reference for long-term projects. Getting his thoughts down allowed them to be tested and iterated on.  </p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/1-flying-machine-sketches.jpg\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/2-helicopter-sketches.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/3-character-studies.png\" /></p>\n<p>The benefits of such extensive documentation were not limited to da Vinci himself. Writing his ideas down also allowed them to survive him for the benefit of countless millions since. Centuries on his notebooks continue to surprise, delight and educate.</p>\n<p>Da Vinci’s zeal for writing and sketching lends itself to web development. First is the powerful — sometimes downright mysterious — creative freedom of jotting down what’s going on inside your head. Sometimes you start writing down idea A and suddenly find yourself at solution X.</p>\n<p>Not everything we do has to be perfect. Anyone expecting to arrive directly at the final product is going to be disappointed or have a pretty shoddy final product. Writing and sketching give you the license to be playful, maybe even a little bit audacious. Many timeless ideas are born on notebook paper. </p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/4-apple-hand-icon-sketch.jpg\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/5-apple-paint-icon-sketch.png\" /></p>\n<p>There is a sense sometimes that the code we write is akin to sand sculptures — pretty but temporary. This doesn’t have to be the case. Even if the final form of websites continues to change, the thinking behind that evolution is invaluable. How did we get here, and why?</p>\n<p>Documenting your pull requests to survive when you’re dead may be a bit strong, but your successors at old jobs will be grateful for the insight and guidance.</p>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/09/power-pen-paper-sketching/\">The Power Of Pen And Paper Sketching</a>” by Tracy Osborn</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/11/playfulness-code-supercharge-fun-learning/\">Playfulness In Code: Supercharge Your Learning By Having Fun</a>” by Jhey Tompkins</li>\n</ul>\n<p>Web devs and designers ought to document their own journey, be it through PR descriptions or an actual notebook of their own:</p>\n<ul>\n<li>Flesh out ideas,</li>\n<li>Jot down idle thoughts,</li>\n<li>Doodle page layouts.</li>\n</ul>\n<p>May future generations be delighted and awed by your pull request descriptions. May the feature ideas in your GitHub issues be as aspirational as da Vinci’s flying machines. </p>\n<p>The best ideas in the world are of no practical use for as long as they’re stuck in one’s head. </p>\nObsess Over Geometry\n<p>As most famously demonstrated by the Vitruvian Man, da Vinci was a lifelong student of geometry, shape, and proportion. He was fascinated by the recurrence of various shapes in nature, as well as by the workings of proportion and perspective. He understood their value to paintings and architecture alike.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/6-vitruvian-man.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/7-perspective-study.jpg\" /></p>\n<p>Da Vinci took great pains to understand these invisible frameworks and replicate them in his work. Although he is more often remembered for his fine art, everything he did was underpinned by a fascination with science and mathematics. </p>\n<p>These are essential tools for any web developer. Pages look similarly off-kilter if they are not assembled around invisible guidelines. Grids are the most common example of this, but areas like typography and responsive design are similarly rooted in questions of size, proportion, ratio, and shape.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/8-grid-example.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/9-grid-sketches.jpg\" /></p>\n<p>Showing a da Vinci-like interest in the rules behind these subjects is the difference between a website being pleasing to the eye and being a complete disaster. If you’re unsure where to start, then it’s safe to say <em>Smashing</em> has you covered:</p>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2017/12/building-better-ui-designs-layout-grids/\">Building Better UI Designs With Layout Grids</a>” by Nick Babich</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/11/document-object-model-geometry-guide/\">Document Object Model (DOM) Geometry: A Beginner’s Introduction And Guide</a>” by Pearl Akban</li>\n<li>Rachel Andrew’s Understanding CSS Grid series<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/01/understanding-css-grid-container/\">Creating a Grid Container</a>”</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/01/understanding-css-grid-lines/\">Grid Lines</a>”</li>\n<li>“<a href=\"https://www.smashingmagazine.com/understanding-css-grid-template-areas/\">Grid Template Areas</a>”</li>\n</ul>\n</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2010/05/symmetry-a-balancing-act-in-two-or-more-parts/\">Symmetry: A Balancing Act In Two (Or More) Parts</a>” by Maggie Macnab</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2008/05/applying-divine-proportion-to-web-design/\">Applying Divine Proportion To Your Web Designs</a>” by Vitaly Friedman</li>\n<li>“<a href=\"https://css-tricks.com/the-shapes-of-css/\">The Shapes of CSS</a>” by Chris Coyier</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/06/vitruvius-web-design/\">What Vitruvius Can Teach Us About Web Design</a>” by me</li>\n</ul>\n<p>From nature to painting to architecture to web design, applied geometry can create a sense of the sublime.</p>\nThink Right-To-Left\n<p>In his notebooks, da Vinci typically wrote right to left in <a href=\"https://www.mos.org/leonardo/activities/mirror-writing\">‘mirror script’</a>. He only wrote the ‘normal’ way when he intended it to be read by other people. </p>\n<p>Why did he write that way? He was left-handed and wasn’t classically schooled. It prevented him from smudging the ink. It made his ideas harder to steal. Whatever the combination, it’s clearly what he felt most comfortable with.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/10-mirror-script.jpg\" /></p>\n<p>Da Vinci’s mirror script shows the value of embracing ways of working that suit you. Da Vinci didn’t have to justify his methods to anyone else. And neither do you. </p>\n<p>Trust what feels natural and customize the way you work to fit. Personalize your IDE, choose fonts and colors that you like, and write and draw however comes naturally — be that with a tablet or in a leatherbound journal.</p>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/02/inspiring-websites-tools/\">Falling In Love With The Web: Inspiring Websites And Tools</a>” by Cosima Mielke</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/12/tools-tips-resources-to-build-better-user-experiences/\">Useful UX Guidelines, Tools And Resources</a>” by Cosima Mielke</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/01/top-frontend-tools-2022/\">Top Front-End Tools Of 2022</a>” by Louis Lazaris</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/12/optimizing-design-workflow-tools/\">Boosting Productivity For Designers With Efficient Tools</a>” by Ashish Bogawat</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/08/figma-tools-plugins-resources/\">Useful Figma Plugins and Tools</a>” by Janet John</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/08/everything-developers-must-know-about-figma/\">Everything Developers Must Know About Figma</a>” by Chrinstine Vallaure</li>\n</ul>\n<p>Norms being what they are doesn’t necessarily mean that’s how they should be. You will feel better about yourself, and who knows, maybe making space for your methods will allow unexpected ideas to appear.</p>\nFind Good Patrons (Or Failing That, Good Employers)\n<p>Da Vinci was picky about the work he did and the patrons he found. He lived in places that gave space to his flamboyance and creativity. Florence valued the arts, so it valued da Vinci as well as peers like Michelangelo.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/11-florence-painting.jpg\" /></p>\n<p>When he moved to Milan, he delighted the courts with his theatrics, eloquence, and stagecraft. On the other end of the spectrum, da Vinci also spent a couple of years in the service of Cesare Borgia, a man so conniving, violent, and altogether horrible that he was a major inspiration for Machiavelli’s book <a href=\"https://www.gutenberg.org/ebooks/1232\"><em>The Prince</em></a>. Still, it gave him the opportunity to apply himself in new areas like mapping.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/12-imola-map.jpg\" /></p>\n<p>Time inside the belly of the beast can be educational in its own way. However, it’s telling that da Vinci only spent a few years in Borgia’s service before slipping back into the less murderous company.</p>\n<p>Although patrons are all well and good, we, in the world of web development, usually have to settle for employers. We owe it to ourselves — if at all possible — to find spaces for our creativity, to find outlets for our passions, or at the very least, not feel like a cog in some colossal evil machine. </p>\n<p>Have enough pride in your work to channel it into projects you care about. Even da Vinci needed a good working culture. Find your Florence, and if you can’t, do what you can to make where you are a little more like it. </p>\nIterate, Iterate, Iterate\n<p>It may be of some comfort to know that Leonardo da Vinci was, at times, a breathtaking procrastinator. He would take years to complete works, and that’s if he finished them at all. </p>\n<p>Da Vinci worked on many of his paintings for years, including the Mona Lisa, which he took with him on his travels until the day he died. </p>\n<p>Da Vinci’s creations were the result of countless experiments, tangents, and iterations. The final products are what looms large in the public consciousness today, but each was but the final step of long, often difficult journeys. </p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/13-last-supper-and-geometry-study.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/14-last-supper-study.jpg\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/15-the-last-supper.jpg\" /></p>\n<p>One particularly pertinent example of this process in action is <em>Leonardo’s Horse</em>, an equestrian monument da Vinci was commissioned to design and build in 1482 by the Duke of Milan Ludovico il Moro. A decades-long frenzy of research ensued, ranging from horse anatomy to concocting entirely new bronze casting techniques. </p>\n<p>The project was not completed in da Vinci’s lifetime, but his work made it possible for the effort to be renewed when his extensive notes resurfaced in the 20th century. In 1999, a cool 517 years after he was commissioned, da Vinci’s horse was finally unveiled in Milan.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/16-study-of-horses.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/17-horse-statue-study.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/18-horse-casting-mould-sketch.jpg\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/19-da-vinci-horse-milan.jpg\" /></p>\n<p>For all his brilliance, da Vinci was also an exemplar of the power of slow, steady progress — even procrastination. Yes, sometimes inspiration strikes, but more often, we find it at the end of a long, laborious journey. As Steven Pressfield puts it in <a href=\"https://www.goodreads.com/book/show/1319.The_War_of_Art\"><em>The War of Art</em></a>, “The Muse favors working stiffs.” </p>\n<p>In the world of web design, the idea of something being ‘finished’ is pretty quaint. There will always be dependencies to update, tweaks to make, and <a href=\"https://www.smashingmagazine.com/2020/02/foldable-web-meaning/\">new devices to accommodate</a>. This is a good thing. It is true to nature. It’s <em>exciting</em>. In how many fields can one rebuild something they’ve made? Architects don’t have that luxury. Even painters can only change so much before they have to start again.</p>\n<p>The ethereal nature of the web and its technologies lends itself to a da Vinci-esque approach to iteration. Build it, then build it again better. And again. And again. </p>\n<p>Do not get too attached to what it is now. It is valuable, yes, but ultimately a stepping stone to what is to come. It is not about throwing away your work but evolving it. </p>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2021/04/guarding-against-disposable-design/\">Guarding Against Disposable Design</a></li>\n</ul>\n<p>Seldom is a work truly finished. There are always more perfections to be made.</p>\n<blockquote>“Art is never finished, only abandoned.”<br />— Leonardo da Vinci</blockquote>\n\n\n\nFeed Your Inner Polymath\n<p>Leonardo da Vinci was too multifaceted to be tied down with one label. He was a writer, painter, sculptor, architect, inventor, scientist, philosopher, and the list goes on and on. </p>\n<blockquote>“He who loves practice without theory is like the sailor who boards a ship without a rudder and compass and never knows where he may cast.”<br />— Leonardo da Vinci</blockquote>\n\n<p>His knowledge of each field improved his proficiency in others. Anatomical studies led to more realistic illustrations. His studies of light helped him to create more lifelike paintings. </p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/20-study-of-embryos.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/21-studies-of-water.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/22-shoulder-anatomy-studies.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/23-studies-of-legs.png\" /></p>\n<p>This, in part, stemmed from his atypical education. By avoiding the classical syllabus, he was able to explore on his own terms, blurring the lines between different subjects. His understanding of the world was fluid and holistic.</p>\n<p><img src=\"https://files.smashing.media/articles/leonardo-da-vinci-teach-web-design/24-da-vinci-self-portrait.png\" /></p>\n<p>Web developers operate within a similarly vast and beautiful constellation of interconnected disciplines. The really good stuff happens when we tie them together.</p>\n<blockquote>“Technology alone is not enough — it’s technology married with liberal arts, married with the humanities, that yields us the results that make our heart sing.”<br />— <a href=\"https://hbr.org/2011/08/steve-jobss-ultimate-lesson-fo\">Steve Jobs</a></blockquote>\n\n<p>Play with new languages, old languages, frameworks, and libraries. Browse <em>Smashing Magazine</em> categories that you’re a novice in. Go down those rabbit holes. Pull on those threads. As da Vinci said of art, so too is true of the web: it can never be finished, only abandoned. </p>\n<h3>Further Reading</h3>\n<ul>\n<li><a href=\"https://www.goodreads.com/book/show/34684622-leonardo-da-vinci\">Leonardo da Vinci</a> by Walter Isaacson, a superb biography</li>\n<li><a href=\"https://www.goodreads.com/book/show/18077903-creativity-inc\">Creativity, Inc.: Overcoming the Unseen Forces That Stand in the Way of True Inspiration</a> by Ed Catmull, Amy Wallace</li>\n<li>“<a href=\"https://mymodernmet.com/leonardo-da-vinci-notebooks-online/\">Where to View Leonardo da Vinci’s Notebooks Online for Free</a>”, Margherita Cole </li>\n<li>“<a href=\"https://www.wsj.com/articles/SB10001424053111904875404576532342684923826\">Marrying Tech and Art</a>”, Steve Johnson</li>\n<li><a href=\"https://www.artrenewal.org/Artist/Index/186\">Various da Vinci artworks at the Art Renewal Center</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"b1dd7ba09a5c58144644c866f1755b2b6f46f3d7e31d078f708d76a5d4e6f41b","category":"Tech"}