{"title":"Apple บอกความปลอดภัย คือเหตุผลที่ไม่ให้ประเทศนอกกลุ่ม EU ได้ฟีเจอร์โหลดแอปนอก App Store ด้วย","link":"https://www.blognone.com/node/137892","date":1706267074000,"content":"<div><div><div><p>แอปเปิลประกาศว่า iPhone และ iPad จะมี<a href=\"https://www.blognone.com/node/137876\">การเปลี่ยนแปลง</a>ใน iOS 17.4 เช่น การโหลดแอปจากสโตร์ภายนอกได้ จ่ายเงินผ่านช่องทางอื่นได้ และอื่น ๆ อีกหลายอย่าง แต่มีผลเฉพาะกลุ่มประเทศสหภาพยุโรป 27 ประเทศเท่านั้น เพื่อให้เป็นไปตามกฎหมายดิจิทัล <a href=\"https://www.blognone.com/node/129250\">Digital Markets Act (DMA)</a></p>\n<p>คำถามที่หลายคนอยากรู้ แม้จะเดาคำตอบในใจกันได้ไม่ยาก ก็คือประเทศอื่นจะมีโอกาสได้อะไรแบบนี้บ้างไหม? ซึ่งแอปเปิลก็มีคำตอบมาให้แล้ว</p>\n<p>แอปเปิลบอกว่าการเปลี่ยนแปลงจะไม่มีในประเทศที่อยู่นอกกลุ่ม EU เพราะว่าสิ่งที่เปลี่ยนแปลงนี้ไม่ใช่ระบบที่ปลอดภัยที่สุดสำหรับผู้ใช้งาน แอปเปิลแสดงจุดยืนชัดเจนว่าแนวทางของ DMA นั้น เพิ่มความเสี่ยงทั้งมัลแวร์ แอปหลอกลวง และแอปเปิลยังมีอำนาจควบคุมความปลอดภัยและจัดการสิ่งเหล่านี้น้อยลง การเปลี่ยนแปลงตาม DMA หลายอย่างยังไม่ถูกทดสอบ และอาจต้องปรับแก้ไขในอนาคตด้วย</p>\n<p>แอปเปิลยังบอกว่า ความเชื่อถือของลูกค้าเป็นสิ่งพื้นฐานที่แอปเปิลยึดถือไว้ ความเป็นส่วนตัวและความปลอดภัยคือสิ่งสำคัญ กระบวนการตรวจสอบแอปต่าง ๆ ในปัจจุบันมีมาตรฐานและคุณภาพที่ทำให้ผู้ใช้งานยอมรับ กฎหมาย DMA ของ EU ที่ออกมา ทำให้แอปเปิลต้องเปลี่ยนกระบวนการต่าง ๆ ที่กระทบกับผู้ใช้งาน แต่จะทำให้มีผลต่อความเสี่ยงน้อยที่สุด และยังเป็นไปตามกฎหมายที่กำหนด</p>\n<p>ที่มา: <a href=\"https://9to5mac.com/2024/01/25/third-party-app-stores-browsers-eu/\">9to5Mac</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/22a00d9a3361b0c8b8d3bcd9d9522b80.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/europe\">Europe</a></div><div><a href=\"/topics/ios\">iOS</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b1e4a606ebeea380f944389b7639a63a63ad257212f61fadf513a002292881e5","category":"Thai"}