{"title":"Differential effects of polystyrene microplastics on the adsorption of cadmium and ciprofloxacin by tea leaf litter‐derived magnetic biochar: Influencing factors and mechanisms","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11117?af=R","date":1725519600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5efbde53-95b5-45a1-8be4-c6f19165382e/wer11117-toc-0001-m.png\" alt=\"Differential effects of polystyrene microplastics on the adsorption of cadmium and ciprofloxacin by tea leaf litter-derived magnetic biochar: Influencing factors and mechanisms\" />\n<p>Cadmium and ciprofloxacin adsorption by tea leaf litter-derived magnetic biochar were influenced by polystyrene microplastics.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Water pollution involves the coexistence of microplastics (MPs) and traditional pollutants, and how can MPs influence the adsorption of other pollutants by biochar during the treatment process remains unclear. This study aimed to investigate the influence of polystyrene microplastics (PS MPs) on the adsorption of cadmium (Cd) and ciprofloxacin (CIP) by magnetic biochar (MTBC) in the single and binary systems. MTBC was prepared using tea leaf litter; the effects of time, pH, and salt ions on the adsorption behaviors were investigated; and X-ray photoelectronic spectroscopy (XPS) and density flooding theory analysis were conducted to elucidate the influence mechanisms. Results indicated that PS MPs reduced the pollutants adsorption by MTBC due to the heterogeneous aggregation between PS MPs and MTBC and the surface charge change of MTBC induced by PS MPs. The effects of PS MPs on heavy metals and antibiotics adsorption were distinctly different. PS MPs reduced Cd adsorption on MTBC, which were significantly influenced by the solution pH and salt ions contents, suggesting the participation of electrostatic interaction and ion exchange in the adsorption, whereas the effects of PS MPs on CIP adsorption were inconspicuous. In the hybrid system, PS MPs reduced pollutants adsorption by MTBC with 66.3% decrease for Cd and 12.8% decrease for CIP, and the more remarkable reduction for Cd was due to the predominated physical adsorption, and CIP adsorption was mainly a stable chemisorption. The influence of PS MPs could be resulted from the interaction between PS MPs and MTBC with changing the functional groups and electrostatic potential of MTBC. This study demonstrated that when using biochar to decontaminate wastewater, it is imperative to consider the antagonistic action of MPs, especially for heavy metal removal.</p>\n<h2>Practitioner Points</h2>\n<p>\nMagnetic biochar (MTBC) was prepared successfully using tea leaf litter.\nMTBC could be used for cadmium (Cd) and ciprofloxacin (CIP) removal.\nPolystyrene microplastics (Ps MPs) reduced Cd/CIP adsorption by MTBC.\nPs MPs effects on Cd adsorption were more obvious than that of CIP.\nPs MPs changed the functional groups and electrostatic potential of MTBC, thus influencing MTBC adsorption.\n</p>","author":"Xiaoming Gong, \nRanran Chen, \nGuanwei Shi, \nHaibo Sun, \nYang Yang, \nYunshan Liang, \nPufeng Qin, \nHuilin Yang, \nZhibin Wu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"b1e712cba0c56cfbe910ce26ccbc5b14323138f5c6ac7cadd6cdefff312872b2","category":"Environment"}