{"title":"Climatic and management‐related drivers of endemic European spruce bark beetle populations in boreal forests","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14606?af=R","date":1708065877000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/3ecca907-f8da-4847-ae94-9760011b066e/jpe14606-toc-0001-m.png\" alt=\"Climatic and management-related drivers of endemic European spruce bark beetle populations in boreal forests\" />\n<p>Some of the population drivers identified here, i.e., spruce volume and clearcut edges, can be targeted by adaptive management measures to reduce the risk of future bark beetle outbreaks. Implementing such measures may help preserve future carbon sequestration of European boreal forests.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nClimate change is already reducing carbon sequestration in Central European forests dramatically through extensive droughts and bark beetle outbreaks. Further warming may threaten the enormous carbon reservoirs in the boreal forests in northern Europe unless disturbance risks can be reduced by adaptive forest management. The European spruce bark beetle (<i>Ips typographus</i>) is a major natural disturbance agent in spruce-dominated forests and can overwhelm the defences of healthy trees through pheromone-coordinated mass-attacks.\n\nWe used an extensive dataset of bark beetle trap counts to quantify how climatic and management-related factors influence bark beetle population sizes in boreal forests. Trap data were collected during a period without outbreaks and can thus identify mechanisms that drive populations towards outbreak thresholds.\n\nThe most significant predictors of bark beetle population size were the volume of mature spruce, the extent of newly exposed clearcut edges, temperature and soil moisture. For clearcut edge, temperature and soil moisture, a 3-year time lag produced the best model fit. We demonstrate how a model incorporating the most significant predictors, with a time lag, can be a useful management tool by allowing spatial prediction of future beetle population sizes.\n\n<i>Synthesis and Applications</i>: Some of the population drivers identified here, i,e., spruce volume and clearcut edges, can be targeted by adaptive management measures to reduce the risk of future bark beetle outbreaks. Implementing such measures may help preserve future carbon sequestration of European boreal forests.\n</p>\n<h2>Sammendrag</h2>\n<p>\n\nGlobale klimaendringer fører allerede til drastisk redusert karbonbinding i sentraleuropeiske barskoger ved å legge til rette for omfattende tørke og barkbilleutbrudd. Ytterligere oppvarming kan true de enorme karbonreservoarene i de boreale skogene i Nord-Europa, med mindre risikoen reduseres gjennom adaptiv skogforvaltning. Den europeiske granbarkbillen (<i>Ips typographus</i>) er en viktig økologisk forstyrrelsesfaktor i grandominerte skoger og kan overmanne forsvaret til friske trær gjennom koordinerte masseangrep.\n\nVi har analysert et stort datasett med fangsttall fra barkbillefeller for å kvantifisere hvordan klimatiske og forvaltningsrelaterte faktorer påvirker mengden barkbiller i boreale skoger. Fangstdataene ble samlet inn over en lang tidsperiode uten barkbilleutbrudd, og vi kunne dermed identifisere mekanismer som driver barkbillepopulasjonene mot utbruddsterskler.\n\nDe viktigste prediktorene for mengden barkbiller lokalt var volum hogstmoden gran, mengden ferske hogstflatekanter, lufttemperatur og jordfuktighet. For flatekant, temperatur og jordfuktighet fant vi at en tidsforsinkelse på tre år ga de best modellene. Vi viser også hvordan en modell som inkluderer de viktigste prediktorene, med en tidsforsinkelse, kan være et nyttig forvaltningsverktøy for å gjøre romlige prediksjoner av mengden barkbiller noen år frem i tid.\n\nSyntese og anvendelse: Noen av populasjonsdriverne vi identifiserer her, slik som granvolum og mengden hogstkanter, kan påvirkes av adaptive skjøtselstiltak for å redusere risikoen for fremtidige barkbilleutbrudd. Gjennomføringen av slike skjøtselstiltak kan bidra til å sikre den fremtidige karbonbindingen i Europas boreale skoger.\n</p>","author":"Jostein Gohli, \nPaal Krokene, \nEva Solbjørg Flo Heggem, \nBjørn Økland","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"b1e9fb2d472efea2a9fc672db5d9946881e9825912e4ab48992606fbd039b707","category":"Environment"}