{"title":"From death comes life: Large vertebrate carrion enhances seedling establishment in clonal ericaceous shrubs","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14531?af=R","date":1709033687000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/a506277b-6e4d-4c87-b578-a7238a615ba2/fec14531-toc-0001-m.png\" alt=\"From death comes life: Large vertebrate carrion enhances seedling establishment in clonal ericaceous shrubs\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/07/life-sprouts-from-death-when-mammal-carcasses-are-the-perfect-nursery-for-seedlings/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCarrion can have disproportionally large effects on ecological processes and community dynamics. During decomposition, the influx of growth-limiting nutrients can create small-scale disturbances with high soil cover known as ‘cadaver decomposition islands’ (CDIs). Such disturbances can allow for altered plant species composition, increased biomass production or provide microsites for regeneration. Carcasses also provide a resource for omnivorous scavengers, which have the potential to direct endozoochorous seed dispersal towards developing CDIs.\n\nIn this study, we investigated functional links between the scavenger community, carcass-induced disturbances in vegetation and the seedling establishment of berry-producing ericaceous species. We experimentally placed out 30 vertebrate carcasses of various species in a boreal forest ecosystem, each paired with a control and a mechanically disturbed plot to track vertebrate animal activity (i.e. dispersal vectors), vegetation changes (i.e. recruitment windows) and seedling establishment. We hypothesized that carcass size and season of experimental deposition would affect (H1) scavenger community composition and (H2) formation of CDIs, and that (H3) seedling establishment of ericaceous species is more abundant at CDIs compared with control or disturbed plots without carcass deposition.\n\nWe found that carcass presence effectively created a spatiotemporal hotspot of animal activity and that 94% of observations of vertebrates at carcasses were of species with the potential for ericaceous seed dispersal. Larger carcasses (e.g. moose, reindeer) attracted similar and abundant vertebrate communities, whereas observations at small carcasses (e.g. red fox) resembled those at control plots (H1). Only larger carcasses led to CDI formation (i.e. potential recruitment microsites), while plots with small carcasses resembled control plots (H2). Surprisingly, the season of carcass deposition did not influence vertebrate composition at carcass plots or CDI formation (H1–2). Seedlings were significantly more abundant in CDIs compared with mechanical disturbance and control plots (H3). Overall, CDIs contained about 4 and 19 times more seedlings compared with disturbed and controls, respectively.\n\nOur study demonstrates how individual carcasses in a boreal forest landscape can facilitate sexual reproduction in ericaceous keystone species. We suggest that this pathway also occurs in other ecosystems and that it may contribute to the genetic diversity of plant populations.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/07/life-sprouts-from-death-when-mammal-carcasses-are-the-perfect-nursery-for-seedlings/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Mie P. Arnberg, \nAmy E. Eycott, \nSam M. J. G. Steyaert","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"b1eb49613ce7c282e7c2001f5801eaa7e7194b3c99b169aa10461a4cfb6c1c0c","category":"Environment"}