{"title":"Your guide to greatness in the 2021 CyclingTips Fantasy Competition","link":"https://cyclingtips.com/2021/06/your-guide-to-greatness-in-the-2021-cyclingtips-fantasy-competition/","date":1624579500000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/2020-tour-de-france-stage10-corvos-3-650x433.jpg\" /></div><h2>Your guide to greatness in the 2021 CyclingTips Fantasy Competition</h2><p>\n</p><p>When riders clip into pedals <a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\">in Brest this weekend</a> for the start of the <a href=\"https://cyclingtips.com/tag/tour-de-france\">Tour de France</a>, they also signal the kick-off of the 2021 CyclingTips Fantasy Competition Around France.</p>\n\n\n\n<p>For the next few weeks, you’ll have the chance to pick one rider a day to lead your fantasy team to glory, with the possibility of winning prizes if you can manage to come away with a fantasy classification win.</p>\n\n\n\n<p>This time around we’re shaking up the scoring system to make for a better competition. The new system rewards you with points for picking a rider in the top 10 of each stage, and the points scale is the same on every stage. In other words, you’ll get as many points for picking a sprint stage winner as you will for picking a mountaintop finish winner.</p>\n\n\n\n<p>Meanwhile, if you miss your proverbial throw at the startlist dartboard on a breakaway day, you’ll be in the same boat as if you picked the 11th fastest finisher in a sprint, instead of being a seemingly insurmountable five minutes down on GC.</p>\n\n\n\n<p>To help you pick a winning team, we’ve put together a guide with an overview of the basics, as well as some more in-depth advice to help you achieve fantasy greatness.</p>\n\n\n\n<p>Before going any further, <a href=\"https://fantasy.cyclingtips.com/Home/Fantasy-Competition\">sign up for the Fantasy Competition here</a>. </p>\n\n\n\n<h2>Get to know the rules</h2>\n\n\n\n<p>Understanding the rules of any competition is pretty important to having success, so let’s start there. The CyclingTips Fantasy Competition is pretty straightforward but it may also be a bit different from other competitions you’ve participated in.</p>\n\n\n\n<p>Here’s how it works: You pick one rider per stage, and that rider can score points for your team based on where he finishes in the actual race, with a sliding scale of points awarded for any placing inside the top 10 (see below). Once you’ve picked a rider for a stage, you can’t pick him again later in the race, so be judicious. It’s a long race with 21 stages, so you can’t pick Tadej Pogačar to win every mountain stage!</p>\n\n\n\n<p>At the end of the Tour, the player with the most points wins the fantasy competition. It all sounds pretty intuitive to us, which is why we like it. We hope you will too.</p>\n\n\n\n<p>The scoring rubric is as follows:</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Rider selection 101</h2>\n\n\n\n<p>Once you’ve got the rules down, you may be wondering how to pick your rider for a given stage. Make sure to keep a few tools in your tipping toolbox.</p>\n\n\n\n<p>First, taking a look at a stage profile is absolutely key to making an accurate prediction for the day. If you’re relatively new to scoping out stage profiles, be aware that the vertical gain is not represented on the same scale as the distance. Otherwise, even fourth-category climbs would pose physically impossibly challenges for the peloton to overcome, with 5% gradients looking more like 100% gradients in race graphics.</p>\n\n\n\n<p>As an example of how you might use a profile (and our <a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\" target=\"_blank\">handy guide has all of them in one </a><a href=\"https://cyclingtips.com/2021/05/preview-your-stage-by-stage-breakdown-of-the-2021-giro-ditalia-course/\" target=\"_blank\">place</a>) take a look at stage 19 of the Tour. Being a relatively flat stage after a few tough days in the mountains, it looks like it will probably come down to a bunch kick, so you’ll probably want to name a sprinter to your lineup if you want the best chance of winning the stage.</p>\n\n\n\n<p>And if there was any doubt of that, you might use another key tool in the fantasy toolbox: betting odds. Bookies make a living by being smart about predicting outcomes. If you’re looking for insight on which riders might be well-suited to a certain stage, consult the experts.</p>\n\n\n\n<p>Beyond the basics of rider selection, you want to tailor your team to the rules. If you’re not sure about a rider’s form before a stage, feel free to take a wait-and-see approach and potentially pick him later, because once you’ve picked him that one time, you won’t have an opportunity to rely on him again later in the race.</p>\n\n\n\n<p>At the same time, if someone looks like they’re flying, make sure to capitalize on that when you can. This is bike racing, after all, and crashes do happen. You may not want to wait for a rider to take on that perfect parcours for his skillset two weeks into the race if you know he’s riding well and has a good shot on a stage right now.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<p>Racking up points in the competition will require you to be knowledgeable about the sport and tactical with your selections. There is plenty of chance involved as well. Crashes happen. So, too, do breakaways, which are often extremely unpredictable.</p>\n\n\n\n<p>Compared to the way things ran in the past, the new scoring system is likely to dampen the impact that both of those things will have on your fantasy experience. Previously, you were liable to lose several minutes if you picked a rider who crashed or simply stuck with the peloton on a breakaway day. Now, those selections hopefully won’t knock you out of the running entirely.</p>\n\n\n\n<p>That said, breakaways will still be important, and big breakaways will afford a lot of points to the tipsters that have picked a rider up the road – while anyone who misses out will get nothing. On the other hand, you’re gambling any time you pick a pure breakaway rider.</p>\n\n\n\n<p>For starters, it’s hard predicting whether a stage will go to the break or the bunch! And beyond that, even stages that go to the break can often see the big names placing highly just behind the move. If you pick an escape artist that misses the move on a high-mountain stage, you’ve missed out on solid points by eschewing that selection of a yellow jersey contender.</p>\n\n\n\n<p>Keep all that in mind over the course of the race, and be strategic with your picks. If you know you need big points to get ahead to achieve your fantasy goals, you might find it worthwhile to take a few chances. If you’re sitting pretty with a big points total and want to run out the proverbial clock on your mini-league (more on that in a moment), maybe play things a bit more cautiously.</p>\n\n\n\n<h2>Join a mini-league</h2>\n\n\n\n<p>There will be some serious bragging rights and even some prizes on offer for the overall competition, but you may find it even more fun to join a mini-league with your friends to vie for fantasy supremacy within your own crew.</p>\n\n\n\n<p>Creating a mini-league is easy, and from there you can invite your friends, and you can also take advantage of some customization options. If you liked the old time-based system, you can switch things up to run your mini-league that way.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<p>Once you’ve got your mini-leagues sorted, you can look forward to 21 stages of competition against your pals, regardless of how things go for you and your team in what’s sure to be a highly competitive overall leaderboard.</p>\n\n\n\n<p>Whatever you do, have fun with it. You may not ever get a chance to race up Mont Ventoux yourself, but you <em>can</em> put a fictional racing team in the hands of real riders taking on the real challenges over the next few weeks, and that’s got to count for something.</p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Follow the links for our <a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\" target=\"_blank\">stage-by-stage breakdown of the 2021 Tour de France</a><a href=\"https://cyclingtips.com/2021/05/preview-your-stage-by-stage-breakdown-of-the-2021-giro-ditalia-course/\" target=\"_blank\"> route</a> and the <a href=\"https://cyclingtips.com/2021/06/heres-whats-going-to-happen-we-think-at-the-tour-de-france/\" target=\"_blank\">riders you should be keeping an eye on.</a></em></p>\n\n\n    </div>\n    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/06/your-guide-to-greatness-in-the-2021-cyclingtips-fantasy-competition/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b1f76d2a46b062e0bec011257dcbcce4219261cd295b7d9c8747bafb72a7faae","category":"Cycling"}