{"title":"The Dietary Conundrum in Dialysis Patients: Fact vs Fiction on Social Media","link":"https://www.preprints.org/manuscript/202407.0998/v1","date":1721050452000,"content":"Background:Patients with chronic kidney disease (CKD), especially those undergoing dialysis, encounter complex nutritional challenges. Key dietary factors such as protein and fluid intake, potassium and sodium levels, and co-morbidities significantly influence dietary planning for CKD patients. A standardized approach to dietary recommendations for CKD patients is ineffective due to the diverse needs of individual patients. Social media platforms have become a popular source of dietary information, often advocating low-carb, high-protein diets, and other combinations purported to be universally beneficial. However, these generalized online dietary recommendations lack the individualized approach necessary for CKD patients. Unlike these social media-driven suggestions, established medical guidelines offer a more nuanced view of CKD dietary needs. This study investigates the discrepancies between these sources and their potential impact on patient health. Objective:The primary goal of this study is to identify and analyze the flaws in the dietary recommendation system for CKD patients that might adversely affect their health. By critically evaluating the content of YouTube videos, we aim to compare the dietary advice provided by social media influencers and content creators with established medical guidelines. Our approach combines qualitative and quantitative methods to thoroughly assess the accuracy and reliability of online dietary advice available to CKD patients. Method:We conducted four YouTube searches using keywords related to \"diet plan\" and \"chronic kidney disease (CKD).\" From each search, the first 30 videos were selected based on relevance, resulting in an initial pool of 120 videos. A stepwise screening process was used to filter out the most relevant and accessible content, ultimately narrowing the sample to 30 videos for in-depth analysis. The videos were evaluated using two scoring systems: the Journal of the American Medical Association (JAMA) score and the Global Quality Scale (GQS) score, which assess video quality. To ensure impartiality, three independent scorers conducted the evaluations. Additionally, two six-point scorecards were used to evaluate the inclusion and accuracy of information on various foods and eating behaviors affecting CKD risk, with higher scores indicating more comprehensive coverage. Data on video characteristics, such as view count, number of likes, and video age, were also collected to provide context and further insight into their reach and influence. Results:The study included 30 videos, with 60% (18 out of 30) posted by or featuring nephrology health professionals. Scorer 1 reported a mean JAMA score of 2.3 (SD 0.61) out of 4 points and a mean GQS score of 2.5 (SD 0.64) out of 5 points. Scorer 2 found a mean JAMA score of 2.5 (SD 0.62) and a mean GQS score of 2.8 (SD 0.73). Scorer 3 reported a mean JAMA score of 2.6 (SD 0.55) and a mean GQS score of 2.8 (SD 0.69). The dietary six-point scorecards revealed a mean score of 3.6 (SD 0.85) for the presence of information and 2.8 (SD 0.88) for the accuracy of the information. Conclusion:The videos analyzed in this study related to diet plans for CKD patients demonstrated generally low scores, indicating a lack of comprehensive and accurate information. Many videos provided incomplete or partial information, which could mislead viewers and potentially cause harm due to incomplete knowledge. This study highlights the need for careful scrutiny of online content, particularly on platforms like YouTube, due to the potential for contradictory information and its harmful consequences. The findings emphasize the necessity for greater accuracy and vigilance in disseminating health-related information to ensure the safety and well-being of CKD patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b1f90bbfa52ffce5d7ebec2b6693a5cc1eb2596bf1e2c0c22426215a823e63dc","category":"Interdisciplinary"}