{"title":"Researchers find deliberate backdoor in police radio encryption algorithm","link":"https://arstechnica.com/?p=1956349","date":1690290332000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/police-radio-800x622.jpg\" alt=\"police radio in car\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/police-radio.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/police-patrol-car-radio-equipment-and-microphone-royalty-free-image/1150657759\">Evgen_Prozhyrko via Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For more than 25 years, a technology used for critical data and voice radio communications around the world has been shrouded in secrecy to prevent anyone from closely scrutinizing its security properties for vulnerabilities. But now it’s finally getting a public airing thanks to a small group of researchers in the Netherlands who got their hands on its viscera and found serious flaws, including a deliberate backdoor.</p>\n<p>The backdoor, known for years by vendors that sold the technology but not necessarily by customers, exists in an encryption algorithm baked into radios sold for commercial use in critical infrastructure. It’s used to transmit encrypted data and commands in pipelines, railways, the electric grid, mass transit, and freight trains. It would allow someone to snoop on communications to learn how a system works, then potentially send commands to the radios that could trigger blackouts, halt gas pipeline flows, or reroute trains.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1956349#p3\">Read 40 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956349&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b205e39fd39cd294eb6cbc938948a3c7e1124924d3a4e32b8e8296ccc2fd0722","category":"Tech"}