{"title":"<i>TaeC</i>: A manually annotated text dataset for trait and phenotype extraction and entity linking in wheat breeding literature","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305475","date":1718287200000,"content":"<p>by Claire Nédellec, Clara Sauvion, Robert Bossy, Mariya Borovikova, Louise Deléger</p>\r\n\r\nWheat varieties show a large diversity of traits and phenotypes. Linking them to genetic variability is essential for shorter and more efficient wheat breeding programs. A growing number of plant molecular information networks provide interlinked interoperable data to support the discovery of gene-phenotype interactions. A large body of scientific literature and observational data obtained in-field and under controlled conditions document wheat breeding experiments. The cross-referencing of this complementary information is essential. Text from databases and scientific publications has been identified early on as a relevant source of information. However, the wide variety of terms used to refer to traits and phenotype values makes it difficult to find and cross-reference the textual information, e.g. simple dictionary lookup methods miss relevant terms. Corpora with manually annotated examples are thus needed to evaluate and train textual information extraction methods. While several corpora contain annotations of human and animal phenotypes, no corpus is available for plant traits. This hinders the evaluation of text mining-based crop knowledge graphs (e.g. AgroLD, KnetMiner, WheatIS-FAIDARE) and limits the ability to train machine learning methods and improve the quality of information. The <i>Triticum aestivum trait Corpus</i> is a new gold standard for traits and phenotypes of wheat. It consists of 528 PubMed references that are fully annotated by trait, phenotype, and species. We address the interoperability challenge of crossing sparse assay data and publications by using the <i>Wheat Trait and Phenotype Ontology</i> to normalize trait mentions and the species taxonomy of the <i>National Center for Biotechnology Information</i> to normalize species. The paper describes the construction of the corpus. A study of the performance of state-of-the-art language models for both named entity recognition and linking tasks trained on the corpus shows that it is suitable for training and evaluation. This corpus is currently the most comprehensive manually annotated corpus for natural language processing studies on crop phenotype information from the literature.","author":"Claire Nédellec","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b212f7de0965084c3ee3d1999a9c7ee833adffbd8598f496e9e74eb27ea8494f","category":"Interdisciplinary"}