{"title":"Emergency Awake Laparotomy Using Neuraxial Anaesthesia: A Case Series and Literature Review","link":"https://www.preprints.org/manuscript/202407.0215/v1","date":1719914119000,"content":"Introduction\nEmergency laparotomy is a surgical procedure associated with significantly higher mortality rates compared to elective surgeries. Awake laparotomy under neuraxial anaesthesia has recently emerged as a promising approach in abdominal surgery to improve patient outcomes. This study aims to evaluate the feasibility and potential benefits of using lumbar spinal anaesthesia as the primary anaesthetic technique in emergency laparotomies.\nMethods\nWe conducted a case series involving 16 patients who underwent emergency laparotomy for bowel ischemia, perforation, or occlusion. Lumbar spinal anaesthesia was employed as the main anaes-thetic technique. We analysed patient demographics, clinical characteristics, intraoperative details, and postoperative outcomes. The primary outcome measures included the adequacy of postoper-ative pain control, the incidence of postoperative complications, and mortality rates.\nResults\nAmong the 16 patients, adequate postoperative pain control was achieved, with only 2 patients requiring additional analgesia. Postoperative complications, including sepsis, wound dehiscence, and pneumonia, were observed in 7 patients (44%). The observed mortality rate was relatively low at 6% (1 patient). Notably, conversion to general anaesthesia was not necessary in any of the cases, and no early readmissions were reported.\nDiscussion\nOur findings highlight the feasibility and potential benefits of using neuraxial anaesthesia in emergency laparotomies. The observed low mortality rate and the avoidance of conversion to general anaesthesia suggest that lumbar spinal anaesthesia may be a useful alternative in emer-gency settings. However, the occurrence of postoperative complications in 44% of patients indi-cates the need for cautious patient selection and close monitoring. Further research with larger sample sizes is warranted to fully elucidate the efficacy, safety, and potential impact of this tech-nique on patient outcomes in emergency laparotomies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b2142c5b67dc89c0c8ebe3cfb0b58f590ca9c7421d52ba64a73845c54ea2df51","category":"Interdisciplinary"}