{"title":"อดีตทีมงานออกมาแฉ ผู้จัดจำหน่ายเกม Gollum ใช้ ChatGPT เขียนคำขอโทษที่เกมออกมาแย่","link":"https://www.blognone.com/node/136146","date":1696844178000,"content":"<div><div><div><p>นอกจากจะเป็น<a href=\"https://www.blognone.com/node/134637\">เกมที่มีคะแนนรีวิวน้อยที่สุดในปีนี้แล้ว</a> The Lord of The Rings Gollum ยังสร้างตำนานใหม่เพิ่มขึ้นมาด้วย เมื่ออดีตทีมงานของ Daedalic Entertainment สตูดิโอผู้สร้างเกมดังกล่าวได้ออกมาแฉว่าคำแถลงขอโทษของ Daedalic ใช้ Chat GPT เขียนขึ้นมา</p>\n<p>อดีตทีมงาน Daedalic ทั้ง 2 คนได้ให้สัมภาษณ์กับทาง Game Two ช่องยูทูปที่ทำเนื้อหาเกี่ยวกับเกมในเยอรมนี โดยเป็นการตีแผ่เบื้องหลังการสร้างเกม The Lord of The Rings Gollum และช่วงท้าย ๆ ของวิดีโอมีการพูดถึงถึงคำแถลงขอโทษของ Daedalic ซึ่งอดีตทีมงานทั้ง 2 คนบอกว่าคำแถลงที่ปล่อยออกมาเมื่อเดือนพฤษภาคมนั้น ทาง Daedalic ไม่ได้เขียนขึ้นมาเอง แต่เป็นทาง Nacon บริษัทแม่ของ Daedalic และผู้จัดจำหน่ายเกมเขียนคำแถลงโดยใช้ Chat GPT ร่างคำแถลงขึ้นมา และไม่ได้ตรวจความถูกต้องของข้อความก่อนปล่อยออกมา</p>\n<p>ส่วนเนื้อหาในวิดีโอได้รายงานว่า งบประมาณการพัฒนาของ The Lord of The Rings Gollum อยู่ที่ประมาณ 15 ล้านยูโร ซึ่งถือว่าน้อยมากสำหรับเกมระดับ AAA (ที่ทีมงานตั้งเป้าไว้) ในปี 2023</p>\n<p>มีการอ้างว่าเกมสร้างไม่ทันตามกำหนดที่ต้องปล่อยในปี 2023 ทำให้มีตัวละคร และฉากคัตซีนหลายตัวถูกซ่อนไม่ให้ผู้เล่นมองเห็น ตัวอย่างเช่น มีฉากหนึ่งที่ควรจะเห็นกอลลัมดักฟังการสนทนาระหว่างตัวละครหลัก 2 ตัวถูกสร้างไว้แล้ว แต่ทีมงานทำเป็นคัทซีนไม่ทัน Daedalic จึงให้กอลลัมมองที่หน้าต่าง และเล่นเสียงที่บันทึกไว้โดยไม่แสดงภาพตัวละครที่กำลังคุยอยู่</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f5694d4c254f1b87d79f08db955e9577.png\" /></p>\n<p>นอกจากนี้ระบบคุยกับตัวเองระหว่าง Gollum และ Smeagol ที่เป็นตัวเลือกให้ผู้เล่นตัดสินใจว่าจะเลือกความคิดของใครก็ยังทำไม่เสร็จ และมีการเแก้ปัญหาชั่วคราวก่อนที่จะวางขายเกมไม่นาน ในความเป็นจริงระบบนี้จะเป็นการใช้บทพูดที่คล้ายกับในภาพยนตร์ และมุมกล้องจะเปลี่ยนไปตามบุคลิกภาพของ Gollum โดยระบบนี้เป็นถูกแสดงในตัวอย่างของเกม แต่เมื่อเกมวางขายกลับเป็นเพียงข้อความให้เลือกไม่กี่ข้อ และมี Gollum ที่ดูไร้ชีวิตชีวาอยู่ในปูมหลัง</p>\n<p><em>คำแถลงขอโทษของ Daedalic Entertainment</em></p>\n<blockquote><p>A few words from the \" The Lord of the Rings: Gollum™ \" team <a href=\"https://t.co/adPamy5EjO\">pic.twitter.com/adPamy5EjO</a></p>\n<p>— The Lord of the Rings: Gollum (@GollumGame) <a href=\"https://twitter.com/GollumGame/status/1662124108614717448?ref_src=twsrc%5Etfw\">May 26, 2023</a></p></blockquote>\n<p><em>วิดีโอของ GameTwo ที่ตีแผ่เบื้องหลังการสร้างเกม The Lord of The Rings Gollum</em></p>\n<p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/chatgpt-was-used-to-write-gollum-game-apology-its-claimed/\">Video Games Chronicle</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/lord-rings\">The Lord of the Rings</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b2270bf4a40cc08070a3f39b4e69d0dd58f973e2223d62e224653fef85b4f912","category":"Thai"}