{"title":"ทำเกมเองไม่รอด กูเกิลหันไปทำระบบคลาวด์สำหรับให้บริการเกม Live Service","link":"https://www.blognone.com/node/132948","date":1678368923000,"content":"<div><div><div><p>หลังจากล้มเหลวกับบริการคลาวด์เกมมิ่ง Stadia จนต้องปิดตัว กูเกิลปรับทิศทางใหม่ นำเทคโนโลยีจาก Stadia มาให้บริการบริษัทเกมอื่นๆ แทน ภายใต้ชื่อแบรนด์ว่า Google Cloud for Live Service Games</p>\n<p>บริการภายใต้ร่มของ Google Cloud for Live Service Games เป็นผลิตภัณฑ์ที่กูเกิลมีอยู่ก่อนแล้ว แต่นำมาจัดชุดใหม่ให้เหมาะกับลูกค้ากลุ่มบริษัทเกม ที่ต้องการเซิร์ฟเวอร์ขนาดใหญ่รองรับเกมแนว Live Service ที่มีผู้เล่นจำนวนมหาศาล</p>\n<ul>\n<li>เซิร์ฟเวอร์: ใช้ Google Kubernetes Engine (GKE) ที่มีโหนดได้มากถึง 15,000 คลัสเตอร์ ใหญ่กว่าคลาวด์เจ้าอื่น 10 เท่า และ<a href=\"https://www.blognone.com/node/100602\">มีซอฟต์แวร์เซิร์ฟเวอร์เกม Agones รันบน Kubernetes ที่ร่วมพัฒนากับ Ubisoft</a></li>\n<li>เก็บข้อมูล: ใช้ <a href=\"https://www.blognone.com/node/92500\">Cloud Spanner ฐานข้อมูลขนาดใหญ่ที่กระจายตัวไปทั้งโลก</a> ตอบโจทย์ทั้งด้านสเกลและประสิทธิภาพ ไม่ต้องทำ sharding แยกส่วนฐานข้อมูล แยกกลุ่มผู้เล่นอีกต่อไป</li>\n<li>วิเคราะห์ข้อมูล: ใช้ BigQuery ซึ่งเป็นมาตรฐานที่ใช้ในบริษัทเกมขนาดใหญ่อยู่แล้ว พร้อมชูตัวอย่างลูกค้าคือ Square Enix ที่ใช้ทำเป็นแดชบอร์ดวิเคราะห์ข้อมูลผู้เล่นแบบเรียลไทม์</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c5e0399386d6aeef3952b94c8e40190c.jpg\" /></p>\n<p>Jack Buser หัวหน้าฝ่ายลูกค้าอุตสาหกรรมเกมของ Google Cloud เคยอยู่ในทีม Stadia มาก่อน เขายอมรับว่าถึงแม้ Stadia ไม่ประสบความสำเร็จ แต่ตัวเทคโนโลยีนั้นก้าวหน้ามาก จึงนำแพลตฟอร์มที่สร้างขึ้นมาให้บริการลูกค้าบริษัทเกมรายอื่นที่มีความต้องการแบบเดียวกัน และประสบปัญหาเรื่องการสเกลเซิร์ฟเวอร์ให้รองรับปริมาณผู้เล่นที่เยอะขึ้นเรื่อยๆ ซึ่งกูเกิลเชี่ยวชาญเรื่องนี้อยู่แล้วจากการให้บริการ Google Search และ YouTube</p>\n<p>Buser บอกว่าเขาเองก็เป็นเกมเมอร์ และเจอปัญหาเซิร์ฟเวอร์เต็มหรือเซิร์ฟเวอร์ล่มอยู่บ่อยๆ ซึ่งมันไม่ควรเกิดขึ้นในยุคนี้ มันเป็นปัญหาที่กูเกิลแก้ไขได้นานแล้ว (These problems are solved problems at Google) ตอนนี้กูเกิลเข้ามาให้บริการเกมใหญ่ๆ ของโลกหลายเกมตั้งแต่วันแรก ซึ่งมันเป็นเรื่องน่าเบื่อมาก เพราะระบบทำงานได้ดีไม่มีพัง (Just bored. Because it just works.)</p>\n<p>ที่มา - <a href=\"https://cloud.google.com/blog/products/gaming/how-google-cloud-for-games-enables-live-service-games/\">Google Cloud</a>, <a href=\"https://venturebeat.com/games/after-stadia-google-unveils-google-cloud-for-live-games/\">VentureBeat</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-cloud\">Google Cloud</a></div><div><a href=\"/topics/stadia\">Stadia</a></div><div><a href=\"/topics/server\">Server</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/cloud-computing\">Cloud Computing</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b228e0934694564eeb7b0f727127008693c6cdae28b4bc5d8d3137","category":"Thai"}