{"title":"HCP Vault on Microsoft Azure is now generally available","link":"https://www.hashicorp.com/blog/hcp-vault-on-microsoft-azure-is-now-generally-available","date":1677603600000,"content":"<p>We are excited to announce that HashiCorp Vault is now generally available as a fully managed service for Microsoft Azure environments on the HashiCorp Cloud Platform (HCP). HCP Vault helps organizations get Vault up and running quickly and provides comprehensive secrets management and encryption capabilities. This release is also the latest milestone in the <a href=\"https://www.hashicorp.com/partners/cloud/microsoft\">HashiCorp and Microsoft</a> partnership.</p>\n<h2><a href=\"#hcp-as-a-multi-cloud-solution\">»</a><a></a>HCP as a multi-cloud solution</h2>\n<p>Previously, HCP Vault was able to support only workloads that were running in an Amazon Web Services (AWS) environment. While this provided a good starting point for users interested in our cloud service, it didn’t address the needs of the many organizations that use Microsoft Azure as their primary cloud environment. Our goal has always been for HCP to be a multi-cloud solution and enabling Azure gets us one step closer to achieving that mission.</p>\n<p>New and current HCP users can deploy a fully managed version of Vault on Azure, connecting their workloads that are running on Azure virtual machines (VMs) or Azure Kubernetes Service (AKS).</p>\n<h2><a href=\"#general-availability-features\">»</a><a></a>General availability features</h2>\n<p>HCP Vault on Azure is now available to all HCP users for either on-demand hourly consumption or via annual contracts. To deploy HCP Vault on Azure, users can select Azure for their HVN as a deployment option from the HCP UI. HCP Vault on Azure can be used to discover and securely connect applications running in either Azure Virtual Machines or on Azure Kubernetes Service. With the GA release, we support both development and standard (single region) clusters. Additional features and capabilities are planned for later releases of HCP Vault on Azure.</p>\n<h2><a href=\"#getting-started\">»</a><a></a>Getting started</h2>\n<p>As a fully managed service, HCP Vault is the easiest way to secure, store, and tightly control access to tokens, passwords, certificates, encryption keys, and other sensitive data.</p>\n<p>HCP Vault is designed to minimize the steps necessary to use Vault within your Azure environments. At a high level, operators need to take these three steps to start using HCP Vault:</p>\n<ol>\n<li>Create an account: First, create a <a href=\"https://portal.cloud.hashicorp.com/sign-up\">HashiCorp Cloud Platform</a> account.</li>\n<li>Deploy a cluster: Next, select HCP Vault from the dashboard. We have a <a href=\"https://developer.hashicorp.com/vault/tutorials/cloud/get-started-vault?in=vault%2Fcloud\">quickstart deployment guide</a> that will walk you through the process of creating your HashiCorp Virtual Network (HVN) and a Vault cluster.</li>\n<li>Peer with Azure: Once you have deployed the HVN and cluster, the next step is to <a href=\"https://developer.hashicorp.com/hcp/tutorials/networking/azure-peering-hcp\">peer that network with your existing Azure environments</a>.</li>\n</ol>\n<p>That’s it. You are ready to connect and use HCP Vault. In practice, these steps will have a range of options when you drill down into them, so we’ve created a series of <a href=\"https://developer.hashicorp.com/vault/tutorials/cloud\">HCP Vault guides</a> to help you manage the finer details of your setup.</p>\n<h2><a href=\"#pricing-and-azure-region-availability\">»</a><a></a>Pricing and Azure region availability</h2>\n<p>At launch, HCP Vault is generally available in Azure regions of North America (East US, East US 2, West US 2, Central US, Canada Central), Europe (France Central, North Europe, West Europe, UK South), and Asia Pacific (Australia Southeast, Japan East, Southeast Asia). Additionally, we plan to add more region options in the future.</p>\n<p>For pricing, HCP Vault offers three different pricing tiers to meet your needs including development, starter, and standard packages. To review our pricing information, please visit our <a href=\"https://cloud.hashicorp.com/pricing/vault\">HCP Vault pricing page</a>.</p>\n<h2><a href=\"#next-steps\">»</a><a></a>Next steps</h2>\n<p>We are excited to announce the next milestone in HCP’s multi-cloud journey. To get started using HCP Vault on Azure visit the <a href=\"https://portal.cloud.hashicorp.com/sign-in\">HCP Portal</a> to sign up. And for more information about HCP Vault please visit our <a href=\"https://cloud.hashicorp.com/\">product page</a> or check out our <a href=\"https://developer.hashicorp.com/vault\">Vault guides page</a> for additional documentation.</p>","author":"Aubrey Johnson","siteTitle":"HashiCorp Blog","siteHash":"3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b22def7d27c2330851155853b22a3455b3d2fda08b4c5257ace591","category":"Tech"}