{"title":"Otolith reliability is context‐dependent for estimating warming and CO2 acidification impacts on fish growth","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17501?af=R","date":1725624309000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/60a776e4-b805-4b69-a4f8-2bd61a169d16/gcb17501-toc-0001-m.png\" alt=\"Otolith reliability is context-dependent for estimating warming and CO2 acidification impacts on fish growth\" />\n<p>This study performed a global meta-analysis of experiments investigating the direct effects of warming and CO<sub>2</sub> acidification on fish otolith growth and compared them with fish body growth responses. It found that otolith growth responses exhibited large sensitivity differences, depending on species characteristics, response measurements, and experimental conditions. The consistency between the growth responses of otoliths and fish bodies is likely to vary with climate change scenarios represented by different experimental design types. Context-dependent otolith sensitivity and reliability should be highlighted when examining climate change impacts using otoliths per se or as growth proxies for fish bodies.</p>\n<br />\n<h2>Abstract</h2>\n<p>Otoliths are frequently used as proxies to examine the impacts of climate change on fish growth in marine and freshwater ecosystems worldwide. However, the large sensitivity differences in otolith growth responses to typical changing environmental factors (i.e., temperature and CO<sub>2</sub> concentration), coupled with unclear drivers and potential inconsistencies with fish body growth, fundamentally challenge the reliability of such otolith applications. Here, we performed a global meta-analysis of experiments investigating the direct effects of warming (297 cases) and CO<sub>2</sub> acidification (293 cases) on fish otolith growth and compared them with fish body growth responses. Hierarchical models were used to assess the overall effect and quantify the influence of nine explanatory factors (e.g., fish feeding habit, life history stage, habitat type, and experimental amplitude and duration). The overall effects of warming and acidification on otolith growth were positive and significant, and the effect size of warming (effect size = 0.4003, otolith size of the treatment group increased by 49.23% compared to that of the control group) was larger than that of acidification (0.0724, 7.51%). All factors examined contributed to the heterogeneity of effect sizes, with larger responses commonly observed in carnivorous fish, marine species, and young individuals. Warming amplitudes and durations and acidification amplitudes increased the effect sizes, while acidification durations decreased the effect sizes. Otolith growth responses were consistent with, but greater than, fish body growth responses under warming. In contrast, fish body growth responses were not significant under acidification (effect size = −0.0051, <i>p</i> = .6185) and thus cannot be estimated using otoliths. Therefore, our study highlights that the reliability of applying otoliths to examine climate change impacts is likely varied, as the sensitivity of otolith growth responses and the consistency between the growth responses of otoliths and fish bodies are context-dependent.</p>","author":"Bangli Tang, \nLiuyong Ding, \nChengzhi Ding, \nDekui He, \nHaojie Su, \nJuan Tao","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"b22ed8261af84fb4436cdc19c97f8b8fd2ba75b19dbfd13f0e991c838c35778d","category":"Environment"}