{"title":"How to Lock Specific iPhone Apps Behind Face ID or Your Passcode","link":"https://www.macrumors.com/how-to/automatically-lock-iphone-app-opened/","date":1683286361000,"content":"In the interests of enhanced privacy, some third-party iOS apps include an option to require passcode or Face ID authentication before they can be opened, even though the iPhone is already unlocked. This puts the app's contents behind an additional layer of security, but not all apps offer the same facility. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/iphone-passcode-green.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nUntil recently, Apple did not offer a way to individually lock sensitive apps like Photos, and iPhone users had to resort to <a href=\"https://www.macrumors.com/how-to/passcode-lock-app/\">Screen Time's App Limits as a workaround</a>. Fortunately however that's no longer the case, because you can now create an additional security barrier for any app on your iPhone using a shortcut action new to iOS 16.4. \r<br />\n\r<br />\nApple has added <a href=\"https://www.macrumors.com/2023/03/27/ios-16-4-macos-13-3-shortcut-actions/\">several new actions to the Shortcuts app</a>, and the one that interests us here is Lock Screen. The Lock Screen action essentially allows you to set up a personal automation that automatically locks your iPhone when a specified app is opened. \r<br />\n\r<br />\nOf course, this action should pose no access issues for you as the iPhone owner, but it does mean that anyone else trying to open the app first needs to pass facial authentication or enter your passcode even though your iPhone was unlocked when they tapped the app icon.\r<br />\n\r<br />\nThe following steps guide you through the process of setting up a personal automation that will instantly lock your iPhone when the app of your choosing is opened. \r<br />\n<ol><li>Launch the <strong>Shortcuts</strong> app on your iPhone.</li>\r<br />\n<li>Tap the <strong>Automation</strong> tab at the bottom of the screen.</li> \r<br />\n<li>Tap the <strong>+</strong> button in the top-right corner, then tap <strong>Create Personal Automation</strong>.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/lock-iphone-when-app-opened4.jpg\" alt=\"shortcuts\" width=\"2738\" height=\"2716\" />\r<br />\n</li><li>Scroll down and tap <strong>App</strong>.</li>\r<br />\n<li>Make sure <strong>Is Opened</strong> is ticked on the next screen, then tap <strong>Choose</strong>.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/lock-iphone-when-app-opened3.jpg\" alt=\"shortcuts\" width=\"2738\" height=\"2716\" />\r<br />\n</li><li>Select an app from the list, then tap <strong>Done</strong>.</li>\r<br />\n<li>Tap <strong>Next</strong>, then tap the blue <strong>Add Action</strong> button on the next screen.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/lock-iphone-when-app-opened2.jpg\" alt=\"shortcuts\" width=\"2738\" height=\"2716\" />\r<br />\n</li><li>Start typing \"Lock Screen\" into the text field and select <strong>Lock Screen</strong> when it appears in the results below, then tap <strong>Next</strong>.</li>\r<br />\n<li>Toggle off the switch next to <strong>Ask Before Running</strong>.</li>\r<br />\n<li>Tap <strong>Don't Ask</strong> in the pop-up prompt, then tap <strong>Done</strong>.<img src=\"https://images.macrumors.com/article-new/2023/05/lock-iphone-when-app-opened1.jpg\" alt=\"settings\" width=\"2738\" height=\"2716\" /></li></ol>Your personal automation is now complete and should automatically spring into action the next time you open the chosen app. For an extra security step, you may consider setting up the same Lock Screen action for the Shortcuts app as well.\r<br />\n\r<br />\nNote that the same Lock Screen action can also be found in macOS 13.3, but bear in mind that there may be other ways to access the contents of a Mac app without launching it.<div>Tag: <a href=\"https://www.macrumors.com/guide/shortcuts/\">Shortcuts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/automatically-lock-iphone-app-opened/\">How to Lock Specific iPhone Apps Behind Face ID or Your Passcode</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-to-lock-specific-iphone-apps-behind-face-id-or-your-passcode.2388738/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b246c36ca0b04d1f84d27f0f045c3a0403c9457ac967c8f274f444352cfa63a1","category":"Apple"}