{"title":"CES 2024 Day 1: What's New From Samsung and CES Unveiled","link":"https://www.macrumors.com/2024/01/08/ces-2024-day-1-recap/","date":1704739801000,"content":"The annual CES event kicks off this week, and we sent <em>MacRumors</em> videographer Dan Barbera to hunt down cool new products and technologies that are being previewed this year. CES officially starts tomorrow, but Dan attended CES Unveiled last night, and was able to get an early look at devices from Samsung,\r<br />\n\r<br />\n<div></div>\r<br />\nSamsung showed off new OLED TVs with an updated anti-reflective coating that makes them much better in bright rooms and with reflective lights, plus there was a new 8K projector and some very impressive transparent OLED screens.\r<br />\n\r<br />\nSamsung had a neat 2D/3D display that uses cameras and eye tracking to display content in 3D without the need for glasses, and Dan was also impressed with a customizable music frame that holds artwork but also serves as a speaker for a subtle surround sound system.\r<br />\n\r<br />\nAt Unveiled, Dan checked out a pet-focused robot vacuum and mop combo from Narwhal, Belkin's Qi2 wireless chargers and StandDock Pro, a Keurig sort of device for ice cream, and some retro Mac power adapters from Sharge.\r<br />\n\r<br />\nMake sure to watch the full video to see the products in action, and stay tuned to <em>MacRumors</em> because we'll be sharing CES videos and articles for the next few days.<div>Tag: <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/08/ces-2024-day-1-recap/\">CES 2024 Day 1: What's New From Samsung and CES Unveiled</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ces-2024-day-1-whats-new-from-samsung-and-ces-unveiled.2415785/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b258fd4765a9207c2fa7671ae7aabdab047eb4d6ebb051c2e96a8bcb808995f6","category":"Apple"}