{"title":"High Expression of AhR and Environmental Pollution As AhR Linked Ligands Impact on Oncogenic Signaling Pathways in Western Patients With Diffuse Gastric Cancers. A Pilot Study","link":"https://www.preprints.org/manuscript/202406.1594/v1","date":1719224077000,"content":"Diffuse type of gastric cancer (GC) has an increasing prevalence worldwide, especially in Western countries, is usually diagnosed at advanced stages, and has no efficacious treatment options. Epidemiological studies have reported an increased mortality from GC after occupational exposure to well-studied pro-carcinogen that are metabolically activated by Cyp P450 enzymes through aryl hydrocarbon receptor (AhR). Substantial studies support the involvement of AhR in gastric carcinogenesis. However, little is known about the role of AhR in diffuse GC, as compared to intestinal GC. In a cohort of 29 gastric tumors, we described a significantly increased AhR protein and mRNA expression levels in GCs, independently of subtypes and clinical parameters. AhR and RhoA mRNA expression were correlated in diffuse GC. Further, our study characterized how AhR affects gene expression in diffuse GC. Using qRT-PCR, we compared the expression levels of AhR, Cyp1A1 and Cyp1B1 to the expression of genes in a panel previously described. In diffuse GC, Cyp1A1 expression correlated with genes involved in IGF signalling, EMT (VIM), migration (MMP2). In an in vitro assay using the poorly differentiated KATOIII epithelial cell line, two well-known ligands for AhR (TCDD and BaP) induced mRNA expression of CYP1A1, IL1b, as well as UGT1, NQO1 and AhRR to a lower extent. We also observed a strong increase in Cyp1B1 expression in diffuse GC, along with a lower TCDD-increased Cyp1B1 expression as compared to Cyp1A1 in KATOIII cells, and immunostaining in stromal cells. In intestinal GC, Cyp1B1 inversely correlated with several genes including IDO1 (generating endogenous kynurenin-e AhR ligand). Our data provide evidence for a major role of AhR in GC, as an environmental xenobiotics receptor, through different mechanisms and pathways in diffuse and intestinal GC. Our results support continued efforts to clarify the identities of exogenous AhR ligands in diffuse GC in order to define new therapeutic strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b258c9d6bea7b79fde201723c5563125a662dcb81a0cf0f2538a7703da7d09e3","category":"Interdisciplinary"}