{"title":"Association of Medicaid coverage with emergency department utilization after self-harm in Korea: A nationwide registry-based study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306047","date":1719324000000,"content":"<p>by Ga In Han, Sikyoung Jeong, Insoo Kim, Min Ah Yuh, Seon Hee Woo, Sungyoup Hong</p>\r\nBackground <p>Self-harm presents an important public health challenge. It imposes a notable burden on the utilization of emergency department (ED) services and medical expenses from patients and family. The Medicaid system is vital in providing financial support for individuals who struggle with medical expenses. This study explored the association of Medicaid coverage with ED visits following incidents of self-harm, utilizing nationwide ED surveillance data in Korea.</p> Methods <p>Data of all patients older than 14 years who presented to EDs following incidents of self-harm irrespective of intention to end their life, including cases of self-poisoning, were gathered from the National ED Information System (NEDIS). The annual self-harm visit rate (SHVR) per 100,000 people was calculated for each province and a generalized linear model analysis was conducted, with SHVR as a dependent variable and factors related to Medicaid coverage as independent variables.</p> Results <p>A 1% increase in Medicaid enrollment rate was linked to a significant decrease of 14% in SHVR. Each additional 1,000 Korean Won of Medicaid spending per enrollee was correlated with a 1% reduction in SHVR. However, an increase in Medicaid visits per enrollee and an extension of Medicaid coverage days were associated with an increase in SHVR. SHVR exhibited a stronger associated with parameters of Medicaid coverage in adolescents and young adults than in older adult population.</p> Conclusion <p>Expansion of Medicaid coverage coupled with careful monitoring of shifts in Medicaid utilization patterns can mitigate ED overloading by reducing visits related to self-harm.</p>","author":"Ga In Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b26ac96ad474211a2e0271f3ed660f64831494d61088bf3c7c519f7f56d058ac","category":"Interdisciplinary"}