{"title":"iOS 14.7: Apple releases the first beta","link":"https://www.macworld.com/article/346989/ios-14-7-features-release-date-beta-how-to-install.html","date":1621461790000,"content":"\n<div>\n<section><div></div></section><p>Just days after the release of the final beta of <a href=\"https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">iOS 14.6</a>, and before it is released to the general public, Apple has begun beta testing iOS 14.7. A point-seven release ties iOS 14 with iOS 13 for the most point releases of any iOS version ever. Even that is a bit of a technicality, as iOS 13.7 was released in September of 2020, many months after iOS 13.6, just to get the new COVID-19 contact tracing technology out to as many people as possible.</p>\n\n\n\n<p>Betas of the associated operating systems, iPadOS 14.7, tvOS 14.7, and watchOS 7.6, have also been released.</p>\n\n\n\n<h2>What’s new in iOS 14.7</h2>\n\n\n\n<p>We don’t have word yet of any new user-facing features of iOS 14.7. Apple previously stated that the new <a href=\"https://www.macworld.com/article/346720/apple-music-spatial-audio-dolby-atmos-lossless-high-resolution-streaming.html\">Apple Music Lossless and Dolby Atmos features</a> launching in June would require iOS 14.6, so it seems doubtful that the 14.7 release has anything to do with that.</p>\n\n\n\n<h2>How to get the iOS 14.7 beta</h2>\n\n\n\n<p>If you’re feeling brave, you can try out iOS 14.7 before its general release. Apple suggests you do not run the beta on any critical device, and that’s good advice—you never know what can go wrong.</p>\n\n\n\n<p>Developers can go head to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/download/&amp;xcust=1-1-344220-0-0-0%7Cxid:fr1621460822673ggd&amp;sref=https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">developer.apple.com/download</a> on the device upon which they which to run the beta, and download a developer beta profile. Those who aren’t developers can join the public beta by heading to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-344220-0-0-0%7Cxid:fr1621460822673ffd&amp;sref=https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">beta.apple.com</a> using the device upon which you wish to run the beta, signing in, and downloading the beta profile.</p>\n\n\n\n<p>Once you have the profile you must enable it by going to <em>Settings</em> &gt; <em>General</em> &gt; <em>Profile</em>. Your device will reset to enable the profile. After it has reset with the profile enabled, you can head to <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Updates</em> to download the latest beta release.</p>\n\n\n\n<p>If you’re already on the release candidate version of iOS 14.6, you’ll see the 14.7 update listed under a new “Also Available” section in Software Updates. This allows you to either stay on the iOS 14.6 release or jump on the new beta.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b26b18ea9d470c9d3ace58d83517f27ce0a7b7fa0360d4cdb42295f9217269aa","category":"Apple"}