{"title":"Linux could be 3% of global desktops. What happened to Windows?","link":"https://arstechnica.com/?p=1953373","date":1689198452000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/image-1-1.png\" alt=\"Linux on the desktop, only going up\" />\n      <p>How can you argue against these numbers? (credit: 20th Century Fox / Aurich Lawson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>According to one measurement by one firm, <a href=\"https://gs.statcounter.com/os-market-share/desktop/worldwide\">Linux reached 3.07 percent market share</a> of global desktop operating systems in June 2023. It's a notable first for the more than 30-year-old operating system, though other numbers in Statcounter's chart open it up to many more interpretations. It's either the year of the Linux desktop or a notable asterisk—your call.</p>\n<p><a href=\"https://gs.statcounter.com/faq#methodology\">As Statcounter explains</a>, its numbers come from tracking code installed on more than 1.5 million websites across the globe, capturing roughly 5 billion page views per month. Statcounter says it does not collate, weigh, or otherwise adjust its data aside from correcting for bots and Google Chrome's prerendering. Laptops are included in \"desktop\" because there is no easy way to separate them. And they're subject to revision for up to 45 days after publication.</p>\n<p><a href=\"https://gs.statcounter.com/os-market-share/desktop/worldwide/2018\">Five years ago</a>, Linux made up 1.69 percent of Statcounter's June numbers. In the year between June 2022 and 2023, Linux unsteadily crept up from 2.42 to 3.07 percent, jumping past 3 percent for the first time between May and June. If you regard Chrome OS as a Linux system, you could add that 4.13 percent and get to 7.2 percent.</p></div><p><a href=\"https://arstechnica.com/?p=1953373#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953373&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b270b4e575dab1a2c9ab1a55b4884713f26a2e7456e4683956fc16cbe3729729","category":"Tech"}