{"title":"Transcription factor PagMYB31 positively regulates cambium activity and negatively regulates xylem development in poplar","link":"https://academic.oup.com/plcell/article/36/5/1806/7606091?rss=1","date":1707523200000,"content":"<span><div>Abstract</div>Wood formation involves consecutive developmental steps, including cell division of vascular cambium, xylem cell expansion, secondary cell wall (SCW) deposition, and programmed cell death. In this study, we identified PagMYB31 as a coordinator regulating these processes in <span>Populus alba</span> × <span>Populus glandulosa</span> and built a PagMYB31-mediated transcriptional regulatory network. <span>PagMYB31</span> mutation caused fewer layers of cambial cells, larger fusiform initials, ray initials, vessels, fiber and ray cells, and enhanced xylem cell SCW thickening, showing that PagMYB31 positively regulates cambial cell proliferation and negatively regulates xylem cell expansion and SCW biosynthesis. PagMYB31 repressed xylem cell expansion and SCW thickening through directly inhibiting wall-modifying enzyme genes and the transcription factor genes that activate the whole SCW biosynthetic program, respectively. In cambium, PagMYB31 could promote cambial activity through TRACHEARY ELEMENT DIFFERENTIATION INHIBITORY FACTOR (TDIF)/PHLOEM INTERCALATED WITH XYLEM (PXY) signaling by directly regulating <span>CLAVATA3</span>/<span>ESR-RELATED</span> (<span>CLE</span>) genes, and it could also directly activate <span>WUSCHEL HOMEOBOX RELATED4</span> (<span>PagWOX4</span>), forming a feedforward regulation. We also observed that PagMYB31 could either promote cell proliferation through the MYB31-MYB72-WOX4 module or inhibit cambial activity through the MYB31-MYB72-VASCULAR CAMBIUM-RELATED MADS2 (VCM2)/PIN-FORMED5 (PIN5) modules, suggesting its role in maintaining the homeostasis of vascular cambium. PagMYB31 could be a potential target to manipulate different developmental stages of wood formation.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"b282f951e3e6e70790094e6c23d3b95648f7c6c40d6fd64aae022abec6551f70","category":"Environment"}