{"title":"The iPhone’s switch from Lightning to USB-C could come at a high price–for Apple","link":"https://www.macworld.com/article/1664069/iphone-lightning-usb-c-fast-charging-mfi.html","date":1679753700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Welcome to our Apple Breakfast column, which includes all of the Apple news you missed last week in a handy bite-sized roundup. We call it Apple Breakfast because we think it goes great with a morning cup of coffee or tea, but it’s cool if you want to give it a read during lunch or dinner hours too.</p>\n\n\n\n<h2>The high cost of fast charging</h2>\n\n\n\n<p>An odd story popped up this week, with the reputable Apple pundit Ming-Chi Kuo predicting that this year’s hot iPhone 15 accessory will be… Apple’s <a href=\"https://www.macworld.com/article/1665706/iphone-15-20w-charger-fast-charge.html\">own 20W USB-C charger</a>. Not an especially thrilling object, you might think, but the logic behind the prediction is positively explosive.</p>\n\n\n\n<p>There are a number of good reasons why Kuo–and Apple itself if the report is to be believed–expects the 20W charger to sell like proverbial hotcakes. First, the late-2023 iPhone launch should see Apple switch from Lightning to USB-C. Second, the iPhone 15 won’t come with a power adapter in the box. And third, the iPhone 15, like the iPhone 14, is likely to feature fast charging, but this feature will reportedly be limited to use with accessories that have been made by Apple itself, or certified via its MFi (Made For iPhone) program. In other words, a lot of people are going to discover that they can’t use their trusty old USB-A adapters and USB-A-to-Lightning cables with the new iPhone, that Apple isn’t planning to give them new charging kits, and that lots of the cheaper third-party options won’t work properly either. Hence massive sales of the official adapter. (<a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1664069-1-0-0&amp;u=https://www.apple.com/shop/product/MD810LL/A/apple-5w-usb-power-adapter\" target=\"_blank\">That’ll be $19, sir.</a>)</p>\n\n\n\n<p>For a discussion of mundane charging accessories, this story has generated what might seem like a surprising amount of disgruntlement. And since we already knew there wouldn’t be a charger in the box and the switch to USB-C has been expected for some time, it must be the third point that’s got people riled up. Not without cause, I would suggest. It’s a bit rich to be asked to part with the better part of a grand for a smartphone, and then to be informed that a) it doesn’t come with a plug, and b) you can’t just use any old plug, you need to buy one from a list of approved (and naturally more expensive) retailers and manufacturers. I can understand why this might raise a few hackles.</p>\n\n\n\n<p>iPhones are expensive products with a high-profit margin that make Apple an ungodly amount of money, but the company has wisely recognized that it can’t rely on that income stream alone in the long term. It’s trying hard, for example, to pivot into selling subscription services to people who own iPhones as well as selling the iPhones themselves: that much is sensible. But there’s an uglier side to Apple’s attempts to diversify its revenue streams, which we see when the company uses its muscle to push customers into buying apps, getting repairs and spare parts, and buying accessories from third-party businesses who have agreed to give Apple a share of their income. The MFi program is supposed to exist to guarantee the quality and reliability of accessories made by other companies, but there’s always been the suspicion that it’s really about making money. And locking down a feature of the iPhone 15 so it only works with MFi chargers would only fit with the latter explanation. This isn’t about customers, it’s about Apple’s bank balance.</p>\n\n\n\n<p>This is all rather ironic since the coming advent of USB-C on the iPhone–the result of external political pressure rather than internal altruism–was intended to decrease Apple’s monopolistic leanings rather than feed them. The use of a common connection standard rather than a proprietary one should mean customers can use the same accessories on their iPhones as they do on any number of other electronic devices–maybe even including Android smartphones–and thereby save money and reduce electronic waste. (If you’ll recall, the latter was one of the purported motives for power adapters being removed from iPhone boxes back in 2020. Funny how these ideals get forgotten.) Apple has resisted the use of common standards for so long precisely because proprietary ports give it leverage to squeeze extra revenue out of the accessories market… so it should come as no surprise if it continues that tradition when USB-C arrives. It wouldn’t be surprising, but it would still be disappointing.</p>\n\n\n\n<p>The worst part might be the shortsightedness of it all, the smallness of the thinking. The money Apple stands to make by pushing those iPhone 15 customers into MFi chargers is a rounding error for a company of this magnitude–and Apple reached those heights by thinking first and foremost about the quality of the product and the satisfaction of the customer. Sure, you can make a little extra money by keeping a firm grip on the accessories market for as long as possible. But what does that tell your customers about your priorities? And how much longer will those customers put up with a company that is so happy to make their lives more difficult?</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3811721/apple_breakfast_logo.jpg?quality=50&amp;strip=all\" alt=\"Apple Breakfast logo\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Trending: Top stories</h2>\n\n\n\n<p>Why on earth is Apple <a href=\"https://www.macworld.com/article/1665435/iphone-15-pro-solid-state-volume-mute-buttons-why.html\">ditching the physical buttons</a> on the <strong>iPhone 15 Pro</strong>?</p>\n\n\n\n<p>But <a href=\"https://www.macworld.com/article/1665456/iphone-15-mute-volume-buttons-bezels-app-store-restrictions.html\">the Macalope reckons</a> we should forget bezels and buttons; the iPhone 15’s <strong>best new feature</strong> will be the App Store.</p>\n\n\n\n<p><strong>MacGPT</strong> is the next <a href=\"https://www.macworld.com/article/1665074/macgpt-review-macos-manu-bar.html\">must-have tool</a> for your Mac’s menu bar.</p>\n\n\n\n<h2>The rumor mill</h2>\n\n\n\n<p>Does the release of <strong>macOS Ventura 13.3</strong> mean a <a href=\"https://www.macworld.com/article/1670022/macos-13-3-ventura-mac-pro-release.html\">new Mac Pro</a> is finally on the way?</p>\n\n\n\n<p>Hidden <strong>iOS 16.4 references</strong> hint at a possible <a href=\"https://www.macworld.com/article/1667528/new-airpods-launch-hidden-ios-reference.html\">imminent AirPods launch</a>. It could even be the $99 ‘Lite’ model.</p>\n\n\n\n<p>Apple is reportedly <a href=\"https://www.macworld.com/article/1663995/apple-is-reportedly-delaying-major-new-products-in-cost-cutting-maneuver.html\">delaying major new products</a> in a radical <strong>cost-cutting maneuver</strong>.</p>\n\n\n\n<p>In the world of sport, meanwhile, Apple is thought to be seeking to <a href=\"https://www.macworld.com/article/1669303/premier-league-soccer-streaming-apple-tv-plus-bid.html\">expand its football roster</a> with <strong>Premier League streaming rights</strong>.</p>\n\n\n\n<p><strong>SiriGPT</strong>, anyone? We explain how <a href=\"https://www.macworld.com/article/1662031/apple-siri-language-generation-ai-chatgpt.html\">Apple’s AI project</a> could bring a long-overdue Siri breakthrough.</p>\n\n\n\n<h2>Podcast of the week</h2>\n\n\n\n<p>Are you ready to explore the limitless possibilities of <strong>artificial intelligence</strong> and tech innovation? Today’s topic is ChatGPT and how Apple could take advantage of its amazing capabilities.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>You can catch every episode of the Macworld Podcast on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://open.spotify.com/show/3uyZkE4tjbwNNrJCLsBUAM&amp;xcust=1-1-1664069-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Spotify</a>, <a href=\"https://soundcloud.com/macworld\" target=\"_blank\">Soundcloud</a>, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/us/podcast/id563933198&amp;xcust=1-1-1664069-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Podcasts app</a>, or <a href=\"https://www.macworld.com/opinion/podcast\">our own site</a>.</p>\n\n\n\n<h2>Software updates, bugs &amp; problems</h2>\n\n\n\n<p>A <a href=\"https://www.macworld.com/article/1669513/apple-music-bug-add-delete-playlists-library.html\">‘horrific’ Apple Music bug</a> is syncing playlists with <strong>different users’ libraries</strong>.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1668421/acropalypse-bug-windows-pixel-cropping-images-apple-devices.html\">Fear not</a>, the <strong>‘acropalypse’</strong> isn’t coming to your iPhone and Mac.</p>\n\n\n\n<p>Jason Cross has found <a href=\"https://www.macworld.com/article/1660169/ios-16-4-new-features-upgrade-home-architecture-emoji-web-app.html\">three new iOS 16.4 features</a> that will make you want to <strong>upgrade right away</strong>. While Michael Simon has <a href=\"https://www.macworld.com/article/1668373/ios-16-4-hidden-features-voice-isolation-page-turn-duplicate-photos.html\">three more you’ll love</a>—once we tell you where to find them.</p>\n\n\n\n<p>And with that, we’re done for this week. If you’d like to get regular roundups, sign up for <a href=\"https://www.macworld.com/newsletters/signup\">our newsletters</a>. You can also follow us <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macworld&amp;xcust=1-1-1664069-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Twitter</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.facebook.com/Macworld/&amp;xcust=1-1-1664069-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Facebook</a> for discussion of breaking Apple news stories. See you next Saturday, enjoy the rest of your weekend, and stay Appley.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b286ada757fb16bf889bd2b45819349572d66945ef8cdcdcee092a2bd2c7641f","category":"Apple"}