{"title":"Kuo: MacBook Sales Down 30% Amid No New Products","link":"https://www.macrumors.com/2023/10/18/kuo-macbook-sales-down-amid-no-new-products/","date":1697626798000,"content":"MacBook sales have dropped significantly amid Apple's decision to launch no new Macs for the remainder of 2023, Apple supply chain analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/MacBook-Air-15-Inch-Feature-Teal.jpg\" alt width=\"1600\" height=\"894\" />\r<br />\n\r<br />\nIn a new <a href=\"https://medium.com/@mingchikuo/4q23-macbook供應鏈出貨顯著衰退25-35-yoy-需警戒同時是macbook關鍵供應商之ai股票-4q23-macbook-supply-chain-shipments-9cdc1c26b65a\">post on Medium</a>, Kuo claimed that MacBook sales as a whole are expected to be around 30% lower this year compared to 2022, reducing to about 17 million units. Kuo highlighted that demand for the 15-inch <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> has dropped significantly following the end of the back-to-school period, revising shipment forecasts down by approximately 20% or more. \r<br />\n\r<br />\nIn September, Kuo <a href=\"https://www.macrumors.com/2023/09/08/kuo-first-m3-macbooks-unlikely-2023/\">reported</a> that Apple is unlikely to release any new MacBook models with the M3 chip this year. With no new product launches for the rest of the year, Kuo now expects MacBook shipment momentum to be significantly lower than in previous seasons. Kuo said that declining work-from-home demand and waning appeal of Apple silicon and mini-LED displays are also driving down MacBook sales.\r<br />\n\r<br />\nKuo believes that one reason for Apple choosing to withhold the launch of any products is to clear inventory ahead of new releases next year. Apple apparently expects the M3 series of chips to boost Mac sales in 2024, but Kuo says this is yet to be seen.\r<br />\n\r<br />\nIn a <a href=\"https://www.macrumors.com/2023/09/27/kuo-2024-macbooks-ipads-3nm/\">previous report</a>, Kuo seemed skeptical of new MacBooks with <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> chips boosting sales. He warned that demand for these devices might be \"below expectations\" due to a \"lack of growth drivers.\" Kuo is essentially saying that Apple will no longer have the growth catalysts that it did over the past few years, such as a pandemic-driven work-from-home boost in demand or the newness of Apple silicon, which spurred many customers to upgrade from Intel-based Macs. However, given Mac and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> sales already significantly declined in 2023, Apple will at least have more favorable year-over-year sales comparisons in 2024.<div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/18/kuo-macbook-sales-down-amid-no-new-products/\">Kuo: MacBook Sales Down 30% Amid No New Products</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-macbook-sales-down-30-amid-no-new-products.2407932/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b296c3c3d5cce586a39a2bb4b5f38b9d06112ccf71abcd0ef82a3ab736bad002","category":"Apple"}