{"title":"Graphene-Doped Piezoelectric Transducers by Kriging Optimal Model for Detecting Various Types of Laryngeal Movements","link":"https://www.preprints.org/manuscript/202408.0136/v1","date":1722580542000,"content":"This study fabricated piezoelectric fibers of polyvinylidene fluoride (PVDF) with graphene using near-field electrospinning (NFES) technology. A uniform experimental design table U*7 (7^4 ) was applied, considering weight percentage (1-13 wt%), distance between needle and disk collector (2.1-3.9 mm), and applied voltage (14.5-17.5 kV). We optimized the parameters using electrical property measurements and the Kriging response surface method. Adding 13 wt% graphene significantly improved electrical conductivity, increasing from 17.7 μS/cm for pure PVDF to 187.5 μS/cm. The fiber diameter decreased from 21.4 μm in PVDF/1% graphene to 9.1 μm in PVDF/13% graphene. Adding 5 wt% graphene increased the β-phase content by 6.9%, reaching 65.4% compared to pure PVDF fibers. Material characteristics were investigated using scanning electron microscopy (SEM), Fourier-transform infrared spectroscopy (FTIR), X-ray diffraction analysis (XRD), contact angle measurements, and tensile testing. Optimal parameters included 3.47 wt% graphene, yielding 15.82 mV voltage at 5 Hz and 5 N force (2.04 times pure PVDF). Force testing showed a sensitivity (S) of 7.67493 log(mV/N). Fibers were attached to electrodes for piezoelectric sensor applications. Results affirmed enhanced electrical conductivity, piezoelectric performance, and mechanical strength. The optimized piezoelectric sensor could be applied to measure physiological signals, such as attaching it to the throat under different conditions to measure the output voltage. The force-to-voltage conversion facilitated subsequent analysis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b29889708fbefb6055c3b8d3681bf2c2d28b2a1a3a9da5412a5174d1c0e020b5","category":"Interdisciplinary"}