{"title":"Skydio 2 Drone 65KPH Wind & Waves Cycling Test","link":"https://www.dcrainmaker.com/2021/01/skydio-2-drone-65kph-wind-waves-cycling-test.html","date":1611935359000,"content":"<p><iframe src=\"https://www.youtube.com/embed/dK6gAjGsXtw\" width=\"720\" height=\"420\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>If you’re a <a href=\"https://www.youtube.com/c/Dcrainmaker\">regular subscriber of my YouTube Channel</a> you know that one of my ‘specialties&#8217; is high wind drone testing – basically pushing the drones to the limits of their capabilities in conditions that most people wouldn’t want to risk their drone in – all in the name of science. My <a href=\"https://www.youtube.com/c/Dcrainmaker/search?query=wind%20drone\">collective series of videos</a> doing this has over 1.2 million views.</p>\n<p>But there’s been a test I’ve been wanting to do for the better part of a year that I finally had a chance to do a couple of months ago, and now finally the time to edit it up: <a href=\"https://www.dcrainmaker.com/2019/12/skydio-autonomous-sports.html\">A Skydio 2 autonomous drone</a> tracking test with nearly 70KPH winds, while heavy waves crashed against the break wall aside and over me. It would be a test of not only the autonomous tracking aspects (which uses 7 cameras to follow you automatically), but also the aircraft’s ability to handle the crazy gusting winds. From salt spray to an unexpected rain squall – this video has it all.</p>\n<p>Additionally, as you can clearly see from the thumbnail above – it’s an opportunity to test whether my bike handling skills can handle not only the wind on wet pavement combination, but also the waves literally crashing through me as I ride.</p>\n<p>There’s not much more text that needs texting here – so I’ll leave you with simply hitting the play button up above, and enjoying a bit of Friday fun. Fear not, we’ll return to all important cycling and running sports tech product reviews next week.</p>\n<p>Have a good weekend!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"b2aa7679cfc3cb4c95148523835960a7af5127762c13d432d5b5bbf515e669d9","category":"Cycling"}