{"title":"HashiConf Europe Workshops: Key Takeaways and How to Book","link":"https://www.hashicorp.com/blog/hashiconf-europe-workshops-key-takeaways-and-how-to-book","date":1618297200000,"content":"<p>In less than two months, infrastructure operators, administrators, developers, and architects will once again meet online for the next fully digital <a href=\"https://hashiconf.com/europe/\">HashiConf Europe</a> community conference. HashiConf Europe runs from June 8 to June 11, 2021—keynotes, product updates, and technical sessions will take place on June 8 and 9, followed by two days of product workshops on June 10 and 11.</p>\n<p>We've created an extensive series of <a href=\"https://learn.hashicorp.com/\">online tutorials</a> to help you learn on your own, but a concentrated, hands-on course led by an experienced instructor can go a long way toward helping you build the proficiency and confidence to take these tools into production.</p>\n<p>Product workshops at HashiConf Europe are 90 minutes long and held in real-time over Zoom with HashiCorp product experts. Every workshop has been updated with recent features to give you a hands-on experience that will help you become confident using the latest versions of HashiCorp infrastructure automation tools.</p>\n<p>NOTE: All workshops are based on content available at <a href=\"https://learn.hashicorp.com/\">HashiCorp Learn</a> but are led by a live instructor and include access to technical experts from HashiCorp.</p>\n<p>In each session you will experience:</p>\n<ul>\n<li>A pre-built personal cloud workstation with credentials for deploying code and creating infrastructure</li>\n<li>An expert instructor who knows the tools well</li>\n<li>Several teaching assistants from our engineering department to answer your in-depth questions</li>\n<li>A copy of the slides, lab exercises, and demo code to keep</li>\n<li>Access to all of our <a href=\"https://learn.hashicorp.com/\">online training materials</a> for advance preparation and continued proficiency</li>\n</ul>\n<p><a href=\"https://hashiconf.com/europe/workshops/\">Sign up</a> now to reserve your spot in one of the workshops listed below. Space is limited, so there will be a nominal fee of €65 EUR to reserve your place. Pre-registration by May 28 is required (while tickets last).</p>\n<p><strong>Good to know:</strong> Workshops take place on Thursday and Friday, June 10 and 11, at 10:30 am and 3:00 pm Central European Summer time (CEST), so those in adjacent time zones from South America to Africa can also conveniently attend.</p>\n<h2><a href=\"#terraform-cloud-link-workspaces-with-infrastructure-pipelines\">»</a><a></a>Terraform Cloud: Link Workspaces With Infrastructure Pipelines</h2>\n<p>Terraform Cloud can link interdependent workspaces so that an <code>apply</code> in one triggers a run in another. In this workshop, you’ll link Kubernetes, Consul, and Vault deployments to create an infrastructure pipeline.</p>\n<p><strong>This workshop is for:</strong>\nExperienced Terraform users who are comfortable reading and writing Terraform configuration, and are interested in learning how to coordinate between workspaces.</p>\n<h2><a href=\"#terraform-cloud-enforce-policy-with-sentinel\">»</a><a></a>Terraform Cloud: Enforce Policy With Sentinel</h2>\n<p>Sentinel policy-as-code integrates with Terraform Cloud and Enterprise to enforce policy on infrastructure changes before they are applied. Learn about Sentinel language syntax and the policy writing and testing workflow. This content is based on material at <a href=\"https://learn.hashicorp.com/\">learn.hashicorp.com</a>.</p>\n<p><strong>This workshop is for:</strong>\nExperienced Terraform users who are interested in using Sentinel to enforce policy on their infrastructure with Terraform Enterprise, or Terraform Cloud Team and Governance.</p>\n<h2><a href=\"#terraform-build-a-custom-terraform-provider\">»</a><a></a>Terraform: Build a Custom Terraform Provider</h2>\n<p>Providers map target APIs to Terraform to create, read, update, and delete (CRUD) resources. In this workshop, you’ll modify an existing Terraform provider to add CRUD functionality to a new resource.</p>\n<p><strong>This workshop is for:</strong>\nExperienced Terraform users who are also proficient in GoLang, and are interested in learning how to modify an existing provider or create a new provider.</p>\n<h2><a href=\"#vault-highly-available-ha-cluster-with-integrated-storage\">»</a><a></a>Vault: Highly Available (HA) Cluster With Integrated Storage</h2>\n<p>Instead of relying on external storage, you can use an embedded storage backend, Integrated Storage, to support production workloads.</p>\n<p><strong>This workshop is for:</strong>\nOperations and solution architects who are looking to leverage Integrated Storage to persist the encrypted Vault data.</p>\n<h2><a href=\"#vault-manage-secrets-with-vault-on-kubernetes\">»</a><a></a>Vault: Manage Secrets With Vault on Kubernetes</h2>\n<p>The Vault Helm chart enables you to declaratively manage secrets for Vault-unaware application deployments within Kubernetes.</p>\n<p><strong>This workshop is for:</strong>\nKubernetes practitioners, who are looking to integrate Vault as a secrets-management solution while applications are running in a Kubernetes environment.</p>\n<h2><a href=\"#vault-granular-access-control-using-vault-policies\">»</a><a></a>Vault: Granular Access Control Using Vault Policies</h2>\n<p>Secret security fails without implementation of least-privileged-access control in Vault for all client types (human user, application, service, system, etc.). This hands-on workshop teaches you how to create policies that are secure, flexible, and reusable for your team or your entire enterprise.</p>\n<p><strong>This workshop is for:</strong>\nVault administrators responsible for governing access to secrets using Vault policies.</p>\n<h2><a href=\"#consul-secure-consul-with-access-control-lists-acls-and-vault\">»</a><a></a>Consul: Secure Consul With Access Control Lists (ACLs) and Vault</h2>\n<p>Learn how to secure your Consul datacenter with access control lists (ACLs). In this workshop, you will configure Consul to require tokens to gain access to the UI, API, CLI, and data. You will also learn how to manage ACL tokens with Vault's Consul secret engine.</p>\n<p><strong>This workshop is for:</strong>\nOperators who need to secure a production Consul datacenter and are interested in using Vault's Consul secrets engine to manage ACL tokens.</p>\n<h2><a href=\"#consul-securely-connect-multiple-kubernetes-clusters-with-consul\">»</a><a></a>Consul: Securely Connect Multiple Kubernetes Clusters With Consul</h2>\n<p>Learn how to enable two services in the Consul service mesh, in different Kubernetes clusters, to securely communicate with each other over mesh gateways. Learn how to configure WAN federation on the Consul servers in both datacenters and then use it to discover services across the datacenter. Finally, gain an understanding of the different gateways available and their use cases.</p>\n<p><strong>This workshop is for:</strong>\nKubernetes operators managing multiple clusters looking for a solution to discover services and secure service communications between Kubernetes clusters.</p>\n<h2><a href=\"#nomad-production-ready-nomad\">»</a><a></a>Nomad: Production-Ready Nomad</h2>\n<p>This workshop provides an instructor-led exploration of HashiCorp Learn content about how to secure Nomad agent communication with TLS encryption, gossip encryption, and ACLs. Learn how to configure Nomad agents to securely communicate and how to provide operators secure access to the cluster with ACL tokens.</p>\n<p><strong>This workshop is for:</strong>\nNomad users earlier in their adoption journey who are familiar with Nomad, and are interested in transforming proof-of-concept environments into more production-ready configurations by enabling the security features of Nomad</p>\n<h2><a href=\"#book-your-workshop-today\">»</a><a></a>Book Your Workshop Today</h2>\n<p>You can view all workshop descriptions and reserve your spot on the <a href=\"https://hashiconf.com/europe/workshops/\">HashiConf Europe website</a>. Workshops fill up fast so plan accordingly. We look forward to seeing you at HashiConf Europe.</p>","author":"Amanda Perino","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b2b050aa286243ba57eeeae4b2d6f92d6f0e97ab4303db80c76836c8b1fc5a15","category":"Tech"}