{"title":"The Quality of the Structural Domain of Tuberculosis Services at Public Health Facilities in Sidama Region, Southern Ethiopia: An Institution-Based Cross-Sectional Study Design","link":"https://www.preprints.org/manuscript/202403.1367/v1","date":1711103753000,"content":"Abstract Introduction: Poor structural quality of health facilities for tuberculosis (TB) diagnosis and treatment contributes to unfavorable health outcomes among TB patients. Improving the quality of healthcare services helps to avert TB-related morbidity. Despite these facts, the level of structural quality of health facilitieSs to deliver TB services is not in line with what the national TB and leprosy program (NTLP) recommends. Hence, the present study was conducted to assess the structural quality of health facilities to deliver quality TB services to TB patients among public health facilities in the Sidama region.Objectives: To determine the quality of the structural domain of TB services at public health facilities in the Sidama region of southern Ethiopia.Methods: An institution-based cross-sectional study was conducted from June to July 2023 among randomly selected public health facilities in the Sidama region. We included 40 randomly selected public health facilities that delivered TB services in the study area. Data was collected by experienced data collectors using facility audits, clinical observation checklists, structured questionnaires, and in-depth interviews. An Open Kit Mobile (ODK) application was used to collect data and exported to SPSS version 26. All statistical analysis was done using SPSS version 26.Results: The overall mean quality score for the structural dimension was 50.25 among the 40 health facilities audited in the study area.Conclusion: The quality of TB services regarding structural dimensions was poor in the study area. Therefore, any strategies must give careful attention to increasing the comprehensive structural dimension of quality TB services.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b2b51df6529041dc3565ff2a764ec2897b24050f5768781512dd04fc14b547b6","category":"Interdisciplinary"}