{"title":"Amazon layoffs will shut down camera review site DPReview.com after 25 years","link":"https://arstechnica.com/?p=1925645","date":1679424429000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Full-Width-NIKKOR-Lenses-800x533.jpeg\" alt=\"Amazon layoffs will shut down camera review site DPReview.com after 25 years\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Full-Width-NIKKOR-Lenses.jpeg\">Enlarge</a> (credit: Nikon)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n\n<p>Amazon has plans to lay off at least 27,000 workers this year, including 9,000 that were announced in an internal email yesterday morning. One unexpected casualty: Digital Photography Review, also known as DPReview, is losing its entire editorial staff, and the site <a href=\"https://www.dpreview.com/news/5901145460/dpreview-com-to-close\">will stop updating on April 10</a>.</p>\n<p>The announcement post, written by DPReview General Manager Scott Everett, says that new pieces will continue to be posted through April 10, and \"the site will be locked\" afterward. It's unclear what will happen to the site's content afterward—the post promises only that the site's content \"will be available in read-only mode for a limited period afterwards.\" Any photos and text that readers have uploaded to their accounts can be <a href=\"https://www.dpreview.com/data-download\">requested and downloaded until April 6</a>, \"after which we will not be able to complete the request.\"</p>\n<p>Former site editor Gannon Burgett <a href=\"https://twitter.com/gannonburgett/status/1638216719029116940\">said on Twitter</a> that the decision to lay off the staff was announced back in January and that \"<a href=\"https://twitter.com/gannonburgett/status/1638218357814992905\">Amazon hasn't yet come up with an archival plan</a>\" for the site. Cameras, even digital ones, tend to have a pretty long shelf life, and there's an active used market for lenses and camera bodies—if DPReview.com goes offline entirely, that would be a huge blow to anyone trying to research older products.</p></div><p><a href=\"https://arstechnica.com/?p=1925645#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925645&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b2c54ad725527a457c329d808a6eb5e391ccbf957ef683f2a88911fb9ef0ff03","category":"Tech"}