{"title":"Archerfish foraging success varies with immediate competition level but not group size","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae040/7678766?rss=1","date":1716249600000,"content":"<span><div>Abstract</div>Group living can lead to kleptoparasitism, the theft of resources by competitors. Under such conditions, foragers may alter their behavior to minimize competition. However, it is unclear how such behavioral changes impact foraging performance. Archerfish (<span>Toxotes</span> spp.) are a good model for investigating the behavioral responses to kleptoparasitism, as their hunting method (shooting waterjets at insects perched above the water) leaves them vulnerable to theft. They must hit the target prey with sufficient force to dislodge it; thus, the prey may land some distance away from the shooter. Kleptoparasitism rates increase with group size in archerfish, and individuals alter their behavior around conspecifics. We investigated whether group size affected shooting success, using 7-spot archerfish <span>T. chatareus</span>. We considered a fish’s shot to be successful if it knocked a fly, placed on a transparent platform above the tank, into the water. The probability of shooting success was modeled as a function of group size, aiming duration, nearest neighbor distance and position, and trial number. We found no effect of group size, aiming duration, or nearest neighbor distance or position on shooting success. Shooting success increased as trials progressed, likely due to the fish becoming more familiar with the task. We also found no change in the kleptoparasitism rate between group sizes. Instead, the likelihood of the shooter consuming the prey depended on the types of competition present at the time of shooting. We suggest that archerfish shooting behavior can be influenced by the presence of conspecifics in ways not previously considered.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"b2ca6dfccd1eed3136321d913b22bba43e29abe5e6119eca0784e73565c507cc","category":"Environment"}