{"title":"Different taste map for amiloride sensitivity, response frequency, and threshold to NaCl in the rostral nucleus of the solitary tract in rats","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae036/7798471?rss=1","date":1727740800000,"content":"<span><div>Abstract</div>Studies on taste bud cells and brain stem relay nuclei suggest that alternative pathways convey information regarding different taste qualities. Building on the hypothesis that amiloride (epithelial Na channel antagonist)-sensitive neurons respond to palatable salt (low-concentration) and amiloride-insensitive neurons respond to aversive salt (high-concentration), we investigated the histological distribution of taste-sensitive neurons in the rostral nucleus of the solitary tract in rats and their NaCl and amiloride sensitivities. We recorded neuronal activity in extracellular single units using multi-barrel glass micropipettes and reconstructed their locations on the rostrocaudal and mediolateral axes. Seventy-three taste-sensitive neurons were categorized into the best-taste category. The amiloride sensitivities of the 31 neurons were examined for 0.1, 0.2, 0.4, and 0.8 M NaCl. The neuronal distribution of amiloride-sensitive neurons was located in the lateral region, while amiloride-insensitive neurons were located in the medial region. The amiloride-sensitive neurons responded to low salt concentrations, signaling the NaCl levels required by body fluids. Amiloride-insensitive neurons were silent at low salt concentrations but may function as warning signals for high salt concentrations. Low-threshold and/or high-response neurons were located in the rostrolateral region. In contrast, high-threshold and/or low-response neurons were located in the caudal-medial region.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"b2df3b4dcf353127b776ee4e2a1574a0b701c9ae9f9e82ae606ed8d480988024","category":"Environment"}