{"title":"Here’s how long it takes new BrutePrint attack to unlock 10 different smartphones","link":"https://arstechnica.com/?p=1941070","date":1684794675000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/finterprint-authentication-800x512.jpg\" alt=\"Here’s how long it takes new BrutePrint attack to unlock 10 different smartphones\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/finterprint-authentication.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Researchers have devised a low-cost smartphone attack that cracks the authentication fingerprint used to unlock the screen and perform other sensitive actions on a range of Android devices in as little as 45 minutes.</p>\n<p>Dubbed BrutePrint by its creators, the attack requires an adversary to have physical control of a device when it is lost, stolen, temporarily surrendered, or unattended, for instance, while the owner is asleep. The objective: to gain the ability to perform a brute-force attack that tries huge numbers of fingerprint guesses until one is found that will unlock the device. The attack exploits vulnerabilities and weaknesses in the device SFA (smartphone fingerprint authentication).</p>\n<h2>BrutePrint overview</h2>\n<p>BrutePrint is an inexpensive attack that exploits vulnerabilities that allow people to unlock devices by exploiting various vulnerabilities and weaknesses in smartphone fingerprint authentication systems. Here's the workflow of these systems, which are typically abbreviated as SFAs.</p></div><p><a href=\"https://arstechnica.com/?p=1941070#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941070&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b2e32d4d0ebdc78c4ab961eee5a04b2953f9be6a1052fd6acd6192d60e62a1a7","category":"Tech"}