{"title":"Smart CSS Solutions For Common UI Challenges","link":"https://smashingmagazine.com/2021/10/modern-css-solutions-for-common-problems/","date":1634212800000,"content":"<p>It’s incredible to see what we can do with CSS today, especially if you still remember how difficult it once was to figure out stacking contexts or why margins collapsed and why <code>top: float</code> didn’t work. In this post, we’ll look at just that: <strong>exciting and fun things we can do with CSS</strong>, exploring common problems and use cases we all have to face in our work.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/53de3b82-28d7-44b3-9f5f-7e648a08eb7c/01-optimized-shadow-css.jpg\" /></p>\n<p>Another <a href=\"https://www.joshwcomeau.com/css/designing-shadows/\">fantastic article on the topic</a> comes from Josh W Comeau. To put an end to those “fuzzy grey boxes that don’t really look much like shadows”, as Josh describes the current state of most shadows on the web, he shows how to transform typical box-shadows into beautiful, life-like ones. A little detail that makes any UI a lot more tactile.</p>\nCSS Paper Cut-Out Effect\n<p>If you ever wanted to create a paper cut-out effect for a heading, you might have struggled quite a bit. Perhaps you need to set up two separate <code>div</code>s that then would be overlapped on top of each other. The spacing would need to be defined in relative units, of course, that might be a bit difficult to get right across screens.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/76ece241-3da9-4d44-a9ed-a7ee476bb4ba/02-paper-cut-out.jpg\" /></p>\n<p>Stephanie Eckles’ <a href=\"https://codepen.io/smashing-magazine/pen/dyzPQor\">CSS Paper Cut-Out Effect</a> solves the problem for good with CSS custom properties, CSS Grid, CSS transforms and a good ol'-fashioned CSS function <code>attr()</code>. Stephanie is using a <code>data</code>-attribute on <code>h1</code> along with a <code>span</code> inside it. <code>attr()</code> picks up the value of the <code>data</code>-attribute, which is then used for the <code>content</code>-property in a <code>:after</code>-pseudo element. The highlights, shadows and colors can then be adjusted with CSS Custom Properties. Reusable and simple to maintain!</p>\n<p>And if you are interested in more magic by Stephanie and other wonderful people who love CSS, take a look at <a href=\"https://stylestage.dev/\">StyleStage</a>, where modern CSS gets the spotlight it deserves.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/95a80ce7-f235-4747-a303-f926b708c42e/transparent-elipse-diagram.png\" /></p>\n<p>Also, take a look at Ahmad Shadeed’s piece on <a href=\"https://ishadeed.com/article/thinking-about-the-cut-out-effect/\">Thinking About The Cut Out Effect</a>, which goes into all the fine detail of deciding when SVG might make more sense, and how to implement in a real-life scenario. The article also provides plenty of code examples to get started with!</p>\nThe Minimap For The Web\n<p>We’ve seen them before: tiny horizontal bars that usually live at the top of the page. As a user is scrolling down, the horizontal bar is filling up, so the user knows how much is actually left to scroll.</p>\n<p>What if we make it <strong>a bit more contextual</strong> though? Perhaps the page includes some images and videos, or quotes and distinct sections — wouldn’t be interesting to highlight them differently, while also allowing readers to pin a position on the page and jump back if needed? Well, Rauno Freiberg thought so, too.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/396b5b84-9cb7-4a32-97d1-ac9fa715ddc0/03-progress.jpg\" /></p>\n<p>Rauno’s <a href=\"https://uiw.tf/minimap\">minimap for the web</a> (currently works only in Firefox) makes it trivial to create a minimap representation of the entire page, while also allowing readers to pin section of the page and navigate between them. To achieve it, Rauno uses an experimental CSS property <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/element(\"><code>element()</code></a>) to display a live image from an arbitrary HTML element (which currently only available in Firefox). </p>\nConditional Border Radius In CSS\n<p>When designing cards, you might want a <code>border-radius</code> to have a quite sizeable value when there is enough space to display it along with other cards. Yet <strong>when there is no space</strong> and perhaps no margin either on the card — as it might be the case on smaller screens — you might want to reduce <code>border-radius</code> to <code>0</code>. How would you achieve that?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2609d7d3-4af3-4b92-a493-74635edb4f9e/conditional-border-rad.jpg\" /></p>\n<p>Ahmad Shadeed has looked into this problem in quite a bit of detail in his article on <a href=\"https://ishadeed.com/article/conditional-border-radius/\">Conditional Border Radius In CSS</a>. The idea, originally suggested by Heydon Pickering and Naman Goel, is to use a large enough number to trigger one state or the other. On smaller screens, if the difference between <code>100vw</code> and <code>100%</code> is <code>0</code>, then the radius will be <code>0</code>, too; but if the difference is larger, a larger value would be used. You can <a href=\"https://codepen.io/shadeed/pen/BaZezzv\">take a look at the CodePen</a> as well.</p>\nCSS Grainy Gradients\n<p>What if you wanted to <strong>add some noise</strong> to bring a bit of texture to an image? Of course you could export images as PNGs, WebP or AVIFs, but ideally we’d want to add \"noise\" on top of SVGs, so we can always turn and off noise if we wanted to.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fa0f21e9-7cb1-4cf5-8313-6f2a2e7c3597/grainy-gradients-example.png\" /></p>\n<p>In his CSS-Tricks article on <a href=\"https://css-tricks.com/grainy-gradients/\">grainy gradients</a>, Jimmy Chion explains how we can generate colorful noise to add texture to a gradient with just a sparkle of CSS and SVG. As Jimmy explains, the idea is to use an SVG filter to create the noise, then apply that noise as a background. Then we layer it underneath a gradient, refine the brightness and contrast, and — voilà — you have gradient that gradually dithers away.</p>\n<p>Issue solved! You can also explore the <a href=\"https://grainy-gradients.vercel.app/\">Grainy Gradient playground</a> that Jimmy has set up.</p>\nMulti-Line Background Gradient\n<p>Some things might seem impossible to do with CSS — well, until someone finds a hack to make it happen. Like in this case: Can you achieve a multi-line padded text with a gradient that doesn’t reset for each line?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c26aba8f-df0b-4053-93b5-a4e3c607e149/multi-padded-text-opt.png\" /></p>\n<p>Yes, <a href=\"https://twitter.com/m_ott/status/1069741458641600513\">as Matthias Ott shows</a>. Matthias’ solution is a bit hacky, but it leads to the desired result thanks to a pseudo-element that is added on top of the text. An interesting idea to tinker with.</p>\nForm Field Focus Without Outlines\n<p>Who said forms need to be boring? Hakim El Hattab created a <a href=\"https://lab.hakim.se/focussss/\">demo</a> that proves that even something as simple as a form asking for name, email, and password is an occasion to think outside the box and cater for a spark of delight.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7018dabb-2448-43c6-a49c-a117e3a04401/focus-opt.png\" /></p>\n<p>To achieve that, Hakim combines form focus and validation in a subtle yet surprising animation that gets by without any focus outlines on the fields themselves. Instead, a dot marks the field that is focused. When the focus switches to another field, the animation is triggered, and the dot jumps to the new active field, drawing a connection between the two. Form field validation is also integrated seamlessly, with the dot expanding and showing a checkmark. If you’d like to dive deeper into the code, Hakim also published a demo on <a href=\"https://codepen.io/hakimel/pen/YzZoVxx\">Codepen</a>. Inspiring!</p>\nTransitioning CSS Gradients\n<p>If you’ve ever tried to transition gradients in CSS, you probably have noticed that it actually doesn’t work. Instead of gradually fading from one gradient to another, the change is happening immediately, abruptly, with no smooth transition between the two.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3bf0115-0bc9-41b7-b027-3ea8b6b7e848/transition-css-gradients-opt.png\" /></p>\n<p>As Keith J. Grant has <a href=\"https://keithjgrant.com/posts/2017/07/transitioning-gradients/\">discovered</a>, we can achieve the transition with a <strong>clever workaround</strong> though. We use a pseudo-element and opacity transform for that. First, we apply one gradient to the element, then position its pseudo-element to fill the element, and then apply the second gradient to it. And we “transition” between two gradients by transitioning the opacity of the pseudo-element. You can check a <a href=\"https://codepen.io/keithjgrant/pen/OgEdgN\">full working example on CodePen</a>.</p>\nImproving Image Performance With <code>image-set()</code>\n<p>Have you heard of <code>image-set()</code> already? You can think of it as a CSS background equivalent to the HTML <code>srcset</code> attribute for <code>img</code> tags. Chromium-based browsers and Safari have supported it for some years now, Firefox followed just recently. Ollie Williams takes a look at <a href=\"https://css-tricks.com/using-performant-next-gen-images-in-css-with-image-set/\">what we can and what we can’t do with it today</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c7439d61-2cf3-4683-8a59-1397627249a7/image-set-2-opt.png\" /></p>\n<p>As Ollie describes, one use case for <code>image-set()</code> is to provide multiple resolutions of a background image and leave it to the browser to decide which image is served to a user — a high-res version for users on fancy devices and a lower-res image for those on slow connections or screens with a lower pixel density, for example.</p>\n<p>Another very promising use case is still lacking browser support, unfortunately: the idea to use new image formats like AVIF, WebP, or HEIF while adding a fallback for older browsers. If you want to achieve something like that already today and don’t need <code>background-image</code>, the <code>&amp;lt;picture&amp;gt;</code> element might be an alternative worth considering, as Ollie suggests. A great read to help you improve image performance.</p>\nClip-Path Pop-Out Effect\n<p>With <code>clip-path: path()</code> supported by major browsers, it’s time to get creative. Mikael Ainalem shows a beautiful use case for the rather new feature: a <a href=\"https://codepen.io/ainalem/full/QWGNzYm\">buttery-smooth pop-out effect</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a1540260-9d6a-489f-9110-01df256801ef/clip-path-opt.png\" /></p>\n<p>Mikael uses <code>clip-path: path()</code> to set a photo of a person apart from its circle-shaped background. As you hover over it, the person seems to rise from the inside of the circle, creating a cool 3D impression. Perfect for “About Us” pages.</p>\nWhimsical 3D Button\n<p>Details matter. Designing a lovely button doesn’t seem to be a big complicated endeavor: a bit of padding here and there, a funky color, accessible text, and a few button states. Well, Josh Comeau has gone all the way to design a <a href=\"https://www.joshwcomeau.com/animation/3d-button/\">truly whimsical 3D button</a> that you might want to click more than once.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e509cd52-e15a-4470-a768-82dceb05b1d0/3d-button-opt.png\" /></p>\n<p>The idea is simple: we create two layers and offset the foreground layer a little bit at first. On hover, we shift the front layer down. Then, we adjust the focus outline with <code>outline-offset</code>, or use <code>:focus:not(:focus-visible)</code> to hide the outline when the button is focused and the user is using a pointer device.</p>\n<p>Then we shift the button up by a few pixels when they hover, animate the transform a lil’ bit, adjust the Bezier curve for animation and add a bit of blurring, for a softer, more natural shadow. And voilà — we have a whimsical 3D button that is <strong>accessible, works on mobile and on desktop</strong>, and is a pleasure to tap and click on. Of course, you can find the <a href=\"https://www.joshwcomeau.com/animation/3d-button/\">full code snippet</a> on Josh’s blog.</p>\nCSS Charts\n<p>Perhaps you need to design a column chart, or a bar chart, or even a multi-dataset column chart or stacked columns. Where do you even start? Perhaps with <a href=\"https://chartscss.org/\">Charts.css</a>, a <strong>CSS data visualization framework</strong> that uses CSS utility classes to style HTML elements as charts.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0a593b64-ef42-458c-8401-5e0ecfba584f/charts-css-opt.png\" /></p>\n<p>Created by Lana Gordiievski and Rami Yushuvaev, the framework supports many chart types, has no dependencies, and is very lightweight. It also includes thorough documentation on its <a href=\"https://chartscss.org/components/\">components</a> and <a href=\"https://chartscss.org/charts/\">built-in chart types</a>, plus the source code is <a href=\"https://github.com/ChartsCSS/charts.css\">available on GitHub</a> (licensed under MIT). And if you need slightly more creative approaches, Preethi explains <a href=\"https://css-tricks.com/how-to-create-css-charts-with-interesting-shapes-glyphs-and-emoji/\">how to create CSS Charts with interesting shapes</a> on CSS-Tricks as well.</p>\nThe New CSS Reset\n<p>What do you use to <strong>normalize styles across browsers</strong>? As of recently, there were new approaches to reduce the size of the global CSS reset, and perhaps they would be good candidates for your projects as well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bee91222-6ab6-4c98-9577-ca0d57513394/css-reset-opt.png\" /></p>\n<p>With his <a href=\"https://piccalil.li/blog/a-modern-css-reset/\">Modern CSS Reset</a>, Andy Bell has reduced the CSS reset to its minimum by adding box-sizing rules, removing default margins, set core root default and body defaults. Along with it Andy removes all animations, transitions, and smooth scroll for people that prefer not to see them, and has added modern properties like <code>scroll-behavior</code> and <code>text-decoration-skip-ink</code> by default.</p>\n<p>The <a href=\"https://github.com/elad2412/the-new-css-reset\">New CSS Reset</a> by Elad Shechter takes a slightly more aggressive approach. Elad removes all the default styles which we are getting on specific HTML elements except the <code>display property</code>. Both approaches are worth looking into!</p>\nStable Scrollbar Gutters With CSS\n<p>Ah, the good ol’ layout shifts! As Bramus Van Damme <a href=\"https://www.bram.us/2021/07/23/prevent-unwanted-layout-shifts-caused-by-scrollbars-with-the-scrollbar-gutter-css-property/\">explains</a>, one of the slightly more obscure reasons for layout shifts comes due to <strong>different types of scrollbars</strong> on the web. While overlay scrollbars on iOS/macOS are placed <em>over</em> the content (and aren’t shown by default), other scrollbars are placed in the “scrollbar gutter”, i.e. the space between the inner border edge and the outer padding edge.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7fab7f77-2708-4756-84f6-4bec6fe9f4f1/overflow-example-opt.png\" /></p>\n<p>When the content of a box becomes too large, the browser will — by default — show a scrollbar. In the latter case, it will cause a layout shift. Fortunately, this problem might be gone for good soon. Meet a shiny new <code>scrollbar-gutter</code> property: by setting it to <code>stable</code>, we can have the browser always showing the scrollbar gutter, even if the box is not overflowing.</p>\n<p>And to keep things symmetric, we can use <code>scrollbar-gutter: stable both-edges</code>. The feature isn’t available yet, but <a href=\"https://www.bram.us/2021/07/23/prevent-unwanted-layout-shifts-caused-by-scrollbars-with-the-scrollbar-gutter-css-property/\">coming in Chromium</a> very soon, with other rendering engines hopefully following soon.</p>\nThe Surprising Things That CSS Can Animate\n<p>When you think of animating CSS properties, which ones come to your mind? Will Boyd looked at the question from a different perspective and decided to explore the properties that don’t come to mind immediately, the ones that aren’t typically associated with animation, but turn out to be animatable.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b584490e-3fb1-4564-ad1e-5efff185aefd/animation-opt.png\" /></p>\n<p>In his post “<a href=\"https://codersblock.com/blog/the-surprising-things-that-css-can-animate/\">The Surprising Things That CSS Can Animate</a>”, Will dives deep into these unexpectedly animatable properties — and, of course, the nifty things you can do by animating them. <code>z-index</code>, for example, can be used for layered animations, <code>opacity</code> helps you fade out a modal just with CSS. A great reminder of how powerful CSS is.</p>\nLearning Resources\n<p>Learning never stops, right? Below we compiled some useful — and fun! — resources that are perfect to <strong>take your CSS skills to the next level</strong>. And if you’re already a CSS pro, there are also challenges to put your knowledge to the test. Enjoy!</p>\n<h3>CSS Vocab And Cheatsheets</h3>\n<p>You might have been there before. Just when you are working on a <strong>tight deadline</strong>, you need to look up something quickly. For CSS, you will never go wrong with <a href=\"https://css-tricks.com/almanac/\">CSS Tricks Almanac</a>, and you can also look up <a href=\"http://apps.workflower.fi/vocabs/css/en\">CSS vocabulary</a> gathered by Ville V. Vanninen from Finland as well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/547afdd1-484d-4e8e-8dc3-b13f99e64c91/css-vocab-opt.png\" /></p>\n<h3>Learn Flexbox The Fun Way</h3>\n<p>What do <strong>frogs, zombies, and towers</strong> have in common? Well, they are your best friends when learning Flexbox. Because, let’s be honest: Flexbox is very powerful once you understand it, but getting there can be quite hard. So let’s make learning a bit more fun.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181c9891-aff7-43e0-b46b-7fbf17bf94fb/flexbox-froggy-opt.png\" /></p>\n<p>In the game <a href=\"https://flexboxfroggy.com/\">Flexbox Froggy</a>, you help a little frog and its friends <strong>find their lilypads</strong> by, you guessed it, writing CSS. The game consists of 24 levels that take you from the very basics of Flexbox positioning to more advanced challenges.</p>\n<p>If zombies are more down your alley, <a href=\"https://geddski.teachable.com/p/flexbox-zombies\">Flexbox Zombies</a> is for you. Each section of the game unravels part of the plot, introduces a new Flexbox concept, and presents so-called <strong>“zombie survival challenges”</strong> that help you solidify your new skills.</p>\n<p>Last but not least, you might also want to take a look at <a href=\"http://www.flexboxdefense.com/\">Flexbox Defense</a>. Inspired by tower defense games, your job is to <strong>stop incoming enemies</strong> from getting past your defenses — by positioning your towers with CSS, of course. All three games run right in your browser. Happy flexbox’ing!</p>\n<h3>CSS Grid, CSS Selectors, And Other Competitions</h3>\n<p>Do you want to take your CSS skills to the next level? These three little games help you do just that — quite literally. In <a href=\"https://cssgridgarden.com/\">Grid Garden</a>, you’ll become the proud owner of a <strong>carrot garden</strong>. 28 levels are waiting for you in which you need to take good care of your crop with the help of CSS grid.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d5aa97ab-d7fe-4b7d-919b-5679c102c037/css-battle-opt.png\" /></p>\n<p>If you feel your CSS selectors skills could need some polishing, <a href=\"https://flukeout.github.io/\">CSS Diner</a> is for you. <strong>Plates, apples, pickles</strong> — in each of the 32 challenges, you’ll need to use a different CSS selector to select specific items on a table.</p>\n<p>And if you’re up for some competition, be sure to also check out <a href=\"https://cssbattle.dev/\">CSSBattle</a>. In the <strong>CSS golfing game</strong>, you’ll be using your CSS skills to visually replicate targets with smallest possible code to get to the top of the leaderboard. Each of the challenges is dedicated to a specific topic like <code>visibility</code>, <code>display</code>, <code>transition</code>, or <code>z-index</code>.</p>\nWrapping Up\n<p>Have you come across a CSS resources or technique recently that changed the way you approach a particular challenge? Let us know in the comments below! We’d love to hear about it.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"b2eca0634915f84af1f7d5c5f453a343f667674d7d47135dcccb67dc264120ae","category":"Tech"}