{"title":"Temperature‐dependent alterations in the proteome of the emergent fish pathogen Edwardsiella piscicida","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14017?af=R","date":1726892032000,"content":"<h2>Abstract</h2>\n<p><i>Edwardsiella piscicida</i> is an emerging bacterial pathogen and the aetiological agent of edwardsiellosis among cultured and wild fish species globally. The increased frequency of outbreaks of this Gram-negative, facultative intracellular pathogen pose not only a threat to the aquaculture industry but also a possible foodborne/waterborne public health risk due to the ill-defined zoonotic potential. Thus, understanding the role of temperature on the virulence of this emerging pathogen is essential for comprehending the pathogenesis of piscine edwardsiellosis in the context of current warming trends associated with climate change, as well as providing insight into its zoonotic potential. In this study, significant temperature-dependent alterations in bacterial growth patterns were observed, with bacterial isolates grown at 17°C displaying higher peak growth sizes, extended lag times, and slower maximal growth rates than isolates grown at 27or 37°C. When <i>E. piscicida</i> isolates were grown at 37°C compared to 27 and 17°C, mass spectrometry analysis of the <i>E. piscicida</i> proteome revealed significant downregulation of crucial virulence proteins, such as Type VI secretion system proteins and flagellar proteins. Although in vivo models of infection are warranted, this in vitro data suggests possible temperature-associated alterations in the virulence and pathogenic potential of <i>E. piscicida</i> in poikilotherms and homeotherms.</p>","author":"Kim L. Jacobsen, \nMatt Griffin, \nBrett S. Phinney, \nMichelle Salemi, \nZeinab Yazdi, \nSujita Balami, \nCaitlin E. Older, \nEsteban Soto","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"b2ee338cd78ece6ae23d31ad277f2315a0b1ed311133eff35d0ed9f434799d02","category":"Environment"}