{"title":"Two Decades of Progress in Personalized Medicine of Colorectal Cancer in Serbia – Insights from the Institute for Oncology and Radiology of Serbia","link":"https://www.preprints.org/manuscript/202409.0672/v1","date":1725876017000,"content":"Background/Objectives: The global burden of colorectal cancer (CRC) is projected to increase by 2040, highlighting the need for prevention strategies, early detection and adequate follow. The aim of this study was to provide an overview of the progress in personalized medicine of CRC in Serbia, with results and insights from the Institute for Oncology and Radiology of Serbia (IORS), and to propose guidance for tackling observed challenges in the future. Methods: Epidemiological data was derived from official global and national cancer registries and IORS electronic medical records. Germline genetic testing for Lynch syndrome was performed by Next Generation Sequencing. RAS and BRAF mutation analyses were performed using qPCR diagnostic kits. Results: Epidemiology and risk factors, prevention and early detection programs, as well as treatment options and scientific advances have been described in detail. Out of 103 patients who underwent germline testing for Lynch syndrome, 19 (18.4%) had a pathogenic or likely pathogenic mutation in one of the MMR genes, and 8 (7.8%) in other CRC-associated genes (APC, CHEK2, MUTYH). Of 6369 tested patients, 50.43% had a mutation in KRAS or NRAS genes, while 9.54% had the V600 mutation in the BRAF gene. Conclusions: Although significant improvements in CRC management have occurred globally in recent years, the high incidence of young-onset CRC and the growing elderly population due to a rise in life expectancy require a strategic approach leading to population-based systemic solutions, especially important for countries with limited health care resources as Serbia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b2f56454bc7bd6409dc91deed54538af278689ac0e5c0404c607ab1d1d1c53a1","category":"Interdisciplinary"}