{"title":"Accelerate your Terraform development with Amazon CodeWhisperer","link":"https://www.hashicorp.com/blog/accelerate-your-terraform-development-with-amazon-codewhisperer","date":1701277200000,"content":"<p>In April 2023, <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/04/amazon-codewhisperer-generally-available/\">AWS announced the general availability of Amazon CodeWhisperer</a>, an AI-based coding companion that generates real-time single-line or full-function code suggestions. Now, at <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent 2023</a>, HashiCorp and <a href=\"https://aws.amazon.com/blogs/aws/amazon-codewhisperer-offers-new-ai-powered-code-remediation-iac-support-and-integration-with-visual-studio/\">AWS have announced the support for Terraform in Amazon CodeWhisperer</a>. CodeWhisperer helps accelerate Terraform development by providing code suggestions that reduce total development effort, allowing Terraform practitioners to focus on end-to-end Terraform workflows. Customers can now take advantage of real-time generative AI Terraform suggestions, an open source reference tracker, and built-in security scans in Amazon CodeWhisperer.</p>\n\n<h2>HashiCorp Terraform and Amazon CodeWhisperer</h2>\n\n<p>Amazon CodeWhisperer provides code suggestions based on large language models (LLMs) trained on billions of lines of code, including Amazon's internal code and IaC config files as well as open source code. To generate high-quality Terraform suggestions, HashiCorp and Amazon CodeWhisperer teams worked together to source sample Terraform modules and configurations written in <a href=\"https://developer.hashicorp.com/terraform/language/syntax/configuration\">HashiCorp Configuration Language (HCL)</a>. The teams collaborated on providing model validations, working to ensure the output generated by the CodeWhisperer meets the requirements of Terraform practitioners. </p>\n\n<h2>The rise of HashiCorp Configuration Language (HCL)</h2>\n\n<p>CodeWhisperer and Terraform is a powerful combination, as HCL has once again been confirmed <a href=\"https://github.blog/2023-11-08-the-state-of-open-source-and-ai/\">as a high-growth programming language</a> by Octoverse, indicating that operations and IaC work are gaining prominence among developers. Specifically, HCL adoption has grown 36% year-over-year, demonstrating that developers are increasingly using declarative languages to leverage infrastructure deployments.</p>\n<img src=\"https://www.datocms-assets.com/2885/1701123492-octoverse-hcl-chart-2023.png\" alt=\"Top\" /><h2>How CodeWhisperer and Terraform work together</h2>\n\n<p>To use CodeWhisperer with Terraform, you simply install the latest AWS Toolkit plugin in your integrated development environment (IDE) of choice. CodeWhisperer automatically detects when customers write a new Terraform configuration file (*.tf file) and generates code suggestions using comments. </p>\n\n<p>Here are a few examples of what CodeWhisperer can do:</p>\n\n<p>Let’s start with a simple example, suppose you want to create multiple Amazon EC2 instances using the latest Amazon Linux 2 machine image. You would start with a simple prompt to configure Terraform Cloud, followed by instructions to create the instance by looking up the Amazon Machine Image (AMI) for Amazon Linux 2. CodeWhisperer will provide suggestions for each resource block. You can select the alternative suggestions and use the tab key to accept the suggestion:</p>\n<img src=\"https://www.datocms-assets.com/2885/1701123420-1-terraform-cloud-ec2.gif\" alt=\"Terraform\" /><p>CodeWhisperer is also trained in understanding advanced HCL syntax and expressions. For example, you could ask it to do variable validations for bucket names with 10-20 characters without special characters. CodeWhisperer can generate suggestions as shown here:</p>\n<img src=\"https://www.datocms-assets.com/2885/1701123414-2-variable-validation.gif\" alt=\"Generating\" /><p>Another example is to create an EC2 Security Group and populate the ingress rules using dynamic blocks expression and the existing locals:</p>\n<img src=\"https://www.datocms-assets.com/2885/1701123408-3-dynamic-block.gif\" alt=\"Creating\" /><h2>Better with Terraform enhanced editor validation</h2>\n\n<p>When writing Terraform code, either by hand or by leveraging an AI-based coding companion such as CodeWhisperer, errors are a fact of life. If the generated Terraform has missing artifacts or has validation errors, developers often find themselves context-switching between their editor and the CLI to validate code, leading to frustration and reducing productivity.</p>\n\n<p>Enhanced editor validation in the <a href=\"https://marketplace.visualstudio.com/items?itemName=HashiCorp.terraform\">Terraform extension for Visual Studio Code</a> automatically validates Terraform code as early as possible, creating an enhanced, integrated authoring experience by highlighting errors and providing guidance to help resolve issues quickly. </p>\n\n<p>Examples of these new validations include:</p>\n\n<ul>\n<li>Identifying missing variable declarations or required attributes</li>\n<li>Highlighting unexpected attributes or blocks</li>\n<li>Issuing warnings for deprecated attributes.</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1701123394-4-terraform-enhanced-editor-validation.gif\" alt=\"Terraform\" /><p>Validation errors are immediately identified within the Terraform extension for the Visual Studio Code editor, no context switching is needed.</p>\n\n<h2>Start generating code</h2>\n\n<p>You can start using Terraform code generation in Amazon CodeWhisperer using <a href=\"https://aws.amazon.com/codewhisperer/resources/\">AWS’ getting started resources</a>. To complement your generative workflows you can install the <a href=\"https://marketplace.visualstudio.com/items?itemName=HashiCorp.terraform\">Terraform extension for Visual Studio Code</a> and learn about enhancements recently added to the extension.</p>\n\n<p><em>Special thanks to Kevon Mayers, Kalen Arndt, and Sean Doyle whose work behind the scenes made all of this possible.</em></p>\n","author":"Gautam Baghel","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b2f69e031b2c857c9bee50db819fdeba3855b39b202863300f709d4dd01ec936","category":"Tech"}