{"title":"Optimization and Field Trial of an Aeromonas hydrophila Vaccine Candidate for Motile Aeromonads Septicemia in Farmed Nile Tilapia in Tanzania","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8891296?af=R","date":1722242903000,"content":"<p>Vaccination is an approved novel approach for controlling aeromonads disease caused by <i>Aeromonas hydrophila</i>. This study aimed to optimize the <i>A. hydrophila</i> vaccine candidate with a protective efficacy of 71.4% through immersion. A total of 600 tilapia fingerlings weighing 10–15 g were collected and distributed in tanks at Magadu farm. The fingerlings acclimatized for 2 weeks. Vaccination was done by immersion at a dose of 1.6 × 10<sup>8</sup> cfu/mL mixed as 1 part of a vaccine in 20 parts of tank water. A total of 150 fingerlings were exposed to a vaccine for 30 min and distributed in three replica tanks, each having 50 fingerlings. The same procedure was applied to fingerlings exposed to the vaccine at 45 and 75 min, while the remaining 150 fingerlings served as control. Fish were bled at day 0 and days 7, 14, 21, and 28 postvaccinations for immunogenicity studies. A challenge trial with a virulent <i>A. hydrophila</i> followed. Observation for mortalities and clinical signs was made for 28 days postchallenge. No clinical signs and death were observed during the entire period of 28 days postvaccination. The serology findings showed higher antibody titer of 45 min vaccination time of exposure (GMT log 2 = 5.0 at day 28). The findings revealed that the protective efficacy had increased to 90% relative percent of survival at 45 min duration of vaccine exposure. The vaccine demonstrated acceptable safety and protection levels on the field.</p>","author":"Judith A. Sombe, \nAlexanda Mzula, \nElisa Mwega, \nGabriel M. Shirima, \nPhilemon N. Wambura, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"b328aeb54ee02b9e673cadb4935b8fa0fe6e1288cfa1c3bf7c394a04bd08883e","category":"Environment"}