{"title":"Placental Protein 13 (PP13): Vasomodulatory Effects on Human Uterine Arteries and Potential Implications for Preeclampsia","link":"https://www.preprints.org/manuscript/202406.1369/v1","date":1718835110000,"content":"Placental protein 13 (PP13) exhibits a plasma concentration that increases gradually during normal gestation, a process disrupted in preeclampsia, characterized by elevated vascular resistance, re-duced utero-placental blood flow and intrauterine growth restriction. This study investigated PP13’s role in vascular tone regulation and its molecular mechanisms.\nUterine and subcutaneous arteries isolated from both pregnant and non-pregnant women were precontracted with the thromboxane analogue U46619, and exposed to PP13 using pressurized myography. The molecular mechanisms were further investigated using specific inhibitors for ni-tric oxide synthase (L-NAME+LNNA at 10-4 M) and guanylate cyclase (ODQ at 10-5 M).\nResults showed PP13 induced vasodilation in uterine arteries but not in subcutaneous arteries. Ad-ditionally, PP13 counteract U46619-induced vasoconstriction, which is particularly pronounced in pregnancy. Further investigation revealed that PP13's mechanism of action is dependent on activa-tion of the Nitric oxide-cGMP pathway.\nThis study provides novel insights into the vasomodulatory effects of PP13 on human uterine ar-teries, underscoring its potential role in regulating utero-placental blood flow. These findings suggest PP13 may be a promising candidate for improving utero-placental blood flow in condi-tions such as preeclampsia. Further research and clinical studies are warranted to validate PP13's efficacy and safety as a therapeutic agent for managing preeclampsia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b32c6e03e6a4e238b38075e055d24390dfccb4b71605d6b514d9b07136faad90","category":"Interdisciplinary"}