{"title":"LINC01572 promotes triple‐negative breast cancer progression through EIF4A3‐mediated β‐catenin mRNA nuclear exportation","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24171?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<p>Long noncoding RNAs have been reported to be involved in the development of breast cancer. LINC01572 was previously reported to promote the development of various tumors. However, the potential biological function of LINC01572 in breast cancer remains largely unknown. R language was used to perform bioinformatic analysis of The Cancer Genome Atlas data. The expression level of RNAs was examined by RT-qPCR. The effect of knocking down or overexpression LINC01572 in triple-negative breast cancer (TNBC) cell lines was evaluated by detecting cell proliferation, migrant action. RNA immunoprecipitation assay and RNA pull-down assay were performed to explore the regulatory relationship between LINC01572, EIF4A3, and β-catenin. Bioinformatics analysis identifies LINC01572 as an oncogene of breast cancer. LINC01572 is over-expressed in TNBC tissues and cell lines, correlated with poor clinical prognosis in BC patients. Cell function studies confirmed that LINC01572 facilitated the proliferation and migration of TNBC cells in both vivo and vitro. Mechanistically, β-catenin mRNA and EIF4A3 combine spatially to form a complex, LINC01572 helps transport this complex from the nucleus to the cytoplasm, thereby facilitating the translation of β-catenin. Our findings confirm that LINC01572 acts as a tumor promoter and may act as a biomarker in TNBC. In addition, novel molecular regulatory relationships involving LINC01572/EIF4A3/β-catenin are critical to the development of TNBC, which led to a new understanding of the mechanisms of TNBC progression and shows a new target for precision treatment for TNBC.</p>","author":"Bowen Zheng, \nBaian Zhou, \nDanrong Ye, \nYuying Wang, \nWenfang Zheng, \nXuehui Wang, \nDiya Liu, \nFengyuan Qian, \nXiqian Zhou, \nTao Yan, \nYating Li, \nLin Fang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"b33342702937e16b7353aaa9a3acd15cc03868c2e429d3db52bce72b8a519dad","category":"Environment"}