{"title":"Gravel dropper, mega wide bars, wearable bar bag, superlight sleeping mat & a dyno light","link":"https://www.bikeradar.com/features/first-look-friday/pnw-rainier-dropper/","date":1617958800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/First-Look-Friday-updated-d159aee.jpg?quality=45&amp;resize=620,413\" />                                            <p>Unusually, it’s been a quiet week for product launches in the bike industry, but we’ve published more reviews than you can shake a spoke at, with highlights including the outstanding <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/hunt-4-season-aero-wheelset-review/\">Continental GP 5000 road tyre</a>, Hunt’s very keenly-priced <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/hunt-4-season-aero-wheelset-review/\">4 Season Aero wheelset</a>, the striking <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/canyon-precedeon-cf-9-review/\">Canyon Precede:ON</a>, and <a href=\"https://www.bikeradar.com/reviews/accessories/books/end-to-end-book-review/\">Paul Jones’ excellent book <em>End to End</em></a>.</p>\n<p>Resident tech nerd Simon Bromley delved into <a href=\"https://www.bikeradar.com/features/pro-bike/2021-tour-of-flanders-clinchers/\">Kasper Asgreen’s controversial choice of clincher tyres</a> for his winning Tour of Flanders ride, and we updated our guides to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">best road bike wheels</a> and the <a href=\"https://www.bikeradar.com/advice/best-womens-road-bikes-12-of-the-best/\">best women’s road and adventure bikes</a>.</p>\n<p>This week’s round-up has a distinctly gravel and adventure slant to it, read on for this week’s product…</p>\n<h2>PNW Components gravel cockpit and dropper seatpost</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/First-Look-Friday-9-April-2021-5-7fdb392.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Rainier is one of relatively few droppers available in 27.2mm.</span>\n    </figcaption><span>\n                    <i>Matthew Loveridge / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/First-Look-Friday-9-April-2021-6-f2785b9.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Rainier is cable-actuated, with internal routing. </span>\n    </figcaption><span>\n                    <i>Matthew Loveridge / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/First-Look-Friday-9-April-2021-7-63b0537.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The travel can be reduced if desired. </span>\n    </figcaption><span>\n                    <i>Matthew Loveridge / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/First-Look-Friday-9-April-2021-8-cc18af5.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>This is the drop bar remote lever, PNW offers various alternatives too. </span>\n    </figcaption><span>\n                    <i>Matthew Loveridge / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nBest known for its Gucci mountain bike dropper posts and matching levers, PNW Components now offers a selection of gravel-friendly kit including a dropper that’s available in a skinny 27.2mm diameter, meaning it will fit many road or gravel frames.\n<p>The post we have here is the third generation of the Rainier, and in this diameter it offers up to 125mm of travel, which can be adjusted tool-free down to as little as 100mm in 5mm increments, if desired.</p>\n<p>Larger diameter versions of the post are available (30.9mm, 31.6mm and 34.99mm) and these offer longer travel options too.</p>\n<p>The Rainier is cable-actuated and designed for internal routing only. PNW says it’s rider-serviceable and the post we have here weighs 448g on our scales.</p>\n<p>As the PNW offers a choice of levers for its posts, these are sold separately. We’ve got the Drop Bar option, which is designed to be mounted on the drops and weighs 19g (plus cables).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Coast cockpit is seriously wide.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>PNW has also got into the gravel cockpit game with its Coast bar and stem.</p>\n<p>The bar comes in nominal widths of 480mm and 520mm, which denote the span at the hoods. We’ve got the former here and it’s seriously wide – thanks to a 20-degree flare, it measures approximately 560mm across at the tips of the drops. If you opt for the wider version, it’s 604mm at the drops, a figure that puts it into old-school flat-bar territory.</p>\n<p>The Coast bar weighs 336g on our scales. The matching stem is 135g in a 90mm length and includes a removable mount for a GoPro or front light.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Coast stem has a mount for a camera or light.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Virtually all of PNW’s range is backed by a lifetime warranty that covers manufacturing defects and, if <a href=\"https://nsmb.com/articles/disrupting-lousy-warranties-mountain-biking/\" target=\"_blank\">this interview</a> with the brand’s co-founder Aaron Kerson is anything to go by, the terms are somewhat more generous than is typical in the bike industry.</p>\n<p>Would you like a dropper on your gravel bike?</p>\n<ul><li><strong>Coast handlebar:</strong> $69 / £50.97</li>\n<li><strong>Coast stem (90mm) w/GoPro mount:</strong> $69 / £50.97</li>\n<li><strong>Rainier Gen 3 dropper post:</strong> $179 / £146.99 (available first week of May)</li>\n<li><strong>DropBar Lever Kit:</strong> $59 / £43.58</li>\n<li><a href=\"https://www.pnwcomponents.com/collections/all\" target=\"_blank\">Buy now from PNW</a></li>\n</ul>\n<h2>Chrome Industries Doubletrack Handlebar Sling</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Doubletrack Handlebar Sling is a bar bag and messenger bag hybrid.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Imagine if you could combine the practical qualities of the now-ubiquitous bar bag with the portability and hipster chic of the messenger bag. That’s the USP of the Doubletrack Handlebar sling.</p>\n<p>It attaches to the bike quickly via two Velcro bar straps and one head tube strap with a buckle.</p>\n<p>Removal only takes a few seconds and you can then pull out the shoulder strap that’s hidden at the back to sling it across your chest for easy carrying.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Off the bike, the Doubletrack can be worn across the back.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>The Doubletrack is reasonably capacious by bar bag standards, with a claimed internal volume of five litres. It measures roughly 20×24×9cm with the roll-top folded right down, but doing it up less snugly unlocks extra space.</p>\n<p>The top is held shut with a magnetic closure, and there’s a mesh pocket on each side of the exterior for quick access to small essentials, plus loops you can strap things to. Within, there are another two pockets to keep small items separate from the main storage area.</p>\n<div></div>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Doubletrack is roomy, particularly if you don’t roll the top right down.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Weight isn’t likely to be the primary concern for riders seeking a bag like this but, if you’re interested, it weighs 393g on our scales.</p>\n<p>Like previous Chrome bags we’ve featured, it appears well made and its construction is such that it holds its shape even if it’s not fully loaded.</p>\n<ul><li>$60 / £60</li>\n<li><a href=\"https://www.chromeindustries.com/product/doubletrack-handlebar-sling/BG-328.html?dwvar_BG-328_color=BK&amp;dwvar_BG-328_size=NA&amp;cgid=bike_bagshttps://youtu.be/4qJAX1ov_HM\" target=\"_blank\">Buy now from Chrome Industries</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>SON (Schmidt) Edelux II dynamo headlight</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> SON’s dynamo headlights are some of the best in the business.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>SON (sometimes known as Schmidt) is one of the most respected names in the world of dynamo lighting – the brand’s hubs are renowned for their low rolling resistance, and its lights are lauded for their high-quality optics.</p>\n<p>Jack Luke is our resident dynamo fan and, having tried many of the other options on the market, he’s finally invested in a SON Edelux II headlight.</p>\n<p>The high-quality construction is immediately obvious. The housing is milled from a single piece of alloy and feels absolutely solid. This is sealed with an epoxy resin, protecting the delicate internals from water ingress.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A neat magnetic switch allows you to change modes.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The light uses a neat magnetic switch to change between settings and even the finish of the coaxial cable feels premium.</p>\n<p>In terms of construction, only the <a href=\"https://www.bikeradar.com/features/so-it-turns-out-rim-dynamos-dont-suck-anymore/\" target=\"_blank\">Exposure Revo</a> comes close in terms of how it feels in the hand.</p>\n<p>Unlike most <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lights-for-road-cycling/\" target=\"_blank\">bike lights</a>, which splurt out a big ol’ pile of lumens in a big broad circular beam, dynamo lights typically use funky shaped reflectors to provide a shaped beam that focuses light onto the road or trail without dazzling drivers (much like a car’s headlights).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The optics are licensed by B&amp;M.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The optics used in the Edelux II are licensed by Busch and Müller and conform to Germany’s strict StVZO standards.</p>\n<p>The light is available in a range of different colours, as well as vertical or ‘upside down’ mounting options (the latter is typically used when mounting the light to the underside of a front rack).</p>\n<p>Naturally, such a high-end light commands a bit of a premium over other options, but if the experiences of others are anything to go by, it’s money well spent.</p>\n<ul><li>£134.99 / €150 / $180 / AU$260</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Exped Synmat HL M</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Exped Synmat HL M is a ~2.5 season inflatable mat.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Lockdown restrictions ease again in England on the 12 April, which makes bikepacking and touring a possibility once more.</p>\n<p>So, what better way to re-ignite your passion for sleeping in ditches than a comfortable new mat to bed down on at the end of a long ride?</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The mat is not much larger than a 1-litre water bottle.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The Exped Synmat HL is a super lightweight inflatable sleeping mat that, when packed down, is only marginally bigger than a 1-litre bottle, at 19cm long and 9cm in diameter.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The bag is inflated with a nifty inflation sack.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The whole system (mat, inflation bag, storage sack and repair kit) weighs 464g on our scales – that’s impressively light for a relatively luxurious 7cm thick, full-length mattress that isn’t outrageously expensive at £150 RRP.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The mat is around 7cm deep.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The mat has an ASTM R-value (the measure of how warm a sleeping mat is) of 2.9. Generally speaking, a mat with an R-value of 2.0 is designed for summer use, with 4.0+ for winter use, so this sits more towards the fair-weather end of the spectrum.</p>\n<p>The slender volume of the matt is its key attraction.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Imagine Jack Luke’s sultry mat modelling pose but, instead of his bedroom, he’s under a wet hedge – that’s what he’s hoping his April will look like once restrictions ease.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Given it is so small, it’s entirely possible that when paired with a lightweight bag, you could get a full summer sleep system (minus bivvy bag) that would fit within a triple-boss cargo cage, with a full weight under 1kg.</p>\n<ul><li>£150 / $179 / €TBC</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b349e06cafd25fb272f3d1b22b912683da01f259ade4e96b6ee00cd14b6f5ee2","category":"Cycling"}