{"title":"Extended ozone depletion and reduced snow and ice cover—Consequences for Antarctic biota","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17283?af=R","date":1714028400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d6710ee5-89ef-4f6c-92c6-d11d000f7749/gcb17283-toc-0001-m.png\" alt=\"Extended ozone depletion and reduced snow and ice cover—Consequences for Antarctic biota\" />\n<p>The last 4 years have seen unusually long-lived ozone holes over Antarctica, persisting into early summer—the crucial period of new plant growth and peak animal breeding season. Less ozone means the UV index has doubled, reaching extreme levels of 14. Ice and snow reflect light, and long-lasting ozone holes mean that emperor penguin chicks and seal pups born in late spring are potentially impacted by this enhanced UV radiation. Less sea ice, driven by climate change, means more sunlight penetrates the ocean. Increasing UV impacts survival of phytoplankton and krill, with cascading effects higher up the food chain.</p>\n<br />\n<h2>Abstract</h2>\n<p>Stratospheric ozone, which has been depleted in recent decades by the release of anthropogenic gases, is critical for shielding the biosphere against ultraviolet-B (UV-B) radiation. Although the ozone layer is expected to recover before the end of the 21st century, a hole over Antarctica continues to appear each year. Ozone depletion usually peaks between September and October, when fortunately, most Antarctic terrestrial vegetation and soil biota is frozen, dormant and protected under snow cover. Similarly, much marine life is protected by sea ice cover. The ozone hole used to close before the onset of Antarctic summer, meaning that most biota were not exposed to severe springtime UV-B fluxes. However, in recent years, ozone depletion has persisted into December, which marks the beginning of austral summer. Early summertime ozone depletion is concerning: high incident UV-B radiation coincident with snowmelt and emergence of vegetation will mean biota is more exposed. The start of summer is also peak breeding season for many animals, thus extreme UV-B exposure (UV index up to 14) may come at a vulnerable time in their life cycle. Climate change, including changing wind patterns and strength, and particularly declining sea ice, are likely to compound UV-B exposure of Antarctic organisms, through earlier ice and snowmelt, heatwaves and droughts. Antarctic field research conducted decades ago tended to study UV impacts in isolation and more research that considers multiple climate impacts, and the true magnitude and timing of current UV increases is needed.</p>","author":"Sharon A. Robinson, \nLaura E. Revell, \nRoy Mackenzie, \nRachele Ossola","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"b34da9625478e5fc49efb8ddd7fde4331b9135b0eb3c91b62ed79f08fbab8dd7","category":"Environment"}