{"title":"Trying to make sense of why Otis exploded en route to Acapulco this week","link":"https://arstechnica.com/?p=1978886","date":1698333457000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/otis-1-1024x746-1-800x583.jpg\" alt=\"Hurricane Otis on Tuesday, as it was strengthening before making landfall in Mexico.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/otis-1-1024x746-1.jpg\">Enlarge</a> <span>/</span> Hurricane Otis on Tuesday, as it was strengthening before making landfall in Mexico. (credit: NOAA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The word \"unprecedented\" gets tossed around a lot these days, but what happened with Hurricane Otis and its impact on Acapulco on Tuesday were truly without precedent. And it was with only slight precedent anywhere in terms of how quickly it intensified.</p>\n<p>Otis was the textbook definition of rapid intensification, going from a 50 mph tropical storm on Monday evening to a 165 mph category 5 hurricane last night. Through about mid-morning on Tuesday, everything was going basically as you'd expect for a modest hurricane with Otis. It may have been tracking toward a category 2 type landfall, or even a category 3 type landfall in the worst case, if you assumed the general rules of rapid intensification in this region. But Otis did not follow the rules.</p>\n<p>Much like an onion, there are layers to this story that are important. First, take it from one of the more seasoned NOAA hurricane hunters—this was not what they expected when they flew their mission on Tuesday. Meteorologist Jeremy DeHart wrote on the site formerly known as Twitter, \"I have arrived to a storm &amp; been surprised by the intensity, but nothing like this. Expected a marginal hurricane, found a Cat 3! Reminiscent of the stories I've heard about flying into Patricia ('05), in the same part of the world.\"</p></div><p><a href=\"https://arstechnica.com/?p=1978886#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1978886&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b3678456b088b77d590f5b806c78330178adaff64e05d84d23abdf7be1373e02","category":"Tech"}