{"title":"มหาวิทยาลัยกรุงเทพ ลงทุนโครงสร้างพื้นฐานไอทีรองรับการผลิตวิศวกรรมเอไอที่เข้าใจโลกธุรกิจ","link":"https://www.blognone.com/node/124392","date":1629963000000,"content":"<div><div><div><p><em>มหาวิทยาลัยกรุงเทพ เลือกใช้งานระบบโครงสร้างพื้นฐานไอทีจากไอบีเอ็ม โดยคอมพิวเตอร์ยูเนี่ยนพาร์ตเนอร์ผู้เชี่ยวชาญเป็นผู้ติดตั้งระบบ ชูจุดเด่นสร้างวิศวกรปัญญาประดิษฐ์ที่พร้อมทำงานได้จริง</em></p>\n<p>จากการขาดแคลนบุคลากรทางด้านไอทีโดยเฉพาะบุคลากรด้านเอไอ กระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม ตั้งเป้าหมายในการผลิตบุคลากรทางด้านเอไอ จำนวน 700,000 คนภายใน 7 ปีข้างหน้า ทางมหาวิทยาลัยกรุงเทพเองก็เช่นกัน เล็งเห็นถึงปัญหาดังกล่าว จึงได้เปิดสอนหลักสูตรวิศวกรรมปัญญาประดิษฐ์และวิศวกรรมข้อมูล หรือวิศวกรรมเอไอ เมื่อ 2 ปีที่แล้ว โดยมีจุดมุ่งหมายเพื่อพัฒนาวิศวกรด้านปัญญาประดิษฐ์ที่แตกต่างออกไปจากหลักสูตรของทางด้านประเทศฝั่งตะวันตกที่มุ่งเน้นในการพัฒนาในเรื่องของอัลกอลิธึมและการพัฒนาแพลตฟอร์มด้านปัญญาประดิษฐ์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9b5e109d1e3be5700839d3bc0509211d.png\" /></p>\n<p>แต่ที่มหาวิทยาลัยกรุงเทพมุ่งมั่นสร้างวิศวกรด้านปัญญาประดิษฐ์ที่สามารถนำเอาอัลกอริธึมและแพลตฟอร์มต่างๆ มาประยุกต์ใช้กับงานด้านธุรกิจได้อย่างแท้จริง จึงถือว่าเป็นจุดแตกต่างในการผลิตวิศวกรด้านปัญญาประดิษฐ์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7c89967d8e07459c02925eda0da47cc8.jpg\" /></p>\n<p><strong>ผู้ช่วยศาสตราจารย์.ดร.วิศาล พัฒน์ชู คณบดีคณะวิศวกรรมศาสตร์ มหาวิทยาลัยกรุงเทพ</strong> ได้อธิบายถึงความแตกต่างของหลักสูตรนี้ว่า “ความรู้ทางด้านเทคนิคเราไม่ห่วงเลย ความรู้เกี่ยวกับเรื่องนี้มีอยู่มากมาย แต่ความสามารถในการคิดวิเคราะห์และนำเอาเอไอไปใช้ต่างหากเป็นสิ่งที่ควรให้ความสนใจ ทางมหาวิทยาลัยจึงเน้นให้นักศึกษาของเราได้มีโอกาสฝึกทดลองปฏิบัติดาต้าเซ็ตชุดจริงที่ใช้ในโลกธุรกิจ เพื่อให้ได้สัมผัสกับการใช้งานในธุรกิจจริง”</p>\n<p><strong>หลักสูตรวิศวกรรมปัญญาประดิษฐ์ที่แตกต่าง</strong><br />\nนักศึกษาในสาขาวิชาวิศวกรรมปัญญาประดิษฐ์และวิทยาการข้อมูล จะมีรูปแบบการเรียนที่แตกต่างจากวิศวกรรมคอมพิวเตอร์และวิทยาการคอมพิวเตอร์ ถึงแม้จะเป็นหลักสูตร 4 ปีเหมือนกัน แต่ระดับความเข้มข้นของการเรียนรู้กลับแตกต่างออกไปจากที่เคยมีมา โดยเริ่มต้นจากปี 1 จะเป็นการปูพื้นฐานด้านต่างๆ พอก้าวเข้าสู่ปีที่ 2 เป็นการเรียนรู้ในเรื่องของโปรแกรมมิ่ง เช่น Python, PyTorch การเรียกใช้งาน Library ด้านเอไอต่างๆ มาใช้อย่างเหมาะสมกับขนาดของข้อมูลที่แตกต่างกัน</p>\n<p>ต่อมาในปีที่ 3 จะเป็นการเจาะลึกด้านเอไอ ได้เรียนรู้เครื่องมือที่มีบนแพลตฟอร์มและสภาพแวดล้อมต่างๆ ไม่ว่าจะเป็นงานเล็กๆ ที่สามารถทำบนเครื่องของนักศึกษาเองได้ จนกระทั่งถึงการทำงานบนสภาพแวดล้อมบนคลาวด์ หรือจะเป็นงานที่ต้องการกำลังในการประมวลผลขนาดใหญ่ที่อยู่บนเซิร์ฟเวอร์ก็สามารถทำได้ เมื่อนักศึกษาคุ้นเคยกับเครื่องมือต่างๆ ก็ถึงเวลาที่จะต้องถูกส่งเข้าสู่การลงมือทำงานจริงกับภาคธุรกิจในรูปแบบของการทำสหกิจหรือการรับโจทย์จริงเพื่อแก้ปัญหาในช่วงปี 3 เทอม 2</p>\n<p>หลังจากกลับจากสหกิจเพื่อเข้าเรียนในชั้นปีที่ 4 ก็เชื่อว่าทุกคนจะนำความรู้ ประสบการณ์ และความต้องการทางธุรกิจที่แท้จริงมาทำโครงการเพื่อตอบโจทย์ทางธุรกิจก่อนที่จะจบการศึกษาออกไป จะเห็นได้ว่าหลักสูตรนี้กำลังสร้างบัณฑิตที่พร้อมใช้งาน</p>\n<p><strong>ลงทุนสร้างความได้เปรียบด้วยสภาพแวดล้อมที่ครบถ้วน</strong><br />\nทั้งนี้ การเรียนรู้การใช้งานปัญญาประดิษฐ์ ในปีที่ 3 และปีที่ 4 จำเป็นต้องประมวลผลดาต้าเซ็ตขนาดใหญ่ ซึ่งการประมวลผลบนเครื่องคอมพิวเตอร์ส่วนตัวของนักศึกษา หรือการประมวลผลบนคลาวด์ จะใช้เวลานาน และค่าใช้จ่ายสูงกว่าการลงทุนโครงสร้างพื้นฐานไอทีไว้ใช้งานเองที่มหาวิทยาลัย จึงเป็นเหตุผลสำคัญที่ทำให้ทางมหาวิทยาลัยตัดสินใจลงทุนจัดสร้างระบบโครงสร้างพื้นฐานไอที เพื่อรองรับการประมวลผลดาต้าเซ็ตขนาดใหญ่ โดยเลือกใช้งานเซิร์ฟเวอร์ประมวลผล และสตอเรจประสิทธิภาพสูง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5b9bff6df52db6ec1250768b3990cffb.jpg\" /></p>\n<p><strong>IBM และ CU ช่วยเติมเต็ม</strong><br />\nทางมหาวิทยาลัยกรุงเทพตัดสินใจเลือก IBM Power System AC922 ใช้ซีพียู Power9 ที่ออกแบบมาเพื่องานเอไอ 2 เครื่อง โดยอีกเครื่องมาพร้อมกับ GPU NVIDIA Tesla V100 จำนวน 4 ใบ เพื่อเพิ่มความแรงในการประมวลผลได้อย่างเต็มที่ จากความมั่นใจในเทคโนโลยีและองค์ความรู้ด้านเอไอที่ทางไอบีเอ็มสะสมมา ประกอบกับข้อมูลที่ทางมหาวิทยาลัยได้มาจากงานแสดงประสิทธิภาพทางด้านเทคโนโลยี ที่แสดงให้เห็นว่าสำหรับงานวิจัยด้านเอไอ และวิทยาศาสตร์ข้อมูล (Data Science) โซลูชั่นของไอบีเอ็มมีค่า Performance Index ดีกว่าแบรนด์อื่น อีกทั้งยังมีซอฟต์แวร์เด่น เช่น Watson ที่ทำให้คนทั้งโลกยอมรับการทำงานด้านเอไอ</p>\n<p>นอกจากนี้ไอบีเอ็ม ยังมีเครื่องมือทางด้านเอไอให้เลือกใช้มากมาย และมีประสบการณ์ในการนำเอไอ ไปใช้ในธุรกิจจริง เช่น อุตสาหกรรมรถยนต์ การเงิน การธนาคาร การประกันภัย อุตสาหกรรมโรงงานและการผลิต อุตสาหกรรมสุขภาพและโรงพยาบาล ทำให้นักศึกษามีเครื่องมือและประสบการณ์ที่ช่วยย่นระยะเวลาในการเรียนรู้ได้เร็วมากขึ้น ทำให้โซลูชั่นที่เลือกลงทุนครั้งนี้สามารถรองรับการใช้งานของนักศีกษาที่ต้องการได้อย่างเต็มรูปแบบ</p>\n<p>ผู้ช่วยศาสตราจารย์.ดร.วิศาล กล่าวว่า <em>“ทางมหาวิทยาลัยเลือกไอบีเอ็ม เพราะเราอยากได้โซลูชั่น ซึ่งนอกจากไอบีเอ็มจะมีเซิร์ฟเวอร์แล้ว ไอบีเอ็มยังมีแพลตฟอร์ม Watson ซึ่งเป็นแพลตฟอร์มเอไอที่ใช้งานจริงในโลกธุรกิจ เราอยากให้นักศึกษาได้มีโอกาสใช้งานโซลูชั่นเหล่านี้ เวลาไปทำงานจริง Learning curve ก็จะไปเร็ว”</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e5797f46a3569fcfe62e46aa4a50de51.jpg\" /></p>\n<p>นอกจากการเลือกโซลูชั่นของทางไอบีเอ็มแล้ว ทางมหาวิทยาลัยฯ เลือกผู้ให้บริการติดตั้งและให้บริการหลังการขายที่เหมาะสมที่สุด ซึ่งเป็นการเลือกใช้บริการมืออาชีพอันดับต้นๆ ของเมืองไทยอย่างคอมพิวเตอร์ยูเนี่ยน การเลือกใช้บริการครั้งนี้ พิจารณาจากประสบการณ์ของทีมงานของคอมพิวเตอร์ยูเนี่ยนที่เต็มไปด้วยผู้เชี่ยวชาญที่มากด้วยประสบการณ์ในการให้บริการกับลูกค้าขนาดใหญ่มากมาย เชื่อว่าจะสามารถร่วมถ่ายทอดความรู้ในทั้งในเชิงเทคนิคและความต้องการทางธุรกิจให้กับทางมหาวิทยาลัยได้อย่างลงตัวที่สุด</p>\n<p>ผู้ช่วยศาสตราจารย์.ดร.วิศาล กล่าวเพิ่มเติมว่า <em>“ทางมหาวิทยาลัยเลือก บริษัท คอมพิวเตอร์ยูเนี่ยน เป็นผู้ติดตั้งระบบ เพราะเป็นบริษัทตัวแทนจำหน่ายด้านเทคโนโลยีและผู้ให้บริการมาอย่างยาวนาน และมีบุคลากรมือต้นๆ ของประเทศ ในการถ่ายทอดความรู้ความเชี่ยวชาญให้กับมหาวิทยาลัยอีกด้วย”</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/444d1bda00d4cc62eb47c5d86f11afb1.jpg\" /></p>\n<p><strong>เน้นความร่วมมือจริงกับโลกธุรกิจ</strong><br />\nการทำสหกิจ เป็นโครงการที่เปิดโอกาสให้นักศึกษาได้ทดลองทำงานจริงกับผู้ประกอบการ ซึ่งจะทำให้นักศึกษามีประสบการณ์ในการรับรู้ความต้องการในโลกธุรกิจและนำมาต่อยอดจนกลายเป็นผลงานที่ตอบโจทย์ให้กับธุรกิจได้</p>\n<p>ตัวอย่างเช่น ในปีที่ผ่านมา ทางมหาวิทยาลัยมีความร่วมมือกับทางบริษัทที่ทำการพัฒนาแชทบ็อตและไมโครไฟแนนซ์ มาช่วยสอนและแนะนำการนำเอไอมาใช้งานในธุรกิจ โดยทั้งสองบริษัทเป็นตัวอย่างของการพัฒนาความร่วมมือของทางมหาวิทยาลัยกรุงเทพ ซึ่งจะมีการขยายความร่วมมือในบริษัทอื่นๆ เพิ่มขึ้นอย่างต่อเนื่อง</p>\n<p><strong>เปิดคอร์สเอไอเพื่ออัพสกิลคนไอที</strong><br />\nในระยะยาวด้วยจำนวนของนักศึกษาที่จบไปในแต่ละปีการศึกษาย่อมไม่เพียงพอต่อความต้องการของตลาดแรงงานด้านไอที ทางมหาวิทยาลัยกรุงเทพจึงมีแนวความคิดที่จะเปิดเป็นหลักสูตรให้กับคนภายนอก และคนทำงานด้านไอทีให้เข้ามาเพิ่มพูนทักษะด้านเอไอโดยเฉพาะ เชื่อว่าการรับรองหลักสูตรที่ครบองค์ที่ประกอบไปด้วยมหาวิทยาลัยกรุงเทพ ร่วมด้วยผู้เชี่ยวชาญจากคอมพิวเตอร์ยูเนี่ยนและเทคโนโลยีระดับโลกของไอบีเอ็ม หากสามารถร่วมรับรองหลักสูตรที่จะพัฒนาขึ้นในอนาคต เชื่อว่าจะสร้างความมั่นใจให้กับผู้เรียนและผู้สอบได้อย่างแน่นอน</p>\n<p><strong>บทสรุป</strong><br />\nปัจจุบันนักศึกษารุ่นแรกที่เข้ามาเรียนในปีการศึกษา 2563 กำลังก้าวขึ้นสู่ชั้นปีที่ 2 นั่นหมายความว่าบัณฑิตรุ่นแรกของหลักสูตรวิศวกรรมปัญญาประดิษฐ์ของมหาวิทยาลัยกรุงเทพ จะเข้าสู่ตลาดแรงงานทางด้านนี้ได้จำนวนไม่น้อยกว่า 50 คนในปี 2566 เชื่อว่า บัณฑิตรุ่นแรกจะเป็นกำลังสำคัญและเป็นบุคลากรที่พร้อมทำงานให้กับธุรกิจที่ต้องการการนำเอาปัญญาประดิษฐ์ไปใช้ในรูปแบบที่พร้อมใช้และเข้าใจความต้องการของธุรกิจอย่างแท้จริง</p>\n<p>................................................</p>\n<p>บริษัท คอมพิวเตอร์ยูเนี่ยน จำกัด<br />\nโทร 02 311 6881 # 7151, 7156 หรือ email : cu_mkt@cu.co.th</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/31f663c512c8fbe9e50e0384b705cd48.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/computer-union\">Computer Union</a></div><div><a href=\"/topics/ibm\">IBM</a></div><div><a href=\"/topics/bangkok-university\">Bangkok University</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b36848f4d29bad0dedcfacb0a9a38f68fd2bcc7e9814f0628a0f3ba679b5872b","category":"Thai"}