{"title":"Carbon Cycle–Climate Feedbacks in the Post-Paris World","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-081700?TRACK=RSS","date":1721692800000,"content":"<div><p>The Paris Agreement calls for emissions reductions to limit climate change, but how will the carbon cycle change if it is successful? The land and oceans currently absorb roughly half of anthropogenic emissions, but this fraction will decline in the future. The amount of carbon that can be released before climate is mitigated depends on the amount of carbon the ocean and terrestrial ecosystems can absorb. Policy is based on model projections, but observations and theory suggest that climate effects emerging in today's climate will increase and carbon cycle tipping points may be crossed. Warming temperatures, drought, and a slowing growth rate of CO<span>2</span> itself will reduce land and ocean sinks and create new sources, making carbon sequestration in forests, soils, and other land and aquatic vegetation more difficult. Observations, data-assimilative models, and prediction systems are needed for managing ongoing long-term changes to land and ocean systems after achieving net-zero emissions.\n</p><ul>\n<li><span>▪ \n</span>International agreements call for stabilizing climate at 1.5° above preindustrial, while the world is already seeing damaging extremes below that.\n</li>\n<li><span>▪ \n</span>If climate is stabilized near the 1.5° target, the driving force for most sinks will slow, while feedbacks from the warmer climate will continue to cause sources.\n</li>\n<li><span>▪ \n</span>Once emissions are reduced to net zero, carbon cycle-climate feedbacks will require observations to support ongoing active management to maintain storage.\n</li>\n</ul><p></p></div>","author":"David S. Schimel and Dustin Carroll","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"b36d53f1167084d902024cc6716af491e12f90eb30541a25d7344c64fc488537","category":"Environment"}