{"title":"Rapid climate change increases diversity and homogenizes composition of coastal fish at high latitudes","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17273?af=R","date":1715324400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a61d78ef-c21b-4988-b8b6-aff84892a607/gcb17273-toc-0001-m.png\" alt=\"Rapid climate change increases diversity and homogenizes composition of coastal fish at high latitudes\" />\n<p>During the last three decades, as water temperatures along the Norwegian coast increased rapidly, many fish species have moved north. The northward expansion in species distributions resulted in higher biodiversity and more similar species composition along the entire coast. The documented changes in diversity and composition are reshaping coastal ecosystems, influencing their functioning, and potentially affecting their provision of goods and services. The rapid, climate-driven changes in fish biodiversity stress the urgent need for a climate adaptation of integrated coastal management.</p>\n<br />\n<h2>Abstract</h2>\n<p>Rapid warming at high latitudes triggers poleward shifts of species' distributions that impact marine biodiversity. In the open sea, the documented redistributions of fish lead to a borealization of Arctic fauna. A climate-driven borealization and increased species diversity at high latitudes are also expected in coastal fish communities, but they have not been previously documented on a large, biogeographic scale. Here, we investigate the impact of temperature change over the last 25 years on fish communities along the coast of Norway. The study area, spanning different ecoclimatic zones between 62° and 71° N, harbors over 200 species of boreal and Arctic fish. Several of these fish species are harvested by coastal and indigenous communities, influencing settlement geography and livelihood. The long-term data on coastal water temperatures and fish species were obtained from monitoring stations and scientific surveys. Water temperature measured at three fixed sampling stations distributed along the coast show increased temperatures during the study period. The fish species distribution and abundance data were obtained from the annually standardized scientific bottom trawl survey program. Fish species richness, which was highest in the south, increased with warming first in the south and then, gradually, further north, eventually affecting biodiversity in the whole study area. Fish community composition showed a distinct latitudinal pattern early in the study, with Arctic fish species confined to the north and boreal species dominating the south. The poleward shifts eventually eroded this zoogeographic pattern, resulting in more boreal fish species in the north and an increased homogenization of species composition along the Norwegian coast. The climate-driven reorganization of fish communities affects coastal ecosystems that are exposed to fisheries, aquaculture, and other rapidly expanding human activities, stressing the urgent need for a climate adaptation of integrated coastal management.</p>","author":"Anna Siwertsson, \nUlf Lindström, \nMagnus Aune, \nErik Berg, \nJofrid Skarðhamar, \nØystein Varpe, \nRaul Primicerio","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"b375b0963d3a8ebfd8258ce06d2ef0bb3b1cb0c63c65810cbd8975bbf6afca56","category":"Environment"}