{"title":"Rohan Dennis officially joins Jumbo-Visma","link":"https://cyclingtips.com/2021/09/rohan-dennis-officially-joins-jumbo-visma/","date":1630494543000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/GettyImages-1331045721-650x433.jpg\" /></div><h2>Rohan Dennis officially joins Jumbo-Visma</h2><p>\n</p><p>Rohan Dennis will leave Ineos Grenadiers at the end of the 2021 season to join Jumbo-Visma through 2023. Dennis has represented Ineos Grandiers for two years. </p>\n\n\n\n<p>“I’m looking forward to the new challenges and I’m excited to be joining arguably one of the leading teams with R&amp;D in the pro peloton. Riding alongside the likes of Primož Roglič, Wout van Aert and Tom Dumoulin – again – is something I couldn’t refuse,” Dennis said of the move.</p>\n\n\n\n<p>Dennis rode for Jumbo-Visma’s development team in 2011, back when it was the Rabobank Continental Team. “It’s a new chapter, but also a return to a part of my early years,” said Dennis.</p>\n\n\n\n<p>Jumbo-Visma will have the full Olympic time trial podium on their team in 2022, with Dennis, Tom Dumoulin, and the Olympic champion Primoz Roglič. </p>\n\n\n\n<p>“We have a very good reputation in terms of time trialling among riders of other teams,” said Jumbo-Visma Head of Performance Mathieu Heijboar. “We came first and second at the Olympics and the number three will also be on the team next year. Soon we will have three riders from the Olympic podium in our team, on a Cervélo. That is fantastic.”</p>\n\n\n\n<p>Dennis has had a weird couple of years, with his premature exit of Bahrain-Merida during the Tour de France in 2019. Despite the uncertainty, Dennis won the World Championship time trial that year and was picked up by Ineos Grenadiers. </p>\n\n\n\n<p>In 2020 Dennis was a key member of the Giro d’Italia winning team, helping Tao Geoghegan-Hart take the pink jersey home at the end of the three-week race. Dennis has notched two victories in 2021. First on stage 2 of the Volta Catalunya and then the Tour de Romandie prologue. </p>\n\n\n\n<p>With his raw power and years of experience Dennis adds value to Jumbo-Visma’s Grand Tour team but might also find himself hunting his own results. </p>\n\n\n\n<p>“I have been talking to him for a few years now. He is a dream asset for me, who will be a great support for our GC riders in particular, but who will also regularly be in a position to chase an overall victory himself,” said team director Merijn Zeeman.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/rohan-dennis-officially-joins-jumbo-visma/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b377ed3e4c414cce5a033630b709c81926b2102cbaa9549fd31294f56e1b959d","category":"Cycling"}