{"title":"★ Nobody Uses Threads Anymore, It’s Too Crowded","link":"https://daringfireball.net/2023/07/nobody_uses_threads_anymore","date":1690858932000,"content":"\n<p>Katie Paul and Sheila Dang, reporting for Reuters, “<a href=\"https://www.reuters.com/business/media-telecom/meta-plans-retention-hooks-threads-more-than-half-users-leave-app-2023-07-28/\">Meta Plans Retention ‘Hooks’ for Threads as More Than Half of Users Leave App</a>”:</p>\n\n<blockquote>\n  <p>Meta Platforms executives are heavily focused on boosting\nretention on their new Twitter rival Threads, after the app lost\nmore than half of its users in the weeks following its buzzy\nlaunch, CEO Mark Zuckerberg told employees on Thursday. Retention\nof users on the text-based app was better than executives had\nexpected, though it was “not perfect,” said Zuckerberg, speaking\nat an internal company town hall, the audio of which was heard by\nReuters.</p>\n\n<p>“Obviously, if you have more than 100 million people sign up,\nideally it would be awesome if all of them or even half of them\nstuck around. We’re not there yet,” he said. Zuckerberg said he\nconsidered the drop-off “normal” and expected retention to grow as\nthe company adds more features to the app, including a desktop\nversion and search functionality.</p>\n</blockquote>\n\n<p>Of course there was going to be a drop-off in usage after the initial influx. When brick-and-mortar stores and restaurants have successful grand openings, no one expects that opening traffic not to drop off. By <em>all</em> accounts, Threads has tens of millions of daily users despite being brand new and not yet offering a web interface.</p>\n\n<p>[<strong>Sidenote:</strong> It is a bit depressing that among normal people, <a href=\"https://www.threads.net/@reckless1280/post/CvAkXe3LOpc/\">web apps are equated with “desktop”</a>. But it’s not surprising. People want to use Threads from their desktop computers, and to them, that means typing “threads.net” in their web browser.]</p>\n\n<p>But this narrative that Threads is a bust <a href=\"https://www.techmeme.com/230727/p38#a230727p38\">took hold over the weekend</a>:</p>\n\n<ul>\n<li><a href=\"https://arstechnica.com/tech-policy/2023/07/zuck-says-threads-doing-better-than-expected-despite-losing-over-half-of-users/\">Ars Technica</a>: “Most of the 100 Million People Who Signed Up for Threads Stopped Using It”</li>\n<li><a href=\"https://nypost.com/2023/07/28/elon-musk-touts-record-number-of-x-users-as-threads-stumbles/\">The New York Post</a>: “Elon Musk Touts Record Number of X Users as Mark Zuckerberg’s Threads Stumbles”</li>\n<li><a href=\"https://www.businessinsider.com/threads-lost-more-than-half-its-users-mark-zuckerberg-says-2023-7?op=1\">Insider</a>: “Over Half the People Who Signed Up for Threads Have Stopped Using It Already, Prompting Mark Zuckerberg to Push for ‘Hooks’ to Entice Users, Report Says”</li>\n</ul>\n\n<p>Dare Obasanjo, writing on Threads, <a href=\"https://www.threads.net/@carnage4life/post/CvTYp1AJ00Z/\">retorted perfectly</a>:</p>\n\n<blockquote>\n  <p>The idea that an app that is clearly an MVP (Minimum Viable\nProduct) doesn’t have 100 million active users is a failure is\nthe sort of addle brained thinking that the tech media has\nsaddled us with.</p>\n\n<p>The tech press can only write 3 stories:</p>\n\n<ul>\n<li>This company is a success</li>\n<li>This company is a failure</li>\n<li>Look how much funding this company got</li>\n</ul>\n</blockquote>\n\n<p>Arguably, “look how much funding this company got” stories are just variations on the first two, depending on the sum of the funding.</p>\n\n<p>A retention rate of 40-50 percent for a new app is excellent. I see no reason to doubt Zuckerberg’s claim that Threads’s retention is higher than they expected. All you need to do is <em>use</em> Threads to see that it’s thriving. Is it on a path to long-term success? I don’t see how anyone could say that so early, but it sure seems more likely than not. And we haven’t even yet mentioned the fact that Threads is not yet available in the entire EU.</p>\n\n<p>One interesting data point comes from Google’s Play Store, where the top free apps in the “Social” category look like this, as I write at 8pm ET:</p>\n\n<ol>\n<li>TikTok</li>\n<li>Instagram</li>\n<li>Facebook</li>\n<li>Threads</li>\n<li>X</li>\n<li>Reddit</li>\n<li>Facebook Lite</li>\n<li>Bigo Live</li>\n<li>Text Free</li>\n<li>Plenty of Fish Dating App</li>\n</ol>\n\n<p>Earlier this evening, that same list had apps 4–7 — Threads, X, Reddit, and Facebook Lite — in a different order. I take this to mean that the first 3 are the big 3, and the next 4 are close to each other in a second tier. And then there’s a dropoff to weird apps.</p>\n\n<p>The “social networking” category is very different on Apple’s App Store, because many of these apps aren’t in the “social networking” category. In the App Store, the top 5 in the category are WhatsApp, Facebook, Telegram, Threads, and Facebook Messenger; on Android, WhatsApp, Messenger, Telegram (and Snapchat!) are all in the “communications” category. And Instagram and Snapchat are in the “photo and video” category. X, just like when it was named Twitter, is in the “News” category, where it can look more popular than it actually is.</p>\n\n<p>Here’s where these apps rank amongst <em>all</em> apps on the App Store:</p>\n\n<p>5. TikTok <br />\n6. WhatsApp <br />\n9. Instagram <br />\n13. Facebook <br />\n16. Telegram <br />\n18. Snapchat <br />\n21. Threads <br />\n31. Messenger <br />\n35. X</p>\n\n<p>They use different ranking formulas (and both keep their formulas secret, to thwart attempts to game the rankings), but both the App Store and Play Store have Threads ahead of X. You’d never guess that from this weekend’s “Threads is a bust” headlines.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b37e444f531c09a0d3f54cbb1fc03784f2d551fd59f5ed868ed7c9c2310d83d8","category":"Tech"}