{"title":"Unraveling radiation resistance strategies in two bacterial strains from the high background radiation area of Chavara-Neendakara: A comprehensive whole genome analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304810","date":1718028000000,"content":"<p>by Sowptika Pal, Ramani Yuvaraj, Hari Krishnan, Balasubramanian Venkatraman, Jayanthi Abraham, Anilkumar Gopinathan</p>\r\n\r\nThis paper reports the results of gamma irradiation experiments and whole genome sequencing (WGS) performed on vegetative cells of two radiation resistant bacterial strains, <i>Metabacillus halosaccharovorans</i> (VITHBRA001) and <i>Bacillus paralicheniformis</i> (VITHBRA024) (D<sub>10</sub> values 2.32 kGy and 1.42 kGy, respectively), inhabiting the top-ranking high background radiation area (HBRA) of Chavara-Neendakara placer deposit (Kerala, India). The present investigation has been carried out in the context that information on strategies of bacteria having mid-range resistance for gamma radiation is inadequate. WGS, annotation, COG and KEGG analyses and manual curation of genes helped us address the possible pathways involved in the major domains of radiation resistance, involving recombination repair, base excision repair, nucleotide excision repair and mismatch repair, and the antioxidant genes, which the candidate could activate to survive under ionizing radiation. Additionally, with the help of these data, we could compare the candidate strains with that of the extremely radiation resistant model bacterium <i>Deinococccus radiodurans</i>, so as to find the commonalities existing in their strategies of resistance on the one hand, and also the rationale behind the difference in D<sub>10</sub>, on the other. Genomic analysis of VITHBRA001 and VITHBRA024 has further helped us ascertain the difference in capability of radiation resistance between the two strains. Significantly, the genes such as <i>uvsE</i> (NER), <i>frnE</i> (protein protection), <i>ppk1</i> and <i>ppx</i> (non-enzymatic metabolite production) and those for carotenoid biosynthesis, are endogenous to VITHBRA001, but absent in VITHBRA024, which could explain the former’s better radiation resistance. Further, this is the first-time study performed on any bacterial population inhabiting an HBRA. This study also brings forward the two species whose radiation resistance has not been reported thus far, and add to the knowledge on radiation resistant capabilities of the phylum Firmicutes which are abundantly observed in extreme environment.","author":"Sowptika Pal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b37ed9fbcd5bf12c9281fc3078882f4fc9626c04865548ea350f11bf05cfe6cb","category":"Interdisciplinary"}