{"title":"How negative self-views may interfere with building positive relationships: An experimental analogue of identity dysfunction in borderline personality disorder","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301196","date":1711634400000,"content":"<p>by Charlotte C. van Schie, Laura Whiting, Brin F. S. Grenyer</p>\r\nIntroduction <p>A disturbed, negative sense of self is associated with various interpersonal difficulties and is characteristic of disorders such as borderline personality disorder (BPD). Negative self-views may affect an individuals’ ability to build positive relationships, including a therapeutic relationship. However, it is not yet well understood how identity disturbances give rise to interpersonal difficulties. Using an experimental analogue design, we tested whether identity disturbances are associated with interpersonal difficulties.</p> Methods <p>Participants were university students (<i>N</i> = 43, age <i>M</i> = 20.51 (<i>SD</i> = 3.08), women <i>N</i> = 32 (74.4%)) who reported moderate to high levels of BPD features, with 34.9% reporting significant BPD features as measured by the Borderline scale of the Personality Assessment Inventory (PAI-BOR). In a within-subject experimental paradigm using a Social Feedback Task, participants received negative, intermediate, and positive evaluations, supposedly from a panel. Using multilevel models, we tested whether negative self-views were associated with how much the participants liked, trusted, and felt close to each of the three panel members who provided either predominantly negative, intermediate, or positive feedback.</p> Results <p>People with more negative self-views reported lower mood in response to positive feedback. In addition, where people with more positive self-views felt better when receiving feedback that was congruent with their self-views, people with more negative self-views did not report a better mood. Importantly, people with negative self-views felt lower desire to affiliate with the member who provided predominantly positive feedback. Affiliation was not affected when feedback was given by the negative member and intermediate member to those with negative self-views.</p> Conclusions <p>The findings validated that those with more negative self-views anticipated and expected more negative responses from others. Negative self-views, as relevant for BPD, may explain how people relate differently to those giving different types of feedback. Pervasive negative self-views may interfere with building new relationships including the therapeutic alliance. It may be helpful for clinicians to be aware of the potential challenges around creating a supportive therapeutic relationship for patients with negative self-views. Overly positive affirmations made by clinicians may inadvertently lower the patient’s mood and may impede alliance formation.</p>","author":"Charlotte C. van Schie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b383a832940d46ab3eade8e59e6e2cdf87757d98b7e0b8680c9a71d319119aaa","category":"Interdisciplinary"}