{"title":"Hydroclimatic Vulnerability of Wetlands to Upwind Land Use Changes","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003837?af=R","date":1709110137000,"content":"<h2>Abstract</h2>\n<p>Despite their importance, wetland ecosystems protected by the Ramsar Convention are under pressure from climate change and human activities. These drivers are altering water availability in these wetlands, changing water levels or surface water extent, in some cases, beyond historical variability. Attribution of the effects of human and climate activities is usually focused on changes within the wetlands or their upstream surface and groundwater inputs. However, the reliance of wetland water availability on upwind atmospheric moisture supply is less understood. Here, we assess the vulnerability of 40 Ramsar wetlands to precipitation changes caused by land use and hydroclimatic change occurring in their upwind moisture-supplying regions. We use moisture flows from a Lagrangian tracking model, atmospheric reanalysis data, and historical land use change (LUC) data to assess and quantify these changes. Our analyses show that historical LUC has decreased precipitation and terrestrial moisture recycling in most wetland hydrological basins, decreasing surface water availability (precipitation minus evaporation). The most substantial effects on wetland water availability occurred in the tropic subtropical regions of Central Europe and Asia. Overall, we found wetlands in Central Asia and South America to be the most vulnerable by a combination of LUC-driven effects on runoff, high terrestrial precipitation recycling, and recent decreases in surface water availability. This study stresses the need to incorporate upwind effects of land use changes in the restoration, management, and conservation of the world's wetlands.</p>","author":"Simon Felix Fahrländer, \nLan Wang‐Erlandsson, \nAgnes Pranindita, \nFernando Jaramillo","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"b38bee309e8768b5cc2398645d477d9ada905affa4088867a11d70737e55bdb4","category":"Environment"}