{"title":"The NYPD retires “Digidog” robot after public backlash","link":"https://arstechnica.com/?p=1761658","date":1619817357000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/nypd-robot-dog-2-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/nypd-robot-dog-2.jpg\">Enlarge</a> <span>/</span> The NYPD's Digidog is just a Boston Dynamics robot in blue livery.  (credit: <a href=\"https://freedomnews.tv/2021/04/29/nypd-robot-dog-returned-to-sender/\">Daniel Valls/FNTV freedomnews.tv</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><a href=\"https://www.theguardian.com/us-news/2021/apr/30/new-york-mayor-creepy-police-robo-dog/\">The Guardian</a> reports that the New York City Police Department (NYPD) is retiring \"Digidog,\" a Boston Dynamics <a href=\"https://arstechnica.com/gadgets/2020/06/boston-dynamics-robot-dog-can-be-yours-for-the-low-low-price-of-74500/\">Spot robot</a> the state started testing in December. The department <a href=\"https://abc7ny.com/nypd-robot-dog-digidog-k9-artificial-intelligence/8669769/\">described the robot</a> as a tool that could be used to defuse dangerous situations and said it would help officers stay out of harm's way. In an environment where critics question the amount of resources police departments are given, having a state-of-the-art robot dog patrolling the streets of NYC drew a lot of <a href=\"https://www.theguardian.com/commentisfree/2021/mar/02/nypd-police-robodog-patrols\">negative attention</a> and viral videos. The local <a href=\"https://abc7ny.com/digidog-robodog-robot-dog-nypd/10559908/\">ABC News</a> affiliate reports that testing was supposed to continue until August.</p>\n<p>With the robot set to be returned to Boston Dynamics, New York City Mayor Bill de Blasio <a href=\"https://abc7ny.com/digidog-robodog-robot-dog-nypd/10559908/\">said</a> he is \"glad the Digidog was put down,\" adding through a spokesperson that the robot is \"creepy, alienating, and sends the wrong message to New Yorkers.\" The police signed a $94,200 contract for the robot, about enough for one $74,500 spot unit and one 360-degree \"Spot Cam\" camera for $21,800. US Representative <a href=\"https://twitter.com/AOC/status/1365021717144420354\">Alexandria Ocasio-Cortez</a> (D-N.Y.) argued that the money should be invested in communities instead, saying, \"When was the last time you saw next-generation, world class technology for education, healthcare, housing, etc consistently prioritized for underserved communities like this?\"</p>\n<p>The high-tech robot police dog naturally sent imaginations running wild, but Spot is just a human-operated mobile camera, as opposed to an autonomous, weaponized dog version of RoboCop. Boston Dynamics' <a href=\"https://www.bostondynamics.com/sites/default/files/inline-files/spot-terms-and-conditions-of-sale.pdf\">terms of sale</a> prohibit weaponizing Spot, with the \"prohibited uses\" section (5.2) banning \"intentional use of the Equipment to harm or intimidate any person or animal, as a weapon, or to enable any weapon.\" Rules are only good if they're enforced, though, and there's an argument to be made that police use of the robot counts as intimidation. Either way, arming the police with a $100,000 surveillance device did not earn the department a lot of praise.</p></div><p><a href=\"https://arstechnica.com/?p=1761658#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761658&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b39f5e67e12724180e893b0c76ccbf8a3c448a6e96b01b9aeeea30ad7861a146","category":"Tech"}