{"title":"Feasibility of Vis-NIR spectroscopy approach to predict soil biological attributes in arid land soils","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311122","date":1727272800000,"content":"<p>by Elias Hosseini, Mehdi Zarei, Ali Akbar Moosavi, Reza Ghasemi-Fasaei, Majid Baghernejad, Hasan Mozaffari</p>\r\n\r\nVisible and near-infrared (Vis-NIR) reflectance spectroscopy has recently emerged as an efficient and cost-effective tool for monitoring soil parameters and provides an extensive array of measurements swiftly. This study sought to predict fundamental biological attributes of calcareous soils using spectral reflectance data in the Vis-NIR range through the application of partial least square regression (PLSR) and stepwise multiple linear regression (SMLR) techniques. The objective was to derive spectrotransfer functions (STFs) to predict selected soil biological attributes. A total of 97 composite samples were collected from three distinct agricultural land uses, i.e., sugarcane, wheat, and date palm, in the Khuzestan Province, Iran. The samples were analyzed using both standard laboratory analysis and proximal sensing approach within the Vis-NIR range (400–2500 nm). Biological status was evaluated by determining soil enzyme activities linked to nutrient cycling including acid phosphatase (ACP), alkaline phosphatase (ALP), dehydrogenase (DEH), soil microbial respiration (SMR), microbial biomass phosphorus (P<sub>mic</sub>), and microbial biomass carbon (C<sub>mic</sub>). The results indicated that the developed PLSR models exhibited superior predictive performance in most biological parameters compared to the STFs, although the differences were not significant. Specifically, the STFs acceptably accurately predicted ACP, ALP, DEH, SMR, P<sub>mic</sub>, and C<sub>mic</sub> with R<sup>2</sup><sub>val</sub> (val = validation dataset) values of 0.68, 0.67, 0.65, 0.65, 0.76, and 0.72, respectively. These findings confirm the potential of Vis-NIR spectroscopy and the effectiveness of the associated STFs as a rapid and reliable technique for assessing biological soil quality. Overall, in the context of predicting soil properties using spectroscopy-based approaches, emphasis must be placed on developing straightforward, easily deployable, and pragmatic STFs.","author":"Elias Hosseini","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b3a150706ebad440391138b3b494198308ea5c0412a5c18b9075bf4bbf0b5feb","category":"Interdisciplinary"}