{"title":"Characterizing juvenile dispersal dynamics of invasive Barred Owls: Implications for management","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad061/7422757?rss=1","date":1700006400000,"content":"<span><div>Abstract</div>Characterizing natal dispersal can help manage the spread of invasive species expanding their ranges in response to land use and climate change. The Barred Owl (<span>Strix varia</span>) is a prominent example of an apex predator undergoing a rapid range expansion, having spread from eastern to western North America where it is now hyperabundant—threatening the Northern Spotted Owl (<span>Strix occidentalis caurina</span>) with extinction and potentially endangering many other native species. We attached satellite tags to 31 Barred Owl juveniles at the southern leading edge of the Barred Owl’s expanding range in California to characterize natal dispersal patterns and inform management. Juveniles traveled up to 100 km from natal territories and experienced high mortality (annual survival = 0.204). At landscape scales, juveniles preferentially used forests, shrublands, and lower elevations during dispersal and avoided grasslands and burned areas. At finer scales, juveniles preferred shorter (younger) forests, lower elevations, and drainages, and avoided unforested areas. Our results suggest that the Barred Owl range expansion is being driven primarily by high reproductive rates and densities despite low juvenile survival rates and dispersal through putatively suboptimal younger forests as a result of exclusion from high-quality habitat by territorial individuals. These findings also point to several strategies for conserving Spotted Owls and other native species in the Barred Owl’s expanded range, including: (1) creating and maintaining Barred Owl-free reserves bounded by open or high elevation areas, (2) creating reserves large enough to reduce immigration by long-distance dispersers, and (3) removing Barred Owls from large riparian corridors.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"b3a2de0bc63e285ff14cb0423e361068af4667c80024d58532f1f7b35c34b036","category":"Environment"}