{"title":"Male Barbary macaques choose loyal coalition partners which may increase their coalition network betweenness","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13413?af=R","date":1709810886000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/da3adb18-c4d0-40d6-91f1-16357d78a313/eth13413-toc-0001-m.png\" alt=\"Male Barbary macaques choose loyal coalition partners which may increase their coalition network betweenness\" />\n<p>In larger groups, males can support each other in coalitions against male group mates. Here we show with data on Barbary macaques, that males cooperate more with partners that are more loyal to them and that loyalty is reciprocated. We argue that this partner choice mechanism may often affect an individual's coalition network betweenness - depicted here as the size of the node.</p>\n<br />\n<h2>Abstract</h2>\n<p>Reciprocity in the form of contingent exchanges of goods and services is widespread across animals. While there is ample evidence for helping to be contingent upon the help received from a partner, less attention has been paid to partner avoidance based on harm inflicted by a partner. Here, we investigated whether partner choice for agonistic support against powerful targets is guided by loyalty received, i.e., the tendency to refrain from attacking the subject in a coalition with any third partner. We further assessed whether loyalty received by all cooperation partners may generate increased levels of betweenness in the coalition network of a group, a measure of indirect connectedness that has previously been associated with fitness benefits. Based on observational data from male coalitions against male group mates in Barbary macaques (<i>Macaca sylvanus</i>), loyalty received was found to predict the frequency of cooperation in coalitions and the loyalty given to a partner. We propose that loyalty-guided reciprocity will be favored in species with rank-changing coalitions where defection is particularly risky. The more loyal a male's cooperation partners were, the more central he was in the coalition network in terms of higher in betweenness, suggesting a cognitively simple strategy underlying complex network positioning. Analyses of simulated data suggest strong correlations of loyalty and betweenness to be more prevalent in the relatively small groups characteristic of many primate species.</p>","author":"Oliver Schülke, \nEva‐Maria Rathke, \nAndreas Berghänel, \nJulia Ostner","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"b3a4b00fe0585151db72b7d1166dab1cb49454f1dec25c795f11bad8c7fe2eaa","category":"Environment"}