{"title":"Effects of Novel Co-amorphous Naringenin and Fisetin Compounts on a Diet-induced Obesity Murine Model","link":"https://www.preprints.org/manuscript/202410.1627/v1","date":1729520745000,"content":"Background/Objective: In recent studies, it has been shown that dietary bioactive compounds can produce health benefits, however, it is not known whether an improvement in solubility can enhance their biological effects. Thus, the aim of this work was to study whether co-amorphous (CoA) of naringenin or fisetin with enhanced solubility modify glucose and lipid metabolism, thermogenic capacity and gut microbiota in mice fed a high-fat, high-sucrose (HFSD) diet. Methods: Mice were fed with a HFSD with or without CoA-naringenin or CoA-fisetin for 3 months. Body weight, food intake, body composition, glucose tolerance test, hepatic lipid composition and gut microbiota were assessed. Results: CoA-naringenin demonstrated significant reductions in fat mass gain, improved cholesterol metabolism, and enhanced glucose tolerance. Mice treated with CoA-naringenin gained 45% less fat mass and exhibited improved hepatic lipid profiles, with significant reductions in liver triglycerides and cholesterol. Additionally, both CoA-flavonoids increased oxygen consumption (VO2), contributing to enhanced energy expenditure and improved metabolic flexibility. Thermogenic activation, indicated by increased UCP1 and PGC-1α levels, was observed with CoA-naringenin, supporting its role in fat oxidation and adipocyte size reduction. Further, both CoA-flavonoids modulated gut microbiota, restoring diversity and promoting beneficial bacteria, such as Akkermansia muciniphila, linked to improved metabolic health. Conclusions: These findings suggest that co-amorphous naringenin or fisetin offer promising applications in improving solubility, metabolic health, and thermogenesis, highlighting their potential as therapeutic agents against obesity and related disorders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b3b0b6e567327e0b13764b25d0c691b300852b837a09d335f677c2e67c635957","category":"Interdisciplinary"}