{"title":"Insights into Acinetobacter baumannii AMA205&#039;s Unprecedented Antibiotic Resistance","link":"https://www.preprints.org/manuscript/202409.2016/v1","date":1727259992000,"content":"The rise of antibiotic-resistant bacteria in clinical settings has become a significant global concern. Among these bacteria, Acinetobacter baumannii stands out due to its remarkable ability to acquire resistance genes and persist in hospital environments, leading to some of the most challenging infections. Horizontal gene transfer (HGT) plays a crucial role in the evolution of this pathogen. The A. baumannii AMA205 strain, belonging to sequence type ST79, was isolated from a COVID-19 patient in Argentina in 2021. This strain’s antimicrobial resistance profile is notable as it harbors multiple resistance genes, some of which had not been previously described in this species. The AmpC family β-lactamase blaCMY-6, commonly found in Enterobacterales, had never been detected in A. baumannii before. Furthermore, this is the first ST79 strain known to carry the carbapenemase blaNDM-1 gene. Other acquired resistance genes include the carbapenemase blaOXA-23, further complicating treatment. Susceptibility testing revealed high resistance to most antibiotic families, including cefiderocol, with significant contributions from blaCMY-6 and blaNDM-1 genes to the cephalosporin and carbapenem resistance profiles. The A. baumannii AMA205 genome also contains genetic traits coding for 111 potential virulence factors, such as the iron-uptake system and biofilm-associated proteins. This study underscores A. baumannii's ability to acquire multiple resistance genes and highlights the need for alternative therapies and effective antimicrobial stewardship to control the spread of these highly resistant strains.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b3b1f6c0d6d5671919467baa1933b4dfa7f18168f1fee2d8b44fca5cb5131dcd","category":"Interdisciplinary"}