{"title":"Here’s exactly how much longer the iPhone 15 Pro will last by turning ProMotion off","link":"https://www.macworld.com/article/2103229/iphone-15-pro-promotion-display-battery-life-test.html","date":1700143607000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/2091512/iphone-15-pro-review.html\">iPhone 15 Pro</a> and <a href=\"https://www.macworld.com/article/2081235/iphone-15-pro-max-review.html\">iPhone 15 Pro Max</a> both have fantastic battery life. It’s roughly the same as the iPhone 14 Pro and Pro Max from last year (just slightly longer in our testing), but that makes them some of the longest-lasting high-end smartphones you can buy.</p>\n\n\n\n<p>But the non-Pro iPhones generally have <em>longer</em> battery life. We know that the higher refresh rate of 120Hz ProMotion displays can have a significant impact on battery life which is one reason why Apple promotes the iPhone 15 Plus as having the longest battery life in the lineup.</p>\n\n\n\n<p>So naturally I wondered: if you stopped your iPhone 15 Pro from going up to 120Hz, would it make the battery last longer? After a few days of testing, I can confirm that it <em>does</em> help, but not enough to be worth it, with one exception: gaming.</p>\n\n\n\n<h2>Using Accessibility to limit ProMotion</h2>\n\n\n\n<p>Apple doesn’t provide a means to disable ProMotion the iPhone Pro models. The display simply dynamically adjusts refresh rate from 1 to 120Hz making adjustments on the fly as determined by the system.</p>\n\n\n\n<p>But you <em>can</em> use a setting in Accessibility to limit refresh rate to 60Hz, which will prevent the display from ramping up to those battery-draining high refresh rates. Of course, it also means you don’t get the smooth scrolling and animations of ProMotion, so you’re giving up one of the key features for which you buy a “Pro” iPhone. Perhaps if the battery life is much better, it will be worth it?</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Accessibility Motion settings\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?quality=50&amp;strip=all 5756w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=2048%2C1366&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/10/accessibility-motion.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>Foundry</p></div>\n\n\n\n<p>To limit your iPhone 15 Pro (or iPhone 14 Pro) to 60Hz, open <em>Settings</em>, choose <em>Accessibility</em>, then choose <em>Motion</em>. Scroll down and enable the option that says <em>Limit Frame Rate</em>. </p>\n\n\n\n<h2>Does it make a difference?</h2>\n\n\n\n<p>Of course, what I really want to know is whether or not this makes a real difference battery life. If you could get an extra hour of screen-on time with Limit Frame Rate enabled, it may be worth giving up the extra smoothness for some users.</p>\n\n\n\n<p>I ran my standard battery benchmark on both the iPhone 15 Pro and iPhone 15 Pro Max with this setting enabled and disabled. This consists of running the Geekbench 4 battery life test with the display calibrated to 200 nits, with auto-brightness and True Tone disabled.</p>\n\n\n\n<p>It looks like this setting <em>does</em> have an impact, albeit a minor one. In two tests per phone, I consistently saw a battery life improvement of around 5 percent. That something, but it’s not the kind of change that makes you want to give up the 120Hz smoothness for. </p>\n\n\n\t\t\n\t\t<div></div>\n\t\t\n\t\t\t\n\n\n<p>It’s hard to know what the refresh rate is during the Geekbench 4 test, which shows a relatively static screen during the entire benchmark, so I tried a few other tests. I scrolled through Instagram and reddit continuously, with very few pauses and the brightness cranked up to about 70 percent. After 20 minutes, the battery indicator still read 100%. After 30 minutes, still 100%. Somewhere between the 30 and 35 minute mark, the battery meter finally ticked down to 99.</p>\n\n\n\n<p>That result was consistent with or without the <em>Limit Frame Rate</em> accessibility setting activated. At least when it comes to apps where you scroll through text and images, it appears that the dynamic nature of the frame rate has more to do with anything than whether the maximum is 60Hz or 120Hz. If there’s a difference, again, it’s rather minor.</p>\n\n\n\n<h2>Where it really matters: premium games</h2>\n\n\n\n<p>Many mobile games do not support ProMotion, but a few of them do. Shooters <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/no/app/call-of-duty-mobile/id1287282214&amp;xcust=1-1-2103229-1-0-0&amp;sref=https://www.macworld.com/feed\">Call of Duty: Mobile</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/no/app/pubg-mobile/id1330123889&amp;xcust=1-1-2103229-1-0-0&amp;sref=https://www.macworld.com/feed\">PUBG Mobile</a> support high refresh rates, as do games like Brawl Stars, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/league-of-legends-wild-rift/id1480616990&amp;xcust=1-1-2103229-1-0-0&amp;sref=https://www.macworld.com/feed\">League of Legends: Wild Rift</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/genshin-impact-3rd-anniversary/id1517783697&amp;xcust=1-1-2103229-1-0-0&amp;sref=https://www.macworld.com/feed\">Genshin Impact</a>, Alto’s Odyssey, and more. In most of these titles you have to open the in-game options to select a special 120fps or high frame rate mode.</p>\n\n\n\n<p>It’s almost impossible to make consistently benchmark the difference in battery life during live gameplay–there are just too many variables. Still, in playing several of these games with the high frame rate options enabled for 20 minutes at a time, I noticed a lot less battery drain when I had <em>Limit Frame Rate</em> enabled. Battery drain varies wildly from one game to the next, but it wasn’t uncommon to have the battery last twice as long with <em>Limit Frame Rate</em> option enabled.</p>\n\n\n\n<p>But then, game developers already know this. That’s is why it’s almost always an option, and usually not the default setting. In fact, many games even offer 30fps limits in their game settings, typically called “Power saving mode” or “Battery life mode,” even if the game doesn’t support ProMotion at all. </p>\n\n\n\n<p>It’s not just the <em>display</em> uses more energy when a game runs at higher frame rates, but the processor as well. This drains your battery a lot faster.</p>\n\n\n\n<h2>Our recommendation</h2>\n\n\n\n<p>We recommend that most users looking to simply limit battery drain on their iPhone 13 Pro, 14 Pro, or 15 Pro should probably <em>not</em> enable the Limit Frame Rate accessibility setting. The difference in battery life in most apps is minimal and not worth the tradeoff in smoothness. </p>\n\n\n\n<p>In games, however, limiting frame rate has a huge impact, and it should be the first thing you examine if you’re concerned with battery life. But this is best accomplished within the game’s visual settings, which often provide far more options than just a 60fps limit.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b3cdec602143531f97365eeb249170ad163458031c5d99a3aa3c956c05fdcaa8","category":"Apple"}