{"title":"Malaria Public Health Status: Global Context and Update on Gulf Cooperation Council Countries","link":"https://www.preprints.org/manuscript/202407.2174/v1","date":1722005652000,"content":"The human malaria parasite, Plasmodium falciparum, accounts for more than 500,000 deaths worldwide per year. From 2000 to 2019, the malaria global death toll fell from 864,000 to 576,000 deaths; however, progress on reducing this toll has since slowed, with the COVID-19 pandemic contributing to an increase in the mortality rate since 2020. The emergence of widespread resistance in P. falciparum to first-line treatment drugs has highlighted the need for new antimalarial drugs, and smarter approaches, including better combination therapies and mass drug administration. Nevertheless, recent successes of the first malaria vaccine (RTS,S/AS01) and the approval of a second (R21/MM), have renewed the promise of widely applicable vaccines in the future. Since 2015, the Eastern Mediterranean Region has experienced an overall increase in malaria cases and deaths. In the Arabian Peninsula, while most of the Gulf Cooperation Council (GCC) countries have been declared free of indigenous malaria (Bahrain, Kuwait, Qatar, and the United Arab Emirates), malaria is still endemic in two GCC countries (Saudi Arabia and Oman) and its neighbors (Yemen). Furthermore, a number of factors threaten malaria control in this region, at the level of the parasite (antimalarial drug resistance), the mosquito (the emergence of highly invasive species), the environment (climate change and increasing average temperatures), and society (imported malaria). In this review, we assess the current world-wide status of malaria in terms of public health, prevention and treatment, before providing an Arabian regional perspective, with a critical evaluation of the malaria situation in the GCC countries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b3d2f01465ac9514fab555324227775b51b984d25d4a7da4782e3a865d2b38a0","category":"Interdisciplinary"}