{"title":"Positive pressure in bamboo is generated in stems and rhizomes, not in roots","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae040/7717119?rss=1","date":1721347200000,"content":"<span><div>Abstract</div>Bamboos stand out among other tall plants in being able to generate positive pressure in the xylem at night, pushing water up to the leaves and causing drops to fall from leaf tips as guttation that can amount to a steady nocturnal ‘bamboo rain’. The location and mechanism of nocturnal pressure generation in bamboos are unknown, as are the benefits for the plants. We conducted a study on the tall tropical bamboo species <span>Bambusa oldhamii</span> (giant timber bamboo) growing outdoors in southern California under full irrigation to determine where in the plant the nocturnal pressure is generated, when it rises in the evening, and when it dissipates in the morning. We hypothesized that the build-up of positive pressure would be triggered by the cessation of transpiration-driven sap flow and that resumption of sap flow in the morning would cause the pressure to dissipate. Nocturnal pressure was observed in mature stems and rhizomes, but never in roots. The pressure was episodic and associated with stem swelling and was usually, but not always, higher in rhizomes and basal stems than in stems at greater height. Time series analyses revealed that dry atmospheric conditions were followed by lower nocturnal pressure and rainfall events by higher stem pressure. Nocturnal pressure was unrelated to sap flow and even was generated for a short time in isolated stem pieces placed in water. We conclude that nocturnal pressure in bamboo is not ‘root pressure’ but is generated in the pseudo-woody rhizomes and stems. It is unrelated to the presence or absence of sap flow and therefore must be created outside of vessels, such as in phloem, parenchyma, or fibres. It is unlikely to be a drought adaptation and may benefit the plants by maximizing stem water storage for daytime transpiration or by transporting nutrients to the leaves.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"b3d37ce3a669595f29b54ffc27f0eab7120bad89d512a50d4ec3a2b66c8bf5cf","category":"Environment"}