{"title":"PSEUDO-RESPONSE REGULATOR 3b and transcription factor ABF3 modulate abscisic acid-dependent drought stress response in soybean","link":"https://academic.oup.com/plphys/article/195/4/3053/7667144?rss=1","date":1715126400000,"content":"<span><div>Abstract</div>The circadian system plays a pivotal role in facilitating the ability of crop plants to respond and adapt to fluctuations in their immediate environment effectively. Despite the increasing comprehension of PSEUDO-RESPONSE REGULATORs and their involvement in the regulation of diverse biological processes, including circadian rhythms, photoperiodic control of flowering, and responses to abiotic stress, the transcriptional networks associated with these factors in soybean (<span>Glycine max</span> (L.) Merr.) remain incompletely characterized. In this study, we provide empirical evidence highlighting the significance of GmPRR3b as a crucial mediator in regulating the circadian clock, drought stress response, and abscisic acid (ABA) signaling pathway in soybeans. A comprehensive analysis of DNA affinity purification sequencing and transcriptome data identified 795 putative target genes directly regulated by GmPRR3b. Among them, a total of 570 exhibited a significant correlation with the response to drought, and eight genes were involved in both the biosynthesis and signaling pathways of ABA. Notably, GmPRR3b played a pivotal role in the negative regulation of the drought response in soybeans by suppressing the expression of <span>abscisic acid-responsive element-binding factor 3</span> (<span>GmABF3</span>). Additionally, the overexpression of <span>GmABF3</span> exhibited an increased ability to tolerate drought conditions, and it also restored the hypersensitive phenotype of the <span>GmPRR3b</span> overexpressor. Consistently, studies on the manipulation of <span>GmPRR3b</span> gene expression and genome editing in plants revealed contrasting reactions to drought stress. The findings of our study collectively provide compelling evidence that emphasizes the significant contribution of the GmPRR3b-GmABF3 module in enhancing drought tolerance in soybean plants. Moreover, the transcriptional network of <span>GmPRR3b</span> provides valuable insights into the intricate interactions between this gene and the fundamental biological processes associated with plant adaptation to diverse environmental conditions.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"b3dd8d79e6128ffbc76a4ef5f3e056fb152b1cacf82dd95127f1ebaefb1ea966","category":"Environment"}