{"title":"A gender-based review of workplace violence amongst the global health workforce—A scoping review of the literature","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003336","date":1719928800000,"content":"<p>by Sioban Nelson, Basnama Ayaz, Andrea L. Baumann, Graham Dozois</p>\r\n\r\nWorkplace violence (WPV) impacts all levels of the health workforce, including the individual provider, organization, and society. While there is a substantial body of literature on various aspects of WPV against the health workforce, gender-based WPV (GB-WPV) has received less attention. Violence in both the workplace and broader society is rooted in gendered socio-economic, cultural, and institutional factors. Developing a robust understanding of GB-WPV is crucial to explore the differing experiences, responses, and outcomes of GB-WPV with respect to gender. We conducted a scoping review and report on the prevalence and risk factors of GB-WPV in healthcare settings globally. The review followed the Preferred Reporting Items for Systematic and Meta-Analyses extension for Scoping Reviews (PRISMA-ScR). We registered the scoping review protocol on the Open Science Framework on January 14, 2022, at https://osf.io/t4pfb/. A systematic search was conducted of empirical literature in five health and social science databases. Of 13667, 226 studies were included in the analysis. Across the studies, more women than men experienced non-physical violence, including verbal abuse, sexual harassment, and bullying. Men experienced more physical violence compared to women. Younger age, less experience, shifting duties, specific clinical settings, lower professional status, organizational hierarchy, and minority status were found to be sensitive to gender, reflecting women’s structural disadvantages in the workplace. Given the high prevalence and impact of GB-WPV on women, we provided recommendations to address systemic issues in clinical practice, academia, policy, and research.","author":"Sioban Nelson","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"b3e11e31c5d03c289ce830d74ec75467a9e88c1fac05ca7c6aea5f265cd7f008","category":"Environment"}