{"title":"Inshore and offshore marine migration pathways of Atlantic salmon post‐smolts from multiple rivers in Scotland, England, Northern Ireland, and Ireland","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15760?af=R","date":1714353502000,"content":"<h2>Abstract</h2>\n<p>The migratory behavior of Atlantic salmon (<i>Salmo salar</i>) post-smolts in coastal waters is poorly understood. In this collaborative study, 1914 smolts, from 25 rivers, in four countries were tagged with acoustic transmitters during a single seasonal migration. In total, 1105 post-smolts entered the marine study areas and 438 (39.6%) were detected on a network of 414 marine acoustic receivers and an autonomous underwater vehicle. Migration pathways (defined as the shortest distance between two detections) of up to 575 km and over 100 days at sea were described for all 25 populations. Post-smolts from different rivers, as well as individuals from the same river, used different pathways in coastal waters. Although difficult to generalize to all rivers, at least during the year of this study, no tagged post-smolts from rivers draining into the Irish Sea were detected entering the areas of sea between the Hebrides and mainland Scotland, which is associated with a high density of finfish aquaculture. An important outcome of this study is that a high proportion of post-smolts crossed through multiple legislative jurisdictions and boundaries during their migration. This study provides the basis for spatially explicit assessment of the impact risk of coastal pressures on salmon during their first migration to sea.</p>","author":"Jessica R. Rodger, \nJessie Lilly, \nHannele M. Honkanen, \nDiego del Villar, \nRichard Kennedy, \nNiall Ó. Maoiléidigh, \nPatrick Boylan, \nRobert Rosell, \nDavid J. Morris, \nRoss O'Neill, \nCatherine Waters, \nDeirdre Cotter, \nLorna Wilkie, \nAndrea Barkley, \nAmy Green, \nSamantha V. Beck, \nJamie Ribbens, \nJim Henderson, \nDebbie Parke, \nAlan Kettle‐White, \nLucy Ballantyne, \nShona Marshall, \nPaul Hopper, \nNiall Gauld, \nJason D. Godfrey, \nLauren E. Chapman, \nJames Thorburn, \nAlan Drumm, \nFred Whoriskey, \nBrian Shields, \nPhilip Ramsden, \nJames Barry, \nMichael Milane, \nWilliam Roche, \nJohn D. Armstrong, \nAlan Wells, \nSilas Walton, \nMelanie Fletcher, \nDavid M. Bailey, \nBill Whyte, \nRoss McGill, \nMark Bilsby, \nKen Whelan, \nColin W. Bean, \nColin E. Adams","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"b3e4fe8321401d2be92f231b8ef9350c2244bcea0355f0c70349c06437d50c23","category":"Environment"}