{"title":"New PSVR controllers suggest PS5 headset won’t need external sensors","link":"https://arstechnica.com/?p=1750572","date":1616080124000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/psvr1-980x551.jpg\" alt=\"\"></div>\n        <p>\n          Can't wait for the \"brass knuckles\" adapter that turns these into handheld weapons.                  </p>\n        </div>\n      </li>\n      </ul><p>One month after officially <a href=\"https://arstechnica.com/gaming/2021/02/sony-announces-new-psvr-hardware-for-playstation-5/\">announcing a new generation of PlayStation VR hardware</a> for the PS5, Sony today revealed additional details of the new handheld controllers designed to work with the upcoming unit.</p>\n<p>As previously announced, the new controllers integrate some of the unique features of the PS5's standard DualSense controllers. That includes adaptive triggers that can apply variable tension depending on the in-game situation, <a href=\"https://arstechnica.com/gaming/2020/10/hands-on-with-the-ps5s-synesthetic-dualsense-controller/\">as shown off in PS5 games like <em>Astro's Playroom</em></a>. The new PSVR controllers also feature haptic feedback that has been \"optimized for its form factor.\" That tech seems positioned to go beyond the generalized rumbling of earlier controllers to make \"every sensation in the game world more impactful, textured, and nuanced,\" as Sony puts it.</p>\n<p>The new PSVR controller also mirrors features found on other virtual reality controllers like the <a href=\"https://arstechnica.com/gaming/2016/12/oculus-touch-controller-review-let-your-fingers-do-the-grabbing/\">Oculus Touch</a>, including the \"orb\" shape created by the hand-circling tracking ring. The new controller comes with \"finger detection\" for the thumb, index, and middle fingers when they rest on the appropriate parts of the controller, no button-press necessary. A \"grip button\" on the inner edge of each handheld controller can also be accessed by the middle finger to pick up in-game objects. Sony also promises that the controller is \"well-balanced and comfortable\" in tests with \"a range of hand sizes.\"</p></div><p><a href=\"https://arstechnica.com/?p=1750572#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1750572&comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b3f067fcf3762b07bb34bc127ca61715ad3406b2fbe3b84ece11e29c71d08a70","category":"Tech"}