{"title":"ChatGPT iPhone App's Voice Chat Feature Now Free to All Users","link":"https://www.macrumors.com/2023/11/22/chatgpt-app-voice-chat-free-to-all/","date":1700653089000,"content":"OpenAI has announced that the voice chats feature in its <a href=\"https://apps.apple.com/app/chatgpt/id6448311069\">official ChatGPT app for iPhone and iPad</a> is now available for everyone to use, no subscription required.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/chatgpt-for-iphone-feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nOpenAI introduced voice chats in its ChatGPT app back in September. The feature gives users the option of speaking conversationally with the chat bot instead of typing, but it was previously only available to Plus and Enterprise subscribers.\r<br />\n\r<br />\nTuesday's <a href=\"https://x.com/gdb/status/1727067288740970877?s=20\">announcement</a> by OpenAI co-founder Greg Brockman changes all that, and ChatGPT Voice has now rolled out for all free users on iOS and Android.\r<br />\n\r<br />\nOpenAI's ChatGPT has long been accessible <a href=\"https://openai.com/\">on the web</a> and has previously been made available on iOS through multiple third-party apps, many of which are <a href=\"https://www.macrumors.com/2023/04/25/chatgpt-scam-apps-mac-app-store/\">little better than scam apps</a>, but the legitimate app gives users a safe way to use ChatGPT on the go.\r<br />\n\r<br />\nFor those unfamiliar with ChatGPT, it is an AI-based chatbot that uses generative artificial intelligence to answer questions and provide advice on all manner of subjects. History is synced across devices, so you can see your ChatGPT interactions both on the web and on iOS devices, and it integrates the Whisper speech recognition system.\r<br />\n\r<br />\n<div><blockquote><p>ChatGPT Voice rolled out for all free users. Give it a try — totally changes the ChatGPT experience: <a href=\"https://t.co/DgzqLlDNYF\">https://t.co/DgzqLlDNYF</a></p>— Greg Brockman (@gdb) <a href=\"https://twitter.com/gdb/status/1727067288740970877?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote> </div>\r<br />\nIn case you hadn't heard, it's been a tumultuous few days at OpenAI. Sam Altman, the CEO of OpenAI, was initally ousted from his position as CEO last Friday, shocking the company's investors and employees, who were informed via an internal message and the company's blog post​​. The dismissal was apparently due to internal disagreements over the direction of OpenAI​.\r<br />\n\r<br />\nAlmost all of the staff at OpenAI threatened to resign if Altman was not reinstated. Then things took a turn on Wednesday morning when OpenAI <a href=\"https://x.com/OpenAI/status/1727206187077370115?s=20\">reached an agreement</a> for Altman to return as CEO. This return is coupled with the establishment of a new board featuring Bret Taylor, formerly co-CEO of Salesforce, as chair, and Larry Summers, former U.S. Treasury Secretary. \r<br />\n\r<br />\nMicrosoft, a financial backer of OpenAI, welcomed the changes. \"We believe this is a first essential step on a path to more stable, well-informed, and effective governance,\" said Microsoft CEO Satya Nadella in a <a href=\"https://x.com/satyanadella/status/1727207661547233721?s=20\">post on X</a>, formerly Twitter.\r<br />\n\r<br />\n\"I'm looking forward to returning to OpenAI,\" said Altman in an <a href=\"https://twitter.com/sama/status/1727207458324848883\">earlier post</a>.\r<br />\n\r<br />\nAn OpenAI account is required to use the ChatGPT app, and it can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/app/openai-chatgpt/id6448311069\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/chatgpt/\">ChatGPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/22/chatgpt-app-voice-chat-free-to-all/\">ChatGPT iPhone App's Voice Chat Feature Now Free to All Users</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/chatgpt-iphone-apps-voice-chat-feature-now-free-to-all-users.2411692/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b3f1bdcc0d5149756921aaf598c9ce262cb43a12b646f6094c0a524ccceb594b","category":"Apple"}