{"title":"Ninth Circuit Court of Appeals Denied the Coalition for App Fairness’s Motion to File an Amicus Brief","link":"http://www.fosspatents.com/2021/12/apple-gets-injunction-stayed-as.html","date":1639528721000,"content":"\n<p>Florian Mueller, with a detail I haven’t seen reported elsewhere:</p>\n\n<blockquote>\n  <p>U.S. courts — and especially appeals courts — normally have a\npermissive approach toward amicus briefs, above all in high-stakes\nhigh-profile cases like this one. It rarely happens that they tell\nstakeholders they are unwelcome to join a proceeding as “friends\nof the court” contributing potentially useful information. Here,\nhowever, a filing by the Coalition for App Fairness (whose three\nkey members are Epic, Spotify, and Match Group, which is best\nknown for Tinder) and four of its members (Match Group, Tile,\nBasecamp, and Knitrino) has been <em>flatly rejected</em> by the Ninth\nCircuit.</p>\n\n<p>As a result, the CAF now faces a credibility issue in any\nother App Store cases around the globe in which it may try to\nsupport Epic or even another one of its large members. Even if\nother courts ultimately allowed the CAF to join other cases,\nApple would point to the Ninth Circuit decision, which at a\nminimum would diminish the credibility of anything the CAF\nwould say on Epic’s behalf. The CAF has now been stigmatized\nas part of an Epic anti-Apple initiative designed to raise\nissues regardless of whether those were “organic or\nmanufactured” as the evidence shows.</p>\n</blockquote>\n\n<p>Not quite sure what to make of this, but if nothing else, it’s a sign of how overwhelming Apple’s victory is in this case.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/12/14/caf-amicus-brief-denied\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b3f6c51df65545f7381707405b7eea90bcb0cb1ddf98b2041af5536f80b0ff87","category":"Tech"}