{"title":"Estimating Post‐Fire Flood Infrastructure Clogging and Overtopping Hazards","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036522?af=R","date":1723909153000,"content":"<h2>Abstract</h2>\n<p>Cycles of wildfire and rainfall produce sediment-laden floods that pose a hazard to development and may clog or overtop protective infrastructure, including debris basins and flood channels. The compound, post-fire flood hazards associated with infrastructure overtopping and clogging are challenging to estimate due to the need to account for interactions between sequences of wildfire and storm events and their impact on flood control infrastructure over time. Here we present data sources and calibration methods to estimate infrastructure clogging and channel overtopping hazards on a catchment-by-catchment basis using the Post-Fire Flood Hazard Model (PF2HazMo), a stochastic modeling approach that utilizes continuous simulation to resolve the effects of antecedent conditions and system memory. Publicly available data sources provide parameter ranges needed for stochastic modeling, and several performance measures are considered for model calibration. With application to three catchments in southern California, we show that PF2HazMo predicts the median of the simulated distribution of peak bulked flows within the 95% confidence interval of observed flows, with an order of magnitude range in bulked flow estimates depending on the performance measure used for calibration. Using infrastructure overtopping data from a post-fire wet season, we show that PF2HazMo accurately predicts the number of flood channel exceedances. Model applications to individual watersheds reveal where infrastructure is undersized to contain present-day and future overtopping hazards based on current design standards. Model limitations and sources of uncertainty are also discussed.</p>","author":"Ariane Jong‐Levinger, \nDouglas Houston, \nBrett F. Sanders","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"b3fc0abfd1f94b4c08f66bbf81233f6ececc197d675467a594ba616950f68748","category":"Environment"}