{"title":"5 Sport Tech Products I Want To See AirTag Integration In","link":"https://www.dcrainmaker.com/2021/06/5-sport-tech-products-i-want-to-see-airtag-integration-in.html","date":1623237977000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/06/FindMySportsTech.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FindMySportsTech_thumb.jpg\" /></a></p>\n<p>It’s been about 5 weeks since AirTags started shipping, and like many techies, I bought a pack of them. I stealthily snuck them in our cargo bikes, and then onto our keyrings. All literally side by side with Tile. And as much as I love Tile, and its greater feature set than AirTags, the simple reality is that it’s not even close in terms of find and recovery prowess. Using the term ‘landslide’ doesn’t even begin to cover it.</p>\n<p>But that’s not what this is about. Instead, this is actually about Apple’s Find My network, which is what AirTags run atop. This is actually something 3rd parties can <a href=\"https://developer.apple.com/find-my/\">take advantage of</a>. We saw <a href=\"https://www.dcrainmaker.com/2021/04/apple-rolls-out-find-my-to-bicycles-and-more-sports-tech-thoughts.html\">VanMoof integrate it into their bikes two months ago</a>, as did Belkin in their earbuds. Once they do this, it shows up directly in the Apple ‘Find My’ app, under a new ‘Items’ tab, the same exact place Apple’s own AirTags shown up (which are different than the ‘People’ and ‘Devices’ tabs, devices are things like Apple’s phones, tablets, or computers).</p>\n<p>Now, admittedly, this doesn’t do anything for Android users. But look, there’s still Tile. Heck, maybe Google will just buy Tile and be done with it.</p>\n<p>But for those not familiar, AirTags and the larger Find My network actually serve two purposes:</p>\n<p>A) Finding things you’ve lost (hopefully temporarily)<br />\nB) Finding the location of things not lost, but needing tracking (such as a family cargo bike)</p>\n<p>It then utilizes literally every recent Apple device out there, to find and track those items 24×7. You don’t need to mark them as lost. I can simply open the app up at any time and see the location of any of my items.<strong> It’s like live tracking for all your things</strong>.</p>\n<p>However, as good as AirTags and 3rd party Find My devices are, it’s not a perfect system. In fact, for families or friends it has one big flaw: You can’t “share” items. Meaning, I can’t share (permanently or temporarily) the location of the cargo bike AirTag. Thus, only I can see it on my account. But my wife can’t see it, despite us having a defined Apple ‘Family’.</p>\n<p>Making matters worse, you can’t lend someone an item without them getting stalker alerts about 8 hours later. So when my parents come next month and watch the kids for a handful of days, they’ll start getting stalker alerts from the cargo bike, because I won’t be here anymore. And because they aren’t in our Apple ‘family’, there’s nothing they can do about it. Hopefully Apple can find ways to solve both of these issues, and in fairness, they did add some new features around Find My this week as part of WWDC, though neither of these two issues were addressed.</p>\n<p>In any case, the technology platform in terms of how it’ll grow with 3rd parties and uses cases is really just at the beginning. So let’s talk about what I’m hoping for as we go towards the 2nd half of the year, and onto 2022.</p>\n<h3><span>1) Action Cameras</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/2020-09-10-16.57.24-1-2.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/2020-09-10-16.57.24-1-2_thumb.jpg\" /></a></p>\n<p>Hands-down, without question, the singular piece of my sports tech arsenal I want to see with baked-in Find My support is my GoPro (or, any action camera really). Mostly, because it’s the one item that’s easiest to lose (admittedly, mostly at home), but also one of the items that’s most often to be temporarily misplaced by friends (or kids) borrowing it. My <a href=\"https://www.dcrainmaker.com/2019/03/three-quick-ways-to-find-your-lost-gopro.html\">past ‘How to find your lost GoPro’ post continues</a> to drive lots of traffic, so clearly there’s demand for people finding lost GoPro’s.</p>\n<p>At present, the way GoPro’s internal finding technology works is that you’ve got 8 hours from the moment you power it down, till Bluetooth connectivity terminates. So if you can’t find it in that 8 hours, or if the battery was dead, you’re outta luck. But of course, that’s not really Find My. That lacks many aspects of what an AirTag like thing would have, such as allowing others to find it, setting it to lost mode, and that it’ll work for a year without battery (versus 8 hours).</p>\n<p>Thus, GoPro would need to ensure there’s always some battery leftover to power the Find My feature for ideally weeks to months. Still, I’ve gotta believe such a feature would be a huge headliner on a GoPro Hero 10.</p>\n<h3><span>2) All My Bikes</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2018/01/P1010130_thumb.jpg\" /></p>\n<p>Sure, you can do as I’ve done, and stash AirTags in creative locations on your bike. <a href=\"https://www.youtube.com/watch?v=aLtWN1Mp2Qc\">GPLama has a video on lots of road bike locations too</a>. And while some would argue that AirTags don’t help against theft, that’s a silly (and wrong) assertation. They give you more of a window than not having AirTags/Find My on your bike. Even if that’s a short window until a device is found. A secured/hidden AirTag in a bike gives you time to find that bike if you just dipped into a coffee shop and came out 3 minutes later to find your bike missing.</p>\n<p><em>(Again, we’re not talking about just taping it under the saddle, which surprisingly The Internet widely seems to believe is some secret never-thought-of-before location. Instead, we’re talking permanently affixing it to the bike, as VanMoof has done.)</em></p>\n<p>But more than that, Find My built into a bike is actually a great substitute for LiveTrack style tracking. For example, when my wife is doing the evening kids’ bike commute pickup around town, I can easily pull open the Apple Find My app and see where she currently is, using the AirTag hidden in that cargo bike. But the same is also true if I stash an AirTag into my regular bike and go out for a long ride around the countryside. This way when my phone battery dies because I took too many selfies, the AirTag still uses the endless stream of other people’s phones to find me, allowing my wife to check-in on me.</p>\n<p>Ultimately, having it built into the frame is what I want. Somewhere that’s substantially difficult to get access to, but still chargeable (or coin-cell battery swappable). Just, with some complexity to slow people down. For me, an AirTag on a bike is 80-90% simply location tracking when a phone is dead, and 10%+ short-term theft recovery.</p>\n<h3><span>3) All Wireless Sport Earbuds</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-Fabric-CloseUp_thumb.jpg\" /></p>\n<p>Like with VanMoof on bicycles, one of the other ‘launch day’ 3rd party applications for the Find My <a href=\"https://www.amazon.com/Belkin-SoundForm-Bluetooth-Headphones-Isolation/dp/B087KR6XHM?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=8280a3145bd18a6527ceeed7c155d7fd&amp;language=en_US&amp;ref_=as_li_ss_tl\">network was headphones, from Belkin</a>. This is a great use of it for even regular headphones (such as being left on a plane or a bus), but especially in sport usage.</p>\n<p>For example, mountain biking can often lead to earbuds falling out if the fit isn’t nailed (or, the jump not nailed). And while some earbuds do have internal finding technologies, that can require the app usually to be open at the time of the incident. If not, the app can often find it later, assuming you haven’t gone out of Bluetooth range. But if you’re descending quickly on rough trails, you may not have even realized an earbud popped out 45 seconds ago, let alone where to find it.</p>\n<p>This gives you a chance to find it either with your own phone and the last known location, or doing another pass of the trail the next run more slowly in lost mode till it picks it up.</p>\n<h3><span>4) Bike Computers</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2017/08/GOPR5998_thumb.jpg\" /></p>\n<p>While I’ve argued for baking it into your bike above, the reality is most of us aren’t replacing our bikes anytime soon. Plus, the bike industry works at glacial speeds, and it’ll take the majors quite some time to get their ships shifted. However, bike computers are something most of us buy far more frequently than new bikes, and can also go between our bikes (such as from a mountain bike to road bike).</p>\n<p>In this scenario, I’m again not super interested in the theft side of things. Sure, that’s loosely valuable for a short period, but I’m more interested in poor man’s tracking. Or basically, dead-phone tracking. In general, there’s an 0% chance my bike computer will have its battery die. Whereas there’s an approximately ‘very high’ percentage chance my phone will die. With a bike computer-enabled here, it’ll simply transmit my location via my friends’ phones (who are far better battery charging people than I), and then my wife can see where I am.</p>\n<p>Of course, this once again depends on Apple opening up sharing of ‘Items’ the same way they show sharing of people location. Today, she wouldn’t be able to see this, because I can’t share my AirTags or ‘Find My Items’ with her (or with anyone else). But assuming that gets solved, this works perfectly for that.</p>\n<p>Plus, it’s also helpful for the semi-rare scenario I misplace my bike computer. And hey, I can even toss the bike computer in my luggage then and it’ll act like a luggage tracker. Or, it’ll get stolen (and then I can track it again!).</p>\n<h3><span>5) Sports Drones</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/04/DJI-Air-2S-In-Depth-Review_thumb.jpg\" /></p>\n<p>I know, I know, I’ve got a small history with occasionally misbehaving drones.</p>\n<p>But realistically, <a href=\"https://www.dcrainmaker.com/2021/04/dji-air-2s-in-depth-review-with-a-sports-tracking-focus.html#sports-tracking\">sport-focused drones like the Skydio, or even some DJI models</a> are arguably one of the best examples of where Find My can be super powerful, especially with a <a href=\"https://www.cnet.com/news/apple-airtags-use-uwb-wireless-tech-heres-how-ultra-wideband-makes-your-life-easier/\">UWB chipset in there</a>. In most cases if a drone following you goes down, many drone apps/controllers have ‘last known locations’ in their systems. However, the challenge with that, is that it only shows you the last known location that the drone could talk to you about.</p>\n<p>Meaning, if the communications between the drone and the controller are severed (battery dislodged, communications interference, etc), but the drone is still going somewhere, then you won’t know where it actually went.</p>\n<p>By having something that can go hundreds of meters in line of sight, you’ve got a much better chance of either yourself finding it, or eventually, someone else perhaps finding it. But even in close-range, the idea that a properly equipped drone could be located within a few centimeters in dense bush is super useful. Often when a drone crashes in brush, it’s trying to figure out exactly where in the brush it is. GPS coordinates in dense woods tend to be a bit iffy on drones, and when a camera is facing a leaf, that’s not super helpful either. Whereas using the UWB pinpointing capabilities would be amazing here.</p>\n<p>Of course, it’s not perfect. It won’t do jack-all for my watery situations (either drone or GoPro), as the signal won’t connect through. But hey, that gives me even more <a href=\"https://www.amazon.com/Underwater-Viewing-Controller-Adjustable-Tilt-Lock/dp/B08BZBPSTH?dchild=1&amp;keywords=underwater+drone&amp;qid=1623234675&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7a3804b131201293034362a7963799f5&amp;language=en_US&amp;ref_=as_li_ss_tl\">reason to buy an underwater drone</a>. I mean, for taking underwater 4K openwater swim videos of course.</p>\n<p>—</p>\n<p>Still, would love to hear what other sports tech products would be interesting in the sports tech range. I can think of my other examples that could have baked in finding technology, from watches to heart rate straps, to power meters. And in fact, some of those have already been tried. We <a href=\"https://tileteam.zendesk.com/hc/en-us/articles/1500002374602-Tile-Fitbit-\">saw Fitbit add Tile support</a>, and <a href=\"https://www.dcrainmaker.com/2019/01/4iiii-tracking-capabilities.html\">4iiii add Chipolo support</a>. Though, the Chipolo network is obviously far smaller, and in this particular endeavor, size definitely matters.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"b40048d2f4a3dd2ec2c0255a68eb0ca12bfc0e5ebfee436d64d9c44401544c98","category":"Cycling"}