{"title":"Kuss, Roglič, or Vingegaard: Who will Jumbo-Visma choose for Vuelta a España glory?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-which-jumbo-visma-rider-will-win","date":1694285301000,"content":"\n      Nothing happened during stage 14 to challenge the now widely agreed upon perception that Jumbo-Visma all but have the overall victory in this year's <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> wrapped up. Having eliminated their hottest rival Remco Evenepoel (Soudal–Quick-Step) on the Col d'Aubisque on stage 13, as well as diminishing the threat posed by UAE Team Emirates by putting minutes into both Marc Soler and João Almeida, all three of Sepp Kuss, Primož Roglič and Jonas Vingegaard finished within the group of favourites without ever coming under any serious pressure. No more time was gained on GC, but that trio continued to occupy the top three places in the overall standings. <br />\n<div></div>\n<p><br />But for all Jumbo-Visma’s dominance, one question remains unresolved and could still ensure a thrilling endgame of this Vuelta: Which of their three riders will win? Their least proven rider, Kuss, remains in pole position, while the other two multiple Grand Tour winners are both still within 1:44 of his time. They are riding harmoniously together with no hint of tension despite the circumstances, and an outbreak of civil war seems a remote possibility. But with plenty of racing still to come, including more big mountains, it might not need to for the order between them on GC to change. <br /><br />That said, today was one of the hardest stages of the whole race, and Kuss came out of it with his grip on the red jersey strengthened rather than reduced. He and the team were only subjected to one real attack, when Juan Ayuso (UAE Team Emirates) put in a dig on the day’s third-to-last climb, Puerto de Larrau, over 53km from the finish. It was more of a test of legs than an all-in attack, and when all three of Jumbo’s leaders managed to follow his wheel, along with the other top GC riders, the Spaniard eased off. After that, neither Ayuso nor anyone else tried anything on the category one climb to the finish at Larra-Belagua, and consequently, the GC remains as-you-were. It was not especially exciting to watch as a spectator, but for Kuss, it was a significant step forward in his hitherto unlikely bid for overall victory. <br /><br />Ayuso’s attack might not have amounted to anything, but it does hint that UAE Team Emirates still has big ambitions in the GC race – and such a proactive approach might just be what leads to a shift in the Jumbo-Visma hierarchy and a threat to Kuss’ leadership. These kinds of proactive tactics, especially coming so far from the finish, have the effect of destabilising and opening a race, disrupting the tempo a climb is ridden. Attacks open up the possibility of counter-attacks, and the pace transforms from steady to stop-start. Had Almeida been fully fit and not still recovering from sickness, or Soler on the form he was during the opening week, they might have joined forces with their UAE Team Emirates teammate Ayuso to attack in tandem. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230909VUE02009-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1694285193\" alt /><br />On this occasion, neither were able, and attacks from Enric Mas (Movistar) or Mikel Landa (Bahrain-Victorious) weren’t forthcoming, while all three of the Jumbo-Visma riders latched onto Ayuso’s wheel. The race settled down again, Jumbo-Visma reclaimed control, and the status quo resumed. In future stages, though, things could get very interesting if such moves are made, and only one or two of the Jumbo-Visma riders mark a move. The more attacks are made, the less likely or efficient it would be for Kuss to try to follow each one, which opens up the possibility of Roglič and/or Vingegaard escaping up the road with, say, one of the UAE Team Emirates riders. The Jumbo-Visma rider would not be obliged to work with their GC rival, but could still find themselves with a gap if that rival chooses to push on anyway. From there, a situation could easily develop in which the tactically sound move would be for the Jumbo-Visma rider out front to strike out for glory themselves.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/remco-evenepoels-pyrenean-redemption\"><em><strong>Read more: Remco Evenepoel's Pyrenean redemption</strong></em></a><br /><br />As things stand, with the team now in such a strong position and only Ayuso (at 2:37) within three minutes of the red jersey, we’re less likely to see another aggressive move from the Jumbo-Visma riders like the one Vingegaard made on the Tourmalet yesterday, where he was let off the leash to get up the road in order to put Evenepoel and co under pressure. With no dangerous rival like Evenepoel jostling them for position on GC, such a ploy would feel much more like a direct attack on his teammate Kuss, the more so the closer he gets to Madrid still in the red jersey. But if they can get up the road this way, as a result of marking a GC rival, they could still find themselves gaining enough time to potentially take over the red jersey. <br /><br />You can imagine these kinds of tactical affairs taking place on stages to come like the punchy uphill finish at Bejes on stage 16, the feast of mountains in Asturias on stage 18, or the long, undulating and deceptively hard stage 20. When it comes to stage 17, it will be pure strength of the legs that will determine the rider's fate. This is the stage that finishes atop the Angliru, arguably the hardest climb in professional cycling, and one that may produce ruptures between even the Jumbo-Visma trio. Holding back in order to help your teammate isn’t too important here, as the gradients are so steep that it’s almost impossible to do anything to aid a teammate anyway, with gravity, rather than wind, being the real hindrance. This is, therefore, probably the only stage where the road could be allowed to decide which of them is crowned overall victory. <br /><br />We know Kuss usually excels on such climbs, but he’s never before had to do so in such circumstances. Will the pressure of riding in the red jersey get to him? Will he be more fatigued than usual having had to ride for GC every day? Will the demands of third-week GC racing prove too much for him? Or will it be the cumulative fatigue of having already finished two Grand Tours this year? We’re about to find out a lot about Sepp Kuss as a rider. <br /><br />Neither Vingegaard nor Roglič would surely begrudge Kuss winning the red jersey after all the work the American has done over the years to help them win their own Grand Tour titles. Yet, as committed racers who are used to riding to win, and anything less than that being a disappointment, neither would they decline an opportunity of taking the title for themselves should it arise. Cycling is, after all, a race won by individuals, even if it is ridden as teams. With so much racing still to come and the slopes of the Angliru to conquer, it could yet be either of the trio who ultimately triumphs.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b413dc1e92194869987a6380415700f5fca9b430696e511828f60157408e463a","category":"Cycling"}