{"title":"147 Effects of grazing dairy-beef and native beef crossbred steers on native range with supplementation on growth","link":"https://academic.oup.com/jas/article/102/Supplement_1/74/7617959?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Our objective was to evaluate the effects of grazing dairy-beef crossbred and native beef crossbred steers on native range with supplementation on growth. Dairy-beef (DB) steers (n = 75) were acquired and transported 214 km from Buffalo Feeders at Buffalo, OK. Native beef (NB) steers (n = 75) were acquired and transported 647 km from Capitol Land and Livestock at Schwertner, TX. All steers were transported to the Marvin Klemme Range Research Station in Bessie, OK. Steers were rested for 48 h and received ad libtum access to mixed grass hay and water. Steers were allocated by BW and randomly assigned to pasture based on a stocking rate of 2.43 ha/animal. Animals grazed 3 native pastures (pasture 1; n = 39, pasture 2; n = 52, pasture 3; n = 59), and pastures were balanced for breed type (pasture 1; DB = 21; NB = 18, pasture 2; BD = 26; NB = 26, pasture 3; DB = 28; NB = 31). Steers were supplemented with extruded 100% DDGS cubes (MasterHand Milling, Lexington, NE) at 0.45 kg per animal per day for the first 53 d. As forage maturity increased and 53-d body weights (BW) were taken, supplementation increased to 1.13 kg per animal per day. Initial BW was 8 ± 3 kg greater (P = 0.01) in DB steers than the NB steers. Native beef steers weighed 16 ± 4 kg heavier (P &lt; 0.01) on d 60 and weighed 24 ± 5 kg heavier (P &lt; 0.01) at final BW than the DB steers. Average daily gain for NB steers was greater (P &lt; 0.01) by 0.46 ± 0.04 kg in the first 53 d and was greater (P = 0.01) by 0.11 ± 0.04 kg for d 53 to 145 than DB. Native beef steers also had a greater (P &lt; 0.01) overall ADG by 0.22 ± 0.02 kg. There were no differences (P = 0.55) in breed for those treated and re-retreated for issues such as pinkeye, foot rot, and BRD. Based on these results, breed of cattle grazing native rangeland in Southwestern Oklahoma with supplementation had an impact on performance, but no impact on treatment of respiratory and non-respiratory issues.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b414938503eaca90fde0a335896b8b308dace267b516f2063ecc46ba517e774a","category":"Environment"}