{"title":"Weather Or Not: The 2021 Hope Cyclery Higher Ground 100 in Johnstown, PA – Brett Rothmeyer","link":"https://theradavist.com/2021/11/weather-or-not-hope-cyclerys-higher-ground-100/?utm_source=rss&utm_medium=rss&utm_campaign=weather-or-not-hope-cyclerys-higher-ground-100","date":1636376412000,"content":"<p>If you’re not from Pennsylvania there’s a good chance you have at least heard of Johnstown. Maybe it was from the lyrics of a Bruce Springsteen song, or the pages of your history books. Sitting in the Conemaugh River Valley, Johnstown was the site of a devastating flood in 1889, and then again in 1936 and 1977. <a href=\"https://en.wikipedia.org/wiki/Johnstown_Flood\" target=\"_blank\">Given the city’s notoriety for flooding</a>, the staging of this year’s <a href=\"https://www.instagram.com/highergroundhundo/\" target=\"_blank\">Higher Ground Hundo</a> event put on by the fine people of <a href=\"https://www.hopecyclery.com/\" target=\"_blank\">Hope Cyclery</a> was mildly concerning.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-9-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Sunrise refused to check in early Saturday morning, as the sky remained dark with thunderclouds. Intervals of downpours set the tone for the rider’s queuing up to start the day’s route. Intermittently riders heading out on the 100 and 69-mile courses quietly drifted off through the steady rain in ones and twos to get to the task at hand. A group taking on the 30-miler course huddled under the awning of Hope Cyclery as the sky opened up in a deluge. A few jokes about the weather gave way to a host of wry smiles and they were off to break the stillness of the puddled street.  As the riders rolled away from Hope Cyclery, owner <a href=\"https://www.instagram.com/jarrod_from_hope/\" target=\"_blank\">Jarrod Bunk</a> shouted, “Have a great time, and even if you don’t, tell your friends you had a great time!” The mood amongst the riders lightened even more despite the heavy weather.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-65-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The best course of action during a potential flood is to head for “Higher Ground” so it only made sense that on this day in particular an event based in Johnstown, PA, would be named as such. Perhaps it was serendipitous that some of the hardest rains of the year would fall on the inaugural running of the Higher Ground Hundo. So heading for Higher Ground is exactly what the riders did on a beautiful and difficult route up and over the forest roads. The few who tackled the 100-mile route would experience over 9,000 feet of elevation gain thanks to the Allegheny Mountains. Even at the highest ground, there was little refuge from the rain. The clouds consumed the top of the bergs as the day pushed on the wind picked up and the temperatures dropped into the 50’s. I dare not use the word ‘epic’ but the overall feel of the day was hovering in the vicinity.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-37-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As I watched riders roll by smiling and chatting with friends, saturated but undeterred I thought about the recent query of the ‘spirit of gravel’. Was the Higher Ground Hundo a race or a ride? There was no podium but I did overhear someone say “Well if someone won it was definitely so and so.” Whatever the idea is behind the ‘spirit of gravel’ the folks at Hope Cyclery have been able to conjure it up for the Higher Ground Hundo. There was a sense of adventure and the unknown as the course was barely marked. The riders downloaded routes to their GPS devices and phones occasionally finding aid stations at the far reaches of each course.  As lone riders passed by on washed-out forest roads no one yelled for time splits, just a friendly ‘hey’ or ‘hello’.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-60-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>By mid-afternoon, the group that had set out on the 30-mile course had finished and sought the comfort of warmer and dryer clothes. The final riders of the longer routes trickled in to find a bountiful buffet of hot Caribbean bbq waiting for them. Molly, who was working one of the aid stations rescued an adorable grey kitten who was quickly adopted into the role of shop cat. The evening found the skies clearing, the dark grey gave way to blues and gold as neighborhood kids raced past the shop on their BMX and beach cruiser bikes.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-24-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The Higher Ground Hundo will no doubt grow exponentially next year. The routes, the camaraderie, it was all too good for the word not to get out. A tip of the cap to Jarrod, David, and Molly for putting on a wonderful first-year event, to John Paul and Jane for serving up a delicious breakfast, and for <a href=\"https://www.instagram.com/hwondercoffee/?hl=en\" target=\"_blank\">H. Wonder Coffee</a> for extra stoke boost. Mark your calendar and head for Higher Ground.</p>\n<p><strong>If you want to register for the 2022 Higher Ground Hundo, <a href=\"https://www.bikereg.com/higher-ground\" target=\"_blank\">you can do so now at BikeReg</a>!</strong></p>\n<p></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/higher-ground-14-of-105.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><em>Editor’s note: we love a good <a href=\"https://open.spotify.com/artist/7kWnE981vITXDnAD2cZmCV\" target=\"_blank\">Darkthrone</a> flip! <a href=\"https://www.youtube.com/watch?v=xo6AnRwKvUE\" target=\"_blank\">Biking metal punks</a>… forever!</em></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"b41af8f1d8f83d0ffa5a0b2ec48b028e88f8a7c9594d97b5c3b7b69fbcc673cf","category":"Cycling"}