{"title":"Avocado cultivar and tree-to-tree leaf compositional differences affect infestation severity of Pseudocysta perseae (Hemiptera: Tingidae)","link":"https://academic.oup.com/ee/article/53/5/849/7710871?rss=1","date":1720656000000,"content":"<span><div>Abstract</div>Avocado lace bug, <span>Pseudocysta perseae</span> (Heidemann) (Hemiptera: Tingidae), is a sap-feeding insect that feeds on the underside of avocado leaves. First observed in 2019, <span>P. perseae</span> has spread throughout the Hawaiian islands, causing premature leaf drop and decrease in avocado yield. Due to Hawai’i’s approximately 200 cultivars comprised of all 3 avocado races with extensive racial hybrids, we were able to investigate whether certain cultivars were more prone to experiencing higher <span>P. perseae</span> abundances and infestations compared to others. We conducted longitudinal abundance surveys on Hawai’i Island across several common avocado varieties monitoring changes in <span>P. perseae</span> abundance. These surveys were supplemented with longitudinal infestation severity surveys across 4 avocado lineages (Mexican, Guatemalan, West Indian, and Guatemalan × West Indian hybrid). Additionally, we collected leaves of ‘Sharwil’, ‘Hass’, ‘Kahalu’u’, and ‘Nishikawa’ cultivars looking at associations between <span>P. perseae</span> abundance and cultivar, herbivory-related biomechanical traits, and soluble sugar content. We found that some cultivars, such as ‘Malama’, typically experience lower <span>P. perseae</span> abundances compared to cultivars such as ‘Kahalu’u’, ‘Beshore’, and ‘Sharwil’. Guatemalan × West Indian hybrid trees were also shown to have a higher probability of experiencing more severe <span>P. perseae</span> infestations compared to other lineages. Lastly, soluble sugar content, specifically fructose content, had a positive effect on juvenile <span>P. perseae</span> abundance. These findings suggest that cultivar differences in <span>P. perseae</span> infestations may exist, but tree-to-tree leaf compositional differences, such as soluble sugar content, may be a large driver of variation in <span>P. perseae</span> abundance.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"b41b217cfe41d03ea652ab8af8c6431651b205a371788ceb5d3720612e7e7cf5","category":"Environment"}