{"title":"Ductile Deformation of the Lithospheric Mantle","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-063756?TRACK=RSS","date":1685491200000,"content":"<div><p>The strength of lithospheric plates is a central component of plate tectonics, governed by brittle processes in the shallow portion of the plate and ductile behavior in the deeper portion. We review experimental constraints on ductile deformation of olivine, the main mineral in the upper mantle and thus the lithosphere. Olivine deforms by four major mechanisms: low-temperature plasticity, dislocation creep, dislocation-accommodated grain-boundary sliding (GBS), and diffusion-accommodated grain-boundary sliding (diffusion creep). Deformation in most of the lithosphere is dominated by GBS, except in shear zones—in which diffusion creep dominates—and in the brittle-ductile transition—in which low-temperature plasticity may dominate. We find that observations from naturally deformed rocks are consistent with extrapolation of the experimentally constrained olivine flow laws to geological conditions but that geophysical observations predict a weaker lithosphere. The causes of this discrepancy are unresolved but likely reside in the uncertainty surrounding processes in the brittle-ductile transition, at which the lithosphere is strongest.\n</p><ul>\n<li><span>▪ \n</span>Ductile deformation of the lithospheric mantle is constrained by experimental data for olivine.\n</li>\n<li><span>▪ \n</span>Olivine deforms by four major mechanisms: low-temperature plasticity, dislocation creep, dislocation-accommodated grain-boundary sliding, and diffusion creep.\n</li>\n<li><span>▪ \n</span>Observations of naturally deformed rocks are consistent with extrapolation of olivine flow laws from experimental conditions.\n</li>\n<li><span>▪ \n</span>Experiments predict stronger lithosphere than geophysical observations, likely due to gaps in constraints on deformation in the brittle-ductile transition.\n</li>\n</ul><p></p></div>","author":"Jessica M. Warren and Lars N. Hansen","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"b41c3504666b51cd65da7769b8f9e4f8c7b8cb75defc7c432f0aee3dfe10b823","category":"Environment"}