{"title":"The utility of orbital imaging in the evaluation of orbital disease","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308528","date":1725026400000,"content":"<p>by Min Joung Lee, Rohan Verma, Bronwyn E. Hamilton, David Pettersson, Dongseok Choi, Eun Soo Kim, Bobby S. Korn, Don O. Kikkawa, James T. Rosenbaum</p>\r\nPurpose <p>This study investigates the accuracy of either computerized tomography (CT) or magnetic resonance imaging (MRI) for the evaluation of various orbital diseases.</p> Methods <p>We collected 126 CT scans and 65 MRI scans from 144 subjects and asked two radiologists to interpret the images without clinical information. Images included 14 with a clinical diagnosis of orbital infection, 144 with orbital inflammation, and 33 with orbital neoplasm. The inflammatory diseases included thyroid eye disease (TED, n = 69), non-specific orbital inflammation (NSOI, n = 44), IgG4-related disease (IgG4-RD, n = 15), sarcoidosis (Sarcoid, n = 9), granulomatosis with polyangiitis (GPA, n = 5), and Erdheim-Chester disease (ECD, n = 2).</p> Results <p>The balanced accuracy (BA) for the two radiologists ranged from 0.87 to 0.90 for cellulitis, 0.81 to 0.86 for inflammation, and 0.82 to 0.85 for neoplasm. Radiologists were excellent at recognizing GPA (BA = 0.98 to 0.99) and very good for TED (BA = 0.80 to 0.86). They also did well identifying IgG4-RD (BA = 0.75 to 0.77), but slightly less well for NSOI (BA = 0.69 to 0.75) and poorly for Sarcoid (BA = 0.48 to 0.50).</p> Conclusions <p>CT or MRI scanning contributes to the evaluation of patients with orbital disease, but accuracy does varies based depending on the diagnosis. We could not evaluate issues such as determination of disease activity, variability based on the unit used for imaging or the skills beyond those of our two specialized neuroradiologists. Future studies should directly compare the two imaging modalities and assess the utility of imaging to determine disease activity.</p>","author":"Min Joung Lee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b421013f5e1f83e3b23e71e403f70a2a2765bab86d2a79225b5356f24f65dcf6","category":"Interdisciplinary"}