{"title":"In vitro effects of phytogenic feed additive on Piscirickettsia salmonis growth and biofilm formation","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13913?af=R","date":1715361848000,"content":"<h2>Abstract</h2>\n<p>Piscirickettsiosis is the main cause of mortality in salmonids of commercial importance in Chile, which is caused by <i>Piscirickettsia salmonis</i>, a Gram-negative, γ-proteobacteria that can produce biofilm as one of its virulence factors. The Chilean salmon industry uses large amounts of antibiotics to control piscirickettsiosis outbreaks, which has raised concern about its environmental impact and the potential to induce antibiotic resistance. Thus, the use of phytogenic feed additives (PFA) with antibacterial activity emerges as an interesting alternative to antimicrobials. Our study describes the antimicrobial action of an <i>Andrographis paniculate</i>-extracted PFA on <i>P. salmonis</i> planktonic growth and biofilm formation. We observed complete inhibition of planktonic and biofilm growth with 500 and 400 μg/mL of PFA for <i>P. salmonis</i> LF-89 and EM-90-like strains, respectively. Furthermore, 500 μg/mL of PFA was bactericidal for both evaluated bacterial strains. Sub-inhibitory doses of PFA increase the transcript levels of stress (<i>groEL</i>), biofilm (<i>pslD</i>), and efflux pump (<i>acrB</i>) genes for both <i>P. salmonis</i> strains in planktonic and sessile conditions. In conclusion, our results demonstrate the antibacterial effect of PFA against <i>P. salmonis</i> in vitro, highlighting the potential of PFA as an alternative to control Piscirickettsiosis.</p>","author":"Natacha Santibáñez, \nMatías Vega, \nTatiana Pérez, \nRicardo Enriquez, \nCarla Estefanía Escalona, \nCristian Oliver, \nAlex Romero","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"b4230c8f6f8fd66e5ca952247cb404b5f2ffc68c13f4c9f6569f4431ea5312ac","category":"Environment"}