{"title":"Longitudinal impact of screening colonoscopy on greenhouse gas emissions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307133","date":1721397600000,"content":"<p>by Hasiya Yusuf, Vinita Gupta, Ikponmwosa Osaghae, Abhishek Kumar</p>\r\nBackground and aim <p>Colonoscopy is the gold-standard screening test for colorectal cancer. However, it has come under scrutiny for its carbon footprint and contribution to greenhouse gas (GHG) emissions compared to other medical procedures. Notwithstanding, screening colonoscopies may have a positive effect on GHG emissions that is unknown. This study estimated the carbon emissions prevented by screening colonoscopies in the U.S.</p> Methods <p>Using the reported number of screening colonoscopies performed annually in the U.S. and the absolute risk reduction (ARR) reported in the NorDICC trial, we calculated the expected minimum number of cancer treatment and surveillance visits prevented through screening based on the cancer stage. The average carbon emission averted per mile traveled was computed using the Environmental Protection Agency’s (EPA) GHG equivalencies calculator. The final estimate of carbon emissions averted over a decade by screening colonoscopies performed in one year was determined.</p> Result <p>6.3 million screening colonoscopies performed in one year prevent 1,134,000 colorectal cancers over a ten-year period. Of these, 38∙3% (434,254) are localized, 38∙8% (440,281) are regional, and 22∙9% (259,465) are metastatic disease. The minimum number of post-diagnosis visits prevented is 11 for stage I, ≥ 21 for stage II, ≥25 for stage III, and ≥ 20 for stage IV disease, comprised of diagnostic, surgical evaluation, chemotherapy, and surveillance visits. The total number of visits prevented by screening is 2,388,397 for stage I, 5,254,421 for stage II, 13,120,369 for stage III, and 9,210,972 for stage IV disease. Approximately 395 million miles of travel and 158,263 metric tons of CO2, equivalent to 177 million pounds of coal burned, 19 billion smartphones charged, or 18 million gallons of gasoline consumed, were saved over ten years through screening.</p> Conclusion <p>Colorectal cancer screening decreases cancer-related GHG emissions and minimizes the environmental impact of cancer treatment.</p>","author":"Hasiya Yusuf","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b4335c72c29dffb05102996dd9b24c81c1c251ef9287ef9e2e624ff08803869b","category":"Interdisciplinary"}