{"title":"Coal consumption and carbon emission reductions in BRICS countries","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300676","date":1711720800000,"content":"<p>by Jie Wen, Fan Yang, Yiyin Xu</p>\r\n\r\nThe primary energy consumption structure of BRICS countries is dominated by fossil energy, particularly coal. Coal consumption in BRICS countries is a major driver underlying increased carbon emissions. Therefore, this study developed a spatiotemporal decoupling mode and incorporated factors related to coal consumption-induced carbon emissions into a spatiotemporal decoupling analysis method to provide differentiated and targeted policies for energy restructuring and emission reduction targets in BRICS countries. Moreover, a temporal-spatial decomposition logarithmic mean Divisia index model was developed using the spatiotemporal decoupling index method. The model is based on CO<sub>2</sub> emissions generated by coal consumption in BRICS countries, with a primary focus on data from Brazil, Russia, South Africa, India, and China. The findings reveal distinct spatiotemporal distributions and driving effects of coal consumption and carbon dioxide emissions across various countries. Factors such as CO<sub>2</sub> emission intensity, coal consumption intensity, economic output per capita, and population structure exerted either positive or negative effects on the distributional effect of the carbon emission-economic output per capita association in BRICS countries. Additionally, country-level heterogeneity in the influence of the distributional effects of CO<sub>2</sub> emissions was observed within each BRICS country. Thus, different policies are needed to achieve carbon emission reduction targets in different countries.","author":"Jie Wen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b43998fe9a5136d2b37ad1c89cf36c6cd4aef6d6d981c4a018d4485592728a6c","category":"Interdisciplinary"}