{"title":"The Efficacy and Safety Associated with Switching from Brimonidine and Ripasudil, or Brimonidine or Ripasudil to a Fixed Combination of Brimonidine and Ripasudil in Glaucoma Patients","link":"https://www.preprints.org/manuscript/202405.1886/v1","date":1716908380000,"content":"To investigate switching from brimonidine and ripasudil, and brimonidine or ripasudil to a fixed combination of brimonidine and ripasudil and evaluate the associated efficacy and safety in glaucoma patients. Glaucoma patients undergoing treatment with at least brimonidine and ripasudil (n = 25) or treatment with at least brimonidine or ripasudil (n = 45) were evaluated in this retrospective study. After switching patients taking brimonidine and ripasudil, or brimonidine or ripasudil to a ripasudil/brimonidine fixed-combination ophthalmic suspension (RBFC), intraocular pressure (IOP), superficial punctate keratopathy (SPK) and conjunctival hyperemia were evaluated at baseline and at 4, 12 and 24 weeks. No significant differences in the IOPs were observed at any of the time points after switching from brimonidine and ripasudil to RBFC. However, at 4, 12 and 24 weeks, a significant decrease was observed in the mean baseline IOP from 17.0 ± 4.4 mmHg to 15.7 ± 3.2 mmHg (P &lt; 0.01), 14.3 ± 3.4 mmHg (P &lt; 0.01) and 14.4 ± 4.1 mmHg (P &lt; 0.01), respectively, after switching from brimonidine or ripasudil to RBFC. No significant changes were noted for the SPK score or conjunctival hyperemia at any time points after switching to RBFC. Throughout the 24-week evaluation period, the IOP was maintained after switching from brimonidine and ripasudil to RBFC. However, there was a significant IOP decrease after switching from brimonidine or ripasudil to RBFC. These results demonstrate that RBFC is safe for use in the treatment of glaucoma patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b43a86aa268826ca25fa492d79f240e199a067046d73c2c388084c1035710f36","category":"Interdisciplinary"}