{"title":"The bad blood between Musk and Zuckerberg began with a bang","link":"https://arstechnica.com/?p=1949475","date":1687445346000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/musk-vs-zuck-800x450.jpg\" alt=\"Musk versus Zuckerberg in a cage match? Probably not.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/musk-vs-zuck.jpg\">Enlarge</a> <span>/</span> Musk versus Zuckerberg in a cage match? Probably not. (credit: Aurich Lawson | Getty Images ( David Paul Morris | Nathan Laine))</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Internet is aflame this morning with the prospect of a cage match between two of the tech industry's most prominent and controversial leaders. Ready to rumble in the red corner is Tesla and SpaceX founder Elon Musk. And in the blue corner, we have the founder of Facebook, Mark Zuckerberg.</p>\n<p>As the BBC and multiple other outlets <a href=\"https://www.bbc.com/news/business-65981876\">have confirmed</a>, Zuckerberg was entirely serious when he accepted Musk's offer of a cage match by saying \"send me location.\" On Wednesday evening, Musk <a href=\"https://twitter.com/elonmusk/status/1671704483598925825\">then replied</a> with \"Vegas Octagon.\" This was a reference to the fenced-in area used for Ultimate Fighting Championship bouts in Las Vegas.</p>\n<p>Given the humorous nature of Musk's other responses to the proposed fight, such as \"I have this great move that I call 'The Walrus', where I just lie on top of my opponent &amp; do nothing,\" it seems probable that he is not overly serious. While Musk has the definite advantage in size, he is 12 years older than Zuckerberg, and the Facebook founder frequently trains in mixed-martial arts.</p></div><p><a href=\"https://arstechnica.com/?p=1949475#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949475&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b44f7add74a0648465e2380ad5dc0bfa751f2c7c1584ddade96e17e4f10b5199","category":"Tech"}