{"title":"Intel Plans to Make Chips for Qualcomm in the Future","link":"https://www.macrumors.com/2021/07/26/intel-manufacturing-future-qualcomm-chips/","date":1627337828000,"content":"Intel <a href=\"https://www.intc.com/news-events/press-releases/detail/1486/intel-accelerates-process-and-packaging-innovations\">today announced</a> that it is teaming up with Qualcomm to manufacture some of Qualcomm's future chips. The chips will be manufactured using Intel's 20A process, which is expected to ramp in 2024.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/intel-logo.jpg\" />\r\n<br />\r\nThere is no word on which chips Intel will make for Qualcomm, but Qualcomm's Snapdragon chips are used in most Android smartphones. Though the 20A design is expected to be available starting in 2024, Intel did not provide a timeline for when it will begin working with Qualcomm.\r\n<br />\r\n\r\n<br />\r\nIntel says that its 20A manufacturing process introduces RibbonFET, the first new transistor architecture since FinFET in 2011. The 20A technology brings faster transistor switching speeds and a smaller footprint. Before the 20A chips are ready, Intel <a href=\"https://www.intc.com/news-events/press-releases/detail/1486/intel-accelerates-process-and-packaging-innovations\">will be working on</a> Intel 7, Intel 4, and Intel 3 chips in 2021 through 2023.\r\n<br />\r\n\r\n<br />\r\nIntel CEO Pat Gelsinger said that Intel is aiming to be on a \"clear path to process performance leadership by 2025.\"<blockquote>We are leveraging our unparalleled pipeline of innovation to deliver technology advances from the transistor up to the system level. Until the periodic table is exhausted, we will be relentless in our pursuit of Moore's Law and our path to innovate with the magic of silicon.</blockquote>Qualcomm's chips will be manufactured under Intel's new Intel Foundry Services business, which was <a href=\"https://www.macrumors.com/2021/03/23/intel-manufacture-apple-silicon-chips/\">announced in March</a>. Intel wants to become a major provider of foundry capacity and manufacture chips for other companies, and to do so, it is building two new chip factories in Arizona.\r\n<br />\r\n\r\n<br />\r\nWhen the Intel Foundry Services plan was introduced, Gelsinger said that Intel would pursue Apple has a potential customer. If this happens, Intel would be producing Apple silicon chips for use in Apple devices.\r\n<br />\r\n\r\n<br />\r\nAt the current time, Apple relies on Taiwan Semiconductor Manufacturing Company (TSMC) to produce all of the A-series and Apple silicon chips used in the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Mac. TSMC is Apple's sole supplier, so it's not out of the question that Apple could eventually reach some kind of deal with Intel to diversify its supply chain.\r\n<br />\r\n\r\n<br />\r\nIntel and Apple previously partnered on modem chips for iPhones when Apple was in a <a href=\"https://www.macrumors.com/guide/apple-vs-qualcomm/\">legal battle with Qualcomm</a>. Intel was not able to deliver the 5G chips that Apple needed for the ‌iPhone‌, so Apple and Qualcomm <a href=\"https://www.macrumors.com/2019/04/16/apple-qualcomm-settlement/\">settled their dispute</a>, dropped all litigation, and Apple went back to purchasing Qualcomm modem chips. After that snafu, Intel in 2019 <a href=\"https://www.macrumors.com/2019/04/16/intel-exits-5g-smartphone-modem-business/\">decided to exit</a> the smartphone modem chip business, and ultimately sold the majority of its smartphone modem business <a href=\"https://www.macrumors.com/2019/07/25/apple-intel-acquisition/\">to Apple</a>.\r\n<br />\r\n\r\n<br />\r\nEarlier this month, Qualcomm CEO Cristiano Amon said that Qualcomm will provide laptop chips able to <a href=\"https://www.macrumors.com/2021/07/02/qualcomm-ceo-plans-to-compete-with-apple-silicon/\">compete with Apple silicon</a> by 2022, and that Qualcomm is \"capable of having the best chip on the market\" with a team of chip architects that previously <a href=\"https://www.macrumors.com/2019/03/30/gerard-williams-iii-departs-apple/\">worked for Apple</a>.\r\n<br />\r\n\r\n<br />\r\nQualcomm in January <a href=\"https://www.macrumors.com/2021/01/13/qualcomm-to-acquire-chip-startup-nuvia/\">acquired chip startup Nuvia</a> for $1.4 billion, and the company plans to begin selling custom silicon Nuvia-based laptop chips in 2022.<div>Tags: <a href=\"https://www.macrumors.com/guide/intel/\">Intel</a>, <a href=\"https://www.macrumors.com/guide/qualcomm/\">Qualcomm</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/26/intel-manufacturing-future-qualcomm-chips/\">Intel Plans to Make Chips for Qualcomm in the Future</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/intel-plans-to-make-chips-for-qualcomm-in-the-future.2305584/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vV1DbBT9ZQE:s4tgkA-pc3A:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vV1DbBT9ZQE:s4tgkA-pc3A:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/vV1DbBT9ZQE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b45b27c16a26d511cdd147b6e13eaf711b73a387650833f0f5b835da8f81d8f6","category":"Apple"}