{"title":"Wetness severity increases abrupt shifts in ecosystem functioning in arid savannas","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17235?af=R","date":1710761732000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0baa7de6-e823-46b8-9e24-030820f65d6d/gcb17235-toc-0001-m.png\" alt=\"Wetness severity increases abrupt shifts in ecosystem functioning in arid savannas\" />\n<p>The research delves into climate-driven changes within arid savanna ecosystems, with a particular focus on pinpointing pivotal shifts in ecosystem functioning. Remote sensing and time series analysis of rain use efficiency (RaUE) were used to identify and characterise abrupt changes in savanna ecosystem functioning. Factors exacerbating susceptibility were identified through survival analysis, notably including higher soil sand content, flatter terrain and cooler long-term mean temperatures during the wet summer season. It was found that increased severity of rainfall events (i.e., wetness severity), rather than drought alone, predominantly instigated these functional changes.</p>\n<br />\n<h2>Abstract</h2>\n<p>The accelerating pace of climate change has led to unprecedented shifts in surface temperature and precipitation patterns worldwide, with African savannas being among the most vulnerable regions. Understanding the impacts of these extreme changes on ecosystem health, functioning and stability is crucial. This paper focuses on the detection of breakpoints, indicative of shifts in ecosystem functioning, while also determining relevant ecosystem characteristics and climatic drivers that increase susceptibility to these shifts within the semi-arid to arid savanna biome. Utilising a remote sensing change detection approach and rain use efficiency (RaUE) as a proxy for ecosystem functioning, spatial and temporal patterns of breakpoints in the savanna biome were identified. We then employed a novel combination of survival analysis and remote sensing time series analysis to compare ecosystem characteristics and climatic drivers in areas experiencing breakpoints versus areas with stable ecosystem functioning. Key ecosystem factors increasing savanna breakpoint susceptibility were identified, namely higher soil sand content, flatter terrain and a cooler long-term mean temperature during the wet summer season. Moreover, the primary driver of changes in ecosystem functioning in arid savannas, as opposed to wetter tropical savannas, was found to be the increased frequency and severity of rainfall events, rather than drought pressures. This research highlights the importance of incorporating wetness severity metrics alongside drought metrics to comprehensively understand climate–ecosystem interactions leading to abrupt shifts in ecosystem functioning in arid biomes. The findings also emphasise the need to consider the underlying ecosystem characteristics, including soil, topography and vegetation composition, in assessing ecosystem responses to climate change. While this research primarily concentrated on the southern African savanna as a case study, the methodological robustness of this approach enables its application to diverse arid and semi-arid biomes for the assessment of climate–ecosystem interactions that contribute to abrupt shifts.</p>","author":"L. M. Vermeulen, \nB. Verbist, \nK. Van Meerbeek, \nJ. Slingsby, \nP. N. Bernardino, \nB. Somers","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"b46676af6348bf4b4ae08503a1e55f52fda1964f00bf839e5a55c2152679f1e0","category":"Environment"}