{"title":"Aussie track and road rider Leigh Howard is retiring","link":"https://cyclingtips.com/2021/12/aussie-track-and-road-rider-leigh-howard-is-retiring/","date":1639527300000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1052923402-650x443.jpeg\" /></div><h2>Aussie track and road rider Leigh Howard is retiring</h2><p>\n</p><p>Olympic medalist and four-time track world champion Leigh Howard has announced his retirement from professional cycling.</p>\n\n\n\n<p>The 32-year-old Australia has split his time between track and road commitments over the past 13 years, achieving significant success in both domains.</p>\n\n\n\n<p>On the track he claimed world titles in the omnium (2009), madison (2010 and 2011, with Cameron Meyer) and the team pursuit (2019) and he was part of Australia bronze-medal-winning team pursuit squad at the recent Tokyo Olympics. He’s also a seven-time Australian champion on the track, and was part of the gold-medal-winning team pursuit team at the 2018 Commonwealth Games.</p>\n\n\n\n<p>On the road, Howard spent seven seasons racing at the WorldTour level – two with HTC-Columbia/High Road (2010-11), four with Orica-GreenEdge where he was a founding member (2012-2015), and IAM Cycling (2016). He took eight victories on the road including stages at the Tour of Oman, the Tour of Britain, and the Ster ZLM Tour, plus a handful of one-day victories including the Clasica de Almeria.</p>\n\n\n\n<p>Howard’s career can be separated into three distinct chapters: his early days spent focusing on track racing, a full-time focus on the road starting in 2010, and then a return to the track in 2018. Howard’s return to the velodrome saw him become a vital part of Australia’s team pursuit squad which ultimately took him to the delayed Tokyo Olympics this year.</p>\n\n\n\n<p>Howard had planned to retire after Tokyo but ultimately the final decision came after that.</p>\n\n\n\n<p>“I think the moment it became a reality was about a month after the Olympics,” he said via an AusCycling press release. “I hadn’t touched the bike, and usually in past years, after about four weeks of not riding, that is when I’m itching to get back on the bike. However, this time after four weeks, I still had no interest whatsoever in getting back on the bike again. </p>\n\n\n\n<p>“Going for rides with my dog was about my limit. I’m sure eventually I will get back on and start doing more, but for the moment, I’m happy just playing some golf and doing a bit of running.” </p>\n\n\n\n<p>Asked to nominate his fondest memories, Howard notes his first pro win, at the 2010 Tour of Oman, and crossing the finish of the 2016 Tour de France. But it’s the Tokyo Olympics that he’ll remember most fondly.</p>\n\n\n\n<p>“The moment I’m most proud of was standing on the podium in Tokyo – not much can beat that feeling,” Howard said. “It was a big fight to get track-ready again after so many years on the road, and then throwing COVID and a newborn into the mix in the lead-up was extremely difficult but rewarding. </p>\n\n\n\n<p>“I’m proud of my partner for what she was able to do during that time to help me do what I have done.</p>\n\n\n\n<p>“Olympics was by far the most challenging thing I had to do, not that my other accomplishments during my career came easily, but the length of time it took to prepare solely for one event at the Olympics was really tough. To finally reach the end of that journey and walk away with a medal was pretty damn special and [even though] it wasn’t the colour medal we all wanted, it was still special to have something to walk away with.” </p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/aussie-track-and-road-rider-leigh-howard-is-retiring/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b4674af74ffcf56f0981a22283998de53c24be372a75322b7094f4acbd4539c6","category":"Cycling"}