{"title":"Increased Risk of Herpes Zoster in Rheumatoid Arthritis Is Not Only Due to Jak Inhibitors: Study of 392 Patients from a Single University Center","link":"https://www.preprints.org/manuscript/202403.0979/v1","date":1710749484000,"content":"Background/Objectives: Patients with rheumatoid arthritis (RA) have an increased risk of infections. The risk of presenting herpes zoster (HZ) is 1.5-2 times higher than in immunocompetent individuals and disseminated presentation is more frequent. Our aim was to analyze the prevalence and general features of HZ in RA patients. Methods: Prospective study of 392 RA patients included in the vaccination program of our hospital between 2011 and 2016, and followed-up until December 2020. Diagnosis of HZ was made according to clinical manifestations: skin rash, blisters, paresthesia and local pain in one or more dermatomes. Results: We studied 392(309women/83men), mean age 59±13years. Every patient was followed-up during a mean period of 137±110 months (range: 42months- 42years). HZ infection was observed in 30 of 392 (25women/5men) patients; age (mean±SD) 64.7±11.8years. Prevalence was 7.65% in this period and incidence rate was 13.22/1000patients/year. Three patients had facial involvement, one with optic involvement and one patient presented a disseminated HZ. Seven patients presented postherpetic neuralgia treated with gabapentinoids. The main features of RA of these 30 patients were: positive RF(n=17; 56.6%), positive anti-CCP(13; 43.3%) and erosive disease(10; 33.3%). At HZ infection they were in treatment with glucocorticoids (19; 63.3%), conventional DMARDs (15; 50%), biological DMARDs (15; 50%), tofacitinib (2; 6.6%) and upadacitinib (1; 3.3%). Conclusions: HZ is a relative frequent viral complication of RA patients. In our series, one patient presented a disseminated HZ and nearly 25% of patients had post-herpetic neuralgia. Include HZ vaccine in our vaccination program in RA patients may be beneficial.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b46d2ad7769ad2760bce210f18232899ead54fca9e8056edc2d4f36f3bea2dbc","category":"Interdisciplinary"}