{"title":"Porsche and Penske: Two of racing’s most famous names join forces again","link":"https://arstechnica.com/?p=1762203","date":1620136850000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Porsche-Motorsport_LMDh-teaser-front--980x608.jpg\" /></div>\n        <p>\n          This sketch is all we've seen of Porsche's forthcoming LMDh hybrid racer. But now we know that when it starts racing in 2023, it will be run by Team Penske.                      [credit:\n                        Porsche                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Porsche and Penske: two of the most storied names in racing. You could fill at least one library just with books about their exploits. In fact, you could probably fill a library just with stories of their exploits when working together—in the \"anything goes\" days of CanAm in the early 1970s or battling against the diesel Audis in the heyday of the American Le Mans Series. Now the two are coming together again as Porsche re-enters endurance racing with a hybrid LMDh race car in 2023.</p>\n<p>As many have suspected, Penske will run Porsche's factory racing teams with these new 670 hp (500 kW) prototypes. In fact, Penske will field a pair of teams: a two-car effort for the FIA World Endurance Championship, which includes the 24 Hours of Le Mans, and another two-car program for IMSA's WeatherTech Sportscar Championship, which races here in the US. Additionally, Porsche plans to sell LMDh prototypes to privateer teams, something it last did with the RS Spyder in the mid-2000s.</p>\n<p>\"We are delighted that we were able to get Team Penske to form this partnership,\" said Oliver Blume, chairman of the executive board of Porsche AG in a statement sent to Ars. \"For the first time in the history of Porsche Motorsport, our company will have a global team competing in the world's two largest endurance series. To this end, we will be setting up team bases on both sides of the Atlantic. This will enable us to create the optimal structures we will need to take overall victories at Le Mans, Daytona, and Sebring, for example.\"</p></div><p><a href=\"https://arstechnica.com/?p=1762203#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762203&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b476ea2f928a8c161dbffd7da15e2b3accd1f0882a2f2e3e38c0aa4ad258555b","category":"Tech"}