{"title":"Combining network pharmacology and experimental verification to study the anti‐colon cancer effect and mechanism of sulforaphene","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13703?af=R","date":1721296798000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Sulforaphene is a derivative of glucosinolate and a potential bioactive substance used for treating colon cancer. This study aimed to evaluate the potential inhibitory effect and mechanisms of sulforaphene in human colon cancer Caco-2 cells. Network pharmacology, molecular docking, and experimental verification were performed to elucidate potential sulforaphene mechanisms in the treatment of this condition.</p>\n<h2>RESULT</h2>\n<p>Network pharmacology predicted 27 intersection target genes between sulforaphene and colon cancer cell inhibition. Key sulforaphene targets associated with colon cancer cell inhibition were identified as <i>EGFR, MAPK14, MCL1, GSK3B, PARP1, PTPRC, NOS2, CTSS, TLR9,</i> and <i>CTSK.</i> Gene ontology functional enrichment analysis revealed that the above genes were primarily related to the positive regulation of peptidase activity, cytokine production in the inflammatory response, and the cell receptor signaling pathway. Kyoto Encyclopedia of Genes and Genomes enrichment analysis indicated that sulforaphene mainly inhibited the proliferation of cancer cells by affecting apoptosis as well as the signaling pathways of PD-1, Toll-like receptor, T cell receptor, and P13k–Akt. Molecular docking results further confirmed that <i>CTSS, GSK3B,</i> and <i>NOS2</i> were significantly up-regulated and had good binding affinity with sulforaphene. <i>In vitro</i> experiments also indicated that sulforaphene had a significant inhibitory effect on human colon cancer Caco-2 cells.</p>\n<h2>CONCLUSION</h2>\n<p>This paper revealed the pharmacodynamic mechanism of sulforaphene in the treatment of colon cancer for the first time. It provides scientific insight into the development of sulforaphene as a medicinal resource. © 2024 Society of Chemical Industry.</p>","author":"Yang Qu, \nXiuxia Li, \nJianrong Li, \nZhangfu Yu, \nRonghu Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"b47af4da09db2948c0e80f953e1eef307ad8fd6c070c81c4914979204a6548e7","category":"Environment"}