{"title":"Tim Cook Talks Privacy, User Trust, Morning Routine, and More in Financial Review Interview","link":"https://www.macrumors.com/2021/08/20/tim-cook-interview-privacy-user-trust-more/","date":1629450477000,"content":"In a long and <a href=\"https://www.afr.com/technology/why-tim-cook-thinks-australia-is-a-perfect-tech-breeding-ground-20210726-p58cvp\">extensive interview</a> with the <em>Australian Financial Review</em>, Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> discussed many topics, from Apple's core values on privacy, the importance of user trust, his morning routine, <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> regulation, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/tim-cook-afr-cover-interview-.jpg\" />\r\n<br />\r\nThe interview, conducted in July, is in celebration of the <em>Financial Review</em>'s 70th anniversary. Cook begins the interview by sharing his morning routine, noting he likes to read emails from customers as it helps him keep a \"pulse on what customers are feeling.\"\r\n<br />\r\n<blockquote>Tim Cook likes to begin his days early; he's at his desk by 4am. \"I do that because I can control the morning better than the evening and through the day. Things happen through the day that kind of blow you off course,\" he tells The Australian Financial Review. \"The morning is yours. Or should I say, the early morning is yours.\"\r\n<br />\r\n\r\n<br />\r\nThe morning routine of the man at the helm of the world's most valuable company? Reading emails from customers. Cook estimates he gets through hundreds a day. \"I cannot read all of them, no. I'd not admit to doing that. But I read an extraordinary number of them. It keeps my hands on the pulse of what customers are feeling and thinking and doing\"</blockquote>Speaking about the Apple Watch, which since its introduction in 2015 has gained new health monitoring and tracking capabilities, Cook said emails from customers on how the device has changed, or in many cases saved their life, \"really mean something\" to Apple. Cook notes that his company wants to create products that \"enrich people's lives, and there's no better example of that than saving someone's.\"\r\n<br />\r\n\r\n<br />\r\nTalking about artificial intelligence, Cook notes that Apple already utilizes AI in features on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Apple Watch but believes that AI is just getting started in terms of on its impact on our lives. Cook also commented on augmented reality, calling it a way to \"amplify the value of technology with people, without enclosing or shutting off the real world.\"\r\n<br />\r\n<blockquote>He's excited about artificial intelligence, which is already \"all over the current iPhone, iPad and the watch et cetera\" but \"we're only at the early stages of what can be done\". AI will take away some of the mundane things we do every day, he says, and free up our time so we can do more of what we love.\"\r\n<br />\r\n\r\n<br />\r\nHe goes on: “I'm a huge believer in augmented reality. It can enhance our conversations that we're having, and enhance learning and really amplify the value of technology with people, without it enclosing or shutting off the real world.”</blockquote>Apple is widely rumored to be working on augmented reality glasses, and the company has stepped up its efforts in recent years on building outs its AR platform. Learn more about Apple's future augmented reality plans using our <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">comprehensive guide</a>. \r\n<br />\r\n\r\n<br />\r\nWith the emergence of AI and AR becoming more mainstream in the future, Cook spoke to concerns over how technology can be utilized for harm rather than to benefit people's lives. Cook said he believes that technology's impact on society is not based on the technology itself but on how its creators and users take advantage of it. \r\n<br />\r\n<blockquote>\"Technology doesn't want to be good. It doesn’t want to be bad, it's neutral,\" Cook says when asked about the potential downsides from tech as we move towards the middle of this century. \"And so it's in the hands of the inventor and the user as to whether it's used for good, or not used for good. And it depends on creativity. It depends on empathy. It depends on the passion of the people behind the technology. At Apple, when we make something, we make sure that we spend an enormous amount of time thinking carefully about how it will be used.\"</blockquote>\r\n<br />\r\n\r\n<br />\r\nAs is customary for any ‌Tim Cook‌ interview, the executive also touched on privacy and its role as a core value for Apple. It's worth mentioning that the interview was conducted in July, before Apple announced its controversial plans to scan ‌iPhone‌ users' photo libraries for CSAM or child sexual abuse material. As such, Cook's privacy and user trust comments during the interview don't address those plans.\r\n<br />\r\n\r\n<br />\r\nReferencing Screen Time, a built-in feature of iOS and macOS that provides users with tools to monitor the amount of time they're spending on their device, Cook said that it was an important feature to launch, pointing out the potential risks of technology losing touch with people's lives. \r\n<br />\r\n\r\n<br />\r\nCook went on to discuss privacy as a whole, noting that the topic has become more mainstream over the last few years. Cook said that he believes people's trust in some ways has been taken advantage of and that steps need to be taken to rebuild that trust. \r\n<br />\r\n<blockquote>Does he think people's trust has been taken advantage of?\r\n<br />\r\n\r\n<br />\r\n\"In some cases the answer is undeniably yes. And I think it's incumbent on all of us to rebuild that trust.\"\r\n<br />\r\n\r\n<br />\r\n\"I think what's happened is that there are many more people today that view privacy as a mainstream issue,\" he tells the Financial Review. \"Ten years ago, privacy was a niche issue. Today it's one of the primary issues in people’s minds because people know that the web has become this surveillance tool in all too many cases, and that the building of detailed profiles on people has gone well beyond any kind of reasonable thing.\"</blockquote>\r\n<br />\r\n\r\n<br />\r\nIn several countries, including Australia, Apple is under investigation for alleged monopolistic practices and behavior that could be considered anti-competitive. Probes, still ongoing in many cases, are likely pointing to increased regulation that would Apple and how it operates the ‌App Store‌.\r\n<br />\r\n\r\n<br />\r\nCook spoke about regulation and said it needs first to be determined where regulation is needed and where its specific focus should be. The CEO also pointed out the competition that Apple faces and said that he believes \"competition is inherently good.\" \r\n<br />\r\n<blockquote>\"Well, I think scrutiny of large companies is fair. And I start from the premise that regulation is necessary in some areas. And so it becomes a matter of determining where it's necessary and where the focus should be...In our model, the user is where the power exists because it's the user who decides when they buy a phone, are they going to buy an iPhone. Are they going to buy any number of Android phones? And so it's a fiercely competitive market. And then the market inside the App Store is also fiercely competitive ...And so there's huge competition in all areas of this.</blockquote>\r\n<br />\r\n\r\n<br />\r\nCook said that any form of regulation that could be implemented would need to \"be justified by being great for the user,\" drawing the comparison between regulation and product innovations. Cook also touched on the idea of Apple's tight control of the ‌App Store‌, which has become a hot button issue for the company.\r\n<br />\r\n\r\n<br />\r\nCriticism, mainly driven by game developer <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, is that Apple holds a monopoly over the ‌App Store‌ and that it should instead open up its devices to allow users to download apps from platforms outside of its own. Cook said that he believes doing so would be considered a backdoor.\r\n<br />\r\n<blockquote>\"It's the reality. If you put back doors in a system, anybody can use a back door. And so you have to make sure the system itself is robust and durable; otherwise you can see what happens in the security world. Every day you read about a breach, or you read about a ransomware.\"</blockquote>In the remainder of the interview, Cook spoke about his childhood, the late Steve Jobs, and more. ‌Tim Cook‌ is being featured on the cover of the Finical Review's \"Platinum 70\" magazine for Friday, August 20.<div>Tag: <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/20/tim-cook-interview-privacy-user-trust-more/\">Tim Cook Talks Privacy, User Trust, Morning Routine, and More in Financial Review Interview</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/tim-cook-talks-privacy-user-trust-morning-routine-and-more-in-financial-review-interview.2308117/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=w-4-sxgbkdI:cFvE8TCJu9U:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=w-4-sxgbkdI:cFvE8TCJu9U:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/w-4-sxgbkdI\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b484c9818d8e03954dc9ca387ef34cf050a4f99d56a7a9059389849e17762f4e","category":"Apple"}