{"title":"A Dimensional Analysis for Cost Optimization and Cost-Effective Carbon Capture: A Comparative Study of Hybrid Post-Combustion Configurations in Natural Gas Power Plants","link":"https://www.preprints.org/manuscript/202408.0552/v1","date":1723115969000,"content":"Carbon capture, utilization, and storage (CCUS) considered a the key strategy for reducing the emissions of anthropogenic carbon dioxide from power generation plants, can be achieved by three main technologies: oxy-fuel combustion, pre-combustion, and post-combustion capture.\nPost-combustion carbon capture (PCC), where CO2 is removed after the fuel burning, is a crucial solution for reducing greenhouse gas emissions from natural gas power plants (NGPPs). However, high costs and energy penalties associated with PCC technologies hinder their widespread adoption.\nRecent advancements in hybrid PCC configurations have shown promise in improving efficiency and reducing costs. In effect, six PCC hybrid configurations below were identified as feasible process routes: \n\n•\t2S-AB +AD: Two-stage Absorption + Adsorption hybrid\t\n•\t2S-AB +MB: Two-stage Absorption + Membrane hybrid\t\n•\t2S-AD +AB: Two-stage Adsorption + Absorption hybrid\t\n•\t2S-AD +MB: Two-stage Adsorption + Membrane hybrid\t\n•\t2S-MB +AB: Two-stage Membrane + Absorption hybrid\t\n•\t2S-MB +AD: Two-stage Membrane + Adsorption hybrid\n\nEach hybrid has its own technical and economic challenges that need to be investigated in order to identify the best technique for carbon capture. In this paper, we performed Aspen Hysys design simulation of the six hybrids PCC configurations and also their economic evaluations using parameters like investment costs, operating costs, net present value, and rate of return, culminating in the use of three assessment parameters namely, levelized cost of electricity (LCOE), carbon emission intensity (CEI) and cost of carbon avoidance (COA), to evaluate the six hybrids PCC configurations and to determine the most viable option.\n\nOverall, it was found by dimensional analysis that the post combustion carbon capture using 2S-MB +AB: Two-stage Membrane + Absorption hybrid is the most viable for capturing CO2 from power generation plants and is hereby recommended. However, the choice of materials (membranes and absorbents) needs to be evaluated so as determined the best optimal configuration for commercialization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b4862ebc70d909c1c3a0c18e3b7399cd9db02b07944c6037e8d7b1de39249669","category":"Interdisciplinary"}