{"title":"Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas","link":"https://arstechnica.com/?p=1946025","date":1686160483000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-apple-800x447.jpeg\" alt=\"Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-apple-scaled.jpeg\">Enlarge</a> (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Usually when Apple announces big new operating system updates at WWDC, it releases early, work-in-progress developer betas for app developers who have paid for an Apple Developer account. A few weeks later, once the betas have been updated a couple of times, it has released somewhat more-stable public beta versions for general consumption.</p>\n<p>That has changing this year. Anyone who signs in to <a href=\"https://developer.apple.com/support/compare-memberships/\">Apple's developer site</a> with their Apple ID will have access to the developer beta builds of iOS 17, macOS Sonoma, and Apple's other operating systems for free. Actually submitting apps to Apple for App Store distribution (or, on the Mac, signing them so that you can distribute them outside the App Store without setting off macOS' many unsigned app warning messages) will still cost $99 per year. But enthusiasts and testers who use developer accounts to get early beta access will no longer need to pay to do it.</p>\n<p>Apple will still release public beta builds of all its operating systems through its <a href=\"https://beta.apple.com/sp/betaprogram\">public beta program</a> sometime in July.</p></div><p><a href=\"https://arstechnica.com/?p=1946025#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946025&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b49e378666d423cfa6e583d2277af79f27b443cd8cb4a47ab97709708bff4dad","category":"Tech"}