{"title":"Rockman 11","link":"https://markpeak.net/rockman-11/","date":1707794571000,"content":"<p>ในฐานะแฟนเกม Rockman / Mega Man มายาวนาน และเล่นมาทุกภาค (ยกเว้นภาค 9/10 ที่ไม่มีโอกาสเล่น) ก็โหยหาเกมลักษณะนี้อยู่เรื่อยๆ เมื่อมีมิตรสหายท่านหนึ่งส่งต่อแผ่น Rockman 11 มาให้ และมีเวลาอันสมควร สุดท้ายก็ได้เล่นสักที (เล่นช้าไปราว 5-6 ปี)</p>\n\n\n\n<p>Rockman 11 ออกเมื่อปี 2018 โดยทิ้งช่วงห่างจากภาค 10 เป็นเวลานาน 8 ปี จุดเปลี่ยนสำคัญคือเป็นการรีเซ็ตรูปแบบเกมจากภาค 9/10 ที่เป็น 8-bit pixelate ย้อนยุค กลับมาสู่เกมที่ใช้กราฟิกสมัยใหม่ ซึ่งภาค 11 ก็ทำออกมาได้ดีทีเดียว</p>\n\n\n\n<p>นอกจากกราฟิกแล้ว ของใหม่ที่สำคัญคือระบบ Double Gear ที่เปลี่ยนแปลงเกมเพลย์แบบเดิมๆ ไปอย่างสิ้นเชิง โดยระบบ Gear มีสองแบบคือ Power Gear เพิ่มพลังอาวุธให้ยิงแรงขึ้น และ Speed Gear ที่เพิ่มความเร็วของตัว Rockman หรือในอีกทางคือผู้เล่นเห็นภาคเคลื่อนไหวช้าลง (เหมือนกับ bullet time ใน Max Payne) ถึงแม้ไม่ใช่ของใหม่ในวงการเกม แต่พอมันเป็นของใหม่ในซีรีส์ Rockman ทำให้วิธีการเล่นเปลี่ยนไปจากเดิมมาก</p>\n\n\n<div>\n<figure><img loading=\"lazy\" width=\"600\" height=\"600\" src=\"https://markpeak.net/wp-content/uploads/2024/02/product_rc11_thumb.jpg\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/product_rc11_thumb.jpg 600w, https://markpeak.net/wp-content/uploads/2024/02/product_rc11_thumb-300x300.jpg 300w, https://markpeak.net/wp-content/uploads/2024/02/product_rc11_thumb-150x150.jpg 150w\" /></figure></div>\n\n\n<p><strong>ชอบ</strong></p>\n\n\n\n<ul>\n<li>กราฟิกยุคโมเดิร์น สมกับการรอคอยการอัพเกรดกราฟิกครั้งใหญ่ นับตั้งแต่ภาค 8 ในปี 1996 ยุค PS1 โน่นเลย</li>\n\n\n\n<li>ระบบ Double Gear ที่ทำให้เกมเพลย์สดใหม่ขึ้นมาก</li>\n\n\n\n<li>บอส 8 ตัวออกแบบมาได้น่าสนใจ ถึงแม้คอนเซปต์ยังเป็นแบบเดิมๆ จำพวกไฟ น้ำแข็ง ไฟฟ้า ระเบิด แต่ก็เห็นความพยายามฉีกให้ไม่ซ้ำกับบอสหุ่นยนต์รุ่นก่อนๆ </li>\n\n\n\n<li>บอสมีท่าอัพเกรด ที่เปลี่ยนวิธีโจมตีให้ยิ่งใหญ่ขึ้น หลากหลายขึ้น กรณีของ Block Man ถือว่าน่าสนใจเพราะมีบอสอีกร่าง ที่มีแถบพลังแยกจากบอสปกติด้วย</li>\n\n\n\n<li>อาวุธจากบอสใช้ประโยชน์ได้จริงจัง ต่างจากหลายๆ ภาคที่อาวุธใช้จริงแทบไม่ได้เลย มีทั้งอาวุธยิงแนวตั้ง (Tundra Man) อาวุธยิงจากด้านบนระยะไกล (Block Man) อาวุธวิ่งตามพื้น (Fuse Man) อาวุธผูกติดกับศัตรู (Blast Man) อาวุธระยะสั้นพุ่งชน (Impact Man) อาวุธยิงเฉียง (Torch Man) อาวุธยิงทั้งฉาก (Bounce Man) มีแค่อาวุธบาเรีย (Acid Man) เท่านั้นที่ไม่ค่อยมีประโยชน์ ซึ่งอาวุธบาเรียก็ไม่มีประโยชน์ในแทบทุกภาคอยู่แล้ว</li>\n\n\n\n<li>ฉากออกแบบได้ดีพอสมควร มีบอสกลางฉากทุกฉาก (บางฉากมี 2 ตัว) และเห็นความพยายามมีไอเดียใหม่ๆ เช่น บอลกระเด้ง กำแพงไฟวิ่งไล่ เพิ่มเข้ามาบ้าง แม้บางอันไม่ค่อยเวิร์ค เช่น บ่อน้ำกรด หรือบางอันก็ซ้ำซาก เช่น บล็อคหายได้ ต้องกระโดดตามจังหวะ ที่มีมาตั้งแต่ Rockman 1</li>\n</ul>\n\n\n<div>\n<figure><img loading=\"lazy\" width=\"640\" height=\"360\" src=\"https://markpeak.net/wp-content/uploads/2024/02/product_rockman11_img01.jpg\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/product_rockman11_img01.jpg 640w, https://markpeak.net/wp-content/uploads/2024/02/product_rockman11_img01-300x169.jpg 300w\" /><figcaption>Block Man แปลงร่าง!</figcaption></figure></div>\n\n\n<p><strong>ไม่ชอบ</strong></p>\n\n\n\n<ul>\n<li>เนื้อเรื่องจืดจางมาก เรียกว่าแทบไม่มีเนื้อเรื่องเลยก็ได้</li>\n\n\n\n<li>คัทซีนก็แย่ บอกได้เลยว่าคัทซีนของภาค 8 ยังทำได้ดีกว่ามาก</li>\n\n\n\n<li>ปราสาทของ Dr. Wily สั้นมาก คือมีบอสเพียง 2 ตัว (แถมหนึ่งในนั้นคือ Yellow Devil รอบที่เท่าไรก็จำไม่ได้แล้ว), แคปซูลบอส 8 ตัว แล้วก็เจอกับ Dr. Wily เลย อะไรคือปราสาทซ้อน 2 ชั้นในยุคภาค 4-5-6 มันจบแล้วครับนาย</li>\n\n\n\n<li>การออกแบบฉากไม่มีส่วนที่เป็น exploration การสำรวจทางลับ ไอเทมลับ ใดๆ หายไปหมด ไม่ต้องหาเพราะไม่มีเลย ไอเทมพิเศษทุกอย่างได้มาจากการซื้อของเท่านั้น ความสนุกในการสำรวจฉากช่วงภาค 6-7-X หายไปเกลี้ยงเช่นกัน อันนี้เลวร้ายมาก (มีคนบ่นเรื่องนี้เยอะ เช่น <a href=\"https://gamefaqs.gamespot.com/boards/228477-mega-man-11/77093871\">GameFaqs</a>, <a href=\"https://stoneagegamer.com/blog/mega-man-11-is-an-odd-game\">StoneAgeGamer</a>)</li>\n\n\n\n<li>ระบบ Double Gear ไม่ค่อยสมดุลนัก เพราะสุดท้ายแล้ว Speed Gear ที่เวิร์คจริง ส่วน Power Gear แทบไม่ได้ใช้ (<a href=\"https://www.reddit.com/r/Megaman/comments/9lef7n/some_design_flaws_in_mega_man_11_gameplay_and/\">มีคนคิดเหมือนกัน</a>)</li>\n\n\n\n<li>ตัวละครในจักรวาล Rockman บางตัวหายไปเลย เช่น Blues/Forte ที่ไม่มีแม้แต่ซีนเดียว หรือบางตัวก็ถูกลดบทบาทมาก เช่น Eddy</li>\n</ul>\n\n\n\n<p>ภาพรวมให้คะแนน 7/10 คือรู้สึกว่าทำมาดีแต่ยังไปไม่สุด ถ้าเพิ่มส่วนของ exploration และเนื้อเรื่องให้จริงจังกว่านี้ ก็ควรจะได้คะแนนสัก 9/10 เลย</p>\n\n\n\n<p><strong>อื่นๆ</strong></p>\n\n\n\n<p>ระหว่างค้นหาข้อมูลมาเขียนบล็อกนี้ เจอคลิปวิเคราะห์การออกแบบฉากของ Rockman 11 รู้สึกน่าประทับใจดีมาก ขอนำมาแปะไว้</p>\n\n\n\n<figure><div>\n\n</div></figure>The post <a href=\"https://markpeak.net/rockman-11/\">Rockman 11</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"b4ae7a801eab71eb69d5e7d90fe8e4428c7167e1a657733fed48a7a912de97b7","category":"Thai"}