{"title":"Drivers of rising monthly water temperature in river estuaries","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12507?af=R","date":1705059257000,"content":"<h2>Abstract</h2>\n<p>River estuaries are habitats for a variety of organisms, including many temperature-sensitive species; water temperatures in estuaries are affected by several factors as they are influenced by both terrestrial and marine environments. Therefore, understanding the factors that influence river estuaries are essential for environmental management. However, no information exists on temperature change at high temporal resolution and over a wide area; moreover, the relationship with environmental factors has not yet been clarified. Here, we have described the actual status of water temperature change in riverine estuaries and its relationship with environmental factors for a wide area of the Japanese archipelago. Our results indicated that 217 of 294 rivers showed a significant monthly increase in water temperature. The average annual change in rates of water temperature increase was the highest in October at 0.090°C yr<sup>−1</sup> and lowest in February at 0.068°C yr<sup>−1</sup>. Furthermore, snowfall, air temperature increase, sea water temperature, and land use were identified as factors increasing the rate of water temperature increase. Factors influencing the increase in river estuarine water temperature varied from month to month—with meteorological factors being the strongest influencers from spring to fall, and anthropogenic factors in winter. Our findings emphasize the importance of considering not only meteorological and oceanographic phenomena, but also anthropogenic influences and topographic features to understand the pattern of water temperature changes in river estuaries.</p>","author":"Rei Itsukushima, \nKazuaki Ohtsuki, \nTatsuro Sato","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"b4b431d2eee39da52b5837cf9e8f8d0a08c0abde1bbf57a6e313a2a545871288","category":"Environment"}