{"title":"Dynamic observation and risk factors analysis of deep vein thrombosis after hip fracture","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304629","date":1717423200000,"content":"<p>by Yuxuan Cong, Baohui Wang, Chen Fei, Hong Zhang, Zhong Li, Yangjun Zhu, Yan Zhuang, Pengfei Wang, Kun Zhang</p>\r\nObjective <p>To dynamically observe the occurrence of deep vein thrombosis (DVT) after a hip fracture and analyze of the risk factors affecting the dynamic alteration of DVT.</p> Methods <p>Data of patients with hip fractures from January 1, 2017 to August 31, 2021 were collected. Patients were divided into DVT and non-DVT groups according to their daily Doppler ultrasonography findings. Survival analysis was used to describe dynamic changes in DVT occurrence with time. Log-rank tests were used to compare the influence of individual factors of patients with DVT occurrence, and a Cox proportional hazards regression model was used to identify the risk factors affecting the dynamic alteration of DVT occurrence.</p> Results <p>A total of 331 patients were included: 148(44.7%) had preoperative DVT, and 143 (96.6%) had DVT in the first 3days after admission. The probability of DVT was 0.42 on Day 1, 0.11 on Day 2, 0.10 on Day 3, 0.08 on Day 4, 0.20 on Day 5, and 0.00 on Day 6–7, with a median survival time of 3.30 d. Age&gt;70 years, intertrochanteric fracture, admission hemoglobin&lt;130g/L, and admission hematocrit&lt;40% had a significantly higher occurrence rate of DVT. A hematocrit level of &lt;40% (Hazard Ratio 2.079, 95% Confidence Interval:1.148–3.764, P = 0.016) was an independent risk factor for DVT.</p> Conclusion <p>DVT after hip fractures mainly occurred in the first three days after admission, the trend was stabilized within one week, and day 1 had the highest rate of DVT incidence. Age, fracture type, HGB level, and Hct level affected dynamic occurrence of DVT. At constant other factors, Hct&lt;40% was 2.079-fold incidence in the risk of preoperative DVT formation than those with Hct≥40% after hip fracture.</p>","author":"Yuxuan Cong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b4b59b6e9fff23598e2ae05e5ac53e4db9343aab37073a1309e80efb6bd66b80","category":"Interdisciplinary"}