{"title":"Consensus QTL map deciphered genes and pathways regulating tolerance to post‐flowering diseases in maize","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12937?af=R","date":1727190868000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/626523b7-6a42-44d5-abc3-16627cfe41bb/aab12937-toc-0001-m.png\" alt=\"Consensus QTL map deciphered genes and pathways regulating tolerance to post-flowering diseases in maize\" />\n<p>The QTL associated with different post-flowering diseases (PFD) reported from independent studies were utilised in the identification of consensus quantitative trait loci (QTL). The consensus meta-QTL (MQTL) which is stable and has the potential to render broad-spectrum resistance against one or more PFD was targeted in our study. Understanding the interaction of genes involved in plant defence-related pathways will facilitate breeding maize for broad-spectrum resistance against PFD. We have identified putative candidate genes conferring tolerance to single or multiple PFD that have practical implications. Further, we have verified the candidate genes identified within the consensus QTL with the reported studies and their in silico expression. Thus, verified consensus, or MQTL with a narrow confidence interval, has been proposed for deployment in practical maize improvement programmes.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Post-flowering diseases (PFDs), such as ear rot, stalk rot and smut, affect maize yield and quality by damaging the reproductive organs, stalks and seeds. We hypothesized that quantitative trait loci (QTL) associated with different PFDs colocalize and share similar defence mechanisms. Hence, to find a stable consensus meta-QTL (MQTL) for single or multiple PFDs, MQTL analysis was performed. QTL conferring resistance to PFD reported in 31 independent studies were collated to develop a consensus map. As many as 49 MQTL conferring PFD resistance were projected using appropriate algorithms. Most MQTL regions encompass genes encoding a wide range of defence-related proteins. MQTL1.1 and MQTL10.5 included QTL/genes for resistance to all PFDs, which supported our hypothesis. Candidate genes for PFDs in MQTL7.1 were associated with pathogenesis-related 1 protein and mitogen-activated protein kinase (MAPK) signalling. MQTL5.2 encompassed chalcone flavanone isomerase and cinnamoyl coenzyme A (CoA) reductase genes involved in flavonoid and phenylpropanoid biosynthesis, respectively. Furthermore, MQTL10.4 was found to harbour genes encoding E3 ubiquitin ligase, WRKY-TF11, calcium-binding domains and zinc finger motifs. Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis reiterated the role of genes within MQTL7.1 in the MAPK signalling pathway, phytohormone signal transduction and plant–pathogen interaction. Hence, we propose that these genes are potential candidates for PFD resistance. Furthermore, 75% of the genes within the MQTL showed orthology with sorghum and rice, indicating that these genes were conserved across species. The role of 27 MQTL, including the six most significant MQTL, was confirmed with reported genome-wide association study (GWAS) results. Thus, the hotspots associated with PFDs identified in our study could be reliably used in marker-assisted breeding for PFD resistance.</p>","author":"Nagenahalli Chandrappa Sunitha, \nSampangi Ramesh, \nHirenalluru Chandappa Lohithaswa, \nSelvaraj Sabarinathan, \nChandrappa Anilkumar","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"b4c09a99170195899c98e9658dde0e29f1ff1764b6fdf558951e5e51e3e3e267","category":"Environment"}