{"title":"Influence of agricultural intensification on pollinator pesticide exposure, food acquisition and diversity","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14701?af=R","date":1723007870000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3acfbef1-0c2c-4378-b73c-b5d687f807d1/jpe14701-toc-0001-m.png\" alt=\"Influence of agricultural intensification on pollinator pesticide exposure, food acquisition and diversity\" />\n<p>Our results suggest that pollinator communities could be at an increased risk of pesticide exposure due to intensified agriculture, while the negative impact on pollinator diversity mainly results from the loss of habitat and/or reduced food sources. This study highlights the importance of conserving semi-natural habitat to mitigate the causes of decline in pollinator diversity. We also recommend long-term, multi-year studies to further understand the mechanisms behind the loss of pollinators in farming landscapes.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPollinators are essential for maintaining sustainable crop production, while the decline of pollinators is a widespread concern. Agricultural intensification is one of the primary drivers of the decline of insect pollinators. Agricultural intensification usually involves a decreasing of non-crop semi-natural habitat and an increasing of pesticide exposure for pollinators. However, causal links between agricultural intensification, increased pesticide exposure, and reduced pollinator's food sources and pollinator diversity remain underexplored.\n\nWe assessed pollinator diversity across a landscape gradient where the proportion of rice ranged from 11% to 85% in South China. We placed honeybee (<i>Apis mellifera</i>) and mason bee (<i>Osmia excavata</i>) in these landscapes and investigated pesticide exposure in honeybee foragers and pollen, and in mason bee pollen and nesting materials. We also assessed the acquisition of food by mason bees.\n\nWe found a higher frequency of pesticide detection in honeybee foragers and honeybee pollen samples in areas with a higher proportion of rice fields. There was a strong positive relationship between mason bee food acquisition and the proportion of semi-natural habitats, while no significant effects of pesticide exposure on pollinator diversity were found in addition to the effect of semi-natural habitat.\n\n<i>Synthesis and applications</i>: Our results suggest that pollinator communities could be at an increased risk of pesticide exposure due to intensified agriculture, while the negative impact on pollinator diversity mainly results from the loss of habitat and/or reduced food sources. This study highlights the importance of conserving semi-natural habitat to mitigate the causes of decline in pollinator diversity. We also recommend long-term, multi-year studies to further understand the mechanisms behind the loss of pollinators in farming landscapes.\n</p>\n<h2>摘要</h2>\n<p>\n\n传粉昆虫对于维持作物可持续生产至关重要，而传粉昆虫的减少是全球广泛关注的问题。 农业集约化是传粉昆虫减少的主要驱动因素之一。 农业集约化常导致传粉昆虫的非作物(半自然)生境的减少与农药暴露的风险增加。然而，农业集约化、农药暴露风险增加、食物资源降低和传粉昆虫多样性之间的因果关联仍未得到系统解析。\n\n我们评估了中国南方稻区水稻种植面积比例为 11% ~ 85% 景观梯度样地的传粉昆虫多样性。 我们将西方蜜蜂 (<i>Apis mellifera</i>) 和凹唇壁蜂 (<i>Osmia excavata</i>) 引入放置在各梯度景观样地中，并检测了西方蜜蜂及其采集花粉、凹唇壁蜂采集的花粉团及其筑巢材料中的农药残留水平。另外，我们还评估了凹唇壁蜂的食物获取情况。\n\n研究发现，在水稻田占比较高的景观内，西方蜜蜂及其采集花粉样本中农药检出的频率较高。凹唇壁蜂食物获取与半自然生境的比例正著正相关。除了半自然生境的影响外，未发现农药暴露对传粉昆虫多样性的显著影响。\n\n总结和应用:我们的研究结果表明，随着农业集约化提升，传粉昆虫种群面临农药暴露的风险增加。对传粉昆虫多样性的负面影响主要原因仍然是农业集约化导致栖息地丧失和/或食物源的减少。本研究突显保护半自然生境对于减轻传粉昆虫多样性下降的重要性。我们还建议需要进行长期的定位研究，以进一步了解农田景观水平传粉昆虫种群衰减背后的机制。\n</p>","author":"Xiaoyu Shi, \nChangsheng Ma, \nJoop de Kraker, \nShanxing Gong, \nJenny A. Hodgson, \nShudong Luo, \nJozef J. M. van der Steen, \nHaijun Xiao, \nFang Wang, \nXiaowei Tie, \nZheng Chen, \nYi Zou","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"b4c23b7c75a64da85ea799506ebbe84ed881d07be74459171180bc4c8ce7d0ba","category":"Environment"}