{"title":"Growth Performance and Nutritional Condition of Marble Goby (Oxyeleotris marmoratus) Larvae Fed under Different Onsets of First Feeding","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3948836?af=R","date":1680073200000,"content":"<p>The marble goby (<i>Oxyeleotris marmoratus</i>) is a valuable food fish, but its aquaculture production is often hampered by poor growth performance associated with starvation at an early stage. The objective of this study was to investigate the effects of delayed initial feeding on the growth performance and nutritional condition of the marble goby. Six different first feeding times were examined: 0, 12, 24, 36, 48, and 60 hours after the first feeding (HAFF), and their impacts on growth performances were evaluated based on larval final total length (mm) and survival (%), while nutritional condition was evaluated based on body morphometric changes, gut epithelium height (<i>μ</i>m), and gut condition. The experiment was conducted for 15 days. All parameters were measured after larvae were collected at different sampling times, except survival and growth, which were measured at the end of the experiment. The results showed that the onset of the first feeding was 36 h after hatching (hAh) and that a short delay in the first feeding by 12, 24, 36, 48, and 60 HAFF significantly reduced the growth performance of the larvae and severely affected the larval nutrition condition with noticeable shrinkage in body morphometry and gut epithelium height. This study concluded that the onset of first feeding in marble goby occurs at 36 hAH and that first feeding beyond 36 hAH significantly worsens the nutritional condition and growth performance of the larvae.</p>","author":"Siti Fairus Mohamed Yusoff, \nFui Fui Ching, \nGunzo Kawamura, \nShigeharu Senoo, \nJianguang Qin","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"b4c429642c6078d2f1c701dceda9e2ee980189802a83b65e411f15471bc0676f","category":"Environment"}