{"title":"Cloudflare เปิดซอร์ส Pingora เฟรมเวิร์คภาษา Rust, เตรียมสร้าง reverse proxy ที่ดีกว่า NGINX","link":"https://www.blognone.com/node/138451","date":1709138461000,"content":"<div><div><div><p>Cloudflare เปิดซอร์สโครงการ Pingora เฟรมเวิร์คที่บริษัท<a href=\"https://www.blognone.com/node/130408\">นำมาพัฒนาเว็บเซิร์ฟเวอร์ทดแทน NGINX มาตั้งแต่ปี 2022</a> แต่ตัวโครงการไม่ใช่เว็บเซิร์ฟเวอร์สำเร็จรูปแต่อย่างใด แต่เป็นเฟรมเวิร์คที่ต้องเขียนโค้ดเองเพื่อใช้งาน</p>\n<p>ส่วนประกอบภายในของ Pingora มีไว้สำหรับรองรับโปรโตคอล HTTP/1, HTTP/2, TLS, TCP/UDP, gRPC, WebSocket โดยมีแผนรองรับ HTTP/3 รองรับการทำ filter แบบเดียวกับ NGINX ที่ใช้โค้ด Lua ใน OpenResty รองรับการรีสตาร์ตโดยไม่ตัดการเชื่อมต่อเลยแม้แต่อันเดียว และยังสามารถส่งข้อมูลไปยังเครื่องมือตรวจสอบทั้งหลาย เช่น syslog, Prometheus, Sentry, OpenTelemetry</p>\n<p>แม้ Cloudflare จะใช้ Pingora นับปีแล้วแต่ Cloudflare ก็เตือนว่า API ยังไม่เสถียรจนกว่าจะออกเวอร์ชั่น 1.0 และไม่มีแผนการรองรับระบบปฎิบัติการอื่นๆ นอกจากกลุ่ม Unix</p>\n<p>การเปิด Pingora ออกมาครั้งนี้ได้รับความร่วมมือกับโครงการ Prossimo ของ ISRG ผู้ให้บริการ Let's Encrypt เตรียมสร้างโครงการ River พรอกซี่แบบพร้อมใช้ที่สร้างจาก Pingora คาดว่าจะมีประสิทธิภาพดีกว่า NGINX เสียอีก, รองรับการเขียนสคริปต์ในภาษาอะไรก็ได้โดยอาศัย WASM</p>\n<p>River ได้รับความร่วมมือจาก Cloudflare, Shopify, Chainguard ด้วย คาดว่าจะเริ่มพัฒนาจริงในไตรมาสที่สองของปี 2024 นี้</p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/pingora-open-source\">Cloudflare</a>, <a href=\"https://www.memorysafety.org/blog/introducing-river/\">Prossimo</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fa3452ff441f5882f0643ca5fd805923.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div><div><a href=\"/topics/rust\">Rust</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b4c5e78f37ed3a215cd3612ec6f98a943f281b22fe8df099a62d5cff33e67e16","category":"Thai"}