{"title":"OpenAI เปิดตัว GPT-4 ฉลาดกว่า ChatGPT เข้าใจรูปภาพได้ ทำข้อสอบระดับสูงได้หลายวิชา","link":"https://www.blognone.com/node/133009","date":1678816041000,"content":"<div><div><div><p>OpenAI เปิดตัวปัญญาประดิษฐ์ GPT-4 โดยไม่เปิดเผยสถาปัตยกรรมภายใน เช่น โครงสร้างหรือจำนวนพารามิเตอร์ที่ใช้งาน แต่ออกรายงานถึงความฉลาดและความสามารถในการควบคุมให้ปัญญาประดิษฐ์พูดเฉพาะเรื่องที่กำหนดได้</p>\n<p>จุดสำคัญที่สุดของ GPT-4 คือมันสามารถทำข้อสอบระดับสูง เช่น AP, SAT, GRE ได้คะแนนดีมากขึ้นกว่า GPT-3.5 ในหลายวิชา โดยเฉพาะวิชาด้านคำนวณ หรือการเขียนโปรแกรมที่ทำ Leetcode ระดับ Hard ได้ 3 ข้อจาก 45 ข้อแล้ว ในแง่ของอินพุต GPT-4 รองรับภาพพร้อมๆ กับข้อความทำให้สามารถบรรยายภาพ หรือถามคำถามเกี่ยวกับภาพได้</p>\n<p>สำหรับคำถามที่พยายามล่อหลอกให้ GPT ตอบข้อมูลที่ถูกห้ามไว้ (adversarial question) นั้น GPT-4 ยังหลบเลี่ยงได้ไม่สมบูรณ์แต่ก็ดีขึ้นกว่า GPT-3.5 หรือ ChatGPT อย่างชัดเจน เนื่องจากระหว่างการฝึกเพิ่มเติมด้วยมนุษย์ (RLHF training) นั้นมีการฝึกคำถามที่พยายามหลอกล่อเหล่านี้เอาไว้ด้วย ทำให้การตอบคำถามนอกเรื่องที่กำหนดลดลงถึง 82%</p>\n<p>แม้จะไม่บอกความใหญ่ของโมเดลเต็ม แต่ GPT-4 จะรองรับอินพุตใหญ่ขึ้นเป็น 8,192 โทเค็น และมี API พิเศษสำหรับ context ขนาด 32,768 token แต่จำกัดผู้ใช้งาน ตอนนี้ราคาค่าใช้งานอยู่ที่ 0.03 ดอลลาร์ต่อ 1,000 โทเค็นสำหรับอินพุตและ 0.06 ดอลลาร์ต่อ 1,000 โทเค็นสำหรับเอาท์พุต ส่วนรุ่น 32K นั้นราคาเพิ่มเท่าตัว ผู้สนใจใช้งานต้องรอิวเข้าใช้เท่านั้น ส่วนผู้ใช้ส่วนบุคคลที่สมัคร ChatGPT Plus จะสามารถใช้งานได้แบบจำกัดปริมาณ โดยอนาคตอาจจะเปิดให้ผู้ใช้ฟรีใช้ได้ด้วย</p>\n<p>ตอนนี้มีบริษัทใช้งาน GPT-4 แล้วหลายบริษัท เช่น Duolingo เปิด Duolingo Max สำหรับคุยกับบอทในภาษาที่กำลังเรียนได้ โดยเปิดใช้งานในภาษาฝรั่งเศสและสเปน ขณะที่ Stripe ใช้อธิบายคู่มือการใช้งาน API และใช้ตรวจสอบการฉ้อโกง</p>\n<p>ที่มา - <a href=\"https://openai.com/product/gpt-4\">OpenAI</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ceb7d6f729c8f861da58158825e0494c.png\" /></p>\n<p>Duolingo Max ฝึกภาษาแบบโต้ตอบแชต GPT-4</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b4cff9e3ae0e188b9e96285c045a9383ed8f70593c1cfd1e343d567a38b9e21e","category":"Thai"}