{"title":"BIM-Based Risk Management to Optimal Performance in Construction Projects","link":"https://www.preprints.org/manuscript/202410.1783/v1","date":1729675376000,"content":"This study explores integrating Building Information Modeling (BIM) technology into risk management practices for construction projects, aiming to enhance project performance through improved risk identification, assessment, and mitigation. The research employs the Analytical Hierarchy Process (AHP) to prioritize BIM-based strategies across multiple risk management dimensions, including technical, financial, sustainability, and time management. The findings demonstrate that BIM-financial strategies rank most among BIM-driven risk management, followed by sustainability and time. In contrast, Technical, Operation, and maintenance capabilities have the lowest rank. Given the high priority of BIM financial strategies, it has been applied to conduct sensitivity analysis; the sensitivity analysis results demonstrate the dynamic nature of BIM sub-criteria strategy in response to changes in the weight of financial considerations. As financial concerns diminish, the shift towards sustainability, health, safety, and time efficiency underscores the importance of a more balanced approach in BIM strategy prioritization. BIM- risk management improves project outcomes by enabling real-time data-driven decision-making, enhancing stakeholder collaboration, and optimizing resource use, cost control, and sustainability. This research contributes to theoretical and practical advancements in construction risk management, suggesting that BIM can be a transformative tool for optimizing project performance while addressing the complexities and uncertainties inherent in the construction industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b4da10019480ed680ea9f13d774c0d363fbfd616b10c6f339ff46c89dc277eb8","category":"Interdisciplinary"}