{"title":"Announcing the Linux package archive site","link":"https://www.hashicorp.com/blog/announcing-the-linux-package-archive-site","date":1697472000000,"content":"<p>On January 10th, 2024, HashiCorp will no longer support versions of Linux operating systems that have reached end-of-life (EoL) status. We will move these packages to the new <a href=\"https://archive.releases.hashicorp.com/\">archive site</a> where users can continue to download them. </p>\n\n<p>Note that package managers will no longer be able to download packages for these versions. To help you update existing systems to minimize impact when we stop publishing versions that have reached EoL, please see the list of impacted versions below: </p>\n\n<ul>\n<li><strong>Fedora:</strong> 29, 30, 31, 32, 33, 34, 35, 36, and 37<em>, _(</em>Fedora 37 will reach EoL status November 2023)_</li>\n<li><strong>Ubuntu:</strong> Eoan, Hirsute, Impish, Groovy, and Kinetic</li>\n<li><strong>Debian:</strong> Jessie and Stretch</li>\n</ul>\n\n<h2>Special case: RHEL</h2>\n\n<p>Systems will need to be updated to use the major versions of Red Hat Enterprise Linux (RHEL) (7, 8, and 9) see our <a href=\"https://www.hashicorp.com/official-packaging-guide\">Official Packaging Guide</a> for the appropriate <code>hashicorp.repo</code> configuration. While they are not EoL versions, as part of this effort we are also removing the minor version aliases of RHEL, which include: </p>\n\n<ul>\n<li>7Server, 7Workstation, 7.7, 7.8, 7.9, 8.1, 8.2, and 8.3</li>\n</ul>\n\n<h2>Archival site</h2>\n\n<p>We have migrated our EoL and RHEL minor distributions to the <a href=\"https://archive.releases.hashicorp.com\">archive site</a> and users can download the packages from there instead of releases.hashicorp.com. HashiCorp will no longer be responsible for maintaining the EoL/RHEL minor packages on the archive site. Use these packages at your own risk. We highly recommend users migrate to an OS version that is currently supported by package maintainers.  </p>\n\n<h2>FAQ</h2>\n\n<p>To make these changes as clear as possible, we have created a short FAQ list below:</p>\n\n<p><strong>Q: What changes must practitioners make to continue using Linux packages from HashiCorp?</strong></p>\n\n<p><strong>A:</strong> Anyone using EoL distributions will need to upgrade their OS (and existing systems) to continue having package manager support.</p>\n\n<p>Anyone currently changing their repo configs to reference RHEL minor versions will need to revert to major versions. This applies only to HashiCorp repositories, users can continue targeting minor versions for other repos if that suits them.</p>\n\n<p>If users want to use any EoL or RHEL minor distributions, they will need to pull from the archive site instead of the production sites (<code>[apt|rpm].releases.hashicorp.com</code>). However, we highly encourage users to migrate and use current versions. HashiCorp will not offer official support or publish any updates to fix issues with EoL packages on the archive site. </p>\n\n<p><strong>Q: If a user is running on supported versions of HashiCorp products but on an EoL OS, what is the workaround?</strong></p>\n\n<p><strong>A:</strong> Users can install via .zip instead of Linux packages or download the packages manually from <a href=\"https://archive.releases.hashicorp.com/\">https://archive.releases.hashicorp.com/</a> and create their own local repo (users can generate their own metadata, allowing their hosts to then use the local repo via package managers).</p>\n\n<p><strong>Q: Will moving EoL versions to the archive site become a regular thing?</strong></p>\n\n<p><strong>A:</strong> Yes. This process will become a regular occurance when a distribution version reaches end-of-life status. We will follow the EoL cycles that distribution maintainers have set up for their distributions.</p>\n\n<p>If you have concerns or questions, please create a post on <a href=\"https://discuss.hashicorp.com/\">HashiCorp Discuss</a>.</p>\n","author":"Claire Labry","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b4ddcfd7d4128777f6a17dbb9ae2942fba94843825ac37e3eb1eb01abf0542ef","category":"Tech"}