{"title":"Cardio-Oncology: Cardiac Toxicity, Cardiovascular Hypersensitivity and Kounis Syndrome","link":"https://www.preprints.org/manuscript/202403.0690/v1","date":1710235448000,"content":"The most frequent cause of cardiac failure globally is ischemic heart disease, with chemothera-py-related cardiovascular side effects emerging as the second most frequent cause. Cancer therapy can result in acute cardiac events, such as coronary artery spasm, acute myocardial infarction, thromboembolism, myocarditis, bradycardia, tachyarrhythmias, atrio-ventricular blocks, QT pro-longation, torsades de pointes, pericardial effusion and hypotension, as well as chronic conditions, such as hypertension, systolic and diastolic left ventricular dysfunction presenting clinically as heart failure or cardiomyopathy. In cardio-oncology, when referring to cardiac toxicity and cardiovas-cular hypersensitivity, there is a great deal of misunderstanding. When a dose-related cardiovas-cular side effect continues even after the causative medication is stopped, it is referred to as cardi-otoxicity. A fibrotic response is the ultimate outcome of cardiac toxicity, which is defined as a dose-related cardiovascular adverse impact that lasts even after the causative treatment is stopped. Cardiotoxicity can occur after a single or brief exposure. On the other hand, the term cardiac or cardiovascular hypersensitivity describes an inflammatory reaction that is not dose-dependent, can occur at any point during therapy, even with very low medication dosages, and can show up as Kounis syndrome. It may also be accompanied by anti-drug antibodies and tryptase levels. In this comprehensive review, we present the current views on cardiac toxicity and cardiovascular hypersensitivity, together with the reviewed cardiac literature on the chemotherapeutic agents inducing hypersensitivity reactions. Cardiac hypersensitivity seems to be the pathophysiologic basis of coronary artery spasm, acute coronary syndromes such as Kounis syndrome and myocardi-tis caused by cancer therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b4e24ddc3159f2b42c873840689e7f6eddda081362d6480ef86d79a6a88cbba5","category":"Interdisciplinary"}