{"title":"Knockout of the orphan membrane transporter <i>Slc22a23</i> leads to a lean and hyperactive phenotype with a small hippocampal volume","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309461","date":1724853600000,"content":"<p>by Yasuhiro Uchimura, Kodai Hino, Kosuke Hattori, Yoshinori Kubo, Airi Owada, Tomoko Kimura, Lucia Sugawara, Shinji Kume, Jean-Pierre Bellier, Daijiro Yanagisawa, Akihiko Shiino, Takahisa Nakayama, Yataro Daigo, Tomoji Mashimo, Jun Udagawa</p>\r\n\r\nEpidemiological studies suggest that poor nutrition during pregnancy predisposes offspring to the development of lifestyle-related noncommunicable diseases and psychiatric disorders later in life. However, the molecular mechanisms underlying this predisposition are not well understood. In our previous study, using rats as model animals, we showed that behavioral impairments are induced by prenatal undernutrition. In this study, we identified solute carrier 22 family member 23 (<i>Slc22a23</i>) as a gene that is irreversibly upregulated in the rat brain by undernutrition during fetal development. Because the substrate of the SLC22A23 transporter has not yet been identified and the biological role of the <i>Slc22a23</i> gene <i>in vivo</i> is not fully understood, we generated pan-<i>Slc22a23</i> knockout rats and examined their phenotype in detail. The <i>Slc22a23</i> knockout rats showed a lean phenotype, an increase in spontaneous locomotion, and improved endurance, indicating that they are not overweight and are even healthier in an <i>ad libitum</i> feeding environment. However, the knockout rats had reduced hippocampal volume, and the behavioral analysis suggested that they may have impaired cognitive function regarding novel objects.","author":"Yasuhiro Uchimura","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b4e3bddc3cbef45f607632283ff41a36be538cc63ba5270331e6aaaf364b315a","category":"Interdisciplinary"}