{"title":"Android 4.4 KitKat is truly dead, loses Play Services support","link":"https://arstechnica.com/?p=1956401","date":1690303615000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2013/09/Android-KitKat-640x426.jpg\" alt=\"Android 4.4 KitKat is truly dead, loses Play Services support\" />\n      <p>(credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Android ecosystem rightfully gets a lot of slack for being unable to deliver operating system updates to everyone in a timely manner, but there's more to Android updates than just OS support. App updates can keep a phone chugging along even after the updates have stopped, and Google's do-it-all super app, Google Play Services, contains a ton of app APIs and features and enables the really important stuff like Play Store transactions and advertisements.</p>\n<p>Google just announced Play Services is dropping support for an old version of Android, and while OS development might stop at just three or four years, Play Services goes back way longer than that. Google <a href=\"https://android-developers.googleblog.com/2023/07/google-play-services-discontinuing-updates-for-kitkat.html\">announced</a> Play Services is dropping support for Android 4.4 KitKat, which is now 10 years old. Support isn't really being artificially cut off, either. Google says KitKat's active device count is \"below 1 percent,\" so there's not much reason to support it anymore.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/studio64_L9Nw6w4ygg.png\"><img alt=\"Google's Android Platform chart has KitKat at 0.5 percent. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/studio64_L9Nw6w4ygg-980x671.png\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/studio64_L9Nw6w4ygg.png\">Google's Android Platform chart has KitKat at 0.5 percent. </a> (credit: Google)</p></div>\n<p>These devices will stop getting Play Services updates after July, and then it's anyone's guess as to how much longer they will work. At some point, Google will change something, and your device will become a brick. Old, unsupported Android devices <a href=\"https://arstechnica.com/gadgets/2021/08/google-will-kill-off-very-old-versions-of-android-next-month/\">can't log in</a> to a Google account, which is a prerequisite for opening half of the apps that come with your phone. You'll be locked out of the Play Store, Gmail, Google Maps, and other Google products, with no way to see these old versions again. Luckily, <em>someone</em> saw all this coming and <a href=\"https://arstechnica.com/gadgets/2016/10/building-android-a-40000-word-history-of-googles-mobile-os/\">took screenshots</a> of every old version.</p></div><p><a href=\"https://arstechnica.com/?p=1956401#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956401&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b4e366d8c214f8f94c813a48f680b4d987984417d0044f4a413ca68265a97f5f","category":"Tech"}