{"title":"Formation of environmentally persistent free radicals and their risks for human health: a review","link":"http://link.springer.com/10.1007/s10311-024-01701-x","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Environmentally persistent free radicals are long-lived pollutants that maintain stability in air, soil, and water. They contribute to the production of reactive oxygen species in environmental media, leading to oxidative stress in biological organisms. This stress can provoke inflammation and damage to biological macromolecules, potentially resulting in cardiopulmonary dysfunction.  In this review, we discuss the formation and classification of EPFRs. Typically, EPFRs form through electron transfer from organic compounds to transition metals during thermal processes. In metal-free environments, however, organic compounds can undergo bond cleavage, generating EPFRs under thermal conditions and light exposure. EPFRs are generally categorized into three types: oxygen-centered, carbon-centered, and those containing heteroatoms centered on either oxygen or carbon. We also provide a detailed summary of the fundamental characteristics of EPFRs in different environments such as air, soil, and water. Given their role as electron donors, EPFRs have potential applications in degrading organic pollutants in the environment. The review comprehensively addresses the deleterious impacts of EPFRs on organism health, highlighting risks to metabolic functions and cardiopulmonary health. Furthermore, it underscores the potential involvement of EPFRs as electron donors in atmospheric chemical reactions. The pivotal role of EPFRs in environmental pollutant transformation warrants more studies in future research endeavors.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"b4e63be4a269998700101937398b669f1b9d303c73d19a3dca5fc92bf9222f81","category":"Environment"}