{"title":"Scientists induced hallucinations in mice to learn more about human psychosis","link":"https://arstechnica.com/?p=1762625","date":1622070157000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/micehallucinateTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/micehallucinateTOP.jpg\">Enlarge</a> <span>/</span> A computer game that induces mice to experience hallucination-like events could be a key to understanding the neurobiological roots of psychosis, according to a study from Washington University School of Medicine in St. Louis. (credit: J. Kuhl)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>People suffering from psychotic episodes often experience both visual and aural hallucinations, due in part to the neurochemical dopamine; antipsychotics block dopamine receptors in the brain. But little is known about precisely how brain circuits change in response to elevated dopamine levels. The humble mouse might be able to help. An increase in dopamine in the brain can trigger auditory hallucinations in mice, according to <a href=\"https://science.sciencemag.org/cgi/doi/10.1126/science.abf4740\">a recent paper</a> published in the journal Science—a surprising link between how human and mouse minds malfunction.</p>\n<p>While the very notion of hallucinating mice might strike some as amusing, co-author Adam Kepecs of the Washington University School of Medicine in St. Louis emphasizes that it is not a joke and that mouse studies really can shed light on human psychosis. \"It's so easy to accept the argument that psychosis is a fundamentally human thing and say, 'Forget about mice',\" <a href=\"https://www.eurekalert.org/pub_releases/2021-04/wuso-mwh033021.php\">he said</a>. \"But right now, the prognosis for psychotic patients has not substantially improved over the past decades, and that's because we don't really understand the neurobiology of the disease.\"</p>\n<p>Kepecs' lab has focused largely on developing a more complete understanding of confidence in rats by studying their neurocircuitry, with a long-term goal of shedding light on self-reported confidence in humans. Lead author Katharina Schmack is a psychiatrist at Cold Spring Harbor Laboratory in New York who studies psychosis and schizophrenia. They saw an opportunity for an interdisciplinary study of psychotic disorders in animals.</p></div><p><a href=\"https://arstechnica.com/?p=1762625#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762625&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b4f0ceb7a66db4a91a6d7cf7f51d3c089102cbed1ea95e0696cb25215466ba32","category":"Tech"}