{"title":"Breaking Water Laws in the Murray‐Darling Basin: Understanding Water Compliance Challenges and Stakeholder Perceptions","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035635?af=R","date":1728928217000,"content":"<h2>Abstract</h2>\n<p>Climate change will put pressure on irrigated agriculture, increasing water scarcity and possible non-compliance with water regulations. This is especially true in areas such as the Murray-Darling Basin (MDB), Australia, an area where water resources have been overallocated. Understanding the expected penalties and probability of detection and prosecution of water theft faced by irrigators is important for understanding the incentives for water compliance. We analyze state-level compliance action data and undertake a detailed case study of estimating the real penalty value of water theft in New South Wales (NSW), the largest MDB state. This analysis is supplemented with qualitative comment on compliance issues from 63 MDB stakeholder interviews. Although findings from random audits suggest that only a small percentage of irrigators commit water theft offenses, the average probabilities of audit detection and prosecution for water theft in NSW between 2018/19 and 2020/21 were low, leading to an average <i>real</i> expected penalty value of stealing water well below existing market prices. Stakeholder interviews confirmed that the majority did not believe there were serious water theft or water compliance challenges—whereas recent secondary survey data suggests that the general public perceives water theft and compliance as a serious and ongoing challenge in the MDB and more needs to be done to address it. Three recommendations for data and policy reform are proposed, namely: (a) improving compliance data and reporting; (b) increasing the probability of detection and prosecution; and (c) increasing penalties, regulator visibility, and reforming legislation. Results illustrate that even countries with highly advanced water governance require data improvements, along with sufficient levels of compliance activities and penalties for effective deterrence and stakeholder confidence.</p>","author":"Constantin Seidl, \nSarah Ann Wheeler","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"b4f233bc183aca33e94ffba9f379782960054e5cc5fb1fe5e6da1efdccf1bce3","category":"Environment"}