{"title":"There’s hope yet for the 2022 Tour Down Under","link":"https://cyclingtips.com/2021/10/theres-hope-yet-for-the-2022-tour-down-under/","date":1635588130000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/CORVOS_00031943-198-650x433.jpg\" /></div><h2>There’s hope yet for the 2022 Tour Down Under</h2><p>\n</p><p>The 2022 Tour Down Under was only cancelled a month ago, but hope has been renewed after the state government announced its roadmap for easing COVID-19 restrictions.</p>\n\n\n\n<p>Australia’s premier WorldTour stage race, traditionally the overture that opens the pro season, was expected to make its triumphant return after the 2021 edition was swallowed by the coronavirus, but with the world still in the grip of the pandemic, <a href=\"https://cyclingtips.com/2021/09/tour-down-under-and-cadels-road-race-scrapped-for-2022/\">the 2022 Tour Down Under went the same way in September.</a> For the second year running, it would be replaced by a scaled-back Santos Festival of Cycling.</p>\n\n\n\n<p>Then last week, the government announced that South Australia’s borders would reopen and restrictions begin to ease from November 23rd. This comes with news that quarantine rules would be scrapped for international visitors when the destination reaches 90% vaccination. This is expected to happen before Christmas, around a month before the Tour Down Under is typically held. </p>\n\n\n\n<p>Don’t get too excited though. While the window is open, it’s still small.</p>\n\n\n\n<p>“To be clear, while we will consider our position further, including consulting key stakeholders, it is unlikely it will be possible to hold the Santos Tour Down Under in 2022 given the short time frames for all involved,” <a href=\"https://www.adelaidenow.com.au/news/south-australia/tour-down-under-organisers-considering-reviving-the-scrapped-2022-event/news-story/f7d8efc417c92fa1fe51ae19c213386d\">said Hitaf Rasheed</a>, executive director of events for South Australian Tourism Commission.</p>\n\n\n\n<p>The Tour Down Under organisers (who are yet to comment) have been thrown a bone, albeit a very little one.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/theres-hope-yet-for-the-2022-tour-down-under/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b4f663d928fbe708bad42585104e59c6bc054111244afcb7a4821fcf4ae21de7","category":"Cycling"}