{"title":"Apple won’t need to open iMessage to Android after all","link":"https://www.macworld.com/article/2235265/apple-wont-need-to-open-imessage-to-android-after-all.html","date":1707845377000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Good news for Apple: the European Commission (via <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2024-02-13/apple-imessage-microsoft-bing-dodge-eu-s-big-tech-crackdown&amp;xcust=1-1-2235265-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Bloomberg</a>) has concluded a five-month investigation into iMessage, together with Microsoft’s Bing, Edge, and Microsoft Advertising, and concluded that the four do not qualify as gatekeeper services under the Digital Markets Act (DMA). This means they will not face potentially disastrous regulatory sanctions.</p>\n\n\n\n<p>“Following a thorough assessment of all arguments, taking into account input by relevant stakeholders, and after hearing the Digital Markets Advisory Committee, the Commission found that iMessage, Bing, Edge and Microsoft Advertising do not qualify as gatekeeper services,” said the Commission in a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://ec.europa.eu/commission/presscorner/detail/en/mex_24_785&amp;xcust=1-1-2235265-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">press release</a> on February 13.</p>\n\n\n\n<p>“The Commission will continue to monitor the developments on the market with respect to these services, should any substantial changes arise. The decisions do not affect in any way the designation of Apple and Microsoft as gatekeepers on 5 September 2023 as regards their other core platform services.”</p>\n\n\n\n<p>Apple and Microsoft, predictably, have both issued statements welcoming the decision.</p>\n\n\n\n<p>Among other sanctions there had been a possibility, until today’s ruling, that Apple would be forced to <a href=\"https://www.macworld.com/article/626377/new-eu-rules-could-force-apple-to-open-imessage.html\">make iMessage interoperable</a> with other messaging platforms under the terms of the DMA. This would be a huge blow, since iMessage’s “blue-bubble FOMO” has been called a powerful selling point for the iPhone in the U.S. (Outside the U.S., the prevalence of other messaging services like WeChat and WhatsApp make this less of an issue.) Apple seemingly doesn’t want iMessage to play nicely with Android, since a sub-par experience in group chats, a sense of being in some way a second-class digital citizen, is a constant incentive to switch to iOS.</p>\n\n\n\n<p>Mind you, this may be something of a moot point since Apple has already ‘voluntarily’–by which I mean ‘incredibly reluctantly’–agreed to <a href=\"https://www.macworld.com/article/2141884/iphone-imessage-rcs-support-later-in-2024.html\">support the RCS standard</a> later in 2024. RCS works on Android, and this should ensure a better overall cross-platform experience (although the <a href=\"https://www.macworld.com/article/2144333/iphone-rcs-android-blue-green-blue-bubble-drama.html\">green-bubble drama</a> will apparently continue).</p>\n\n\n\n<p>In other words, Apple has evaded looming regulatory interference by pre-emptively doing the thing it was threatened with, albeit in the most advantageous way it can. And thus the conclusion of the investigation may have ended up being irrelevant, in the happy sense that the mere existence of the political willingness to investigate already had the desired effect. And in the end this should be <a href=\"https://www.macworld.com/article/2163354/imessage-rcs-android-iphone-user-experience.html\">good for everyone</a>.</p>\n\nApple Inc, iOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b504928bf10ee91376feb0a22a34a697850b4af03ef0e3ffef551613d0a42e58","category":"Apple"}