{"title":"The birth of Van Rysel: road bikes designed for performance","link":"https://www.cyclist.co.uk/sponsored/9410/the-birth-of-van-rysel-road-bikes-designed-for-performance","date":1616587439000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-25T10:33:00+00:00\">25 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nHow Decathlon’s in-house performance brand wants to make the pleasure and benefits of cycling accessible to all</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/van_rysel_lead_image.jpg?itok=ZxN94VzI\" />  </div>\n<div class=\"field field-name-body\">\n      <p> For Van Rysel, Decathlon’s in-house performance road cycling brand, the clue to its heritage is in the name. Born in 2018, the company’s title means ‘from Lille’, a tribute to Decathlon's headquarters in the north of France where the bikes are designed and built.</p>\n<p>Rysel, the West Flemish name for Lille, also serves as a tip of the hat to the nearby Roubaix and Flanders cobbles where testing takes place. In fact, each frame is marked with the lion of Flanders to put the region’s stamp on the bikes.</p>\n<p>Decathlon’s cycling heritage stretches back decades. From 2000 to 2008, when Van Rysel was known as B’Twin, it partnered with professional teams Cofidis, AG2R Prévoyance and AG2R La Mondiale. Those technical partnerships made it possible to accelerate the development and design of new ranges of bicycles, textiles and helmets.</p>\n<p>More recently, B’Twin partnered the professional FDJ team for four seasons in textiles.</p>\n<p>These B’Twin collaborations ripple through Decathlon’s bikes today – where the Triban range is designed with comfort in mind, Van Rysel is set on performance and a desire to bring cyclists, be they professional or amateur pelotons, the highest possible standards. All frames, whether aluminium or carbon fibre, are assembled at the Lille factory after manufacture with global partners.</p>\n<p>Quality is critical. Van Rysel’s carbon fibre frames, used across its EDR CF range, come from the Vietnam-based industrial partner VIP. There, VIP goes through a 12-stage creation process for the carbon frames before they head to Lille for assembly. The front triangle alone has more than 200 individual pieces and each of them is weighed to the exact gram.</p>\n<p>VIP’s checks are so thorough they also encompass appearance, geometry and utilise cameras and X-rays to check a frame’s integrity. Anything that doesn’t pass these checks is destroyed or sent off for lab testing and further research. Van Rysel and VIP are in regular contact, visiting each other on-site to solidify their relationship and make sure each component is the best it can possibly be.</p>\n<div id=\"file-44337\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/03/van_rysel_frames.jpg?itok=AU3cRV-y\" alt=\"\" />  </div>\n</div>\n<p>Van Rysel’s guiding philosophy revolves around four key areas: making high-end products accessible to all; developing and testing in demanding conditions so efficiency is ensured; making users proud to ride or wear a Van Rysel product; and allowing riders to live their passion safely and responsibly.</p>\n<p>You can learn more about Van Rysel’s ‘BEST’ mantra <a href=\"https://www.vanryselcycling.com/best\" target=\"_blank\" rel=\"“nofollow”\">here</a>.</p>\n<p>Supporting everything Van Rysel does is a team of passionate cycling experts with professional credentials. This stretches beyond the bikes to the equipment, clothing and accessories that are rider essentials.</p>\n<p>One cyclist helping build the brand from the ground up is French pro Nans Peters. He won Stage 17 at the Giro d'Italia in May 2019 and Stage 8 at the Tour de France last year, riding with <a href=\"https://www.decathlon.co.uk/p/van-rysel-sport-cycling-shoes/_/R-p-168471?mc=8487100&amp;c=BLUE\" target=\"_blank\" rel=\"“nofollow”\"><span>Van Rysel Sport Cycling Shoes</span></a><span> he was instrumental in creating.</span></p>\n<p>I’m very demanding when it comes to my shoes – I have to feel good in them given the amount of time I spend wearing them and my pursuit of performance,’ Peters explains. ‘I’ve talked regularly with the design team – we make improvements day to day. Every prototype brings something new, to keep, improve or reject. We need to take everything into consideration to create the perfect shoe.’</p>\n<p>Peters covers thousands of kilometres each year, giving Van Rysel valuable insight and feedback on the construction of the shoes. For instance, during the 2019 Tour Down Under in Australia, Peters solved an overheating issue by removing part of the shoe to air airflow and ventilation. That change was then fed back to the Van Rysel team, who adapted the shoe to make it more breathable.</p>\n<p>Peters has been collaborating with Van Rysel for years, with his technical partnership covering the design of 900 shoes. He picked up the mantle from Jean-Christophe Péraud, who worked with Van Rysel until the end of his career in 2016.</p>\n<div id=\"file-44338\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/03/van_rysel_sport_cycling_shoe.jpg?itok=asp4d0Qj\" alt=\"\" />  </div>\n</div>\n<p>Van Rysel brings full-time expertise in-house, too. Élise Delzenne competed professionally between 2013 and 2017 for the Bourgogne-Pro Dialog, Velocio-Sram and Lotto-Soudal Ladies teams.</p>\n<p>In 2017 she became a technical partner for Decathlon to help test out textile products. Now, Delzenne is the textile product engineer for Van Rysel’s women’s road bike team, which develops products for beginners right through to professional riders.</p>\n<p>Delzenne says of her journey to Van Rysel: ‘I enjoyed testing the textile products and offering my feedback, both positive and negative, as a technical partner. So when the product manager offered me the job I didn’t think twice!</p>\n<p>‘My experience helps me on a daily basis. As soon as a prototype is made, I can try it out in use, and directly report the points to improve. I know the constraints of short and long rides, as well as the difficulties encountered by a beginner cyclist, and those of an experienced cyclist.</p>\n<p>‘I feel totally at home. I have the chance to combine my experience as a professional cyclist, my studies in textile engineering and my passion for cycling.’</p>\n<p>It’s this passion and expertise that are helping to put Van Rysel on the map, creating high-quality road bikes and clothing for all types of cyclist. Whether it’s the entry-level 900 AF 105, the high-end carbon EDR 940 CF Dura-Ace, or essential gear and equipment, the range will have something to suit you.</p>\n<p><em><strong>Explore the full Van Rysel range online at <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5651074470&amp;iu=/359/impcount.co.uk\" target=\"_blank\" rel=\"“nofollow”\">decathlon.co.uk</a></strong></em> </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/bikes\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Bikes</a></div>    </div></div>","author":"SimonR","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"b507e2ca80c8482404d26d3fbb9a46e5754132a190b2172fa9a3878cc6a7c420","category":"Cycling"}