{"title":"China Expanding Government iPhone Ban","link":"https://www.macrumors.com/2023/09/07/china-expanding-government-iphone-ban/","date":1694105150000,"content":"China earlier this week banned government officials from using iPhones and other foreign smartphones for work or from bringing such devices to their government offices, and now China is expanding the ban. According to <em><a href=\"https://www.bloomberg.com/news/articles/2023-09-07/china-plans-to-expand-iphone-ban-to-some-state-backed-firms-in-blow-to-apple\">Bloomberg</a></em>, multiple state agencies and state companies have started telling workers not to bring their iPhones in to their jobs.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/iPhone-14-Pros-in-Hand-Black-Background-Feature.jpg\" alt width=\"2500\" height=\"1404\" />\r<br />\nThe restriction is expected to expand to additional government-controlled organizations in the future as China aims to block foreign technology. China does not yet have a formal injunction, so it is not yet known how many companies may adopt the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> restrictions. China has a <a href=\"https://en.wikipedia.org/wiki/Category:Government-owned_companies_of_China\">huge number</a> of state-owned enterprises in power generation, seaport construction, mining, manufacturing, education, and investment markets. Foreign devices have historically been discouraged in sensitive agencies, but China is now taking a firmer stance.\r<br />\n\r<br />\nChina is an important market for Apple, and the ban could push customers to purchase Chinese-made devices if they are unable to use their personal iPhones for much of the day. <em>Bloomberg</em> suggests that the strictness of the bans could vary from company to company, with some banning Apple products from the workplace and some preventing employees from using Apple devices entirely.\r<br />\n\r<br />\nApple stock has been dropping since yesterday, and it is down over 5 percent as of Thursday.<div>Tag: <a href=\"https://www.macrumors.com/guide/china/\">China</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/07/china-expanding-government-iphone-ban/\">China Expanding Government iPhone Ban</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/china-expanding-government-iphone-ban.2400723/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b50defdadd624da8031c5036134d4d4730364b1ee3032de2924d46f39e891bab","category":"Apple"}