{"title":"86 Evaluation of dietary Saccharomyces cerevisiae fermentation product on markers of joint inflammation in young, exercising horses following an intra-articular lipopolysaccharide challenge","link":"https://academic.oup.com/jas/article/102/Supplement_1/19/7617983?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Including Saccharomyces cerevisiae fermentation product (SCFP) into the diets of young, exercising horses may prolong their performance career by optimizing the intra-articular environment. Our objective was to evaluate the effect of dietary SCFP on joint inflammation in yearlings undergoing regular exercise, challenged with intra-articular lipopolysaccharide (LPS). Thirty Quarter Horse yearlings (374 ± 25 kg BW; 562 ± 16 d of age; 15 fillies and 15 geldings) were used in a 60-d study to test the hypothesis that dietary SCFP (TruEquine C, Diamond V Mills, Inc.) ameliorates joint inflammation following an acute inflammatory insult. Horses were stratified by BW, age, sex, and randomly assigned to dietary treatments (n = 10/treatment): Control (0), 46, or 92 mg/kg BW SCFP. Treatments were top-dressed onto a custom-formulated concentrate void of added microbials offered at 1% BW/d (as-fed) every 12 h. Horses were individually stalled (3.6 m × 7.3 m) and offered ad libitum Coastal bermudagrass hay. Using a free-stall exerciser, horses were exercised following a progressive workload regimen for 30 min/d, 5 d/wk. On d 46, all horses underwent an intra-articular LPS challenge where each horse had one radial carpal joint randomly assigned to receive either 0.8 mL of a 0.5 ng LPS solution or sterile lactated Ringer’s solution (LRS) as a contralateral control. Synovial fluid samples were obtained pre-injection (h 0) and at 6, 12, 24, and 336 h post-injection and analyzed for prostaglandin E2 (PGE<sub>2</sub>), a pro-inflammatory prostaglandin via commercial ELISA, and for chemokine-concentration (signaling proteins that direct immune cells; CCL2, and CCL11) and cytokines (inflammatory mediators; TNFα and IL-10) using a multiplex platform via commercial laboratory. Non-normal data (PGE2, IL-10, and CCL2) were log transformed, and all markers were analyzed using MIXED procedure of SAS v9.4. Mean separation was achieved with orthogonal contrasts, and contralateral control carpi were used as a covariate across all hours. There was no effect of SCFP on synovial logPGE<sub>2</sub> (P = 0.42), logCCL2 (P = 0.90), CCL11 (P = 0.26), or logIL-10 (P = 0.23). However, there was a treatment × hour interaction for CCL11 (P = 0.04) where the Control had increased concentrations compared with SCFP treatment groups at 6 h post-injection. Furthermore, logIL-10 also had a treatment × hour interaction (P = 0.05) where the 46mg/kg BW group had decreased concentrations at h 12 compared with the Control and 92mg/kg BW group. The main effect of treatment for TNFα (P = 0.04) revealed that the 92mg/kg BW group had less concentrations than the 46mg/kg BW group and tended to have less concentrations than the Control group across all hours. Results indicate that SCFP may help mitigate inflammation markers following an acute intra-articular inflammatory insult.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b5143a6a4425d7bb6c083e69159aad571227357d7110d7738877488ce0dada82","category":"Environment"}