{"title":"Effects of the Methotrexate on HIF-1α, HIF-2α and P4H-TM Levels in Breast Cancer Cells: Results from an In Vitro Study","link":"https://www.preprints.org/manuscript/202406.0408/v1","date":1718015425000,"content":"Background: Methotrexate (MTX) displayed cytotoxic properties against some cancer cells. However, there is very limited data about the possible anti-tumoral potential of them in breast cancer (BC) cells. We aimed to determine the effects of MTX, which is widely used in clinical practice, on cell viability, Hypoxia-inducible factor (HIF) -1α, HIF-2α and prolyl 4-hydroxylase-transmembrane (P4H-TM) in BC cells (MCF-7) and health breast cell (HTERT-HME1) treated with MTX. Methods: Human healthy breast cells (HTERT-HME1) and BC cells (MCF-7) treated with MTX for 24 h, 48h, and 72 h, the effects of MTX on cell viability. Results: The cell viability and with half-maximal inhibitory concentration (IC50) values of of MTX treatment in healthy breast cells were determined to be higher than in MCF-7 cells. MTX showed higher cytotoxicity against MCF-7 cells. MTX significantly reduced cell viability values in HTERT-HME1 and MCF-7 cells. HIF-1α, HIF-2α, and P4H-TM levels was significantly higher in the MCF-7 group than the other groups. Morever, there was a moderate significant correlation between HIF-1α and HIF-2α levels and between HIF-1α and P4H-TM. Conclusions: MTX will show a further decrease in cell viability in long-term treatments of 48 and 72 hours, it is predicted that short-term use may be more appropriate. P4H-TM may be a novel regulator of hypoxia in BC cells. HIF-1α, a key protein responsible for the molecular mechanism of hypoxia in cells, is a key mediator between P4H-TM and hypoxia in MTX-treated cells. HIF-1α, HIF-2α, and P4H-TM values may be markers that can be used as a panel to differentiate BC from healthy women.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b519f7102ffc456d5938301c23be21ec0e96dc65e13e050c4169b83e1ad0f223","category":"Interdisciplinary"}