{"title":"X Tests 'Not A Bot' Program That Charges New Users $1/Year to Post","link":"https://www.macrumors.com/2023/10/17/x-not-a-bot-program/","date":1697588904000,"content":"X, the social network formerly known as Twitter, <a href=\"https://help.twitter.com/en/using-x/not-a-bot\">today announced</a> that it is testing a \"Not A Bot\" program that charges new, unverified users $1 per year to post and interact with content on X.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/X-twitter-logo.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nNot A Bot is being tested in New Zealand and the Phillipines at the current time, and it only applies to new users. The X support account says that existing users are not affected \"within this test.\"\r<br />\n\r<br />\nCharging users $1 per year is meant to \"reduce spam, manipulation of [the X] platform, and bot activity.\" X claims that subscription options have \"proven to be the main solution that works at scale\" to combat these issues.<blockquote>This new program aims to defend against bots and spammers who attempt to manipulate the platform and disrupt the experience of other X users. We look forward to sharing more about the results soon.</blockquote>All new accounts in New Zealand and the Philippines will be required to verify a phone number and then pay a $1 USD fee to create posts, reply, repost, quote posts, and bookmark posts. New users who do not pay the fee will only be able to read posts, watch videos, and follow accounts.\r<br />\n\r<br />\nThere is no word yet on whether Not A Bot will be expanded to additional countries and to users who have already signed up for X but have declined to pay the monthly fee for a premium subscription.<div>Tags: <a href=\"https://www.macrumors.com/guide/twitter/\">Twitter</a>, <a href=\"https://www.macrumors.com/guide/elon-musk/\">Elon Musk</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/17/x-not-a-bot-program/\">X Tests 'Not A Bot' Program That Charges New Users $1/Year to Post</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/x-tests-not-a-bot-program-that-charges-new-users-1-year-to-post.2407901/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b51c69c86445c20a72c0d9561df33d982f0444558b06e5c681016d815f3eab5e","category":"Apple"}