{"title":"From Linear to Circular: A Novel Approach of Integration of Blockchain in Agri-Food Chains and the SCOR Model Oriented to Logistics Reverse and Sustainable Development Goals","link":"https://www.preprints.org/manuscript/202406.0722/v1","date":1718105383000,"content":"⦁ Introduction: The challenging context, resulting from a post-pandemic scenario, wars, and various natural disasters, does not allow for the ideal assurance of efficiency in the Agri-food supply chain. \n⦁ Research significance\nCurrently, Agri-food supply chains and Reverse logistics show critical characteristics such as centralization, limited flexibility, distrust, bureaucratization, Border and Documentary Compliance and there are problems about efficiency, security, and safety Agri-Food. using the Supply Chain Operations Reference (SCOR) framework, with the purpose of achieving Sustainable Development Goals, promoting transparency, traceability, and non-linearization of the agri-food supply chain.\n⦁ Methodology\nThe methodology is combined, the first part uses Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) identifying 72 articles with the principal contribution in the literature. The second part combines the application of Supply Chain Operations References (SCOR) and the Blockchain Technology aiming to decentralize the linear Agri-food Supply Chain and Reverse logistics.\n⦁ Results/findings\nThe results revealed a transformation of the traditional Agri-food Supply Chain, transitioning from linear management to a circular one. Additionally, after application it is possible to know a new way to manage the Reverse Logistic with more decentralization, flexibility, traceability, and reducing the unnecessary activities, which include Border and Documentary Compliance.  The originality of this research is the novel combination of SCOR Model and Blockchain showing a priority about the key activities that add value and come close to the Sustainable practices.\n⦁ Conclusion / Implications\nBased on the results is possible to conclude that the synergy between Blockchain and SCOR Model enables a new way to manage the Agri-food supply chain, improving efficiency and reducing activities without value. Also, it is possible to ensure that the practices of Reverse Logistics are improved based on terms of cost and time, and the reduction of the exposition on the Defective Product Risk.\n⦁ Social Implications\nThis paper could enhance confidence in all operations of the Agri-food supply chain as there are numerous issues regarding the security and safety of food. Additionally, it will aid in diminishing unnecessary activities and inefficient resource consumption practices, thereby accomplishing objectives 2 \"zero hunger\", 9 \"Industry, Innovation, and Infrastructure\", and 12 \"Responsible consumption and production\", along with their respective indicators.\n⦁ Practical implications\nRegarding the practical implications, this research could contribute to analyses of the application of technology Blockchain in different sectors and identify the possible limitations when the main objective is to apply it on a big scale.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b522d43f603d5e0ec45079d138c02360109f7c41f8345a8e614895cea4efc548","category":"Interdisciplinary"}