{"title":"Investigating the Impact of Information Sharing on Supply Chain Resilience","link":"https://www.preprints.org/manuscript/202406.0557/v1","date":1718013972000,"content":"This study investigates the impact of information sharing on supply chain resilience by exploring the experiences and insights of supply chain professionals through qualitative research. Information sharing has become increasingly recognized as a vital component in enhancing the ability of supply chains to anticipate, respond to, and recover from disruptions. Through semi-structured interviews with 22 supply chain professionals across various industries, the study delves into the mechanisms through which information sharing influences supply chain resilience, the challenges faced, and the role of enabling factors such as technology and organizational culture. The findings reveal that effective information sharing enhances supply chain visibility, coordination, and adaptability. Enhanced visibility allows supply chain partners to monitor real-time operational data, facilitating early detection of potential disruptions. Improved coordination enables better alignment of activities, reducing inefficiencies and mitigating the bullwhip effect. Adaptability is bolstered through the timely exchange of information, allowing for rapid adjustments to changing conditions. However, the study also identifies significant barriers to effective information sharing, including concerns about data security, competitive advantage, and trust among partners. Trust and strong relationships emerge as critical factors for successful information sharing, highlighting the need to build and maintain trust to facilitate open communication. The role of technology is emphasized, with digital platforms, blockchain, and the Internet of Things (IoT) identified as key enablers of efficient and secure information exchange. The study concludes that fostering a supportive organizational culture and leadership commitment to transparency and collaboration, along with tailoring information-sharing strategies to specific supply chain contexts, is essential for enhancing supply chain resilience. This research contributes to the understanding of the impact of information sharing on supply chain resilience and provides practical insights for organizations aiming to strengthen their resilience in an increasingly complex global business environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b52480f0c7972206e8da055516f0f53f8dce856767f617aac9dd0e19540b42f9","category":"Interdisciplinary"}