{"title":"Root Primordium Defective 1 Encodes an Essential PORR Protein Required for the Splicing of Mitochondria-Encoded Group II Introns and for Respiratory Complex I Biogenesis","link":"https://academic.oup.com/pcp/article/65/4/602/7272703?rss=1","date":1694563200000,"content":"<span><div>Abstract</div>Cellular respiration involves complex organellar metabolic activities that are pivotal for plant growth and development. Mitochondria contain their own genetic system (mitogenome, mtDNA), which encodes key elements of the respiratory machinery. Plant mtDNAs are notably larger than their counterparts in Animalia, with complex genome organization and gene expression characteristics. The maturation of the plant mitochondrial transcripts involves extensive RNA editing, trimming and splicing events. These essential processing steps rely on the activities of numerous nuclear-encoded cofactors, which may also play key regulatory roles in mitochondrial biogenesis and function and hence in plant physiology. Proteins that harbor the plant organelle RNA recognition (PORR) domain are represented in a small gene family in plants. Several PORR members, including WTF1, WTF9 and LEFKOTHEA, are known to act in the splicing of organellar group II introns in angiosperms. The <span>AT4G33495</span> gene locus encodes an essential PORR protein in <span>Arabidopsis</span>, termed ROOT PRIMORDIUM DEFECTIVE 1 (RPD1). A null mutation of <span>At.RPD1</span> causes arrest in early embryogenesis, while the missense mutant lines, <span>rpd1.1</span> and <span>rpd1.2</span>, exhibit a strong impairment in root development and retarded growth phenotypes, especially under high-temperature conditions. Here, we further show that RPD1 functions in the splicing of introns that reside in the coding regions of various complex I (CI) subunits (i.e. <span>nad2, nad4, nad5</span> and <span>nad7</span>), as well as in the maturation of the ribosomal <span>rps3</span> pre-RNA in <span>Arabidopsis</span> mitochondria. The altered growth and developmental phenotypes and modified respiration activities are tightly correlated with respiratory chain CI defects in <span>rpd1</span> mutants.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"b52e4403df280f0d5da8c34798ead31a86ab7e959b923e28b8bb3a40ae35cb7d","category":"Environment"}