{"title":"Impact of Powder Morphology and Coating Microstructure on Mechanical Properties of Plasma-Sprayed Magnesia (24%)-Stabilized Zirconia on Stainless Steels","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.617/7719623?rss=1","date":1721779200000,"content":"<span>Thermal barrier coatings (TBCs) are applied to advanced heat engines to protect surfaces from exposure to high temperatures, resulting in more efficient performance over longer lifetimes [<a href=\"#ozae044.617-B1\">1-4</a>]. Zirconia (ZrO<sub>2</sub>)-based TBCs deposited by atmospheric plasma spraying (APS) have received considerable attention because of its physical properties such as low thermal conductivity and high strength. The advantages of using the APS approach include a high deposition rate, a wide range of coating thickness, and low processing costs. In the APS process, the initial powder particles are injected into high temperature conditions generated by a plasma arc, and then the heated particles are accelerated and propelled toward a substrate by a gas jet. Metal oxides are added to ZrO<sub>2</sub> to stabilize the tetragonal and/or cubic phases at the ambient temperature conditions [<a href=\"#ozae044.617-B5\">5</a>, <a href=\"#ozae044.617-B6\">6</a>]. Zirconia stabilized with 15-24% MgO is comparatively cheaper and is utilized in low temperature regions such as in the exhaust nozzle of the jet engines [<a href=\"#ozae044.617-B7\">7</a>]. Furthermore, MgO-stabilized zirconia has a low thermal conductivity (1.0-1.5 W/mK), which is fairly comparable to Y<sub>2</sub>O<sub>3</sub>-stabilized zirconia, implying that it has considerable potential as a ceramic top coat material for suitable applications [<a href=\"#ozae044.617-B8\">8</a>, <a href=\"#ozae044.617-B9\">9</a>]. The study investigates the impact of the initial powder morphology and microstructure of as-sprayed MgO-stabilized ZrO<sub>2</sub> (MSZ) on the hardness and microhardness of the resulting coatings.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"b535b627362a42cbe42a15e5178fc1d5774a957bad88fd9dbbdaf1222154518e","category":"Environment"}