{"title":"How to shut down a Mac","link":"https://www.macworld.com/article/2228380/how-to-shut-down-a-mac.html","date":1707312194000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Macs are quite happy to stay on all the time, in fact, some ask whether they <a href=\"https://www.macworld.com/article/675859/should-i-shut-down-my-mac-every-night.html\">should shut down their Mac every night or not</a>, but there are occasions when you might need to power it off to clear memory, address errors, rescue a machine that’s locked up, or simply put it away for a couple of weeks while you’re on holiday. There are several ways to power down a Mac, depending on the situation. Here’s our quick guide on how to shut down a MacBook or Mac. </p>\n\n\n\n<h2>How to shut down a Mac via the menu</h2>\n\n\n\n<p>The most common way to power down a Mac is via the menu in macOS. This allows the system to properly close open apps and deal with any processes that are ongoing, so that the shutdown is as clean as possible. To do this, follow these simple steps. </p>\n\n\n\n<ol>\n<li>Click on the Apple icon in the top left corner. </li>\n\n\n\n<li>Select <strong>Shut Down</strong>. </li>\n\n\n\n<li>At this point, you will get one minute to stop the shutdown process, or you can click on <strong>Shut Down</strong> again to shut down immediately. </li>\n\n\n\n<li>If you don’t want the open apps to reopen when you reboot the machine, deselect the ‘<strong>Reopen windows when logging back in</strong>’ option. </li>\n\n\n\n<li>Confirm your choice by clicking <strong>Shut Down</strong> again.</li>\n\n\n\n<li>Your Mac will now start the shutdown process, but you will get the opportunity to save any unsaved documents you might have open, and you will be asked to confirm if certain apps should be closed. </li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-MACOS.jpg?quality=50&amp;strip=all\" alt=\"Shutting down a Mac in macOS\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-MACOS.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-MACOS.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-MACOS.jpg?resize=768%2C431&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-MACOS.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"575\" /></figure><p>Martyn Casserly</p></div>\n\n\n\n<p>Tip: Apple recommends not closing the display on a MacBook until the screen has gone completely black, as this could cause things to not shut down properly and may increase the time it takes to reboot the machine.  </p>\n\n\n\n<h2>How to shut down a Mac with the power button</h2>\n\n\n\n<p>If your Mac has become unresponsive, and you can’t access the shutdown menu to close it down, you can turn to the power button to shut down your Mac. Here’s what you need to do:</p>\n\n\n\n<ol>\n<li>Press and hold the power button until the screen goes blank. </li>\n\n\n\n<li>There’s usually an audible sound to listen out for, either a click or the sound of the fans stopping, that tells you it has switched off. </li>\n\n\n\n<li>Wait a minute or so before starting the Mac up again. </li>\n</ol>\n\n\n\n<p>It’s not as clean a method as the software approach, and there’s a possibility you may lose any unsaved data or documents that were open at the time, but, most of the time, everything should be there when you restart the device. </p>\n\n\n\n<p>If you are unfortunate enough to have lost something you were working on you may want to read our guide on <a href=\"https://www.macworld.com/article/672463/how-to-recover-unsaved-word-documents.html\">how to recover a lost Word document</a>. </p>\n\n\n\n<h2>How to shut down an unresponsive app</h2>\n\n\n\n<p>If your Mac has one app that’s gotten itself stuck and is causing problems, you may not need to fully shut down your Mac. The <a href=\"https://www.macworld.com/article/671386/how-to-force-quit-on-a-mac.html\">Force Quit</a> command may allow you to reset the troublesome app. Here’s what to do. </p>\n\n\n\n<ol>\n<li>Right-click on the app icon in the Dock at the bottom of the screen.</li>\n\n\n\n<li>Select the Quit option. </li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-FORCEQUIT.jpg?quality=50&amp;strip=all\" alt=\"Force quitting an app on Mac\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-FORCEQUIT.jpg?quality=50&amp;strip=all 840w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-FORCEQUIT.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-FORCEQUIT.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/02/How-to-shut-down-a-Mac-FORCEQUIT.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"840\" height=\"472\" /></figure><p>Martyn Casserly</p></div>\n\n\n\n<p>If that doesn’t work there are a few other ways to Force Quit: </p>\n\n\n\n<ul>\n<li>Press and hold the Option (or Alt) key while right clicking the app in the Dock and you should see the option to Force Quit. </li>\n\n\n\n<li>Click on the Apple Menu and select Force Quit. </li>\n\n\n\n<li>Press: Command + Option (or Alt) + Escape to open the Force Quit dialog box. </li>\n\n\n\n<li>Open the Activity Monitor app and select Force Quit. </li>\n</ul>\n\n\n\n<p>Hopefully this will clear any system blockages that are causing slow-downs or other issues. If it doesn’t, then you may want to use the method above to restart your Mac. </p>\n\n\n\n<p>There are other ways to close misbehaving apps, all of which are covered in our <a href=\"https://www.macworld.com/article/671386/how-to-force-quit-on-a-mac.html\">how to Force Quit on a Mac</a> guide. </p>\n\n\n\n<p>If you are coming from the PC world you might be more familiar with control-alt-delete but that key combo won’t work on a Mac. </p>\n\n\n\n<p>Like with the Force Quit command, there are a few different approaches for shutting down an unresponsive Mac, which we cover in our <a href=\"https://www.macworld.com/article/670250/how-to-fix-a-frozen-macbook-or-mac.html#reboot\">how to fix a frozen MacBook or Mac</a> and <a href=\"https://www.macworld.com/article/671489/what-to-do-if-your-mac-wont-shut-down.html\">what to do if your Mac won’t shut down</a> guides. </p>\n\n\n\n<h2>How to schedule a Mac to turn itself on and off</h2>\n\n\n\n<p>It’s not always problems that cause people to want to shut down their Macs. It could just be that you prefer your device to power down at night or other specific times. This used to be part of macOS and was found in the Energy Saver section of System Preferences. Sadly, Apple decided to remove the feature with macOS Ventura, and it can now only be accessed through the Terminal app. </p>\n\n\n\n<p>Admittedly this isn’t something that the vast majority of Mac users will want to mess about with, as it requires a small amount of coding to be done. If you’re determined though, you can read our<a href=\"https://www.macworld.com/article/621076/how-to-schedule-your-mac-to-turn-off-and-on.html\"> how to schedule your Mac to turn off and on</a> tutorial, which takes you through all the required steps. </p>\n\n\n\n<p>If, after all this, you discover that the problem is more serious than a simple glitch, then you may want to consider upgrading to a newer machine. If you want to see which devices we recommend, check out our <a href=\"https://www.macworld.com/article/219909/best-mac.html\">Mac buyers guide</a> where we look at all the current offerings and highlight which ones will be right for different people, depending on their needs.</p>\n\nMac, MacBook, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b5429215f68747e929a3cc4fa079ec274836acb68456406c23f4453f65dc323a","category":"Apple"}