{"title":"Cysteamine HCl Administration Impedes Motor and Olfactory Functions Accompanied by Reduced Dopaminergic Neurons in Experimental Mice: A Preclinical Mimetics Relevance to Parkinson&rsquo;s Disease","link":"https://www.preprints.org/manuscript/202406.0417/v1","date":1718015808000,"content":"Cysteamine HCl has been established as a potent ulcerogenic agent of the gastrointestinal (GI) system. GI dysfunction and olfactory deficits are the most common clinical symptoms of many movement disorders including Parkinson's disease (PD). Cysteamine HCl has  been shown to interfere with dopamine, a neurotransmitter crucial for motor, olfactory, and cognitive functions. However, the reports on the effect of cysteamine HCl treatment on the behavior and dopamine system appear to be inconsistent. Therefore, we revisited the impact of cysteamine HCl on motor function in experimental mice using a battery of behavioral tests such as pole test (PT), beam walking test (BWT), and rotarod test (RDT), while the olfactory ability and cognitive functions were examined through food buried test (FBT) and Y maze.  Furthermore, we investigated the effect of cysteamine HCl on the density of dopaminergic tyrosine hydroxylase (TH)-positive cells in the substantia nigra (SN) and olfactory bulb (OB) of experimental mice using immunohistochemistry. Results revealed that cysteamine HCl administration in mice induced significant impairments in motor balance and coordination, as their movement-related performance was markedly reduced in behavioral tasks. Mice exposed to cysteamine HCl showed a pronounced reduction in odor discrimination ability and cognitive impairments. Strikingly, the number of TH-positive neurons was found to be reduced in the SN and OB of the cysteamine HCl-treated group which is a bonafide neuropathogenic hallmark of PD. This study highlights the potential neurotoxic effects of cysteamine HCl in experimental brains and suggests further investigation into its role in pathogenesis of Parkinsonism.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b54425af779917fa6a40493648d29f092db1677d087b0d924a5322de2908dd86","category":"Interdisciplinary"}