{"title":"Deepening our understanding of the environmental influences on the reproductive dynamics of the main fishery stock of Argentine hake, Merluccius hubbsi, in the southwestern Atlantic Ocean","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12687?af=R","date":1719812407000,"content":"<h2>Abstract</h2>\n<p>This study analyzed the inter-annual variability in the reproductive dynamics of the Argentine hake from Patagonian waters during the last 20 years concerning the environmental conditions and the nutritional status of females. Macroscopic and histological information on gonadal maturity, female condition factor (K), and oceanographic data at different sampling sites throughout the studied region were obtained from research surveys carried out during the main spawning season of this species. Four stages, according to the maturity ovarian phases composition, were assigned annually at each sampling site to assess reproductive dynamics: vitellogenesis, ovulation, regression, and resting. The spatial pattern of inter-annual variability in reproductive dynamics was described, and the influence of temperature and female condition on the probability of ovulation and regression was assessed using generalized linear models. The area with the lowest inter-annual variability in the hake reproductive dynamics was observed between 43 and 45°S (50 to 80 m depth) in relation to ovulation events. The vitellogenesis stage was more frequently found adjacent to the reproductive area, whereas the regression was mainly observed in deeper waters. Both bottom and surface temperatures explained the ovulation and regression stages, showing a positive and negative relationship, respectively. Lower values of the K factor, associated with low food availability, were further linked to the occurrence of regression. Finally, it is worth noting that the relationship observed between the ovulation/spawning dynamics of Argentine hake and water temperature suggests that the reproductive success of this species could be affected in the future scenario of climate change.</p>","author":"Mariano Elisio, \nMarina V. Diaz, \nEzequiel Leonarduzzi, \nKarina A. Rodrigues, \nJuan M. Burla, \nGustavo J. Macchi","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"b544fa84590529e01625cf5f643dfa7ed8ec8b9dec3793b5b5ad47ac0aeae369","category":"Environment"}