{"title":"Overwintering strategy regulates phenological sensitivity and consequences for ecological services in a clade of temperate North American insects","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14543?af=R","date":1715144986000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d9fb00f9-c83e-4111-bb4f-fd6f912e9041/fec14543-toc-0001-m.png\" alt=\"Overwintering strategy regulates phenological sensitivity and consequences for ecological services in a clade of temperate North American insects\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/06/response-of-butterfly-timing-and-abundance-to-climate-change-depends-on-life-stage-during-winter/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nRecent reports of insect declines have raised concerns about the potential for concomitant losses to ecosystem processes. However, understanding the causes and consequences of insect declines is challenging, especially given the data deficiencies for most species. Needed are approaches that can help quantify the magnitude and potential causes of declines at levels above species.\n\nHere we present an analytical framework for assessing broad-scale plant–insect phenologies and their relationship to community-level insect abundance patterns. We intentionally apply a species-neutral approach to analyse trends in phenology and abundance at the macroecological scale. Because both phenology and abundance are critical to ecosystem processes, we estimate aggregate metrics using the overwintering (diapause) stage, a key species trait regulating phenology and environmental sensitivities. This approach can be used across broad spatiotemporal scales and multiple taxa, including less well-studied groups.\n\nUsing community (‘citizen’) science butterfly observations from multiple platforms across the Eastern USA, we show that the relationships between environmental drivers, phenology and abundance depend on the diapause stage. In particular, egg-diapausing butterflies show marked changes in adult-onset phenology in relation to plant phenology and are rapidly declining in abundance over a 20-year span across the study region. Our results also demonstrate the negative consequences of warmer winters for the abundance of egg-diapausing butterflies, irrespective of plant phenology.\n\nIn sum, the diapause stage strongly shapes both phenological sensitivities and developmental requirements across seasons, providing a basis for predicting the impacts of environmental change across trophic levels. Utilizing a framework that ties thermal performance across life stages in relation to climate and lower-trophic-level phenology provides a critical step towards predicting changes in ecosystem processes provided by butterflies and other herbivorous insects into the future.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/06/response-of-butterfly-timing-and-abundance-to-climate-change-depends-on-life-stage-during-winter/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Elise A. Larsen, \nMichael W. Belitz, \nGrace J. Di Cecco, \nJeffrey Glassberg, \nAllen H. Hurlbert, \nLeslie Ries, \nRobert P. Guralnick","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"b54d0b905249f78b7363e356d27cf08e3abfb33f40834b164317267ae513aef3","category":"Environment"}