{"title":"Advancements and hurdles of deeper‐offshore aquaculture in China","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12858?af=R","date":1710918000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ba60bb44-62de-4e3d-a924-9d997590ce9c/raq12858-toc-0001-m.png\" alt=\"Advancements and hurdles of deeper-offshore aquaculture in China\" />\n<p>The world faces the pressing challenges of expanding population, resource constraints, water eutrophication, and climate change, the global community expects aquaculture to fulfil the goals of helping increase food production, relieve eutrophication, and reduce greenhouse gas emissions. If properly developed, deeper-offshore aquaculture could be a viable approach.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Open offshore areas boast strong physical self-purification capacity and abundant non-fossil energy resources, such as wind, waves, and solar energy. Consequently, the global community anticipates nearshore aquaculture to transition towards offshore to help increase production, alleviate eutrophication, and reduce greenhouse gas emissions. To date, China has constructed over 40 sets of deeper-offshore aquaculture (DOA) infrastructures, encompassing various types of pens, cages and closed containment systems. Although DOA holds vast potential to address food security and aquaculture sustainability in China, its current development trajectory struggles to meet those goals and primarily achieves profitability by focusing on high-value species or products. For DOA to realize its potential, innovative production systems must tackle three key contradictions: enterprise profitability versus product affordability, clean energy-based products versus carbon-intensive products, and automated operation versus re-employment of coastal fish farmers. Resolving these contradictions requires the development of a large-scale, anti-typhoon offshore enclosure that integrates mariculture with other industries, such as wind farming, food processing, and tourism. This approach will foster a sustainable balance between profitability, environmental impact, and employment opportunities in the sector.</p>","author":"Shuang‐Lin Dong, \nYun‐Wei Dong, \nLiu‐Yi Huang, \nYan‐Gen Zhou, \nLing Cao, \nXiang‐Li Tian, \nLi‐Min Han, \nDa‐Hai Li","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"b54fb273cbbcb71dcd6ec0f6b56078a980109d2e76618969aa11a2444031e36e","category":"Environment"}