{"title":"Hugs banned: UCI asks riders to keep their joy to themselves","link":"https://cyclingtips.com/2021/03/hug-ban-uci-asks-riders-to-keep-their-joy-to-themselves/","date":1614874424000,"content":"<p>Bike racers in the thrall of victory shouldn&#8217;t celebrate in close proximity, the UCI has announced. A hug ban has been instituted within the professional peloton.</p>\n\n\n\n<p>The UCI&#8217;s request comes after numerous riders were seen embracing their excitement and each other following victories in early season races. Hugging, much like specific methods of <a href=\"https://cyclingtips.com/2021/02/the-uci-is-banning-the-super-tuck/\">riding downhill</a> and <a href=\"https://cyclingtips.com/2021/02/uci-reiterates-ban-on-invisible-aero-bars/\">leaning forward</a>, is now a celebration non grata at pro bike races. </p>\n\n\n\n<p>&#8220;When we show some riders congratulating each other and hugging, that’s not a good message for the fans and spectators,&#8221; said UCI Medical Director Xavier Bigard.</p>\n\n\n\n<p>The hug ban is largely predicated on optics, rather than sound science, as the UCI admits. Riders and staff already spend significant time together within their team bubbles, in busses and at hotels, and Bigard admitted that the risk of passing COVID-19 via hug is low.</p>\n\n\n\n<p>&#8220;In my opinion as a doctor, the risk of being contaminated by this behavior is not very high,&#8221; Bigard said. &#8220;However, the message we have to send around the world and to race spectators is that we have to fight this virus and remind people that it is prohibited to touch other people.&#8221;</p>\n\n\n\n<p>Fist bumps and other less advanced celebration techniques remain legal.</p>\n\n\n\n<p>&#8220;There is already a ban for riders to hug or touch each other on the podium,&#8221; Bigard said. &#8220;Common sense says that riders are also better off showing the same behavior after the finish line, even if they have just won the race.&#8221;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"831\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-1340x831.jpg\" alt=\"Taylor Phinney and Tyler Farrar fist bump. \" class=\"wp-image-487413\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-1340x831.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-650x403.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-190x118.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-1080x670.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1-16x10.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/no-more-hugs-1-of-1.jpg 1900w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Yes.  This is good. </figcaption></figure>\n\n\n\n<p>The hug ban was presented in a webinar in which the UCI presented its updated COVID-19 medical protocol. Most of that protocol remains the same &#8211; teams are required to &#8220;bubble,&#8221; can&#8217;t hug or touch each other on the podium, and have no interaction with the general public.</p>\n\n\n\n<p>Bigard warned that these measures would remain in place for much if not all of the coming season. &#8220;We can&#8217;t expect a normal Tour de France this year,&#8221; he said.</p>\n\n\n\n<p>Teams will continue to undergo pre-race PCR COVID-19 tests and masks and social distancing are required at the start and finish lines. Every race must have an appointed COVID-19 doctor who is responsible for handling any cases at that race.</p>\n\n\n\n<p>&#8220;The success of the season depends on two points,&#8221; Bigard said. The first is the behavior of team members, team doctors, and organizers. The second is the spread of new COVID variants. &#8220;Nobody can say what will happen with the variants in the next weeks and months. However, I can only repeat that we can be confident the cycling season will go ahead,&#8221; he said.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/hug-ban-uci-asks-riders-to-keep-their-joy-to-themselves/\">Hugs banned: UCI asks riders to keep their joy to themselves</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b551b6bc097393fc26ca9694f8bc224df2feeaefc65d27a01f18f818a5000b16","category":"Cycling"}