{"title":"Energy harvester reliability study by Gaidai reliability method","link":"https://rmets.onlinelibrary.wiley.com/doi/10.1002/cli2.64?af=R","date":1704268800000,"content":"<img src=\"https://rmets.onlinelibrary.wiley.com/cms/asset/590e8e35-d0e7-461a-bfb2-543e33c4ee60/cli264-gra-0001-m.png\" alt=\"Energy harvester reliability study by Gaidai reliability method\" /><p>The paper validates a novel structural reliability method, particularly suitable for multidimensional energy harvesting device responses, versus a well-established bivariate statistical method that is known to accurately predict two-dimensional system extreme response levels. Classic reliability methods, dealing with time series, do not have an advantage of dealing easily with system high dimensionality and cross-correlation among different dimensions.</p>\n<p>Energy harvesters constitute an important part of modern offshore green energy engineering, therefore proper experimental study along with safety and reliability analysis are of practical engineering importance. To study performance of galloping energy harvesters various wind tunnel tests have been conducted with different wind speeds. This paper studies bivariate statistics of extreme experimental galloping energy harvester dynamic response. The bivariate statistics was extracted from available experimental results, more specifically for the voltage-force dataset. Advantage of the proposed methodology is that relatively short experimental data record can still yield meaningful statistical and design results, provided proper statistical methods are applied.</p>\n<p>Safety and reliability are important engineering concerns for all kinds of green energy offshore installations.</p>\n<p>Unlike other reliability methods, the new method does not require to restart simulation each time the system fails, in the case of numerical simulation. In the case of measured structural response, an accurate prediction of system failure probability is also possible as illustrated in this study. Moreover, classic reliability methods dealing with time series do not have an advantage of dealing easily with system high dimensionality and cross-correlation among different dimensions. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study validates a novel structural reliability method, particularly suitable for high-dimensional green energy harvesting device dynamic systems, versus a well-established bivariate statistical method, known to accurately predict two-dimensional system extreme response contours. Classic reliability methods dealing with time series do not always have an advantage of dealing easily with dynamic system high dimensionality, along with complex cross-correlations among different system components. Energy harvesters constitute an important part of modern offshore green energy engineering; hence, proper experimental study along with safety and reliability analysis are of practical design and engineering importance. To study the performance of galloping energy harvesters, a series of laboratory wind tunnel tests have been conducted, selecting different wind speeds. This study illustrates the usage of the advocated novel reliability method, by analyzing bivariate statistics of experimental galloping energy harvester's dynamics. The bivariate statistics was extracted from available experimental results, more specifically for the device's voltage-force dataset. Advantage of the proposed methodology being that relatively short experimental data record may still yield meaningful design results, provided proper statistical methods have been applied. Safety and reliability are important engineering concerns for all kinds of green energy devices. In the case of measured device's structural response, an accurate prediction of system failure or damage probability is possible, as illustrated in this study. Distinctive advantage of advocated novel semi-analytical reliability methodology being the fact that it can tackle dynamic systems with practically unlimited number of dimensions (or components), along with complex nonlinear cross-correlations between different system key components.</p>","author":"Oleg Gaidai, \nJiayao Sun, \nFang Wang","siteTitle":"Wiley: Climate Resilience and Sustainability: Table of Contents","siteHash":"e7509a6a763a901e53649c0568b0f7267c6e779cdc08f41bb80af5ed2bfb3753","entryHash":"b553d1fd2fc4cfe581842b9b1abecd6476269165114e2ce6b594884c860c3502","category":"Environment"}