{"title":"Nutritional composition, fatty acids profile and immunoglobulin G concentrations of mare milk of the Chilean Corralero horse breed","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310693","date":1726754400000,"content":"<p>by M. Jordana Rivero, Andrew S. Cooke, Monica Gandarillas, Roberto Leon, Veronica M. Merino, Alejandro Velásquez</p>\r\n\r\nThe objective of the present study was to characterize the nutritional composition, fatty acid profile, and IgG concentration of the milk produced by Chilean Corralero horse (CCH) mares from breeding farms located in southern Chile. Forty-five milk samples were collected from three of the biggest breeding farms (coded as A, B and C) specialized in breeding and selection of CCH in Chile (15 mares sampled per farm). Farms differed in days in milk (DIM). A negative association between DIM and ash, milk protein, milk solids, saturated fatty acids (SFA), and gross energy (GE) was found, whereas DIM had a positive association with monounsaturated fatty acids (MUFA). Milk components like fat, lactose, and energy content varied independently of DIM, indicating other influencing factors such as farm-specific management practices. Offspring sex moderately affected GE content, with milk from mares bearing female offspring having higher GE. Macronutrient profiles of the CCH mares’ milk were within the reported range for other horse breeds but tended to have lower fat and total solids. Compared to cow and human milk, horse milk is richer in lactose and lower in fat and protein. Immunoglobulin G concentration was only affected by the farm (B &gt; A) which could be linked to dietary factors and pasture composition rather than maternal parity or other known factors. Overall, CCH mare milk has notable nutritional characteristics, with implications for both foal health and potential human consumption, posing less cardiac risk compared to cow’s milk as indicated by lower atherogenic and thrombogenic indices.","author":"M. Jordana Rivero","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b55858dbaccdf83ee4d740c122f84923163fa93a8ad4f90635f279993d27e414","category":"Interdisciplinary"}