{"title":"Visfatin (NAMPT) expression in human placenta cells in normal and pathological conditions and its hormonal regulation in trophoblast JEG-3 cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310389","date":1726668000000,"content":"<p>by Monika Dawid, Patrycja Kurowska, Piotr Pawlicki, Małgorzata Kotula–Balak, Tomasz Milewicz, Joelle Dupont, Agnieszka Rak</p>\r\n\r\nVisfatin is an adipokine involved in energy metabolism, insulin resistance, inflammation, and female reproduction. Due to limited data about its action in the human placenta, the aims of our studies included the analysis of visfatin expression and immunolocalization in trophoblast cell lines JEG-3 and BeWo as well as in human placentas from normal and pathological pregnancies. Moreover, we also checked the hormonal regulation of visfatin levels and the molecular mechanism of observed changes in JEG-3 cells. Cell culture and placental fragments collection along with statistical analysis were performed using standard laboratory procedures also described in our previous papers. We demonstrated an increased gene and protein expression of visfatin in JEG-3, BeWo cells, while variable expression in maternal and fetal parts of normal/ pathological pregnancy placentas. In addition, the immunolocalization of visfatin was observed in the cytoplasm of both cell lines, the capillary epithelium of the maternal part and syncytiotrophoblasts of the placental fetal part; in all tested pathologies, the signal was also detected in decidual cells. Furthermore, we demonstrated that hormones: progesterone, estradiol, human chorionic gonadotropin, and insulin increased the visfatin levels in JEG-3 cells with the involvement of specific signaling pathways. Taken together, differences in the expression and localization of visfatin between normal and pathological placentas suggested that visfatin may be a potential marker for the diagnosis of pregnancy disorders. In addition, we found that placental levels of visfatin can be regulated by hormones known to modulate the function of placental cells.","author":"Monika Dawid","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b55c8f5f041a39d6a759a323c2c470a262cfd09dbacfe087f4b424f0d0b158b5","category":"Interdisciplinary"}