{"title":"Raman Technology for Process Control: Waste Shells Demineralization to Produce Transparent Polymer Foils Reinforced with Natural Antioxidant, and Calcium Acetate By-Product","link":"https://www.preprints.org/manuscript/202403.0918/v1","date":1710500472000,"content":"Waste biogenic materials from seafood exploitation are valuable resources of new compounds exploitation within the blue bioeconomy concept. Here, we describe the effectiveness of Raman technology implementation as an in-line tool for demineralization process control of crustaceans or gastropods. We produced transparent chitin polymer foils from three waste crustacean shells (C. sapidus, S. mantis and M. squinado) using a slow, green chemical approach employing acetic acid, and showed the progressive process of biogenic carbonate dissolution and increasing the Raman characteristic signal of chitin, in a time dependence manner. It turned that chitin foils obtaining is species-specific, and the demineralization bath of waste shell mixture can be effectively tracked by Raman spectroscopy, for solvent control and the recovery of the calcium acetate as valuable by-product. Comparatively, calcium acetate drug, a compound widely used in kidney failure diseases, or as additive in nutraceuticals and food industry, has been obtained here, following a green demineralization path of the sea snail Rapana venosa intact shell, assisted by Raman tech-nology, using 9% acetic acid (vinegar) solution for 14 days. To validate the final products identity and quality, The process of waste shells demineralization and the final products of the treatment were investigated using various Raman techniques and technologies, cross-validating the results with FT-IR, XRD and SEM-EDX techniques. NIR Raman spectroscopy revealed chitin bands in a time-dependent manner, while Resonance Raman spectroscopy showed the preservation of ca-rotenoids after two weeks of acetic acid treatment. A hand-held flexible TacticID Raman system with a 1064 nm excitation demonstrated its effectiveness as a rapid, in-line decision making tool during process control and revealed excellent reproducibility of the lab-based instrument signal, suitable for in situ evaluation of the demineralization status and solvent saturation control. The calcium acetate recovered from residual treatment solutions was assessed regarding its hydration status, purity, and suitability as recrystallized material for further use as pharmaceutical product or ingredient in complex formulations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b56165dea6f754e2c6cc12f99708a98de8545ae87c3d0930c4c11fdcd250764c","category":"Interdisciplinary"}