{"title":"Evaluation of dental pulp stem cells response to flowable nano-hybrid dental composites: A comparative analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303154","date":1715608800000,"content":"<p>by Dina Rady, Nassreen Albar, Waad Khayat, Mennatullah Khalil, Shereen Raafat, Mohamed Ramadan, Shehabeldin Saber, Mohamed Shamel</p>\r\nBackground <p>Flowable resin composites (FRC) are tooth-colored restorative materials that contain a lower filler particle content, and lower viscosity than their bulk counterparts, making them useful for specific clinical applications. Yet, their chemical makeup may impact the cellular population of the tooth pulp. This in-vitro study assessed the cytocompatibility and odontogenic differentiation capacity of dental pulp stem cells (DPSCs) in response to two recent FRC material extracts.</p> Methods <p>Extracts of the FRC Aura easyflow (AEF) and Polofil NHT Flow (PNF) were applied to DPSCs isolated from extracted human teeth. Cell viability of DPSCs was assessed using MTT assay on days 1, 3 and 7. Cell migration was assessed using the wound healing assay. DPSCs’ capacity for osteo/odontogenic differentiation was assessed by measuring the degree of mineralization by Alizarin Red S staining, alkaline phosphatase enzyme (ALP) activity, and monitoring the expression of osteoprotegerin (<i>OPG</i>), RUNX Family Transcription Factor 2 (<i>RUNX2</i>), and the odontogenic marker dentin sialophosphoprotein (<i>DSPP</i>) by RT-PCR. Monomer release from the FRC was also assessed by High-performance liquid chromatography analysis (HPLC).</p> Results <p>DPSCs exposed to PNF extracts showed significantly higher cell viability, faster wound closure, and superior odontogenic differentiation. This was apparent through Alizarin Red staining of calcified nodules, elevated alkaline phosphatase activity, and increased expression of osteo/odontogenic markers. Moreover, HPLC analysis revealed a higher release of TEDGMA, UDMA, and BISGMA from AEF.</p> Conclusions <p>PNF showed better cytocompatibility and enhancement of odontogenic differentiation than AEF.</p>","author":"Dina Rady","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b5611c0939759f86a9b428cc4cf4ea559614dbabe503e9aa0237e51138914152","category":"Interdisciplinary"}