{"title":"PSLBI-9 The growth performance and total tract starch digestibility of finishing Nelore bulls fed flint corn-based diets are improved by the corn processing method and urea source","link":"https://academic.oup.com/jas/article/102/Supplement_3/642/7757856?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The aim of this study was to evaluate the flint corn processing method (CPM) and urea source for finishing Nellore bulls fed corn-based diets. In this study, 80 Nellore bulls [initial body weight (BW) = 388 ± 45.7 kg] were allocated into 28 pens (7 pens/treatment; 6 pens with 3 bulls + 1 pen with 2 bulls). A completely randomized design with a 2 × 2 factorial arrangement of treatments was used to test two CPMs: dry ground corn (DGC) and reconstituted and ensiled corn (REC), and two US: feed-grade urea (FGU) and post-ruminal release urea (PRU). Dietary inclusion (% DM) of flint corn (vitreousness = 86.0%) was 61.3% (DGC or REC), and urea source addition was 0.5% as non-protein nitrogen (NPN; as FGU or PRU). The PRU source (Trouw Nutrition, Netherlands) contained 82% urea on a DM basis. In an in vitro assay, 27% of this urea was released into the rumen. Experimental period lasted 100 d (with 14 d of adaptation). Fecal samples from each bull were collected in two periods of three consecutive days (d 44 to 46 and 94 to 96) at different time (0600, 1200, and 1800 h). Samples were composited by pen and analyzed for fecal starch (FS) and indigestible NDF as markers for fecal excretion. At the end of the experiment, bulls were slaughtered and the jejunum and pancreas were sampled from one bull per pen. Interaction effects were not found (<span>P</span> ≥ 0.31) for any feedlot growth performance variables (Table 1). Final BW, average daily gain, and feed efficiency (gain to feed; G:F) were greater for bulls fed REC and PRU than for those fed DGC and FGU (<span>P</span> &lt; 0.02), respectively. As a result, observed dietary net energy (NE) for maintenance and BW gain were about 7.0% and 9.0% greater for bulls fed REC diets, and 4.3% and 5.6% greater for bulls fed PRU diets, respectively. Bulls fed DGC had 2.2 times greater FS compared with bulls fed REC, resulting in lower fecal pH and total tract starch digestibility (TSD) for bulls fed DGC compared with those fed REC (<span>P</span> &lt; 0.01). Interestingly, a similar trend was observed in bulls fed PRU compared with those fed diets with FGU (<span>P</span> &lt; 0.06). Jejunal gene expression of SLC5A1 was not affected by treatments (<span>P</span> &gt; 0.14). Nevertheless, bulls fed diets with PRU presented greater jejunal α-amylase activity (<span>P</span> = 0.02). Pancreatic α-amylase activity was less when bulls were fed DGC + PRU diet. In conclusion, REC markedly improved TSD and growth performance compared with DGC. Additionally, independent of CPM, PRU inclusion as NPN source increased G:F and dietary NE concentration due to the positive effects on jejunal amylase activity and TSD.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b5683c06923db5e330cea270a786d5db180d726fb0dfce5f3e217e26af6e3f88","category":"Environment"}