{"title":"Feeding habits of splendid alfonsino Beryx splendens in the vicinity of Kuroshio, the south of Japan","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12703?af=R","date":1725339311000,"content":"<h2>Abstract</h2>\n<p>Gut contents and nitrogen isotope ratio (<i>δ</i>\n<sup>15</sup>N) analyses were conducted on splendid alfonsino <i>Beryx splendens</i> collected in the vicinity of Kuroshio from May 2015 to November 2016 (<i>n</i> = 708) to identify their feeding habits in the Western North Pacific. Micronektonic fish, shrimp, and squid were the dominant prey species, with the Decapoda <i>Acanthephyra quadrispinosa</i>, <i>Prehensilosergia prehensilis</i>, Cephalopoda <i>Enoploteuthis chunii</i>, <i>Chiroteuthis calyx</i>, Teleostei <i>Sigmops gracilis</i>, and <i>Gonostoma elongatum</i>. These micronektons are common in the Kuroshio Current; thus, <i>B. splendens</i> is a possible opportunistic feeder. Gut content weight (GCW), occurrence (%O) of fish and squid, and <i>δ</i>\n<sup>15</sup>N were significantly increased with the fork length (FL) of <i>B. splendens</i>. Only the %O of shrimp does not show a significant relationship with the FL of <i>B. splendens</i>. These indicated the ontogenetic shift of dominant prey from shrimp to fish. Fattened specimens could also prey on a greater number of fish. The seasonality of GCW and %O values was high in spring and autumn and low in summer and winter. This seasonality indicated that the feeding habits of <i>B. splendens</i> are controlled by primary productivity in the surface layer and/or by maturity. When the Kuroshio flowed in the north of Hachijojima Island, the GCW was significantly increased, and some organisms, including <i>C. calyx</i>, <i>G. elongatum</i>, and <i>S. gracilis</i>, were preyed on more. While the offshore area of the Kuroshio has low productivity, <i>B. splendens</i> can actively prey in this area, indicating that it is an important feeding ground for this species.</p>","author":"Taketoshi Kodama, \nKoichi Ishii, \nSachiko Horii, \nNatsuki Gonda, \nJunji Yonezawa, \nKazuto Ando, \nKazutaka Takahashi","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"b5697447963ad157c770f081ed2f2e3931cfa6b0ad190b47765020d8d0119f3d","category":"Environment"}