{"title":"Apple releases fifth 2nd-gen AirPods Pro firmware update in less than 2 months","link":"https://www.macworld.com/article/2163431/apple-2nd-gen-airpods-pro-firmware-updates-ios-17.html","date":1701851171000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When iOS 17 arrived in September, it brought a slew of new features including adaptive audio and conversation awareness. It also brought a slew of firmware updates, with no fewer than four arriving since September. And now Apple has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT213317&amp;xcust=1-1-2163431-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">released another one</a>, bringing the iOS 17 total to five.</p>\n\n\n\n<p>For perspective, Apple released just six AirPods firmware updates for the entirety of iOS 16, beginning with 5A374 in September 2022. Then the new 2nd-gen AirPods Pro got their own update a couple of weeks later, followed by updates in November, January, April, and May. Since 6A300/6A301 arrived alongside iOS 17 in September, Apple has released four firmware updates just for the 2nd-gen AirPods Pro, with “bug fixes and other improvements.”</p>\n\n\n\n<p>The newest update, 6B34, Is once again only for the <a href=\"https://www.macworld.com/article/1207444/airpods-pro-2022-review.html\">2nd-gen AirPods Pro</a>, which includes both the original Lightning model and the new USB-C model. There isn’t a way to force an upgrade to the new firmware; it will automatically install when the AirPods are in their case and charging. It can take hours or even days to get the latest firmware.</p>\n\n\n\n<p>To see what firmware version your AirPods are running, you can open the Settings app, select your connected AirPods (near the top), scroll down past all the options to the <em>About</em> section, and look at the <em>Version</em> line. You can also find this information in <em>General</em> &gt; <em>About</em> &gt; <em>AirPods Pro</em>.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b57688d23b1eafa4ca4c3231c2103a41a6afb5367dd0a04ebcbf961598a461db","category":"Apple"}