{"title":"Sea Level Modulation of Atlantic Nitrogen Fixation Over Glacial Cycles","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024PA004878?af=R","date":1723270783000,"content":"<h2>Abstract</h2>\n<p>N<sub>2</sub> fixation in low-latitude surface waters dominates the input of fixed nitrogen (N) to the global ocean, sustaining ocean fertility. In the Caribbean Sea, higher foraminifera-bound (FB-)δ<sup>15</sup>N indicates a decline in N<sub>2</sub> fixation during ice ages, but its cause and broader implications are unclear. Here, we report three additional Atlantic FB-δ<sup>15</sup>N records, from the subtropical North and South Atlantic gyres (MSM58-50 and DSDP Site 516) and the equatorial Atlantic (ODP Site 662). Similar glacial and interglacial δ<sup>15</sup>N in the equatorial Atlantic suggests a stable δ<sup>15</sup>N for the nitrate below the gyre thermoclines. The North Atlantic record shows a FB-δ<sup>15</sup>N rise during the ice ages, resembling a previously published FB-δ<sup>15</sup>N record from the South China Sea. The commonality among the FB-δ<sup>15</sup>N records is that they resemble sea level-driven variation in regional shelf area, with high FB-δ<sup>15</sup>N (inferred reduction in N<sub>2</sub> fixation) during periods of low shelf area. The South China Sea shows the largest δ<sup>15</sup>N signal, the subtropical North Atlantic shows less, and the South Atlantic shows the least, the same ordering as the ice age reductions in continental shelf area in the different regions. Reduced shelf sedimentary denitrification would have increased the nitrogen-to-phosphorus ratio of the nutrient supply to open ocean surface waters, leading to decreased N<sub>2</sub> fixation and thus higher gyre thermocline nitrate δ<sup>15</sup>N, explaining the higher FB-δ<sup>15</sup>N of peak ice ages. These observations identify shelf sediment denitrification as an important regional driver of modern N<sub>2</sub> fixation and imply strong basin-scale coupling of fixed nitrogen losses and inputs.</p>","author":"Alexandra Auderset, \nFrançois Fripiat, \nRoger C. Creel, \nLukas Oesch, \nAnja S. Studer, \nJanne Repschläger, \nEd Hathorne, \nHubert Vonhof, \nRalf Schiebel, \nLaura Gordon, \nKira Lawrence, \nHaojia Abby Ren, \nGerald H. Haug, \nDaniel M. Sigman, \nAlfredo Martínez‐García","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"b57a7671873bdfde39e72138fb666ef728c55b4c03b883c7f659ce7987bc00b6","category":"Environment"}