{"title":"PSIX-20 Effect of protein and starch level on N balance and ruminal fermentation parameters in steers consuming low-quality forage: Bos taurus indicus","link":"https://academic.oup.com/jas/article/102/Supplement_3/737/7757853?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Despite the global importance of <span>Bos taurus indicus</span> production systems for converting low-quality forage to high-quality human consumable products, their responses to supplementation are not well characterized. Low-quality forage lacks the N necessary to support microbial activity and even correcting this deficiency may still fail to provide sufficient energy to meet animal requirements. Therefore, addition of starch may be warranted to increase animal performance and volatile fatty acid (VFA) production. Accordingly, our objective was to determine the effect starch supplementation on N balance and ruminal fermentation parameters in <span>Bos taurus indicus</span> steers. Accordingly, ruminally cannulated Brahman steers [n = 5; body weight (BW) = 420 ± 55 kg] were used in a 4 × 4 Latin square to evaluate the effect of increasing supplemental starch when consuming King Ranch Bluestem hay (3.5% CP, 73% NDF). Four supplements were formulated to be isonitrogenous (130 mg N/kg BW) and provide similar amounts of ruminally degradable protein while supplying increasing levels of starch (2% starch = 100% soybean meal; 20% starch = 26.3% corn, 73% soybean meal, 0.7% urea; 38% starch = 51.6% corn, 47% soybean meal, 1.4% urea; 56% starch = 78.6% corn, 19% soybean meal, 2.4% urea). Five 14-d periods were conducted, consisting of 9 d adaptation and 4 d to measure intake and digestion, and 1 d for ruminal fermentation. Supplemental N intake decreased linearly (<span>P</span> = 0.02) with increasing starch as the crude protein content of the soybean was underestimated. Forage and total N intake were not affected by starch level (<span>P</span> ≥ 0.27). Fecal and total urinary N excretion were not different between starch levels (<span>P</span> ≥ 0.20). Urinary ammonia-N decreased quadratically (<span>P</span> = 0.03) as a percentage of total N excretion, 9.5, 5.4, 5.8, and 6.9%, for 2, 20, 38, and 56% starch, respectively. In contrast, there were no significant effects of treatment (<span>P</span> ≥ 0.30) on urinary urea excretion. Level of starch had no effect on N retention and absorption (<span>P</span> ≥ 0.14). A treatment × time interaction was observed for ruminal ammonia (<span>P</span> &lt; 0.01) with concentrations peaking at h 4. The greatest ruminal ammonia was observed at h 4 for 56% starch it decreased markedly between h 4 and 8 and remained low thereafter. There was a small quadratic (<span>P</span> = 0.04) decrease in molar proportion of acetate. No other significant effects on VFA molar proportions, total VFA concentration, or ruminal pH were observed (<span>P</span> ≥ 0.12). In conclusion, providing increasing levels of supplemental starch to <span>Bos taurus indicus</span> steers consuming low-quality forage did not significantly affect N balance or VFA concentrations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b57be8f47b5a67168becefbcde647a84c3d1d18b6f1cc1e15d225fa49b15a662","category":"Environment"}