{"title":"Taphonomic signatures of early scavenging by black and turkey vultures","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307610","date":1723644000000,"content":"<p>by Marian L. Wahl, Grant N. Burcham, Amanda M. Herbert, Lee A. Humberg, Patrick A. Zollner, Landon R. Jones, Brandon M. Quinby, Bryan M. Kluever</p>\r\n\r\nScavenging is critical for nutrient cycling and maintenance of healthy ecosystems. While there is substantial research into the identification of taphonomic signatures from facultative mammalian scavengers, early stage scavenging signatures by vultures remain unknown. Further, some vulture species are opportunistic predators, highlighting the need to define signatures observed in the course of normal scavenging behavior. We placed stillborn neonatal calves in an unoccupied pasture and used motion-trigger camera traps to quantify scavenging effort, then conducted necropsies to evaluate the effect of black vulture (<i>Coragyps atratus</i>) and turkey vulture (<i>Cathartes aura</i>) scavenging effort on carcass consumption. We measured the order of consumption of different tissue types to delineate which anatomic structures vultures consume first. Scavenging trials with higher numbers of vultures feeding on the carcass for longer were associated with decreased remaining tongue and abdominal viscera, and a larger umbilical wound. Greater maximum flock sizes were associated with decreased remaining tongue and abdominal viscera, a larger umbilical wound, and greater biomass consumption. Black vultures targeted the perineum and tongue earlier, while turkey vultures targeted the eyes, perineum, and tongue. These results are consistent with the idea that vultures prefer tissues that are easy to access and contain high nutrient content. These patterns form a distinctive taphonomic signature that can be used to identify early scavenging by black and turkey vultures. Our results demonstrate that criteria commonly used to identify livestock depredation by black vultures only document vulture presence and not predation. This distinction implies that new and more definitive criteria need to be developed and put into practice for more accurate decision criteria in livestock depredation compensation programs.","author":"Marian L. Wahl","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b585c98a770eccfe092e1a855909b0630d8bc67e1549dd62a4fe2d9445fbdc84","category":"Interdisciplinary"}