{"title":"The Accuracy and Utility of Nasal FeNO Measurement with Handle Device in Patients with Allergic Rhinitis: A Single Center Study","link":"https://www.preprints.org/manuscript/202403.1603/v1","date":1711460229000,"content":"Objective: This study aimed to demonstrate the availability of portable devices for nasal FeNO measurement, which could replace exhaled NO measurement based on the continuous aspiration of multiple flow measurement systems. Methods: A descriptive cross-sectional study. The healthy subjects without rhinosinusis disorders (control group) and those with diagnosed allergic rhinitis (AR group) were enrolled in the study. They underwent nasal and bronchial FeNO measurements by both fixed flow NObreath® connected to nasal mask and multiple flows HypAir FeNO®. Results: A total of 153 people were recruited including 63 healthy subjects and 90 subjects with AR. There were no statistically significant differences in anthropometric characteristics between the two groups (P &gt; 0.05). There were a significant increase in FeNO values in the AR group compared to the control group; concentrations of nasal and bronchial FeNO mearsured by NObreath®  were 76.0 ± 50.7 ppb (vs 36.0 ± 28.1 ppb, P &lt; 0.01) and 32.3 ± 15.4 ppb (vs 9.2 ± 5.6 ppb, P &lt; 0.001), and those mearsured by NObreath® Hypair FeNO® were 1796.9 ± 523.3 ppb (vs 400.2 ± 123.1 ppb, P &lt; 0.001) and 37.3 ± 23.0 ppb (vs 17.4 ± 18.3 ppb, P &lt; 0.01). A weak correlation between the values measured by NObreath® and Hypair FeNO® devices was observed (r = 0.023 and r = 0.089, respectively; p &lt; 0.05). Conclusions: The handheld NObreath® device is effective in measuring FeNO concentrations in both normal subjects and AR patients. The advantages in price and size, creating a compact, low-cost device that is convenient for use and research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b588236d0b1153f34e337c6aaaad2818a5f366bea325d18316ff7e92192add3e","category":"Interdisciplinary"}