{"title":"Feasibility and reliability of fetal two dimensional speckle tracking echocardiography at 16 weeks gestational age: A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302123","date":1713362400000,"content":"<p>by Thomas J. Nichting, Zoé A. van Lier, Chantelle de Vet, Myrthe van der Ven, Daisy A. A. van der Woude, Sally A. Clur, Noortje H. M. van Oostrum, S. Guid Oei, Judith O. E. H. van Laar</p>\r\nBackground <p>Fetal two-dimensional speckle tracking echocardiography (2D-STE) is an emerging technique for assessing fetal cardiac function by measuring global longitudinal strain. Alterations in global longitudinal strain may serve as early indicator of pregnancy complications, making 2D-STE a potentially valuable tool for early detection. Early detection can facilitate timely interventions to reduce fetal and maternal morbidity and mortality. Therefore, the aim of this study was to investigate the feasibility of performing 2D-STE at 16 weeks gestational age.</p> Methods <p>This pilot study utilized 50 ultrasound clips of the fetal four-chamber view recorded between 15+5 and 16+2 weeks gestational age from a prospective cohort study. A strict protocol assessed three parameters essential for 2D-STE analysis: fetal four-chamber view ultrasound clip quality, region of interest, and frame rates. Two independent researchers measured global longitudinal strain in all adequate fetal four-chamber view ultrasound clips to determine inter- and intra-operator reliability.</p> Results <p>Out of the 50 ultrasound clips, 37 (74%) were feasible for 2D-STE analysis. The inter-operator reliability for global longitudinal strain measurements of the left and right ventricles was moderate (ICC of 0.64 and 0.74, respectively), while the intra-operator reliability was good (ICC of 0.76 and 0.79, respectively).</p> Conclusions <p>Our findings demonstrate that fetal 2D-STE analysis at 16 weeks gestational age is feasible when adhering to a strict protocol. However, further improvements are necessary to enhance the inter- and intra-operator reliability of 2D-STE at this gestational age.</p>","author":"Thomas J. Nichting","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b58b64e98571a299bf3fc698bec958d8249cc14b09549a64dbf3ee305c19ad8a","category":"Interdisciplinary"}