{"title":"Dimensions of caregiver strain may partially mediate the relationship between youth symptomology and counseling utilization among Latinxs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302575","date":1714140000000,"content":"<p>by Alejandro L. Vázquez, Demi Culianos, Omar G. Gudiño, Cynthia M. Navarro Flores, Tyson S. Barrett, Melanie M. Domenech Rodríguez</p>\r\n\r\nWhether Latinx families use youth mental health services (MHS) depends on complex influences of barriers and facilitators within and outside of the home. This research sought to shed light on caregiver strain as part of the equation focused on parental identification and responses to youth mental health needs. We examined multiple dimensions of caregiver strain as potential mediators between youth mental health symptom severity and psychological counseling utilization. The present sample consisted of 598 Latinx caregivers to youths ages 6–18 who provided information on youth internalizing and externalizing problems, caregiver strain, and youth psychological counseling service utilization within the last year. Our findings suggest that youth symptom severity (internalizing and externalizing problems) was generally positively associated with dimensions of caregiver strain. Youth symptom severity through <i>objective</i> and <i>subjective internalized strain</i> pathways were associated with greater odds of youth MHS utilization. In contrast, youth symptom severity through <i>subjective externalized strain</i> reduced the odds that Latinx caregivers would report utilizing youth MHS. These models only partially mediated the relationship between youth problems and service use. Findings suggest that Latinx caregivers may navigate conflicting sources of strain related to their child’s mental health problem severity in ways that may differentially impact the odds that they access youth MHS. Along with addressing structural and systemic barriers to care, utilization of psychological counseling services may also be improved through interventions that help Latinx caregivers view youth services as avenues for addressing caregiver strain and providing psychoeducation that frames externalized strain within a mental health lens.","author":"Alejandro L. Vázquez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b58f9acf1fa39d9c1782372ec2dad26a4336225c47eef8ac1574690e502b9072","category":"Interdisciplinary"}