{"title":"Fossil fuel combustion kills more than 1 million people every year, study says","link":"https://arstechnica.com/?p=1821222","date":1639687231000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-83498986-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-83498986.jpg\">Enlarge</a> <span>/</span> Coal smoke and steam vapor pour out of the Bruce Mansfield Power Plant across from a largely abandoned children's park on September 11, 2008, in Shippingport, Pennsylvania. After two enormous toxic coal soot discharges in 2006 and 2007, the children's park was rarely used. The 2,460 MW coal-fired  plant wasn't fully decommissioned until November 2019. (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Robert+Nickelsberg\">Robert Nickelsberg/Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Burning fossil fuels kills more than 1 million people ever year, according to a <a href=\"https://www.healtheffects.org/publication/global-burden-disease-major-air-pollution-sources-gbd-maps-global-approach\">new study</a> that examined the worldwide health effects of fine particulate pollution, also known as PM2.5.</p>\n<p>Coal, which produces sooty, particulate-laden pollution, is responsible for half of those deaths, while natural gas and oil are responsible for the other half. Some 80 percent of premature deaths due to fossil fuel combustion takes place in South Asia or East Asia, the report said.</p>\n<p>“Our key objective was to identify major sources of PM2.5 pollution and to understand how these sources change around the world,” Erin McDuffie, the study’s lead author and a research associate at Washington University, said in a statement. “In some countries, our results are some of the first pieces of information they have on the major sources in their region.”</p></div><p><a href=\"https://arstechnica.com/?p=1821222#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821222&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b5910875eb78d449b961409d976de5afce82e0c4083c11fc623ffa52bf6cf74d","category":"Tech"}