{"title":"Apple Savings Users Complain of Delays Withdrawing Money","link":"https://www.macrumors.com/2023/06/01/apple-savings-money-withdrawal-issues/","date":1685639136000,"content":"<a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> customers who have opted to create a high-yield Apple Savings account through Goldman Sachs have been experiencing issues attempting to withdraw their money, according to a report from <em><a href=\"https://www.wsj.com/amp/articles/apple-savings-account-customers-say-its-hard-to-get-their-money-out-of-goldman-sachs-bd8b9ccb\">The Wall Street Journal</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-card-savings-account-16x9.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nMultiple customers who transferred thousands of dollars to the Apple Savings account have had to wait weeks for money transfers in some cases, and some customers have also had money disappear. Kevin Smyth from Minnesota, for example, attempted to transfer $10,000 from his Apple account to U.S. Bank in mid-May, but Goldman Sachs would not complete the transfer.\r<br />\n\r<br />\nCustomer representatives suggested he contact U.S. Bank, but U.S. Bank said there was no incoming transaction. Later, he was told that Goldman Sachs had placed his account under a security review. Another customer, Nathan Thacker of Atlanta, tried to transfer $17,000 from his Apple Savings account to JPMorgan Chase on May 15, and it took more than two weeks for the transaction to complete.\r<br />\n\r<br />\nIn a statement to <em>The <a href=\"https://www.macrumors.com/guide/wsj-com/\">Wall Street Journal</a></em>, Goldman Sachs said some customers had experienced delays due to security processes designed to protect customer deposits.<blockquote>\"The customer response to the new savings account for Apple Card users has been excellent and beyond our expectations. While the vast majority of customers see no delays in transferring their funds, in a limited number of cases, a user may experience a delayed transfer due to processes in place designed to help protect their accounts.\"</blockquote>According to <em>The ‌Wall Street Journal‌</em>, transferring large amounts of money that make up much of a newly-opened account's balance can trigger anti-money-laundering alerts, resulting in delays that last around five days. Some of the issues may be caused by the newness of the Savings account.\r<br />\n\r<br />\nApple Savings account users who have had issues and who have contacted Goldman Sachs have said that the customer service has been poor, with customers receiving varying information with each call.\r<br />\n\r<br />\nOpening a high-yield Apple Savings account requires an ‌Apple Card‌, and it offers a competitive 4.15 percent interest rate. Opening up a new savings account takes just minutes to do, and it is also designed to aggregate all Daily Cash earned through the ‌Apple Card‌.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/01/apple-savings-money-withdrawal-issues/\">Apple Savings Users Complain of Delays Withdrawing Money</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-savings-users-complain-of-delays-withdrawing-money.2391282/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b595b687e517bb9aed152d257d2473508bb5426c6a4a473e45a374ed0a339ee3","category":"Apple"}