{"title":"Apple's Flagship Mumbai Store to Open in April, Followed by Second Store in New Delhi","link":"https://www.macrumors.com/2023/03/20/apple-mumbai-store-opening-april/","date":1679314622000,"content":"Apple will open its flagship India retail store in Mumbai next month, after several delays, soon to be followed by another store in New Delhi, reports <em><a href=\"https://economictimes.indiatimes.com/industry/cons-products/electronics/apple-to-open-flagship-india-store-in-mumbai-in-april-second-store-to-come-up-in-delhi/articleshow/98723300.cms\">The Economic Times</a></em>, citing industry executives.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/08/apple-india.jpg\" alt width=\"2304\" height=\"1296\" />\r<br />\nLocated in the Jio World Drive mall and covering 22,000 square feet, the Mumbai store will be a retail landmark similar to Apple stores in Los Angeles, New York, Beijing, and Singapore. \r<br />\n\r<br />\nThe second, smaller 10,000 to 12,000-square-feet store in New Delhi's Select CityWalk mall is expected to launch in April-June, potentially just a few days after the Mumbai store opening, according to the paper's sources. Apple stared hiring for the stores in <a href=\"https://www.macrumors.com/2023/01/09/apple-hires-retail-store-staff-india/\">January</a>.\r<br />\n<blockquote>\"Fitouts are completed for both the stores,\" the person said. \"In fact, the fitout was completed for the Delhi store ahead of the Mumbai one.\" \r<br />\n\r<br />\n\"But since Mumbai will be the flagship Apple Store in India, it will open first next month. The Delhi one will open soon after,\" said the industry executive. </blockquote>India has become more important at Apple over the last few years due to the growing demand for Apple products. In 2020 Apple <a href=\"https://www.macrumors.com/2023/01/09/apple-hires-retail-store-staff-india/\">opened its online store in India</a>, offering Indian customers a direct way to purchase products directly from Apple without having to go through an authorized premium reseller. \r<br />\n\r<br />\nWhile most people in India use Android devices, it is the second largest smartphone market in the world and Apple has the potential to make inroads with more affordable product options.\r<br />\n\r<br />\nApple has started producing some iPhone models in India, including the iPhone 14, as it looks to diversify beyond China. Apple supplier Foxconn has invested $500 million in the country to boost production capabilities.\r<br />\n\r<br />\nIndia has been one of the best-performing markets for Apple over the last few years. In the quarter ended December, the company achieved record overall sales in the country. India is also set to be its own sales region within Apple, which will give the country \"increased prominence\" within the company, <a href=\"https://www.macrumors.com/2023/03/08/apple-india-focus-international-sales/\">according to one report</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/india/\">India</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/20/apple-mumbai-store-opening-april/\">Apple's Flagship Mumbai Store to Open in April, Followed by Second Store in New Delhi</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-flagship-mumbai-store-to-open-in-april-followed-by-second-store-in-new-delhi.2384189/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b59b648db8e0177b99bf4618d29323374ce7766ab18fd384748875daf60915d6","category":"Apple"}