{"title":"New Zwift Cog widens compatibility and brings virtual shifting to brand’s smart trainer","link":"https://www.bikeradar.com/news/new-zwift-hub-one/","date":1697036414000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/FotoJet-92408f4.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Zwift Cog and Zwift Click\" title=\"Zwift Cog and Zwift Click\" />                                            <p>Zwift has announced the Zwift Hub One, an updated version of its highly-rated smart trainer, the Zwift Hub, with a new freehub attachment that allows “almost any” bike with an 8- to 12-speed drivetrain to be mounted on it.</p>\n<p>The Zwift Hub One differs from the standard <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/zwift-hub-review/\">Zwift Hub</a> through its use of the new Zwift Cog.</p>\n<p>The Zwift Cog replaces the <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">freehub</a> – the splined part to which you would normally mount a <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">bike cassette</a> –  on the Zwift Hub with a single-speed component.</p>\n<p>Variable gearing is then taken care of by the Zwift Hub through virtual shifting, which can be enabled with the latest firmware.</p>\n<p>Zwift says the Hub’s new virtual gearing has an extra wide range with “minimal jumps” between each of its 24 virtual gears.</p>\n<p>This means no matter what drivetrain your bike is running, you should have enough high and low gears for everything Zwift’s virtual terrain can throw at you.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub One\" title=\"Zwift Hub One\" />\n\n</div><div><figcaption><span><i></i> The new Zwift Hub One is compatible with “almost any” bike with an 8- to 12-speed drivetrain.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>A wireless shifter called the Zwift Click is included with the Zwift Hub One.</p>\n<p>Alternatively, virtual shifting can be enabled with existing Zwift Hub smart trainers – without the new Zwift Cog – using the recently launched <a href=\"https://www.bikeradar.com/reviews/training/gadgets/zwift-play-first-ride-review/\">Zwift Play</a> controllers (available separately), simply by upgrading to the latest firmware on both devices.</p>\n<p>Virtual shifts are claimed to be both instantaneous and silent and can be activated under load without the risk of chain skips or drops.</p>\n<p>The Zwift Hub One is available now for £549 / $599 / €599, including the Zwift Cog, Zwift Click and a year’s subscription to the <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift app</a>.</p>\n<p>The Zwift Cog and Click can be purchased separately as a bundle – to upgrade an existing Zwift Hub – for a promotional price of £59.99 / $59.99 / €59.99, for a limited time only.</p>\n<h2>Zwift Cog</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub One\" title=\"Zwift Hub One\" />\n\n</div><div><figcaption><span><i></i> The Zwift Cog is a single-speed freehub replacement that significantly widens the Zwift Hub’s compatibility.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>The Zwift Cog replaces the Shimano HG-compatible freehub on the Zwift Hub with a single-speed component called the Zwift Cog.</p>\n<p>On the Zwift Hub One, this comes pre-installed, but the Zwift Cog can also be purchased separately and installed on existing Zwift Hub smart trainers.</p>\n<p>It uses a 14t cog which is said to be compatible with almost any 8- to 12-speed bike.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub One\" title=\"Zwift Hub One\" />\n\n</div><div><figcaption><span><i></i> The Zwift Hub One has a Zwift Cog pre-installed, and uses the Hub’s new virtual drivetrain to simulate variable gearing.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>This is designed to simplify the experience of using multiple bikes running different groupsets on the Zwift Hub. It negates the need to swap the cassette (and potentially freehub) when switching between bikes with differing gear ranges.</p>\n<p>The Zwift Cog is user-serviceable and can be disassembled to replace the cog (should it wear out) using a standard cassette lockring tool.</p>\n<p>Zwift says the Hub’s virtual drivetrain has 24 discrete gears, simulating a gear ratio range from 0.75 to 5.49.</p>\n<p>That’s roughly equivalent to a 30-tooth chainring paired with a 40t cassette sprocket at the lowest end, all the way up to a monstrous 55x10t gear at the high end.</p>\n<p>According to Zwift, this can be especially useful for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a>, which typically use smaller front chainrings than road bikes.</p>\n<p>With virtual shifting enabled, Zwift says you’ll no longer spin out on fast flats or downhills from not having big enough gears.</p>\n<p>Zwift says the Hub automatically calibrates at the start of every ride, ensuring the virtual gear range feels the same even if you swap to a bike with a different size front chainring.</p>\n<h3>Zwift Click</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Click\" title=\"Zwift Click\" />\n\n</div><div><figcaption><span><i></i> The Zwift Click is included with the Zwift Hub One and Zwift Cog.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Zwift Click is a wireless shifter for the Zwift Hub’s new virtual drivetrain. It is included with the Zwift Hub One and Zwift Cog.</p>\n<p>It uses two buttons, with a simple “+” or “-” to shift to a harder or easier gear.</p>\n<p>The “+” button features a micro-dot texture while the “-” button is smooth. This helps to differentiate the buttons by touch, negating the need to look at the unit itself.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Click\" title=\"Zwift Click\" />\n\n</div><div><figcaption><span><i></i> The Zwift Click uses simple elastic bands to mount on handlebars.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>The Zwift Click uses Bluetooth to communicate and can be connected to smartphones via the Zwift Companion app to check and update its firmware.</p>\n<p>It also features an LED status light which can show different colours to confirm it is switched on and connected, or the battery is low.</p>\n<p>The Zwift Click mounts via rubber bands, in a similar manner to a band-on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">bike computer</a> mount.</p>\n<p>Zwift says the Zwift Click can be mounted to road, mountain bike and <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bike</a> handlebars.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Click on a drop handlebar\" title=\"Zwift Click\" />\n\n</div><div><figcaption><span><i></i> Zwift Click can be positioned wherever you choose.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>It features a user-replaceable CR2032 coin cell battery, and has a claimed battery life of “approximately 100 hours”.</p>\n<p>After an unspecified time period, the bundle price will rise to £79.99 / $79.99 / €79.99.</p>\n<h2>Zwift Play integration</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Play\" title=\"Zwift Play\" />\n\n</div><div><figcaption><span><i></i> Zwift Play can be used to activate the Hub’s virtual drivetrain without a Zwift Cog.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>While there’s no option to use wireless electronic gear shifters from the major groupset manufacturers (<a href=\"https://www.bikeradar.com/brand/sram/\">SRAM</a>, <a href=\"https://www.bikeradar.com/brand/shimano/\">Shimano</a> or <a href=\"https://www.bikeradar.com/brand/campagnolo/\">Campagnolo</a>) to control the Zwift Hub’s virtual drivetrain, Zwift says its Play controllers can also be used to enable virtual shifting even if you don’t have a Zwift Cog.</p>\n<p>All that’s needed is to update the Zwift Hub and Play controllers to the latest firmware (via the Zwift Companion app), and virtual shifting will become an optional setting accessible via the in-game settings menu.</p>\n<p>If using a standard cassette and <a href=\"https://www.bikeradar.com/news/zwift-play/\">Zwift Play</a> instead of the Zwift Cog, Zwift says it’s important not to shift your real gears while virtual shifting is turned on.</p>\n<p>This is because the Zwift Hub calculates the gear ratios for your bike at the beginning of each ride, in order to give you the correct virtual gear range, and shifting your real gears would alter the virtual gear ratios.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Play\" title=\"Zwift Play\" />\n\n</div><div><figcaption><span><i></i> When using the Hub’s virtual drivetrain with the Zwift Play controllers and a standard cassette, Zwift says it’s important not to shift your real gears while riding.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift recommends picking a gear with a good chain line – such as a cog in the middle of the cassette and the inner chainring on a 2x-equipped bike.</p>\n<p>If you have both the Zwift Click and Zwift Play, Zwift says both devices can be paired to the Zwift app simultaneously, allowing the Click shifter to be used as a satellite shifter in addition to shifting with Zwift Play.</p>\n<p>The Zwift Play controllers will cost £149 / $149 / €149, but they are currently on sale for £99 / $99 / €99 for a limited time while the product is in beta mode.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b59db559bdb3652830a7407bb4b2c856005b77402cd63f29d3e73916a9bc1b0f","category":"Cycling"}