{"title":"Subclinical Maternal Pathologies with Clinical Manifestation in the Offspring","link":"https://www.preprints.org/manuscript/202408.1471/v1","date":1724230226000,"content":"It is documented that maternal diseases or treatments influence a newborn’s clinical status at birth; autoimmune diseases with circulating antibodies are often clinically expressed transiently in newborns due to the crossover of the specific IgG through the placenta during pregnancy. The offspring can inherit maternal genetic anomalies, but clinical expression usually becomes patent later in life. If prenatal medical history is not available or if signs or symptoms of a mother’s disease are revealed for the first time during pregnancy or postpartum, their effects on the newborn may be misattributed.\nIn this article, we present three cases of pregnant women, without any known pathology before or during pregnancy, who gave birth to very sick preterm newborns that required admission to the Neonatal Intensive Care Unit (NICU). The neonates’ complications were considered initially as consequences of prematurity or infection, but later investigations revealed transient autoimmune disease in two of the cases (myasthenia gravis and hyperthyroidism) and a severe form of thrombophilia in the third case. In all cases, mothers were asymptomatic and unaware of their subclinical disease. \n\tPreemies’ diagnosis has contributed to the identification of their mothers’ pathology and adequate treatment was prescribed with favourable short- and long-term outcomes. In one of the cases (myasthenia gravis) both mother and child had associated infectious diseases in the perinatal period that complicated the clinical picture and created problems of diagnosis. \nThis article intends to emphasize the paramount importance of prenatal care, for both mother and newborn. Repeated medical visits and investigations throughout the pregnancy are a good opportunity to detect subclinical diseases or predispositions. As newborns usually develop non-specific signs, one should have experience and pay attention to differentiate among etiologies. Our paper takes a reversed approach to the usual medical diagnosis pathway: from infant to mother instead of mother towards the infant, proving that inter-speciality collaboration can work bi-directionally.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b5a78c698a845be4c2bcebc60b133c6fcee0671509cfc4ee19cd37674d0723e5","category":"Interdisciplinary"}