{"title":"iOS 15: How to use the awesome new Live Text feature","link":"https://www.macworld.com/article/351094/ios-15-how-live-text-camera-photos-safari.html","date":1626340500000,"content":"\n<div>\n<section><div></div></section><p>Have you ever wanted to copy/paste text from the <em>real world?</em> Maybe you want to capture everything off a company whiteboard. Perhaps there’s a signboard of specials at a restaurant that you want to text to your friend. Maybe you want to quickly call a phone number you see on a sign. </p>\n\n\n\n<p>With iOS 15, Apple has implemented an incredibly good system for recognizing and capturing real-world text. It’s called Live Text and it’s built right into Camera, Photos, even Safari. Here’s how you use it.</p>\n\n\n\n<hr /><p><em><a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">For more tips, tricks, news, features, and updates, check out our iOS 15 superguide</a></em></p>\n\n\n\n<hr /><h2>Using Live Text in Camera</h2>\n\n\n\n<p>In order to use Live Text, you’ll need an iPhone XS or newer in addition to iOS 15. Check out our guide for more on <a href=\"https://www.macworld.com/article/348528/ios-15-public-beta-ipados-15-macos-monterey-features-devices-facetime-spatial-audio-siri-dictation-universal-control.html\">which iOS 15 features work on which devices</a>.</p>\n\n\n\n<p>To use Live Text in the Camera app, just point the camera at something with text in it. You’ll see a yellow bracketed box around the text area, and a small circular button in the lower right—it looks like lines of text with brackets around it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-live-text-camera.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Look for the text button in the lower right, and tap it to enable text selection.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Tap that button and the Camera app will break out the text in the brackets. You can then select whichever text you want by simply swiping across it, the same way you would select text in any app: You can copy the text, select all, look up terms online. It’s even smart enough to recognize addresses, phone numbers, and email addresses so you can find it in maps, start a phone call, or start an email with a single tap.</p>\n\n\n\n<h2>Using Live Text in Photos</h2>\n\n\n\n<p>Live Text in the Photos app works essentially the same as the Camera app. If there’s any recognized text in the photo, you’ll see that same Live Text button in the lower right (the text lines with brackets around it). </p>\n\n\n\n<p>Just tap that button to recognize and highlight all the text in the image. You can select text by dragging across it, copy it, tap on phone numbers to call them, tap addresses to see them in Maps, or email addresses to start an email.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-live-text-photos.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Look for the Live Text button in the Photos app, too. It works just like in Camera.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Using Live Text in Safari</h2>\n\n\n\n<p>Obviously, you can select text on a web page in Safari without doing anything special. But with iOS 15, you can select text in images as well.</p>\n\n\n\n<p>Simply press-and-hold on any image in a web page until the context menu pops up. You’d normally see options to Share, Add to Photos, or Copy an image. But now you’ll see an additional option: Show Text. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-live-text-safari.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>In Safari, long-press on an image to bring up the context menu, then select Show Text to enter Live Text mode.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Select that option and the image will be focused on, with the text highlighted. You can then select it as you do text in any app: by tapping and holding, then dragging the selection box around the text you want. Just as in the Camera and Photos apps, it will recognize addresses, phone numbers, and email addresses.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b5ab4ba64c46ec81ec48e989624eaed13007e739e9e69fd5c378852f7f9d2876","category":"Apple"}