{"title":"The effects of dance interventions on physical function and quality of life among middle-aged and older adults: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301236","date":1713535200000,"content":"<p>by Jingting Lu, Nur Athirah Abd Rahman, Matthew Wyon, Shazlin Shaharudin</p>\r\nBackground <p>Fundamental physical functions such as postural control and balance are vital in preserving everyday life, affecting an individual’s quality of life. Dance is a physical activity that offers health advantages across various life stages. Nevertheless, the effects of dance interventions on physical function, postural control, and quality of life among older adults have remained underexplored. The review aimed to examine the strength of evidence for dance interventions on physical function and quality of life among middle-aged and older adults.</p> Methods <p>A systematic review was conducted across four databases (PubMed, Cochrane Library, Web of Science, and Medline), focusing on studies involving more than four weeks of dance interventions. MeSH terms [dance or dance intervention or dance rehabilitation or dance movement] and [motor function or functional capacity or postural control or functional mobility or mobility or postural balance or balance or flexibility or gait] and [well-being or quality of life or life satisfaction] were utilized in the search. This review was registered in the PROSPERO database (CRD42023422857). Included studies were assessed using the Cochrane Risk of Bias.</p> Results <p>The search revealed 885 studies, and 16 met the inclusion criteria. The effects of various dance genres on physical functions and quality of life were compared. Most studies showed that dance intervention improved physical function, balance, postural control and quality of life. Dance intervention showed a high level of adherence compared to physiotherapy, self-care, conventional therapy, and aerobic and resistance exercise.</p> Conclusion <p>In terms of improving physical function and quality of life, structured dance is a safe and relatively effective alternative to exercise. Note the effect of movement selection and intensity in the dance interventions. Dance with music may increase participants’ interest, encouraging more physical activity among middle-aged and older adults.</p>","author":"Jingting Lu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b5ad59230d2ff9c5b7c91fdb005cb3578e31a1a5f84936736bbdb748cc2c9a83","category":"Interdisciplinary"}