{"title":"The Ne/N ratio in applied conservation","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13695?af=R","date":1715151600000,"content":"<h2>Abstract</h2>\n<p>Recent developments within the IUCN and the Convention on Biological Diversity have affirmed the increasingly key role that effective population size (<i>N</i>\n<sub>\n   <i>e</i>\n</sub>) and the effective size: census size ratio (<i>N</i>\n<sub>\n   <i>e</i>\n</sub>/<i>N</i>) play in applied conservation and management of global biodiversity. This paper reviews and synthesizes information regarding the definition of <i>N</i>\n<sub>\n   <i>e</i>\n</sub> and demographic and genetic methods for estimating effective size, census size, and their ratio. Emphasis is on single-generation estimates of contemporary <i>N</i>\n<sub>\n   <i>e</i>\n</sub>/<i>N</i>, which are the most informative for practical applications. It is crucial to clearly define which individuals are included in the census size (<i>N</i>). Defining <i>N</i> as the number of adults alive at a given time facilitates comparisons across species. For a wide range of applications and experimental designs, inbreeding <i>N</i>\n<sub>\n   <i>e</i>\n</sub> is simpler to calculate and interpret than variance <i>N</i>\n<sub>\n   <i>e</i>\n</sub>. Effects of skewed sex ratio are generally modest, so most reductions to <i>N</i>\n<sub>\n   <i>e</i>\n</sub>/<i>N</i> arise from overdispersed (greater-than-Poisson) variance in offspring number (σk2$$ {\\sigma}_k^2 $$). Even when fecundity changes with age, overdispersed within-age variance generally contributes most to overall σk2$$ {\\sigma}_k^2 $$, and both random and deterministic (mediated by selection) factors can be important. Most species are age-structured, so it is important to distinguish between effective size per generation (<i>N</i>\n<sub>\n   <i>e</i>\n</sub>) and the effective number of breeders in one season or year (<i>N</i>\n<sub>\n   <i>b</i>\n</sub>). Both <i>N</i>\n<sub>\n   <i>e</i>\n</sub> and <i>N</i>\n<sub>\n   <i>b</i>\n</sub> are important for applied conservation and management. For iteroparous species, a key metric is variance in lifetime reproductive success (σk•2$$ {\\sigma}_{k\\bullet}^2 $$), which can be affected by a variety of additional factors, including variation in longevity, skip or intermittent breeding, and persistent individual differences in reproductive success. Additional factors that can be important for some species are also discussed, including mating systems, population structure, sex reversal, reproductive compensation, captive propagation, and delayed maturity.</p>","author":"Robin S. Waples","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"b5bb921baf1e0b92226ad950eafc63a06f3ef56dce15a6c6f391602269e864bb","category":"Environment"}