{"title":"Terraform Cloud adds Vault-backed dynamic credentials","link":"https://www.hashicorp.com/blog/terraform-cloud-adds-vault-backed-dynamic-credentials","date":1682352000000,"content":"<p>In March 2023, we announced the <a href=\"https://www.hashicorp.com/blog/dynamic-provider-credentials-now-ga-for-terraform-cloud\">general availability of dynamic provider credentials in HashiCorp Terraform Cloud</a>. This feature automates the creation of short-lived credentials for the officially supported cloud providers (Amazon Web Services, Microsoft Azure, and Google Cloud) and the HashiCorp Vault provider. Initially, the Vault integration supported only static secrets engines for use within Terraform configurations. Today, we’re excited to announce Vault-backed dynamic credentials, a native integration between Terraform Cloud dynamic provider credentials and the <a href=\"https://www.vaultproject.io/use-cases/dynamic-secrets\">Vault dynamic secrets engines</a> for AWS, Azure, and Google Cloud.</p>\n\n<p>Vault-backed dynamic credentials represent a significant enhancement for our many customers already using Vault for on-demand cloud access and for any organization seeking to reduce the risks of managing credentials. <a href=\"https://www.hashicorp.com/products/vault\">HashiCorp Vault</a> is a centralized identity-based management system for all types of secrets. Unifying these two capabilities provides a seamless approach for securing your cloud provisioning workflows.</p>\n\n<h2>Better together</h2>\n\n<p><a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/dynamic-provider-credentials\">Dynamic provider credentials</a> in Terraform Cloud eliminates the risks associated with storing long-lived credentials and avoids the operational burdens of manually rotating them.</p>\n\n<p>Vault-backed dynamic credentials in Terraform Cloud combines dynamic provider credentials with <a href=\"https://developer.hashicorp.com/vault/docs/secrets\">Vault secrets engines</a> to offer a consolidated workflow. This approach authenticates Terraform runs to Vault using workload identity tokens generated by Terraform Cloud, then uses Vault secrets engines to generate dynamic credentials for the AWS, Azure, and Google Cloud providers.</p>\n<img src=\"https://www.datocms-assets.com/2885/1682348441-vault-backed-dynamic-creds.png\" alt=\"Vault-backed\" /><p>First, Terraform Cloud runs are authenticated to Vault with industry-standard OpenID Connect (OIDC) workload identity tokens, using Vault’s <a href=\"https://developer.hashicorp.com/vault/docs/auth/jwt\">JWT/OIDC auth method</a>. Then, Vault uses the configured dynamic secrets engine for AWS, Azure, or Google Cloud to generate a short-lived cloud credential that is unique to the Terraform run phase. This credential is injected into the run environment for use with the corresponding Terraform provider. Once the <em>plan</em> or <em>apply</em> is complete, the temporary Vault token and downstream credential are revoked, eliminating the risk of re-use.</p>\n\n<p>The advantages of this approach include:</p>\n\n<ul>\n<li>Consolidated management and auditing for all your cloud credentials and other secrets</li>\n<li>No OIDC setup required in your cloud provider</li>\n<li>Leverage your existing Vault secrets engine configurations</li>\n<li>No need to expose inbound access to self-hosted Terraform Enterprise instances from cloud providers to validate OIDC metadata</li>\n</ul>\n\n<h1>Setting up Vault-backed dynamic credentials</h1>\n\n<p>At a high level, setting up Vault-backed dynamic credentials involves three steps:</p>\n\n<ol>\n<li>Performing the setup for <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/dynamic-provider-credentials/vault-configuration#dynamic-credentials-with-the-vault-provider\">dynamic credentials with the Vault provider</a>.</li>\n<li>Configuring the appropriate secrets engine in Vault: <a href=\"https://developer.hashicorp.com/vault/docs/secrets/aws\">AWS</a>, <a href=\"https://developer.hashicorp.com/vault/docs/secrets/azure\">Azure</a>, or <a href=\"https://developer.hashicorp.com/vault/docs/secrets/gcp\">Google Cloud</a>.</li>\n<li><a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/dynamic-provider-credentials/vault-backed\">Adding additional environment variables</a> to your Terraform Cloud configuration based on the Vault secrets engine used. This can be done via workspace-level variables or by using <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/variables/managing-variables#variable-sets\">variable sets</a> at the workspace or project level.</li>\n</ol>\n\n<p>This feature automatically injects the temporary cloud credential into the Terraform Cloud agent runtime environment, eliminating the need to configure the corresponding Vault data source in your Terraform code.</p>\n\n<h1>Next steps</h1>\n\n<p>Vault-backed dynamic credentials enhances the existing Terraform Cloud dynamic provider credentials feature by allowing you to consolidate onto a unified secrets management platform and workflow. Learn more with the <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/dynamic-provider-credentials/vault-backed\">dynamic provider credentials documentation</a> and hands-on tutorial: <a href=\"https://developer.hashicorp.com/terraform/tutorials/cloud/dynamic-credentials-vault\">Authenticate providers with Vault-backed dynamic credentials</a>.</p>\n\n<p>Get started with <a href=\"https://cloud.hashicorp.com/products/terraform\">Terraform Cloud</a> for free and try <a href=\"https://cloud.hashicorp.com/products/vault\">HCP Vault</a>, the easiest way to get started with Vault. You can <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/users-teams-organizations/users#log-in-with-your-hashicorp-cloud-platform-account\">link your Terraform Cloud and HashiCorp Cloud Platform (HCP) accounts</a> together for a seamless sign-in experience.</p>\n","author":"Dan Barr","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b5bfe165f81c1521e02f6f1253da3b77db69d20bcf0038fddb4e958b04e31b5c","category":"Tech"}