{"title":"Early Pleistocene Orbital‐Scale Variability in Australian Northwest Shelf Sediments","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024PA005015?af=R","date":1729341214000,"content":"<h2>Abstract</h2>\n<p>Paleoclimate proxy records from regions sensitive to humidity/aridity extremes provide crucial insights into the natural forcing mechanisms underlying long-term climate variability in broader regions. One such area is Northwest Australia, where the Australian monsoon impacts its northernmost fringes, which are bordered by the Great Sandy Desert inland. Marine sediments from the Australian Northwest Shelf record fluvial run-off and eolian dust input during the wet and dry seasons, respectively. The location is therefore ideal for investigating long-term variability in the Australian monsoon and Northwest Australian dust flux over orbital timescales. However, there are few continuous, high-resolution paleoclimate records from this region spanning the early Pleistocene, when strong ice-climate feedbacks of the late Pleistocene did not yet dominate global climate. Here, we present geochemical and environmental magnetic proxy records that reveal %CaCO<sub>3</sub> and dust-flux variability between 2.9 and 1.6 million years (Myr) ago from International Ocean Discovery Program Expedition 356 Site U1464 on the Australian Northwest Shelf. We establish a new, orbitally-tuned chronology for Site U1464, primarily based on ∼400 thousand year (kyr) eccentricity cyclicity in %CaCO<sub>3</sub>, and observe strong obliquity variability (41 and 54 kyr periodicities) but almost no precession signal in the dust-flux records. We propose that the 41 kyr cycle in Northwest Australian dust flux could be a linear response to East Asian winter monsoon intensity and/or the summer inter-tropical insolation gradient (SITIG), whereas the 54 kyr cyclicity might be a non-linear response to obliquity amplitude modulation via the SITIG effect on the cross-equatorial atmospheric circulations.</p>","author":"Song Zhao, \nKatharine M. Grant, \nDavid Heslop, \nStephen J. Gallagher, \nClara T. Bolton, \nGerald Auer","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"b5cdb94f90a48040ecad9994f86d5bb3ecf052acf4b89238c1bfc1cd7fd528f7","category":"Environment"}