{"title":"Multi-Objective Optimization in Support of Life-Cycle Cost Performance-Based Design of Reinforced Concrete Structures","link":"https://www.preprints.org/manuscript/202405.2076/v1","date":1717077018000,"content":"Surveys on the optimum seismic design of structures reveal that many investigations focus on how to minimize its initial cost while satisfying the performance constraints. Although reducing the initial cost while complying with the requirements of earthquake design codes of practice will significantly guarantee the life safety of occupants against earthquakes, it may still cause considerable economic losses to residents and fatalities. Accordingly, calculating the possible earthquake damages caused during the structure's lifetime may become essential from the optimal Life Cycle Cost (LCC) design point of view. LCC analysis is used to evaluate economic feasibility including construction, operation, occupancy, maintenance and end-of-life costs. For optimization, the population-based, meta-heuristic algorithm based on the Ideal Gas Molecular Movement (IGMM), has established its capability in solving highly nonlinear mono and multi-objective engineering problems. Therefore, this paper investigates the LCC -based mono and multi-objective optimum design of a 3-D four-story concrete building structure combined with the Endurance Time (ET) competence. The results show that, apart from substantially reducing the total number of analyses required, the proposed technique significantly affected dipping minor injury cost, rental, and income costs by 22%, 16%, and 16%, respectively. In total, a 10% reduction in all structural life-cycle costs was achieved, which could well be considered significant.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b5d0ef074d074f9cf7f254ffc3f9d6e12355b58194df1cf68ad078f03e72ad38","category":"Interdisciplinary"}