{"title":"257 Estimating bone mineral replenishment following phosphorus deficiency in growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/155/7664837?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Available phosphorus (avP) is essential for bone health and strength in growing pigs. Our objective was to evaluate growth performance and replenishment of bone mineral in avP deficient pigs when fed diets adequate in avP. Over a 42-d test period, mixed sex pigs [n = 48; initial body weight (BW) = 13.1 ± 0.7 kg], were randomly assigned to one of three dietary treatments consisting of two experimental periods. In period 1(28 d), 8 pens/trt (2 pigs/pen) were fed diets formulated to 0.36, 0.17 and 0.08% avP and at a total calcium to avP ratio of 2.91, 3.15 or 6.40, respectively, representing adequate, marginally deficient, or deficient avP. In period 2 (14 d), marginally deficient and deficient pigs were then fed diets formulated to be above requirement at 0.54% avP and a 2.19 Ca:avP, while the adequate pigs staying on the same period 1 diet (n = 8 pens/trt). Pig BW and pen feed disappearance were recorded during each phase to calculate average daily gain (ADG), average daily feed intake (ADFI) and feed efficiency gain to feed (G:F). At the end of each period, 1 pig per pen was removed to assess whole body, femur, and 3<sup>rd</sup> metatarsal bone mineral content (BMC) and bone mineral density (BMD) via dual-energy X-ray absorptiometry (DXA). All data were analyzed with pen as the experimental unit and the fixed effect of diet within each period. At the end of period 1, adequate avP and marginally deficient fed pigs were heavier than the deficient avP fed pigs (41.9 and 41.2 vs 33.4 kg, respectively, <span>P</span> &lt; 0.001). Consequently, ADG and ADFI were significantly reduced as avP decreased (<span>P</span> &lt; 0.001). Compared with the adequate avP pigs, whole body BMD was reduced by 22% and 65% in marginal and deficient avP pigs (<span>P</span> &lt; 0.001), respectively. At the end of period 2, adequate, marginal, and deficient avP pigs weighed 53.4, 53.2 vs 43.1 kg (<span>P</span> &lt; 0.001), respectively. Within period 2, ADG, ADFI, and G:F did not differ. However, adequate avP fed pigs continued to have a greater body BMD compared with marginal and deficient avP pigs (0.928, 0.850, and 0.732 g/cm<sup>2</sup>; <span>P</span> &lt; 0.001), respectively. Whole body BMD and BMC increased from period 1 to peiod 2, resulting in period 2 whole body BMC accretion rates of 2.31, 23.28, and 9.30 g/d (<span>P</span> &lt; 0.007) for deficient, marginal, and adequate diets, respectively. In conclusion, pigs fed marginally deficient avP diets reduced body BMD while pigs fed deficient avP diets reduced body BMD and performance. Following this period of deficiency, marginal deficient avP pigs recovered growth and BMC within 14 d when fed increased dietary avP. However, compared with adequate avP fed pigs, the deficient pigs only partially recovered BMC and BW within the 14-d replenishment period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b5dc3f1569795d90d3167ba2aaf8d53e9bed0595c86b0c000c3cc285e6284457","category":"Environment"}