{"title":"Marine heatwave‐driven mass mortality and microbial community reorganisation in an ecologically important temperate sponge","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17417?af=R","date":1722927600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/dfded345-081c-4817-891f-f748635d56d9/gcb17417-toc-0001-m.png\" alt=\"Marine heatwave-driven mass mortality and microbial community reorganisation in an ecologically important temperate sponge\" />\n<p>Marine heatwaves (MHWs) are increasing in frequency, duration and intensity, disrupting global marine ecosystems. In this study, we examine the impact of a severe MHW in 2022 on the ecologically important photosynthetic sponge <i>Cymbastella lamellata</i> in Fiordland, New Zealand. We found that half of the sponges died, but the remaining sponges had an altered microbial community, which we propose represents a microbial-mediated adaptive response to MHWs.</p>\n<br />\n<h2>Abstract</h2>\n<p>Marine heatwaves (MHWs) are increasing in frequency, duration and intensity, disrupting global marine ecosystems. While most reported impacts have been in tropical areas, New Zealand experienced its strongest and longest MHW in 2022, profoundly affecting marine sponges. Sponges are vital to rocky benthic marine communities, with their abundance influencing ecosystem functioning. This study examines the impact of this MHW on the photosynthetic sponge <i>Cymbastella lamellata</i> in Fiordland, New Zealand. We describe the extent, physiological responses, mortality, microbial community changes and ecological impact of this MHW on <i>C. lamellata</i>. The Fiordland MHW reached a maximum temperature of 4.4°C above average, lasting for 259 days. Bleaching occurred in &gt;90% of the <i>C. lamellata</i> Fiordland population. The population size exceeded 66 million from 5 to 25 m, making this the largest bleaching event of its kind ever recorded. We identified the photosynthetic symbiont as a diatom, and bleached sponges had reduced photosynthetic efficiency. Post-MHW surveys in 2023 found that over 50% of sponges at sampling sites had died but that the remaining sponges had mostly recovered from earlier bleaching. Using a simulated MHW experiment, we found that temperature stress was a driver of necrosis rather than bleaching, despite necrosis only rarely being observed in the field (&lt;2% of sponges). This suggests that bleaching may not be the cause of the mortality directly. We also identified a microbial community shift in surviving sponges, which we propose represents a microbial-mediated adaptive response to MHWs. We also found that <i>C. lamellata</i> are key contributors of dissolved organic carbon to the water column, with their loss likely impacting ecosystem function. We demonstrate the potential for MHWs to disrupt key marine phyla in temperate regions, highlighting how susceptible temperate sponges globally might be to MHWs.</p>","author":"James J. Bell, \nValerio Micaroni, \nFrancesca Strano, \nKen G. Ryan, \nKatherine Mitchell, \nPaul Mitchell, \nShaun Wilkinson, \nTorsten Thomas, \nRamadian Bachtiar, \nRobert O. Smith","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"b5e4cede319ac5b67e937a53a4fe7e64f4d9647d27ea2e9abbe2c6d1f36b7419","category":"Environment"}