{"title":"Laccase-induced decontamination and humification mechanisms of estrogen in water–crop matrices","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae118/7631509?rss=1","date":1710806400000,"content":"<span><div>Abstract</div>Enzymatic humification plays a crucial biogeochemical role in eliminating steroidal estrogens and expanding organic carbon stocks. Estrogenic contaminants in agroecosystems can be taken up and acropetally translocated by crops, but the roles of laccase-triggered rhizospheric humification (L-TRH) in pollutant dissipation and plant uptake remain poorly understood. In this study, the laccase-induced decontamination and humification mechanisms of 17β-estradiol (E2) in water–crop media were investigated by performing greenhouse pot experiments with maize seedlings (<span>Zea mays</span> L.). The results demonstrated that L-TRH effectively dissipated E2 in the rhizosphere solution and achieved the kinetic constants of E2 dissipation at 10 and 50 μM by 8.05 and 2.75 times as much as the treatments without laccase addition, respectively. The copolymerization of E2 and root exudates (i.e. phenols and amino acids) consolidated by L-TRH produced a larger amount of humified precipitates with the richly functional carbon architectures. The growth parameters and photosynthetic pigment levels of maize seedlings were greatly impeded after a 120-h exposure to 50 μM E2, but L-TRH motivated the detoxication process and thus mitigated the phytotoxicity and bioavailability of E2. The tested E2 contents in the maize tissues initially increased sharply with the cultivation time but decreased steadily. Compared with the treatment without laccase addition, the uptake and accumulation of E2 in the maize tissues were obviously diminished by L-TRH. E2 oligomers such as dimer, trimer, and tetramer recognized in the rhizosphere solution were also detected in the root tissues but not in the shoots, demonstrating that the acropetal translocation of E2 oligomers was interrupted. These results highlight a promising strategy for decontaminating estrogenic pollutants, boosting rhizospheric humification, and realizing low-carbon emissions, which would be beneficial for agroenvironmental bioremediation and sustainability.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"b5ed25545b0ad6eb850b0fdc6a36eb984f0189b28e68f1db8e787755c8644bb5","category":"Interdisciplinary"}