{"title":"If you have an iPhone 8 or iPhone X, you should probably sell it now","link":"https://www.macworld.com/article/1953947/iphone-8-iphone-x-sell-it-now.html","date":1686827700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When <a href=\"https://www.macworld.com/article/1940357/ios-17-features-live-voicemail-autocorrect-contact-posters-standby.html\">iOS 17 arrives this fall</a>, it’ll bring a slew of new features to your iPhone, including personalized contact cards, live voicemail, and <em>so</em> many stickers. But not every iOS 16 phone will get it. As announced at WWDC, Apple is <a href=\"https://www.macworld.com/article/1942219/ios-17-iphone-compatibility-features.html\">only supporting iPhones going back to the XS</a>, which means the iPhone 8 and iPhone X, announced in 2017, have reached the end of the line and will only receive security updates going forward.</p>\n\n\n\n<p>If you own one of those phones you’ll probably want to upgrade—and you’ll probably want to get as much as you can for your old phone. If that’s the case, you probably want to sell it as soon as possible. According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.sellcell.com/blog/will-ios-17-kill-iphone-x-8/&amp;xcust=1-1-1953947-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">a report from SellCell</a>, the iPhone 8 and X could lose nearly 50 percent of their value when iOS 17 arrives in September.</p>\n\n\n\n<p>The company reports that the “Phone 6S and 7 ranges lost 42.8 percent of their value, on average across all models, by the time iOS 16 rolled out in 2022.” According to the charts tracking trade-in prices, the iPhone 7 Plus went from $138 in June 2022 to $80 in September 2022, while the iPhone 6S Plus went from $94 to $47.</p>\n\n\n\n<p>As of Wednesday, June 14, the iPhone X was getting a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.sellcell.com/sell-iphone/&amp;xcust=1-1-1953947-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">max of $193</a> and the iPhone 8 Plus around $150, both decent returns on a near-six-year-old phone. But SellCell expects the value of those phones to “plummet once we hit the two/three-week mark following iOS 17 Beta release.”</p>\n\n\n\n<p>Granted, SellCell has a vested interest in getting you to sell your old iPhone sooner than later, but it’s hard to argue with the logic. If you want an iPhone running the latest operating system, you’ll need an iPhone XS or later. So you might as well get the most you can for it before it’s too late.</p>\n\n\n\n<p>See: <a href=\"https://www.macworld.com/article/675021/how-long-does-apple-support-iphones.html\">How long does Apple support iPhones?</a> for more information.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b5f7fdb1877903a7f94bb7fa65c21e307d663844cf6faaaa2332538e8eca0471","category":"Apple"}