{"title":"[ลือ] Call of Duty ปีหน้าถึงคิวภาคต่อ Black Ops เล่าเรื่องช่วง Gulf War พัฒนาโดย Treyarch","link":"https://www.blognone.com/node/136911","date":1700722258000,"content":"<div><div><div><p>จากรายงานของ Windows Gentral เผยว่าภาคต่อไปของเกม Call of Duty จะพัฒนาโดย Treyarch เป็นภาคต่อของ Black Ops ที่จะเล่าเรื่องเกี่ยวกับ Gulf War หรือปฏิบัติการโล่ทะเลทรายที่นำสู่การสั่งสมกำลังและการป้องกันของซาอุดีอาระเบียและปฏิบัติการพายุทะเลทรายเป็นสงครามในภูมิภาคอ่าวเปอร์เซียที่เกิดขึ้นในปี 1991</p>\n<p>จากรายงานพบว่าทีมพัฒนากำลังสำรวจเรื่องราวของ Gulf War อย่างถี่ถ้วน โดยเน้นไปที่หลากหลายมุมมองของความขัดแย้งในสงคราม และจะย้อนกลับไปสู่การต่อสู้ทางทหารแบบดั้งเดิมพร้อมอุปกรณ์ที่คุ้นเคยในซีรี่ส์ Black Ops ที่ตรงข้ามกับเทคโนโลยีอาวุธยุคปัจจุบันหรืออนาคตที่ถูกนำเสนอใน Modern Warfare</p>\n<p>นอกจากนี้มีการอ้างถึงโหมด Multiplayer ของเกมว่าอาจนำแผนที่คลาสสิกจำนวนมากของซีรี่ส์ Black Ops กลับมา รวมไปถึงโหมด Zombies ที่ Treyarch เป็นทีมแรกที่นำโหมดนี้เข้ามาใส่ใน Call of Duty</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/67e45e29c9f7cc20cea9d04e992aa7f7.jpg\" /></p>\n<p>Windows Central รายงานว่า Activision กำลังมองหาความเป็นไปได้ที่เปิดให้เล่นเกมแบบ Early access สำหรับผู้สั่งจองล่วงหน้าโดยจะเปิดให้เข้าเล่นหลายช่วงเวลาสำหรับเกมหลัก และโหมดซอมบี้</p>\n<p>ก่อนหน้านี้เคยมีคอนเซ็ปต์อาร์ตหลุดออกมาที่ถูกค้นพบในเกมมือถือ Call of Duty Warzone เป็นเครื่องบินขับไล่ไอพ่น F-117 ซึ่งเป็นเครื่องบินโจมตีล่องหนที่มีบทบาทสำคัญใน Gulf War</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/254f99cd07435ea4259a0bccfc908604.jpg\" /></p>\n<p>ตัวเกมดังกล่าวคาดว่าจะวางจำหน่ายในช่วงปลายปี 2024 เช่นเดียวกับภาคก่อน ๆ ของ Call of Duty</p>\n<p>ที่มา - <a href=\"https://www.windowscentral.com/gaming/exclusive-call-of-duty-2024-is-indeed-black-ops-set-during-the-gulf-war-in-the-early-90s\">Windows Central</a> via <a href=\"https://www.videogameschronicle.com/news/new-call-of-duty-black-ops-gulf-war-details-have-seemingly-leaked/\">Video Games Chronicle</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/call-of-duty\">Call of Duty</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/activision-blizzard\">Activision Blizzard</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b5f782d859030f1ee6efe3b4dc2956935ec28fd81769437ccf71d0efacdb973e","category":"Thai"}