{"title":"Low-Income Fish Consumers&#039; Subsidies to the Fish Reduction Industry","link":"https://www.preprints.org/manuscript/202407.0245/v1","date":1719958489000,"content":"The forage fish, a crucial source of nutrition in developing countries, are unfortunately primarily used for fishmeal and aquafeed production for aquaculture that mainly serves consumers in developed countries. Industrial fish use leaves a meager portion of the catch for direct human consumption in the fish-producing countries, leading to inflated fish prices locally. Overfishing forage fish necessary to support the fish reduction industry disrupts the ecosystem, diminishes the catch of larger fish, such as mackerel, and marginalizes local artisanal fishermen. This article appraises roughly the financial and nutritional impacts of elevated fish prices on low-income consumers in forage fish-producing countries, drawing attention to the ethical implications of this situation. A hypothetical 10% boost in the annual supply of fresh forage fish to the current global supply of 5 million MT markets could save consumers hundreds of millions of US dollars globally, tens of mil-lions of US dollars nationally, and several dollars for a family while improving the nutrition of families that depend on forage fish. The numbers suggest that even a modest boost to the supply of forage fish in fresh fish markets could significantly benefit the fish-producing nations' consumers and the fish-producing nations. In some countries, such as South Africa, the orders of magnitude of these sums approach that of the entire local fish reduction industries' value. The increased fish prices could be considered involuntary subsidies by low-income consumers to the aquafeed and aquaculture industries. In summary, the reduction industry's and aquaculture's current use of captured forage fish warrants further scrutiny, as it inadvertently burdens disadvantaged societies financially and nutritionally. The article proposes alternative protein sources and cultivating non-carnivorous fish among several optional measures to ensure equitable distribution of forage fish resources.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b5fafaee8ec79ca24cba9e39f742a00e4e9ff2081cfd696ff5268145fa1edc00","category":"Interdisciplinary"}