{"title":"Shocking Pixel 6 rumor lists Google SoC with two ARM X1 CPU cores","link":"https://arstechnica.com/?p=1795420","date":1631742312000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/20-2-980x735.jpg\" /></div>\n        <p>\n          Google's best image of the Pixel 6 Pro.                       [credit:\n                        <a href=\"https://store.google.com/?hl=en-US\">Google</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p><em>What in the world is going on?</em></p>\n<p>Google is building the Pixel 6, and with it, the company is dumping Qualcomm and introducing its first in-house main SoC (with help from Samsung): the \"Google Tensor SoC,\" aka \"Whitechapel.\" Other than some talk about Google's special AI sauce, there's hasn't been much info about the core parts of Tensor like, say, the CPU. A <a href=\"https://arstechnica.com/gadgets/2021/09/google-reportedly-optimistic-about-pixel-6-sales-increases-production-by-50/\">reasonable expectation</a> for a company building its first SoC is that it won't be too ambitious—we would expect Google to play within the guardrails set up by ARM, and after shipping a modest, cookie-cutter SoC, the company would learn from its first design and iterate. But a new report from XDA Developers' <a href=\"https://www.xda-developers.com/exclusive-google-tensor-specs-in-pixel-6/\">Mishaal Rahman</a> claims that even with its first design, Google isn't afraid to blaze its own trail in SoC design.</p>\n<p>Recall how ARM SoCs generally come with three tiers of CPU cores: a big CPU for bursty processing tasks like app-launching, medium cores for sustained performance, and small cores for background duty and low-power processing. Rahman says he has a source with a real-life Pixel 6 Pro and offers the following CPU specs: <em>two </em>2.8GHz Cortex-X1 cores, two 2.25GHz Cortex-A76 cores, and four 1.8GHz Cortex-A55 cores.</p></div><p><a href=\"https://arstechnica.com/?p=1795420#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795420&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b6047c50b4a02f45ec50159968a213c1e715ffb83fc7c8a34a7544a8206142e3","category":"Tech"}