{"title":"XBB.1, BQ1.1 and atypical BA.4.6/XBB.1 recombinants predominate current SARS-CoV-2 Wavelets with flu-like symptoms in Cameroon: A snapshot from genomic surveillance","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003153","date":1715349600000,"content":"<p>by Joseph Fokam, Ezechiel Ngoufack Jagni Semengue, Davy-Hyacinthe Gouissi Anguechia, Naomi-Karell Etame, Désiré Takou, Nadia Mandeng, Minelle Aurelie Kengni Ngueko, Grace Beloumou Angong, Sandrine Djupsa Ndjeyep, Collins Chenwi Ambe, Alex Durand Nka, Evariste Molimbou, Audrey Rachel Mundo Nayang, Larissa Gaëlle Moko Fotso, Derrick Tambe Ayuk Ngwese, Pamela Patricia Tueguem, Carlos Michel Tommo Tchouaket, Aude Christelle Ka’e, Nadine Fainguem, Cyrille Abega Abega, Edie-Gregory Halle-Ekane, Linda Esso, Alain Georges Etoundi Mballa, Judith Shang, Clement B. Ndongmo, Giulia Cappelli, Sofonias Kifle Tessema, Anne-Cecile Z-K Bissek, Vittorio Colizzi, Alexis Ndjolo, Carlo-Federico Perno, Nicaise Ndembi</p>\r\n\r\nAs of December 2022, Cameroon had observed a slight resurgence of COVID-19, raising concerns on genomic surveillance of related-SARS-CoV-2 variants under circulation. Following a laboratory-based survey, positive SARS-CoV-2 samples detected from December-2022 through March-2023 were processed for targeted sequencing at the Chantal BIYA International Reference Centre (CIRCB) in Yaoundé-Cameroon. From all positive cases detected, 13 were successfully sequenced (mean age 34 years, 70% female); the majority of the cases were unvaccinated (70%, 9/13) and symptomatic (92%, 12/13); all with flu-like symptoms (100%, 12/12). Following RT-PCR, the median cycle threshold was 22.23 [18–24] for the N gene; and 24.09 [20–26] for the ORF gene, underscoring high viral loads. Phylogenetic analysis of nucleotide sequences identified four major sub-variants in circulation, of which BA.5 (3/13), the recombinants BQ.1.1 (4/13), XBB.1 (4/13) and novel atypical variant of BA.4.6/XBB.1 (2/13). This snapshot surveillance indicates the introduction/emergence and circulation of new Omicron sub-variants, all accompanied by minor/mild symptoms. However, these new sub-variants and recombinants call for continuous genomic surveillance to prevent further resurgence of Covid-19 epidemiological wave.","author":"Joseph Fokam","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"b6045dc91644e48dd4814ec4e510f2160c319f99de0e2aa89539d13248c31d42","category":"Environment"}