{"title":"Revisiting Avian Metapneumovirus Subtype B in Broiler Chickens and Turkeys in Morocco: First Molecular Characterization","link":"https://www.preprints.org/manuscript/202409.0892/v1","date":1726046654000,"content":"Avian Metapneumovirus (aMPV) is a significant poultry pathogen with a global presence, primarily causing respiratory issues in turkeys. It also affects chickens, although the severity of its impact is often lessened in this species. In Morocco, aMPV has been detected in broiler flocks, prompting the need to deeply analyze circulating strains to understand better the epidemiology and develop control measures accordingly. This research focuses on the sequencing and molecular characterization of aMPV in these flocks. Additionally, aMPV isolated from turkeys displaying Turkey Rhinotracheitis (TRT) signs, were included in the study to compare the findings. RNA extracted from positive swabs was subjected to nested PCR, targeting the attachment protein of the G gene, followed by gel electrophoresis. Amplicons were purified and sequenced using the Sanger method. Bioinformatics tools facilitated sequence analyses, including BLAST for similarity searches and Mega® for phylogenetic analysis using the maximum likelihood method with 1000 bootstrap replicates. The investigation unveiled the existence of three distinct clades of the same aMPV/B strain, two of which originated from used vaccines and one from field recombination, all circulating in broilers and turkeys and indicating potential virus transmission between both poultry species.\nThis article presents the first-ever molecular characterization of aMPV isolated from Moroccan broilers and turkeys, encompassing comprehensive investigations on its presence and subtype, and genetic characterization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b6074c412247522e16d2aa1bb6f2246eadbbbc88f0a75fe2db7c2eeb8068aa88","category":"Interdisciplinary"}