{"title":"Unraveling Environmental Forces Shaping Surface Sediment Geochemical “Isodrapes” in the East Asian Marginal Seas","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GB007839?af=R","date":1712229555000,"content":"<h2>Abstract</h2>\n<p>As major sites of carbon burial and remineralization, continental margins are key components of the global carbon cycle. However, heterogeneous sources of organic matter (OM) and depositional environments lead to complex spatial patterns in sedimentary organic carbon (OC) content and composition. To better constrain the processes that control OM cycling, we focus on the East Asian marginal seas as a model system, where we compiled extensive data on the OC content, bulk isotopic composition (δ<sup>13</sup>C and Δ<sup>14</sup>C), total nitrogen, and mineral surface area of surficial sediments from previous studies and new measurements. We developed a spatial machine learning modeling framework to predict the spatial distribution of these parameters and identify regions where sediments with similar geochemical signatures drape the seafloor (i.e., <i>“isodrapes”</i>). We demonstrate that both provenance (44%–77%) and hydrodynamic processes (22%–53%) govern the fate of OM in this margin. Hydrodynamic processes can either promote the degradation of OM in mobile mud-belts or preserve it in stable mud-deposits. The distinct isotopic composition of OC sources from marine productivity and individual rivers regulates the age and reactivity of OM deposited on the sea-floor. The East Asian marginal seas can be separated into three main <i>isodrapes</i>: hydrodynamically energetic shelves with coarser-grained sediment depleted in OC, OM-enriched mud deposits, and a deep basin with fine-grained sediments and aged OC affected by long oxygen exposure times and petrogenic input from rivers. This study confirms that both hydrodynamic processes and provenance should be accounted for to understand the fate of OC in continental margins.</p>","author":"Sarah Paradis, \nMarkus Diesing, \nHannah Gies, \nNegar Haghipour, \nLena Narman, \nClayton Magill, \nThomas Wagner, \nValier V. Galy, \nPengfei Hou, \nMeixun Zhao, \nJung‐Hyun Kim, \nKyung‐Hoon Shin, \nBaozhi Lin, \nZhifei Liu, \nMartin G. Wiesner, \nKarl Stattegger, \nJianfang Chen, \nJingjing Zhang, \nTimothy I. Eglinton","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"b60f5068a554ce7b09fd5fe6ae158dc436655e41521ee4e1ccbc9172f4c7b353","category":"Environment"}