{"title":"A SIRT1-independent mechanism mediates protection against steroid-induced senescence by resveralogues in equine tenocytes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309301","date":1724335200000,"content":"<p>by Neda Heidari, Richard G. A. Faragher, Graham Pattison, Jayesh Dudhia, Roger K. W. Smith</p>\r\n\r\nTendinopathy is a common age-related disease which causes significant morbidity for both human athletes and performance horses. In the latter, the superficial digital flexor tendon is an excellent model for human tendinopathies because it is a functional homologue of the human Achilles tendon and a primary site of injuries with strong similarities to the human disease. Corticosteroids have been previously used clinically to treat tendinopathic inflammation, but they upregulate the p53-p21 axis with concomitant reductions in cell proliferation and collagen synthesis in human tenocytes. This phenotype is consistent with the induction of cellular senescence <i>in vitro</i> and <i>in vivo</i> and probably represents an important clinical barrier to their effective use. Because of the many differences in senescence mechanisms between species, this study aimed to evaluate these mechanisms after corticosteroid treatment in equine tenocytes. Exposure to clinically reflective levels of dexamethasone for 48 hours drove equine tenocytes into steroid induced senescence (SIS). This was characterised by permanent growth arrest and upregulation of p53, the cyclin dependent kinase inhibitors p21<sup>waf</sup> and p16<sup>ink4a</sup> as well as the matrix degrading enzymes MMP1, MMP2 and MMP13. SIS also induced a distinctive equine senescence associated secretory phenotype (eSASP) characterised by enhanced secretion of IL-8 and MCP-1. Preincubation with resveratrol or the potent SIRT1 activator SRT1720 prevented SIS in equine tenocytes, while treatment with the non-SIRT1 activating resveratrol analogue V29 was equally protective against SIS, consistent with a novel, as yet uncharacterised SIRT1-indendent mechanism which has relevance for the development of future preventative and therapeutic strategies.","author":"Neda Heidari","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b613372bfc6ec18700eb6a2d728b9a760b1c84cecac247c8f091ee615cfb6c52","category":"Interdisciplinary"}