{"title":"Apple Investigating 'Ghost Touches' Issue Affecting Some Series 9 and Ultra 2 Watches","link":"https://www.macrumors.com/2024/02/10/apple-watch-series-9-ultra-2-touch-screen-issue/","date":1707591282000,"content":"In an <a href=\"https://twitter.com/StellaFudge/status/1756365322301423616\">internal memo</a> shared with Apple Authorized Service Providers this week, Apple said it is \"aware of\" and \"investigating\" a touch-related issue affecting some Apple Watch Series 9 and Apple Watch Ultra 2 displays.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/apple-watch-series-9-display.jpeg\" width=\"1960\" height=\"1102\" />\r<br />\n\"Some customers may report their Apple Watch Series 9 or Apple Watch Ultra 2 is experiencing false touches on their display,\" reads Apple's memo, obtained by <em>MacRumors</em>. Apple said some customers may describe the issue as \"ghost\" touches.\r<br />\n\r<br />\nThe issue may cause the screen on affected Apple Watch models to \"jump erratically\" or exhibit other unexpected behavior, without any user interaction, according to Apple. The memo said the issue can also result in an Apple Watch starting a phone call unintentionally, and prevent users from entering the device's passcode.\r<br />\n\r<br />\nApple recommends that customers keep their Apple Watch's software up to date, suggesting that the company is hopeful it will be able to address the issue in a future watchOS update. Apple did not say how widespread the issue is, or provide a timeframe for a potential fix. It is unclear if defective hardware is a contributing factor.\r<br />\n\r<br />\nApple has instructed technicians not to repair affected Apple Watch models while it investigates. In the meantime, technicians are told to ask customers who are experiencing this issue to force restart their Apple Watch by holding down the Digital Crown and the side button at the same time for at least 10 seconds, until the Apple logo appears.\r<br />\n\r<br />\nApple Watch Series 9 and Apple Watch Ultra 2 models were released in September 2023.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra 2</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/aasp/\">Apple Authorized Service Providers</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_Ultra\">Apple Watch Ultra (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/10/apple-watch-series-9-ultra-2-touch-screen-issue/\">Apple Investigating 'Ghost Touches' Issue Affecting Some Series 9 and Ultra 2 Watches</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-investigating-ghost-touches-issue-affecting-some-series-9-and-ultra-2-watches.2419114/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b619ee8058f260df3c5b12b4c699afa63bb3450dd75b1b3f83e97a09b42c80e1","category":"Apple"}