{"title":"Whole Genome Sequence Analysis of Listeria monocytogenes Isolates Recovered from Cattle Farms, Cattle Abattoirs, and Retail Outlets in Gauteng Province, South Africa","link":"https://www.preprints.org/manuscript/202403.1868/v1","date":1711724093000,"content":"Abstract: The study used whole-genome sequencing (WGS) and bioinformatics analysis for the genomic characterization of 60 isolates of Listeria monocytogenes isolated from cattle farms, cattle abattoirs, and retail outlets in Gauteng province, South Africa. The isolates' sequence types (STs), clonal complexes (CCs), and lineages were determined using in silico multilocus sequence typing (MLST). We used BLAST-based analyses to identify virulence and antimicrobial genes, plasmids, proviruses, and the CRISPR-Cas system. The study investigated any association of the detected genes to the origin in the beef production chain of the L. monocytogenes isolates. Overall, in 60 isolates of Listeria monocytogenes, there were 7 STs, 6 CCs, 44 putative virulence factors, 2 resistance genes, 1 plasmid with AMR genes and 3 with conjugative genes, 1 CRISPR gene, and all 60 isolates were positive for proviruses. Among the 7 STs detected, ST204 (46.7%) and ST2 (21.7%) were the most prominent, with ST frequency varying significantly (p&amp;lt;0.001). The predominant CC detected were CC2 (21.7%) and CC204 (46.7%) in lineages I and II, respectively. Of the 44 virulence factors detected, 26 (across Listeria Pathogenicity Islands, LIPIs) were present in all the isolates. The difference in the detection frequency varied significantly (P&amp;lt;0.001). The two AMR genes (fosX and vga(G)) detected were present in all 60 (100%) isolates of L. monocytogenes. The only plasmid, NF033156, was present in 3 (5%) isolates. A CRISPR-Cas system was detected in 6 (10%), and all the isolates carried proviruses. Significant differences were detected in the frequencies of STs and virulence factors regarding the source and sample type of the L. monocytogenes isolates. The presence of both fosX and vga(G) genes in all the isolates from the three industries (cattle farms, abattoirs, and retail outlets) can potentially cause therapeutic implications. Our study, which characterized L. monocytogenes recovered from the three levels in the beef production chain in the country, provides the first evidence of the distribution of the pathogen with potential food safety and therapeutic implications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b61af4cc23204bdcdf5cac91245fdb729249a567ced0c64f0eea0aa3ba26fc2c","category":"Interdisciplinary"}