{"title":"Why Capcom thinks PC game modding is akin to “cheating”","link":"https://arstechnica.com/?p=1980411","date":1698867259000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/capcom-modding-800x450.jpg\" alt=\"Why Capcom thinks PC game modding is akin to “cheating”\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/capcom-modding.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For most PC gamers, the ability to update their game with a wide variety of mods is a huge benefit they can claim over most (<a href=\"https://arstechnica.com/gaming/2019/02/microsoft-paradox-allow-open-game-modding-on-xbox-one-for-the-first-time/\">but</a> not <a href=\"https://arstechnica.com/gaming/2016/05/fallout-4-on-xbox-one-gets-mod-support-today/\">all</a>) console players. But Japanese publisher Capcom (<em>Resident Evil</em>, <em>Street Fighter</em>) says it sees unauthorized modding of PC games as a problem akin to cheating, bringing with it the risk of headaches for the company's reputation and support costs. That's according to a 50-minute presentation covering \"anti-cheat and anti-piracy measures in PC gaming\" that was <a href=\"https://www.youtube.com/watch?v=CT5bwwvDv00\">posted to the Capcom R&amp;D YouTube channel</a> last week (and <a href=\"https://www.gamesradar.com/mods-are-no-different-than-cheating-according-to-capcom/\">noticed recently by GamesRadar</a>).</p>\n<p>The presentation describes modding as an \"inseparable part of PC gaming\" and a reflection of a PC platform that lets you \"do anything you want compared to the game console.\" At the same time, these facts make the PC a place \"that allows you to create freely, but [where] people are also free to tamper with the game.\"</p>\n<h2>“No different than cheating”</h2>\n<p>One obviously bad form of PC game tampering, according to Capcom, is piracy. If anti-piracy tools are not used for PC titles, Capcom says, \"pirated copies appear in less than a day [and] paid content such as DLC will be made free,\" leading to what the company calls \"an immediate loss of profit.\" Then again, Capcom admits that the size of this profit loss is \"unobservable\" because there is no suitable control case to compare it to. \"We can only speculate on the cost of cheats and piracy,\" Capcom says, \"but it's clear that if we don't do anything, the damage will surely be greater.\"</p></div><p><a href=\"https://arstechnica.com/?p=1980411#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980411&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b61cb662b88cf085952ef76fee5daefc3a0858aee663d5364abe044358a424ae","category":"Tech"}