{"title":"Assessment of the potential for sustainable sugarcane production for bioenergy in Angola","link":"https://www.preprints.org/manuscript/202406.1454/v1","date":1718888735000,"content":"With a predominantly humid tropical climate and a large area for expanding agricultural activities, Angola has in principle favorable conditions for bioenergy production. The focus of this study was to evaluate the availability of suitable land for producing sugarcane. This crop is highly efficient in converting solar energy into biomass for energy purposes in Angola. To this end, the Global Agro-Ecological Zones database, GAEZ v4, developed by IIASA and FAO, with the aid of the QGIS version 3.22.5, has been used to identify areas suitable for sugarcane cultivation, considering four levels of suitability. Aiming at the sustainability of bioenergy production, areas dedicated to food production, protected areas, and areas with slopes above 16% were excluded. Under these criteria, this study identified the existence of 6.3 Mha in lands of good agricultural suitability, with water resources, corresponding to 5% of the Angolan territory, distributed in seven provinces of the country, especially in the provinces of Cuando Cubango and Cunene, where 85% of the very suitable land under irrigation is located. Adopting a model of agricultural productivity, assuming irrigation and adequate agricultural practices, such area could produce approximately 956 million ton of sugarcane annually, which is significantly higher than the current production in this country, This amount of feedstock, processed using current technology could potentially produce 81.3 GL of ethanol and 176,9 TWh of electricity with low GHG emission per year, able to mitigate, as a whole, circa 60.3 MtCO2-eq/year by displacing gasoline in light vehicles and diesel and natural gas consumed in power generation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b627cf1fa3d1740e6bfaff9c1ee464708e1a384de3455965fb32f958d9f7fc44","category":"Interdisciplinary"}