{"title":"Comparative metatranscriptomics reveals effect of host plant on microbiota gene expression of Anastrepha obliqua (Diptera: Tephritidae) larvae","link":"https://academic.oup.com/ee/article/53/1/157/7503661?rss=1","date":1703808000000,"content":"<span><div>Abstract</div>The microbiota associated with phytophagous insects perform several functions that help insects exploit plant resources. Thus, microorganisms contribute to the dispersal of phytophagous species to new host plants, thereby promoting diversification. In this study, metatranscriptomic analysis was used to compare the gene expression of the microbiome of <span>Anastrepha obliqua</span> Macquart larvae feeding on 3 of its host plants: <span>Spondias purpurea</span> L (red mombin), <span>Mangifera indica</span> L (mango), and <span>Averrhoa carambola</span> L (starfruit). To identify differential gene expression in relation to the host plant, transcript abundance was compared. The results of the taxonomic and functional beta-diversity analysis showed that there were significant differences in the structures and activities of the microbial communities depending on the infested plant. Among the microorganisms, bacteria and fungi were active components of the microbiota. Differential expression analyses showed that the different active genes in each of the plants analyzed were mainly grouped into categories related to carbohydrate and amino acid metabolism, with some of these genes coding for cytochrome o ubiquinol oxidase, cytochrome c, and the enzyme isocitrate dehydrogenase. The microbiota of <span>A. carambola</span> larvae differed more at the level of community structure and gene function, possibly due to the different nutritional composition of the <span>A. carambola</span> and the presence of a set of secondary metabolites specific to the family Oxalidaceae. In conclusion, the transcriptional activity of the microbiota of <span>A. obliqua</span> larvae is influenced by diet, which is important because it could influence the performance of the insect on each of its different host plants.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"b6322b60c9a84516fa85c8a4e677a6e6e90ce6e1f195656072b92c5c2cad9b75","category":"Environment"}