{"title":"Motorola still makes flagship phones: Meet the Edge 40 Pro","link":"https://arstechnica.com/?p=1929317","date":1680719060000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/5-980x848.jpg\" alt /></div>\n          <p>\n            The Motorola Edge 40 Pro. You'd have a hard time picking this out of a lineup.                           [credit:\n                              Motorola                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>These days Motorola is <a href=\"https://arstechnica.com/gadgets/2022/04/new-moto-g-takes-on-impossible-task-of-competing-with-the-pixel-5a/\">mostly known</a> as a mid- to low-end smartphone manufacturer thanks to product lines like the Moto G, but the Lenovo division still makes flagship smartphones. The latest is the Motorola Edge 40 Pro, which the company says is headed to Europe in a few days and Latin America in a few weeks. The US is left out of the party, but Motorola's <a href=\"https://motorolanews.com/article/introducing-the-new-motorola-edge-40-pro-flawless-design-meets-unbounded-performance-ffnwrxlnfo?language=en-US\">latest blog post</a> promises to \"expand the edge family in North America this year.\" (Presumably, Lenovo's flagship US phone is supposed to be <a href=\"https://arstechnica.com/gadgets/2023/01/lenovo-puts-the-legendary-thinkpad-brand-on-a-phone-meet-the-thinkphone/\">excitingly branded \"ThinkPhone</a>,\" but that still hasn't launched yet despite being announced three months ago.)</p>\n<p>In Europe, the Edge 40 Pro is 899.99 euro, or about $982, so this phone needs to be on par with the best Android phones out there. The specs are close, with a Qualcomm Snapdragon 8 Gen 2, 12GB of RAM, and 256GB of UFS 4.0 storage. The OLED display has a unique stat line of 165 Hz with a 2400×1080 resolution—typically flagships have a 120 Hz display at 1440p. The battery is smaller than expected at 4600 mAh, when most phones pack in 5000 mAh at this size.</p>\n<p>It has IP68 dust and water resistance, Android 13, Wi-Fi 7 support, NFC, an in-screen fingerprint reader, and 15 W wireless charging. One standout is the 125 W wired charging, which Motorola says will charge the phone in 23 minutes. For cameras, Motorola has included a \"triple high-res camera system,\" which includes a 50 MP main camera, a wide-angle camera, and a 12 MP 2x telephoto camera on the back; the front has a 60 MP selfie camera.</p></div><p><a href=\"https://arstechnica.com/?p=1929317#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1929317&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b654886ce2cca5a1929bb4ffd51b1dcbc7a7bab673bb6afd592d7799e199a43a","category":"Tech"}