{"title":"51 Application of an energy and nutrient matrix to a mixed cereals-based diet supplemented with a novel phytase and xylanase–β-glucanase achieved a production benefit from wean-to-finish in pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/81/7664727?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The effect of a novel consensus bacterial 6-phytase variant (PhyG) without or with a xylanase–β-glucanase (XB) when added to an energy and nutrient-reduced diet on growth performance and production benefit was evaluated in pigs from wean-to-finish. A total of 192 weaned pigs [DanBred x Pi; initial body weight (BW) 7.18 ± 0.38 kg] were randomized to 4 treatments with 12 (4 piglets/pen) and 24 pens (2 pigs/pen) per treatment (1:1 male to female) for nursery and grow-finish phases, respectively. Diets were wheat-corn-barley-rye-soybean meal-based and fed in 5 phases (pre-starter, 7–11 kg, starter, 11–25 kg, grower I, 25–55 kg, grower II, 55–85 kg and finisher, 85–110 kg BW). Treatments comprised: 1) a nutritionally adequate positive control (PC); 2) a negative control (NC1) without added inorganic phosphate, reduced (based on specific PhyG dose) in net energy (NE), calcium (Ca), digestible amino acids (AA) and sodium (Na) vs. PC, supplemented with PhyG at 1,000, 1000, 750, 500 and 500 FTU/kg during pre-starter, starter, grower I, II and finisher phase, respectively (NC1+PhyG ‘low’); 3) a negative control (NC2) without added inorganic phosphate, supplemented with PhyG at 2,000, 2,000, 1,000, 750 and 750 FTU/kg in each phase with reduction in NE, Ca, dig AA and Na vs. PC based on the specific PhyG dose (NC2+PhyG ‘high’); and 4) a negative control (NC3) that was similar to 2) but supplemented with XB to provide 2,400 U/kg xylanase and 304 U/kg β-glucanase, with additional reduction in NE and dig AA based on the contribution of XB vs NC1 (NC3+PhyG ‘low’+XB). Data were analyzed by ANOVA, and means separation was by Tukey’s HSD test. Growth performance in all enzyme-supplemented diets was maintained or improved compared with PC. The NC3+PhyG ‘low’+XB treatment significantly improved performance vs. PC; average daily gain (ADG) and BW were greater vs. PC in starter (620 g and 28.2 kg vs. 557 g and 26.4 kg) and grower I (859 g and 65.1 kg vs. 777 g and 60.0 kg) respectively; feed conversion ratio (FCR) was reduced in grower II vs. PC (2.10 vs. 2.25; <span>P</span> &lt; 0.05). The final BW was 114.5, 114.8, 115.6 and 116.7 kg in PC, NC1+PhyG ‘low’, NC2+PhyG ‘high’ and NC3+PhyG ‘low’+XB, respectively (<span>P</span> &gt; 0.05). Carcass parameters were unaffected by treatments. Compared with PC, NC1+PhyG ‘low’, NC2+PhyG ‘high’ and NC3+PhyG ‘low’+XB conferred a 3.8 to 5.8% reduction in total feed cost (ingredients price, October 2023)/kg BWG and 4.4 to 6.8% reduction in the total carbon footprint (FeedPrint, WUR, The Netherland, CO<sub>2</sub> eq., g)/kg BWG. The results confirm the appropriacy of the applied matrix values with PhyG supplementation, with or without XB, in mixed cereal diets from wean-to-finish and highlight the potential feed cost and sustainability benefit of using the phytase alone or in combination with the carbohydrase enzymes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b65fea5c129aafb3cf3f86085b92d1455161209038f9f9f1c2b169c96a9f4407","category":"Environment"}