{"title":"How to install the tvOS 15 Public Beta","link":"https://www.macworld.com/article/350203/tvos-15-public-beta-install-devices.html","date":1625241103000,"content":"\n<div>\n<section><div></div></section><p>tvOS doesn’t get nearly as much attention as iOS and macOS, but Apple has <a href=\"https://www.macworld.com/article/348413/tvos-15-sign-in-suggestions-shareplay-home-spatial-audio-compatilibity-release-beta-how-to-install.html\">a new version coming out in the fall with some new features</a> and you can try it out now.</p>\n\n\n\n<h2>Should you install the tvOS 15 Public Beta?</h2>\n\n\n\n<p>As always, beta releases of software carry the usual warnings of bugs and other issues, but like Apple Watch, updating to the tvOS 15 beta is a one-way street. So once you update, you can’t go back even if there’s a a major issue. That’s unlikely to happen, but it’s something to consider before you go through with the process below.</p>\n\n\n\n<h2>Enroll your Apple TV in the Public Beta</h2>\n\n\n\n<p>On your Mac, head over to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-350203-0-0-0&amp;sref=https://www.macworld.com/feed?\">https://beta.apple.com</a> and sign up for the Beta Software Program (or sign in if you’ve already installed a beta on another device). Then click the tvOS tab and click the Enroll your Apple TV link under Get Started.</p>\n\n\n\n<h2><strong>I</strong>nstall the Public Beta on your Apple TV</h2>\n\n\n\n<p>On your Apple TV, head over to the Settings app, then go to System and you should see a Get Beta Updates option. If you don’t, then you might be logged into a different iCloud account than the one on your Mac. Go to the Users &amp; Accounts tab and check. If they’re the same, restart your Apple TV and check for the Get Beta Updates button again.</p>\n\n\n\n<h2>Supported devices</h2>\n\n\n\n<p>Here is the list of supported devices able to get tvOS 15</p>\n\n\n\n<ul><li>Apple TV 4K</li><li>Apple TV HD (2015)</li></ul></div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b672aa11953565ec06d6aabbf8ba2e8adb0e230c4ea043bb4e16929e8fe48099","category":"Apple"}