{"title":"Encryption-breaking, password-leaking bug in many AMD CPUs could take months to fix","link":"https://arstechnica.com/?p=1956383","date":1690302717000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/amd-epyc-half-delidded_hero-800x500.jpg\" alt=\"Encryption-breaking, password-leaking bug in many AMD CPUs could take months to fix\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/amd-epyc-half-delidded_hero.jpg\">Enlarge</a> (credit: AMD)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A recently disclosed bug in many of AMD's newer consumer, workstation, and server processors can cause the chips to leak data at a rate of up to 30 kilobytes per core per second, <a href=\"https://lock.cmpxchg8b.com/zenbleed.html\">writes</a> Tavis Ormandy, a member of Google's Project Zero security team. Executed properly, the so-called \"Zenbleed\" vulnerability (CVE-2023-20593) could give attackers access to encryption keys and root and user passwords, along with other sensitive data from any system using a CPU based on AMD's Zen 2 architecture.</p>\n<p>The bug allows attackers to swipe data from a CPU's registers. Modern processors attempt to speed up operations by guessing what they'll be asked to do next, called \"speculative execution.\" But sometimes the CPU guesses wrong; Zen 2 processors don't properly recover from certain kinds of mispredictions, which is the bug that Zenbleed exploits to do its thing.</p>\n<p>The bad news is that the exploit doesn't require physical hardware access and can be triggered by loading JavaScript on a malicious website (according to networking company <a href=\"https://blog.cloudflare.com/zenbleed-vulnerability/\">Cloudflare</a>). The good news is that, at least for now, there don't seem to be any cases of this bug being exploited in the wild yet, though this could change quickly now that the vulnerability has been disclosed, and the bug requires precise timing to exploit.</p></div><p><a href=\"https://arstechnica.com/?p=1956383#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956383&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b685f51d1ff61ecbd115001c9fb23d8a1bef4600e49192da5a91ffe46a048026","category":"Tech"}