{"title":"Does dam construction increase the biotic homogenization of riparian vegetation along a regulated river?","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4297?af=R","date":1716267255000,"content":"<h2>Abstract</h2>\n<p>Dam construction in natural rivers alters the intensity and frequency of water level fluctuations in reservoirs and their downstream river reaches, leading to the biotic homogenization of riparian communities. Although the intensity of dam-induced water level fluctuations is often described qualitatively, quantitative analysis of its effects on riparian vegetation remains inadequate. This study compared riparian species dissimilarity between the natural Chishui River (as a control) and the regulated Wujiang River (with cascade reservoirs) to assess the level of biotic homogenization under different regulation types and in zones with different riverbank characteristics using the Bray–Curtis dissimilarity index. The reservoirs along the Wujiang River were classified into four different regulation types according to the water retention time, which were daily (0–7 days), weekly (7–30 days), seasonally (30–90 days), and yearly (&gt;365 days). Results showed significant species dissimilarity in riparian vegetation along the Wujiang River compared to that along the Chishui River in the inundation, transitional, and unflooded zones. Furthermore, the species composition and dissimilarity patterns differed in the reservoirs and downstream rivers of the cascade dams in terms of regulation type and zone. For different regulation types, there was high species dissimilarity in both the upstream and downstream inundation zone of the daily reservoirs, while species dissimilarity was lower in both upstream and downstream of the yearly reservoir (Bray–Curtis index &lt;0.5). This study provides a quantitative measure of how dam construction perturbs riparian vegetation communities, emphasizing the importance of the balance between the riparian ecosystem conservation and the economic demands of dam construction.</p>","author":"Jiayu Li, \nYu Cao, \nZarah Pattison, \nWenlong Fu, \nJunyao Sun","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"b68849e02a465fc20489fe8e026e45b17be7d48b60538490527597a8ce870db1","category":"Environment"}