{"title":"Judge finds Google destroyed evidence and repeatedly gave false info to court","link":"https://arstechnica.com/?p=1927710","date":1680119187000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-shredder-800x596.jpg\" alt=\"A piece of paper being destroyed in a paper shredder machine.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-shredder.jpg\">Enlarge</a> (credit: Getty Images | Hup)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A federal judge yesterday ruled that Google intentionally destroyed evidence and must be sanctioned, rejecting the company's argument that it didn't need to automatically preserve internal chats involving employees subject to a legal hold.</p>\n<p>\"After substantial briefing by both sides, and an evidentiary hearing that featured witness testimony and other evidence, the Court concludes that sanctions are warranted,\" US District Judge James Donato <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.373179/gov.uscourts.cand.373179.469.0.pdf\">wrote</a>. Later in the ruling, he wrote that evidence shows that \"Google intended to subvert the discovery process, and that Chat evidence was 'lost with the intent to prevent its use in litigation' and 'with the intent to deprive another party of the information's use in the litigation.'\"</p>\n<p>He said that chats produced by Google last month in response to a court order \"provided additional evidence of highly spotty practices in response to the litigation hold notices.\" For example, Donato quoted one newly produced chat in which \"an employee said he or she was 'on legal hold' but that they preferred to keep chat history off.\"</p></div><p><a href=\"https://arstechnica.com/?p=1927710#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927710&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b688df8f73be3da7f6834bba8d8ceadd8d7dc30f24536956e299d3dc94d089b0","category":"Tech"}