{"title":"16 Effects of fiber supplementation during gestation on sow and piglet performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/66/7664858?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Our objective was to determine the effects of fiber supplementation during gestation on sow and piglet performance. A total of 200 PIC Camborough P1+ sows were used. At breeding, sows were balanced by body weight (BW) within parity and randomly allotted to 1 of 2 dietary treatments, which consisted of 1) Control; corn-soybean meal gestation diet; and 2) Fiber; inclusion of soybean hulls in the formulation at a level to yield a dietary crude-fiber content 6%. Females were housed in individual stalls throughout the entire gestation. At d 90 of gestation, serum glucose, fecal dry matter, fecal volatile fat acids (acetate, propionate, butyrate, isovalerate, and valerate), urinary traits (color, turbidity, density, pH, and presence of nitrate or blood), and frequency of stereotypic behavior (sham chewing, teeth grinding, bar biting, and floor licking) was accessed. Perineal scoring was visually evaluated at d 105 and 110 of gestation. Farrowing traits (farrowing length, and number of piglets born alive, stillborn, and mummified fetuses) and piglet vitality (meconium presence, umbilical cord integrity, oxygenation, and heart rate) were individually monitored. Individual piglet BW was obtained within 12 h of birth and after 24 h for colostrum intake, and at weaning. Sow daily lactation feed intake was registered. Data were analyzed using generalized linear mixed models with the Glimmix procedure of SAS with sow serving as the experimental unit. There was no evidence (<span>P</span> &gt; 0.10) for differences in sow BW at d1, d112 of gestation, and at weaning. Sows fed the greater fiber diet showed lower levels of post-prandial glucose (-6%; <span>P</span> &lt; 0.10), darker urine (+33%; <span>P</span> &lt; 0.10) with greater pH (+5%; <span>P</span> &lt; 0.05), and greater levels of fecal butyrate (+62%; <span>P</span> &lt; 0.05) and isovalerate (+15%; <span>P</span> &lt; 0.10) at the end of gestation (d 90). Feces from sows fed the control diet were drier (<span>P</span> &lt; 0.05) at d 90 of gestation. Fiber supplementation reduced the frequency of teeth grinding (-52%; <span>P</span> &lt; 0.10), bar biting (-74%; <span>P</span> &lt; 0.05), and floor licking (-65%; <span>P</span> 0.10) behaviors. There was no evidence for treatment differences (<span>P</span> &gt; 0.10) for perineal scores. Piglet vitality was not affected by the treatments, except for a marginal increase in blood oxygen saturation for piglets from sows fed the greater fiber diet (+1%; <span>P</span> &lt; 0.10). Treatment did not impact (<span>P</span> &gt; 0.10) farrowing duration, number of total piglets born, born alive, stillborn, and mummified, nor average piglet birth weight and colostrum intake. Sows fed diet with fiber supplementation during gestation had a marginal increase in average daily feed intake during lactation (+0.50kg/d; <span>P</span> = 0.08), which resulted in improved piglet BW gain (<span>P</span> &lt; 0.05) and weaning weights (+0.20kg; <span>P</span> &lt; 0.05). In summary, providing increased level of fiber supplementation via soybean hulls to gestating diets did not impact sow reproductive performance. Beneficial effects were observed for welfare lactation feed intake, piglet BW gain and weaning weights.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b68b781451d4f2e387b0624cc5a2a86b3533921d18a0d9ebc7999b910d67f7f9","category":"Environment"}