{"title":"The Rolls-Royce Ghost: A magic carpet ride that costs as much as a house","link":"https://arstechnica.com/?p=1754152","date":1618226124000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/2021-Rolls-Royce-Ghost-12-980x735.jpg\" /></div>\n        <p>\n          And the award for most improved goes to.... the 2021 Rolls-Royce Ghost, which is better than the car it just replaced in almost every way.                      [credit:\n                        Jonathan Gitlin                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The most inescapable thing about driving a Rolls-Royce Ghost is never being able to forget how much it costs. So let's get that out of the way: with a sticker price of $460,350, it's a car that costs <a href=\"https://fred.stlouisfed.org/series/MSPUS%20\">more than a house</a> in many parts of the country. This knowledge never escapes you, a constant reminder that you're visiting a world where just the cost of the options fitted to the car seen here would buy a pretty good pre-owned Mercedes S-Class.</p>\n<p>You remember it when you park or whenever another car gets a little too close in traffic, given the pricey consequences of a scratch or scrape. But the price tag also looms when you feel the weight of the metal switchgear or your feet sink into the deep shag of the lambswool carpets. You quickly realize the amount of time and materials that went into putting everything together.</p>\n<h2>The award for most improved goes to…</h2>\n<p>Despite the above, it was hard not to like the 2021 Ghost. When we tried the previous model a couple of years ago, it was similarly solid and sumptuously trimmed, but <a href=\"https://arstechnica.com/cars/2019/12/ars-technicas-favorite-cars-and-suvs-of-2019/\">it thoroughly underwhelmed</a>, particularly from behind the wheel. Part of the problem, perhaps, was that car sharing a platform with BMW's 7 Series.</p></div><p><a href=\"https://arstechnica.com/?p=1754152#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1754152&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b68ff540593e9d514bfdf6ca255cdf72fc0c244e13ac5ddad5858cef6084a039","category":"Tech"}