{"title":"PSXIII-21 Fiber digestibility and phosphorus absorption by crossbred heifers receiving different phosphates","link":"https://academic.oup.com/jas/article/102/Supplement_3/795/7757924?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective was to compare the potential of different phosphates in promoting improvement in fiber digestibility and phosphorus absorption by heifers. Crossbred weaned heifers [n = 5; body weight (BW) = 150 ± 14 kg] were used in a 5 × 5 Latin square design and offered diets harvested from processed forage seeds for 21-d periods (14-d adaptation and 7-d data collection). The treatments were 1) negative control (NC) without supplementary phosphorus; 2) dicalcium phosphate from igneous rock with sulfuric acidulation, neutralization with limestone, and the show physical form of micro granules (DPIRSALNG); 3) Dicalcium phosphate from igneous rock with sulfuric acidulation, neutralization with hydrated lime, and powder physical form (DPIRSAHLiNP); 4) Dicalcium phosphate from sedimentary rock with hydrochloric acidulation, neutralization with limestone, and the micro granulated show physical form (DPSRHCALNG); and 5) Dicalcium phosphate from the monocalcium phosphate and hydrated lime reaction with phosphorus concentration adjusted with phosphoric acid, and powder physical form (DPfMP+HLPAP). In each sample collection period two dry matter intake measurements, and two total feces collections were carried out for 24 h. Thus, the digestibility of dry matter (DMd), and the apparent absorption (aA) were calculated. Data were subjected to analysis of variance (<span>P</span> &lt; 0.05), and when significant, a multiple comparison test was performed (SNK test). No treatment x animal x period interactions were observed (<span>P</span> ≥ 0.05) for either of the two variables under study. The greatest neutral detergent fiber (NDF) digestibilities were in the diets with DPIRSALNG and DPSRHCALNG, followed by DPIRSAHLiNP and DPfMP+HLPAP, which did not differ from each other, and the least was in NC, respectively 430, 390, 310, and 270 g/kg of DM (Table 1). Phosphorus apparent absorption (PaA) was greater (<span>P</span> &lt; 0.05) in heifers that received DPIRSALNG (0.65) followed by DPSRHCALNG (0.61). DPIRSAHLiNP (0.52) and DPfMP+HLPAP (0.48) did not differ from each other (<span>P</span> &gt; 0.05) and were greater (<span>P</span> &lt; 0.05) than NC (0.21). Phosphorus supplementation resulted in greater NDF digestibility and greater phosphorus absorption regardless of phosphate sources. The sources DPIRSALNG and DPSRHCALNG were more efficient in terms of DMd and absorption.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b68f5c770298cecf7a6e25e48924857c43d3da09c03675a3ed76f2d355cd28cb","category":"Environment"}