{"title":"WHOOP is now using ChatGPT to answer your health and fitness questions","link":"https://www.bikeradar.com/news/whoop-coach-chatgpt-4/","date":1695738065000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/whoop-coach-d318da2.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"WHOOP Coach graphic showing phone screen asking question and wearable device.\" title=\"whoop-coach\" />                                            <p>WHOOP has announced the introduction of WHOOP Coach, a generative AI feature said to provide users with recommendations and guidance on their health and fitness.</p>\n<p>The feature uses ChatGPT-4, the AI-language model created by OpenAI, to generate individualised and conversational responses to your health and fitness questions, according to WHOOP.</p>\n<p>The update is said to turn the WHOOP fitness and well-being system, used by the likes of Mathieu van der Poel and Wout van Aert, into a “powerful new coaching experience” that “goes beyond surface-level insights”.</p>\n<h2>Harnessing AI</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"WHOOP app\" title=\"WHOOP app\" />\n\n</div><div><figcaption><span><i></i> WHOOP Coach enables you to ask questions through the company’s app.</span></figcaption><span> <i>WHOOP</i></span></div>\n<p>Founded in 2012, WHOOP captures data on your physical condition via a wearable band that records your heart rate and blood oxygenation along with other metrics, such as heart-rate variability and sleep quality, to help maintain or improve fitness.</p>\n<p>Using ChatGPT-4, WHOOP says you can now ask your wearable device any questions through the company’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">app</a>.</p>\n<p>“With the launch of WHOOP Coach, we’re now offering on-demand, personalised health and fitness coaching. This is the first of its kind and it will transform our members’ relationship with their data,” says founder and CEO of WHOOP Will Ahmed.</p>\n<p>WHOOP Coach is said to take WHOOP’s algorithm, custom-built machine learning model, performance science and research, and your biometric data, to identify patterns and connections across recovery, strain, sleep, health and stress data.</p>\n<p>It can then use this information to answer your health and fitness questions via ChatGPT-4 in more than 50 languages “all within seconds”.</p>\n<p>WHOOP says the more data you share, the more effective WHOOP Coach will be.</p>\n<p>You can track more than 140 behaviours in WHOOP’s journal – from diet to medication – to unlock “highly individualised insights”.</p>\n<h2>What else can WHOOP Coach do?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"WHOOP 4.0 band on an EF Education-EasyPost rider\" title=\"WHOOP 4.0 band on an EF Education-EasyPost rider\" />\n\n</div><div><figcaption><span><i></i> WHOOP Coach will also answer your general training queries, such as “What is HRV?”.</span></figcaption><span> <i>WHOOP</i></span></div>\n<p>WHOOP Coach is said to go beyond basic insights, providing you with answers to more complex training questions as well as general guidance on training and the platform.</p>\n<p>WHOOP says you can ask WHOOP Coach to provide training plans and recommendations, including routines and recipe suggestions. It will provide answers to questions such as how to train for a 24-minute 5km run or how to maintain fitness with a newborn baby, according to the brand.</p>\n<p>The feature will find answers to questions such as “Why am I so tired?” or “Am I getting sick?” by sifting through data to identify why you might be feeling the way you are, according to WHOOP.</p>\n<p>It will also provide answers to general questions to do with training, giving guidance on heart-rate variability and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>.</p>\n<p>Finally, WHOOP says the update will help provide comparisons with other people, giving the example of how you sleep compared to people your age.</p>\n<p>Away from training and health, the ChatGPT-4 functionality will help answer questions to do with your WHOOP band itself and your membership or account.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b695505a14e8ddb4d7575e936d20a0230be8633033a98e0425f54daf463a53f6","category":"Cycling"}