{"title":"Zwift Increases Zwift Hub Price to $599","link":"https://www.dcrainmaker.com/2023/09/zwift-increases-zwift-hub-price.html","date":1694595635000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-720x480.jpeg\" alt width=\"720\" height=\"480\" srcset=\"https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-278x185.jpeg 278w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub-125x83.jpeg 125w, https://media.dcrainmaker.com/images/2023/09/Zwift-Hub.jpeg 1024w\" /></p>\n<p>Today Zwift announced a slate of new software features for the upcoming season, including new roads in Watopia, Climb Portal updates, an entirely new methodology for racing categorization called Race Score, along with new features to take advantage of the Zwift Play hardware. Plus a number of other software-focused announcements. All of which I’ll find some way to cover in due time.</p>\n<p>However, arguably one of the most notable changes is actually that to the pricing of their Zwift Hub smart trainer, which launched a year ago at $499. That trainer set off a patent infringement lawsuit by Wahoo Fitness, as well as shifted the mindset in the industry on trainer pricing. In recent weeks we saw <a href=\"https://www.dcrainmaker.com/2023/09/wahoo-and-zwift-reach-patent-dispute-agreement-heres-whats-happening-next.html\">Zwift and Wahoo Fitness settle that lawsuit</a>, as well as Elite and Wahoo Fitness, <a href=\"https://www.dcrainmaker.com/2023/09/elite-wahoo-reduce-list-prices-on-trainers.html\">drop their pricing of trainers</a> in that same price ballpark.</p>\n<p>However, buried as the last item in that press release was the announcement of a new Zwift Hub bundle, which includes 1-year of Zwift, for the price of $599/<span>€599/£549</span>. Left unsaid though was the fact that Zwift will no longer be selling the $499 standalone version of the Zwift Hub. In effect, the only way to buy the Zwift Hub now is at $599 with a year of Zwift included. That first year being just $100 represents a savings of $80, as Zwift currently doesn’t offer an annual plan – only month to month at $15US/month (plus taxes). $15 x 12 months = $180, thus the $80 savings.</p>\n<p>Of course, the writing was somewhat on the wall last week for this, when Zwift announced that *all smart trainers* sold on Zwift would be bundled with a year of Zwift. This announcement was part of the Wahoo Fitness settlement/partnership announcement, and included a number of other changes as well around pricing – such as the Wahoo also selling Zwift-bundled trainers on WahooFitness.com. In the case of Zwift, that bundling takes the form of a $100/<span>€89/£89</span> upsell for all existing smart trainers/bikes. Meaning, a $599 trainer becomes a $699 – but now including 1-year of Zwift.</p>\n<p>This is particularly notable for Wahoo and their KICKR CORE, which saw a price reduction to $599. However, if sold on Zwift.com, that price is now $699 with Zwift included. It means a consumer is essentially choosing whether they want to buy a KICKR CORE without Zwift, or a Zwift Hub with Zwift – for the same $599 price. Both Wahoo and Zwift coordinated these pricing changes, based on this new partnership – and undoubtedly, a component of this was related to the Wahoo lawsuit being dropped.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed.jpeg\" alt width=\"720\" height=\"480\" srcset=\"https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed.jpeg 720w, https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed-278x185.jpeg 278w, https://media.dcrainmaker.com/images/2023/09/ZwiftHubUnboxed-125x83.jpeg 125w\" /></p>\n<p>That coordination, even last week, has raised some concerns about competition – given we’re seeing the two biggest players in the space cooperating at a new level. For example, does this signal either company will limit compatibility with their products, in favor of a deepened partnership? When asked, Zwift responded with:</p>\n<blockquote><p>“Throughout their history, both companies have actively collaborated across the industry with a variety of partner brands. <span>Zwift</span> remains committed to further collaboration with other trainer companies just as Wahoo remains committed to continued collaboration with other software companies.”</p></blockquote>\n<p>In many ways, this question was already answered a year ago when Zwift announced the Zwift Hub. And further, the question, at least at a hardware level, was answered nearly a decade ago with the formation of various indoor trainer standards and protocols (e.g. ANT+ FE-C, Bluetooth Smart FTMS, etc…). These protocols largely ensure that devices work across the board. Albeit, only at a baseline level. We can see for example what happens when companies don’t integrate at the next tier.</p>\n<p>An ironically good example of that is the new <a href=\"https://www.dcrainmaker.com/2023/09/wahoo-kickr-bike-shift-initial-thoughts.html\">Wahoo KICKR BIKE SHIFT</a>, announced yesterday. In order to reduce price, that bike lacks a display showing the current gearing (whereas the higher-end KICKR BIKE V1/V2 has such a display). In the case of Zwift, they don’t show virtual gearing for any Wahoo smart bikes today, but do show it for other brand smart bikes (such as Wattbike &amp; Tacx). While Wahoo and Zwift said last week they’re working to rectify this gap, that ‘work’ has really only started since the settlement was been announced. It shows that while baseline industry interoperability can continue on between products despite the lawsuit, the reality is that for higher-end integration (like gear display), companies need to work together. <em>(One could also argue this is yet another reason for more/better/closer industry collaboration on trainer standards…but alas, that’s a conversation for a different day).</em></p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-720x480.jpeg\" alt width=\"720\" height=\"480\" srcset=\"https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-278x185.jpeg 278w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE-125x83.jpeg 125w, https://media.dcrainmaker.com/images/2023/09/WahooKICKRCORE.jpeg 1024w\" /></p>\n<p>Finally, there’s one more interesting quirk here – which is that WahooFitness.com will now only sell the <a href=\"https://www.dcrainmaker.com/2018/09/wahoo-kickr-core-trainer-in-depth-review-2.html\">Wahoo KICKR CORE</a> in a Zwift-bundled configuration for $699. Meaning, a consumer going to the Wahoo site directly will not be able to buy the KICKR CORE without Zwift on Wahoo’s site. Instead, consumers can only purchase the KICKR CORE individually (sans Zwift) at 3rd party retailers or local bike shops. Those same bike shops will soon have the opportunity to do the $100 upsell for a year of Zwift included as well.</p>\n<p>Of course, the obvious implication here is that it’s seemingly another nail in the coffin for Wahoo X and RGT, just two weeks ago Wahoo disbanded their Sport Science division in Colorado. That division heavily contributed to Wahoo X. Then yesterday, in Wahoo’s announcement of the new <a href=\"https://www.dcrainmaker.com/2023/09/wahoo-kickr-move-smart-trainer-review.html\">Wahoo KICKR MOVE</a> smart trainer and <a href=\"https://www.dcrainmaker.com/2023/09/wahoo-kickr-bike-shift-initial-thoughts.html\">Wahoo KICKR BIKE SHIFT</a>, it didn’t mention Wahoo X or RGT even a single time. Wahoo normally extensively mentions its own software platform in every press release, but here it simply didn’t exist.</p>\n<p>What that means for Wahoo X or RGT remains to be seen, but it’s very clear and obvious the path forward for now seems heavily aligned with Zwift. Whether or not that is good for consumers remains to be seen, however, if you were in the market for either a Zwift Hub or Wahoo KICKR CORE and planned to use Zwift as a new customer, you do at least save $80 in this scenario.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"b6970123d5c120f1f2fd5247aa57134d01d5a19e21ad907892080d03e3ffadba","category":"Cycling"}