{"title":"Thermal performance of native and invasive crab species: investigating the invasion potential of Hemigrapsus takanoi in southern European Carcinus maenas’ habitats","link":"http://link.springer.com/10.1007/s10530-024-03396-1","date":1730419200000,"content":"<h3>Abstract</h3>\n                    <p>Invasive species’ plasticity and latitudinal spread have become an increasing matter of concern in rapidly changing climate. The brush-clawed shore crab (<em>Hemigrapsus takanoi</em>), native along northwestern Pacific shores, has established dense populations in northern European coasts. Detrimental effects in natura have been reported, such as displacement of native species and competition for shelter, rasing concerns regarding shellfish early life stages and food webs-posing a threat to wild stocks’ recruitment and aquaculture. The species has not yet been observed in southern European countries (e.g., Portugal), where niche habitats such as harbours, mudflats, and lagoons reach higher temperatures than the invaded northern range. The aims of this study were to determine <em>H. takanoi</em> potential to acclimate to a southern thermal range, assess thermal performance, and identify potential competitive advantages over the native shore crab <em>Carcinus maenas</em>. This was accomplished through individual exposure to one of three treatments, resembling a southern European thermal range (17 °C, 21 °C, or 25 °C), for 30 days. <em>H. takanoi</em> thrived in temperatures as high as 25 °C, a realistic thermal scenario in Óbidos Lagoon (the biggest Portuguese lagoon)—while the native shore crab <em>C. maenas</em> underperformed at that treatment, showing lower survival, growth, and feed intake than <em>H. takanoi</em>. These results suggest that <em>H. takanoi</em> may be able to colonise southern and warmer European locations and have higher plasticity than the native species already inhabiting areas close to its upper thermal limits. Under global warming scenarios, inferences of further latitudinal spread and increased invaded range may also be taken to the invaded northern European habitats.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"b69e0e6eef31c03657247ef6266c4f3330069799796ed2c4a895ec3a25e1cb2b","category":"Environment"}