{"title":"How to make and manage a shared iCloud calendar","link":"https://www.macworld.com/article/351384/how-to-make-and-manage-a-shared-icloud-calendar.html","date":1627635600000,"content":"<div>\n<section><div></div></section><p>A shared calendar can be a big help in coordinating activities across a couple, a family, or a group. Apple offers shared calendars via iCloud, but it doesn’t always make it easy to understand how to share or accept an invitation—particularly if you or those you’re sharing with don’t use only Apple calendar tools on a Mac, iPhone, or iPad, or use other operating systems.</p>\n\n\n\n<p>People inside the Apple ecosystem or using iCloud-compatible third-party apps like <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.busymac.com/busycal/&amp;xcust=1-1-351384-1-0-0&amp;sref=https://www.macworld.com/feed\">BusyCal</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://flexibits.com/fantastical&amp;xcust=1-1-351384-1-0-0&amp;sref=https://www.macworld.com/feed\">Fantastical</a> can view and modify events on privately shared calendars.</p>\n\n\n\n<p>If you’re using calendar software that doesn’t integrate directly with iCloud, requiring a log in with your account, you won’t be able to accept invitations to private calendars, but can still view publicly shared ones.</p>\n\n\n\n<h2>Start by sharing a calendar</h2>\n\n\n\n<p>You can create a new private calendar or share an existing one privately to specific people. Here’s how.</p>\n\n\n\n<ul><li><strong>macOS:</strong> Hover over the right-side of the calendar name in the Calendar List. (Choose <em>View &gt; Show Calendar List</em> if that list isn’t showing.) Click the outline of a person’s head. This produces a popout menu. If it’s a calendar you create or can modify who shares it, click <em>Share With</em> or click an existing name to open up an area you can type part an address in that’s autocompleted or paste an email address into. Click <em>Done</em> when you’ve added all the addresses you want and invitations are mailed out and triggered in Apple’s apps and some third-party apps.</li><li><strong>iOS/iPadOS:</strong> Tap <em>Calendars</em> and then tap the i info button to the right of the calendar you want to share. Tap <em>Add Person</em> to type or paste an address into. Invitations are sent immediately. Tap <em>Done</em> when complete.</li><li><strong>iCloud.com:</strong> Navigate to Calendar. Click the waves icon to the right of calendars you can share—it looks like a rotated Wi-Fi symbol. Check the <em>Private Calendar box and then type or paste the </em>address into the<em> Add Person</em> field. Click <em>OK</em>.</li></ul><div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac-911-calendar-share-popup.png?w=552\" /><figcaption>macOS makes it easy to share a calendar by clicking.</figcaption></figure></div></div>\n\n\n\n<p>You can remove addresses or click or tap <em>Stop Sharing</em> in each of these locations to halt sharing with a person, people, or everyone.</p>\n\n\n\n<p>In each of those locations, there’s an option to check, click, or tap to share a public, read-only version of the calendar (in iCloud, you have to click, then click <em>Done</em>, then click the waves again). Copy the URL that appears that starts with <code>webcal://</code> to share with anyone using any calendar software with support for Internet-published calendars. Uncheck or disable <em>Public Calendar</em> in each of these locations to unpublish the calendar.</p>\n\n\n\n<h2>Subscribe to a calendar</h2>\n\n\n\n<p>To subscribe to a private calendar:</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-share-prompt.png?w=330\" /><figcaption>You can accept an invitation via the inbox in all Apple calendar apps and in iCloud.com</figcaption></figure></div></div>\n\n\n\n<ul><li><strong>macOS:</strong> In the Calendars List, click the inbox icon next to the calendar icon at the top. New invitations appear there. Click <em>Join Calendar</em>.</li><li><strong>iOS/iPadOS:</strong> Tap the Inbox link and tap <em>Join Calendar</em>.</li><li><strong>iCloud.com:</strong> Tap the inbox icon (an arrow pointing downwards into a physical inbox tray) and click <em>Join Calendar</em>.</li></ul><p>To subscribe to a public calendar:</p>\n\n\n\n<ul><li><strong>macOS:</strong> Choose <em>File &gt; New Calendar Subscription</em>, paste the <code>webcal://</code> URL, and click <em>Subscribe</em>.</li><li><strong>iOS/iPadOS:</strong> Go to <em>Settings &gt; Calendars &gt; Accounts &gt; Add Account &gt; Other &gt; Add Subscribed Calendar</em> and paste the URL. Tap <em>Next</em>. Apple shows a shocking amount of technical information that’s unnecessary for this sort of connection. Tap <em>Save</em>.</li><li><strong>iCloud.com:</strong> There doesn’t appear to be a method to subscribe to a public calendar on iCloud.com, even though you can share public calendars <em>from</em> iCloud.com.</li><li><strong>Google Calendar:</strong> Visit <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://calendar.google.com/&amp;xcust=1-1-351384-1-0-0&amp;sref=https://www.macworld.com/feed\">Google Calendar</a> and click the + next to “Other calendars.” Select From URL. Paste the URL of the calendar in and click “Add calendar.”</li></ul><h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b6a15bcfd0325d5cac50f4874c8972e9a23d14e11e82f08a0e881cfd33df8f05","category":"Apple"}