{"title":"AeroCoach introduces £950, 1.6-watt saving titanium and carbon aero track chainring","link":"https://www.bikeradar.com/news/aerocoach-aten-chainring/","date":1626105610000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Aten-Chainring_07-553829f.jpg?quality=90&amp;resize=620,413\" />                                            <p>AeroCoach has announced a new track chainring made from titanium and carbon that costs a whopping £950, as well as a sprocket that costs £180.</p>\n<p>Claimed to be the “most aerodynamic and technologically advanced chainring for top level track competition”, the Aten titanium/carbon track chainring is machined from titanium and backed with a carbon fibre plate to improve stiffness.</p>\n<p>Each Aten chainring and sprocket is polished to a high-gloss finish and coated with titanium nitride, which gives them their golden hue. This surface treatment is also said to improve durability and efficiency versus standard uncoated aluminum chainrings.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> AeroCoach’s Aten track chainrings and sprockets are a serious investment, but they also look undeniably cool.</span></figcaption><span> <i>AeroCoach</i></span></div>\n<p>In terms of aerodynamics, the Aten chainring is lenticular in shape and features a “unique tooth wave profile” that follows the contours of the chain plates.</p>\n<p>These features are said to help keep the airflow attached for longer as it passes over the chain and onto the chainring. In turn, this reduces aerodynamic drag. Removable bolt covers are also included for a final aerodynamic touch.</p>\n<p>In terms of performance gains, AeroCoach is claiming a 0.3 per cent reduction in total rider plus bike system drag, which is said to equate to 1.6 watts at 60kph, compared to a standard aero chainring.</p>\n<p>Compared to a non-aero chainring, the claimed advantage is greater at 2.4 watts at 60kph.</p>\n<h2>1.6 watts at 60kph for £950?</h2>\n<p>Before you jump straight to the comments to decry such a miniscule potential advantage, the head of AeroCoach, <a href=\"https://www.bikeradar.com/author/drxavierdisley/\">Dr Xavier Disley</a>, does admit that the gains in absolute wattage terms are “relatively small”.</p>\n<p>Nevertheless, he insists that in the context of the velodrome – and the elite target audience these products are aimed at – such small differences can actually provide a tangible performance benefit.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Aten-Chainring_05-452cec6.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Aten chainring has a lenticular profile…</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Aten-Chainring_02-4f2907d.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>As well as a “unique tooth wave profile” that helps smooth the airflow over the chain and chainring.</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Aten-Chainring_04-f04ed6a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>A close-up of the tooth wave profile.</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Aten-Chainring_03-Edit-4f66328.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Aten chainring is backed with carbon fibre to improve sitffness.</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>To be precise, that 1.6-watt saving versus a standard aero chainring is said to be worth an extra 25cm per 250m lap at 50 to 70kph.</p>\n<p>Versus a non-aero chainring, the claimed advantage increases to 37cm per 250m lap at 50 to 70kph.</p>\n<p>A truly marginal gain then, if ever there was one, but perhaps also enough to make the difference between winning and losing at the highest level.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 1.6 watts at 60kph doesn’t sound like much, but 25cm per lap could be the difference between winning and losing an elite track race.</span></figcaption><span> <i>AeroCoach</i></span></div>\n<p>It’s at that highest level (specifically the upcoming <a href=\"https://www.bikeradar.com/events/tokyo-2020/\">Tokyo Olympic Games</a>) where Disley expects Aten chainrings and sprockets to be used: “This is very much a top-level, no holds barred product”.</p>\n<p>As you expect then, the Aten chainring has been approved by the UCI for use in UCI-sanctioned events and races.</p>\n<h2>AeroCoach Aten titanium track sprockets</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/AeroCoach-Aten-Sprocket_01-028b41a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>AeroCoach’s Aten track sprockets are also made from CNC titanium and coated with titanium nitride.</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/AeroCoach-Aten-Sprocket-94b8f1b.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>A single sprocket will set you back £180.</span>\n    </figcaption><span>\n                    <i>AeroCoach</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nFor those looking to push drivetrain efficiency to the absolute limit, AeroCoach has also announced Aten titanium track sprockets.\n<p>Also machined from titanium and coated with low-friction titanium nitride, each Aten sprocket is said to be lighter, stronger and more efficient than traditional steel sprockets.</p>\n<p>Available in sizes from 13 to 16 teeth, and priced at a cool £180, AeroCoach naturally recommends pairing an Aten chainring with an Aten sprocket for “maximum drivetrain efficiency”.</p>\n<h2>Why are Aten chainrings and sprockets so expensive?</h2>\n<p>As for why the Aten chainrings and sprockets cost so much, Disley explains that this is mostly due to the lengthy research and development process, as well as the resource-intensive manufacturing process.</p>\n<p>“Machining titanium is incredibly difficult. You have to make sure the titanium you’re using is high quality as any inherent stresses will result in a warped part once you’ve done the machining”, he tells us.</p>\n<p>“Titanium is also so tough you wreck cutting equipment constantly, sometimes requiring a new cutting tool for every ring.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Aten chainrings are very expensive, but are targeted at elite level riders.</span></figcaption><span> <i>AeroCoach</i></span></div>\n<p>As for why AeroCoach decided to make the chainrings out of titanium rather than carbon (as it has done previously with its range of <a href=\"https://www.aero-coach.co.uk/store/Drivetrain-components-c51365656\">Arc aero carbon chainrings</a> for track and road bikes), Disley says that this actually helped bring the final costs down.</p>\n<p>“Machining titanium gives us more room for manoeuvre, in terms of shape, so we could make a lenticular profile on the chainring for aerodynamics, as well as our unique tooth wave profile.</p>\n<p>“Doing this in carbon would have required different moulds for every size of chainring, as well as post-processing CNC work, which would have pushed the cost up too much.”</p>\n<h2>Okay, so how do I get a set for my fixed-gear commuter?</h2>\n<p>AeroCoach says it is currently working on fulfilling orders to a lead time of six to seven weeks, but limited numbers of 59 to 61-tooth Aten chainrings will be available within three to four weeks.</p>\n<p>Too late for any Olympic hopefuls who haven’t yet placed an order, then, but Disley says: “They will definitely be in Tokyo, just not many.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Aten chainrings are available in a five-bolt 144 BCD format and are compatible with 1/8in chains.</span></figcaption><span> <i>AeroCoach</i></span></div>\n<p>For the rest of us, though, Aten chainrings and sprockets can be ordered directly from AeroCoach.</p>\n<p>Compatible with 1/8in track chains and available in a five-bolt 144 BCD (bolt circle diameter) format, there’s just one other catch – sizes start from 58 teeth and go up to 66 teeth, so you’ll need strong legs to use one.</p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b6abc52b28bffe45d7dfaef9860df1c0af730682d6beb90a7f6f191bcc9bd344","category":"Cycling"}