{"title":"Vuelta a España 2023 stage 20 preview: The penultimate stage","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-20-preview","date":1694793350000,"content":"\n      <p><b>Distance: </b>208km<br /><strong>Start location:</strong> Manzanares El Real<br /><b>Finish location: </b>Guadarrama<br /><b>Start time:</b> 11:55 CEST<b><br /></b><b>Finish time (approx): </b>17:30 CEST</p>\n<p>Lying to the north of Madrid are the Sierras de Guadarrama, the eastern end of the Sistema Central mountain range that spans horizontally across the Iberian Peninsula. It’s a convenient natural landscape for the organisers of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, as it provides the perfect terrain for one final climactic showdown between the overall contenders just before they arrive at the race’s usual finish in Madrid.</p>\n<div></div>\n<p>That indeed is what has happened in several Vueltas of recent years. In 2012, Alberto Contador managed to hand on to seal overall victory despite being dropped by Joaquin Rodríguez; in 2015, Fabio Aru and his Astana succeeded in cracking Tom Dumoulin on the Puerto de la Morcuera to take the red jersey; and just last year Enric Mas attacked Remco Evenepoel on that very same climb, but by contrast could not shed his rival as the Belgian finished off the job.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/debf0.png?v=1693299001\" alt /></p>\n<p><i>﻿Stage 20 profile sourced via the Vuelta website</i></p>\n<p>The penultimate stage of this year’s Vuelta will take place in the same area of Guadarrama, but the climbs to be tackled aren’t as big. Whereas the Puerto de la Morcuera and other mountains that witnessed the drama of aforementioned editions were of category one status, today there isn’t a single effort ranked higher than category three. But the riders defending positions on the GC shouldn’t make the mistake that they can afford to relax just yet — though none of the climbs are especially hard, there are a lot of them. In fact, there are no less than 10 summits to be overcome, together amounting to over 4,000m of elevation gain.</p>\n<p>Added to the fact that this stage is, at 208km, the longest of the Vuelta, and this is one of the most atypical ends to a Grand Tour in recent memory and will be very difficult to predict. Without a single standout climb to use as an obvious springboard, attacks could just about come from anywhere, while the way the road weaves around the area, with no lengthy flat stretches and many of the climbs tackled twice, means it sort of resembles a spring Classic. If raced like a spring Classic, attacks could come from very far out, possibly from ambitious GC contenders seeking one last roll of the dice. However big their lead might be going into the stage, whoever is in the red jersey will need to be very attentive so as not to get caught out, and have a strong team around him to help control the race. If not, this stage has the potential to turn the race on its head and cause dramatic late shocks.</p>\n<h3>Contenders</h3>\n<p>There is one rider going into this stage as a clear favourite, and that is none other than <strong>Remco Evenepoel</strong> (Soudal–Quick-Step). He’s won three stages so far and is on the prowl for more to add to his tally. He’s a two-time Liège-Bastogne-Liège winner also, a race with parcours very similar to this Vuelta stage. He’s looked almost unstoppable this last week, so anyone looking to beat him on this stage will have to bring their absolute best.</p>\n<p>But with there only being this stage and tomorrow’s expected sprint in Madrid left, this is the last opportunity for many riders to get a stage win. One rider, however, won’t be going home disappointed having won stage 15 but could be a contender to double up on his victories, <strong>Rui Costa</strong> (Intermarché-Circus-Wanty). If he can get in the breakaway, he’ll certainly be one the other riders will need to keep an eye on.</p>\n<p><strong>Andreas Kron</strong> (Lotto Dstny) is another stage winner who will want to target this stage. He’s come close to a second victory since his stage two win but has just missed the mark. He was one of the riders in the break to stick to Evenepoel’s wheel on stage 19 as he set a demanding pace until he attempted an attack 35km to go which saw him dropped. But he possesses an explosive kick which will be needed on a stage like this. Lotto Dsnty also has <strong>Thomas De Gendt</strong>, who they could choose to send up the road for the stage win.</p>\n<p>Fourth at this year’s Liège-Bastogne-Liège behind Evenepoel was <strong>Santiago Buitrago</strong> (Bahrain-Victorious), who suits punchy climbs like this. He’s looked strong throughout this year's Vuelta, especially on stage 15, where he was in the early break, coming third overall. <br /><br />Another rider who has looked extremely strong throughout this race is <strong>Romain Bardet</strong> (DSM-Firmenich), who could be a contender for the stage. He’ll be bolstered by the team’s win on stage 19 and will want to deliver for DSM for a second day running. <br /><br /><strong>Iván García Cortina</strong> (Movistar), <strong>Driers Van Gestel</strong> (TotalEnergies), <strong>Nico Denz</strong> (Bora-Hansgrohe), and <strong>Marijn van den Berg</strong> (EF Education-EasyPost) could be other contenders for the stage win.</p>\n<h3></h3>\n<h3>Prediction</h3>\n<p><span>We think <strong>Remco Evenepoel</strong> will dominate the day once again and take the stage win.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b6af9895a4441174f972c811d7dcc021a5d5ea869ba83aabfb4128d379ced5f8","category":"Cycling"}