{"title":"Konami warns players of “outdated” content in Metal Gear Solid collection","link":"https://arstechnica.com/?p=1962127","date":1692707241000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/mgs-800x450.jpeg\" alt=\"Someone had better warn that snowsuit-clad guard about the &quot;outdated&quot; content he's about to walk into...\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/mgs.jpeg\">Enlarge</a> <span>/</span> Someone had better warn that snowsuit-clad guard about the \"outdated\" content he's about to walk into... (credit: Konami)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Gamers of a certain age may find it hard to accept that the <em>Metal Gear Solid</em> series will celebrate its 25th anniversary next month. And publisher Konami is apparently worried that the game's age may be starting to show for some modern audiences.</p>\n<p>As <a href=\"https://www.gamesradar.com/the-metal-gear-solid-collection-is-so-true-to-hideo-kojimas-original-vision-that-it-needed-a-new-content-warning/\">noted by GamesRadar</a>, the upcoming <em>Metal Gear Solid: Master Collection</em> re-release warns players that the games in the collection contain \"expressions and themes which may be considered outdated.\" The disclaimer notes that the games are presented \"without alteration\" to preserve the \"historical context\" and the \"creator's original vision,\" but still urges that \"player discretion is advised.\"</p>\n<p>While the disclaimer doesn't go into specifics of the \"outdated\" content in the games, it's not hard to come up with examples that might hit a little differently in the context of the 2020s (warning: vague spoilers for <em>Metal Gear</em> series plot points until the next heading). <em>Metal Gear Solid 2</em>, in particular, features discussion of some heavy incest themes between a major character and their step-family, for instance. That game also features a scene where a character grabs another by the crotch to confirm their sex.</p></div><p><a href=\"https://arstechnica.com/?p=1962127#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962127&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b6af12cda9469a072908d8252de49b67561133054c04bbfd91a5ac0cb3f8ef75","category":"Tech"}