{"title":"WSJ: ‘A Lab Leak in China Most Likely Origin of Covid Pandemic, Energy Department Says’","link":"https://www.wsj.com/articles/covid-origin-china-lab-leak-807b7b0a","date":1677468689000,"content":"\n<p>Michael R. Gordon and Warren P. Strobel, reporting for The Wall Street Journal (<a href=\"https://apple.news/AlwSvtnkcSSGoTPIiMsquxQ\">News+ link</a>):</p>\n\n<blockquote>\n  <p>The U.S. Energy Department has concluded that the Covid pandemic\nmost likely arose from a laboratory leak, according to a\nclassified intelligence report recently provided to the White\nHouse and key members of Congress. [...]</p>\n\n<p>The new report highlights how different parts of the intelligence\ncommunity have arrived at disparate judgments about the pandemic’s\norigin. The Energy Department now joins the Federal Bureau of\nInvestigation in saying the virus likely spread via a mishap at a\nChinese laboratory. Four other agencies, along with a national\nintelligence panel, still judge that it was likely the result of a\nnatural transmission, and two are undecided.</p>\n\n<p>The Energy Department’s conclusion is the result of new\nintelligence and is significant because the agency has\nconsiderable scientific expertise and oversees a network of U.S.\nnational laboratories, some of which conduct advanced biological\nresearch.</p>\n\n<p>David Relman, a Stanford University microbiologist who has argued\nfor a dispassionate investigation into the pandemic’s beginnings,\nwelcomed word of the updated findings. “Kudos to those who are\nwilling to set aside their preconceptions and objectively\nre-examine what we know and don’t know about Covid origins,” said\nDr. Relman, who has served on several federal scientific-advisory\nboards. “My plea is that we not accept an incomplete answer or\ngive up because of political expediency.”</p>\n</blockquote>\n\n<p>No smoking gun here, but it’s <a href=\"https://daringfireball.net/linked/2021/01/05/lab-leak-hypothesis\">long</a> seemed bananas to me how many people refuse to even <em>consider</em> the possibility that COVID-19 leaked from <a href=\"https://www.propublica.org/article/senate-report-covid-19-origin-wuhan-lab\">a poorly-run Wuhan lab</a> that researches exactly these sort of viruses.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/02/26/wsj-covid-energy-department-lab-leak\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"5dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b6b429d645d795f147eaf67142642d96eed92bdfda62caa1332238","category":"Tech"}