{"title":"Ammonium oxidation from concentrated synthetic wastewater and landfill leachate using partial nitritation in sequencing batch reactor","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11075?af=R","date":1720594800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5cebac4f-a9eb-4a89-a840-ba0531390286/wer11075-toc-0001-m.png\" alt=\"Ammonium oxidation from concentrated synthetic wastewater and landfill leachate using partial nitritation in sequencing batch reactor\" />\n<p>Landfill leachate can improve ammonium removal during partial nitritation (PN) in sequencing batch reactor (SBR) when the biomass is pre-soaked in leachate, which promotes the growth of ammonium-oxidizing bacteria (AOB) and inhibits nitrite-oxidizing bacteria (NOB).\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Partial nitritation (PN) is a novel treatment for nitrogen removal using aerobic ammonium oxidation with reduced oxygen requirements compared to conventional nitrification. This study evaluated the performance of the PN process and the factors influencing nitrogen removal from landfill leachate. During the reactivation of biomass, the results showed 70% ammonium removal, but only 20% total nitrogen removal. Further analysis showed that low nitrite accumulation and high nitrate production promoted the growth of nitrite-oxidizing bacteria (NOB). The ammonium removal activity after soaking the cultivated biomass in synthetic water and leachate was measured to be 0.57, 0.1, 0.17, and 0.25 g N•g VSS<sup>−1</sup>•d<sup>−1</sup> for synthetic wastewater and leachate soaking for synthetic wastewater, 12 h, 3 days, and 7 days, respectively. The study found abundant ammonium-oxidizing bacteria (AOB) and NOBs in biomass soaked in synthetic wastewater. However, soaking in leachate promoted AOB growth and inhibited NOB growth making leachate suitable for PN.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe study found that with a longer leachate-soaking period for biomass, ammonium removal activity increases, which in turn increases ammonium conversions during the PN process.\nAmmonium-oxidizing bacteria (AOB) can acclimate to landfill leachate substrate and grow with a longer soaking period.\nNitrite-oxidizing bacteria (NOB) were inhibited by landfill leachate substrate, which is beneficial for nitrite accumulation.\nAnabolized DO can convert nitrite to nitrate rapidly, which results in higher nitrate accumulation compared to nitrite accumulation.\nHence, the DO level has to be sufficiently low to prevent nitrite oxidation and nitrate accumulation.\n</p>","author":"Harsh V. Patel, \nRenzun Zhao, \nAlessia Eramo, \nSophia Blanc, \nNicole L. Fahrenfeld, \nBrian Brazil, \nStephanie Luster‐Teasley","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"b6beccf947451599bcda7343f76e90578a8672072e65907964a5296305f65487","category":"Environment"}