{"title":"Key determinants to supply chain resilience to face pandemic disruption: An interpretive triple helix framework","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299778","date":1714572000000,"content":"<p>by Md. Galib An-Noor Amio, Humaira Nafisa Ahmed, Syed Mithun Ali, Sayem Ahmed, Abhijit Majumdar</p>\r\n\r\nToday, supply chain (SC) networks are facing more disruptions compared to the past. While disruptions are rare, they can have catastrophic long-term economic or societal repercussions, and the recovery processes can be lengthy. These can tremendously affect the SC and make it vulnerable, as observed during the COVID-19 pandemic. The identification of these concerns has prompted the demand for improved disruption management by developing resilient, agile, and adaptive SC. The aim of this study is to introduce an assessment framework for prioritizing and evaluating the determinants to supply chain resilience (SCR). To analyze the empirical data, fuzzy criteria importance through intercriteria correlation (fuzzy CRITIC) and fuzzy technique for order of preference by similarity to ideal solution (fuzzy TOPSIS) have been incorporated. Fuzzy CRITIC method was used to identify the critical determinants and fuzzy TOPSIS method was applied for determining relative ranking of some real-world companies. Finally, by developing propositions an interpretive triple helix framework was proposed to achieve SCR. This research stands out for its originality in both methodology and implications. By introducing the novel combination of Fuzzy CRITIC and Fuzzy TOPSIS in the assessment of determinants to SCR and applying these determinants with the help of interpretive triple helix framework to establish a resilient SC, this study offers a unique and valuable contribution to the field of SCR. The key findings suggest that ‘Responsiveness’ followed by ‘Managerial coordination and information integration’ are the most significant determinant to achieve SCR. The outcome of this work can assist the managers to achieve SCR with improved agility and adaptivity.","author":"Md. Galib An-Noor Amio","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b6ccee1eacf00ec20a9d2248d41cb7597f862f5ec6a9ce400f88399db0b99e58","category":"Interdisciplinary"}