{"title":"Minimizing the time to evaluate pheromone‐mediated reduction of aggressive behavior in Mozambique tilapia (Oreochromis mossambicus)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15823?af=R","date":1717461189000,"content":"<h2>Abstract</h2>\n<p>Some cichlid fishes release urine-containing chemical cues that lower aggression in their opponents. Bioassays to identify the aggression-modulating pheromone include assessing the effect of urine fractions on the behavior towards a mirror image or in interactions with another male. However, many of these methods can be time-consuming and require many fish. The objective of the present study was to assess the behavior of male Mozambique tilapia (<i>Oreochromis mossambicus</i>) towards male urine using two methods with the intent of simplifying the bioassays: aggression towards a mirror image (mirror assay) and real opponents in which the urogenital papilla was tied using surgical silk to prevent urination. The results confirm the aggression-reducing effect of dominant male urine in both experimental approaches. Ten minutes of biting or 15 min of tail-beating behaviors in the mirror assay, or 5 min of opercular expansion or 15 min of lateral display in interactions with real opponents were necessary to detect a statistically significant reduction in aggressive behavior towards dominant male urine. We also found that males with subordinate status had lower latency to initiate aggressive behaviors towards the mirror than dominants in the same condition, even though fish had been isolated for 1 week. However, no such differences in latency were found in the real opponent assay. We conclude that 5 min of opercular expansion behavior in real opponent fights or 10 min of biting behavior in the mirror assay are the shortest times necessary to test aggressive behavior in urine fractions in bioassay-guided identification of pheromones.</p>","author":"Samyar Ashouri, \nPeter C. Hubbard, \nAdelino V. M. Canário","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"b6ce1d69704b3e4dfaaaa1df612281970ad1881f8b5382913198d9c64757064f","category":"Environment"}