{"title":"Blurring cluster randomized trials and observational studies: Two-Stage TMLE for subsampling, missingness, and few independent units","link":"https://academic.oup.com/biostatistics/article/25/3/599/7235826?rss=1","date":1690934400000,"content":"<span><div>Summary</div>Cluster randomized trials (CRTs) often enroll large numbers of participants; yet due to resource constraints, only a subset of participants may be selected for outcome assessment, and those sampled may not be representative of all cluster members. Missing data also present a challenge: if sampled individuals with measured outcomes are dissimilar from those with missing outcomes, unadjusted estimates of arm-specific endpoints and the intervention effect may be biased. Further, CRTs often enroll and randomize few clusters, limiting statistical power and raising concerns about finite sample performance. Motivated by SEARCH-TB, a CRT aimed at reducing incident tuberculosis infection, we demonstrate interlocking methods to handle these challenges. First, we extend Two-Stage targeted minimum loss-based estimation to account for three sources of missingness: (i) subsampling; (ii) measurement of baseline status among those sampled; and (iii) measurement of final status among those in the incidence cohort (persons known to be at risk at baseline). Second, we critically evaluate the assumptions under which subunits of the cluster can be considered the conditionally independent unit, improving precision and statistical power but also causing the CRT to behave like an observational study. Our application to SEARCH-TB highlights the real-world impact of different assumptions on measurement and dependence; estimates relying on unrealistic assumptions suggested the intervention increased the incidence of TB infection by 18% (risk ratio [RR]=1.18, 95% confidence interval [CI]: 0.85–1.63), while estimates accounting for the sampling scheme, missingness, and within community dependence found the intervention decreased the incident TB by 27% (RR=0.73, 95% CI: 0.57–0.92).</span>","author":"","siteTitle":"Biostatistics Current Issue","siteHash":"d3a47065211a18721436d2ad1f713237ccbb15b7790ebb347bb018c26cfcb04f","entryHash":"b6d587bc4d67a9cfb079ef8b69c2e9ccec7534df3142b2838147e81dd41365e4","category":"Environment"}