{"title":"Views of healthcare professionals regarding barriers and facilitators for a Fracture Liaison Service in Malaysia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307919","date":1722002400000,"content":"<p>by Min Hui Cheah, Pauline Siew Mei Lai, Terence Ong</p>\r\n\r\nThis study aimed to explore the views of healthcare professionals regarding the barriers and facilitators for a Fracture Liaison Service (FLS) in Malaysia. The qualitative study was conducted from February to December 2021 at a tertiary hospital in Malaysia. Doctors, nurses, pharmacists, and policymakers were recruited via purposive sampling. Semi-structured in-depth interviews were conducted until thematic saturation was achieved. Data were transcribed verbatim and analysed using thematic analysis. Thirty participants [doctors (n = 13), nurses (n = 8), pharmacists (n = 8), and policymakers (n = 1)] with 2–28 years of working experience were recruited. Three themes emerged: 1) Current delivery of secondary fracture prevention; 2) Importance of secondary fracture prevention, and 3) FLS sustainability. Some participants reported that the current post-hip fracture care was adequate, whilst some expressed concerns about the lack of coordination and continuity of care, especially in non-hip fragility fracture care. Most participants recognised the importance of secondary fracture prevention as fracture begets fracture, highlighting the need for a FLS to address this care gap. However, some were concerned about competing priorities. To ensure the sustainability of a FLS, cost-effectiveness data, support from relevant stakeholders, increased FLS awareness among patients and healthcare professionals, and a FLS coordinator were required. Training and financial incentives may help address the issue of low confidence and encourage the nurses to take on the FLS coordinator role. Overall, all participants believed that there was a need for a FLS to improve the delivery of secondary fracture prevention. Addressing concerns such as lack of confidence among nurses and lack of awareness can help improve FLS sustainability.","author":"Min Hui Cheah","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b6de7ceabac03733dbebbc43b0d310fdbe5c3a3cb78e4a6e0aa8f8d95d5d8f16","category":"Interdisciplinary"}