{"title":"VMware Fusion Review: New features in Fusion 13","link":"https://www.macworld.com/article/668080/vmware-fusion-review.html","date":1690806237000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a Glance</span><h3>Expert's Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Free for ‘non-commercial’ users</li><li>Unity mode runs Windows apps on Mac desktop</li><li>3D acceleration for Intel-based Macs</li></ul></div><div><h3>Cons</h3><ul><li>Limited support for Apple Silicon Macs</li><li>Little help for installing Windows 11 On Arm</li><li>Uses a lot of techno-jargon</li></ul></div></div></div><h3>Our Verdict</h3><p>Support for Apple Silicon is still a work in progress, but Fusion 13 remains a good option for Mac users who need to run Windows 11 or Linux apps on their Macs. And, with a free version available for non-commercial use, it’s also the most affordable option for home users and students.</p>\n</div><h3>Price When Reviewed</h3><p>Free (personal use); $149 (commercial); $199 (pro edition)</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today: VMware Fusion\t\t</h3>\n\t\t\t\t<div>\n\t\t\n\t\t<div>\n\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>VMware</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$0</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://store-us.vmware.com/fusion_buy_dual_new&amp;xcust=1-1-668080-2-660845-11742&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\tPrice comparison from Backmarket\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>For many years Parallels Desktop and VMware Fusion fought a long battle to produce the best virtualization software for Mac users who needed to <a href=\"https://www.macworld.com/article/668848/best-virtual-machine-software-for-mac.html\">run Windows software on their Macs</a>. Every time Apple released a <a href=\"https://www.macworld.com/article/672681/list-of-all-macos-versions-including-the-latest-macos.html\">new version of the macOS</a> we would see Parallels and VMware release their own updates, and this competition was great for Mac users as it meant that both programs continued to offer new features and performance improvements every year. In recent years, though, VMware has seemed to focus more on its high-end corporate products and, since the introduction of Apple Silicon in 2020, Fusion no longer really competes with the annual updates to <a href=\"https://www.macworld.com/article/668146/parallels-desktop-review.html\">Parallels Desktop</a> anymore.</p>\n\n\n\n<p>Both programs work in basically the same way, allowing you to create a virtual machine (VM) that runs on your Mac just like any other Mac application. This virtual machine emulates the workings of a Windows PC, allowing you to <a href=\"https://www.macworld.com/article/670954/how-to-install-windows-on-mac.html\">install a full copy of Windows</a> on the virtual machine and then run any Windows software or games that you need to use. And, crucially, you can run your Windows apps right alongside your existing Mac apps – rather than having to switch back and forth between Mac and Windows as you have to do when using Boot Camp on Intel Macs (and, of course, <a href=\"https://www.macworld.com/article/670954/how-to-install-windows-on-mac.html\">Boot Camp</a> is no longer available on Macs with Apple Silicon at all). Both programs also allow you to create virtual machines that run various versions of Linux too, which is a useful feature for many developers and students.</p>\n\n\n\n<p><em>Updated July 31, 2023 with details of VMware’s tech preview of a forthcoming update to Fusion that should lead to performance improvements for Macs with Apple Silicon. </em></p>\n\n\n\n<h2>Fusion 13 meets Windows 11</h2>\n\n\n\n<p>The last major update to Fusion was version 12 in 2021, but Fusion 12 didn’t support Apple’s new M1 or M2 processors, so it would only run on older Macs that still had Intel processors. And, in fact, it didn’t officially support Windows 11 as a guest operating system for your Windows virtual machines either. But, to try and tempt people away from Parallels Desktop, VMware did announce a free version of the program – called Fusion Player – which is available for ‘non-commercial’ use, such as home users or students who just need to use Windows apps on their Macs every now and then. </p>\n\n\n\n<p>You need a MyVMware account to benefit from the free version and you shouldn’t be using it for commercial reasons. Register for your free personal use license <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.vmware.com/products/fusion.html&amp;xcust=1-1-668080-1-0-0&amp;sref=https://www.macworld.com/feed\">here</a>.</p>\n\n\n\n<p>That’s still the case today with the new Fusion 13, which is available as a free download for non-commercial use, although business users who want to use Fusion more regularly at work are required to pay for a commercial license for Fusion Player, which costs $149/£127.49. There’s also a version called Fusion Pro, which provides more advanced features for larger organizations and IT managers, priced at $199/£169.16.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Windows 11 Vmware\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?quality=50&amp;strip=all 1504w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?resize=300%2C197&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?resize=768%2C505&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?resize=1200%2C788&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Windows-11-settings.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"788\" /></figure><p>Foundry</p></div>\n\n\n\n<p>New updates may have been coming more slowly in the last couple of years, but there’s a small group – called ‘teamfusion’ – at VMware who are led by Michael Roy (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://blogs.vmware.com/teamfusion/)&amp;xcust=1-1-668080-1-0-0&amp;sref=https://www.macworld.com/feed\">blogs.vmware.com/teamfusion/)</a> and are continuing to work on improving Fusion. A preview version of Fusion was released about a year ago that introduced support for both Apple Silicon and Windows 11, but it wasn’t until the end of 2022 that the final version of Fusion 13 was released.</p>\n\n\n\n<p>When you download Fusion 13, it provides a single universal file that can run natively on both Intel Macs and Macs with Apple Silicon processors. The only limitation is that Fusion now requires a Mac running macOS 12 (Monterey) or later (whereas Parallels Desktop will run on macOS going back to Catalina 10.15).</p>\n\n\n\n<p>When running on Macs with Intel processors, Fusion continues to work just as it has always done. You can assign up to 32 processor cores to your virtual machines, and up to 128GB of memory, in order to fine-tune the performance of your virtual machines as required. </p>\n\n\n\n<p>Fusion also has a viewing mode called Unity – which is similar to the Coherence mode of Parallels Desktop – that hides the Windows desktop on your virtual machines and allows individual Windows apps to sit on the Mac desktop right alongside all your other Mac apps.</p>\n\n\n\n<h2>Windows on Apple Silicon</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"VMware Windows 11 on Mac\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?quality=50&amp;strip=all 2784w, https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?resize=300%2C205&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?resize=768%2C524&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?resize=1200%2C819&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?resize=1536%2C1048&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/VMware-13-windows-11-on-Mac.jpg?resize=2048%2C1398&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"819\" /></figure><p>VMware</p></div>\n\n\n\n<p>There’s a more limited range of features available when running Fusion 13 on Macs that have Apple Silicon processors such as the M1 or M2. These Macs need a special version of Windows 11 called Windows 11 On Arm, and VMware’s Michael Roy says that Fusion 13 is just “our first round of features for Windows 11 On Arm”.</p>\n\n\n\n<p>This means that the process of installing and running Windows 11 on Macs with Apple Silicon has some rather rough edges. Parallels Desktop includes an option to automatically download and purchase Windows 11 On Arm when creating a new virtual machine, but VMware simply told us that it’s up to the user to buy a license from Microsoft. Unfortunately, that’s not an easy task, as Windows 11 On Arm is primarily intended for sale to PC manufacturers, rather than individual users, so VMWare needs to make Fusion a bit more user-friendly for people who don’t understand the intricacies of Microsoft’s licensing policies. Fusion also has a tendency to throw a lot of complicated jargon at you too – such as “side channel mitigations” – which is the sort of thing that only corporate IT managers are likely to understand.</p>\n\n\n\n<p>There are some technical limitations too. When running on Macs with Intel processors, Fusion provides hardware acceleration for 3D graphics in Windows games and design software that use DirectX and OpenGL 4.3. But, when running on Apple Silicon, Fusion only supports OpenGL for virtual machines that use Linux – with Windows support still in development. To be fair, the high performance of Apple’s M1 and M2 processors means that your Windows virtual machines should be able to handle routine tasks such as web browsing or running the Windows version of Microsoft Office without too much trouble – and even at 4K resolution too.</p>\n\n\n\n<p>However, gamers who are hoping to play Elden Ring or Diablo IV may be disappointed – at least with the current version of Fusion 13. But there’s hope on the horizon, as in July 2023 VMware announced a tech preview of a forthcoming update to Fusion that provides new features and performance improvements for Macs with Apple Silicon.</p>\n\n\n\n<p>As mentioned, the current release version of Fusion 13 doesn’t support 3D graphics acceleration when running Windows 11 On Arm on Macs with Apple Silicon (M1 or M2 processors). However, the Fusion Tech Preview 2023 brings “full 3D hardware accelerated graphics” to virtual machines running Windows On Arm on Macs with Apple Silicon, including support for Microsoft’s DirectX 11 graphics system. VMware also states that this improvement in graphics performance will boost performance for the Windows user-interface as well so that tasks such as changing the resolution of the Windows virtual machine become quicker and smoother.</p>\n\n\n\n<p>There are other features that are currently only available when running Fusion on older Macs with Intel processors, which will also be updated so that they run on Macs with Apple Silicon too. Collectively known as VMware Tools (just like Parallels Tools on the rival Parallels Desktop) these features are designed to allow the macOS and Windows operating systems to work together more efficiently. Key features here include the ability to copy/paste and drag-and-drop between Mac apps and Windows apps. The Autofit feature will also now allow you to quickly change the resolution of the Windows On Arm virtual machine simply by dragging the Fusion window to the size you require.</p>\n\n\n\n<p>The Fusion Tech Preview also introduces a new security feature, using an encryption system called XTS. This won’t be backward-compatible with older versions of Fusion, so you should take care to back up your Fusion virtual machines before trying this particular new feature. There’s no release date for the next version of VMware Fusion, but you can download the Fusion Tech Preview, and read all about the new features from the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blogs.vmware.com/teamfusion/2023/07/vmware-fusion-2023-tech-preview.html&amp;xcust=1-1-668080-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">VMware Blog</a></p>\n\n\n\n<p>Just remember, of course, that the Fusion Tech Preview is not finished software, so take care when using it to work with any important files or data that you don’t want to lose.</p>\n\nMac, MacOS, Personal Software, Professional Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b6de849da9731825628b6d7aaace5f64d67c98ca204b353963ae95edb89cb4dd","category":"Apple"}