{"title":"Password-stealing Linux malware served for 3 years and no one noticed","link":"https://arstechnica.com/?p=1967881","date":1694547267000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-digital-trojan-horse-800x522.jpg\" alt=\"Illustration of a Trojan horse in an electronic environment.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-digital-trojan-horse.jpg\">Enlarge</a> <span>/</span> A digital Trojan horse. (credit: Getty Images | posteriori)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A download site surreptitiously served Linux users malware that stole passwords and other sensitive information for more than three years until it finally went quiet, researchers said on Tuesday.</p>\n<p>The site, freedownloadmanager[.]org, offered a benign version of a Linux offering known as the Free Download Manager. Starting in 2020, the same domain at times redirected users to the domain deb.fdmpkg[.]org, which served a malicious version of the app. The version available on the malicious domain contained a script that downloaded two executable files to the /var/tmp/crond and /var/tmp/bs file paths. The script then used the cron job scheduler to cause the file at /var/tmp/crond to launch every 10 minutes. With that, devices that had installed the booby-trapped version of Free Download Manager were permanently backdoored.</p>\n<p>After accessing an IP address for the malicious domain, the backdoor launched a reverse shell that allowed the attackers to remotely control the infected device. Researchers from Kaspersky, the security firm that discovered the malware, then ran the backdoor on a lab device to observe how it behaved.</p></div><p><a href=\"https://arstechnica.com/?p=1967881#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967881&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b6e26f8eaf0782c2596da6d1316e4f92876bacf21cccd11305345b765e911528","category":"Tech"}