{"title":"Enhancing Crop Yield Predictions with PEnsemble 4: IoT and ML-Driven for Precision Agriculture","link":"https://www.preprints.org/manuscript/202403.0969/v1","date":1710746514000,"content":"This paper presents the PEnsemble 4 model, a sophisticated machine learning framework that integrates IoT-based environmental data to accurately forecast maize yield. With the projected significant growth in global maize demand over the next decade, the inherent risks posed by the crop’s dependence on weather conditions necessitate improved prediction capabilities. The PEnsemble 4 model, developed with high accuracy, incorporates comprehensive datasets encompassing soil attributes, nutrient composition, weather conditions, and UAV-captured vegetation imagery. By employing a combination of Huber and M estimates, the PEnsemble 4 model effectively analyzes temporal patterns in vegetation indices, specifically CIre and NDRE, which serve as reliable indicators of canopy density and plant height. In addition, this research significantly contributes to precision agriculture by offering an efficient and sustainable alternative to conventional farming practices through precise yield predictions. Notably, the PEnsemble 4 model enables earlier estimation, advancing the timeline for yield prediction from the conventional day 100 in the R6 stage to day 79 in the R2 stage. This improvement enhances decision-making processes in farming operations. The remarkable accuracy rate of 91% underscores the importance of adopting a multifaceted data approach that harnesses IoT-derived environmental insights. Additionally, the PEnsemble 4 model extends its benefits beyond yield prediction, facilitating the detection of water and crop stress, as well as disease monitoring in broader agricultural contexts. Ultimately, the PEnsemble 4 model establishes a new standard in maize yield prediction, revolutionizing crop management and protection through the synergistic utilization of IoT and machine learning technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b6eae8392e495177156a32fd82870c58a5e4d4a9d9d4c2d1d24a9a74052415a3","category":"Interdisciplinary"}