{"title":"Copy number variant detection using next-generation sequencing in <i>EYS</i>-associated retinitis pigmentosa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305812","date":1719237600000,"content":"<p>by Masakazu Hiraoka, Yusaku Urakawa, Kanako Kawai, Akiko Yoshida, Junichi Hosakawa, Masaki Takazawa, Akira Inaba, Satoshi Yokota, Yasuhiko Hirami, Masayo Takahashi, Osamu Ohara, Yasuo Kurimoto, Akiko Maeda</p>\r\n\r\nRetinitis pigmentosa (RP) is the most common inherited retinal dystrophy and a major cause of blindness. RP is caused by several variants of multiple genes, and genetic diagnosis by identifying these variants is important for optimizing treatment and estimating patient prognosis. Next-generation sequencing (NGS), which is currently widely used for diagnosis, is considered useful but is known to have limitations in detecting copy number variations (CNVs). In this study, we re-evaluated CNVs in <i>EYS</i>, the main causative gene of RP, identified via NGS using multiplex ligation-dependent probe amplification (MLPA). CNVs were identified in NGS samples of eight patients. To identify potential CNVs, MLPA was also performed on samples from 42 patients who were undiagnosed by NGS but carried one of the five major pathogenic variants reported in Japanese <i>EYS</i>-RP cases. All suspected CNVs based on NGS data in the eight patients were confirmed via MLPA. CNVs were found in 2 of the 42 NGS-undiagnosed RP cases. Furthermore, results showed that 121 of the 661 patients with RP had <i>EYS</i> as the causative gene, and 8.3% (10/121 patients with <i>EYS</i>-RP) had CNVs. Although NGS using the CNV calling criteria utilized in this study failed to identify CNVs in two cases, no false-positive results were detected. Collectively, these findings suggest that NGS is useful for CNV detection during clinical diagnosis of RP.","author":"Masakazu Hiraoka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b6ecc2cc9707340bf9a50be034f3d448927d67c072c0fcb79ba100161e78ec63","category":"Interdisciplinary"}