{"title":"Matej Mohorič: Gravel racing will be a focus for me in 2024","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/matej-mohoric-gravel-racing-will-be-a-focus-for-me-in-2024","date":1699887165000,"content":"\n      <p><span>Matej Mohorič becoming gravel world champion this year was an outcome that few of us had on our bingo cards at the start of the season. Although a prolific winner on the road, the Slovenian rider has never shown an interest in dabbling in the rough stuff until this year. When you think about it, though, the fact that Mohorič excels when things get especially tough and technical, and when the distances are long, makes a lot of sense.</span></p>\n<div></div>\n<div></div>\n<p><span>If there’s anything that his famous dropper seat post daredevil descent in <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-San Remo</a> taught us, it’s that Mohorič’s bike-handling is breathtaking. He finesses corners and floats on the tarmac like he was born to do so – himself and his bike are at one. When he broke away solo in the closing kilometres of the Gravel World Championships it was a similar story, he was pushing the limits of every turn, making those of us watching at home wince in anticipation. For Mohorič himself, however, it was nothing special.</span></p>\n<p><span>“I was completely within my perception of what's normal, efficient and smooth,” he says matter-of-factly. “But I did grow up riding those types of roads, I was riding my supermarket mountain bike down trails like that when I was six years old, so it was not uncomfortable to me.”</span></p>\n<p><span>The UCI Gravel World Championships took place in the Italian region of Treviso, around a three hour drive from Mohorič’s native Slovenia. While it's not the exact area he grew up in, he admits that the forests and terrain of his hometown were similar to those he faced in Italy.</span></p>\n<p><span>“I didn't know what to expect but I grew up in the forest. As a six-year-old child, I was riding very similar trails to what they had in that race. I felt comfortable on those roads during the recon. When I was a little child, I would have preferred to start racing off-road than on road, but I started on the road when I was seven then I just always stayed,” he explains. “But I genuinely really enjoyed the experience. It was the first time I was allowed to participate in a proper off-road race.”</span></p>\n<p><span>In the past, Mohorič’s sole focus has been racing in the WorldTour, targeting the Classics and stage wins in Grand Tours. 2023 was the first time his team had given him the opportunity to race on gravel, in part due to Bahrain-Victorious’ bike sponsor, Merida, launching a new gravel bike, the Merida ​​Silex, a few weeks after the event (Mohorič won the Gravel World Championships on a prototype of the bike).</span></p>\n<p><span>“The team asked me to participate as a favour. I was immediately up for the idea and I enjoyed the whole experience. The bike came a little bit late and I didn’t get much time to train on it, I only got it on Thursday and the race was on Sunday which I was sad about,” the 29-year-old rider explains.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0096_1024x1024.jpg?v=1699635435\" /><em><span>Image: Alex Whitehead/SWpix</span></em></span></p>\n<p><span>Despite Mohorič being unfamiliar with his set-up for the race, Merida couldn’t have asked for a better validation of their new gravel offering than the Slovenian rider eventually taking a dominant, solo win in Pieve di Soligo where the World Championships concluded.</span></p>\n<p><span>“I knew that I was physically amongst the strongest in the race, but I definitely had a huge amount of respect for all the other riders that were way more experienced in off-road racing,” Mohorič explains. “I just wanted to enjoy the opportunity to actually race off-road and live every moment of it, because I didn't know if it was ever going to happen again or not. I'm glad I embraced the opportunity and actually took advantage of my really good physical condition which I kept even after all the racing I’ve done this year.”</span></p>\n<p><span>The friendly and more relaxed atmosphere of gravel racing is something that draws many riders towards the discipline. In gravel events, it’s often just as much about the social atmosphere before and after the race as it is about the winner on the day, something Mohorič noticed in his first experience of the gravel scene.</span></p>\n<p><span>“You start just a couple of minutes in front of the age group categories so if you do end up having a puncture or something, you're right with them,” he explains. “You get ready in the same area in the same parking area and you feel more of a community vibe, it was nicer, I thought.”</span></p>\n<p><span>It wasn’t only before the race that Mohorič saw differences between gravel and road races, commenting that gravel, in some ways, is more of a physical challenge than racing on the tarmac.</span></p>\n<p><span>“It's completely different to road racing, there's not a lot of drafting involved, you need to stay at the front. Inevitably, that leads to average power being much higher and the race being more demanding,” he says. </span></p>\n<p><span>“Strictly energy consumption wise and strictly from a performance standpoint, the Gravel World Championships was the hardest ride I’ve ever done. Harder than <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège–Bastogne–Liège</a> and the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>. You need the best shape you can get to do well. It’s an honest race from both a physical standpoint but also because, more often than not, crashes and mechanicals are your fault if you don't see an obstacle or you hit a big rock or something.”</span></p>\n<p><span>Mohorič admits that the difficulty of the Gravel World Championships wasn’t something that he’d expected ahead of the race, noting that this has made the win mean even more to him than he initially thought, ranking above even his Monument victory on the road.</span></p>\n<p><span>“If people had asked me what the win would mean ahead of the race I would have put it below my two <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> stage wins and Milan-San Remo,” he admits. “When you ask me today, I would rate it above because it really caught a lot of attention and I genuinely think that in a couple of years, it's going to be crazy hard to repeat this achievement, so I appreciate it and I’m grateful.”</span></p>\n<p><span>With gravel constantly growing as a discipline, Mohorič doesn’t expect to be the first rider to move over from the WorldTour to the gravel scene, arguing that the importance of the Gravel World Championships for stakeholders like brands will push more road riders into competing.</span></p>\n<p><span>“The partners, the sponsors and the bike manufacturers are going to put more pressure on teams to actually have their sponsored athletes who have a chance to win the event go and race it, because it's a huge recognition for them,” he explains. “I think this sport is exploding. It's on a very steep growth curve.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mohoric02-Rouleur-Live01_2023_1024x1024.jpg?v=1699635480\" /></span><em><span>Image: James Startt</span></em></p>\n<p><span>It’s no secret that WorldTour riders taking part in select gravel events have been met with mixed responses from those riders who dedicate themselves fully to gravel racing all year. In last year’s Gravel World Championships, there was uproar on social media when road professionals were immediately gridded to the front on the start line, rather than gravel professionals who had raced in premier gravel events all year. While Mohorič understands the frustration from those who do gravel as their sole discipline, he sees WorldTour riders turning up to join the races as something that’s inevitable for the growth of the sport.</span></p>\n<p><span>“Last year the parcours were not pure gravel. I think they [full-time gravel racers] all agree that this year’s parcour was one of the hardest they’ve done all year. It was, at points, closer to a mountain bike course than a gravel course. Some of the descents were pretty nasty – I loved that! But, I genuinely think that they don't mind if the WorldTour pros turn up to the World Championships as long as the course is a gravel course,” Mohorič says. “It’s about who is the best in the world in that discipline. Some of them are also ex-pros from the road and know that we are physically on a different level having been given different support during the year.</span></p>\n<p><span>“You can’t compare a 30 million euros budget of a WorldTour team that gives support to someone like me, to a privateer who has his family giving support to him on race day. It's not the same thing. But I think they are better off with us turning up to the events, the sport is going to get more recognised and gain popularity.”</span></p>\n<p><span>Having the opportunity to wear the rainbow stripes in gravel races next year is something that Mohorič admits he doesn't want to miss out on, despite stressing his unwavering commitment to a full road calendar. He points out that he’s been world champion twice before, as a junior and an under-23 rider. On both those occasions he wasn’t able to wear the rainbow stripes due to moving up a category the following season, something he plans to make up for in 2024.</span></p>\n<p><span>“I’m not going to get flicked the third time round,” he laughs. “We're going to establish a proper schedule and see what we can do. Obviously, still, the focus is going to be mostly on the road and these are the most important goals, but if we can fit in some gravel races that don't harm the other goals and objectives, it’s definitely going to be a focus.”</span></p>\n<p><em><span>Cover image: James Startt</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b6efada4cc951035357907487008334bdb6ac825ce3efd0ec2dbc8da3bf1d4ce","category":"Cycling"}