{"title":"Sony’s “generations matter” mantra crumbles: Gran Turismo 7 will be cross-gen","link":"https://arstechnica.com/?p=1769551","date":1622743391000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/gt7-not-exclusive-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/gt7-not-exclusive.png\">Enlarge</a> <span>/</span> We've since touched up <em>GT7</em>'s last significant advertisement, as per this week's platform update. (credit: Sony Interactive Entertainment / Aurich Lawson)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On Wednesday, Sony published <a href=\"https://blog.playstation.com/2021/06/02/hermen-hulst-qa-whats-next-for-playstation-studios/\">a wide-ranging interview with the head of its PlayStation Studios division</a>, arguably to set expectations ahead of the usual barrage of mid-June game announcements and reveals. In Sony's case, setting expectations now requires telling fans which console to expect future games to land on—especially in a world where <a href=\"https://arstechnica.com/cars/2021/05/chip-shortage-continues-us-asks-taiwan-to-prioritize-automakers/\">chip shortages</a> have made it tough to purchase the company's new and very popular PlayStation 5.</p>\n<p>This week's PlayStation announcement marks a change for multiple games that had been previously advertised as PlayStation 5 titles. We have now learned that <em>God of War: Ragnarok</em> and <em>Gran Turismo 7</em> are officially coming to both PlayStation 4 and PlayStation 5. The news follows last week's confirmation that <a href=\"https://arstechnica.com/gaming/2021/05/horizon-forbidden-west-gameplay-reveal-swimming-with-tropical-robo-saurs/\"><em>Horizon: Forbidden West</em> will also launch as a cross-gen game</a>.</p>\n<p>While the <em>God of War</em> sequel's backward-compatibility status was unclear, the <em>Gran Turismo 7</em>'s announcement comes as a big surprise, since it was <a href=\"https://arstechnica.com/gaming/2020/06/grand-theft-auto-v-is-getting-expanded-and-enhanced-for-ps5-next-year/\">revealed to the world in June 2020 with a loud \"get ready for next gen\" tagline</a>, followed by an outright declaration six months later that the game would be <a href=\"https://www.youtube.com/watch?v=2KROCZ1q4OE\">a \"PlayStation 5 exclusive.\"</a> Both video advertisements for the anticipated racing game revolved around intense reflection effects that take material properties and car surface warping into account. While Sony Interactive Entertainment has yet to detail exactly how the game's tech works, what we've seen so far will likely hinge on next-gen processing power, perhaps with ray-tracing or double-rendered geometry.</p></div><p><a href=\"https://arstechnica.com/?p=1769551#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769551&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b6f8d9cd1a5290fc47c43ffc89f19b117515896f02f5029492c7ddf1221571c3","category":"Tech"}