{"title":"This refurb Apple Watch Series 5 with LTE is cheaper than an Apple Watch SE","link":"https://www.macworld.com/article/551870/this-refurb-apple-watch-series-5-with-lte-is-cheaper-than-an-apple-watch-se.html","date":1637001377000,"content":"<div>\n<section><div></div></section><p>With <a href=\"https://www.macworld.com/article/541154/black-friday-apple-deals-retailers-prices.html\">Black Friday approaching</a>, we’re frantically tracking the best deals on Apple’s latest products. But today we have one on an older device: Amazon’s Woot is selling <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.woot.com/offers/apple-watch-series-5-grade-a-refurbished-your-choice?ref=w_cnt_wp_0_3&amp;xcust=1-1-551870-1-198083-9934&amp;sref=https://www.macworld.com/feed\">a “Grade A” refurbished 40mm Apple Watch Series 5 with GPS and cellular for $280</a>, the same price as an Apple Watch SE. That’s $220 off the original MSRP and the best price we’ve ever seen.</p>\n\n\n\n<p>First the technical stuff. Woot is offering a 90-day warranty on these watches and promises that they “have been inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm’s length &amp; have successfully passed a full diagnostic test which ensures like-new functionality” Additionally, the batteries are guaranteed to have a minimum 85 percent capacity.</p>\n\n\n\n<p>The Apple Watch Series 5 is two generations old, but it’s still an excellent wearable. The main things you’re missing are the blood-oxygen sensor and always-on altimeter that was introduced on <a href=\"https://www.macworld.com/article/234682/apple-watch-series-6-review.html\">the Series 6</a> and the larger screen of <a href=\"https://www.macworld.com/article/547360/apple-watch-series-7-review.html\">the Series 7</a>. The chip is also slightly slower, but everything else is the same: design, display, battery life, and fitness features. You’ll also be able to update to watchOS 8.</p>\n\n\n\n<p>When we <a href=\"https://www.macworld.com/article/233334/apple-watch-series-5-review.html\">reviewed the Apple Watch Series 5</a>, we called it “the absolute best smartwatch money can buy,” with “an incredible screen, excellent app support, and the strongest set of sensors and features you’ll find anywhere.” While it’s obviously no longer the best smartwatch, it’s still a solid choice at a great price.</p>\n\n\n\n<p>Woot is also offering discounts on several other refurbished Apple Watch and iPhone models today, so be sure to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.woot.com/plus/iphones-and-apple-watches-6?ref=w_cnt_gw_dly_image&amp;xcust=1-1-551870-1-0-0&amp;sref=https://www.macworld.com/feed\">check out the entire sale</a>.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b6fc0666ff2764413cbb8dbf697aad8052dbe7339faa96e2f094444a4ffc1d24","category":"Apple"}