{"title":"La verdadera magia del iPad Pro de nueva generación la veremos en su teclado","link":"https://www.macworld.com/article/2048504/teclado-nuevo-ipad-pro.html","date":1693469403000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>“No me gustaría tener que dedicarme al negocio de las fundas para el iPhone”, me dijo un amigo el otro día, y no pude evitar darle la razón. </p>\n\n\n\n<p>Diseñar accesorios para los productos de Apple significa competir ferozmente por unos márgenes muy reducidos, apostar por las primeras filtraciones de diseños para empezar con tus propias creaciones y estar totalmente a merced de las decisiones de diseño de Apple.</p>\n\n\n\n<p>Sin embargo, hay un vendedor de accesorios de Apple que no tiene que preocuparse tanto: la propia Apple. </p>\n\n\n\n<p>Apple tiene la ventaja de conocer todos los detalles de sus próximos productos. Tiene la posibilidad de vender productos de marca Apple con márgenes de beneficio mucho mayores. Pero quizá ahí esté la mayor ventaja de todas: Apple puede controlar el propio diseño del producto para crear los accesorios que desee.</p>\n\n\n\n<p>Ningún producto encarna la sinergia propia de Apple entre <em>hardware </em>y accesorios como el iPad. Si lo reducimos a lo básico, no es más que una <em>tablet</em>. </p>\n\n\n\n<p>Pero puede equiparse con fundas Smart Folio, teclados Magic Keyboard y lápices Apple Pencil, a menudo con conectividad proporcionada por puertos nunca vistos en ningún otro producto Apple. Y parece que estamos a punto de ver otra ronda de innovación en accesorios para el iPad.</p>\n\n\n\n<p>Esta semana, Mark Gurman, de <em>Bloomberg</em>, ha informado de que el año que viene habrá un <a href=\"https://www.macworld.com/article/1926698/ipad-pro-de-14-pulgadas.html\">nuevo iPad Pro</a>. Y, dice, vendrá con un “renovado” Magic Keyboard que “hará que el iPad Pro se parezca aún más a un ordenador portátil que la configuración actual y añade un <em>trackpad </em>más grande”</p>\n\n\n\n<p>El <a href=\"https://www.macworld.com/article/1458884/sale-a-la-venta-oficialmente-el-nuevo-ipad-pro-con-mayor-potencia-que-nunca.html\">iPad Pro</a> actual utiliza un diseño específicamente construido para permitir accesorios interesantes: un fuerte conjunto de imanes y un Smart Connector (tres puntos de metal que transfieren energía y datos), todo situado en la parte posterior del dispositivo. </p>\n\n\n\n<p>El Smart Connector estaba anteriormente en el lateral, pero claramente, Apple decidió que la colocación a lo largo de la parte posterior encajaría mejor con los futuros accesorios que tenía en mente.</p>\n\n\n\n<p>Entonces, ¿para qué accesorios estaría diseñado el iPad de 2024? Gurman cita el <a href=\"https://www.macworld.com/article/1451434/mejores-teclados-mac.html\">Magic Keyboard</a>, y llegaremos a eso en un momento, pero primero, vamos a reflexionar sobre el enigma del Apple Pencil. </p>\n\n\n\n<p>El Pencil de segunda generación se acopla a un conjunto de imanes y a un cargador inalámbrico en el lateral del iPad, diseñado específicamente para el Pencil. (¿Ves qué bonito es cuando el producto y los accesorios se diseñan juntos?)</p>\n\n\n\n<p>El Pencil de segunda generación es estupenda. Sin peros. Pero cuando Apple rediseñó el iPad de gama baja el año pasado, movió la <em>webcam</em> del iPad al lado largo del dispositivo, aparentemente bloqueando el espacio donde el Pencil 2 podría haber ido. </p>\n\n\n\n<p>En su lugar, el iPad utiliza el Apple Pencil original. Como resultado, es posible que Apple tenga que reconsiderar su enfoque del Apple Pencil una vez más. Supongo que Apple encontrará una manera de hacer que todo funcione, incluso si eso significa crear un nuevo diseño de Pencil para que todo tenga sentido.</p>\n\n\n\n<p>¿Y qué pasa con el Magic Keyboard? El diseño actual de Apple, introducido en 2020, hace flotar el iPad por encima del teclado a través de un voladizo unido magnéticamente. </p>\n\n\n\n<p>La razón de esa ingeniería extra es pura física: sin mover el centro de masa del dispositivo sobre el teclado, toda la carcasa se volcaría hacia atrás. </p>\n\n\n\n<p>Es una solución inteligente, pero reduce el espacio disponible para las filas del teclado (¡no hay teclas de función!), y el <em>trackpad </em>del Magic Keyboard es bastante pequeño, en comparación con los <em>trackpads </em>de los equipos de Apple.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/reviews/3787426/1magic_keyboard_apple_ipad.jpg?quality=50&amp;strip=all\" alt=\"iPad Magic Keyboard detalle\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<p>El informe de Gurman dice que el nuevo accesorio es más grande y más parecido a un portátil. Los portátiles, por supuesto, no se inclinan sobre sus teclados, simplemente están unidos por una bisagra en la parte trasera. Los portátiles no vuelcan hacia atrás cuando los abres porque la parte inferior es mucho más pesada que la superior.</p>\n\n\n\n<p>Si la información de Gurman es correcta, entonces tengo que asumir que la próxima generación del Magic Keyboard va a poner todo su peso justo debajo del teclado. Este es el enfoque que han utilizado los teclados Bluetooth del iPad, y han conseguido que funcione.</p>\n\n\n\n<p>La clave estará en cómo Apple diseñe el iPad para conectarlo a este accesorio. ¿Habrá puntos específicos en el lateral del iPad que permitan que una bisagra en la parte trasera del teclado lo sujete y lo mantenga en posición vertical, al estilo de un portátil?</p>\n\n\n\n<p>¿O seguirá Apple confiando en los potentes imanes de la parte trasera del iPad para fijarlo a una superficie relativamente ligera conectada al teclado con una bisagra?.</p>\n\n\n\n<p>En cualquier caso, Apple tendrá que añadir algo de peso al teclado. Y aunque puedas pensar que añadir peso es algo malo, tiene sus ventajas. </p>\n\n\n\n<p>Incluso un Magic Keyboard ligeramente más pesado no hará que la unidad combinada sea más pesada que un portátil Mac. Un teclado más pesado podría tener ese <em>trackpad </em>más grande, y una fila adicional de teclas de función.</p>\n\n\n\n<p>Pero aquí está la mejor parte: Apple podría, por primera vez, incluir una batería bajo ese teclado. </p>\n\n\n\n<p>Los anteriores teclados de iPad de Apple se alimentaban del Smart Connector, pero imagina un teclado que funcione como batería y cargador, permitiendo que un iPad en la funda amplíe drásticamente la duración de su batería. Es un gran conjunto de características.</p>\n\n\n\n<p>Muchos de los informes de Gurman sobre la próxima generación del iPad Pro son más o menos lo que cabría esperar: Pantallas OLED y <a href=\"https://www.macworld.com/article/2047223/mac-chip-m3-rendimiento.html\">procesadores M3</a>.</p>\n\n\n\n<p>Pero una gran parte de la identidad del iPad viene de su capacidad para adaptarse a diferentes usos a través de su gran colección de accesorios. Por eso me entusiasma la idea de que Apple rediseñe el iPad Pro para una nueva generación de accesorios.</p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/2046116/ipad-pro-revamp-magic-keyboard-pencil.html\" target=\"_blank\">Macworld.com</a></em>.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b6fe2b527348ac8e8ef1161a463f31201db9fcdfdc3766e115cd308c5fcd21ba","category":"Apple"}