{"title":"Amphetamine review: Chill your Mac’s desire to sleep","link":"https://www.macworld.com/article/548594/amphetamine-review.html","date":1636110000000,"content":"<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div></div><h3>Price When Reviewed</h3><p>Free</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Mac App Store</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$0</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://itunes.apple.com/us/app/amphetamine/id937984704&amp;xcust=1-1-548594-2-245840-16495&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Apple and macOS long ago became obsessed with reducing the power usage on your Mac, through putting drives to sleep, dimming the display, or going into sleep or hibernate modes. The original reasons were practical: to avoid screen burn-in on a CRT, to reduce wear on hard drives, to produce less heat, or simply to reduce electrical usage for conservation and cost reasons.</p>\n\n\n\n<p>We’re in a post-CRT world with mostly efficient SSDs driving Macs, and Apple silicon drops idle computers’ heat profile and electrical usage to a surprisingly low amount. Yet, Apple persists in pushing for always using less juice. They’re probably correct. But what if you need your Mac to stay awake for a fixed period time or for particular reasons?</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mac-gems-amphet-while-app-running-menu.png?w=1200\" /><figcaption>You can use the menu for a lot of straightforward operations, such as keeping your Mac alert as long as a selected app remains running.</figcaption></figure></div>\n\n\n\n<p>Open your eyes with Amphetamine, a free utility by William Gustafson that lets you click, schedule, or trigger Mac alertness from the menu bar. For such a simple concept as “don’t let parts or all of a Mac go to sleep,” Amphetamine has fleshed out a robust set of options—and also lets you ignore them all.</p>\n\n\n\n<p>In the simplest case, you can choose an item from the menu: Indefinitely keeps your Mac awake until canceled, but you can also select a duration, while a given app remains running, or until a file is downloaded. (That last one is a neat treat: pick an observation interval after which Amphetamine checks if the file has changed in size so it can predict that the file has completed its download.)</p>\n\n\n\n<p>You can make things far more complicated, too. Let’s say you regularly plug in an external drive to a laptop to perform a Time Machine backup or a drive clone, but you don’t want to keep the backup going if the battery runs low. In the app’s preferences, under Triggers, you can say as long as a given drive is mounted and battery power is greater than 50 percent or the laptop is plugged in, don’t sleep.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mac-gems-amphet-trigger-bordered.png\" /><figcaption>A trigger lets you set when Amphetamine keeps your Mac from sleeping.</figcaption></figure></div>\n\n\n\n<p>Amphetamine has a lot of extras related to sleep behavior. The Drive Alive preference lets you pick drives you never want to shift into a state of inactivity—this matters only for hard drives, which can have a spin-up time. Or you can let the app move your cursor at intervals to simulate activity. There’s a lot to explore and configure when you need something other than default behavior.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mac-gems-amphet-icon-alternatives-bordered.png\" /><figcaption>Alternative icons let you avoid the drug association if desired.</figcaption></figure></div></div>\n\n\n\n<p>The name might seem to indicate being a little too wired, but <em>a lot</em> of other names indicating wakefulness had already been taken by its debut in 2014, which followed on from the Caffeine app, no longer in development. If you don’t like the abstracted pill icon, you can select from a variety of others; I picked a teapot. (Apple briefly blocked the app from the Mac App Store in December 2020 because it allegedly appeared “to promote inappropriate use of controlled substances,” but <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/x74353/SaveAmphetamine&amp;xcust=1-1-548594-1-0-0&amp;sref=https://www.macworld.com/feed\">then correctly reversed itself after a few days</a>.)</p>\n\n\n\n<p>Amphetamine answers the question, “How do I keep my Mac awake when I need it to be?” with an essay-long response instead of multiple choice. If you ever or regularly need your Mac to remain constantly available, get this free app. And if that’s useful to you, help keep its developer alert <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.buymeacoffee.com/x74353&amp;xcust=1-1-548594-1-0-0&amp;sref=https://www.macworld.com/feed\">by buying him a coffee</a>.</p>\n\n\n\n<p><em>Macworld has never reviewed Amphetamine, but <a href=\"https://www.macworld.com/article/226525/free-mac-apps-every-mac-user-should-have.html\">we did mention it in passing</a> in March 2021 as one of “the greatest Mac apps [that] won’t cost you anything more than the time they take to download them.”</em></p>\n\n\n\n<p><em>Mac Gem is a column that highlight great nuggets of Mac software, apps that have a high utility, have a sharp focus on a limited set of problems to solve, and are generally developed by an individual or small company. With the strong resurgence of the Mac in recent years, we want to celebrate tools we use and that readers recommend to make the most of your macOS experience. Stay tuned for weekly updates, and send your suggestions to the Mac Gems Twitter feed (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macgems&amp;xcust=1-1-548594-1-0-0&amp;sref=https://www.macworld.com/feed\">@macgems</a>).</em></p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b705bfedf4d2a5ad889764da1eb19e1c0756cdf868922e7229a10b99ca46be9a","category":"Apple"}