{"title":"The impact of the forestland‐tenure disputes on the new type of forestry operating entity's long‐term investment: The intermediary effects on credit constraints","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12394?af=R","date":1704194277000,"content":"<h2>Abstract</h2>\n<p>In the context of the state's proposal to accelerate the development of new type of forestry operating entities in rural area, we provide an analysis of how forestland-tenure disputes affect the long-term investment behavior through credit constraints based on the perspective of forestland-tenure disputes. Based on the survey data of 485 new type of forestry operating entities in nine provinces across China, the empirical analysis is conducted using the Tobit model and mediating effect model, while paying attention to the heterogeneity of management scale and different entity types on the impact of new type of forestry operating entity's long-term investment behavior. The conclusions are as follows: both forestland-tenure disputes and dispute areas have a significant negative impact on the new type of forestry operating entity's long-term investment. In addition, forestland-tenure disputes not only have a direct negative impact on the long-term investment but also have an indirect negative impact on the long-term investment by constraining the new type of forestry operating entity's bank loan and expanding the loan gap. It is suggested to improve the forestland trading market, regulate the order of trading, and implement the policy of forest tenure mortgage to provide stable policy guarantee and external conditions for fully activating the vitality of forestland management.</p>","author":"Hui Xiao, \nFangmiao Hou, \nXiaoyi Li, \nZhuoran Wei, \nChengliang Wu","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"b71069f8a2512a574c9febb628eea1b3596837bd92b38f23f29c8bc0b5e30cc3","category":"Environment"}