{"title":"Serum Level of Cadherin-P (CDH3) a Novel Predictor of Cardiovascular Events Related to Atherosclerosis in a 3-Year Follow-Up Study","link":"https://www.preprints.org/manuscript/202409.2347/v1","date":1727662596000,"content":"Placental cadherin (cadherin-P, CDH3) is a cell-to-cell adhesion molecule expressed at a high level in many malignant tumors. Associations of serum CDH3 with atherosclerosis have not been investigated previously. The present clinical cohort study with 3-year follow up measured atherosclerosis of the coronary, brachiocephalic, and femoral circulation and fasting levels of CDH3 in the serum in 218 patients in a hospital setting. Coronary lesions were assessed as Gensini score calculated according to the data of coronary angiography. The volumes of the brachiocephalic and femoral circulation plaques were quantified by ultrasound imaging. Serum proteomic profiling was performed in selected samples using antibody microarrays. The content of CDH3 in the serum was measured using an indirect ELISA. Odds ratio (OR), ROC-analysis, and logistic regressions were used to evaluate the associations between CDH3 content, atherosclerotic lesions, and various serum biomarkers. CDH3 serum content was associated with severity of atherosclerosis and diastolic blood pressure. The levels of СDH3 were able to discriminate patients with total subclinical and hemodynamically significant atherosclerotic lesions in all circulation pools (coronary, brachiocephalic, and femoral). Elevated serum СDH3 appeared to be a risk factor for cardiovascular outcomes after 3-year follow up with OR=1.81 (95%CI: 1.07-3.72; P=0.022). Endothelin-1 and NOx were associated with the content of СDH3 in the serum, suggesting the involvement of certain signal transduction pathways that may participate in plaque formation. CDH3 was associated with cardiovascular outcomes adjusted for coronary plaque presence, indicating a role of CDH3 in plaque biology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b71238d76d09ea0c6fddd3925c560ce6dfc09c1ab70f7dc6c0e142ab7b0b6bfd","category":"Interdisciplinary"}