{"title":"Helminths of free-ranging dogs and cats in an urban natural reserve in Mexico City and their potential risk as zoonotic agents","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310302","date":1726495200000,"content":"<p>by Valeria Camacho-Giles, Yolanda Hortelano-Moncada, Gerardo Torres-Carrera, Guillermo Gil-Alarcón, Alejandro Oceguera-Figueroa, Luis García-Prieto, David Osorio-Sarabia, Fernando A. Cervantes, Pablo Arenas</p>\r\n\r\nIn the Reserva Ecológica del Pedregal of San Ángel, located in the south of Mexico City, Mexico, free-roaming dogs and cats coexist with 148 bird, 33 of mammal, 23 of reptile and seven amphibian species, that represent a remnant of the original fauna of the Mexican Plateau. The negative impact that dogs and cats have on local fauna is unobjectionable, however, the role that these introduced vertebrates play as potential transmitters of infectious diseases for native fauna and humans, is much less understood. Information about parasitic infections in native and introduced animals in this location is scarce. In order to ameliorate this lack of information, the objective of this study is to characterize the helminth fauna of the free-ranging dogs and cats of the ecological reserve. Between 2018 and 2023, 36 <i>Felis silvestris catus</i> and 7 <i>Canis lupus familiaris</i> were studied from the helminthological perspective. Endoparasites were obtained from the digestive tract and were identified to the species level using morphological and molecular evidence. Hosts were parasitized by eight species of helminths: in cats the cestodes <i>Hydatigera taeniaeformis</i>, <i>Mesocestoides</i> sp., <i>Taenia rileyi</i> and the nematode <i>Toxocara cati</i> were recorded, while in dogs, the cestode <i>Taenia pisiformis</i> and the nematodes <i>Ancylostoma caninum</i>, and <i>Uncinaria stenocephala</i> were found. The only species shared between cats and dogs was the cestode <i>Dipylidium caninum</i>. These free-ranging animals act as definitive hosts of 5 species known to have zoonotic potential; their presence in the area may generate a public and animal health problem if programs of dog and cat population control are not continued.","author":"Valeria Camacho-Giles","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b716cdc956577041c32ea7fa9378d45cac0059ccb7fab6ab76fcd23ed7fa3c60","category":"Interdisciplinary"}