{"title":"The flesh texture of teleost fish: Characteristics and interventional strategies","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12849?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>With the growing demand of consumers for high-quality aquatic products, controlling the harvest quality of farmed fish is becoming increasingly important in aquaculture industry. The texture is a sensory property that covers a group of attributes, such as firmness, tenderness, chewiness, adhesiveness, resilience, etc., which greatly determine consumers' perception and satisfaction for flesh products. Regarding texture quality, extensive research has been conducted in recent decades based on its related theories, influencing factors, and intervention strategies. However, the information available is largely scattered and disjointed. Essentially, flesh texture is mainly determined by the collective contribution of three major muscle components: muscle fibres, intramuscular connective tissue, and intramuscular fat. Therefore, changing these components in living animals through nutritional and management factors has the potential to modulate texture quality. Here, we briefly introduced the features and development of the three muscle components mentioned above, particularly their potential contributions to texture quality of fish flesh. Exciting promises to manipulate flesh texture through dietary intervention, feed restriction, and exercise training were also discussed. To ensure their applications in large-scale aquaculture facilities, specific considerations of these regimens should be incorporated in experimental design parameters, including the species and age of fish, research system, experiment duration, and exercise intensity. Finally, the existing challenges and limitations of fish texture studies were presented, along with some viewpoints about current work and future directions of this field.</p>","author":"Zhe Wang, \nFang Qiao, \nWen‐Bing Zhang, \nGiuliana Parisi, \nZhen‐Yu Du, \nMei‐Ling Zhang","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"b722600c14a93ad16184caf8cfb75da9e93637fa8b1367ea06ae71aa61e1ce61","category":"Environment"}