{"title":"10 ways to make bike components last longer","link":"https://www.bikeradar.com/advice/workshop/how-to-make-components-last-longer/","date":1686150008000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/GettyImages-609801590-627898f.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Dirty bike on the floor\" title=\"Dirty bike on the floor\" />                                            <p>Bikes are subject to a lot of wear and tear, through exposure to the elements and general day-to-day use.</p>\n<p>This means you can end up spending your money on replacing parts far sooner than you’d like to – or is really necessary.</p>\n<p>However, it doesn’t have to be this way.  You can do plenty of small maintenance jobs to make the components on your bike last longer.</p>\n<p>Whether you’re cycling on a budget or simply want to save some cash, we’ve collated 10 tips and tricks to increase the lifespan of your bike – and we promise they’re not too labour-intensive or time-consuming.</p>\n<p>These tips will also help your bike run smoother and make it more fun to ride as a result.</p>\n\n<h2>1. Clean your bike</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Brushing a dirty bike down\" title=\"Brushing a dirty bike down\" /></div><div><figcaption><span><i></i> Getting into a regular routine of cleaning your bike will do it wonders.</span></figcaption><span> <i>Will Poole / Immediate Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">Cleaning your bike</a> helps keep the components running smoothly and reduces wear, increasing the lifespan of components in the process.</p>\n<p>We’d recommend cleaning your bike at least once a week in the summer if you’re using it regularly and after every ride in the winter. Consider doing this at the end of your ride before you head back inside to get the job out of the way.</p>\n<p>Cleaning your bike doesn’t need to be a chore or take too long. Start by wetting the bike with a hose pipe or a bucket and sponge and then clean the chain. While you’re waiting for the degreaser to work its magic (typically three to five minutes), you can clean the rest of the bike using a specific bike cleaner.</p>\n<p>Once you’re done, dry the bike and apply <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">chain lube</a> to your chain to keep it running smoothly. Don’t leave the bike out overnight before lubing the chain, to avoid rust.</p>\n<h2>2. Maintain your chain</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Dirty bicycle chain.\" title=\"Dirty bicycle chain.\" /></div><div><figcaption><span><i></i> Don’t let your chain get this dirty, it will just wear out your other drivetrain components.</span></figcaption><span> <i>Colin Levitch / Immediate Media</i></span></div>\n<p>Your chain is a critical component on your bike. There are several ways you can extend its life, and in doing so, the lifetime of other components on your bike.</p>\n<p>Regularly <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">cleaning your chain</a> is one of way of doing this so your <a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\">drivetrain</a> runs smoothly. A specific chain <a href=\"https://www.bikeradar.com/features/how-to-degrease-your-transmission/\">degreaser</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">chain lubricant</a> will ensure optimal results. Make sure you apply a suitable chain lube for the weather conditions – dry lube in the winter, for example, will wash off instantly.</p>\n<p>You’ll also decrease the rate of <a href=\"https://www.bikeradar.com/advice/workshop/how-to-know-when-its-time-to-replace-your-bicycle-chain/\">chain wear</a>. It’s worth investing in a chain checker and regularly checking the chain’s wear. If you’re running an 11, 12 or 13-speed chain, it’s best to replace it when it reads at 0.5 per cent on a chain checker. Chains 10-speed and fewer can be replaced at 0.75 per cent.</p>\n<p>If you let the chain stretch further, it will then begin to wear out the <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a> and chainrings. It’s much cheaper to replace a chain than it is to replace all three.</p>\n<h2>3. Check your brake pads</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Don't let your pads get like these....\" title=\"1430499301780-7ozaye7dhdrt-c025406\" /></div><div><figcaption><span><i></i> Don’t let your pads get like these….</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>Much in the same vein as a chain, brake pads will also wear down through use.</p>\n<p>It’s worth keeping an eye on the remaining pad material. If you let them get down to the bare metal, you can prematurely wear out disc brake rotors or the wheel’s braking surface. If you’re running rim brakes, it will also lead to less effective braking.</p>\n<p>On the note of rim brake wheels, we’d recommend regularly removing the wheel and thoroughly cleaning the braking surface and picking any dirt or debris from the brake pads that can get lodged there and further decrease the lifespan of your wheels.</p>\n<p>You’ll also want to prevent contaminating <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">disc brake pads</a> when cleaning your bike. If you get any oily contaminant on them, the <a href=\"https://www.bikeradar.com/advice/workshop/how-to-silence-disc-brakes/\">brakes will squeal</a> and their performance will be diminished. It’s an easy mistake to make and is costly because you have to replace them.</p>\n<p>We’d recommend either covering the caliper and rotor or spraying degreaser on the chain on the underside of the driveside chainstay by the chainring. This is because it’s the furthest point away from the brake caliper.</p>\n<h2>4. Look after your cables</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The continuous liner stops dirt flicking up and degrading the inner gear cables.\" title=\"Jagiwre cables on Specialized Allez DSW\" /></div><div><figcaption><span><i></i> We’d recommend fully sealed cables if your bike has external routing.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>The condition of your bike’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brake-gear-cables-explained/\">gear and brake cables</a> is critical for optimal performance.</p>\n<p>Unless the manufacturer says otherwise, it’s a good idea to put a drop of dry lube on them from time to time, where the inner is exposed at the derailleur or brake caliper. Then, shift through the gears to encourage the lube up the housing. The gears will feel noticeably smoother.</p>\n<p>If there is any fraying to the inner, or kinks or tears to the outer though, replacement is the only option.</p>\n<p>Although a greater initial investment, we’d recommend upgrading to higher-quality cables because they tend to last longer, and feel slicker and smoother in operation.</p>\n<p>It’s also a wise idea to replace the inner cable regularly to maintain optimum shifting performance. If you ride frequently in all weather types, consider replacing it once a year.</p>\n<p>If you often ride in foul conditions and your bike has external cable routing, consider fully sealed cables. These use a continuous liner that seals the inner cable completely from the elements.</p>\n<h2>5. Keep an eye on the bearings</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle servicing headset on Specialized Crux\" title=\"Headset service\" /></div><div><figcaption><span><i></i> Servicing your bearings periodically will extend their life.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Many parts of your bike include <a href=\"https://www.bikeradar.com/features/bicycle-bearings-everything-you-need-to-know/\">bearings</a> to help them move. These require lubrication to work effectively but also to stop them from wearing out.</p>\n<p>As the grease is washed out over time, the bearing will become dry and start to wear as the balls rub directly on the bearing’s race.</p>\n<p>As such, it’s a good idea to check the condition of the bearings periodically and regrease them.</p>\n<p>The lower headset bearing is particularly prone to the elements as it’s in the firing line of any dirt or debris from the front wheel. The same is true of the non-driveside bottom bracket bearing because it doesn’t have any chainrings in front of it to protect it.</p>\n<p>On some bearings, you can very carefully prise off the seal, flush out any old grease and repack it with new grease.</p>\n<p>On full-suspension mountain bikes, we’d recommend keeping on top of the frame bearings. It may be wise to invest in higher-quality bearings such as those from Enduro because they’ll typically last longer.</p>\n<h2>6. Give your suspension some TLC</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Canyon Strive CFR Underdog full suspension mountain bike\" title=\"Canyon Strive CFR Underdog - Shock\" /></div><div><figcaption><span><i></i> Neglecting your fork or shock is a costly mistake.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>Suspension servicing stops any grit and grime that’s made its way into your shock or fork from causing damage, and refreshes the fluid and seals to keep everything working perfectly.</p>\n<p>If you don’t keep your suspension in tip-top condition, it can get expensive very quickly.</p>\n<p>The various components that make up the fork or shock are always moving when you ride, and the oils and seals need to be kept fresh and clean.</p>\n<p>At a minimum, you should regularly wipe down the suspension stanchions to stop any ingress scoring them.</p>\n<p>Suspension manufacturers include recommended specific service intervals, so it’s worth monitoring when it’s time to service your fork or shock.</p>\n<h2>7. Regularly replace your bar tape</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Silca Nastro Fiore bar tape on Pinarello GAN K\" title=\"Silca Nastro Fiore bar tape on Pinarello GAN K\" /></div><div><figcaption><span><i></i> Get into the habit of regularly refreshing your bar tape.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>Regularly replacing your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-handlebar-tape/\">handlebar tape</a> ensures you have a comfortable grip, but it can also lengthen the handlebar’s lifespan, especially if it is metal.</p>\n<p>This is because the salt in your sweat can cause the aluminium of the handlebar to oxidise. In extreme cases, the corrosion can even lead to handlebar failure.</p>\n<p>By getting into the routine of regularly replacing bar tape, you can inspect your handlebar periodically and prevent any oxidisation. Unravelling old, sweat-infested tape is never a fun task, either.</p>\n<p>We’d recommend cork tape without an adhesive because it’s generally inexpensive and you can rewrap it in case you ever need to replace the handlebar or change the shifter’s position.</p>\n<p>We’d recommend replacing your handlebar tape once or twice a year, especially if you ride frequently or you’re into indoor cycling.</p>\n<h2>8. Don’t swap tyres</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Scott Solace Gravel eRide 10 against a wall\" title=\"Scott Solace Gravel eRide 10 against a wall\" /></div><div><figcaption><span><i></i> Look after your tyres and they should look after you.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Tyres can pick up all kinds of debris from the road or trails and it’s worth inspecting them regularly and picking out anything that may have lodged itself into the carcass. Otherwise, you risk the debris pushing itself further into the tyre, potentially causing a tear or a puncture.</p>\n<p>Some profess to swap the front and rear tyres to eke out extra life, but we’d recommend against this.</p>\n<p>Tyres wear at different rates and you tend to go through the rear quicker because it’s put under more strain. By swapping them, you’ll have decreased grip at the front, which is where you need it.</p>\n<p>When you’re buying tyres, you could consider buying three rather than a pair so you have a spare to run at the rear when that wears out, although there is always an element of pot luck.</p>\n<h2>9. Hang your bike up in storage and keep the tyres inflated</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Stashed SpaceRail bike storage rack\" title=\"Stashed SpaceRail bike storage rack\" /></div><div><figcaption><span><i></i> Hang your bike up if you’ll be leaving it in storage for a while.</span></figcaption><span> <i>James Costley-White / Our Media</i></span></div>\n<p>If you’re putting your bike away for an extended period of time, it’s a wise idea to hang it up, particularly if you’re running <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tubes</a>.</p>\n<p>If the bike is on the floor and you don’t keep the <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">tyre pressure</a> topped up, the inner tube can perish over time. This process will take longer if the bike is hanging because the tyre isn’t in contact with the ground.</p>\n<p>We’d also recommend keeping your bike stored in a warm, dry environment. Storing your bike outside can quickly ruin your drivetrain components and could lead to rusting.</p>\n<h2>10. Consider investing in a winter bike (or cheaper bike)</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pack shot of the Condor Fratello Disc road bike\" title=\"Condor Fratello Disc\" /></div><div><figcaption><span><i></i> Mudguards and winter tyres are a must for UK winters.</span></figcaption><span> <i>Robert Smith / Immediate Media</i></span></div>\n<p>Now this one flies slightly in the face of trying to save money…</p>\n<p>If you have the means and space to own a second bike, investing in a cheaper <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bikes/\">winter bike</a> to use when the weather’s poor can save you money in the long run. You’ll avoid wearing out the more expensive components on your nicer rig and replacement parts will be cheaper.</p>\n<p>There’s also a satisfying feeling at the start of spring when you jump onto a lighter bike and feel a performance benefit.</p>\n<p>This is, of course, not a solution for everyone, but is well worth considering if you want to ride in bad weather.</p>\n<p> </p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b729394fc218aa39b5fa97a4095c4d8cf9991b4687fb72f8e57b3b100238b3f0","category":"Cycling"}