{"title":"Wout van Aert wins Gent-Wevelgem","link":"https://cyclingtips.com/2021/03/wout-van-aert-wins-gent-wevelgem/","date":1616940704000,"content":"<p>Wout van Aert (Jumbo-Visma) powered to victory at Gent-Wevelgem on Sunday, winning a sprint out of a small group ahead of Giacomo Nizzolo (Qhubeka-Assos) and Matteo Trentin (UAE-Team Emirates).</p>\n\n\n\n<p>The Belgian one-day may have come down to a fast finish with several marquee speedsters in the mix, but it was anything but a conventional edition of the race, as the leaders were battling for the win after spending a long day out front in a big move that formed in the crosswinds with roughly 175 km still to go in the race. Even with so much ground to cover before the finish, a select group of those originally out front held on all the way into Wevelgem (after traveling 1.1 km more than originally planned after a fire in the city of Menen led to <a href=\"https://cyclingtips.com/2021/03/gent-wevelgem-route-changed-due-to-fire/\" target=\"_blank\" rel=\"noreferrer noopener\">changes</a> in the route). </p>\n\n\n\n<p>Seven riders rolled into Wevelgem together in the end, and Van Aert took a convincing win in the final kick.</p>\n\n\n\n<h2>How it happened</h2>\n\n\n\n<p>The 83rd edition of Gent-Wevelgem rolled out from Ypres without either Bora-Hansgrohe or Trek-Segafredo as both squads did not start the race due to COVID-19 cases in each team.</p>\n\n\n\n<p>The race saw a break of four riders jump out to sizable advantage in the early goings, with the gap growing out to nearly 10 minutes with 200 km to go, but the situation would rapidly change as crosswinds buffeted the race with around 180 km to go.</p>\n\n\n\n<p>With 175 km still to go, echelons began to form, splitting the peloton into groups. The foremost of those was a group that contained several fast finishers. That 21-rider strong selection included Van Aert, Nizzolo, Sam Bennett (Deceuninck-Quick-Step), and Michael Matthews (BikeExchange), and it rapidly closed down the early escapees to form a new lead group, while fragmented groups behind took time to form a concerted chase.</p>\n\n\n\n<p>The lead group never had more than two minutes on those chasing, but with so many riders to work together on terrain that made it hard for the pursuit to close things down, the powerful break stayed more than a minute ahead for much of the next hundred kilometers, even as it lost riders here and there along the way. With a little under 100 km to go, it was announced that the route of the finale had been altered due to a fire, with 1.1 km added as part of the rerouting, bringing the total race distance to 248.6 km.</p>\n\n\n\n<p>With a little over 50 km to go, the gap was down under 40 seconds, but the Kemmelberg saw more action as several riders were dropped from the lead group and splits formed in the pack. Out front, Van Aert applied pressure, shelling several riders out the back and making for a group of nine riders that led into the last 50 km. In the mix were Van Aert, his Jumbo-Visma teammate Nathan Van Hooydonck, Nizzolo, Trentin, Bennett, Matthews, Danny van Poppel (Intermarché-Wanty-Gobert Matériaux), Stefan Küng (Groupama-FDJ), and Sonny Colbrelli (Bahrain Victorious). That group would continue to carry an advantage as the kilometers ticked down while the peloton reabsorbed a small group of chasers that had formed in between the pack and the leaders.</p>\n\n\n\n<p>With a little more than 30 km to go, Bennett appeared to be struggling, and at one point, he could be seen vomiting while riding at the back. With around 15 km to go, Van Hooydonck put in a big surge, and Bennett and Van Poppel were dropped, but the rest of the lead group stayed together. The seven out front would hold on into the finale, where things would come down to a sprint in Wevelgem.</p>\n\n\n\n<p>Küng launched early on the approach to the line but Van Aert quickly pulled past. Nizzolo and Trentin tried to match his speed, but Van Aert held on to take his first one-day win of 2021 at the line.</p>\n\n\n\n<p><strong>Top 10</strong></p>\n\n\n\n<p>1 VAN AERT Wout (Jumbo-Visma)<br>2 NIZZOLO Giacomo (Qhubeka-Assos)<br>3 TRENTIN Matteo (UAE-Team Emirates)<br>4 COLBRELLI Sonny (Bahrain Victorious)<br>5 MATTHEWS Michael (BikeExchange)<br>6 KÜNG Stefan (Groupama-FDJ)<br>7 VAN HOOYDONCK Nathan (Jumbo-Visma)<br>8 VAN BAARLE Dylan (Ineos Grenadiers)<br>9 TURGIS Anthony (Total Direct Energie)<br>10 VERMEERSCH Gianni (Alpecin-Fenix)</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/wout-van-aert-wins-gent-wevelgem/\">Wout van Aert wins Gent-Wevelgem</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b72bb8b876eebf59d5a7e1ae2c2ca71b3c9b26167df03bd3fbd272298d1b8d1a","category":"Cycling"}