{"title":"412 Awardee Talk: Implementing student-centered teaching and learning strategies in undergraduate animal science","link":"https://academic.oup.com/jas/article/102/Supplement_3/421/7757257?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Student-centered teaching and learning strategies enhance active engagement, foster critical thinking, and promote the practical application of knowledge gained from undergraduate animal science courses. The scholarship of teaching and learning (SOTL) has evolved within the animal science community, with a recent focus on adopting evidence-based teaching activities in college classrooms. We discuss documented SOTL approaches utilized in our program for the development of student-centered teaching and learning. In addition to traditional internships and student research projects, capstone projects utilizing a design thinking approach to solving animal industry problems have proven significantly effective. This problem-based learning program enables students to develop industry networks, understand problems within the industry, and develop creative ways to address the problems. Non-conventional and innovative designs of course assignments can foster student interest and enhance learning experiences. For example, by incorporating engaging and novel resources such as animal industry webinars and podcasts as classroom materials, instructors can reinforce course content and captivate students’ attention to the topic. Specifically, students have appreciated the opportunity to learn from experts not available locally at the university. Developing and utilizing real-world case studies exposes students to farm practices and related decision-making. Involving students in competitive team activities like the Dairy Challenge and Academic Quadrathlon contests develops marketable skills for students while training them to implement the knowledge acquired in the classrooms on a commercial farm. Field trips, short courses, and summer schools provide hands-on training opportunities, enhancing students’ exposure to the industry and opportunities after graduation. Students have identified that animal science topics are relevant beyond the classroom walls in everyday life including grocery store and kitchen, as demonstrated by a significant increase in enrollment of non-animal science major students in the animal science courses. The student-centered programs like Cross-training students in data-driven decision support tools help to develop strong day-one competency of graduates through training and networking within and outside the discipline. With the advent of new technologies and tools, training programs surrounding data management and interpretation should integrate systems knowledge across plant science, animal science, and computer science disciplines. These interdisciplinary and cross-disciplinary training activities promote the exchange of ideas while developing systems-level understanding. Furthermore, initiatives like Collaborative Online International Learning (COIL) provide students with exposure to diverse thoughts and situations, broadening their horizons and perspectives. For students not able to participate in study abroad and international programs due to time and financial constraints, COIL delivers cost-effective virtual opportunities to develop global understanding and cultural competency. By incorporating these student-centered teaching and learning strategies, undergraduate animal science programs can effectively prepare students for real-world challenges for the next generation of agriculture leaders.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b72db3cb6ea18a75b02a9bdb6fb2f67a9eb15c006e255c1543e5e2b51b36b45a","category":"Environment"}