{"title":"Who wants to rally? Spot Bikes’ new gravel bike is down","link":"https://www.cyclingtips.com/2023/04/who-wants-to-rally-spot-bikes-new-gravel-bike-is-down/","date":1681397847000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Twilight-Purple-01-scaled-e1681355185998.jpg?width=1200\" alt=\"Who wants to rally? Spot Bikes' new gravel bike is down\" /></figure><p>Spot Bikes is introducing <a href=\"https://spotbikes.com/collections/bikes/products/rallye?variant=41041241800738\">a new gravel bike, the Rallye</a>, and it’s just the gravel bike you’d suspect from the brand that pioneered the Living Link suspension technology and CenterTrack belt design.</p>\n<p>Known for its mountain bike lineup, which includes the Mayhem trail bikes, short-travel Ryve, and Rocker hardtail, the team at Colorado-based Spot is unapologetically mountain bike-biased.</p>\n<p>But, mountain bikers need something to do in the winter, too.</p>\n<p>I picked up my test Rallye in Golden on yet another snow-dusted frigid February day, which Spot’s engineering director Andy Emanuel said was quite apropos.</p>\n<p>“This is, ‘I’m a mountain biker but the weather is like this,'” Emanuel said as he unveiled the shimmery purple bike. “So, there’s a piece of singletrack here and there that I can connect with some gravel roads and some paved roads. That’s what we’re going for.”</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Twilight-Purple-02-1340x895.jpg?width=730\" alt width=\"1340\" height=\"895\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Twilight-Purple-02-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Twilight-Purple-02-scaled.jpg?width=190 190w\" /></figure>\n<h2>The Rallye</h2>\n<p>If the name of the Spot’s new gravel bike sounds familiar, that’s because it is. The Rallye has long been part of Spot’s quiver, but it began as a metal cyclocross bike “that barely cleared a 33c tire and was tied up in strict UCI standards,” Emanuel said.</p>\n<p>Over the years the Rallye evolved to a more relaxed gravel all ’rounder, but the bike never really caught on — namely for Emanuel himself.</p>\n<p>But, the blueprint was there, and Emanuel has spent the last few years tweaking the Rallye to his preferences.</p>\n<p>“Playing with it over the years, I learned what I liked about how these things rode and what I didn’t. This is basically everything I liked. It’s not a mountain bike with drop bars, although I think what you’ll feel on steep descents or singletrack descents is that it’s a lot more comfortable than anything with a 71 degree head tube angle and narrow tires.”</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/2024-Spot-Rallye-Geometry-Chart-1340x828.jpg?width=730\" alt width=\"1340\" height=\"828\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/2024-Spot-Rallye-Geometry-Chart-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/2024-Spot-Rallye-Geometry-Chart-scaled.jpg?width=190 190w\" /></figure>\n<p>Speaking of head tube angles, the Rallye’s comes in at 69 degrees, and speaking of tire clearance, it can clear a 53mm/2.1in.</p>\n<p>Although the Rallye is most definitely not a “gravel race bikes with road geo tweaked a little bit to fit big tires,” as Emanuel says, it’s not necessarily a mountain bike tweaked for the road.</p>\n<p>The Rallye’s elevated and asymmetrical drive-side chainstay may be its most striking feature, but it’s not an aesthetic flourish. The e-stay enable 50-tooth chainring compatibility and big tire clearance while maintaining a road bike Q factor. The chainstays are a short 415mm for nimble handling, fast acceleration, and efficient pedaling.</p>\n<p>For those wishing to maximize the trail riding potential of the Rallye even further, the bike is both dropper post and suspension fork compatible. Stock, it comes with neither.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Limestone-Grey-01-1340x895.jpg?width=730\" alt width=\"1340\" height=\"895\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Limestone-Grey-01-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Spot-Rallye-Limestone-Grey-01-scaled.jpg?width=190 190w\" /></figure>\n<p>The Rallye is currently available with SRAM wireless drivetrains (so go to town with that new transmission). The 5-star AXS Rival build clocks in at $5,899 and the 6-star Red is $8,499. The bike is 1x only.</p>\n<p>It’s available in two tones — limestone grey and twilight purple — and soon enough, when my local trails are dry enough to include in big mixed-surface routes, I’ll be out there testing my purple Rallye. It’s what Emanuel says I should do anyway.</p>\n<p>“What we do best here is mountain bikes,” Emanuel said. “So we want to be the hardcore mountain biker’s gravel bike. We’re not out there trying to win Unbound or these big events. We don’t have the interest here or presence in that scene. But, if it’s winter and your singletrack happens to be dry, you can go ride this.”</p>\n<p> </p>","author":"Betsy Welch","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b7338ab053c9adea1823fb912aa03343d4ede5f63da2423409df5fbe9d1852e5","category":"Cycling"}