{"title":"First iPhone 16 Component Leak Reveals Redesigned Camera Chassis","link":"https://www.macrumors.com/2024/02/16/iphone-16-camera-component-leak/","date":1708110750000,"content":"Following our previous in-depth coverage of the <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> and the <a href=\"https://www.macrumors.com/2024/02/06/apple-iphone-16-slim-camera-bump/\">various camera bump designs</a> Apple has tested for it, new information has surfaced on social media website X from user Majin Bu. Although this user has a mixed track record, they have occasionally provided accurate information on the design of upcoming iPhones, and their latest post could very well be our first look at a genuine ‌iPhone 16‌ part.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Screenshot-2024-02-16-at-7.05.28 PM.png\" width=\"2062\" height=\"1160\" />\r<br />\nIn <a href=\"https://twitter.com/MajinBuOfficial/status/1758491579067650512\">their post</a>, Bu shared an image of what appears to be the main camera chassis for the base model ‌iPhone 16‌, featuring a vertical camera layout. Although the part image was posted upside down, as pointed out by users <a href=\"https://twitter.com/axoajo/status/1758523318976549339\">replying</a> to Bu's post, this does not affect the authenticity of the component itself.\r<br />\n\r<br />\n<em>MacRumors</em> is able to independently verify the authenticity of the component design pictured above. Through our industry sources, we are able to confirm that the item featured in Bu’s post is the main camera chassis for the I-34 camera project, intended for use in the base model ‌iPhone 16‌ set to be released later this year. \r<br />\n\r<br />\nThis latest component leak aligns with <a href=\"https://www.macrumors.com/2023/05/22/iphone-16-vertical-camera-lenses-rumor/\">multiple reports</a> concerning the new vertical camera layout Apple has planned for the ‌iPhone 16‌. As seen in <a href=\"https://www.macrumors.com/2023/12/12/early-iphone-16-prototypes/\">our December report on early iPhone 16 prototypes</a>, along with our coverage of <a href=\"https://www.macrumors.com/2024/02/06/apple-iphone-16-slim-camera-bump/\">more recent internal designs</a>, Apple has decided to align the cameras vertically, as opposed to the current diagonal layout found on the base model <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and ‌iPhone 15‌ Plus. By employing a vertical camera layout, Apple could bring Spatial Video recording to the base model ‌iPhone 16‌, expanding the feature's overall availability to the entire ‌iPhone 16‌ range.\r<br />\n\r<br />\nAlong with the vertical camera layout, the ‌iPhone 16‌ is also expected to receive the <a href=\"https://www.macrumors.com/2023/11/30/iphone-16-action-button-all-models/\">Action button</a> as a carryover from the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a>, and will have an additional <a href=\"https://www.macrumors.com/2023/09/25/iphone-16-capture-button/\">Capture button</a> featuring force-sensor technology, located on the right side of the device.\r<br />\n\r<br />\nFor additional information on what to expect with this year’s new iPhones, check out our dedicated rumor roundup pages for <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> and <a href=\"https://www.macrumors.com/roundup/iphone-16-pro/\">iPhone 16 Pro</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/16/iphone-16-camera-component-leak/\">First iPhone 16 Component Leak Reveals Redesigned Camera Chassis</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-iphone-16-component-leak-reveals-redesigned-camera-chassis.2419647/\">Discuss this article</a> in our forums<br /><br />","author":"Marko Zivkovic","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b7397d9c9287d4c3132eed1ce323b67fba748b016bc5c67a68650db90200d602","category":"Apple"}