{"title":"Digital Transformation in BIM Execution Plans for Effective BIM Implementation","link":"https://www.preprints.org/manuscript/202410.1112/v1","date":1728933456000,"content":"Building Information Modeling (BIM) is a revolutionary method in the construction industry that enhances project coordination, minimizes mistakes, and enables efficient project completion. An essential aspect of achieving successful BIM implementation is the creation of a BIM Execution Plan (BEP). The BEP facilitates effective communication, defines roles and responsibilities, and establishes standardized processes for all stakeholders involved. Although BIM is being used more widely, the absence of standardized BEPs frequently leads to inefficiencies in projects, especially those of significant scale [3]. This paper introduces the development of a new dynamic platform designed specifically for automating and standardizing the creation of BEPs. The platform aligns with ISO 19650 standards and offers customizable workflows to suit various project needs, improving collaboration, data management, and project outcomes. In addition, the paper emphasizes the advantages of utilizing this platform, including the efficient creation of BEPs, improved collaboration through centralized data management, and the ability to tailor BEPs to specific project requirements. The platform's user-friendly interface and extensive data management capabilities not only increase efficiency but also minimize risks and enhance project results. The survey results indicate that the BEP platform is effective in resolving common issues encountered in the creation of BEPs, such as miscommunication and inconsistencies. Additionally, it helps to improve project outcomes and reduce risks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b73b0a1bf5c80eea36da296b20e83ae40c28a85aa774d93c449611bd063da42d","category":"Interdisciplinary"}