{"title":"WSJ: ‘Facebook Knew Calls for Violence Plagued “Groups”, Now Plans Overhaul’","link":"https://www.wsj.com/articles/facebook-knew-calls-for-violence-plagued-groups-now-plans-overhaul-11612131374?mod=djemalertNEWS","date":1612304640000,"content":"\n<p>Jeff Horwitz, reporting for The Wall Street Journal (<a href=\"https://apple.news/ADlFU2qqDSb20W-FbNRsLZw\">News+ link</a>):</p>\n\n<blockquote>\n  <p>The company’s data scientists had warned Facebook executives in\nAugust that what they called blatant misinformation and calls to\nviolence were filling the majority of the platform’s top “civic”\nGroups, according to documents The Wall Street Journal reviewed.\nThose Groups are generally dedicated to politics and related\nissues and collectively reach hundreds of millions of users.</p>\n\n<p>The researchers told executives that “enthusiastic calls for\nviolence every day” filled one 58,000-member Group, according to\nan internal presentation. Another top Group claimed it was set up\nby fans of Donald Trump but it was actually run by “financially\nmotivated Albanians” directing a million views daily to fake news\nstories and other provocative content.</p>\n\n<p>Roughly “70% of the top 100 most active US Civic Groups are\nconsidered non-recommendable for issues such as hate, misinfo,\nbullying and harassment,” the presentation concluded. “We need to\ndo something to stop these conversations from happening and\ngrowing as quickly as they do,” the researchers wrote, suggesting\nmeasures to slow the growth of Groups at least long enough to give\nFacebook staffers time to address violations.</p>\n\n<p>“Our existing integrity systems,” they wrote, “aren’t addressing\nthese issues.”</p>\n</blockquote>\n\n<p>You need actual integrity to implement integrity systems that work.</p>\n\n<div>\n<a  title=\"Permanent link to ‘WSJ: ‘Facebook Knew Calls for Violence Plagued “Groups”, Now Plans Overhaul’’\"  href=\"https://daringfireball.net/linked/2021/02/02/facebook-wingnut-groups\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b7422dce18ea854d8188d2452f879e7cf0663e3c3bec35cd8e7f6a298e31e1ac","category":"Tech"}