{"title":"ROUTT RSL—THE PERFECT RACE BIKE FOR the`Rad Dirt Fest","link":"https://moots.com/routt-rsl-the-perfect-race-bike-for-therad-dirt-fest/","date":1631139823000,"content":"<p>ROUTT RSL—THE PERFECT RACE BIKE FOR the `Rad Dirt Fest? We think so and here’s why:<span></span></p>\n<p>A race bike in the traditional sense is a stripped-down build that leaves nothing to chance and adds nothing to the bike that is not focused on sending the riding forward as efficiently as possible, no add-ons and no creature comforts. Well, things have changed a bit and with the advent of gravel racing the builds have gotten very creature comfort oriented, adding a negligible amount of weight is not a knock, but a plus for the rider when the going gets gravel.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/olivia-1800x1000-unbound_2400x-1.jpg\" /></p>\n<p> </p>\n<p>We’ve been refining our gravel line-up for a decade and this bike that is named after the county we design and test the very bikes fits the bill as a gravel race bike with several standout features Let’s take a closer look at what those are:<span> </span></p>\n<p><strong>Ride quality</strong>: The Routt RSL (race superlight) uses a double butted tube set (thinner walled tubing in the center of each tube, thicker at the ends where the stresses happen) to reduce weight and give the frame a lively ride.</p>\n<p><strong>Geometry</strong>: As gravel bikes have evolved the geometry (Head Tube angle, Seat Tube angle, Chain Stay length and bottom bracket drop) have been tuned to give the rider a confidence inspiring ride on those loose marble surfaces we call gravel.</p>\n<p><strong>Durability</strong>: Gravel is a rough and tumble activity; rocks flying, potholes hit head-on and maybe even the occasional crash.<span>  </span>What the Routt RSL holds in spades is the ability to take the abuse mile after mile, ride after ride and keep going in style. Don’t worry, each frame we make comes with a lifetime warranty to the original owner. …. that’s how confident we are in our material of choice.<span> </span></p>\n<p><strong>Tire clearance</strong>: The Routt RSL can accommodate up to a 45mm tire with room to spare. This places the Routt RSL in the sweet spot of the running a race preferred size of 40mm, with the ability to go slightly bigger if needed as well as going smaller for a more road-like set up.<span> </span></p>\n<p><strong>Stock Add-ons</strong>: As gravel bikes have become more versatile the Routt RSL has stepped up to give the rider an all-year round bike that can be dressed in full fenders using the hidden eyelets on the fork as well as the rear end of the frame. Wet, sloppy winter days won’t keep you from riding. Another stock feature of the Routt RSL is three water bottle locations for carrying additional water or a tool keg at the ready.<span> </span></p>\n<p><strong>Finishes</strong>: The Routt RSL is available with multiple in-house Moots finishes to match your style and preferences.<span> You can go bold or go subtle, that’s up to you: <a href=\"https://moots.com/finishes/\">MOOTS FINISHES</a></span></p>\n<p>If you’ve got your mind set on a new gravel racer, check out the Routt RSL. You can learn more here:</p>\n<p><a href=\"https://moots.com/bike/routt-rsl/\"><img src=\"https://moots.com/wp-content/uploads/Moots_Slider_RouttRSL_full-copy.jpg\" /></a></p>\n<p> </p>\n<p> </p>\n<p>The post <a href=\"https://moots.com/routt-rsl-the-perfect-race-bike-for-therad-dirt-fest/\">ROUTT RSL—THE PERFECT RACE BIKE FOR the`Rad Dirt Fest</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"b74a6d6f61f98c57bf899eca4897f8cc457cb90342cf0a475dd710281bd22e9a","category":"Cycling"}