{"title":"The first Arab mission to Mars is delivering some interesting science","link":"https://arstechnica.com/?p=1802935","date":1633961010000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/FBPgb-qXsAAENOD-800x800.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/FBPgb-qXsAAENOD.jpg\">Enlarge</a> <span>/</span> New whole-hemisphere image of Mars captured by the UAE \"Hope\" probe. (credit: Emirates Mars Mission)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Since arriving at Mars eight months ago, the Emirates Mars Mission has quietly begun to deliver some intriguing scientific data about the Martian atmosphere and its weather patterns.</p>\n<p>Named \"Hope,\" the probe is in a relatively high orbit, varying in altitude above Mars from 20,000 to 43,000 km. This vantage point allows the spacecraft to see an entire hemisphere at a time. For much of this year, then, the Hope probe has been training its multi-band imager, infrared spectrometer, and ultraviolet spectrometer on Mars to collect data about the planet's atmosphere and resulting weather conditions.</p>\n<p>The project was financed by the United Arab Emirates, and the spacecraft was built in conjunction with several US-based universities, including the University of Colorado Boulder. The goal was to inspire young Emiratis to pursue an education in math and science and train some of them through the resulting collaborations. <a href=\"https://arstechnica.com/science/2020/07/hope-probe-launches-sunday-beginning-seven-month-journey-to-mars/\">The probe launched</a> in July 2020 on a Japanese rocket.</p></div><p><a href=\"https://arstechnica.com/?p=1802935#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802935&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b74d8e5b1cc360591fedcd092659d780240d8f4397a35c1d66bf334205b3dc9f","category":"Tech"}