{"title":"Dispersal syndrome and landscape fragmentation in the salt-marsh specialist spider Erigone longipalpis","link":"https://academic.oup.com/cz/article/69/1/21/6545283?rss=1","date":1646784000000,"content":"<span><div>Abstract</div>Dispersal and its evolution play a key role for population persistence in fragmented landscapes where habitat loss and fragmentation increase the cost of between-habitat movements. In such contexts, it is important to know how variation in dispersal and other traits is structured, and whether responses to landscape fragmentation are aligned with underlying dispersal-trait correlations, or dispersal syndromes. We, therefore, studied trait variation in <span>Erigone longipalpis</span>, a European spider species specialist of (often patchy) salt marshes. We collected spiders in two salt-marsh landscapes differing in habitat availability. We then reared lab-born spiders for two generations in controlled conditions, and measured dispersal and its association with various key traits. <span>Erigone longipalpis</span> population densities were lower in the more fragmented landscape. Despite this, we found no evidence of differences in dispersal, or any other trait we studied, between the two landscapes. While a dispersal syndrome was present at the among-individual level (dispersers were more fecund and faster growing, among others), there was no indication it was genetically driven: among-family differences in dispersal were not correlated with differences in other traits. Instead, we showed that the observed phenotypic covariations were mostly due to within-family correlations. We hypothesize that the dispersal syndrome is the result of asymmetric food access among siblings, leading to variation in development rates and carrying over to adult traits. Our results show we need to better understand the sources of dispersal variation and syndromes, especially when dispersal may evolve rapidly in response to environmental change.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"b772a5bd6c6bbe8a758db19189a337a9fa55203794b5997810fd3b04c580a7de","category":"Environment"}