{"title":"Chemical Compositions and Fumigation Effects of Essential Oils Derived from Cardamom, Elettaria cardamomum (L.) Maton, and Galangal, Alpinia galanga (L.) Willd Against Red Flour Beetle, Tribolium castaneum (Herbst) (Coleoptera: Tenebrionidae)","link":"https://www.preprints.org/manuscript/202405.0327/v1","date":1715093406000,"content":"The prevention of destruction caused by red flour beetle, Tribolium castaneum (Herbst), using essential oils derived from certain herbal plants presents an interesting alternative to synthetic insecticides, known for their harm to both consumers and the environment. The research aimed to investigate the chemical compositions and fumigating effects of essential oils derived from cardamom (Elettaria cardamomum (L.) Maton) and galangal (Alpinia galanga (L.) Willd) against T. castaneum. Chemical compositions were analyzed using GC-MS, while fumigation bioassay was conducted via a vapor-phase test. Experimental setup followed factorial design in CRD with 5 replications. Factor A encompassed 4 types of essential oils: the manually extracted essential oils from cardamom leaves (MCL) and galangal leaves (MGL), the commercially produced essential oils from cardamom seeds (CCS) and galangal rhizomes (CGR). Factor B consisted of 7 concentrations: 0, 50, 100, 150, 200, 250, and 300 µL/L air. Results indicated that MCL contained eucalyptol, trans-calamenene, and isospathulenol as its main compounds. Similarly, CCS was characterized by camphene and eucalyptol. MGL exhibited caryophyllene, aciphyllene, and α-bisanolene. Lastly, CGR was composed of methyl cis-cinnamate, safrole, and p-vinylphenyl isothiocyanate. Study noted that 250 µL/L air over 168 hours of CGR, demonstrated 94% fumigation efficiency against adult T. castaneum. These results suggest the potential of galangal rhizome derived essential oil as an insecticide for managing T. castaneum populations in agricultural product storage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b775a86ab93c88e08a9d0c4849a10cd12c0843fc85fe54d390b5bea4804773f3","category":"Interdisciplinary"}