{"title":"The Manx Missile Relaunched: Why cycling needed another Cav win","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-manx-missile-relaunched-why-cycling-needed-a-cav-win","date":1618570233000,"content":"\n      <p><span>For a rider who has 30 stage wins at the Tour de France to his name, a victory at the Presidential Tour of Turkey might seem insignificant. Ask anyone who has followed the ebb and flow of Mark Cavendish’s career, though, and they will understand the importance of these results. His victory in stage 2 was his first win in over 1000 days.</span></p>\n<div></div>\n<p><span>Up until 2016, Cavendish winning had become almost a formality. He had over 140 victories in his arsenal and seemed to be unbeatable in a bunch sprint. He was physically fast, but his tactical prowess set him apart from his rivals. He would never lose his leadout man and he’d never let himself be forced off the wheel he wanted. Often, it looked like he had left it too late, but Cav always got it right – popping out at the last minute, crushing the hopes of his competitors.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendish-cal-crutchlow-valtteri-bottas-and-jamie-chadwick-in-conversation\">Related – Cavendish, Bottas, Chadwick and Crutchlow in conversation</a> <br /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related – Tour de France 2021 Preview</a></strong></em></p>\n<p><span>However, in 2018, Cavendish was not able to finish the Tour de France, missing the time cut on stage 11. He’d had a lacklustre season by his standards up to that point, only securing one win in Abu Dhabi. It was later revealed that he’d been suffering from Epstein-Barr virus, an illness which had severely affected his racing that year.</span></p>\n<p><span></span><span>Although he was able to return to competition the next season, Cavendish never looked like his former stage-winning self and many people questioned whether the sprinter would ever be able to contest the podium again. But those who asked that question had forgotten the traits which make Mark Cavendish the champion he is.</span></p>\n\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_575468_cycle_14_1024x1024.jpg?v=1618569904\" /></span></p>\n<p><em><span>Cavendish didn't finish the 2017 Tour de France (Photo credit: Offside/Presseports)</span></em></p>\n<p><span>The characteristics that have always made him an excellent sprinter have helped him overcome the obstacles he faced in recent years. His innate stubbornness makes him a great bike rider: he’s never intimidated by other riders and never happy with anything other than first place. This determination meant that Cavendish had no choice but to silence his critics who questioned if he’d ever return to form, and he did that at the Tour of Turkey this week.</span></p>\n<p><span>The three stage wins didn’t come easy, either. Although only a ProSeries race, the sprinting calibre in Turkey was high. Cavendish finished ahead of the 11-time Tour stage winner Andre Greipel and up-and-coming young talent, Jasper Phillipsen. On stage 2, Cavendish used all his experience to give a masterclass in timing, staying in the wheel of Greipel until the last minute, showing patience and calm that only a rider of his stature is capable of.</span></p>\n<div></div>\n<p><span>On stage 3, his confidence had skyrocketed and we saw that he was simply the fastest man in the race. Once he opened up his sprint, no rider could find their way round and Cav took an even more convincing win than the day before. In the words of everyone’s favourite Eurosport commentator Carlton Kirby: “beware everybody, he is well and truly back!” Kirby’s warning was only confirmed when Cavendish took his third win in three days in stage 4.</span></p>\n<p><span>Of course, Cavendish didn’t do it alone, and he would be the first to thank his Deceuninck-Quick Step teammates. He is certainly relishing his return to the ‘Wolfpack’, the team he rode for in the 2013 and 2014 season. He secured 36 wins in his first stint with the Belgian outfit and it looks like they have brought Cavendish back to his best this year.</span></p>\n<p><span>Patrick Levefere made no attempts to hide the fact that Cav had brought his own sponsors to the team for 2021 and that those sponsors would help pay the Manxman’s contract. Lefevere has his critics, those who disagree with his outspoken and old-school mentality, but the results of his team do the talking. Quick Step clearly provides an environment in which riders can thrive. The likes of Remco Evenepoel and Julian Allaphillipe surely have offers from other World Tour teams, but they choose to stay with Lefevere, despite Quick Step not having the biggest budget.</span></p>\n<p><span>Could it be that what Mark Cavendish needed all along was a boss who believed in him, but wouldn’t take any excuses? Lefevere certainly took a chance with Cav: places in WorldTour teams are valuable and Levefere could only take Cavendish’s word that he’d win again. Levefere’s approach of being honest with riders and giving each of them an opportunity to go for a result has created a team of winners. Cavendish is now surrounded by those who perform at the highest standard in the professional peloton, and that must have only been motivation to return to that level himself. </span></p>\n<p><span>One of the most notable things about Cavendish’s wins was the reaction of his colleagues and competitors. They queued up to congratulate him after the stages, a testament to his authority in the peloton and the respect that his fellow riders have for him. Many of us watching at home shared that sentiment. Seeing him first across the line allowed the cycling community to breathe a sigh of relief. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cavendish_2007___Kolln_1024x1024.jpg?v=1618569494\" /></span></p>\n<p><em><span>Mark Cavendish in 2007, by Timm Kölln</span></em></p>\n<p><span>Cavendish has paved the way for British cycling success and he’s a crucial part of cycling’s history. He broke through to the European scene in 2007 when he won Scheldeprijs in Belgium, and he went to win four stages of the Tour de France in 2008. This was before the 2012 Olympics and the days of Team Sky dominating the Grand Tours. His contribution to the sport means his fan base might well be bigger than any rider before him.</span></p>\n<p><span>Of course, Cavendish hasn’t had a career without controversy, his interviews in the early parts of his career were often as dramatic as his race wins, especially if he hadn’t got the result he wanted. Riders now have extensive media training and interviews are often bland, to say the least. Cavendish always wore his heart on his sleeve, and always will. From swearing at journalists who asked annoying questions, to finishing tearfully in Gent-Wevelgem last year as he worried it might be the final race of his career, Cav doesn’t hide his emotions, and you can’t help but love him for it.</span></p>\n<p><span>The responses on social media and from other riders show how well-regarded he has come to be in the sport. Winning is great: it’s good for motivation, it keeps the sponsors happy and silences the naysayers. But Cavendish should perhaps be prouder of the reaction to his win.</span></p>\n<p><span>The number of people delighted to see him taste success again is only a testament to his inspiring attitude, his likability and his contribution to the sport. Long may it continue.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b77cc190067a007fd4ffde3ec117640e28b3d95d1b9fe09332ffd628f46e6e3d","category":"Cycling"}