{"title":"An Increasing Triglyceride-Glucose Index Predisposes to a Pro-Inflammatory Phenotype: Implications for Cardio-Metabolic Syndromes","link":"https://www.preprints.org/manuscript/202406.0337/v1","date":1717652473000,"content":"Background  and Aims\n        Insulin resistance  is pivotal in  the pathogenesis of Metabolic Syndrome (MetS),  which predisposes to both type 2 diabetes mellitus (T2DM) and premature atherosclerotic cardiovascular disease (ASCVD). The triglyceride-glucose index (Ty-G index), a validated measure of insulin resistance also predicts MetS, T2DM, severity of albuminuria and ASCVD. There is scantly data providing mechanistic insights into these sequalae. \n Accordingly, we investigated the relationship between the TyG index and biomarkers of inflammation, oxidative stress, free fatty acids (FFA) levels and adipokine dysregulation in a cohort comprising   both controls and patients with nascent MetS.\n  Patients and Methods \nParticipants included 47 patients with MetS and 41 controls. Persons with diabetes, ASCVD, smoking and macro-inflammation were excluded.  Fasting blood was obtained for both plasma and monocyte isolation.\nResults: \n Receiver operating Characteristic (ROC) curve analysis revealed that TyG index was an excellent predictor of MetS with an area under the curve of 0.87 and it correlated with both hepatic and adipose tissue insulin ressitance .Both serum FFA levels and non-HDL-cholesterol increased significantly over tertiles of TyG index. Based on TyG index tertiles and or correlations, C reactive protein, endotoxin, chemerin , interleukin-6 levels and monocyte toll-like receptor (TLR)- 4 and   TLR-2 and their  cellular signaling were  significantly  associated with TyG index .\nConclusion:\t\n   Increased non-HDL-C and most importantly a pro-inflammatory state evidenced by both circulating and cellular biomarkers could be advanced as potential mechanisms explaining the increased risk for T2DM and ASCVD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b791ab1c6c0a1a0a4c3a4422d80cf4116b25e30c244104bcc17ce68e899a02a5","category":"Interdisciplinary"}