{"title":"Impact of staff training on university productivity through job satisfaction: A study of ISO 9001- certified institutions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306799","date":1720533600000,"content":"<p>by Shahzaf Iqbal, Dr. Mubashir Hanif, Dr. Sohaib Khan</p>\r\n\r\nThe study examines the influence of staff training on university productivity through the job satisfaction of academic and administrative staff in ISO 9001-certified universities in Pakistan, utilizing a quantitative research approach. Data were gathered through online surveys using purposive sampling from academic and administrative staff, with analysis performed using SmartPLS-4. The results indicate that staff training significantly influences both job satisfaction and university productivity, with job satisfaction serving as a significant mediator. This research contributes to scholarly discourse by validating Organizational Learning Theory in ISO 9001-certified universities, highlighting the enhancement of productivity and job satisfaction through ISO 9001-aligned staff training. It also underscores the influence of QMS on employee attitudes and university productivity, highlighting the significance of ISO 9001 implementation, specifically through staff training, in university operations. Practical implications include recommendations for policymakers, administrators, and quality managers to prioritize ISO 9001-focused training to boost productivity and certification success, foster a culture of continuous learning, and improve educational quality and organizational outcomes. However, limitations such as the study’s cross-sectional design, purposive sampling, and focus on specific universities in Pakistan may limit generalizability. Future research should explore novel approaches to understanding factors influencing job satisfaction among academic and administrative staff to enhance productivity in ISO 9001-certified universities worldwide.","author":"Shahzaf Iqbal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b798cd395eebe932ea564340aed41aa06f55bf3c8a805f090b15512a385dc25c","category":"Interdisciplinary"}