{"title":"Reddit CEO: Apollo-Related Subreddit Blackouts 'Will Pass,' No Significant Revenue Impact So Far","link":"https://www.macrumors.com/2023/06/13/reddit-ceo-blackouts-no-revenue-impact/","date":1686679854000,"content":"Reddit CEO Steve Huffman on Monday told Reddit employees that he is unconcerned about current protests over the company's sudden API changes. In a letter shared by <em><a href=\"https://www.theverge.com/2023/6/13/23759559/reddit-internal-memo-api-pricing-changes-steve-huffman\">The Verge</a></em>, Huffman said that while there's a \"lot of noise\" right now, it \"will pass.\" He also said that Reddit \"has not seen any significant revenue impact so far.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/04/reddit-app-icon.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nA number of community-moderated subreddits began shutting down and going private on Monday, June 12, with the blackout set to last until Wednesday, June 14 in many cases. Subreddits with millions of subscribers are <a href=\"https://www.macrumors.com/2023/06/11/apple-subreddit-goes-dark/\">participating in the protest</a>. Going private means that no new posts are able to be submitted to a given subreddit, and in some cases, the content from the subreddit is not viewable at all.\r<br />\n\r<br />\nHuffman's full letter is below:<blockquote>Starting last night, about a thousand subreddits have gone private. We do anticipate many of them will come back by Wednesday, as many have said as much. While we knew this was coming, it is a challenge nevertheless and we have our work cut out for us. A number of Snoos have been working around the clock, adapting to infrastructure strains, engaging with communities, and responding to the myriad of issues related to this blackout. Thank you, team.\r<br />\n\r<br />\nWe have not seen any significant revenue impact so far and we will continue to monitor.\r<br />\n\r<br />\nThere's a lot of noise with this one. Among the noisiest we've seen. Please know that our teams are on it, and like all blowups on Reddit, this one will pass as well. The most important things we can do right now are stay focused, adapt to challenges, and keep moving forward. We absolutely must ship what we said we would. The only long term solution is improving our product, and in the short term we have a few upcoming critical mod tool launches we need to nail.\r<br />\n\r<br />\nWhile the two biggest third-party apps, Apollo and RIF, along with a couple others, have said they plan to shut down at the end of the month, we are still in conversation with some of the others. And as I mentioned in my post last week, we will exempt accessibility-focused apps and so far have agreements with RedReader and Dystopia.\r<br />\n\r<br />\nI am sorry to say this, but please be mindful of wearing Reddit gear in public. Some folks are really upset, and we don't want you to be the object of their frustrations.\r<br />\n\r<br />\nAgain, we'll get through it. Thank you to all of you for helping us do so.</blockquote>While the protest was only meant to last for a couple of days, Huffman's callous response to user and moderator concerns could potentially escalate the situation. Some subreddits have already pledged to remain inaccessible until Reddit makes a meaningful change. Popular Apple-related subreddit r/Apple, for example, has decided to remain closed indefinitely. \r<br />\n\r<br />\n<div><blockquote><p>While I can't speak for the entire r/Apple mod team I can say that we have voted to stay closed indefinitely due to Reddit's CEO's poor decision-making. <a href=\"https://t.co/JyIT2qYbf4\">https://t.co/JyIT2qYbf4</a></p>— Aaron (@aaronp613) <a href=\"https://twitter.com/aaronp613/status/1668683335718035457?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote> </div>\r<br />\nThe blackouts are in support of third-party Reddit app Apollo and other third-party apps, some of which will soon be forced offline by the amount of money that Reddit wants to charge for API access and the limited mount of time that developers have to make changes before accruing fees.\r<br />\n\r<br />\nApollo developer Christian Selig said that his app would cost $20 million per year, which is why he <a href=\"https://www.macrumors.com/2023/06/08/apollo-shutting-down-june-30/\">made the decision to shut it down on June 30</a>. Apollo and other third-party apps offer a range of features that are not available through the subpar official Reddit app.\r<br />\n\r<br />\nReddit does not offer a similar app experience for users or for moderators, who also use Apollo as a moderation tool. Subreddit moderators work for free, overseeing their respective communities with no compensation. Moderators have expressed growing frustration at the lack of tools provided to them by Reddit, and have said that the loss of Apollo will make their work harder.\r<br />\n\r<br />\nHuffman has refused to back down on the API pricing changes or the implementation timeline, and he has also maligned Selig multiple times, lying about the interactions that Reddit had with Apollo despite documentation provided by Selig.\r<br />\n\r<br />\nAs of right now, more than 8,000 subreddits with millions of Reddit users have gone dark.<div>Tags: <a href=\"https://www.macrumors.com/guide/apollo/\">Apollo</a>, <a href=\"https://www.macrumors.com/guide/reddit/\">Reddit</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/13/reddit-ceo-blackouts-no-revenue-impact/\">Reddit CEO: Apollo-Related Subreddit Blackouts 'Will Pass,' No Significant Revenue Impact So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/reddit-ceo-apollo-related-subreddit-blackouts-will-pass-no-significant-revenue-impact-so-far.2392830/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b798570b5aef6af084f6f2bbf3947bc58494a202e21e05f1c2a82959013454f3","category":"Apple"}