{"title":"Salmon lice biology, environmental factors, and smolt behaviour with implications for the Norwegian salmon farming management system: A critical review","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12953?af=R","date":1722393514000,"content":"<h2>Abstract</h2>\n<p>In 2017, a new regulatory management system, the traffic light system (TLS), was implemented to estimate the effects of salmon lice from Norwegian salmon aquaculture on marine survival of wild Atlantic salmon and forms the basis of aquaculture capacity regulation. The TLS relies on observational data and a set of models to estimate the risk for negative impact on wild salmon populations. This review of the literature that forms the basis for the TLS as well as other relevant studies is presented in the context of the currently practiced TLS and suggestions are made for immediate and long-term improvements. The main findings of this review are that: (1) assumed timing and duration of smolt migration contribute to unreliable observational and modelled data and overestimates of infection pressure; (2) production of lice larvae from farmed salmon is overestimated; (3) TLS model systems rely on or are calibrated by the same potentially flawed data; (4) lice-associated mortality in wild salmon smolts may be overestimated; and (5) lice infection levels on farms are not associated with measurable effects on wild salmon. Recommendations to improve the accuracy and reliability of the TLS, and hence its environmental efficiency include the more complete use of available biological and physical environmental variables, adjusting the time period that observational data are registered and modelled data are integrated, adjusting the interpretation of data including recognition of uncertainty in model outcomes, and use of more realistic assumptions concerning lice-induced mortality thresholds.</p>","author":"Solveig van Nes, \nAlbert Kjartan Dagbjartarson Imsland, \nSimon R. M. Jones","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"b79a95788ea74aac51a68f9fd47749e5cde176442f0dda45f1238d052584783e","category":"Environment"}