{"title":"The Hadley circulation in a changing climate","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15114?af=R","date":1713373495000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/8a8f8ddd-71c4-4dba-84dd-4edcaa511527/nyas15114-gra-0001-m.png\" alt=\"The Hadley circulation in a changing climate\" />\n<p>The Hadley circulation is a global-scale atmospheric feature that plays a fundamental role in Earth's climate: its variations primarily affect the tropical and subtropical hydrological cycle, impacting water resources in monsoon regions and vulnerable semi-arid areas. This article reviews the understanding of the processes that are responsible for its evolution. A key result is that both theory and models support the future expansion of the Hadley circulation under anthropogenic climate change.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The Hadley circulation (HC) is a global-scale atmospheric feature with air descending in the subtropics and ascending in the tropics, which plays a fundamental role in Earth's climate because it transports energy polewards and moisture equatorwards. Theoretically, as a consequence of anthropogenic climate change, the HC is expected to expand polewards, while indications on the HC strength are equivocal, as weakening and strengthening are expected in response to different mechanisms. In fact, there is a general agreement among reanalyses and climate simulations that the HC has significantly widened in the last four decades and it will continue widening in the future, but there is no consensus on past and future changes of the HC strength. Substantial uncertainties are produced by the effects of natural variability, structural deficiencies in climate models and reanalyses, and the influence of other forcing factors, such as anthropogenic aerosols, black carbon, and stratospheric and tropospheric ozone. The global HC can be decomposed into three regional HCs, associated with ascending motion above Equatorial Africa, the Maritime Continent, and Equatorial America, which have evolved differently during the last decades. Climate projections suggest a generalized expansion in the Southern Hemisphere, but a complex regional expansion/contraction pattern in the Northern Hemisphere.</p>","author":"Piero Lionello, \nRoberta D'Agostino, \nDavid Ferreira, \nHanh Nguyen, \nMartin S. Singh","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"b79c7f67eb09dfe7250e9b79ccc8426d221dddab22983f1706df467a0cf5042d","category":"Environment"}