{"title":"Nobel Prize in Physics honors attosecond pulses to study electrons","link":"https://arstechnica.com/?p=1972730","date":1696364576000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/attoTOP-800x533.jpg\" alt=\"drawings of two men and one woman\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/attoTOP.jpg\">Enlarge</a> <span>/</span> Pierre Agostini, Ferenc Krausz and Anne L'Huillier have been awarded the 2023 Nobel Prize in Physics for their work using attosecond pulses to study the dynamics of electrons inside atoms. (credit: Niklas Elmehed/Nobel Prize Outreach)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Electrons move and change energies at such a blistering speed that physicists long believed it would never be possible to capture their dynamics, even with the fastest lasers. The Royal Swedish Academy of Sciences <a href=\"https://www.nobelprize.org/prizes/physics/2023/prize-announcement/\">has awarded</a> the 2023 Nobel Prize in Physics to three scientists who used ultrafast pulses of light to do just that with a technique known as attosecond spectroscopy. Per the citation, Pierre Agostini, Ferenc Krausz, and Anne L'Huillier \"have given humanity new tools for exploring the world of electrons inside atoms.\"</p>\n<p>It's well known that to capture detailed images of, say, a hummingbird mid-flight, one needs to use exposure times that are shorter than a single beat of the hummingbird's wings. But atoms in a molecule move in billionths of a second, aka femtoseconds; electrons move and change energies faster, between one and a few hundred attoseconds. (An attosecond is one billionth of a billionth of a second.) If you sent a flash of light from one end of a room to the other, it would take 10 billion attoseconds. Physicists had long believed that a femtosecond was the fundamental limit for producing short bursts of light—at least with existing technology—and thus capturing the behavior of electrons in atoms was beyond reach.</p>\n<p>That changed over the last 20 years. “The ability to generate attoseconds of light has opened the door on an extremely tiny timescale, and it also opened the door to the world of electrons,” said Eva Olsson, chair of the Nobel committee for physics, at the press conference announcing the prize. “Back in 1925, Werner Heisenberg argued that this world cannot be seen. Thanks to attosecond physics, this is now starting to change.” The work is expected to have a significant impact on electronics, where understanding and controlling how electrons behave in materials is critical to achieving faster electronics, as well as in medical diagnostics, which requires being able to identify different molecules.</p></div><p><a href=\"https://arstechnica.com/?p=1972730#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972730&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b79d2346118b7266111dadd3cf5a7e26533f3820ce9459ce30fa89b5d36022b6","category":"Tech"}