{"title":"Volkswagen Group wants six new European battery factories by 2030","link":"https://arstechnica.com/?p=1749809","date":1615839570000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DB2021AL00263_large-800x533.jpg\" alt=\"A man in an open-collared suit stands in front of a large power charger mockup.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DB2021AL00263_large.jpg\" class=\"enlarge-link\" data-height=\"2175\" data-width=\"3262\">Enlarge</a> <span class=\"sep\">/</span> Thomas Schmall, Member of the Board of Management of Volkswagen Group for Technology, and CEO of Volkswagen Group Components.  (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.volkswagenag.com/\">Volkswagen AG</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Volkswagen Group is planning six new European lithium-ion battery factories with a total yearly output of 240 GWh once they're all operational in 2030. It made the announcement on Monday at an online \"Power Day\" event, where it laid out the latest update to <a href=\"https://arstechnica.com/cars/2017/09/volkswagen-group-will-electrify-all-12-brands-by-2030-needs-gigafactories/\">its electrification plan</a>. In addition to the new factories, it will be moving to a common prismatic cell design in 2023 to drive down battery costs and is upping its investment in DC fast-charging infrastructure.</p>\n<p>\"E-mobility has become core business for us. We are now systematically integrating additional stages in the value chain. We secure a long-term pole position in the race for the best battery and best customer experience in the age of zero emission mobility,\" said VW Group chairman Herbert Diess.</p>\n<p>Some of battery factories will be owned by VW Group, like the one in Salzgitter, Germany, that in 2025 will start churning out a single design of prismatic cells for high-volume EVs built on VW Group's MEB platform. Others will be operated by suppliers; on Monday, Northvolt and VW Group signed a $14 billion order for battery cells for premium EVs, which Northvolt will begin producing in 2023 at its factory in Skellefteå, Sweden. Both factories will reach annual capacities of 40 GWh by 2030. (VW is also increasing its ownership stake in Northvolt, and Northvolt will sell its share of the Salzgitter factory to VW Group.)</p></div><p><a href=\"https://arstechnica.com/?p=1749809#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1749809&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b7a1d527bb836cfd98a214a66e236fe64f9a80b6f7834d3f7237a11d190289ea","category":"Tech"}