{"title":"Evaluation of landscaping and vegetation management to suppress host-seeking Ixodes scapularis (Ixodida: Ixodidae) nymphs on residential properties in Connecticut, USA","link":"https://academic.oup.com/ee/article/53/2/268/7604098?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>Ticks and tick-borne diseases are of increasing concern across the United States, particularly in the Northeast. <span>Ixodes scapularis</span> Say (Ixodida: Ixodidae) remains the primary vector for the Lyme disease spirochete, <span>Borrelia burgdorferi</span> (Johnson, Schmid, Hyde, Steigerwalt, and Brenner). Prior studies established that <span>I. scapularis</span> can be found in greatest abundance in the 1-m forested ecotone surrounding the lawn edge in residential backyards. Our study was conducted on 42 properties in Guilford, CT, and sought to expand upon this premise by determining which key habitat features were associated with increased densities of host-seeking <span>I. scapularis</span> nymphs. We quantified nymphal abundances in 19 different habitat types that were posited to influence densities. We determined that nymphal <span>I. scapularis</span> densities were greatest in forested areas closest to lawn edges with leaf litter or understory vegetation present, as well as short lawns adjacent to woodland edges. Additionally, we determined that there were no significant declines in nymphal <span>I. scapularis</span> density where leaf litter was removed, lawns were left unmowed, or woodchip barriers were installed. Bird feeders and woodpiles were not associated with increased nymphal <span>I. scapularis</span> densities. However, areas adjacent to stone walls did have nearly 3 times the density of <span>I. scapularis</span> nymphs present compared with habitats without stone walls. The culmination of the results from this study can be utilized to create more targeted acaricide applications rather than broadcast spraying, as well as increase homeowner awareness for areas with heightened risk for exposure to nymphal <span>I. scapularis</span>, which are deemed the most epidemiologically important species and stage for pathogen transfer to humans.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"b7a4125c333270351b3405d5e6a822faf3662e94ea0628dbe1e0168422b6923a","category":"Environment"}