{"title":"Apple ends the End Call button saga in latest iOS 17 beta","link":"https://www.macworld.com/article/2033323/apple-ends-the-end-call-button-saga-in-latest-ios-17-beta.html","date":1692203776000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Back when the iOS 17 beta arrived, it included a slight change that no one seemed to care about for weeks. Once the mainstream press started to take notice, they weren’t happy. Apple appears to have noticed and backtracked on the change.</p>\n\n\n\n<p>We’re talking about the End Call button in the iOS 17 Phone app. In the first five betas, Apple had moved the button to the bottom right, surrounded by other buttons, rather than by itself in the center where it had been for years. In the latest beta that arrived this week, Apple moved the button to the center of the bottom row, roughly the same position as before. It is still surrounded by other buttons rather than by itself, having swapped positions with the Keypad button. The other interface changes—including the rearranging of the Mute, Audio, and FaceTime buttons, as well as the removal of the Contacts button—still remain.</p>\n\n\n\n<p>The quick change shows just how valuable Apple’s beta program is, and how Apple really does listen to feedback. For example, Safari went through extensive changes during the iOS 15 beta that resulted in major changes to the interface, including options to change back to the original “URL bar on top” version.</p>\n\n\n\n<p>iOS 17 will likely go through at least two more betas before it releases to the public in September, but we assume this particular saga is over. When iOS 17 arrives, the End Call button will be centered as it always was and you’ll be able to quickly hang up on calls without learning any new button placement.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b7a819ddad93052483e84233ba7be66f068f1fea7192faad2181b152d01831c4","category":"Apple"}