{"title":"After the failure of the Facebook Phone, get ready for a Facebook Watch","link":"https://arstechnica.com/?p=1742335","date":1613411260000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/10/GettyImages-1151289735-800x501.jpg\" alt=\"After the failure of the Facebook Phone, get ready for a Facebook Watch\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/10/GettyImages-1151289735.jpg\" class=\"enlarge-link\" data-height=\"2180\" data-width=\"3481\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Here's a statement that should fill everyone with optimism: Facebook is building an Android smartwatch! That's according to a new report from <a href=\"https://www.theinformation.com/articles/facebook-plans-smartwatch-with-focus-on-messaging-health\">The Information</a>, which says the watch should hit the market next year.</p>\n<p>Sources tell The Information that the watch will be a standalone device, able to hook up to cellular networks without tethering to a smartphone. The report makes it sound like Facebook wants to build its own smartwatch ecosystem, saying the device will \"let wearers send messages using Facebook’s services and also offer health and fitness features.\" The Information later added that \"Facebook hopes to emphasize features that utilize its social networking prowess, such as allowing users to track their workouts with friends or communicate with their trainer\" and that Facebook \"plans to allow the device to connect to the services or hardware of health and fitness companies, such as Peloton Interactive.\"</p>\n<p>Will the project be successful? Let's just say that every word in the phrase \"Facebook Android smartwatch\" is cause for concern. If you exclude the acquired Oculus VR division, Facebook's hardware efforts haven't panned out well. The closest previous project to a smartwatch is the Facebook Phone, aka, the HTC First. Facebook and HTC teamed up in 2013 to design a smartphone using HTC's hardware and Facebook's software. Facebook made a custom Android skin with a new, Facebook-centric home screen and a few other additions. The phone lasted one month on the market. Facebook's newer, less historically disastrous hardware effort is the Facebook Portal line, which is a series of video chat devices available in several smart display form factors and as a set-top box for your TV. These did <a href=\"https://www.fastcompany.com/90419009/supply-chain-sources-say-facebook-portal-sales-are-very-low\">not sell well</a> in the normal market, but when the pandemic hit, the Portal TV <a href=\"https://www.cnbc.com/2020/03/25/facebooks-portal-tv-video-chat-system-sold-out.html\">sold out</a> along with every other video chat device.</p></div><p><a href=\"https://arstechnica.com/?p=1742335#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1742335&comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b7a9fc77b6ba8bae91bc8f3566c29a0060cf2d8d8dfeadaaf3131263ef90b11f","category":"Tech"}