{"title":"Amitraz Resistance in French Varroa Mite Populations&ndash;More Complex than a Single Nucleotide Polymorphism","link":"https://www.preprints.org/manuscript/202404.1720/v1","date":1714109800000,"content":"Resistance against amitraz in varroa mite populations has become a subject of interest in recent years due to increasing reports of reduced field efficacy of amitraz treatments, especially from some beekeepers in France and the United States. The loss of amitraz as a reliable tool to effectively reduce varroa mite infestation in the field could severely worsen the position of beekeepers in the fight to keep varroa infestation rates in their colonies at low levels. In this publication, we present data from French apiaries, collected in the years 2020 and 2021. These data include field efficacy of an authorized amitraz-based varroa treatment (Apivar®) and results of laboratory sensitivity assays of varroa mites exposed towards the reference LC90 concentration of amitraz. In addition, a total of 240 varroa mites from Eastern, Central, and Southern regions in France that were previously classified as either “sensitive” or “resistant” towards amitraz in a laboratory sensitivity assay were genotyped. The genetic analyses of mite samples are focused on the β−adrenergic-like octopamine receptor, which is considered as the main target site for amitraz in varroa mites. Special attention was given to a single nucleotide polymorphism (SNP) at position 260 of the ORβ-2R-L gene that had previously been described by Hernández Rodríguez et al. (2021) as associated to the resistance to amitraz in French varroa mites. Our findings confirm that amitraz resistance occurs in patches or “islands of resistance” with a less severe reduction in treatment efficacy compared to pyrethroid resistance or coumaphos resistance in varroa mites. The results of our genetic analyses of varroa mites call into question the hypothesis of the SNP at position 260 of the ORβ-2R-L gene being directly responsible for amitraz resistance development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b7b155c1b1c5fa7dbac804002383775c5472e998e0256ae73a2de28c5859a1b7","category":"Interdisciplinary"}