{"title":"iPad Shipments to Stay Stable in Second Quarter Despite Chip Shortages","link":"https://www.macrumors.com/2021/05/04/ipad-shipments-stable-q2-chip-shortages/","date":1620121245000,"content":"Apple's <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> shipments are expected remain stable in the second quarter of this year, despite the impact of global chip shortages, according to a new report.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/new-ipad-pro-11-inch.jpg\" />\r\n<br />\r\nThe ongoing integrated chip shortage has been caused by supply chain issues that arose during the global health crisis and weather-related events like the freeze in Texas that shut down Austin chip plants.\r\n<br />\r\n\r\n<br />\r\nAs chip factories struggled to keep up with standard outputs during the pandemic, demand surged as people purchased devices for an at-home lifestyle, leading to higher prices. As a result, electronics companies bought up all available supply, leading chip makers to run at capacity.\r\n<br />\r\n\r\n<br />\r\nSo far, the shortage has only had minor impacts on the tablet market, which continues to follow its seasonal pattern. Global tablet shipments totaled 35.95 million units in the first quarter of 2021, down 22.7% sequentially, but 45.5% on year, according to <em><a href=\"https://www.digitimes.com/news/a20210504PD208.html\">DigiTimes</a></em>.\r\n<br />\r\n\r\n<br />\r\nHowever, the release of new <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models will help Apple buck declining trends in the global market, according to the report, with most non-Apple brands expected to witness sequential declines in second-quarter shipments.\r\n<br />\r\n<blockquote>The sequential shipment decline in the first quarter was due to slow-season effect and volumes in the second quarter are expected to continue suffering from seasonality, witnessing a sequential drop of 6.6%, Digitimes Research's figures show.</blockquote>Unbranded or \"white-box\" tablet vendors are said to have been seriously hit by the shortages and have watched their market shares being taken over by inexpensive models by brand vendors. <em>DigiTimes</em> reports that white-box tablets could be at risk of disappearing from the market altogether in 2022.\r\n<br />\r\n\r\n<br />\r\nDespite Apple's ability to remain unscathed by the chip shortage in Q2, <em>Bloomberg</em> <a href=\"https://www.macrumors.com/2021/04/12/high-end-ipad-pro-mini-led-production-issue/\">reports</a> that its 12.9-inch ‌iPad Pro‌ may be in short supply when it launches on May 21 due to production issues of the mini-LED display being used in the device.\r\n<br />\r\n\r\n<br />\r\nOverall, Apple will seen an impact from the chip shortages and <a href=\"https://www.macrumors.com/2021/04/28/apple-ipad-mac-supply-shortages/\">says</a> it expects to see a sequential decline of approximately $3 to $4 billion revenue in the third-quarter of 2021 due to ‌‌iPad‌‌ and Mac supply constraints. Apple says a combination of the shortages and a very high level of demand for both ‌‌iPad‌‌ and Mac is expected to impact revenue in the second half of 2021.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">digitimes.com</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#11-iPad-Pro\">11\" iPad Pro (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Buy Now)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/04/ipad-shipments-stable-q2-chip-shortages/\">iPad Shipments to Stay Stable in Second Quarter Despite Chip Shortages</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ipad-shipments-to-stay-stable-in-second-quarter-despite-chip-shortages.2294752/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IuIIwP3kAwY:MjYe6BYrTww:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IuIIwP3kAwY:MjYe6BYrTww:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/IuIIwP3kAwY\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b7c45e47bc20d973b270d1bb47885b57c6471edb7a99acea21587f0297177a8b","category":"Apple"}