{"title":"Integrating climate change into state hazard mitigation plans: A five-year follow-up survey of state hazard mitigation officers","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000385","date":1729778400000,"content":"<p>by Evan C. Mix, Meg Hamele, Andrew L. Dannenberg, Robert Freitag, Nicole A. Errett</p>\r\n\r\nClimate change is making disaster events more frequent and intense, increasing the risk to economic security, ecosystem health, and human health and well-being. Hazard mitigation planning, overseen in the United States by the Federal Emergency Management Agency (FEMA), aims to reduce disaster risk by identifying hazards and taking action to reduce their impact. While FEMA policy requires states and territories to consider the risks of climate change in their plans, guidance remains broad. As a result, jurisdictions have taken different approaches to integrating climate change into their hazard mitigation plans (HMPs). Thirty of 56 U.S. State and Territorial Hazard Mitigation Officers (SHMOs) responded to a survey concerning climate planning, building on a similar survey conducted in 2018. A majority of respondents recognized that their jurisdictions are vulnerable to climate change and agreed that climate change is a threat to their jurisdictions both now and in the future. Respondents were motivated to integrate climate change into their HMPs by factors including increased evidence for climate change projections and disaster events in either their jurisdictions or neighboring ones. Among the most frequently reported barriers was reliance on historical patterns of hazard exposure. Most respondents had incorporated at least one climate change adaptation strategy into their HMPs but reported having insufficient resources to plan for and implement climate-related hazard mitigation activities. Findings suggest that state and territorial hazard mitigation planning programs are taking more steps to integrate climate change into their plans and that SHMOs are more aware of the risks that climate change poses than in 2018. Further research is needed to explore how best to support state-level hazard mitigation program response to climate change.","author":"Evan C. Mix","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"b7c43e99128ca7444d854e22fee1737920f885005d90c377190801329ad1abcb","category":"Environment"}