{"title":"Announcing Amazon OpenSearch Service zero-ETL integration with Amazon S3 (preview)","link":"https://aws.amazon.com/blogs/aws/amazon-opensearch-service-zero-etl-integration-with-amazon-s3-preview/","date":1701279646000,"content":"<p>Today we are announcing a preview of <strong>Amazon OpenSearch Service zero-ETL integration with Amazon S3</strong>, a new way to query operational logs in <a href=\"https://aws.amazon.com/s3\">Amazon S3</a> and S3-based data lakes without needing to switch between services. You can now analyze infrequently queried data in cloud object stores and simultaneously use the operational analytics and visualization capabilities of OpenSearch Service.</p> \n<p><a href=\"https://aws.amazon.com/opensearch-service\">Amazon OpenSearch Service</a> direct queries with Amazon S3 provides a <a href=\"https://aws.amazon.com/what-is/zero-etl/\">zero-ETL integration</a> to reduce the operational complexity of duplicating data or managing multiple analytics tools by enabling customers to directly query their operational data, reducing costs and time to action. This zero-ETL integration will be configurable within OpenSearch Service, where you can take advantage of various log type templates, including predefined dashboards, and configure data accelerations tailored to that log type. Templates include <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/flow-logs.html\">VPC Flow Logs</a>, <a href=\"https://aws.amazon.com/elasticloadbalancing/\">Elastic Load Balancing</a> logs, and NGINX logs, and accelerations include skipping indexes, materialized views, and covered indexes.</p> \n<p>With direct queries with Amazon S3, you can perform complex queries critical to security forensic and threat analysis that correlate data across multiple data sources, which aids teams in investigating service downtime and security events. After creating an integration, you can start querying their data directly from the OpenSearch Dashboards or OpenSearch API. You can easily audit connections to ensure that they are set up in a scalable, cost-efficient, and secure way.</p> \n<p><strong><u>Getting started with direct queries with Amazon S3</u></strong><br /> You can easily get started by creating a new Amazon S3 direct query data source for OpenSearch Service through the <a href=\"https://console.aws.amazon.com/aos\">AWS Management Console</a> or the API. Each new data source uses <a href=\"https://docs.aws.amazon.com/glue/latest/dg/start-data-catalog.html\">AWS Glue Data Catalog</a> to manage tables that represent S3 buckets. Once you create a data source, you can configure <a href=\"https://aws.amazon.com/s3\">Amazon S3</a> tables and data indexing and query data in OpenSearch Dashboards.</p> \n<p><strong>1. Create a data source in OpenSearch Service</strong><br /> Before you create a data source, you should have an OpenSearch Service domain with version 2.11 or later and a target Amazon S3 table in AWS Glue Data Catalog with the appropriate IAM permissions. IAM will need access to the desired S3 bucket(s) and read and write access to AWS Glue Data Catalog. To learn more about IAM prerequisites, see Creating a data source in the AWS documentation.</p> \n<p>Go to the <a href=\"https://console.aws.amazon.com/aos/home#opensearch/domains\">OpenSearch Service console</a> and choose the domain you want to set up a new data source for. In the domain details page, choose the <strong>Connections</strong> tab below the general information and see the <strong>Direct Query</strong> section.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/2023-opensearch-zeroETL-s3-1-new.jpg\" width=\"2560\" height=\"2017\" /></p> \n<p>To create a new data source, choose <strong>Create</strong>, input the name of your new data source, select the data source type as <strong>Amazon S3 with AWS Glue Data Catalog</strong>, and choose the IAM role for your data source.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/2023-opensearch-zeroETL-s3-2.png\" width=\"1674\" height=\"1156\" /></p> \n<p>Once you create a data source, you can go to the OpenSearch Dashboards of the domain, which you use to configure access control, define tables, set up log type–based dashboards for popular log types, and query your data.</p> \n<p><strong>2. Configuring your data source in OpenSearch Dashboards</strong><br /> To configure data source in OpenSearch Dashboards, choose <strong>Configure</strong> in the console and go to OpenSearch Dashboards. In the left-hand navigation of OpenSearch Dashboards, under <strong>Management</strong>, choose <strong>Data sources</strong>. Under <strong>Manage data sources</strong>, choose the name of the data source you created in the console.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/2023-opensearch-zeroETL-s3-3.png\" width=\"1578\" height=\"1072\" /></p> \n<p>Direct queries from OpenSearch Service to Amazon S3 use Spark tables within AWS Glue Data Catalog. To create a new table you want to direct query, go to the <strong>Query Workbench</strong> in the Open Search Plugins menu.</p> \n<p>Now run as in the following SQL statement to create <code>http_logs</code> table and run <code>MSCK REPAIR TABLE mys3.default.http_logs</code> command to update the metadata in the catalog</p> \n<pre><code>CREATE EXTERNAL TABLE IF NOT EXISTS mys3.default.http_logs (\n   `@timestamp` TIMESTAMP,\n    clientip STRING,\n    request STRING, \n    status INT, \n    size INT, \n    year INT, \n    month INT, \n    day INT) \nUSING json PARTITIONED BY(year, month, day) OPTIONS (path 's3://mys3/data/http_log/http_logs_partitioned_json_bz2/', compression 'bzip2')</code></pre> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/2023-opensearch-zeroETL-s3-4.png\" width=\"2182\" height=\"960\" /></p> \n<p>To ensure a fast experience with your data in Amazon S3, you can set up any of three different types of accelerations to index data into OpenSearch Service, such as skipping indexes, materialized views, and covering indexes. To create OpenSearch indexes from external data connections for better performance, choose the <strong>Accelerate Table</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/2023-opensearch-zeroETL-s3-5.png\" width=\"1096\" height=\"924\" /></p> \n<ul> \n <li>Skipping indexes allow you to index only the metadata of the data stored in Amazon S3. Skipping indexes help quickly identify data stored by narrowing down a specific location of where the data is stored.</li> \n <li>Materialized views enable you to use complex queries such as aggregations, which can be used for querying or powering dashboard visualizations. Materialized views ingest data into OpenSearch Service for anomaly detection or geospatial capabilities.</li> \n <li>Covering indexes will ingest all the data from the specified table column. Covering indexes are the most performant of the three indexing types.</li> \n</ul> \n<p><strong>3. Query your data source in OpenSearch Dashboards</strong><br /> After you set up your tables, you can query your data using <strong>Discover</strong>. You can run a sample SQL query for the http_logs table you created in AWS Glue Data Catalog tables.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/2023-opensearch-zeroETL-s3-6-new.jpg\" width=\"2156\" height=\"1440\" /></p> \n<p>To learn more, see Working with Amazon OpenSearch Service direct queries with Amazon S3 in the AWS documentation.</p> \n<p><strong><u>Join the preview</u></strong><br /> Amazon OpenSearch Service zero-ETL integration with Amazon S3 is now previewed in the AWS US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland) Regions.</p> \n<p>OpenSearch Service separately charges for only the compute needed as OpenSearch Compute Units to query your external data as well as maintain indexes in OpenSearch Service. For more information, see <a href=\"https://aws.amazon.com/opensearch-service/pricing/\">Amazon OpenSearch Service Pricing</a>.</p> \n<p>Give it a try and send feedback to the <a href=\"https://repost.aws/tags/TA6VFzFFY6QQa_KlHRKR-WsA/amazon-opensearch-service\">AWS re:Post for Amazon OpenSearch Service</a> or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"b7cc1e7a5f289925b3788705c686611dd2d6a4723e506b5e86e717092dbf24bf","category":"Tech"}