{"title":"Cytotoxicity and Chemotaxonomic Significance of Saponins from Wild and Cultured Asparagus Shoots","link":"https://www.preprints.org/manuscript/202406.0696/v1","date":1718100050000,"content":"Asparagus shoots are worldwide consumed, although most of such species have a restricted range, and several taxa still remain unstudied. In this work, a total of four taxa from different locations were scrutinized and compared with cultivated A. officinalis. All shoots were screened for saponins by LC-MS, and in vitro antiproliferative activities against the HT-29 colorectal cancer cell line (by MTT assay). The total saponins (TS) contained in the crude extracts ranged from 710.0 (A. officinalis) to 1258.6 mg/100 g dw (A. acutifolius). It stands out the richness of compounds detected in this work: a total of 47 saponins have been detected and quantified in the edible parts (shoots) of 5 taxa of Asparagus. The structure of all the saponins found present skeletons of the furostane and spirostane type. In turn, the structures with a furostane skeleton are divided into unsaturated and dioxygenated, both in the 20-22 position. The sum of dioscin and derivatives varied largely along the studied taxa. It reached the following percentages of TS: 27.11 (A. officinalis), 18.96 (A. aphyllus), 5.37 (A. acutifolius), and 0.59 (A. albus), while in A. horridus such compound remains undetected. Aspachiosde A, D, and M varied largely among samples, while a total of seven aspaspirostanosides were characterized in the analyzed species. Hierarchical cluster analysis of the saponin profiles clearly separated the various taxa and demonstrated that the taxonomic position is more important than the place from which the samples were acquired. Thus, saponin profiles have chemotaxonomic significance in Asparagus taxa. The MTT assay showed dose- and time-dependent inhibitory effects of several saponins extracts on HT-29 cancer cells, standing out the cell growth inhibition exercised by A. albus and A. acutifolius (GI50 of 125 and 175 µg/mL). This work constitutes a whole approach to evaluate the saponins from shoots of different Asparagus taxa and provide arguments for use them as functional foods.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b7d0253091737f68fea5e2fa9678026928eb848a22a79c42759741547b19ba77","category":"Interdisciplinary"}