{"title":"444 The effects of increasing standardized ileal digestible lysine-to-net energy ratio during at 24-day lactation period on primiparous sow nitrogen utilization and lactation performance","link":"https://academic.oup.com/jas/article/102/Supplement_3/255/7757385?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Primiparous sows (n = 50) were used to evaluate the impacts of increasing standardized ileal digestible (SID) Lys-to-net energy (NE) ratios on sow performance and nitrogen utilization during a 24-d lactation period. Sows were assigned to one of five diets with equally spaced and increasing SID Lys-to-NE ratios between 2.85 and 5.51 g SID Lys/Mcal NE. Desired ratios were achieved by blending the two extreme diets in varying proportions using a feeding system with feed blending capabilities and were provided to sows immediately after farrowing until weaning (d 24 ± 0.3). Litters were standardized to 13 ± 1 piglets within 24 h after birth and were not provided creep feed. Nitrogen balances were conducted between d 4 and 7 (NB1), 12 and 15 (NB2), and 20 and 23 (NB3) of lactation, with total urine collection and fecal grab sampling. Contrast statements were used to assess linear and quadratic effects of increasing the SID Lys-to-NE ratio. Linear (LBL) and quadratic broken-line and polynomial quadratic models were used to determine the optimum dietary Lys-to-NE ratios for maternal nitrogen retention. The Bayesian information criterion was used to assess best fit. Sow body weight (BW) and backfat depth losses over lactation decreased with increasing dietary SID Lys-to-NE ratio (linear; -19.0 to -5.9 ± 3.7 kg, <span>P</span> = 0.001 and -3.9 to -2.0 ± 0.7 mm, <span>P</span> = 0.003, respectively). No differences were observed for milk nitrogen output (69.3 ± 4.5, 74.2 ± 6.6, 85.6 ± 6.8 g/day for NB1, NB2, and NB3, respectively), overall piglet average daily gain (219 ± 10 g), and piglet BW at weaning (6.33 ± 0.24 kg). Sow average daily feed intake was not influenced by SID Lys-to-NE ratio (5.3 ± 0.2 kg/day) but sow nitrogen intake (linear; <span>P</span> &lt; 0.001) and total nitrogen excretion (urine + feces; linear; <span>P</span> &lt; 0.001) increased with dietary SID Lys-to-NE ratio in all NB periods. Nitrogen retention (linear; <span>P</span> &lt; 0.001) and maternal nitrogen retention (nitrogen intake – nitrogen excretion – milk nitrogen output; <span>P</span> &lt; 0.05) increased with dietary SID Lys-to-NE ratio in all NB periods (-22.8 to -2.7 ± 6.7, 3.6 to 36.3 ± 8.4, and 9.0 to 34.8 ± 6.8 g/d for maternal nitrogen retention in NB1, NB2, and NB3, respectively). The LBL model showed that maternal nitrogen retention was optimized beyond the SID Lys-to-NE ratio limits in NB1 but breakpoints were observed for maternal nitrogen retention at 4.74 and 4.85 g SID Lys/Mcal NE in NB2 and NB3, respectively. Therefore, optimizing the SID Lys-to-NE ratio during specific weeks of lactation could minimize maternal nitrogen losses of primiparous sows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b7eaf893f7902f6ecce4d0feaa715436390adad2f9cd7a9cf1e80cbaafd4c342","category":"Environment"}