{"title":"AirTag: Everything you need to know about Apple’s tracking device","link":"https://www.macworld.com/article/343664/airtags-price-release-date-specs-features-privacy.html","date":1619801048000,"content":"\n<div>\n<section><div></div></section><p>Apple recently <a href=\"https://www.macworld.com/article/342763/apple-opens-up-its-find-my-network-to-third-party-devices-no-airtag-needed.html\">opened up its Find My network</a> to third-party device makers, but that’s not stopping the company from making its own item tracker. We’ve heard <a href=\"https://www.macworld.com/article/234037/apple-airtags-bluetooth-track-find-my-ultrawide-band-u1-keychain-locate-lost-items.html\">rumors about AirTag</a> since around 2019, and the company has finally released them. They’re pretty simple, really: You add the AirTag to your account, attach it to some object, and then the Find My app will tell you where it is in the Items tab.</p>\n\n\n\n<hr /><p><em><a href=\"https://www.macworld.com/article/344113/airtag-reviews-roundup-they-work-well-but-scratch-easily.html\">You can preorder an AirTag tracker at 5 am PT. Here’s how to get one before they inevitably sell out.</a></em></p>\n\n\n\n<hr /><p>Since nearly all modern Apple products can passively (and privately) use their Bluetooth radios to locate lost devices, you’ll have a pretty good chance of locating something that you accidentally leave somewhere. You can locate devices in real time, and also set a device to “Lost Mode,” which will notify you and display an optional phone number and message on the screen of whatever Apple got near enough to “find” it.</p>\n\n\n\n<p>Here’s what you need to know about Apple’s own tracking devices.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>AirTag</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/airtags-front-back.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tMSRP:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t1 pack $29 | 1 pack $99\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-airtag/airtag&amp;subid1=1-1-343664-0-0-0\" target=\"_blank\">US$29 at Apple</a> | <a href=\"https://www.amazon.com/dp/B0933BVK6T?tag=macworld05-20&amp;#038;linkCode=ogi&amp;#038;th=1&amp;#038;psc=1&amp;ascsubtag=1-1-343664-0-0-0\" target=\"_blank\">$29.00 at Amazon</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<h2>AirTag costs $29 each</h2>\n\n\n\n<p>Little Bluetooth trackers are nothing new. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thetileapp.com/&amp;xcust=1-1-343664-0-0-0&amp;sref=https://www.macworld.com/feed\">Tile</a> has been making them for years, and Apple even just announced that the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://chipolo.net/en-us/pages/chipolo-one-spot&amp;xcust=1-1-343664-0-0-0&amp;sref=https://www.macworld.com/feed\">Chipolo One Spot</a>, coming in June, would support the Find My network. If you want an item tracker, what you care about are things like size, durability, the scale of the network, and price. </p>\n\n\n\n<p>Apple’s first-party trackers cost $29 each. That’s even less than the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thetileapp.com/en-us/store/tiles/pro&amp;xcust=1-1-343664-0-343670-15156&amp;sref=https://www.macworld.com/feed\">$35 Tile Pro</a> and about on par with Samsung’s Galaxy SmartTag+. Apple lets you buy a four-pack for $99. Orders start on Friday, April 23, 2021, and they ship on April 30.</p>\n\n\n\n<h2>You use the Find My app</h2>\n\n\n\n<p>You don’t need a new app to use AirTag. They’ll show up as Items in the Find My app, newly updated for anyone with iOS 14.3, iPadOS 14.3, and macOS Big Sur 11.1.</p>\n\n\n\n<h2>AirTag require an iPhone, iPad, or iPod Touch</h2>\n\n\n\n<p>Though Find My works on a Mac, and MacBooks are a part of the Find My network, you’ll need an iPhone or iPod Touch running iOS 14.5 or later, or iPad running iPadOS 14.5 or later in order to set up your AirTag.</p>\n\n\n\n<p>Once set up, AirTag work with all modern Apple devices, including iPhones, iPads, iPod Touch devices, and MacBooks. You’ll be able to use Find My on all these devices to locate the objects you’ve attached an AirTag to. What’s more, all these devices are used to create the Find My network—hundreds of millions of Apple devices that all register the locations of your items whenever they pass within Bluetooth range.</p>\n\n\n\n<h2>The U1 chip allows for Precision Finding</h2>\n\n\n\n<p>You don’t need an iPhone with the U1 chip (the iPhone 11 or iPhone 12) in order to use AirTags. But if you have one, you can use a feature called Precision Finding. It uses the accelerometer, cameras, and more to direct you to the exact location of your tag. An arrow appears on the screen to show the direction and distance.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/precision-finding-airtags.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption>On iPhones with a U1 chip, you can get precise and direct directions to your AirTag.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>AirTag protects your privacy</h2>\n\n\n\n<p>As is true with all devices on the Find My network—from iPhones to e-bikes—there is no personally-identifiable information shared with anyone at any time. Apple uses end-to-end encryption and unique random identifiers, so it never knows which devices belong to which people. Only your devices know which identifiers are yours. What’s more, Apple only sends location information when it’s requested and only retains it for 24 hours. Unless you have Lost Mode enabled, other users never know which devices they have come across. </p>\n\n\n\n<p>Learn more about <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212037&amp;xcust=1-1-343664-0-0-0&amp;sref=https://www.macworld.com/feed\">Find My and privacy on Apple’s support site</a>.</p>\n\n\n\n<h2>You can personalize your AirTag</h2>\n\n\n\n<p>When you order your AirTag, you can personalize each tag with free engraving, including 31 different Emoji.</p>\n\n\n\n<h2>AirTag holders cost more than AirTag</h2>\n\n\n\n<p>AirTag has no holes or clips or other means of attaching to your devices. Don’t worry, Apple will sell you one! The least expensive of which is the Polyurethane Loop (in four colors), which costs $29. The Leather Key Ring costs $35 and comes in three colors, and the Leather Loop comes in two colors and costs $39. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/airtag-leather-key-ring.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption>The Apple Leather Key Ring costs $35—more than the AirTag itself.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>There will probably be a large third-party market of AirTag holders, clips, loops, and other attachment devices that are more affordable.</p>\n\n\n\n<h2>How to setup AirTag</h2>\n\n\n\n<p>AirTag is really easy to set up. Here are the steps. You can also see how it’s done in the video below.</p>\n\n\n\n<ol><li>When you take the AirTag out of the box it has an insert to prevent the battery from connecting. Once you remove the insert, the battery connects and AirTag turns on.</li><li>Place the AirTag near your iPhone, and the iPhone will sense it and automatically launch the setup process.</li><li>Give the AirTag a name.</li><li>Register with your Apple ID.</li><li>AirTag is all set. Now attach it to your item.</li></ol><figure><div>\n\n</div></figure></div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b7f894ac71bd686702f5b4e4a7cb19d1fb8705efaa8b2911484e8cc3d0d20ed0","category":"Apple"}