{"title":"Zwift Hardware Tidbits: Breaking Steering, Apple TV 2021 Updates, New Non-Supported Trainers List","link":"https://www.dcrainmaker.com/2021/06/zwift-hardware-tidbits-breaking-steering-apple-tv-2021-updates-new-non-supported-trainers-list.html","date":1623875035000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2020/08/DSC_7102_thumb.jpg\" /></p>\n<p>This post is a collection of randomly interesting Zwift hardware things. Sure, Zwift is often updating software related stuff. But more quietly they’re also making changes behind the scenes on hardware – some of which good, and some of which, well…aren’t. So, I figured I’d round them up together here.</p>\n<p>In effect, this post could be titled: As the Zwift Hardware World Turns – The Good, the Bad, and the Ugly.</p>\n<h3><span>Steering Breakage:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2020/08/DSC_7563_thumb.jpg\" /></p>\n<p>I could have titled section all sorts or of things, all of which would have been true:</p>\n<p>A) Elite Sterzo Requires Firmware Update<br />\nB) Zwift Breaks Wahoo KICKR Bike Steering Again<br />\nC) Zwift Breaks TrueBike Steering<br />\nD) Zwift forces Elite Sterzo Update<br />\nE) Zwift Change Steering Protocol to Break Kommander<br />\nF) Zwift’s Cat &amp; Mouse Attempt Already Out-Moused</p>\n<p>So, for those playing catch-up on the Zwift steering saga, essentially, Zwift had an exclusivity agreement with Elite for non-smart bike steering <a href=\"https://www.dcrainmaker.com/2020/08/zwift-steering-elite-sterzo-smart.html\">on the Sterzo Smart</a>. That expired in April. Additionally, with smart bikes, they too had to pay Zwift a licensing fee so you could use your smart bike and steer with Zwift. However, even when companies begrudgingly agreed to this fee, Zwift dragged their heals on them (or didn’t respond at all). So, companies like <a href=\"https://www.dcrainmaker.com/2021/02/kommander-review-zwift-control-for-your-handlebars.html\">Titan Labs made Kommander</a>, a little accessory that figured out the Zwift steering protocol and replicated it. <a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\">TrueKinetix did the same</a>, leveraging Titan’s published work, and let the TrueBike steer with.</p>\n<p>However, Zwift has decided to break the existing protocol they established with Elite and the Sterzo Smart, forcing all users to upgrade their Sterzo Smart firmware if they want to continue steering in Zwift. However, it’s somewhat funny that Zwift tries to throw this on Elite. After all, there’s exactly *ZERO* reason technical why Zwift needs to break backwards compatibility with the current firmware. Though, <a href=\"https://forums.zwift.com/t/update-firmware-on-elite-sterzo-smart-june-2021/550937/16\">after pressed in a thread</a> by other users, I’ll at least give Zwift props to admitting that the reason they’re doing is to break companies/people using the existing protocol without paying Zwift’s licensing fee:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-41.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-40.png\" /></a></p>\n<p>I mean, ignoring the fact that nobody was selling ‘Fake Sterzos’. They were selling products that were not called Sterzos, but used the published protocols to do so.</p>\n<p>Nonetheless, here’s the thing that’s stupid about this entire thing: It’s only a self-inflicted wound against Zwift’s own technologies. Despite being a year old, there’s virtually zero meaningful adoption of steering in Zwift events. The reason? Well, actually, there’s two reasons:</p>\n<p>A) Zwift decided to set to default off steering for events, thus, almost no events use/allow it.<br />\nB) Zwift dragged their heals on all the other smart bike that wanted to implement it.</p>\n<p>Typically speaking, people paying $3,000 for a Zwift-compatible smart bike are *YOUR BEST CUSTOMERS*, and also, typically speaking, the most willing to try new technologies. What Zwift failed to understand here, is that the more people that get this onboard, the more people will that will use it, and oddly enough, the more people that will buy Elite Sterzo Smart’s. It’s a hilariously simple revenue circle.</p>\n<p>But setting that aside, the lack of open steering API sucks, and is counter to everything Zwift bases their success on. The *ONLY* reason Zwift can exist successfully as a company at scale is because of open standards for ANT+ FE-C and later, Bluetooth FTMS. So much so that Zwift eventually ceased supporting new companies wanting to do one-off protocols to their platform, because it wasn’t scalable. They embraced standards back then, because it was the only business option.</p>\n<p>Said differently: Zwift is still holding hostage the very companies that make Zwift successful and viable, and in the process, holding their customers hostage. All for what is a silly meaningless amount of revenue for Zwift. They’ve literally spent more time breaking steering than making it work. In fact, yesterday’s update to implement this had a secondary side casualty: It broke <a href=\"https://zwiftinsider.com/update-1-14-0-72262/\">Wahoo KICKR Bike steering</a> (again), for <a href=\"https://www.dcrainmaker.com/2021/01/zwift-rolls-out-steering-to-wahoo-kickr-smart-bike.html\">all those users</a>.</p>\n<p>For real, I can’t make this stuff up.</p>\n<h3><span>Apple TV 2021 Update:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4761_thumb.jpg\" /></p>\n<p>I’m gonna make this one quick. Remember when Apple released their <a href=\"https://www.dcrainmaker.com/2021/05/zwift-edition-different.html\">Apple TV 2021 4K model about a month ago</a>? In short, it ended up being a worse Zwift experience than the existing Apple TV 4K. That wasn’t (initially) entirely Zwift’s fault. I can’t blame them for that – that’s on Apple. Apple releases new hardware and virtually nobody gets access to it ahead of time. So everyone has to play whack-a-mole afterwards.</p>\n<p>So in essence, since Zwift didn’t have that hardware, it defaulted to a lower graphics profile, removing things like building shadows and a few other minor things. But yeah, it wasn’t ideal. Atop that, the new dedicated navigation buttons didn’t work at all within Zwift. Again, we can’t really blame Zwift there either, since they lacked hardware to test it.</p>\n<p>Fast forward a few weeks and Zwift has dropped a new version of Zwift for Apple TV, which fixes the graphics issue – essentially making it the same as the previous Apple TV 4K version. You can see the building shadows are back in this ride from last week I did:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image001-4.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image001_thumb-4.jpg\" /></a></p>\n<p>However, the so-called D-pad buttons (dedicated buttons) are still not active. Given other developers (other companies) sound like they’re struggling with implementation there as well, this might be a longer term type item.</p>\n<p>That said, everything is a wash now. Thus, there’s no reason not to get the new version if you’re in the market. Eventually Zwift will make those dedicated buttons work and life will be grand, but for now you’re no worse than before (but get all the other non-Zwift benefits of the newer Apple TV model). As for upgrading from an existing Apple TV 4K to new Apple TV 2021 4K? Nah, not worth it. I won’t be upgrading the rest of my Zwift or non-Zwift units. If you have specific things non-Zwift features you want, then sure, but none of those matter to me at this point.</p>\n<h3><span>Zwift’s New Non-Supported List:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0015-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0015_thumb-1.jpg\" /></a></p>\n<p>Two weeks ago Zwift quietly posted an article that noted they’ll <a href=\"https://forums.zwift.com/t/discontinuing-official-support-for-least-used-devices-june-2021/549180\">stop supporting certain trainers from November 30th, 2021</a>. Except, they…umm…didn’t bother to list which trainers are going off the list. Instead, they outlined a slew of questions, indicating that you’re SOL if a new bug is introduced that breaks your trainer:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-42.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-41.png\" /></a></p>\n<p>Linked above is the <a href=\"https://support.zwift.com/en_us/supported-trainers-BkPlq7gr\">list of supported trainers</a>. Except, as I’ve outlined previously, that list is a proper dumpster fire. I mean, not like Shimano/Pioneer bike computer level dumpster fire (that’s more like the entire trash facility went ablaze). But nonetheless, the Zwift trainer compatibility list is hot garbage. Mainly, because it can’t be trusted. There’s numerous inconsistencies in certification levels (take a look at the Tacx NEO 2 vs 2T for fun), functional levels, and even what they call the darn things.</p>\n<p>Now again, despite posting this long thing above, they don’t actually list which trainers they’re removing support for. Though, they do randomly throw Elite under the bus in a Q&amp;A question:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-43.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-42.png\" /></a></p>\n<p>It’s like someone talking to a room and saying “Now, we don’t know who stole the cookie, right Jenny? Do we Jenny?!?”. Meanwhile, Jenny hates cookies.</p>\n<p>But, let’s look at a real-world example of this. Right now I’m testing the JetBlack VOLT. It’s hardly new, and has been on the market for a number of months. Yet, here’s the JetBlack section for direct drive trainers (it lacks any reference to anything other than a single older model):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-44.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-43.png\" /></a></p>\n<p>Yet, in the most recent Game Updates, they clearly talk about fixing bugs of their own with the JetBlack units, and even use the plural of it – implying they know more than one trainer exists. So why isn’t it listed above?</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-45.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-44.png\" /></a></p>\n<p>How are consumers supposed to use that list if it can’t even be kept halfway up to date. The last time I pointed this out, it resulted in changes within 24 or so hours. So, let’s see if it fixes things this time.</p>\n<p>Speaking of which, fun little Easter egg tossed in here. While <a href=\"https://www.dcrainmaker.com/2021/03/zwift-plans-three-at-home-fitness-hardware-products.html\">Zwift has acknowledged numerous times in numerous places</a> they were building their own hardware – and even alluded specifically to a smart bike, they did yet include specifically that they’re working on their own trainer. So funny for them to out themselves here, but also not answer their own question.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-46.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-45.png\" /></a></p>\n<p>Of course, a trainer makes sense. I’ve argued that they basically will probably roll out three levels of hardware:</p>\n<p>A) High end smart-bike<br />\nB) Mid-high end trainer (a KICKR competitor)<br />\nC) Low-end offering</p>\n<p>I could see the smart-bike being splintered into high and mid-range offering ala Peloton (Bike &amp; Bike+), but probably not at launch.</p>\n<p>In any case, my point here with pounding on about this, is lists like these matter. They drive peoples purchasing decisions. And at the moment, Zwift is 100% dependent on their 3rd party partners for their hardware and people using it in game. If someone finds the JetBlack Volt (which based on my early testing seems like a really compelling unit), then goes and finds this list but doesn’t find it there, they’ll question a purchase – even if it works perfectly fine with Zwift.</p>\n<p>To be clear: I’m totally OK with a rational list of non-supported trainers – that’s a proper adult-like thing for a company to do. But, you know, actually have the list. And then for the list of supported trainers, actually update it properly.</p>\n<p>–</p>\n<p>With that, I’ll leave you to enjoy the rest of your day. Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"b7fb9cdd71698ff8b756f4a81832264e87b912ad730a046e2f30d957e5903725","category":"Cycling"}