{"title":"Shock indices are associated with in-hospital mortality among patients with septic shock and normal left ventricular ejection fraction","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298617","date":1710252000000,"content":"<p>by Kyu Jin Lee, Yong Kyun Kim, Kyeongman Jeon, Ryoung-Eun Ko, Gee Young Suh, Dong Kyu Oh, Sung Yoon Lim, Yeon Joo Lee, Su Yeon Lee, Mi-Hyeon Park, Chae-Man Lim, Sunghoon Park, on behalf of the Korean Sepsis Alliance (KSA) investigators </p>\r\nBackground <p>The understanding of shock indices in patients with septic shock is limited, and their values may vary depending on cardiac function.</p> Methods <p>This prospective cohort study was conducted across 20 university-affiliated hospitals (21 intensive care units [ICUs]). Adult patients (≥19 years) with septic shock admitted to the ICUs during a 29-month period were included. The shock index (SI), diastolic shock index (DSI), modified shock index (MSI), and age shock index (Age-SI) were calculated at sepsis recognition (time zero) and ICU admission. Left ventricular (LV) function was categorized as either normal LV ejection fraction (LVEF ≥ 50%) or decreased LVEF (&lt;50%).</p> Results <p>Among the 1,194 patients with septic shock, 392 (32.8%) who underwent echocardiography within 24 h of time zero were included in the final analysis (normal LVEF: n = 246; decreased LVEF: n = 146). In patients with normal LVEF, only survivors demonstrated significant improvement in SI, DSI, MSI, and Age-SI values from time zero to ICU admission; however, no notable improvements were found in all patients with decreased LVEF. The completion of vasopressor or fluid bundle components was significantly associated with improved indices in patients with normal LVEF, but not in those with decreased LVEF. In multivariable analysis, each of the four indices at ICU admission was significantly associated with in-hospital mortality (P &lt; 0.05) among patients with normal LVEF; however, discrimination power was better in the indices for patients with lower lactate levels (≤ 4.0 mmol/L), compared to those with higher lactate levels.</p> Conclusions <p>The SI, DSI, MSI, and Age-SI at ICU admission were significantly associated with in-hospital mortality in patients with septic shock and normal LVEF, which was not found in those with decreased LVEF. Our study emphasizes the importance of interpreting shock indices in the context of LV function in septic shock.</p>","author":"Kyu Jin Lee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b7ffacd4c0d5e20c7d1d50941231f60e1ab07dcfa726ff7b2d96bc56ad7b4b3b","category":"Interdisciplinary"}