{"title":"PSA: Reddit is Forcing Users to Accept Personalized Ads","link":"https://www.macrumors.com/2023/09/28/reddit-personalized-ads/","date":1695932467000,"content":"Reddit <a href=\"https://www.reddit.com/r/reddit/comments/16tqihd/settings_updateschanges_to_ad_personalization/\">this week announced</a> that it will no longer allow Reddit users to opt out of ad personalization, which means that ads on the platform will be targeted based on site usage.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/04/reddit-app-icon.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nRight now, users can choose to toggle off an option to \"personalize ads based on your Reddit activity and account info,\" but this toggle is being removed going forward. Reddit claims that it requires \"very little personal information\" and the change will be able to predict ads that are more relevant to each person.<blockquote>Reddit requires very little personal information, and we like it that way. Our advertisers instead rely on on-platform activity--what communities you join, leave, upvotes, downvotes, and other signals--to get an idea of what you might be interested in.\r<br />\n\r<br />\nThe vast majority of redditors will see no change to their ads on Reddit. For users who previously opted out of personalization based on Reddit activity, this change will not result in seeing more ads or sharing on-platform activity with advertisers. It does enable our models to better predict which ad may be most relevant to you.</blockquote>Reddit claims that the \"vast majority\" of Reddit users will not see changes to their ads, nor will users be seeing more ads. With no option to opt-out of ad personalization, Reddit is adding new toggles to limit ads from specific categories, including Alcohol, Dating, Gambling, Pregnancy &amp; Parenting, and Weight Loss. Machine learning will be used to classify ads, so users will not be able to opt out of these ad categories entirely.\r<br />\n\r<br />\nIn select countries, the option to turn off ad personalization will remain, allowing Reddit to continue to comply with GDPR restrictions. Reddit users without the option to turn off ad targeting can expect to see ads that are based on subreddits they belong to, content that is upvoted, and more.\r<br />\n\r<br />\nReddit earlier this year made changes to <a href=\"https://www.macrumors.com/2023/06/08/apollo-shutting-down-june-30/\">the cost of its API</a>, cutting out <a href=\"https://www.macrumors.com/2023/06/30/apollo-app-shutting-down-today/\">almost all third-party apps</a> and forcing the majority of users to view Reddit on the website or on the Reddit app, both of which support ads.\r<br />\n\r<br />\nReddit says that these ad changes started rolling out yesterday.<div>Tag: <a href=\"https://www.macrumors.com/guide/reddit/\">Reddit</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/28/reddit-personalized-ads/\">PSA: Reddit is Forcing Users to Accept Personalized Ads</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-reddit-is-forcing-users-to-accept-personalized-ads.2405359/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b801788bae35de2f56f41e47f32d00cb0593c5f578fbc7ce0e0e8e75da4733cc","category":"Apple"}