{"title":"A twin-driven analysis on early aging biomarkers and associations with sitting-time and physical activity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308660","date":1726063200000,"content":"<p>by Ryan Bruellman, Shandell Pahlen, Jarrod M. Ellingson, Robin P. Corley, Sally J. Wadsworth, Chandra A. Reynolds</p>\r\nBackground <p>Current physical activity guidelines may be insufficient to address health consequences in a world increasing in sedentary behavior. Physical activity is a key lifestyle factor to promote healthy aging, but few studies examine activity in conjunction with sitting. We examine how activity intensity and sitting behavior influence health and the extent to which physical activity might counter sitting.</p> Methods <p>We analyzed data from the Colorado Adoption/Twin Study of Lifespan behavioral development and cognitive aging (CATSLife) in adults aged 28–49 years (M = 33.16, SD = 4.93). We fit a linear mixed-effect model for body mass index (BMI) and total cholesterol/high-density lipoprotein ratio (TC/HDL). Leveraging the co-twin control approach, we explore the trade-off between sitting and physical activity.</p> Results <p>Across established adulthood, TC/HDL and BMI demonstrated increasing age trends with prolonged sitting and vigorous activity inversely associated. Moreover, after considering sitting time, we found an age-equivalent benefit of vigorous exercise where those performing 30 minutes daily had expected TC/HDL and BMI estimates that mirrored sedentary individuals 5 and 10 years younger, respectively. Co-twin control analysis suggests partial exposure effects for TC/HDL, indicating greater vigorous activity may counter sitting-health effects but with diminishing returns.</p> Conclusions <p>Our findings support the counteracting influence of prolonged sitting and physical activity on indicators of cardiovascular and metabolic health. A compensating role of vigorous activity on sitting health links is indicated while reducing sitting time appears paramount. Public health initiatives should consider sitting and vigorous activity in tandem in guidelines to promote health maintenance and combat accelerated aging.</p>","author":"Ryan Bruellman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b8022f402b166ce220c0b6989c697d9006a299f0074a965928cfb7ae71374195","category":"Interdisciplinary"}