{"title":"New data-driven equation for estimating total sediment loads in rivers: application of the MHBMO algorithm","link":"http://link.springer.com/10.1007/s11600-023-01196-0","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Knowing the amount of sediment transported in rivers is important in river and hydraulic engineering. In essence, sediment transport process is very complex, whose direct measurement is not only challenging but also costly. In this regard, several equations have been developed to estimate sediment discharge, while their estimations may be an order of magnitudes different from one another under specific circumstances. In a bid to improve the estimation of sediment transport, this study proposed a new data-driven equation based on 543 reliable field measurements at 25 rivers using the Modified honey bee mating optimization (MHBMO) algorithm. The data include mean flow velocity, water surface slope, mean flow depth, median particle size, water surface width, suspended load, and bed load measured in the field. The performance of the new equation was compared to those of Yang, Engelund and Hansen, Shen and Hung, and Ackers and White using 6 metrics. Moreover, another nature-inspired optimization algorithm, i.e., genetic algorithm (GA) was employed to enhance the comparison. Based on the results, the MHBMO-based equation outperformed other estimation models and served as the best method in the ranking analysis. For instance, it improves the determination coefficient of Yang’s equation, which is one of the widely-used equations recommended by the United States Bureau of Reclamation by 15.2%. Despite being ranked the second, the GA-based equation was only marginally less precise than the MHBMO-based model. Furthermore, the sensitivity analysis indicates that the sediment load is mostly sensitive to mean flow depth. Finally, it is postulated that applications of nature-inspired algorithms can help to improve the estimation of sediment transport.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"b806223f910672724bef0f65e6fb63a3a2e95d116ffa6669f72547bb3cc98d91","category":"Environment"}