{"title":"รู้จักกับ False Base Station การโจมตีเครือข่ายโทรศัพท์มือถือที่ถูกใช้งานเป็นวงกว้าง","link":"https://www.blognone.com/node/134042","date":1685191108000,"content":"<div><div><div><p>การสื่อสารผ่านโทรศัพท์มือถือบนเครือข่ายดิจิทัลนั้นมีการพัฒนามายาวนาน และมาตรฐานหลายตัวที่ออกมานับสิบปีแล้วก็ยังคงมีอุปกรณ์รองรับอยู่แม้มาตรฐานใหม่ๆ จะแก้ไขไปมากแล้ว สัปดาห์ที่ผ่านมากองบัญชาการตำรวจสืบสวนสอบสวนอาชญากรรมทางเทคโนโลยี (บก.สอท.) ก็ประกาศจับกุมกลุ่มคนร้ายที่อาศัยการโจมตีด้วยการตั้งสถานีปลอม (False Base Station) เพื่อยิง SMS เข้าไปยังโทรศัพท์มือถือโดยตรง ในบทความนี้จะมาสำรวจถึงการโจมตีรูปแบบนี้</p>\n<p>การตั้งสถานีปลอมมีชื่อเรียการโจมตีหลากหลาย เช่น false base station, IMSI catcher, Stingray, rogue base station, cell-site simulator โดยแนวทางการโจมตีเหมือนกันหมด คือคนร้ายพยายามตั้งเสาสัญญาณโทรศัพท์มือถือ ปลอมตัวเป็นเครือข่ายโทรศัพท์มือถือเพื่อ ในกรณีของไทยที่เป็นข่าวใหญ่เนื่องจากคนร้ายสามารถส่ง SMS เข้ามาโดยไม่ต้องใช้ซิม แต่<a href=\"https://www.3gpp.org/ftp/Inbox/SA3/Inbox/drafts/draft_S3-190960-TR33.809%20rev.doc\">รายงานของ 3GPP ระบุถึงแนวทางการโจมตีว่าคนร้ายอาจจะต้องการผล 1 ใน 4 รูปแบบ</a> ได้แก่</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/02598ed8a923bf778704f2dde516c4bf.png\" /></p>\n<ol>\n<li>โจมตีโทรศัพท์ไม่ให้เชื่อมต่อเครือข่ายใดๆ</li>\n<li>โจมตีเครือข่าย ไม่ให้สามารถให้บริการโทรศัพท์ได้ตามปกติ</li>\n<li>แทรกบริการของตัวเอง เช่น โทรศัพท์, SMS เข้าไปยังโทรศัพท์มือถือ (ข่าวของไทยโดนโจมตีรูปแบบนี้)</li>\n<li>ดึงข้อมูลส่วนตัวผู้ใช้ ทำให้สามารถติดตามได้ว่าโทรศัพท์เครื่องใดอยู่ตำแหน่งใดบ้าง เป็นรูปแบบที่มีรายงานว่า<a href=\"https://en.wikipedia.org/wiki/Stingray_use_in_United_States_law_enforcement\">ตำรวจสหรัฐฯ ใช้งานอย่างต่อเนื่องตั้งแต่ปี 1995</a></li>\n</ol>\n<p>คนร้ายที่โจมตีแบบ FBS อาศัยการยิงสัญญาณที่แรงกว่าเสาสัญญาณของจริง ทำให้ตัวโทรศัพท์มือถือตัดสินใจที่จะเชื่อมต่อไปยังเสาปลอมแทน <a href=\"https://www.usenix.org/system/files/sec19-yang-hojoon.pdf\">เคยมีการศึกษา</a>ว่าหากคนร้ายส่งสัญญาณแรงกว่าเสาสัญญาณจริง 35dB ก็จะมีอัตราการล่อโทรศัพท์มือถือให้เข้ามาเชื่อมต่อสำเร็จที่ 80% และหากแรงกว่าเสาจริง 40dB ก็จะล่อสำเร็จ 100%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/758ace7134035acf3f221ea4f394e11f.jpg\" /></p>\n<p>เครื่อง Stingray โดย Harris Corporation ขายให้กับหน่วยงานรัฐ เป็นที่มาของชื่อเรียกการโจมตีรูปแบบนี้ว่า Stingray</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d197db7134032b7598d3413f8705434e.png\" /></p>\n<p>หลังจากคนร้ายสามารถล่อให้เหยื่อเชื่อมต่อแล้ว หากคนร้ายต้องการเพียงหมายเลขประจำตัวซิมของเหยื่อ (IMSI) ก็จะสามารถปลอมเป็นเสา 3G หรือ 4G ได้เลย แต่หากต้องการดักฟังการเชื่อมต่อ ปลอมตัวเป็นเสาสัญญาณโทรศัพท์มือถือและแทรกข้อมูลเข้าไป คนร้ายต้องบังคับให้เหยื่อเชื่อมต่อแบบ 2G หรือ GSM <a href=\"https://www.eff.org/wp/gotta-catch-em-all-understanding-how-imsi-catchers-exploit-cell-networks#fnref5\">เนื่องจาก GSM อนุญาตให้เชื่อมต่อแบบไม่เข้ารหัส</a> หรือใช้กระบวนการเข้ารหัสที่อ่อนแอเพียงพอที่จะแฮกได้โดยง่าย</p>\n<p>3GPP ตระหนักว่ามีการโจมตี FBS มานาน และพยายามออกมาตรฐานใหม่ๆ เพื่อปิดช่องโหว่นี้ <a href=\"https://www.ericsson.com/en/blog/2019/1/3gpp-release15\">มาตรฐาน 3GPP Release 15 สำหรับ 5G ออกมาตั้งแต่ปี 2018</a> เพิ่มฟีเจอร์ความเป็นส่วนตัวขึ้นอีกหลายอย่าง โดยเฉพาะการปิดบังหมายเลขประจำตัวซิม (ใน 5G เรียกว่า Subscriber Permanent Identifier - SUPI) โดยเครือข่ายสามารถใช้งาน SUCI (Subscription Concealed Identifier) แทนได้ และยังมีเฟรมเวิร์คสำหรับตรวจหาเสาสัญญาณปลอม โดยขอข้อมูลสัญญาณวิทยุจากโทรศัพท์เอง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0d6b6ffb1ae893e724458ef3a243962c.jpg\" /></p>\n<p>สำหรับการป้องกันการโจมตีจาก FBS นั้นอาจจะเลือกป้องกันตัวเองได้หลายระดับ เช่น การปิดใช้งาน 2G เพื่อป้องกันการถูกแทรก SMS หรือหากต้องการการป้องกันมากกว่านั้นสามารถเปิดใช้ 5G SA พร้อมฟีเจอร์ SUCI ซึ่งจำเป็นต้องใช้งาน eSIM และ<a href=\"https://www.ais.th/5g/connectivity.html#connectivity_5gsa\">ยังรองรับเฉพาะโทรศัพท์บางรุ่นเท่านั้น</a></p>\n<p>อ่านเพิ่มเติม: รายงาน <a href=\"https://www.eff.org/wp/gotta-catch-em-all-understanding-how-imsi-catchers-exploit-cell-networks#fnref5\">IMSI Catcher ของ EFF</a>, <a href=\"https://www.cablelabs.com/blog/false-base-station-or-imsi-catcher-what-you-need-to-know\">Cable Labs</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gsm\">GSM</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b807bee41331655a4b8008b0d23aa93d00a1d13626565fe3196283d2684dbb58","category":"Thai"}