{"title":"New – Recycle Bin for EBS Snapshots","link":"https://aws.amazon.com/blogs/aws/new-recycle-bin-for-ebs-snapshots/","date":1638233196000,"content":"<p>It is easy to create <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSSnapshots.html\">EBS Snapshots</a>, and just as easy to either <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-deleting-snapshot.html\">delete them manually</a> or to use the <a href=\"https://aws.amazon.com/blogs/aws/new-lifecycle-management-for-amazon-ebs-snapshots/\">Data Lifecycle Manager</a> to delete them automatically in accord with your organization’s retention model. Sometimes, as it turns out, it is a bit <em>too</em> easy to delete snapshots, and a well-intended cleanup effort or a wayward script can sometimes go a bit overboard!</p> \n<p><span><strong>New Recycle Bin</strong></span><br /> In order to give you more control over the deletion process, we are launching a Recycle Bin for EBS Snapshots. As you will see in a moment, you can now set up rules to retain deleted snapshots so that you can recover them after an accidental deletion. You can think of this as a two-level model, where individual AWS users are responsible for the initial deletion, and then a designated “Recycle Bin Administrator” (as specified by an IAM role) manages retention and recovery.</p> \n<p>Rules can apply to all snapshots, or to snapshots that include a specified set of tag/value pairs. Each rule specifies a retention period (between one day and one year), after which the snapshot is permanently deleted.</p> \n<p><span><strong>Let’s Recycle!</strong></span><br /> I open the <a href=\"https://console.aws.amazon.com/rbin/home\">Recycle Bin Console</a>, select the region of interest, and click <strong>Create</strong> r<strong>etention rule</strong> to begin:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/29/rb_console_main_2.png\" /></p> \n<p>I call my first rule <strong>KeepAll</strong>, and set it to retain all deleted EBS snapshots for 4 days:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/02/rb_keepall_top_2.png\" />I add a tag (<strong>User</strong>) to the rule, and click <strong>Create retention rule</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/02/rb_keepall_bot_2.png\" /></p> \n<p>Because <strong>Apply to all resources</strong> is checked, this is a general rule that applies when there are no applicable rules that specify one or more tags.</p> \n<p>Then I create a second rule (<strong>KeepDev</strong>) that retains snapshots tagged with a <strong>Mode</strong> of <strong>Dev</strong> for just one day:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/02/rb_keepdev_top_4.png\" /></p> \n<p>If two different tag-based rules match the same resource, then the one with the longer retention period applies.</p> \n<p>Here are my retention rules:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_my_rules_1.png\" /></p> \n<p>Here are my EBS snapshots. As you can see, the first three are tagged with a <strong>Mode</strong> of <strong>Dev</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_my_snaps_1.png\" /></p> \n<p>In an effort to save several cents per month, I impulsively delete them all:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_delete_em_1.png\" /></p> \n<p>And they are gone:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_gone_1.png\" /></p> \n<p>Later in the day, a member of my developer team messages me in a panic and lets me know that they desperately need the latest snapshot of the development server’s code. I open the Recycle Bin and I locate the snapshot (<strong>DevServer_2021_10_6</strong>):</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_arbys_1.png\" /></p> \n<p>I select the snapshot and click <strong>Recover</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_recover_1.png\" /></p> \n<p>Then I confirm my intent:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_conf_recover_1.png\" /></p> \n<p>And the snapshot is available once again:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/07/rb_im_back_1.png\" /></p> \n<p>As has always been the case, <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-ebs-fast-snapshot-restore-fsr/\">Fast Snapshot Restore</a> is disabled when a snapshot is deleted. With this launch, it will remain disabled when a snapshot is restored.</p> \n<p>All of this functionality (creating rules, listing resources in the Recycle Bin, and restoring them) is also available from the CLI and via the <a href=\"https://docs.aws.amazon.com/recyclebin/latest/APIReference/Welcome.html\">Recycle Bin APIs</a>.</p> \n<p><span><strong>Things to Know</strong></span><br /> Here are a couple of things to know about the new Recycle Bin:</p> \n<p><strong>IAM Support</strong> – As I mentioned earlier, you can use <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> to grant access to this feature, and should consider creating an empowered user known as the Recycle Bin Administrator.</p> \n<p><strong>Rule Changes</strong> – You can make changes to your retention rules at any time, but be aware that the rules are evaluated (and the retention period is set) when you delete a snapshot. Changing a rule after an item has been deleted will not alter the retention period for the item.</p> \n<p><strong>Pricing</strong> – Resources that are in the Recycle Bin are charged the usual price, but be aware that creating rules with long retention periods could increase your AWS bill. On a related note, be sure that keeping deleted snapshots around does not violate your organization’s data retention policies. There is no charge for deleting or recovering a resource.</p> \n<p><strong>In the Bin</strong> – Resources in the Recycle Bin are immutable. If a resource is recovered, all of its existing metadata (tags and so forth) is also recovered intact.</p> \n<p><strong>Recycling </strong> – We will do our best to recycle all of the zeroes and all of the ones once when a resource in your Recycle Bin reaches the end of its retention period!</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"b80d6b450dead0705e25c267a709c8dfa82599005e295b667e69625288c3b75a","category":"Tech"}