{"title":"Tesla รายงานผลประกอบการไตรมาส ระบุกำลังพัฒนารถยนต์รุ่นใหม่ที่จะปฏิวัติกระบวนการผลิต","link":"https://www.blognone.com/node/137860","date":1706150247000,"content":"<div><div><div><p>Tesla รายงานผลประกอบการประจำไตรมาสที่ 4 ปี 2023 รายได้รวม 25,167 ล้านดอลลาร์ เพิ่มขึ้น 3% จากช่วงเดียวกันในปีก่อน กำไรสุทธิตามบัญชี GAAP 7,928 ล้านดอลลาร์ และมีกระแสเงินสดอิสระ 2,064 ล้านดอลลาร์</p>\n<p>Tesla ระบุในรายงานผลประกอบการว่าตอนนี้บริษัทกำลังโฟกัสการพัฒนารถยนต์รุ่นใหม่ ให้เข้าสู่ตลาดโดยเร็วที่สุดเท่าที่ทำได้ ซึ่งจะเริ่มการผลิตที่โรงงานในเท็กซัส สิ่งสำคัญคือรถยนต์รุ่นนี้จะปฏิวัติวิธีการผลิตรถยนต์ใหม่ด้วย</p>\n<p>ซีอีโอ Elon Musk ตอบหลายคำถามจากนักวิเคราะห์ที่ในช่วงแถลงประกอบการ เรื่องแรกคือโพสต์ใน X เกี่ยวกับ<a href=\"https://www.blognone.com/node/137694\">การถือหุ้น 25%</a> เขาบอกว่าที่มาเกิดจากเขาไม่ต้องการให้นักลงทุนสถาบันที่ถือหุ้นเยอะ แล้วแต่งตั้งคนเข้ามาในบอร์ด เพื่อโหวตให้เขาออก แนวทางแก้ไขคือการจัดคลาสหุ้น แบบที่หลายบริษัทเทคโนโลยีทำ</p>\n<p>เมื่อถามถึงไทม์ไลน์ของ<a href=\"https://www.blognone.com/node/130711\">หุ่นยนต์ Optimus</a> เขาบอกอาจส่งมอบได้ในปีหน้าด้วยจำนวนเล็กน้อย และบอกว่าตอนนี้ทุกอย่างที่จำเป็นมีพร้อมแล้วในเทคโนโลยีรถยนต์ เพราะจริง ๆ รถยนต์ก็คือหุ่นยนต์ที่มี 4 ล้อ</p>\n<p>Tesla ยังบอกว่ากำลังการผลิต <a href=\"https://www.blognone.com/node/137026\">Cybertruck</a> ในปี 2024 อยู่ที่ประมาณ 125,000 คัน ขณะที่คำสั่งซื้อมีจำนวนมากกว่านั้นมาก</p>\n<p>ที่มา: <a href=\"https://www.cnbc.com/2024/01/24/tesla-tsla-earnings-q4-2023.html\">CNBC</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/aadf2dafe97af5bdb96c02c6619d7995.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla\">Tesla</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b814d759d36c1194eecbbd3031f81204c10c9d8229518367fb6a55b75fd9ecae","category":"Thai"}