{"title":"ประวัติธงชาติไทย กับอุดมการณ์ชาติ-ศาสน์-กษัตริย์","link":"https://markpeak.net/thai-national-flag/","date":1629096328000,"content":"<p>เขียนเรื่องธงชาติของประเทศต่างๆ ไปเยอะพอสมควรแล้ว (<a href=\"https://markpeak.net/flag-of-france/\">ฝรั่งเศส</a> <a href=\"https://markpeak.net/flag-of-the-netherlands/\">เนเธอร์แลนด์</a> <a href=\"https://markpeak.net/flag-of-russia/\">รัสเซีย</a>) ทีนี้ได้เวลาวนกลับมาเขียนถึง “ธงชาติไทย” กันบ้าง</p>\n<p>ก่อนเข้าเรื่องธงไตรรงค์เวอร์ชันปัจจุบัน ต้องย้อนดูประวัติของธงชาติไทยในอดีตกันก่อน โชคดีว่า <a href=\"https://th.wikipedia.org/wiki/%E0%B8%98%E0%B8%87%E0%B8%8A%E0%B8%B2%E0%B8%95%E0%B8%B4%E0%B9%84%E0%B8%97%E0%B8%A2\">Wikipedia มีข้อมูลค่อนข้างละเอียด</a> สามารถใช้อ้างอิงได้เลย (แหล่งอ้างอิงอื่น <a href=\"https://www.silpa-mag.com/history/article_52059\">ศิลปวัฒนธรรม</a> และ <a href=\"https://www.bbc.com/thai/thailand-41410161\">BBC Thai</a>)</p>\n<h2>ประวัติธงชาติไทยแบบสั้น</h2>\n<p>แนวคิดเรื่อง “ธงชาติ” เป็นแนวคิดของรัฐชาติสมัยใหม่ และเริ่มใช้งานจากแวดวงการเดินเรือก่อนใคร (จากเรื่องธงชาติดัตช์ และรัสเซียที่ใช้ตามดัตช์) ในยุคอยุธยาตอนปลาย-รัตนโกสินทร์ตอนต้น เริ่มมีเรือสินค้าต่างชาติเข้าอ่าวไทยมา คนไทยจึงเริ่มรู้จักการใช้ธงเป็นสัญลักษณ์บอกสัญชาติของเรือ</p>\n<p><strong>ธงชาติไทย v1</strong> ในสมัยแรกๆ ยังไม่มีใครออกแบบธงชาติไทย วิธีง่ายๆ คือใช้ผ้าแดงมาผูก ธงชาติไทยที่เป็นสัญลักษณ์ของ “เรือจากสยาม” จึงเป็นธงสีแดงล้วน</p>\n<p>สมัย ร.1-2 เริ่มมี “เรือหลวง” ที่พระมหากษัตริย์นั่ง เลยหาสัญลักษณ์มาบ่งบอกว่าเหนือกว่าเรือชาวบ้านทั่วไป เลยนำจักรสีขาวและช้างเผือกเข้ามาใส่ในธงด้วย (แต่ชาวบ้านก็ยังใช้ธงแดงอยู่)</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/thai-flag-1.png\" /></p>\n<p><strong>ธงชาติไทย v1.1</strong> ในสมัย ร.3 พบว่าการใช้ธงแดงล้วน ซ้ำกับประเทศอื่น จึงนำช้างเผือกมาใส่กลางธงแดง ส่วนธงของกษัตริย์ที่ใช้กับเรือหลวงนั้น ร.4 ให้ใช้ธงช้างสีน้ำเงินขาบ (น้ำเงินม่วง) แทน</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/thai-flag-2.png\" /></p>\n<p><strong>ธงชาติไทย v2</strong> หลังใช้ธงช้างเผือกมานาน ในสมัย ร.6 พ.ศ. 2459 ได้ไปเยือน จ.อุทัยธานี ชาวบ้านหาธงมาปักต้อนรับกษัตริย์แต่ใช้ธงไม่เป็น จึงชักธงช้างกลับหัว ทำให้ ร.6 พบว่าธงช้างแบบเดิมมีจุดอ่อน แถมการวาดช้างให้สวยทำได้ยากด้วย จึงออกแบบธงใหม่ที่สมมาตร ชักด้านไหนก็ได้ และทำได้ง่าย กลายเป็นธง 5 ริ้วสีขาว-แดง</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/thai-flag-3.png\" /></p>\n<p><strong>ธงชาติไทย v2.1</strong> ธง 5 ริ้วขาว-แดง ใช้ได้ไม่นาน ในปีถัดมาคือ พ.ศ. 2460 ก็มีคนเขียนความเห็นลงในหนังสือพิมพ์ เสนอว่าธง 5 ริ้วยังไม่สวยพอ ควรเปลี่ยนแถบตรงกลางเป็นสีน้ำเงิน เพื่อแสดงถึงสีของกษัตริย์ (ร.6 เกิดวันเสาร์ สีประจำตัวคือม่วง/น้ำเงินขาบ และเป็นสีที่ชอบด้วย)</p>\n<p>อีกเหตุผลหนึ่งคือช่วงนั้นมีสงครามโลกครั้งที่ 1 พอดี ซึ่งสยามเลือกเข้าข้างฝ่ายพันธมิตร (อังกฤษ ฝรั่งเศส รัสเซีย) ที่ทั้ง 3 ประเทศใช้ธงสีน้ำเงิน-ขาว-แดงหมดเลย การที่สยามใช้ธงชุดสีเดียวกัน ย่อมทำให้ทั้ง 3 ประเทศพอใจ</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/08/thai-flag-4.png\" /></p>\n<p>เราเลยได้ใช้ธงชาติไทย v2.1 หรือธงไตรรงค์นับแต่นั้นเป็นต้นมา</p>\n<h2>ความหมายของธงชาติไทย ชาติ ศาสนา พระมหากษัตริย์</h2>\n<p>จากประวัติของธงชาติไทยข้างต้น จะเห็นว่าธงชาติไทยถูกประดิษฐ์ขึ้นมาด้วยประโยชน์เชิงการใช้สอย (functional) เป็นสำคัญ ทั้งจากการเดินเรือ (ธงแดง v1) การสร้างความแตกต่างจากธงชาติอื่น (เอาช้างมาใส่เป็น v1.1) การออกแบบธงที่ทันสมัยขึ้น ประดิษฐ์ได้ง่าย (ธง 5 ริ้ว v2) และการใส่สีน้ำเงินเพื่อความสวยงาม + สร้างสัมพันธ์ชาติพันธมิตร (ไตรรงค์ v2.1)</p>\n<p>แล้วความหมายของธงชาติไทยที่อ้างอิงเรื่อง ชาติ ศาสนา พระมหากษัตริย์ อย่างที่เราร้องกันในเพลง “ไตรรงค์ธงไทย ปลิวไสวสวยงามสง่า สีแดงคือชาติ สีขาวศาสนา สีน้ำเงินนั้นหมายว่า พระมหากษัตริย์ไทย” นั้นมาจากไหนกันแน่</p>\n<p>ในกรณีของไทย หลักฐานอ้างอิงที่มีคือ ร.6 เป็นคนแต่งขึ้นมาเอง อยู่ในกลอน “เครื่องหมายแห่งไตรรงค์” เมื่อ พ.ศ. 2462 (2 ปีหลังสร้างธงไตรรงค์) – <a href=\"https://www.matichonweekly.com/column/article_350324\">มติชนสุดสัปดาห์</a></p>\n<blockquote><p>“ขอร่ำรำพันบรรยาย ความคิดเครื่องหมาย แห่งสีทั้งสามงามถนัด</p>\n<p>ขาว คือบริสุทธิ์ศรีสวัสดิ์ หมายพระไตรรัตน และธรรมคุ้มจิตไทย</p>\n<p>แดง คือโลหิตเราไซร้ ซึ่งยอมสละได้ เพื่อรักษะชาติศาสนา</p>\n<p>น้ำเงิน คือสีโสภา อันจอมประชา ธ โปรดเป็นของส่วนองค์</p>\n<p>จัดริ้วเข้าเป็นไตรรงค์ จึงเป็นสีธง ที่รักแห่งเราชาวไทย</p>\n<p>ทหารอวตารนำไป ยงยุทธวิชัย วิชิตชูเกียรติสยาม”</p></blockquote>\n<p>หากเราประเมินตามบริบทของการสร้างธง</p>\n<p><strong>สีแดง</strong> ซึ่งเป็นสีออริจินัลของธงสยามมาตั้งแต่สมัยอยุธยาตอนปลาย หมายถึงชาติ-ประเทศ และเป็นสีที่เปิดให้ประชาชนทั่วไป (ไพร่) ใช้งาน ภายหลังถูกนิยามใหม่ให้เป็นสีแห่งเลือด ที่ปกป้องแผ่นดิน (ตามบริบทสงครามโลกในตอนนั้น แม้ว่าสยามไม่ได้ไปรบกับใครสักเท่าไรนักก็ตาม)</p>\n<p>ส่วน<strong>สีน้ำเงิน</strong> ถูกกำหนดเป็นสีธงกษัตริย์ตั้งแต่สมัย ร.4 (ธงเรือหลวง) และถูกใช้อีกครั้งในธงไตรรงค์เวอร์ชัน 2.1 โดยกษัตริย์อีกยุคคือ ร.6</p>\n<p><strong>สีขาว</strong> ถูกนิยามขึ้นมาโดยไม่มีบริบทใดเพิ่ม คิดว่าน่าจะมาจากตัว ร.6 เองที่พยายามหานิยาม (ที่อาจจะ romanticize) ว่าเป็นสีแห่งความบริสุทธิ์ และโยงเข้าเรื่องศาสนา (ซึ่งเป็นศาสนาพุทธ by default)</p>\n<p>คำถามถัดมาคือ ร.6 ไปเอาแนวคิดเรื่อง ชาติ ศาสนา พระมหากษัตริย์ มาจากไหนกัน? นักวิชาการไทยจะเชื่อกันว่า มาจาก <a href=\"https://markpeak.net/god-king-and-country/\">God, King, and Country</a> ซึ่งเป็นคำขวัญทหารของอังกฤษในยุคสงครามโลกครั้งที่ 1 เพราะ ร.6 เองก็เป็นนักเรียนเก่าอังกฤษ น่าจะได้อิทธิพลมาจากอังกฤษเยอะ (แต่ท่านก็อยู่อังกฤษถึงแค่ พ.ศ. 2445 ก่อนสงครามโลกหลายปีมาก แม้อาจได้ข้อมูลจากหนังสือพิมพ์ในช่วงครองราชย์แล้วก็ตาม)</p>\n<p>แต่อย่างที่เขียนไปแล้วว่า ผมลองหาคำประวัติของคำว่า God, King, and Country ดู ก็ไม่ค่อยพบข้อมูลนี้มากนัก (เจอแต่ King and Country) เลยยังไม่เชื่อเรื่องนี้เท่าไร ในขณะที่ <a href=\"https://markpeak.net/flag-of-russia/\">ความหมายของธงชาติรัสเซีย</a> (ขาว = พระเจ้า, น้ำเงิน = กษัตริย์, แดง = ประชาชน) กลับมีความหมายที่ตรงกับของสยามกว่ามาก</p>\n<p>ตัว ร.6 เองก็<a href=\"https://www.silpa-mag.com/history/article_61621\">เคยเสด็จประพาสรัสเซียมาก่อน (สมัยอยู่อังกฤษ)</a> และราชสำนักไทยยุคนั้นก็มีสายสัมพันธ์ที่ดีมากๆ กับราชสำนักรัสเซีย ผมก็ขอตั้งข้อสังเกตไว้ตรงนี้ว่า ร.6 อาจได้อิทธิพลเรื่อง ชาติ ศาสน์ กษัตริย์ มาจากรัสเซียก็เป็นได้</p>\n<p>แต่ไม่ว่าที่มาของไอเดีย ชาติ ศาสน์ กษัตริย์ จะเริ่มมาอย่างไร ตลอดรัชสมัย ร.6 เองก็ได้กล่าวถึงเรื่องนี้หลายครั้ง (เช่น ในหนังสือ ปลุกใจเสือป่า) โดยใช้คำลักษณะเดียวกันนี้เรียกองค์ประกอบ 3 อย่างพร้อมกันในทีเดียว (เช่น “รักเจ้า รักชาติ รักศาสนา”) รวมถึงการกำหนดนิยามของ “ชาติ” ในแบบ modern state สมัยใหม่ด้วย</p>\n<p>ธงไตรรงค์เองเคยเกือบถูก ร.7 เปลี่ยนกลับเป็นธงช้าง ด้วยเหตุผลว่าไม่เป็นที่รู้จักเท่ากับธงช้าง แต่ความเห็นของสภาองคมนตรีก็หลากหลาย เสียงแตก ทำให้ ร.7 ตัดสินใจใช้ธงไตรรงค์ต่อไปแบบเดิม</p>\n<p>หลังการเปลี่ยนแปลงการปกครอง 2475 ธงไตรรงค์ถูกนำมาใช้แทน “ชาติ” เป็นหลัก และยิ่งถูกขับเน้นในยุคสร้างชาติของจอมพล ป. (หลัง พ.ศ. 2482 เป็นต้นมา) ที่มีหลวงวิจิตรวาทการเป็นหัวหอก มีการประดิษฐ์เพลงชาติ และการเคารพธงชาติเช้า-เย็นเพิ่มเข้ามาอีก</p>\n<p>รายละเอียดเรื่องธงชาติไทยกับอุดมการณ์รัฐไทย อ่านได้ในวิทยานิพนธ์ <a href=\"http://cuir.car.chula.ac.th/handle/123456789/5363\">ธงไตรรงค์กับการสร้างอุดมการณ์รัฐไทย พ.ศ. 2459-2520 ของ ชนิดา พรหมพยัคฆ์</a> คณะอักษรศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย (<a href=\"http://cuir.car.chula.ac.th/bitstream/123456789/5363/1/Chanida.pdf\">PDF</a>) รวบรวมไว้ค่อนข้างละเอียด (ผู้เขียนได้นำวิทยานิพนธ์ไปพัฒนาเป็นหนังสือ <a href=\"https://library.coj.go.th/th/book/22619/book-22619.html\">การเมืองในประวัติศาสตร์ : ธงชาติไทย</a> ต่อด้วย มติชนพิมพ์ปี 2546 ปัจจุบันน่าจะหาไม่ได้แล้วนอกจากในห้องสมุด)</p>The post <a href=\"https://markpeak.net/thai-national-flag/\">ประวัติธงชาติไทย กับอุดมการณ์ชาติ-ศาสน์-กษัตริย์</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"b827e106aa57f4f90faf6486379b066cd65bebd7693dcbefa200bfd40043ece9","category":"Thai"}