{"title":"รัฐมิสซิสซิปปีและเวอร์จิเนีย ผ่าน กม. ตรวจสอบอายุคนเข้าเว็บโป๊, Pornhub ประท้วงด้วยการบล็อคเว็บทั้งรัฐ","link":"https://www.blognone.com/node/134678","date":1688469776000,"content":"<div><div><div><p>Pornhub บล็อกการเข้าถึงเว็บไซต์ของผู้ใช้ในรัฐมิสซิสซิปปี และรัฐเวอร์จิเนีย เพื่อเป็นการประท้วง หลังรัฐทั้งสอง ผ่านกฏหมายตรวจสอบอายุผู้ใช้เพื่อป้องกันไม่ให้เด็กเข้าถึงสื่อลามก ซึ่งกำหนดให้เว็บไซต์สื่อลามกเข้มงวดกับตรวจสอบอายุของผู้ใช้มากขึ้น ไม่ใช่แค่ การถามผู้ใช้ว่า  “คุณอายุ 18 ปีขึ้นไปหรือเปล่า ?”</p>\n<p>ด้วยกฎหมายใหม่นี้ เว็บไซต์อาจขอให้ผู้ใช้ยืนยันอายุด้วยข้อมูลส่วนบุคคลต่าง ๆ เช่น บัตรประชาชน ซึ่ง Pornhub มองว่ากฎหมายดังกล่าวไม่มีประสิทธิภาพ รวมถึงมีความเสี่ยงในความปลอดภัยของข้อมูลและความเป็นส่วนตัวของผู้ใช้ เช่นเดียวกับ Electronic Frontier Foundation (EFF) องค์กรด้านสิทธิบนโลกออนไลน์ที่โจมตีกฎหมายนี้ว่าเป็นระบบควบคุมตรวจสอบประชาชน และวิจารณ์ว่า ประชาชนจะไม่มีทางรู้เลยว่า ข้อมูลที่ถูกนำไปตรวจสอบอายุ จะถูกเก็บหรือใช้อย่างไร</p>\n<p>ระยะหลัง หลายรัฐที่มีความอนุรักษ์นิยมในสหรัฐ ทยอยผ่านกฎหมายลักษณะเดียวกันออก เพื่อป้องกันไม่ให้เด็กที่อายุต่ำกว่า 18 ปี เข้าถึงสื่อลามกอนาจาร อย่างเช่นในเท็กซัส, มอนทานา, ยูทาห์, อาคันซอและลุยเซียน่า ทำให้นอกจาก 2 รัฐล่าสุด ก่อนหน้านี้ Pornhub ยังเคยบล็อครัฐยูทาห์และลุยเซียนา โดย Pornhub เคยเผยด้วยว่ายอดทราฟิคจากลุยเซียน่าลดลงถึง 80% หลังกฎหมายเริ่มบังคับใช้</p>\n<p>ที่มา : <a href=\"https://www.theverge.com/2023/7/3/23782776/pornhub-blocks-mississippi-virginia-age-verification-laws\">The Verge</a>, <a href=\"https://gizmodo.com/pornhub-cuts-off-access-in-mississippi-and-virginia-1850602485\">Gizmoodo</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/da6a76aae157378beded02857d0e33f6.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/pornhub\">Pornhub</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/usa\">USA</a></div></div></div>","author":"ydk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b82781378720097d1ee8a115c3a0b0a6938acb22feeeb04903817c80e59024c7","category":"Thai"}