{"title":"PSXIII-18 Prenatal transportation differentially affects the adrenal cortical and adrenomedullary transcriptomes of Brahman bull calves","link":"https://academic.oup.com/jas/article/102/Supplement_3/713/7757927?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Prenatal stress (PNS) and early life adversity have been linked to epigenetic changes in the nervous, immune, and endocrine systems in various species. Previously, we reported that PNS calves had greater serum concentrations of ACTH and cortisol, were more temperamental, and had differential methylation of leukocyte DNA. The purpose of this study was to determine whether prenatal transportation stress differentially affected gene expression in the adrenal gland of calves. Mature Brahman cows inseminated to a single Brahman sire were assigned to either Control (n = 35; not transported) or PNS (n = 37; 2 h of transportation at 60, 80, 100, 120, and 140 ± 5 d of gestation) group. From some of these cows, 8 Control and 8 PNS bull calves were humanely euthanized at 25 ± 2 d of age. Adrenal glands were obtained, separated into the cortical (AC) and medullary (AM) components, placed into cryovials, snap frozen in liquid nitrogen, and stored at -80°C. Frozen samples (200 mg) were submitted to Novogene Corporation for RNA sequencing analysis on an Illumina Novaseq 6000 platform to generate 150 bp paired-end reads. The reference genome was <span>Bos taurus</span> ARS-UCD1.2. The DESeq2 R package was used for differential gene expression analysis (DEG) and DEGs (P ≤ 0.05, log2FC ≥ 1) were evaluated for gene ontology (GO) subclass terms and Kyoto encyclopedia of genes and genomes (KEGG) enrichment pathways. For the AC DEG comparison, a total of 899 genes were identified, with 641 upregulated and 258 downregulated in PNS calves. The AC DEGs were in the cellular component, molecular function and biological process GO subclasses related to circadian rhythm, lymphocyte proliferation, cytokine regulation, muscle development, and lipid metabolism. The KEGG enrichment analysis identified nitrogen metabolism, cytokine signaling, and circadian rhythm pathways associated with DEG of the AC. For the AM DEG comparison, a total of 1,245 genes were identified, with 745 upregulated and 500 downregulated in the PNS calves. The AM DEGs were in GO subclasses related to skeletal muscle development, antigen processing, and neural crest development. The KEGG enrichment analysis identified cell adhesion, viral infection, cytokine signaling, and amphetamine pathways associated with DEG of the AM. These early results suggest that prenatal stress differentially affects expression of genes of the adrenal cortex and adrenal medulla, which may affect health and growth of calves.Support: USDA NIFA Award No. 2019-67015-29573</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b829888f1fbc3ef13584a713c3385e25cae155a9d7053ad898b23bfe6c4473aa","category":"Environment"}