{"title":"Prevalence and associated risk factors of current hepatitis C infection among U.S. general population and injection drug users aged 20–59 years: NHANES 2009–2018","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309345","date":1724680800000,"content":"<p>by Harun Mazumder, Md Faruk Hossain, Pratibha Shrestha, Sultan Mahmud, Maidul Husain, Rebeka Ahmed</p>\r\nIntroduction <p>The people who inject drugs (PWID) are attributed to high-risk groups for transmission of the Hepatitis C virus (HCV). This study assessed the prevalence and associated factors of current HCV infection (CHI) among U.S. general population and PWID of ages between 20 and 59 years old.</p> Methods <p>This study utilized cross-sectional data from the 2009–2018 National Health and Nutrition Examination Survey, conducting separate analyses for the U.S. general population, including PWID and non-PWID, as well as specific analyses focusing solely on PWID. The analytical methods included the estimation of CHI prevalence, Rao-Scott chi-square test to compare CHI-positive and CHI-negative groups, and univariate and multivariable logistic regressions models to evaluate the associated risk factors of CHI.</p> Results <p>The prevalence of CHI among general population and PWID were 1% and 19%, respectively. Compared to non-PWID, the odds of CHI were significantly higher among PWID (OR = 32.6, 95% CI = 17.7–60.3) in general population. Among PWID, male vs. female (OR = 2.6, 95% CI = 1.1–5.9), adults aged 40–59 vs. 20–39 years old (OR = 2.9, 95% CI = 1.2–7.3), Non-Hispanic Black vs. White (OR = 4.6, 95% CI = 1.5–13.6), with high school diploma or less educational attainment vs. above college degree (OR = 3.5, 95% CI = 1.4–9.2) showed higher odds of having CHI.</p> Conclusion <p>The prevalence of CHI was found to be higher among PWID especially those who were male, aged 40–59 years old, Non-Hispanic Black, and had lower educational attainment. Targeted intervention such as screening and awareness program among PWID population is recommended to reduce the burden of new HCV infections in the U.S.</p>","author":"Harun Mazumder","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b831248cb38ce1b2e7a7de5807dd23d1b8d944bf050c45d9a38d52a10f719eb1","category":"Interdisciplinary"}