{"title":"Filippo Ganna’s Pinarello Bolide gets a new custom paint job","link":"https://cyclingtips.com/2021/05/filippo-gannas-pinarello-bolide-gets-a-new-custom-paint-job/","date":1620419060000,"content":"<p>Filippo Ganna will start stage one of the Giro this weekend, a nine-kilometre individual time, as one of the favourites for the win. Furthermore, Ganna will start the race against the clock as current time trial World and Italian champion, <a href=\"https://cyclingtips.com/2020/10/ganna-first-to-wear-pink-at-giro-ditalia/\" target=\"_blank\">winner of stage one</a> at last year’s Giro and, as the icing on the cake, aboard this stunning custom-painted Pinarello Bolide. </p>\n\n\n\n<p>Ganna unveiled the stunning paintwork in a video released on Ineos Grenadiers YouTube channel today. Pinarello painted the bike in the same metallic blue as previously used on Elia Viviani’s MAAT track bike post 2016 Rio Olympics. When asked why this colour, Ganna simply replied, “because I like to be different.”. </p>\n\n\n\n<p>Different he is, having won time trial and road stages in last years Giro, World Championships on the road and track, Ganna has earned the nickname “Top Ganna”. </p>\n\n\n\n<p>I guess you have to embrace a nickname like that, and so that blue paintwork is complimented with chrome Pinarello decals the “Top Ganna” logo. The paint job also features the world champions rainbow bands on the front forks and the Italian Tricolore on the seat tube, a nod to the reigning Italian national time trial champions home country. </p>\n\n\n\n<p>Apart from the paintwork, the Pinarello Bolide is almost identical to that used so successfully by Ganna at last year’s Giro and world championships. The bike features custom 3D printed aerobars, including what appears to be custom made Di2 shifter buttons, and Dura-Ace Di2 groupset.  </p>\n\n\n\n<p>This is where things start to differ from last year’s setup. Last year’s opening stage time trial featured a long fast descent and Ganna opted for a 60t chainring. It would appear Ganna is on an ever-so-slightly more practical 58t Dura-Ace chainring for this weekends time trial. </p>\n\n\n\n<p>In another change, Ineos riders were often spotted time trialling on Princeton Carbon works wheels over the past number of years. While the Prineton rear disc can be seen on the Bolide in this video, the front wheel is very clearly an Aerocoach Aeox Titan. The 100mm deep Aeox wheel features an ultra-narrow hub and hidden valve stem for improved aerodynamics. </p>\n\n\n\n<p>Ineos seem happy to chop and change time trial wheels (and <a target=\"_blank\" href=\"https://cyclingtips.com/2019/07/team-ineos-swaps-to-lightweights-for-climbing-stages/\">road wheels</a>) when deemed necessary. Ineos riders were spotted using the rear Aerocoach Aeox Ultra disc, notably Chris Froome at last years Vuleta. </p>\n\n\n\n<p>With fast wheels comes a requirement for fast tyres, and Ganna has opted for Continental Grand Prix TT clinchers, presumably with latex inner tubes. </p>\n\n\n\n<p>Somewhat surprisingly, given the attention to detail on this bike, Ganna has stuck with a traditional round water bottle and not opted for an aero shaped TT specific bottle. This could a training setup and might yet get swapped out before the start. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-2-1340x754.jpg\" /><figcaption>Ganna’s Pinarello Bolide in Viviani blue.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-4-1340x754.jpg\" /><figcaption>This Grenadier is Italian champion.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-5-1340x754.jpg\" /><figcaption>Top Ganna is often top gun in the time trials.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-6-1340x754.jpg\" /><figcaption>Has there ever been a sleeker rim brake setup? </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-10-1340x754.jpg\" /><figcaption>The location, date, and finishing time of Ganna’s World championship individual time trial victory. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-7-1340x754.jpg\" /><figcaption>A good day at the office.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-8-1340x754.jpg\" /><figcaption>So shiny!</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-9-1340x754.jpg\" /><figcaption>The rear brakes are just as sleek and feature this wave design introduced with the updated lighter Bolide TT in 2016.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Bolide-rear-brake-1340x754.jpg\" /><figcaption>A side-on shot of those rear brakes.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Top-Ganna-2-Giro-TT-pinarello-Bolide--1340x754.jpg\" /><figcaption>Chrome Pinarello and Top Ganna decals match the metallic blue finish on the frame.</figcaption></figure></li></ul></figure>\n\n\n\n<p>Last but not least, Ganna chooses a Fizik Ares TT saddle. The Ares is an older saddle and no longer features on Fizik’s website, perhaps Ganna has a stash somewhere. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/filippo-gannas-pinarello-bolide-gets-a-new-custom-paint-job/\">Filippo Ganna’s Pinarello Bolide gets a new custom paint job</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b831e89ceb506374b4470cb3c7fba0a45d8ad4662b3113da72f41d519496236e","category":"Cycling"}