{"title":"Room temperature biosynthesis of ZnO nanoparticles using avocado seed extract with antimicrobial and anticancer properties","link":"http://link.springer.com/10.1007/s13762-024-05528-5","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>In this study, methanol–water extract of Hass avocado seed was used as a reducing agent for the room temperature biosynthesis of crystalline ZnO nanoparticles (ZnONPs). XRD, ATR-FTIR, DLS, SEM analysis and UV–Vis spectroscopy results demonstrated that crystalline ZnONPs can be synthesized in the presence of avocado seed extract at 1, 3 and 5 mg/mL concentrations. Nanoparticles showed hexagonal crystalline structure with crystallite sizes in the 17–20 nm range and ZnONPs synthesized with 3 mg/mL avocado seed extract content (ZnONPs-3) showed the smallest crystallite size (16.9 nm). Flower like structures of ZnONPs agglomerates were observed in SEM images. The most uniform size distribution with the lowest PdI value (0.140) was determined for ZnONPs-3 by DLS analysis. All ZnONPs exhibited high antimicrobial activity with minimum inhibitory concentrations between 7.81 and 125 µg/mL. Cytotoxicity of ZnONPs-3 was investigated with human normal skin (BJ) and brain glioblastoma cancer (T98G) cell lines. IC<sub>50</sub> values for BJ and T98G cells were determined as 36.05 and 23.60 µg/mL at 24 h, respectively; which decreased to 31.07 µg/mL and 18.05 µg/mL at 48 h. Additionally, ZnONPs-3 showed anticancer activity against T98G cancer cells after 24 and 48 h of exposure at non-toxic doses for BJ normal cells. The results indicate that ZnONPs synthesized in the presence of avocado seed extract are promising bioactive agents that can be used in various fields such as biomedicine, drug delivery and cosmetics due to their antimicrobial and anticarcinogenic properties.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"b8328c1d6a59f8b8eaee72abf04d4807b4946045e14af0fa6f788edf3422493f","category":"Environment"}