{"title":"Designing A Dispatch Engine for Hybrid Renewable Power Station Using Mixed-Integer Linear Programming (MILP) Technique","link":"https://www.preprints.org/manuscript/202405.0865/v1","date":1715610672000,"content":"Hybrid power plants have recently emerged as reliable and flexible electricity generation stations by combining multiple renewable energy sources, energy storage systems (ESS), and fossil-based output. However, the effective operation of the hybrid power plants to ensure continuous energy dispatch under challenging conditions is a complex task. This paper proposes a dispatch engine (DE) based on mixed-integer linear programming (MILP) for the planning and management of hybrid power plants. To maintain the committed electricity output, the dispatch engine will provide schedules for operation over extended time periods as well as monitor and reschedule the operation in real-time. Through precise prediction of the PV and wind power output, the proposed approach guarantees optimum scheduling. The precise prediction of the PV and wind power are achieved by employing a predictor of Feed-Forward Neural Network (FFNN) type. With such a dispatch engine, the operational cost of the hybrid power plants, and the use of diesel generators (DGs) are both minimized. A case study is carried out to assess the proposed dispatch engine feasibility. A real-time measurement data pertaining to load, wind, and PV power outputs is obtained from different locations in the Sultanate of Oman. The real-time data is utilized to predict the future output power from PV and the Wind farm over 24 hours. The predicted powers are then used in combination with a PV-Wind-DG-ESS-Grid hybrid plant to evaluate the performance of the proposed dispatch engine. The proposed approach is implemented and simulated using MATLAB. The results of the simulation reveal the proposed Feed-Forward Neural Network’s (FFNN) powerful forecasting abilities. In addition, the results demonstrate that adopting the proposed DE can minimize the use of DG units and reduce plant running expenses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b83531f708435339b528a8f46b2775d735e12e2f7dfab4f6f18a9456354bb287","category":"Interdisciplinary"}