{"title":"Developing Sustainable Hospital Capacity Management Protocols Using Clinical Prognostic Analysis: A Novel Stochastic Model for Covid-19","link":"https://www.preprints.org/manuscript/202405.1255/v1","date":1716190948000,"content":"The relentless challenges posed by the COVID-19 pandemic have placed immense pressure on densely populated regions, such as Hong Kong, particularly in the context of an aging population. The burgeoning demand for healthcare services has necessitated the optimization of resource al-location within healthcare systems. This research presents an innovative analytical queueing model specifically tailored to address the intricate gridlock dynamics prevalent in healthcare systems, with a focused application in the challenging landscape of COVID-19 management. Hong Kong, like numerous other regions, has experienced a demo-graphic transition leading to heightened healthcare demands. Traditional methodologies for scrutinizing gridlock issues in healthcare settings, including simulation models, often prove suboptimal within the context of sophisticated optimization frameworks. This study, however, delves into analytical queueing models, offering a more efficient and effective approach. These models have been underexplored, primarily due to the intricacies involved in modeling gridlock propagation within restricted capacity, a critical concern magnified by the COVID-19 pandemic. The novel Queueing Model introduced in this research incorporates the maintenance of queue capacities and topological aspects as exogenous parameters, rendering it exceptionally adaptable for diverse gridlock-related applications. This adaptability is especially pertinent to healthcare management during the COVID-19 crisis. The model meticulously integrates the concept of gridlock, furnishing a comprehensive comprehension of its origins and repercussions. Validation of this model involves rigorous comparison with established methodologies, exact results, and simulation data, consistently high-lighting its versatility and precision. By applying the model to healthcare management, we scrutinize the dynamics of patient flow within a Hong Kong hospital, placing specific emphasis on the critical issue of bed blockage, further exacerbated by the COVID-19 pandemic. The model's gridlock decomposition unearths the nuanced impact of bed blockage on distinct hospital units, addressing the imperative requirement for quantifying in-patient bed blockage within healthcare systems during a pandemic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b837f7d5397f7564c9f1d80785f9f25f336b97bf41e63322962281bc3d2daa3d","category":"Interdisciplinary"}