{"title":"Double-index rainfall warning and probabilistic physically based model for fast-moving landslide hazard analysis in subtropical-typhoon area","link":"http://link.springer.com/10.1007/s10346-023-02187-4","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>In subtropical typhoon-prone regions, landslides are triggered by short-duration intense rainfall and prolonged periods of elevated pore-water pressure. However, fast-moving landslides pose a significant challenge for timely warning because of insufficient data on rainfall triggers and the identification of potential failure sites. Thus, our study introduces an integrated approach that combines a double-index intensity-duration (I-D) threshold, accounting for daily rainfall (R<sub>0</sub>) and 5-d effective rainfall (R<sub>5</sub>), with the MC-TRIGRS, a probabilistic physically based model, to analyze fast-moving landslide hazards at a regional scale. This approach is characterized by its innovative features: (i) it employs a double-index model to categorize rainfall events, differentiating between long-term continuous rainfall and short-term intense precipitation; (ii) it utilizes a comprehensive dataset from extensive field investigations to implement the grey wolf optimizer (GWO) -enhanced long short-term memory neural network (LSTM) to predict soil thickness distributions across the study area; and (iii) it adopts the classical Monte Carlo method to calculate failure probabilities under various rainfall scenarios, incorporating randomness in key soil parameters, such as cohesion and internal friction angle. By leveraging geotechnical data from both field and laboratory tests and integrating the accumulated knowledge, these models can be applied to the coastal mountainous basins of Eastern China, a region highly prone to landslides. Our goal was to augment the effectiveness of landslide early warning systems. Particularly, the synergistic use of rainfall empirical statistics and probabilistic physically based slope stability models is poised to bolster real-time control and risk mitigation strategies, providing a robust solution for short-term preparedness.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"b8394b90c426aaf21cb516847291d190e216c647e8a53794e84c40301f1d15c6","category":"Environment"}