{"title":"Unlocking Nile tilapia (Oreochromis niloticus Linn., 1758) selective breeding programmes in Uganda through geographical genetic structure mapping","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.197?af=R","date":1720940400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3d43ca71-3b87-4e58-84ec-840a47a0eaca/aff2197-gra-0001-m.png\" alt=\"Unlocking Nile tilapia (Oreochromis niloticus Linn., 1758) selective breeding programmes in Uganda through geographical genetic structure mapping\" />\n<p>Geographic genetic structure maps of Nile tilapia in Uganda.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Nile tilapia (<i>Oreochromis niloticus</i>), native to Africa and the Levant, is an important species for both aquaculture and capture fisheries. Despite these attributes, Nile tilapia has been negatively impacted by anthropogenic activities ranging from overfishing and habitat destruction to translocations. These human-mediated activities have threatened the genetic evolutionary integrity of native populations of Nile tilapia and congeneric species through admixture, demographic bottlenecks and introgressive hybridization. In this context, the genetic contrast between farmed/bred strains and wild Nile tilapia populations in the major lakes of Uganda remains understudied. Understanding the genetic structure of Nile tilapia populations in the major water bodies of Uganda (lakes Victoria, Kyoga, Edward, George, Albert and Nile River) is a key resource to guide selective breeding programmes, thus minimizing the effects of maladaptation under both aquaculture and natural stocks. Although the population genetics of Nile tilapia in Uganda's major lakes have been studied, this was based on limited sampling scope, especially in the wild, and the key information on the species could have been overlooked. We fill this knowledge gap by genotyping 756 Nile tilapia individuals from multiple populations for each major water body of Uganda using a panel of 34 microsatellite loci based on the microsatellite genotyping-by-sequencing (SSR-GBS) technique. The results indicate two discrete gene pools/stocks: the Edward-George system and the Albert-Kyoga system-Victoria. Evidence of loss of genetic diversity and admixture of some Nile tilapia stocks was found, most likely resulting from anthropogenic perturbations. This study contributes useful information key for understanding the potential Nile tilapia broodstock sources for selective breeding programmes, aimed at improving aquaculture production in Uganda.</p>","author":"Papius Dias Tibihika, \nCassius Aruho, \nVictoria Namulawa, \nRichard Ddungu, \nGertrude Atukunda, \nMargaret Aanyu, \nMujibu Nkambo, \nThapasya Vijayan, \nGerald Kwikiriza, \nManuel Curto, \nHarald Meimberg","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"b849972e83cb699439533cc42da82f285eb07f3cbf3f3edc2ee47757294b5c77","category":"Environment"}