{"title":"NIR-HSI/2B-CNN Algorithmic Scheme for Early Detection of Anthracnose on Mango Fruits","link":"https://www.preprints.org/manuscript/202408.0759/v1","date":1723431719000,"content":"This research proposes a near-infrared hyperspectral imaging/two-branch convolutional neural network (NIR-HSI/2B-CNN) algorithmic scheme to detect mango anthracnose of the species Colletotrichum asianum at the early stages of disease development. In the algorithmic model development, root mean square propagation was used as the solver to train the neural network, given 150 epochs. In addition, spectral raw data was preprocessed to transform it into an understandable and efficient format. The optimal classification model was the 2B-CNN model with 1st-derivative preprocessing, achieving an accuracy of 0.94 for the calibration set and 0.71 for the prediction set. The proposed NIR-HSI/2B-CNN scheme could detect anthracnose mangoes since the the first day of inoculation of the spore suspension (i.e., day 0) through to day 3, achieving a moderate classification accuracy. Meanwhile, the accuracy of conventional convolutional neural networks (CNN) were within a range of 0.66-0.67 for the calibration set and 0.55-0.57 for the prediction set. The results indicated that incorporating spatial features in the 2B-CNN modeling enhanced the prediction performance of the algorithm. The proposed NIR-HSI/2B-CNN algorithmic scheme needs refinements to be able to reliably sort mango fruits into those suitable for premium fresh consumption and export without anthracnose and those for domestic consumption or processing. The novelty of this research lies in the use of NIR-HSI and 2B-CNN algorithm to detect plant pathogens at the early stages of disease development. In addition, the new method of natural simulation to deposit the fungal spores onto the mango surface by spraying spore suspension onto the mango surface where the conidia penetrated unaided into the underneath of the mango peel is proposed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b851551c4adc5d5612facdb6e8c00e1820a18a3d2312bcadaad011ae96df1b3a","category":"Interdisciplinary"}