{"title":"Nature-based solutions and the rural-urban divide: CNature-Based Solutions and the Rural-Urban Divide: Community-Based Convergence Research for Food System and Ecological Resilienceommunity-based convergence research for food system and ecological resilience","link":"https://www.preprints.org/manuscript/202408.1559/v1","date":1724257284000,"content":"Changes in hydrology from aridification in the U.S. Southwest have led to tension at the urban-rural divide about conservation and land management strategy. Strain on multi-generational agricultural livelihoods and a nearly 150-year-old Colorado River water adjudication system presents an opportunity for multidisciplinary solutions and symbiotic partnerships. In this study, producers in a small San Juan River headwater community in southwestern Colorado participated in a convergence research study developed collaboratively with community partners, prioritizing local objectives and policy needs. Acknowledging the historic and sometimes perceived role of academic institutions as representing urban interests, our goal was to highlight how research could support rural governance and identify rural interests. Respondents identified water availability and climate changes as the factor that most negatively affects operations. Respondents had interest in nature-based agroforestry methods like windbreak trees and drought-resistant crop species. Community members identified cost as the leading perceived barrier to implementing nature-based agricultural solutions, with over half of respondents indicating that programs to subsidize or eliminate cost would improve willingness to try nature-based methods. Analyses identified that satisfaction with community resources was positively correlated with scale of production, satisfaction with irrigation equipment, and familiarity with water rights. Further, our results outline barriers to perceptions about nature-based solutions on rural landscapes. We hope to contribute this model for wider applications in other regions to uncover place-based solutions to resource challenges and contribute to addressing stress at the urban-rural divide.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b85198f3ad77de6099b75a6d72be9c4ab95a79c99db7cf02c46e5f66d4246bcd","category":"Interdisciplinary"}