{"title":"Apple Vision Pro: Apple’s big bet on a brand-new platform starts at $3,499","link":"https://www.macworld.com/article/1940428/apple-vision-pro-design-features-specs-price-release-date.html","date":1685992514000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After months—years, even—of rumors, Apple has finally unveiled its mixed-reality headset. Dubbed Apple Vision Pro, it supports both AR and VR applications and boasts features and specs that make other competing products look like toys. Apple calls it “the most advance personal electronics device ever” and has filed over 5,000 patents related to it. But it will cost you. Apple says it starts at $3,499 and will be available early in 2024. Apple claims it is a high-end TV, sound system, computer, and more–making the cost a bargain by comparison.</p>\n\n\n\n<p>Apple calls it a new type of product that blends the digital and real world. It’s the first Apple product you look <em>through</em>, and not <em>at</em>. You control everything using your eyes, hands, and voice, rather than holding physical controllers. Apps and the interface can be moved around and resized, and even cast shadows on the real world to help you understand scale. Apple says that just as the Mac introduced us to personal computing, and the iPhone introduced us to portable computing, Apple Vision Pro will introduce us to “spatial computing.” </p>\n\n\n\n<p>You’re able to place multiple apps in the real world space and can type with either voice or a virtual keyboard, but you can also use Bluetooth keyboards and trackpads, and with a glance at your Mac, you can use it on a large virtual display.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-PRo-2.jpg?quality=50&amp;strip=all\" alt=\"Apple Vision Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-PRo-2.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-PRo-2.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-PRo-2.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-PRo-2.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /><figcaption><p>Apple Vision Pro shows a real-time rendition of your eyes,</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>An external display shows people what your eyes look like at the moment with a feature called EyeSight, so others are not disconnected from you. But if you’re in a fully immersive experience, a cloudy view shows others that you’re not able to see them at the moment.</p>\n\n\n\n<p>The apps we know are all completely redesigned for the virtual space. FaceTime shows each participant in a large video tile and uses spatial audio to help you place who is talking. Vision Pro also lets you capture photos and video in full 3D, so you can watch them using the headset and experience them with real depth. Watching a film dims the room or places you in a large virtual environment.</p>\n\n\n\n<p>As part of the announcement, Apple brought out Disney CEO Bob Iger to show a sizzle reel of some of the ways the company plans to support the product, including new ways to consume Disney or ESPN content. The demo showed off movies with interactive elements, and live sports with stats and highlights, and courtside views. </p>\n\n\n\n<p>The front is a single piece of glass. The aluminum frame has a button on the left side and a Digital Crown on the right. The cloth face cushion comes in various sizes, and the cloth headband is stretchy and even removable for different kinds of headbands. Speakers are integrated into the sides and provide personalized spatial audio. They use audio ray tracing to create a sound profile of your room and  If you need glasses, there are Zeiss magnetically attached vision correction attachments.</p>\n\n\n\n<p>The headset is meant to be used all day when plugged in, but a separate battery pack that tethers to the side is meant to last two hours.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/New-Project-2023-06-05T205851.421.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Vision Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/New-Project-2023-06-05T205851.421.jpg?quality=50&amp;strip=all 1427w, https://b2c-contenthub.com/wp-content/uploads/2023/06/New-Project-2023-06-05T205851.421.jpg?resize=300%2C241&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/New-Project-2023-06-05T205851.421.jpg?resize=768%2C618&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/New-Project-2023-06-05T205851.421.jpg?resize=1200%2C965&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"965\" /><figcaption><p>Apple Vision Pro will last all day when plugged in and two hours with the external battery pack.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The two displays provide over 23 million pixels combined–greater than 4K per eye. A high-speed eye tracking system on the inside monitors where you look, and foveated rendering helps keep rendering running smoothly. Inside, the system is powered by an M2 processor and a new R1 chip that can process input from all 12 cameras and numerous other sensors in just a few milliseconds.</p>\n\n\n\n<p>The external OLED on the front is curved and uses a lenticular display so that when other people see you, they see your eyes from the correct perspective. You’ll scan your face to create an accurate 3D avatar of yourself.</p>\n\n\n\n<p>All of this is run by VisionOS, Apple’s new operating system designed from the ground up for spatial computing. Hundreds of thousands of iPhone and iPad apps will work on Vision Pro from day one, in addition to new 3D apps you get from a new App Store. Apple says there will be over 100 Apple Arcade games available to play on day one, including NBA 2K24, and the hardware supports gamepads just like iPhone, iPad, and Apple TV.</p>\n\n\n\n<p>The Vision Pro will scan your iris with Optic ID, which like Face ID is encrypted and stays on device and is only accessible to the secure enclave in the M1 processor. It is used to authenticate just like Touch ID and Face ID are. Where you look is processed by a secure background process so apps can’t track you.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b855107c15e87966994546fa3271ff8aa7be94968a0f5cee1ddf91a00897d14c","category":"Apple"}