{"title":"Deciphering the pathogenesis of melanized focal changes in the white skeletal muscle of farmed Atlantic salmon (Salmo salar)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13988?af=R","date":1719646122000,"content":"<h2>Abstract</h2>\n<p>Melanized focal changes (MFCs) in the fillet of farmed Atlantic salmon is a major quality concern. The changes are thought to initially appear as acute red focal changes (RFCs) that progress into chronic MFCs. Recent findings have indicated that hypoxia may be important in their development, possibly leading to necrosis affecting not only myocytes but also adipocytes. Thus, the aim of this study was to investigate possible hypoxic conditions in RFCs and the subsequent inflammatory responses and lesions in the adipose tissue in RFCs and MFCs. A collection of RFCs, MFCs and control muscle samples from several groups of farmed salmon was studied. Using immunohistochemistry, we found induction of the hypoxia-inducible factor 1 pathway in RFCs. Histological investigations of RFCs and MFCs revealed different stages of fat necrosis, including necrotic adipocytes, a myospherulosis-like reaction and the formation of pseudocystic spaces. Accumulations of foamy macrophages were detected in MFCs, indicating degradation and phagocytosis of lipids. Using in situ hybridization, we showed the presence of tyrosinase- and tyrosinase-related protein-1-expressing amelanotic cells in RFCs, which in turn became melanized in MFCs. In conclusion, we propose a sequence of events leading to the formation of MFCs, highlighting the pivotal role of adiposity, hypoxia and fat necrosis.</p>","author":"Håvard Bjørgen, \nMalin Brimsholm, \nCharlotte Finstad Asserson, \nKirstin Skaar, \nGeir Magne Knutsen, \nØyvind Oaland, \nRandi Haldorsen, \nPer Gunnar Fjelldal, \nTom Hansen, \nEspen Rimstad, \nBritta Andrea Kleist, \nMarius Lund‐Iversen, \nMariusz Pawel Kowalewski, \nErling Olaf Koppang","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"b85f24daeead0b9fdf0cb69715e32caf945d8fdec4765afacd9d7059206ce81a","category":"Environment"}