{"title":"Characteristics and Influencing Factors of Landscape Pattern Gradient Transformation of Small-Scale Agroforestry Patches (SAP) in Mountain Cities","link":"https://www.preprints.org/manuscript/202405.2111/v1","date":1717139412000,"content":"Questions：SAP in mountainous cities of China serve as crucial carriers for species and wild food, constituting potential green infrastructure. These patches should be recognized as locally specific resources. This study investigates the transformation characteristics of the landscape patterns of SAP, along with their elements, across urban-rural gradients, providing foundational support for the planning of conservation and utilization strategies. Location: Yongchuan area of Chongqing in southwest China. Methods: The study investigated urban-rural gradient-based transformation of SAP. A four-direction transect space was selected and divided into uniform sample squares. Fragstats 4.3 calculated the landscape index of SAP, and Spearman correlation coefficients in SPSS were used to evaluate the influence of landform and artificial factors on agroforestry patch transformation. Results: 1) Patch area (PA), Plaque density (PD), and CLUMPY of SAP systematically transform, showing increased SAP areas and higher connectivity with greater distance from the city, resulting in reduced patch fragmentation. However, Edge density (ED) and Largest plaque index (LPI) exhibit irregular transformation patterns. 2) With increased distance from the city, woodland patch area and connectivity increase, leading to decreased fragmentation, dispersal, and lower fractal dimensions. Conversely, Cultivated land follows the opposite trend. garden land patch area, fractal dimension, fragmentation, and dispersal all increase, while connectivity decreases. 3) Landscape pattern transformations of SPA are significantly influenced by artificial factors. Woodland patches are influenced similarly by landform and artificial factors. In contrast, cultivated land and garden land patches are more significantly impacted by artificial factors. Conclusions: SAP exhibit differentiated conservation and utilization measures across urban-rural gradients. Small patches located far from urban centers may benefit from systematic conservation measures to prevent further fragmentation and erosion in peri-urban areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b8637f9dc2afa7d41145408d62cfbeb77b24c468c2fb10422b1a85f4dd8aa9d2","category":"Interdisciplinary"}