{"title":"T‐YOLO: a lightweight and efficient detection model for nutrient buds in complex tea‐plantation environments","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13396?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Quick and accurate detection of nutrient buds is essential for yield prediction and field management in tea plantations. However, the complexity of tea plantation environments and the similarity in color between nutrient buds and older leaves make the location of tea nutrient buds challenging.</p>\n<h2>RESULTS</h2>\n<p>This research presents a lightweight and efficient detection model, T-YOLO, for the accurate detection of tea nutrient buds in unstructured environments. First, a lightweight module, C2fG2, and an efficient feature extraction module, DBS, are introduced into the backbone and neck of the YOLOv5 baseline model. Second, the head network of the model is pruned to achieve further lightweighting. Finally, the dynamic detection head is integrated to mitigate the feature loss caused by lightweighting. The experimental data show that T-YOLO achieves a mean average precision (mAP) of 84.1%, the total number of parameters for model training (Params) is 11.26 million (M), and the number of floating-point operations (FLOPs) is 17.2 Giga (G). Compared with the baseline YOLOv5 model, T-YOLO reduces Params by 47% and lowers FLOPs by 65%. T-YOLO also outperforms the existing optimal detection YOLOv8 model by 7.5% in terms of mAP.</p>\n<h2>CONCLUSION</h2>\n<p>The T-YOLO model proposed in this study performs well in detecting small tea nutrient buds. It provides a decision-making basis for tea farmers to manage smart tea gardens. The T-YOLO model outperforms mainstream detection models on the public dataset, Global Wheat Head Detection (GWHD), which offers a reference for the construction of lightweight and efficient detection models for other small target crops. © 2024 Society of Chemical Industry.</p>","author":"Bingyi Bai, \nJunshu Wang, \nJianlong Li, \nLong Yu, \nJiangtao Wen, \nYuxing Han","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"b871ba1daecbdb864ec6badab1a0028f31d5a2cb5a54e1e40edef53e6b27b184","category":"Environment"}