{"title":"Roku-YouTube Dispute Escalates","link":"https://www.protocol.com/youtube-tv-roku-issues","date":1619822073000,"content":"\n<p>Janko Roettgers, reporting for Protocol:</p>\n\n<blockquote>\n  <p>Roku is alleging that Google is using the YouTube TV negotiations\nto push it to enforce hardware requirements for future Roku\nproducts that could make Roku devices more expensive. This\nallegation bears some extra weight because of Google’s own\nChromecast TV streaming device, which is currently selling for $20\nmore than the cheapest Roku streamer. […]</p>\n\n<p>Roku also alleges that Google aims to dictate how the streaming\ndevice maker treats voice search results. According to those\nallegations, Google wants to force Roku to only show YouTube\nresults when someone launches a voice search from within the\nYouTube app. If, for instance, someone browses YouTube and then\ndecides to listen to music, a voice query like “Play ‘Uptown\nFunk’” would open the song on YouTube, even if the consumer had\nset Pandora as their default music app.</p>\n</blockquote>\n\n<p>Roku has removed the YouTube TV app from their store, but it still works for users who already have it installed.</p>\n\n<p>Google, <a href=\"https://blog.youtube/news-and-events/update-our-youtube-tv-members-roku/\">in its response on the official YouTube blog</a>, doesn’t deny the requirements for the new AV1 codec, but flatly denies the rest of Roku’s allegations:</p>\n\n<blockquote>\n  <p>Our agreements with partners have technical requirements to ensure\na high quality experience on YouTube. Roku requested exceptions\nthat would break the YouTube experience and limit our ability to\nupdate YouTube in order to fix issues or add new features. For\nexample, by not supporting open-source video codecs, you wouldn’t\nbe able to watch YouTube in 4K HDR or 8K even if you bought a Roku\ndevice that supports that resolution.</p>\n\n<p>We can’t give Roku special treatment at the expense of users. To\nbe clear, we have never, as they have alleged, made any requests\nto access user data or interfere with search results. This claim\nis baseless and false.</p>\n</blockquote>\n\n<p>This is remarkably contentious. I don’t see any way to square this up without concluding that one of the companies is flat-out lying.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/30/roku-youtube\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b879f4f183c131514e5b9e9ebc2824ef4bd92745fbb0c6eb23cbd1d6b39d1642","category":"Tech"}