{"title":"The impact of benzoic acid and lactic acid on the treatment efficiency and microbial community in the sulfur autotrophic denitrification process","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11056?af=R","date":1717311600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/55a01194-9fa2-4d38-a8db-8131e20377a0/wer11056-toc-0001-m.png\" alt=\"The impact of benzoic acid and lactic acid on the treatment efficiency and microbial community in the sulfur autotrophic denitrification process\" />\n<p>This study investigates the effects of benzoic acid and lactic acid on sulfur autotrophic denitrification. The results show that both organic acids promote denitrification activity while leading to a decrease in microbial abundance.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Nitrate poses a potential threat to aquatic ecosystems. This study focuses on the sulfur autotrophic denitrification mechanism in the process of water culture wastewater treatment, which has been successfully applied to the degradation of nitrogen in water culture farm effluents. However, the coexistence of organic acids in the treatment process is a common environmental challenge, significantly affecting the activity of denitrifying bacteria. This paper aims to explore the effects of adding benzoic acid and lactic acid on denitrification performance, organic acid removal rate, and microbial population abundance in sulfur autotrophic denitrification systems under optimal operating conditions, sulfur deficiency, and high hydraulic load. In experiments with 50 mg·L<sup>−1</sup> of benzoic acid or lactic acid alone, the results show that benzoic acid and lactic acid have a stimulating effect on denitrification activity, with the stimulating effect significantly greater than the inhibitory effect. Under optimal operating conditions, the average denitrification rate of the system remained above 99%; under S/N = 1.5 conditions, the average denitrification rate increased from 88.34% to 91.93% and 85.91%; under HRT = 6 h conditions, the average denitrification rate increased from 75.25% to 97.79% and 96.58%. In addition, the addition of organic acids led to a decrease in microbial population abundance. At the phylum level, <i>Proteobacteria</i> has always been the dominant bacterial genus, and its relative abundance significantly increased after the addition of benzoic acid, from 40.2% to 61.5% and 62.4%. At the genus level, <i>Thiobacillus</i>, <i>Sulfurimonas</i>, <i>Chryseobacterium</i>, and <i>Thermomonas</i> maintained high population abundances under different conditions.</p>\n<h2>Practitioner Points</h2>\n<p>\nEmploying autotrophic denitrification process for treating high-nitrate wastewater.\nUtilizing organic acids as external carbon sources.\nDenitrifying bacteria demonstrate high utilization efficiency towards organic acids.\nOrganic acids promote denitrification more than they inhibit it.\nThe promotion is manifested in the enhancement of activity and microbial abundance.\n</p>","author":"Jiancheng Du, \nBing Xu, \nGuangxiang Ma, \nLiang Ma, \nJinhao Liang, \nKe Li, \nHui Jiao, \nBinbin Tian, \nBingxu Li, \nLinfeng Ma","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"b87f53de6d47898d231b5805ab166b6dcd2280d353efeae07f397b6ccee96157","category":"Environment"}