{"title":"Cycling in the heat: here’s how you can make the most of the hot weather","link":"https://www.bikeradar.com/advice/fitness-and-training/cycling-in-hot-weather/","date":1686823200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beat-the-heat-07-7e4d004.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Beat the heat - riding in hot weather\" title=\"Beat the heat - 07\" />                                            <p>Compared to running or any non-water-based team sports, cycling is surely the most pleasurable in a heatwave. The increased speeds and bike-generated movement of air provide a cooling blanket of sorts over the rider.</p>\n<p>That windchill, however, can be devious and disguise just how hard we’re working, just how hot it is and how much we’re sweating. This is why staying hydrated on the bike this summer is paramount to your riding performance and enjoyment.</p>\n<p>And there’s no doubting it is getting hotter, with 2018 the joint hottest summer since records began and 2022 recording the UK’s highest ever temperature of 40.3°C. While that’s good for ice cream sales, the physical effects on cyclists are proven and pose problems.</p>\n<p>In terms of performance, an <a href=\"https://research.monash.edu/en/publications/effects-of-heat-stress-on-physiological-responses-and-exercise-pe\" target=\"_blank\">Australian study</a> found that when cyclists exercise in 32°C heat, their power output drops by 6.5 per cent, while dehydration, cramping and hyponatremia (when the concentration of sodium in your blood is abnormally low) are all dangers of insufficient fuelling on the bike.</p>\n<p>“Largely due to genetics, everyone loses a different amount of sodium in their sweat, from as little as 200mg per litre of sweat, to as much as 2,000mg/l,” says Andy Blow, founder of Precision Fuel &amp; Hydration, which helps athletes establish how much sodium is lost when they sweat and develop personalised hydration and fuelling strategies.</p>\n<p>Sweat contains salt, comprising 40 per cent sodium and 60 per cent chloride, so the more you sweat, the more sodium you lose.</p>\n<p>But sodium losses are just one part of the hydration jigsaw, says Blow. How much sodium you lose in sweat isn’t the sole indicator of what you should be drinking when cycling. This depends on how much you’re sweating and over what period.</p>\n<p>In this guide, we look at how best to stay hydrated and fuelled, and offer some practical tips for staying safe when the sun’s out in full force.</p>\n<h2>9 tips for cycling in hot weather</h2>\n<h3>1. Hydrate, but don’t drink too much</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Beat the heat - riding in hot weather\" title=\"Beat the heat - 08\" /></div><div><figcaption><span><i></i> Adding sodium tabs to your drink will aid electrolyte levels.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Hyponatremia is a condition when the concentration of sodium in your blood is abnormally and dangerously low, and can lead to athletes collapsing or worse during endurance sports events.</p>\n<p>“Hyponatremia can be a result of athletes shifting from slightly under-drinking before training to significantly over-drinking pre-training with plain water or weak sports drinks, which leads to an inadequate replacing of the sodium lost when sweating and further dilutes the concentration of sodium in the body,” says Blow.</p>\n<p>So how do we find the balance between pre-loading and over-drinking?</p>\n<p>“Take in one or two additional cups of fluid each day in the final couple of days before your event, but don’t go crazy by drinking above what your body is telling you it needs,” Blow explains.</p>\n<p>“Urine colour and thirst are helpful indicators of hydration status disposal. Ensure your pee isn’t too dark in colour or low in volume and don’t mistake a large amount of really clear urine as a universally good thing.</p>\n<p>“You can increase sodium intake by adding <a href=\"/features/what-are-electrolytes/\">electrolyte</a> supplements to the water that you’re drinking or by putting additional salt on your food.”</p>\n<h3>2. Start hydrated</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, bottles\" title=\"14-00-34_SNY0520\" /></div><div><figcaption><span><i></i> An electrolyte drink before a ride will pay dividends.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>The health dangers of dehydration are clear, but there’s also a clear impact on performance when you’re dehydrated, with more blood sent to your skin to release heat and less then going to your muscles to deliver oxygen and nutrients.</p>\n<p>The result is a lower power output, higher heart and breathing rates, and your brain also suffers a drop in neurotransmitters, which leads to fatigue.</p>\n<p>“Drinking a strong electrolyte drink to optimise your hydration status before long, hot or really hard rides and events can significantly improve your performance,” says Blow.</p>\n<p>“This is ‘pre-loading’. There’s strong evidence that taking in additional sodium with fluids before you start sweating is effective in promoting increased acute fluid retention and in improving endurance performance, especially in the heat.”</p>\n<h3>3. Prevent sunburn</h3>\n<p>Radiation from the sun is another factor that catches many people out. A dab of sun cream does not give you a permanent shield against the sun.</p>\n<p>In most cases you have a two-hour barrier – you’ll need to reapply if you’re riding in the sun for any longer than this.</p>\n<h3> 4. Acclimatise on the turbo</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Wahoo Kickr smart trainer 2020\" title=\"Wahoo Kickr smart trainer 2020\" /></div><div><figcaption><span><i></i> You can use a turbo trainer to acclimatise to riding in the heat.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Heat acclimatisation is useful if your event is somewhere hot, because it teaches your body to sweat, and you can also do this at lower intensities indoors.</p>\n<p>When you’re on the <a href=\"/advice/buyers-guides/best-smart-trainer/\">turbo trainer</a>, turn off the fan and/or shut any windows and you’ll gradually improve.</p>\n<p>You can also move the turbo somewhere hot such as a conservatory, which is something triathlete and famed heat sufferer Jonny Brownlee did before the 2020 Olympics in a bid to replicate the heat of Tokyo in the Yorkshire winter (the result was a gold medal in the relay and a top-five finish in the individual event).</p>\n<p>Heat turbo sets are also an ideal time to practise your hydration strategy.</p>\n<p>And, if you don’t have a turbo or want to keep riding outdoors for all the benefits it brings, you can look at wearing more layers on your training rides ahead of your event.</p>\n<h3>5. Have a hot bath</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Hand turning off bath tap.\" title=\"Turning Tap\" /></div><div><figcaption><span><i></i> Hot baths can help acclimatise you to heat.</span></figcaption><span> <i>Catherine Falls Commercial</i></span></div>\n<p>In 2020, Dr Jessica Mee conducted research on pre-event acclimatising. The results found that if you take a hot bath after exercising in cool conditions, building up from 10 to 20 to 40 minutes (in the bath) over the course of six days, you get a profound reduction in resting core temperature of about a third of a degree, which more than bettered exercise heat acclimatisation.</p>\n<h3>6. Choose liquids and semi-solids for fuel</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Science in Sport indoor training gels\" title=\"Science in Sport indoor training gels\" /></div><div><figcaption><span><i></i> Energy gels are a good way to consume energy when heat lowers your appetite.</span></figcaption><span></span></div>\n<p>Hot weather can also upset your digestion by reducing blood flow to the gastrointestinal tract. “Dehydration can also impair our ability to transport nutrients through the intestine lining,” says<br />\nEF Pro Cycling nutritionist Will Girling.</p>\n<p>“Heat will lower your appetite, so opt for liquids and semi-solids, such as energy gels,” says Girling.</p>\n<p>Try making <a href=\"/advice/nutrition/6-delicious-flapjack-and-breakfast-bar-recipes-to-boost-your-riding-energy/\">homemade flapjacks</a> for long rides because they have a higher moisture content than many dry energy bars.</p>\n<h3>7. Cool clothing</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Beat the heat - riding in hot weather\" title=\"Beat the heat - 05\" /></div><div><figcaption><span><i></i> Make sure you get your kit right – whatever the weather.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>What you <a href=\"/advice/buyers-guides/how-to-dress-for-summer-cycling/\">wear in summer</a> is as crucial as kit choices for riding in the cold. Your <a href=\"/advice/sizing-and-fit/how-to-wear-bike-helmet/\">helmet</a> should feature plenty of cooling vents and you need a pair of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-glasses-for-cycling/\">best cycling sunglasses</a> to filter harmful UV rays.</p>\n<p>Look for a <a href=\"/advice/buyers-guides/best-cycling-jerseys/\">cycling jersey</a> with mesh panels to aid ventilation (but watch out for sunburn). Light-coloured clothing is better at reflecting heat, but some dark jerseys feature a textile called Coldblack that helps reflect the sun to prevent heat build-up.</p>\n<p>“Colour makes less of a difference than you might think, especially while moving,” explains Yanto Barker, founder of Le Col clothing.</p>\n<p>“A summer <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-base-layers/\">baselayer</a> will help wick sweat away and circulate airflow more evenly to avoid sweat pooling,” adds the former pro rider.</p>\n<h3>8. Be aware of the conditions</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Joel Saget crashing at the 2003 Tour de France\" title=\"Joseba-Beloki\" /></div><div><figcaption><span><i></i> Joseba Beloki crashed at the 2003 Tour de France on melted tarmac.</span></figcaption><span> <i>Joel Saget / Getty Images</i></span></div>\n<p>Black strips of tarmac absorb the heat from the sun easily and by the time the day’s stage starts, road surface can easily reach 50-80°C. In turn, the air directly above is heated up like a kettle, so when the temperature in the shade is 32 to 40°C, that could equate to 50°C or more for the cyclist.</p>\n<p>Sometimes, roads at the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> reach such extreme temperatures that the tarmac can become sticky, catching out unsuspecting riders as they descend at 80kmph plus. In 2003, ONCE’s Joseba Beloki was in second place overall and descending from Col de la Rochette. The most diligent course recce wouldn’t have unearthed a patch of tarmac softened by the midday sun, which sent Beloki skidding, breaking his femur, elbow and wrist.</p>\n<p>The organisers took notice and ever since 2003 now deploy water tankers before the peloton are due through, to spray sections of road that are susceptible to melting.</p>\n<h3>9. Calculate your sweat rate</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Cyclist man, sweating and focus for marathon race, competition or sports event on sky mock up for advertising space or marketing. Cycling sports person in helmet tired for training fitness challenge\" title=\"Cyclist man, sweating and focus for marathon race, competition or sports event on sky mock up for advertising space or marketing. Cycling sports person in helmet tired for training fitness challenge\" /></div><div><figcaption><span><i></i> Calculating your sweat rate can help you determine what type of fluid to drink.</span></figcaption><span> <i>iStock / Getty Images Plus</i></span></div>\n<p>Estimating your sweat rate can be useful when working out how much and what type of fluid (water or electrolytes) you need to drink in training and in races. All you will need to establish an estimate is an accurate set of weighing scales and a drying towel.</p>\n<p>Before you start the workout, go to the toilet, then weigh yourself (ideally in the nude). Remember, if you are planning to drink, hold your <a href=\"/advice/buyers-guides/best-cycling-water-bottles/\">water bottles</a> and include them in your ‘before’ weight.</p>\n<p>Usually, people try to simulate ‘race pace’, so they can calculate how much fluid they’ll need for races. Be sure to log the temperature, humidity and intensity of the workout, so you can monitor how your sweat rate changes across different conditions. Indoor sessions are much easier to control, so we’d recommend doing this kind of test on the turbo or on a treadmill.</p>\n<p>After the workout, towel yourself as dry as you can, then weigh yourself (again, ideally in the nude as your clothing can retain a lot of sweat). This is your ‘after’ weight. Remember to hold your water bottles to account for how much you drank, even if they are empty.</p>\n<p>To estimate your sweat rate, simply subtract ‘after’ weight from ‘before’ weight. For example: following a one-hour workout, if ‘before’ weight was 71kg and ‘after’ weight was 70kg, this equals a 1kg loss. 1kg is equal to 1l, therefore for this workout, your sweat rate would be 1l per hour.</p>\n<p>This will give you a guide to how much fluid you should aim to replace during exercise. Replacing 100 per cent of your fluid losses isn’t necessary, and can actually be detrimental to performance, but under-hydrating can be just as detrimental, so it’s important to strike the correct balance.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b87ff72f100345e0d28710b99e80093b981083d88eabbb5e595e2809fb27dd3e","category":"Cycling"}