{"title":"A new tool for setting biodiversity management priorities adapted from aquatic invasive species management: A pilot using Atlantic salmon (Salmo salar) in NS, Canada","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12340?af=R","date":1717645183000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8c556be1-88a7-45bc-aae2-fba7fc126ba8/eso312340-toc-0001-m.png\" alt=\"A new tool for setting biodiversity management priorities adapted from aquatic invasive species management: A pilot using Atlantic salmon (Salmo salar) in NS, Canada\" />\n<p>We adapted the species-sites-pathways concept to develop an integrated management approach to aquatic invasive species (AIS) and Atlantic salmon management in Nova Scotia, Canada. We adapted and created novel tools to determine (1) AIS impacts on Atlantic salmon and management action that could lessen their impacts, (2) sites of high conservation value for Atlantic salmon and (3) the risk of active vectors to spread AIS to these areas. We offer proactive, geographically specific solutions to improve both AIS and Atlantic salmon management and explore the possibility of using these tools and approach for setting other biodiversity and conversation priorities.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAquatic invasive species (AIS) are a leading cause of global loss of biodiversity. However, the relationships between AIS and vulnerable species (e.g. species at risk and endemic species) are not well-documented and few studies have combined risk of AIS invasion with species distribution modelling of vulnerable species.\n\nAn integrated management approach was developed and applied to assess the effects and risks of AIS on Atlantic salmon (<i>Salmo salar</i>) in Nova Scotia (NS), Canada. A semi-quantitative risk assessment tool was used to evaluate the risk of introduction, establishment and ecological impact of eight AIS currently found across NS. A suitable habitat for Atlantic salmon was predicted using a random forest model and identified watersheds of high conservation value. A vector-based screening-level risk assessment was developed to determine the relative risk of potential vectors introducing AIS into each primary watershed in NS, alongside other anthropogenic pressures. Finally, a matrix was developed to provide recommendations to AIS managers based on species invasion stage and invasion risk score.\n\nResults from this study showed that ecosystem engineer species (e.g. crayfish and invasive plants) were more likely to affect invaded ecosystems, but were less widely reported in NS While invasive piscivores (e.g. chain pickerel [<i>Esox niger</i>], smallmouth bass [<i>Micropterus dolomieu</i>]) had less potential ecosystem impacts, they were more widely reported in the assessment area. Hitchhiking on watercraft and fishing gear were the riskiest vectors for continued spread of AIS in NS. The AIS Management Matrix supports recommendations of scenarios in which AIS could be eradicated or where response plans may be developed to control, contain and respond to new introductions. The Herring Cove Medway and the Salmon Mira were the top two watersheds recommended for Atlantic salmon conservation and AIS control or prevention based on habitat conservation value. Water temperature and physical changes to freshwater habitat (especially adjacent land use) were the model variables that were most important to predict Atlantic salmon habitat suitability.\n\nAt a time of heightened global biodiversity loss, but limited dedicated conservation resources, the integrated management approach developed in this study can be applied to recommend geographically specific actions to managers for strategic vulnerable species conservation planning and AIS management.\n</p>","author":"Sarah Kingsbury, \nBen R. Collison, \nRemi Daigle, \nJ. Derek Hogan, \nBen Lowen, \nAndrew G. Lowles, \nChristine Stortini, \nMarc Trudel, \nSarah M. Tuziak","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"b87f3a37ad19cbabb29d5a4b2d69bda8cb97b972e2b378906bec59ea6a129e51","category":"Environment"}