{"title":"The trajectory of body image dissatisfaction during pregnancy and postpartum and its relationship to Body-Mass-Index","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309396","date":1724680800000,"content":"<p>by Katja Linde, Franziska Lehnig, Julia Treml, Michaela Nagl, Holger Stepan, Anette Kersting</p>\r\nBackground <p>During pregnancy, women’s bodies undergo rapid body weight and size changes within a relatively short period. Pregnancy may therefore, be associated with an increased vulnerability for developing body image dissatisfaction linked to adverse health outcomes for the mother (e.g., depression, eating disorders) and child (e.g., impaired self-regulation, childhood obesity). The present study aims to examine the prevalence and trajectories of body image dissatisfaction during pregnancy and postpartum and its relationship to pre-pregnancy BMI. This is the first study that investigates prevalence rates of body image dissatisfaction not only ante- but also postpartum, and that compares trajectories of women with normal weight and overweight.</p> Methods <p>A prospective longitudinal design with a quantitative approach was applied. Healthy pregnant women (N = 136) answered paper-pencil or online questionnaires at four time points (18th-22nd and 33rd-37th week of gestation, 3 and 6 months postpartum). Body image dissatisfaction was assessed using the German version of the Body Shape Questionnaire (BSQ) and the Eating Disorder Examination Questionnaire (EDE-Q). Both questionnaires are considered reliable and valid measures of several aspects of body image, and the BSQ allows for calculating prevalence rates by providing cut-off values. Using not just one but two body image questionnaires, trajectories of body image dissatisfaction can be compared. Pre-pregnancy BMI was assessed retrospectively via self-reported weight and height.</p> Results <p>The proportion of women reporting elevated levels of body image dissatisfaction was 6.6% (n = 9) in the second trimester, 2.9% (n = 4) in the third trimester, 11.0% (n = 15) three months postpartum, and 10.3% (n = 14) six months postpartum. Repeated measures ANOVA revealed that body image dissatisfaction significantly decreased from pre-pregnancy to pregnancy, remained stable during pregnancy, and returned to pre-pregnancy levels three to six months postpartum. Mixed between-within ANOVA showed that the overweight/obese group reported significantly higher levels of body image dissatisfaction at each measurement point except during the third trimester than women in the normal weight group. Significant but small interaction effects between time and pre-pregnancy BMI were found.</p> Conclusions <p>The results revealed that approximately every tenth woman is affected by body image dissatisfaction after childbirth. Women with a higher BMI level before pregnancy are particularly at risk of experiencing body image dissatisfaction. Healthcare providers should screen for body image dissatisfaction, in particular after childbirth, and inform affected women about possible adverse health outcomes and treatment options. Study limitations concern the drop-out rate of 51.4% and the retrospective and self-reported assessment of pre-pregnancy BMI. Future studies should include additional assessment points in the first trimester and more than six months postpartum and try to include a matched control group of non-pregnant women to compare prevalence rates and trajectory of body image dissatisfaction.</p>","author":"Katja Linde","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b881f64b775dd8dd2f027e3fafa17d5853af35fc7226992e41d45520a13f5ed7","category":"Interdisciplinary"}