{"title":"‘Apple Buying Disney Isn’t the Fairy Tale It Once Was’","link":"https://www.macworld.com/article/2032120/apple-disney-merger-netflix-growth.html","date":1692915263000,"content":"\n<p>A Jason Snell daily double — this time his Macworld column, speculating on rumors of an Apple acquisition of Disney:</p>\n\n<blockquote>\n  <p>If this sounds outlandish, well, if I traveled back in time to\n2011 and told you that Apple would be producing some of the best\nTV shows in the world, wouldn’t that seem bizarre? And yet the\ncompany has grown and changed–and will continue to.</p>\n\n<p>But leaving the growth aside for a moment, there’s also this:\nApple and Disney <em>do</em> have ties. They do feel similar in so many\nways. From the Imagineers working on new Disneyland features to\nthe VFX artists at Industrial Light &amp; Magic to the animators at\nPixar, so much of Disney is located at the same intersection of\nTechnology and the Liberal Arts that Apple calls home. (And when I\nlook at the bill for my last family trip to Disneyland, I\nrecognize that both companies are very good at charging me a lot\nof money.)</p>\n</blockquote>\n\n<p>Last week when I was working — slowly, as ever — <a href=\"https://daringfireball.net/2023/08/disney_and_apple_sitting_in_a_tree\">on my own take</a> on the Apple-Disney speculation, I saw in my feed reader that Snell had published his own take. So, I averted my eyes until I finished my own. Glad I did, because I’m not sure I would have been able to resist lifting that keen observation about both companies residing at the intersection of Technology and the Liberal Arts. That’s exactly why this whole notion, though unlikely, <em>feels</em> like a “but, well ... <em>maybe</em>” idea.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/24/snell-apple-disney\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b886ae4eae8a6c47d2657a5f77d9e7556fb0a86d170aec128624ca3458c0dee6","category":"Tech"}