{"title":"Apple Calls Facebook-Commissioned Study on Preinstalled App Usage 'Seriously Flawed'","link":"https://www.macrumors.com/2021/07/07/facebook-study-on-preinstalled-app-usage/","date":1625668835000,"content":"The majority of apps used by <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and Android users are made by Apple and Google, according to a study commissioned by Facebook that was shared with <a href=\"https://www.theverge.com/2021/7/7/22549338/apple-google-apps-comscore-study-facebook\"><em>The Verge</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Facebook-Feature.jpg\" />\r\n<br />\r\nThe first-of-its-kind Comscore study ranks the popularity of preinstalled iOS and Android apps alongside third-party apps, indicating that the most popular apps are preinstalled. The results show that on iOS, stock apps such as Weather, Calculator, and Clock, are more popular than YouTube, Facebook, and Amazon. The statistics are similar for Android, where pre-installed Google apps dominate the rankings.\r\n<br />\r\n\r\n<br />\r\nAccording to the findings, 75 percent of the top 20 apps on iOS in the U.S. were made by Apple, while Google made 60 percent of the top apps on Android. The top four apps on both platforms were made by their respective parent company.\r\n<br />\r\n\r\n<br />\r\nThe unique study reveals a number of quirks including the fact that Apple's Calculator app has more users than Gmail on Android. Facebook is the only third-party developer with more than one app on the iOS list of apps and the only developer with three apps on the Android list.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/top-20-applications-on-ios-and-android.jpg\" />\r\n<br />\r\nComscore procured data from apps and websites last December to produce the study, alongside information from a study of 4,000 people that asked about the default apps they used during November 2020. The study excluded browsers in the rankings and \"embedded operating system features\" such as voice assistants.\r\n<br />\r\n\r\n<br />\r\nFacebook said that it paid for the Comscore study to show the \"impact of preinstalled apps on the competitive app ecosystem,\" hinting at the apparently anti-competitive nature of Android and iOS. Facebook has found itself increasingly <a href=\"https://www.macrumors.com/2021/01/28/facebook-preparing-antitrust-lawsuit-against-apple/\">at odds with Apple</a>, criticizing the company's <a href=\"https://www.macrumors.com/2020/10/26/apple-policies-stifle-facebook-cloud-games/\">limitations on third-party developers</a>, privacy measures <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">such as App Tracking Transparency</a>, the inability for <a href=\"https://www.macrumors.com/2020/09/25/facebook-lobbying-to-make-messenger-default/\">Messenger to be selected as the default</a> on the ‌iPhone‌, and more.\r\n<br />\r\n\r\n<br />\r\nThe report suggests that some app categories that already have a pre-installed app, such as Weather, are difficult for other apps from third parties to compete in. However, it is worth noting that default apps do not win out in every category; for example, <a href=\"https://www.macrumors.com/guide/maps/\">Apple Maps</a> and <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> do not appear in the rankings at all, while Gmail is represented alongside Apple Mail.\r\n<br />\r\n\r\n<br />\r\nSpeaking to <em>The Verge</em>, Apple scolded the report as \"seriously flawed in a number of ways.\"<blockquote>This Facebook-financed survey from December 2020 was narrowly tailored to give the false impression that there's little competition on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. In truth, third-party apps compete with Apple's apps across every category and enjoy large scale success.</blockquote>The spokesperson for Apple criticized the report's methodology and said that the results contradicted Comscore's recent April 2021 rankings on app usage, even if those previous rankings excluded pre-installed apps.\r\n<br />\r\n\r\n<br />\r\nNevertheless, Facebook clearly hopes that the study will point to the power platform owners have over what apps users choose to use on their devices.<div>Tag: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/07/facebook-study-on-preinstalled-app-usage/\">Apple Calls Facebook-Commissioned Study on Preinstalled App Usage 'Seriously Flawed'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-calls-facebook-commissioned-study-on-preinstalled-app-usage-seriously-flawed.2303519/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OEeASY6azIU:jBHhBe5wRDE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OEeASY6azIU:jBHhBe5wRDE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/OEeASY6azIU\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b8912a14308f113974313cdc951239057a9db53177f0c26dd7b9ddd65be20925","category":"Apple"}