{"title":"Social media restrictions “profoundly damaging,” Biden admin tells SCOTUS","link":"https://arstechnica.com/?p=1968691","date":1694797998000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1681096584-800x556.jpg\" alt=\"Social media restrictions “profoundly damaging,” Biden admin tells SCOTUS\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1681096584.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/president-joe-biden-delivers-remarks-at-prince-georges-news-photo/1681096584\">Kevin Dietsch / Staff | Getty Images North America</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In July, a federal judge issued an order <a href=\"https://arstechnica.com/tech-policy/2023/07/judge-rules-white-house-pressured-social-networks-to-suppress-free-speech/\">limiting the Biden administration's social media contacts</a> over Republicans' concerns that officials illegally suppressed speech. That order <a href=\"https://arstechnica.com/tech-policy/2023/09/order-limiting-biden-admin-contacts-with-social-networks-is-mostly-overturned/\">was mostly overturned</a> last week, and now, US Solicitor General Elizabeth B. Prelogar has rushed to ask the Supreme Court to reevaluate one of the order's remaining restrictions.</p>\n<p>In a <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Murthy-v-Missouri-Stay-of-Injunction-Application-9-14-2023.pdf\">court filing</a> yesterday, Prelogar requested that the Supreme Court extend the stay of a preliminary injunction banning officials from \"coercing\" or \"significantly encouraging\" social media content removals. The injunction would've taken effect Monday, but the Biden administration wants the stay extended while the Supreme Court reviews the lower court's decision. If the stay isn't extended, Prelogar argued that the allegedly overly broad injunction \"would impose grave and irreparable harms on the government and the public\" by preventing officials from quickly responding during emergencies and generally advocating and defending policies that advance the public interest.</p>\n<p>The \"sweeping preliminary injunction\" governs \"thousands of federal officials’ and employees’ speech concerning any content posted on any social-media platform by anyone,\" Prelogar said. \"The implications of the Fifth Circuit’s holdings are startling. The court imposed unprecedented limits on the ability of the President’s closest aides to use the bully pulpit to address matters of public concern, on the FBI’s ability to address threats to the Nation’s security, and on the CDC’s ability to relay public health information at platforms’ request.\"</p></div><p><a href=\"https://arstechnica.com/?p=1968691#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1968691&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b8931b950b0a705d95dd043dd59397f4a9942469abdc3bec52563c6e8fd246c2","category":"Tech"}