{"title":"Varda looks to Australia after delays in obtaining US reentry approval","link":"https://arstechnica.com/?p=1977278","date":1697750135000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/vardaentryart-800x450.jpg\" alt=\"Artist's illustration of Varda's reentry capsule.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/vardaentryart.jpg\">Enlarge</a> <span>/</span> Artist's illustration of Varda's reentry capsule. (credit: Varda Space Industries)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Varda Space Industries says it has reached an agreement with a private range operator in Australia for spacecraft landings as early as next year after the US government declined to grant approval for the reentry of Varda's first experimental mission carrying pharmaceuticals manufactured in orbit.</p>\n<p>After years of applications, reviews, and discussion, the Federal Aviation Administration and the US Air Force would not clear Varda's spacecraft to land at a military test range in the Utah desert last month. An Air Force spokesperson told Ars it did not grant approval for the landing \"due to the overall safety, risk, and impact analysis.\"</p>\n<p>Likewise, the <a href=\"https://arstechnica.com/space/2023/09/permission-denied-for-reentry-of-vardas-orbiting-experiment-capsule/\">FAA denied Varda's application for a commercial reentry license</a> in early September. Varda's first small satellite mission launched in June as a rideshare payload on a SpaceX rocket. The company's leaders say they are still working with the FAA and the Air Force in hopes of getting the spacecraft back to Earth in Utah in the coming months, but now they're looking at other options for future missions.</p></div><p><a href=\"https://arstechnica.com/?p=1977278#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977278&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b89552c384d7a7e8b2bf149e509ff4b52a77374971a1dee74978aa58ed771a75","category":"Tech"}