{"title":"Potential Utility of a 4th Generation EGFR-TKI and Exploration of Resistance Mechanisms &ndash; an In Vitro Study","link":"https://www.preprints.org/manuscript/202406.0009/v1","date":1717462421000,"content":"The emergence of acquired resistance to EGFR-TKIs is almost inevitable even after a remarkable clinical response. Secondary mutations such as T790M and C797S are responsible for the resistance to 1st/2nd generation (1/2G) TKIs and 3G TKIs, respectively. To overcome both the T790M and C797S mutations, novel 4G EGFR-TKIs are now under early clinical development. In this study, we evaluated the efficacy of a 4G EGFR-TKI in the treatment of lung cancer with EGFR mutation as well as explored resistance mechanisms to a 4G TKI. First, we compared the efficacies of seven TKIs including a 4G TKI, BI4020, against Ba/F3 cell models that simulate resistant tumors after frontline osimertinib treatment failure because of a secondary mutation. We also established acquired re-sistant cells to BI4020 by chronic drug exposure. Ba/F3 cells with an osimertinib-resistant secondary mutation were refractory to all 3G TKIs tested (alflutinib, lazertinib, rezivertinib, almonertinib, and befotertinib). BI4020 inhibited the growth of C797S-positive cells; however it was not effective against L718Q-positive cells. Erlotinib was active against all Ba/F3 cells tested. In the analysis of resistance mechanisms of BI4020 resistant (BIR) cells, none harbored secondary EGFR mutations. HCC827BIR cells had MET gene amplification and were sensitive to a combination of capmatinib (MET-TKI) and BI4020. HCC4006BIR and H1975BIR cells exhibited epithelial to mesenchymal transition. This study suggests that erlotinib may be more suitable than 4G TKIs to overcome sec-ondary mutations after front-line osimertinib. We found that off-target mechanisms that cause re-sistance to earlier generation TKIs will also cause resistance to 4G TKIs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b8961df2e940092d7c7a89a3c5f297e2429edc5694fd16cfb0505209a9c26dd8","category":"Interdisciplinary"}