{"title":"Peripheral Arterial Disease prevalence and risk factors in the Eastern Caribbean Health Outcomes Research Network (ECHORN) cohort","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306918","date":1724680800000,"content":"<p>by O. Peter Adams, Deron Galusha, Josefa L. Martinez-Brockman, Euclid H. Morris, Saria Hassan, Rohan G. Maharaj, Cruz M. Nazario, Maxine Nunez, Marcella Nunez-Smith</p>\r\nIntroduction <p>Peripheral arterial disease (PAD) indicates generalised atherosclerotic disease but is often asymptomatic. The prevalence and potential risk factors of PAD were studied in ECHORN cohort study participants.</p> Methods <p>Representative samples of community-dwelling people ≥40 years of age residing in Barbados, Puerto Rico, Trinidad, and the USVI were recruited. The survey included questions on diabetes, hypertension, heart disease and smoking status. Body Mass Index, HbA1c, blood glucose and lipids were determined. Ankle brachial index (ABI) was evaluated in one leg. An oscillometric device measured arm and leg systolic BP simultaneously. ABI classifications were PAD ≤0.90, borderline 0.91 to 0.99, normal 1.00 to 1.40, and non-compressible &gt;0.40. Multivariable logistic regression tested associations of potential risk factors with PAD.</p> Results <p>Of 2772 participants (mean age 57.3, 65.2% female), 35.8% were overweight, 38.1% obese, 32.4% had diabetes, 60% hypertension, and 15.4% reported heart. ABI prevalence (95% CI) by category was PAD 4.4% (3.6%, 5.1%), borderline 5.2% (4.4%, 6.1%), normal 87.0% (85.8%, 88.3%) and noncompressible 3.4% (2.7%, 4.0%). Female sex (OR 1.72, 95% CI 1.07 to 2.77), diabetes (OR 2.23, 95% CI 1.47 to 3.4), heart disease history (OR 1.74, 95% CI 1.07 to 2.83) and less than high school education vs having a university degree (OR 2.49, 95% CI 1.19 to 5.22) were independently associated with PAD.</p> Conclusions <p>Testing one leg only would underestimate PAD prevalence. Increasing the ABI cutoff for identifying PAD to &lt;1.0 when using oscillometric devices is suggested by some studies but would more than double the estimated prevalence. Guidelines need to address this issue. Female sex and lower educational attainment are important considerations when screening. While diabetes and a history of heart disease were confirmed as risk factors, the lack of association of increasing age and cigarette smoking with PAD was unexpected.</p>","author":"O. Peter Adams","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b8a8a144a04d5ecd035c7efb409cb9dfc0c08aa3a205a8cf9baf0405c1d42bef","category":"Interdisciplinary"}