{"title":"Google Messages update translates iMessage responses for Android users","link":"https://arstechnica.com/?p=1814889","date":1637605744000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/File-Nov-22-1-17-06-PM-800x475.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/File-Nov-22-1-17-06-PM.png\">Enlarge</a> (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Putting aside the lack of end-to-end encryption support, one of the most annoying things for Apple iPhone users about communicating with Android users via SMS are all the iOS features that get lost in translation. Having a visual effect translated to a deadpan \"(sent with Balloons)\" ruins whatever impact you intended the effect to have, and it clutters up your message history with extraneous text.</p>\n\n<p>On that second front, Apple’s Tapback feature is especially annoying. When using iMessage, this short list of half a dozen reactions is a handy way to signal acknowledgement or enjoyment, or just to bump a message thread to the top of someone’s list. On Android phones, each individual Tapback generates an entirely new block of text with a text description of the reaction and the entire original text. As a fallback option for non-smartphones or an accessibility feature, this isn’t necessarily a bad thing. But it can quickly make SMS group-text threads chaotic and unreadable for Android users.</p>\n<p>A new update to the <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.messaging&amp;hl=en_US&amp;gl=US\">Google Messages app</a>, which was <a href=\"https://9to5google.com/2021/11/19/google-messages-imessage-reaction-emoji/\">spotted over the weekend by 9to5Google</a> and appears to be rolling out to some Android users now, fixes that issue by translating Tapback responses into emoji responses. Android devices using the Messages app have been able to send each other emoji responses for <a href=\"https://www.theverge.com/2020/7/23/21336079/google-messages-reply-emoji-reactions-smart-reply-sticker\">over a year now</a>, but this is Google’s first attempt to map Apple’s response mechanism to its own.</p></div><p><a href=\"https://arstechnica.com/?p=1814889#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814889&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b8ab9ec367a1d5c5852fd6389ec757d9b47f154d23640b6fe00294f4fe7c5410","category":"Tech"}