{"title":"Effect of electron beam irradiation on raw goat milk: microbiological, physicochemical and protein structural analysis","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13518?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Goat milk is considered a nutritionally superior resource, owing to its advantageous nutritional attributes. Nevertheless, it is susceptible to spoilage and the persistence of pathogens. Electron beam irradiation stands as a promising non-thermal processing technique capable of prolonging shelf life with minimal residue and a high degree of automation.</p>\n<h2>RESULTS</h2>\n<p>The effects of electron beam irradiation (2, 3, 5, and 7 kGy) on microorganisms, physicochemical properties, and protein structure of goat milk compared with conventional pasteurized goat milk (PGM) was evaluated. It was found that a 2 kGy electron beam irradiation reduces the total microbial count of goat milk by 6-logs, and the irradiated goat milk protein secondary structure showed a significant decrease in ɑ-helix content. Low irradiation doses led to microaggregation and crosslinking. In contrast, high doses (≥ 5 kGy) slightly disrupted the aggregates and decreased the particle size, disrupting the microscopic surface structure of goat milk, verified by scanning electron microscopy and confocal laser scanning microscopy.</p>\n<h2>CONCLUSION</h2>\n<p>The irradiation of goat milk with a 2 kGy electron beam may effectively inactivate harmful microorganisms in the milk and maintain/or improve the physicochemical quality and protein structure of goat milk compared to thermal pasteurization. © 2024 Society of Chemical Industry.</p>","author":"Chunlu Wen, \nYue Peng, \nLinlu Zhang, \nYa Chen, \nJiangtao Yu, \nJunqing Bai, \nKui Yang, \nWu Ding","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"b8af60d1429fd997b73891511b74721225cbd98f29c2a95bc843812f3d5ba850","category":"Environment"}