{"title":"Belgium’s Ardennes and the overlooked cycling paradise","link":"https://www.cyclingtips.com/2023/04/belgiums-ardennes-and-the-overlooked-cycling-paradise/","date":1681978772000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9C_1267.jpg?width=1200\" alt=\"Belgium's Ardennes and the overlooked cycling paradise\" /></figure><p>Belgium’s Wallonia region and the Ardennes Forest don’t generate the same buzz and hype as its more famous neighbor in Flanders.</p>\n<p>Long-known for its grotty industrial zones and sometimes bleak post-modern urban wastelands, the region has undergone an incredible transformation over the past decade or so.</p>\n<p>Liège, the regional capital, is no longer the blight that it once was after the local steel and coal mining industries collapsed in the 1970s and 1980s. Urban renewal has given the city a facelift, and the city is now packed with buzzing cafés, restaurants, and rowdy nightlife.</p>\n<p>Everyone’s bucket list always includes a trip to Flanders for De Ronde and a shot at riding up the Koppenberg.</p>\n<p>Yet anyone venturing to Belgium shouldn’t miss a chance to visit the Ardennes. There’s great riding, excellent cuisine, and yes, even fine Belgian beer.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_3864.jpg?width=730\" alt width=\"1200\" height=\"762\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_3864.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_3864.jpg?width=190 190w\" /><figcaption>(Photo: Gruber Images/VeloNews)</figcaption></figure>\n<p>The narrow, winding roads and deep forests often featured in Liège-Bastogne-Liège and Flèche Wallonne hold their eternal charm.</p>\n<p>In contrast to the mostly flat Flanders region, which is punctured with the occasional “berg” made famous in the Tour of Flanders (technically called the Flemish Ardennes), the highlands of the French-speaking Wallonia region deliver some serious altitude and vertical challenges.</p>\n<p>OK, it’s not comparable to anything in the Alps or Pyrénées, but the endless string of ups and downs serves up stiff climbing obstacles. The highest point in the region is the Signal de Botrange (694m, 2,277ft).</p>\n<p>There are plenty of iconic climbs, including the famed La Redoute — former winner Philippe Gilbert grew up in the village just at the base of the climb — as well as Stockeu, the point where Eddy Merckx famously launched to win one year.</p>\n<p>The place is oozing with history, from the wide open boulevards and plazas in Liège to the battlefields of the Battle of the Bulge around Bastogne.</p>\n<p>And yes, there’s beer. Some of Belgium’s most famous beers, including La Chouffe and Chimay are brewed in the Belgian Ardennes.</p>\n<p>What’s not to love?</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_9402.jpg?width=730\" alt width=\"1200\" height=\"750\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_9402.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_9402.jpg?width=190 190w\" /><figcaption>Good food is never an issue in the Walloon. (Photo: Gruber Images/VeloNews)</figcaption></figure>\n<p>Many often package together Amstel Gold Race with the true <em>ardennaise</em> classics at Flèche Wallonne and Liège-Bastogne-Liège, but both geographically and politically, the Vimburg region of The Netherlands is not considered the Ardennes.</p>\n<p>Wallonia stretches across eastern and southern Belgium in the mostly French-speaking part of the nation. The largest cities are Liege, Charleroi, Mons, and Namur, and though it’s about the same size as Flanders, it’s not as heavily populated, good news for cyclists.</p>\n<p>The Ardennes stretch from southern and eastern Belgium into Luxembourg and dips slightly over the border into France and Germany. The region is laced with bike-friendly roads, quaint villages, and cozy inns and hotels.</p>\n<p>Off-road enthusiasts will know Houffalize as a longtime stop of the mountain bike World Cup series. There are hundreds of kilometers of trails there and in nearby Aywaille enough to keep mountain bikers happy for weeks.</p>\n<p>The booming gravel scene is also taking root in the Ardennes. Its deep forests are crisscrossed with forest roads that are ideal for two-wheel, off-road adventures.</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9C_0935.jpg?width=730\" alt width=\"1200\" height=\"960\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9C_0935.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9C_0935.jpg?width=190 190w\" /><figcaption>Rain and cold temperatures are common in the spring, but sometimes the weather is glorious. (Photo: Gruber Images/VeloNews)</figcaption></figure></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_8413.jpg?width=730\" alt width=\"1200\" height=\"654\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_8413.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9B_8413.jpg?width=190 190w\" /><figcaption>Good road surfaces and low traffic offer up superb road riding. Shown here a shot from the 2022 Liège-Bastogne-Liège. (Photos: Gruber Images/VeloNews)</figcaption></figure></figure>\n<p>That famous Belgian passion for cycling thrives in the Ardennes as well.</p>\n<p>Liège-Bastogne-Liège is Belgium’s oldest race, dating back to 1892, and is affectionately called <em>La Doyene</em> (The Old Lady).</p>\n<p>Though most of Belgium’s biggest stars hail from Flanders, riders like Frank Vandenbroucke and Claude Criquielion grew up in Wallonia (though those in Flanders will claim them both), along with Gilbert and today’s rising star Arnaud De Lie.</p>\n<p>Though Flanders might be more renowned beyond Europe among the cycling community, the hilly Ardennes country is in many ways an even better place to ride and explore.</p>\n<p>There’s less traffic, more variety of terrain, and just as much history.</p>\n<p>The region doesn’t pack some of the top sites such as Bruges or Ghent, but Liège provides plenty of urban adventures for anyone between riding.</p>\n<p>Head south and east out of Liège for the choicest roads.</p>\n<p>Anywhere along the Liège-Bastogne-Liège route is fine, and dip off the main roads into the small lanes that connect the spiderweb of rivers and hamlets.</p>\n<p>The big draw here is <em>moules</em>, and just about every bistro will have mussels in season. That’s the ideal energy food for knocking off century rides on the roads Merckx once ruled.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_4342.jpg?width=730\" alt width=\"1200\" height=\"800\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_4342.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/Z9A_4342.jpg?width=190 190w\" /><figcaption><span>The climb at Houffalize is one of the key points of Liège-Bastogne-Liège.</span> (Photo: Getty Images/VeloNews)</figcaption></figure>\n<p> </p>","author":"Andrew Hood","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b8b464caee945de96dd7e29ddf979061f024c2544e78ea3d7ed9b08d9c9d2b35","category":"Cycling"}