{"title":"Team Ineos Grenadiers to switch to disc brakes","link":"https://www.bikeradar.com/news/team-ineos-grenadiers-disc-brakes/","date":1632143254000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/Pinarello-Dogma-F-Disc-49c7c93.jpg?quality=90&amp;resize=620,413\" />                                            <p>Team Ineos Grenadiers is set to switch to disc brakes for tomorrow’s Grand Prix de Denain, in a move that could signal the end of rim brakes in the men’s WorldTour peloton.</p>\n<p>The British-registered WorldTour team has resolutely stuck to rim brakes despite rival teams overwhelmingly adopting <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a> in recent years.</p>\n<p>However, Ineos Grenadiers riders will use the Pinarello Dogma F Disc for GP de Denain, a one-day race in northern France, and in the build-up to Paris-Roubaix on Sunday 3 October. As a result, all 19 teams are now using disc brakes on their <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour bikes</a> in some capacity.</p>\n<p>“Our relationship with Pinarello has always been grounded in a love of racing and innovation, and their work on the Dogma F Disc should enable our riders to race to their maximum,” said Carsten Jeppesen, the team’s head of technical partners.</p>\n<p>“Working closely with Pinarello and Shimano, we will continue to develop the all-round disc package, optimising weight, the integration across Dura-Ace, and improvements in the quick release system,” he continued.</p>\n<p>Two of those factors – weight and wheel changes – were also cited by the team’s lead mechanic, Diego Costa, as reasons for not yet switching to disc brakes, in an interview with the BikeRadar Podcast in July 2020.</p>\n\n<h2>Is this the end for rim brakes in the WorldTour?</h2>\n<p>Ineos Grenadiers has offered little detail around the switch, other than to state GP de Denain is “the first race in the initial phase of the disc brake roll out for the team”, according to the press release announcing the move.</p>\n<p>The statement also says the decision has come after close consultation with “the riders, performance team, Pinarello and Shimano”.</p>\n<p>Paris-Roubaix has been identified as a key race in the team’s adoption of disc brakes, with the <em>Hell of the North</em> moved to October from its usual April date due to the coronavirus pandemic.</p>\n<p>While the team hasn’t explicitly stated its intention to completely phase out rim brakes, the launch of the <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f/\">Pinarello Dogma F</a> and Shimano’s new Dura-Ace groupset, both of which we’ll come on to, means the direction of travel is heading fast towards disc brakes.</p>\n<p>Time will reveal the team’s intentions, though some WorldTour squads have switched between disc brakes and rim brakes this season, with Tadej Pogačar most notably ditching discs in the mountains en-route to winning a second <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> title.</p>\n\n<h2>Why now?</h2>\n<p>Pinarello launched its latest flagship bike, the Dogma F, in June, with the disc frame kit (frame, fork, seatpost, cockpit) claimed to save 256g over the existing <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/pinarello-dogma-f12-dura-ace-di2-disc-review/\">Dogma F12</a>.</p>\n<p>The development of the new <a href=\"https://www.bikeradar.com/news/shimano-dura-ace-di2-r9200/\">Shimano Dura-Ace R9200</a> groupset has also largely been focused on disc brakes, though the image accompanying this latest announcement pictures the Dogma F Disc in Ineos colours with the outgoing <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9170-first-ride-review/\">Dura-Ace Di2 R9170</a> drivetrain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> While the team appears to be sticking with the outgoing Shimano Dura-Ace Di2 R9150 groupset for now, we expect riders to switch to the latest R9200 setup as soon as possible.</span></figcaption><span> <i>Team Ineos Grenadiers</i></span></div>\n<p>While Shimano is continuing to support rim brakes at Dura-Ace level, the new R9200 rim brakes are nearly identical to the current R9100 units.</p>\n<p>Most notably, the rim brake shifters aren’t wireless, whereas the R9270 disc brake shifters communicate wirelessly to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a>, which is in turn wired to the front derailleur and battery.</p>\n<p>With Shimano heavily backing disc-brake technology with its latest launch, it is perhaps little surprise to see cycling’s most powerful WorldTour team finally adopt disc brakes and, with it, Shimano’s true flagship <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupset</a>.</p>\n<p>We expect the team to switch to the new groupset as soon as component availability allows.</p>\n\n<p>In the build-up to the arrival of the Dogma F, Fausto Pinarello had been spotted riding a disc-ready version of the new bike, leading to speculation as to whether the brand’s latest launch would trigger a change in tact from Ineos-Grenadiers.</p>\n<p>While it’s taken four months for the team to announce the move, Pinarello himself is clear about where his company’s future lies.</p>\n<p>“I’ve been convinced about disc brakes since I started riding them myself and I’m happy the team is going to race on them in the final part of this season,” he said.</p>\n<p>“The Ineos Grenadiers are constantly pushing for excellence in everything they do and we are delighted with the Dogma F Disc we have developed with the team.”</p>\n<p>Ineos-Grenadiers’ director of racing, Rod Ellingworth, added: “Pinarello are constantly working to keep our bike at the front of the peloton and their commitment to providing us [with] the very best equipment has been evident across this project. Rider feedback has also been encouraging.”</p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"b8b50d537579868a698ac1a3b408d139be1695476eaf50eac1f66a9c6adeb3f7","category":"Cycling"}