{"title":"Apple Music Classical lands on Android–but iPad and Mac users hear crickets","link":"https://www.macworld.com/article/1936886/android-apple-music-classical-before-ipad.html","date":1685538478000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Having finally launched the <a href=\"https://www.macworld.com/article/1437108/apple-music-classical-primephonic-dedicated-experience.html\">long-awaited</a> Apple Music Classical app for iOS <a href=\"https://www.macworld.com/article/1674013/apple-music-classical-iphone-shuffle-library-download.html\">two months ago</a>, Apple was expected to quickly launch an optimized version of the app for iPad and Mac users who want to enjoy Beethoven while they work. Instead, the company has surprised everyone by releasing an Android edition first.</p>\n\n\n\n<p>Available for free to download on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://play.google.com/store/apps/details?id=com.apple.android.music.classical&amp;xcust=1-1-1936886-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Google Play Store</a>, Apple Music Classical for Android is a close match for the iPhone version, with similar formatting and seemingly all the same features. As <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/05/30/apple-music-classical-android-no-ipad-mac-carplay/&amp;xcust=1-1-1936886-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">9to5Mac</a> notes, it “even has crossfade support, something Apple’s platforms only support on the Mac.” It too requires an Apple Music subscription, which costs $10.99/£10.99 per month.</p>\n\n\n\n<p>It’s not unusual for Apple to make products that are compatible with rival platforms: most famously the Windows version of iTunes has remained available for years after it was removed from macOS. But the company would very obviously prefer people to switch to its own platforms, and tends to give other platforms a subtly (or not so subtly) worse experience. Apps come out later and don’t look as nice, and hardware devices don’t get the same features. (You can use your AirPods with an Android phone, for example, but you don’t get Siri support.)</p>\n\n\n\n<p>It’s therefore surprising that Android users have their own Apple Music Classical app so soon and in such a well-made form. Equally surprising is that Apple hasn’t even launched a version of the app for iPad yet. iPad owners can install the iPhone app, but it isn’t optimized for the platform. There’s no Mac app yet either, and you can’t use Apple Music Classical with CarPlay either. Apple hasn’t addressed any of these limitations, so it could be days, weeks, or months before we see iPad or Mac versions.</p>\n\n\n\n<p>As 9to5Mac points out, the timeliness and quality of the Android launch may reflect the fact that Apple Music Classical isn’t an entirely new service. It’s the result of an acquisition: Cupertino <a href=\"https://www.macworld.com/article/354463/apple-aquires-primephonic-classical-music-streaming-service.html\">bought Primephonic</a> in August 2021 and folded that service into Apple Music. There had been an Android app but this was closed down, and Android-based subscribers have been waiting a while to resume their enjoyment of the service.</p>\n\nAndroid, Apple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b8b97c463460da349e7c4fd0dad64121382ad5d197483e757522e5f02cb888ee","category":"Apple"}