{"title":"Emergency SOS via Satellite Saves Students Trapped in Utah Canyon","link":"https://www.macrumors.com/2023/04/24/emergency-sos-via-satellite-saves-students/","date":1682371482000,"content":"The <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a>'s Emergency SOS via Satellite feature last week saved a trio of students who went canyoneering in Utah and got stuck in an area with no cellular signal. Introduced last September, Emergency SOS via Satellite is designed to let ‌iPhone 14‌ users access satellite communications to get help in emergency situations.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/Emergency-SOS-via-Satellite-iPhone-YT.jpg\" alt width=\"3564\" height=\"1996\" />\r<br />\nThe students who were involved spoke to Utah's <em><a href=\"https://kutv.com/news/local/stranded-canyoneering-group-uses-iphone-feature-to-get-help-in-remote-utah-slot-canyon-the-squeeze-sos-text-message-deep-pools-cold-water-rescue-dps-utah-aero-bureau\">KUTV</a></em> (via <em><a href=\"https://appleinsider.com/articles/23/04/24/iphone-14-emergency-sos-via-satellite-saved-students-stuck-in-a-utah-canyon\">AppleInsider</a></em>) and described their dangerous ordeal. One of the students, Bridger Woods, said that the three had heard about a \"pretty cool canyon\" that they decided to check out because they had been canyoneering for approximately a year.\r<br />\n\r<br />\nInside the canyon, they encountered an area that had unexpectedly deep water, potentially caused by a wet winter in Utah. Woods and another student, Jeremy Mumford, were stuck in the pool for over an hour, but they ultimately were able to get out and continue deeper. They encountered another pool where the water was chest deep, and they could not get out.\r<br />\n\r<br />\nTwo of the students were experiencing symptoms of hypothermia, and because of the location of the canyon, there was no cellular signal, but the third student, Stephen Watts, had an ‌iPhone 14‌. According to Mumford, every 20 minutes, a \"satellite would line up\" to their location, and holding the phone up, they were able to get enough satellite signal to text 911.\r<br />\n\r<br />\nWhile waiting for emergency services, the trio were able to leverage themselves out of the deep pool using rope and carabiners. With Woods going into hypothermic shock, they were still unable to get out of the 10 to 15 foot hole that they were in. Instead, they located driftwood and began a fire to warm up while emergency crews came to their rescue.\r<br />\n\r<br />\nA helicopter crew from Salt Lake City arrived, as did paramedics from Arizona, and all three students were ultimately unharmed. The group told <em>KUTV</em> that they recommend taking a satellite phone on adventures in case of an emergency situation.\r<br />\n\r<br />\nEmergency SOS via Satellite has already been used in several other life-threatening situations, including when an Alaskan man was <a href=\"https://www.macrumors.com/2022/12/01/iphone-14-satellite-sos-in-action/\">stranded in the wilderness</a> and when people were involved <a href=\"https://www.macrumors.com/2022/12/14/emergency-sos-saves-two-in-canyon-crash/\">in a serious crash</a> in the Angeles National Forest in California.\r<br />\n\r<br />\nEmergency Satellite via SOS is available to all ‌‌iPhone 14‌‌ users in select countries, and it can be activated when an emergency situation occurs and there is no WiFi or cellular connection available. The feature is free to use for two years, and Apple has not yet provided detail on how much it will cost going forward.<div>Tag: <a href=\"https://www.macrumors.com/guide/emergency-sos-via-satellite/\">Emergency SOS via Satellite</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/24/emergency-sos-via-satellite-saves-students/\">Emergency SOS via Satellite Saves Students Trapped in Utah Canyon</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/emergency-sos-via-satellite-saves-students-trapped-in-utah-canyon.2387686/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b8b930b4108a129f3ce710f73a2180e405a9398e7c7dcdee68491457e6853bd3","category":"Apple"}