{"title":"430 Spent hemp biomass increases bone mineral density in broilers","link":"https://academic.oup.com/jas/article/102/Supplement_3/203/7757321?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Spent hemp biomass (SHB) is a byproduct of CBD oil production, which has been used in multiple trials recently as an alternative feed for livestock, but it has not been approved as a feed ingredient by the FDA-CVM. This is due in part to the lack of information on the potential effects on animal health. Recent studies have shown possible effects of cannabinoids on bone healing, though the effects on bone growth and calcification are not well established. The objective of the study was to investigate the effects of varying levels of SHB on bone growth, calcification, and strength. A total of two hundred birds (5-d-old Cobb 500 Cornish Cross chicks) were randomly assigned to five different rooms with 4 pens per room and 10 animals/pen. Birds received isonitrogenous, isocaloric diets with either 0, 5, 10, or 20% SHB until euthanasia at 42 d. The tibiotarsus, femur, and humerus were collected from 2 males and 2 females per pen for 80 birds (20 per treatment group). The tibiotarsus bending strength was measured with an Instron 5969 using a three-point bending testing fixture set at 10 mm/min for 19 parameters of the bending and breaking properties. The humerus and femur were scanned with a Hologic Discovery A (S/N 84870) DEXA for mineral content (BMC) and density (BMD). Statistical significance was set at <span>P</span> ≤ 0.05 and analyzed using a generalized linear mixed model. BMD and BMC were not affected by treatments in the humerus, a pneumatic bone, but in the weight bearing femur bones, a significant effect on both BMD (<span>P</span> = 0.0078) and BMC (<span>P</span> = 0.0069) was observed. The change in BMC was quadratic, with a peak in animals receiving 10% SHB in the diet, but the BMD effect was linear with the increased dose of SHB in the diet. In the tibiotarsus three-point bending analysis, no significant changes were found in any of the strength and bending parameters measured, except a tendency (<span>P</span> = 0.07) for a greater work-to-fracture adjusted by bone diameter in 5% vs. 0% SHB group. These data indicate some interaction of SHB on the mineralization of bone; however, the level causes less than significant changes to the overall strength of the bone.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b8c66a7560fc8e6f9c95dced52fe8f5b8f94c8717007dbf9104b527fa97874e9","category":"Environment"}