{"title":"Differential miRNA and Protein Expression Reveals miR-1285, Its Targets TGM2 and CDH-1 as Well as CD166 and S100A13 as Potential New Biomarkers in Patients with Diabetes Mellitus and Pancreatic Adenocarcinoma","link":"https://www.preprints.org/manuscript/202406.1734/v1","date":1719300341000,"content":"Early detection of PDAC remains challenging due to the lack of early symptoms and absence of reliable biomarkers. The aim of the present project was to identify miRNA and proteomics sig-natures discriminating PDAC patients with DM from nondiabetic PDAC patients. Proteomics analysis and miRNA array were used for protein and miRNA screening. We used western blot-ting and Real-Time Quantitative Reverse Transcription polymerase chain reaction (qRT-PCR) for protein and miRNA validation. Comparisons between experimental groups with normal dis-tributions were performed using one-way ANOVA followed by Tukey’s post hoc test and pair-wise tests were performed using t tests. P≤0.05 was considered statistically significant. Protein cluster of differentiation 166 (CD166), glycoprotein CD63 (CD63), S100 calcium binding protein A13 (S100A13), and tumor necrosis factor-β (TNF-β) were detected in the proteomics screening. The miRNA assay revealed a differential miRNA 1285 regulation. Previously described in the literature target proteins of miR-1285 cadherin-1 (CDH-1), cellular Jun (c-Jun), p53, mothers against decapentaplegic homolog 4 (Smad4), human transglutaminase 2 (TGM2) and yes-associated protein (YAP), were validated via Western blotting. miR-1285-3p was successfully validated as differentially regulated in PDAC + DM via qRT-PCR. Overall, our data suggest miRNA1285-3p, TGM2, CDH-1, CD166 and S100A13 as potential meaningful biomarker candi-dates to characterize patients with PDAC + DM. Data are available via ProteomeXchange with identifier PXD053169.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b8c7a001b7b8380d3dcca84b2e4f75325369dbecf684dac6bf68a9b9045422d3","category":"Interdisciplinary"}