{"title":"Precipitation-induced soil properties and plant communities mediate root strategies in an alpine meadow","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae072/7732323?rss=1","date":1723507200000,"content":"<span><div>Abstract</div>Plant roots show flexible traits to changing precipitation, but the factors driving root trait covariation remain poorly understood. This study investigated six key root traits and explored the potential driving factors, including plant community characteristics and soil properties, in the Zoige alpine meadow across five precipitation gradients: natural precipitation (1.0P), a 50% increasing precipitation (1.5P), and 30%, 50% and 90% decreasing precipitation (0.7P, 0.5P and 0.1P, respectively). Our results demonstrated distinct root trait responses to changes in precipitation. Both increasing (1.5P) and decreasing precipitation (0.1P, 0.5P and 0.7P) inhibited root diameter (RD), specific root length (SRL) and specific root area compared with 1.0P. Conversely, root tissue density and root nitrogen content increased under decreasing precipitation but declined under 1.5P. With increasing precipitation, root foraging strategies shifted with thinner RD and larger SRL to that with a larger diameter. Shifts in root strategies were primarily influenced by soil properties, specifically soil water content and available nitrogen. Additionally, root strategies in surface soils (0–10 cm) were mainly related to the grass and sedge coverage, whereas in deeper soils (10–20 cm) root strategies were related to overall plant community coverage and biomass. Our findings indicate that root trait variations and strategies in alpine meadows are co-driven by soil properties and plant communities in response to changing precipitation.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"b8cbcddd2e7671c787309cd213565c5fa6ef9923c134cf25b223e8cfc357af75","category":"Environment"}