{"title":"Influence of supplementation with iron and probiotic bacteria Lactobacillus plantarum and Lactobacillus curvatus on selected parameters of inflammatory state in rats on a high‐fat iron‐deficient diet","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13329?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>A high-fat (HF) diet, diet iron deficiency and iron supplementation may affect inflammatory parameters. Probiotics influence both iron metabolism and inflammation. We compared the inflammatory state in rats on a HF iron-deficient diet receiving oral iron, <i>Lactobacillus plantarum</i> and <i>Lactobacillus curvatus</i> in different combinations.</p>\n<h2>METHODS</h2>\n<p>This was a two-stage experiment. In groups C (<i>n</i> = 8) and HF (<i>n</i> = 8), rats ate a control or HF diet, respectively, for 16 weeks. In the group HFDEF (<i>n</i> = 48), rats ate a HF iron-deficient diet for 8 weeks (first stage) and were subsequently divided into 6 groups (<i>n</i> = 8 each) receiving the following for a further 8 weeks (second stage): HFDEF – a HF iron-deficient diet; HFDEFFe – a HF iron-deficient diet with iron; HFDEFLp and HFDEFLc – a HF iron-deficient diet with <i>L. plantarum</i> or <i>L. curvatus</i>, respectively; and HFDEFFeLp and HFDEFFeLc – a HF iron-deficient diet with iron and <i>L. plantarum</i> or <i>L. curvatus</i>, respectively. Body composition analysis and blood sampling was performed. Markers of iron status and levels of total antioxidant status (TAS), C-reactive protein (CRP), tumour necrosis factor alpha (TNF-<i>α</i>) and interleukin 6 (IL-6) were measured in the blood.</p>\n<h2>RESULTS</h2>\n<p>TAS was higher in the HFDEF group (756.57 ± 489.53 ng mL<sup>−1</sup>) <i>versus</i> the HFDEFLc group (187.04 ± 47.84 ng mL<sup>−1</sup>; <i>P</i> = 0.022). No more differences were found between groups, or in TAS, CRP, TNF-<i>α</i> and IL-6 concentrations. Also, no differences were found between groups for alanine and aspartate aminotransferases, glucose, total cholesterol, low- and high-density lipoproteins and triglycerides. TAS level was positively correlated with ferritin concentration, IL-6 with TAS and TNF-<i>α</i> with hepcidin level.</p>\n<h2>CONCLUSIONS</h2>\n<p>Supplementation with <i>L. plantarum</i>, <i>L. curvatus</i> and iron in combinations exerts no influence on inflammatory status, lipid profile, hepatic function and serum fasting glucose in rats on a HF iron-deficient diet. © 2024 Society of Chemical Industry.</p>","author":"Katarzyna Skrypnik, \nMarcin Schmidt, \nAgnieszka Olejnik‐Schmidt, \nIskandar Azmy Harahap, \nJoanna Suliburska","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"b8cd4c92042637f31a8f7c3467f86c981af5e37ca81ae4d8ab3fe87b225e8c20","category":"Environment"}