{"title":"The Invasion Factor ODZ1 Is Upregulated through an Epidermal Growth Factor-Induced Pathway in Primary Glioblastoma Cells","link":"https://www.preprints.org/manuscript/202403.0806/v1","date":1710411085000,"content":"We have previously shown that the transmembrane protein ODZ1 promotes cytoskeletal remodelling of glioblastoma (GBM) cells and invasion of the surrounding parenchyma through activation of a RhoA-ROCK pathway. We also described that GBM cells can control the expression of ODZ1 through transcriptional mechanisms triggered by binding of IL-6 to its receptor and a hypoxic environment. Epidermal growth factor (EGF) plays a key role in the invasive capacity of GBM. However, the molecular mechanisms that enable tumor cells to acquire the morphological changes to migrate out from the tumor core have not been fully characterized. Here we show that EGF is able to induce the expression of ODZ1 in primary GBM cells. We analysed the levels of EGF receptor (EGFR) in 20 GBM primary cell lines and found expression in 19 of them by flow cytometry. We selected two cell lines that do or do not express EGFR and found that EGFR-expressing cells responded to EGF ligand by increasing ODZ1 at the mRNA and protein level. Moreover, blockade of EGF-EGFR binding by Cetuximab, inhibition of the p38 MAPK pathway or siRNA-mediated knockdown of MAPK11 (p38 MAPK) reduced the induction of ODZ1 in response to EGF. Overall, we show that EGF may activate an EGFR-mediated signalling pathway through p38 MAPK, to upregulate the invasion factor ODZ1, which may initiate morphological changes for tumor cells to invade the surrounding parenchyma. These data identify a new candidate of the EGF-EGFR pathway for novel therapeutic approaches.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b8d2ab1ad09fe9b490608efadeda516cab9b5d2346e2d8b0e2d30a0b8328d41e","category":"Interdisciplinary"}