{"title":"Apple Looking to Expand CarPlay With New Integrations for AC, Seats, Instrument Cluster, and More","link":"https://www.macrumors.com/2021/10/07/apple-expanding-carplay-ac-functions-more/","date":1633606087000,"content":"Apple is looking to expand <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a>'s functionality to include controls for core car functions such as the air conditioning system, radio, speedometer, seats, and more, according to a <a href=\"https://www.bloomberg.com/news/articles/2021-10-07/apple-s-plan-for-cars-using-iphone-to-control-a-c-seats-radio\">new report</a> from <em>Bloomberg</em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/carplay-dashboard-ios-14.jpg\" />\r\n<br />\r\nThe project, internally codenamed \"IronHeart,\" is still in its early stages but would include Apple working with carmakers to expand ‌CarPlay‌'s functionality to control core car functions. Beyond apps for music and navigation, ‌CarPlay‌ doesn't let users control any aspect of the car itself. This new iPhone-based project would be looking to change that.\r\n<br />\r\n<blockquote>The company is working on technology that would access functions like the climate-control system, speedometer, radio and seats, according to people with knowledge of the effort. The initiative, known as \"IronHeart\" internally, is still in its early stages and would require the cooperation of automakers. \r\n<br />\r\n\r\n<br />\r\nIronHeart would take CarPlay a step further. The iPhone-based system could access a range of controls, sensors and settings, said the people, who asked not to be identified because the project is secret.</blockquote>The report lists several different car functions that ‌CarPlay‌ could display in the future, including inside and outside temperature and humidity readings, seats and armrests, instrument cluster, and controls for the cars built-in speakers.\r\n<br />\r\n\r\n<br />\r\n<em>Bloomberg</em> says Apple's ‌CarPlay‌ strategy is similar to that of its Home and Health offerings, where the company has consolidated users' information into single apps on their <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. With \"IronHeart,\" ‌CarPlay‌ would be a more comprehensive system for users to control their vehicle without having to switch between ‌CarPlay‌ and the car's control system. \r\n<br />\r\n\r\n<br />\r\nUltimately, while Apple is rumored to be building its own car, ‌CarPlay‌ and any of its plans would require the cooperation of carmakers. As today's report notes, Apple has struggled to convince some carmakers to adopt certain features of ‌CarPlay‌ into their vehicles.\r\n<br />\r\n<blockquote>IronHeart would represent Apple's strongest push into cars since CarPlay was released in 2014, but it may not be a hit with automakers. They could be reluctant to hand over control of key features to Apple. While CarPlay is now in more than 600 car models, other Apple initiatives launched in recent years have been slower to catch on with automakers. \r\n<br />\r\n\r\n<br />\r\nBut automakers have mostly balked at adding these enhancements. The climate control and radio apps are only supported by a few cars. And the EV routing feature isn't available on any vehicles that are currently shipping. The CarPlay display expansion is only supported by a few brands, such as BMW and Volkswagen, and CarKey is just on some BMWs.  </blockquote>Apple recently tapped Kevin Lynch, who was previously an important part of developing watchOS, to lead the <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a> team, but following several departures, doubts are starting to arise about whether Apple will ever release its own vehicle.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/bloomberg/\">Bloomberg</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/07/apple-expanding-carplay-ac-functions-more/\">Apple Looking to Expand CarPlay With New Integrations for AC, Seats, Instrument Cluster, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-looking-to-expand-carplay-with-new-integrations-for-ac-seats-instrument-cluster-and-more.2315815/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5IgrPpJyrOs:bO1ExmuNFsc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5IgrPpJyrOs:bO1ExmuNFsc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5IgrPpJyrOs\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b8d4812d848f87da79be58a07ecbccd7f767f65a5c8c06ce56bcce35deb49150","category":"Apple"}