{"title":"Meet the Flashpoint MVMNT gravel (and more) team","link":"https://cyclingtips.com/2021/03/meet-the-flashpoint-mvmnt-gravel-and-more-team/","date":1617121187000,"content":"<p>A collection of bike industry brands, led by Giro and including Canyon, Wahoo, SRAM, Thule, and WTB, has launched a new four-rider team with a mission to &#8220;break down the barriers that prevent people from enjoying riding bikes,&#8221; the team said in a statement. </p>\n\n\n\n<p>The Flashpoint MVMNT team includes four riders: Kathy Pruitt, Andrew Jackson, Nehemiah Brown, and Amanda Schaper, who is also Team Manager.</p>\n\n\n\n<p>The team will focus on major gravel races, including the Belgian Waffle Ride, SBT GRVL, Grinduro Wales, and Grinduro California, as well as other events outside the usual gravel circuit. </p>\n\n\n\n<p>“The Flashpoint MVMNT crew came together naturally because we all see the same thing,” said Dain Zaffke, Giro Marketing Director. “Cycling is no longer solely defined by what happens at commercial events like the Tour de France, the UCI World Cup and Red Bull Rampage, it’s being shaped by the masses and the grassroots riders. After a year of turmoil, bikes have never been more popular as a means of exploration, exercise, and adventure. But this boom illustrates the divide between cycling media/marketing and the folks actually buying the equipment. Why should newcomers be influenced by the traditional reference points? Flashpoint MVMNT riders are all motivated to challenge the status quo and change the image of cycling.”</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"668\" height=\"1000\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/flashpoint-1-of-1-2.jpg\" alt=\"\" class=\"wp-image-509096\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/flashpoint-1-of-1-2.jpg 668w, https://cyclingtips.com/wp-content/uploads/2021/03/flashpoint-1-of-1-2-650x973.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/flashpoint-1-of-1-2-190x284.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/flashpoint-1-of-1-2-11x16.jpg 11w\" sizes=\"(max-width: 668px) 100vw, 668px\" /><figcaption>Photo: Dain Zaffke</figcaption></figure>\n\n\n\n<p>Kathy Pruitt is a former junior downhill world champion (in 2000) returning to racing full-time in 2021. Andrew Jackson is a BMX legend and filmmaker who recently found drop bars. &#8220;I want to show people that you don&#8217;t need to live in the mountains to ride gravel,&#8221; he said. &#8220;I love riding from my house in downtown LA. There are gravel spots all over, and sometimes it just takes a little creativity to find them. </p>\n\n\n\n<p>Nehemiah Brown balances a day job at a tech startup with his racing ambitions, and commitment to promoting racial equity. &#8220;I want to uplift marginalized communities, and that starts by making sure they can join in the fun,&#8221; he said. </p>\n\n\n\n<p><a href=\"https://www.instagram.com/flashpointmvmnt/\">Find out more. </a></p>\n\n\n\n\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/meet-the-flashpoint-mvmnt-gravel-and-more-team/\">Meet the Flashpoint MVMNT gravel (and more) team</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"CyclingTips","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b8e05b52795703121f56730e23760892a29507d79f43ef2246e800e669d3db78","category":"Cycling"}