{"title":"Characterizing subgenome recombination and chromosomal imbalances in banana varietal lineages","link":"https://academic.oup.com/aob/article/133/2/349/7473428?rss=1","date":1702512000000,"content":"<span><div>Abstract</div><div>Background</div>Bananas and plantains (<span>Musa</span> spp.) are among the most important crops worldwide. The cultivated varieties are vegetatively propagated, so their genetic diversity is essentially fixed over time. <span>Musa acuminata</span>, <span>M. balbisiana</span> and <span>M. schizocarpa</span> have provided the named A, B and S subgenomes that predominantly constitute these varieties. Here we aimed to characterize intergenetic recombination and chromosomal imbalances between these A/B/S subgenomes, which often result in copy-number variants (CNVs) leading to changes in gene dosage and phenotype, in a diverse panel of bananas and plantains. This will allow us to characterize varietal lineages better and identify sources of genetic variation.<div>Methods</div>We delimited population structure and clonal lineages in a diverse panel of 188 banana and plantain accessions from the most common cultivars using admixture, principal component and phylogenetic analyses. We used new scalable alignment-based methods, Relative Averaged Alignment (RAA) and Relative Coverage, to infer subgenome composition (AA, AAB, etc.) and interspecific recombination.<div>Results</div>In our panel, we identified ten varietal lineages composed of somatic clones, plus three groups of tetraploid accessions. We identified chromosomal exchanges resulting in gains/losses in chromosomal segments (CNVs), particularly in AAB and ABB varieties.<div>Conclusions</div>We demonstrated alignment-based RAA and Relative Coverage can identify subgenome composition and introgressions with similar results to more complex approaches based on single nucleotide polymorphism (SNP) databases. These <span>ab initio</span> species-agnostic methods can be used without sequencing a panel of wild ancestors to find private SNPs, or in recently diverged pools where private SNPs are uncommon. The extensive A/B/S exchanges and the variation in the length of some introgressions between lineages further support multiple foundational events of hybridization and residual backcrossing. Imbalances between A/B/S may have resulted in CNVs and gene dosage variation. Since most edible banana genomes are fixed on time, these CNVs are stable genetic variations probably associated with phenotypic variation for future genetic studies.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"b8e5899c4ac5e6996df758ac35920f946043b2346201413ae00e4127ff016b52","category":"Environment"}