{"title":"145 Utilization of 16s sequencing data and physiological measurements to produce a comparative analysis of the equine microbiome","link":"https://academic.oup.com/jas/article/102/Supplement_3/217/7757076?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Rapid advancements in microbiome research, particularly in the technologies associated with next-generation sequencing have enabled unprecedented investigations into the composition of the equine microbiome. The large datasets produced from these studies often present challenges to researchers seeking to understand the applicability of these data to equine physiology. To that end, a multi-year project was conducted with the goal of determining the core bacterial population of the equine hindgut through analysis of rectal swabs collected from thousands of horses and applying logic to the association between these ecologies and equine health. Samples were obtained from horses that varied across a diverse range of considerations including location, breed, age, and diet, amongst other metadata points including disease state, health history, vaccination and deworming status, body condition, and pregnancy status. These data were used in the development of a comparative score, that authors defined as the Microbiome Quotient (MQ score). Rectal swabs were collected, and DNA was extracted using the Quick-DNA Fecal/Soil Microbe Miniprep kit (Zymo Research, Irvine, CA) and the V3-V4 hypervariable region of the 16S rRNA gene was sequenced by following the Illumina 16S Protocol (San Diego, CA). Sequences were denoised using DADA2 within the QIIME2 pipeline to obtain amplicon sequence variant composition. These data were filtered again in R (4.2.2) to remove samples with missing data and low sequencing depth. Sample metadata was used to classify samples as either typical or atypical. The MQ score was calculated by computing the Euclidean distance difference between a sample and the centroids representing typical and atypical microbial ecologies, and then subtracting these distances to obtain the individual score. This score quantifies how similar the microbiome in a sample is to those of typical and atypical horses. These scores were then categorized into tertiles, representing the status of the individual horse’s microbiome. These statuses indicate differences in bacterial ecology among samples and their subsequent relevance to the health of the horse. While a large portion of the equine fecal microbiome is conserved through homeostatic and other mechanisms, there remains a high degree of variability in the lesser abundant genera that may be responsible for the different physiological interactions between the microbes and their hosts. Utilizing this MQ score, feeding and management recommendations can be made, providing veterinarians and horse owners with a tool to support the health and performance of horses through modulation of the bacterial population and its functionality. Further research is necessary to fully elucidate the impact of the various metadata components on the bacterial ecology. Additionally, the function of the metagenome is a critical component of microbiome sciences. Prediction of metagenomic function is likely to provide insight into the regulation of physiological function by the microbial population residing within the host.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b8e7c3d1b1b80d0c7a83218a5cd49d405c8416e829d1dc70a328c2753a33d59c","category":"Environment"}