{"title":"Big Tech Companies to Be Hit by 'Historic' International Tax Agreement","link":"https://www.macrumors.com/2021/06/05/big-tech-to-be-hit-by-international-tax-agreement/","date":1622895886000,"content":"Some of the world's richest countries have today reached a landmark agreement to close international tax loopholes used by some of the biggest multinational corporations, including big tech companies like Apple, Google, and Amazon (via <em><a href=\"https://www.reuters.com/business/g7-nations-near-historic-deal-taxing-multinationals-2021-06-05/\">Reuters</a></em>).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/g7-summit-2021.jpg\" />\r\n<br />\r\nAt the G7 summit in London, representatives of the U.S., UK, France, Germany, Canada, Italy, and Japan reached an agreement on a coordinated effort to support a minimum global corporation tax rate of at least 15 percent and committed to ensure that multinational corporations pay taxes in the countries where their business operates.\r\n<br />\r\n\r\n<br />\r\n\"After years of discussion, G7 finance ministers have reached a historic agreement to reform the global tax system to make it fit for the global digital age,\" said the United Kingdom's Chancellor of the Exchequer, Rishi Sunak.\r\n<br />\r\n\r\n<br />\r\nThe joint accord, which is expected to form the foundation of a global pact next month, is aimed to stop what U.S. Treasury Secretary Janet Yellen called \"thirty-year race to the bottom on corporate tax rates,\" where countries have felt compelled to slash tax rates and introduce exemptions to remain appealing to corporate giants.\r\n<br />\r\n\r\n<br />\r\nThe deal will put pressure on other countries to follow suit and join the agreement. A meeting of the G20 next month is expected to continue the talks with a wider group of nations, including Argentina, Australia, Brazil, China, India, Indonesia, Mexico, Russia, Saudi Arabia, South Africa, South Korea, and Turkey.\r\n<br />\r\n\r\n<br />\r\nAny broader, final agreement could have repercussions for low-tax countries and tax havens, such as Ireland, where Apple is headquartered outside the U.S. Low-tax countries are expected to try to build support for a minimum rate as close as possible to around 12.5 percent or seek exemptions.\r\n<br />\r\n\r\n<br />\r\nAmerican multinationals play a significant role in Ireland's economy, attracted by the country's \"BEPS\" tools, that protect their non–U.S. profits from the U.S. \"worldwide\" corporate tax system, and provide an effective Irish tax rate of zero to 2.5 percent. As a result, large multinational companies, particularly in the technology industry, such as Apple, Google, Amazon, and Facebook, are expected to be heavily impacted by the new international tax plans.\r\n<br />\r\n\r\n<br />\r\nThe agreed minimum corporation tax rate of 15 percent is still above the level in countries such as Ireland, but below the lowest level in the G7. The 15 percent rate is lower than the 21 percent that was expected ahead of the summit, and some countries, such as France, are arguing that the 15 percent rate should be viewed as a base level for setting a higher, more ambitious rate.\r\n<br />\r\n\r\n<br />\r\nA move toward making companies declare their environmental impact in a standardized way, primarily so that it is clearer to investors, was also agreed upon.<div>Tags: <a href=\"https://www.macrumors.com/guide/corporate-tax/\">corporate tax</a>, <a href=\"https://www.macrumors.com/guide/tax/\">tax</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/05/big-tech-to-be-hit-by-international-tax-agreement/\">Big Tech Companies to Be Hit by 'Historic' International Tax Agreement</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/big-tech-companies-to-be-hit-by-historic-international-tax-agreement.2299293/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0jwPqb3qzzI:RnZrucSYo3Q:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0jwPqb3qzzI:RnZrucSYo3Q:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0jwPqb3qzzI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b8e89ee9b97b2e5bb8bb7e2d09e8ef008e6c584b62fd1ad9ab48d7b97d6955c8","category":"Apple"}