{"title":"Room Temperature Superconductivity in Thorium Salts Reveals a Novel Superconducting Mechanism","link":"https://www.preprints.org/manuscript/202404.0402/v4","date":1714465731000,"content":"An innovative superconducting mechanism was developed based on a patented discovery of room temperature superconductivity in several thorium (Th) salts or compounds. The rationale behind this discovery is through the experimental results about the unique electrical and magnetic properties of these Th salts. Accordingly, this new superconducting mechanism for these Th salts was obtained through the analyses of the compounds’ molecular configurations and the packings of their relevant crystal structures. Owing to the distinctive properties of the Th compounds in this discovery, we further established a different electron pairing scheme as opposed to the pairing of the Cooper pairs. Compared to the long distance electron pairing of the Cooper pairs, the new electron pairing in our mechanism is constructed by two closely correlated electrons that reside on the same atomic orbital of the Th cation as an electron lone pair. In this new superconducting mechanism, the Th cation is sitting on a relevant crystallographic lattice arrangement or a network of the relevant Th compounds. This network is constructed by many Th cations along certain crystallographic lattice arrangement where each Th cation contains one electron lone pair. This network allows the electron lone pairs on the Th cations to be delocalized over the network, “in pair”, and thus, reveals the electron lone pair in presence in a long distance fashion. The closely correlated electron lone pairs hop on this network and thus, construct the supercurrent over the network. This explanation about the superconductivity laid the basis for our superconducting mechanism. All these conclusions came from the previous studies about these compounds that illustrated their unusual features of a coexistence of high electrical conductivity and diamagnetism. These electrical and magnetic properties fall in line with that of superconductors but, surprisingly, these Th compounds have such properties at the ambient condition, meaning under room temperature and atmosphere pressure. We expect that this mechanism may be appropriate to be utilized to other superconducting cases and therefore, can be adapted to describe the superconducting phenomenon for other superconductors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b90018bc8a0defc98959b83e4611dd8a1ed32b0b928293388699cc2e6b992983","category":"Interdisciplinary"}