{"title":"UK Government Denies U-Turn on Plan to Scan Encrypted Messages","link":"https://www.macrumors.com/2023/09/07/uk-government-plan-scan-encrypted-messages/","date":1694078633000,"content":"The UK government has denied that it has dropped a controversial plan to scan encrypted messaging services for harmful content as part of its Online Safety Bill, which is due to become law later this year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/07/General-Apps-Messages.jpg\" alt width=\"2500\" height=\"1407\" />\r<br />\nA provision in the bill allows regulator Ofcom to order messaging services to use \"accredited technology\" to look for and take down child sexual abuse material. \r<br />\n\r<br />\nHowever, according to a <em><a href=\"https://www.ft.com/content/770e58b1-a299-4b7b-a129-bded8649a43b\">Financial Times</a></em> report, the British government's minister for arts and heritage, Stephen Parkinson, said on Wednesday that Ofcom would only be able to intervene if scanning content was \"technically feasible\" and if the process met minimum standards of privacy and accuracy.\r<br />\n\r<br />\nMany security experts believe that such tech tools may never exist, while tech firms have argued that content moderation policies such as client-side scanning are impossible to implement without circumventing end-to-end encryption, which ensures that only the user and the person they are communicating with can read or listen to what is sent.\r<br />\n\r<br />\nApple has threatened to <a href=\"https://www.macrumors.com/2023/07/20/apple-threatens-to-pull-facetime-and-imessage-uk/\">pull services including FaceTime and iMessage</a> in the UK if the online safety bill goes ahead in its current form, while WhatsApp and Signal have <a href=\"https://www.macrumors.com/2023/04/18/whatsapp-signal-open-letter-uk-government/\">said they will quit the UK altogether</a>.\r<br />\n\r<br />\nDespite the government's apparent concession to tech companies' arguments, technology minister Michelle Donelan on Thursday denied that the bill had changed, arguing that if necessary it will still require companies to work to develop technology to scan encrypted messages if they cannot take action to stop child abuse on their platforms. \r<br />\n\r<br />\nDonelan <a href=\"https://www.reuters.com/technology/uk-minister-says-position-encryption-not-changed-2023-09-07/\">told reporters</a> further work to develop the technology was needed, adding that government-funded research had shown it was possible, however she did not offer evidence to back her claim.<div>Tags: <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a>, <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/07/uk-government-plan-scan-encrypted-messages/\">UK Government Denies U-Turn on Plan to Scan Encrypted Messages</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/uk-government-denies-u-turn-on-plan-to-scan-encrypted-messages.2400680/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b90fa1b5a9a3fa99d685fd5404cce5d7a5aa533fd3c2a66c25498c1ce1d9100d","category":"Apple"}