{"title":"Assessing parent-child interaction with deaf and hard of hearing infants aged 0–3 years: An international multi-professional e-Delphi","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301722","date":1714399200000,"content":"<p>by Martina Curtin, Madeline Cruice, Gary Morgan, Rosalind Herman</p>\r\nIntroduction <p>Most deaf babies are born to hearing families who do not yet have the skills to communicate effectively with their child. Adaptations to communication are important because the quality of parent-child interaction (PCI) predicts how a deaf child develops language. Teachers of Deaf children and Speech and Language Therapists support families with communication in the home. Currently, there are no assessments that appraise how a parent interacts with their deaf baby. Previous research has identified which parent behaviours and approaches are used in PCI assessments in research and practice. The current paper forms consensus on the core content and best practices of a new PCI tool for deaf children aged 0–3 years.</p> Methods <p>An international sample of expert academics and practitioners (n = 83) were recruited to take part in a two-round modified electronic Delphi study. Participants were presented with 69 statements focusing on (i) which parent behaviours were important in assessment (ii) the methods to be used in PCI assessment. Participants rated the extent to which they agreed or disagreed with each statement on a five-point Likert scale and gave comments to support their response. Consensus was defined as &gt;80% of participants rating the statement as a (4) ‘highly important’ or a (5) ‘essential’. If consensus was not reached, participant comments were used to generate new statements which were rated in the second round. This project involved a patient and public involvement (PPI) group of hearing and deaf parents and professionals to design and guide the study.</p> Results <p>Consensus was achieved on 52 statements and ranged from 80–99%. A further six statements were additionally included. Within the 58 statements included, 36 were parent behaviours which centred on the parent’s observation of, and response to, their child’s behaviour and/or language. The remaining 22 statements focused on methods used in the assessment such as parents having their PCI filmed, parents having the opportunity to review the video and assess themselves alongside a professional, and parents being involved in subsequent goal setting.</p> Conclusions <p>This e-Delphi presented the parent behaviours and methods of assessment to be included in a new PCI tool for deaf children. Future co-production work and acceptability and feasibility testing are discussed.</p>","author":"Martina Curtin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b912a5da5164d7ce8db7ab4ad2fad2e6e4e7263e56191321bc777a99e735172a","category":"Interdisciplinary"}