{"title":"Tour de France 2023 stage two preview - the longest stage","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-two-preview-the-longest-stage","date":1688227425000,"content":"\n      <p><b>Distance: </b><span>208.9km<br /></span><b>Start location: </b><span>San Sebastián<br /></span><b>Finish location: </b><span>Vitoria-Gasteiz<br /></span><b>Start time: </b><span>12:15 CEST<br /></span><b>Finish time (approx): </b><span>17:04 CEST</span></p>\n<p>Clásica San Sebastián is arguably the most overlooked major race on the cycling calendar. Held the weekend after the end of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, it often gets lost in the post-Tour lull as fans take some downtime following all the drama of the La Grande Boucle, but it’s always an exciting and selective race won by quality names, most recently Remco Evenepoel (Soudal-Quick-Step) with a vintage long-range attack. And though the wider cycling community may sleep on it, the notoriously passionate local fans always show up in numbers. There are few if any images more emblematic of cycling fan culture than crowds of orange-clad Basques densely packed roaring their support on a steep hill in the green Basque countryside.</p>\n<div></div>\n<p>Then there is the town of San Sebastian itself, which is one of the most popular tourist destinations in Spain. Renowned for its in-city beaches, Spaniards travel up here during the summer to escape the searing high temperatures of the rest of the nation. Despite its small size, it also hosts world-recognised annual jazz and film festivals, the latter of which in 1958 hosted the world premiere of Alfred Hitchcock’s Vertigo, which has since been preserved in the canon of the greatest ever films. And for foodies, San Sebastian is a must; it features the second most Michelin star restaurants per capita of any city in Europe, where you can sample the region’s famous seafood and tapas.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2023-06-22_at_09.08.05.png?v=1687421484\" alt /></p>\n<p><i>Stage two profile sourced via ASO</i></p>\n<p>The Tour de France has visited San Sebastian once before when it hosted the Grand Départ of the 1992 edition, but neither of the two stages that year (a prologue won by Miguel Induráin at the peak of his powers, and a road stage that culminated in a bunch sprint won by Frenchman Dominique Arnould) bore much resemblance to Clásica San Sebastián. For this year’s stage, by contrast, that classic will be a handy point of reference as to what to expect, featuring as it does many of the same roads and the similar hilly terrain that makes that race so selective. Even its relatively excessive length draws comparisons with the classic — at 209km, this is the longest stage of the whole 2023 Tour de France.</p>\n<p>The signature climb of Clásica San Sebastián, the Jaizkibel, is included, and if anything, will play an even more decisive role than in that annual race. Although it's climbed via a different side than usual, an average gradient of 5.3% across 8.1km makes this way up just as difficult as the usual road, and unlike at the classic, it’ll today be the final climb tackled rather than the third-to-last. As none of the preceding four categorised climbs are as hard, it looks inevitable that all the big moves will be saved for here, and if any individual or small group of stage-hunting puncheurs can reach the top with any kind of gap over the peloton, they stand a good chance of staying clear over the 9km descent and 8km flat run-in to the finish.</p>\n<h3>Contenders</h3>\n\n<p><span>After the opening stage, which featured over 3,000 metres of climbing, another 3,000-metre day follows. Again, it is a stage for the punchier riders, but the descent from the Jaizkibel and the flat run-in to the finish could put some of the stronger sprinters in the mix for the stage. </span></p>\n<p><strong><span>Wout van Aert </span></strong><span>(Jumbo-Visma) will certainly be a favourite for stage two again. He had a disappointing first stage, placing 11th, so he’ll be determined to put in a better performance on this stage. The same goes for </span><strong><span>Mathieu van der Poel </span></strong><span>(Alpecin-Deceuninck) who was another firm favourite going into the first stage but came 37th. Perhaps stage one was a warm-up for the legs, and stage two is where both riders will showcase their talents. </span></p>\n<p><strong><span>Mads Pedersen</span></strong><span> (Lidl-Trek) could secure an early victory here. He has one of the strongest sprints in the peloton, so if it boils down to a bunch sprint, he’ll be one to watch. His teammate </span><strong><span>Mattias Skjelmose, </span></strong><span>who crossed the line in stage one with the GC favourites after a solid performance, could also be a potential contender for the Lidl-Trek team.  </span></p>\n<p><span>Another rider who is on the hunt for stage wins is </span><strong><span>Julian Alaphilippe</span></strong><span> (Soudal-Quick-Step) and is a rider who can handle the relentless short but steep climbs the route boasts. However, he was a favourite for the opening stage but ended up rolling over the line 25th. <strong>Tom Pidcock</strong> (Ineos Grenadiers) could launch an attack on the final climb, securing an early stage win for the British team. </span></p>\n<p><strong>Neilson Powless</strong> (EF Education-EasyPost) is the current king of the mountains, so he could look to get up the road first and keep away from the fast finishers. </p>\n<h3>Prediction</h3>\n<p>After just slipping outside the top 10 in stage one, we think <strong>Wout van Aert</strong> will be eyeing the stage win in <span>Vitoria-Gasteiz. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b91289e411fa19fbe8c745fdd8dd956a4b7d5ae223eca0430344ada523c74e57","category":"Cycling"}