{"title":"[Reuters] YouTube ลบวิดีโอตีแผ่การละเมิดสิทธิมนุษยชนชาวอุยกูร์หลายรายการ บีบให้ช่องต้องหาแหล่งเผยแพร่อื่น","link":"https://www.blognone.com/node/123451","date":1624848792000,"content":"<div><div><div><p>Reuters รายงานว่า YouTube ลบวิดีโอตีแผ่การละเมิดสิทธิมนุษยชนในชาวอุยกูร์ ซึ่งเป็นวิดีโอจากช่อง Atajurt Kazakh Human Rights โดยเมื่อวันที่ 15 มิถุนายน ช่องดังกล่าวถูกบล็อกเนื่องจากละเมิดหลักเกณฑ์ของ YouTube ตามภาพหน้าจอที่ Reuters ตรวจสอบ ผู้ดูแลช่องได้ร้องเรียนการบล็อกวิดีโอทั้งสิบสองรายการไปยัง YouTube ระหว่างเดือนเมษายนถึงมิถุนายน โดยมีบางรายการที่ YouTube คืนสถานะให้</p>\n<p>ช่อง Atajurt Kazakh Human Rights มี Serikzhan Bilash นักเคลื่อนไหวชาวคาซัคที่เกิดในซินเจียงซึ่งเป็นผู้ร่วมก่อตั้งช่อง เขาเคยถูกจับกุมหลายครั้งในข้อหาเคลื่อนไหว ทางช่องได้เผยแพร่วิดีโอเกือบ 11,000 รายการบน YouTube รวมแล้วกว่า 120 ล้านวิวตั้งแต่ปี 2017 เนื้อหาในวิดีโอเป็นการสัมภาษณ์คนว่าบรรดาญาติของพวกเขาหายตัวอย่างไร้ร่องรอยในพื้นที่ซินเจียง ซึ่งผู้เชี่ยวชาญของ UN และกลุ่มสิทธิมนุษยชนประเมินว่ามีผู้คนกว่าล้านคนถูกควบคุมตัวในช่วงไม่กี่ปีที่ผ่านมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/007282f723c793f659c64cefa7754b8c.jpg\" /></p>\n<p>จากการสอบถามของ Reuters ว่าทำไมช่องจึงถูกลบ YouTube อธิบายว่าช่องดังกล่าวได้รับการ 'ประท้วง' หลายครั้งสำหรับวิดีโอที่มีผู้คนถือบัตรประจำตัวเพื่อพิสูจน์ว่าพวกเขาเกี่ยวข้องกับการสูญหาย ซึ่งมันไปละเมิดนโยบายของ YouTube ที่ห้ามไม่ให้ข้อมูลที่ระบุตัวบุคคลนั้นปรากฏในเนื้อหา ซึ่ง YouTube ได้แจ้งไปยังผู้ดูแลช่องให้ทำเบลอบัตรประจำตัวแล้ว แต่ถูกปฏิเสธ เนื่องจากกังวลว่าจะกระทบความน่าเชื่อถือของเนื้อหา</p>\n<p>ผู้ดูแลช่องได้โยกย้ายเนื้อหาบางส่วนไปไว้ที่ Odysee บริการที่สร้างบนบล็อกเชนโปรโตคอลที่ชื่อว่า LBRY</p>\n<p>ในช่วงไม่กี่ปีที่ผ่านมา YouTube ได้จำกัดเนื้อหามากขึ้น ท่ามกลางการตรวจสอบที่เพิ่มขึ้นเกี่ยวกับการกลั่นแกล้งในโลกออนไลน์ ข้อมูลผิด และคำพูดแสดงความเกลียดชัง ซึ่งกระทบช่องขวาจัดมาก บังคับให้พวกเขาแสวงหาที่หลบภัยอื่นในโซเชียลมีเดีย เช่น Parler</p>\n<p>ที่มา - <a href=\"https://www.reuters.com/technology/exclusive-youtube-takes-down-xinjiang-videos-forces-rights-group-seek-2021-06-25/\">Reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/youtube\">YouTube</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/freedom-information\">Freedom of Information</a></div><div><a href=\"/topics/human-rights\">Human Rights</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b914487c1cfa7a5dd765f9a48ecae209b1b1c0b5c51173e9c17f79c81ed334f4","category":"Thai"}