{"title":"A new mechanistic model for individual growth applied to insects under ad libitum conditions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309664","date":1725458400000,"content":"<p>by Karl Mauritsson, Tomas Jonsson</p>\r\n\r\nMetabolic theories in ecology interpret ecological patterns at different levels through the lens of metabolism, typically applying allometric power scaling laws to describe rates of energy use. This requires a sound theory for metabolism at the individual level. Commonly used mechanistic growth models lack some potentially important aspects and fail to accurately capture a growth pattern often observed in insects. Recently, a new model (MGM–the Maintenance-Growth Model) was developed for ontogenetic and post-mature growth, based on an energy balance that expresses growth as the net result of assimilation and metabolic costs for maintenance and feeding. The most important contributions of MGM are: 1) the division of maintenance costs into a non-negotiable and a negotiable part, potentially resulting in maintenance costs that increase faster than linearly with mass and are regulated in response to food restriction; 2) differentiated energy allocation strategies between sexes and 3) explicit description of costs for finding and processing food. MGM may also account for effects of body composition and type of growth at the cellular level. The model was here calibrated and evaluated using empirical data from an experiment on house crickets growing under ad libitum conditions. The procedure involved parameter estimations from the literature and collected data, using statistical models to account for individual variation in parameter values. It was found that ingestion rate cannot be generally described by a simple allometry, here requiring a more complex description after maturity. Neither could feeding costs be related to ingestion rate in a simplistic manner. By the unusual feature of maintenance costs increasing faster than linearly with body mass, MGM could well capture the differentiated growth patterns of male and female crickets. Some other mechanistic growth models have been able to provide good predictions of insect growth during early ontogeny, but MGM may accurately describe the trajectory until terminated growth.","author":"Karl Mauritsson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b91ba4b9e4f904b46c5a83b00480b3e354e8797d665533efb670ea48b3359ac1","category":"Interdisciplinary"}