{"title":"Attributing Urban Evapotranspiration From Eddy‐Covariance to Surface Cover: Bottom‐Up Versus Top‐Down","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037508?af=R","date":1726929582000,"content":"<h2>Abstract</h2>\n<p>Evapotranspiration (ET) $(ET)$ is a key process in the hydrological cycle that can help mitigate urban heat. ET $ET$ depends on the surface cover, as the surface affects the partitioning of precipitation between runoff and evapotranspiration. In urban neighborhoods, this surface cover is highly heterogeneous. The resulting neighborhood-scale ET $ET$ can be observed with eddy-covariance systems. However, these observations represent the signal from wind- and stability-dependent footprints resulting in a continuously changing contribution of surface cover types to the observation. This continuous change prevents quantifying the contribution of the surface cover types to neighborhood ET $ET$ and their hourly dynamics. Here, we disentangle this neighborhood-scale ET $ET$ at two sites in Berlin attributing the patch-scale ET $ET$ dynamics to the four major surface cover types in the footprint: impervious surfaces, low vegetation, high vegetation, and open water. From the bottom-up, we reconstruct neighborhood ET $ET$ based on patch-scale observations and conceptual models. Alternatively, we start top-down and attribute neighborhood ET $ET$ to the surface cover types solving a system of equations for three eddy-covariance systems. Although data requirements for the bottom-up approach are met more frequently, both approaches indicate that vegetation is responsible for more ET $ET$ than proportional to its surface fraction in the footprint related to the large evaporating surface compared to the ground surface. Evaporation from impervious surfaces cannot be neglected, although it is less than from vegetation due to limited water availability. The limited water availability causes impervious surfaces to cease evaporation hours after rainfall, while vegetation and open water sustain ET $ET$ for extended periods.</p>","author":"H. J. Jongen, \nS. Vulova, \nF. Meier, \nG. J. Steeneveld, \nF. A. Jansen, \nD. Tetzlaff, \nB. Kleinschmit, \nN. Haacke, \nA. J. Teuling","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"b93651f54d3c813544cfbeb1bd94ae6176350b04f431b7605faf678f2dc1728b","category":"Environment"}