{"title":"Apple just made it way easier to design apps on your iPad","link":"https://www.macworld.com/article/559882/apple-swift-playgrounds-4-ipad-mac.html","date":null,"content":"<div>\n<section><div></div></section><p>Apple on Wednesday released <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/swift-playgrounds/id908519492&amp;xcust=1-1-559882-1-0-0&amp;sref=https://www.macworld.com/feed\">Swift Playgrounds 4</a>, an iPad and Mac app used to create apps in the Swift programming language. Apple originally announced the app at WWDC but delayed its release when <a href=\"https://www.macworld.com/article/353470/macos-monterey-superguide-features-tips-tricks-updates.html\">macOS Monterey</a> and <a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">iPadOS 15</a> launched earlier this fall. </p>\n\n\n\n<p>Before version 4, a Mac was required by Swift Playgrounds users to submit an app to the App Store, but now iPad users no longer need to switch and can make submissions directly from the iPad. Here are the release notes that list the new features for the iPad version:</p>\n\n\n\n<blockquote><p>• Build iPhone and iPad apps with SwiftUI right on your iPad (requires iPadOS 15.2 or later)</p><p>• App Store Connect integration lets you upload your finished app to the App Store</p><p>• App Preview shows live updates as you make changes to your app</p><p>• Full-screen preview lets you see your app edge-to-edge</p><p>• Smart, inline code suggestions help you write code quickly and accurately</p><p>• App Projects make it easy to move projects to Xcode and back</p><p>• Project-wide search finds results across multiple files</p><p>• Snippets Library provides hundreds of SwiftUI controls, symbols, and colors</p><p>• Swift Package support lets you include publicly-available code to enhance your apps</p></blockquote>\n\n\n\n<p>Swift Playgrounds 4 was announced at WWDC21 and its arrival was much anticipated by the developer community. Several developers received an early copy of the app and were impressed with the performance and flexibility of version 4, including Swift guru Paul Hudson who said the speed is “like having an iPhone permanently docked on the right-hand side of your editor.”</p>\n\n\n\n<figure><div>\n<blockquote><p>Swift Playgrounds 4 is out, and it's a thing of beauty – incredible speed, brilliant code completion, and many tweaks and improvements that make building SwiftUI apps a joy. Full review here: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/gOpEhCUmxp&amp;xcust=1-1-559882-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/gOpEhCUmxp</a></p>— Paul Hudson (@twostraws) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/twostraws/status/1471185524660527112?ref_src=twsrc%5Etfw&amp;xcust=1-1-559882-1-0-0&amp;sref=https://www.macworld.com/feed\">December 15, 2021</a></blockquote></div></figure><p>Swift Playgrounds 4 for Mac is also available, which now supports <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.swift.org/blog/swift-5-5-released/&amp;xcust=1-1-559882-1-0-0&amp;sref=https://www.macworld.com/feed\">version 5.5 of the Swift programming language</a>.</p>\n\n\n\n<p><a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/swift/playgrounds/&amp;subid1=1-1-559882-1-0-0\">Swift Playgrounds</a> is software that can be used to create apps, but it is designed for people who do not know how to write code, though it’s often used by experienced coders. Playground uses a series of lessons to teach coding concepts, and the lessons become more advanced as the user makes progress. It’s much easier to use than Apple’s major programming app, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/xcode/&amp;xcust=1-1-559882-1-0-0&amp;sref=https://www.macworld.com/feed\">Xcode</a>, but you can import and export code between Playground and Xcode to be able to use the toolset you want.</p>\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b944779e6a16396457f1db4679f6a16d75e4c6fbaf54efebbaa8be984fd7086d","category":"Apple"}