{"title":"Hydrogen Bond Strengthens Acceptor Group: The Curious Case of The C-H...O=C Bond","link":"https://www.preprints.org/manuscript/202407.1039/v1","date":1720782820000,"content":"An H-bond involves the sharing of a hydrogen atom between an electronegative atom to which it is covalently bound (the donor) and another electronegative atom serving as an electron acceptor. Such bonds represent a critically important geometrical force in biological macromolecules and, as such, have been characterized extensively. H-bond formation invariably leads to a weakening within the acceptor moiety due to the pulling exerted by the donor hydrogen. This phenomenon can be compared to a spring connecting two masses; pulling one mass stretches the spring, similarly affecting the bond between the two masses. Herein, we describe the opposite phenomenon when investigating the energetics of the C-H...O=C bond. This bond underpins the most prevalent protein transmembrane dimerization motif (GxxxG) in which a glycine C-H on one helix forms a hydrogen bond with a carbonyl in a nearby helix. We use isotope-edited FT-IR spectroscopy and corroborating computational approaches to demonstrate a surprising strengthening of the acceptor C=O bond upon binding with the glycine C-H. We show that electronic factors associated with the C-H bond strengthen the C=O oscillator by increasing the s-character of the -bond, lowering the hyperconjugative disruption of the -bond. In addition, a reduction of the acceptor C=O bond’s polarity is observed upon the formation of the C-H...O=C bond. Our findings challenge the conventional understanding of H-bond dynamics and provide new insights into the structural stability of inter-helical protein interactions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b94677896aafb862bc6bafff42ba2f18f1dd8696705116db9510fce47e4940ae","category":"Interdisciplinary"}