{"title":"Parenting stress, dyadic coping and endocrine markers of stress and resilience in foster and biological mothers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310316","date":1725976800000,"content":"<p>by Vanessa Reindl, Arnold Lohaus, Nina Heinrichs, Kerstin Konrad</p>\r\n\r\nFoster parents have been shown to report higher levels of parenting stress but also more dyadic coping (DC) behaviors in their partnership than biological parents, which might be an important protective factor that helps them cope with daily stressors. Here, we examined how parenting stress and DC are related in foster and biological parents and whether these are reflected in long-term alterations of hypothalamic-pituitary-adrenocortical (HPA) axis activity. A total of 79 foster mothers and 131 biological mothers participated in a longitudinal study. At the initial assessment, children were aged 2–7 years and lived for an average of 18 months in their current foster family. Mothers’ cortisol and dehydroepiandrosterone (DHEA) concentrations and their cortisol/DHEA ratios were assessed in scalp hair twice with approximately 11 months in between, while their perceived parenting stress and DC were measured by self-report questionnaires. Results showed no significant differences between foster mothers and biological mothers in cortisol, DHEA and cortisol/DHEA concentrations. While more DC was longitudinally related to lower levels of parenting stress across both study groups, no significant associations were found to endocrine markers. Thus, these findings indicate that increased parenting stress levels were not, or not strongly, reflected in HPA axis alterations as assessed in hair. Our findings thus add evidence for non-significant associations between self-reported perceived stress and chronic HPA axis markers. Future studies may explore whether early interventions, including those aimed at promoting and maintaining positive DC, are beneficial in preventing the development of stress-related illnesses in foster parents.","author":"Vanessa Reindl","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b949c02d2076d19fadfedb30c3acbe4df8558f0ced831fe028cd12c6daf33e2a","category":"Interdisciplinary"}