{"title":"Pirelli launches $37 SmarTUBE lightweight inner tubes","link":"https://cyclingtips.com/2021/05/pirelli-launches-37-smartube-lightweight-inner-tubes/","date":1621002858000,"content":"<p>Pirelli has announced the launch of its new range of super-light, reinforced inner tubes made with thermoplastic polyurethane (TPU). The tubes are the result of a custom tubular update for Pirelli’s World Tour teams and is said to be 70% lighter than a standard butyl tube. </p>\n\n\n\n<p>The new tube is available in three options. The P-Zero, a 35g road-specific version, the reinforced Cinturato a gravel/endurance tube weighing in at 70g, and the Scorpion, an MTB option at 100g. </p>\n\n\n\n<p>The Smartubes are built using the “latest generation” TPU to create a tube Pirelli claims is “stronger than butyl and has a better air retention than latex.” As a bonus, Pirelli claims to have tuned the properties of the TPU in the reinforced Cinturato tube, to offer “double the puncture protection compared to a standard butyl tube”, although there is no mention of how this is tested.  </p>\n\n\n\n<p>The new tubes are said to use 50% less space in a jersey pocket or saddlebag, meaning more space to carry food. The P-Zero and Cinturato tubes also feature a 60mm valve to suit most rim depths, while the Scorpion comes with a 42mm valve. </p>\n\n\n\n<p>The Smartubes are only available in this “highly visible” yellow, which I guess is useful if you are replacing an inner tube in the dark of night… I can’t think of another scenario where a highly visible inner tube would be useful.  </p>\n\n\n\n<p>At $37 a tube, the fear of puncturing such an expensive tube could kill the joy of any ride, especially given that Pirelli explicitly states not to repair (patch – Ed) a damaged tube or valve. However, I can see the appeal of the Smartubes minimal weight and space-saving size as a barely noticeable backup tube.</p>\n\n\n\n<p>Interestingly while the Smartubes are rated for use with disc or rim brake road setups, Pirelli states the new tubes should not be used with rim brake mountain bikes. </p>\n\n\n\n<p>With the introduction of the Smartube, Pirelli joins <a href=\"https://cyclingtips.com/2021/04/tubolitos-new-psens-inner-tube-tells-you-how-much-air-is-in-your-tires/\" target=\"_blank\">Tubolito</a> and <a href=\"https://cyclingtips.com/2020/10/schwalbe-promises-performance-and-durability-with-new-aerothan-inner-tubes/\" target=\"_blank\">Schwalbe</a> in the TPU inner tube market.  However, unlike Tubolito who claim its S-Road tube offers “extremely low rolling resistance”, Pirelli has made no reference to efficiency gains at all. UK outfit Aerocoach recently published results of its <a href=\"https://cyclingtips.com/2020/10/updated-aerocoach-inner-tube-tests-conclude-latex-is-still-fastest/\" target=\"_blank\">rolling resistance testing</a> and found that while TPU tubes compare well, latex is still the fastest. </p>\n\n\n\n<p>The new tubes are available in a range of sizes (see below) and priced at US$36.90 / £27.99 </p>\n\n\n\n<p><a href=\"https://velo.pirelli.com/en/uk/inner-tubes\" target=\"_blank\">Velo.Pirelli.com</a></p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Pirelli-Smartube-range-1340x754.jpg\" /><figcaption>The full range of Smartube sizes and offerings</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Pirelli-SmarTUBE-1-1340x754.jpg\" /><figcaption>The P-Zero is Pirellis smallest and lightest Smartube </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Pirelli-SmarTUBE-2-1340x754.jpg\" /><figcaption>The range includes gravel, road, and MTB options</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Pirelli-SmarTUBE-5-1340x754.jpg\" /><figcaption>The tube certainly folds down quite small. Handy as a fit and forget, in case of emergency tubeless sealant backup. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Pirelli-SmarTUBE-4-1340x754.jpg\" /><figcaption>The Cinturatio is the reinforced gravel and endurance option available in 700c and 650b sizes. </figcaption></figure></li></ul></figure>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/pirelli-launches-37-smartube-lightweight-inner-tubes/\">Pirelli launches $37 SmarTUBE lightweight inner tubes</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b94be04aad660323a1683fc3b99f50812f0174ca32ec9895b11002fbf078f587","category":"Cycling"}