{"title":"Optimizing the prediction of discard survival of bottom-trawled plaice based on vitality indicators","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae070/7816362?rss=1","date":1728432000000,"content":"<span><div>Abstract</div>Predicting the discard survival of aquatic animals after fisheries capture using vitality indicators (i.e. individual scores or indices of physical condition) is a resource-efficient approach compared to estimating discard survival from captive observation. But such indicators do not always lead to accurate and robust predictions. Individual scores of reflex impairments and injuries are typically given the same weight when being aggregated into an index, while some reflexes or injuries may contribute to mortality more than others. This study established an analytical methodology and created an index based on differential contributions of individual reflexes and injuries to optimize the prediction of discard survival of bottom-trawled European plaice (<span>Pleuronectes platessa</span>). The optimization procedures were applied to a dataset from vitality assessment of 1122 undersized plaice caught during 16 commercial fishing trips and 58 gear deployments in Belgium and Denmark. As welfare indicators, we considered and evaluated against post-capture survival of plaice: original vs. optimized reflex impairment and injury (R&amp;I) index, number of absent reflexes, number of present injuries, number of absent reflexes and present injuries, categorical vitality score and individual reflex and injury scores. These were used in eight candidate generalized linear models (one without any vitality indicator) as explanatory variables to predict survival, with or without biological, environmental, technical and operational covariates, either at the individual fish or trip level. Bruising to the head and body were the most relevant predictors. The optimized R&amp;I index did not perform better than any other vitality indicator, and all the indicators performed poorly in predicting survival probability both at the fish and trip levels without information on air exposure and seawater temperature. This means that they cannot be considered to be independent measures. The categorical vitality score provided a viable alternative to the more labour-intensive, scoring method of reflex responsiveness. Use of reflexes as proxies may not be accurate when they are not independent of environmental, biological or technical variables.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"b9578049089cb0e9fdc486ce1dd4a4764db4b915f70dadc71504658c878e5766","category":"Environment"}