{"title":"iPhone 15 Pro Max to Feature Rearranged Camera Layout to Accommodate Periscope Lens","link":"https://www.macrumors.com/2023/05/17/iphone-15-pro-max-camera-redesign-periscope/","date":1684325361000,"content":"Apple is set to rearrange the layout of the rear triple-lens camera system on the iPhone 15 Pro Max to accommodate the new periscope camera technology that will be exclusive to the larger handset. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/iphone-14-pro-cameras.jpg\" alt width=\"1184\" height=\"670\" /><div><em>iPhone 14 Pro camera layout. Arrows indicate swapped lens positions on iPhone 15 Pro Max.</em></div>\r<br />\nThis year, a periscope lens system will be used for the telephoto camera in the iPhone 15 Pro Max for the first time, allowing for <a href=\"https://www.macrumors.com/2023/05/08/iphone-15-pro-max-periscope-rumored-again/\">5x or 6x optical zoom</a>. Comparatively, the iPhone 14 Pro Max offers 3x optical zoom, which is expected to be retained for the smaller iPhone 15 Pro.\r<br />\n\r<br />\nApple is likely limiting the periscope technology to the iPhone 15 Pro Max because of the internal space needed for the advanced hardware, but even with the available extra space in the Pro Max model, Apple has had to reorganize the formation of the camera module purely out of necessity.\r<br />\n\r<br />\nWhen the current iPhone 14 Pro Max is held in landscape orientation with the Side button at the top (as per the above image) the Telephoto lens is closest to the top corner of the device, while the Ultra Wide lens sits below between the flash and LiDAR sensor. \r<br />\n\r<br />\nIn comparison, the Ultra Wide lens on the iPhone 15 Pro Max will move to the corner position in the array, while the Telephoto will take its place between the flash and LiDAR. This will provide Apple with more internal space to fit in the complex folded optics in the periscope system.\r<br />\n\r<br />\nA periscope lens system generally uses a primary lens to capture a photo, with an angled mirror or prism reflecting the light 90 degrees toward a second lens that then sends it to the image sensor. The image sensor and secondary lens are positioned sideways inside the smartphone to extend focal length, and that takes up valuable surface area. \r<br />\n\r<br />\nBecause of the way light is reflected at an angle in this system, the actual telephoto lens will likely need to be square-shaped, a departure from the circular telephoto lens used for the iPhone 14 Pro Max. Granted, the camera cutout will still be circular, but the actual lens inside will be square.\r<br />\n\r<br />\nIn that sense, compared to the iPhone 14 Pro Max, from the outside the next-generation model will look as though nothing has changed in the lens array, but under hood, the hardware layout will be significantly different.\r<br />\n\r<br />\n<div><blockquote><p>On a related note - the camera arrangement has changed, compared to the 14 Pro / Pro Max.<br /><br />The Ultra Wide and Telephoto cameras have swapped positions - so the camera between the flash and LiDAR sensor is the one with periscope lens on the 15 Pro Max (regular telephoto on 15 Pro) <a href=\"https://t.co/J0QYdPsNH7\">https://t.co/J0QYdPsNH7</a></p>— Unknownz21 🌈 (@URedditor) <a href=\"https://twitter.com/URedditor/status/1658596215951441920?ref_src=twsrc%5Etfw\">May 16, 2023</a></blockquote> </div>\r<br />\nThe notable tidbit was revealed by researcher <a href=\"https://twitter.com/URedditor/status/1658596215951441920?s=20\">Unknownz21</a>, who yesterday <a href=\"https://www.macrumors.com/2023/05/16/iphone-16-display-sizes/\">confirmed</a> that next year, both the iPhone 16 Pro and iPhone 16 Pro Max will get the periscope zoom camera technology, a change that was <a href=\"https://www.macrumors.com/2023/05/16/iphone-16-pro-models-larger-periscope/\">first revealed by Apple analyst Ming-Chi Kuo</a>.\r<br />\n\r<br />\nThe displays on the iPhone 16 Pro and Pro Max models are expected to be <a href=\"https://www.macrumors.com/2023/05/08/iphone-16-pro-larger-display-sizes/\">slightly bigger</a> than previous generation models, and the larger internal space afforded by the new sizes is likely one of the reasons why Apple will be able to bring the periscope lens to both premium devices in 2024 for the first time.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/periscope-lens/\">Periscope Lens</a>, <a href=\"https://www.macrumors.com/guide/unknownz21/\">Unknownz21</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/17/iphone-15-pro-max-camera-redesign-periscope/\">iPhone 15 Pro Max to Feature Rearranged Camera Layout to Accommodate Periscope Lens</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-max-to-feature-rearranged-camera-layout-to-accommodate-periscope-lens.2389772/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b9596554ab36fbce2a05f9317a12550dcd5a0d0c73200623885b68f7885d4eea","category":"Apple"}