{"title":"In vivo evidence of sea buckthorn relieving oxidative stress and improving immune performance of common carp (Cyprinus carpio L.)","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13535?af=R","date":1713199451000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Sea buckthorn has the functions of anti-oxidation, anti-tumor, anti-inflammation and regulating energy metabolism. In order to investigate the effects of sea buckthorn powder and sea buckthorn flavonoids on the antioxidant properties, immune function, and muscle fatty acid composition of common carp, an oral feeding experiment was carried out.</p>\n<h2>Results</h2>\n<p>The administration of glucose significantly reduced the levels of GSH and the activity of T-AOC enzyme in serum and hepatopancreas, while concurrently up-regulating the level of MDA (<i>P</i> &lt; 0.05). Conversely, oral intake of sea buckthorn powder and flavonoids increased antioxidant enzyme activity and decreased MDA levels. In terms of antioxidant molecular indicators, sea buckthorn powder and sea buckthorn flavonoids significantly increased the mRNA levels of nuclear factor NF-E2-related factor (<i>nrf2</i>) in the hepatopancreas and muscle. Meanwhile, mRNA expression levels of downstream antioxidant-related genes (<i>gr</i>, <i>cat</i>, <i>gpx,</i> and <i>sod</i>) regulated by Nrf2 were also up-regulated. In the immune aspects, the mRNA expression levels of the pro-inflammatory cytokines, such as interleukin-6 (<i>il-6</i>), interleukin-1β (<i>il-1β</i>) and nuclear factor-κB (<i>nf-κb</i>) were reduced, but the expressions of anti-inflammatory cytokines, such as growth factor-β (<i>tgf-β</i>) and interleukin-10 (<i>il-10</i>) were enhanced in the head kidney and spleen tissues after oral administration with sea buckthorn. In terms of muscle fatty acid composition, the ratio of n-3 PUFA/n-6 PUFA was notably higher after administering sea buckthorn flavonoids than that of the glucose group (<i>P</i> &lt; 0.05).</p>\n<h2>Conclusion</h2>\n<p>This study demonstrated that oral administration of sea buckthorn powder and sea buckthorn flavonoids significantly enhanced the antioxidant capacity and immune response, improved the muscle fatty acid compositions in common carp, and also mitigated the adverse effects of glucose treatment to a certain extent.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Xiao Yan, \nPeng Pang, \nHang Zhang, \nJiali Mi, \nChaobin Qin, \nLiping Yang, \nBowen Yang, \nGuoxing Nie","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"b961c05e9821dca9277cdbf9958730d5623e9e8e39866b6aff031bdc4f87d93e","category":"Environment"}