{"title":"New HCP Vault Secrets, Radar, and other features fight secrets sprawl","link":"https://www.hashicorp.com/blog/new-hcp-vault-secrets-radar-and-other-features-fight-secrets-sprawl","date":1697040000000,"content":"<p>Today at <a href=\"https://hashiconf.com/2023/\">HashiConf</a>, we are pleased to announce the alpha program for HashiCorp Cloud Platform (HCP) Vault Radar, <a href=\"https://developer.hashicorp.com/hcp/docs/vault-secrets\">HCP Vault Secrets</a> general availability, secrets sync beta for Vault Enterprise, and <a href=\"https://www.hashicorp.com/blog/vault-1-15-brings-ui-updates-pki-enhancements-new-betas-and-more\">HashiCorp Vault 1.15</a>. These new capabilities help organizations secure their applications and services as they leverage a <a href=\"https://www.hashicorp.com/cloud-operating-model\">cloud operating model</a> to power their shift to the cloud. Enabling a cloud operating model helps organizations cut costs, reduce risks, and increase the speed at which developers build and deploy secure applications. </p>\n\n<p>The new capabilities boost Vault’s focus on helping organizations use identity to achieve their security goals by:</p>\n\n<ul>\n<li><strong>Centrally managing and enforcing access to secrets and systems</strong> based on trusted sources of application and user identity. </li>\n<li><strong>Eliminating credential sprawl</strong> by identifying static secrets hardcoded throughout complex systems and tooling across your entire cloud estate.</li>\n<li><strong>Reducing manual overhead and risk</strong> associated with managing access to infrastructure resources like SSH, VPNs, as well as applications and services. </li>\n<li><strong>Automatically implementing authentication and authorization mechanisms</strong> to ensure only authorized services can communicate with one another.</li>\n</ul>\n\n<p>Below is a closer look at each of the Vault announcements made at HashiConf: </p>\n\n<h2>HCP Vault Radar (alpha)</h2>\n\n<p>Organizations can significantly reduce their attack surface by leveraging Vault to manage secrets, enforce authentication, and rotate credentials regularly. However, many enterprises struggle with the step <em>before</em> secrets management: finding all of the untracked secrets sprawled across their IT estates.</p>\n\n<p>In June, HashiCorp <a href=\"https://www.hashicorp.com/blog/announcing-acquisition-of-blubracket\">announced the acquisition of BluBracket</a>, a company that focused on enabling customers to scan, identify, and remediate secrets inadvertently stored in source code, development environments, internal wikis, chat services, and ticketing systems. Secret scanning is essential for organizations working to control secret sprawl without compromising efficiency, speed, and innovation. Today, we’re updating the HashiCorp community on our progress integrating BluBracket technology into the HashiCorp product line. </p>\n\n<p>The initial deliverable built from the BluBracket acquisition is called HCP Vault Radar. Additionally, we have successfully integrated Vault Radar’s secret detection functionality in Git-based version control systems, AWS Configuration Manager, and directory structures in the HCP ecosystem. </p>\n\n<p>HCP Vault Radar automates the detection, identification, and removal of secrets in code. It categorizes secrets, ranks them by risk, and provides a means to remediate them. Categories can include:</p>\n\n<ul>\n<li>Secrets</li>\n<li>Personally identifiable information (PII)</li>\n<li>Non-inclusive language (NIL)</li>\n</ul>\n\n<p>HCP Vault Radar also protects code from leaking into public repositories and helps prevent secrets and intellectual property from getting into the wrong hands. HCP Vault Radar works across multiple Git providers, integrates with enterprise CI/CD tools, version control, code servers, identity and access management (IAM) systems, messaging, ticketing, and many other IT resources.</p>\n\n<p>Organizations interested in testing these new features can request to be a part of our <a href=\"https://www.hashicorp.com/go/blubracket-integration-updates\">early access program</a>. HCP Vault Radar is scheduled to be released in beta in January 2024 and we anticipate general availability later in 2024. </p>\n\n<h2>HCP Vault Secrets (GA)</h2>\n\n<p>HCP Vault Secrets — generally available today — is a new software-as-a-service (SaaS) offering of HashiCorp Vault focusing primarily on secrets management. HCP Vault Secrets was released in beta earlier this year as an even faster, simpler way for users to onboard with Vault secrets management. The general availability builds on the beta release with production-ready secrets management capabilities, additional secrets sync destinations, and multiple consumption tiers. </p>\n\n<p>HCP Vault Secrets sharpens the focus on secrets management with three key benefits:</p>\n\n<ul>\n<li><strong>Centralized secrets management:</strong> Centralize secrets lifecycle management in one place so users can eliminate context switching between multiple secrets management applications.</li>\n<li><strong>Secure secrets when and where you need them:</strong> Enhanced secrets versioning and access control setup ensures secrets can be securely synced to multiple destinations, including AWS Secrets Manager, GitHub Actions, and Vercel. Alternatively, app secrets can be fetched using CLI, <a href=\"https://developer.hashicorp.com/hcp/api-docs/vault-secrets\">API</a>, <a href=\"https://registry.terraform.io/providers/hashicorp/hcp/latest/docs/data-sources/vault_secrets_secret\">Terraform</a>, or Vault Secrets Operator. </li>\n<li><strong>Get up and running in minutes, for free:</strong> Users and organizations can get started with HCP Vault Secrets in minutes via our free offering or our standard paid tier. </li>\n</ul>\n\n<p>To get started, sign up for <a href=\"https://portal.cloud.hashicorp.com/sign-up?product_intent=vault\">HCP Vault Secrets for free</a> and check out our <a href=\"https://developer.hashicorp.com/hcp/docs/vault-secrets\">HCP Vault Secrets documentation</a> on HashiCorp Developer. </p>\n\n<p><strong>Learn more:</strong> <a href=\"https://www.hashicorp.com/blog/hcp-vault-secrets-is-now-generally-available\">HCP Vault Secrets is now generally available</a></p>\n\n<h2>Vault Enterprise secrets sync (beta)</h2>\n\n<p>Cloud secrets sync, previously available only in HCP Vault Secrets, is now available as a beta feature in <a href=\"https://www.hashicorp.com/blog/vault-1-15-brings-ui-updates-pki-enhancements-new-betas-and-more\">Vault Enterprise 1.15</a>. Secrets sync allows platform teams to centralize their secrets management while still letting developers easily consume secrets as needed within the applications they use every day.</p>\n\n<p>As more and more organizations adopt a multi-cloud approach, they face challenges around isolated secrets management, compliance, and reporting tools, as well as protecting expanded attack surfaces. Isolated secrets management solutions are primarily concerned with unifying secrets across solutions that are specific to their own platform, which can’t provide a complete solution and therefore is not suitable for multi-cloud environments. They also lose the ability to centrally provision and rotate secrets based on the best practices they’ve established. That leaves organizations faced with leveraging multiple logging tools to show auditors that they are within compliance. Finally, multi-cloud environments present a larger attack surface, making secrets management and compliance more important than ever. </p>\n\n<p>Vault secrets sync bridges this multi-cloud secrets management divide between solution providers by helping teams update, rotate, and revoke secrets across multiple platforms. Used in conjunction with Vault’s existing automation functionality, secrets sync can execute these tasks automatically. Without secrets sync, organizations’ visibility into their secrets will be fragmented amongst different platforms and create a prohibitive level of risk.</p>\n\n<p>The new Vault secrets sync beta release supports the synchronization of secrets to multiple platforms, and more are planned for the feature’s general availability:</p>\n\n<ul>\n<li>Amazon Web Services (AWS)</li>\n<li>Microsoft Azure</li>\n<li>Google Cloud </li>\n<li>GitHub</li>\n<li>Vercel</li>\n</ul>\n\n<p><strong>Learn more:</strong> Visit our <a href=\"https://developer.hashicorp.com/vault/docs/sync\">developer documentation</a> or the <a href=\"https://www.hashicorp.com/products/vault/features\">Vault product page</a>.</p>\n\n<h2>HashiCorp Vault 1.15</h2>\n\n<p>HashiCorp Vault 1.15, <a href=\"https://www.hashicorp.com/blog/vault-1-15-brings-ui-updates-pki-enhancements-new-betas-and-more\">released last month</a>, includes a broad range of updates, including new graphical user interfaces, PKI certificate management customizations, and several new beta features. Notable updates include:</p>\n\n<p><strong>New landing page dashboard:</strong> Vault 1.15 introduces a landing page dashboard that provides a more comprehensive and unified overview of important information about a Vault instance. From this new view, customers can quickly see key information like client counts and config details and take quick actions.</p>\n\n<p><strong>Certificate issuance external policy service (CIEPS):</strong> With the release of CIEPS, Vault enables fine-grained control over issued certificates using custom policies in a customer-defined service outside of Vault. Using CIEPS, customers implement a custom service that can be called by the Vault PKI secrets engine to evaluate and override original certificate-request content. This capability helps customers ensure Vault PKI-issued certificates meet corporate compliance standards.</p>\n\n<p><strong>Vault Enterprise seal high availability (beta):</strong> This new feature lets enterprise customers use independent seals retained in multiple key management services (KMS) providers, helping to ensure continuity of business operations.</p>\n\n<p><strong>Event monitoring (beta):</strong> This feature, now in beta, lets subscribers register to be notified of changes to their key-value (KV) secrets. Initially released as an alpha feature in <a href=\"https://www.hashicorp.com/blog/vault-1-13-adds-kubernetes-operator-mfa-improvements-and-more\">Vault 1.13</a>, event monitoring now adds full policy support, namespaces, and an API.</p>\n\n<p><strong>Learn more:</strong> <a href=\"https://www.hashicorp.com/blog/vault-1-15-brings-ui-updates-pki-enhancements-new-betas-and-more\">Vault 1.15 brings UI updates, PKI enhancements, new betas, and more</a></p>\n\n<h2>Get started and go deeper with Vault</h2>\n\n<p>The new options for identity-based security with HashiCorp Vault — including HCP Vault Radar, HCP Vault Secrets, Vault Enterprise secrets sync, and other features in Vault 1.15 — fight secret sprawl,  reduce operational costs, improve speed of delivery, and lower risk in multiple ways. They also provide the flexibility to choose cloud-based multi-tenant or dedicated approaches, self-managed or HashiCorp-managed, and Vault community options to fit your organizational standards and preferences.</p>\n\n<p>For more information about the latest releases of Vault Enterprise, visit the <a href=\"https://developer.hashicorp.com/vault/docs\">Vault Enterprise release page</a>. To learn more about HCP Vault and Vault Enterprise, or to get started with HashiCorp Vault, visit the <a href=\"https://www.hashicorp.com/products/vault/features\">Vault product page</a> and <a href=\"https://www.hashicorp.com/contact-sales\">contact HashiCorp Sales</a>.</p>\n","author":"Rich Dubose","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b9653230163b94219a0caf4eb0621b84397b04ca1e662de6ef672d001703f10b","category":"Tech"}