{"title":"Giro d'Italia First Week Debrief: the jersey contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-first-week-debrief-the-jersey-contenders-so-far","date":1621060829000,"content":"\n      <p><span>Seven days of the Giro d'Italia</span><span> have gone by and Atilia Valter is sitting pretty in pink. This is largely unexpected as Valter is a relatively unknown rider; at only 22 and in his second ever Grand Tour, many of us won’t have had him in our fantasy teams.</span></p>\n<p><span>There have been surprise wins with Taco van der Hoorn pulling off an exceptional solo feat, and enormous lows with GC favourites Mikel Landa and Pavel Sivakov crashing out on Wednesday’s sprint stage. With 14 stages remaining, the race is in its early days and there’s still everything to play for at the Giro.</span></p>\n<p><span>Still, a lot can be taken away from the opening week. We might not yet have a clear idea of who will be the likely winner of the race but small gaps are opening up in the fight for pink and a few riders are already out of contention. The fast men have shown their hand in three furious sprint stages and the competition for the maglia azzurra is still tight at the top of the leaderboard between the breakaway specialists.</span></p>\n<p><span>Here’s how the fight for each jersey at the Giro is playing out.</span></p>\n<div></div>\n<h4>Maglia rosa - GC contenders</h4>\n<p><span>Valter holds the jersey for now, but by a slender margin of 11 seconds to the Belgian protégé Remco Evenepoel. Valter will face his first real challenge defending the jersey on stage 8 –  a rolling day which will feature a second category climb.</span></p>\n<p><span>The battle for the GC began on stage 1, the opening time trial in Turin. With Ganna’s winning time being around eight minutes, no huge gaps developed between riders, but Deceuninck-Quick Step’s Evenepoel and João Almeida were the best placed of the GC favourites. Astana’s Alexandr Vlasov also had an impressive ride, putting 14 seconds into Simon Yates and Hugh Carthy, and 15 into Egan Bernal.</span></p>\n<p><span>The next real hit out for the climbers came on stage 4 in torrential rain which followed them from the flag drop all the way to the finish in Sestola. Mikel Landa and Hugh Carthy flourished in the grim conditions, coming to the line in a group with Bernal, Vlasov and Ciccone. Evenepoel finished 10 seconds down, along with Yates, Martin and Bardet. The real loss for Quick Step, though, was the disappointing performance of Almeida who finished four minutes down on his rivals. There’s no question of who will lead Deceuninck for the rest of the race now.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/bernal_y_remco_1024x1024.jpg?v=1620979521\" /></div>\n<p><em><span>Bernal and Evenepoel are best placed of the pre-race favourites</span></em></p>\n<p><span>On paper, the flat, sprint stage which followed should have been a simple one for the GC contenders, but a technical run in and precarious road furniture wreaked havoc for some. Mikel Landa and Pavel Sivakov crashed in the run in, leading them both to retire from the race. A huge loss for both of their teams.</span></p>\n<p><span>Stage 6 was the last time the GC men fought it out in a mountainous stage which finished on a second category climb: the Colle San Marco. Once again, the weather didn’t comply: lashings of rain made it a grim day out for the riders.</span></p>\n<p><span>Bernal, Martin and Evenepoel finished in a group behind Gino Mäder, the stage winner, after a dominant performance by the Ineos Grenadiers. Soler, Carthy, Yates and Vlasov were all around 15 seconds behind the leading trio, as Bernal rode an attacking race and did his best to snatch any time he could on his rivals.</span></p>\n<p><span>Evenepoel would not be distanced by the Colombian rider, though, meaning he and Bernal now sit 2nd and 3rd respectively on GC. Vlasov sits in 4th, Carthy in 6th, the Italian duo of Caruso and Ciccone in 7th and 8th, whilst Martin and Yates round out the top 10.</span></p>\n<p><span>The gaps are still slender with only 49 seconds separating the top 10. What is clear from this first week is that Ineos and Quick-Step are the two most dominant teams in the race and anyone who wants to disrupt Bernal or Evenepoel’s assault on pink is going to need to think strategically in the stages coming up.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Italy_Photo_Press_1030063_1024x1024.jpg?v=1620856409\" /></div>\n<p><em>Who will don the maglia ciclamino when the race concludes in Milan? </em></p>\n<h4>Maglia ciclamino - The sprinters</h4>\n<p><span>The chances for the sprinters are heavily weighted to the front of the Giro this year. There have already been four stages that the fast men would have highlighted as possible win opportunities so far.</span></p>\n<p><span>The first came on stage 2, and it was won by the new kid on the block: Tim Merlier. He’s riding his first Grand Tour for Alpecin-Fenix, and what a way to begin their campaign. Despite only being ProTeam level, the Belgian outfit stuck it to the big guns and delivered Merlier to the line after a strong lead out. He opened up his sprint from four wheels back and pipped Giacomo Nizzolo to the line.</span></p>\n<p><span>UAE Team Emirates had a disastrous race, with Gaviria’s leadout man almost putting him into the barriers. Pre-stage favourite Caleb Ewan also was out of position, finishing in tenth spot.</span></p>\n<p><span>With his win, Merlier also took the maglia ciclamino which he wore in to stage 3 – a day in which he might have hoped to have a crack at victory again, if it hadn’t been for the blistering pace Bora-Hansgrohe set on the front for Peter Sagan. The Slovak’s team dropped Merlier and some other big sprinters on the climbs earlier in the stage, in the hope that Sagan would take victory from a reduced bunch. </span></p>\n<p><span>Taco van der Hoorn spoiled their master plan, however, staying away from the chasing pack after being in breakaway all day to win the stage. Sagan took third in the end, ahead of Viviani in fourth place. Despite being dropped, Merlier had enough points to hold on to the maglia ciclamino.</span></p>\n<p><span>Like many of the other sprinters, Caleb Ewan struggled over the mountains in stage 4, his main focus being to make the time cut. Still, he managed to overcome any fatigue he was carrying to win the following day in stage 5. Merlier dropped his chain in an unfortunate tangle with his Aussie rival and he finished down in 12th place. </span></p>\n<p><span>Home favourite Nizzolo finished runner-up for the second time this Giro, something that can only be fuelling his hunger to clinch that elusive stage victory. Still, his consistency is not without reward, as he took the maglia ciclamino going into stage 7, where Ewan took his second win of the race so far.</span></p>\n<p><span>Closing the gap to Gaviria, who opened up his sprint early, Ewan displayed pure strength in a long run-in to the line, finishing ahead of Davide Cimolai and Merlier. With this victory, the Aussie catapults himself into the lead of the points classification – he'll wear the purple jersey into the hills.</span></p>\n<div></div>\n<h4><strong>Maglia azzurra - The breakaway men</strong></h4>\n<p><span>Keeping their sponsors happy with some good TV time, the Spanish team Eolo-Kometa made sure they were represented in the breakaways of stages 1 and 2. This helped Vincenzo Albanese into the blue climber’s jersey, which he wore until stage 4, where he lost it to eventual stage winner Joe Dombrowski from UAE Team Emirates.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG_1097_copy_1024x1024.jpg?v=1621001545\" /></div>\n<p><em><span>Wildcards </span></em><em><span>Eolo-Kometa have soaked up some TV time in week one</span></em></p>\n<p><span>Dombrowski looked to be in fantastic shape in stage 4, riding away from his breakaway companions to take his first ever Grand Tour stage win. It was heartbreak for the American rider, though, when he crashed out in the sprint stage the next day and had to leave the race due to concussion. </span></p>\n<p><span>The unfortunate retirement of Dombrowski meant that the maglia azzurra fell on the shoulders of Albanese once again, until the Eolo-Kometa rider lost it to Gino Mäder in the mountains of stage 6. Mäder won the stage too, proving his exceptional form at the moment. </span></p>\n<h4>Maglia bianca - The young rider</h4>\n<p><span>Young Remco Evenepoel is taking care of this jersey for the maglia rosa, Attila Valter. At only 22, the Hungarian rider is also eligible for the young rider's competition, as are the top four riders in the general classification, for that matter.</span></p>\n<p><span>The fact that most of the riders who could win the white jersey are targeting pink is an indication of a change in the average age of Grand Tour contenders in recent years. At this stage in the race, it looks as if Bernal and Evenepoel are the two main contenders for the maglia rosa and the white jersey would be a consolation prize, at most, for either of the young talents.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b9897d35ec47188e09cdb3b8008a12e84e1cd0953e19c321395dc3d708c73fd5","category":"Cycling"}