{"title":"Photodegradation of a Broad-Spectrum Antibiotic Azithromycin Using H2O2 under UV Irradiation","link":"https://www.preprints.org/manuscript/202404.1626/v1","date":1713965644000,"content":"The photodegradation of azithromycin present was carried out in water using H2O2 under UV irradiation. The reaction variables considered in this study were the amount of H2O2 solution and the initial concentration of azithromycin to evaluate the performance of the photodegradation process. The azithromycin degradation was not observed in the dark during stirring for 20 minutes. The study showed efficient photodegradation of azithromycin using H2O2 as an oxidant in the presence of UV irradiation. The azithromycin degradation was affected significantly by the pH of the irradiated solution. The degradation was low at an acidic pH and showed an increasing trend as the pH changed to basic. The azithromycin degradation was increased with a higher amount (higher concentration) of H2O2. The degradation of azithromycin decreased with a higher concentration of azithromycin in the reacting solution. The highest degradation of AZT was achieved in 1 hour using a 1.0 ppm AZT solution containing 3 ml of H2O2. The experimental data obtained was well-fitted to zero-order reaction kinetics. The results of this study were found to be superior when compared with those reported in the literature, with photocatalysis using nanomaterials and photolysis using irradiation and H2O2. The UV/H2O2 system was found to be quite efficient for the photodegradation of azithromycin, and this system can be applied to degrade other organic pollutants present in industrial wastewater. To this point, such a study has not been reported specifically for AZT photodegradation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b98ec62c72841de4fc8a01f5b0bd8a23f66670b865e2ff61c587ac9bd52deedf","category":"Interdisciplinary"}