{"title":"Nuzzel Is Shutting Down After Acquisition by Twitter","link":"https://blog.nuzzel.com/nuzzel-is-going-away-for-now/","date":1620264748000,"content":"\n<p>Tony Haile, writing yesterday at the Nuzzel blog:</p>\n\n<blockquote>\n  <p>Simply cloning a service conceived in 2012 doesn’t make a ton of\nsense. Instead we’re going to spend a little time working out how\nthe best of Nuzzel should be expressed in 2021. There may be\nelements of Nuzzel that also belong in the Twitter app or that can\ntake advantage of new internal APIs.</p>\n\n<p>In the meantime, Nuzzel’s app, site and email service will go\ndark. To those of you who love Nuzzel and are disappointed that\nwe can’t maintain Nuzzel as-is in the interim, I’m as\ndisappointed as you. We explored any number of Hail Marys to make\nthat happen and just couldn’t get there. Looking to the future,\nNuzzel’s functionality has always felt like it should be a part\nof Twitter and I’m excited to help make it so. If you want to\nhelp, let us know.</p>\n</blockquote>\n\n<p>Nuzzel is probably the best Twitter service that most of you have never heard of. The basic idea behind Nuzzel is (was?) that you signed in with your Twitter account, and rather than show you <em>tweets</em> from the people you follow, like a Twitter client would, it showed you <em>links</em> that were posted by the people you follow, sorted by how many people had shared the same article. It’s a remarkably effective way to find good articles. If I had to guess, I’d say I’ve posted <em>thousands</em> of linked list items here on Daring Fireball that discovered via Nuzzel over the years. There’s nothing else quite like it, so here’s hoping Twitter can surface something very similar post-acquisition. (I’m not holding my breath.)</p>\n\n<p><a href=\"https://twitter.com/GlennF/status/1389663288657473536\">Glenn Fleishman</a>:</p>\n\n<blockquote>\n  <p>Nuzzel has been since it launched nearly the only app I’ve ever\nlet put notifications on my lock screen, and something I consult\n20 to 50 times a day. I don’t blame Twitter, though: the model\ndidn’t pan out (though I would have paid $25–$50 a year as a\nservice!).</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/waxpancake/status/1389634422123626496\">Andy Baio</a>:</p>\n\n<blockquote>\n  <p>Add me to the list of people bummed that Nuzzel is shutting down\non Thursday after Twitter acquired Scroll, its parent company. It\nwas really good at surfacing popular links and articles from your\nnetwork.</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/mmasnick/status/1389599395075690498\">Mike Masnick</a>:</p>\n\n<blockquote>\n  <p>I, of course, found out about this story via Nuzzel, an app I use\nmultiple times a day. This is going to upset my entire news\nfinding process.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/05/05/nuzzel\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b98f4e8cd82ca060d2090853390a4df5241bcc7d184e4342e2817f3fc21fe02f","category":"Tech"}