{"title":"NPCC4: New York City climate risk information 2022—observations and projections","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15116?af=R","date":1717401278000,"content":"<h2>Abstract</h2>\n<p>New York City (NYC) faces many challenges in the coming decades due to climate change and its interactions with social vulnerabilities and uneven urban development patterns and processes. This New York City Panel on Climate Change (NPCC) report contributes to the Panel's mandate to advise the city on climate change and provide timely climate risk information that can inform flexible and equitable adaptation pathways that enhance resilience to climate change. This report presents up-to-date scientific information as well as updated sea level rise projections of record. We also present a new methodology related to climate extremes and describe new methods for developing the next generation of climate projections for the New York metropolitan region. Future work by the Panel should compare the temperature and precipitation projections presented in this report with a subset of models to determine the potential impact and relevance of the “hot model” problem. NPCC4 expects to establish new projections-of-record for precipitation and temperature in 2024 based on this comparison and additional analysis. Nevertheless, the temperature and precipitation projections presented in this report may be useful for NYC stakeholders in the interim as they rely on the newest generation of global climate models.</p>","author":"Christian Braneon, \nLuis Ortiz, \nDaniel Bader, \nNaresh Devineni, \nPhilip Orton, \nBernice Rosenzweig, \nTimon McPhearson, \nLauren Smalls‐Mantey, \nVivien Gornitz, \nTalea Mayo, \nSanketa Kadam, \nHadia Sheerazi, \nEquisha Glenn, \nLiv Yoon, \nAmel Derras‐Chouk, \nJoel Towers, \nRobin Leichenko, \nDeborah Balk, \nPeter Marcotullio, \nRadley Horton","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"b9923b1d345bb3f5f677f2fc9e41ffebeb9d9a27a525f75ef26019f8c6a7338c","category":"Environment"}