{"title":"Unlocking the power of synergy: High-intensity functional training and early time-restricted eating for transformative changes in body composition and cardiometabolic health in inactive women with obesity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301369","date":1714572000000,"content":"<p>by Ranya Ameur, Rami Maaloul, Sémah Tagougui, Fadoua Neffati, Faten Hadj Kacem, Mohamed Fadhel Najjar, Achraf Ammar, Omar Hammouda</p>\r\nObjective <p>The purpose of this study was to examine the long-term effects of time-restricted eating (TRE), with or without high intensity functional training (HIFT), on body composition and cardiometabolic biomarkers among inactive women with obesity.</p> Methods <p>Sixty-four women (BMI = 35.03 ± 3.8 kg/m<sup>2</sup>; age = 32.1 ± 10 years) were randomly allocated to either: (1) TRE (≤8-h daily eating window, with ad libitum energy intake) group; (2) HIFT (3 sessions/week) group; or (3) TRE combined with HIFT (TRE-HIFT) group. The interventions lasted 12 weeks with a pre-post measurement design. A HIFT session consists of 8 sets of multiple functional exercises with self-selected intensity (20 or 30s work/10s rest).</p> Results <p>TRE-HIFT showed a greater decrease of waist and hip circumferences and fat mass compared to TRE (p = 0.02, p = 0.02 and p&lt;0.01; respectively) and HIFT (p = 0.012, p = 0.028 and p&lt;0.001; respectively). Weight and BMI decreased in TRE-HIFT compared to HIFT group (p&lt;0.001; for both). Fat-free mass was lower in TRE compared to both HIFT and TRE-HIFT groups (p&lt;0.01 and p&lt;0.001; respectively). Total cholesterol, triglyceride, insulin, and HOMA-IR decreased in TRE-HIFT compared to both TRE (p&lt;0.001, p&lt;0.01, p = 0.015 and p&lt;0.01; respectively) and HIFT (p&lt;0.001, p = 0.02, p&lt;0.01 and p&lt;0.001; respectively) groups. Glucose level decreased in TRE-HIFT compared to HIFT (p&lt;0.01). Systolic blood pressure decreased significantly in both TRE-HIFT and HIFT groups compared to TRE group (p = 0.04 and p = 0.02; respectively).</p> Conclusion <p>In inactive women with obesity, combining TRE with HIFT can be a good strategy to induce superior effects on body composition, lipid profile and glucose regulation compared with either diet or exercise intervention alone.</p> Trial registration <p>Clinical Trials Number: PACTR202301674821174.</p>","author":"Ranya Ameur","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b9975e021d79a53b1f39b9831dc316a92e6841a385e2a90417cffeb6c618f9dc","category":"Interdisciplinary"}