{"title":"อดีตประธาน Blizzard สองคนล่าสุดร่วมก่อตั้งสตูดิโอแห่งใหม่ Magic Soup Games","link":"https://www.blognone.com/node/133042","date":1678969015000,"content":"<div><div><div><p>สตูดิโอที่มีประวัติความเป็นมายาวนานแบบ Blizzard มีซีอีโอ-ประธานมาแล้วทั้งหมด 4 คน คนแรกคือ Michael Morhaime ผู้ก่อตั้งบริษัท (1991-<a href=\"https://www.blognone.com/node/105647\">2018</a>), คนที่สองคือ  J. Allen Brack โปรดิวเซอร์ของ World of Warcraft (2018-<a href=\"https://www.blognone.com/node/124043\">2021</a>) หลังจากนั้นเป็นประธานร่วมสองคนคือ Jen Oneal และ Mike Ybarra ซึ่ง <a href=\"https://www.blognone.com/node/125637\">Jen Oneal ลาออกเพียงไม่กี่เดือนหลังจากนั้น</a> ตอนนี้ Mike Ybarra เป็นประธานคนเดียว</p>\n<p>ข่าวนี้คือประธาน Blizzard สองคนล่าสุด Jen Oneal และ J. Allen Brack ร่วมกับ John Donham ผู้บริหาร Blizzard อีกคนที่เคยทำงานช่วงสั้นๆ ระหว่างปี 2019-2020 ประกาศก่อตั้งสตูดิโอเกมแห่งใหม่ <a href=\"https://magicsoup.com/\">Magic Soup Games</a> โดยที่ Jen Oneal จะรับบทเป็นซีอีโอ</p>\n<p>ทั้งสามคนจะออกทุนตั้งบริษัทเองโดยไม่รับแหล่งเงินภายนอก เพื่อรักษาอิสระในการทำเกมตามที่ตัวเองต้องการ ตอนนี้บริษัทยังมีแค่ 5 คน ใช้การทำงานแบบรีโมท 100% และยังไม่เผยรายละเอียดว่าจะทำเกมอะไรบ้าง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b426297ee38e177d37a3d40d22c703ff.jpg\" /></p>\n<p>Jen Oneal ซีอีโอของ Magic Soup เริ่มทำงานกับ LucasArts ในช่วงปลายยุค 90s แล้วย้ายมาอยู่กับ Activision ในปี 2003 ดูแลเกมสเกตบอร์ด Tony Hawk จากนั้นในปี 2008 เธอย้ายมาอยู่กับสตูดิโอลูก Vicarious Visions จนได้เป็นหัวหน้าสตูดิโอในปี 2016 แต่<a href=\"https://www.blognone.com/node/120766\">หลังจากสตูดิโอถูกยุบเข้ากับ Blizzard ในปี 2021</a> เธอย้ายไปเป็นประธานฝั่ง Blizzard แทนก่อนลาออกในเวลาต่อมา</p>\n<p>Mike Morhaime ผู้ร่วมก่อตั้งและอดีตซีอีโอของ Blizzard Entertainment เองก็<a href=\"https://www.blognone.com/node/118601\">เพิ่งเปิดบริษัทเกมของตัวเอง Dreamhaven ในปี 2020</a> นอกจากนี้ยังมี<a href=\"https://www.blognone.com/node/119192\">บริษัท Frost Giant ที่เกิดจากอดีตพนักงานของ Blizzard</a> เช่นกัน</p>\n<p>ที่มา - <a href=\"https://venturebeat.com/games/ex-blizzard-leaders-jen-oneal-and-j-allen-brack-create-startup-studio-magic-soup-games/\">VentureBeat</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/blizzard\">Blizzard</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b9997444fd4e335c81916528557295cce182f5b08f78ada167f778f3f79b3c0e","category":"Thai"}