{"title":"Literature Review on Thermodynamic and Kinetic Limitations of Thermal Decomposition of Methane","link":"https://www.preprints.org/manuscript/202408.0065/v1","date":1722505916000,"content":"Based on literature data, an analysis was conducted on the thermodynamic and kinetic dependencies of the thermal decomposition of methane. Course of this process was analysed for both thermal and thermal-catalytic conditions. The elementary reaction, i.e. the synthesis of methane from its elements, including its reversibility, was used as the basis for the for considerations on the kinetic model. The conversion degree was adopted as the kinetic parameter (kinetic variable) since this measure is essential for determining the amount of carbon deposit formed and thus closing the mass balance of this process. Several different kinetic models for the elementary reaction were analysed to determine how do they relate in regard to the constant of the reaction rate. It was determined that regardless of whether the process is catalytic or purely thermal, for temperatures t&gt;900°C, the influence of reversibility of the reaction, has negligible influence on the yield of hydrogen produced, and thus can be omitted from the kinetic models. Special attention was given to iron-based catalysts, analysing the reactivity of Fe/C systems. It was demonstrated that the determined kinetic parameters satisfy the Kinetic Compensation Effect (KCE). Furthermore, by incorporating elements of Transition State Theory (TST), the existence of Entropy-Enthalpy Compensation (EEC) was highlighted. Based on these findings Authors show that through analysis of the changes in activation energy (E=20–421 kJ·mol-1) only an estimate of the optimal process conditions can be found, because the isoconversional temperature is also dependent on the way in which the reaction is conducted (T_{iso}=1200-1450K\\ &gt;\\ \\ T_{eq}). In other words, it was found that strong influences of such factors as T, P, etc. can locally compensate each other. Finally, it was also shown that the relations between KCE and EEC complement each other, which is confirmed by the determined average activation entropy at the isokinetic temperature (∆SB= -275.0 J·(mol·K)-1).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b9ada43a600c2167626e9a29aef07d5b4e8b5a842803cf7657713d946a18d725","category":"Interdisciplinary"}