{"title":"(Photo)toxicity of Partly Oxidized Docosahexaenoate and Its Effect on the Formation of Lipofuscin in Cultured Human Retinal Pigment Epithelial Cells","link":"https://www.preprints.org/manuscript/202410.0926/v1","date":1728645795000,"content":"Docosahexaenoate is a cytoprotective ω-3 polyunsaturated lipid which is abundant in the retina and is essential for its function. Due to its six unsaturated double bonds, docosahexaenoate is highly susceptible to oxidation and formation of products with photosensitizing properties. The aim of this study was to test on cultured human retinal pigment epithelial cells ARPE-19 the (photo)cytotoxic potential of partly oxidized docosahexaenoate and its effect on the formation of lipofuscin from phagocytosed photoreceptor outer segments (POS). The results demonstrate that the cytoprotective effects of docosahexaenoate do not counteract the deleterious effects of its oxidation products leading to the concentration-dependent loss of cell metabolic activity, which is exacerbated by concomitant exposure to visible light. Partly oxidized docosahexaenoate does not cause permeability of the cell plasma membrane but does cause apoptosis. While vitamin E can provide partial protection from the (photo)toxicity of partly oxidized docosahexaenoate, zeaxanthin undergoes rapid photodegradation and can exacerbate the (photo)toxicity. Feeding cells with POS enriched in partly oxidized docosahexaenoate results in a greater accumulation of intracellular fluorescent lipofuscin than in cells fed POS without the addition. In conclusion, partly oxidized docosahexaenoate increases the accumulation of lipofuscin-like intracellular deposits, is cytotoxic, and its toxicity increases during exposure to light.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b9b405378f921bf5ad59e8940985ed18de09573636ad6836b9596c03e586529d","category":"Interdisciplinary"}