{"title":"Facebook Is Developing a Version of Instagram for Children Under 13","link":"https://www.macrumors.com/2021/03/19/instagram-for-kids-under-13-in-the-works/","date":1616152928000,"content":"Facebook is developing a version of Instagram thats specifically aimed at children under 13, according to an internal company post (via <em><a href=\"https://www.buzzfeednews.com/article/ryanmac/facebook-instagram-for-children-under-13\">BuzzFeed News</a></em>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Instagram-Feature-2.jpg\" alt=\"\" width=\"2250\" height=\"1266\" class=\"aligncenter size-full wp-image-786418\" /><blockquote>\"I'm excited to announce that going forward, we have identified youth work as a priority for Instagram and have added it to our H1 priority list,\" Vishal Shah, Instagram's vice president of product, wrote on an employee message board on Thursday. \"We will be building a new youth pillar within the Community Product Group to focus on two things: (a) accelerating our integrity and privacy work to ensure the safest possible experience for teens and (b) building a version of Instagram that allows people under the age of 13 to safely use Instagram for the first time.\"</blockquote>Instagram's policy prohibits kids under 13 from using the platform. Head of Instagram Adam Mosseri later <a href=\"https://twitter.com/mosseri/status/1372691059348631555?s=20\">confirmed in a tweet</a> that a version of the popular photo sharing app is \"something we're exploring.\"  \r\n<br/>\r\n\r\n<br/>\r\n\"Kids are increasingly asking their parents if they can join apps that help them keep up with their friends,\" wrote Mosseri. \"A version of Instagram where parents have control, like we did [with] Messenger Kids, is something we're exploring. We'll share more down the road.\"\r\n<br/>\r\n\r\n<br/>\r\nThe news follows a blog post from Instagram earlier this week in which the Facebook-owned company <a href=\"https://www.macrumors.com/2021/03/16/instagram-protecting-young-people-tools/\">described changes</a> coming to the platform with the aim of \"protecting young people.\"\r\n<br/>\r\n\r\n<br/>\r\nIn the post, Instagram admitted that some young users \"can lie about their date of birth,\" when signing up to the platgform, and said it now asks some new users for a form of age verification, but the post didn't mention its work on a distinct platform specifically for children.\r\n<br/>\r\n\r\n<br/>\r\nIn 2017, Facebook <a href=\"https://www.macrumors.com/2017/12/04/facebook-kids-only-messenger/\">launched</a> Messenger Kids, which is aimed at children between the ages of 6 and 12. Following the launch, several children's health advocates called on Facebook CEO Mark Zuckerberg to discontinue the product, <a href=\"https://commercialfreechildhood.org/wp-content/uploads/archive/devel-generate/gaw/FBMessengerKids.pdf\">citing research</a> that \"excessive use of digital devices and social media is harmful to children and teens, making it very likely this new app will undermine children's healthy development.\"\r\n<br/>\r\n\r\n<br/>\r\nFacebook said it had consulted multiple of experts during the app's development, although a <em>Wired</em> report later <a href=\"https://www.wired.com/story/facebook-funds-its-favorite-experts-but-skirts-tough-critics/\">revealed</a> that the company had financial relationships with many of the people and organizations that advised on the product.\r\n<br/>\r\n\r\n<br/>\r\nIn 2019, <em><a href=\"https://www.theverge.com/2019/7/22/20706250/facebook-messenger-kids-bug-chat-app-unauthorized-adults\">The Verge</a></em> reported on a bug in Messenger Kids that allowed children to join groups with strangers. Facebook soon acted to resolve the issue, claiming it had only affected a \"small number of group chats.\"<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a>, <a href=\"https://www.macrumors.com/guide/instagram/\">Instagram</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/19/instagram-for-kids-under-13-in-the-works/\">Facebook Is Developing a Version of Instagram for Children Under 13</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/facebook-is-developing-a-version-of-instagram-for-children-under-13.2288885/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vmJRMR62Jms:kchr2tZqsKI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vmJRMR62Jms:kchr2tZqsKI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/vmJRMR62Jms\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b9c3b6495f6f216b80c1673e42133f9f35b27362160af8879122c6512953e66b","category":"Apple"}