{"title":"Research on adaptive hydraulic drive optimization control of concrete mixing tank truck for open-pit mine","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310249","date":1728482400000,"content":"<p>by Guangwei Liu, Chonghui Ren, Senlin Chai, Xuedong Wang, Wei Liu</p>\r\n\r\nThe non-axisymmetric problem caused by the fluid sloshing in the tank of a mining concrete mixing tank truck during driving is affected by the excitation of complex road surfaces. The fluid sloshing is coupled with the dynamics of the vehicle body due to the excitation of the complex road surface. The traditional hydraulic drive proportional integral differential (PID) control method is not effective in dealing with such problems, which can easily lead to accidents such as overturning. To improve the accuracy and stability of the hydraulic drive control system, this paper proposes an optimized particle filter PID adaptive control method based on the elastic firefly (FA) algorithm to accelerate the convergence speed of control parameter optimization, and then analyzes its hydraulic drive control characteristics and structural applications, and discusses step steering and double lane change modes are simulated under filling rates of 1.5 and 2.0, respectively. The experimental results show that compared with traditional PID control, the proposed adaptive control method can significantly reduce the average speed error of hydraulic drive control to 0.03km/h and the maximum speed error to 0.17km/h. It also improves the control tracking performance and stability. The practicality of the adaptive hydraulic drive is verified in the filling rate experiments under step steering and double-lane shifting conditions. It has important reference value for the practical application of hydraulic drive control optimization of mining concrete mixing transport tank trucks.","author":"Guangwei Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b9cc2706cda4a660da48bf176b410bfb782266cd85e8a9c77c0031f4605b4934","category":"Interdisciplinary"}