{"title":"PSX-17 Effects of Saccharomyces cerevisiae fermentation product on methane production of steers fed a finishing diet","link":"https://academic.oup.com/jas/article/102/Supplement_3/746/7757820?rss=1","date":1726272000000,"content":"<span><div>Abstract</div><span>Saccharomyces cerevisiae</span> fermentation product (SCFP), a postbiotic feed additive, has been reported to improve ruminal pH in cattle fed a high-starch diet. Given that higher ruminal pH was associated with greater methane production, SCFP may affect enteric methane production. However, no research has investigated the effect of SCFP on methane production in finishing cattle. This study assessed the effects of SCFP on enteric methane production of steers fed a high-concentrate finishing diet. Holstein steers (n = 12) were blocked based on their initial body weight (BW; 294 ± 12.7 kg) to 3 groups and enrolled in a randomized block design study. The 4 steers in each block were randomly assigned to two treatments and fed ad libitum a finishing diet consisting of 20% corn silage and 80% concentrate on a DM basis. The treatments were CON (Control, basal diet only) and SCFP (basal diet, top dressed with 12 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> SCFP, NaturSafe, Diamond V, Cedar Rapids, IA). After 29 d, steers were transferred to head-boxes for respiratory measurement for 72 h. The first 24 h was used as adaptation. During the last 48 h, respiratory samples were collected every 21 min and analyzed with gas sensors to determine O<sub>2</sub> consumption and CO<sub>2</sub> and CH<sub>4</sub> production. Data were analyzed with the GLIMMIX procedure of SAS 9.4. The BW of steers was similar (342.5 vs. 338.8 kg for SCFP and CON respectively, <span>P</span> = 0.65) between two treatments before the respiratory measurement. Steers fed SCFP tended to have an overall greater dry matter intake (DMI; 7.26 vs. 6.76 kg/d, <span>P</span> = 0.10) and had graeter DMI during the 48-h respiratory measurement (6.58 vs. 5.45 kg/d, <span>P</span> = 0.03). The amount of O<sub>2</sub> consumed was not affected by SCFP (35.6 vs. 34.4 Lּ kg BW<sup>.75</sup>/d, <span>P</span> = 0.45). Similarly, CO<sub>2</sub> production was not affected by SCFP (36.5 vs. 34.8 Lּ kg BW<sup>.75</sup>/d, <span>P</span> = 0.36). Supplementing SCFP did not affect daily CH<sub>4</sub> production per unit of metabolic BW (1.82 vs 1.80 Lּkg BW<sup>.75</sup>/d, <span>P</span> = 0.94), but it numerically reduced hourly methane emissions per unit of DMI (1.00 vs. 1.29 L/kg DMI, <span>P</span> = 0.39, Figure 1). Our results suggest that SCFP did not lead to greater methane production but instead showed a trend toward reduced methane emission per kilogram of DMI. This is likely driven by greater DMI by feeding SCFP during the respiratory chamber measurements. Further studies using larger experimental units are needed to confirm this observation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b9cc96c06fd3d149b08b7b3cb53ce8268a0d918664f62fb3c1ac4e6dea9711bb","category":"Environment"}