{"title":"Zombie star’s strange behavior ascribed to what it’s eating","link":"https://arstechnica.com/?p=1973620","date":1696615363000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/pulsar-banner-800x450.jpg\" alt=\"Pulsars are spinning neutron stars, the relics of massive stars gone supernova. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/pulsar-banner.jpg\">Enlarge</a> <span>/</span> Pulsars are spinning neutron stars, the relics of massive stars gone supernova.  (credit: NASA's Goddard Space Flight Center)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Some stars never really die. <a href=\"https://arstechnica.com/science/2023/07/new-slow-repeating-radio-source-we-have-no-idea-what-it-is/2/\">Pulsars</a> are the undead magnetized cores of massive stars that have met their end in a supernova. They rotate furiously, spewing jets of electromagnetic radiation from their magnetic poles, which makes them appear to flash regularly when observed from Earth.</p>\n<p>As if these zombies weren’t already bizarre enough, the behavior of one of them, pulsar PSR J1023+0038, has remained a mystery until now. PSR J1023 does have the usual compact jet of radiation at its poles. But it’s in a close binary system with another star, and, as it orbits this star, it has been observed blazing intensely before quickly dimming again. An international team of astronomers has finally made a breakthrough in understanding what causes the pulsar to switch from intensely bright “high mode” to dimmer “low mode” as it strips material from its companion star. Where that material goes has finally explained why it acts so erratically.</p>\n<h2>Extreme highs…</h2>\n<p>PSR J1023 is no ordinary pulsar, but a<a href=\"https://arstechnica.com/science/2023/06/nanograv-picks-up-signal-of-cosmic-choir-of-supermassive-black-holes/\"> millisecond pulsar</a>, meaning that it rotates hundreds of times per second. Even before its 2002 discovery, it was thought that millisecond pulsars get their speed from being in binary systems. Their speed comes from stripping material off their companion stars and drawing it in, which keeps feeding the neutron star more energy.</p></div><p><a href=\"https://arstechnica.com/?p=1973620#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973620&amp;comments=1\">Comments</a></p>","author":"Elizabeth Rayne","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b9ce309d86f3372c519cc206aaed0480785f93f809307a8dc6895d7b4e0120e8","category":"Tech"}