{"title":"OldOS: iOS 4 Rebuilt in SwiftUI","link":"https://twitter.com/zzanehip/status/1402625414762270723?s=20","date":1623369600000,"content":"\n<p>Holy hell this new project from <a href=\"https://zsk.dev/\">Zane Kleinberg</a>, a talented 17-year-old developer who just dropped this out of the blue yesterday. It’s available via TestFlight (the first one is full already, though) and <a href=\"https://github.com/zzanehip/The-OldOS-Project\">as open source code</a> you can build yourself.</p>\n\n<p>It’s exquisitely well done, very fun to play with, and surprisingly usable. And what a remarkable testimony to the expressiveness of Swift UI.</p>\n\n<p>Once you get past the surface aesthetic differences, it’s also interesting as a way to remember how many little things iOS has added over the years. iOS is so much richer now. You couldn’t do anything in list views back then. E.g., if you wanted to delete a note in Notes, you had to open the note and tap the Trash button. In a view hierarchy, you couldn’t go back just by swiping from the left edge of the display — you had to tap the Back button in the navigation bar at the top of the display. Going back to this simulacrum of iOS 4 reminds me of what it felt like going back to, say, <a href=\"https://en.wikipedia.org/wiki/System_6\">System 6</a> (1988) after taking for granted all the various little things added to the Mac between then and <a href=\"https://www.macobserver.com/newreviews/bc/99/macos86/macos86.html\">Mac OS 8.6</a> (1999).</p>\n\n<p>A decade is a long time. Even the 1990s — the most dysfunctional decade of Apple’s corporate existence — was a productive one for the Mac. Now, though, with Apple firing on all cylinders throughout the 2010s, iOS 4 feels joyful but crude, barren of small conveniences.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/10/oldos\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b9cf04b20c29faf14a56cb0a6445cfacbd648268286e35942908e4f3f41bd5c4","category":"Tech"}