{"title":"Your iPad could be ruining your health","link":"https://www.macworld.com/article/1802925/your-ipad-could-be-ruining-your-health.html","date":1683706151000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><strong>The iPad is replacing the laptop–at an ergonomic cost</strong></p>\n\n\n\n<p>Portable and powerful, the iPad is in many ways the perfect replacement for the laptop, particularly when switching between home and office. As remote and flexible employment practices become more widely accepted, more of us than ever before depend on a slimline tablet for long-form work.</p>\n\n\n\n<p>But an iPad isn’t a natural work companion unless accompanied by a well-chosen accessory. Held in the hand it causes arm strain; positioned too far away it causes eye strain; and coupled with many of the basic stands on the market right now – either keyboard stands, or stands designed for use with a separate keyboard and mouse – it can lead the user to hunch over, harming posture and potentially causing long-term back and neck problems.</p>\n\n\n\n<p><strong>Safeguard your health with the MagFlött Stand</strong></p>\n\n\n\n<p>Fortunately, there are more advanced stands you can choose from, painstakingly designed to safeguard user health. The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.charjenpro.com/products/magflottipadpro&amp;xcust=1-1-1802925-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MagFlött Stand</a>, for example, addresses the ergonomic issues of an iPad workstation with its formidable feature set. You can adjust the iPad to suit your posture and activity–the stand’s 360-degree rotation makes it easy to switch between portrait and landscape, while 180 degrees of tilt is ideal for finetuning viewing angles, from vertical video viewing to flat board gaming–and the tablet is held in place with strong magnets. It couldn’t be easier to set up and use.</p>\n\n\n\n<p>Available in two sizes and both Silver and Space Gray color finishes, the MagFlött is also a stylish accessory, with an aesthetic sense to match classic Apple design. Certified as compatible with a wide range of iPad, iPad Air and iPad Pro models, the accessory is highly rated and the number-one bestselling magnetic iPad stand.</p>\n\n\n\n<p><strong>The next evolution of the iPad stand</strong></p>\n\n\n\n<p>CharJenPro, the family-owned and family-run Los Angeles company behind the MagFlött Stand, has now come up with the next evolution in iPad accessories. This year the firm is launching two new devices that add still greater customization and comfort to make your iPad the ideal work tool.</p>\n\n\n\n<p>The company’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.charjenpro.com/products/magflottpro&amp;xcust=1-1-1802925-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MagFlött Pro</a> takes the previous stand’s feature set and adds height adjustment, anywhere from 12 to 17.5 inches, making it the first and only iPad stand to offer eye-level positioning. This is a crucial element in setting up an ergonomic workstation, ensuring sound posture and safeguarding the user’s neck and back from long-term pain. The MacFlött Pro also allows you to attach MagSafe-compatible iPhones to the stand, so even small-screen entertainment is delivered in comfort.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.charjenpro.com/products/magflottvesamount&amp;xcust=1-1-1802925-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MagFlött VESA Mount</a>, meanwhile, lets you benefit from the magnetic feature in combination with any standard VESA-compliant arm mount. This is perfect for use in offices that have already been equipped for use with secondary monitors, and for home workers who already own an arm mount but need to upgrade it for secure and ergonomic use with an iPad. These two new stands, lovingly designed in response to user feedback following the success of the original MagFlött Stand, are currently live on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.kickstarter.com/projects/charjenpro/magflottpro&amp;xcust=1-1-1802925-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Kickstarter</a>. Macworld readers can join the campaign until May 10 and make a big saving compared to the MSRP.</p>\n\nApple, Tablets</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"b9cf55a1c07d451fa56eb0cb1982ce2f0e3bd967530028073b96d249fdc169f4","category":"Apple"}