{"title":"A novel model combining genes associated with disulfidptosis and glycolysis to predict breast cancer prognosis, molecular subtypes, and treatment response","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24329?af=R","date":1715768692000,"content":"<h2>Abstract</h2>\n<p>Breast cancer (BC) is a heterogeneous malignancy with a dismal prognosis. Disulfidptosis is a novel type of regulated cell death that happens in the presence of glucose deficiency and is linked to the metabolic process of glycolysis. However, the mechanism of action of disulfidptosis and glycolysis-related genes (DGRG) in BC, as well as their prognostic value in BC patients, remain unknown. After identifying the differentially expressed DGRG in normal and BC tissues, a number of machine learning algorithms were utilized to select essential prognostic genes to develop a model, including SLC7A11, CACNA1H, SDC1, CHST1, and TFF3. The expression characteristics of these genes were then examined using single-cell RNA sequencing, and BC was classified into three clusters using “ConsensusClusterPlus” based on these genes. The DGRG model's median risk score can categorize BC patients into high-risk and low-risk groups. Furthermore, we investigated variations in clinical landscape, immunoinvasion analysis, tumor immune dysfunction and rejection (TIDE), and medication sensitivity in patients in the DGRG model's high- and low-risk groups. Patients in the low-risk group performed better on immunological and chemotherapeutic therapies and had lower TIDE scores. In conclusion, the DGRG model we developed has significant clinical application potential because it can accurately predict the prognosis of BC, TME, and pharmacological treatment responses.</p>","author":"Mei‐Huan Wang, \nYue‐Hua Gao, \nZhen‐Dan Zhao, \nHua‐Wei Zhang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"b9d1275b8df6b7faec6438c384b9eb042c784463427a71e887d390e9e6077853","category":"Environment"}