{"title":"Formation of pure anatase TiO2 using the reactive pulsed dc magnetron sputtering method for controlling the target poisoning state","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300003?af=R","date":1707196547000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/365ff5b2-ed40-41eb-9d0f-e176fa8c32ac/appl202300003-gra-0001-m.png\" alt=\"Formation of pure anatase TiO2 using the reactive pulsed dc magnetron sputtering method for controlling the target poisoning state\" /><p>This work addresses the formation of photocatalytically active TiO<sub>2</sub> using reactive pulsed dc magnetron sputtering method. A technique for the control of target poisoning in reactive sputtering with oxygen is presented.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The use of pulsed dc-sputtering sources for reactive magnetron sputtering with oxygen offers a possibility to suppress the negative effects of target poisoning (such as arcing). This results in a wide process range for the selection of a desired operating point. The control of target poisoning plays a major role in maintaining constant coating properties and affects the stoichiometry of the reactive coating, as well as the coating rate and the economic impact of the coating process. In a hysteresis, the target poisoning during the reactive sputtering of titanium under oxygen addition proceeds nonlinearly. Without the use of a suitable target poisoning control technique, the sputtering process can abruptly change to an unstable state. As a result, variations of stoichiometry can occur during the deposition process. A proven method for maintaining a stable reactive sputtering process is the control of oxygen flow with the input variable target voltage. By determining the typical oxygen hysteresis at constant target power and constant argon flow, an operating point for the control loop is derived. The desired target voltage then serves as the input variable for the control loop of the target poisoning. The controlling technique for target poisoning is a basic requirement for the production of the photolytic active anatase phase of titanium dioxide (TiO<sub>2</sub>) using reactive magnetron sputtering. The photocatalytic equipment of surfaces with a titanium dioxide coating in the anatase phase can be realized with the reactive pulsed dc magnetron sputter ion plating process (DC-MSIP). The pulsed DC-MSIP process facilitates coating a variety of surfaces at temperatures below 200°C in an environmentally friendly manner.</p>","author":"Nikolai Desch, \nMarkus Lake","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"b9e49875f322d4a46501575efc74d8c9b489962024246e6d3386bc694092b6f7","category":"Environment"}