{"title":"Use of a Vaginally Administered Gel Containing the GnRH Agonist Triptorelin and Fixed Time and Single Artificial Insemination of Pigs under Commercial Conditions. Productive and Economic Impact","link":"https://www.preprints.org/manuscript/202408.0424/v1","date":1723014767000,"content":"Fixed-time artificial insemination is an important technique in swine production that can improve reproductive efficiency and meat production quality by making better use of the genetic potential of breeding males and reducing the costs associated with double or multiple inseminations. Our goal was to evaluate the vaginal application of the GnRH agonist triptorelin acetate to synchronize post-weaning sows and facilitate implantation of a single fixed-time insemination. In a first experiment, the efficacy of treatment with the triptorelin in animals with or without signs of estrus was analyzed using a single insemination at a fixed time compared to the control following the standard insemination strategy. Farrowing rate was comparable between triptorelin and control groups (100 vs. 87.50%), but triptorelin without estrus had a lower rate (50%). Litter size did not differ between groups. Estradiol and progesterone levels at 96- and 120-hours post-weaning were similar in the control and triptorelin groups (P&gt;0.05). These results suggest that Triptorelin has the potential to synchronize ovulation in pigs without affecting post-weaning hormonal profiles. In a second experiment, the objective was to evaluate the productive and economic impact of implementing a treatment with triptorelin acetate 96 hours after weaning compared to the standard insemination protocol. Sows were grouped according to treatment (control vs. triptorelin) and estrus onset (≤5 days and &gt;5 days after weaning considered as late estrus). Farrowing rate was lower in the control late estrus group than in the control and triptorelin groups and similar to the triptorelin late estrus group. No differences were found for litter size, live or dead piglets born (P&gt;0.05). We developed an estimation model to assess the cost/benefit of intravaginal triptorelin administration at 96 h post-weaning. The overall result is that the use of triptorelin increases the benefit per inseminated sow in the range of €15-20. This improvement is mainly related to an increase in the reproductive performance of the treated sows compared to the control sows and the reduction in the number of inseminations per sow. These results highlight the potential of triptorelin to optimize reproductive management in pigs, improving efficiency and economic viability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"b9eae29c600d17c3d178bc3cb528a68e642d3b5d9623ee9c7d8d5227f58d7f1d","category":"Interdisciplinary"}