{"title":"Mercedes wins Formula E title, will quit the series at end of 2022","link":"https://arstechnica.com/?p=1788322","date":1629324928000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1234697251-800x463.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1234697251.jpg\">Enlarge</a> <span>/</span> Stoffel Vandoorne of the Mercedes-EQ Formula E Team leads the pack at the Berlin E-Prix.  (credit: <a href=\"https://www.gettyimages.com/search/photographer?assettype=image&amp;photographer=picture%20alliance&amp;sort=best\">Andreas Gora/picture alliance via Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On Sunday, Formula E's seventh series came to a close on the concrete of Templehof in Berlin. It was the sport's first season as an official FIA world championship, which technically makes the Mercedes-EQ team and driver Nyck de Vries the first ever Formula E world champions. But the team's celebrations may have been brief. On Wednesday, Mercedes-Benz confirmed that it will quit Formula E at the end of 2022, bringing a bittersweet end to the season.</p>\n<p>Formula E's low point was undoubtedly round 5, the Valencia E-Prix in Spain. This was held on a permanent racetrack—Circuit Ricardo Tormo—which was a change from Formula E's usual MO of holding events at temporary tracks in city centers. Racing on tight street circuits with short straights definitely played to the original Formula E race car's strengths and worked with its weaknesses. The introduction of the faster, more powerful Gen2 car in 2018 meant <a href=\"https://www.motorsportmagazine.com/articles/single-seaters/formula-e/formula-e-has-a-chance-to-prove-itself-with-valencia-circuit-race\">there was plenty of interest in seeing what these cars could do on a permanent track</a>. But after the first of two races at Valencia in April, I'm sure many audiences had seen enough.</p>\n<p>Between the heavy rain and a tight, temporary chicane at the end of the lap, more than a few drivers came a cropper, resulting in multiple periods behind a safety car. Formula E races are designed around energy management; without recapturing energy under regenerative braking, the car's 56 kWh battery is insufficient to get to the finish line. Although the organizers have access to telemetry showing every car's battery state of charge, the teams do not. This is done intentionally to make things a bit harder. This information has to be communicated to the teams by their drivers each lap.</p></div><p><a href=\"https://arstechnica.com/?p=1788322#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788322&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b9eb37507ff67f6d3ce0c93f96170e1bb37b3ecba6e6f8bd06daa7a4beba7ba3","category":"Tech"}