{"title":"Twelve South Launches More Affordable Curve SE Stand for Mac Notebooks","link":"https://www.macrumors.com/2023/08/01/twelve-south-curve-se-stand/","date":1690906794000,"content":"Popular accessory maker <a href=\"https://www.twelvesouth.com/\">Twelve South</a> today announced the launch of the Curve SE, an aluminum multi-piece stand that builds on the original Curve MacBook Stand.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/twelve-south-curve-se.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe three pieces of the Curve SE snap together so you can position your MacBook at the ideal ergonomic height. It can be used alongside a secondary display like the Studio Display, and you can also adjust it to put your webcam at eye level for better video calls.\r<br />\n\r<br />\nTwelve South's Curve SE is similar in design to the standard Curve, but it is more affordable, coming in at $20 less. It has the same benefits and a sleek, aluminum design, but it does not feature the same black or white matte finish as the original.\r<br />\n\r<br />\nThere are silicone-lined arms that grip your MacBook to hold it securely in place on the stand, just like the standard Curve stand. In terms of design, it is basically identical to the Curve stand, but with the three-piece assembly that keeps costs down.\r<br />\n\r<br />\nThe Curve SE is priced at $40 and it can be <a href=\"https://www.twelvesouth.com/\">purchased from the Twelve South website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/twelve-south/\">Twelve South</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/twelve-south-curve-se-stand/\">Twelve South Launches More Affordable Curve SE Stand for Mac Notebooks</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/twelve-south-launches-more-affordable-curve-se-stand-for-mac-notebooks.2397462/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b9ed489781b6dfdd26923ad2bf32f0ad2c02cf5f1b9348602ce34dff79bd6976","category":"Apple"}