{"title":"166 Beyond solubility: Navigating the complex landscape of dietary fiber in swine digestion and physiology","link":"https://academic.oup.com/jas/article/102/Supplement_2/187/7664691?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Dietary fiber comprises a diverse group of cell wall polysaccharides, along with lignin, that resist digestion by endogenous enzymes in non-ruminants. Over the past 50 yr, our understanding of dietary fiber has significantly advanced, resulting in diverse definitions and analytical methods that have deepened our comprehension of its role in swine nutrition. However, the analysis of dietary fiber remains one of the most intricate, expensive, and resource-intensive aspects of monogastric nutrition research. From the early days of crude fiber and detergent fiber techniques to the more recent methods such as non-starch polysaccharide and total dietary fiber methodologies, analytical techniques have evolved to encompass the complex carbohydrates found in diets. Translating these chemical and analytical understandings into physiological insights poses a formidable challenge for nutritionists. This presentation aims to discuss these analytical concepts and challenges in understanding dietary fiber, with a particular focus on its impact on swine nutrition and physiology. Going beyond the concept of ‘solubility,’ we will delve into the physicochemical and physiological properties of dietary fiber, emphasizing its intricate roles in the swine digestive milieu. This includes aspects such as digestion kinetics, fermentability, rheology, viscosity, and microbial ecosystems. Moreover, research consistently demonstrates that dietary fiber can have positive effects on gastrointestinal health under specific production and dietary conditions. Paradoxically, it can also negatively impact energy digestibility and feed efficiency. By modeling the chemical nature of fiber and its role in digestion physiology, it could be possible to bridge this gap to optimize production goals and swine health in high fiber diets. This presentation will highlight the significance of a holistic comprehension of the intricate aspects of dietary fiber within swine nutrition and future directions for incorporating it into formulation metrics. Such knowledge is pivotal for navigating the complexities of incorporating fiber into diet formulation, effective management, and the pursuit of sustainable practices.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"b9f1a216c185102cb9b50257f67e2dec521cd578f1884266a31bb0873ca6ecea","category":"Environment"}