{"title":"The impact of diabetes on physical and mental health status and patient satisfaction after total hip and knee arthroplasty","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302315","date":1713967200000,"content":"<p>by J. Denise Power, Flaviu Trifoi, Mayilee Canizares, Anthony V. Perruccio, Ajaykumar Shanmugaraj, Rajiv Gandhi, J. Roderick Davey, Khalid Syed, Nizar N. Mahomed, Christian Veillette, Y. Raja Rampersaud</p>\r\nObjective <p>To assess the impact of diabetes on physical and mental health status, as well as patient satisfaction, one-year following knee and hip total joint arthroplasty (TJA) for osteoarthritis (OA).</p> Methods <p>Participants were 626 hip and 754 knee TJA patients. Pre-surgery data were collected on socio-demographics and health status. The 12-item Short Form Health Survey (SF-12) was collected pre- and one year post-surgery, and physical (PCS) and mental component (MCS) summary scores computed. One-year patient satisfaction was also recorded. Four regression models tested the effect of diabetes on: 1) PCS change score; 2) MCS change score; 3) achieving minimal clinically important improvement (MCII) on PCS; and 4) patient satisfaction (‘Somewhat or Very Satisfied’ vs. ‘Somewhat or Very Dissatisfied’). An interaction between surgical joint and diabetes was tested in each model.</p> Results <p>Self-reported diabetes prevalence was 13.0% (95% CI: 11.2%-14.7%) and was more common in knee 16.1% (95% CI: 13.4%-18.7%) than hip 9.3% (95% CI: 7.0%-11.5%) patients. In adjusted analyses, change scores were 2.3 units less on the PCS for those with diabetes compared to those without (p = 0.005). Patients with diabetes were about half as likely to achieve MCII as patients without diabetes (p = 0.004). Diabetes was not significantly associated with satisfaction or changes in MCS scores. Diabetes effects did not differ by surgical joint.</p> Conclusions <p>Findings support that diabetes has a negative impact on improvements in physical health after TJA. Considering the growing prevalence of OA and diabetes in the population, our findings support the importance of perioperative screening and management of diabetes in patients undergoing TJA.</p>","author":"J. Denise Power","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b9f4350e43770f3bbac649cd28f17152925a7e76c366b6603bd156e96622f7c5","category":"Interdisciplinary"}