{"title":"Chasing and surfing seasonal waves: Avian migration through the US tracks land surface phenology in fall, but not spring","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14088?af=R","date":1719984809000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1fc7dfe7-3321-4fec-a110-0752a1b7eaa7/jane14088-toc-0001-m.png\" alt=\"Chasing and surfing seasonal waves: Avian migration through the US tracks land surface phenology in fall, but not spring\" />\n<p>Coupling weather surveillance radar and remote sensing data reveals how songbird migrants in the Central Flyway experience major temperature changes during their migrations. While the green-up of the land surface does not limit their spring progression northwards, later fall migrants may be pushed southwards by vegetation dormancy.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nClimate change is altering the timing of seasonal events for many taxa.\n\nThere is limited understanding of how northward/southward songbird migration follows or is limited by the latitudinal progression of seasonal transitions. Consistent environmental conditions that migrating birds encounter across latitudes likely represent or correlate with important resources or limiting factors for migration.\n\nWe tested whether migratory passage—observed via radar—consistently tracked land surface variables and phenophases across latitudes in the US Central Flyway in both spring and fall.\n\nThe daily temperatures, precipitation and vegetation greenness occurring on 10%, 50% and 90% cumulative passage dates changed substantially with latitude, indicating that most migrants experienced rapidly changing conditions as they headed north or south. Temperature did not limit the progression of migration in either season.\n\nPeak spring migration in the southern US occurred nearly 40 days after the spring green wave, the northward progression of vegetation growth, but nearly caught up to green-up at 48° N. Spring migration phenology may have evolved to prioritize earlier arrival for breeding.\n\nAcross all latitudes, peak fall migration coincided with the same land surface phenophase, an interval of 26 days prior to dormancy onset. Migrants may rely on phenological events in vegetation during fall stopovers.\n\nConsidering that (a) migratory passage tracked fall land surface phenology across latitudes at a continental scale, (b) previous studies at local scales have demonstrated the importance of fruit during fall migratory stopover and (c) fruiting phenology in North America is occurring later over time while fall migration is advancing, the potential for mismatch between fall fruiting and bird migration phenology urgently needs further investigation.\n</p>","author":"Carrie Ann Adams, \nMonika A. Tomaszewska, \nGeoffrey M. Henebry, \nKyle G. Horton","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"b9f57fc348a980941688262eef2417e71e7075cf4d0f599d6f36328c34c30252","category":"Environment"}