{"title":"Experiences of smoking and tobacco use during pregnancy: A qualitative study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308781","date":1723212000000,"content":"<p>by Maria Agràs-Guàrdia, Sara Martínez-Torres, Eva Satué, Ester Granado-Font, Meritxell Pallejà-Millán, Demetria Patricio, Miriam Leiva, Cristina Rey-Reñones, Francisco Martín-Luján</p>\r\n\r\nTobacco use during pregnancy is the main avoidable cause of morbidity and mortality both for pregnant women and their offspring. Between 12 and 22% of pregnant women in industrialized countries smoke during pregnancy, and 13% are unable to stop smoking. Pregnancy is considered an ideal opportunity to intervene and control tobacco use among smokers and their families. However, pregnant women experience barriers to quitting smoking, including social stigma and fear of being judged. Thus, it is necessary to develop interventions for smoking cessation adapted for pregnant women. This paper presents a qualitative study protocol to assess the barriers and facilitators of smoking cessation during pregnancy that female smokers encounter or perceive. It consists of a series of focus groups and individual interviews with female smokers who have been pregnant within the last five years. Participants will be recruited from the Sexual and Reproductive Health Care Services of the Camp de Tarragona. A group of 5–10 women who have been pregnant and tried to quit smoking over the last 5 years will be selected. The data will be collected by means of semistructured interviews. All interviews will be transcribed verbatim, coded and synthesized into categories and main themes. Thematic analysis will be conducted employing an iterative and reflexive approach. The results of this study will offer new perspectives on smoking interventions for pregnant women and enhance our comprehension of the main barriers to and facilitators of smoking cessation during pregnancy. This will contribute to the adaptation of the Tobbstop app, originally designed for the general public, to suit the needs of pregnant women. Consequently, the creation of targeted interventions will positively influence the health outcomes of both pregnant women and newborns.\r\nTrial registration: Clinicaltrials.gov ID: NCT05222958. The trial was registered 3 February 2022, at https://clinicaltrials.gov/ct2/show/NCT05222958.","author":"Maria Agràs-Guàrdia","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b9f6b0bcbeced4e21dac55e033af016816f7b9f174e7f4ccd507c6ebf9c2c52f","category":"Interdisciplinary"}