{"title":"Investigating animal reservoirs for hepatitis E virus in Bangui, Central African Republic","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300608","date":1710511200000,"content":"<p>by Marina Prisca de Marguerite Nombot-Yazenguet, Abdou Fatawou Modiyinji, Vianney Tricou, Alexandre Manirakiza, Richard Njouom, Narcisse Patrice Joseph Komas</p>\r\nBackground <p>Hepatitis E virus (HEV) is a major cause of enterotropic viral hepatitis, a major public health problem in many developing countries. In Central African Republic (CAR), HEV genotypes 1, 2, and 3 have been found to have an impact on human health. However, data on HEV in animal reservoirs are still lacking for CAR. Here, we investigated the presence of HEV in farmed pigs and goats in Bangui, the capital city of CAR, using molecular methods.</p> Methodology <p>In a prospective study, fecal samples from 61 pigs and 39 goats from farms in five districts (2<sup>nd</sup>, 4<sup>th</sup>, 6<sup>th</sup>, 7<sup>th</sup>, 8<sup>th</sup>) of Bangui were collected and tested for HEV RNA by real-time RT-PCR. The samples were further analyzed by nested-PCR and sequenced to determine the genotype and subtype to which the virus belong.</p> Results <p>In total, 22/100 (22.0%) feces samples were successfully amplified for HEV RNA by real time RT-PCR. All positive samples were from pigs (22/61; 36.1%), while all goat samples were negative (0/39). Twelve HEV RNA samples (12/22 or 54.5%) were successfully amplified by nested RT-PCR, and subsequently sequenced. Phylogenetic analysis revealed that the obtained sequences clustered with subtype 3h and were genetically related to the human HEV sequences from CAR.</p> Conclusion <p>This study confirms that pigs constitute an HEV reservoir, with genotype 3 being the major circulating strain. Further studies are needed to investigate other local reservoirs and to improve knowledge of the molecular epidemiology of HEV in CAR.</p>","author":"Marina Prisca de Marguerite Nombot-Yazenguet","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"b9fa126fef5e21174b9a41c90653914b85542b3a942d2c1265af1778c5bdecce","category":"Interdisciplinary"}