{"title":"Attitude Q&A 2","link":"https://srakrn.me/blog/attitude-qa-2/","date":1586189609000,"content":"<figure class=\"wp-block-image\"><img src=\"https://pbs.twimg.com/media/EUzhFiuUMAAPkEF?format=jpg&amp;name=large\" alt=\"Image\"/><figcaption><br></figcaption></figure>\n\n\n\n<h2>ตลาดล่าง</h2>\n\n\n\n<p>ตอบแบบไม่กวนเหมือนรอบที่แล้วละ</p>\n\n\n\n<p>ส่วนหนึ่งมองว่าหากอยากจะเข้าใจตลาดล่าง ต้องเริ่มจากการพยายามทำความเข้าใจพฤติกรรมและขั้นตอนวิธีในการ &#8220;เหยียด&#8221; ของ elite หรือ upper-middle class ที่มองลงมายัง middle class ทั่วไปก่อน</p>\n\n\n\n<p>ถ้า middle class ไม่ได้ naive ขนาดนั้นสักเท่าไหร่ก็คงพอรู้ว่าการเหยียดแบบนี้มีจริง และเราคิดว่า middle class บางกลุ่มแสดงออกผ่านการรีเฟลกซ์กลับไปที่ชนชั้นที่ต่ำกว่าตามลำดับ</p>\n\n\n\n<p>ยกตัวอย่างเคสนึงที่น่าจะเห็นได้ชัดคือจัดฟันเถื่อน&#8211;กรณีนี้น่าสนใจ บริบทของการรักษาสุขภาพช่องปากที่ผิดปกติกลับไม่สามารถเข้าถึงได้อย่างเท่าเทียมเทียบกับการแพทย์ชนิดอื่นๆ ทำให้เส้นแบ่งของคนที่จัดฟัน&#8211;ในฐานะคนที่จ่ายไหว และคนที่จ่ายไม่ไหวนั้นชัดเจนมาก</p>\n\n\n\n<p>ชนชั้นกลางกระเสือกกระสนถีบตัวเองผ่านการศึกษา ของแบรนด์เนม การช็อปปิ้ง (ซึ่งนี่ก็คือ norm ที่ชนชั้นกลางสร้างจากภาพมองของชนชั้นสูงที่ตัวเองจะตะกายไปถึง) เช่นไร ชนชั้นล่างก็กระเสือกกระสนกับการถีบตัวเองแบบนี้เหมือนกัน (ผ่าน norm ที่ชนชั้นล่างสร้างจากภาพของชนชั้นกลาง)</p>\n\n\n\n<p>ลองวันนึงคุณไปทำอะไรที่กระทบกับโรงพยาบาลเอกชน คลับกีฬา หรืออะไรสักอย่างที่เป็นพูลของชนชั้นสูง วันนึงคุณก็โดนเหยียดเหมือนกับที่คุณเหยียดเด็กแว๊นที่รบกวนระบบเดินทางของคุณ จัดฟันเถื่อนที่รบกวนระบบประกันสุขภาพของคุณ หรืออะไรทำนองนั้นแหละ (แต่ไม่ได้บอกว่าสิ่งที่ทำอยู่มันถูกนะ)</p>\n\n\n\n<h2>Toxic femininity</h2>\n\n\n\n<p>เป็นเรื่องที่สนใจแต่ไม่ถนัดที่สุด</p>\n\n\n\n<p>ไม่มีความเห็นแล้วกัน แต่ทิ้งคำถามไว้ให้คิด&#8211;ถ้าผู้หญิงหันมาเบลมกันเองว่าเธออ้วนแล้วนะ ใครเป็นฝ่าย toxic? ถ้ามองว่าผู้หญิง แล้วปฏิเสธได้ไหมว่าการที่ผู้ชาย stereotype ผู้หญิงว่าต้องสวยและหุ่นบางทำให้เกิดความ toxic แบบนั้น? แล้วถ้ามันเป็น norms ที่เกิดจากการที่ผู้หญิงมองว่าผู้ชายมองว่าผู้หญิงต้องเป็นแบบนี้ ความ toxic นั้นก็เกิดจากผู้หญิงเองใช่หรือไม่?</p>\n\n\n\n<h2>ผีน้อย</h2>\n\n\n\n<p>ขอไม่เรียกว่าผีน้อย ขอเรียกว่าแรงงานผิดกฎหมายในต่างประเทศ</p>\n\n\n\n<p> แรงงานผิดกฎหมายในต่างประเทศคือคนที่ไม่เล่นตามกติกา&#8211;การโกงเกมของเขาทำให้เกิดผลกระทบกับคนที่เล่นตามกติกา ทั้งไกด์ทัวร์ นักท่องเที่ยว แรงงานถูกกฎหมายคนอื่น</p>\n\n\n\n<p>แต่ต้องไม่ลืมมองความจริงว่าครั้งหนึ่งเขาคงเคยพยายามเล่นตามกติกาแล้วเหมือนกัน&#8211;น่าสนใจว่าเพราะเหตุใดการเล่นตามกติกาของเขาถึงไม่เวิร์ก มันอาจจะเป็นความโลภหรือปากท้องของครอบครัวที่ไม่มีข้าวตกถึงกระเพาะก็ได้ ไม่มีใครรู้นอกจากพวกเขา</p>\n\n\n\n<p>ในการบ่นว่า (condemn) พวกเขา เราใส่ความเห็นใจ (empathy) เข้าไปได้</p>\n\n\n\n<h2>โทษประหาร</h2>\n\n\n\n<p>ไม่มีความเห็นในเรื่องนี้ เพราะไม่มีความรู้มากพอให้มีความเห็น</p>\n\n\n\n<h2>สาววาย</h2>\n\n\n\n<p>สเปกตรัมสาววายกว้างมากตั้งแต่ LGBTQI+ supporter จนถึงระรานให้คนสองคนที่มีชีวิตจริงได้กันจริงๆ สักที</p>\n\n\n\n<p>เส้นแบ่งที่โอเคจากมุมมองของตัวเอง คือเคารพและไม่ก้าวก่ายบุคคลที่มีตัวตนจริง อย่างไรก็ตามคำว่าก้าวก่ายนี่ก็พูดยาก คือการพูดชื่อลอยๆ สองชื่อแล้วอ้างว่าเป็นชื่อทั่วไปที่เพียงไปบังเอิญซ้ำก็ย่อมทำได้</p>\n\n\n\n<p>แต่เอาเป็นว่าหลักการเบื้องต้นคือการ &#8220;จิ้น&#8221; กันของสาววายไม่ควรไป offend คนโดนจิ้น</p>\n\n\n\n<h2>วัฒนธรรมติ่งเกาหลี</h2>\n\n\n\n<p>เปลี่ยนคำว่าติ่งเกาหลีเป็นแฟนคลับศิลปินเกาหลี แล้วลองเปลี่ยนชื่อประเทศดูเรื่อยๆ ถ้าความเห็นมันเปลี่ยนก็แปลว่ามี negative attitude ต่อกลุ่มนึงแค่นั้นละ</p>\n\n\n\n<h2>ราคาผ้าอนามัย</h2>\n\n\n\n<p>ควรถูก subsidise อย่างหนักโดยรัฐ หรือแจกฟรี (รวมถึงผ้าอนามัยแบบอื่น เช่นแบบสอด หรือถ้วย)</p>\n\n\n\n<h2>Gay marriage</h2>\n\n\n\n<p>มันน่าตลกที่ถ้า non-straight จะแต่งงานกันแล้วต้องมาขอ straight ให้ผ่านกฎหมายก่อน</p>\n\n\n\n<h2>โอตะ</h2>\n\n\n\n<p>เปลี่ยนคำว่าโอตะเป็นแฟนคลับศิลปินญี่ปุ่น แล้วลองเปลี่ยนชื่อประเทศดูเรื่อยๆ ถ้าความเห็นมันเปลี่ยนก็แปลว่ามี  negative attitude ต่อกลุ่มนึงแค่นั้นละ</p>\n\n\n\n<p>ไม่ใช่หรอก&#8211;คือเวลา condemn ติ่งเกาหลีมันดูไม่มีอะไร กลวงๆ แต่พอมา condemn โอตะแล้วมันมีประเด็นพวกความเป็นไอดอลด้วย</p>\n\n\n\n<p>ส่วนตัวรู้สึกว่าไอดอลแบบญี่ปุ่นนี่ dehumanise ตัวไอดอลเองเยอะมากๆ ก็ต้องดูด้วยแหละว่าตัวโอตะมีทัศนะคติยังไงต่อระบบแบบนี้ คำตอบของเราคือเลิกตาม BNK48 แบบเสียเงินไปนานแล้ว</p>\n\n\n\n<h2>อยู่ก่อนแต่ง</h2>\n\n\n\n<p>เราอยู่ก่อนแต่งแน่นอน คือมันมีรายละเอียดชีวิตเล็กๆ น้อยๆ (ตื่นมาพับผ้าไหม เก็บของเป็นไง) ที่อยากดูด้วยกันก่อนอยู่กันจริงๆ</p>\n\n\n\n<p>จริงๆ มันไม่ควรเป็นปัญหานะ เซ็กส์ที่ทุกฝ่ายสมยอม (รวมถึงคนที่ผูกพันในสถานะที่ commit ให้เซ็กส์ถูกผูกขาดโดยฝ่ายถือความสัมพันธ์คนเดียว) คือเซ็กส์ที่โอเค</p>\n\n\n\n<h2>การรับราชการ</h2>\n\n\n\n<p>เหมือนการทำงานในบริษัทขนาดใหญ่ที่เทอะทะและไม่มีความท้าทาย</p>\n\n\n\n<h2>รักไม่มีเพศ</h2>\n\n\n\n<p><a href=\"https://srakrn.me/blog/nearby-his-ear/\">เสียงที่กระซิบใกล้หูในวันนั้น</a>เคยบอกว่าไม่เชื่อในการแปะป้ายคนทั้งโลกเป็น 16 แบบ&#8211;เธอกำลังหมายถึง MBTI</p>\n\n\n\n<p>เราก็ไม่เชื่อในการแปะป้ายคนว่าเป็นชาย หญิง เกย์ เลสเบี้ยน หรืออะไรประมาณนี้เหมือนกัน</p>\n\n\n\n<p>เราเป็นเพศศิระกร</p>\n\n\n\n<h2>รัฐสวัสดิการ</h2>\n\n\n\n<p>รัฐที่อยากเห็นคนทำอะไรก็ควรจะมีตาข่ายมารับเวลาใครสักคนล้ม มีข้าวให้กิน มีที่ให้ซุกหัวนอน เพื่อจะได้เก็บออมพลังไว้เติมตัวเองและทำอะไรต่อไปแบบที่รัฐอยากเห็นคนทำอะแหละ</p>\n\n\n\n<h2>แอคเห็บ</h2>\n\n\n\n<p>ไม่มีความคิดเห็น ไม่เคยเจอ</p>\n\n\n\n<h2>นักฉอด</h2>\n\n\n\n<p>ถ้าฉอดด้วยเหตุผล หลักฐาน และตรรกะ เราแฮปปี้และอยากเจอนะ</p>\n\n\n\n<h2>Toxic Masculinity</h2>\n\n\n\n<p>Toxic masculinity นี่พูดง่ายกว่า femininity นะ</p>\n\n\n\n<p>เราไม่ชอบคำว่าเป็นลูกผู้ชายไม่ร้องเลย เรามีโครโมโซม XY แล้วเราร้องไห้ไม่ได้เหรอ</p>\n\n\n\n<h2>คบคนที่หน้าตา</h2>\n\n\n\n<p>มันก็คือนิยามของคำว่าสวยอะ และแน่นอนว่า beauty is in the eye of the holder</p>\n\n\n\n<p>นี่เลือกคบคนจากชั้นหนังสือ คนที่เคยคุยด้วยแล้วชอบแบบจริงจังนี่คือเห็นชั้นหนังสือก่อนเห็นหน้า&#8211;แค่คุณก็จะรู้สึกว่ามันรับได้กว่าไง เพราะมันดูเหมือนไม่ฉาบฉวย แต่จริงๆ ใครก็สามารถสร้างชั้นหนังสือที่ตัวเองไม่สนใจจะอ่านได้</p>\n\n\n\n<p>สิ่งที่ตัวเองทำตอนนี้นี่ฉาบฉวยกว่าคบคนที่หน้าตาอีก</p>\n\n\n\n<h2>ละครและนิยายตบจูบ</h2>\n\n\n\n<p>เราไม่ควรต้องมานั่งคุยเรื่องพวกนี้ในปี 2020 นะ</p>\n\n\n\n<p>ละครสะท้อนสังคม สังคมสะท้อนละคร แล้วก็เป็นการอ้างเหตุผลไปมากันเรื่อยๆ คือต้องมีคน break ลูปนี้แหละ</p>\n\n\n\n<h2>ทุนนิยม</h2>\n\n\n\n<p>เวลาเดินไปตลาดแล้วเจอแผงขายผักสามสี่แผงแล้วก็จะขอบคุณตัวเองที่มีทางเลือก ทุนนิยมในแง่ของการแข่งขันที่ไม่ผูกขาดกับตลาดนี่จริงๆ สำคัญไม่ใช่น้อย</p>\n\n\n\n<p>เราเป็น economically left เราเชื่อใน free trade ระดับนึง (ก็จนถึงจุดที่เชื่อว่าทุนนิยมที่ดีต้องมีกลไกข้างหลัง ทั้ง anti-trust, การแข่งขันที่เป็นธรรม, safety net ให้คนล้มเหลวจากระบบ) และเชื่อในมันมากกว่าแนวคิดทาง communism นะ</p>\n\n\n\n<h2>คู่จิ้น</h2>\n\n\n\n<p>จิ้นใครจิ้นไป อย่าไปทำให้เขาไม่สบายใจหรือเดือดร้อนก็พอ</p>\n\n\n\n<h2>นิยายวาย</h2>\n\n\n\n<p>เขียนอยู่ จริงๆ คือตั้งใจเขียนให้เป็นนิยายที่ไม่ได้มีแต่ straight ด้วยเหตุผลที่อยากเห็นวัฒนธรรม non-straight กลุ่มอื่นดังขึ้นมาบ้าง</p>\n\n\n\n<h2>แฟนมาก่อนเพื่อน</h2>\n\n\n\n<p>ไม่มีปัญหา ที่จริงก็คือความสามารถการแบ่งบริบทและเวลา รวมถึงการจัดลำดับความสำคัญ แต่ถ้าผิดมารยาท (เบี้ยวนัด ไม่ตรงเวลา กระทบการงาน ฯลฯ) อันนี้เชิญพิจารณาตัวเอง</p>\n\n\n\n<h2>ของแบรนด์เนม</h2>\n\n\n\n<p>ใช้แล้วมีความสุขกับไม่เดือดร้อนเรื่องเงินก็ใช้ไปเถอะ *ทำหน้าคนไม่เคยซื้อแบรนด์เนมราคาเต็ม*</p>\n\n\n\n<h2>หัวหน้าครอบครัว</h2>\n\n\n\n<p>ไม่เชื่อในความจำเป็น อยากเลี้ยงลูกแบบพ่อไม่ใช่หัวหน้าครอบครัว แม่ไม่ใช่หัวหน้าครอบครัว เราคือสมาชิกและเราทุกคนได้รับการทรีตเท่ากัน</p>\n\n\n\n<h2>เสื้อซับในของนักเรียนหญิง</h2>\n\n\n\n<p>เราเป็นผู้ชายที่เคยใส่เสื้อกล้ามตลอดเพราะไม่อยากให้ใครเห็นในเสื้อขาว</p>\n\n\n\n<p>ความตั้งใจในการใส่มาจากความรู้สึกของเราเองที่ไม่ได้ถูกกดดันจากสังคมข้างนอก และการไม่อยากให้ใครเห็นข้างในของเราก็ไม่ได้ขึ้นอยู่กับกรอบสังคมว่าแบบนี้มันโป๊นะหรืออะไรแบบนั้น</p>\n\n\n\n<p>การใส่เสื้อของผู้หญิงก็ควรเป็นแบบนี้&#8211;ไม่มีคนกดดัน ไม่เป็นไปตามกรอบสังคม</p>\n\n\n\n<h2>สังคมเฟซบุ๊ก</h2>\n\n\n\n<p>เฟซบุ๊กกลายเป็นที่ตามข่าวกับเขียนอะไรมีสาระไปแล้ว ไม่ได้ปฏิสัมพันธ์อะไรกับใครเป็นพิเศษ จะเรียกว่ามีสังคมในนั้นก็คงเรียกได้ไม่เต็มปาก</p>\n\n\n\n<h2>มหาวิทยาลัยเอกชนและรัฐบาล</h2>\n\n\n\n<p>สมัยปัดทินเดอร์เราปัดเฉพาะคนที่เรียนมหาวิทยาลัยรัฐบาล</p>\n\n\n\n<p>เหตุผลไม่ใช่เรื่องคุณภาพการศึกษา แต่เหตุผลคือภาพจำ (perception) ของเราก็ยังคงมองว่ามหาวิทยาลัยเอกชนมีค่าใช้จ่ายสูงกว่าในการเข้าเรียน และเราไม่อยากเป็นฝ่ายที่ socio-economics status ต่ำกว่ามากในเรื่องความสัมพันธ์</p>\n\n\n\n<p>เรื่องการศึกษาแน่นอนว่าไม่มีความคิดเห็น ไปดูอันดับมหาวิทยาลัยโลกว่าบ้านเราที่อันดับต้นๆ อยู่ที่เท่าไหร่ของโลก แล้วจะเข้าใจเอง</p>\n\n\n\n<h2>การทำแท้ง</h2>\n\n\n\n<p>ควรเสรีทุกกรณี&#8211;ทำแท้งนะไม่ใช่กินขนม มันไม่มีใครอยากเจ็บตัวหรอก</p>\n\n\n\n<h2>ล้อสำเนียง</h2>\n\n\n\n<p>ไม่มีความคิดเห็น</p>\n\n\n\n<h2>สลิ่ม</h2>\n\n\n\n<p>ไม่รู้จะอธิบายความคิดเห็นยังไง&#8211;อาจจะปลงไปแล้ว ซึ่งจริงๆ ไม่ควร</p>\n\n\n\n<p>แต่เราเชื่อใน intention ที่ดีของทุกคน คนที่เป็นสลิ่ม (ซึ่งตามนิยามของเราคือเป็น ignorant) อาจจะแค่ยังไม่เห็นอะไรบางอย่าง ก็ค่อยๆ ชี้กันไป</p>","author":"@srakrn","siteTitle":"@srakrn's Blog","siteHash":"8610f010f52679fdf8125827e361d560c59c9ee46c9232365fabf44f77865fb7","entryHash":"ba028d37b579914189078554479cef2c4025cbaef067dc1c82b5ac26525fb4be","category":"Thai"}