{"title":"Characteristics of cervicovaginal microflora at different cervical maturity during late pregnancy: A nested case-control study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300510","date":1710943200000,"content":"<p>by Ping Chen, Tingting Hu, Zheng Zheng, Robert E. Garfield, Jinying Yang</p>\r\nObjective <p>The mechanism of cervical ripening in late pregnancy is still unclear. The vaginal microbiome has been reported to correlate with the preterm birth and short cervix in pregnant women. However, the associations between the cervical maturity and the vaginal microbiome are still poorly understood. We aim to analyze the cervicovaginal microflora in women with ripe cervix and in those who are unripe when delivering at term.</p> Methods <p>Cervicovaginal swabs were collected between 40 and 41 weeks of gestation from the following 2 different groups of patients: ripe group (n = 25) and unripe group (n = 25). Samples were tested using 16S ribosomal RNA gene high-throughput sequencing and analyzed by bioinformatics platform.</p> Results <p>This study highlights the relationship between cervical maturity during late pregnancy and the composition of the cervicovaginal microflora. Both α- and β-diversity analyses demonstrated significant differences between women with a ripe cervix and those with an unripe cervix. Notably, the <i>Lactobacillus</i> profile was found to be closely linked to cervical maturity. There was a significant difference in the vaginal community state type, with CST IV being more prevalent in women with an unripe cervix. Furthermore, the association between CST IV and the unripe cervix group, as indicated by the odds ratio of 8.6, underscores its relevance in evaluating cervical maturity, when compared to other <i>Lactobacillus</i>-dominant community state types. Additionally, several bacterial taxa, particularly <i>Lactobacillus</i>, exhibited differential relative abundances between the two groups.</p> Conclusion <p>This study provided significant evidence regarding the relationship between the vaginal microbiome and cervical maturity, highlighting the differential diversity, community state types, and specific bacterial taxa, such as <i>Lactobacillus</i>, that are associated with cervical maturation status. These findings contributed to our understanding of the dynamics of the cervicovaginal microflora during late pregnancy and its implications for cervical health.</p>","author":"Ping Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ba0376b084816e0d369dda2d389116dc4401ab0ca86ff68087c7bdfda0831bb3","category":"Interdisciplinary"}