{"title":"iOS 18 Potentially 'Biggest' Software Update in iPhone's History","link":"https://www.macrumors.com/2024/01/28/ios-18-big-expectations/","date":1706451437000,"content":"Apple has big plans for iOS 18, according to <a href=\"https://www.bloomberg.com/news/newsletters/2024-01-28/apple-eu-changes-sideloading-third-party-app-stores-are-future-of-the-iphone-lrxjzbg6\"><em>Bloomberg</em>'s Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-18-Mock-Feature-Baubles.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nIn the subscriber-only Q&amp;A section of his <a href=\"https://www.bloomberg.com/news/newsletters/2024-01-28/apple-eu-changes-sideloading-third-party-app-stores-are-future-of-the-iphone-lrxjzbg6\"><em>Power On</em> newsletter</a> today, Gurman said iOS 18 has the potential to be the \"biggest\" software update in the iPhone's history.\r<br />\n\r<br />\n\"I'm told that the new operating system is seen within the company as one of the biggest iOS updates — if not the biggest — in the company's history,\" he wrote.\r<br />\n\r<br />\nGurman said he plans to share more details about specific iOS 18 features and changes that are planned in the future, but we already know about two new features that are likely to be included in the update, as outlined below.\r<br />\n\r<br />\niOS 18 will be released in September, and the first beta for developers will come out during Apple's annual developers conference WWDC in June.\r<br />\n\r<br />\n<h2>RCS Support</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/07/General-Apps-Messages.jpg\" width=\"2500\" height=\"1407\" />\r<br />\nIn November 2023, Apple announced that it would <a href=\"https://www.macrumors.com/2023/11/16/apple-to-adopt-rcs-messaging-standard/\">support the cross-platform messaging standard RCS</a> in the Messages app on the iPhone starting \"later\" in 2024, so it will likely be an iOS 18 feature based on that timeframe.\r<br />\n\r<br />\nRCS support should result in the following improvements to the default messaging experience between iPhones and Android devices:<ul>\r<br />\n <li>Higher-resolution photos and videos</li>\r<br />\n <li>Audio messages</li>\r<br />\n <li>Typing indicators</li>\r<br />\n <li>Read receipts</li>\r<br />\n <li>Wi-Fi messaging between iPhones and Android devices</li>\r<br />\n <li>Improved group chats, including the ability for iPhone users to leave a conversation that includes Android users</li>\r<br />\n <li>Improved encryption compared to SMS</li>\r<br />\n</ul>These modern features are already available for iPhone-to-iPhone conversations with blue bubbles, via iMessage, and many of the features are also available in third-party messaging apps, such as WhatsApp and Telegram. RCS support on the iPhone will extend the features to green bubbles in the Messages app.\r<br />\n\r<br />\n<h2>Smarter Siri</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-18-Mock-Siri-Feature-Baubles.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nGurman expects <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">iOS 18 to feature generative AI technology</a> that \"should improve how both Siri and the Messages app can field questions and auto-complete sentences.\" He said Apple has also explored generative AI features for other apps across its platforms, including Apple Music, Pages, Keynote, and Xcode.\r<br />\n\r<br />\n<em>The Information</em> reported that Apple plans to <a href=\"https://www.macrumors.com/2023/09/06/ios-18-siri-improvements/\">incorporate large language models into Siri</a> to let users automate complex tasks, a feature that would involve deeper integration with the Shortcuts app. The report said this feature is expected to be released in an iPhone software update coming in 2024, which would likely be iOS 18.\r<br />\n\r<br />\nGenerative AI surged in popularity in 2022 when OpenAI released ChatGPT, a chatbot that can respond to questions and other prompts. Google and Microsoft released similar chatbots last year, as more companies race into the space. The chatbots are trained on large language models, allowing them to respond like a human.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-18/\">iOS 18</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/28/ios-18-big-expectations/\">iOS 18 Potentially 'Biggest' Software Update in iPhone's History</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-18-potentially-biggest-software-update-in-iphones-history.2417674/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ba07d2a7e887c35ecc09121ea318970bd65592134f7f7d2bec866b0561c81da5","category":"Apple"}