{"title":"Beneficial effects of advanced chelate technology‐based 7‐minerals in aflatoxin‐B1 challenged broilers: toxin residue reduction, serum biochemical improvement and modulation of the mRNA expression of NF‐kB and Nrf2, and genes within their pathways","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13755?af=R","date":1721718000000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Organic trace minerals (TM) offer superior nutritional benefits because of their stable structure, making their addition to broiler diets potentially beneficial during challenging periods such as aflatoxin B1 (AFB1) contamination. The present study evaluated the impacts of different replacement levels of inorganic TM (ITM) with advanced chelate technology-based TM (ACTM) on the growth performance, serum biochemical parameters, antioxidant indicators, and some inflammatory and immune parameters of broilers fed diets contaminated with AFB1. A 42-day experiment involved randomly assigning 1-day-old broiler chickens (<i>n</i> = 480) to one of five dietary treatments, each with six replicates. The treatments were as follows: (1) NC: basal diet without AFB1 and recommended ITM levels; (2) PC: basal diet with 0.5 mg kg<sup>−1</sup> AFB1 and recommended ITM levels; (3) TB: PC diet +1 g kg<sup>−1</sup> toxin binder; (4) ACTM50: replacement of ITM with 50% ACTM in the PC diet; and (5) ACTM100: replacement of ITM with 100% ACTM in the PC diet.</p>\n<h2>RESULTS</h2>\n<p>Compared with PC treatment, ACTM100 treatment resulted in increased (<i>P</i> &lt; 0.05) body weight gain, serum zinc and glutathione concentrations, immunoglobulin Y level, antioxidant enzyme activities, and hepatic gene expression of nuclear factor erythroid 2-related factor 2, glutathione peroxidase-1, superoxide dismutase-1 and transforming growth factor beta 1. The ACTM100 group also exhibited decreased AFB1 residue in the liver and kidney, serum alanine transaminase activity and malondialdehyde concentration, and hepatic gene expression levels of nuclear factor-kappa B and interferon-gamma (<i>P</i> &lt; 0.05). These values were comparable to those recorded in the TB and NC treatments.</p>\n<h2>CONCLUSION</h2>\n<p>In conclusion, completely replacing ITM with ACTM can benefit the metabolism and mitigate AFB1-induced immunotoxicity and oxidative damage in chickens by altering the mRNA expression of nuclear factor-kappa B and nuclear factor erythroid 2-related factor 2, and some genes downstream their signaling pathways. © 2024 Society of Chemical Industry.</p>","author":"Zeynab Mohammadi, \nKamran Taherpour, \nHossein Ali Ghasemi, \nSaideh Fakharzadeh, \nZahra Nooreh, \nSomayeh Kalanaky","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ba093a9356cc5f516851246a9ba1c40a4ca2ca03f9439b5d75975716e43a3464","category":"Environment"}