{"title":"Wetlands Water Level Measurements From the New Generation of Satellite Laser Altimeters: Systematic Spatial‐Temporal Evaluation of ICESat‐2 and GEDI Missions Over the South Florida Everglades","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035422?af=R","date":1709107200000,"content":"<h2>Abstract</h2>\n<p>The ICESat-2 and GEDI missions were launched in 2018, becoming the new generation of space-borne laser altimeters. These missions provide unprecedented global geodetic elevations, opening great opportunities for water level monitoring. The potential of these altimeters has been demonstrated in open-water environments such as lakes, rivers, and reservoirs. However, detailed evaluations in vegetated environments, such as wetlands, floodplains, and other areas not constrained by water canal networks, are essential for continued improvement and further hydrological application. We developed a systematic accuracy assessment of ICESat-2 ATL08, and GEDI L2A products to monitor spatial-temporal water level and depth dynamics over the South Florida Everglades wetlands. The evaluation was performed on data acquired between 2020 and 2021, using gauge-based water level and depth estimates as references. The results showed an RMSE of 0.17 m (water level) and 0.15 m (water depth) for ICESat-2 and 0.75 m (water level) and 0.37 m (water depth) for GEDI. The analysis suggested that nighttime acquisitions were more accurate for both missions than daytime ones. The low-power beams achieved slightly higher accuracies than those of the high-power beams over the evaluated wetlands. Water level retrieval was more problematic in densely vegetated areas; however, we derived a correction model based on the leaf area index that improved the accuracy by up to 75% for water depth retrievals from GEDI. Furthermore, the analysis provides new insights to understand the potential of the altimeters in monitoring the spatial-temporal dynamics of water levels in the evaluated wetlands.</p>","author":"Sebastián Palomino‐Ángel, \nShimon Wdowinski, \nShanshan Li","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"ba0b82156b45dbfd577ec1f8e9a2e8228074d0a8cb7cf5dc181029889d6f8819","category":"Environment"}