{"title":"Can cyclone exposure explain behavioural and demographic variation among lemur species?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300972","date":1711548000000,"content":"<p>by Alison M. Behie, Travis S. Steffens, Keaghan Yaxley, Alan Vincent, Patricia C. Wright, Steig E. Johnson, Mary S. M. Pavelka</p>\r\n\r\nMadagascar has a harsh and stochastic climate because of regular natural disturbances. This history of regular cyclones has been hypothesised to have directed evolutionary changes to lemur behaviour and morphology that make them more resilient to sudden environmental change. These adaptations may include: small group sizes, high degrees of energy-conserving behaviours, generalist habitat use, small home ranges, small body size, and a limited number of frugivorous species. To date, however, no one has tested how variation in cyclone exposure across Madagascar is associated with variation in these resilience traits. In this study, we created a detailed cyclone impact map for Madagascar using Koppen-Geiger climate class, historical cyclone tracks, the Saffir Class of cyclone and hurricane intensity, and precipitation data. We also used existing literature to calculate a resilience score for 26 lemur species for which data existed on resilience traits. Our cyclone impact map was then overlaid on known geographic ranges of these species and compared to resilience score while controlling for phylogenetic non-independence and spatial autocorrelation. We found no association between cyclone impact in a lemur range and their resilience score. When assessing traits individually, however, we found that cyclone impact was positively associated with body size, suggesting that the more impacted a species is by cyclones the smaller they are. We also found cyclone impact to be negatively associated with frugivory, with species in higher impact zones eating more fruit. While unexpected, this could reflect an increased production in fruit in tree fall gaps following cyclones. While we did not find a pattern between cyclone impact and behavioural resilience in lemurs, we suggest a similar study at a global scale across all primates would allow for more taxonomic variation and reveal larger patterns key to understanding past and future vulnerability to natural disturbances in primates.","author":"Alison M. Behie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ba11c272dd140a20ed6abe1cd0ba236df8012f672a21ed5984ef65edef523580","category":"Interdisciplinary"}