{"title":"A qualitative inquiry on drivers of COVID-19 vaccine hesitancy among adults in Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002986","date":1711634400000,"content":"<p>by Stacey Orangi, Daniel Mbuthia, Elwyn Chondo, Carol Ngunu, Evelyn Kabia, John Ojal, Edwine Barasa</p>\r\n\r\nCOVID-19 vaccination rates have been low among adults in Kenya (36.7% as of late March 2023) with vaccine hesitancy posing a threat to the COVID-19 vaccination program. This study sought to examine facilitators and barriers to COVID-19 vaccinations in Kenya. We conducted a qualitative cross-sectional study in two purposively selected counties in Kenya. We collected data through 8 focus group discussions with 80 community members and 8 in-depth interviews with health care managers and providers. The data was analyzed using a framework approach focusing on determinants of vaccine hesitancy and their influence on psychological constructs. Barriers to COVID-19 vaccine uptake were related to individual characteristics (males, younger age, perceived health status, belief in herbal medicine, and the lack of autonomy in decision making among women ‐ especially in rural settings), contextual influences (lifting of bans, myths, medical mistrust, cultural and religious beliefs), and COVID-19 vaccine related factors (fear of unknown consequences, side-effects, lack of understanding on how vaccines work and rationale for boosters). However, community health volunteers, trusted leaders, mandates, financial and geographic access influenced COVID-19 vaccine uptake. These drivers of hesitancy mainly related to psychological constructs including confidence, complacency, and constraints. Vaccine hesitancy in Kenya is driven by multiple interconnected factors. These factors are likely to inform evidence-based targeted strategies that are built on trust to address vaccine hesitancy. These strategies could include gender responsive immunization programs, appropriate messaging and consistent communication that target fear, safety concerns, misconceptions and information gaps in line with community concerns. There is need to ensure that the strategies are tested in the local setting and incorporate a multisectoral approach including community health volunteers, religious leaders and community leaders.","author":"Stacey Orangi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"ba161ebdad9d24b3c16e24b5f76313110d785df0dd66734b394b714c715018a2","category":"Environment"}