{"title":"Alpine plants exhibited deep supercooling upon exposed to episodic frost events during the growing season on the Qinghai-Tibet Plateau","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae034/7657855?rss=1","date":1714003200000,"content":"<span><div>Abstract</div>Climatic warming has advanced the spring phenology of plants and disrupted the alignment of phenology with weather patterns. Such misalignments can cause problems as extreme weather events become more frequent and thus impact the survival, growth and reproduction of plants. To prevent freezing within their cells during the growing season, plants adopt a supercooling strategy. However, the weather event severity and seasonal timing may impact the plant’s recovery after a freezing event. We conducted experiments to investigate how extreme freezing events of four different severities impacted the supercooling points and senescence of two dominant alpine plant species, <span>Potentilla saundersiana</span> (mid-summer flowering) and <span>Gentiana parvula</span> (late-summer flowering) on the Qinghai-Tibet Plateau (QTP). We also explored how the phenological stage impacted <span>P. saundersiana</span>’s response to freezing events. We found that both species exhibited supercooling upon exposed to frost damage. However, the average supercooling point for <span>P. saundersiana</span> was −6.9°C and was influenced by minimum temperature, duration and phenological stage. Whereas, the average supercooling point for <span>G. parvula</span> was −4.8°C, and neither minimum temperature nor duration had an effect on the supercooling point. In addition, the minimum temperature treatment of −10°C caused death in both plants when held constant for 4 h. Our study provides the first experimental dataset exploring the supercooling points of alpine plants on the QTP. Given the increasing probability of alpine plants encounters frost events, these results are of great significance for understanding the growth and survival strategies of alpine plants to cope with the adverse effects of extreme climate.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"ba18ebdba666beb79e6a7dfb1c1796edc147ccdae041793bc669ca0eb68abd9b","category":"Environment"}