{"title":"‘Headless Body in Topless Bar’","link":"https://www.inquirer.com/opinion/commentary/headless-body-topless-bar-headline-40th-anniversary-20230414.html","date":1681782626000,"content":"\n<p>Michael Klein, writing for The Philadelphia Inquirer:</p>\n\n<blockquote>\n  <p>This month marks the 40th anniversary of a watershed moment in\njournalism: the publication of the “Headless Body in Topless Bar”\nheadline on the front page of the New York Post. [...]</p>\n\n<p>Vincent A. Musetto, one of the Post’s managing editors, gets the\ncredit for “Headless Body in Topless Bar.” In a madcap newsroom\nrun largely by owner Rupert Murdoch’s Fleet Street-hardened crew\nof Brits, Aussies, and Kiwis, Musetto was a real-deal,\nprototypical New Yorker: brash, zany, unafraid to drop-kick a\ntrash can during a debate.</p>\n\n<p>From that day, I wanted to work for Vinnie. Two years later, as a\npun-loving 25-year-old copy editor at a South Jersey paper, I\ntried out as a Post sub-editor, designing pages and writing\nheadlines. On the first day of my tryout, the editors sent me a\ngoofy filler story about male dogs being electrocuted by a poorly\ngrounded lamppost. The headline I submitted: “Piss of death.” It\nran in exactly one edition before someone pointed out that such a\nfour-letter word in 18-point type might be too much, even for the\nNew York Post, which five years before had paid a morgue worker to\nunzip John Lennon’s body bag and take a photo of the slain Beatle\nin repose.</p>\n\n<p>Musetto slapped my back, shot me a grin, and offered me a job.</p>\n</blockquote>\n\n<p>The best detail: the Post got two sources to confirm that the bar did indeed feature topless dancing.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/04/17/headless-body-in-topless-bar\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ba23eb4b0de3cfd610a647047e9f2c2b895d8ba4b45432b510625e51248328aa","category":"Tech"}