{"title":"The perfect ambush: Carlos Rodríguez takes full advantage","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-perfect-ambush-carlos-rodriguez-goes-full-flight-at-the-right-moment","date":1689450393000,"content":"\n      <p>There are points of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> where it’s easy to forget the rest of the race exists. That there are tens of riders sprawled across a mountain range all trying to reach the finish line to, in some cases, improve their position in the race, or for the most part, simply make it through to tomorrow.</p>\n<div></div>\n<p>On the Col de Joux Plane, the final climb of a brutish stage 14 in Alps, all spectating eyes were fixed on the Tour’s two main protagonists for the yellow jersey. There is so little to separate Jonas Vingegaard and Tadej Pogačar, and so far ahead of everyone else are they, that it’s understandable to become transfixed with their era-defining scrap for seconds.</p>\n<p>And while as spectators it’s easy to dismiss from our minds those that have drifted out of sight back down the mountain in favour of the two Tour heavyweights dealing blows to one another, it’s just as easy for those involved too.</p>\n<p>At one point following Pogačar’s initial attack on Joux Plane, there was nobody within a minute of him and Vingegaard, and it seemed almost impossible to imagine anyone closing that considering the pace with which those two have ridden every summit of this Tour. But as Vingegaard returned to his side, a watchful slowing ensued, and each of them occupied the entire focus of the other as they waited for the inevitable move to grab invaluable bonus seconds at the summit.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/there-are-still-two-why-2023-is-a-tour-for-the-ages\"><strong><em>Read more: There are still two: why 2023 is a Tour de France for the ages</em></strong></a></p>\n<p><span>That slowing allowed the next best rider on the mountain, Ineos Grenadiers Carlos Rodríguez (fourth overall at the start of the day), to work his way back to within touching distance of them both. The 22-year-old Spaniard, who later described the superior Vingegaard and Pogačar as “playing a video game” in which “their legs don't hurt”, did the only thing he could in the situation he found himself, and rode his own pace in a methodical and precise manner many of his forebears at Ineos/Sky would have been proud of. Though he didn’t catch them before the summit of Joux Plane, the false flat and uphill kick prior to the descent proper offered just enough road for him to claw them back.</span></p>\n<p>What he did next felt like the antithesis of the original Sky playbook and a pure moment of racing instinct. It’s safe to say neither Vingegaard nor Pogačar saw it coming given how transfixed they were on one another and the throngs of crowds around them, but Rodríguez executed the perfect ambush as he attacked the moment he caught them. His move with just over 9km to go and on the crest of that final kick upwards saw him gap the two leaders briefly, but it was a combination of his descending prowess and the doubt he had cast behind that saw him get away in earnest.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230715TDF0026-A.S.O._Pauline_Ballet.jpg?v=1689449755\" alt /></p>\n\n<p><em>Rodríguez worked his way back to Pogačar and Vingegaard after being dropped on Joux Plane (Photo by Pauline Ballet/ASO)</em></p>\n<p><span>That doubt was particularly obvious from Pogačar, who by now had Vingegaard glued to his wheel offering no assistance. The Slovenian is a winner, and securing the stage (and the bonus seconds that come with it) was clearly in his mind, as was shaking the yellow jersey. In the end he achieved neither, his slowing into and aggressively accelerating out of corners unable to lose Vingegaard while simultaneously distancing himself from the lone escapee. Even the presence of his teammate Adam Yates (who had followed Rodríguez back to the front of the race, did little to assist him in either task. It was a sheer rock and hard place situation.</span></p>\n<p>For Rodríguez, it was the perfect play and the perfect situation to be in. A fast, but safe, descent would see him score just the third win of his burgeoning career and a Tour win (Ineos’ second in two days) on debut in a mountain stage for the ages. His performance also meant he forced his way onto the overall podium ahead of Jai Hindley (Bora-Hansgrohe), which will come as some relief to Ineos management after Tom Pidcock slipped out of contention earlier in the stage. It may also give them food for thought about letting Rodríguez leave for Movistar next year.</p>\n<p>Vingegaard and Pogačar may have been playing a video game of their own today, but they didn’t look up quite long enough to see Rodríguez take full advantage.</p>\n<p><em>Cover photo by James Startt</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ba2a192c12c767678b368b7e2a20456f011030dd72afdc6ecc6df1056a3391cd","category":"Cycling"}