{"title":"Sustainable Growth of Transversal Competences: Exploring the Competence Relationships among University Students","link":"https://www.preprints.org/manuscript/202404.1325/v1","date":1713513072000,"content":"The development of transversal competences, in interaction with professional competences, is essential for individuals to adapt to change and live meaningful and productive lives. The aim of this study was to explore the mutual interaction of six transversal competences—civic, digital, entrepreneurial, global, innovation, and research, as well as their respective sub-competences—and propose possible approaches to how this dynamic of interaction can be applied to facilitate the development of transversal competences. A sample of students (N = 1575) from 21 universities in Latvia completed a self-assessment survey evaluating multiple behavioural indicators for each transversal competence and sub-competence. The results revealed that civic competence was evaluated significantly lower than other competences, and, for most transversal competences, sub-competences associated with active and systematic collaboration and networking received lower evaluations. A network analysis showed that the community involvement sub-competence of the civic competence and the initiative and critical thinking sub-competences of the innovation competence had the strongest links to the other measured sub-competences on average. The results suggest that the development of initiative and cooperation-and-collaboration-related and network-building skills are likely to have a systematic positive effect on the development of a wider set of transversal competences and the professional autonomy of students in the long term.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ba2d57cc5e2edea471688b4117a6814630fa076d809fed71fb2a2801c2b2f57f","category":"Interdisciplinary"}