{"title":"3DFin: a software for automated 3D forest inventories from terrestrial point clouds","link":"https://academic.oup.com/forestry/article/97/4/479/7680458?rss=1","date":1716422400000,"content":"<span><div>Abstract</div>Accurate and efficient forest inventories are essential for effective forest management and conservation. The advent of ground-based remote sensing has revolutionized the data acquisition process, enabling detailed and precise 3D measurements of forested areas. Several algorithms and methods have been developed in the last years to automatically derive tree metrics from such terrestrial/ground-based point clouds. However, few attempts have been made to make these automatic tree metrics algorithms accessible to wider audiences by producing software solutions that implement these methods. To fill this major gap, we have developed <span>3DFin</span>, a novel free software program designed for user-friendly, automatic forest inventories using ground-based point clouds. <span>3DFin</span> empowers users to automatically compute key forest inventory parameters, including tree Total Height, Diameter at Breast Height (DBH), and tree location. To enhance its user-friendliness, the program is open-access, cross-platform, and available as a plugin in <span>CloudCompare</span> and <span>QGIS</span> as well as a standalone in <span>Windows</span>. <span>3DFin</span> capabilities have been tested with Terrestrial Laser Scanning, Mobile Laser Scanning, and terrestrial photogrammetric point clouds from public repositories across different forest conditions, achieving nearly full completeness and correctness in tree mapping and highly accurate DBH estimations (root mean squared error &lt;2 cm, bias &lt;1 cm) in most scenarios. In these tests, <span>3DFin</span> demonstrated remarkable efficiency, with processing times ranging from 2 to 7 min per plot. The software is freely available at: <a href=\"https://github.com/3DFin/3DFin\">https://github.com/3DFin/3DFin</a>.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"ba35937c40f6a3a653e393eb99ba64592844a49b9fc7c1829773220f513a02bf","category":"Environment"}