{"title":"Exploring the Utilization of Plastic Sand in Construction to Drive Sustainable Practices and Foster a Circular Economy","link":"https://www.preprints.org/manuscript/202403.0773/v1","date":1710320194000,"content":"Plastics play a pivotal role in the principles of a circular economy, where their effective recycling post-utilization, leading to economic value generation and minimal environmental harm, is crucial for achieving sustainable management. Extensive research has delved into the incorporation of waste plastics in concrete, showcasing promising outcomes with a myriad of advantages..The escalating volume of plastic waste is becoming a pressing issue, contributing to environmental pollution, particularly in densely populated cities and towns in Nigeria such as Delta, Aba, Port Harcourt, Onitsha, Enugu, Benue, and Ogun. These urban centers experience high consumption of goods packaged or sealed in plastic materials. Tourist destinations are also affected as large quantities of plastic waste are improperly disposed of or incinerated, resulting in environmental contamination and air pollution. Efforts to address this growing concern are crucial to safeguarding the environment and public health in these regions.Therefore, it is imperative to find effective ways to utilize these waste plastics. By cleaning low-density polyethylene bags and combining them with sand at specific proportions, high-strength bricks can be produced. These bricks not only exhibit thermal and sound insulation properties but also help in pollution control and cost reduction in construction projects. This innovative approach not only addresses the issue of accumulating plastic waste, a non-biodegradable pollutant, but also offers a sustainable solution to manage plastic waste while contributing to the construction industry's efficiency and environmental protection., By incorporating waste plastic and nylon into brick production, we not only reduce the amount of sand extracted from our natural resources like rivers and seas but also utilize the surplus plastic waste that is currently discarded. This research focuses on creating eco-friendly bricks by incorporating molten plastic, nylon, and plastic bottles in varying percentages (0 to 15% by weight) along with 5kg of fly ash. The experimental results from this study will shed light on the feasibility and benefits of using these materials in brick manufacturing, highlighting the potential of sustainable construction practices that minimize environmental impact and resource depletion, The experimental process involved utilizing cement and sand to complete the brick composition, with curing conducted underwater for 29 days followed by baking at temperatures between 100°C to 120°C for 2 hours. The resulting eco-friendly bricks exhibited key characteristics such as being lightweight, porous, having low thermal conductivity, and displaying appreciable mechanical strength. Interestingly, the compressive strengths of these bricks, post the addition of waste plastic and nylon, were found to be comparable to that of conventional bricks. Additionally, these eco-friendly bricks showcased reduced water absorption capacity compared to regular bricks, offering a promising alternative for sustainable and efficient construction practices.The eco-friendly bricks made from A, B, C, and D using 0%, 5%, 10%, and 15% plastic/nylon waste showed comprehensive strengths of 19.5 ,19.46, 20.3, and 21.1 respectively, with corresponding water absorption percentages of 0.34, 0.25, 0.22, 0.20, and 0.085. The efflorescence values were lower than those of normal bricks. These bricks are likely to enhance energy efficiency in buildings and provide economic value to manufacturers, thereby promoting a sustainable ecosystem for plastic waste management with the involvement of all stakeholders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ba45edc1ef5b79f87a2afe907c8b54010f1b4885eef06c1250af56498505fcfd","category":"Interdisciplinary"}