{"title":"Type 2 diabetes: a sacrifice program handling energy surplus","link":"https://academic.oup.com/lifemeta/article/doi/10.1093/lifemeta/loae033/7728979?rss=1","date":1722988800000,"content":"<span><div>Abstract</div>Type 2 diabetes mellitus (T2DM) is closely associated with obesity, while interactions between the two diseases remain to be fully elucidated. To this point, we offer this perspective to introduce a set of new insights into the interpretation of T2DM spanning the etiology, pathogenesis, and treatment approaches. These include a definition of T2DM as an energy surplus-induced diabetes characterized by the gradual decline of β cell insulin secretion function, which ultimately aims to prevent the onset of severe obesity through mechanisms of weight loss. The body employs three adaptive strategies in response to energy surplus: the first one is adipose tissue expansion to store the energy for weight gain under normal weight conditions; the second one is insulin resistance to slow down adipose tissue expansion and weight gain under overweight conditions; and the third one is the onset of T2DM following β cell failure to reverse the weight gain in obese conditions. The primary signaling molecules driving the compensatory responses are adenosine derivatives, such as adenosine triphosphate (ATP), acetyl coenzyme A (acetyl-CoA), and reduced nicotinamide adenine dinucleotide (NADH). These molecules exert their effects through allosteric, post-translational, and transcriptional regulation of metabolic pathways. The insights suggest that insulin resistance and T2DM are protective mechanisms in the defense against excessive adiposity to avert severe obesity. The perspective provides a unified framework explaining the interactions between the two diseases and opens new avenues in the study of T2DM.</span>","author":"","siteTitle":"Life Metabolism Current Issue","siteHash":"d3cf61b7d69b232b580c1102d6441106867080e8dca2814adef0cc08b7e63ed3","entryHash":"ba53fddde80cde32d7dfe04f3c5567bbb221c4921536514ac926b88c6140c850","category":"Environment"}