{"title":"The Prevalence and Risk Factors of Low Bone Mineral Density in the Population of the Abay Region of Kazakhstan","link":"https://www.preprints.org/manuscript/202404.1288/v1","date":1713448443000,"content":"Osteoporosis is considered a serious public health problem, particularly affecting the postmenopausal period. In 2018, in the Republic of Kazakhstan the total and primary incidence was 10 and 3.7 cases per 100,000 adults, respectively. The objective is to study osteoporosis prevalence and indicate main factors affecting low bone mineral density by screening adult population of Abay region, Kazakhstan. The target group were 641 respondents aged between 18 and 65 years old, Kazakh population living in Abay region since birth. All participants filled out questionnaire and had a bone mineral density measurement by dual energy X-ray absorptiometry (DXA) between July 15, 2023 and February 29, 2024. Logistic regression analysis was conducted to assess the association between low bone mineral density and key demographic characteristics, aforementioned lifestyle factors and nutrition habits. We identified the prevalence of low bone density and osteoporosis at the level of 34.1% with the highest prevalence in the older population group (50+ years) - 48.3%. Regression analysis revealed a number of indicators associated with the likelihood of bone sparing. However, only 4 of these showed significance in the final multivariate model (R2=22.4%). These included age (AOR 1.05), body mass index (AOR 0.92), fracture history (AOR 1.64), consumption of nuts and dried fruits were associated with lower prevalence of osteoporosis (AOR 0.48).  Our study was the first in Kazakhstan that investigates the association of key demographic, behavior and anamnestic factors with low mineral density.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ba54787e4796cda9042289489ddba20dd2535a514409208355c39bdbed122236","category":"Interdisciplinary"}