{"title":"Soybean type-B response regulator GmRR1 mediates phosphorus uptake and yield by modifying root architecture","link":"https://academic.oup.com/plphys/article/194/3/1527/7330354?rss=1","date":1698278400000,"content":"<span><div>Abstract</div>Phosphorus (P) plays a pivotal role in plant growth and development. Low P stress can greatly hamper plant growth. Here, we identified a QTL (named <span>QPH-9-1</span>), which is associated with P efficiency across multiple environments through linkage analysis and genome-wide association study. Furthermore, we successfully cloned the underlying soybean (<span>Glycine max</span>) gene <span>GmRR1</span> (a soybean type-B Response Regulator 1) that encodes a type-B response regulator protein. Knockout of <span>GmRR1</span> resulted in a substantial increase in plant height, biomass, P uptake efficiency, and yield-related traits due to the modification of root structure. In contrast, overexpression of <span>GmRR1</span> in plants resulted in a decrease in these phenotypes. Further analysis revealed that knockout of <span>GmRR1</span> substantially increased the levels of auxin and ethylene in roots, thereby promoting root hair formation and growth by promoting the formation of root hair primordium and lengthening the root apical meristem. Yeast two-hybrid, bimolecular fluorescence complementation, and dual-luciferase assays demonstrated an interaction between GmRR1 and Histidine-containing Phosphotransmitter protein 1. Expression analysis suggested that these proteins coparticipated in response to low P stress. Analysis of genomic sequences showed that <span>GmRR1</span> underwent a selection during soybean domestication. Taken together, this study provides further insights into how plants respond to low P stress by modifying root architecture through phytohormone pathways.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"ba741663b09e883f339bedf91d7b6528084701fbf84ab72bd09c01b8c79e44e1","category":"Environment"}