{"title":"300 Awardee Talk: Elisabeth Huff-Lonergan","link":"https://academic.oup.com/jas/article/102/Supplement_3/116/7757207?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The science of pet food processing is an emerging area of interest for many companion animal scientists. Pet food science has an essential role in ensuring the health and well-being of companion animals, and in the sustainability and viability of the animal agriculture industry. Many ingredients used in pet foods are co-products of human food production. Meat products, including whole meats, mechanically deboned meat, and rendered protein meals, are often used as a principal source of highly digestible, well-balanced proteins and, vitamins and minerals. These products are transported, stored, and processed under various means. Many of these processes can have a detrimental impact on the nutrient and functionality of the protein component. Proteins are susceptible to many changes during processing that can impact their functionality, nutritional quality, and digestibility - including oxidative degradation. Oxidation of proteins is critical to understand as it can affect the functionality and quality of the diet. However, protein oxidation, from exposure to oxygen, heat, and light, has often not been well explored. Oxidized proteins may lead to reduced palatability, decreased digestibility, and other aspects of product quality of pet foods. Understanding protein oxidation mechanisms and their impact on product quality can help develop effective mitigation strategies for producing and maintaining high-quality pet food. There is a need for ongoing work to identify antioxidants, processing techniques, and storage conditions that minimize protein oxidation. Another critical need for the industry is to educate future pet food scientists to answer new problems and capitalize on innovative solutions. However, despite the growing demand for high-quality pet food, there remains a gap in specialized education for aspiring pet food professionals. Traditional animal science programs often lack dedicated coursework on companion animal nutrition and formulation, specifically pet food processing. On both the science of processing and the education of the next generation of scientists and industry professionals, there is a need to continue to draw on perspectives from the human food industry. As the pet food industry continues to evolve, it faces several challenges related to product quality, innovation, and the need for scientists who understand the pet food industry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ba75574f36ce9c040d3e21b8d60f9e231fbfc51368c090ba4d3469b7bd2b8201","category":"Environment"}