{"title":"Pinion combines shifting and drive with its first ebike motor and gearbox","link":"https://www.bikeradar.com/news/pinion-e-drive-gearbox/","date":1687242624000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Simplon-Rapcon-Pinion-04-ac48508.jpeg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Simplon e-mountain bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" />                                            <p>German bicycle gearbox manufacturer Pinion has launched its new E-Drive Motor Gearbox unit.</p>\n<p>The brand, made up of former Porsche car engineers, has drawn upon its experience of powertrains to create a system that combines an <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a> and a gearbox in one unit that shifts wirelessly.</p>\n<p>It gives the brand an entry into the ever-growing <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-an-electric-bike/\">electric bike</a> market with versions of E-Drive suitable for mountain biking, touring, commuting and cargo bikes.</p>\n<p>The new Motor Gearbox Unit, or MGU for short, is also designed to alleviate some of the disadvantages of traditional bicycle gearboxes, namely drag and decreased shifting performance under load.</p>\n<h2>Pinion E-Drive MGU</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Simplon e-bike showing casing new Pinion E-Drive Motor Gearbox Unit and Wireless Shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Pinion’s new E-Drive system combines the brand’s gearbox technology with a cutting-edge electric motor.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>Pinion claims its new E-Drive MGU system is not just a <a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\">drivetrain</a>, but a powertrain.</p>\n<p>It unites a full-power ebike motor and a 9- or 12-speed gearbox with electronic shifting into a compact package that is claimed to weigh around 4kg.</p>\n<p>This compares to the 2.9kg and 2.6kg weight of Bosch’s Performance Line CX  and Shimano’s EP8 motors respectively.</p>\n<p>Adding SRAM’s traditional GX AXS drivetrain to either the Bosch or Shimano motors adds 1.85kg, so the E-Drive is lighter than both options, once all parts of a bike’s powertrain are taken into account.</p>\n<p>Despite cramming all of that in, the E-Drive is not much larger than many full-power ebike motors.</p>\n<p>By uniting everything that’s needed to power an ebike in one unit, Pinion claims the E-Drive MGU can tell what gear the rider is in and the cadence they’re riding at. This enables it to adjust the motor’s speed and support accordingly, and select the perfect gear ratio, according to Pinion.</p>\n<p>The brand claims it can shift precisely, reliably, instantaneously and depending on the setting, can even shift for you, ensuring you’re always be in the optimum gear.</p>\n<p>Low maintenance is one of the points that makes Pinion’s other gearboxes popular with owners of <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">touring bikes</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\">commuter bikes</a>. Just like its regular gearboxes, the brand claims the new E-Drive system requires little maintenance, only needing an internal oil change every 10,000 km.</p>\n<p>This should mean you can keep the battery topped up and ride with minimal fuss, a real boon for riders who want to cover serious mileage.</p>\n<h2>Pinion E-Drive Tech</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"E-bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Pinion says E-Drive is a versatile system suitable for a wide range of bikes.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>In order to make E-Drive a reality, Pinion has designed its own hardware and software to control the MGU.</p>\n<p>Data is fed to this via a series of patented internal sensors that it claims continuously read the input torque, motor speed and other metrics to ensure a natural ride feel.</p>\n<p>The brand says the beating heart of the motor powering the E-Drive system is a state-of-the-art brushless motor that’s both compact, wear-free and manufactured in Germany.</p>\n<p>It claims the motor has been heavily modified with more powerful magnets to offer “amazing efficiency, unmatched reliability and incredible power density” in comparison to other ebike motors on the market.</p>\n<p>As with other ebike motors, E-Drive offers multiple levels of assistance, with four support or assistance levels to choose from.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"E-bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> A choice of handlebar remotes control the four support modes; Eco, Flow, Flex and Fly.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>Eco is designed for maximum range, while the most powerful Fly mode enables the rider to access all of the power of the system.</p>\n<p>The middle Flow and Flex modes are adaptive and are claimed to alter the amount of support perfectly for every riding situation and terrain.</p>\n<p>Pinion also says there’s a finely tuned starting aid to help prevent wheel spin when setting off on loose climbs and a boost button on the handlebar when you want an extra kick.</p>\n<p>All support modes can be tailored to a rider’s individual preferences through Pinion’s FIT E-Bike Control app.</p>\n<h2>Pinion E-Drive setup options</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"E-bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> E-Drive is available in Comfort or Performance tunes to suit electric MTBs, hybrids, touring and commuter bikes.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>Along with a choice of 9- or 12-speed internals, there are two setups: Comfort and Performance.</p>\n<p>These are pre-configured by manufacturers speccing the E-Drive on their bikes.</p>\n<p>Pinion says the Comfort setup is designed to provide a balanced, natural ride feel that is ideally suited to commuting, touring and weekend adventures.</p>\n<p>For <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bikes</a>, Pinion claims the Performance setup has been developed to suit experienced riders, offering a finely tuned dynamic power output.</p>\n<p>There is also a dedicated Speed version for speed pedelecs that ups the maximum supported speed to 45kph.</p>\n<p>The regular ebike version can provide up to 600W or 400 per cent of assistance at a maximum cadence of 120rpm, according to Pinion.</p>\n<h3>Fighting Torque</h3>\n<p>When it comes to the MGU’s torque output, Pinion claims it gives up to 160Nm of torque at the motor’s output shaft in first gear.</p>\n<p>This might seem high when compared to the competition, but Pinion says it doesn’t believe the way other ebike motor manufacturers measure torque is applicable to its motor and gearbox unit.</p>\n<p>As such, Pinion says the E-Drive’s torque measurements are taken at the output shaft rather than the power that goes to the back wheel, where other brands take their readings.</p>\n<p>For a more comparable measurement, Pinion claims a maximum torque delivery to the rear wheel of 85Nm, making it roughly in line with the competition.</p>\n<h3>Pinion E-Drive gear range and wireless shifting</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"E-bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> E-Drive offers huge overall gear ranges, at 568 per cent and 600 per cent for E1.9 9-speed and E1.12 12-speed gearbox options respectively.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>The 9- and 12-speed setups offer gearing ranges of 568 per cent and 600 per cent respectively.</p>\n<p>This means both provide more range than the most popular drivetrains on the market.</p>\n<p>For comparison, <a href=\"https://www.bikeradar.com/tags/sram-eagle/\">SRAM’s Eagle</a> provides 520 per cent and <a href=\"https://www.bikeradar.com/news/shimano-linkglide-xt-deore/\">Shimano’s Linkglide</a> and Hyperglide 454 per cent and 510 per cent respectively</p>\n<p>Steps between gears sit at around 24 per cent for the 9-speed setup. That is reduced to 17.7 per cent steps for the 12-speed version.</p>\n<p>The gear range is impressive, but some riders might be more interested in the shifter itself, because Pinion has moved away from its grip shift design, with E-Drive using a wireless trigger shifter.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Simplon e-bike showing casing new Pinion E-Drive Motor Gearbox Unit and Wireless Shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Rather than Pinion’s existing grip shifter, the brand has developed new wireless shifting, called Smart.Shift.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>Pinion claims this can change gear within a fraction of a second, with or without pedalling.</p>\n<p>The inability to shift smoothly under load is a common complaint about existing Pinion gearboxes. However, the brand claims on-power shifting is ultra-precise because the new E-Drive MGU is designed as a unit, with the motor assisting the gearbox.</p>\n<p>Shifter ergonomics are also said to be improved compared to the regular gearbox.</p>\n<p>The shifter is similar in style to Shimano’s Di2 mountain bike shifter, with two levers – one to go to an easier gear and the other for a harder gear.</p>\n<p>Once the motor battery runs out of charge, Pinion says you can still shift around 1,000 times, so you shouldn’t be left with a hefty ebike stuck in a single gear if the battery runs flat.</p>\n<p>The brand’s own software connects the motor and gearbox elements together to enable semi-automatic shifting, which it calls Smart.Shift.</p>\n<p>Pinion claims that because the motor can monitor your speed and cadence and tailor the support towards the situation you’re in, the Smart.Shift system knows when it’s best to shift.</p>\n<p>It can even execute a pre-selected shift command thanks to two additional functions, Pre.Select and Start.Select.</p>\n<p>Pre.Select is a function that shifts automatically to the perfect gear for your speed when coasting downhill.</p>\n<p>This means you’re in the right gear to get back on the pedals without having to change multiple gears at once yourself.</p>\n<p>Pinion says Start.Select can shift automatically into a pre-selected starting gear when you come to a complete stop.</p>\n<p>The brand claims Start.Select makes life easier when you stop at a set of traffic lights at the base of a climb, because it will shift into the selected starting gear for you.</p>\n<h3>Multiple battery and display options</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rotwild e-bike showing casing new Pinion E-Drive Motor Gearbox Unit and Wireless Shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Pinion will offer multiple battery sizes, including a whopping 960Wh version.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>The E-Drive system is powered by lithium-ion battery cells, with a choice of 480, 720 and 960Wh batteries available. There’s also a range extender, though Pinion hasn’t stated the capacity of this.</p>\n<p>Paired to the batteries is an intelligent battery management system to protect them from overloading and causing lasting damage to the cells, as well as highlighting faults and issues through the handlebar display.</p>\n<p>The remotes and displays for the system are available in a few size and function options, and are all interchangeable.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"E-bike showcasing new Pinion E-Drive motor gearbox unit and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Pinion says multiple display and remote options will be available.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>The brand claims you should be able to speak to your chosen retailer to find the right option for you.</p>\n<p>Regardless of the specification, all of the remote’s buttons are backlit and provide haptic vibration feedback that rises in intensity with the bike’s speed.</p>\n<p>The system can be connected to Pinion’s FIT-E Control App to help plan or show routes via <a href=\"https://www.bikeradar.com/advice/buyers-guides/guide-to-using-komoot/\">Komoot</a>. All information can be displayed regardless of the chosen display option, because it is adjusted to the screen’s size.</p>\n<p>There’s also a version of the remote that features an integrated display if you want a cleaner-looking cockpit with the controls and display within easy reach of your grips.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Simplon e-mountain bike showcasing new Pinion E-Drive motor gearbox unit, remote controller with display and wireless shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> The remote with integrated display is certainly neat, but may not have all the functionality of the separate versions.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>However, we don’t know if this all-in-one remote and display option has all the functionality of the separate remote and display variants.</p>\n<h3>Bike partnerships</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Male Cyclist riding Simplon e-bike showing casing new Pinion E-Drive Motor Gearbox Unit and Wireless Shifting\" title=\"Pinion E-Drive Launch\" /></div><div><figcaption><span><i></i> Simplon is one of the brands launching bikes equipped with the E-Drive system, along with Rotwild and Flyer.</span></figcaption><span> <i>Pinion</i></span></div>\n<p>Pinion has partnered with Simplon, Rotwild and Flyer to introduce the E-Drive system.</p>\n<p>Simplon and Rotwild will be introducing full-suspension e-MTBs equipped with the Performance variant, while Flyer will have a host of city and touring bikes kitted out with the Comfort version.</p>\n<p>The new system is also rated for cargo bike use and there will be load-lugging bikes sporting E-Drive coming soon.</p>\n<p>If you want to experience the E-Drive system, these bikes are likely to be the only way to do it; Pinion hasn’t confirmed this, but it’s highly unlikely you’ll be able to swap your Bosch, Shimano or other brands of motor out for E-Drive.</p>\n<h3>Why should I want a gearbox?</h3>\n<p>Gearboxes are often a divisive subject thanks to their drag and shifting performance, so could Pinion’s E-Drive be the future of electric bike technology and convince more people to ditch traditional derailleurs?</p>\n<p>After all, while Pinion has been making its bicycle gearboxes for more than a decade and they are popular with riders who want a reliable, basically maintenance-free drivetrain, they haven’t really managed to crack the mainstream, where derailleurs still rule the roost.</p>\n<p>The Increased drag is the primary problem with gearboxes for bikes.</p>\n<p>Back in their Porsche days, the engineers at Pinion had powerful engines to overcome the drag in their cars’ gearboxes.</p>\n<p>That drag is more of a problem on a bicycle, where the power of a rider is a lot lower, and the difference between a gearbox and a derailleur drivetrain can really be felt through the pedals.</p>\n<p>Unlike a car, bikes also don’t have clutches, so the shifting of Pinion’s older gearboxes relied on you easing off the pedals in order to shift smoothly, because the gearbox cogs cannot change under high loads.</p>\n<p>Not only that, but as we’ve mentioned, for most of its gearboxes Pinion has relied on a twist-grip style shifter to pull the cable back and forth to change gear. This is arguably not as good a solution as a trigger-style shifter.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The Pinion gearbox is controlled using a twist grip style shifter.\" title=\"Desiknio X20 Brighton-1150\" /></div><div><figcaption><span><i></i> Pinion’s grip shifter is not that easy or intuitive to use, so the new Smart.Shift TE1 wireless shifter should be an improvement.</span></figcaption><span> <i>Deskinio</i></span></div>\n<p>There’s also an issue of the frame having to be designed around the gearbox, meaning it’s more restrictive than a frame built for traditional derailleurs.</p>\n<p>If you want to use a Pinion gearbox, it’s highly likely you’re not going to be able to change it for anything else and you’ll be tied into one brand and one drivetrain configuration.</p>\n<p>With Pinion adding an electric bike motor to help mitigate the drag penalty of existing gearboxes and wireless shifting with a more ergonomic trigger shifter into E-Drive, two of those issues are erased… in theory.</p>\n<p>We haven’t had a chance to test the system yet, but we’re hoping to swing a leg over a bike equipped with E-Drive in the coming weeks, so stay tuned for our first ride impressions when we have them.</p>","author":"Tom Law","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ba750e8721db8cefe8284e51d7fd6ff5e2994bf312144dda381959525295f50d","category":"Cycling"}