{"title":"Trusted platform module security defeated in 30 minutes, no soldering required","link":"https://arstechnica.com/?p=1784665","date":1627997563000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/burning-laptop-800x534.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/burning-laptop.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Let’s say you’re a large company that has just shipped an employee a brand-new replacement laptop. And let’s say it comes preconfigured to use all the latest best security practices, including full-disk encryption using a trusted platform module, password-protected BIOS settings, UEFI SecureBoot, and virtually all other recommendations from the <a href=\"https://media.defense.gov/2020/Sep/15/2002497594/-1/-1/0/CTR-UEFI-SECURE-BOOT-CUSTOMIZATION-20200915.PDF/CTR-UEFI-SECURE-BOOT-CUSTOMIZATION-20200915.PDF\">National Security Agency</a> and <a href=\"https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-147.pdf\">NIST</a> for locking down federal computer systems. And let’s say an attacker manages to intercept the machine. Can the attacker use it to hack your network?</p>\n<p>Research published last week shows the answer is a resounding yes. Not only that, but a hacker who has done her homework needs a surprisingly short stretch of time alone with the machine to carry out the attack. With that, the hacker can gain the ability to write not only to the stolen laptop, but to the fortified network it was configured to connect to.</p>\n<p>Researchers at the security consultancy Dolos Group, hired to test the security of one client’s network, received a new Lenovo computer preconfigured to use the standard security stack for the organization. They received no test credentials, configuration details, or other information about the machine. An analysis of the BIOS settings, boot operation, and hardware quickly revealed that the security measures in place were going to preclude the usual hacks, including:</p></div><p><a href=\"https://arstechnica.com/?p=1784665#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784665&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ba7e277f2182016316a349ce690793eda55d7578b9e52cac6064674af42bd691","category":"Tech"}