{"title":"Road vs gravel: What pedal to use and why","link":"https://www.cyclingtips.com/2023/03/road-vs-gravel-what-pedal-to-use-and-why/","date":1678743951000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/pedals-TOZ03901.jpg?width=1200\" alt=\"Road vs gravel: What pedal to use and why\" /></figure><p>We are all guilty of being stubborn and set in our ways, but using the correct type of pedal is more important than many realize. Sure, we all have a pair of cycling shoes that just fit and feel better than the rest, so we default to them and their partnering pedal style. However, properly choosing between a road pedal and shoe combo vs. the gravel/ mountain style can vastly improve performance, and more importantly, safety.</p>\n<p>But where to start?</p>\n<p>When I look at a pedal, I think about how it functions mechanically—not the float or the tension or any other features, but why it was designed in a certain way. From there you can decide what’s best for how you ride.</p>\n<h2>Road Pedals</h2>\n<p>Most road-pedal systems have a triangular cleat that is placed front first into a fixed spot, and then a retention clip holds to the back, pushing forward. The cleat bottoms out on the pedal’s platform and is designed to offer a very large and stable base. More (downward) pressure (standing or sprinting) only means things are more secure.</p>\n<p>To unclip, you need to remove pressure (seated is easiest) and rotate your heel out. The amount of float in the system (how much your foot can move before the cleat disengages from the pedal, thus allowing a more natural foot position) will determine how far you need to rotate before the release starts.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505003-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The single-sided nature of road pedals also makes them less ideal when riding on unpredictable terrain. </span></figcaption></figure>\n<h2>Gravel Pedals</h2>\n<p>Most dirt-oriented clipless pedals (gravel or mountain) work completely opposite to that. The cleats are mounted with two bolts and provide far more float. The pedal has a spring closure that retains the smaller cleat. The spring also is positioned in a way that the more pressure you apply, it is opened, further reducing tension. However, the body of the pedal contacts the lugs on the sole of the shoe, this means the system relies on the shoe’s tread to press on the side of the pedal for support and to limit how far the pedal opens. Normally, this support and tension are unchanged, no matter the float position. In some cases, it may get much looser when standing or under pressure if the shoe tread doesn’t contact the pedal initially.</p>\n<p>This means when you are standing or have more pressure on the pedals (descending) that the pedals will actually be slightly easier to exit. Most dirt cleats are also designed to allow you to roll your foot to get out, something that you cannot do on a road pedal. The easiest and fastest way out of a dirt pedal is with a bit of pressure and the same heel-out motion you do on road pedals. This is where people get confused because it’s easy to assume that since both pedals use a heel-out movement to disengage that they work the same.</p>\n<p>The added pressure on the dirt pedal pushes against the retention spring, which opens it up for release; this is not the case on the road. All of this added movement in dirt pedals means you may need a lot more float, so you don’t accidentally come out when riding with a lot of body English.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/DSC_9365-1340x754.jpg?width=730\" alt width=\"1340\" height=\"754\" /></figure>\n<p>The downside to dirt pedals is that they rely on the shoe to work properly, so if your shoes are worn, it can negatively affect the experience. But really, it’s not like the negative effects of road pedals when you need to roll your foot out and it won’t, causing you to hit the ground. Potential negatives on a dirt pedal is your cleats feel too loose and/or your foot comes out too easily because the tread on the shoe is worn or there is an incorrect gap between the shoe, cleat, and pedal.</p>\n<p>Why wouldn’t you want dirt pedals on the road? Sprinting hard enough could offer enough stress to pull the cleat from the retention on the pedal. But the real reason is that dirt pedals wear the shoe slightly, and this can cause your ankle to rock. When your ankle and knee are not in alignment, there can be a significant loss of power, and pain can arise. This is amplified by high cadence, which is more common on road rides. Some dirt pedals like Crankbrothers offer off-set spacers to make up for wearing shoes or just the slight gap that some shoes have.</p>\n<p>With all that said, I personally ride <a href=\"https://www.cyclingtips.com/2022/08/review-a-year-with-wahoos-new-speedplay-pedal-range/\" target=\"_blank\">Wahoo Speedplay Zero</a> pedals on the road because of a bad knee and hip that cause my ankle to require more float on one side. The Zero pedal has an adjustable float from 0 (fixed) to 15 degrees independently. They work a bit differently and are a bit better releasing under pressure, but are terribly hard to walk in no matter the surface, and if it’s dirty, they get clogged and will be non-functioning. This is probably the last reason that dirt-oriented pedals are a better overall option if you had to choose just one style. They shed dirt and mud efficiently while being significantly easier to walk in.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/Wahoo-Speedplay-1-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The Wahoo Speedplay pedal is a dual-sided road pedal.</span></figcaption></figure>\n<h2>Risk vs. Reward</h2>\n<p>Sure, we will always see pros racing gravel with road shoes and pedal systems, but the risk of getting stuck in them during a silly off-balance mistake is much higher. While that may not seem so bad, in my experience, slow-speed crashes cause the most damage. Plus, the risk of having to walk in dirt that clogs up road cleats and means you have to manually scrape out debris is not fun at all.</p>\n<p>So for me, I keep it pretty simple and ride a road system when I know I’ll be on paved ground and am not planning on getting off my bike for anything other than a pastry. Gravel shoes and pedals are dedicated for any ride that touches the dirt, with only a few exceptions. Namely, a ride like BWR San Diego, where there is usually 100 miles of perfectly paved roads, and the dirt sections are essentially unpaved smooth roads that are still smoother than the paved roads of LA I ride normally. Sure, there are a few sections that are technical, or I might have to take a few steps in the dirt, but for the majority of my ride, I’ll be pedaling.</p>\n<p>But not everyone has the luxury of having both a road and gravel system. For riders who like to dabble in both road and gravel and might only want one system, a dirt-oriented pedal is always a better option.</p>","author":"Troy Templin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ba897148b21bdc0c5d4e7cd231924d30575ae9a8a50bb48319461425051f00b6","category":"Cycling"}