{"title":"Eye‐tracking study on the impact of ‘EU organic’ and ‘sustainable irrigation’ logos on consumer acceptance of olive oil","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13963?af=R","date":1729305246000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>This study investigates to what extent the presence of the EU organic (EU‑O) logo and a sustainable irrigation (SI) logo on extra virgin olive oil (EVOO) labels affects (i) consumers expectations and purchase intention based on label information and (ii) acceptance of olive oil when tasted under informed versus blind conditions. A panel of 94 consumers took part in the study. Attention paid to label components during the task designed to evaluate the logos’ effect on expectations was recorded by means of an eye-tracker.</p>\n<h2>Results</h2>\n<p>Compared with the control (without logos), the presence of EU‑O and SI logos on the EVOO label significantly influenced participants' associations (i.e. price, sustainability, consumption occasions, etc.). A halo effect was detected, so that both logos led consumers to anticipate higher expected liking compared with the control. A synergic effect between both logos was detected. Eye-tracker data revealed that participants whose liking expectations were improved by the EU‑O logo paid more attention to it than those whose expectations did not improve. This relation between attention and expectation improvement was not observed with the SI logo, likely because participants were unfamiliar with it. Beyond expectations, the presence of logos on labels significantly increased the liking scores given by the participants when EVOOs were tasted, which resulted in a higher percentage of participants’ willingness to purchase.</p>\n<h2>Conclusion</h2>\n<p>Consumers perceived added value for the sustainable labeled food, which positively affected their liking and purchase intentions. This may encourage food production companies to adopt more sustainable practices. © 2024 Society of Chemical Industry.</p>","author":"Bárbara Delpozo, \nAna Pons‐Gómez, \nCristina Besada","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ba8f61a8cfd5a758542278011c5216dfff160774f4b3a79208dda42c0186d1ea","category":"Environment"}