{"title":"Seasonal impacts on gut microbial composition of the Eastern subterranean termite (Blattodea: Rhinotermitidae)","link":"https://academic.oup.com/ee/article/53/3/406/7638264?rss=1","date":1711843200000,"content":"<span><div>Abstract</div>Termite hindguts are inhabited by symbionts that help with numerous processes, but changes in the gut microbiome due to season can potentially impact the physiology of termites. This study investigated the impact of seasonal changes on the composition of bacteria and protozoa in the termite gut. Termites were obtained monthly from May to October 2020 at a location in the central United States that typically experiences seasonal air temperatures ranging from &lt; 0 to &gt; 30 °C. The guts of 10 termites per biological replication were dissected and frozen within 1 day after collections. DNA was extracted from the frozen gut tissues and used for termite 16S rRNA mitochondrial gene analysis and bacterial 16S rRNA gene sequence surveys. Phylogenetic analysis of termite 16S rRNA gene sequences verified that the same colony was sampled across all time points. On processing bacterial 16S sequences, we observed alpha (observed features, Pielou’s evenness, and Shannon diversity) and beta diversity (unweighted Unifrac, Bray-Curtis, and Jaccard) metrics to vary significantly across months. Based on the analysis of the composition of microbiomes with bias correction (ANCOM-BC) at the genus level, we found several significant bacterial taxa over collection months. In addition, Spearman correlation analysis demonstrated that 41 bacterial taxa were significantly correlated (positively and negatively) with average soil temperature. These results from a single termite colony suggest termite microbial communities go through seasonal changes in relative abundance related to temperature, although other seasonal effects cannot be excluded. Further investigations are required to conclusively define the consistency of microbial variation among different colonies with season.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"baaf18dca2a74c3c8c96cabc05e52e1e586a18ed472dacfdb7294ae967446680","category":"Environment"}