{"title":"Here’s what’s coming up in ‘week two’ of the Tour de France","link":"https://cyclingtips.com/2021/07/heres-whats-coming-up-in-week-two-of-the-tour-de-france/","date":1625529540000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033268-030-650x433.jpeg\" /></div><h2>Here's what's coming up in 'week two' of the Tour de France</h2><p>\n</p><p>After nine stages of racing and one rest day, the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> peloton is diving into “week two” (even if that technically started this past weekend) of the race on Tuesday. The Tour’s two high-mountain stages in the Alps are in the rearview mirror, but there are quite a few big challenges ahead, along with a few days that could provide some intrigue regardless of the number of categorized climbs on the menu.</p>\n\n\n\n<p>Although Tadej Pogačar (UAE Team Emirates) may have a firm grip on yellow right now, there’s plenty of racing to come – and plenty of other storylines to follow, too.</p>\n\n\n\n<p>Here are a few things to look forward to as the peloton gears up for its second stretch of racing in the 2021 Tour …</p>\n\n\n\n<h3>Mark Cavendish will have his chances to break a longstanding record.</h3>\n\n\n\n<p>As improbable as it may have seemed only a month ago, Mark Cavendish (Deceuninck-QuickStep) is now just two wins away from Eddy Merckx’s all-time record of 34 career Tour de France stage wins – and there’s a very real possibility that the 36-year-old Manxman will match or maybe even surpass that record in the coming days.</p>\n\n\n\n<p>He’ll have an opportunity coming out of the rest day, as Tuesday’s stage 10 features only one categorized climb that comes in the early goings. Stages 12 and 13 could also come down to bunch kicks, and assuming they do, Cavendish will have golden opportunities to add to his win total. As if his form and lead-out weren’t enough, Cavendish is also going up against a seriously depleted field, as both Tim Merlier (Alpecin-Fenix) and Arnaud Démare (Groupama-FDJ) abandoned the race over the weekend.</p>\n\n\n\n<p>Beyond his hunt for the record, Cavendish will also have opportunities to pick up points in the green jersey battle. He has a commanding lead right now, but he’ll need to keep winning sprints to stave off the more versatile fast finishers like Peter Sagan (Bora-Hansgrohe), Michael Matthews (BikeExchange), and Sonny Colbrelli (Bahrain Victorious).</p>\n\n\n\n<figure><img /><figcaption>More of this in the coming days?</figcaption></figure>\n\n\n\n<h3>Two trips up Mont Ventoux.</h3>\n\n\n\n<p>Sandwiched between the flatter stages 10 and 12 is a day that could be a highlight of this Tour de France. Stage 11 will take riders over Mont Ventoux. Twice.</p>\n\n\n\n<p>It’s an interesting parcours that features two early Cat 4 climbs and then the Cat 1 Col de la Liguière as an appetizer for the first trip up Mont Ventoux, which will be undertaken from the rarely used Sault side of the Giant of Provence.</p>\n\n\n\n<p>After a steep descent, riders will then go up the more familiar route from Bédoin. Instead of finishing atop the climb, however, stage 11 concludes after the descent, meaning that any rider who goes over the top with the lead will have to hold it through the downhill run into Malaucène.</p>\n\n\n\n<p>The battle for the stage will be fierce, and it will be a critical day for the general classification as well. A bad day could prove ruinous on this kind of profile.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h3>Chaos in the crosswinds?</h3>\n\n\n\n<p>Considering just how strong Pogačar is on the climbs and against the clock, the rest of the yellow jersey hopefuls in this race will be on the alert for opportunities away from the high mountains and the TTs to take time on the defending champion. The next few stages of the Tour could (maybe) provide those opportunities.</p>\n\n\n\n<p>There is some wind in the forecast for Tuesday’s stage 10 into Valence and Thursday’s stage 12 into Nîmes, and as Christian Prudhomme points out in the roadbook, the walled city of Carcassone (where stage 13 finishes) has yet to host a bunch sprint at the Tour, even though the profile looks friendly for the fast finishers.</p>\n\n\n\n<p>No, we’re not expecting anything quite as dramatic as the gale force winds along the North Sea that the Classics often feature, but there is a real chance of crosswinds at some point as the Tour makes its way towards the Pyrenees.</p>\n\n\n\n<figure><img /><figcaption>Echelons!</figcaption></figure>\n\n\n\n<h3>The KOM battle will heat up.</h3>\n\n\n\n<p>Speaking of mountains, we saw the opening salvo in the battle for polka dots over this past weekend, and the stages to come will offer those targeting that classification more opportunities to rack up the points. And considering how strong Pogačar’s lead in the general classification already is, it could be that the fight for the polka dot jersey offers at least as much intrigue in the days ahead.</p>\n\n\n\n<p>Stage 11 will be an obvious battleground for the likes of Nairo Quintana (Arkéa-Samsic), Mike Woods (Israel Start-Up Nation), Wout Poels (Bahrain Victorious), Ben O’Connor (AG2R Citroën), Sergio Higuita (EF Education-Nippo), and anyone else hunting mountains points after amassing a good foundation in the Alps. Stage 14 will be another golden opportunity: There are five categorized climbs on the menu (all Cat 2s or Cat 3s) and the profile favors the chances of the break, so the fight to get up the road should be fierce.</p>\n\n\n\n<p>Those hunting polka dots may have to make some tough decisions about where to expend energy, however, as the very next day will feature plenty more opportunities to nab points as the peloton rides into Andorra.</p>\n\n\n\n<figure><img /><figcaption>Nairo Quintana currently leads the KOM competition.</figcaption></figure>\n\n\n\n<h3>Altitude in Andorra.</h3>\n\n\n\n<p>The second stretch of racing at the 2021 Tour de France will conclude with a day that will take the pack to the highest point in this year’s edition of the event. Stage 15 will start in Céret at 187 meters above sea level and then head into the Pyrenees.</p>\n\n\n\n<p>Riders will tackle the Cat 1 Montée de Mont-Louis and the Cat 2 Col de Puymorens on their way into Andorra and the top of this year’s highest climb, the <a href=\"https://cyclingtips.com/2021/06/the-highest-climb-of-the-2021-tour-de-france-is-a-monster/\" target=\"_blank\">Port d’Envalira</a>, at 2,408 meters. They’ll still have one more Cat 1, the Col de Beixales, to ascend after that, before descending to the finish in Andorre-La-Vieille.</p>\n\n\n\n<p>The climbs themselves won’t be the steepest challenges that riders will face in the race, but that elevation could have a real impact. The Cima Coppi at this year’s Giro d’Italia, the Passo Giau, was the setting for an emphatic attack by eventual race winner Egan Bernal (Ineos Grenadiers), and the Tour’s Souvenir Henri Desgrange will be awarded to the first rider over a climb that is nearly 200 meters higher. It should be a great way to close out the “second week” of the Tour ahead of the final rest day.</p>\n\n\n\n<figure><img /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/07/heres-whats-coming-up-in-week-two-of-the-tour-de-france/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bab4c165a44e2df1275b4edc60ce53fd460469bb1be8ade7bcb335336814eb15","category":"Cycling"}