{"title":"La Vuelta a España 2021 Stage 11 Preview - A Gruelling Finale","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-11-preview-a-gruelling-finale","date":1629739519000,"content":"\n      <p><span>With the exception of time-trials, s</span><span>tage 11 is the shortest stage at the 2021 Vuelta a España. We can expect</span><span> explosive racing throughout, with over 2,600 metres of climbing and hardly a kilometre of flat terrain </span><span>in sight.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-11_1024x1024.png?v=1629729508\" />Stage 11 profile</span></i></p>\n<p><span>The riders depart from Antequera, which made its <span>Vuelta a España </span>debut in 2013. The stage kicked-off stage 9, which was won by Daniel Moreno in</span><span> Valdepeñas de Jaén, where stage 11 will conclude this year.</span><span> Although the stage starts and ends in the same locations, this year, the </span><span>stage is 30km shorter than in 2013. At just 133km, this will be a fiery affair. </span></p>\n<p><span>Undulating terrain defines the initial kilometres. Many riders will be eager to join the breakaway, so the battle to join the group will be manic. Although there are no categorised climbs in the first 120km, this phase of the race is filled with short hills and some ascents which are over 5km in length.</span></p>\n<p><span>The Puerto de Locubin begins with just under 17km remaining — the second category climb is 8.8km in length and averages 5%. Bonus seconds are handed to the first three riders to crest the climb, which could encourage attacks from GC riders.</span></p>\n<p><span>The riders then descend for around 5km,</span><span> before the road begins to rise on the way into <span>Valdepeñas de Jaén.</span></span><span> </span>The final kilometre features absurd percentages — the gradient is in excess of 20% in places. <span>Igor Antón,<span> </span></span><span>Joaquim Rodríguez</span><span> and the aforementioned </span><span>Daniel Moreno have all won on the wall of </span><span>Valdepeñas de Jaén previously, which illustrates the qualities the stage winner must possess.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1335272932-min_1024x1024.jpg?v=1629729594\" />Andreas Kron (Image credit: Stuart Franklin/Getty Images)</span></i></p>\n<p><strong>Primož Roglič </strong><span>continues in the red jersey, and although he is be the heavy favourite from the GC group, Jumbo-Visma may find it difficult to control a large breakaway on such a short, explosive stage. This tips the balance in favour of the breakaway.</span></p>\n<p><span>Without a GC contender, Deceuninck-Quick Step are free to do what they do best: stage hunting. Fabio Jakobsen has already recorded two stage victories, which relinquishes the pressure from his team-mates. <strong>Andrea Bagioli</strong> was a close third on stage 6, which also finished on a steep climb. The 22-year-old is constantly proving that he is one of the best young puncheurs in the world.</span><span> <strong>Mauri Vansevenant</strong> is another good option for Deceuninck.</span></p>\n<p><span>Lotto Soudal are another team free from general classification concerns. Leading their stage hunting squad is <strong>Andreas Kron.</strong> Although the Dane is competing in his first Grand Tour, he has great pedigree with two victories at WorldTour level already. The 23-year-old </span><span>reconned</span><span> the stage in July as per <a href=\"https://www.strava.com/activities/5621914435#2850086091236212670\" target=\"_blank\">his strava</a>, so he may have this one earmarked. Aside from Kron, <strong>Harm Vanhoucke</strong> and <strong>Maxim Van Gils</strong> are good options for Lotto Soudal.</span></p>\n<p><span>Astana-Premier Tech will lose GC leader <span>Alex Vlasov to Bora-Hansgrohe from 2022. However, the Russian</span></span><span> has fallen outside the top ten after he finished 15th on the Alto de Velefique, so his team-mates must be given more freedom to go stage hunting. The steep finale suits <strong>Omar Fraile, Alex Aranburu, Ion Izagirre </strong>and <strong>Gorka Izagirre.</strong></span></p>\n<p><span><strong>Odd Christian Eiking</strong> has never finished in the top ten at a Grand Tour – which is odd – but the Norwegian possesses </span><span>the ability to challenge here. Eiking was a close second at the Arctic Race of Norway prior to the Vuelta, which backed up a fine top ten finish at the Donostia San Sebastian Klasikoa.</span></p>\n<p><span>Team DSM won stage 7 from the breakaway after stuffing the group with five riders. <strong>Michael Storer</strong> was the strongest that day, defeating Carlos Verona and Pavel Sivakov on the Balcón de Alicante. He could be a contender again, though the punchy finish may better suit <strong>Romain Bardet</strong>.</span></p>\n<p><span><span><strong>Max Schachmann</strong> was one of the unfortunate riders to crash on stage 2, and he hasn’t finished a stage better than 65th since. If his form improves in the second week, he has a chance in Valdepeñas de Jaén. The German champion is a great puncher — he has finished on the podium at the Amstel Gold Race, </span></span>Strade Bianche and Liège-Bastogne-Liège.</p>\n<p><span>Other riders to keep an eye on from the breakaway include</span><b> Wout Poels, Rudy Molard, Tobias Bayer</b><span> and </span><b>Clément Champoussin</b><span>.</span></p>\n<p><i><span>Cover image: Charly López / ASO</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"bab90451fd34e7091d8503cce44d15bdbb0c0669477008f54dfc2c03cf6fca42","category":"Cycling"}