{"title":"The Mechanistic Link Between Tau-Driven Proteotoxic Stress and Cellular Senescence in Alzheimer&rsquo;s Disease","link":"https://www.preprints.org/manuscript/202410.0983/v1","date":1728897974000,"content":"In Alzheimer’s disease (AD), tau dissociates from microtubules (MTs) due to hyperphosphorylation and misfolded. It is degraded by various mechanisms, including the 20S proteasome, chaperone-mediated autophagy (CMA), 26S proteasome, macroautophagy, and aggrephagy. Neurofibrillary tangles (NFTs) form upon impairment of aggrephagy, and eventually, the ubiquitin chaperone valosin-containing protein (VCP) and heat shock 70 kDa protein (HSP70) are recruited to the sites of NFTs for extraction of tau for the ubiquitin-proteasome system (UPS)-mediated degradation. However, impairment of tau degradation in neurons allows tau to be secreted into the extracellular space. Secreted tau can be monomers, oligomers, and paired helical filaments (PHFs), which are seeding competent pathological tau that can be endocytosed/phagocytosed by healthy neurons, microglia, astrocytes, oligodendrocyte progenitor cells (OPCs) and oligodendrocytes, often causing proteotoxic stress, and eventually triggers senescence. Senescent cells secrete various senescence-associated secretory phenotype (SASP) factors, which trigger cellular atrophy, causing decreased brain volume in human AD. However, the molecular mechanisms of proteotoxic stress and cellular senescence are not entirely understood and are an emerging area of research. Therefore, this comprehensive review summarizes pertinent studies that provided evidence for the sequential tau degradation, failure, and the mechanistic link between tau-driven proteotoxic stress and cellular senescence in AD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"babc08370ffc9864ef82311d9a845b117893636f43ece66ba4490d7ff8fd1682","category":"Interdisciplinary"}