{"title":"[ไม่ยืนยัน] ชิป-หายแค่ไหน? Apple ต้องลดอัตราผลิต iPad เพื่อโยกชิ้นส่วนไปให้ iPhone 13","link":"https://www.blognone.com/node/125655","date":1635937410000,"content":"<div><div><div><p>ดูท่าทางวิกฤตชิปขาดแคลนครั้งนี้จะส่งผลกระทบกับ Apple หนักกว่าที่คิด หลังก่อนหน้านี้มีข่าวไม่ยืนยันจาก Bloomberg ช่วงเดือนตุลาคม ระบุว่า Apple ต้อง<a href=\"https://www.blognone.com/node/125248\">สั่งลดการผลิต iPhone 13 ลงถึง 10 ล้านเครื่อง</a></p>\n<p>ล่าสุดแหล่งข่าวไม่เปิดเผยตัวตนระบุกับ Nikkei Asia ว่า Apple ต้องลดอัตราการผลิตอุปกรณ์ตระกูล iPad ลง แล้วโยกชิ้นส่วนบางชิ้นที่ใช้ร่วมกันได้ เช่นชิปต่างๆ ไปเน้นผลิตโทรศัพท์ตระกูล iPhone 13 แทน</p>\n<p>แหล่งข่าวระบุว่าการปรับการผลิตครั้งนี้ ทำให้อัตราการผลิต iPad สองเดือนที่ผ่านมา (กันยายน-ตุลาคม) ต่ำกว่าแผนที่ Apple คาดไว้ถึง 50% และสาเหตุการเลือกปรับการผลิตครั้งนี้ เป็นเพราะ Apple คาดการณ์ว่า iPhone 13 จะมีความต้องการซื้อสูงกว่า iPad หลังยุโรปเริ่มฟื้นตัวจากการระบาดของโรคโควิด</p>\n<p>Luca Maestri ซีเอฟโอของ Apple ระบุในการประชุมผู้ถือหุ้นเช่นกันว่ารายได้จาก iPad ในช่วงเดือนตุลาคมถึงธันวาคมน่าจะลดลงเนื่องจากการขาดแคลนชิ้นส่วน ส่วน Tim Cook เองก็ระบุว่ารายได้ไตรมาสเดือนกรกฎาคมถึงตุลาคมของ iPad น้อยกว่าที่คาดถึง 6 พันล้านดอลลาร์ และคาดว่าอาจจะน้อยลงอีกในไตรมาสปัจจุบัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ccff9b09a98feeef3b57aee6fba4b27a.jpg\" /></p>\n<p>แม้ iPad จะยังมีความต้องการซื้ออยู่เป็นจำนวนมาก และ Nikkei Asia ก็อ้างอิงข้อมูลจาก IDC ว่ายอดส่งมอบของ 9 เดือนแรกในปีนี้ สูงถึง 40.3 ล้านเครื่อง เพิ่มขึ้นถึง 17.83% จากช่วงเดียวกันในปีก่อน การลดการผลิตลง อาจทำให้ผู้ใช้ต้องรอจัดส่งเครื่องนานขึ้น</p>\n<p>แต่ Brady Wang นักวิเคราะห์ด้านเทคจาก Counterpoint Research ก็ระบุว่าที่ Apple เลือกโฟกัส iPhone 13 นั้น เป็นเพราะ Apple ครองตลาดแท็บเล็ตอยู่แล้ว คนที่จะซื้อ iPad มักจะไม่เปลี่ยนใจไปซื้อแท็บเล็ตแอนดรอยด์ง่ายๆ แต่ผู้ที่ต้องการซื้อ iPhone 13 อาจเปลี่ยนใจไปซื้อมือถือแอนดรอยด์ได้ง่ายกว่า หากต้องรอเครื่องนาน</p>\n<p>ที่มา - <a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Apple-trims-iPad-production-to-feed-chips-to-iPhone-13\">Nikkei Asia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone-13\">iPhone 13</a></div><div><a href=\"/topics/ipad\">iPad</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"babd604e8e6423bca68c00fc9aebe6e3548bc0a653b79bbc81b1b33f266e3c56","category":"Thai"}