{"title":"Characteristics of a transgender and gender-diverse patient population in Utah: Use of electronic health records to advance clinical and health equity research","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302895","date":1715090400000,"content":"<p>by Tiffany F. Ho, Brian Zenger, Bayarmaa Mark, Laurel Hiatt, Erika Sullivan, Benjamin A. Steinberg, Ann Lyons, Adam M. Spivak, Cori Agarwal, Marisa Adelman, James Hotaling, Bernadette Kiraly, Sharon Talboys</p>\r\n\r\nTransgender and gender-diverse (TGD) people, individuals whose gender identity differs from their sex assigned at birth, face unique challenges in accessing gender-affirming care and often experience disparities in a variety of health outcomes. Clinical research on TGD health is limited by a lack of standardization on how to best identify these individuals. The objective of this retrospective cohort analysis was to accurately identify and describe TGD adults and their use of gender-affirming care from 2003–2023 in a healthcare system in Utah, United States. International Classification of Disease (ICD)-9 and 10 codes and surgical procedure codes, along with sexual orientation and gender identity data were used to develop a dataset of 4,587 TGD adults. During this time frame, 2,985 adults received gender-affirming hormone therapy (GAHT) and/or gender-affirming surgery (GAS) within one healthcare system. There was no significant difference in race or ethnicity between TGD adults who received GAHT and/or GAS compared to TGD adults who did not receive such care. TGD adults who received GAHT and/or GAS were more likely to have commercial insurance coverage, and adults from rural communities were underrepresented. Patients seeking estradiol-based GAHT tended to be older than those seeking testosterone-based GAHT. The first GAS occurred in 2013, and uptake of GAS have doubled since 2018. This study provides a methodology to identify and examine TGD patients in other health systems and offers insights into emerging trends and access to gender-affirming care.","author":"Tiffany F. Ho","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"babd192dd77c0286d43fdb3d6a8fc645c6d86fce425bbdf0dfe1783c085588d6","category":"Interdisciplinary"}