{"title":"Less experienced observers assess piglet castration-induced acute pain differently than experienced observers: A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309684","date":1725458400000,"content":"<p>by Gustavo Venâncio da Silva, Magdiel Lopez-Soriano, Monique Danielle Pairis-Garcia, Pedro Henrique Esteves Trindade</p>\r\n\r\nBehavioral pain scales have been helpful for standardized swine pain assessment. However, it is still unknown if observers’ experience influences the scale score. We conducted a pilot study to investigate how three different levels of swine experience influenced how observers scored castration pain in piglets using Unesp-Botucatu Pig Composite Acute Pain Scale (UPAPS). We used a database from UPAPS scores from pigs undergoing surgical castration in a previous study. Scores were attributed by six observers with Little to no experience (n = 2), Some experience (n = 2) and Extensive experience (n = 2). Reliability was estimated using the intraclass correlation coefficient, agreement was investigated by Bland-Altman analysis, predictive capacity was estimated using the area under the curve (AUC), and statistical differences were tested using a regression model. We found that intra-experience levels reliability were satisfactory (Little to no: 0.72, Some: 0.81, Extensive: 0.84), but inter-experience reliability was lower (0.42). Little to no experience observers had poor agreement with other observers, with a bias toward underscoring UPAPS (bias of 0.94 vs. Some, 1.17 vs. Extensive). Predictive capacity was similar between all observers (AUC, Little to no: 71.94%, Some: 76.10%, Extensive: 79.09%, p &gt; 0.05). Regression model confirmed underscoring of Little to no experience observers (mean ± standard error; Little to no: 1.09 ± 0.14; Some: 2.02 ± 0.23; Extensive: 2.25 ± 0.22; p &lt; 0.05). We concluded that minimal experience, as Some experience observers have in the swine industry, is sufficient for them to score UPAPS in a similar way than more experienced observers. The present pilot study supports the enhancement and implementation of UPAPS on farm and laboratory settings by minimally qualified observers, improving swine welfare in the short and long term.","author":"Gustavo Venâncio da Silva","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"babefbd8d5793026c0baf0a2450a86cf6b0bbc22aa35030756c262da989ece8e","category":"Interdisciplinary"}