{"title":"Announcing HashiCorp Boundary 0.4","link":"https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-4","date":1625155200000,"content":"<p>From the beginning, HashiCorp Boundary has promised to streamline access management. Since <a href=\"https://www.hashicorp.com/blog/hashicorp-boundary\">Boundary’s launch</a> eight months ago, we have openly discussed integration with HashiCorp Vault as a primary focus of our immediate road map. Today, we are thrilled to announce Boundary 0.4, which adds a Vault integration for the brokering of Vault secrets to Boundary clients (both command line and desktop clients) for use in Boundary sessions.</p><img src=\"https://www.datocms-assets.com/2885/1625010318-3.png\" /><p><em>Screenshot: Boundary target connection details.</em></p>\n<p>Brokering of Vault secrets is the foundation of Boundary’s larger credential-management story for seamless single sign-on to infrastructure targets. This feature involved the development of new <a href=\"https://www.boundaryproject.io/docs/concepts/domain-model/credentials\">Boundary resources</a> to support binding credentials with user sessions, as well as surfacing those credentials during session initialization on the command line and in <a href=\"https://www.boundaryproject.io/docs/api-clients/desktop\">Boundary Desktop</a>.</p><img src=\"https://www.datocms-assets.com/2885/1625010346-screen-shot-2020-09-21-at-3-42-20-pm.png\" /><p>Users can configure <a href=\"https://boundaryproject.io/docs/concepts/domain-model/credential-libraries\">Vault credential libraries</a> and <a href=\"https://boundaryproject.io/docs/concepts/domain-model/credential-stores\">Vault credential stores</a> through our <a href=\"https://registry.terraform.io/providers/hashicorp/boundary/latest/docs\">Terraform Provider</a> and command-line interface, and we will be shipping the ability to do this through our administrative console soon. Along with having the ability to receive the credential for a given session through the desktop client, we have made a seamless integration with the <code>psql</code> command line wrapper during connect which will automatically inject credentials into a session on the command line when connecting with the postgres wrapper via <code>boundary connect postgres</code>.</p>\n<p>To get started with this using Boundary sessions, please check out this <a href=\"https://learn.hashicorp.com/tutorials/boundary/vault-cred-brokering-quickstart\">HashiCorp Learn tutorial</a>.</p>\n<h2><a href=\"#session-cleanup-enhancements\">»</a><a></a>Session Cleanup Enhancements</h2>\n<p>We are also working to tighten the behavior of how sessions are handled during periods of degraded performance.</p>\n<p>Consider a scenario in which a worker loses its connection to the controller, or vice versa. In these events, vital communication regarding the validity of a session is lost, and as such, we cannot know if a connection should reasonably continue. Following the principle of least privilege, it behooves Boundary to ensure that such connections cannot continue in the absence of that data.</p>\n<p>These enhancements are being introduced, starting in Boundary 0.4, with logic on the worker side to shut down all connections in the event of a failure to contact the controller after a short period of time. Additional enhancements will be coming in 0.4's minor releases, including controller-side logic to mirror the worker enhancements, synchronization of connection expiry times to the database, and additional behavior on shutdown to not only ensure the connections themselves are closed, but that the state of the connections is correctly cleaned up.</p>\n<h2><a href=\"#upgrade-details\">»</a><a></a>Upgrade Details</h2>\n<p>Boundary 0.4 introduces significant new functionality. Please review Boundary’s <a href=\"https://learn.hashicorp.com/tutorials/boundary/upgrade-version\">general upgrade guide</a> and <a href=\"https://www.boundaryproject.io/docs/releases/release-notes\">release notes</a> for details.</p>\n<p>As always, we recommend upgrading and testing this release in an isolated environment. If you experience any issues, please report them on the<a href=\"https://github.com/hashicorp/boundary/issues/new/choose\"> Boundary GitHub issue tracker</a> or post to the <a href=\"https://discuss.hashicorp.com/c/boundary/50\">Boundary discussion forum</a>. As a reminder, if you believe you have found a security issue in Boundary, please responsibly disclose it by emailing <a href=\"mailto:security@hashicorp.com\">security@hashicorp.com</a> — do not use the public issue tracker. Our security policy and our PGP key can be found on the <a href=\"https://www.hashicorp.com/security\">HashiCorp security page</a>.</p>\n<p>We hope you enjoy Boundary 0.4!</p>","author":"Boundary Team","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"bac00f10f721b3ac066773d5f9f1d29fdc840f9717b50772264935682c46e673","category":"Tech"}