{"title":"Study on the mechanism of the diversion of flow and sediment in the complex Estuarine River network","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4247?af=R","date":1715076409000,"content":"<h2>Abstract</h2>\n<p>The anomalous variation in the diversion of flow and sediment at the major bifurcation nodes of the Pearl River network in recent years has been generally recognised and accepted, yet the underlying mechanisms have not been revealed. In this study, a large-scale two-dimensional flow-sediment numerical model of the Pearl River estuary was constructed using the TELEMAC-MASCARET modelling system. Additionally, synchronous field surveys from the dry season of 2016 and wet season of 2017 were used to validate the model. The complex branches system of the Pearl River network was generalised. The theoretical models for calculating the water diversion ratio (WDR) of complex estuarine river networks were proposed. The WDR at each river network node is related to Manning's roughness coefficient, the average cross-sectional water depth, the water surface slope, the length of the branches and the average cross-sectional area from the river network nodes to the main estuary outlets. Specifically, the average cross-sectional water depth is the main driver of the formation of the WDRs at the nodes in the Pearl River network. The sediment SDRs at the primary and secondary lateral branching nodes are significantly higher than the WDRs in the dry season, which explains the uneven distribution of flow and sediment. Sediment mining and reclamation are the main factors that have affected the variation in flow and SDRs in the Pearl River network over recent decades.</p>","author":"Haoyan Dong, \nZixiao He, \nLiangwen Jia","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"bac1cb891807695e3ab3f2888cd9af0c66d0d7b178eba968859f8342c83e5ddb","category":"Environment"}