{"title":"A Review of Intelligent Condition Monitoring of Rolling Element Bearings","link":"https://www.preprints.org/manuscript/202406.0016/v1","date":1717462394000,"content":"Bearing component damage contributes significantly to rotating machinery failures. It is vital for the rotor-bearing system to be in good condition to ensure proper functioning of the machine. Over recent decades, extensive research has been devoted to the condition monitoring of rotational machinery, with a particular focus on bearing health. This paper provides a comprehensive literature review of recent advancements in intelligent condition monitoring technologies for rolling element bearings. Fundamental monitoring strategies are introduced, covering various sensing, signal processing, and feature extraction techniques for detecting defects in rolling element bearings. While vibration-based monitoring remains prevalent, alternative sensor types are also explored, offering complementary diagnostic capabilities or detecting different defect types compared to accelerometers alone. Signal processing and feature extraction techniques, including time domain, frequency domain, and time-frequency domain analysis, are discussed for their ability to provide diverse perspectives for signal representation, revealing unique insights relevant to condition monitoring. Special attention is given to information fusion methodologies and the application of intelligent algorithms. Multisensor systems, whether homogeneous or heterogeneous, integrated with information fusion techniques, hold promise in enhancing accuracy and reliability by overcoming limitations associated with single sensor monitoring. Furthermore, the adoption of AI techniques, such as machine learning and metaheuristic optimisation, has led to significant advancements in condition monitoring, yielding successful outcomes in various studies. Finally, avenues for further advancements to improve monitoring accuracy and reliability are identified, offering insights into future research directions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bac16faf2356c489b1dd08b94635424a38759ef46c33fba445952a89556ce66a","category":"Interdisciplinary"}