{"title":"Apple just issued a major security warning for a decade of Macs, iPads, and iPhones","link":"https://www.macworld.com/article/1781328/security-warning-decade-macs-ipads-and-iphones.html","date":1681211700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you own an Apple device, there’s likely a very important security update waiting for it. After issuing <a href=\"https://www.macworld.com/article/1780577/ios-16-4-1-bug-fixes-security-updates.html\">iOS 16.4.1</a>, iPadOS 16.4.1, <a href=\"https://www.macworld.com/article/1780591/macos-ventura-13-3-1-bug-fixes-security-updates.html\">macOS 13.3.1</a>, and Safari 16.4.1 on Friday, Apple pushed iOS 15.7.5 and iPadOS 15.7.5 and <a href=\"https://www.macworld.com/article/1781132/apple-releases-macos-big-sur-11-7-6-and-monterey-12-6-5-with-critical-security-updates.html\">macOS Big Sur 11.7.6 and Monterey 12.6.5</a> to older devices to patch two actively exploited security flaws.</p>\n\n\n\n<p>In all, Macs going back to 2013, iPhones to 2015, and iPads to 2014 have all been patched within days of each other, underscoring the urgency of the patches. Apple usually waits to update older operating systems until the next full version arrives, which would have been <a href=\"https://www.macworld.com/article/1674501/ios-16-5-beta-features-release-install.html\">iOS 16.5</a> and <a href=\"https://www.macworld.com/article/1674563/macos-ventura-13-4-beta-features-release-how-to-install.html\">macOS 13.4</a>, presumably arriving in early May. The iOS 15.7.5 update addresses the iPhone 6s and 7, while the Big Sur and Monterey updates add MacBooks from 2013 and 2014 and iMacs from 2014.</p>\n\n\n\n<p>The patches fix the same two security issues across all devices. Apple says both “may have been actively exploited” and could allow a hacker to “execute arbitrary code” on your device:</p>\n\n\n\n<p><strong>IOSurfaceAccelerator</strong></p>\n\n\n\n<ul><li><strong>Impact: </strong>An app may be able to execute arbitrary code with kernel privileges. Apple is aware of a report that this issue may have been actively exploited.</li><li><strong>Description: A</strong>n out-of-bounds write issue was addressed with improved input validation.</li><li><strong>CVE-2023-28206: </strong>Clément Lecigne of Google’s Threat Analysis Group and Donncha Ó Cearbhaill of Amnesty International’s Security Lab</li></ul>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul><li><strong>Impact: </strong>Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.</li><li><strong>Description: </strong>A use after free issue was addressed with improved memory management.</li><li><strong>WebKit Bugzilla:</strong> 254797<strong><br />CVE-2023-28205: </strong>Clément Lecigne of Google’s Threat Analysis Group and Donncha Ó Cearbhaill of Amnesty International’s Security Lab</li></ul>\n\n\n\n<p>The updates are all very small, between 256MB and 1.5GB depending on the device. To update an iPhone or iPad head over to the Settings app and tap General and Software Update. On a Mac, open System Preferences (Big Sur, Monterey) or System Settings (Ventura), then Software Update and follow the prompts.</p>\n\n\n\n<p>Read more about <a href=\"https://www.macworld.com/article/675021/how-long-does-apple-support-iphones.html\">How long Apple supports iPhones for</a> and <a href=\"https://www.macworld.com/article/673939/this-is-how-long-macs-and-macbooks-last.html\">How long Apple supports Macs for</a>. </p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bac4931aeba4eff7037bad6883dd39cf78f58c88ac54d9569b46275ec678d750","category":"Apple"}