{"title":"Freezing‐Thawing Hysteretic Behavior of Soils","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037280?af=R","date":1719564562000,"content":"<h2>Abstract</h2>\n<p>The soil freezing characteristic curve (SFCC) plays a crucial role in investigating the soil freezing-thawing process. Due to the challenges associated with measuring the SFCC, there is a shortage of high-quality or rigorous test results with sufficient metadata to be effectively used for applications. Current researchers typically conduct freezing tests to measure the SFCC and assume a singular SFCC when studying the freezing-thawing process of soils, although limited studies indicated that there is a hysteresis during the freezing and thawing process. In this paper, a series of freezing-thawing tests were performed to assess the SFCC, utilizing a precise nuclear magnetic resonance apparatus. The test results reveal a hysteresis between the SFCC obtained from the freezing process and that from the thawing process. Through analyzing the test results, the hysteresis mechanism of the SFCC is attributed to supercooling. Supercooling inhibits initial pore ice formation during freezing, causing a drastic liquid water-ice phase change once supercooling ends. Despite being considered closely related, the hysteresis of the SFCC differs from the soil water characteristic curve (SWCC), and the models used to simulate the hysteresis of SWCC cannot directly be used. To address the impact of supercooling on soil freezing-thawing hysteresis, a novel theoretical model is proposed. Comparisons between the measured and predicted results affirm the validity of the proposed model.</p>","author":"Jidong Teng, \nAntai Dong, \nSheng Zhang, \nXiong Zhang, \nDaichao Sheng","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"bac5007e547039d8382c3e581efad40b4794526c661073d1526369c4d0c21fd8","category":"Environment"}