{"title":"Sex differences in the association between sleep duration and muscle quality index in adults: A cross-sectional study from NHANES 2011–2014","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306661","date":1721052000000,"content":"<p>by Bin Xu, MengNi Jiang, Yu Wei, Ran Duan, Feng Tong</p>\r\nObjective <p>The aim of this study was to investigate the association between sleep duration and muscle quality index (MQI) in middle-aged and older age groups, as limited evidence exists on this topic.</p> Methods <p>In order to assess the relationship between sleep duration and MQI, a cross-sectional study was undertaken, utilizing data from the National Health and Nutrition Examination Survey (NHANES) acquired during the period from 2011 to 2014. The study comprised a total of 4598 participants aged 20 years and above. To examine the association between sleep duration and MQI, sophisticated weighted multivariate linear regression models were employed. Additionally, smooth curve fitting techniques were applied to examine the possibility of any non-linear relationship between the two variables.</p> Results <p>The average age of the adults who were enrolled in the study was 38.48±11.69 years, and 46.75% of them were female. The results of the multivariable linear regression models showed that sleep duration had a positive correlation with MQI. However, when subgroup analysis was conducted, it was found that this positive correlation only existed among women (β = 0.09, 95% CI: 0.014 to 0.167). To further confirm the differences between sexes in the relationship between sleep duration and MQI, a weighted generalized additive model (GAM) was used.</p> Conclusions <p>This research study provides evidence that there is a positive correlation between the duration of sleep and MQI specifically in females, while no such association was observed in males. These findings shed light on the existence of gender disparities in the connection between sleep duration and MQI.</p>","author":"Bin Xu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bac7496ca341a1991d92bd850facaca07af9aa12f6cfade1f5142e3854e51e73","category":"Interdisciplinary"}