{"title":"The top 10 riders from the 2021 Spring Classics","link":"https://www.cyclist.co.uk/in-depth/9543/the-top-10-riders-from-the-2021-spring-classics","date":1619526064000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>27 Apr 2021</span></div>    </div></div><p>\nA breakdown of the best riders this spring and the rider we ranked first among them all</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/strade_bianche_2021_italy_photo_press_1015462.jpg?itok=HUv7TGqh\" />  </div>\n<div>\n      <p> And just like that, the <a href=\"/tags/cycling-spring-classics\">2021 Spring Classics</a> season is over. It only feels like yesterday that we were cracking open our first Belgian Tripels of the year, settling in on the sofa for an afternoon of enjoying back-to-back coverage of the men’s and women’s Omloop Het Nieuwsblad and yet, with the conclusion of <a href=\"/tags/li-ge-bastogne-li-ge\">Liege-Bastogne-Liege</a>, it is all over again for another year.</p>\n<p>In a spring that missed <a href=\"/tags/paris-roubaix\">Paris-Roubaix</a> for a second consecutive year, no one rider really dominated throughout the period in either the men’s or women’s peloton. Instead, the very best kindly shared the spoils among one another with no rider taking home more than two one-day victories this spring.</p>\n<p>We also learned that <a href=\"/tags/mathieu-van-der-poel\">Mathieu van der Poel</a> and Wout van Aert are human, the <a href=\"/in-depth/7977/a-short-sharp-shock-celebrating-the-mur-de-huy\">Mur de Huy</a> is property of Anna van der Breggen and that it really helps if you are Dutch or Danish.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1803/giro-ditalia-2021-route-riders-start-list-live-tv\">Giro d'Italia 2021: Full details for this year's race</a></div>      <div><a href=\"/news/8760/how-to-watch-and-live-stream-the-giro-ditalia-2021\">How to watch and live stream the Giro d'Italia 2021</a></div>      <div><a href=\"/canyon/aeroad/8789/canyon-aeroad-cfr-first-ride-review-canyon-s-fastest-bike-ever\">Canyon Aeroad CFR first ride review: Canyon’s fastest bike ever</a></div>      <div><a href=\"/in-depth/3300/ultimate-time-trial-bikes-canyon-speedmax-cf-slx-90-ltd\">Ultimate time-trial bikes: Canyon Speedmax CF SLX 9.0 LTD</a></div>      <div><a href=\"/in-depth/8795/cyclist-magazine-podcast-episode-12-the-new-canyon-aeroad-and-why-aero-isnt-dead\">Cyclist Magazine Podcast Episode 12 – The new Canyon Aeroad and why aero isn't dead</a></div>    </div></div><h3>Top 10 riders of Spring 2021</h3>\n<h3>1. Anna van der Breggen (SD Worx)</h3>\n<h4>Number of victories: 2 – Omloop Het Nieuwsblad, Fleche Wallonne</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/anna-van-der-breggen.jpeg\" />  </div>\n</div>\n<p>In what will be her final Spring Classics campaign as a pro, Anna van der Breggen can consider herself more than satisfied. She won a seventh consecutive Fleche Wallonne, a second Omloop Het Nieuwsblad and finished first in the <em>Cyclist</em> ranking, the most cuveted prize of them all.</p>\n<p>In all seriousness, to win any race seven times is remarkable let alone seven times in a row – especially a race as brutal as Fleche Wallonne with its finish atop the Mur de Huy. On every single occaasion since 2015, Van der Breggen has climbed up the Huy faster than each and every one of her competitors. That’s real dominance.</p>\n<p>And when Van der Breggen was not winning races herself this spring, she was busy guiding Demi Vollering to a debut Liege-Bastogne-Liege win and Chantal van den Broek-Blaak to Strade Bianche, proving the consummate teammate in being more than willing to sacrifice herself for others despite it being her last year as a professional rider. Class.</p>\n<h3> 2. Annemiek van Vleuten (Movistar)</h3>\n<h4>Number of victories: 2 – Dwars door Vlaanderen and Tour of Flanders</h4>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/04/annemiek-van-vleuten.jpeg\" />  </div>\n</div>\n<p>After Liege finished on the weekend, we thought to ourselves that Van Vleuten’s spring had been pretty average. Then we checked back on her results since the start of season and realised how utterly stupid we were being.</p>\n<p>After all, she won Flanders which was the biggest race of spring. She also won it with ease, 23 seconds ahead of the next best rider Lisa Brennauer, having ridden everyone else off of her wheel on the Paterberg before riding alone for 13km to the finish. It was <a href=\"/tags/movistar\">Movistar</a>’s first ever cobbled Monument victory in 38 years, which is quite the achievement.</p>\n<p>And had Van Vleuten just been a quicker sprinter, she would probably also have won Liege and Amstel Gold Race too.</p>\n<h3>3. Kasper Asgreen (Deceuninck-QuickStep)</h3>\n<h4>Number of victories: 2 – Tour of Flanders and E3-Saxo Bank Classic</h4>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/04/tour-of-flanders-auld-13.jpg\" />  </div>\n</div>\n<p>So much for this spring being a three-way battle between Mathieu van der Poel, Wout van Aert and Julian Alaphilippe. <a href=\"/in-depth/9455/gallery-kasper-asgreen-rips-up-the-script-at-the-tour-of-flanders\">Kasper Asgreen read that script, ripped it up and wrote his own</a>.</p>\n<p>His win at E3 was one of the best tactical displays by both individual and team that we have seen in quite some time. It started with the entire <a href=\"/tags/deceuninck-quickstep\">QuickStep</a> team simultaneously attacking up the Taaienberg which immediately isolated both Van der Poel and Van Aert.</p>\n<p>It carried on with Asgreen attacking solo for 40km while his teammates anchored onto the wheels of the aforementioned duo and finished with the cheekiest of winning attacks using a traffic island as camoflague.</p>\n<p>Then a week later came Flanders. Less tactics, more brute power. When Van der Poel opened up the cylinders on the Oude Kwaremont, Asgreen matched him pedal stroke for pedal stroke while all others faded away. The pair rode side by side up the Paterberg and eventually arrived at the finish together in a sprint that you would have put your bottom dollar on Van der Poel winning. It takes some nerve to take Van der Poel to the line and back yourself to beat him in a sprint. But he did, so <em>chapeau</em>.</p>\n<p>Not bad for a man only signed by <a href=\"/tags/deceuninck-quickstep\">Deceuninck-QuickStep</a> in 2018 to cover at Scheldeprijs during an injury crisis.</p>\n<h3>4. Demi Vollering (SD Worx)</h3>\n<h4>Number of victories: 1 – Liege-Bastogne-Liege</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/demi-vollering.jpeg\" />  </div>\n</div>\n<p>Say hello and welcome to cycling’s latest superstar.</p>\n<p>With Van der Breggen retiring and Vos and Van Vleuten comfortably into the twilight of their careers themselves, Vollering proved this spring that she is the heir apparent to the Dutch cycling throne and with victory at Liege, she showed to be more than ready to carry the <em>Oranje</em> torch for the next decade or so.</p>\n<p>Frighteningly consistent in Flanders, the Ardennes and Tuscany, the 24-year-old raced seven times this spring with a worst result of 13th. On two occasions – Brabantse Pijl and Amstel Gold – she was within millimetres of victory but impressed us most with her 10th at Fleche Wallonne having already emptied the tank on behalf of eventual winner and teammate Van der Breggen. A special rider.</p>\n<h3>5. Wout van Aert (Jumbo-Visma)</h3>\n<h4>Number of victories: 2 – Gent-Wevelgem and Amstel Gold Race</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/wout-van-aert.jpeg\" />  </div>\n</div>\n<p>All things considered, <a href=\"/tags/wout-van-aert\">Wout van Aert</a> is probably the best male bike racer in the world right now.</p>\n<p>He can sprint, he can climb, he can <a href=\"/tags/time-trial\">time-trial</a>. His bike handling is flawless as is his tactical nous. Van Aert managed more victories than his arch rival Van der Poel over the spring, transcended from the cobbles to the Ardennes seamlessly and even managed to challenge for the General Classification at Tirreno-Adriatico in between.</p>\n<p>To put things in perspective, Van Aert can be considered a direct rival of Caleb Ewan, Tadej Pogacar, Filippo Ganna and Mathieu van der Poel all in one.</p>\n<h3>6. Marianne Vos (Jumbo-Visma)</h3>\n<h4>Number of victories: 2 – Gent-Wevelgem and Amstel Gold Race</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/marianne-vos.jpeg\" />  </div>\n</div>\n<p>With her two wins this spring and a sprinkling of further top 10s, it’s so good to see Vos back. She’s not quite back to her unstoppable best of a decade ago but I think we can agree that rider no longer exists.</p>\n<p>The best thing about Vos now is that her sheer presence in the peloton makes the race exciting by virtue of each and every one of her competitors knowing they have to drop her before the finish line or face being comfortably beaten in the sprint.</p>\n<p>Just look at Liege last weekend. That final 20km would not have been as explosive had it not been for the fact they all knew Vos needed dropping.</p>\n<h3>7. Tom Pidcock (Ineos Grenediers)</h3>\n<h4>Number of victories: 1 – Brabantse Pijl</h4>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/04/pressesports_583752_cycle-10.jpg\" />  </div>\n</div>\n<p>Pretty good bike racer isn’t he, this Pidcock fella?</p>\n<p>If I remember correctly, Pidcock and Ineos had decided against a full spring campaign instead favouring a more streamlined approach that centred around the smaller semi-Classics. Besides Liege which he missed through injury, Pidcock rode close to every race possible over the past eight weeks.</p>\n<p>In the process, he proved his incredible versatility with good results at Kuurne-Brussels-Kuurne, Strade-Bianche, the Amstel Gold Race and Fleche Wallonne – four very different races. He also proved his undeniable talent when he outsprinted Van Aert and Matteo Trentin at Brabantse Pijl, too in arguably one of the best finishes to a race this spring.</p>\n<p>And best of all, because of riders like Pidcock and others, Ineos Grenadiers are finally become exciting to watch!</p>\n<h3>8. Mathieu van der Poel (Alpecin-Fenix)</h3>\n<h4>Number of victories: 1 – Strade Bianche</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/03/strade_bianche_2021_italy_photo_press_1015462.jpg\" />  </div>\n</div>\n<p>We won’t lie to you, we were slightly underwhelmed with Van der Poel this spring. We expected nothing less than complete and utter domination. We didn’t get that.</p>\n<p>Taking away his heroics at Tirreno-Adriatico which we are not considering in these rankings, the only standout performance from cycling’s phenomenon this spring was Strade Bianche. I mean yes,<a href=\"/news/9331/mathieu-van-der-poels-insane-strade-bianche-watts-revealed\"> that particular win was among one of the most impressive victories we have seen this century</a> and we still can't believe the violent nature of his attack into Siena, but for the rest of the period it seemed as if Van der Poel was running on fumes.</p>\n<p>He blew up on the line at Flanders, bonked at Dwars door Vlaanderen, was tactically schooled at E3, failed to stick to his attacking word at <a href=\"/tags/milan-san-remo\">Milan-San Remo</a> and skipped the Ardennes.</p>\n<p>Do better, Mathieu.</p>\n<h3>9. Elisa Longo Borghini (Trek-Segafredo)</h3>\n<h4>Number of victories: 1 – Trofeo Alfredo Binda</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/03/strade_bianche_2021_italy_photo_press_1015465.jpg\" />  </div>\n</div>\n<p>As fun as she is infuriating to watch, Elisa Longo Borghini was a real enigma for me this spring.</p>\n<p>One minute she is constantly attacking the race, taking things by the scruff of the neck, trying her very all to force the issue far from the line. The next she refuses to work with Katarzyna Niewiadoma in the dying stages of the Amstel Gold Race, sand-bagging on the Pole’s wheel as they both see the chance of glory slip away.</p>\n<p>It made for great viewing but I cannot help but think a little more shrewdness around her race tactics could have led to more than just the one win for the Italian this spring.</p>\n<h3>10. Anthony Turgis (Total-Direct Energie)</h3>\n<h4>Number of victories: 0 – best result: 2nd at Kuurne-Brussels-Kuurne</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/pressesports_583752_cycle_-3.jpg\" />  </div>\n</div>\n<p>Ok, this may seem like a hipster’s choice when you consider Turgis took zero victories throughout spring and we have omitted Jasper Stuyven and <a href=\"/tags/tadej-pogacar\">Tadej Pogacar</a>, the respective winners of Milan-San Remo and Liege-Bastogne-Liege, but there is no rider who has advanced their career over the past eight weeks quite like Turgis.</p>\n<p>Only a second-tier rider with Total-Direct Energie, Turgis was ever-present in every Cobbled Classic, standing toe-to-toe with cycling’s elite, even managing to trade a few of his own blows at times. He proved he is comfortable at the biggest races and capable of huge results.</p>\n<p>Do not be surprised if he is high on the shopping list of many WorldTour teams come the end of this season. He will be snapped up by one of the big teams sooner or later – it’s just a matter of who.</p>\n<h4>Notable absences</h4>\n<p>Jasper Stuyven (Trek-Segafredo), Tadej Pogacar (UAE Team Emirates), Julian Alaphilippe (Deceuninck-QuickStep), Grace Brown (Team BikeExchange), Katarzyna Niewiadoma (Canyon-Sram). </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"bacd81da18f9cf090f9b14894b6b26fa095d9b9d1d0cc049e81ecedca9eb51cc","category":"Cycling"}