{"title":"MOOTS + SBT GRVL PRE-RIDE 2021","link":"https://moots.com/moots-sbt-grvl-pre-ride-2021/","date":1622841343000,"content":"<p>We are pleased to announce that MOOTS is working with SBT GRVL to host a pre-ride on August 13th, just two days before the big race takes place. Our community will be buzzing with the hum of gravel tires the entire week and we’d like to take this chance to ride with you. Whether you own a Moots or not, we invite you to come ride with us. The pre-ride is FREE to all!<span></span> <img src=\"https://moots.com/wp-content/uploads/RANCH-RALLY-GROUP-copy.jpg\" /></p>\n<p>There are a few details we’d like you to be aware of so lets cover off on those:</p>\n<p><span>WHAT: Moots hosted SBT GRVL pre-ride.—FREE! </span></p>\n<p><span>WHEN: Friday August 13th, 9:00 am depart from Moots.</span></p>\n<p><span>RSVP: Please RSVP on Eventbrite so we can have an idea of the number of people that will be riding.</span></p>\n<p><strong>PLEASE RSVP HERE</strong>: <a href=\"https://www.eventbrite.co.uk/e/moots-sbt-grvl-pre-ride-2021-tickets-157877009385?utm-campaign=social&amp;utm-content=attendeeshare&amp;utm-medium=discovery&amp;utm-term=listing&amp;utm-source=cp&amp;aff=escb\">MOOTS + SBT GRVL PRE-RIDE</a></p>\n<p><span>WAIVER: We will have a waiver for you to sign the morning of the ride. (the paper type).</span></p>\n<p><span>WHERE: Starting at Moots world headquarters (2545 Copper Ridge Drive) Steamboat Springs, Colorado</span></p>\n<p>RIDE TO THE RIDE: There is almost zero parking around the Moots building, so please leave the car behind and spin over to Moots for the ride. If you must drive, please park at the <a href=\"https://www.google.com/maps/place/Stockbridge+Transit+Center/@40.4939212,-106.8508062,17.7z/data=!4m5!3m4!1s0x874268ece0c5faad:0x18edbe572bc2df0d!8m2!3d40.4939352!4d-106.849957\">TRANSIT CENTER</a></p>\n<p><span>COURSE: We will cover 48.5 miles with 2800 feet of climbing.This ride will give you a good look at the early miles of the race course. The course will be unmarked so you will need to load the route into your GPS device for a care free ride. There are a few bail-out points if you don’t want to cover the entire route. </span></p>\n<p><span>You can find the route here: </span></p>\n<p><a href=\"https://ridewithgps.com/routes/35701877\"><span>MOOTS-SBT GRVL PRE-RIDE</span></a></p>\n<p><span>WHAT YOU’LL NEED: This ride is unsupported, so come ready with food, water, rain jacket, sunscreen and spare tubes/flat fixing utensils.</span></p>\n<p><span>WHAT WE WON’T DO: We will not have a sweep on course or outside mechanical support. Come prepared! </span></p>\n<p><span>TURN AROUND: Moots will have their sprinter van at the half way point for minor mechanical support, water and light snacks. </span></p>\n<p><span>WHY: At Moots we love to ride and when it comes to gravel, we are experts in the field. Our gravel bike line up (named ROUTT) was concepted, designed and tested on these very roads we will cover. We’ll have a large part of our staff out riding with you and sharing insight to Moots and the surrounding area. Moots  turns 40 years old this year, so there might be cake! Come out and ride with Moots! </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_2025-copy-3-scaled.jpg\" /></p>\n<p><img src=\"https://moots.com/wp-content/uploads/Screen-Shot-2019-01-22-at-1.54.32-PM-copy-2.png\" /></p>\n<p>The post <a href=\"https://moots.com/moots-sbt-grvl-pre-ride-2021/\">MOOTS + SBT GRVL PRE-RIDE 2021</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"badafca0009bb962578721c6cb8c19c657ee307ed63af5a6ec8277394987538b","category":"Cycling"}