{"title":"รีวิว Surface Pro 7+ อัพเกรดย่อยครึ่งรอบ พลัง Tiger Lake, ใส่ซิม 4G, SSD ถอดเปลี่ยนได้","link":"https://www.blognone.com/node/122837","date":1621927333000,"content":"<div><div><div><p>ไมโครซอฟท์เปิดตัวฮาร์ดแวร์รอบต้นปี 2021 ไม่มากนัก มีเพียง 2 รุ่นเท่านั้นคือ <a href=\"https://www.blognone.com/node/120529\">Surface Pro 7+</a> และ <a href=\"https://www.blognone.com/node/122167\">Surface Laptop 4</a> ซึ่งเป็นการอัพเกรดสเปกภายในล้วนๆ โดยยังคงบอดี้ภายนอกแบบเดิม</p>\n<p>กรณีของ Surface Pro 7+ ถือเป็นครั้งแรกที่ไมโครซอฟท์ออกรุ่น + ให้กับสินค้าแบรนด์ Surface อีกทั้งยังเป็น Surface for Business ขายเฉพาะลูกค้าองค์กรเท่านั้นด้วย สำหรับในประเทศไทย <a href=\"https://www.blognone.com/node/120715\">Surface Pro 7+ เปิดราคาและเริ่มวางขายมาตั้งแต่เดือนกุมภาพันธ์</a> โดย Blognone ก็ได้เครื่องมาทดสอบด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f84ab117d25925340714ad47e35c0a88.jpg\" /></p>\n<h3>สเปกเครื่อง</h3>\n<p>การเปลี่ยนแปลงสำคัญในแง่สเปกของ Surface Pro 7+ เทียบกับ Surface Pro 7 มีเพียงอย่างเดียว คืออัพเกรดซีพียูมาใช้ 11th Gen Core หรือที่เราเรียกตามโค้ดเนมว่า Tiger Lake (รุ่น Pro 7 เป็น 10th Gen Ice Lake) และสามารถเลือกซื้อรุ่นที่มีช่องเสียบซิม LTE ได้ถ้าต้องการ</p>\n<p>ซีพียู Tiger Lake ของ Surface Pro 7+ มีทั้งหมด 3 รุ่นย่อยคือ Core i3-1115G4, Core i5-1135G7, Core i7-1165G7 โดยสามารถใส่แรมได้สูงสุด 32GB และสตอเรจได้สูงสุด 1TB (มีเฉพาะในรุ่น Core i7 รุ่นท็อปสุด) เครื่องบางรุ่นย่อยมีแบบสีดำให้เลือกด้วย แต่สีมาตรฐานคือสีเทา</p>\n<p>เครื่องตัวอย่างที่ได้รับมาทดสอบ มีสเปกดังนี้</p>\n<ul>\n<li>ซีพียู: 11th Gen Core i5-1135G7</li>\n<li>จีพียู: Iris Xe</li>\n<li>แรม: 16GB</li>\n<li>สตอเรจ: 256GB</li>\n<li>เป็นรุ่น Wi-Fi + LTE</li>\n<li>ระบบปฏิบัติการ Windows 10 Pro</li>\n</ul>\n<p>ราคาขายในไทย<a href=\"https://www.blognone.com/node/120715\">ตามประกาศของไมโครซอฟท์</a> อยู่ที่ 55,900 บาท ราคานี้รวมปากกา Surface Pen แล้ว แต่ยังไม่รวมคีย์บอร์ด Type Cover ที่ราคา 4,900 บาท</p>\n<p>เนื่องจาก <a href=\"https://www.blognone.com/node/114147\">Blognone เคยรีวิว Surface Pro 7 รุ่นดั้งเดิมไปแล้ว</a> รีวิวนี้จะเน้นไปที่จุดแตกต่างของ Pro 7+ ที่เพิ่มเข้ามาเท่านั้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4e451ae039a4830b7799ad0c1121d246.jpg\" /></p>\n<h3>ตัวเครื่องภายนอก</h3>\n<p>หน้าตาของ Surface Pro 7+ เหมือนกับ Surface Pro 7 ทุกประการ (ต้องบอกว่าหน้าตาแบบนี้ เหมือนเดิมมาหลายรุ่นแล้วด้วย) ข้อดีคือใช้อุปกรณ์เสริมอย่างคีย์บอร์ดหรือเคสร่วมกันได้ ไม่ต้องซื้อใหม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/43995c6f4b0425068a09bdf2b6be786d.jpg\" /></p>\n<p>หน้าจอยังเป็นจอขนาด 12.3\" PixelSense ความละเอียด 2736x1824 สัดส่วน 3:2 เหมือนเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/916e5bf1f124dbcbd7d59f26e7a0324c.jpg\" /></p>\n<p>ขอบเครื่องด้านซ้าย มีช่องเสียบหูฟัง 3.5 มิลลิเมตรเพียงอย่างเดียว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/321530a660a56dfaac3ab578f07cdb84.jpg\" /></p>\n<p>ขอบเครื่องด้านขวา มีพอร์ต USB-C หนึ่งพอร์ต (ยังไม่รองรับ Thunderbolt 3), USB-A หนึ่งพอร์ต และสายชาร์จ Surface Connect หนึ่งพอร์ต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/23bd18aa5ad2dc88d5cb638216a3156e.jpg\" /></p>\n<p>การชาร์จไฟสามารถทำได้ทั้งผ่าน Surface Connect และ USB-C เท่าที่ลองชาร์จด้วยอแดปเตอร์ USB-C ของยี่ห้ออื่นก็ทำได้ปกติดี ไม่มีปัญหาอะไร</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e2daac03f07a36b0dd32ef33df3dee03.jpg\" /></p>\n<p>กล้องหน้ายังถือเป็นจุดเด่นของ Surface มานาน และยิ่งเห็นประโยชน์ในยุคที่เราต้องประชุมออนไลน์กันบ่อยขึ้นมาก กล้องมีความละเอียด 5MP และเป็นกล้อง Infrared รองรับการล็อกอินด้วยใบหน้า Windows Hello เช่นเดิม สะดวกสบายในการใช้งาน แม้ตัวกล้องไม่ได้อัพเกรดใดๆ มานานแล้ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2ae0a21dd484b52bf9657955034963b7.jpg\" /></p>\n<h3>ช่องเสียบซิม LTE และ SSD ถอดเปลี่ยนได้</h3>\n<p>การเปลี่ยนแปลงสำคัญของฮาร์ดแวร์ Pro 7+ ซ่อนอยู่ด้านหลังขาตั้ง เพราะมีช่องเสียบซิม และ SSD แบบถอดเปลี่ยนได้เองเพิ่มมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f227525a38ef6c28ec0cdb69b720cdc3.jpg\" /></p>\n<p>กรณีของ SSD ต้องใช้เข็มจิ้มซิมกดตรงรู เพื่อให้ฝาหลุดออกมา (ตัวฝามีส่วนที่เป็นแม่เหล็กซะด้วย) ถ้าต้องการอัพเกรดเป็น SSD ขนาดที่ใหญ่ขึ้น สามารถซื้อ SSD ไซส์ M2 มาเปลี่ยนเองได้เลย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/af779d6546204ab46c0dcd4141799952.jpg\" /></p>\n<p>ตรงนี้มีโน้ตเล็กๆ ว่า SSD ของไมโครซอฟท์จะมีตัวระบายความร้อนหุ้มมาให้ด้วย ขนาดจึงอาจไม่พอดี 100% แต่เห็นมีตัวอย่างยูทูบเบอร์บางราย ใช้เทประบายความร้อนมาแปะให้พอดีกันแทน ตามคลิปด้านล่าง</p>\n<p>ส่วนช่องใส่ซิมของ Surface Pro 7+ มาแทนช่องใส่ microSD เดิม แปลว่าต้องเลือกอย่างใดอย่างหนึ่ง ถ้าจะเอาช่องใส่ซิมก็ไม่มี microSD มาให้ ข้อจำกัดอีกอย่างคือยังรองรับเฉพาะ 4G LTE เท่านั้น (โมเด็มเป็น Snapdragon X20) ไม่รองรับ 5G</p>\n<p>ผมลองนำซิมจากมือถือมาใส่ดู พบปัญหาเล็กน้อยว่ารูสำหรับจิ้มมีขนาดเล็กมาก ใช้เข็มจิ้มซิมของตัวเองแล้วจิ้มไม่เข้า (รูเล็กเกิน) แต่ไมโครซอฟท์ก็ให้เข็มจิ้มซิมมาในกล่องด้วย ซึ่งจิ้มได้ไม่มีปัญหา</p>\n<p>ใส่ซิมเรียบร้อยแล้วก็เข้าในหน้า Settings &gt; Cellular สามารถเลือกได้ทั้งซิมแบบปกติ (SIM1) หรือจะเป็น eSIM ก็รองรับ ตั้งค่าเรียบร้อยก็พร้อมใช้งานได้ทันที</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/37be048891e2407061e92b84d2ae2e60.jpg\" /></p>\n<h3>ซีพียู Core 11th Gen Tiger Lake และจีพียู Iris Xe</h3>\n<p>ในแง่สเปก ของใหม่ใน Pro 7+ มีเพียงอย่างเดียวคืออัพเกรดซีพียูมาเป็น <a href=\"https://www.blognone.com/node/118253\">11th Gen Tiger Lake</a> ซึ่งจุดขายสำคัญคือใช้จีพียูตัวใหม่ Iris Xe ที่คุยว่าแรงขึ้นจาก Intel UHD ของเดิมมาก</p>\n<p>แต่ก็ต้องโน้ตไว้ก่อนว่า แม้แต่อินเทลยังไม่กล้านำ Iris Xe มาจับตลาดเกมมิ่งเลย (จะเริ่มทำตลาดด้วยการ์ด Xe-HPG ที่จะออกในปีนี้) และไมโครซอฟท์เองก็ระบุชัดเจนว่า Surface Pro 7+ เป็น \"for Business\" นั่นคือไม่เน้นเกมมิ่ง ดังนั้นประสิทธิภาพที่ดีขึ้นของ Xe จะมุ่งไปที่แอปพลิเคชันทั่วไป (เช่น ออฟฟิศ กราฟิก ออกแบบ ตัดต่อ ฯลฯ) เป็นหลัก</p>\n<p>เครื่องที่ได้รับมาทดสอบเป็น Core i5-1135G7 ที่จีพียู Iris Xe มี execution unit (EU) จำนวน 80 ตัว ลดจากรุ่นท็อป Core i7-1165G7 ที่มี EU เยอะกว่าคือ 96 ตัว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7c9922d599a9717460312446cf6408b9.jpg\" /></p>\n<p>ผมลองรัน Surface Pro 7+ เพื่อดูประสิทธิภาพของ Iris Xe 80 EU ด้วยเบนช์มาร์ค 3DMark Time Spy ได้คะแนนรวม 996 คะแนน (เทียบกับ Iris Xe 96 EU ที่ทำได้ราว 1,200 คะแนน) นับเฉพาะคะแนนกราฟิกที่ 931 คะแนน แต่ก็ถือว่าอยู่ในระดับมาตรฐานของจีพียูโน้ตบุ๊กสายทำงานทั่วไป</p>\n<p>ภาพรวมแล้ว การมาถึงของ Iris Xe คงไม่ได้ช่วยให้เล่นเกมได้ดีขึ้นมากนัก พอเล่นเกมที่กราฟิกไม่แรงได้บ้าง แต่ประโยชน์ของมันคงอยู่ที่การใช้งานเชิงธุรกิจเป็นหลัก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c2120b0593bb5ac11e8e17283393400c.jpg\" /></p>\n<h3>ความร้อน แบตเตอรี่ และการใช้งาน</h3>\n<p>Surface Pro 7/7+ รุ่นที่เป็น Core i3 และ i5 เป็นดีไซน์แบบ fanless คือไม่มีพัดลม เพราะการปล่อยความร้อนไม่ได้เยอะมาก ในขณะที่รุ่น Core i7 ยังเป็นดีไซน์แบบมีพัดลมอยู่</p>\n<p>เท่าที่ทดลองใช้งานท่องเว็บ โซเชียล ดูวิดีโอทั่วๆ ไป ตัวเครื่อง Surface Pro 7+ ค่อนข้างเย็นทีเดียว จะมีแค่ตอนรันงานหนักๆ (เช่น รันเบนช์มาร์คข้างต้น) ที่ตัวเครื่องด้านหลังซีกบนจะอุ่นขึ้น แต่ก็ยังไม่ร้อนจัดจนจับไม่ได้</p>\n<p>ประเด็นเรื่องแบตเตอรี่ ไมโครซอฟท์คุยว่าใช้ได้นานสูงสุด 15 ชั่วโมง (รุ่น Wi-Fi) หรือ 13.5 ชั่วโมง (รุ่น LTE) ซึ่งในการใช้งานจริงย่อมไม่ถึงอยู่แล้ว จากการใช้งานทั่วๆ ไป ไม่ได้รันลูปงานเพื่อทดสอบแบบจริงจัง อยู่ได้ประมาณ 8 ชั่วโมง ถือว่าระดับกลางๆ ไม่ได้น้อยจนน่าเกลียด หรือนานจนตะลึง</p>\n<p>การใช้งานอื่นๆ ไม่มีอะไรแตกต่างจาก Surface Pro รุ่นก่อนๆ เพราะเป็น form factor ที่ผ่านการพิสูจน์ตัวเองมานานพอสมควรแล้ว หลายสิ่งที่ Surface ทำได้ดี (เช่น จดโน้ตด้วยปากกา ปรับเป็นแท็บเล็ตได้ง่าย ล็อกอินด้วยใบหน้าได้) ก็ยังทำได้ดีเหมือนเดิม ส่วนสิ่งที่เป็นจุดอ่อนหรือทำได้ไม่ดี ไม่ว่าจะเป็นข้อจำกัดทางฮาร์ดแวร์ (เช่น ขาตั้งวางบนพื้นที่ไม่ใช่โต๊ะได้ยาก) หรือซอฟต์แวร์ (จากตัว OS เอง) ก็ยังเป็นเช่นเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/42b8b0907ffadd1d881a4aac276dd274.jpg\" /></p>\n<h3>Surface Pro 7+ วิวัฒนาการขั้นสุดของ Surface Pro ก่อนเข้าสู่ยุคใหม่</h3>\n<p>ประเด็นที่น่าพูดถึงมากที่สุดของ Surface Pro 7+ คือตัว + ในชื่อรุ่น ซึ่งถือเป็นครั้งแรกที่ไมโครซอฟท์ตั้งชื่อด้วย + เพื่อแสดงให้เห็นว่า เป็นการเปลี่ยนแปลงเล็กน้อยจาก Surface Pro 7 แต่ยังไม่นับเป็น Surface Pro 8</p>\n<p>การตั้งชื่อรุ่นแบบนี้ ต่างจากธรรมเนียมเดิมที่ไมโครซอฟท์ออก Surface Pro รุ่นใหม่แทบทุกปี (ตามรอบการออกซีพียูของอินเทล) แล้วขยับเลขท้ายขึ้นเรื่อยๆ แต่รอบนี้การอัพเกรดซีพียูใหม่เป็น Tiger Lake กลับไม่เพิ่มเลขรุ่นแบบที่แล้วๆ มา มิหนำซ้ำยังแปะตรา for Business มาขายเฉพาะตลาดองค์กรด้วย</p>\n<p>ท่าทีนี้ของไมโครซอฟท์เป็นสิ่งบ่งชี้กลายๆ ว่าการอัพเกรดซีพียู และการเปลี่ยนอย่างอื่นเล็กๆ น้อย (SSD อัพเกรดได้, ช่องใส่ซิม) คงไม่เพียงพอแล้วสำหรับการอัพเกรดเครื่องในสายตาผู้บริโภค</p>\n<p>ตัวบอดี้ของ Surface Pro นั้นไม่ถูกอัพเกรดใหญ่มานานมากแล้ว เราใช้บอดี้รุ่นนี้มาตั้งแต่ Surface Pro 4 ที่ออกในปี 2015 โน่นเลย ระหว่างนั้นมีเพียงการอัพเกรดเล็กๆ น้อยๆ เท่านั้น เช่น อัพเกรดขาตั้งให้กางได้มากขึ้น (Surface Pro 5), เพิ่มรุ่นสีดำ (Surface Pro 6), และเปลี่ยนพอร์ต Mini DisplayPort มาเป็น USB-C (Surface Pro 7) ดังนั้น Surface Pro 7+ ที่เพิ่ม SSD ถอดเปลี่ยนได้ และช่องใส่ซิมเข้ามา ถือเป็นอีกขั้นเล็กๆ ของวิวัฒนาการนี้ และน่าจะเป็นจุดสุดทางของบอดี้นี้แล้ว</p>\n<p>มาถึงปี 2021 หน้าตาแบบของ Surface Pro 7+ ถือว่าเริ่มล้าสมัยแล้ว เรายังเห็นแท็บเล็ตขอบจอหนาแบบเดียวกับ Surface Pro 4 ที่ออกในปี 2015 อยู่เช่นเดิม ปากกาต้องพกแยก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/84f5900c619d56c494e2cc8bece3186d.jpg\" /></p>\n<p>ที่น่าสนใจคือ ไมโครซอฟท์เองก็มี \"วิสัยทัศน์\" ของ Surface แห่งอนาคตออกมาให้เห็นกันแล้ว มันคือ Surface Pro X ที่ขอบจอเล็กลง ตัวเครื่องเล็กลง คีย์บอร์ดมีช่องเก็บปากกา เปลี่ยนมาใช้หน่วยประมวลผลที่ประหยัดพลังงานมากขึ้น เพียงแต่ข้อจำกัดเรื่องสถาปัตยกรรม Arm ทำให้เรายังเห็น Surface Pro X มีสถานะเป็น \"อุปกรณ์กึ่งทดลอง\" ที่แยกสายจาก Surface Pro รุ่นหลัก วางขายคู่ขนานกัน</p>\n<p>Surface Pro X ออกมาตั้งแต่ช่วงปลายปี 2019 พร้อมกับ Surface Pro 7 แต่พอมาถึงปี 2021 เรายังเห็น Surface Pro 7+ ที่หน้าตาแบบเดิมออกมาขายอยู่ ตรงนี้ทุกคนคงมีความเห็นร่วมกันว่า Surface Pro รุ่นถัดไป ที่น่าจะเปิดตัวช่วงปลายปี 2021 (และยังไม่รู้ว่าจะเรียกว่า Pro 8, X2 หรือชื่ออื่น) น่าจะเป็นการเปลี่ยนแปลงครั้งใหญ่ที่รอคอยกันมานาน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a2f00bbf927362111739ce144b53aff0.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/surface-pro-7\">Surface Pro 7</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/review\">Review</a></div><div><a href=\"/topics/microsoft-surface\">Microsoft Surface</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"badbc67bf1dc974d2960047357d4a93f6222e96a8d8aab4db03a6b181f1ac453","category":"Thai"}