{"title":"Human rights campaigner calls on cycling industry to help female riders fleeing Afghanistan","link":"https://www.cyclist.co.uk/in-depth/10060/human-rights-campaigner-calls-on-cycling-industry-to-help-female-riders-fleeing","date":1631012443000,"content":"<span>\n      <span><a href=\"/authors/trevor-ward\">Trevor Ward</a></span>\n  </span><div>  \n  <div>      <div><span>7 Sep 2021</span></div>    </div></div><p>\nShannon Galpin helpied co-ordinate the evacuation of women as Taliban seized power</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/afghan-cycling-women.jpeg?itok=OUtczl5l\" />  </div>\n<div>\n      <p><span>A human rights campaigner is calling on the cycling industry to help female riders flee Afghanistan. </span>Shannon Galpin, who has addressed global conferences about ‘how the bike is a vehicle for human rights and social justice’, was named a National Geographic Adventurer of the Year after cycling across the Panjshir Valley in Afghanistan in 2009.</p>\n<p>She worked as a coach and consultant with the Afghan national women’s cycling team from 2013 to 2016 and has watched in horror the unfolding events of the last few weeks as the Taliban swept into power.</p>\n<p>This week she tweeted: ‘Cycling industry. I see your silence. Afghan women represent the best of your industry over the past decade but where are you?!</p>\n<p>‘These women risked their lives to ride a bike. They built a cycling culture that claimed space for young women. They created bike protests and the first bike races for women in Afghanistan. They founded clubs and ran teams. What does the industry stand for if not this??’</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/afghan-women-two.jpeg?itok=oLglKC2l\" />  </div>\n</div>\n<p>One of the women Galpin helped coach, Masoma Alizada, was later granted asylum in France and earlier this year competed in the women’s TT in Tokyo as part of the Olympic Refugee team. Yet just days after the Taliban seized control of Kabul, and with the airport besieged by thousands of Afghans trying to board evacuation flights, the Afghanistan Cycling Federation tweeted: ‘The dreams, the strategy and the development for women cycling was always first and we were doing all efforts to develop cycling but now we only dream of it.’</p>\n<p>There are an estimated 200 female riders registered with the Federation, which restarted its national women’s team in 2011 with just a dozen members. In 2016 the team was included in a bid for the Nobel Peace Prize which declared the bicycle ‘an instrument of peace’.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/in-depth/10059/which-bikes-groupsets-and-brakes-did-best-at-grand-tours-in-2021\">Which bikes, groupsets and brakes did best at Grand Tours in 2021?</a></div>    </div></div><p>\nFrom her home in Edinburgh, Galpin is now helping co-ordinate the evacuation of some of these riders, and claims she has had ‘only a couple hours of sleep in the last 12 days’.</p>\n<p>‘I know many of the girls that have been evacuated and their families, and there’s a whole other generation of girls that started cycling in the past year or two that are also being evacuated,’ she said. ‘It’s an ongoing process but there has been a lot of cross-pollination with other evacuations. There’s an entirely invisible network of people getting everyone out.’</p>\n<p>While high-profile professional riders in the UK have so far been silent on the subject, others have been keen to help, including Alessandra Cappellotto, the first Italian female to win a World Championship Road Race medal (in San Sebastian in 1997) who currently heads the women’s Professional Cyclists Association (CPA). She contacted the UCI, United Nations and Italian military to successfully organise the evacuation of six female riders who are currently in Covid quarantine in Italy.</p>\n<p>‘There is joy for the girls rescued but also anguish for those who are still there,’ she said. ‘I found myself catapulted into this nightmare with the sole aim that the cyclists could be saved. A first step has been taken, but we hope that all the athletes, through the channels activated internationally, can be rescued. It is not yet the time to celebrate, but this drop of hope in a sea of ​​pain has immense value.’</p>\n<h3>Afghan Cycles documentary</h3>\n<p>\nAn idea of the oppression and hostility female riders could face now that the Taliban are in power can be gleaned from the 2019 documentary Afghan Cycles, which Galpin produced.</p>\n<p>In it, female cyclists talk of the abuse and threats they faced on a daily basis just for riding their bikes. One girl recalls how she was threatened by two men bearing pistols, while another complains to her provincial governor that religious leaders have branded her and her companions ‘infidels’ for ‘training uncovered’ (when in fact they all wear baggy, long-sleeved jerseys, tracksuit bottoms and headscarves while riding).</p>\n<p>The film was made between 2013 and 2017 when Afghanistan was ruled by a US-backed civilian government, yet one Taliban member who is interviewed warns chillingly: ‘For a female to ride a bike is a wasteful action, it’s only showing off. We will give them a warning three times. If she doesn’t stop, we have to stop her by any means.’</p>\n<p>This is the reality now facing the female cyclists of Afghanistan as the Taliban forms a government. The fear is that the hard-line habits of old – the Taliban was last in power from 1996 until the US invasion following the 9/11 terror attacks – will be resumed.</p>\n<p>‘We are afraid that if the Taliban come, the first thing they will do is kill the cycling girls,’ says a member of the national women’s cycling team in the film.</p>\n<p>Asked if cycling is worth the daily risks, she replies, ‘Every accomplishment needs a sacrifice at the beginning. We might be the first sacrifices for cycling in Afghanistan.’</p>\n<p>Galpin says for the women of Afghanistan, the bicycle is more than just a piece of sporting equipment.</p>\n<p>‘The bicycle can mean the difference between a life fulfilled and a life of oppression,’ she says. ‘Within a year of working with the first Afghan women’s cycling team, I was supporting new bike clubs founded by girls to ride socially and soon there was a “right-to-ride” revolution happening. In 2020 there were over 200 registered cyclists in seven provinces.’</p>\n<p>But now ‘they are in hiding, burning their clothing, and scared of reprisals by the Taliban. They are literally burning their future as are many women across Afghanistan who are burning diplomas and other “incriminating” items.</p>\n<p>‘These women are on evacuation lists but we need to fund their evacuation and their repatriation costs, mental health counselling and, of course, once they have a community, get them bikes. They never wanted this. We have a moral obligation to support them and help them rebuild their lives.’</p>\n<p>A fundraising page set up by Galpin to support the evacuation and resettlement of female riders has so far raised more than £58,000. To donate, visit: <a href=\"https://fundly.com/support-afghan-cyclists\" target=\"_blank\">https://fundly.com/support-afghan-cyclists</a></p>\n<p>The film Afghan Cycles is available for rent or purchase on YouTube. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"baf4ee4bb2e1013b9708067ecaf634f81b721f0b0bd7200c03518f2f80040841","category":"Cycling"}