{"title":"Eve Debuts Thread-Enabled Eve Energy HomeKit Smart Plug","link":"https://www.macrumors.com/2021/04/27/eve-energy-homekit-thread-support/","date":1619528748000,"content":"<a href=\"http://www.evehome.com\">Eve Systems</a> today announced the newest version of its HomeKit-compatible Eve Energy Smart Plug, introducing Thread integration.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/eve-energy-thread.jpg\" />\r\n<br />\r\nThe fourth-generation Eve Energy supports <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> over Thread, and as a main-powered always-on Thread accessory, Eve Energy serves as a router node in the Thread network to make smart homes more reliable with better reach throughout the house.\r\n<br />\r\n\r\n<br />\r\nAs a Thread router node, the Eve Energy can relay other accessories' data packages in the Thread mesh network for overall performance improvements.<blockquote>\"Packing Thread router functionality into a premium quality, small-footprint smart plug, Eve Energy is the quintessential ‌HomeKit‌ accessory,\" said Jerome Gackel, CEO of Eve Systems. \"Not only does it offer endless automation possibilities, but it also delivers an ultra-robust network to ensure that your schedules and timers work, any time and any place.\"</blockquote>As a Smart Home device, Eve Energy is a plug that can turn any standard appliance into a smart appliance, allowing it to be controlled through the Eve app, though the Home app, and with <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> voice commands.\r\n<br />\r\n\r\n<br />\r\nWith the Eve app, users can monitor the energy consumption and energy costs of whatever is plugged into the Eve Energy.\r\n<br />\r\n\r\n<br />\r\nIf a smart home setup has a <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> or <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> as a home hub, users can access their accessories when away from home, plus the Eve Energy supports automations that work with other ‌HomeKit‌ products.\r\n<br />\r\n\r\n<br />\r\nThrough Thread and Bluetooth integration, Eve Energy can join a Thread network automatically, and it will work more reliably than a standalone Bluetooth-enabled accessory. Eve has several other Thread-compatible accessories including the Eve Door &amp; Window, Eve Weather, and Eve Aqua.\r\n<br />\r\n\r\n<br />\r\nEve Energy can be <a href=\"http://www.evehome.com/store\">purchased from the Eve online store</a> for $40, and it will soon be available from Apple and Amazon.<div>Tag: <a href=\"https://www.macrumors.com/guide/eve/\">Eve</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/27/eve-energy-homekit-thread-support/\">Eve Debuts Thread-Enabled Eve Energy HomeKit Smart Plug</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eve-debuts-thread-enabled-eve-energy-homekit-smart-plug.2293495/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=WSVwUeOZs6o:gc2OtwwglQE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=WSVwUeOZs6o:gc2OtwwglQE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/WSVwUeOZs6o\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"baf56467312cb9fe946d6bdd68a52554fa3d7fa0d77b585e201a6dbed24c4d24","category":"Apple"}