{"title":"Autophagy-associated biomarkers ULK2, UVRAG, and miRNAs miR-21, miR-126, and miR-374: Prognostic significance in glioma patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311308","date":1727704800000,"content":"<p>by Wajiha Amin, Syed Ather Enam, Sufiyan Sufiyan, Kulsoom Ghias, Mohammad Hamza Bajwa, Sahar Ilyas, Altaf Ali Laghari, Sana Naeem, Syed Hani Abidi, Nouman Mughal</p>\r\n\r\nAs the pioneering study from Pakistan, our research distinctly focuses on validating the roles of autophagy-associated genes and MicroRNAs (miRs) in the unique context of our population for glioma prognosis. The study delves into the nuanced interplay of autophagy within a miR-modulated environment, prompting an exploration of its potential impact on glioma development and survival. Employing real-time PCR (qPCR), we meticulously assessed the expression profiles of autophagy genes and miRs in glioma tissues, complemented by immunohistochemistry on Formalin-fixed paraffin-embedded tissues from the same patients. Our comprehensive statistical analyses, including the data normality hypothesis Shapiro-Wilk test, the Mann-Whitney U-test, Spearman correlation test, and Kaplan-Meier survival analysis, were tailored to unravel the intricate associations specific to low- and high-grade glioma within our population. Clinicopathological analysis revealed a predominance of male patients (66%) with a median age of 35 years. Glioblastoma (32%) and Astrocytoma (36%) were the most prevalent histopathological subtypes. Molecular analysis showed significant correlations between prognostic markers (Ki-67, IDH-1, p53) and clinicopathological factors, including age, histological type, radiotherapy, and chemotherapy. In high-grade glioma, increased expression of AKT and miR-21, coupled with reduced ULK2 and LC3 expression was distinctly observed. While correlation analysis identified a strong positive correlation between ULK2 and UVRAG, PTEN, miR-7, and miR-100 in low-grade glioma, unveiling distinctive molecular signatures unique to our study. Furthermore, a moderate positive correlation emerged between ULK2 and mTOR, miR-7, miR-30, miR-100, miR-204, and miR-374, also between miR-21 and miR-126. Similarly, a positive correlation appeared between ULK2 and AKT, LC3, PI3K, PTEN, ULK1, VPS34, mTOR, Beclin1, UVRAG, miR-7 and miR-374. AKT positively correlated with LC3, PI3K, PTEN, ULK1, VPS34, mTOR, Beclin1, UVRAG, miR-7, miR-30, miR-204, miR-374, miR-126 and miR-21 weakly correlated with AKT and miR-30 in high-grade glioma, providing further insights into the autophagy pathway within our population. The enrichment analysis for miR-21, miR-126, and miR-374 showed MAPK pathway as a common pathway along with Ras, PI3K, and mTOR pathway. The low ULK2, UVRAG, and miR-374 expression group exhibited significantly poor overall survival in glioma, while miR-21 over-expression indicated a poor prognosis in glioma patients, validating it in our population. This study provides comprehensive insights into the molecular landscape of gliomas, highlighting the dysregulation of autophagy genes ULK2, and UVRAG and the associated miR-21, miR-126 and miR-374 as potential prognostic biomarkers and emphasizing their unique significance in shaping survival outcomes in gliomas within the specific context of the Pakistani population.","author":"Wajiha Amin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bb021f673b9681a946c927a0ad92dd7f1011f9af5dc85822989bf3c550242868","category":"Interdisciplinary"}