{"title":"Google Photos เพิ่มฟีเจอร์ Memories จัดภาพเก่าๆ ความทรงจำดีๆ เป็นชุด ชวนคนอื่นมาร่วมทำได้","link":"https://www.blognone.com/node/135300","date":1692151525000,"content":"<div><div><div><p>Google Photos เพิ่มฟีเจอร์เกี่ยวกับ Memories หรือภาพเก่าในอดีตมาย้อนความทรงจำดีๆ อีกหลายอย่าง โดยขยับเอา Memories มาเป็นเมนูหลักของแอพเลย</p>\n<p>แอพ Google Photos ของเดิมมีเมนูหลัก 4 อันด้านล่างคือ Photos, Search, Sharing, Library คราวนี้กูเกิลตัดส่วน Sharing ออกแล้วเพิ่ม Memories เข้ามาแทนให้เป็นกิจลักษณะ เมนูแบบใหม่คือ Photos, Memories, Library, Search</p>\n<p>หน้าหลักของ Memories รวมทุกอย่างเกี่ยวกับภาพเก่าๆ โดยแสดงผลเป็นแบบ timeline scrapbook เหมือนสมุดสะสมภาพในอดีต ยังใช้ AI ช่วยคัดเลือกภาพให้อัตโนมัติแต่ผู้ใช้ก็ปรับแต่งเองได้ ก่อนแชร์ให้เพื่อนหรือครอบครัวได้ ฟีเจอร์ใหม่อีกอย่างคือสามารถชวนคนอื่นมาร่วมสร้าง memories ได้แล้ว โดยใช้ภาพจากไลบรารีของแต่ละคน (ที่อยู่ในเหตุการณ์เดียวกัน แต่คนละมุมมอง) มาใส่ใน memories อันเดียวกันได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e13fa951f93e697732e16333ae860968.jpg\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/80a8ef6c5e3fdd612aea07b911f2d484.png\" /></p>\n<p>ฟีเจอร์ใหม่อีกอันที่น่าสนใจคือ ใช้ AI ช่วยตั้งชื่อ memories โดยอิงจากภาพและข้อมูลสถานที่ในภาพ รูปแบบคือมีปุ่มไม้กายสิทธิ์ Help me title แบบเดียวกับใน Gmail/Google Workspace ขึ้นมาให้กด แล้ว AI ของกูเกิลจะสร้างชื่อมาให้เลือก 3 แบบ ซึ่งเราสามารถเปลี่ยนหรือแก้ไขได้ด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4d0b018046d33890c77afabb290fbefe.png\" /></p>\n<p>ที่มา - <a href=\"https://blog.google/products/photos/google-photos-memories-view/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-photos\">Google Photos</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bb064ee37ad29ef76d9c238f5fd0a60f3a4a25ee7e17a475fa7120d0dd656e0f","category":"Thai"}