{"title":"Revealing High‐Temporal‐Resolution Flood Evolution With Low Latency Using GRACE Follow‐On Ranging Data","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036332?af=R","date":1718443790000,"content":"<h2>Abstract</h2>\n<p>An emerging approach is utilizing the line-of-sight gravity difference (LGD) between the twin Gravity Recovery and Climate Experiment Follow-On (GFO) satellites to refine the temporal resolution of water storage estimates from 1 month to days, thus making the data applicable to transient extreme climate events like floods. However, applying the approach to medium-scale climate events (with mass changes of several tens of gigatons) is challenging due to surrounding signal contamination and low signal-to-noise ratios. To address this problem, this study develops an improved algorithm accounting for peripheral signal sources and temporal correlations in mass variation. Two floods in July 2021 in Western Europe and Central China (CC) are chosen as case studies to demonstrate our approach's applicability to moderate floods in complex hydrological settings. The results present the temporal progression of the floods up to a maximum of ∼40 Gt with a scale of 3–5 days. However, the GFO-derived water gain in CC is much lower than expected values from land surface models, indicating a mass deficit during the flood. We find that the potent manipulation of water resources by human activities might impact the predictive capabilities of these models, thereby misrepresenting the hydrological evolution during the flood event. This study refines the viability of applying GFO data to restore transient dynamics characterizing extreme climate events of ∼20 Gt magnitude. We also provide insights on the use of LGD data for high-temporal-resolution estimation of water storage changes and underscore the non-negligible influence of human interventions on short-term hydrological dynamics.</p>","author":"Hao‐si Li, \nShuang Yi, \nZi‐ren Luo, \nPeng Xu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"bb0dcdc6762f1cad695f2e5a1da8ec24ebcea9a54a615100d5970fec7459acc2","category":"Environment"}