{"title":"The White House has its own pharmacy—and, boy, was it shady under Trump","link":"https://arstechnica.com/?p=1998430","date":1706057553000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-white-house-800x450.jpg\" alt=\"The White House seen in the early evening.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-white-house.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=creative&amp;photographer=Erik+Pronske\">Getty Images | Erik Pronske Photography</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according to a <a href=\"https://media.defense.gov/2024/Jan/09/2003373440/-1/-1/1/DODIG-2024-044_REDACTED%20SECURE.PDF\">recent investigation report from the Department of Defense’s Office of the Inspector General</a>.</p>\n<p>For years, the White House Medical Unit, run by the White House Military Office, provided the full scope of pharmaceutical services to senior officials and staff—it stored, inventoried, prescribed, dispensed, and disposed of prescription medications, including opioids and sleep medications. However, it was not staffed by a licensed pharmacist or pharmacy support staff, nor was it credentialed by any outside agency.</p>\n<p>The operations of this pseudo-pharmacy went as well as one might expect, according to the DoD OIG's alarming investigation report. The investigation was prompted by complaints in May 2018 alleging that an unnamed \"senior military medical officer\" was engaged in \"improper medical practices.\" This resulted in the OIG's investigation, which included 70 interviews of military office officials who worked in the White House between 2009 and 2018 and covers the office's activity until early 2020. However, the investigation heavily focused on prescription drug records and care between 2017 and 2019 during the Trump administration.</p></div><p><a href=\"https://arstechnica.com/?p=1998430#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998430&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bb13c80c00b0f347825853cd8856eb9b02166a99f211396fe186dba5fdbf73ad","category":"Tech"}