{"title":"Exploring the effects of habitat management on grassland biodiversity: A case study from northern Serbia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301391","date":1711634400000,"content":"<p>by Dubravka Milić, Milica Rat, Bojana Bokić, Sonja Mudri-Stojnić, Nemanja Milošević, Nataša Sukur, Dušan Jakovetić, Boris Radak, Tamara Tot, Dušanka Vujanović, Goran Anačkov, Dimitrije Radišić</p>\r\n\r\nGrasslands represent a biodiversity hotspot in the European agricultural landscape, their restoration is necessary and offers a great opportunity to mitigate or halt harmful processes. These measures require a comprehensive knowledge of historical landscape changes, but also adequate management strategies. The required data was gathered from the sand grasslands of northern Serbia, as this habitat is of high conservation priority. This area also has a long history of different habitat management approaches (grazing and mowing versus unmanaged), which has been documented over of the last two decades. This dataset enabled us to quantify the effects of different measures across multiple taxa (plants, insect pollinators, and birds). We linked the gathered data on plants, pollinators, and birds with habitat management measures. Our results show that, at the taxon level, the adopted management strategies were beneficial for species richness, abundance, and composition, as the highest diversity of plant, insect pollinator, and bird species was found in managed areas. Thus, an innovative modelling approach was adopted in this work to identify and explain the effects of management practices on changes in habitat communities. The findings yielded can be used in the decision making as well as development of new management programmes. We thus posit that, when restoring and establishing particular communities, priority needs to be given to species with a broad ecological response. We recommend using the decision tree as a suitable machine learning model for this purpose.","author":"Dubravka Milić","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bb198456a329100202c9491aa193b967fbf71deb4dfd12d141744d396dcb097f","category":"Interdisciplinary"}