{"title":"The best new iOS 17 feature is a toggle","link":"https://www.macworld.com/article/1944553/ios-17-beta-feature-clean-up-verification-codes-automatically.html","date":1686136500000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a> is here and there are a lot of cool new features. You can get a live readout of a voicemail being left in case the call is more important than you thought. You can customize your contact to give a little personality to incoming calls. And if you flip your iPhone on its side when charging, you’ll enter StandBy mode with full-screen widgets, Live Activities, and Siri results.</p>\n\n\n\n<figure><div>\n<blockquote><p>In iOS 17, you can now have verification codes be auto-deleted in both Messages and Mail <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/SOBLaRjl0W&amp;xcust=1-1-1944553-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/SOBLaRjl0W</a></p>— Aaron (@aaronp613) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/aaronp613/status/1665837591336189959?ref_src=twsrc%5Etfw&amp;xcust=1-1-1944553-1-0-0&amp;sref=https://www.macworld.com/feed\">June 5, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>But the coolest new feature is one you didn’t hear on the main stage. It’s a simple toggle in the Passwords settings that offers to automatically “clean up” verification codes. Turn it on and your Mail and Messages apps will automatically delete those annoying one-time password emails and texts cluttering your inboxes.</p>\n\n\n\n<p>It’s a simple feature that didn’t make it into the keynote or the key features graphic. But it’s the one that everyone will love the most. (We also think the feature that automatically fills one-time password codes from emails as well as texts will be popular.) The good news is you don’t have to wait—Apple has <a href=\"https://www.macworld.com/article/1944275/ios-17-developer-beta-accidentally-made-available-to-all.html\">opened up the developer beta to everyone</a>, so if you don’t mind a few bugs and the occasional crash, go try out the best toggle ever right now.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bb206d6d9038f21ffd11ba0775687014e2557461d256a92f423e32089639b3f8","category":"Apple"}