{"title":"Impact of recurrent intermittent flooding on the yield and growth of Elaeis guineensis","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12925?af=R","date":1719192864000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b9f88c98-812f-4e94-b327-a575b9d84793/aab12925-toc-0001-m.png\" alt=\"Impact of recurrent intermittent flooding on the yield and growth of Elaeis guineensis\" />\n<p>An oil palm trial in Terengganu, Malaysia, was inundated with severe flooding within a year after planting and several times in the years thereafter. Compared to oil palms in non-flooded trials, palms that experienced recurrent but intermittent high flooding generally exhibited poorer fruit yields, and reduced vertical growth with poorer canopy cover. Young oil palms that experienced recurrent intermittent low flooding depths demonstrated higher survival rates and generally produced comparable yields to palms in non-flooded areas.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Increased frequency and severity of flooding are linked to global warming. Flooding stress can severely affect crop yields and plant survival, and therefore the livelihoods of farmers. An oil palm breeding trial plot consisting of six progenies in Terengganu, Malaysia, happened to be inundated with flooding within a year after planting and annually for 2 years thereafter. Flooding recurred at the 8th year of planting and several times after that within the 14-year period of monitoring. Due to the uneven terrain in this trial, palms were exposed to various flood levels and were categorized into two flooding groups. Yields and survivability of the palms were not affected by low-flood levels, in contrast to the palms in lower areas that experienced higher flood levels. Compared to neighbouring non-flooded trials, palms exposed to high floodwaters generally experienced lower fruit yields, and reduced vertical growth with poorer canopy cover. However, one of the progenies that exhibited a moderate survival rate in high-flooded areas outperformed the other progenies in terms of yield in these areas. Generally, young oil palms exposed to low floods were able to survive and produce yields that were comparable to palms in non-flooded areas, though 10%–20% of the low-flooded palms produced poor yields in the first 3–5 years. In high-flooded areas however, oil palm survivability ranged from 45% to 73% during the early 3 years and 46%–89% thereafter. Hence, young palms exposed to recurrent flooding of approximately more than 1 m during their early years are likely to become poor yielders with poor survival rates. Observations from this study may assist oil palm farmers in the management of this crop in the event of unexpected flooding.</p>","author":"Ahmad Malike Fadila, \nKian‐Wah Liew, \nZulkifli Yaakub, \nSiew‐Eng Ooi","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"bb211a0dcff65dbc80ddc5cfed4190ad89946e3597380d5eb8cf6a22638c08bf","category":"Environment"}