{"title":"บอสใหญ่ Epic เดือด หลัง Apple แบน Fortnite ต่อยาว จนกว่าคดีในชั้นศาลทั้งหมดจะสิ้นสุด","link":"https://www.blognone.com/node/124908","date":1632392262000,"content":"<div><div><div><p>หลังคดี Epic v Apple มีคำตัดสินจากศาลชั้นต้น ซึ่งมีแง่มุมที่ทั้ง <a href=\"https://www.blognone.com/node/124713\">Apple</a> และ <a href=\"https://www.blognone.com/node/124717\">Epic</a> มองได้ว่าตนเองเป็นฝ่ายชนะ แต่ Apple ก็มีคำตัดสินที่ได้เปรียบกว่าหลายแง่มุม</p>\n<p>ศาลยืนยันว่า Apple ไม่ได้เป็นผู้ผูกขาด (monopolist) และยืนยันว่าแอปเปิลทำหน้าที่รักษาความปลอดภัยให้ทั้งผู้ใช้และนักพัฒนา รวมถึง Epic ละเมิดสัญญาของ Apple ที่มีผลบังคับใช้ได้ตามกฎหมาย ส่วน Epic ก็ยื่นอุทธรณ์ให้ศาลพิจารณาคดีในชั้นต่อไป</p>\n<p>ก่อนหน้านี้ Apple หลังมีคำตัดสิน Epic มีท่าทางอ่อนลง และใน<a href=\"https://twitter.com/TimSweeneyEpic/status/1440711578819567622\">จดหมายถึง Apple</a> ก็ดูพร้อมจะ “เล่นตามกฎ” มากขึ้น โดยยอมจ่ายเงิน 6 ล้านดอลลาร์ตามที่ศาลสั่ง ยอมปิดระบบจ่ายเงินจากฝั่งเซิฟเวอร์ของ Epic เอง และยืนยันจะทำตามกฎ เพื่อให้ได้สิทธิ์ developer กลับคืนมา และให้ Fortnite กลับไปอยู่บนทั้ง Mac และ iOS ได้ตามเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9f7f0317c895625a98cd89e05b74ee10.jpg\" /></p>\n<p>แต่ <a href=\"https://twitter.com/TimSweeneyEpic/status/1440711772483186690\">Apple กลับปฏิเสธ</a> ไม่ยอมให้ Developer Account กับ Epic พร้อมอ้างเหตุผลว่า Apple ชนะคดี, Epic จงใจละเมิดสัญญา และเป็นเพราะ Tim Sweeney ออกมาโพสต์เป็นสาธารณะหลังศาลตัดสิน ว่า “จะ [ไม่ยอมแลกวิธีการจ่ายเงินอื่น] เพื่อให้ Fortnite กลับไปอยู่บน iOS” จึงจะแบน developer account ของ Epic ต่อ จนกว่าคดีในชั้นศาลจะสิ้นสุด และไม่สามารถอุทธรณ์ต่อได้อีก ซึ่งอาจกินเวลาถึง 5 ปี</p>\n<p>คำปฎิเสธนี้ทำให้ Tim Sweeney เดือด ทวิตยาว สาธยายถึงคำโกหก และพฤติกรรมผูกขาดของ Apple โดย Tim บอกว่า Apple โกหก ในเรื่องที่เคยบอกว่ายินดีรับ Epic กลับเข้าสู่ระบบ หากเล่นตามกฎเหมือนคนอื่น ซึ่ง Epic ก็ยอมแล้ว แต่ Apple ก็ยังมีพฤติกรรมที่ทำให้ความสามารถในการแข่งขันในวงการ metaverse ของ Fortnite ต่ำลงไปอีก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/34f41c052a113daf99ff02ce0d38a919.jpg\" /></p>\n<p>Tim บอกอีกว่าเหตุผลที่ Apple อ้างมาไม่มีน้ำหนัก เพราะเรื่องที่เปลี่ยนไปหลังศาลตัดสินเมื่อ 10 กันยายนก็มีแค่ Epic ยื่นอุทธรณ์ และทวิตที่เขาออกมาโพสต์ ซึ่ง<a href=\"https://twitter.com/TimSweeneyEpic/status/1440712310339694592\">เขาบอกว่า Apple จงใจตีความทวิตเขาผิด</a> เพราะทวิตของเขาพูดถึงเรื่องอนาคตของวงการแพลตฟอร์มและ metaverse เท่านั้น และบอกว่าจะไม่ยอมแลกอิสระภาพกับการให้ Fortnite กลับไปอยู่บน iOS ต่างหาก ไม่เกี่ยวกับช่องทางจ่ายเงินอื่น</p>\n<p>เขา<a href=\"https://twitter.com/TimSweeneyEpic/status/1440712760828907530\">ทิ้งท้ายว่า Fortnite</a> ไม่ควรถูกแบล็กลิสต์เพราะต่อต้านพฤติกรรมที่ศาลยังเห็นว่าไม่ชอบด้วยกฎหมาย และจะสู้ต่อไป</p>\n<p>อย่างไรก็ตาม <a href=\"https://www.documentcloud.org/documents/21060696-epic-v-apple-ruling\">คำตัดสินของศาลชั้นต้นเมื่อ 10 กันยายน</a> ระบุให้สิทธิ์ Apple ในการกระทำนี้เต็มที่ โดยมีข้อความระบุว่า \"การยกเลิก DPLA (Developer Program License Agreement - ข้อตกลงการใช้งานสำหรับนักพัฒนา) และข้อตกลงที่เกี่ยวข้องระหว่าง Epic Games กับ Apple นั้น ถูกต้อง เป็นไปตามกฎหมาย และบังคับใช้ได้\" และระบุว่า Apple สามารถยกเลิกข้อตกลงกับ Epic และบริษัทในเครือ \"เมื่อไรก็ได้ตามดุลพินิจของ Apple\" และ Fortnite ก็คงถูกกีดกันจากระบบของ Apple ไปอีกนาน</p>\n<blockquote><p>Apple lied. Apple spent a year telling the world, the court, and the press they’d \"welcome Epic’s return to the App Store if they agree to play by the same rules as everyone else\". Epic agreed, and now Apple has reneged in another abuse of its monopoly power over a billion users.</p>\n<p>— Tim Sweeney (@TimSweeneyEpic) <a href=\"https://twitter.com/TimSweeneyEpic/status/1440711467888615431?ref_src=twsrc%5Etfw\">September 22, 2021</a></p></blockquote>\n<p>ที่มา - <a href=\"https://www.pcgamer.com/apple-blacklists-epic-wont-allow-fortnite-back-on-the-app-store/\">PC Gamer</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/lawsuit\">Lawsuit</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bb215dcbcf54f4d2c765322394362a238d6c27783829bb103e397f976530a885","category":"Thai"}