{"title":"NADPH oxidase-mediated sulfenylation of cysteine derivatives regulates plant immunity","link":"https://academic.oup.com/jxb/article/75/15/4641/7641151?rss=1","date":1712275200000,"content":"<span><div>Abstract</div>Reactive oxygen species (ROS) are rapidly generated during plant immune responses by respiratory burst oxidase homolog (RBOH), which is a plasma membrane-localized NADPH oxidase. Although regulatory mechanisms of RBOH activity have been well documented, the ROS-mediated downstream signaling is unclear. We here demonstrated that ROS sensor proteins play a central role in ROS signaling via oxidative post-translational modification of cysteine residues, sulfenylation. To detect protein sulfenylation, we used dimedone, which specifically and irreversibly binds to sulfenylated proteins. The sulfenylated proteins were labeled by dimedone in <span>Nicotiana benthamiana</span> leaves, and the conjugates were detected by immunoblot analyses. In addition, a reductant dissociated H<sub>2</sub>O<sub>2</sub>-induced conjugates, suggesting that cysteine persulfide and/or polysulfides are involved in sulfenylation. These sulfenylated proteins were continuously increased during both pattern-triggered immunity (PTI) and effector-triggered immunity (ETI) in a RBOH-dependent manner. Pharmacological inhibition of ROS sensor proteins by dimedone perturbated cell death, ROS accumulation induced by INF1 and MEK2<sup>DD</sup>, and defense against fungal pathogens. On the other hand, Rpi-blb2-mediated ETI responses were enhanced by dimedone. These results suggest that the sulfenylation of cysteine and its derivatives in various ROS sensor proteins are important events downstream of the RBOH-dependent ROS burst to regulate plant immune responses.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"bb2fabe5f745ebb6fe48101e753aff7f2c85a90c1b32a3815cd7b32993923ca0","category":"Environment"}