{"title":"Screening the polymeric membrane toxic metals ion‐selective electrodes with multiple high‐response performances using electrode quality index","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12926?af=R","date":1715302131000,"content":"<h2>Abstract</h2>\n<p>Toxic metal ion-selective electrodes (TM-ISEs) with simultaneously multiple high-response properties (MHRPs) are urgently needed for continuous monitoring of contaminated water environment. Still, scarce reports exist from research in which electrodes developed possess those properties. To overcome this challenge, we previously proposed an <i>I</i>\n<sub>ECQ</sub> index method for obtaining a few of Pb<sup>2+</sup>-ISEs with MHRPs and a universal approach for selecting referable values of response characteristic ([<i>RC</i>]<sub>refer</sub>) for normalization. This research aims to select electrodes with MHRPs from 391 collected electrodes for five kinds of TM (Cd, Cu, Hg, Ag or Zn)-ISEs (TM-ISEs) reported in the literature, through the <i>I</i>\n<sub>ECQ,i</sub> indices and the study of the <i>I</i>\n<sub>ECQ</sub> screening capacity, that is, the magnitude of <i>I</i>\n<sub>ECQ</sub> coverage. The higher coverages, from 63.60% to 100%, of four categories <i>I</i>\n<sub>ECQ,i</sub> (<i>I</i>\n<sub>ECQ,2</sub>\n<sup>B</sup>, <i>I</i>\n<sub>ECQ,3</sub>\n<sup>C</sup>, etc.) to electrodes with high performance are observed, indicating their good screening abilities. For eight diverse needs, the 21 screened electrodes have MHRPs, and their excellent performances are comparable with those used in real-time monitoring. The reliability of the monitored results would be improved if they were applied to the actual detection of TM ions.</p>","author":"Lingzhi Sun, \nChengjun Sun, \nXianxiang Sun","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"bb2fe1a943847fa8bfd9b5a00a084494f8f927b85ab940e279c2df96e6fba25e","category":"Environment"}