{"title":"Kelp and sea urchin settlement mediated by biotic interactions with benthic coralline algal species","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13420?af=R","date":1712751025000,"content":"<h2>Abstract</h2>\n<p>Species interactions can influence key ecological processes that support community assembly and composition. For example, coralline algae encompass extensive diversity and may play a major role in regime shifts from kelp forests to urchin-dominated barrens through their role in inducing invertebrate larval metamorphosis and influencing kelp spore settlement. In a series of laboratory experiments, we tested the hypothesis that different coralline communities facilitate the maintenance of either ecosystem state by either promoting or inhibiting early recruitment of kelps or urchins. Coralline algae significantly increased red urchin metamorphosis compared with a control, while they had varying effects on kelp settlement. Urchin metamorphosis and density of juvenile canopy kelps did not differ significantly across coralline species abundant in both kelp forests and urchin barrens, suggesting that recruitment of urchin and canopy kelps does not depend on specific corallines. Non-calcified fleshy red algal crusts promoted the highest mean urchin metamorphosis percentage and showed some of the lowest canopy kelp settlement. In contrast, settlement of one subcanopy kelp species was reduced on crustose corallines, but elevated on articulated corallines, suggesting that articulated corallines, typically absent in urchin barrens, may need to recover before this subcanopy kelp could return. Coralline species differed in surface bacterial microbiome composition; however, urchin metamorphosis was not significantly different when microbiomes were removed with antibiotics. Our results clarify the role played by coralline algal species in kelp forest community assembly and could have important implications for kelp forest recovery.</p>","author":"Brenton A. Twist, \nFlorent Mazel, \nStefanie Zaklan Duff, \nMatthew A. Lemay, \nChristopher M. Pearce, \nPatrick T. Martone","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"bb319d1af810af5addb4455daacc62ec3c117e21db636fb80957d6bd06ccd1a7","category":"Environment"}