{"title":"PSVII-3 Genome-wide association study for first-lactation fertility traits in dairy cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/439/7757043?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Infertility has been a leading cause of economic loss for the dairy industry. It accounts for a total net loss of $259 per poor fertility cow per year compared with a cow with optimal fertility due to decreased milk production, non-pregnant cows, the inability to sell calves, wasted AI, and management costs. Thus, the goal of this study was to perform genome-wide association studies (GWAS) to identify significant single nucleotide polymorphisms (SNPs), genes, and biological pathways associated with age at first calving (AFC), calving ease (EASE) and interval from calving to first time bred (CFSI), and of first-lactation cow. The GWAS was performed on medium (100k SNPs) and high-density (700k SNPs) SNP panels on 2,121 Holstein and Jersey cows from three dairy herds in California. For each trait, univariate single SNP mixed model association analysis, implemented in GCTA software, was performed including breed and herd year interaction as fixed effects and the animal as random effect. The SNP was declared significant at a 5% false discovery rate (FDR) and on a suggestive level of significance for the top 100 significant. Two SNPs on chromosomes 18 and 21 were detected significant at 5% FDR for CFSI. Chromosomes 3, 10, 18, and 25, were found to hold associated regions from 100K. In-silico functional analyses were performed on the mapped genes using DAVID software to identify associated biological mechanisms and pathways. The enriched biological pathways were found to be regulation of plasma membrane organization (<span>P</span> = 0.016) for AFC, regulation of blood circulation (<span>P</span> = 0.03) for CFSI, and chemotaxis (<span>P</span> = 0.004) for EASE. The plasma membrane contains specialized domains abundant in sterols, a component previously shown to allow sperm to fertilize. Establishing blood flow to the reproductive tract is vital as it is the sole pathway of nutrient transport, and increasing blood circulation is needed to support fetal growth. A previous study confirmed a link between chemotactic activity of placental tissue and placental expulsion. These results will be further validated in relatively unrelated populations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bb3588067d9f1afd82e01ec591db1799305fcd39dab650d9425a59a78ed470e0","category":"Environment"}