{"title":"Numerical Investigation of Confluence Flow in a Degraded Bed under Different Hydraulic Parameters, Using SSIIM 2.0","link":"http://link.springer.com/10.1007/s11269-024-03818-8","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>River interaction is a problematic place in hydraulic engineering. This is rooted in creating an intricate behavior that leads to the development of vortex flow at the intersections and results in sediment deposition in these areas. This phenomenon depends on various factors, from flow rate ratio, intersection angle, channel geometry, longitudinal slope to bed resistance, and lateral channel width ratio to the main channel. Studying flow patterns is a necessary action that can assist in predicting the changes in bed morphology and preventing issues, such as main channel blockage while increasing the flow rate in the main channel. The SSIIM2.0 model's capacity to simulate three-dimensional flow at a confluence was used to examine the effects of bed morphology and flow parameters on junction angle, flow rate ratio, and lateral channel width ratio. With correlation values of 0.9 and 0.68 for velocity and bed profiles, the results show that this model can reasonably predict these variables. Additionally, the effect of various junction angles (45, 60, 75, 90, and 105 degrees) on hydraulic flow, particularly maximum bed shear stress, temporal variation of shear stress, and dimensions of the separation area, were examined. At the 45° angle, a significant separation area was not observed, but the results showed that with an increase in the junction angle, the dimensions of the separation area are increased. Dimensionless length of the separation zone has decreased by 18% due to a change in the connection angle from 60° to 105°. Meanwhile, the width of the separation zone has increased by 60%. Furthermore, the results indicate that increasing the tributary angle from 45° to 105° resulted in a 91.8% increase in maximum bed shear stress at the junction location.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"bb38156e1b06d5cfdfe28ca7cf3c2320cd783576a5d85cc85ebea0efd7bd8d5a","category":"Environment"}