{"title":"The illusion of information adequacy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310216","date":1728482400000,"content":"<p>by Hunter Gehlbach, Carly D. Robinson, Angus Fletcher</p>\r\n\r\nHow individuals navigate perspectives and attitudes that diverge from their own affects an array of interpersonal outcomes from the health of marriages to the unfolding of international conflicts. The finesse with which people negotiate these differing perceptions depends critically upon their tacit assumptions—e.g., in the bias of naïve realism people assume that their subjective construal of a situation represents objective truth. The present study adds an important assumption to this list of biases: <i>the illusion of information adequacy</i>. Specifically, because individuals rarely pause to consider what information they may be missing, they assume that the cross-section of relevant information to which they are privy is sufficient to adequately understand the situation. Participants in our preregistered study (<i>N =</i> 1261) responded to a hypothetical scenario in which control participants received full information and treatment participants received approximately half of that same information. We found that treatment participants assumed that they possessed comparably adequate information and presumed that they were just as competent to make thoughtful decisions based on that information. Participants’ decisions were heavily influenced by which cross-section of information they received. Finally, participants believed that most other people would make a similar decision to the one they made. We discuss the implications in the context of naïve realism and other biases that implicate how people navigate differences of perspective.","author":"Hunter Gehlbach","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bb39b66a5c08081dccedde18346488f8244877b84415534b7f5404cd0a8f6280","category":"Interdisciplinary"}