{"title":"Interplay of cooperative breeding and predation risk on egg allocation and reproductive output","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae010/7615682?rss=1","date":1709078400000,"content":"<span><div>Abstract</div>Predation risk can influence behavior, reproductive investment, and, ultimately, individuals’ fitness. In high-risk environments, females often reduce allocation to reproduction, which can affect offspring phenotype and breeding success. In cooperative breeders, helpers contribute to feed the offspring, and groups often live and forage together. Helpers can, therefore, improve reproductive success, but also influence breeders’ condition, stress levels and predation risk. Yet, whether helper presence can buffer the effects of predation risk on maternal reproductive allocation remains unstudied. Here, we used the cooperatively breeding sociable weaver <span>Philetairus socius</span> to test the interactive effects of predation risk and breeding group size on maternal allocation to clutch size, egg mass, yolk mass, and yolk corticosterone. We increased perceived predation risk before egg laying using playbacks of the adults’ main predator, gabar goshawk (<span>Micronisus gabar</span>). We also tested the interactive effects of group size and prenatal predator playbacks on offspring hatching and fledging probability. Predator-exposed females laid eggs with 4% lighter yolks, but predator-calls’ exposure did not clearly affect clutch size, egg mass, or egg corticosterone levels. Playback-treatment effects on yolk mass were independent of group size, suggesting that helpers’ presence did not mitigate predation risk effects on maternal allocation. Although predator-induced reductions in yolk mass may decrease nutrient availability to offspring, potentially affecting their survival, playback-treatment effects on hatching and fledging success were not evident. The interplay between helper presence and predator effects on maternal reproductive investment is still an overlooked area of life history and physiological evolutionary trade-offs that requires further studies.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"bb3b27f3e4c934209e97bfa17ac833ab086f91ae2f7583d0b4f42fb9dee0bf6b","category":"Environment"}