{"title":"Grain size and sediment load control on channel migration patterns of the Ghaghara river from Faizabad to Deoria, Ganga plain, India","link":"http://link.springer.com/10.1007/s12517-024-12104-1","date":1728604800000,"content":"<h3>Abstract</h3>\n                    <p>This present study investigates grain size, sediment dynamics and lateral erosion processes along the Ghaghara River from Faizabad to Deoria, Ganga Plain, India. The grain size analysis reflects that surface sediments have silt (24.50%) and very coarse silty-sand (75.50%) composition. The mean grain size varies from 2.20 to 4.21 ϕ indicating fine sand to very coarse silt. The Skewness, which varies from 0.01 to 0.48 ϕ, indicates the dominance of fine-grain sediments. The kurtosis varying from 0.66 to 1.38 ϕ explains the dominance of finer sediments. The standard deviation varies from 0.78 to 1.36 ϕ, thus indicating poorly sorted to moderately sorted and fluctuation in energy of the depositional environment. These river valley deposits (sand and very coarse-grained silt) reflect a depositional environment under fluctuating energy conditions. This river is characterized by the variable discharge frequency and high sediment load. The lateral erosion has been monitored during field work near Sita Rampur (Faizabad), Kamhariya (Ambedkar Nagar), Gola Bazar, and Barhalganj (Gorakhpur). The river migration observed on the left valley side (NNE) is 6144, 4838, 6475, and 4755 m and on the right valley side (SSW) 7021, 4555, 4718, and 4257 m between 1975–1990, 1975–2000, 1975–2010, and 1975–2020, respectively. In addition, the presence of sandy and silty facies and sediment load in the river valley deposits enhances the lateral erosion. This recent investigation of sediment dynamics and lateral erosion phenomena will advance river management and environmental preservation in the area.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"bb4cee323f29acf29cb9c70e680f78d01cfb8b8e869cb27bf6f73361e46ed57b","category":"Environment"}