{"title":"America’s ‘Wokeness’ Divide Is Not About Level of Education","link":"https://www.theatlantic.com/politics/archive/2021/11/young-people-college-grads-wokeness/620674/","date":1636658003000,"content":"\n<p>Olga Khazan, writing for The Atlantic:</p>\n\n<blockquote>\n  <p>But according to a recent Atlantic/Leger survey, no gap exists\nbetween people with college degrees and those without them on some\nof the hot topics most commonly associated with “wokeness.”\nInstead, neither group endorses the supposedly “woke” positions\nparticularly strongly. Though the term <a href=\"https://www.vox.com/culture/21437879/stay-woke-wokeness-history-origin-evolution-controversy\">originated</a> in the\nBlack community, <em>woke</em> now lacks a standard definition, and is\nsometimes used as a catchall label for a group of only loosely\nrelated ideas. People often use the term to describe neologisms\nthat are more popular among progressives, such as <a href=\"https://www.theatlantic.com/politics/archive/2021/09/pregnant-people-gender-identity/620031/\"><em>pregnant\npeople</em></a>, as well as policy choices advocated for by some on\nthe left, such as defunding the police. In our poll, we also\nincluded reverse-coded statements, meant to capture whether\nsomeone was the opposite of “woke,” by asking about common\nright-wing shibboleths such as political correctness, “cancel\nculture,” and <a href=\"https://www.theatlantic.com/politics/archive/2021/05/gops-critical-race-theory-fixation-explained/618828/\">critical race theory</a>.</p>\n\n<p>For the poll, Leger surveyed a representative sample of 1,002\nAmerican adults from October 22 to October 24. We asked for\nrespondents’ agreements with various statements, shown in the\nchart below, that are often invoked by conservatives and moderates\nas being associated with people who are “woke.” The results showed\nthat there was no significant difference between people with\ncollege degrees and those without them on the question of whether\nAmerica is becoming too politically correct (slight majorities of\nboth groups agreed somewhat or strongly). The same was true for\nbelieving “cancel culture is a big problem in society” — 51\npercent of degree holders agreed, as did 45 percent of those\nwithout degrees.</p>\n</blockquote>\n\n<p>Long story short, it’s an age divide, not an education divide. But none of these “woke” positions are actually popular, even amongst the young.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/11/american-wokeness-divide\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"bb5005e4a96bdb97aa1a06c7f007d5ada399f988f3a5448768649817f9a9eb1e","category":"Tech"}