{"title":"Comparing the Outcomes of Matched and Mismatched Unrelated Allogeneic Hematopoietic Stem Cell Transplantation with Different Anti-thymocyte Globulin Formulations. A Retrospective, Double-Centre Experience on Behalf of the Polish Adult Leukaemia Group","link":"https://www.preprints.org/manuscript/202404.1232/v1","date":1713424541000,"content":"Despite notable advancements in immunotherapy in the past decades, allogeneic hematopoietic stem cell transplantation (allo-HCT) remains a promising, potentially curative treatment modality. Only a limited number of studies has performed a direct comparison of two prevalent rabbit anti-thymocyte globulin (r-ATG) formulations — specifically, Thymoglobuline (ATG-T, formerly Genzyme) and Grafalon (ATG-G, formerly Fresenius). The primary objective of our retrospective analysis was to compare the outcomes of adult patients undergoing matched or mismatched unrelated donor (MUD/MMUD) allo-HCT, with a graft-versus-host disease (GvHD) prophylaxis based on either ATG-T or ATG-G. A total of 87 patients undergone allo-HCT between 2012 and 2022 were included. We observed no significant differences between ATG-T and ATG-G concerning the occurrence of acute graft-versus-host disease (aGvHD), regardless of its severity. Conversely, chronic graft-versus-host disease (cGvHD) occurred less frequently in the ATG-T group compared to ATG-G (7.5% vs. 38.3%, p=0.001). Patients treated with ATG-T manifested a higher incidence of cytomegalovirus (CMV) reactivations (70% vs. 31.9%, p&amp;lt;0.001), with a shorter time between transplant and CMV (&amp;lt;61 days, 77.8% vs. 33.3%, p=0.008) and a higher median CMV copy number (1000 vs. 0, p=0.004). Notably, despite a higher occurrence of CMV reactivations in the ATG-T cohort, most patients were asymptomatic compared to ATG-G (85.7% vs. 43.8%, p=0.005). Finally, we observed no significant differences in terms of 5-year overall survival (OS) and 3-year probability of relapse while comparing ATG-T and ATG-G (32.0% vs 40.3%, p=0.423; 63.9% vs 55.7%, p=0.438, respectively).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bb52efc9497d82098db33e4eea73021add05ef276912d0497b3851ea38754d42","category":"Interdisciplinary"}