{"title":"Organizing Design Workshops: A Detailed Checklist","link":"https://smashingmagazine.com/2023/03/organizing-design-workshops-checklist/","date":1680181200000,"content":"<p>The more workshops you organize, the better you realize how similar they actually are, regardless of the methodology or tool used. I would like to share a comprehensive checklist that will help you prepare for any workshop and take care of all the tiny details (i.e., enablers of the workshop’s success).</p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/1-workshop-steps.png\" /></p>\nTable Of Contents\n<p>You can jump directly to the topic you’re interested in or <a href=\"#step-1-scoping\">browse through all the steps</a>. Enjoy!</p>\n<ul>\n  <li><a href=\"#step-1-scoping\">💁🏻‍♂️ Scoping</a></li><br />  <li><a href=\"#step-2-participants\">👯‍♀️ Participants</a></li>\n  <li><a href=\"#step-3-format\">⏳ Format</a></li>\n  <li><a href=\"#step-4-agenda\">💎 Agenda</a></li>\n  <li><a href=\"#step-5-risk-management\">📌 Risk management</a></li>\n</ul>\n\nStep 1: Scoping\n<h3>Problem</h3>\n<blockquote>The better you understand a problem, the smoother your workshop will be. If you cannot name a problem, the workshop will fall apart.</blockquote>\n\n<p>✅ <strong>What problem are you trying to solve?</strong></p>\n<p>Don’t skip this step while striving to come up with a robust solution. If you notice a workshop goes sideways at some point, you can always say, “Wait a minute. What problem are we trying to solve?” and refer to the agenda where it’s written.</p>\n<p>Remember to formulate the problem negatively <em>(risk of…, lack of…, low…, prefixes ‘un’ and ‘in’)</em>. Otherwise, it might not be a real problem but rather an attempt to push your preconceived solution.</p>\n<p>✅ <strong>Is a workshop the right choice?</strong></p>\n<p>Workshops are a tool. They require much preparation but help tackle problems where conventional methods — presentations or discussions — won’t help. Here is what workshops are capable of:</p>\n<ul>\n<li><strong>Align people</strong>: let them exchange opinions and reveal contradictions, not just be informed about something.</li>\n<li><strong>Reach agreements</strong>: resolve conflicts and create a joint action plan, vision, or set of principles.</li>\n<li><strong>Engage people</strong>: excite them about the topic and let them contribute.</li>\n<li><strong>Have fun</strong>: let the team also feel entertained during hard brainwork.</li>\n</ul>\n<p>If you want to share fully reliable and accurate information, there is no need to arrange a workshop; a simple meeting will do.</p>\n<h3>Context</h3>\n<blockquote>A problem doesn’t exist in a vacuum. There is a chance someone has tried to solve or investigate it before. Turn it to your advantage.</blockquote>\n\n<p>✅ <strong>What information is already available?</strong></p>\n<p>You don’t want people to write known information again from scratch (it’s just wasting their time) or hear such complaints as:</p>\n<ul>\n<li>“If only I knew you would need this, I would prepare it properly.”</li>\n<li>“We already have it, and here is a Confluence link.”</li>\n</ul>\n<p>✅ <strong>What information can you prepare in advance?</strong></p>\n<p>Starting from an empty canvas rarely works in actual business conditions, and here is how you can prepare:</p>\n<ul>\n<li>Partially pre-fill the workshop canvas with available facts.</li>\n<li>Create a structure where participants will add their information.</li>\n<li>Place essential reference information on the side of the canvas.</li>\n<li>Share pre-reading with participants (documents to review, Loom videos to watch, questionnaires to fill in, and so on).</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/2-user-registration-journey-map.png\" /></p>\n<h3>Expected Output</h3>\n<blockquote>Planning a workshop is thinking backward. Visualize the ideal result at the beginning, and you won’t be stuck while composing its agenda.</blockquote>\n\n<p>✅ <strong>What deliverable will you produce at the end?</strong></p>\n<p>Depending on the problem defined in the previous step, you may want to prepare a certain artifact after the workshop, for example:</p>\n<ul>\n<li>Not clear what to do → an action plan;</li>\n<li>Efforts without a focus → a list of priorities;</li>\n<li>Dependencies and many parallel projects → a roadmap;</li>\n<li>Broken processes → a guideline;</li>\n<li>Many contradicting opinions → a vision document;</li>\n<li>Lack of understanding → visualization or storyboard, and so on.</li>\n</ul>\n<p><strong>Note:</strong> <em>There might be an immediate deliverable right after the workshop and a more elaborate one to be created later.</em></p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/3-workshop-rating-topics.png\" /></p>\n<p>✅ <strong>Who and how will use this deliverable?</strong></p>\n<p>Think of it in advance not to produce something people won’t find useful (even if it’s objectively great). A few things to consider:</p>\n<ul>\n<li>A deliverable for workshop participants or a larger audience;</li>\n<li>For regular or one-time use;</li>\n<li>A final artifact or invitation to further discussion and contribution.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/4-summary-team-feedback.png\" /></p>\n<h3>Expected Outcome</h3>\n<blockquote>Apart from creating an immediate artifact, workshops are a great opportunity to make a long-lasting impact on the team.</blockquote>\n\n<p>✅ <strong>What long-term effect can this workshop have on your team?</strong></p>\n<p>In other words, with what feeling should participants leave the meeting room or Zoom call? For example:</p>\n<ul>\n<li>Higher transparency around who does what;</li>\n<li>Better alignment and trust;</li>\n<li>A new way of doing work and avoiding misunderstandings, and so on.</li>\n</ul>\n<p>✅ <strong>What other initiatives can build on the achievements of this workshop?</strong></p>\n<p>This is an optional point. If you skip it, nothing terrible will happen, but you might overlook an opportunity. Questions to answer here:</p>\n<ul>\n<li>If this workshop goes as expected, will you want to scale the success to other teams or topics?</li>\n<li>Can it serve as a role model for others? How can you show the value?</li>\n<li>What can be the next workshop to build upon the current one?</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/5-workshop-goals-further-steps.png\" /></p>\nStep 2: Participants\n<h3>Expertise, Role, And Experience</h3>\n<blockquote>Workshops are all about people. Even the best technique won’t help you extract good ideas from the minds of the wrong people.</blockquote>\n\n<p>✅ <strong>What expertise do you need to be present in the workshop?</strong></p>\n<p>Depending on the subject, you’ll need to involve people with suitable knowledge and skills:</p>\n<ul>\n<li>Technical (engineering, data science, quality assurance);</li>\n<li>User experience (design, research, content);</li>\n<li>Operations, marketing, finances, and so on.</li>\n</ul>\n<p>For example, you need to involve software engineers if you’ll talk about the feasibility and business logic, you need to go for customer support and operations specialists, researchers, product managers, and designers if the topic is about user experience, or you need all of them if you are going to identify problems and search for holistic solutions.</p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/6-expertise-journey-mapping-workshop.png\" /></p>\n<p>✅ <strong>Who exactly should participate?</strong></p>\n<p>When it comes to choosing particular people, you need to take into account their connection to the subject:</p>\n<ul>\n<li><strong>Topic promoters</strong><br />Who was involved in the workshop topic the most and consistently pushed it?</li>\n<li><strong>Domain experts</strong><br />Who is a go-to person for the topic? Is there anyone with deep knowledge of the subject? Remember: It’s often not the highest-ranking professional.</li>\n<li><strong>Local context</strong><br />If there are multiple representatives of the same role, do you want to involve people from countries where your business is in trouble or, let’s say, gets most of its profits?</li>\n</ul>\n<p>✅ <strong>Do you need decision-makers or knowledge-keepers? Or both?</strong></p>\n<p>There are workshops for gathering and structuring new information and workshops for decision-making with known data.</p>\n<p>Depending on participants’ positions and experience, they can be inclined to certain workshop activities. Of course, this is quite simplified, but it narrows down to the following:</p>\n<ul>\n<li><strong>Hands-on folks</strong> are exposed to the topic every day and can share and structure useful information. At the same time, they may lack a bird’s-eye view of the situation.</li>\n<li><strong>Managers</strong> have a mindset of analyzing data and making decisions on the overlap of different factors and limitations. However, they might not be the best source of precise information.</li>\n</ul>\n<p>✅ <strong>Do you need a co-facilitator, and who can it be?</strong></p>\n<p>If your team is large and enthusiastic about workshopping, you might need help with facilitation. Below are several examples of what a co-facilitator can help you with, depending on the workshop format.</p>\n<p><strong>Online workshops:</strong></p>\n<ul>\n<li>Help the participants, who were disconnected, to rejoin the call;</li>\n<li>Move disordered sticky notes into respective canvas cells;</li>\n<li>Remove accidentally created elements, fix mistakenly unlocked and moved canvas parts, and so on.</li>\n</ul>\n<p><strong>Offline workshops:</strong></p>\n<ul>\n<li>Put sticky notes that fell on the floor back into place;</li>\n<li>Quietly instruct participants who came late and missed the beginning;</li>\n<li>Gently invite not very active participants to the conversation, and so on.</li>\n</ul>\n<p>An optimal co-facilitator is a trusted team member who has participated in workshops before, understands workshop basics well, and is proficient with the tool (if you collaborate online).</p>\n<h3>Team Dynamics</h3>\n<blockquote>Do not only participants matter but also the way they interact with each other.</blockquote>\n\n<p>✅ <strong>How many representatives of one role or function do you need? How will you ensure equality?</strong></p>\n<p>When the list of expertise to involve is ready, it’s time to think about the number of people from each side. In a narrowly focused workshop, one expertise can prevail (for example, three-fourths of engineers for a technical feasibility workshop or more than half of product managers for product roadmap alignment).</p>\n<p>But if the workshop goal is to co-create a new solution to a large problem, you’ll need an equal representation of product management, design, UX research, software engineering, operations, marketing, customer support, data analysis, and others.</p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/7-product-team-structure-diagram.png\" /></p>\n<p>✅ <strong>Will you collaborate all together or split into working groups?</strong></p>\n<p>Efficient collaboration where everyone contributes equally is possible in groups of 3–5 people. When the team is larger, you’ll need to split it into workgroups. You can organize their work in two ways:</p>\n<ol>\n<li>Each group works on a separate aspect of a large problem.</li>\n<li>Groups work on the same problem in parallel and then exchange findings and find overlaps.</li>\n</ol>\n<p>The number of workgroups also depends on how many representatives of essential roles participate in the workshop. For example, if one of the exercises is sketching potential solutions, it would be helpful to have at least one designer in each workgroup. If the exercise is about mapping pain points on a journey map, having at least one customer support or operations specialist makes sense.</p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/8-canvas-educational-workshop-about-organizing-workshops.png\" /></p>\nStep 3: Format\n<blockquote>When the problem and relevant people are chosen, it’s time to think about how to use everyone’s time in the most productive way possible.</blockquote>\n\n<p><strong>✅ Format: online, offline, or hybrid? Several hours or full-day?</strong></p>\n<p>Many factors impact the format choice, for instance:</p>\n<ul>\n<li>Topic complexity → how much time will you need for it?</li>\n<li>Team location → can people gather offline without much traveling?</li>\n<li>Secondary goals → what about an informal part (party) afterward?</li>\n<li>Team size → how much space do you need?</li>\n</ul>\n<p>And here are the main workshop formats:</p>\n<ul>\n<li><strong>Online</strong> works the best when it’s shorter than 3–4 hours; otherwise, people will experience ‘Zoom fatigue’ and be quickly distracted. Complex topics can be split into several sessions instead of working non-stop the whole day.</li>\n<li><strong>Offline</strong> is preferable for all workshop types by default if the team is already collocated, or you can bring them together without too much cost and effort. Such a workshop can be up to several days long and combined with entertainment after work.</li>\n<li><strong>Hybrid</strong> is a rare and fragile format. It works fine when participants are equally distributed and fails when, let’s say, ten people are sitting in the room, and two persons join remotely. In this case, remote team members will eventually drop off the call or make an extra effort to stay as engaged as their colleagues in the room.</li>\n</ul>\n<p><strong>✅ A digital tool or paper canvas?</strong></p>\n<p>The format influences other workshop parameters, including how people accomplish exercises.</p>\n<ul>\n<li><strong>Digital tools</strong> are a great option for both offline and online workshops. The choice of a particular tool (FigJam, Miro, Mural, Whimsical, and so on) depends on team members’ skills. It’s always better to pick something they’ve already used or just something as simple as possible. It’ll save you quite a few precious workshop minutes.</li>\n<li><strong>Paper canvases</strong> and colored sticky notes are a good match for offline workshops or non-tech-savvy participants. They give a feeling of more valuable contribution and collaboration, but after the workshop, you’ll need to decode and digitize all the handwritten notes.</li>\n</ul>\n<p><strong>✅ How to inform people so that they attend and know what to do?</strong></p>\n<p>Satisfaction is a matter of expectations. That’s why it’s essential to set the right expectations. If team members lack awareness and alignment, even a perfect workshop is destined to fail before it even starts.</p>\n<p>The best approach is to blend in and use channels that people check regularly. If people don’t read emails, don’t spend time on them and better write a Slack message or compose a Google document.</p>\n<p>Information to share in advance:</p>\n<ul>\n<li><strong>Agenda</strong>: with all the major stages, coffee breaks, and lunch (no need to describe exercises in detail);</li>\n<li><strong>Tool-related instructions</strong>: if this is a new tool or if not everyone knows how to work with it;</li>\n<li><strong>Questions or topics</strong>: to think about in advance if you expect participants to have certain data at hand or think in a specific direction.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/9-slack-message-explaining-details-upcoming-workshop.png\" /></p>\nStep 4: Agenda\n<h3>Workshop Activities</h3>\n<blockquote>This part will take most of your time to prepare, but is the easiest one if you’ve checked all the boxes above.</blockquote>\n\n<p>✅ <strong>What will participants do in the workshop?</strong></p>\n<p>Formulate the plan on a high-level first, without diving into individual exercises. Try to fit it into one sentence.</p>\n<p>It may sound like this: “Vote for the previously discovered (pre-filled) UX issues, take three top-voted items for brainstorming, generate solution ideas, vote for the strongest ideas, make sketches of the top-voted ideas, vote for the most promising sketches for further prototyping.” </p>\n<p>Another example: “Write feedback about team collaboration in a matrix, group positive and negative feedback pieces by topics, rank the issues from minor to major ones, and assign people to solve five major issues.”</p>\n<p><strong>Note</strong>: <em>Feel free to check a <a href=\"https://shestopalov.medium.com/comprehensive-anatomy-of-all-ux-design-thinking-workshops-c416706cd3e2\">comprehensive anatomy of design workshops</a> where I dwell on typical ‘atomic’ activities all workshops consist of.</em></p>\n<p><strong>✅ What will each exercise be like?</strong></p>\n<p>When the general plan is ready, it’s time to think about the way you’ll organize each exercise, for example:</p>\n<ul>\n<li>How many sticky notes per participant will you give?</li>\n<li>Do you need to compose input examples so that people submit the information in a proper format?</li>\n<li>How many votes will you assign to participants? In what order should they vote (if offline)? And so on.</li>\n</ul>\n<p>✅ <strong>How much time will participants need for each exercise?</strong></p>\n<p>Usually, the simplest exercise requires 15–20 minutes, while more sophisticated ones may take 40–50 minutes. And don’t forget to include a few minutes to instruct the participants before each activity and summarize their contributions afterward. Besides, you cannot immediately dive into the workshop since people are a few minutes late and need to switch to a workshopping mood.</p>\n<p>However, every team has its own dynamics, that’s why accurate estimations are possible only after you conduct a couple of workshops and witness your teammates’ actual speed and engagement.</p>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/10-workshop-timeline.png\" /></p>\n<p>✅ <strong>Will you need to break the ice at the beginning and keep people energized during the workshop?</strong></p>\n<p>Unlike the main workshop activities, these ones play an auxiliary role and help you keep the team spirit high:</p>\n<ul>\n<li><strong>Ice-breaker or check-in</strong>: a fun exercise to fill the time while you are waiting for participants, help people get acquainted with each other, or create a creative mood in the team.</li>\n<li><strong>Warm-up or energizer</strong>: an intermediate short exercise between the sessions of concentrated work. Usually, it’s a physical activity like jumping or stretching.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/11-check-in-exercise-emoji.png\" /></p>\n<h3>Structure</h3>\n<blockquote>When you know what you need from people, you can pack it into a visual structure to help everyone grasp the topic.</blockquote>\n\n<p>✅ <strong>Input: where will participants get the information for each exercise?</strong></p>\n<p>Every exercise should be based on the previous one. You need to check if there are no logical gaps between the workshop stages.</p>\n<p>For example, if you want people to vote for the most critical problems with your digital product, you must get a list of problems first. In this case, ask people to write them down in the previous exercise or add them to the canvas yourself in advance.</p>\n<p>✅ <strong>Output: how will each exercise feed into the next one?</strong></p>\n<p>This is just a double-check that each next exercise will build upon the findings from the previous one. If the information from a previous step doesn’t go anywhere further, the team will be naturally curious about why you even asked them to share this data.</p>\n<p>✅ <strong>Canvas: what visual structure will help the team to contribute?</strong></p>\n<p>Information is clearer and more useful when it’s structured and visualized. Besides, participants can submit better data if you guide them with a relevant canvas. Depending on the workshop goal and expected outcome, you might choose one of the following structures:</p>\n<ul>\n<li>User journeys, storyboards, and project timelines: for time-based information like stories and processes;</li>\n<li>Matrices or ratings: for priorities and comparison;</li>\n<li>Tables, blueprints, and maps: for interconnected data;</li>\n<li>Mindmaps: for hierarchies, and so on.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/12-custom-canvas-cross-functional-feedback.png\" /></p>\nStep 5: Risk Management\n<p>Prevention is always better than a cure. When you involve many people in any activity, there will always be an element of ‘chaos’. But, like a seasoned standup comedian always finds a way out when they forget a joke or when a microphone stops working, the workshop facilitator should also have a trump up their sleeve just in case.</p>\n<blockquote>Workshops have many ‘moving parts’, which means things may not go as expected. So, having Plan B (and C, and D) is indispensable.</blockquote>\n\n<p>⚠️ <strong>Some people are skeptical and resist the workshop idea.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>One-on-one interviews with skeptics before the workshop to learn more about their concerns and expectations.</li>\n<li>A survey about expectations from the workshop and urgent needs.</li>\n<li>Asking about participants’ expectations at the beginning of the workshop and then comparing them to the actual result at the end.</li>\n<li>Sharing stories about similar successful workshops conducted with other teams in the company earlier.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>Figure out what the actual concern is and adjust if it makes sense.</li>\n<li>Invite the workshop ‘sponsor’ (usually a domain, product, or discipline manager) to explain to a skeptical participant why this activity is crucial and how the team will benefit from it.</li>\n<li>Ask people to stick to the agreed agenda since they received it in advance, and thus could’ve shared their concerns before the event instead of disrupting it.</li>\n</ul>\n<p>⚠️ <strong>You are about to exceed the planned timeline.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>Don’t let people discuss random things; politely interrupt and remind them about the workshop goal.</li>\n<li>Use a ‘parking lot’ for spin-off topics and questions. Don’t dismiss ideas but keep people focused on the subject.</li>\n<li>Split a large team into working groups where everyone can contribute more efficiently without long debates.</li>\n<li>Analyze previous workshops and how long it actually took people to do corresponding activities.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>Skip or shorten inessential workshop steps (if you have any).</li>\n<li>Predict the delay at least half an hour before the planned finish and openly announce it.</li>\n<li>Properly finish the last exercise, summarize intermediate results, and announce another session for later.</li>\n</ul>\n<p>⚠️ <strong>The online workshop tool stopped working.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>Use a reliable and robust tool that has good reviews.</li>\n<li>If participants have non-standard software or hardware setup, share a test canvas in advance so that they can try the tool and tell you if everything works fine.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>Wrap up the last step and schedule the workshop continuation.</li>\n<li>If the remaining exercise is simple, create an empty canvas in another tool and continue there.</li>\n</ul>\n<p>⚠️ <strong>The key people are absent.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>Talk with all the major stakeholders one-on-one in advance and make sure they understand why their participation is important.</li>\n<li>Choose the time slot when the key participants can attend.</li>\n<li>Reach out to people who haven’t confirmed the appointment in their calendars and ask them to respond.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>If you receive last-minute appointment rejections, reschedule the workshop as soon as possible.</li>\n<li>If the key people didn’t show up without any notification, reschedule the workshop or conduct a simplified session to gather preliminary information from the available people.</li>\n</ul>\n<p>⚠️ <strong>In the middle of a workshop, you suddenly discover the actual hidden problem that changes your initial plan.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>Choose a significant problem that people would have tried to solve anyway — with or without a workshop.</li>\n<li>Confirm the workshop topic and format with the key stakeholders.</li>\n<li>Send the workshop goal and agenda via a channel where participants will notice and, if needed, challenge it.</li>\n<li>Justify the presence of each participant; be able to explain to yourself and others why these people are invited and others aren’t.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>Wrap up the workshop and agree to organize another, more relevant team activity soon.</li>\n<li>Repurpose the existing workshop if you can use the same canvas and all the participants have sufficient expertise to work on the new problem.</li>\n</ul>\n<p>⚠️ <strong>People get distracted during the workshop.</strong></p>\n<p><em>How to prevent it:</em></p>\n<ul>\n<li>Don’t leave the team unattended for too long: even if the exercise needs a lot of time, split it into parts and check the progress, for example, every 20 minutes.</li>\n<li>Include a reasonable dose of fun and humor in exercises.</li>\n<li>Create a space for random stuff and jokes so that enthusiastic people can express themselves in a non-intrusive way.</li>\n<li>Set the right expectations: participants shouldn’t think they’ll be able to multitask during the workshop. If someone has an urgent task, let them leave the room/call and turn back later.</li>\n</ul>\n<p><em>When it has happened:</em></p>\n<ul>\n<li>Conduct an energizer/warm-up activity or give people a short break.</li>\n<li>Gently remind the team that you should achieve a certain result and that you don’t want to finish late or schedule another session, thus using everyone’s time inefficiently.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/organizing-design-workshops-checklist/13-check-in-exercise-meme-templates.png\" /></p>\nSummary\n<p>Design workshops are no rocket science. In the ideal world, there would probably be no workshops: people would just have common sense by default. Maybe, that’s why small, close-knit teams usually don’t need special workshop preparations because they share the same values and already speak the same language.</p>\n<p>However, in most cases, workshops are inevitable. They help build trust if it doesn’t appear between team members naturally and align people of different backgrounds who haven’t collaborated a lot before. That’s why you should plan workshops with people in mind. And if I had to choose one point that contributes to the workshop’s success the most, it’s involving the right people.</p>\n<p>Meanwhile, here is a short version of the checklist:</p>\n<p><strong>Problem framing</strong></p>\n<ul>\n<li>Choose the topic and formulate the problem.</li>\n<li>Check if a workshop will be the right tool to use.</li>\n<li>Analyze already available information on the subject.</li>\n<li>Prepare known information for the workshop.</li>\n<li>Decide what deliverable you’ll produce as a result of the workshop.</li>\n<li>Think of making the future deliverable relevant and valuable for the team.</li>\n<li>Envision the long-term effect of this workshop on your team.</li>\n<li>Think of other initiatives that can build on the achievements of this workshop.</li>\n</ul>\n<p><strong>Participant selection</strong></p>\n<ul>\n<li>Define the expertise you need to be present in the workshop.</li>\n<li>Think of the potential participants based on their knowledge and experience.</li>\n<li>Invite decision-makers and knowledge-keepers according to the workshop goal.</li>\n<li>If you’ll need help, assign a co-facilitator.</li>\n<li>Ensure equality by inviting a certain number of representatives of each role or function.</li>\n<li>If your team is large, plan how to create constructive group dynamics.</li>\n</ul>\n<p><strong>Workshop format</strong></p>\n<ul>\n<li>Define the optimal format and timeline based on the problem scale and team availability.</li>\n<li>Choose a digital workshopping tool if you decide to work paperlessly.</li>\n<li>Find an optimal way to invite people and set their expectations from the workshop.</li>\n</ul>\n<p><strong>Agenda and canvas</strong></p>\n<ul>\n<li>Formulate the general workshop outline in one or two sentences.</li>\n<li>Plan the details of each exercise based on the workshop goals.</li>\n<li>Allocate time for all exercises and auxiliary activities.</li>\n<li>Prepare ice-breakers and energy boosters, just in case.</li>\n<li>Make sure each exercise will be based on the results of the previous one.</li>\n<li>Identify how each exercise will lead to the next one.</li>\n<li>Choose or compose a canvas — a visual structure to organize information from the team.</li>\n</ul>\n<p><strong>Risk management: what can go wrong</strong></p>\n<ul>\n<li>Some people are skeptical and resist the workshop idea.</li>\n<li>You are about to exceed the planned timeline.</li>\n<li>The online workshop tool stopped working.</li>\n<li>The key people are absent.</li>\n<li>In the middle of a workshop, you suddenly discover the actual hidden problem that changes your initial plan.</li>\n<li>People get distracted during the workshop.</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"bb639f86ef21bc812f3edf3d774fdb9c7cc42098eda1c7f670c56bbed0274213","category":"Tech"}