{"title":"Apple Spending Millions of Dollars a Day on Conversational AI","link":"https://www.macrumors.com/2023/09/06/apple-conversational-ai-spending/","date":1694024921000,"content":"Apple has significantly ramped up its spending on artificial intelligence, according to a new report from <em><a href=\"https://www.theinformation.com/articles/apple-boosts-spending-to-develop-conversational-ai\">The Information</a></em> that highlights Apple's AI and machine learning research.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/07/siri-glow.png\" alt width=\"1200\" height=\"630\" />\r<br />\nThough Apple's AI chief John Giannandrea is said to be skeptical of AI chatbots, he established a team that is working on conversational AI four years ago. We have heard prior rumors about \"Apple GPT\" from <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>. Gurman in July said that Apple was experimenting with large language models, and some Apple employees have access to an \"Ajax\" internal chatbot.\r<br />\n\r<br />\nWith the 2022 debut of OpenAI's ChatGPT, chatbots suddenly became the must-have feature. Microsoft and Google have both launched chatbots, but there are so far no signs that Apple has a consumer-oriented product launching in the near future.\r<br />\n\r<br />\nApple's \"Foundational Models\" team that works on conversational AI includes just 16 people, but Apple is spending millions of dollars per day training its language models. Training large language models requires a lot of hardware, and as an example, OpenAI Sam Altman said the company <a href=\"https://www.wired.com/story/openai-ceo-sam-altman-the-age-of-giant-ai-models-is-already-over/\">spent more than $100 million</a> for GPT-4.\r<br />\n\r<br />\nAccording to <em>The Information</em>, Apple has other AI goals. The company is aiming to develop a feature that would allow a voice assistant like <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> to automate multi-step tasks. That functionality is available on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> today, but workflows must be manually set up using the Shortcuts app.\r<br />\n\r<br />\nThe ‌Siri‌ team could have multi-step voice-controlled automation ready for use in iOS 18.\r<br />\n\r<br />\nApple also appears to have AI teams that are working on software to generate videos and images and multimodal AI that works with images, video, and text. The aforementioned Ajax chatbot that Apple is working with is supposedly more capable than the original ChatGPT 3.5 and has been trained on 200 billion parameters, but OpenAI's newer models are more powerful.<div>Tags: <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>, <a href=\"https://www.macrumors.com/guide/chatgpt/\">ChatGPT</a>, <a href=\"https://www.macrumors.com/guide/applegpt/\">AppleGPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/06/apple-conversational-ai-spending/\">Apple Spending Millions of Dollars a Day on Conversational AI</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-spending-millions-of-dollars-a-day-on-conversational-ai.2400638/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bb6fc786a079842300159bea85bafdace44625bea81efe30f192a0852f843730","category":"Apple"}