{"title":"Characterization of Road Dust in Delhi: Heavy Metal Analysis, Health Risks, and Sustainability Implications","link":"http://link.springer.com/10.1007/s41810-024-00231-x","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>The study in Delhi presents a thorough examination of road dust pollution, revealing elevated levels of dust and heavy metals throughout the city. Areas with high road dust concentrations, notably in traffic-congested and industrial zones, show significant metal contamination, with cadmium (Cd), cobalt (Co), chromium (Cr), copper (Cu), nickel (Ni), lead (Pb), and zinc (Zn) levels exceeding background soil values. Particularly heightened Cr and Zn levels, attributed to industrial and vehicular emissions, pose increased non-carcinogenic risks to children through ingestion and inhalation. While the Hazard Index (HI) indicates lower risks for the general population, carcinogenic risk index (RI) values surpass acceptable limits for Pb, Cr, Cd, and Ni, highlighting substantial cancer risks for both children and adults. To mitigate these risks, sustainable road dust management practices are essential to enhance air quality, protect ecosystems, and reduce health hazards linked to dust exposure. Monitoring and controlling heavy metal presence in dust is critical for a cleaner environment. Cd, Pb, and Cr, known to cause various health issues, underscore the necessity of managing their presence in road dust. Recommendations include wearing masks, avoiding outdoor exposure during high pollution events, and maintaining indoor cleanliness. The study emphasizes the importance of green infrastructure and municipal interventions, such as road watering, to combat road dust pollution, emphasizing the need for proactive measures to safeguard public health and the environment.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"bb71b951084e3ebb8d28ad1671aad38816bec65ceaa1446f50fd539fbddb31e6","category":"Environment"}