{"title":"One-pot Golden Gate Assembly of an avian infectious bronchitis virus reverse genetics system","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307655","date":1721916000000,"content":"<p>by Katharina Bilotti, Sarah Keep, Andrew P. Sikkema, John M. Pryor, James Kirk, Katalin Foldes, Nicole Doyle, Ge Wu, Graham Freimanis, Giulia Dowgier, Oluwapelumi Adeyemi, S. Kasra Tabatabaei, Gregory J. S. Lohman, Erica Bickerton</p>\r\n\r\nAvian infectious bronchitis is an acute respiratory disease of poultry of particular concern for global food security. Investigation of infectious bronchitis virus (IBV), the causative agent of avian infectious bronchitis, via reverse genetics enables deeper understanding of virus biology and a rapid response to emerging variants. Classic methods of reverse genetics for IBV can be time consuming, rely on recombination for the introduction of mutations, and, depending on the system, can be subject to genome instability and unreliable success rates. In this study, we have applied data-optimized Golden Gate Assembly design to create a rapidly executable, flexible, and faithful reverse genetics system for IBV. The IBV genome was divided into 12 fragments at high-fidelity fusion site breakpoints. All fragments were synthetically produced and propagated in <i>E</i>. <i>coli</i> plasmids, amenable to standard molecular biology techniques for DNA manipulation. The assembly can be carried out in a single reaction, with the products used directly in subsequent viral rescue steps. We demonstrate the use of this system for generation of point mutants and gene replacements. This Golden Gate Assembly-based reverse genetics system will enable rapid response to emerging variants of IBV, particularly important to vaccine development for controlling spread within poultry populations.","author":"Katharina Bilotti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bb7d0f605f6fe98c6b3e0ee1159a08357fe1ace3b938d519e55126e190c00660","category":"Interdisciplinary"}