{"title":"Electrophysiological and behavioral responses of Tamarixia radiata (Hymenoptera: Eulophidae) to volatiles of nymphal Diaphorina citri (Hemiptera: Liviidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae060/7684708?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Huanglongbing (HLB), a devastating citrus disease caused by <span>Candidatus</span> Liberibacter asiaticus, is efficiently vectored by the Asian citrus psyllid, <span>Diaphorina citri</span> Kuwayama (Hemiptera: Liviidae). <span>Tamarixia radiata</span> (Waterston) plays a crucial role as an ectoparasitoid, preying on <span>D. citri</span> nymphs. By collecting and identifying headspace volatiles from fifth instar nymphs of <span>D. citri</span> using a gas chromatograph–mass spectrometer (GC–MS), we obtained a collection of 9 volatile compounds. These compounds were subsequently chosen to investigate the electrophysiological and behavioral responses of female <span>T. radiata</span>. At a concentration of 10 μg/μl, 9 compounds were compared with <span>cis-</span>3-hexen-1-ol (control), resulting in <span>trans-</span>2-nonenal inducing the highest relative electroantennogram (EAG) value, followed by hexanal, heptanal, <span>n-</span>heptadecane, tetradecanal, <span>n-</span>tetradecane, <span>n-</span>pentadecane, 1-tetradecanol, and 1-dodecanol. The top 5 EAG responses of female <span>T. radiata</span> to these compounds were further investigated through EAG dose–response experiments. The results showed positive dose–responses as concentrations increased from 0.01 to 10 μg/μl. In Y-tube olfactometer bioassays, female <span>T. radiata</span> exhibited a preference for specific compounds. They were significantly attracted to tetradecanal at a concentration of 10 µg/µl and <span>trans-</span>2-nonenal at 0.01 µg/µl, while no significant attraction was observed toward hexanal, heptanal, or <span>n-</span>heptadecane. Our report is the first to demonstrate that volatiles produced by <span>D. citri</span> nymphs attract <span>T. radiata</span>, which suggests that this parasitoid may utilize nymph volatiles to locate its host.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"bb8a611eeb9ec65bf9e5b52f76ec6db99969d6fadd6dd23ac521d70bd3b3c953","category":"Environment"}