{"title":"Scientists turned monkey stem cells into “synthetic embryos”","link":"https://arstechnica.com/?p=1929894","date":1680877899000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/embryo-800x533.jpg\" alt=\"An image of a cell under a lab microscope. This procedure was not related to the new experiment with monkey embryos.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/embryo.jpg\">Enlarge</a> <span>/</span> An image of a cell under a lab microscope. This procedure was not related to the new experiment with monkey embryos. (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The early days of how an embryo develops are shrouded in mystery, because it pulls a kind of vanishing act. Once a sperm finds an egg, it begins a roughly weeklong journey to the uterus, becoming a tiny ball of cells along the way. When it reaches its destination, it attaches to the wall of the uterus, disappearing from view.</p>\n<p>To shed light on the process, researchers are trying to create <a href=\"https://www.wired.com/story/stem-cell-science-pregnancy/\">embryo-like structures derived from stem cells</a>, rather than sperm and eggs, so they can observe early development in the lab. These three-dimensional balls of cells could offer clues to how diseases, birth defects, and miscarriages arise, without the practical and ethical concerns raised by using actual embryos. In the latest effort, researchers in China made these structures using stem cells from macaques and tried to establish pregnancies with them in female monkeys. The experiment <a href=\"https://www.cell.com/cell-stem-cell/fulltext/S1934-5909(23)00080-2\">is described in the journal Cell Stem Cell</a>. Although other researchers have created “synthetic” embryos before, it’s the first time anyone has done it with monkeys—animals closely related to humans—and tried to get them to implant in the uterus.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1929894#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1929894&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bb8bc25cd3161926c45af3bf867942c5fc4f4b9f6c02e6b57c70736b6bba93a7","category":"Tech"}