{"title":"Acteoside and isoacteoside alleviate renal dysfunction and inflammation in lipopolysaccharide-induced acute kidney injuries through inhibition of NF-κB signaling pathway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303740","date":1715781600000,"content":"<p>by Jing Lian, Yisheng Xu, Ji Shi, Pengpeng Liu, Yue Hua, Chao Zhang, Tianhang Ren, Guoming Su, Shizan Cheng, Zixuan Nie, Tianzhu Jia</p>\r\n\r\nAcute kidney injury (AKI) is a sudden loss of renal function with a high mortality rate and inflammation is thought to be the underlying cause. The phenylpropanoid components acteoside (ACT) and isoacteoside (ISO), which were isolated from <i>Cistanche deserticola</i> Y.C.Ma, have been reported to have preventive effects against kidney disorders. This study aimed to investigate the anti-inflammatory properties and protective mechanisms of ACT and ISO. In this investigation, kidney function was assessed using a semi-automatic biochemical analyzer, histopathology was examined using Hematoxylin-Eosin staining and immunohistochemistry, and the concentration of inflammatory cytokines was assessed using an enzyme-linked immunosorbent assay (ELISA) test. In addition, using Western blot and q-PCR, the expression of proteins and genes connected to the NF-κB signaling pathway in mice with lipopolysaccharide (LPS)-induced AKI was found. The findings showed that under AKI intervention in LPS group, ACT group and ISO group, the expression of <i>Rela</i> (<i>Rela</i> gene is responsible for the expression of NFκB p65 protein) and <i>Tlr4</i> mRNA was considerably elevated (<i>P</i>&lt;0.01), which led to a significant improvement in the expression of MyD88, TLR4, Iκ-Bɑ and NF-κB p65 protein (<i>P</i>&lt;0.001). The levels of Alb, Crea and BUN (<i>P</i>&lt;0.001) increased along with the release of downstream inflammatory factors such as IL-1β, IL-6, Cys-C, SOD1 and TNF-α (<i>P</i>&lt;0.001). More importantly, the study showed that ISO had a more favorable impact on LPS-induced AKI mice than ACT. In conclusion, by inhibiting NF-κB signaling pathway, ACT and ISO could relieve renal failure and inflammation in AKI, offering a fresh possibility for the therapeutic management of the condition.","author":"Jing Lian","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bb90593f1295c5e98eca3281a0055dd39047b8703256631691d1e7d40d1d0478","category":"Interdisciplinary"}