{"title":"River definitions reciprocally define us","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4195?af=R","date":1690959600000,"content":"<h2>Abstract</h2>\n<p>This article explores different definitions of river, and in doing so, considers how our efforts to define rivers illuminate aspects of the human condition. Through an exploration of our definitions of river, through the human imagination, in poetry, music, and human's actions, this article considers how our nature is reflected back by rivers—how we in turn are defined by rivers—such as their role in determining borders, movement, escape, the locations of cities, trade, communication, and in the shaping of cultures and societies. This article specifically highlights three definitions of river using examples predominately from North America. River as boundary, exploring how in the reaches of some river basins, rivers act not only as a border, or boundary between two nations or cultures, but also as a line of demarcation between the known and unknown landscapes and the tamed and untamed lands. The definition of river as pathway includes exploration of how the Mississippi River served as a natural highway for people escaping slavery to travel North and reach Underground Railroad routes toward freedom, while also forcibly moving hundreds of thousands of enslaved people in the United States from the Upper South to the Lower South as they were “sold down the river.” Third, this article examines how rivers have been defined as a resource through examples, such as the US government and Bonneville Power Administration's (BPA) efforts, to encourage support of large dam construction and water development projects by hiring Woody Guthrie in 1941 to write songs that would prompt public support for the water projects. Through this discussion of three river definitions, the article considers how rivers have been conceptualized over time and how those different knowledges inform our understanding and treatment of rivers. The article argues that it is vital to include knowledge from across scales, time, boundaries, and ways of knowing in order to improve the protection of rivers and their ecosystems. If we do not, we will continue to lose freshwater biodiversity, wetland and riverine habitat, and their immeasurable qualities that inspire life and imagination at a staggering rate.</p>","author":"Antonia Sohns","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"bb913c7e3ddb596ae8ee187f154c83fa2ac9b096db048527905502be9a193e0d","category":"Environment"}