{"title":"Biden blasts social media after Facebook stonewalls admin over vaccine misinformation","link":"https://arstechnica.com/?p=1781301","date":1626710452000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-biden-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-biden.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images | Pool</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>President Joe Biden and Surgeon General Vivek Murthy spent the last several days hammering social media companies for their platforms’ roles in spreading misinformation about COVID-19 vaccines.</p>\n<p>“They’re killing people,” Biden said, when asked about the role of social networks in the spread of misinformation. “Look, the only pandemic we have is among the unvaccinated. They’re killing people.” His comments came after Facebook reportedly stonewalled the White House. For weeks, officials unsuccessfully petitioned Facebook to share details about how it is fighting vaccine misinformation on its platforms, according to a report in <a href=\"https://www.nytimes.com/2021/07/16/us/politics/biden-facebook-social-media-covid.html\">The New York Times</a>.</p>\n<p>The assault continued on Sunday when Murthy appeared on <a href=\"https://www.cnn.com/2021/07/18/politics/vivek-murthy-surgeon-general-social-media-misinformation-cnntv/index.html\">CNN</a>. “These platforms have to recognize they’ve played a major role in the increase in speed and scale with which misinformation is spreading,” he said. And White House Press Secretary Jen Psaki faulted Facebook last Thursday for the pace of its moderation. “Facebook needs to move more quickly to remove violative posts,” she said. “Posts that will be within their policies’ removal often remain up for days. That's too long. The information spreads too quickly.”</p></div><p><a href=\"https://arstechnica.com/?p=1781301#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781301&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bb92f123d58714c1fc63330996832659bfc289408af905f88aae6b84b45afbf2","category":"Tech"}