{"title":"Retrospective Analysis of Clostridioides difficile Infection Rates in Hospitalized Patients during COVID-19 Pandemic. A Unicenter Study in Reus, Spain","link":"https://www.preprints.org/manuscript/202404.0903/v1","date":1713152255000,"content":".Background: Clostridioides difficile infections (CDI) vary in severity from mild diarrhea to life-threatening conditions like pseudomembranous colitis or toxic megacolon, often leading to sepsis and death. The COVID-19 pandemic prompted changes in healthcare practices, potentially affecting CDI incidence, though reported data are inconclusive. We studied factors influencing CDI incidence and outcomes at a university hospital throughout the COVID-19 pandemic years. Methods: We conducted a retrospective study on all adult hospitalized CDI cases from January 1, 2020, to December 31, 2022. We collected demographic information, comorbid conditions, and concurrent infections. Results: While overall CDI and COVID-19 rates decreased in 2022, a nota-ble increase in CDI infections was observed among oncological patients and those undergoing some aggressive treatments, such as colon or gastroscopies. The prevalence of comorbidities remained unmodified, and there were declines in prior gastrointestinal surgeries and proton pump inhibitor prescriptions. Factors associated with patient fatality or prolonged hospitaliza-tion included older age, cancer, chronic kidney disease, higher Charlson and McCabe indices, elevated C-reactive protein, and low albumin concentrations. Conclusion: Our study shows the evolving landscape of CDI during the COVID-19 pandemic and emphasizes the impact of de-layed diagnoses and treatments exacerbated by telemedicine adoption. Identified risk factors for CDI-related mortality or prolonged hospital stays underscore the importance of targeted inter-ventions in high-risk populations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bb92731220f6c8ec144aa3e93cc23d1d11161b929f86d88b6087f1abe4a09453","category":"Interdisciplinary"}