{"title":"Emergency Mapping for Flood Events Using Satellite Imagery (Optical and/or Synthetic Aperture Radar) and Benchmarking between Open Source and Commercial Geospatial Analysis Tools","link":"https://www.preprints.org/manuscript/202407.1784/v1","date":1721734753000,"content":"Weather conditions appear to be undergoing significant deviations from the long-term average, marked by pronounced extremes of heat, prolonged droughts, and heightened rainfall occurring with greater frequency worldwide. Consequently, new patterns of extreme weather are emerging, like the unusual and unorganized tropical cyclone called \"Yaku\", that influenced the extreme amount of rain that between March 6th to 10th, 2023 hits more than 1000 districts in the northwestern of Peru. One of the district more affected was Íllimo, in the Lambayeque province, due to the river that pass through the city, so called “La Leche”, after the continuous and intensive rain overflow devastating his surrounding areas and causing victims and damage. This emergency provided and excellent opportunity to apply, on the aforementioned areas, the “change detection” technique, that allows identifying areas of change between data obtained before and after of emergency events. In this research, optical data (Sentinel-2, Landsat, MODIS Terra and Aqua, and PeruSAT-1) and synthetic aperture radar (SAR) data (Sentinel-1 and COSMO SkyMed) were analyzed. A benchmark could also be carried out between open-source and commercial spatial analysis tools. The results indicated that in an extreme rain event the optical data are obscured by clouds and do not allow their use, while SAR data overcome clouds, and can be used for this research. The benchmark indicated that using the Jaccard index score, the Sentinel-1A set showed a 33% of correlation, while COSMO SkyMed demonstrated a 38% of match between the maps. The results obtained could be used to sensitize the population and develop a better management of future emergency events (floods) in different areas of Peru.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bb925a64a35f0b568d271ad5aa7b0ff4a9f7d5dd5a6d819d9ed849b489804868","category":"Interdisciplinary"}