{"title":"Elizabeth Holmes personally approved investor presentations, court hears","link":"https://arstechnica.com/?p=1806409","date":1634831905000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235841569-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235841569.jpg\">Enlarge</a> <span>/</span> Elizabeth Holmes, founder of Theranos Inc., left, arrives at federal court in San Jose, Calif., on Tuesday, Oct. 12, 2021. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/elizabeth-holmes-founder-of-theranos-inc-left-arrives-at-news-photo/1235841569?adppopup=true\"> David Paul Morris/Bloomberg</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Over the past few days, jurors in Theranos founder Elizabeth Holmes’ criminal trial have been hearing about the now-infamous demos given to Theranos investors. The devices would <a href=\"https://arstechnica.com/tech-policy/2021/10/theranos-device-made-a-bunch-of-noise-but-did-nothing-else-in-safeway-demo/\">make noise but not produce results</a>, they ran apps that <a href=\"https://arstechnica.com/tech-policy/2021/10/theranos-devices-ran-demo-apps-that-blocked-error-messages-during-investor-pitches/\">blocked error messages</a> from appearing, and in some cases, instead of tests happening in front of visitors, blood samples were taken elsewhere for analysis.</p>\n<p>Yesterday, the picture resolved itself further as testimony from Daniel Edlin, a product manager who was friends with Holmes’ brother Christian, continued. Edlin revealed that Holmes herself and Daniel Young, a Theranos scientist and vice president, played key roles in what ultimately transpired during demos for visitors and investors.</p>\n<p>But first, Edlin was cross-examined by Holmes’ defense attorney Kevin Downey, who <a href=\"https://www.wsj.com/livecoverage/elizabeth-holmes-trial-theranos/card/Q46rk1zIvqVbpl5RJcgj\">showed</a> the court a series of emails from a US military officer who was part of the team evaluating Theranos devices for use on the battlefield in Africa. In a June 2012 email, Young wrote that he felt “very good about reliability for this deployment” after testing 100 protocols over the course of 48 hours in 110° F conditions. Yesterday, the court heard from Edlin that the device would only run properly between 72–82° F. Either Edlin or Young is mistaken or there’s some nuance here that we’ll hopefully hear about later.</p></div><p><a href=\"https://arstechnica.com/?p=1806409#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1806409&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bb97a29c95c08ba04eaefc39c3ea7cf94a2191b5dccb94bf1c18eb1ddd5e7f68","category":"Tech"}