{"title":"Facebook เปิดคอนเทนต์ยอดฮิตในสหรัฐฯ เป็นครั้งแรก, ส่วนใหญ่มาจากเพื่อน, โพสต์มีลิงก์คนดูน้อย","link":"https://www.blognone.com/node/124303","date":1629346551000,"content":"<div><div><div><p>Facebook ทำรายงานเนื้อหาที่มีคนดูมากที่สุดในสหรัฐฯ เป็นครั้งแรก “<a href=\"https://transparency.fb.com/data/widely-viewed-content-report/\">Widely Viewed Content Report</a>” โดยใช้เครื่องมือภายในรวมกับข้อมูล engagement ใน <a href=\"https://help.crowdtangle.com/en/articles/4201940-about-us\">CrowdTangle</a> เพื่อแสดงความโปร่งใสของการแนะนำคอนเทนต์บน News Feed รายงานแรกเป็นของไตรมาสที่ 2/2021 มีจุดที่น่าสนใจดังนี้</p>\n<ul>\n<li>คอนเทนต์ที่คนเห็นเยอะไม่ได้แปลว่าจะมีเอนเกจเมนต์เยอะตาม</li>\n<li>คอนเทนต์ 57% ที่คนเห็นบน News Feed มาจากเพื่อน หรือคนที่ติดตามอยู่ รองลงมาเป็นโพสต์จากกลุ่ม ที่ 19.3% โพสต์จากเพจ 14.3% โพสต์ที่ไม่เกี่ยวข้อง 8% และอื่นๆ อีก 1.5% แปลว่าการแสดงคอนเทนต์ ตรงกับที่ Facebook เคยพยายามทำก่อนหน้านี้ คือแสดงโพสต์จากเพื่อนให้เห็นมากกว่าโพสต์อื่น</li>\n<li>โพสต์ส่วนใหญ่ที่คนเห็น เป็นแบบไม่มีลิงก์ 87.1% มีเพียง 12.9% เท่านั้นที่เป็นโพสต์มีลิงก์ไปนอก Facebook</li>\n<li>คอนเทนต์จากเพจที่มียอดวิวสูงสุด 5 อันดับแรกคือเพจ UNICEF ตามมาด้วยเพจทำอาหาร Cooking Fun With my 3 Sons ที่เหลือเป็นเพจคลิปไวรัลถึง 3 ใน 5 อันดับ คือ Sassy Media, The Dodo และ LADBible</li>\n</ul>\n<p>โพสต์ที่มีคนเห็นมากที่สุดในไตรมาส ยอดวิว 80.6 ล้านครั้ง คือโพสต์ไวรัล “<a href=\"https://www.facebook.com/permalink.php?story_fbid=1885066628300379&amp;id=673040649502989\">สามคำแรกที่คุณเห็นจะบอกถึงชีวิตจริงของคุณ</a>” โพสต์โดย Gaur Gopal Das กูรูไลฟ์โค้ชชื่อดังของสหรัฐ มีผู้ติดตาม 7 ล้านคน</p>\n<p>นอกจากนี้ลิงก์เกี่ยวกับ UNICEF ยังอยู่ในลำดับ 1 ถึง 3 ของทั้งประเภทโดเมนและลิงก์ที่มีคนเห็นมากที่สุดในสหรัฐ โดยประเภทโดเมน อันดับหนึ่งคือ Youtube ตามมาด้วย Amazon และ UNICEF</p>\n<p>ส่วนลิงก์ที่มีคนเห็นมากที่สุด คือเว็บไซต์จัดกิจกรรมของอดีตสมาชิกทีมอเมริกันฟุตบอล <a href=\"https://www.playeralumniresources.com/\">Player Alumni Resources</a>, <a href=\"https://purehempshop.com/collections/all\">เว็บไซต์ขายผลิตภัณฑ์จากกัญชง Pure Hemp Shop</a> และลิงก์ของ Unicef <a href=\"https://www.unicef.org/coronavirus/unicef-responding-covid-19-india\">เกี่ยวกับการช่วยเหลือโควิดในประเทศอินเดีย</a></p>\n<p>ที่มา - <a href=\"https://transparency.fb.com/data/widely-viewed-content-report/\">Facebook: Widely Viewed Content Report</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b536434c3f3006f4b1eeb47372a2ebce.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/transparency-report\">Transparency Report</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bb9acaa8237aeb8e733f810687f12ba0d343cb31a3b0179d594c795359c5168a","category":"Thai"}