{"title":"The YOLO Framework: A Comprehensive Review of Evolution, Applications, and Benchmarks in Object Detection","link":"https://www.preprints.org/manuscript/202410.1785/v1","date":1729661108000,"content":"This paper presents a comprehensive review of the You Only Look Once (YOLO) framework, a transformative one-stage object detection algorithm renowned for its remarkable balance between speed and accuracy. Since its inception, YOLO has evolved significantly, with versions spanning from YOLOv1 to the most recent YOLOv11, each introducing pivotal innovations in feature extraction, bounding box prediction, and optimization techniques. These advancements, particularly in the backbone, neck, and head components, have positioned YOLO as a leading solution for real-time object detection across a variety of domains. In this review, we explore YOLO's diverse applications, including its critical role in medical imaging for COVID-19 detection, breast cancer identification, and tumor localization, where it has significantly enhanced diagnostic efficiency. YOLO's robust performance in autonomous vehicles is also highlighted, as it excels in challenging conditions like fog, rain, and low-light environments, thereby contributing to improved road safety and autonomous driving systems. In the agricultural sector, YOLO has transformed precision farming by enabling early detection of pests, diseases, and crop health issues, promoting more sustainable farming practices. Additionally, we provide an in-depth performance analysis of YOLO models—such as YOLOv9, YOLO-NAS, YOLOv10, and YOLOv11—across multiple benchmark datasets. This analysis compares their suitability for a range of applications, from lightweight embedded systems to high-resolution, complex object detection tasks. The paper also addresses YOLO's challenges, such as occlusion, small object detection, and dataset biases, while discussing recent advancements that aim to mitigate these limitations. Moreover, we examine the ethical implications of YOLO's deployment, particularly in surveillance and monitoring applications, raising concerns about privacy, algorithmic biases, and the potential to perpetuate societal inequities. These ethical considerations are critical in domains like law enforcement, where biased object detection models can have serious repercussions. Through this detailed review of YOLO's technical advancements, applications, performance, and ethical challenges, this paper serves as a valuable resource for researchers, developers, and policymakers looking to understand YOLO’s current capabilities and future directions in the evolving field of object detection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bb9f71bf752c18ed7267dfca0dd20212bd80beaaded576c347ed0b36881db4b2","category":"Interdisciplinary"}