{"title":"Effects of circadian variation of dietary protein sources on growth performance, carcass composition and intestinal enzyme activity in beluga, Huso huso","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13067?af=R","date":1722826820000,"content":"<h2>Abstract</h2>\n<p>The main cost in aquaculture production is feed, so management practices and feeding strategies aim to optimize both feed intake and efficiency. This study aimed to evaluate the growth performance of beluga, <i>Huso huso</i>, affected by periodic changes in dietary protein sources and hence identify possible innovative feeding strategies toward more efficient use of dietary protein. This study was designed with two experimental diets, namely fish meal (diet A) and plant protein blend (diet B) (protein 40%, fat 16%), which were used in different food schedules for feeding beluga (initial weight 82.08 ± 4.1 g) during 8 weeks. The experimental treatments included: continuously feeding a fish meal diet (A); continuously feeding a plant protein diet (B); alternating between diet A in the morning and diet B in the afternoon (A am/B pm); alternating between diet B in the morning and diet A in the afternoon (B am/A pm); and alternating between diet A for one day and diet B for one day (1A/1B). At the end of the eight-week trial, superior growth performance and feed utilization were respectively observed in fish receiving A, Bam/Apm, and Aam/Bpm diets compared with the remaining treatments. The specific activity of trypsin and chymotrypsin was significantly high in fish fed Aam/Bpm and Bam/Apm. Feeding the fish-meal-based diet (A) continuously, led to decreased protein and increased fat deposition in the carcass. Among the mixed feeding schedules, the highest cost-saving was recorded with the Aam/Bpm and Bam/Apm schedules. Based on economic analysis, applying Aam/Bpm and Bam/Apm schedules led to the reduced cost of beluga production compared with the other treatments. Therefore, the optimal feeding schedules for beluga are Aam/Bpm and Bam/Apm, which should be used as a practical feeding guideline for <i>H. huso</i> production.</p>","author":"Zeinab Najafi, \nHossein Ouraji, \nSakineh Yeganeh, \nAyoub Farhadi","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"bb9fa35b4a6d3171877f75a55be079f6c87270e42ea3d7d96cdafe7d7495b959","category":"Environment"}