{"title":"278 Awardee Talk: A multi-perspective approach to understanding fundamental mechanisms that regulate growth and nutrient utilization in pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/198/7757445?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Pigs raised in commercial production settings often do not grow and utilize nutrients to their genetic potential due to a myriad of factors that negatively affect their performance. Understanding the underpinnings of growth and nutrient use by pigs is fundamental to optimizing their growth. The overall objective of research in my laboratory is to investigate mechanisms that guide growth and nutrient use in pigs. We use approaches that involve whole-animal systems and cellular models that query physiological processes in pigs during normal and stressful conditions. To understand the effect of heat stress on adipose tissue development and function in pigs, multiple experiments were conducted using in vitro and in vivo methodologies. First, using in vitro adipocyte differentiation model to characterize cellular responses that occur during differentiation of pig adipocytes, HS was found to increase (<span>P</span> &lt; 0.05) adipogenesis in adipocytes, and this was accompanied by increased (<span>P</span> &lt; 0.05) expression of C/EBPα and HSP 70. Heat stress also increased (<span>P</span> &lt; 0.05) expression of genes involved in fatty acid uptake and TAG synthesis (FAS, aP2, CD36, FATP4, FATP6, LPL, GLUT4, PCK1, and GK). This is supported by increased (<span>P</span> &lt; 0.05) cellular triacylglycerol under HS. In pigs exposed to HS (35°C) vs. Control (20°C), HS resulted in increased (<span>P</span> &lt; 0.05) expression of PCK1, suggesting that increased glyceroneogenesis might be involved in the increased fat storage in pigs under HS. Additionally, experiments conducted to investigate effects of live yeast (LY), fiber and fiber-derived microbial products have shown that maternal fiber type consumed during gestation affects adiposity in the offspring. Experiments have also elucidated the mechanisms by which fiber-derived products such as butyrate affect intestinal epithelial cell function. This work has shown that butyrate increased (<span>P</span> &lt; 0.05) activation of the AKT signaling pathway in epithelial cells to promote tight junction integrity and mitigate effect of inflammation. Using metabolomics analysis, it was also shown that dietary fiber regulates 97 different metabolites in the fecal content of pigs. These metabolites include amino acids and known PPAR gamma ligands, demonstrating a potential role for microbial derived products to regulate intestinal cell metabolism through the PPAR signaling pathway. Feeding LY to sows during gestation and lactation was also accompanied by increased (<span>P</span> &lt; 0.05) growth and nutrient utilization in piglets after weaning, underlying a potential for postweaning growth modulation in piglets with maternal LY supplementation during gestation and lactation. Additional work using proteomics has revealed the potential importance of immune stimulating proteins in the milk of LY fed sows in the growth response of piglets. Knowledge gained from this research would be useful for developing new strategies for optimizing animal growth.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bba2e5dc3e9484c942d7cd40e653d5f37c265eefcdbcf8edc318c0f9ebebfb79","category":"Environment"}