{"title":"Jason Snell on Final Cut and Logic for iPad","link":"https://sixcolors.com/post/2023/05/final-cut-and-logic-arrive-on-ipad-questions-and-some-answers/","date":1684361327000,"content":"\n<p>Jason Snell, writing at Six Colors:</p>\n\n<blockquote>\n  <p>Final Cut Pro for iPad seems to be a subset of the Mac version.\nYou can start on iPad and move to Mac, but the migration won’t\nwork the other way, and a bunch of features from the Mac just\naren’t there on the iPad.</p>\n\n<p>This is disappointing. Yes, the lack of feature parity is\nunfortunate — but perhaps a bit understandable? But as someone\nwho rarely uses those pro-level features, it’s also frustrating to\nrealize that even my simple projects won’t be portable in case I\nneed to leave home and run off somewhere with an iPad.</p>\n</blockquote>\n\n<p>Logic Pro users can roundtrip between Mac and iPad, but as Snell points out, <em>not</em> if you’re using any Audio Unit plugins that are Mac-only.</p>\n\n<p>The lack of roundtripping with Final Cut is disappointing, but I agree with Snell that it’s understandable. Presumably, roundtrip support between iPad and Mac is forthcoming, and requires engineering work that isn’t yet finished — either in iPadOS itself or in Final Cut Pro for iPad (or both). But what would we prefer? To wait for months or another year for Final Cut to hit iPad? After waiting this long, Apple wouldn’t release Final Cut for iPad now if they didn’t think it was a viable product as it stands, even without roundtrip project support with the Mac.</p>\n\n<p>Don’t miss my favorite part of Snell’s piece, where he describes how productive he is editing podcasts on iPad with Ferrite Recording Studio because it has rich support for multitouch. It’s a perfect example of <a href=\"https://daringfireball.net/2020/01/the_ipad_awkwardly_turns_10\">Steve Jobs’s guiding maxim</a> for the iPad when he introduced it in 2010: that it needs to be able to do some things better than either the iPhone or Mac.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/17/snell-final-cut-logic-ipad\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"bba39add46c603903aaa65facf895cd1f302343b462c3133268a97a62371f621","category":"Tech"}