{"title":"What cats’ love of boxes and squares can tell us about their visual perception","link":"https://arstechnica.com/?p=1762974","date":1620337510000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/catsquareTOP-800x531.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/catsquareTOP.jpg\">Enlarge</a> <span>/</span> Like most cats, nothing delights Ariel more than an empty box in which to lounge. This might tell us something about feline visual perception of shapes and contours, per a new study in Applied Animal Behaviour Science.  (credit: Sean Carroll)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>It is a truth universally acknowledged—at least by those of the feline persuasion—that an empty box on the floor must be in want of a cat. Ditto for laundry baskets, suitcases, sinks, and even cat carriers (when not used as transport to the vet). This behavior is <a href=\"https://theconversation.com/why-cant-cats-resist-thinking-inside-the-box-76287\">generally attributed</a> to the fact that cats feel safer when squeezed into small spaces, but it might also be able to tell us something about feline visual perception. That's the rationale behind <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0168159121001258?fbclid=IwAR0NkvhAGEDRgD4xwynVFuaXl6JUFZ0ZSgDYNJH7tEwiPIMZrYv7tkxUoIw\">a new study</a> in the journal Applied Animal Behaviour Science with a colorful title: \"If I fits I sits: A citizen science investigation into illusory contour susceptibility in domestic cats (<em>Felis silvers catus</em>).\"</p>\n<p>The paper was inspired in part by a 2017 viral Twitter hashtag, #CatSquares, in which users posted pictures of their cats sitting inside squares marked out on the floor with tape—kind of a virtual box. The following year, lead author Gabriella Smith, a graduate student at Hunter College (CUNY) in New York City, attended a lecture by co-author Sarah-Elizabeth Byosiere, who heads the <a href=\"https://sites.google.com/view/huntertdc/home?authuser=0&amp;fbclid=IwAR2vOXV1RN1XzgYzJj11HP9k7CCXBet0-680_G9FI221yy0vMamQllouQOY\">Thinking Dog Center</a> at Hunter. Byosiere studies canine behavior and cognition, and she spoke about dogs' susceptibility to visual illusions.  While playing with her roommate's cat later that evening, Smith recalled the Twitter hashtag and wondered if she could find a visual illusion that looked like a square to test on cats.</p>\n<p>Smith found it in the work of the late Italian psychologist and artist <a href=\"https://en.wikipedia.org/wiki/Gaetano_Kanizsa\">Gaetano Kanizsa</a>, who was interested in <a href=\"https://en.wikipedia.org/wiki/Illusory_contours\">illusory (subjective) contours</a> that visually evoke the sense of an edge in the brain even if there isn't really a line or edge there. The Kanizsa square consists of four objects shaped like Pac-Man, oriented with the \"mouth\" facing inward to form the four corners of a square. Even better, there was <a href=\"https://pubmed.ncbi.nlm.nih.gov/3250081/\">a 1988 study</a> that used the Kanizsa square to investigate the susceptibility of two young female cats to illusory contours. The study concluded that, yes, cats are susceptible to the Kanizsa square illusion, suggesting that they perceive subjective contours much like humans.</p></div><p><a href=\"https://arstechnica.com/?p=1762974#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762974&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bba572b5989d748214eb563e473afade09e487c298151f8fc84e978fe82b5a6f","category":"Tech"}