{"title":"Creep Characteristics of Reconstituted Silty Clay Under Different Pre-loading Path Histories","link":"https://www.preprints.org/manuscript/202404.0663/v1","date":1712724566000,"content":"Due to the long-term deformation settlement of foundations, issues such as damage and functional failure of buildings and structures have long been of concern in the engineering field. The creep of soil is one of the primary causes leading to long-term deformation of foundations. In this paper, the consolidation deformation, creep characteristics, and creep model of reconstituted saturated silty clay were studied by isotropic compression test and triaxial shear creep test. The results show that for the isotropic compression test, although the applied load adopts different stages of loading, as long as the final applied confining pressure is the same, the number of stages applied by the confining pressure has little effect on the final isotropic consolidation deformation of the sample and the triaxial undrained shear strength after creep. However, for the triaxial shear creep test, it is found that under the same final deviatoric stress, the final deviatoric strain of the sample is closely related to the number of loading stages of deviatoric stress. It shows that the more loading stages of the sample loaded with the same deviatoric stress, the smaller the final deviatoric strain, and the triaxial undrained shear strength of the sample after creep will increase. In addition, it is reasonable to determine the pore pressure dissipation of the sample to 95%((u0-u0)/u0=95%) as the main consolidation end time (tEOP) of the sample. The isotropic consolidation creep curves and the triaxial shear creep curves show certain nonlinearity. Then the logarithmic model and the hyperbolic model were used to fit the creep curves of the samples. It is found that the hyperbolic model has a better fitting effect than the logarithmic model, but for the triaxial shear creep test, the creep parameters of the sample change greatly. Therefore, studying the creep characteristics of soil under different pre-loading steps is of significant engineering importance for evaluating the long-term deformation of underground structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bba86265391063d4a2f8085052cdac13c0d53db8a7476146be4ca41a364ebe29","category":"Interdisciplinary"}