{"title":"Detection and prevalence of a novel <i>Bandavirus</i> related to Guertu virus in <i>Amblyomma gemma</i> ticks and human populations in Isiolo County, Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310862","date":1726840800000,"content":"<p>by Hellen Koka, Solomon Langat, Samuel Oyola, Faith Cherop, Gilbert Rotich, James Mutisya, Victor Ofula, Konongoi Limbaso, Juliette R. Ongus, Joel Lutomiah, Rosemary Sang</p>\r\nIntroduction <p>Emerging tick-borne viruses of medical and veterinary importance are increasingly being reported globally. This resurgence emphasizes the need for sustained surveillance to provide insights into tick-borne viral diversity and associated potential public health risks. We report on a virus tentatively designated Kinna virus (KIV) in the family <i>Phenuiviridae</i> and genus <i>Bandavirus</i>. The virus was isolated from a pool of <i>Amblyomma gemma</i> ticks from Kinna in Isiolo County, Kenya. High throughput sequencing of the virus isolate revealed close relatedness to the Guertu virus. The virus genome is consistent with the described genomes of other members of the genus <i>Bandavirus</i>, with nucleotides lengths of 6403, 3332 and 1752 in the Large (L), Medium (M) and Small (S) segments respectively. Phylogenetic analysis showed that the virus clustered with Guertu virus although it formed a distinct and well supported branch. The RdRp amino acid sequence had a 93.3% identity to that of Guertu virus, an indication that the virus is possibly novel. Neutralizing antibodies were detected in 125 (38.6%, 95% CI 33.3–44.1%) of the human sera from the communities in this region. In vivo experiments showed that the virus was lethal to mice with death occurring 6–9 days post-infection. The virus infected mammalian cells (Vero cells) but had reduced infectivity in the mosquito cell line (C636) tested.</p> Conclusion <p>Isolation of this novel virus with the potential to cause disease in human and animal populations necessitates the need to evaluate its public health significance and contribution to disease burden in the affected regions. This also points to the need for continuous monitoring of vector and human populations in high-risk ecosystems to update pathogen diversity.</p>","author":"Hellen Koka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bba84ec64b4d3cc296e3659c54e2cb348adce09c0edc7c619e33618f8ac7364d","category":"Interdisciplinary"}