{"title":"Behavioural synchronisation between different groups of dogs and wolves and their owners/handlers: Exploring the effect of breed and human interaction","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302833","date":1714744800000,"content":"<p>by Jasmine Heurlin, György Barabás, Lina S. V. Roth</p>\r\n\r\nDogs have previously been shown to synchronise their behaviour with their owner and the aim of this study was to test the effect of immediate interactions, breed, and the effects of domestication. The behavioural synchronisation test was conducted in outdoor enclosures and consisted of 30 s where the owner/handler was walking and 30 s of standing still. Three studies were conducted to explore the effect of immediate interaction (study A), the effect of breed group (study B), and the effect of domestication (study C). In study A, a group of twenty companion dogs of various breeds were tested after three different human interaction treatments: <i>Ignore</i>, <i>Pet</i>, and <i>Play</i>. The results showed that dogs adjusted their movement pattern to align with their owner’s actions regardless of treatment. Furthermore, exploration, eye contact, and movement were all influenced by the owners moving pattern, and exploration also decreased after the <i>Play</i> treatment. In study B, the synchronisation test was performed after the <i>Ignore</i> treatment on three groups: 24 dogs of ancient dog breeds, 17 solitary hunting dogs, and 20 companion dogs (data from study A). Irrespective of the group, all dogs synchronised their moving behaviour with their owner. In addition, human walking positively influenced eye contact behaviour while simultaneously decreasing exploration behaviour. In study C, a group of six socialised pack-living wolves and six similarly socialised pack-living dogs were tested after the <i>Ignore</i> treatment. Interestingly, these animals did not alter their moving behaviour in response to their handler. In conclusion, dogs living together with humans synchronise with their owner’s moving behaviour, while wolves and dogs living in packs do not. Hence, the degree of interspecies behavioural synchronisation may be influenced by the extent to which the dogs are immersed in everyday life with humans.","author":"Jasmine Heurlin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bbc0cf2570cca73edc99dbbf2c1c78f9ab6e4e6df5422e0752385fb20e9a4091","category":"Interdisciplinary"}