{"title":"Lotto Belgium Tour 2.1 preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/lotto-belgium-tour-2-1-preview","date":1623866254000,"content":"\n      <p>By the time La Course comes around on the 26th June, it will have been well over one month since the last Women’s World Tour race. In the intervening weeks, the void of live women’s racing has been filled somewhat by the two-day Tour de Suisse women and a few one-day races in Belgium but the Lotto Belgium Tour offers up a longer race, alongside hour-long highlights of every stage on GCN+ and Eurosport. </p>\n<div></div>\n<p><span>This year will mark the 10th edition of the race which features stages that mimic some of the cobbled Classics and has been won twice by both Ellen van Dijk and Annemiek van Vleuten. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/5-years-on-what-impact-has-the-introduction-of-the-women-s-world-tour-had\">Related: 5 years on – is the women's WorldTour working?</a></em></strong></p>\n<p><span>Like many regular fixtures on the women’s calendar, the Lotto Belgium Tour took an enforced hiatus in 2020 due to the pandemic meaning the most recent edition took place in 2019 </span><span>—</span> won by German rider Mieke Kröger. </p>\n<p><span>As well as the usual jerseys available in stage racing, this year, the Lotto Belgium Tour will feature a ‘Queen of the Stones’ competition for the best rider over the cobbled sectors which the organisation are running in conjunction with the national breast cancer charity in Belgium. </span></p>\n<p><span>The race looks set to be a slightly hillier version than in previous years but there are still plenty of opportunities for both pure sprinters and punchy climbers. </span></p>\n<h3><strong>The Route</strong></h3>\n<h4><strong>Stage 1 - Prologue - Chimay - Chimay 4.4 km (22/06)</strong></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-06-16_at_14.26.10_07dfc01e-076e-49dd-a977-a667660a1e48_1024x1024.png?v=1623850039\" /></div>\n<p><span>A short but flat prologue to start proceedings on Tuesday 22nd June. Riders will complete a loop both starting and finishing in Chimay. The profile is similar to that of the prologue at this year’s Festival Elsy Jacobs </span><span>—</span> albeit 2km longer <span>—</span> where Lorena Wiebes took the win ahead of her teammate Leah Kirchmann. Given how short and flat the course is this could also be one for the sprinters rather than the time trial specialists who won’t have much of a chance to get going on the 4.4km loop. </p>\n<p><em><strong><a href=\"https://www.rouleur.cc/es/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related: Women's WorldTour Calendar 2021 – The Rouleur Racing Guide</a></strong></em></p>\n\n<h4><strong>Stage 2 - Blankenberge - Bruges 112.6km (23/06)</strong></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-06-16_at_14.28.54_1024x1024.png?v=1623850163\" /></div>\n<p><span>Should the leader’s jersey get into the hands of a sprinter after the prologue, it might well stay there after stage two. The first road stage of the tour is a flat 112.6km race starting with 10km of neutral from Blankenberge to Bruges before the riders then complete four laps of a 24.8km circuit featuring cobbled sectors. </span></p>\n\n<h4><strong>Stage 3 - Galmaarden - Galmaarden 137.5km (24/06)</strong></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-06-16_at_14.29.55_1024x1024.png?v=1623850221\" /></div>\n<p><span> </span></p>\n<p><span>Stage three offers up a lumpy circuit race with five laps of a 27.5km course featuring two climbs, the Congoberg 1.25km at 5% but rising to 10% near the top, and the Steenhoutberg 1.9km maxing out at 11%. On top of the climbs are two cobbled sectors of 1.3km and 1.75km </span></p>\n<p><span>The climbs are steep enough and will be raced enough times to pose a threat to any sprinters who might not have the legs. However, the top of the final climb is 7km away from the finish meaning that unless a break has a clear gap there is enough time for the sprinter’s teams to bring it all back together for the flat finish.</span></p>\n\n<h4><strong>Stage 4 Geraardsbergen - Geraardsbergen 101.1km (25/06) </strong></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-06-16_at_14.31.49_1024x1024.png?v=1623850368\" /></div>\n<p><em>Full circuit profile</em></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-06-16_at_14.31.56_1024x1024.png?v=1623850418\" /></div>\n<div><em>'Local lap' profile</em></div>\n<div><em></em></div>\n<div><em></em></div>\n<div><em></em></div>\n<div><em></em></div>\n<div></div>\n<p><span>The organisers have saved the best until last with a punchy, Classics-style race featuring two iconic Tour of Flanders climbs in the form of the Muur van Geraardsbergen and the </span><span>Bosberg. The race finishes on top of the Muur van Geraardsbergen but there is also the short but painful Denderoordberg to contend with - a 700m climb averaging 7.5% and maxing out at 11%. </span></p>\n<p><span>The peloton will first complete two bigger circuits of 33.2km followed by two ‘local’ laps of 17.1km which include the main climbs. The race could be lost here if the jersey is on the back of a rider who might be worn down by their nearest rivals on the climbs.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-663756064_1024x1024.jpg?v=1623866066\" /></span></p>\n<p><span><em>The Muur van Geraardsbergen (Photo: Tim De Waele/ Getty Images)</em><br /></span></p>\n<h3>Contenders<strong> </strong>\n</h3>\n<p><span>The startlist for this year’s race has yet to be revealed, however we can expect to see a similar field to Tour de Suisse Women with a few of the WWT teams alongside Continental squads. There are opportunities for sprinters and punchy classics-style riders so we could see the likes of Emma Norsgaard, Alice Barnes, and Lorena Wiebes line up. If those riders turn up then the flatter stages will be theirs for the taking. </span></p>\n<p><span>Should newly-crowned Belgian ITT champion Lotte Kopecky line up with her Liv Racing team then she will be one to watch for the GC given her proven ability in both flatter and punchier races. </span></p>\n<p><span>SD Worx are unlikely to field their star riders at this race with the proximity to La Course and the Giro d'Italia Donne but this could be a race for their domestiques or younger riders to shine. Lonneke Uneken, Anna Shackley, or Niamh Fisher-Black might be given the go ahead to ride for themselves at a race such as this one.</span></p>\n<p><span>Trek-Segafredo may also choose to field a similar team to Tour de Suisse women where we saw Lizzie Deignan taking intermediate sprints, however the likes of Deignan might also be sitting out this race in favour of resting for La Course which is just a few days later. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/to-the-wire-the-first-women-s-tour-de-suisse\">Related: To the wire – the first women's Tour de Suisse</a></em></strong></p>\n<p><span>The lure of La Course with its World Tour status might prevent Jumbo-Visma from fielding a squad at this race. However, if they take the likes of Anna Henderson, Anouska Koster, or Riejanne Markus they could have a good chance at the overall depending on the rest of the field. </span></p>\n<p><span>Amongst the Continental squads, Ceratizit-WNT could field Lisa Brennauer with her excellent time trial prowess and track record of performing well in stage races with similar parcours. If A.R Monex race with their sprinter Arlenis Sierra, we could see her contest the flat stages alongside the World Tour favourites. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"bbc4c2e328970acbd653403333b952a424cd76d7efa7cf43830fb794409dfe2c","category":"Cycling"}