{"title":"Robbery victim gets his phone back when thieves realize it’s not an iPhone","link":"https://www.macworld.com/article/2162591/stolen-android-phone-returned-thieves-iphone.html","date":1701785566000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>There are <a href=\"https://www.macworld.com/article/678489/used-iphones-twice-as-valuable-as-android-phones.html\">downsides</a> to owning an Android phone, but one unexpected advantage has emerged: Thieves are less likely to be interested in your property.</p>\n\n\n\n<p>At the end of last month, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://katv.com/news/nation-world/uber-eats-robbed-thieves-carjacking-stolen-auto-dc-14th-street-clifton-northwest-metropolitan-police-department-iphone-android-guns-black-bmw-food-delivery&amp;xcust=1-1-2162591-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">KATV</a> reports, a Washington man was robbed at gunpoint, with the thieves snatching the keys to his wife’s truck and the man’s smartphone. But here’s where the story takes an unexpected turn: they looked at the phone, apparently realized it was an Android handset rather than an iPhone, <em>and then returned it</em>.</p>\n\n\n\n<p>“They basically looked at that phone and was like ‘Oh, that’s an Android? We don’t want this. I thought it was an iPhone,'” said the man’s wife.</p>\n\n\n\n<p>Of course, we’re hearing this something like third-hand, and the word “like” is doing a lot of heavy lifting in that sentence. Depending on what exactly was said I would have thought it was possible that the thieves were more dismayed by the condition or spec or unfamiliarity of the phone than the simple fact of its being based on the Android operating system. That said, the average Android handset is worth considerably less than the average iPhone, of course, but it would be interesting to know which Android phone this was. Would thieves be so sniffy about a <a href=\"https://www.techadvisor.com/article/1511727/samsung-galaxy-s23-ultra-review.html\" target=\"_blank\">Samsung Galaxy S23 Ultra</a>, for example? I suppose we’ll never know.</p>\n\n\n\n<p>And before we go too far down the whimsical “isn’t life funny?” road, it’s worth bearing in mind that the truck was <em>not</em> returned, and as its owner mournfully noted, “That was my income. That was the way I made money. I did Uber Eats and Instacart so, that was our livelihood.” But at least he doesn’t need to buy a new phone now.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bbcbcfc672065099fde70e65a9a5246d0cc7445c8ef6d1e45136afc8930ac06e","category":"Apple"}