{"title":"Associative linking for collaborative thinking: Self-organization of content in online Q&A communities via user-generated links","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300179","date":1710165600000,"content":"<p>by Noa Sher, Sheizaf Rafaeli</p>\r\n\r\nVirtual collaborative Q&amp;A communities generate shared knowledge through the interaction of people and content. This knowledge is often fragmented, and its value as a collective, collaboratively formed product, is largely overlooked. Inspired by work on individual mental semantic networks, the current study explores the networks formed by user-added associative links as reflecting an aspect of self-organization within the communities’ collaborative knowledge sharing. Using eight Q&amp;A topic-centered discussions from the Stack Exchange platform, it investigated how associative links form internal structures within the networks. Network analysis tools were used to derive topological indicator metrics of complex structures from associatively-linked networks. Similar metrics extracted from 1000 simulated randomly linked networks of comparable sizes and growth patterns were used to generate estimated sampling distributions through bootstrap resampling, and 99% confidence intervals were constructed for each metric. The discussion-network indicators were compared against these. Results showed that participant-added associative links largely led to networks that were more clustered, integrated, and included posts with more connections than those that would be expected in random networks of similar size and growth pattern. The differences were observed to increase over time. Also, the largest connected subgraphs within the discussion networks were found to be modular. Limited qualitative observations have also pointed to the impacts of external content-related events on the network structures. The findings strengthen the notion that the networks emerging from associative link sharing resemble other information networks that are characterized by internal structures suggesting self-organization, laying the ground for further exploration of collaborative linking as a form of collective knowledge organization. It underscores the importance of recognizing and leveraging this latent mechanism in both theory and practice.","author":"Noa Sher","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bbd0d1444312a87b51b8d195839089e5abb4491b1700c20cd6826f827867aa23","category":"Interdisciplinary"}