{"title":"Competitive Position of Polish and Ukrainian Food Producers in the EU Market","link":"https://www.preprints.org/manuscript/202410.1371/v1","date":1729231184000,"content":"The war in Ukraine and the related disruptions in supply chains shook global markets for agricultural and energy commodities, causing their prices to increase to unprecedented levels. At the same time, this situation highlighted the fact that Ukraine is an important global producer and exporter of certain agricultural products. The complete opening of the EU market to duty-free imports from Ukraine showed that Ukrainian products constitute competition for both EU and Polish food producers. This, in turn, caused further disruptions in food supply chains within the EU. The aim of the article is to assess the competitive position of Polish and Ukrainian food producers in the EU market and the prospects for the evolution of their competitive advantages. The analysis was carried out using selected quantitative indicators of competitive position, namely Balassa's Revealed Comparative Advantage Index (RCA) and the Trade Coverage Index (TC). The calculations were made using statistical data from the World Bank WITS-Comtrade database. The research covered the period from 2018 to 2023 inclusive. The research shows that between 2018 and 2023, the share of products in Polish exports to the EU, in which both countries compete, increased to 37.5%; that is, both countries had comparative advantages in these products on this market. The current competition includes, among others, poultry meat, bakery products, wafers and cookies, chocolate, corn, fruit juices, frozen fruit, water and other non-alcoholic drinks, and wheat. At the same time, more than half of Polish exports consisted of products that may become the subject of such competition in the future (currently, only Poland has comparative advantages in the export of these products). These may include, among others, cigarettes, animal feed, fresh or chilled beef, other food products, smoked fish, canned meat, fish fillets, pork, canned fish, and liquid milk and cream. Therefore, Polish food producers face big challenges; the process of post-war reconstruction of Ukraine and its potential integration with the single European market will strengthen the competitive position of Ukrainian food producers in the EU market. The current competitive strategy of Polish producers, based on cost and price advantages, may turn out to be ineffective under these conditions. Therefore, they must look for new sources of competitive advantage that will distinguish Polish products from cheaper Ukrainian ones. Therefore, a strategy of competing on quality may prove effective.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bbd6444badd0d0f327c7910c81d86cf85956a0af0411d00497800252dae3809c","category":"Interdisciplinary"}