{"title":"PSVI-3 Effects of dried distillers grains on performance of suckling beef calves in a creep-feeding system","link":"https://academic.oup.com/jas/article/102/Supplement_2/342/7664779?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Dried distiller’s grains (DDG) have been successfully used in beef cattle diets due to their high protein content and increasing availability around the world. However, the chemical composition of DDG varies according to the type of fermented grain and processing methods, and its increased sulfur content can compromise animal performance. There are few studies evaluating DDG in supplements for beef calves in creep-feeding systems. Hence, our objective was to assess the effects of DDG on performance of suckling beef calves in a creep-feeding system. Nellore×Red Angus male calves (n = 37), weighing 162 ± 4.06 kg at 120 d of age, along with their respective dams (n =37 Nellore cows) were used. The cow-calf pairs were randomly assigned into eight paddocks formed by <span>Urochloa decumbens</span> pastures. Animals were subjected to a 14-dadaptation period and an additional 108-d period for performance evaluation. All animals had access to water and mineral mixture ad libitum. Four treatments were evaluated, as follows: control (mixture mineral only), supplement without DDG, or supplements including 375 and 750 g/kg DDG [dry matter (DM) basis]. The supplements were composed of ground corn, soybean meal, urea, and DDG, planned to contain 300 g CP/kg DM, and provided daily at 7.0 g/kg body weight (BW; as fed). Treatments were assigned to experimental units (i.e., calf) in a completely randomized design. Calves were weighed at the beginning and end of the experiment, as well as every 15 d, to adjust the amount of supplement to be provided. Comparisons between treatments were performed by decomposing its sum of squares into orthogonal effects as follows: 1) control (mineral mixture only) versus supplemented calves; 2) evaluation of the linear and quadratic effects of the inclusion of DDG in the supplements. Data were analyzed using the MIXED procedure of SAS 9.4 (α = 0.05). Supplementation enhanced (<span>P</span> &lt; 0.05) average daily gain (ADG) and final body weight (FBW) when compared with control. On average, ADG was increased from 0.94 kg/d to 1.08 kg/d for control and supplemented calves, respectively. On the other hand, ADG and FBW decreased linearly as the DDG inclusion in the supplement increased (<span>P</span> &lt; 0.05). The differential ADG of calves that received supplements with 375 and 750 g/kg DDG compared with calves that did not receive DDG was -0.046 and -0.096 kg, respectively. It is worth emphasizing that calves fed supplements with 375 g/kg and 750 g/kg DDG had a 14% and 46% less supplement intake, respectively, than animals that were not fed DDG. Supplementing beef calves in a creep-feeding system enhances animal performance. However, the inclusion of high DDG levels in supplements decreases the performance of suckling beef calves.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bbd64ffad44573520542fc82b485a5370853981e275afd5dff1e73a3fb57a56c","category":"Environment"}