{"title":"Changes in muscle activation with graded surfaces during canter in Thoroughbred horses on a treadmill","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305622","date":1718373600000,"content":"<p>by Yuji Takahashi, Toshiyuki Takahashi, Kazutaka Mukai, Yusaku Ebisuda, Hajime Ohmura</p>\r\n\r\nUnderstanding how muscle activity changes with different surface grades during canter is essential for developing training protocols in Thoroughbreds because canter is their primary gait in training and races. We measured the spatiotemporal parameters and the activation of 12 surface muscles in the leading limb side of 7 Thoroughbreds. Horses were equipped with hoof strain gauges and cantered at 10 m/s on a treadmill set to grades of −4%, 0%, 4%, and 8%, randomly, for 30 seconds each without a lead change. Integrated electromyography (iEMG) values during stance and swing phases were calculated and normalized to mean iEMG values during stride duration at 0% grade in each muscle. The iEMG values at each grade were compared using a generalized mixed model. Stride duration significantly decreased due to shorter swing duration on an 8% grade (P &lt; 0.001) compared to all other grades, where no significant changes were observed. Compared to a 0% grade, the normalized iEMG values during the stance phase on an 8% grade in five muscles significantly increased (<i>Musculus infraspinatus</i>; +9%, <i>M</i>. <i>longissimus dorsi</i> (LD); +4%, <i>M</i>. <i>gluteus medius</i> (GM); +29%, <i>M</i>. <i>biceps femoris</i>; +47%, <i>M</i>. <i>flexor digitorum lateralis</i>; +16%). During the swing phase, the normalized iEMG values in six muscles significantly increased on an 8% grade compared to a 0% grade (<i>M</i>. <i>splenius</i>; +21%, <i>M</i>. <i>triceps brachii</i>; +54%, LD; +37%, GM; +24%, <i>M</i>. <i>semitendinosus</i>; +51%, <i>M</i>. <i>extensor digitorum longus</i>; +10%). No significant changes were observed in iEMG values on −4% and 4% grades compared to the 0% grade. Although +/− 4% grades had little effect on neuromuscular responses, 8% uphill canter reduced stride duration due to decreased swing duration and required increase of muscle activation during either stance and swing phase. Canter on an 8% grade might strengthen equine muscles to increase propulsive force and stride frequency.","author":"Yuji Takahashi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bbd94441ecb0f01ea53391a6d6adb9ea825cba218fc9ef0007a97eb90d926c05","category":"Interdisciplinary"}