{"title":"Drug makers have tripled the prices of top Medicare drugs","link":"https://arstechnica.com/?p=1960856","date":1692107385000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/GettyImages-148302547-800x600.jpg\" alt=\"Hundred dollar bills inside prescription pill bottles\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/GettyImages-148302547.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/license/148302547\">Getty | Bill Diodato</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The top 25 costliest drugs for Medicare Part D plans earned their lofty rankings largely through exorbitant price hikes—increases that, on average, more than tripled their list prices since they entered the market, according to <a href=\"https://www.aarp.org/pri/topics/health/prescription-drugs/prices-top-medicare-part-d-drugs-tripled-since-entering-market.html\">a new analysis by AARP</a>.</p>\n<p>For nearly all the drugs, the price hikes far outstripped the rate of inflation, with increases ranging from 20 percent to 739 percent during the drugs' lifetimes on the market. Only one of the top 25 drugs—Trelegy Ellipta, an inhaler for asthma and chronic lung conditions—had price increases that were below the rate of inflation during its time on the market. Since its initial release in 2017, Trelegy Ellipta's price increased only 20 percent, compared with a general inflation rate of 23 percent.</p>\n<p>Overall, the average lifetime price increase for the top 25 drugs was 226 percent. The highest increases were seen in drugs that have been on the market the longest. For example, drugs that were on the market for under 12 years had an average lifetime price increase of 58 percent, while those on the market for 20 or more years had an average lifetime increase of 592 percent.</p></div><p><a href=\"https://arstechnica.com/?p=1960856#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1960856&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bbe1f767aad354324332e66952f26fd47166e534a0062c82f74f0fab0c406906","category":"Tech"}