{"title":"Total Cholesterol Determination Accuracy in Dried Blood Spots","link":"https://www.preprints.org/manuscript/202407.0863/v1","date":1720609158000,"content":"BACKGROUND\nDetecting total cholesterol in dried blood spots could aid in identifying individuals with a high likelihood of familial hypercholesterolemia and could be used as a screening measure. This study aims to assess the diagnostic accuracy of dried blood spots on Whatman 903 paper cards using a manual enzymatic technique.\nMETHODS \nA total of 394 samples collected as serum and dried blood spots were compared. Cholesterol was determined in serum using the automated reference method, while cholesterol on paper was measured using a manual enzymatic method. Within- and between-day diagnostic variability were analyzed. The correlation between both methods was assessed using Passing-Bablok regression and Bland-Altman plot. Internal validation of our correlation formula was performed on 149 samples, along with external validation of the formula proposed by Corso et al.\nRESULTS\nThe within- and between-day coefficient of variation was found to be lower than 10.14% and 14.09%, respectively. Method comparison yielded an area under the curve of 0.976, with a standard error of 0.009. Passing-Bablok regression indicated a precision of 0.803 and an accuracy of 0.96. Internal validation precision was measured at 0.716. Regarding internal validation, calculated cholesterol with our regression line did not differ from serum cholesterol analysis, while significant differences were observed in calculated cholesterol levels using the external formula.\nCONCLUSIONS\nTotal cholesterol analysis in dot blood spots demonstrates high precision and reproducibility. This method reliably enables the incorporation of this biological marker into neonatal screening for familial hypercholesterolemia detection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bbe41d15fb8582651999b5dac2566ef3fd348c2a033799534ebb556409e0fa4d","category":"Interdisciplinary"}