{"title":"A Literature Review of Tilapia/Lettuce Aquaponics—Production Status, Varieties, and Research Gaps","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/2642434?af=R","date":1726761892000,"content":"<p>Tilapia and lettuce are the most frequently used combination among aquaponics producers, hobbyists, and educators. Therefore, this literature review aims to aggregate the knowledge on the current status of tilapia/lettuce production and identify research gaps. Among the 40 reviewed publications, 72.5% used Nile tilapia, 17.5% used red, 2.5% used red Mozambique, 5% used rocky mountain strain, and 5% of the articles stated that they used tilapia without reporting the species. Tilapia initial density used ranged from 0.34 to 28.4 kg/m<sup>3</sup>, which depended on the purpose of the study, experimental size, and design. For the hydroponic unit, 55% of the publications utilized deep water culture (DWC), 35% utilized nutrient film technique (NFT), and 10% utilized media bed (MB). The optimum ratio between fish feeding rate and plant growing area (60 g of feed/day/m<sup>2</sup>) was originally calculated at the University of Virgin Island and published in 1988 using Bibb lettuce. This recommended ratio has been used by farmers and researchers as a rule of thumb for years. However, this recommended ratio did not take into account other factors such as fish species, protein content of the diet, plant species/variety, plant density, biological filtration, and airflow in the grow bed. Hence, the current review suggests that the fish-to-plant ratio, fish density, and flow rate in the aquaponic systems needs to be reevaluated. As there is a thermal preference mismatch between tilapia and lettuce, there is a need to evaluate the optimum temperature for both to obtain the highest growth performance. Nowadays, it is believed that the farmed stocks’ genetic quality needs to be regularly enhanced and protected. Consequently, feeding frequency, feeding amount, and stocking densities in aquaponic systems should be continuously reevaluated with the improved strains of tilapia as well as heat-tolerant varieties of lettuce.</p>","author":"Aya S. Hussain, \nPaul B. Brown, \nHisham Abdelrahman","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bbe453a5855ca9c87749c9df4048ca8fc36d03befa104f8014d4e47427e040a0","category":"Environment"}