{"title":"Activision shuts down popular fan servers for legacy Call of Duty games","link":"https://arstechnica.com/?p=1941303","date":1684860537000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Prerelease video of <em>Modern Warfare 2</em>'s SM2 mod, which has ceased development following an Activision cease-and-desist request. </p></div>\n<p>Activision has sent cease-and-desist letters to two makers of popular fan clients for legacy Call of Duty titles in recent weeks. The move cuts off access to the many gameplay and quality-of-life improvements brought by these clients and stops what fans say is the only safe way to play these older games without the threat of damaging hacking by opponents.</p>\n<p>The first victim of Activision's recent efforts was SM2, a major <em>Modern Warfare 2</em> modding project whose development <a href=\"https://web.archive.org/web/20230123173904/https://sm2.gg/faq/\">started over two years ago</a>. Since then, the modding group has been working on updating that seminal 2009 release with new weapons, in-game perks, a redesigned UI, new streak and progression systems, and even <a href=\"https://web.archive.org/web/20230422161946/sm2.gg/devblog-4/\">a recent move to a more modern game engine</a>.</p>\n<p>Those efforts stopped last week, though, before the mod could even release its first version. The SM2 Twitter account <a href=\"https://twitter.com/sm2game/status/1658745182819598337\">reported</a> that \"a team member received a Cease &amp; Desist letter on behalf of Activision Publishing in relation to the SM2 project. We are complying with this order and shutting down all operations permanently.\"</p></div><p><a href=\"https://arstechnica.com/?p=1941303#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941303&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bbe7de2eb947665fcd27c244ee49d4d1858cdcd4a72b93f96b68bfe65c56e5dd","category":"Tech"}