{"title":"The redesigned $499 iPad mini finally catches up with the times","link":"https://arstechnica.com/?p=1794540","date":1631639619000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Apple_iPad-mini_hero_09142021-980x700.jpg\" /></div>\n        <p>\n          The redesigned iPad mini.                      [credit:\n                        Apple                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>After years of being stuck with the same look and features, Apple's iPad mini will finally get a major redesign akin to last year's iPad Air update, <a href=\"https://www.apple.com/newsroom/2021/09/apple-unveils-new-ipad-mini-with-breakthrough-performance-in-stunning-new-design/\" target=\"_blank\">the company announced today</a>. The tablet's screen size gets a bump from 7.9 to 8.3 inches and includes a new A15 Bionic processor that Apple says is \"up to 80% faster\" than the A12 chip in the old iPad mini 5. But the redesign also comes with a price hike—the new <a href=\"https://apple.sjv.io/c/1305166/435031/7613?u=https%3A%2F%2Fwww.apple.com%2Fipad-mini%2F&amp;subid1=ArsAppleEvent091421\" target=\"_blank\">iPad mini starts at $499</a> for a Wi-Fi model with 64GB of storage, $100 more than the previous model.</p>\n<p>Like other recent iPads and iPhones, the iPad mini drops the home button to make more room on the front of the device for a larger, almost edge-to-edge screen. However, the device does not feature Face ID like the iPad Pro. Rather, it follows the 2020 iPad Air in featuring a TouchID fingerprint reader on the power button for authentication. It also leaves behind Apple's long-standing, proprietary Lightning port in favor of industry standard USB-C—a change that also came to other recent iPad redesigns. The flat edges of the tablet bring the new mini's design in line with the iPad Air 4 and post-2018 iPad Pros. The design also enables Apple Pencil 2 compatibility.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screen-Shot-2021-09-14-at-12.20.50-PM.jpg\" /><p>An overview of the new iPad mini's features. (credit: Apple)</p></div>\n<p>Internally, the A15 chip combines a six-core CPU (that's two high-performance cores and four low-power efficiency cores) that Apple says is 40% faster than the A12 and a 5-core GPU that the company says is 80% faster than the A12. Both the rear and front-facing cameras get significant upgrades—the 8MP rear camera in the mini 5 is bumped up to 12MP in the new model, and the front-facing camera gets a 12MP resolution bump and support for the face-and-body-tracking \"Center Stage\" feature from the 2021 iPad Pros. Support for 5G and Wi-Fi 6 round out the connectivity features.</p></div><p><a href=\"https://arstechnica.com/?p=1794540#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1794540&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bbebeb0c2cc92c1a62b85f039c398a4769470c49d48caef80c5735de2fa90103","category":"Tech"}