{"title":"Length-of-stay and factors associated with early discharge after birth in health facilities in Guinea by mode of birth: Secondary analysis of Demographic and Health Survey 2018","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003786","date":1727964000000,"content":"<p>by Aline Semaan, Fassou Mathias Grovogui, Thérèse Delvaux, Natasha Housseine, Thomas van den Akker, Alexandre Delamou, Lenka Beňová</p>\r\n\r\nThe immediate postpartum period (first 24 hours after birth) represents a critical time for women and newborns. Postnatal length-of-stay varies globally; in Guinea, a 24-hour facility stay following childbirth is recommended, with an emphasis on providing frequent monitoring of mother and newborn for the first 6 hours. This study describes postpartum length-of-stay following facility-based births in Guinea, and investigates factors associated with early discharge. This cross-sectional study analysed secondary Demographic and Health Survey data covering the most recent livebirths during 2013–2018. We included 2,763 women who gave birth vaginally or by caesarean section in healthcare facilities. Early discharge following vaginal birth was defined according to two cut-offs (&lt;24 hours and &lt;6 hours); early discharge following caesarean section was defined as &lt;72 hours. We assessed socio-demographic, obstetric and health-system factors associated with early discharge using binary and multi-variable logistic regression. Among women with a vaginal birth, 81.5% were discharged &lt;6 hours, with a median length-of-stay of 3 hours. 28% of women who had caesarean section were discharged &lt;72 hours. Odds of discharge &lt;6 hours among women who gave birth vaginally were lower for births in non-government hospital(aOR = 0.55[95%CI = 0.35;0.85]), and multiple births(aOR = 0.54[95%CI = 0.31;0.94]); while the odds were higher in five of the 8 regions compared to Boké. Among women who gave birth by caesarean section, odds of discharge &lt;72 hours were lower for births in government hospitals(aOR = 0.09[95%CI = 0.03;0.3]), and girl newborns(aOR = 0.15[95%CI = 0.05;0.48]).This study showed that postpartum length-of-stays in Guinea is on average shorter than the local recommendations, with the majority of postpartum women with vaginal births spending less than 6-hours in health facilities after birth. Early discharge was associated with type of facility of birth and region. This warrants an in-depth exploration of reasons related to women’s and families’ preferences, health workers’ practices, resource availability, and whether/how early discharge affects postpartum quality-of-care and health outcomes.","author":"Aline Semaan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"bbf69a3dbee18a81abb6a8944ef4a0ff084741f1c38919dde0101b1f99f437af","category":"Environment"}