{"title":"Integration of Indigenous Low Carbon Technologies with Novel Low Energy Mass Housing in Ladakh (U.T.)","link":"https://www.preprints.org/manuscript/202406.2008/v1","date":1719547540000,"content":"Great Himalayan range with regions namely, Jammu &amp; Kashmir, Ladakh and high altitude parts of north eastern states inherently experience high solar exposure, cold, arid climate and significantly challenging geography. With a scarcity of affordable public housing projects in these regions a grid enabled low energy residential prototype is proposed having the capability to operate on nearly zero consumption of heating and cooling energy with the application of indigenous and contemporary energy efficient passive design techniques. Preliminary study, development of design and reading of simulation results were applied for the performance and benefit analysis of the low energy building prototype. Analysis of the climatic zone further classified and narrowed the design criterion by confirming upon beneficial architectural components proven to be energy efficient. These architectural components include, optimization of direct solar gain and orientation of building envelope, modified trombe wall system, traditional sunrooms, solar chimney with openable vents, efficient spatial planning and compliance of relevant parameters such as window-wall-ratio (WWR). The proposed low energy housing for the economically weaker section is estimated to save nearly 50% of active fuel based household heating energy. Site has been planned in such a way that about 100% of required electricity can be generated from on site renewable energy for the proposed infrastructure, it is proven more beneficial if additional electricity is generated to offset the power supply and result in lower or subsidized electricity bills. Design is compliant to different codes relevant to energy conservation and low-income housing with an embodied carbon of about 1.2 kgCO2/m2 per dwelling unit giving ‘A’ grade in cradle to gate impacts. The findings and performance of this prototype can serve as a guideline for energy efficient design in low income group housing situated in severe cold and arid regions of India such as Ladakh (U.T.).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bbf974aaaecde09376c56e773322c33eb23544c288ef9106b714c9003ac96966","category":"Interdisciplinary"}