{"title":"The good times may stop rolling as Apple faces tough questions","link":"https://www.macworld.com/article/345681/apple-challenges-chip-shortages-epic-app-store-ipad-sales.html","date":1620662974000,"content":"\n<div>\n<section><div></div></section><p>With a <a href=\"https://www.macworld.com/article/344740/apple-q2-2021-earnings-record-revenue-iphone-ipad-mac-wearables-services.html\">blockbuster quarter</a> in its rear-view mirror, Apple seems like it’s sitting pretty right now. But the problem with results as astounding as those Apple recently posted is that it can be challenging when it comes time to follow up on them. Can you keep beating expectations forever? For years, the company had trouble living up to the “tough compare” set by its blockbuster sales of the iPhone 6.</p>\n\n\n\n<p>More to the point: As big, successful, and rich as Apple is, it isn’t without challenges, many of which seem to be rearing their heads at this exact moment. The company faces threats that are outside of its control, as well as those that are mainly of its own making. Despite the huge war chest on which the company sits, not all of those problems are ones that it can easily fix by the liberal application of money.</p>\n\n\n\n<p>While the company as a whole will almost certainly weather the storm ahead, there’s a good chance that it won’t be without some dings, some dents, and perhaps even some casualties along the way.</p>\n\n\n\n<h2>The supply chains that bind</h2>\n\n\n\n<p>High demand—in large part driven by the pandemic—has been <a href=\"https://www.pcworld.com/article/3615234/chip-shortages-will-continue-until-2023-superfoundry-tsmc-says.html\">plaguing the semiconductor market</a> for months now. In April, even large automakers like Ford and GM started shutting down some production lines in response to the shortages. Though <a href=\"https://www.macworld.com/article/342900/apple-products-spring-event-delayed-chip-display-shortages-ipad-macbook-airpods.html\">Apple has managed to largely avoid shortages</a> thus far, the company did warn of issues in the coming quarter, which it said would predominantly affect the iPad and the Mac.</p>\n\n\n\n<p>As a culprit, Apple CEO Tim Cook pointed to so-called “legacy nodes,” which <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnbc.com/2021/04/28/chip-shortages-for-ipads-and-macs-may-cool-apples-hot-streak.html&amp;xcust=1-1-345681-0-0-0&amp;sref=https://www.macworld.com/feed\">CNBC describes as</a> “chips which use older manufacturing methods”—namely, ancillary chips like display controllers, power management, and decoding audio. Those are functions that obviously play a key part in many, if not all, Apple products, so it’s quite possible that those shortages will have a broad impact over the next several months.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/computer-logic-board.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>An industry-wide chip shortage will affect Apple’s production goals in the near future.</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://unsplash.com/photos/-9jmFkN-_U4&amp;xcust=1-1-345681-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Aler Kiv/Unsplash</a></div>\n\n\n\n<p>Apple has proved to be extremely savvy in planning ahead and locking down the supply lines it knows it’ll need, though Cook also confirmed that the company has basically burned through its safety net at this point. Since the company doubtlessly has more announcements scheduled for later this year, the severity of the chip shortage could impact both the timing of when those new products arrive as well as the kind of volumes in which they may be available.</p>\n\n\n\n<h2>Bound by law</h2>\n\n\n\n<p>The App Store remains an Achilles heel of Apple’s business and, case in point, it’s currently being targeted in two separate venues: the trial, currently in progress, where <a href=\"https://www.macworld.com/article/345832/apple-epic-trial-tim-cook-tim-sweeney-netflix-imessage-app-store-rejection-rates.html\">game developer Epic has levied charges </a><a href=\"https://www.macworld.com/article/234497/epic-games-v-apple-court-battle-antitrust-lawsuit.html\">of</a><a href=\"https://www.macworld.com/article/345832/apple-epic-trial-tim-cook-tim-sweeney-netflix-imessage-app-store-rejection-rates.html\"> anti-competitive behavior</a> against Apple, and the investigation being pursued by the European Commission’s antitrust branch.</p>\n\n\n\n<p>Apple, of course, has faced numerous legal challenges in the past. Oftentimes it’s been able to settle these problems in deals involving some cash, but this time around it seems as though both of the other parties are out for blood. To me, the feeling is most reminiscent of the U.S. government’s case against the company for ebook price-fixing back in the early 2010s, a decision that (correct though it may have been) essentially ended up kneecapping Apple’s competition with Amazon.</p>\n\n\n\n<p>The stakes this time are similarly high: Apple’s App Store has become a huge economy of its own, as Apple itself likes to tout every time it gets the chance. Though the company doesn’t break out results in its individual segments, it seems indisputable that the growth of its Services business is certainly fueled in a very large part by the App Store.<a href=\"https://www.macworld.com/article/345475/the-pressure-is-on-apple-to-address-accusations-of-anticompetitive-behavior.html\"> If Apple is forced to change its mode</a>l, whether by enabling users to sideload apps, or allowing competing app stores, or even as extremely as divesting itself of the App Store business, the company stands to take a hit to not just its bottom line, but also to its long-running philosophy of controlling its products from stem to stern.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/iPhone-8.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Apple’s App Store policies are under attack on multiple fronts.</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://unsplash.com/photos/1XXqGbkRJD8&amp;xcust=1-1-345681-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Michael Weidemann/Unsplash</a></div>\n\n\n\n<p>Even regardless of the end result of these cases, the Epic trial <a href=\"https://www.macworld.com/article/345832/apple-epic-trial-tim-cook-tim-sweeney-netflix-imessage-app-store-rejection-rates.html\">has already unleashed a torrent of document</a>s from inside the usually very tight-lipped Apple, which in and of itself may very well prompt further scrutiny from not just the press and developers, but from legislators and regulators as well.</p>\n\n\n\n<h2>The enemy within</h2>\n\n\n\n<p>As always, no list of Apple challenges is complete without pointing to the company’s biggest risk: itself.</p>\n\n\n\n<p>Apple’s latest run of products has been nothing short of astounding, from <a href=\"https://www.macworld.com/article/234860/apple-m1-macs-what-you-need-to-know-about-buying-new-apple-silicon-macs.html\">the transition to Apple silicon</a> on the Mac to <a href=\"https://www.macworld.com/article/343706/ipad-pro-2021-faq-price-specs-features-release-date.html\">the latest iPad Pro</a>. But these products aren’t without their weaknesses, and in particular, despite blockbuster iPad sales in the last year, the company seems to still be struggling with software that can’t catch up to its hardware.</p>\n\n\n\n<p>Let’s be clear: Apple’s not in danger of nobody buying an iPad—that’s not going to happen. But what does bear watching is how Apple plans to position the iPad in the future. Is it condemned to be a device that is great for <em>some</em> things, but not <em>everything</em>? Or, now that it runs on the same hardware that’s in the latest Macs, will Apple finally bite the bullet and set about making the iPad a true parallel to its older sibling?</p>\n\n\n\n<p>This fundamental philosophical question is no less dangerous to the company’s future than all of the external threats Apple faces. Because if it can’t figure out where it wants to go, then it can’t very well get there.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bbfcff9feaa2b4594bd3a5db5942eb3ed8fab69f213b9bf22a4c7f99f7092531","category":"Apple"}