{"title":"AppleDB Offers Useful Database of Apple Devices, Software Updates, Firmware Releases, and More","link":"https://www.macrumors.com/2023/07/18/appledb/","date":1689689714000,"content":"Launched in 2022, <a href=\"https://appledb.dev/\">AppleDB</a> is a helpful resource that provides a database of Apple devices, software updates, firmware releases, and more. The website was recently updated with all macOS releases and beta versions dating back to Mac OS X Tiger in 2005.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/AppleDB.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAppleDB catalogs over 4,000 software and firmware versions for a wide range of Apple products, along with model numbers, model identifiers, tech specs, release dates, and other information. This includes iOS, iPadOS, macOS, watchOS, tvOS, visionOS, and HomePod software releases, along with firmware for accessories like AirPods, Beats, the Studio Display and Pro Display XDR, the AirTag, MagSafe accessories, and more.\r<br />\n\r<br />\nThe database also lists bridgeOS versions for the T1 and T2 security chips in Intel-based Macs, Xcode versions, Safari Technology Preview releases, and more.\r<br />\n\r<br />\n<a href=\"https://appledb.dev/\">AppleDB</a> is worth bookmarking if you are an Apple enthusiast, and the database will be updated with additional information over time, such as software releases for PowerPC-based Macs. The public can contribute to the database by making a pull request <a href=\"https://github.com/littlebyteorg/appledb\">on GitHub</a>, with all information subject to review. The website has a <a href=\"https://discord.gg/rtfNDxnJfB\">Discord server</a> and a <a href=\"https://twitter.com/AppleDBdev\">Twitter account</a> where users can chat with the community and read the latest updates.<br />This article, \"<a href=\"https://www.macrumors.com/2023/07/18/appledb/\">AppleDB Offers Useful Database of Apple Devices, Software Updates, Firmware Releases, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/appledb-offers-useful-database-of-apple-devices-software-updates-firmware-releases-and-more.2396228/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bbfce12e882d721e5607a556a5e5bd89b092c7cf7b9bd22b7e9e219f9e4633f9","category":"Apple"}