{"title":"FlexGroup Volume Management for Amazon FSx for NetApp ONTAP is now available","link":"https://aws.amazon.com/blogs/aws/flexgroup-volume-management-for-amazon-fsx-for-netapp-ontap-is-now-available/","date":1701054353000,"content":"<p>You can now create, manage, and back up your <a href=\"https://aws.amazon.com/fsx/netapp-ontap/\">Amazon FSx for NetApp ONTAP</a> FlexGroup volumes using the AWS Management Console, the Amazon FSx CLI, and the AWS SDK. FlexGroups can be as large as 20 petabytes and offer greater performance for demanding workloads. Before this launch you could only create them using the ONTAP CLI and the ONTAP REST API (these options remain available). Also new to this launch is the ability to create Amazon FSx backups of your FlexGroup volumes.</p> \n<p><span><strong>FlexVol and FlexGroup</strong></span><br /> FSx for ONTAP supports two volume styles:</p> \n<p><strong>FlexVol</strong> – Support for up to 300 TiB of storage, making these volumes a good fit for general-purpose workloads.</p> \n<p><strong>FlexGroup</strong> – Support for up to 20 PiB of storage and billions of files per volume, making these volumes a good fit for more demanding electronic design automation (EDA), seismic analysis, and software build/test workloads.</p> \n<p><span><strong>Using FlexGroups</strong></span><br /> I will use the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> to create a new file system. I select <strong>Amazon FSx for NetApp ONTAP</strong>, and click <strong>Next</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/06/flv_chooser_1.png\" width=\"800\" height=\"409\" /></p> \n<p>I select <strong>Standard create</strong>, enter a name for my file system (<strong>FS-Jeff-1</strong>), and select <strong>Single-AZ</strong> as the deployment type:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/flv_spec_top_3.png\" width=\"805\" height=\"884\" /></p> \n<p>I can use the recommended throughput capacity, or I can specify it explicitly:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/06/flv_pick_tp_2.png\" width=\"645\" height=\"590\" /></p> \n<p>As you can surmise from the values above, the throughput is determined by the number of high availability (HA) pairs that will be used to host your file system. A single-AZ file system can be hosted on up to 6 such pairs; a multi-AZ file system must reside on a single pair. To learn more about these options visit <a href=\"https://aws.amazon.com/blogs/aws/new-scale-out-file-systems-for-amazon-fsx-for-netapp-ontap/\">New – Scale-out file systems for Amazon FSx for NetApp ONTAP</a>.</p> \n<p>After making my selections for <strong>Network &amp; security</strong>, <strong>Encryption</strong>, and <strong>Default storage virtual machine configuration</strong>, I select the <strong>FlexGroup</strong> volume style, assign a name to the initial volume, and either accept the recommended number of constituents or specify it myself:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/flv_vol_style_3.png\" width=\"741\" height=\"757\" /></p> \n<p>On the next page I review my choices and click <strong>Create file system</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/06/flv_ok_go_1.png\" width=\"799\" height=\"289\" /></p> \n<p>The creation process is a good time for a lunch break. When I return the initial volume (<strong>Vol1</strong>) of my file system is ready to use. I can create additional FlexVol or FlexGroup volumes as needed:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/06/flv_add_fs_1.png\" width=\"600\" height=\"316\" /></p> \n<p><span><strong>Things to Know</strong></span><br /> Here are a couple of things to keep in mind about FlexGroup volumes:</p> \n<p><strong>Constituents</strong> – Although each FlexGroup volume can have as many as 200 constituents, we recommend 8 per HA pair. Given the 300 TiB per-constituent size limit, this allows you to create volumes with up to 2.4 PiB of storage per HA pair. ONTAP will balance your files across constituents automatically.</p> \n<p><strong>File Counts</strong> – If you are using NFSv3 and expect to store many billions of files on a FlexGroup volume, be sure to<a href=\"https://docs.netapp.com/us-en/ontap/flexgroup/enable-64-bit-nfsv3-identifiers-svm-task.html\"> enable 64-bit identifiers</a> on the storage virtual machine associated with the file system.</p> \n<p><strong>Backups </strong>– Starting today you can also create backups of FlexGroup volumes, giving you the same fully-managed built-in options that you already have for FlexVol volumes.</p> \n<p><strong>NetApp System Manager</strong> – You can use the <a href=\"https://docs.netapp.com/us-en/ontap-cli-9131/\">ONTAP CLI</a> and the browser-based <a href=\"https://docs.netapp.com/us-en/ontap/concept_administration_overview.html\">NetApp System Manager</a> to perform advanced operations on your ONTAP file systems, storage virtual machines, and volumes. The management endpoint and administrator credentials are available on the <strong>File system details</strong> page:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/06/flv_fs_details_1.png\" width=\"799\" height=\"367\" /></p> \n<p><strong>Regions</strong> – Both volume styles are available in all AWS Regions where <a href=\"https://aws.amazon.com/fsx/netapp-ontap/\">Amazon FSx for NetApp ONTAP</a> is supported.</p> \n<p><strong>Pricing</strong> – You pay for the SSD storage, SSD IOPS, and throughput capacity that you provision, with separate charges for capacity pool usage, backups, and SnapLock licensing; see the <a href=\"https://aws.amazon.com/fsx/netapp-ontap/pricing/\">Amazon FSx for NetApp ONTAP Pricing</a> page to learn more.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"bbfed39b68a581436c37c8caef448bc120f967186d3f998ecfabca38d8209b2f","category":"Tech"}