{"title":"Why we desperately need wild bees","link":"https://arstechnica.com/?p=1962805","date":1692885314000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/bumblebee-800x533.jpg\" alt=\"Bumblebee on a flower\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/bumblebee.jpg\">Enlarge</a> <span>/</span> The black and golden bumblebee, Bombus auricomus, is typically found in grasslands in the Great Plains and eastern states. (credit: <a href=\"https://www.gettyimages.com/detail/photo/bumblebee-on-the-red-flower-royalty-free-image/135159589\">alle12 via Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When ecologist Rachael Winfree first began studying bees 25 years ago, she happened upon a surprise: a species of plasterer bee in the New Jersey Pine Barrens, not seen in 50 years and suspected to have gone extinct. But when she called state wildlife officials to report the discovery, she was told they weren’t interested—they didn’t have the resources to monitor bees and other insects.</p>\n<p>This is a familiar scenario to scientists who study native bees. These insects are facing multiple threats, and though official monitoring has improved, their declines have not been well documented. At the same time, a growing body of research is revealing just how crucial native bees are as pollinators for many plants. “They both pollinate our natural systems and—what people don’t realize—they are also really important for many of our agricultural crops,” says Scott Black, executive director of the Xerces Society, a nonprofit focused on invertebrate conservation.</p>\n<p>Domestic honeybees are pretty much synonymous with pollination in the public’s mind, particularly when it comes to crops, and the plight of wild bees has largely been overshadowed by concern about threats to the domestic variety. Many people don’t know the difference between wild and domestic bees, further obscuring both the troubles faced by many wild species and their value, says Hollis Woodard, an entomologist at the University of California, Riverside.</p></div><p><a href=\"https://arstechnica.com/?p=1962805#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962805&amp;comments=1\">Comments</a></p>","author":"Knowable Magazine","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bc0ea11d2ddd151304dc0273f965b0b10ba07518a4f8454a454415eae3682378","category":"Tech"}