{"title":"Knowledge, attitude and practice of healthcare workers on infection prevention and control in Ethiopia: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308348","date":1725544800000,"content":"<p>by Chalachew Adugna Wubneh, Birye Dessalegn Mekonnen, Tewodros Getaneh Alemu, Masresha Asmare Techane, Nega Tezera Assimamaw, Getaneh Mulualem Belay, Tadesse Tarik Tamir, Addis Bilal Muhye, Destaye Guadie Kassie, Amare Wondim, Bewuketu Terefe, Bethelihem Tigabu Tarekegn, Mohammed Seid Ali, Beletech Fentie, Almaz Tefera Gonete, Berhan Tekeba, Selam Fisiha Kassa, Bogale Kassahun Desta, Amare Demsie Ayele, Melkamu Tilahun Dessie, Kendalem Asmare Atalell</p>\r\nIntroduction <p>Infectious diseases remain the leading causes of death in low and middle-income countries including Ethiopia. The existence of emerging, re-emerging, and drug-resistant infectious agents maximizes the importance of infection prevention and control. Healthcare workers are the key actors in the prevention and control of infection. As a result assessing the knowledge, attitude, and practice of healthcare workers toward infection prevention and control is very critical in the prevention and control of infectious diseases. Therefore, this systematic review and meta-analysis aimed to assess the knowledge, attitude, and practice of healthcare providers toward infection prevention in Ethiopia.</p> Method <p>PubMed, Scopus, SEMANTIC SCHOLAR, Google Scholar, and Addis Ababa University Digital Library were systematically searched for relevant literature until November 18/2023. The quality of the included studies was assessed using the Joanna Briggs Institute quality appraisal tool. Data were abstracted using a Microsoft Excel spreadsheet and analyzed using STATA version 11. A random-effects model was used to estimate the pooled prevalence. Heterogeneity among reported studies was assessed by Forest plot, Cochran’s Q-statistics, and I<sup>2</sup> test. Publication bias was checked using funnel plots, and Egger’s regression test. In addition, sub-group and sensitivity analyses were conducted.</p> Result <p>A total of 7,681 articles were retrieved of which 19 studies with 5,650 healthcare workers were included in this systematic review and meta-analysis. About 74.5% (95% CI, 65.88, 83.12), 66.71% (95% CI 55.15, 78.28), and 55.2% (95% CI 48.22, 62.18) of healthcare workers were knowledgeable, had positive attitudes, and good standard of practice on infection prevention respectively.</p> Conclusion <p>Despite acceptable knowledge and attitude, about half of the healthcare workers have unsafe infection prevention and control practices in Ethiopia. Hence, serious attention should be given to healthcare workers’ application of infection prevention standards in their working environment.</p>","author":"Chalachew Adugna Wubneh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bc1c9eacf8bf79509eb7bb64fc262b3408e844b985cb375a78562bd2fe70ed48","category":"Interdisciplinary"}