{"title":"Finding hope and fulfillment in meaningful work: An interpretative phenomenological analysis of conservation and stewardship practitioners’ experience, values, and motivations","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000087","date":1700661600000,"content":"<p>by Alyssa R. Soucy, Sandra De Urioste-Stone, Parinaz Rahimzadeh-Bajgiran, Jessica Jansujwicz, Karla Eitel, Matthew Brownlee</p>\r\n\r\nValues and motivations can shape natural resource management decision-making as individuals set conservation goals based on diverse, unique backgrounds, histories, and experiences. Recent literature points to the need to understand, evaluate, and articulate practitioner values to make explicit how experiences shape their work. Our research responds to calls to explore a diverse range of values and motivations among conservation practitioners. We used a qualitative approach grounded in phenomenology to advance an in-depth understanding of how conservation and stewardship practitioners experience, acknowledge, and make sense of conservation decision-making in Maine, USA. We interviewed 21 conservation and stewardship practitioners. Our results indicate the presence of complex value systems, including strong biospheric, altruistic, eudaimonic, as well as egoistic values. These values interact and intersect with motivations for participants’ careers in conservation in unique ways, driving participant actions and decision-making. Within Maine specifically, our results highlight the many areas for convergence of broad values among seemingly diverse groups that can inform opportunities for collaboration. Participants expressed various pathways to careers in conservation, where their work enables them to make a meaningful contribution to the environment and society. However in situations where personal and organizational values are misaligned, the role of organizational transparency, employee empowerment, and agency are key. Our results have implications for conservation groups seeking to achieve high employee satisfaction, as well as researchers, policymakers, and practitioners who hope to inspire individuals to take on conservation careers to create sustainable and transformative action for the future. Fostering early experiences in place, including interactions with the non-human world and local community, are important for influencing and reinforcing values and motivations for conservation action.","author":"Alyssa R. Soucy","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"bc226ac9a0bed2602340209c570e4ae5402448bd03d4061fae4fbaa24476a787","category":"Environment"}