{"title":"Inhibitory Effect of Naringenin on LPS Induced Skin Inflammation by NF-&kappa;B Regulation in HDFs","link":"https://www.preprints.org/manuscript/202406.0795/v1","date":1718175139000,"content":"Flavonoids are important natural compounds characterized by their extensive biological activities. Citrus flavonoids form a significant segment within the broader flavonoid category. Naringenin, an integral part of this series, is recognized for its powerful anti-inflammatory and antioxidant properties. In addition, considering the lack of existing research on naringenin's potential effectiveness and intracellular mechanisms of action in skin-related applications, especially as a cosmetic ingredient, this study aimed to explore naringenin's role in reducing the fundamental generation of reactive oxygen species. This was achieved by examining its inhibitory effects on the expression levels of NADPH oxidase and iNOS, ultimately leading to a reduction in NO production. This research examined the anti-inflammatory and antioxidant capacities of naringenin by employing a cellular senescence model of LPS-induced HDFs. The evaluation of naringenin's efficacy was validated through several investigative procedures, including the NF-κB luciferase assay, ELISA assay, and qRT-PCR. To verify the anti-inflammatory effectiveness of naringenin, the study measured the responsive elements of NF-κB using a luciferase reporter assay. This assessment revealed that naringenin could decrease the concentration of genes activated by NF-κB. Moreover, the study found that naringenin inhibited the transcriptional expression of known NF-κB regulated inflammatory cytokines, including IL-1β, IL-6, and IL-8. In addition, results from the qRT-PCR analysis indicated a reduction in iNOS expression facilitated by naringenin. Based on the data gathered and analyzed in this study, it can be conclusively inferred that naringenin possesses promising potential as a cosmetic ingredient, offering both anti-inflammatory and antioxidant benefits.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bc233e99bd301a8aae544a8bab0e47f6e47a9c25116d8f405561fc8b1a88cd5b","category":"Interdisciplinary"}