{"title":"Conservation genomics assessment of Tharp's bluestar (Amsonia tharpii) with comparisons to widespread (A. longilora) and narrowly endemic (A. fugatei) congeners","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13736?af=R","date":1718780400000,"content":"<h2>Abstract</h2>\n<p>Land-use change and habitat fragmentation are threats to biodiversity. The decrease in available habitat, increase in isolation, and mating within populations can lead to elevated inbreeding, lower genetic diversity, and poor fitness. Here we investigate the genetics of two rare and threatened plant species, <i>Amsonia tharpii</i> and <i>A. fugatei</i>, and we compare them to a widespread congener <i>A. longiflora</i>. We also report the first phylogenetic study of the genus <i>Amsonia</i> (Apocynaceae), including 10 of the 17 taxa and multiple sampling locations, to understand species relationships. We used a double digest restriction-site associated DNA sequencing (ddRADseq) approach to investigate the genetic diversity and gene flow of each species and to create a maximum likelihood phylogeny. The ddRADseq data was mapped to a reference genome to separate out the chloroplast and nuclear markers for population genetic analysis. Our results show that genetic diversity and inbreeding were low across all three species. The chloroplast and nuclear dataset in <i>A. tharpii</i> were highly structured, whereas they showed no structure for <i>A. fugatei</i>, while <i>A. longiflora</i> lacked structure for nuclear data but not chloroplast. Phylogenetic results revealed that <i>A. tharpii</i> is distinct and sister to <i>A. fugatei</i>, and together they are distantly related to <i>A. longiflora</i>. Our results demonstrated that evolutionary history and contemporary ecological processes largely influences genetic diversity within <i>Amsonia</i>. Interestingly, we show that in <i>A. tharpii</i> there was significant structure despite being pollinated by large, bodied hawkmoths that are known to be able to carry pollen long distances, suggesting that other factors are contributing to the structure observed among <i>A. tharpii</i> populations. Conservation efforts should focus on protecting all of the <i>A. tharpii</i> populations, as they contain unique genetic diversity, and a protection plan for <i>A. fugatei</i> needs to be established due to its limited distribution.</p>","author":"Dylan H. Cohen, \nJeremie B. Fant, \nKrissa A. Skogen","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"bc29d72e411524d26540213ef035797f75d6f8c24711a234870edbe29dfc4c61","category":"Environment"}