{"title":"Some iPhone 15 Users Complain of Ongoing Bluetooth Issues","link":"https://www.macrumors.com/2024/02/22/iphone-15-bluetooth-issues/","date":1708648641000,"content":"Some <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> users have been experiencing ongoing Bluetooth connection issues that have persisted since the new devices launched, based on complaints on the <a href=\"https://discussions.apple.com/thread/255184161?sortBy=best&amp;page=42\">Apple Support Community</a> and the <a href=\"https://forums.macrumors.com/threads/bluetooth-problems-with-older-devices.2416344/\"><em>MacRumors</em> forums</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iphone-15-blue.jpg\" width=\"1600\" height=\"900\" />\r<br />\nAffected customers are having trouble keeping their iPhones connected to older Bluetooth devices such as in-car systems or headphones that rely on the technology. From <a href=\"https://forums.macrumors.com/threads/bluetooth-problems-with-older-devices.2416344/post-32854348\">the <em>MacRumors</em> forums</a>:\r<br />\n<blockquote>Since ios 17 I have been having frequent disconnects in my car (no carplay. BMW 2014) bluetooth for calls. I make a hands free call in my car and after a few seconds bluetooth disconnects and I have manually switch to the speaker in my Iphone. I have had this car since new and I switch iphones almost every year and usually the release x.0 has some bluetooth problems, but now 2 major releases for ios 17 and the issue is not solved. Another iphone 12 does not have the problem in my car.</blockquote>\r<br />\nMany of the complaints come from ‌iPhone 15‌ users who are attempting to connect their iPhones to Bluetooth headphones, car systems, and similar devices, but some users are <a href=\"https://discussions.apple.com/thread/255184161?answerId=259967295022&amp;sortBy=best#259967295022\">also experiencing issues</a> with more modern products like the AirPods.\r<br />\n<blockquote>I moved from 15 plus to 15 pro max (silly but switched carriers so I got it for free) and am having terrible bluetooth connections. Car bluetooth is fine. But on both my AirPods Max and and Beats Studio Buds, my music will cut out and reconnect and calls will drop after 5 to 10 minutes. Done all the resets. Hoping we are sent a software update soon.</blockquote>\r<br />\nReports of Bluetooth issues date back to October 2023, which is just a month after the ‌iPhone 15‌ models were released. They have continued across multiple updates, with the most recent reports coming from those running iOS 17.3.1. Some customers were told that the problems would be resolved with an <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> update, but based on the continuing complaints, it does not appear that Apple has fully resolved the issue as of yet.\r<br />\n\r<br />\nThe cause of the problem is not clear, but affected users have both ‌iPhone 15‌ and <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models. Some people have been able to get their iPhones replaced, which has been the only way to solve the issue. Restarting, resetting, and other typical fixes have not worked for those who are having problems.\r<br />\n\r<br />\nHave you had issues with Bluetooth connectivity on the ‌iPhone 15‌? Let us know in the comments below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15\">iPhone 15 (Neutral)</a>, <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/22/iphone-15-bluetooth-issues/\">Some iPhone 15 Users Complain of Ongoing Bluetooth Issues</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/some-iphone-15-users-complain-of-ongoing-bluetooth-issues.2420189/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc2945a655bd25613b0b771ce64daae7611b8dd59432773a90d2ffae71fa36c6","category":"Apple"}