{"title":"Al Gore and James Bell to Retire From Apple's Board of Directors, Dr. Wanda Austin to Join","link":"https://www.macrumors.com/2024/01/11/apple-board-of-directors-retirees/","date":1705009090000,"content":"Both Al Gore and James Bell are retiring from Apple's board of directors, <a href=\"https://www.apple.com/newsroom/2024/01/wanda-austin-to-join-apples-board-of-directors/\">Apple announced today</a>. Dr. Wanda Austin, former president and CEO of The Aerospace Corporation, has been nominated to join the board as the two depart.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/Apple-Logo-16x9.jpg\" width=\"1200\" height=\"630\" />\r<br />\nAccording to Apple, Dr. Austin brings \"decades of science and technology experience\" to the role, and she has a track record of \"advancing innovation and shaping corporate strategy.\"<blockquote>\"Wanda has spent decades advancing technology on behalf of humanity, and we're thrilled to welcome her to Apple's board of directors,\" said Tim Cook, Apple's CEO. \"She's an extraordinary leader, and her invaluable experience and expertise will support our mission of leaving the world better than we found it.\"\r<br />\n\r<br />\n\"Like Apple, I've always believed in the power of innovation to improve lives, support human potential, and shape a better future,\" said Dr. Austin. \"I'm honored to join Apple's board of directors, and I look forward to being part of a company that's always creating new ways to empower people all over the world.\"</blockquote>\r<br />\nApple does not allow directors to stand for reelection after reaching age 75, which means that both Al Gore and James Bell are retiring from the board due to their age.\r<br />\n<blockquote>\"We're deeply grateful to Al and James for their many years of service to Apple -- their insights, energy, and values have made us a stronger company in so many ways,\" said Cook. \"For more than 20 years, Al has contributed an incredible amount to our work -- from his unconditional support for protecting our users' privacy, to his incomparable knowledge of environment and climate issues. James's dedication has been extraordinary, and we're thankful for the important perspectives and deep expertise he's offered on audit, finance, and so much more over the years.\"</blockquote>\r<br />\nAl Gore first <a href=\"https://www.macrumors.com/2003/03/19/al-gore-joins-apples-board/\">joined Apple's board in 2003</a>, while James Bell <a href=\"https://www.macrumors.com/2015/10/01/james-bell-apple-director/\">joined in 2015</a>. Dr. Austin has a Ph.D in industrial and systems engineering. She joined The Aerospace Corporation in 1979, and from 2008 to 2016, she served as the organization's president and CEO. From 2018 to 2019, she was the interim president of the University of Southern California, and she also serves on the boards of Amgen and Chevron. She previously was on the board of Virgin Galactic. <br />This article, \"<a href=\"https://www.macrumors.com/2024/01/11/apple-board-of-directors-retirees/\">Al Gore and James Bell to Retire From Apple's Board of Directors, Dr. Wanda Austin to Join</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/al-gore-and-james-bell-to-retire-from-apples-board-of-directors-dr-wanda-austin-to-join.2416096/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc389f089b1d3f4ae8b249a2fab9fc84ada795fb471b6bb8de9131610a8f519a","category":"Apple"}