{"title":"La Course by Le Tour de France: everything you need to know","link":"https://www.bikeradar.com/features/la-course-everything-you-need-to-know/","date":1624687200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/anna-van-der-breggan-la-course-GettyImages-482013350-2dd08f6.jpg?quality=90&amp;resize=620,413\" />                                            <p>As the men’s peloton gears up for the <a href=\"https://www.bikeradar.com/events/tour-de-france/\" target=\"_blank\">2021 Tour de France</a> Grand Depart, their female counterparts kick-off the action in Brittany at La Course by Le Tour de France. Here’s our guide to the race’s history, winners, stages, teams and more.</p>\n<h2>What is La Course by Le Tour de France?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Expect an aggressive race with lots of small groups going off the front.</span></figcaption><span> <i>DAVID STOCKMAN/BELGA MAG/AFP via Getty Images</i></span></div>\n<p>La Course by Le Tour de France was the product of a long, and hard-fought campaign by some of women’s cycling’s biggest stars to earn their slice of cycling’s greatest race.</p>\n<p>Contested for the first time in 2014, La Course is a one-day women’s race attached to the Tour de France.</p>\n<p>Initially raced in Paris, on the Champs-Elysees, ahead of the Tour’s final stage, La Course has moved around the race in recent years.</p>\n<p>From the sprint-friendly race at its inception, La Course moved into the mountains in 2017 and was hosted on route’s mirroring the Tour’s toughest stages.</p>\n<p>Since 2020, however, it has been moved to the start of the race – first in Nice for last year’s edition (having initially been slated for the Paris finale again) and then, this year, to Brest.</p>\n<p>La Course has been part of the UCI Women’s WorldTour since 2016.</p>\n<h2>Who has the most La Course by Le Tour de France wins?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Marianne Vos has claimed two La Course and is one of the favourites for 2021.</span></figcaption><span> <i>JEFF PACHOUD/AFP via Getty Images</i></span></div>\n<p>In the race’s short history, La Course has been dominated by Dutch riders – with three Dutchwomen sharing five of the seven race wins between them.</p>\n<p><strong>Marianne Vos</strong>, one of the biggest proponents for La Course, won the inaugural edition in 2014 and is level with compatriot <strong>Annemiek van Vleuten</strong> with two victories apiece.</p>\n<p>Anna van der Breggen is the other Dutch woman to have celebrated on the top step of La Course’s podium, after a solo win on the Champs-Elysees in 2015, while Australian Chloe Hosking and Great Britain’s defending champion Lizzie Deignan also have one win each.</p>\n<p>La Course by Le Tour de France winners:</p>\n<ul><li>Marianne Vos (2014, 2019)</li>\n<li>Annemiek van Vleuten (2017, 2018)</li>\n<li>Anna van der Breggen (2015)</li>\n<li>Chloe Hosking (2016)</li>\n<li>Lizzie Deignan (2020)</li>\n</ul><h2>When does the 2021 La Course by Le Tour de France start?</h2>\n<p>The 2021 edition of La Course takes place ahead of the Tour de France Grand Depart on Saturday June 26.</p>\n<p>Initially due to follow stage two of the men’s Grand Tour, the race will now follow a 107.4km course from Brest to Landernau.</p>\n<p>Check out our standalone guide on <a href=\"https://www.bikeradar.com/news/how-to-watch-la-course/\" target=\"_blank\">how to watch La Course</a> for more info on how to follow all of the racing action.</p>\n<h2>What is the La Course by Le Tour de France route for 2021?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> La Course 2021 route profile.</span></figcaption><span> <i>La Course / ASO</i></span></div>\n<p>Having been moved back a day to follow a similar route to the Grand Depart, La Course by Le Tour de France starts from Brest and finishes atop the Cote de la Fosse aux Loups in Landerneau.</p>\n<p>The 107.4km route includes three laps of the 14km finishing circuit with four climbs of the 3km Cote de la Fosse Aux Loups.</p>\n<p>The climb is one of two to be tackled on the route, with the Cote de Trebeolin (900m at 5.1 per cent) conquered early in the race.</p>\n<p>The main climb is 3km with an average gradient of 5.7 per cent, and the peloton will pass the finish line three times before returning for the fourth and final climb to the finale.</p>\n<h2>How do you win the La Course by Le Tour de France?</h2>\n<p>As well as the main prize, for the first rider across the finish line on the fourth climb of the Cote de la Fosse aux Loups, there is a secondary prize on offer too.</p>\n<p>The top climber will also be rewarded, with the first rider(s) over the Cote de Trebeolin and all four climbs of the Cote de la Fosse aux Loups earning points.</p>\n<p>Last year, two-time race winner Annemiek van Vleuten won the secondary classification.</p>\n<h2>La Course by Le Tour de France 2020 recap</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Lizzie Deignan won the 2020 La Course in a close sprint with Marianne Vos.</span></figcaption><span> <i>CHRISTOPHE PETIT TESSON/AFP via Getty Images</i></span></div>\n<p>Lizzie Deignan became the first British rider to win La Course by Le Tour de France as she and long-standing rival Marianne Vos wound the clock back to produce a thrilling finish.</p>\n<p>The race in Nice served as the <em>appertif</em> for the Tour de France, taking place ahead of the men’s first stage, and whet the appetite perfectly with a photo finish.</p>\n<p>Deignan won from a six-rider break, which broke away on a steep descent – led by world champion Annemiek van Vleuten.</p>\n<p>Both Van Vleuten and Vos were looking for a record-breaking third La Course victory, and it was the latter who looked on course for victory when she opened out her sprint.</p>\n<p>Deignan timed her counter-attack perfectly, however, getting ahead of her old rival by just centimetres to snatch victory.</p>\n<h2>La Course by Le Tour de France 2021 start list and favourites</h2>\n<p>Lizzie Deignan rolls out as defending champion for La Course by Le Tour de France but in-form Marianne Vos is among the favourites for 2021 victory.</p>\n<p>Annemiek van Vleuten is not racing this year, however – turning her attention instead to the Dutch national road race and the Olympic Games.</p>\n<p>The teams taking part in La Course 2021 this year are:</p>\n<ul><li>Movistar</li>\n<li>Trek-Segafredo</li>\n<li>Team Jumbo-Visma Women</li>\n<li>Ale BTC Ljubljana</li>\n<li>Canyon-SRAM Racing</li>\n<li>FDJ Nouvelle Aquitaine Futuroscope</li>\n<li>Liv Racing</li>\n<li>Team BikeExchange</li>\n<li>Team DSM</li>\n<li>SD Worx</li>\n<li>Team Arkea-Samsic</li>\n<li>A.R. Monex Women’s Pro Cycling Team</li>\n<li>Bizkaia Durango</li>\n<li>Ceratizit-WNT Pro Cycling</li>\n<li>Drops-Le Col s/b TEMPUR</li>\n<li>Massi-Tactic Women</li>\n<li>Parkhotel Valkenburg</li>\n<li>Rally Cycling Women</li>\n<li>Stade Rochelais Charente-Maritime Women Cycling</li>\n<li>Team TIBCO-SVB</li>\n<li>Top Girls Fassa Bortolo</li>\n<li>Valcar-Travel &amp; Service</li>\n</ul>","author":"Colin Henrys","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"bc3bc5cd2b565810b41ccc48bd9098d59e37fdd0756fdd2de22aefc8b6d92244","category":"Cycling"}