{"title":"‘Pinned’ Links in Apple Messages","link":"https://appleinsider.com/inside/ios-15/tips/how-to-pin-articles-and-images-sent-over-messages-in-ios-15-and-ipados-15","date":1692213300000,"content":"\n<p>Last week I noticed a feature for the first time: the contextual menu for a link or image sent in Messages has a “Pin” command. This is a different form of pinning than pinning an entire thread — it’s just for individual <em>messages</em>, and only messages that are links <s>or images</s>. I couldn’t figure out what this did until I found this write-up at AppleInsider, which explains the point. When you pin a link, you can refer back to it in the profile details for the contact(s) in that thread. That’s the popover you get by:</p>\n\n<ul>\n<li>Tapping the user avatar in the center of the top navigation bar on iOS.</li>\n<li>Clicking the “i”-in-circle Info button on MacOS.</li>\n</ul>\n\n<p>Scroll down in that popover and there’s a section for pins, right above the section showing all photos in the conversation.</p>\n\n<p>Kind of a weirdly obscure feature. I can see using it, maybe, now that I know it’s there. But I never would have guessed it was there, and couldn’t even figure out what “Pin” meant in this context until I searched the web for an answer. </p>\n\n<p><strong>Update 1:</strong> The AppleInsider article I’m linking to claims the feature works for images in addition to links, and I originally just took them at their word for that, but it turns out it only works for links. We regret the error. But it just further confirms how unintuitive the feature is.</p>\n\n<p><strong>Update 2:</strong> These pinned links also show up in Safari, in Safari’s “Shared With You” list. In iOS Safari, you get to “Shared With You” by tapping in the URL location field — they appear under your Favorites. On the Mac, “Shared With You” is in Safari’s sidebar, at the bottom, under your tab groups. Pinned links, as you’d guess, stay at the top of the “Shared With You” list. But you can’t unpin them in Safari on either iOS or MacOS, nor you can you pin other items in Shared With You from within Safari. And even within Messages, the only place where you can unpin a link is in its original location within the message thread. So if you pin a link in a busy thread, and want to unpin it after some time as passed, you need to scroll all the way back to when it originally appeared. You can’t unpin links from the contact popover where they’re listed. And if you “delete” a pinned link in the contact popover in Messages, <em>it deletes the original message</em>, not merely removes its pin. The more I figure out about this feature, the more half-baked it seems.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/16/pinned-links-in-messages\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"bc436ff678a5f61948073df3c358e40f213514577a572ca4455ba26e0d534208","category":"Tech"}