{"title":"PLATO: How an educational computer system from the ’60s shaped the future","link":"https://arstechnica.com/?p=1890452","date":1679052658000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/plato-iv-76ab9800cba086f244887e6523b84cfba9cfc1ab.jpg\" alt=\"PLATO IV Terminal, ca. 1972-74.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/plato-iv-76ab9800cba086f244887e6523b84cfba9cfc1ab.jpg\">Enlarge</a> <span>/</span> PLATO IV Terminal, ca. 1972-74. (credit: University of Illinois Archives)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Bright graphics, a touchscreen, a speech synthesizer, messaging apps, games, and educational software—no, it's not your kid's iPad. This is the mid-1970s, and you're using PLATO.</p>\n<p>Far from its comparatively primitive contemporaries of teletypes and punch cards, PLATO was something else entirely. If you were fortunate enough to be near the University of Illinois Urbana-Champaign (UIUC) around a half-century ago, you just might have gotten a chance to build the future. Many of the computing innovations we treat as commonplace started with this system, and even today, some of PLATO's capabilities have never been precisely duplicated. Today, we'll look back on this influential technological testbed and see how you can experience it now.</p>\n<h2>From space race to <em>Spacewar</em></h2>\n<p>Don Bitzer was a PhD student in electrical engineering at UIUC in 1959, but his eye was on bigger things than circuitry. “I'd been reading projections that said that 50 percent of the students coming out of our high schools were functionally illiterate,” he later <a href=\"https://www.wired.com/1997/03/platofest-to-celebrate-first-online-community/\">told</a> a Wired interviewer. “There was a physicist in our lab, Chalmers Sherwin, who wasn't afraid to ask big questions. One day, he asked, 'Why can't we use computers for education?'”</p></div><p><a href=\"https://arstechnica.com/?p=1890452#p3\">Read 64 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1890452&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bc5141eac041cec9f5a48d81ad11be1ea0f954c54f2cff58c89831065e47ab0d","category":"Tech"}