{"title":"Spatial organisation within the earliest evidence of post-built structures in Britain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306908","date":1721052000000,"content":"<p>by Jessica Bates, Nicky Milner, Chantal Conneller, Aimée Little</p>\r\n\r\nThis paper explores tool-using activities undertaken in and around the earliest known evidence of post-built structures in Britain. Microwear results associated with at least three structures identified at the Early Mesolithic site of Star Carr, North Yorkshire, are examined as a means of identifying activity zones associated with the diverse stone tools used to process a variety of materials (e.g. wood, bone, antler, plant, hide, meat, fish). With 341 lithic artefacts analysed, this research represents the first microwear study focused on the post-built structures at Star Carr. A combination of spatial and microwear data has provided different scales of interpretation: from individual tool use to patterns of activity across the three structures. Different types of tool use observed have aided interpretations of possible activity areas where objects were produced and materials were processed. Zones of activity within one of the structures suggest that the working of some materials was more spatially restricted than others; even where there are high densities of flint deposition, spatial patterns in tool-using activity were observed. From this, it is interpreted that social norms and behaviours influenced the spatial organisation of different spaces. Our results demonstrate the importance of combining microwear analysis with GIS to explore function and variability in the use of Mesolithic structures—providing new insights into their role as social spaces.","author":"Jessica Bates","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bc522db33cb11ece75c18ab4b6f19fd49632a4a34ffaaca508194be6ca55d98f","category":"Interdisciplinary"}