{"title":"Light-Induced Charge Separation in Photosystem I from Different Biological Species Characterized by Multifrequency EPR","link":"https://www.preprints.org/manuscript/202406.1222/v1","date":1718699714000,"content":"Photosystem I (PSI) serves as a model system for studying fundamental processes such as electron transfer (ET) and energy conversion, which are not only central to photosynthesis but also have broader implications for bioenergy production and biomimetic device design. In this study, we employed electron paramagnetic resonance (EPR) spectroscopy to investigate key light-induced charge separation steps in PSI isolated from several green algal and cyanobacterial species. Following photoexcitation, rapid, sequential ET occurs through either of two symmetric branches of donor/acceptor cofactors embedded within the protein core, termed the A and B branch. Using high-frequency (130 GHz) time-resolved EPR (TR-EPR) and deuteration techniques to enhance spectral resolution, we observed that at low temperatures prokaryotic PSI exhibits reversible ET in the A branch and irreversible ET in the B branch at low temperatures, while PSI from eukaryotic counterparts displays either reversible ET in both branches or exclusively in the B branch. Furthermore, we observed a notable correlation between low-temperature charge separation to the terminal [4Fe-4S] clusters of PSI, termed FA and FB, as reflected in the measured FA/FB ratio. These findings enhance our understanding of the mechanistic diversity of PSI's ET across different species and underscore the importance of experimental design in resolving these differences. Though further research is necessary to elucidate the underlying mechanisms and the evolutionary significance of these variations in PSI charge separation, this study sets the stage for future investigations into the complex interplay between protein structure, ET pathways, and the environmental adaptations of photosynthetic organisms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bc5913142ac03d45ccc77c47004900d93603407548f6dea8672376a0e9755921","category":"Interdisciplinary"}