{"title":"AirPods 3 Features First Water-Resistant AirPods Charging Case","link":"https://www.macrumors.com/2021/10/25/airpods-3-features-water-resistant-airpods-case/","date":1635168884000,"content":"The <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> Charging Case for the third-generation AirPods features sweat and water resistance, making the standard AirPods the first to feature an IPX4-rated charging case.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/magsafe-airpods.jpeg\" />\r\n<br />\r\nApple promoted the sweat and water-resistance of the third-generation AirPods with the device's <a href=\"https://www.macrumors.com/2021/10/18/apple-announces-third-generation-airpods/\">announcement last week</a>, but the IPX4 rating applies to both the earbuds and the charging case. The <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> were the first AirPods to offer sweat and water resistance, but the feature only applies to the earbuds themselves, with the charging case featuring no accredited sweat or water resistance rating.\r\n<br />\r\n\r\n<br />\r\nThe IPX4 rating means that AirPods have ingress protection to withstand dripping, spraying, or splashes of water. It also means that AirPods cannot withstand water jets (IPX5) or water immersion (IPX7). The \"X\" part of the rating explains that the AirPods have no form of ingress protection against solids or dust.\r\n<br />\r\n\r\n<br />\r\nThe ‌AirPods Pro‌ also now ship with an updated Charging Case that adds ‌MagSafe‌, but unlike the third-generation AirPods, the new case is not officially rated for any kind of ingress protection. Apple confirms on its <a href=\"https://www.apple.com/shop/product/MLWK3AM/A/airpods-pro\">latest AirPods Pro specs page</a> that \"The Wireless Charging Case and ‌MagSafe‌ Charging Case for ‌AirPods Pro‌ are not sweat and water resistant.\"\r\n<br />\r\n\r\n<br />\r\nThe third-generation AirPods feature improved sound quality, a new design with shorter stems, force sensor controls, spatial audio with dynamic head tracking, Adaptive EQ, <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> support, and more. These features debuted with the ‌AirPods Pro‌, but Apple has now brought the standard AirPods up to spec with its \"Pro\" sibling, with the exception of silicone in-ear tips and Active Noise Cancellation (ANC).\r\n<br />\r\n\r\n<br />\r\nSweat and water resistance is now an area where the AirPods <a href=\"https://www.macrumors.com/2021/10/25/airpods-3-are-better-than-airpods-pro/\">surpass the AirPods Pro</a>, but the IPX4-rated charging case is not the only new feature exclusive to the third-generation AirPods; the earbuds also feature an <a href=\"https://www.macrumors.com/2021/10/20/airpods-3-skin-detect-no-conversation-boost/\">all-new skin-detect sensor</a>.\r\n<br />\r\n\r\n<br />\r\nInstead of skin-detect sensors in each earbud, the ‌‌AirPods Pro‌‌ use dual optical sensors to detect if they are in a user's ear. While they effectively perform the same function, the optical sensors can simply tell when they are covered up, rather than specifically against skin. This means that if you put an ‌‌AirPods Pro‌‌ earbud in a pocket or on a surface, it could accidentally resume playback.\r\n<br />\r\n\r\n<br />\r\nThere have been no rumors to suggest that the <a href=\"https://www.macrumors.com/roundup/airpods-pro/#whats_next_for_the_airpods_pro\">next-generation AirPods Pro</a> will feature the new skin-detect sensor and a sweat and water-resistant ‌MagSafe‌ Charging Case, but it seems highly likely that Apple will bring its mid-range AirPods to parity with the entry-level model.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/airpods-3-shipped.jpg\" />\r\n<br />\r\nThe third-generation AirPods have also begun shipping to customers around the world ahead of the device's official launch tomorrow.\r\n<br />\r\n\r\n<br />\r\nFor more detailed information about the third-generation AirPods, see our <a href=\"https://www.macrumors.com/roundup/airpods/\">comprehensive roundup</a>. If you are undecided about buying the new earbuds, take a look at <a href=\"https://www.macrumors.com/guide/\">our buyer's guides</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods 3</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods\">AirPods (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/25/airpods-3-features-water-resistant-airpods-case/\">AirPods 3 Features First Water-Resistant AirPods Charging Case</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airpods-3-features-first-water-resistant-airpods-charging-case.2319165/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_uUgCZzBRx8:qzu4015nCIQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_uUgCZzBRx8:qzu4015nCIQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/_uUgCZzBRx8\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc5989106a708cdf4f62ae7530e0cd2c4caaf6f740e832d28c60d871d8f6b6a9","category":"Apple"}