{"title":"iPhone 15 to Support 15W Wireless Fast Charging Using Third-Party Chargers That Aren't MagSafe Certified","link":"https://www.macrumors.com/2023/05/24/iphone-15-15w-wireless-fast-charging-non-certified/","date":1684925206000,"content":"Apple's upcoming iPhone 15 models will support 15W wireless fast charging even when using third-party chargers that are not MagSafe certified, claims a new rumor coming out of China.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/magsafe-blue-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nApple's official MagSafe magnetic wireless charger or a third-party magnetic charger with official MFM (Made for MagSafe) certification are required to achieve 15W wireless fast charging on the iPhone 12, iPhone 13, and iPhone 14. If using a standard Qi-certified wireless charger, these models top out at 7.5W.\r<br />\n\r<br />\nHowever, according to a Weibo post picked up by <a href=\"https://m.blog.naver.com/PostView.naver?blogId=yeux1122&amp;logNo=223109967648&amp;navType=by\">news aggregator account \"yeux1122\"</a> on the Korean Naver blog, the iPhone 15 series will be capable of open 15W wireless magnetic charging using non-MFM certified chargers, which are usually more affordable alternatives to those with Apple certification.\r<br />\n\r<br />\nThe rumor has not yet been verified as coming from a reliable source, but the claim does make sense given that Apple is contributing to a new version of the Qi open standard that works much like MagSafe.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/2023/01/03/qi2-wireless-charging-standard-gains-magsafe/\">Announced in January 2023</a> by the Wireless Power Consortium (WPC), the next-generation Qi2 wireless standard incorporates a Magnetic Power Profile, which means that devices that adopt Qi2 in the future will use the same magnetic technology used in ‌MagSafe‌ devices created for the iPhone 12 and later.\r<br />\n\r<br />\nThe WPC says that the Magnetic Power Profile in Qi2 will make sure that phones and other battery-powered mobile products are perfectly aligned with chargers for improved energy efficiency and faster charging‌. Qi2 smartphones and chargers are expected to be available starting in the 2023 holiday season.\r<br />\n\r<br />\nApple's decision to make MagSafe technology available to all devices that support Qi2 wireless charging would seem in direct contrast to its position on USB-C. The iPhone 15 is expected to feature a <a href=\"https://www.macrumors.com/2022/05/11/iphone-15-ditch-lightning-for-usb-c/\">USB-C port instead of Lightning</a>, which will allow it to comply with new regulations implemented in Europe. \r<br />\n\r<br />\nBut according to <a href=\"https://www.macrumors.com/2023/02/28/iphone-15-usb-c-accessories-limited-without-mfi/\">rumors</a>, iPhone 15 models will only officially support USB-C accessories certified by the Apple Made for iPhone (MFi) program, which could be used to <a href=\"https://www.macrumors.com/2023/03/21/kuo-iphone-usb-c-faster-charging-speeds/\">limit features like fast charging</a> and high-speed data transfers to Apple-approved accessories. \r<br />\n\r<br />\nApple's iPhone 15 series is expected to be announced during the usual September timeframe. For everything we can expect from the new flagship models, click on the roundup links below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/magsafe/\">MagSafe</a>, <a href=\"https://www.macrumors.com/guide/naver/\">Naver</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/24/iphone-15-15w-wireless-fast-charging-non-certified/\">iPhone 15 to Support 15W Wireless Fast Charging Using Third-Party Chargers That Aren't MagSafe Certified</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-to-support-15w-wireless-fast-charging-using-third-party-chargers-that-arent-magsafe-certified.2390382/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc5a3f277de6c4c189bedadd5a7bb7e9b5773efa39b7228fbef3af437329270b","category":"Apple"}