{"title":"The Witcher Season 3","link":"https://markpeak.net/the-witcher-season-3/","date":1691824944000,"content":"<p>ซีรีส์ The Witcher Season 3 ของ Netflix เป็นการดัดแปลงเนื้อหาจากนิยายเล่ม 2 <a href=\"https://en.wikipedia.org/wiki/Time_of_Contempt\">Time of Contempt</a> มาเป็นซีรีส์ความยาว 8 ตอน</p>\n<p>รอบนี้มาแปลกหน่อยคือ Netflix ปล่อยฉายทีละส่วนคือ 5+3 ตอน ซึ่งก็ไม่ค่อยเข้าใจว่าทำไปทำไม มันดูครึ่งๆ กลางๆ แตกต่างจากการปล่อยทั้งหมด หรือปล่อยตอนละสัปดาห์แบบดั้งเดิม เลยกลายเป็นว่าดูจบไป 5 ตอนแล้วต้องรออีก 2-3 สัปดาห์ จนเลิกสนใจไปแล้วช่วงที่นำอีก 3 ตอนที่เหลือมาปล่อยต่อ</p>\n<p>เนื้อหาใน The Witcher Season 1 เป็นเรื่องแยกของตัวเอก 3 คนหลักคือ Geralt, Yennefer และ Ciri ต่างกรรมต่างวาระ ต่าง timeline กัน (เพราะคนละเผ่าอายุไม่เท่ากัน) โดยที่ Geralt กับ Ciri ได้มาเจอกันในตอนสุดท้าย</p>\n<p>ส่วน Season 2 เป็นการเดินทางของ Geralt กับ Ciri ไปยังป้อมปราการ Kaer Morhen ของเหล่า Witcher เพื่อฝึกวิชา+หลบภัย ส่วนตอนจบ ทั้งสามคนได้กลับมาเจอกันพร้อมหน้าสักที พร้อมกับการเฉลยชาติกำเนิดของ Ciri อันเป็นเหตุให้ทุกแคว้นในทวีป (The Continent) มาตามล่าตัว Ciri กัน</p>\n<p>เนื้อหา Season 3 เปิดมาด้วยการเดินทางของ “ครอบครัว” ตัวเอกทั้งสาม หลบหนีการตามล่าของฝ่ายต่างๆ มาเรื่อยๆ จนสุดท้าย Yennefer ตัดสินใจพา Ciri ไปขอความช่วยเหลือจากอาจารย์ของตัวเอง Tissiah ที่วิหาร Aretuza ของเหล่าพ่อมดแม่มด Brotherhood of Sorcerers</p>\n<p></p>\n<p>พล็อตหลักของเรื่องยังเป็นความสัมพันธ์ของครอบครัวตัวเอก (ที่ไม่ได้เกี่ยวพันกันทางสายเลือด) วางทับซ้อนอยู่บนการเมืองของแคว้นต่างๆ ในทวีปที่ต้องการแย่งตัว Ciri กัน โดยมี 3 ฝ่ายหลักๆ คือ <a href=\"https://witcher.fandom.com/wiki/Redania\">Redania</a> แคว้นใหญ่ทางตอนเหนือ, จักรวรรดิ Nilfgaard Empire ที่รุกรานเข้ามาจากทางใต้ และกลุ่ม Brotherhood of Sorcerers ที่พยายามรวบรวมแคว้นทางเหนือ (<a href=\"https://witcher.fandom.com/wiki/Northern_Kingdoms\">Northern Kingdoms</a>) เข้าด้วยกันเพื่อต่อต้าน Nilfgaard</p>\n<p>ใน The Witcher Season 1 เป็นการเล่าเรื่องแบบ “มอนสเตอร์ประจำสัปดาห์” ที่ค่อนข้างปัจเจก ตรงไปตรงมา แต่ภายหลังเมื่อการเมืองใน The Continent เริ่มมีบทบาทมากขึ้นเรื่อยๆ วิธีการเล่าเรื่องจึงเน้นไปที่การเมืองของแต่ละฝ่าย ที่มีตัวละครแยกย่อย แยกฝักฝ่ายอีกมาก จนเริ่มเหมือน Game of Thrones เข้าไปทุกที</p>\n<p>ปัญหาของ The Witcher Season 3 จึงเป็นเรื่องการเมืองนี่ล่ะ ที่ดูไม่ค่อยรู้เรื่อง เพราะตัวละครซับซ้อน และซีรีส์พยายามเล่าโดยไม่เกริ่นที่มาที่ไป หรือปูพื้นให้รู้จักตัวละครสักเท่าไรนัก ในช่วงครึ่งแรกของซีรีส์ (ราวตอนที่ 2-3) จึงมีความงงอยู่สูงมาก</p>\n<p><em>คลิปย้อนความหลัง Season 1-2 ที่ทำโดย Netflix India เอาไว้ดูก่อนเริ่ม Season 3 แต่ก็เล่าเร็วมาก</em></p>\n<p></p>\n<p>พอเรื่องเริ่มขมวดปม ทุกคนไปรวมตัวกันที่ Aretuza ซึ่งภายนอกดูเหมือนตักศิลาแห่งเวทย์มนตร์ ทรงภูมิความรู้ แต่จริงๆ แล้วมันคือรังโจรที่ทุกคนพร้อมหักหลังกันเสมอ เรื่องจึงคืบหน้า เหตุการณ์งานเลี้ยงตอนที่ 4-5 และสงครามไคลแมกซ์ตอนที่ 6 ทำออกมาได้ดีเลย ถึงขั้นควรตัดจบ Season 3 เท่านี้</p>\n<p>แต่ทีมงานดูยังไม่พอใจ ในตอนที่ 7-8 จึงเป็นเรื่อง after match ที่นำมาจากหนังสือเล่มถัดไป Baptism of Fire ซึ่งขึ้นองค์ใหม่ ตัวละครแต่ละคนแยกย้ายไปคนละทิศละทาง Ciri วาร์ปไปโผล่ในทะเลทราย (จากเจ้าหญิง Elsa ลุยหิมะตอนแรก กลายเป็นเจ้าหญิง Jasmin ลุยทรายในตอนท้าย), Geralt แพ้หมดรูป ต้องฟื้นฟูร่างกายแล้วหาสมาชิกเข้าปาร์ตี้ไปทำเควสต์ตามหา Ciri, Yennefer รับบทเป็นผู้นำของเหล่าแม่มดที่เหลือ (พ่อมดตายหมดเกลี้ยง) พอเอาเนื้อหาส่วนนี้ที่ควรอยู่ใน Season 4 มายัดลงใน Season 3 จึงดูแปลกๆ ไปอยู่มาก</p>\n<p>เว็บไซต์อย่าง <a href=\"https://collider.com/the-witcher-season-3-biggest-problem/\">Collider ก็วิจารณ์ว่า</a> ผู้สร้างซีรีส์ทิ้งพล็อตหลักเรื่องคอบครัว มาเน้นพล็อตรองการเมือง แต่กลับเล่าเรื่องได้ไม่ดีนัก แรงจูงใจของตัวละครรองๆ ไม่ค่อยน่าเชื่อถือสักเท่าไร</p>\n<p>ส่วน Netflix เองในฐานะผู้สร้างยังต้องทำ<a href=\"https://www.netflix.com/tudum/articles/witcher-season-3-ending-explainer\">บทความ Ending Explainer</a> อธิบายตอนจบของ Season 3 เลยด้วยซ้ำ</p>\n<p>ประเด็นอื่นๆ</p>\n<ul>\n<li>ช่วงแรกๆ ซีรีส์พยายามทำเป็นนิยายนักสืบ ให้คนลุ้นว่าใครคือผู้ร้ายตัวจริง แถมมี cliffhanger ทิ้งไว้ท้ายตอนที่ 5 ก่อนตัดเบรกด้วย แต่คนดูอย่างเราๆ ดูยังไงก็รู้ว่าคนร้ายคือใคร เลยกลายเป็นน่ารำคาญไป และพอเฉลยว่าคนร้ายคือ Vilgefortz เลยยิ่งทำให้สงสัยว่าใช่จริงๆ หรือ ทำไมง่ายจัง หรือพล็อตมันซับซ้อนกว่านั้น (ซึ่งจริงๆ คือพล็อตมีแค่นี้)</li>\n<li>ในตอนจบที่ Ciri บอกว่าตัวเองชื่อ Falka ก็เชื่อว่าทุกคนงงว่า <a href=\"https://www.netflix.com/tudum/articles/ciri-the-witcher-season-3-freya-allan-interview\">Falka คือใคร</a> คำตอบคือ <a href=\"https://witcher-games.fandom.com/wiki/Falka\">Falka</a> เป็นบุคคลในประวัติศาสตร์ของโลก The Witcher โดยเป็นบุตรสาวของพระราชา Redania ในอดีต ที่โดนพ่อทอดทิ้ง จนโกรธแค้นและก่อกบฎต่ออาณาจักร เธอโผล่มาในนิมิตของ Ciri กลางทะเลทราย ซึ่งคาดกันว่าเป็นบรรพบุรุษของ Ciri เพราะมีเลือดเอลฟ์เหมือนกัน</li>\n</ul>\n<p>นอกจากนี้ The Witcher Season 3 ยังมีประเด็นนอกเนื้อเรื่องในซีรีส์คือ พระเอก Henry Cavill ตัดสินใจไม่รับเล่นต่อใน Season 4 แล้ว ทำให้แฟนๆ ยิ่งขัดแย้งกันเข้าไปอีก</p>\n<p>ทั้งนี้ไม่มีคำอธิบายอย่างเป็นทางการว่าทำไม Cavill ถึงเลิกเล่น แต่<a href=\"https://uk.news.yahoo.com/witcher-why-henry-cavill-leaving-081956485.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAADt8xfCHG0aaZkxiZ2NjY629MQUU7xnqc4BwqIhAyXFFekkwY-29EPHSTarFkVYycOnxxzqMPJDb9-xlkKeoCuL48lVJ4zzcYCyZKhb58mE-d7w1l37Xuoz7utQcm-_Hss6P0v3vcY9KjcHikR_0wJl5ABoS99FSWRlZPrHk_y0M\">เขาก็ให้สัมภาษณ์</a>ชัดว่าอยากให้ The Witcher ฉบับซีรีส์ สอดคล้องกับนิยายต้นฉบับมากกว่านี้</p>\n<p>เนื่องจากไม่เคยอ่านฉบับนิยาย เลยลองไปค้นดูว่าซีรีส์กับนิยายมีจุดไหนต่างกันบ้าง ซึ่งพบว่ามีเยอะเลย ที่หลักๆ คือ</p>\n<ul>\n<li>Yennefer ไม่เคยทรยศ Geralt/Ciri และตัวละคร Deathless Mother ใน Season 2 ไม่เคยมีอยู่ในนิยาย o_O [<a href=\"https://collider.com/witcher-netflix-worst-book-change/\">อ้างอิง</a>] จึงไม่แปลกใจอะไรที่พล็อตเรื่องความขัดแย้งของ Geralt/Yennefer ใน Season 2 ต่อมาจนถึงต้น Season 3 มันดูแปลกๆ ผิดฝาผิดตัวมากๆ</li>\n<li>Radovid น้องชายของพระราชา Redania ไม่ได้เป็นเกย์ ในนิยายเป็นลูกชายไม่ใช่น้องชาย และมีบุคลิกหัวรุนแรง ถึงขั้นกลายเป็นบอสในเวอร์ชันเกมด้วย [<a href=\"https://collider.com/the-witcher-season-3-jaskier-radovid-romance/\">อ้างอิง</a>] การปรับบทให้เขาเป็นคนหงิม มีสัมพันธ์กับ Jaskier แต่ชะตาชีวิตพลิกผันจนได้เป็นพระราชา กลายเป็นสิ่งที่แต่งเพิ่มเข้ามา</li>\n<li>Teryn หรือ Ciri ตัวปลอม ไม่ได้ผ่านการสร้างความทรงจำด้วยเวทย์มนตร์ของพ่อมด Vilgefortz แต่เป็นแค่เด็กกำพร้าหน้าเหมือน ที่ Vilgefortz นำมาสวมรอยเท่านั้น ในหนังสือ Vilgefortz ไม่ได้มีโรงงานสร้างมนุษย์แต่อย่างใด</li>\n</ul>\n<p>พอได้อ่านว่าซีรีส์ดัดแปลงจากต้นฉบับไปเยอะขนาดนี้ (โดยเฉพาะเรื่อง Deathless Mother ตัวละครสร้างขึ้นมาเอง) เลยถึงขั้นอึ้งไปเลยทีเดียวว่าทำไมกล้าทำถึงขั้นนี้</p>The post <a href=\"https://markpeak.net/the-witcher-season-3/\">The Witcher Season 3</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"bc5bc7854a0405b00b163c7fc33ce29f842297307e427e92b647792a1080eec9","category":"Thai"}