{"title":"Transcription factors BZR2/MYC2 modulate brassinosteroid and jasmonic acid crosstalk during pear dormancy","link":"https://academic.oup.com/plphys/article/194/3/1794/7456357?rss=1","date":1701302400000,"content":"<span><div>Abstract</div>Bud dormancy is an important physiological process during winter. Its release requires a certain period of chilling. In pear (<span>Pyrus pyrifolia</span>), the abscisic acid (ABA)-induced expression of <span>DORMANCY-ASSOCIATED MADS-box</span> (<span>DAM</span>) genes represses bud break, whereas exogenous gibberellin (GA) promotes dormancy release. However, with the exception of ABA and GA, the regulatory effects of phytohormones on dormancy remain largely uncharacterized. In this study, we confirmed brassinosteroids (BRs) and jasmonic acid (JA) contribute to pear bud dormancy release. If chilling accumulation is insufficient, both 24-epibrassinolide (EBR) and methyl jasmonic acid (MeJA) can promote pear bud break, implying that they positively regulate dormancy release. BRASSINAZOLE RESISTANT 2 (BZR2), which is a BR-responsive transcription factor, inhibited <span>PpyDAM3</span> expression and accelerated pear bud break. The transient overexpression of <span>PpyBZR2</span> increased endogenous GA, JA, and JA-Ile levels. In addition, the direct interaction between PpyBZR2 and MYELOCYTOMATOSIS 2 (PpyMYC2) enhanced the PpyMYC2-mediated activation of <span>Gibberellin 20-oxidase</span> genes <span>PpyGA20OX1L1</span> and <span>PpyGA20OX2L2</span> transcription, thereby increasing GA<sub>3</sub> contents and accelerating pear bud dormancy release. Interestingly, treatment with 5 <span>μ</span><span>m</span> MeJA increased the bud break rate, while also enhancing PpyMYC2-activated <span>PpyGA20OX</span> expression and increasing GA<sub>3,4</sub> contents. The 100 <span>μ</span><span>m</span> MeJA treatment decreased the PpyMYC2-mediated activation of the <span>PpyGA20OX1L1</span> and <span>PpyGA20OX2L2</span> promoters and suppressed the inhibitory effect of PpyBZR2 on <span>PpyDAM3</span> transcription, ultimately inhibiting pear bud break. In summary, our data provide insights into the crosstalk between the BR and JA signaling pathways that regulate the BZR2/MYC2-mediated pathway in the pear dormancy release process.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"bc5e0d531f1b428d3fa8f7105e67e4bd76f79ca12c475274fc46b17cab111415","category":"Environment"}