{"title":"Design of a bi-directional methodology for automated assessment of compliance to continuous application of clinical guidelines, and its evaluation in the type 2 diabetes domain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303542","date":1716213600000,"content":"<p>by Avner Hatsek, Irit Hochberg, Deeb Daoud Naccache, Aya Biderman, Yuval Shahar</p>\r\n\r\nWe introduce a new approach for automated guideline-based-care quality assessment, the <i>bidirectional knowledge-based assessment of compliance</i> (BiKBAC) method, and the <i>DiscovErr</i> system, which implements it. Our methodology compares the guideline’s Asbru-based formal representation, including its intentions, with the longitudinal medical record, using a top-down and bottom-up approach. Partial matches are resolved using fuzzy temporal logic. The system was evaluated in the type 2 Diabetes management domain, comparing it to three expert clinicians, including two diabetes experts. The system and the experts commented on the management of 10 patients, randomly selected from 2,000 diabetes patients. On average, each record spanned 5.23 years; the data included 1,584 medical transactions. The system provided 279 comments. The experts made 181 different unique comments. The completeness (recall) of the system was 91% when the gold standard was comments made by at least two of the three experts, and 98%, compared to comments made by all three experts. The experts also assessed all of the 114 medication-therapy-related comments, and a random 35% of the 165 tests-and-monitoring-related comments. The system’s correctness (precision) was 81%, compared to comments judged as correct by both diabetes experts, and 91%, compared to comments judged as correct by one diabetes expert and at least as partially correct by the other. 89% of the comments were judged as important by both diabetes experts, 8% were judged as important by one expert, and 3% were judged as less important by both experts. Adding the validated system comments to the experts’ comments, the completeness scores of the experts were 75%, 60%, and 55%; the expert correctness scores were respectively 99%, 91%, and 88%. Thus, the system could be ranked first in completeness and second in correctness. We conclude that systems such as <i>DiscovErr</i> can effectively assess the quality of continuous guideline-based care.","author":"Avner Hatsek","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bc5e601e3f6993ed321e916cc8547d7f92767807284757673df1f4eef7448129","category":"Interdisciplinary"}