{"title":"Windows Movie Maker Redux? Microsoft acquires web-based video editor Clipchamp","link":"https://arstechnica.com/?p=1792752","date":1631111968000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Microsoft_Clipchamp-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Microsoft_Clipchamp.jpg\">Enlarge</a> (credit: <a href=\"https://clipchamp.com/en/blog/microsoft-acquires-clipchamp-to-empower-creators/\">Clipchamp</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Microsoft hasn't updated its old <a href=\"https://en.wikipedia.org/wiki/Windows_Movie_Maker\">Windows Movie Maker</a> software since 2012, and it hasn't even offered the old version for download since 2017, leaving Windows users to fend for themselves when it comes to beginner-friendly editing and sharing of video clips. That situation will hopefully change thanks to <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2021/09/07/microsoft-acquires-clipchamp-to-empower-creators/\">Microsoft's acquisition</a> of <a href=\"https://clipchamp.com/en/\">Clipchamp</a>, a web-based video-editing tool. Clipchamp includes a variety of built-in templates for family-video editors, Twitch and YouTube streamers, and businesses putting together ads or other branded videos.</p>\n<p>Microsoft hasn't made specific announcements about where and how Clipchamp will be integrated into its products, but it hinted that the app \"is a natural fit to extend the cloud-powered productivity experiences in Microsoft 365,\" implying that the web version will be a part of Microsoft's subscription service in the future. Clipchamp is \"also a great fit for Microsoft Windows,\" which currently only offers very basic video editing via the built-in Photos app. Microsoft's current tools definitely aren't up to the level of <a href=\"https://www.apple.com/imovie/\">iMovie</a>, which Apple offers for free to macOS, iOS, and iPadOS users.</p>\n<p>Whatever comes of the Clipchamp acquisition, it won't be included in the initial version of Windows 11 when it's released on October 5. But Microsoft's Panos Panay <a href=\"https://twitter.com/panos_panay/status/1435346853365575680\">shared a brief teaser video</a> of a revamped Windows 11 Photos app, which may at least improve upon the barebones version in Windows 10.</p></div><p><a href=\"https://arstechnica.com/?p=1792752\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1792752&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bc68c783903362fe396f1ebfcd748a03db38d51c98c3775933c760a19bf969dd","category":"Tech"}