{"title":"Apple Wins Early Victory Against Spyware Maker NSO Group in Court","link":"https://www.macrumors.com/2024/01/24/apple-early-victory-nso-group-spyware-lawsuit/","date":1706097082000,"content":"Apple has dealt a blow against spyware maker NSO Group and the Israeli firm's efforts to move Apple's lawsuit against it to its home country. Apple in November 2021 <a href=\"https://www.macrumors.com/2021/11/23/apple-sues-nso-group/\">sued the group</a> and its parent company with the aim of holding it accountable for targeting Apple users with spyware used for surveillance purposes.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/04/apple-security-banner.jpeg\" width=\"2048\" height=\"1145\" />\r<br />\nJudge Donato <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.388382/gov.uscourts.cand.388382.87.0.pdf\">denied</a> NSO's motion to dismiss Apple's case \"in all respects,\" and rejected the group's arguments that Apple should be required to bring its lawsuit to Israel, deciding instead that the case will proceed in the United States. \r<br />\n\r<br />\nThe court also ruled that Apple had adequately alleged that NSO violated the Computer Fraud and Abuse Act (CFAA) and California’s Unfair Competition Law, breached its contract with Apple, and that NSO unjustly enriched itself at the expense of Apple and its users.\r<br />\n\r<br />\nIn the lawsuit, Apple offers up information on how NSO Group infiltrated the devices of <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> owners and how it utilized the Pegasus spyware to do so. Apple is asking for a permanent injunction that would ban NSO Group from using Apple software, services, or devices.\r<br />\n\r<br />\nAn Apple spokesperson said the victory meant that Apple could proceed in U.S. court to hold NSO accountable and continue to protect Apple's users, products, and infrastructure from hacker groups like NSO.\r<br />\n\r<br />\nNSO Group created invasive spyware known as \"Pegasus\" that was sold to various world governments and was used to access the devices of journalists, lawyers, and human rights activists. \r<br />\n\r<br />\nApple has been working on fixing exploits and has addressed major Pegasus-related hacks in updates to its software since iOS 14.6. In addition to filing a lawsuit against NSO Group, Apple plans to contribute $10 million to organizations pursuing cybersurveillance research and advocacy. \r<br />\n\r<br />\n\"State-sponsored actors like the NSO Group spend millions of dollars on sophisticated surveillance technologies without effective accountability,\" said Apple's software engineering chief Craig Federighi in 2021. \"That needs to change.\"\r<br />\n\r<br />\nNSO will have to answer Apple's complaint in a U.S. court by February 14, 2024. <div>Tags: <a href=\"https://www.macrumors.com/guide/lawsuit/\">Apple Lawsuits</a>, <a href=\"https://www.macrumors.com/guide/apple-security/\">Apple Security</a>, <a href=\"https://www.macrumors.com/guide/privacy/\">Privacy</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/24/apple-early-victory-nso-group-spyware-lawsuit/\">Apple Wins Early Victory Against Spyware Maker NSO Group in Court</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-wins-early-victory-against-spyware-maker-nso-group-in-court.2417289/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc707681ee215eccdeb26181ecaa524a312f58e643d122f7a13e1108bfadfc7c","category":"Apple"}