{"title":"Wiggle ‘up for sale’ with Chain Reaction heading for administration","link":"https://www.bikeradar.com/news/wiggle-appoints-administrators/","date":1698395476000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wiggle-Logo-b0f2b50.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Wiggle-Logo\" title=\"Wiggle-Logo\" />                                            <p>Wiggle has appointed administrators to handle the affairs, business and property of the cycling retailer on Tuesday 24 October. The business is now set to be put up for sale.</p>\n<p>A notice was posted in the FAQ section of user’s Wiggle accounts, first seen by BikeRadar yesterday, notifying customers of the appointment.</p>\n<p>Today, the notice that Wiggle Limited has appointed the administrators was posted in <em>The London Gazette</em>, a journal in which certain statutory notices, such as administration and insolvency, must be posted.</p>\n<p>Wiggle has appointed Anthony John Wright and Alastair Rex Massey from FRP Advisory as administrators.</p>\n<p>The appointment of administrators follows the news that <a href=\"https://www.bikeradar.com/news/wiggle-chain-reaction-insolvency/\">Wiggle and Chain Reaction faced insolvency</a> and were seeking self-administration.</p>\n<p>This came after a period of financial turmoil for Wiggle’s owner Signa Sports United (SSU) and the termination of an unconditional €150 million Equity Commitment by Signa Holdings, an affiliate company of SSU.</p>\n<p>SSU deemed the termination “unjustified”.</p>\n<p>The notice on Wiggle’s website reads: “All orders made with Wiggle will continue to be delivered as usual, and our standard terms and conditions still apply for item returns and warranty claims.”</p>\n<h2>Up for sale</h2>\n<p>A statement issued by the Joint Administrators says Wiggle CRC is set to be put up for sale.</p>\n<p>The statement says Wiggle CRC and its brands will “remain fully operational and will continue to trade”.</p>\n<p>Wright and Massey were also appointed as administrators to Mapil Midco 1 Limited, another company within the Wiggle group. Chain Reaction Cycles Retail Limited and Hotlines Europe Limited are expected to be placed into administration imminently.</p>\n<p>The business has headquarters in Plymouth, UK, and operates a 320,000 sq ft warehouse facility in Bilston, Wolverhampton.</p>\n<p>It employs around 450 staff, all of whom have been retained by the Joint Administrators at this stage, according to the statement.</p>\n<p>Wright says: “WiggleCRC is one of Europe’s best-known sports retailers and has built a committed customer following in the cycling community.</p>\n<p>“The administration provides a crucial period of protection for WiggleCRC as we prepare to market the business for sale.</p>\n<p>“The group has a quality stable of brands and a leading market position, so we expect there to be interest and encourage potential buyers to come forward.”</p>\n<p>Private equity firm Bridgepoint paid £180 million for Wiggle in 2011 and the company merged with Chain Reaction Cycles in 2016.</p>\n<p>SSU bought Wiggle in 2021, but the sports division of Signa, a conglomerate built by Austrian developer René Benko, has struggled financially, delisting from the New York Stock Exchange in October.</p>\n<p>BikeRadar has contacted Wiggle for further information.</p>\n<p><em>If you’ve been affected by the Wiggle administration, we’d love to hear from you at <a href=\"mailto:news@bikeradar.com\" target=\"_blank\">news@bikeradar.com</a></em></p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"bc77c4a08aa74a039c3e904b4af34703bb9bdf79c94ee8e33e4a980c6273a65f","category":"Cycling"}