{"title":"Nobody needs HiFi Apple Music+","link":"https://www.macworld.com/article/346595/nobody-needs-hifi-apple-music.html","date":1621020920000,"content":"\n<div>\n<section><div></div></section><p>We’ve heard <a href=\"https://www.macworld.com/article/339494/multiple-sources-claim-airpods-3-wont-be-part-of-apples-march-event.html\">rumors of a new AirPods design</a> for some time now. (Many keep calling them AirPods 3, though there was never really an AirPods 2.) Depending on who you believe, those are due to be announced at any time—at WWDC, or this fall, or now the <a href=\"https://www.macworld.com/article/346526/apple-music-plus-third-gen-airpods-may-18-rumor.html\">latest rumor says early next week</a>. They’re supposed to accompany a new “Apple Music+” subscription tier, a sort of “HiFi Apple Music” add-on that was hinted at in the code of <a href=\"https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">iOS 14.6</a>.</p>\n\n\n\n<p>While a new AirPods design is welcome, this high-end Apple Music tier is not. High-fidelity music has always been snake oil; a way to part music-loving audiophiles convinced of their golden ears and from their hard-earned money. It has never caught on, mostly because it’s simply not needed. It wouldn’t surprise me to see Apple add such a feature on to Apple Music, but I wish it wouldn’t, even if it doesn’t cost more.</p>\n\n\n\n<h2>The high-fidelity audio graveyard</h2>\n\n\n\n<p>Apple wouldn’t be the first company to try to sell music-lovers on the need for higher-fidelity audio. Or the second. Or the fifth. Digital hi-resolution, high-fidelity audio has been a <em>thing</em> since before the iPod, when there was a format war between <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/DVD-Audio&amp;xcust=1-1-346595-0-0-0&amp;sref=https://www.macworld.com/feed\">DVD-Audio</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Super_Audio_CD&amp;xcust=1-1-346595-0-0-0&amp;sref=https://www.macworld.com/feed\">Super Audio CD</a> over which one could get you to replace your CD player and most of your music for no damn reason whatsoever. </p>\n\n\n\n<p>Music lovers have been ripping CDs in lossless formats like FLAC for ages. Apple even has its own, <a href=\"https://www.macworld.com/article/227769/the-complete-guide-to-using-itunes-with-lossless-audio.html\">ALAC</a> (Apple Lossless Audio Codec), which is now open-source and royalty-free. Despite these formats being available for a very long time, they never really became mainstream.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/homepod-mini-main.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Apple Music Hi-Fi won’t sounds any different on your HomePod.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>Remember Neil Young’s <a href=\"https://www.techhive.com/article/2866107/attention-audiophiles-neil-youngs-high-fidelity-pono-player-hits-stores-monday.html\">Pono Player</a>? Or <a href=\"https://www.macworld.com/article/225240/sorry-tidal-why-im-waiting-for-apple-to-revolutionize-streaming.html\">Tidal</a>, the “artist-owned” vanity service whose claim to fame is letting you pay more for high-fidelity streams? Spotify is apparently <a href=\"https://www.techhive.com/article/3608623/spotify-will-roll-out-cd-quality-audio-streams-later-this-year.html\">ready to roll out a Hi-Fi tier</a>, which may be the reason Apple is doing this Apple Music+ thing. Sigh.</p>\n\n\n\n<p>There are lots of reasons for music products and services to fail, but it seems like every one that stakes it claim on “superior audio” meets an untimely end.</p>\n\n\n\n<h2>Almost nobody can hear the difference</h2>\n\n\n\n<p>There’s a good reason for that. Modern “lossy” music compression is <em>really good</em> at getting rid of only the audio data you can’t really hear anyway. The fact is, when put to the test most people can’t tell the difference between “lossless” audio and well-encoded lossy” audio (say, 256kbits per second AAC, which is what Apple Music currently streams).</p>\n\n\n\n<p>Maybe one in a thousand people have hearing that is good enough and trained well enough to pick out the differences. Even if you do, you need a listening pipeline capable of faithfully reproducing such subtle differences—decoders, amplifiers, and speakers or headphones. Oh, <em>and</em> you need to be in a good listening environment, too.</p>\n\n\n\n<p>The biological, environmental, and technological stars have to align <em>just right</em> in order for lossless, high fidelity music to sound even the tiniest bit better than modern high-quality lossy music. People like to convince themselves that they’re one of the special few, as though there is some value judgement in being able to appreciate lossless hi-fi music. You aren’t special, and that’s fine, because again, modern lossy audio compression is <em>amazing</em>.</p>\n\n\n\n<p>Want to try it yourself? Give this <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://abx.digitalfeed.net/spotify-hq.html&amp;xcust=1-1-346595-0-0-0&amp;sref=https://www.macworld.com/feed\">Digital Feed ABX</a> test a whirl. It’s the best statistically-sound measure of doing a blind audio quality test I’ve seen yet. Don’t feel bad if it says you probably can’t hear the difference between lossless and lossy audio—almost nobody can!</p>\n\n\n\n<h2>A solution in search of a problem</h2>\n\n\n\n<p>HiFi, or lossless, or high-resolution, or whatever-the-latest-marketing-is music keeps failing because it just not a problem that needs to be solved. Every so often a new product will launch in this space and you’ll read reviews from audiophiles that use flowery language about how it “preserves the warmth” or sounds “spacious and detailed” or “crunchy” or some other strange combination of adjectives. What you <em>won’t</em> see is reviewers that subject themselves to a valid <em>blind listening test</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/airpods-max-on-head.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Apple Music Hi-Fi won’t even sound much better on AirPods Max.</p>\n<p><br /></p></figcaption></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>When we know we’re listening to fancy audio, we can convince ourselves that it sounds better. Tell a listener they’re about to hear a $10,000 amplifier and they’ll gush about its quality, too. When we try a blind test, we see that the emperor has no clothes. Modern compressed audio is capable of reaching the limits of human perception and the sound reproduction capabilities of even very expensive consumer gear (like <a href=\"https://www.macworld.com/article/234986/airpods-max-review.html\">AirPods Max</a>). </p>\n\n\n\n<p>Maybe this supposed Apple Music+ tier will be something else. Maybe it will be about using spatial 3D audio to recreate a spacious sound stage (especially useful for live recordings). Or maybe it’s about access to B-sides, demos, audio interviews, and behind-the-scenes content. Maybe, just maybe, Apple’s not going to follow Spotify back down the well-worn path of “high fidelity music,” thinking that this time will be different. That path leads off a cliff and always has.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bc8a1db18b11ed5689b911fd4fffb690587130df64b026a06e3636699f61605b","category":"Apple"}