{"title":"Comparative Analysis and Prediction of Sustainable Development in Earthquake Preparedness: A Cross-Cultural Perspective on Montenegro, North Macedonia, and Serbia","link":"https://www.preprints.org/manuscript/202403.1136/v1","date":1710843758000,"content":"Authorities and governmental bodies strongly emphasize the importance of residents preparing for natural disasters, particularly underscoring the significance of readiness for geophysical hazards like earthquakes. In this study, which represents comparative quantitative research, the levels and predictors of the impact on preparedness for earthquake-induced disasters in South-Eastern Europe countries such as Montenegro, North Macedonia, and Serbia are examined. Using the snowball sampling technique (online questionnaire), a survey of 1245 respondents (Montenegro (n = 400), North Macedonia (n = 345), and Serbia (n = 500) was conducted from February 2023 to February 2024. The paper is based on the central hypothesis that the most significant predictor of earthquake preparedness in Montenegro, North Macedonia, and Serbia is age, followed by gender and education. Multivariate regression analysis was used to determine the extent to which five scores of the subscales (household preparedness, community preparedness, disaster preparation, earthquake risk awareness, reinforced house) were associated with seventh demographic and socio-economic variables. In addition to the mentioned analysis, other statistical analyses such as T-test, one-way ANOVA analysis, and Pearson correlation were also utilized. The results indicate that age emerges as a predictor in various aspects of earthquake-induced disaster preparedness and awareness in most models, followed by education. These findings confirm the significance of respondents' age in determining levels of preparedness and earthquake awareness. Overall, in North Macedonia, respondents recorded the highest ratings (M = 3.52) for household preparedness for earthquakes, compared to Montenegro (M = 2.98) and Serbia (M = 3.26), where the lowest ratings were recorded. Research findings, taking into account cultural characteristics, can serve as a basis for the development of targeted interventions, strategies, policies, and programs aimed at improving the level of societal preparedness for earthquake-induced disasters.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bc97929da41c9a40445faba138a2c9f5671892c3b2e951d69783996b35ae7d72","category":"Interdisciplinary"}