{"title":"125 Relationship of electrical conductivity to color variables (chroma, hue, L*, a*, b*) of fresh beef loins","link":"https://academic.oup.com/jas/article/102/Supplement_1/43/7617987?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Appraisal of beef color and overall quality assessment by consumers may be variable. In this study, Prime Grade beef strip loins were used to determine if electrical conductivity measurements (ECM) are correlated with color variables (chroma, hue, L*, a*, and b*) and could be used to improve color quality assessment and evaluation. An experimental design consisting of 6 full strip loins x 6 steaks per loin x 2 locations per steak was used and provided 72 total observations for analysis. Electrical conductivity measurements (ECM) procedures developed in our lab consisted of using emulsified meat samples concealed in silicon vessel connected to copper electrodes leading to a digital multimeter. ECM was measured in microsiemens (µS) over 60 sec with a sampling rate of 2/sec. Color variables were measured using a Varian Cary 50 Series Spectrophotometer following procedures of AMSA to ensure standardization. Data were analyzed using ANOVA and Pearson correlation coefficients. ECM means in microsiemens (µS) were 14.37, 42.52, 34.86, 22.89, 16.05, and 24.70 for the six groups of fresh steaks and were not different (P &gt; 0.05). However, ECM values for cooked steaks differed (P &lt; 0.05). Mean values for chroma, hue, L*, a*, and b* were different (P &lt; 0.05) across fresh loin steaks. Correlations of ECM to all five of the color variables were different and negative (P &lt; 0.05): chroma -0.013, hue -0.050, L* -0.009, a *-0.031, b* -0.110. These data show that ECM provide another analytical procedure that may be used in evaluating the color of fresh beef loins, and in the overall assessment and evaluation of beef products.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bca67e520c4821618770f3a7ac15458b32197be308e5a86aee96394d54aa5549","category":"Environment"}