{"title":"Social dimensions of climate‐induced flooding in Jakarta (Indonesia): The role of non‐point source pollution","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11129?af=R","date":1727055631000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3b377d42-9f9c-4426-b7ea-08c8d4dd06e4/wer11129-toc-0001-m.png\" alt=\"Social dimensions of climate-induced flooding in Jakarta (Indonesia): The role of non-point source pollution\" />\n<p>Climate changes resulted in annual flooding in Jakarta (Indonesia) in 2020.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Because of its low-lying location, urbanization, and inadequate infrastructure, Jakarta (Indonesia) has experienced an increase in annual flooding events, rising from an average of five significant floods per year in the 1990s to over 20 annually (2010–2020). With climate change exacerbating extreme weather events, Jakarta encounters escalating risks of flooding. Although the recurrent flooding is exacerbated by non-point source (NPS) of pollution such as urban runoff and agricultural discharge that contribute to 40% of total pollutants leading to flood-related issues in Jakarta, none has investigated this research gap. To reflect its novelty, this work explores the implications of climate change on the annual flooding in Jakarta by focusing on NPS and analyzes their impacts from social perspectives. This work also underscores the implications of flooding on livelihoods, health, and social cohesion in Jakarta. Focus group discussion with affected residents was used to shed light on the coping strategies employed in response to recurrent floods, ranging from community-based initiatives to reliance on informal networks. The empirical findings show that the implications of flooding extend beyond physical damages. Displacement of communities, loss of livelihoods, disruption of essential services, and increased health risks are among the social impacts experienced by local residents. Vulnerable populations, including low-income communities residing in informal settlements, bear their consequences. Economic losses from flooding amount to USD 500 million annually, impacting over 1 million residents. However, recent interventions have led to a 15% reduction in peak flood levels and a 20% reduction in flood duration in affected areas. Community resilience has also improved, with a 25% increase in flood insurance coverage and a 20% rise in community response initiatives. Overall, this study highlights that climate change exacerbates annual flooding in Jakarta, significantly impacting vulnerable communities through NPS pollution. Addressing the challenges requires integrated approaches combining effective pollution control, resilient infrastructure, and community engagement to mitigate social and long-term environmental impacts.</p>\n<h2>Practitioner Points</h2>\n<p>\nClimate-induced flooding disproportionately affects vulnerable communities in Jakarta.\nNon-point source pollution from urban runoff contributes to the severity of flooding in Jakarta.\nWaterborne diseases, disruption of livelihoods, and reduced access to clean water are major concerns identified in the study.\nThe study highlights the importance of community-based adaptation strategies to mitigate the impact of flooding and pollution.\n</p>","author":"Tonni Agustiono Kurniawan, \nChristia Meidiana, \nHui Hwang Goh, \nDongdong Zhang, \nMeihui Jiang, \nMohd Hafiz Dzarfan Othman, \nAbdelkader Anouzla, \nFaissal Aziz, \nMohamed Mahmoud, \nMuhammad Imran Khan, \nImran Ali, \nMd Munir Hayet Khan, \nKai Chen Goh","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"bcaa3cc760fec2cfb6587220bea2ad9ad3b81147e4336d53d4d92908dc383482","category":"Environment"}