{"title":"Hematological and Physiological Changes in Rainbow Trout, Oncorhynchus mykiss, Exposed for 30 Days to Critical Low Temperature","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/2925959?af=R","date":1728564551000,"content":"<p>Rainbow trout (<i>Oncorhynchus mykiss</i>) acclimated to 9°C were exposed to 1.8 ± 1.0°C water for 30 days. Survival rate decreased by 8%, and RNA expression of the heat shock protein heatshock protein 90 (<i>hsp90</i>) gene was upregulated, indicating thermal stress. The fish exhibited no growth but lost weight (daily growth rate −0.17% ± 0.03%). This was not due to depletion of energy reserves, as liver glycogen, liver triglycerides, and visceral fat levels remained unchanged. The growth hormone receptor 1 (<i>ghr1</i>) gene, encoding a growth hormone receptor, and the ATP synthase membrane subunit f (<i>atp5j2</i>) gene, encoding a component of mitochondrial ATP synthase, were downregulated, suggesting a reduced metabolic rate. Hematological investigations revealed the following results: Immune activity was suppressed, evidenced by decreased numbers of granulocytes, lymphocytes, thrombocytes, and total immunoglobulin levels. Serum aspartate aminotransferase and alanine aminotransferase activities increased by 90% and 230%, respectively, indicating disturbance in liver functions. Adaptations to the cold included changes in erythrocyte morphology and blood hemoglobin concentration. Erythrocyte cell volume increased by 15%, cytoplasm volume by 10%, nucleus volume by 5%, and cell surface area by 7%, with a concurrent rise in hemoglobin content. These changes likely represent adaptations to altered metabolic demands. Concentrations of blood erythrocytes, erythroblasts, serum Na<sup>+</sup>, K<sup>+</sup>, Cl<sup>−</sup>, and activities of lactate dehydrogenase, lysozyme, and the alternative complement pathway remained consistent between the two temperature regimes. In summary, the data demonstrate that exposing rainbow trout to temperatures of 1.8 ± 1.0°C leads to negative effects on fish performance, the development of thermal stress, suppression of immune parameters, and liver damage. Potential adaptations were observed in erythrocyte size and hemoglobin content.</p>","author":"Franz Lahnsteiner, \nAnna Dünser, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bcac888f2e78019d857406f0b706e9dc1d7f36caedd02b2be49416b7d272798c","category":"Environment"}