{"title":"The Origin of Nerf and Buff","link":"https://markpeak.net/the-origin-of-nerf-and-buff/","date":1707298653000,"content":"<p>คำว่า nerf (ลดความสามารถ) และ buff/debuff (เพิ่ม/ลดความสามารถชั่วคราว) เป็นศัพท์จากวงการวิดีโอเกม ที่เริ่มใช้งานกันแพร่หลายนอกเหนือจากวงการเกมด้วย เป็นตัวอย่างการใช้คำตามวัฒนธรรมป๊อปที่ลื่นไหลตามการขยายตัวของผู้ใช้งาน</p>\n\n\n\n<p>แต่ถ้าถามว่าที่มาของคำว่า nerf และ buff เกิดขึ้นครั้งแรกได้อย่างไร ผมเองก็ตอบไม่ได้เหมือนกัน หลังจากไปค้นข้อมูลเลยพบว่า<a href=\"https://www.inverse.com/gaming/nerf-buff-meaning-video-games-coined-series\">มีคนไปรวบรวมมาให้</a>เรียบร้อยแล้ว</p>\n\n\n\n<h2>Nerf</h2>\n\n\n\n<p>Nerf เป็นคำที่เกิดมาก่อน ที่มาเกิดจากเกม Ultima Online ซึ่งเป็นเกมออนไลน์ยุคแรกๆ เริ่มให้บริการตั้งแต่ปี 1997 ตอนนั้นไม่มีใครเคยทำเกมออนไลน์มาก่อน ไม่รู้ว่าสมดุลของเกมอยู่ตรงไหน ทำให้เกม UO ช่วงแรกๆ อาวุธดาบมีพลังเยอะกว่าอาวุธอื่นๆ ผู้เล่นจึงแห่กันไปใช้อาวุธดาบกันหมด</p>\n\n\n\n<p>เมื่อทีม UO ปรับสมดุลเกมให้ดาบมีพลังน้อยลง ผู้เล่นที่เคยได้ประโยชน์จากดาบ จึงบ่นๆ กันว่าดาบมันกระจอกลงกว่าเดิม ราวกับเป็นดาบของเล่นเด็ก Nerf Sword (เจ้าของเดียวกับแบรนด์ปืนของเล่น Nerf Gun ที่นิยมในอเมริกา) เลยทำให้คำว่า “Nerf” มีความหมายว่า “ถูกปรับให้แย่ลง” มานับตั้งแต่นั้น</p>\n\n\n\n<h2>Buff</h2>\n\n\n\n<p>ส่วนคำว่า Buff นั้นมีความหมายแสลงว่า “ทำให้กล้ามเนื้อแข็งแรง” (having a physique enhanced by bodybuilding exercises) อยู่ก่อนแล้ว (<a href=\"https://www.merriam-webster.com/dictionary/buff\">Merriam-Webster</a>) การใช้งานในวงการเกม เริ่มถูกใช้ในเกมกระดานตระกูล Dungeons and Dragons มาก่อน ที่ใช้เวทย์มนตร์เพิ่มค่าความสามารถให้ตัวละครชั่วคราว</p>\n\n\n\n<p>แต่คำว่า Buff ถูกใช้งานแพร่หลายจริงๆ ในยุคเกมออนไลน์เช่นกัน โดยเป็นเกม Anarchy Online เริ่มให้บริการปี 2001 ที่พูดถึงการใช้คาถาเพิ่มความสามารถให้ตัวละครชั่วคราว หลังจากนั้นก็มีคำว่า Debuff เกิดขึ้นมาในทางกลับกันคือ ลดความสามารถลงชั่วคราว (<a href=\"https://forums-archive.anarchy-online.com/showthread.php?343-Doctor-Woes\">โพสต์ในฟอรั่มของ Anarchy Online ปี 2001 มีใช้คำนี้แล้ว</a>)</p>\n\n\n\n<p>คำว่า Buff/Debuff มักเป็นคำแสลงที่ผู้เล่นเรียกกันเอง แต่ในเกมมักไม่ค่อยใช้คำนี้กัน ใช้คำว่า status effect หรือชื่อเรียกไอเทมในเกมเป็นอย่างๆ ไปมากกว่า แต่ก็มีบ้างที่เห็นช่องทาง official ของเกมใช้คำนี้บ้างเหมือนกัน</p>\n\n\n\n<figure><div>\n<blockquote><p>Buff and Debuff… or else! <br /><br />Strategic buff and debuff use is necessary to bring down stronger foes. <br /><br />Most spells that end in \"-kaja\" will increase your team's stats, while ones that end in \"-nda\" weaken your opponent. Use them wisely for maximum damage! <a href=\"https://t.co/z9bxpYvt4Y\">pic.twitter.com/z9bxpYvt4Y</a></p>— Official ATLUS West (@Atlus_West) <a href=\"https://twitter.com/Atlus_West/status/1394706852831633408?ref_src=twsrc%5Etfw\">May 18, 2021</a></blockquote>\n</div></figure>\n\n\n\n<p>หมายเหตุ: ไม่รู้ใช้รูปประกอบอะไรดี ใช้คาถา time magic จากเกม Final Fantasy V ซึ่งเป็นครั้งแรกที่ผมมีโอกาสได้ใช้คาถาแนว buff/debuff ในเกมก็แล้วกัน – ภาพจาก <a href=\"https://finalfantasy.fandom.com/wiki/Time_Magic_(Final_Fantasy_V)\">Fandom</a></p>The post <a href=\"https://markpeak.net/the-origin-of-nerf-and-buff/\">The Origin of Nerf and Buff</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"bcbbab6a528865405ecf32579b364fd26d12874975bba44c2be61f671a441819","category":"Thai"}