{"title":"Psychosocial Factors in Evidence-based Management Interventions and Policymaking: The COPSOQ III Greek Validation Study","link":"https://www.preprints.org/manuscript/202407.1849/v1","date":1721831554000,"content":"Background: For the past two decades, the Copenhagen Psychosocial Questionnaire (COPSOQ) has been established as a valid instrument to measure psychosocial stress at work. Nowadays, the COPSOQ international network is responsible for the monitoring and improvement of COPSOQ. 2019, a new questionnaire was published, and the Greek version is now being validated. Methods: Measurement qualities of the Greek COPSOQ III have been explored in adherence to the usual requirements of a validation study as defined by DIN EN ISO 10075-3. A sample of observations from 2.189 participants surveyed with the COPSOQ in Greece was used to validate the current version with appropriate statistical analyses. Exploratory factor analysis was used to assess statistical relations for many scales. Results: With its 108 items and 40 scales, the Greek COPSOQ III includes all psychosocial work factors that have been internationally validated and remain compatible with about 72% of the COPSOQ III German version content. Beyond primary results, congruence with widely used theoretical approaches like the Demand-Control(−Support) model (DCM) or the Job Demands-Resources model (JDR) is generally satisfactory. In summary, our validation study for the Greek COPSOQ III version showed adequate reliability and validity, which is in line with the COPSOQ III questionnaire from other European countries, and it is also compatible with the validation of the German COPSOQ III (Lincke, 2021). Our regression analysis showed that the 34 psychosocial work factors (34 “context” scales) could adequately predict the scores of the satisfactory and health scales (6 “outcome” scales). The analysis also indicated the top five (5) predictors (context variables) for each of the six (6) “effect” scales (outcome variables). Conclusions: With the launch of COPSOQ III in Greece, current and new workplace psychosocial aspects could be explored. COPSOQ III(GR) is a beneficial instrument for enterprise research and risk assessment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bcc1cf8040efe6bcbd9b4ac91af211104c32fb3a315b12f72249f66e6beb18cf","category":"Interdisciplinary"}