{"title":"127 Color and oxidative stability of Longissimus lumborum muscles from artificially raised ram lambs finished on a high-concentrate diet","link":"https://academic.oup.com/jas/article/102/Supplement_1/43/7617986?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Pre-weaning strategies, such as artificially raising on milk replacer, can impact lamb quality. Limited studies have examined the influence of artificial raising on color attributes of lamb. The aim of this study was to evaluate how artificially raising on milk replacer affects the color and oxidative stability of longissimus lumborum (LL) muscle from ram lambs finished on a high-concentrate diet. For a 60-day pre-weaning period, Polypay ram lambs were reared either conventionally with ewes (CR; n = 5) or artificially on milk replacer (MR; n = 5). After 60 days, the lambs were finished on a high concentrate diet (85:15 concentrate: forage) containing 78% cracked corn and 22% pre-mixed protein pellet as the concentrate source as well as 15% orchard grass pellet as the forage source. The lambs were fed ad libitum high-concentrate diet until the target body weight of 59 kg. The lambs were harvested, and the LL muscles from both sides of the carcasses (24 h post-mortem) were fabricated into 2.5-cm thick chops. Carcass characteristics were recorded during harvesting and fabricating. The chops were placed on polystyrene trays, overwrapped with oxygen-permeable polyvinyl chloride film, and stored at 2°C in the darkness for 0, 3, and 6 d. Instrumental color, color stability (R630/580), pH, lipid oxidation, and myoglobin reducing activity of the chops were evaluated on the storage days. A split-plot design was employed to analyze the data. Pre-weaning management was the main plot, while the storage time was considered as the sub-plot. The LL muscles from each lamb carcass were considered as the experimental unit, whereas the sub-plot experimental units were the chops allocated for 0, 3, or 6 d storage. The data were analyzed using the PROC GLIMMIX. The least square means were separated utilizing the PDIFF option and adjusted with the Tukey-Kramer method. The differences among means were detected at a 5% level. There was no effect (P &gt; 0.05) of pre-weaning management on carcass characteristics, surface redness (a* value), lightness (L* value), yellowness (b* value), color stability (R630/580), pH, or metmyoglobin reducing activity of LL chops. Color stability (R630/580) and metmyoglobin reducing activity declined (P &lt; 0.05) during storage in both CR and MR chops. In contrast, lipid oxidation, lightness (L* value), yellowness (b* value), and hue value of the chops increased (P &lt; 0.05) in both treatments during storage. Artificial raising on milk replacer for 60 d pre-weaning period did not influence color and oxidative stability of lambs finished on a high-concentrate diet. Carcass characteristics, color stability, and lipid oxidation were comparable in lambs raised through conventional method and those raised artificially on milk-replacer. These findings indicate that milk-replacer could be employed as a practical approach for artificial rearing in lamb production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bcc16b3c5fcb8a51abe9724117ad510254eeece19df2100094ac7b840358a79e","category":"Environment"}