{"title":"Apple Releases macOS Sonoma With New Widget Features, Safari Updates, Screen Sharing Improvements and More","link":"https://www.macrumors.com/2023/09/26/apple-releases-macos-sonoma/","date":1695747697000,"content":"Apple <a href=\"https://www.apple.com/newsroom/2023/09/macos-sonoma-is-available-today/\">today released macOS 14 Sonoma</a>, the newest version of the operating system that runs on the Mac. <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a> has been in beta testing for several months, and it is compatible with the 2019 and later <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>, the ‌iMac‌ Pro, the 2018 and later <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a>, the 2018 and later MacBook Pro, the 2019 and later <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>, and the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-4.jpg\" alt width=\"2336\" height=\"1314\" />\r<br />\nThe ‌‌macOS Sonoma‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Settings.\r<br />\n\r<br />\n‌macOS Sonoma‌ adds interactive widgets to the desktop, bringing them out of the Today view and making them more prominent and useful. With Continuity, you can even see and interact with your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> widgets on your Mac.\r<br />\n\r<br />\nThere are a range of new Apple TV-like screensavers that feature slow-motion videos of worldwide locations, along with matching desktop wallpapers. Apple added a new Game Mode for Macs with Apple silicon chips, and this option prioritizes games on the CPU and GPU for smoother performance.\r<br />\n\r<br />\nVideo conferencing gets a boost with a Presenter Overlay effect for sharing content, plus there's a high performance mode for Screen Sharing that offers higher frame rates and low-latency audio so pros can access their content creation workflows from anywhere.\r<br />\n\r<br />\n<div></div>\r<br />\nSafari's Private Browsing mode is locked behind <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a>, Profiles can be used to separate work and personal browsing, and there are improved tracking and fingerprinting protections to preserve your privacy. You can save your favorite websites as web apps on the desktop or the dock, and they will work as regular apps with a simplified toolbar.\r<br />\n\r<br />\nMany of the features that are in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> are also in ‌macOS Sonoma‌. The Messages app supports a new stickers experience that turns all emoji into stickers, the People album can recognize pets, and Visual Lookup works with videos and can recognize food and identify symbols on labels and signs.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> can be shared with other people using <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a>, <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> Keychain passwords can be shared with friends and family members, the Notes app supports inline PDFs, and <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> can now be activated without saying \"Hey.\" Apple's full release notes for the update are below.<blockquote>macOS Sonoma brings all‑new capabilities that elevate your productivity and creativity. Discover even more ways to personalize your Mac with stunning screensavers and widgets that you can add to your desktop. Elevate your presence on video calls with a new way to present your work that keeps you a part of the presentation. Safari profiles and web apps help you organize your browsing in all-new ways. Game Mode boosts your gaming performance. Sonoma also brings big updates to Messages, Keyboard, and Accessibility. And when you upgrade, you get the latest security and privacy protections available for Mac.\r<br />\n\r<br />\n<strong>Screen Savers</strong>\r<br />\nStunning screen savers of locations from around the world seamlessly become your desktop wallpaper when you log-in\r<br />\n- Shuffle settings for rotating through screensavers by theme including Landscape, Cityscape, Underwater, and Earth\r<br />\n\r<br />\n<strong>Widgets</strong>\r<br />\n- Widgets can be placed anywhere on the desktop and adapt to the color of your wallpaper while working in apps\r<br />\n- iPhone widgets can be added to your Mac when your iPhone is nearby or on the same Wi-Fi network\r<br />\n- Interactive widgets let you take actions directly from the widget such as running a shortcut, pausing media, and more\r<br />\n\r<br />\n<strong>Video Conferencing</strong>\r<br />\n- Presenter Overlay keeps you front and center while sharing your screen in FaceTime or third-party video conferencing apps (Mac with Apple silicon)\r<br />\n- Reactions layer 3D effects like hearts, balloons, confetti, and more around you in video calls and can be triggered with gestures (Mac with Apple silicon, Continuity Camera with iPhone 12 and later)\r<br />\n\r<br />\n<strong>Safari and Passwords</strong>\r<br />\n- Profiles keep your browsing separate for topics like work and personal, separating your history, cookies, extensions, Tab Groups, and favorites\r<br />\n- Web apps let you use any website like an app, complete with an icon in the Dock for faster access and a simplified toolbar for easier browsing\r<br />\n- Enhanced Private Browsing locks your private browsing windows when you're not using them, blocks known trackers from loading, and removes tracking that identifies you from URLs\r<br />\n- Password and passkey sharing allows you to easily share accounts with trusted contacts\r<br />\n\r<br />\n<strong>Messages</strong>\r<br />\n- Live Stickers sync from iOS and iPadOS to macOS, giving you access to the Live Stickers you create on your iPhone and iPad\r<br />\n- Search filters for people, keywords, and content types like photos or links help you more easily find what you are looking for\r<br />\n- Swipe to reply inline on any iMessage bubble\r<br />\n\r<br />\n<strong>Gaming</strong>\r<br />\n- Game Mode gives games the highest priority on the CPU and GPU, delivering more consistent frame rates and lower latency to wireless controllers and AirPods (Mac with Apple silicon)\r<br />\n\r<br />\n<strong>Keyboard</strong>\r<br />\n- Improved autocorrect accuracy makes typing even easier by leveraging a more powerful transformer-based language model\r<br />\n- Inline predictive text shows single- and multi-word predictions that you can add by pressing the Space bar\r<br />\n- Improved Dictation experience supports using your voice and keyboard together to enter and edit text\r<br />\n\r<br />\n<strong>AirPods</strong>\r<br />\n- Adaptive Audio delivers a new listening mode that dynamically blends Active Noise Cancellation and Transparency to tailor the noise control experience based on the conditions of your environment (AirPods Pro (2nd generation) with the latest firmware)\r<br />\n- Personalized Volume adjusts the volume of your media in response to your environment and listening preferences over time (AirPods Pro (2nd generation) with the latest firmware)\r<br />\n- Conversation Awareness lowers your media volume and enhances the voices of the people in front of the user, all while reducing background noise (AirPods Pro (2nd generation) with the latest firmware)\r<br />\n- Press to mute and unmute your microphone by pressing the AirPods stem or the Digital Crown on AirPods Max when on a call (AirPods (3rd generation), AirPods Pro (1st and 2nd generation), or AirPods Max with the latest firmware)\r<br />\n- Improved AirPods automatic switching now detects Mac up to 2X faster (AirPods (2nd and 3rd generation), AirPods Pro (1st and 2nd generation), AirPods Max with the latest firmware)\r<br />\n\r<br />\n<strong>Privacy</strong>\r<br />\n- Sensitive Content Warnings can be enabled to help prevent users from unexpectedly viewing sensitive images in Messages\r<br />\n- Expanded Communication Safety protections for children now detect videos containing nudity in addition to photos shared through Messages and the system Photos picker\r<br />\n- Improved sharing permissions let you choose which photos to share and add calendar events without providing access to your entire photo library or calendar\r<br />\n\r<br />\n<strong>Accessibility</strong>\r<br />\n- Live Speech lets you type what you want to say and reads it aloud in FaceTime calls or in-person conversations\r<br />\n- Personal Voice helps users at risk of speech loss create a voice that sounds like them in a private and secure way using on-device machine learning\r<br />\n- Made for iPhone compatible hearing devices can be paired and used with Mac (MacBook Pro (2021), Mac Studio (2022), and Mac computers with M2 chip)\r<br />\n\r<br />\n<strong>This release also includes other features and improvements:</strong>\r<br />\n- One-Time verification code AutoFill from Mail helps you quickly sign into sites in Safari, without leaving the browser\r<br />\n- Inline PDFs and document scans in Notes are presented full-width making them easy to view\r<br />\n- Grocery Lists in Reminders automatically group related items into sections as you add them\r<br />\n- Visual Look Up for recipes helps you find similar dishes from photo\r<br />\n- Visual Look Up in video helps you learn about objects that appear in paused video frames\r<br />\n- Pets in the People album in Photos surfaces individual pets just like friends or family members\r<br />\n- Option to say \"Siri\" in addition to \"Hey Siri\" for a more natural way to activate Siri (Mac with Apple silicon, AirPods Pro (2nd generation))\r<br />\n- High performance mode in Screen Sharing supports color workflows and improves responsiveness while remotely accessing a Mac (Mac with Apple silicon)\r<br />\n- Item sharing in Find My allows you to share an AirTag with up to five other people\r<br />\n- Activity History in Home displays a recent history of events for door locks, garage doors, security systems, and contact sensors\r<br />\n- Battery health management updated on 13-inch MacBook Air with M2 chip to better optimize long term battery health\r<br />\n\r<br />\nSome features may not be available for all regions or on all Apple devices.</blockquote><h2>Read More</h2>\r<br />\nFor a deeper look at all of the new features in ‌macOS Sonoma‌, we have a <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">dedicated macOS Sonoma roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-sonoma.243\">macOS Sonoma</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/26/apple-releases-macos-sonoma/\">Apple Releases macOS Sonoma With New Widget Features, Safari Updates, Screen Sharing Improvements and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-macos-sonoma-with-new-widget-features-safari-updates-screen-sharing-improvements-and-more.2404826/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bcc27c8ec94bc4d149efa3861a38f9f085a4872e65716e252bf7140457bed05f","category":"Apple"}