{"title":"Identification of Chemical Segregation and Surface Twinning Structures in Electro-Deposited Al Dendrites","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.846/7720180?rss=1","date":1721779200000,"content":"<span>Lithium-ion batteries (LIBs) dominate the industry, but limited lithium supplies and safety concerns with their electrolytes push the search for alternatives. Rechargeable aluminium batteries (RABs) are promising among post-lithium battery chemistries, which exhibit considerable potential as candidates for future applications due to the low cost of component materials and excellent theoretical energy density. Most research on aluminium batteries (AlBs) has focused on enhancing cathode materials [<a href=\"#ozae044.846-B1\">1</a>] and ionic liquid electrolytes [<a href=\"#ozae044.846-B2\">2</a>], overlooking attention to Al anodes [<a href=\"#ozae044.846-B3\">3</a>]. It is crucial to note that the inherent metallic nature of aluminium increases susceptibility to dendrite formation during reversible plating and stripping processes [<a href=\"#ozae044.846-B4\">4</a>]. Dendrites pose safety risks by breaching separators, leading to anode disintegration and cell failure. Uneven Al deposition, resulting in dendrite formation, can cause cell short circuits, particularly under repeated cycling at high capacities [<a href=\"#ozae044.846-B5\">5</a>]. Therefore, it is of great importance to obtain in-depth understanding of the Al dendrite growth mechanism to increase battery safety. Multiple approaches were adopted to restrain the Al dendrite growth and identify the dendrite growth mechanism. Whilst most studies are preferred to reveal the mechanisms from the perspective of electrochemistry [<a href=\"#ozae044.846-B6\">6</a>], electron microscopy is able to provide more straightforward approaches from crystallographic perspectives to understand the dendrite growth mechanism.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"bcc3c185a6ef4b7ba0c02124e3831c27e4aad3d745059c08f544568e5460e57f","category":"Environment"}