{"title":"Social support receipt as a predictor of mortality: A cohort study in rural South Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003683","date":1725890400000,"content":"<p>by David Kapaon, Carlos Riumallo-Herl, Elyse Jennings, Shafika Abrahams-Gessel, Keletso Makofane, Chodziwadziwa Whiteson Kabudula, Guy Harling</p>\r\n\r\nThe mechanisms connecting various types of social support to mortality have been well-studied in high-income countries. However, less is known about how these relationships function in different socioeconomic contexts. We examined how four domains of social support—emotional, physical, financial, and informational—impact mortality within a sample of older adults living in a rural and resource-constrained setting. Using baseline survey and longitudinal mortality data from HAALSI, we assessed how social support affects mortality in a cohort of 5059 individuals aged 40 years or older in rural Mpumalanga, South Africa. Social support was captured as the self-reported frequency with which close social contacts offered emotional, physical, financial, and informational support to respondents, standardized across the sample to increase interpretability. We used Cox proportional hazard models to evaluate how each support type affected mortality controlling for potential confounders, and assessed potential effect-modification by age and sex. Each of the four support domains had small positive associations with mortality, ranging from a hazard ratio per standard deviation of support of 1.04 [95% CI: 0.95,1.13] for financial support to 1.09 [95% CI: 0.99,1.18] for informational support. Associations were often stronger for females and younger individuals. We find baseline social support to be positively associated with mortality in rural South Africa. Possible explanations include that insufficient social support is not a strong driver of mortality risk in this setting, or that social support does not reach some necessary threshold to buffer against mortality. Additionally, it is possible that the social support measure did not capture more relevant aspects of support, or that our social support measures captured prior morbidity that attracted support before the study began. We highlight approaches to evaluate some of these hypotheses in future research.","author":"David Kapaon","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"bcc5d904ff1bad834776edda91b1e268fe7d1236c9657127e59d789a49002e3f","category":"Environment"}