{"title":"Got a new 24-inch iMac? Do these 5 things first","link":"https://www.macworld.com/article/347142/24-inch-imac-usb-thunderbolt-adapters-time-machine-backup-icloud-drive-macos-app-updates-touch-id.html","date":1621593900000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>When that new 24-inch iMac arrives, you don’t want anyone or anything getting in your way as you unpack it and set it up. It’s an exciting moment, so go ahead, go for it! But (or course, there’s a “but”) after you’re done placing it perfectly on your desk, plugging it in, turning it on, and then sitting back to gaze upon it admiringly, take a little break. Pause for bit, because now it’s time to set up your Mac for the work you want to get done. </p>\n\n\n\n<p>To get the most out of your Mac experience, there are a few things you should do first before doing anything else. Many of these tasks are the type you need to do only once, and when they are set, you will rarely need to address them again and you can focus on working or creating on your Mac. </p>\n\n\n\n<h2>Figure out which adapters you need</h2>\n\n\n\n<p>While you set up the iMac, you may have noticed the ports on the back. The iMac has only one type of connector, which is shaped like a USB-C plug. The 24-inch iMac comes with a pair of these ports, and the technology behind those ports is Thunderbolt/USB 4, meaning that you can use those ports with Thunderbolt and USB devices. (The $1,499 and $1,699 come with two additional ports that are USB-C only. Most Thunderbolt devices won’t work with those ports even though the cable looks the same. <a href=\"https://www.pcworld.com/article/3346142/usb4-what-this-future-standard-means-for-usb-chaos-and-thunderbolt-3.html\">It’s confusing</a>, we know.)</p>\n\n\n\n<p>The catch is that the devices you want to connect to your new iMac—hard drive, printer, camera, etcetera—probably use a cable that has a different connector. So to connect your old devices to your new iMac, you need to buy adapters. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/apple-usbc-usb-adapter-thunderbolt-adapter.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>You’ll probably need Apple’s USB-C to USB adapter (left) and Thunderbolt (USB-C) to Thunderbolt 2 Adapter (right).</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Chances are, the device you want to connect uses a USB-A connector, the most widely used version of USB. So the adapter you will need is a USB-C to USB adapter. Apple has one for $19 (<a href=\"https://www.amazon.com/Apple-USB-C-to-USB-Adapter/dp/B00VU2OID2?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Amazon link</a>), but you can find third-party versions for a little cheaper. If you have a device that uses a different version of Thunderbolt, you need an adapter like Apple’s $49 Thunderbolt 3 (USB-C) to Thunderbolt 2 Adapter (<a href=\"https://www.amazon.com/Apple-MMEL2AM-Thunderbolt-USB-C-Adapter/dp/B01MQ26QIY?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Amazon link</a>). We have a <a href=\"https://www.macworld.com/article/229045/macbook-pro-thunderbolt-3-adapter-guide-how-to-connect-an-iphone-display-hard-drive-and-more.html\">complete guide</a> to help you find the adapter you need.</p>\n\n\n\n<p>If you have a lot of devices you want to connect, consider investing in a Thunderbolt dock. This is a box that provides a set of different connectors you can plug into. There are a variety of docks available with different port offerings. We recently <a href=\"https://www.macworld.com/article/342522/owc-thunderbolt-hub-review-a-simple-way-to-add-more-ports-to-a-mac.html\">reviewed</a> the OWC Thunderbolt Hub ($149) and liked it. We also <a href=\"https://www.macworld.com/article/344618/wd_black-d50-review-a-fast-thunderbolt-3-dock-with-internal-storage.html\">reviewed</a> the WD_Black D50, a dock with a built-in 1TB hard drive for $449. That hard drive would be handy for the next step listed below.</p>\n\n\n\n<h2>Set up a Time Machine backup</h2>\n\n\n\n<p>The Mac operating system (called macOS) has a built-in feature for making backups of your data. It’s called Time Machine, and it’s really easy to set up and use. Though it rarely happens, if you use your computer enough, there will come a time when you a file you’re working on goes bad, or you lose it, or you want to revert to a previously saved version. Time Machine can help you recover that file.</p>\n\n\n\n<p>You need an external hard drive to use Time Machine. Connect the drive to your iMac and then go to the Apple menu and open System Preferences. Click on <em>Time Machine</em> and you can set it up. You can have Time Machine perform backups automatically as long as the drive is connected to the iMac.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-big-sur-time-machine.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>It takes just a few minutes to set up Time Machine—time well spent, especially when the time comes when you need to recover a file.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Configure iCloud Drive</h2>\n\n\n\n<p>iCloud is Apple’s online service that provides a way to sync your data between your Macs, iPhones, and iPads. It also has email, <a href=\"https://www.macworld.com/article/233398/find-my-how-to-use-apples-new-all-in-one-app-to-find-friends-and-devices.html\">Find My</a>, and other services. When you set up a new iMac, you’ll be asked to set up an iCloud account or log into one if you already have it. But once your Mac is up and running, you should go a step further and configure iCloud Drive, the online storage that iCloud provides.</p>\n\n\n\n<p>In System Preferences, click on your Apple ID at the top to get to the iCloud settings. Then click on <em>iCloud</em> in the left column, and in the box to the right labeled “Apps on this Mac using iCloud,” check the iCloud Drive if you want to use it. Then click on the <em>Options</em> button, and a window will pop up that shows the apps that will store data on iCloud Drive.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-big-sur-icloud-drive.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Turning on Desktop &amp; Documents will allow you to access files in those folders on any device.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>If you check Desktop and Documents, this will allow you to access any files saved to the Desktop or Documents folder on any other Mac, iPhone, or iPad that you use. If you don’t want to have this kind of access, uncheck the Desktop and Documents box. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT206985&amp;xcust=1-1-347142-0-0-0&amp;sref=https://www.macworld.com/feed\">Learn more about Desktop and Documents on iCloud Drive.</a></p>\n\n\n\n<h2>Check for macOS and app updates</h2>\n\n\n\n<p>While Apple does a good job of shipping its Macs with the latest version of macOS, sometimes updates get released while your iMac is shipped to you. It’s a good idea to check for the latest version of macOS before you start because it fixes bugs, patches security holes, and introduces new features. The latest version is 11.3, though your iMac might with macOS 11.4. </p>\n\n\n\n<p>If you want to check, here are the steps to update macOS:</p>\n\n\n\n<ol><li>Click on the Apple menu.</li><li>Select <em>About this Mac</em>.</li><li>In the window that appears, go to the <em>Overview</em> tab if it’s not already open.</li><li>Click on the <em>Software Update</em> button. This will open the Software Update system preference.</li><li>You can click the <em>More info</em> link if you want to learn more about the update.</li><li>When you are ready to install, click on the <em>Update Now</em> button. Installation takes several minutes, depending on the speed of the internet connection.</li></ol>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/mac-app-stor-update-big-sur.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Check the Mac App Store for app updates.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>You can also check for updates for the apps you use. If you buy apps in the Mac App Store, you can launch the App Store app and click <em>Updates</em> at the bottom of the left column. For apps that you didn’t buy in the App Store, you’ll have to check with the developer’s website to see if any updates are available.</p>\n\n\n\n<h2>Set up Touch ID</h2>\n\n\n\n<p>If you bought a $1,499 or $1,699 24-inch iMac or paid extra for the $1,299 model, the keyboard is equipped with a Touch ID sensor, Apple’s security feature that uses a fingerprint scanner. When you first set up your iMac, you’ll go through the Touch ID setup, but you can add a couple of other fingers to your profile. You can do that in the Touch ID system preferences.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/touch-id-button-magic-keyboard.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Touch ID comes with the $1,499 and $1,699 iMacs. The Touch ID button is located on the upper right corner of the keyboard.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>That’s all done, so clean up your mess</h2>\n\n\n\n<p>We’ve all done it: after setting up your new iMac, you start using it to do things, like check email, visit a few websites, work on a presentation in Keynote, edit a video in iMovie—the list goes on. But look around. You probably have the iMac box laying there, you moved things around to make room for the iMac, maybe you even have your old Mac sitting right next to you on the floor. Numerous studies <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/age-of-awareness/clean-up-your-home-office-and-youll-boost-your-productivity-d0ea0d014882&amp;xcust=1-1-347142-0-0-0&amp;sref=https://www.macworld.com/feed\">say</a> that you are more productive when your workspace is tidy, so take a break from new iMac (I know, it’s hard), and clean up after yourself. Then you’ll be able to use your iMac without any distractions.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bcd02b00de54a8bc7b06f44375c1ad7c4c150b13d7ccbcc3e4ad63a4885291e2","category":"Apple"}