{"title":"The AGAMOUS-LIKE 16–GENERAL REGULATORY FACTOR 1 module regulates axillary bud outgrowth via catabolism of abscisic acid in cucumber","link":"https://academic.oup.com/plcell/article/36/7/2689/7641785?rss=1","date":1712361600000,"content":"<span><div>Abstract</div>Lateral branches are important components of shoot architecture and directly affect crop yield and production cost. Although sporadic studies have implicated abscisic acid (ABA) biosynthesis in axillary bud outgrowth, the function of ABA catabolism and its upstream regulators in shoot branching remain elusive. Here, we showed that the MADS-box transcription factor <span>AGAMOUS-LIKE 16</span> (<span>CsAGL16</span>) is a positive regulator of axillary bud outgrowth in cucumber (<span>Cucumis sativus</span>). Functional disruption of <span>CsAGL16</span> led to reduced bud outgrowth, whereas overexpression of <span>CsAGL16</span> resulted in enhanced branching. CsAGL16 directly binds to the promoter of the ABA 8′-hydroxylase gene <span>CsCYP707A4</span> and promotes its expression. Loss of <span>CsCYP707A4</span> function inhibited axillary bud outgrowth and increased ABA levels. Elevated expression of <span>CsCYP707A4</span> or treatment with an ABA biosynthesis inhibitor largely rescued the <span>Csagl16</span> mutant phenotype. Moreover, cucumber General Regulatory Factor 1 (CsGRF1) interacts with CsAGL16 and antagonizes CsAGL16-mediated <span>CsCYP707A4</span> activation. Disruption of <span>CsGRF1</span> resulted in elongated branches and decreased ABA levels in the axillary buds. The <span>Csagl16 Csgrf1</span> double mutant exhibited a branching phenotype resembling that of the <span>Csagl16</span> single mutant. Therefore, our data suggest that the CsAGL16–CsGRF1 module regulates axillary bud outgrowth via CsCYP707A4-mediated ABA catabolism in cucumber. Our findings provide a strategy to manipulate ABA levels in axillary buds during crop breeding to produce desirable branching phenotypes.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"bcd1969f4f73c5d069b211597e2752131a62a481a9b8b94da2ee47a93a8890be","category":"Environment"}