{"title":"Capitalizing on genebank core collections for rare and novel disease resistance loci to enhance barley resilience","link":"https://academic.oup.com/jxb/article/75/18/5940/7699943?rss=1","date":1719446400000,"content":"<span><div>Abstract</div>In the realm of agricultural sustainability, the utilization of plant genetic resources for enhanced disease resistance is paramount. Preservation efforts in genebanks are justified by their potential contributions to future crop improvement. To capitalize on the potential of plant genetic resources, we focused on a barley core collection from the German <span>ex situ</span> genebank and contrasted it with a European elite collection. The phenotypic assessment included 812 plant genetic resources and 298 elites, with a particular emphasis on four disease traits (<span>Puccinia hordei</span>, <span>Blumeria graminis hordei</span>, <span>Ramularia collo-cygni</span>, and <span>Rhynchosporium commune</span>). An integrated genome-wide association study, employing both Bayesian-information and linkage-disequilibrium iteratively nested keyway (BLINK) and a linear mixed model, was performed to unravel the genetic underpinnings of disease resistance. A total of 932 marker–trait associations were identified and assigned to 49 quantitative trait loci. The accumulation of novel and rare resistance alleles significantly bolstered the overall resistance level in plant genetic resources. Three plant genetic resources donors with high counts of novel/rare alleles and exhibiting exceptional resistance to leaf rust and powdery mildew were identified, offering promise for targeted pre-breeding goals and enhanced resilience in future varieties. Our findings underscore the critical contribution of plant genetic resources to strengthening crop resilience and advancing sustainable agricultural practices.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"bcd684f02215aa4524c091681a2708e1808ab502e2728f8686b1cb8d861b042c","category":"Environment"}