{"title":"Effectiveness of Mysis diluviana as a Substitute for Fishmeal in Formulated Aquafeed for Fingerling Rainbow Trout","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/3774463?af=R","date":1725085138000,"content":"<p>The present study explored the potential of wild <i>Mysis diluviana</i>, a widespread freshwater crustacean that is also invasive in many lakes, to serve as a substitute for fishmeal in the formulation of salmonid aquafeed. <i>M. diluviana</i>, harvested from Okanagan Lake in British Columbia, Canada, had a high protein content, with crude protein making up 53% of its dry body weight; lipids formed 32% of dry <i>M. diluviana</i> body weight. Fingerlings from two distinct strains of rainbow trout were fed for 60 days with one of three diet treatments: experimental feeds in which 25% or 50% of the fishmeal ingredient was replaced with <i>M. diluviana</i> and a feed containing no <i>M. diluviana</i>. Feeds containing <i>M. diluviana</i> supported the same survivorship and similar or better fingerling growth as the fishmeal-only feed, including fingerlings of a trout strain that are highly selective feeders. The amino acid and fatty acid composition of fingerling tissues at the end of the experiment was mostly indistinguishable among the three feed treatments. In addition, the tissue composition of fingerlings, such as the EAA : NEAA ratio and the amounts of SFA, MUFA, and PUFA, did not fully match the biochemical composition of their feeds, likely due in part to the capacity of freshwater salmonids for bioconversion of some amino acids into other less available amino acids. <i>M. diluviana</i> was therefore found to be an effective source of protein and lipid for fingerling rainbow trout and an effective substitute for marine fishmeal in trout aquafeed.</p>","author":"Louis A. Gosselin, \nBrian A. Heise, \nRavinder Sappal, \nAustin N. Pietramala, \nKingsley K. Donkor, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bce0df5dc8ebea3aec9e258fda3b6e75840a4e9be9763304e96b8e093a3341f2","category":"Environment"}