{"title":"Jabuticaba (Myrciaria trunciflora) extract improves metabolic and behavioral markers of obese rats fed on a hypercaloric diet","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13845?af=R","date":1724935481000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Obesity is a metabolic disease that affects many individuals around the world, related to imbalance between energy consumption and expenditure, which can lead to comorbidities. A healthy diet can significantly contribute to the prevention or treatment of this condition. Jabuticaba is an emerging fruit presenting a wide range of bioactive compounds and is being extensively studied due to its effects on lipid metabolism. The aim of this study was to evaluate the jabuticaba extract in the anxious-like behavior and in the lipid and oxidative metabolism in the context of obesity.</p>\n<h2>METHODS</h2>\n<p>Forty male Wistar rats divided into five groups were used. The animals received a standard diet and/or a hypercaloric diet and after 60 days of induction, interventions were carried out with jabuticaba extract (5% and 10%) via gavage for 30 days.</p>\n<h2>RESULTS</h2>\n<p>It can be observed that the jabuticaba extract was able to reverse the anxious behavior observed in obese animals and modulate parameters of lipid and oxidative metabolism. We observed a reduction in cholesterol and triglyceride levels compared to obese animals. Furthermore, we observed an improvement in oxidative parameters, with a reduction in protein carbonylation in the liver and modulation of antioxidant enzymes such as superoxide dismutase and catalase. Contrary to expectations, we did not observe changes in leptin, adiponectin and tumor necrosis factor alpha (TNF-α) levels.</p>\n<h2>CONCLUSION</h2>\n<p>Our work demonstrates that jabuticaba extract can improve metabolic, oxidative and behavioral changes in animals with obesity. © 2024 Society of Chemical Industry.</p>","author":"Jean Ramos Boldori, \nJean Carlos Costa Nogueira, \nFélix Roman Munieweg, \nAnnelize Gruppi Lunardi, \nCristiane de Freitas Rodrigues, \nFrancielli Weber Santos Cibin, \nCristiane Casagrande Denardin","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bcf0820f64e1beed81fcc2a8d8c4180eb154d35fa4d6d0b06cacfa33dd5f8df9","category":"Environment"}