{"title":"xrOS: What to Expect From the Software Designed for Apple's AR/VR Headset","link":"https://www.macrumors.com/guide/xros-apple-headset-software-rumors/","date":1685393990000,"content":"The Worldwide Developers Conference (WWDC), Apple's annual developer and software-oriented conference, is now just a few days away. As with previous years, Apple is expected to introduce major updates to all of its operating systems, but unique to <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a>, Apple is also very likely to unveil <a href=\"https://www.macrumors.com/guide/xros/\">xrOS</a>, the software that will run its much-rumored AR/VR mixed-reality headset. Here's everything we're expecting from it.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div><h2>xrOS: What's in a Name?</h2>\r<br />\nApple has not publicly acknowledged the existence of its headset, but internal Apple sources have confirmed that the operating system will be called <a href=\"https://www.macrumors.com/2023/05/16/apple-registers-xros-headset-wordmark/\">xrOS</a>, and Apple has used hidden shell companies to <a href=\"https://www.macrumors.com/2023/05/21/xrproos-trademark-application/\">trademark</a> the name in various countries.\r<br />\n\r<br />\n‌xrOS‌ is meant to stand for \"extended reality,\" hinting at the augmented and virtual reality functions at the heart of the head-mounted device. The backend capitalization also conforms to the naming conventions Apple has adopted for all of the operating systems in its ecosystem.\r<br />\n\r<br />\nAccording to <a href=\"https://www.bloomberg.com/news/articles/2023-04-18/apple-vr-ar-headset-apps-sports-tv-fitness-gaming-wellness-ipad-features\">reporting by <em>Bloomberg</em>'s Mark Gurman</a>, Apple sees the headset as a device for gaming, watching streaming video, video conferencing, health and fitness, and interfacing with other people. Therefore ‌xrOS‌ will be focused on providing the best possible environment for delivering that content. \r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/05/xros-wordmark.jpeg\" alt width=\"2874\" height=\"1684\" /><em>Apple-registered wordmark for \"‌xrOS‌\" in New Zealand</em></div>\r<br />\n\r<br />\n<h2>xrOS User Interface</h2>\r<br />\n‌xrOS‌ is believed to have an iOS-like interface that will be familiar to <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> users, but presented to them and interacted with in an entirely new way. \r<br />\n\r<br />\nWe are expecting a dedicated <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> containing apps and customizable widgets, all of which can be rearranged, and all viewed on dual high-resolution 4K micro OLED displays with up to 3,000 pixels per inch for a rich, realistic, and immersive viewing experience. \r<br />\n\r<br />\nBoth of the user's hands and eyes will be tracked by more than a dozen optical cameras, and the wearer is expected to be able to look at an on-screen item to select it, and use a hand gesture like a pinch to activate the item on the screen. \r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2016/02/googleglassaugmentedreality.jpg\" alt width=\"800\" height=\"438\" /><em>The now defunct-Google Glass: An early example of an AR interface</em></div>\r<br />\nThe ‌xrOS‌ software could even potentially project AR app interface elements onto actual objects in the real world for a mixed-reality overlay kind of effect.\r<br />\n\r<br />\nApple is also said to be working on an in-air typing feature that is expected to be a bit rudimentary at launch, with Apple to make <a href=\"https://www.macrumors.com/2023/02/26/gurman-apple-headset-in-air-typing-for-text-input/\">notable improvements over time</a>.\r<br />\n\r<br />\n<h2>Apps</h2>\r<br />\nAt the core of ‌xrOS‌ will be re-imagined versions of stock Apple apps like Safari, <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, Messages, Maps, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a>, <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, Podcasts, Reminders, and Calendar, as well as a <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> app customized for the headset. The Maps app will also feature, and could incorporate some of Apple's Look Around and landmark functionality, allowing users to explore cities around the world.\r<br />\n\r<br />\nUsers will be able to work on several apps at the same time, while an ‌xrOS‌ <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> will host made-for-headset apps, as well as existing ‌App Store‌ content. Apple is also said to be adapting ‌iPad‌ apps for the headset's 3D interface.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/app-store-awards-2022.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn addition, Apple is set on transforming several existing services and apps into immersive viewing experiences. For example, users will be able to watch videos in virtual reality environments as if they were looking at a giant screen, or participate in guided meditations accompanied by immersive visuals, audio, and voiceovers. \r<br />\n\r<br />\nSome of the apps and services said to offer radically different experiences in ‌xrOS‌ include Apple Fitness+, ‌Apple TV+‌ (with a focus on viewing sports content like MLB and MLS), and a 3D version of Apple's collaborative Freeform tool. As for ‌FaceTime‌, with all of the cameras that the headset is expected to have, one-on-one chats are said to feature realistic avatars which mimic the user's actual facial expressions and body movements.\r<br />\n\r<br />\nApple is also said to have created a Books app for reading in virtual reality, a Health app focusing on psychological wellness, and a Camera app that can take images from the headset's cameras.\r<br />\n\r<br />\n<h2>Gaming and App Creation</h2>\r<br />\nTo get people to purchase the mixed-reality headset, Apple will need to convince users that the software experiences are worth it. That will require not only compelling first-party experiences, but also innovative third-party apps from developers.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/05/a-screenshot-of-iron-man-vr.jpg\" alt width=\"1245\" height=\"700\" /><em>Iron Man VR on the Meta Quest headset</em></div>\r<br />\nWith gaming reportedly a focus, Apple is said to have been working with a select number of game developers to help them update their existing content for mixed reality, but Apple reportedly also has a robust set of tools available that will allow non-developers to create their own AR/VR experiences. <a href=\"https://www.macrumors.com/2023/01/27/apple-headset-ar-apps-via-siri/\">According to one report</a>, customers will be able to create and release AR apps for the headset using <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> as an assistant, even if they do not have the ability to code.\r<br />\n\r<br />\nThe report likens Apple's tool to Minecraft and Roblox, which allow anyone to easily create 3D tools and worlds. Apple is said to be utilizing technology that it acquired from Montreal-based startup Fabric Software in 2017, and customers would be able to distribute the AR apps they create on the ‌App Store‌ alongside developers. \r<br />\n\r<br />\nIt's worth noting that the report cites sources who last saw demonstrations of the tool in 2021, so the report is based on older information and it's possible that Apple's plans have changed at least slightly in the time that has passed since. Whether this latter report is still accurate is something we should learn soon.\r<br />\n\r<br />\n<h2>When is xrOS Coming?</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/xrOS-Text-Feature-Blue-Triad.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nApple's software tools for the headset are likely to be revealed at ‌WWDC 2023‌, giving developers time to create AR and VR apps and experiences for the headset before it launches. In that sense, we won't see the full version of ‌xrOS‌ until the headset is officially released to the public, and that isn't expected to happen until later in the year.\r<br />\n\r<br />\nFor everything else we know about the headset, including all the hardware details, be sure to check our <a href=\"https://www.macrumors.com/roundup/ar-vr/\">dedicated AR/VR headset roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/xros/\">xrOS</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/xros-apple-headset-software-rumors/\">xrOS: What to Expect From the Software Designed for Apple's AR/VR Headset</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/xros-what-to-expect-from-the-software-designed-for-apples-ar-vr-headset.2390822/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bcf431979e65337a05c28b9d9a3ab4a1ad1a41f60073cfcac6f7c153407cd1a9","category":"Apple"}