{"title":"Evaluation of effects of heat released from SOC decomposition on soil carbon stock and temperature","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17391?af=R","date":1719817200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ae7204a2-c486-4a3b-b37f-3e20b02bb3ab/gcb17391-toc-0001-m.png\" alt=\"Evaluation of effects of heat released from SOC decomposition on soil carbon stock and temperature\" />\n<p>This study explores how heat from soil organic carbon (SOC) decomposition, known as microbial heat, influences soil conditions and climate feedbacks. Using the ORCHIDEE-MICT model, it finds that microbial heat reduces SOC stocks and increases soil temperatures, particularly in deeper layers, affecting SOC accumulation and net primary productivity. These findings highlight the complexity of microbial heat's impact on climate change and the importance of understanding it for effective climate policy.</p>\n<br />\n<h2>Abstract</h2>\n<p>Heat released from soil organic carbon (SOC) decomposition (referred to as microbial heat hereafter) could alter the soil's thermal and hydrological conditions, subsequently modulate SOC decomposition and its feedback with climate. While understanding this feedback is crucial for shaping policy to achieve specific climate goal, it has not been comprehensively assessed. This study employs the ORCHIDEE-MICT model to investigate the effects of microbial heat, referred to as heating effect, focusing on their impacts on SOC accumulation, soil temperature and net primary productivity (NPP), as well as implication on land-climate feedback under two CO<sub>2</sub> emissions scenarios (RCP2.6 and RCP8.5). The findings reveal that the microbial heat decreases soil carbon stock, predominantly in upper layers, and elevates soil temperatures, especially in deeper layers. This results in a marginal reduction in global SOC stocks due to accelerated SOC decomposition. Altered seasonal cycles of SOC decomposition and soil temperature are simulated, with the most significant temperature increase per unit of microbial heat (0.31 K J<sup>−1</sup>) occurring at around 273.15 K (median value of all grid cells where air temperature is around 273.15 K). The heating effect leads to the earlier loss of permafrost area under RCP8.5 and hinders its restoration under RCP2.6 after peak warming. Although elevated soil temperature under climate warming aligns with expectation, the anticipated accelerated SOC decomposition and large amplifying feedback on climate warming were not observed, mainly because of reduced modeled initial SOC stock and limited NPP with heating effect. These underscores the multifaceted impacts of microbial heat. Comprehensive understanding of these effects would be vital for devising effective climate change mitigation strategies in a warming world.</p>","author":"Ye Huang, \nLin Huang, \nChunjing Qiu, \nPhilippe Ciais","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"bcf4d0d7f3f2d22bc813a8057bc26205cda52ff8d36080bcda77bd742ad76ae3","category":"Environment"}