{"title":"Samsung Debuts New $1,599 ViewFinity S9 5K Display to Compete with Apple's Studio Display","link":"https://www.macrumors.com/2023/07/17/samsung-viewfinity-s9-display/","date":1689580800000,"content":"Samsung today announced the upcoming U.S. launch of its ViewFinity S9 display, which is designed to compete with the Studio Display from Apple. The ViewFinity S9 <a href=\"https://www.macrumors.com/2023/06/26/samsung-viewfinity-s9-launching-in-korea/\">previously launched</a> in South Korea in June, but next month it will be expanding to the United States.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/samsung-viewfinity-s9.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe 27-inch ViewFinity S9 features a 5K display with a resolution of 5120 x 2800 and 218 pixels per inch. It offers 600 nits typical brightness, a 1000:1 contrast ratio, and 99 percent DCI-P3 for vivid, realistic colors, and it is has a 60Hz refresh rate with a 5ms response time. According to Samsung, there is also an Intelligent Eye Care feature built into the display to cut down on eye strain.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/samsung-viewfinity-s9-4.jpg\" alt width=\"2000\" height=\"1333\" />\r<br />\nPriced at $1,599, the ViewFinity S9 has the same price tag as the Studio Display from Apple, but Apple charges an additional $300 for Nano-texture matte glass and $400 extra for a tilt and height adjustable stand. Samsung's ViewFinity S9 has a matte display and built-in height and tilt adjustment at its base price, along with a Pivot function that allows the screen to be rotated 90 degrees to a portrait orientation. VESA mounting is also an option.\r<br />\n\r<br />\n<div></div>\r<br />\nThe display includes one Thunderbolt 4 port, three USB-C ports, a Mini DisplayPort, and a DC 20V port for a power supply. It can connect to both PCs and Macs, and offers 90W power transfer and data speeds of up to 40Gb/s for machines connected through the Thunderbolt 4 port.\r<br />\n\r<br />\nAt the top of the display, there is a 4K SlimFit camera that can tilt to fit the angle of the monitor, with an Auto Framing feature keeping the user visible and in the shot, similar to Apple's Center Stage feature. Built-in speakers are included, and an Adaptive Sound+ option allows noise levels to automatically adjust.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/samsung-viewfinity-s9-portrait-2.jpg\" alt width=\"2000\" height=\"1333\" />\r<br />\nSamsung created a Smart Calibration feature for the ViewFinity S9, which uses an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> 11 or later or a modern Galaxy smartphone to quickly customize the screen. Through the SmartThings app, display users can adjust white balance and gamma settings using the Basic mode, or tweak color temperature, luminance, color space, and more with the Professional mode. Calibration works by pointing the smartphone's camera at the ViewFinity S9, and after the process is complete, the app provides a report of the adjustments made and the Delta E color accuracy.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/samsung-viewfinity-s9-3.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe ViewFinity S9 includes Smart TV apps that allow the display to function as a TV independent of a connected computer. It supports popular streaming apps and the Samsung Gaming Hub for playing cloud-based games from Xbox and NVIDIA. There is a remote control for using the TV features.\r<br />\n\r<br />\nSamsung's ViewFinity S9 is priced at $1,599 and it will be available for purchase <a href=\"https://howl.me/ckalWEzpQpn\">from the Samsung website</a> and from other retailers in August.\r<br />\n\r<br />\n<em><small>Note: MacRumors is an affiliate partner with Samsung. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/17/samsung-viewfinity-s9-display/\">Samsung Debuts New $1,599 ViewFinity S9 5K Display to Compete with Apple's Studio Display</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsung-debuts-new-1-599-viewfinity-s9-5k-display-to-compete-with-apples-studio-display.2396115/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bcf78e85319e5023f9e00fb4d3d9b80821f4ec3a27eb9ae2808ad15514f0cd07","category":"Apple"}