{"title":"270 Interactive effects of available phosphorus and Ca:P on growth performance of nursery pigs fed diets containing phytase","link":"https://academic.oup.com/jas/article/102/Supplement_2/164/7664721?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An experiment was conducted to determine the interactive effects of available phosphorus (aP) and Ca:P on growth performance of nursery pigs. A total of 2,492 pigs [PIC 337 × 1050, initial body weight (BW) = 5.6 kg], placed in pens with 35 or 36 pigs each, were used in a 36-d trial. Treatments were arranged as a 2 × 4 factorial structure with two levels of aP (0.40 or 0.55%) and four Ca:P (0.85, 1.07, 1.29, and 1.51) with 9 replicates per treatment. Four basal diets with the extreme aP and Ca:P levels were manufactured in meal form and blended at the farm to create intermediate treatments. Phytase [Allzyme Spectrum Swine (Alltech, Nicholasville, KY)] was included in the experimental diets at superdose levels with an estimated 0.15% aP release. The experimental diets were fed from d 0 to 19 and a common corn-soybean meal-based diet with adequate aP and 1.20 Ca:P was fed from d 19 to 36. Data were analyzed with the MIXED procedure in SAS in a randomized complete block design with pen serving as the experimental unit and initial BW as the blocking factor. There was no evidence (<span>P</span> &gt; 0.10) for aP and Ca:P interactive effects on growth performance (Table 1). From d 0 to 19, there was no evidence (<span>P</span> &gt; 0.10) for growth performance differences between the aP levels. Increasing Ca:P resulted in a quadratic response (<span>P</span> = 0.043) in gain to feed ratio (G:F), with no evidence for (<span>P</span> &gt; 0.10) differences in average daily gain (ADG) or average daily feed intake (ADFI). From d 19 to 36, pigs previously fed 0.55% aP had improved (<span>P</span> ≤ 0.047) ADFI and ADG. Pigs previously fed increasing Ca:P had improved (linear, <span>P</span> = 0.024) G:F. There was also no evidence (<span>P</span> &gt; 0.10) for interactive effects on removal or mortality rates. However, pigs fed greater aP had decreased (<span>P</span> = 0.021) mortality rate. In summary, there were minor performance differences between different aP and Ca:P levels, but feeding greater aP diets resulted in a significant improvement in mortality rate.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bcf8e345d2fdec30f8f1307ee642d2ae3745adc57998e546afee68ced9dbdc8e","category":"Environment"}