{"title":"Cattle exclusion increases encounters of wild herbivores in Neotropical forests","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14751?af=R","date":1725940860000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d7286f95-2f6f-45af-bbba-78f98b8b7a4e/jpe14751-toc-0001-m.png\" alt=\"Cattle exclusion increases encounters of wild herbivores in Neotropical forests\" />\n<p>We provide experimental evidence that fences are effective at selectively excluding cattle and increasing encounter rates of wild browsers and fruit consumers in forest patches where these species co-occur with cattle. Our results highlight an important application of fencing ecology in Neotropical forests, where the implementation of wildlife-permeable fences is feasible due to smaller body sizes of wildlife compared to domestic animals such as cattle.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nOngoing habitat loss and species extinctions require managers to implement and quantify the effectiveness of conservation actions for protecting biodiversity. Fencing, when done properly, is an important management tool for conservation in landscapes where wildlife and domestic animals co-occur, potentially enhancing habitat use through selective exclusion of domestic species. For instance, the fencing of forest patches in the Neotropics is expected to reduce the degradation of understory vegetation by cattle, releasing these resources for the native community of browsers and fruit consumers.\n\nHere, we implemented an ecological experiment using a before-after control-impact design to quantify the effect of cattle exclusion on encounter probability of the native community of browsers and fruit consumers, and percent ground cover in multifunctional landscapes of the Colombian Orinoquía. We built 14 km of wildlife-permeable fences along forest edges in four forest patches (i.e. blocks) containing control and fenced (treatment) sites. We installed 33 camera traps to obtain information about wildlife and cattle encounter probabilities, before and after the fences were constructed. We used Bayesian generalised linear mixed effects models to quantify the effect of fences via the interaction between the time period (before and after the fences were built) and treatment (control or fenced sites).\n\nFencing was effective at reducing encounter probabilities of cattle in the treated sites, and it had a positive impact on relative encounter probabilities of four of seven studied wildlife species (herbivores including the black agouti [dry season only], lowland tapir [dry season only] and spotted paca [both seasons] and an omnivore, the South American coati [rainy season only]). The effect of fencing was negative for the collared peccary but only during the dry season. No statistically significant effect was detected for the white-lipped peccary or white-tailed deer.\n\n<i>Synthesis and applications</i>: We provide experimental evidence that fences are effective at selectively excluding cattle and increasing encounter rates of wild browsers and fruit consumers in forest patches where these species co-occur with cattle. Our results highlight an important application of fencing ecology in Neotropical forests, where the implementation of wildlife-permeable fences is feasible due to smaller body sizes of wildlife compared to domestic animals such as cattle.\n</p>","author":"Juliana Vélez, \nWilliam McShea, \nBudhan Pukazhenthi, \nJuan David Rodríguez, \nMaría Fernanda Suárez, \nJosé Manuel Torres, \nCésar Barrera, \nJohn Fieberg","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"bcfdac95452302a977e6945798dc9bc0b0a6a3d64c7448ecc94bdabb49f701c4","category":"Environment"}