{"title":"A High‐Resolution, Daily Hindcast (1990–2021) of Alaskan River Discharge and Temperature From Coupled and Optimized Physical Models","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036217?af=R","date":1712568592000,"content":"<h2>Abstract</h2>\n<p>Water quality and freshwater ecosystems are affected by river discharge and temperature. Models are frequently used to estimate river temperature on large spatial and temporal scales due to limited observations of discharge and temperature. In this study, we use physically based river routing and temperature models to simulate daily discharge and river temperature for rivers in 138 basins in Alaska, including the entire Yukon River basin, from 1990–2021. The river temperature model was optimized for ice free months using a surrogate-based model optimization method, improving model performance at uncalibrated river gages. A common statistical model relating local air and water temperature was used as a benchmark. The physically based river temperature model exhibited superior performance compared to the benchmark statistical model after optimization, suggesting river temperature model optimization could become more routine. The river temperature model demonstrated high sensitivity to air temperature and model parameterization, and lower sensitivity to discharge. Validation of the models showed a Kling-Gupta Efficiency of 0.46 for daily river discharge and a root mean square error of 2.04°C for daily river temperature, improving on the non-optimized physical model and the benchmark statistical model, which had root mean square errors of 3.24 and 2.97°C, respectively. The simulation shows that rivers in northern Alaska have higher maximum summer temperatures and more variability than rivers in the Central and Southern regions. Furthermore, this framework can be readily adapted for use across models and regions.</p>","author":"Dylan Blaskey, \nMichael N. Gooseff, \nYifan Cheng, \nAndrew J. Newman, \nJoshua C. Koch, \nKeith N. Musselman","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"bd049d598b8c9cd31b96525e17bcb8c9d3dfd6e261bed534472b7edb4745235d","category":"Environment"}