{"title":"PSXIII-17 Comparative Study on epididymal spermatozoa parameters of Large White × Landrace and Windsnyer boars","link":"https://academic.oup.com/jas/article/102/Supplement_3/714/7757926?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Windsnyer pigs are an early maturity breeds that grows slower than Large White x Landrace pigs. There is a concern that the genetic variation in the Windsnyer pig breed is becoming extinct. The aim of the study was to compare semen quality of epididymal spermatozoa derived from slaughtered Large White x Landrace (n = 15) and Windsnyer (n = 15) boars aged between 10 to 12 wk with an average body weight (BW) of 20.0 ± 2.60 kg were used. Boars were fed ad libitum, and water was made available through nipple drinker for a period of 3 mo, were humanely slaughtered following the routine abattoir protocols. Semen was collected from the head of epididymis of Windsnyer and Large White x Landrace testicles. Spermatozoa samples were extracted from the head of epididymus by making incision with a razor. Semen samples were then evaluated for semen volume, pH, sperm concentration, morphology. Sperm motility was evaluated using Computer-Aided Sperm Analyser. Analysis of variance was used to test the difference between the breeds. The average percentage of Windsnyer and Large White x Landrace sperm total motility was 92.4 ± 4.0 and 94.0 ± 4.1 %, respectively (<span>P</span> &gt; 0.05). The sperm velocity on the curve line for Windsnyer was less (147.2 ± 39.2) compared with the Large White x Landrace (178.3 ± 30.1µm/s; <span>P</span> &gt; 0.05). However, no significant differences were observed between the two breeds for rapid sperm and total sperm motility. No significant differences were observed in Windsnyer and Large x Landrace boar epididymal boar semen volume (8.2 and 9.0 mL, respectively) or semen pH (7.0). The average sperm concentration for Windsnyer and Large White x Landrace boar was [2.5 ± 1.2 and 1.1 ± 1.0 (x109 mL<sup>-1</sup>], respectively (<span>P</span> &gt; 0.05). There were no significant differences between Windsnyer and Large White x Landrace boar in abnormal sperm morphology. However, sperm with distal, head, and midpiece abnormalities were significantly different in Windsnyer (14.0 ± 3.6; 3.6 ± 6.0 and 3.4 ± 3.7% and Large White x Landrace boar (5.4 ± 4.7; 4.7 ± 1.0 and 0.4 ± 1.0%), respectively. In conclusion, Windsnyer had more distal, head and midpiece epididymal sperm abonormalities than Large White x Landrace boars.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bd04c262c3190bd70628b5c6055ef9d0fc323a85f639973a37fa8b8c1bfb4da4","category":"Environment"}