{"title":"Identification of Key Determinants Influencing the Spatiotemporal Heterogeneity of Urban Resilience","link":"https://www.preprints.org/manuscript/202409.0394/v1","date":1725517227000,"content":"The identification of spatiotemporal heterogeneity, its key determinants, and the interaction effects between the driving factors of urban resilience (UR) within and between subregions is fundamental for understanding its underlying mechanisms. A resilience evaluation model was applied to analyze the temporal and spatial differences in UR in Hunan Province, China. The standard deviation ellipse was used to explore the spatial and dynamic evolution and direction of UR. A hot spot analysis identified clusters of cold and hot spots. The contribution of spatiotemporal differences in UR within and between subregions was assessed using the Theil index. A geodetector analysis determined the factors influencing UR and their interactions. There was an increasing trend in UR from 0.2692 in 2014 to 0.3422 in 2022. The number of cities with high resilience gradually increased from 2014 to 2022, while there was a decreasing gradient in UR from northeast to southwest across the province. High-resilience cities had positive spillover effects on the surrounding area. Hot spots were predominantly located in the northeast, while cold spots were concentrated in the southwest. The barycenter of UR shifted from northeast to southwest by 2018, before moving southeast by 2022. The Theil index values declined over time both within and between subregions. Per capita GDP, average wages of on-the-job employees, per capita social consumption, and doctor density enhanced UR. Two-factor interactions had a greater influence on the spatiotemporal heterogeneity of UR than single factors. Two-factor and nonlinear enhancements were identified as the primary mode of influence.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd0a3b35b7d4dcb238657bece27c3b9694c366509ebfda1626e2238a361b72c1","category":"Interdisciplinary"}