{"title":"Windows 11 is much more than a new theme slapped onto Windows 10","link":"https://arstechnica.com/?p=1775943","date":1624558022000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/introducing-windows-11-800x417.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/introducing-windows-11.png\">Enlarge</a> <span>/</span> The latest Windows focuses heavily on improved task management, prettier UI, and a much more ambitious Microsoft Store. (credit: <a href=\"https://www.microsoft.com/\">Microsoft</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Earlier this morning, we got our first official look at Windows 11 by way of Microsoft's What's New For Windows <a href=\"https://www.microsoft.com/en-us/windows/event\">event</a>. The new OS offers several significant, functional changes to what we've become accustomed to in Windows 10—this isn't just the same old operating system with a fresh coat of paint.</p>\n<p>However, Windows 11 absolutely does get that fresh coat of paint. Its new desktop environment makes heavy use of translucent window dressing with rounded corners, an effect which brings to mind panes of frosted glass. In many ways, the new look is reminiscent of compiz-based Linux desktop environments circa 2010—but with significantly higher resolution and a more coherent overall theme.</p>\n<p>Microsoft Chief Product Officer Panos Panay ties the new look to eyebrow-raising statements about emotion: \"We understand the responsibility of [functionality and practicality] more than ever before, but it must also be personal—and maybe most importantly, it must feel <em>emotional</em>.\"</p></div><p><a href=\"https://arstechnica.com/?p=1775943#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775943&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bd0bf562e48c66c9ae3b46388d20e7922a11651e5eca4ffd92470634fdee460d","category":"Tech"}