{"title":"Utilization of publicly available data to summarize spatio‐temporal patterns of fish health events of Atlantic salmon (Salmo salar) reported by marine finfish industries in British Columbia (BC), Canada","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14022?af=R","date":1726644429000,"content":"<h2>Abstract</h2>\n<p>Atlantic salmon aquaculture companies in British Columbia (BC) must report fish health events to Fisheries and Oceans Canada (DFO) as part of their licensing conditions. Our study aimed to summarize these fish health events reported by Atlantic salmon sites in BC to identify spatial and spatio-temporal clusters. We conducted descriptive, retrospective global, and local cluster analyses using Moran's <i>I</i> and scan statistics. Between 2016 and 2022, 265 fish health events were reported. The annual incidence ranged from 5.60 (95% CI: 3.90–7.80) to 6.86 (95% CI: 4.70–9.60) health events per 100 active site-months. The most common events were yellow mouth (60.75%; 161/265) and salmonid rickettsial septicaemia (SRS) (15.47%; 41/265). The Moran's I index was positive and significant for yellow mouth, SRS, and overall fish health events at different distance bands. Most of the spatial and spatio-temporal clusters were identified in the west-central and southwestern parts of Vancouver Island. Our study hypothesizes that management practices, environmental conditions, and water quality parameters may have influenced the increased reporting of fish health events in these regions. Overall, the study highlights the potential of publicly available data for practical risk mapping in understanding the patterns of farmed Atlantic salmon diseases in BC.</p>","author":"Sumit Jyoti, \nBeibei Jia, \nSonja Saksida, \nHenrik Stryhn, \nDerek Price, \nKrishna Kumar Thakur","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"bd0e62026bdf595051817678423863dbd3ef3c7148591b237a7851b2758b50c4","category":"Environment"}