{"title":"Preslaughter factors affecting mobility, blood parameters, bruising, and muscle pH of finished beef cattle in the United States","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae035/7628037?rss=1","date":1710288000000,"content":"<span><div>Abstract</div>Decades of work have focused on reducing fear, stress, and discomfort in cattle during the preslaughter phase by improving and promoting animal handling, transportation, and management processes. Even still, there is limited information about the effects of preslaughter factors on animal welfare and meat quality outcomes in finished cattle in the United States. This study aimed to track individual animals through the slaughter process to identify preslaughter factors associated with key welfare and quality outcomes. A total of 454 cattle from one commercial slaughter facility were studied. Preslaughter factors assessed included distance traveled, truck waiting time, lairage density, lairage duration, and season. Animal characteristics, i.e., body weight, breed, and sex, were also recorded. One trained observer scored the mobility of all cattle using the North American Meat Institute’s 1-4 scale (i.e., normal to extremely reluctant to move). Exsanguination blood was collected and analyzed for cortisol, creatine kinase, and lactate. Carcass bruising was scored using a modified version of the National Beef Quality Audit’s bruise-scoring methodology (i.e., no bruise, one bruise ≤ the size of a deck of cards, one bruise &gt; than the size of a deck of cards, and multiple bruises). Ultimate muscle pH was measured 32 to 36 h postmortem. Multi-predictor models were selected for each outcome variable using Akaike Information Criterion. Continuous outcome variables were analyzed using linear mixed-effect models and categorical outcome variables with mixed-effect logistic regression models. Longer truck waiting times were associated with increased cortisol (<span>P </span>= 0.04) and lactate (<span>P</span> = 0.02) concentrations. Similarly, increased lairage duration was associated with increased creatine kinase concentrations (<span>P</span> = 0.05) and the odds of cattle being bruised (<span>P</span> = 0.03). Less space allowance per animal in lairage was associated with increased odds of cattle having impaired mobility (<span>P</span> = 0.01). There was a seasonal effect for many of the measured outcomes; the summer season was associated with greater lactate concentrations (<span>P</span> &lt; 0.0001), increased odds of impaired mobility (<span>P</span> &lt; 0.0001), and increased odds of carcass bruising (<span>P</span> = 0.003). The findings of this study indicate that many of the preslaughter factors assessed influence critical welfare and meat quality outcomes of finished beef cattle, warranting future research and consideration.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"bd185b4cf222a64c5e759a1d0fd43ed4d63b681146aef30c71c7b036f61165db","category":"Environment"}