{"title":"Teniel Campbell on Paris-Roubaix: ‘I’m just excited’","link":"https://cyclingtips.com/2021/10/teniel-campbell-on-paris-roubaix-im-just-excited/","date":1633119062000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/GettyImages-1336842634-650x433.jpg\" /></div><h2>Teniel Campbell on Paris-Roubaix: 'I’m just excited'</h2><p>\n</p><p>It’s been a busy few weeks for Teniel Campbell in her first season as a WorldTour pro.</p>\n\n\n\n<p>She is set to take on the first-ever women’s Paris-Roubaix on Saturday, not long after taking her first pro victory last month. On stage 6 of the 2.1 Tour Cycliste Féminin International de l’Ardèche in September, Campbell showed herself to be more than capable of taking the lead at BikeExchange. A day after her team found themselves scrambling for bikes after they had theirs stolen, Campbell gathered herself and sprinted to victory after spending the afternoon in a 12-rider breakaway. </p>\n\n\n\n<p>“I was really happy. I mean, it was really unfortunate what happened with the equipment. But to still be able to go on and continue the tour it really meant something to us as a team,” she told CyclingTips. “We must thank the staff, we must thank other teams as well for assisting and being supportive. The victory was also such a huge team effort and it made it more special. It was also a way of giving back to the staff and saying, thank you for staying up so late at night to get everything prepped and ready for the following day to race. So it was a really special victory for me and for the team.”</p>\n\n\n\n<p>It takes a level-headed athlete to face down a setback like that and get back on the startline the next day in the right frame of mind. To be calm enough to get into a breakaway and then win is even more impressive, but Campbell says there was never any stress on her part. “We were really relaxed,” she said. “We were still pretty confident. The staff, did what they had to do we did what we had to do and it environment was still good. So no one let it get to them mentally. And we just remained focused on our task and everything that we set out to do regardless of the obstacles that was in the way. So I think, yeah, that’s why we turned everything around. And just keep pressing on.” </p>\n\n\n\n<p>After Ardeche, Campbell had a last-minute call-up to the World Championships for Trinidad &amp; Tobago assisted by the UCI World Cycling Centre – where she spent two years of her career.</p>\n\n\n\n<p>“Worlds was pretty disappointing for me,” she said. “I was still pretty happy for the support I got from the World Cycling Centre, for them, always having my back even though I left there two years ago. To know that I always have the support from them it’s such a phenomenal feeling.” </p>\n\n\n\n<p>She said that on the day, however, “my body just wasn’t there. I really didn’t have the legs and I felt pretty empty. It just was a completely off day on the bike.” </p>\n\n\n\n<p>A week later, Campbell is gearing up for a new kind of challenge. The inaugural Paris-Roubaix Femmes looms.</p>\n\n\n\n<p>“I’m just excited,” she said of the race. “I mean, it’s going to be wet, it’s going to be cold, it’s going to be a chaotic race. I know it’s going to be a phenomenal atmosphere as well. So you just thrive off of that.</p>\n\n\n\n<p>“The big difference between Worlds and now is that I didn’t have a team around me so that that makes a huge difference as well. And yeah, I think I’ll be alright. I’m looking forward to the race.” </p>\n\n\n\n<p>Going into a race like Roubaix with too much of a plan can be a futile exercise, and so Campbell’s is simply to survive the beginning of the race where the worst cobbled sectors come.</p>\n\n\n\n<p>“I think everyone will have their opportunity,” she said. “It’s just about surviving that first appointment because the entire peloton is going to have that exact appointment. So we all know to expect that it’s just going to be chaos and a lot can happen there and maybe even the race can be made there.” </p>\n\n\n\n<p>For now, she is soaking up the atmosphere of being part of this moment in history.</p>\n\n\n\n<p>“It’s a surreal feeling to be honest,” she said. “It’s the first one of many and to even be here is pretty special. I know it’s just going to be a lively day on Saturday and it’s going to be epic. I mean probably our hands wouldn’t be too happy but I think we’re just gonna suck it [up] everything and absorb everything and just give it our all and more.” </p>\n\n\n\n<p>There’s no rest for Campbell after Roubaix. She will keep racing until Drenthe at the end of this month after a long season which started in February with Omloop Het Neiuwsblad and has included the Olympic Games. </p>\n\n\n\n<p>“It is actually my first full European season,” she said. “So yeah, it’s so a lot. But yeah, I also learned a lot and making my notes and absorbing my experience as well. I will take everything into next year as well as maybe also make some changes. I believe next year will be another step up for me and expect bigger things for myself as well. It will be even more exciting next year I think.” </p>\n\n\n\n<p>The 24-year-old will continue to ride for BikeExchange in 2022 and has her sights set on some big races: “Definitely still the classics. I really like them, I know it’s more suited to my characteristics,” she said, “So for sure, the Classics will be a huge target again, and that’s all I have for now. That’s the only thing on my mind right now. So far.”</p>\n\n\n\n<p>If she keeps progressing on the same path, there is no doubt that a result in a Classics race is within reach.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/teniel-campbell-on-paris-roubaix-im-just-excited/\">Read More</a>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bd1c0328c7eb66584bc63358548baca2c5bb1c2dea20f85f33e4399f70435117","category":"Cycling"}