{"title":"iOS 17 Launching Tomorrow for iPhones With These 10 New Features","link":"https://www.macrumors.com/2023/09/17/ios-17-launching-tomorrow-feature-list/","date":1694979300000,"content":"In June, Apple announced <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> with a wide range of new features and changes for the iPhone. Following over three months of beta testing, the free software update will be released this Monday, September 18 for the iPhone XS and newer.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-and-iPhones-Feature.jpg\" alt width=\"1372\" height=\"773\" />\r<br />\nBelow, we have recapped 10 key features coming to the iPhone with iOS 17, with <a href=\"https://www.macrumors.com/2023/09/13/ios-17-features-coming-later-this-year/\">additional features coming later this year</a>. The update should be released to users around 10 a.m. Pacific Time / 1 p.m. Eastern Time on Monday, and once it is available, it can be installed from the Settings app under General → Software Update.\r<br />\n\r<br />\n<h3>StandBy</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/StandBy-iOS-17.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nStandBy is a new full-screen view that provides glanceable information designed to be viewed from a distance when an iPhone is on its side and charging, according to Apple. The customizable interface can show a clock in various styles, a calendar, favorite photos, the weather forecast, music playback controls, widgets, and more.  \r<br />\n\r<br />\nStandBy is designed for an iPhone charging on a nightstand, kitchen counter, or desk, and it supports Live Activities, Siri, incoming calls, and larger notifications. The feature also works with the iPhone 14 Pro's always-on display.\r<br />\n\r<br />\n<h3>Contact Posters</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Contact-Posters-iOS-17.jpg\" alt width=\"2612\" height=\"1828\" />\r<br />\niOS 17 lets users create a personalized Contact Poster that appears during an incoming phone call on another person's iPhone. The poster can include a photo or Memoji, and the font and background color can also be customized. The feature is available in the built-in Phone app and will also be available for third-party calling apps.\r<br />\n\r<br />\n<h3>NameDrop</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/namedrop.jpg\" alt width=\"1600\" height=\"894\" />\r<br />\nNameDrop allows users to easily share contact information by bringing their iPhones close together. Both individuals can choose the specific phone numbers or email addresses they would like to share, and can also share their Contact Posters.\r<br />\n\r<br />\n<h3>Live Voicemail</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Live-Voicemail-iOS-17.jpg\" alt width=\"1306\" height=\"793\" />\r<br />\nLive Voicemail provides real-time transcription on the screen as someone leaves a voicemail. If the user considers the voicemail to be important, they can pick up the call while the caller is leaving their message. Apple says calls identified as spam by carriers are not transcribed and will instead be instantly declined.\r<br />\n\r<br />\n<h3>Swipe to Reply in iMessage</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iMessage-Swipe-to-Reply.jpg\" alt width=\"1330\" height=\"794\" />\r<br />\nIn the Messages app, users can now swipe to the right on any message to send an inline reply.\r<br />\n\r<br />\n<h3>Interactive Widgets</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Interactive-Widgets.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nInteractive widgets are now available on the iPhone across the Home Screen, Lock Screen, and the new StandBy view. Apple gave some examples of what interactive widgets can be used for, including marking a reminder as completed, playing or pausing a song or podcast, and controlling accessories in the Home app, and there will be many more possibilities as third-party apps are updated with support in the coming months.\r<br />\n\r<br />\nHome Screen widgets offered limited functionality until now, as Apple did not allow developers to include scrolling, buttons, or animations.\r<br />\n\r<br />\n<h3>Improved Autocorrect</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Autocorrect-Feature.jpg\" alt width=\"1080\" height=\"638\" />\r<br />\nApple says iOS 17 includes a state-of-the-art language model for word prediction that will greatly improve autocorrection on the iPhone. When typing, on-device machine learning will intelligently correct mistakes with greater accuracy than ever before. In addition, users will now receive predictive text recommendations inline as they type, allowing for words or complete sentences to be added by tapping the space bar.\r<br />\n\r<br />\nAutocorrection has an updated design on iOS 17 that briefly underlines an autocorrected word. Tapping on an underlined word reveals the original word typed, making it easy to quickly revert the change. The system will also learn the user's typing habits over time and avoid some corrections, which Apple's software engineering chief Craig Federighi said is designed for \"those moments where you just want to type a ducking word.\"\r<br />\n\r<br />\n<h3>Apple Maps Offline</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Maps-Offline.jpg\" alt width=\"1324\" height=\"956\" />\r<br />\nApple Maps is catching up on a key Google Maps feature on iOS 17 with the ability to download maps for offline use. Apple says users can download a specific map area and access turn-by-turn navigation, view their estimated time of arrival, find places, and more when an iPhone is not connected to a cellular or Wi-Fi network.\r<br />\n\r<br />\n<h3>Stickers Drawer</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Sticker-Drawer.jpg\" alt width=\"2770\" height=\"1628\" />\r<br />\nA new stickers drawer on iOS 17 provides access to all stickers, including Live Stickers, emoji, Memoji, and iMessage sticker packs in one place. Live Stickers can be created by touching and holding an object in a photo, such as a cat or a dog.\r<br />\n\r<br />\n<h3>\"Hey Siri\" Shortened to Siri</h3>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Hey-Siri-vs-Siri.jpeg\" alt width=\"1600\" height=\"894\" />\r<br />\nApple has simplified the voice command to invoke Siri on the iPhone and other Apple devices, including the iPad, Mac, HomePod, and newest AirPods Pro. Instead of \"Hey Siri,\" users are now simply able to say \"Siri\" to activate the voice assistant, and can issue multiple commands in succession without having to say \"Siri\" again.\r<br />\n\r<br />\nFor more features, read our in-depth <strong><a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17 roundup</a></strong>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/17/ios-17-launching-tomorrow-feature-list/\">iOS 17 Launching Tomorrow for iPhones With These 10 New Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-launching-tomorrow-for-iphones-with-these-10-new-features.2402541/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bd20af7bf7e54ab7358ed427faa24ef76cdb9353c5a5d4c2eb2681fae623bb95","category":"Apple"}