{"title":"Life goes on: Spatial heterogeneity promotes biodiversity in an urbanized coastal marine ecosystem","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17248?af=R","date":1712300400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5040b8c8-7268-4637-becf-6cdddf46adee/gcb17248-toc-0001-m.png\" alt=\"Life goes on: Spatial heterogeneity promotes biodiversity in an urbanized coastal marine ecosystem\" />\n<p>The rapid rate of coastal urbanization makes nearby marine ecosystems among the most profoundly impacted by pollution, resource exploitation and infrastructure development. Using COI metabarcoding, we found that, despite being near one of the largest megacities in the world, the Pearl River Delta is an area of high biodiversity. High-impact sites had fewer taxa and less genetic diversity than low-impact sites, but communities at high- and low-impact sites were almost entirely distinct in species composition, indicating that they held different reservoirs of regional biodiversity. Understanding how biodiversity is structured remains critical to its management and conservation.</p>\n<br />\n<h2>Abstract</h2>\n<p>Both human populations and marine biodiversity are concentrated along coastlines, with growing conservation interest in how these ecosystems can survive intense anthropogenic impacts. Tropical urban centres provide valuable research opportunities because these megacities are often adjacent to mega-diverse coral reef systems. The Pearl River Delta is a prime exemplar, as it encompasses one of the most densely populated and impacted regions in the world and is located just northwest of the Coral Triangle. However, the spatial and taxonomic complexity of this biodiversity, most of which is small, cryptic in habitat and poorly known, make comparative analyses challenging. We deployed standardized settlement structures at seven sites differing in the intensity of human impacts and used COI metabarcoding to characterize benthic biodiversity, with a focus on metazoans. We found a total of 7184 OTUs, with an average of 665 OTUs per sampling unit; these numbers exceed those observed in many previous studies using comparable methods, despite the location of our study in an urbanized environment. Beta diversity was also high, with 52% of the OTUs found at just one site. As expected, we found that the sites close to point sources of pollution had substantially lower diversity (44% less) relative to sites bathed in less polluted oceanic waters. However, the polluted sites contributed substantially to the total animal diversity of the region, with 25% of all OTUs occurring only within polluted sites. Further analysis of Arthropoda, Annelida and Mollusca showed that phylogenetic clustering within a site was common, suggesting that environmental filtering reduced biodiversity to a subset of lineages present within the region, a pattern that was most pronounced in polluted sites and for the Arthropoda. The water quality gradients surrounding the PRD highlight the unique role of in situ studies for understanding the impacts of complex urbanization pressures on biodiversity.</p>","author":"Shelby E. McIlroy, \nIsis Guibert, \nAnand Archana, \nWing Yi Haze Chung, \nJ. Emmett Duffy, \nRinaldi Gotama, \nJerome Hui, \nNancy Knowlton, \nMatthieu Leray, \nChris Meyer, \nGianni Panagiotou, \nGustav Paulay, \nBayden Russell, \nPhilip D. Thompson, \nDavid M. Baker","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"bd241b1adde73b150bec4e1d8a625263574fccc43e19dfc8907e42c906c6fc4f","category":"Environment"}