{"title":"Reduction of misdiagnosis in urinary tract infections during pregnancy: The role of adjusted urine flow cytometry parameters","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308253","date":1727100000000,"content":"<p>by Zhaojie Liu, Dan Liu, Guangming Su, Wei Yang</p>\r\nIntroduction <p>Urinary tract infections (UTIs) pose a significant health concern, particularly among pregnant women, for whom accurate diagnosis is essential. However, the use of Urine flow cytometry (UF) for detecting UTIs in this demographic often results in misdiagnosis. The objective of this study was to explore the reasons behind these diagnostic errors and to develop a strategy to minimize the rate of UTI misdiagnosis in pregnant women.</p> Material and methods <p>The study enrolled 1,200 women aged 18 to 40 years, categorized into pregnant and non-pregnant groups. UTIs were diagnosed using urine bacterial culture, microscopic examination, and UF, followed by statistical analysis to identify any discrepancies in diagnosis between the groups. Following the calibration of UF analyzer’s parameters, the most effective CR(WBC)-CW-FSC-P Gain setting for diagnosing UTIs in pregnant women through UF was ascertained by applying the Youden index.</p> Results <p>The clinical diagnosis rate of UTIs was significantly higher in pregnant women (40.91%) compared to non-pregnant women (20.26%). However, urine microscopy and bacterial culture showed no significant difference in the rates of UTIs between the two groups, suggesting a potential for misdiagnosis. The false-positive rate for WBCs detected by UF was 30.43%, and adjusting the CR(WBC)-CW-FSC-P Gain value of UF reduced the false-positive rate to 9.45%.</p> Conclusion <p>The incidence of UTIs in pregnant women may be overestimated because of the limitations inherent to UF. Adjusting the parameters of the UF analyzer, particularly the CR(WBC)-CW-FSC-P Gain value, can significantly reduce the rate of UTI misdiagnosis in pregnant women.</p>","author":"Zhaojie Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bd266fc6f785145d4b780bd2266aaf243d3865b35843c1ca3a93e06bb19716a2","category":"Interdisciplinary"}