{"title":"Exploring the Relationship Between Dangerous Driving Practices and Traffic Accidents in Pakistan","link":"https://www.preprints.org/manuscript/202403.0966/v1","date":1710752558000,"content":"The increasing growth in road users who are unfamiliar with traffic rules and regulations provides a serious safety problem for Pakistani traffic conditions. This study has two main objectives. First, it seeks to validate the reliability and applicability of the Dula Dangerous Driving Index (DDDI) in Pakistan. Second, it intends to investigate the effects of DDDI, sociodemographic characteristics, seat belt use, and driving training on the occurrence of traffic accidents.\nA total of 623 Pakistani individuals completed a questionnaire as part of this study. The questionnaire consists of items related to dangerous driving behaviors, sociodemographic characteristics, seat belt use, driving instruction, and accident involvement. The DDDI's accuracy was evaluated by comparing it to self-reported traffic incidents and seat belt compliance. To discover predictors within the DDDI dimensions, generalized linear models were used. A binary logistic regression analysis was also performed to evaluate the factors that influence traffic accidents. DDDI dimensions, demographic characteristics, seat belt usage, and driving training were all considered in this study.\nThe use of seat belts while driving reduced the likelihood of an accident by 25%. On the other hand, aggressive driving and risky driving increased the chances of getting involved in traffic accidents by 36%% and 20%. Furthermore, the chances of being involved in a traffic accident decreased by 21% as the drivers age increased. The results also illustrate that Pakistani drivers are more aggressive and risk taker compared to Chinese drivers who are more disciplined. This study suggests that lack of comprehensive and standardized driving training and education programs, in consistent enforcement of traffic laws, the quality of road infrastructure and lack of public awareness campaigns can be attributed to adverse road safety situations in country.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd3a2be31573cec2632c386b6a482fbf857aa228f5203139dd3481f3ddb0f819","category":"Interdisciplinary"}