{"title":"Convolutional neural network allows amylose content prediction in yam (Dioscorea alata L.) flour using near infrared spectroscopy","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12825?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Yam (<i>Dioscorea alata</i> L.) is the staple food of many populations in the intertropical zone, where it is grown. The lack of phenotyping methods for tuber quality has hindered the adoption of new genotypes from breeding programs. Recently, near-infrared spectroscopy (NIRS) has been used as a reliable tool to characterize the chemical composition of the yam tuber. However, it failed to predict the amylose content, although this trait is strongly involved in the quality of the product.</p>\n<h2>Results</h2>\n<p>This study used NIRS to predict the amylose content from 186 yam flour samples. Two calibration methods were developed and validated on an independent dataset: partial least squares (PLS) and convolutional neural networks (CNN). To evaluate final model performances, the coefficient of determination (<i>R</i>\n<sup>2</sup>), the root mean square error (RMSE), and the ratio of performance to deviation (RPD) were calculated using predictions on an independent validation dataset. The tested models showed contrasting performances (i.e., <i>R</i>\n<sup>2</sup> of 0.72 and 0.89, RMSE of 1.33 and 0.81, RPD of 2.13 and 3.49 respectively, for the PLS and the CNN model).</p>\n<h2>Conclusion</h2>\n<p>According to the quality standard for NIRS model prediction used in food science, the PLS method proved unsuccessful (RPD &lt; 3 and <i>R</i>\n<sup>2</sup> &lt; 0.8) for predicting amylose content from yam flour but the CNN model proved to be reliable and efficient method. With the application of deep learning methods, this study established the proof of concept that amylose content, a key driver of yam textural quality and acceptance, can be predicted accurately using NIRS as a high throughput phenotyping method. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Mahugnon Ezékiel Houngbo, \nLucienne Desfontaines, \nJean‐Louis Diman, \nGemma Arnau, \nChristian Mestres, \nFabrice Davrieux, \nLauriane Rouan, \nGrégory Beurier, \nCarine Marie‐Magdeleine, \nKarima Meghar, \nEmmanuel Oladeji Alamu, \nBolanle O Otegbayo, \nDenis Cornet","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bd43268a9bf274e2fcd4b90855fc3cd831ce681cafb4fe3f95ba9e1c449e3a8b","category":"Environment"}