{"title":"Restaurant staff’s knowledge, practices, and attitudes pertaining to food allergy in Qassim region, Saudi Arabia: A cross-sectional analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311650","date":1729692000000,"content":"<p>by Ghadi A. Alkhalaf, Norah A. Aljuaylan, Jolan S. Alsaud, Boshra A. Aljokaidb, Fatima R. Aljalaood</p>\r\n\r\nFood allergies, often triggered by minute amounts of certain foods, affect people of all ages and frequently occur in dining-out settings. Previous research in Saudi Arabia has not investigated the extent of restaurant workers’ knowledge of food allergies and their role in protecting patrons from allergic reactions. This descriptive study assessed the knowledge, attitudes, and practices of restaurant staff regarding food allergies in Qassim, Saudi Arabia between January and March 2023. Interviews and observations were conducted in four stages, and data were analyzed using the Environmental Health Specialists Network Food Allergen Study Protocol. Results showed that most restaurant staff had limited knowledge of food allergens and their symptoms, and a small proportion had received specific training on food allergies. Moreover, only 14% of restaurants provided allergen information on their menus. Despite these knowledge gaps, most staff exhibited positive attitudes toward managing food allergies. Findings also indicated that factors such as experience, training, and restaurant policies were associated with higher levels of knowledge and more positive attitudes. These results highlight the urgent need for the restaurant sector to implement food allergy measures, including clear policies and comprehensive training, to prevent potentially life-threatening incidents.","author":"Ghadi A. Alkhalaf","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bd44435f3ee0664633a5e9e8443a0bce0973a087b319dea18676b32b1086b4e6","category":"Interdisciplinary"}