{"title":"Burden and bacterial etiology of neonatal meningitis at Hawassa University Comprehensive Specialized Hospital, Hawassa, Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308523","date":1723212000000,"content":"<p>by Musa Mohammed Ali</p>\r\nBackground <p>Meningitis poses a significant challenge to public health in low-income nations, such as Ethiopia, with a particular impact on newborns. The magnitude and etiologies of meningitis vary based on geographic location and age of patients. There is limited data regarding the magnitude and etiology of meningitis from Sidama Regional State, Ethiopia. This study aimed to determine the magnitude and bacterial profile of meningitis among newborns aged less than 90 days at Hawassa University Comprehensive Specialized Hospital (HUCSH).</p> Methods <p>A retrospective cross-sectional study was conducted among newborns under 90 days who were suspected of meningitis at HUCSH from January 2019 to July 2023, and for whom Cerebrospinal fluid (CSF) culture was performed. At HUCSH, bacteria are isolated and identified using standard microbiological techniques. Socio-demographic characteristics and culture results were extracted from the laboratory register. Data were entered into Excel and exported it to SPSS version 20 for analysis.</p> Results <p>Overall 1061 newborns suspected of meningitis were included in the study. Among the participants, 767 individuals (72.3%) fell within the age range of 8 to 90 days. Of the total participants, 437 (41.2%) were females. The magnitude of culture-confirmed meningitis was 90(8.5%) 95% CI: 6.8%−10.1%. The magnitude of culture-confirmed meningitis among newborns aged 0−7 days and 8−90 days were 1.6% and 6.9% respectively. The proportion of bacteria among newborns aged 0−7 days and 8−90 days were 18.9% and 81.1% respectively. Coagulase-negative Staphylococci (CONS) were the most common bacteria (n = 26; 28.9%) recovered followed by <i>Acinetobacter</i> species (n = 12, 13.3%), <i>Escherichia coli</i> (n = 9; 10%), and <i>Klebsiella pneumoniae</i> (n = 7; 7.8%). <i>K</i>. <i>pneumoniae</i> was the predominant bacteria among newborns within the age group of 0 to 7 days while <i>Acinetobacter</i> species was the most common among newborns within the 8 to 90 days age group. The prevalence of culture-confirmed neonatal meningitis was found to be greater in male newborns (<i>x</i><sup>2</sup> = 1.74, <i>p</i> = 0.18), newborns aged between 8 to 90 days (<i>x</i><sup>2</sup> = 0.07, <i>p</i> = 3.4), and newborns admitted in 2022 (<i>x</i><sup>2</sup> = 2.4, <i>p</i> = 0.66),</p> Conclusions <p>In this study, the overall magnitude of culture-confirmed meningitis was relatively high. Culture-confirmed meningitis was high in newborns within the age range of 8 to 90 days. The most common bacteria were CONS in both age groups followed by <i>Acinetobacter</i> species, <i>E</i>. <i>coli</i>, and <i>K</i>. <i>pneumoniae</i>.</p>","author":"Musa Mohammed Ali","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bd443a6f9078e69329e0671f7996dc0370084790b78cd9015e3635120aa0938b","category":"Interdisciplinary"}