{"title":"Apple’s hot new fall color might be ‘dark’ titanium","link":"https://www.macworld.com/article/2013734/apple-watch-ultra-2-iphone-15-pro-dark-titanium.html","date":1690820783000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When the Apple Watch Ultra 2 arrives this fall, it will likely have a similar look to the original model, with a 49mm flat display, rugged enclosure, and Action button. However, a new rumor claims that Apple may be adding a new color option that will make it instantly recognizable as a second-gen model.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-07-30/apple-iphone-15-pro-features-usb-c-port-new-design-thinner-bezels-lkpemg29&amp;xcust=1-1-2013734-1-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman’s latest Power On newsletter</a>, Apple will release a second-gen Apple Watch Ultra this fall with a new chip that will bring “a fairly sizable performance bump.” But even more exciting is a new “dark titanium color option,” which Gurman claims was tested before the launch of the original model. Apple’s designers scrapped the color last year because they “didn’t like the appearance,” but it could arrive this year.</p>\n\n\n\n<p>While Gurman isn’t certain of the new “dark” option–he called it “theoretical” due to the issues last year–Apple almost always introduces a new color with each new Apple Watch generation. So if it’s not “dark” titanium, Apple is almost certain to release some new color to entice buyers and differentiate it from the prior generation.</p>\n\n\n\n<p>It’s not clear whether the iPhone 15 Pro, which is also expected to have new titanium edges, will adopt a similar color palette. Apple generally has four colors for the iPhone 15 Pro–the iPhone 14 Pro is available in Space Black, Silver, Gold, and Deep Purple—and rumors claim the new titanium iPhone will still have a frosted glass back in several shades. We wouldn’t say no to “dark” titanium sides.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bd4b35ad167786167d6f6e28f638544b55764fb1ef2158ea89411ab1fbd06d53","category":"Apple"}