{"title":"Assessment of Earthquake Damage and Economic Recovery in Hatay Province, Turkey Using Nighttime Light Data","link":"https://www.preprints.org/manuscript/202407.1060/v1","date":1720785027000,"content":"The catastrophic twin earthquakes that struck southern Turkey and northern Syria on February 6 2023, caused massive casualties and extensive damage to infrastructure, with the province of Hatay bearing the brunt of the impact. To investigate the potential of nighttime light (NTL) data for earthquake disaster assessment, we performed an analysis of pre- and post-earthquake NPP-VIIRS and SDGSAT-1 NTL data. The NTL change ratio (NCR) was employed to identify the extent of damage in Hatay Province following the earthquake to assess the impact on affected buildings and populations. NPP-VIIRS daily NTL Time-series data was used to establish an economic recovery framework for earthquake disasters in Hatay Province, assessing regional economic recovery after earthquake. The results revealed a strong correlation between the total reduced NTLs of NPP-VIIRS and SDGSAT-1 and the presence of severely and moderately damaged buildings. Conversely, the correlation with slightly damaged buildings was relatively weaker. Furthermore, the reduced NTLs of NPP-VIIRS provide a more precise identification of all earthquake damage compared to the SDGSAT-1 data, achieving an overall accuracy of 86.21% in earthquake damage identification and a Kappa coefficient of 0.72. In accordance with the earthquake economic recovery framework, as of the end of March 2024, neither the provincial economy nor any of its districts have fully restored to their pre-earthquake levels. The findings offered new and valuable insights into earthquake disaster assessment, assisting decision-makers in accurately assessing the level of disaster risk following an earthquake and efficiently allocating post-earthquake relief funds.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd4c97308674343ff94018cada1ad41d66abdac4d6463c3d8c02daf66a28f521","category":"Interdisciplinary"}