{"title":"Association Between the Korean Healthy Diet Score and Metabolic Syndrome: Effectiveness and Optimal Cutoff of the Korean Healthy Diet Score","link":"https://www.preprints.org/manuscript/202409.1532/v1","date":1726742630000,"content":"Objectives: Although the prevalence of metabolic syndrome (MetS) has increased among Koreans, the specific health benefits of the Korean Healthy Diet (KHD) score remain unexplored. This study aimed to evaluate the association between the KHD score and MetS, and to identify the optimal cutoff of the KHD score for reducing MetS prevalence. Methods: This cross-sectional study used data from 11,403 participants of the 7th and 8th Korea National Health and Nutrition Examination Survey. The KHD score was calculated based on adherence to 13 dietary components. Logistic regression analysis was used to determine the association between the KHD score and MetS, and to identify the optimal cutoff values for the KHD score. Results: The average KHD score was significantly lower in participants with MetS than in those without MetS (5.03 vs. 5.14, p=0.016). A one- and two-point increase in the KHD score was associated with reduction in MetS prevalence (one-point, odds ratio [OR]: 0.95, 95% confidence interval [CI]: 0.91–0.98; two-point, OR: 0.90, 95% CI: 0.84–0.97). The optimal cutoff for the KHD score was identified as &amp;gt;7 points, which was related to lower odds of MetS (OR: 0.78, 95% CI: 0.65–0.93) compared to 1–4 points, particularly with hypertriglyceridemia (OR: 0.80, 95% CI: 0.69–0.94) and low high-density lipoprotein cholesterol (OR: 0.85, 95% CI: 0.74–0.98). Conclusions: The KHD score was inversely associated with MetS prevalence, and the identified optimal cutoff values can serve as a practical tool for public health interventions aimed at reducing the risk of MetS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd590e422b8d773a0e7ffd02ed3137adc947d722cf87ca132ae9fed63eb31e5e","category":"Interdisciplinary"}