{"title":"Determining Flood Risk Levels and Estimating Return Period of Lake Nokoue Basin Using Probabilisty Distribution Models","link":"https://www.preprints.org/manuscript/202410.1634/v1","date":1729523495000,"content":"The evolution and acceleration of the effects of climate change on the water cycle demand adaptation and mitigation plans. Consequently, the implementation of public policies (management, governance, and strategy) regarding flood risk management or prevention (such as levee heights and spillway dimensions of dams) is based on the characterization of flood hazards. This requires understanding extreme climate phenomena and conducting a rigorous probabilistic analysis of hydrometric data. This study aims to estimate the flood quantiles for lake Nokoue. To achieve this, the adopted methodology involved fitting the Generalized Extreme Value (GEV) distribution, the Gumbel distribution, and the Generalized Pareto (GPA) distribution to the annual maximum water levels of lake Nokoue from 2015 to 2022. We estimated experimental probabilities using the Weibull formula. The assessment of the fit quality of the theoretical probability distributions to our data sample indicated that the Gumbel distribution was the most suitable, with a root mean square error (RMSE) of 0.0724, compared to 0.0754 and 0.0761 for the GEV and GPA distributions, respectively. The position and scale parameters (φ; α) of the Gumbel distribution were estimated to be 3.802 and 0.249, respectively. This allows for the calculation of the probability of an extreme water level occurring within a return period in a single day. Thus, the extreme water levels (flood quantiles) associated with return periods of 10, 50, and 100 years, as determined by the Gumbel distribution, are 4.36m, 4.77m, and 4.95m, respectively. These values are of crucial importance for the design of flood prevention structures (infrastructure) intended to mitigate flood risk.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd69bfc166296391626c052171d578c6e32980293a87808706ec7bfb651719f8","category":"Interdisciplinary"}