{"title":"Real‐time PCR‐based quantitative microbiome profiling elucidates the microbial dynamic succession in backslopping fermentation of Taiwanese pickled cabbage","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13688?af=R","date":1719311709000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Microbiota succession determines the flavor and quality of fermented foods. Quantitative PCR-based quantitative microbiome profiling (QMP) has been applied broadly for microbial analysis from absolute abundance perspectives, transforming microbiota ratios into counts by normalizing 16S ribosomal RNA (16S rRNA) gene sequencing data with gene copies quantified by quantitative PCR. However, the application of QMP in fermented foods is still limited.</p>\n<h2>RESULTS</h2>\n<p>QMP elucidated microbial succession of Taiwanese pickled cabbage. In the spontaneous first-round fermentation (FR), the 16S rRNA gene copies of total bacteria increased from 6.1 to 10 log copies mL<sup>−1</sup>. The dominant lactic acid bacteria genera were successively <i>Lactococcus</i>, <i>Leuconostoc</i> and <i>Lactiplantibacillus</i>. Despite the decrease in the proportion of <i>Lactococcus</i> during the succession, the absolute abundance of <i>Lactococcus</i> still increased. In the backslopping second-round fermentation (SR), the total bacteria 16S rRNA gene copies increased from 7.6 to 9.9 log copies mL<sup>−1</sup>. The addition of backslopping starter and vinegar rapidly led to a homogenous microbial community dominated by <i>Lactiplantibacillus</i>. The proportion of <i>Lactiplantibacillus</i> remained consistently around 90% during SR, whereas its absolute abundance exhibited a continuous increase. In SR without vinegar, <i>Leuconostoc</i> consistently dominated the fermentation.</p>\n<h2>CONCLUSION</h2>\n<p>The present study highlights that compositional analysis would misinterpret microbial dynamics, whereas QMP reflected the real succession profiles and unveiled the essential role of vinegar in promoting <i>Lactiplantibacillus</i> dominance in backslopping fermentation of Taiwanese pickled cabbage. Quantitative microbiome profiling (QMP) was found to be a more promising approach for the detailed observation of microbiome succession in food fermentation compared to compositional analysis. © 2024 Society of Chemical Industry.</p>","author":"You‐Yun Hu, \nI‐Hsuan Lo, \nJhih‐Ting Hsiao, \nFuu Sheu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bd703b10531289109c8f6b6ba8adaa8b3482be7c96841bff987e5196099eb075","category":"Environment"}