{"title":"Risk of Hepatitis B Virus Reactivation in COVID-19 Patients Receiving Immunosuppressive Treatment &ndash; Prospective Study","link":"https://www.preprints.org/manuscript/202409.1173/v1","date":1726542544000,"content":"Objectives: This study aimed to evaluate the risk of hepatitis B virus reactivation (HBVr) in COVID-19 patients receiving immunosuppressive treatment, which has been insufficiently studied to date. Secondarily, we aimed to evaluate the seroprevalence of HBV infection in COVID-19 patients. Methods: We performed an HBV screening in all Romanian adults hospitalized in 4 COVID-19 wards between October 2021 and September 2022. We enrolled patients with positive hepatitis B core antibody (anti-HBc) without protective hepatitis B surface antibody (anti-HBs), HBV treatment or immunosuppressive conditions, whom we followed virologically at 3 months. Results: We identified 333/835 (39.9%) anti-HBc-positive patients. Follow-up was performed in 13 patients with positive hepatitis B surface antigen (HbsAg) and 19 HBsAg-negative/anti-HBc-positive patients. Among those who received immunosuppressants, 4/23 (17.4%) patients experienced HBVr: 1 out of 8 (12.5%) HBsAg-positive patients (with 1.99 log increase in HBV DNA level) and 3 out of 15 (20%) HBsAg-negative/anti-HBc-positive patients (with de novo detectable HBV DNA level). Conclusions: Administration of COVID-19 immunosuppressants may result in a significant risk of HBVr in co-infected patients. We recommend performing an HBV triple screen panel (HBsAg, anti-HBs, anti-HBc) in all COVID-19 patients receiving immunosuppressive treatment. HBV prophylaxis may be indicated in certain patients. Larger studies are needed in order to establish an appropriate and cost-effective management in these patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd77c0c86d07d3b5c42fae1f54abd1988c6e648f6d049256179de154a5f671ce","category":"Interdisciplinary"}