{"title":"Amazon ใช้ AI วิเคราะห์คลังสินค้าและเส้นทาง เพื่อส่งสินค้าได้เร็วขึ้น","link":"https://www.blognone.com/node/133840","date":1684152954000,"content":"<div><div><div><p>Stefano Perego รองประธานบริหารในส่วนของคลังสินค้าและบริการ OPS ที่ดูแลลูกค้าในพื้นที่อเมริกาเหนือและยุโรปของ Amazon ได้พูดถึงการที่บริษัทใช้ AI เข้ามาช่วยในการส่งสินค้า</p>\n<p>Perego ได้พูดถึงการทำงานมี 2 ด้าน คือ ด้านแรกเกี่ยวกับการขนส่ง เช่น การทำแผนที่และวางแผนเส้นทางโดยคำนึงถึงปัจจัยภายนอกอย่าง สภาพอากาศ ส่วนอีกด้านคือ ช่วยให้ลูกค้าค้นหาสินค้าใน Amazon ที่ต้องการได้ง่ายขึ้น</p>\n<p>แต่ในตอนนี้ทางบริษัทเน้นการใช้ AI เข้ามาช่วยในการระบุตำแหน่งเพื่อวางสินค้าคงคลัง เพราะจะสามารถลดต้นทุนได้ เนื่องจากปัญหาการวางสินค้าคงคลังค่อนข้างซับซ้อน เพราะต้องเลือกคลังที่สามารถลดระยะทาง เพื่อให้การจัดส่งสินค้าถึงมือลูกค้าได้เร็วมากขึ้น</p>\n<p>Amazon เรียกสิ่งนี้ว่า “regionalization” ให้ส่งสินค้าถึงลูกค้าจากคลังที่ใกล้ที่สุด แทนที่จะส่งจากคลังอื่นในประเทศ ซึ่งการทำแบบนี้ต้องใช้เทคโนโลยีเข้ามาวิเคราะห์ข้อมูลเพื่อคาดการณ์ความต้องการของสินค้าในแต่ละพื้นท่ี</p>\n<p>และหากมีสินค้าอยู่ในคลังสินค้าใกล้กับลูกค้า ทาง Amazon ก็สามารถจัดส่งถึงลูกค้าได้ภายใน 1-2 วัน เช่นเดียวกับการสมัครสมาชิก Prime และในรายงานของ Amazon บอกว่าตอนนี้มีสินค้าที่ถูกส่งมาจากคลังสินค้าที่อยู่ใกล้กับพื้นที่ของลูกค้ามากกว่า 74% แล้ว</p>\n<p>นอกจากนี้ Amazon ยังนำหุ่นยนต์เข้ามาช่วยในงานซ้ำซ้อน เช่น การยกของ และทางบริษัทยังบอกอีกว่า 75% ของออเดอร์ที่ลูกค้าสั่งถูกจัดการโดยหุ่นยนต์</p>\n<p>Perego  ได้ให้ความเห็นถึงเรื่องการทำงานของหุ่นยนต์และ AI ว่า ควรต้องมีการเปลี่ยนแปลงด้านการทำงานมากกว่าการไล่ออก เช่น งานที่พนักงานจะได้ทำในส่วนของคลังสินค้า ควรจะเป็นงานที่ต้องใช้การคิดหรือวิจารณญาณมากขึ้น ส่วนงานต้องทำซ้ำซากก็จะเป็นหน้าที่ของหุ่นยนต์ทำแทน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2fccb3d356ce80c80b12e749ab3818f1.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.cnbc.com/2023/05/15/amazon-is-focusing-on-using-ai-to-get-stuff-delivered-to-you-faster.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/robot\">Robot</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bd7ca10599582f617e18993ea8b0b058a1027949e58d344fcadf422a2b715acc","category":"Thai"}