{"title":"Redemption, rivalries and the long goodbye: The best moments from the 2023 men’s cycling season","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/redemption-rivalries-and-the-long-goodbye-the-best-moments-from-the-2023-men-s-cycling-season","date":1702038802000,"content":"\n      <p><span>It’s fair to say that 2023 has been a year to remember for cycling fans. While proceedings might have been dominated by a certain team that wears yellow and black kit, this certainly hasn’t led to boring or predictable racing. In fact, in some cases it’s been quite the opposite: think of the inter-team rivalry that set the cycling storm alight during the 2023 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, for example.</span></p>\n<div></div>\n<div></div>\n<p><span>Of course, it’s not always all about winning, either. This year has seen the peloton wave goodbye to some of its most loved and enigmatic stars, namely the likes of Thibaut Pinot and Peter Sagan. Such retirements have poignantly signified the end of an era, and many shed a tear when Pinot climbed off his bike at the end of Il Lombardia a few months ago. It’s not just riders saying their farewells to the sport that have made 2023 an emotional season, either. The tragic passing of Gino  <span>Mäder</span> at the Tour de Suisse shook the cycling world and led to some of the most meaningful and moving tributes from his friends at Bahrain-Victorious.</span></p>\n<p><span>From old teammates rekindling bonds, to spectacular blow ups and equally spectacular victories, these are our top moments from the 2023 men’s cycling season.</span></p>\n<h3>Brothers in arms</h3>\n<p><span>Was there anyone who didn’t get a warm, fuzzy feeling watching the final stage of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> this year? It was the fairytale ending that many had dreamed of: a stage win for Mark Cavendish – everyone’s favourite, hot-headed, outspoken, scrappy little sprinter who had been coming close for weeks on end – on the romantic streets of Rome. That alone would have been enough, but, in a selfless act of friendship, Cavendish was helped to victory by Geraint Thomas. Despite both riders competing on different teams, Thomas – who had narrowly missed out on the overall race win to Primož Roglič the day before – put in a strong pull for Cavendish in the closing kilometres of the stage to help him cross the line first. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-SWpix-Giro-2983_1024x1024.jpg?v=1701951431\" /><em>Image: Zac Williams/SWpix</em></span></p>\n<p><span>It was a flashback to the halcyon days of a dominant Team Sky, in an era which was filled with success for British cyclists. “I’d kind of said jokingly, ‘Fancy doing a lead out?’ Then he just shouted: ‘Cav!’ and did it,” Cavendish explained after the stage. “He’s so special and one of my best friends over the years. We saw yesterday with what he said, how upbeat and ever optimistic he is, despite losing the </span><i><span>maglia rosa</span></i><span>. That’s him down to a treat, it’s how he’s always been. He always sees a glass half full. That’s why he’s special. More than a great bike rider, he’s a f*cking good person and a friend.”</span></p>\n<p><span>Thomas himself added that he wanted to “help a brother out” after seeing that Cavendish was light on Astana teammates to navigate through the final kilometre. The Welshman’s actions were special because they transcended jerseys or sponsors – it was a representation of enduring friendship in a sport which can so often cause rifts and conflicts. The images of Cavendish and Thomas hugging after the stage are representative of how powerful cycling is when it comes to bringing people together – anyone need a tissue?</span></p>\n<h3>Trident tested</h3>\n<p><span>Dual-leadership at Grand Tours is one thing, but a three-way battle to be your team’s protected GC leader? It’s a tricky situation to navigate, something that was made abundantly clear by Jumbo-Visma in this year’s edition of the Vuelta a España. Stage 17 of the race was one of the most controversial in recent memory, causing uproar on social media and even leading to the ‘GC Kuss’ hashtag trending on X (Twitter) after Primož Roglič and Jonas Vingegaard neglected to wait for red jersey wearer, Kuss, on the final climb of the day.</span></p>\n<p><span>Some argued that it was right for the road to decide that Kuss wasn’t strong enough to win the race, there should be no gifts in bike racing, after all. Others said that Kuss deserved the win after all of the work he’s done as a loyal domestique for Jumbo-Visma over the years. There were comments that attacking your own teammate should never be accepted, regardless of the situation. The sentiment on social media seemed as fragmented and murky as it did within the team itself, with each rider giving differing accounts of the instructions and decisions from the team car that day.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-168061jumbogiro1653_1024x1024.jpg?v=1701951311\" /><em>Image: Getty</em></span></p>\n<p><span>Everything was put to rest on stage 18, however, when Roglič and Vingegaard put aside their personal ambitions to fully support Kuss to win the red jersey. Kuss sat in the wheels that day, resplendent in red behind his two newly-loyal worker bees as they checked over their shoulders to see if he was still there. Vingegaard tapped away on the front in a steady rhythm that his American colleague could sustain.  As the finish line came into view, Kuss sprinted hard and ended up ahead of both of his teammates at the end of the stage. Vingegaard even dropped back from the group on the approach to the line, seemingly so he could purposefully lose seconds and avoid any risk of him closing the gap to Kuss on the general classification.</span></p>\n<p><span>Kuss went home with the Vuelta victory in the end, but not without consequences for his team. Roglič will race for Bora-Hansgrohe next season, a move which is widely believed to have been fuelled by the conflict at the Vuelta a España. As for next season, will we see more #GCKuss? Or is it time for him to head back to his domestique duties?</span></p>\n<h3>Gee wizz</h3>\n<p><span>Derek Gee finished in second place on four stages of this year’s Giro d’Italia. He was also second in both the mountains and the points classification, and he finished 22nd on the general classification. If you’re a believer in angel numbers, then so many twos have to mean something: two can be linked to balance, harmony, love and is a positive sign of things to come. Whether the spiritual meaning rings true or not, it certainly doesn’t take a look into a crystal ball to see that Gee’s performances this season have announced him as a rider with a very bright future. Some people even renamed this year’s Giro the Gee-ro in his honour.</span></p>\n<p><span>Despite not taking any stage wins in the end, it was Gee’s name that was trending on Twitter when the race concluded. From a relatively unknown rider at the start of the race, he became one of the Giro’s key protagonists, loved and respected by many for his boundless enthusiasm and zeal in the face of foul weather and tough mountains. People wanted Gee for interviews, for photos, for autographs. Articles were written, posts were published in admiration. Cycling loves an underdog story, and Gee gave us that in bountiful quantities.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--GEE-MOUNTAINGiro-d_Italia-2023---Stage-19-01902_1024x1024.jpg?v=1701951180\" /><em>Image: Zac Williams/SWpix</em></span></p>\n<p><span>His performances were especially impressive for their variety: weighing 75kg, Gee – who comes from track racing originally – still was able to climb with some of the very best in the mountains, as well as pull hard turns on the flat roads. Speaking to <em>Rouleur</em> after the race, he said: I don't have those numbers to be up there with the best climbers when everyone's fresh. I think it was just a case of we're really far into the race. It's been raining for two weeks. Everyone's pretty rundown and I think I just recovered really well. That's why I was able to perform in the mountains when maybe, physiologically, it didn't make a lot of sense.”</span></p>\n<p><span>Nonsensical or not, Gee’s Giro was a highlight of the season, he provided entertainment by getting in the breakaway for days on end – and that stage win isn’t far off.</span></p>\n<h3>“For Gino and the team”</h3>\n<p><span>The 2023 Tour de France was always going to be an emotional, meaningful one for Team Bahrain-Victorious. Gino Mäder died after a crash at the Tour de Suisse just two weeks before the Tour got underway in Bilbao at just 26. His team, distraught and devastated by his loss, came to the Tour on a mission to ride in his memory. It seemed as if all the emotion from the past months culminated in Matej Mohorič's stage 18 victory in which he beat Ben O’Connor and Kasper Asgreen in a three-man sprint to the finish line.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01065mohoriccry-_1_1024x1024.jpg?v=1701951240\" /></span><span><em>Image: Zac Williams/SWpix</em></span></p>\n<p><span>Normally,  <span>Mohorič</span> wouldn’t be who you’d bet on in a sprint against Asgreen, the Danish rider who beat Mathieu van der Poel in a head-to-head finish at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> two years ago. The Bahrain-Victorious rider said it himself after the race: “If I did a sprint with Kasper in training 100 times, I would lose all 100 times.” But that day, he won, spurred on by the power of Gino.</span></p>\n<p><span>It was  <span>Mohorič's</span> post-race interview that will go down in cycling history as one of the most poignant and articulate representations of the intricacies and difficulties that come with life as a professional cyclist, even one who has just won the bike race. “It can change your life, a Tour de France win,” he said. “We’ve been through hard times with everything that’s happened, I’m just super proud and happy.”</span></p>\n<p><span>“You do it for yourself, for your dreams, and for people to enjoy the spectacle,” he said. “At the end of the day it’s just a game, we play, we try to beat each other, sometimes there is pain, [but] we push ourselves. We want this, we enjoy it. I couldn’t give up. I wanted to do my best for him, because he can’t anymore. Gino gives us that extra bit of motivation.”</span></p>\n<h3>Au Revoir, Pinot</h3>\n<p><span>There’s never been a rider quite like Thibaut Pinot, and there’s never been a fan club like the Pinot Ultras, either. The videos and photos that emerged from Il Lombardia this year – the Frenchman’s final race of his career – showed crowds dressed in T-shirts adorned with his name on them, throwing flares and cheering wildly as Pinot eventually passed through, unable to even continue riding as the road was blocked with people. These fans were a physical representation of the Pinot fever that has swept through the sport in recent years: he’s cycling’s lovable, honest, anti-hero.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1769_1024x1024.jpg?v=1701951534\" /></span><em><span>Image: Alex Whitehead/SWpix</span></em></p>\n<p><span>Pinot retired at the end of this season and waved goodbye to a sport which hasn’t always been kind to him. While the 33-year-old might have had his fair share of success, Pinot’s talent has always felt, to the frustration of many around him, unfulfilled. It’s not through lack of trying, and that’s a big part of what makes Pinot so easy to love – he tried painstakingly, eye-wateringly hard, yet he so often failed. It wasn’t always due to his physical strength that Pinot didn’t win more, often his emotions clouded his tactical judgements – Pinot simply could not switch into the robotic, killer mindset that befits some of the sport’s biggest stars. Instead, he wore his heart on his sleeve, giving fans a rare window into the sportsman behind the person and glasses, the guy who loves his farm and his goats, and just wants to ride his bike.</span></p>\n<p><span>A typical Pinot image that will stick in the minds of many from this season is from the Giro d’Italia this year, when he’d fought all the way up the Crans Montana climb on stage 13 of the race, repeatedly getting angry with his breakaway companions for not sharing enough of the workload. When the Groupama–FDJ rider eventually finished in second place, he collapsed over the handlebars of his bike at the top of the mountain and his shoulders convulsed as he cried. Though his helmet covered his face from the cameras, his body language showed enough heartbreak for us all to feel it even through our television screens. And that’s why we’ll all miss Thibaut Pinot, because he makes us feel.</span></p>\n<h3>Human after all</h3>\n<p><span>“I’m gone, I’m dead,” were the words that two-time <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> winner Tadej Pogačar shouted down his team radio midway through stage 17 of the 2023 Tour. It’s four words that no one has ever expected to hear from Pogačar since he stormed into the WorldTour and announced himself as a generational talent who seemed almost inhuman. When the UAE Team Emirates rider spoke those words into the tiny microphone attached to his jersey, he was no longer the unbeatable, unflappable Tadej Pogačar, but instead he became the 25-year-old man whose parents were waiting for him at the top of the Col de la Loze, ready to comfort their disappointed and beaten up son.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-08637-pog-cry_1024x1024.jpg?v=1701951115\" /><em>Image: Zac Williams/SWpix</em></span></p>\n<p><span>For Pogačar, it’s a day he will most likely want to forget, one that saw his dreams of a third yellow jersey disappear right in front of his eyes. With hindsight, however, it remains one of the most important moments in the young rider’s career so far. The way Pogačar reacted to such a huge loss was admirable: he was honest, sportsmanlike and, not once, did he consider giving up. In fact, just a few days later, when he seemed to regain some strength and begin to look like his usual self on the bike, Pogačar took a stunning win on stage 20 to Le Markstein. It didn’t win him the yellow jersey, but it was an important lesson in perseverance and determination, one that we all can learn from.</span></p>\n<p><span>Those photos of Pogačar that popped up of him looking ill and vulnerable atop the Col de la Loze were also a reminder of how fickle this sport can be. In just one bad day, it was as if Pogačar’s wins this year before that day, in the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\"><span>Tour of Flanders</span></a><span>, </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\"><span>Amstel Gold Race</span></a><span> and La Flèche Wallonne, were forgotten. Of course, Pogačar didn’t go to the Tour de France this year dreaming of yet another white jersey and second place overall on the general classification, but these are still achievements to be proud of – and ones that most riders would be grateful for just once in their careers.</span></p>\n<p><span><em>Cover image: Zac Williams/SWpix</em></span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"bd994160cec72dbed308879fc5d569ae1eb04f57dde5654556ce6ac79874dfcc","category":"Cycling"}