{"title":"Impact of Different Foot and Mouth Disease Vaccine Schemes in the Cross-Neutralization against Heterologous Serotype O Strains in Cattle","link":"https://www.preprints.org/manuscript/202409.2378/v1","date":1727685988000,"content":"The high antigenic variability of the foot-and-mouth disease virus (FMDV) represents a challenge for developing prophylactic strategies, stressing the need of research into vaccines offering broad protection against a range of virus strains. Here, the heterotypic cross-reaction using different vaccine schemes against serotype O strains was studied, evaluating the impact of revaccination, antigen dose, and incorporation of additional FMDV serotypes. Naïve cattle were immunized with seven distinct FMDV vaccines, receiving three doses of the same formulation at 0, 28 and 56 days post-primary vaccination (dpv). Serum samples were collected up to 70 dpv and tested by a virus-neutralizing test against serotype O strains from South American and two strains representative two Asian lineages. Our results showed that vaccines containing the ME-SA topotype O1/Campos strain developed cross-neutralizing responses against the two Asian viruses after the first vaccination. In contrast, significant heterotypic neutralizing antibody titers against the homologous topotype strain were only found after the second immunization, indicating that the phylogenic relationship may differ from the antigenic profiles for these two viruses. The amount of the O1/Campos strain and the revaccination were essential factors for neutralization against the homologous and heterologous type O FMDV viruses. The strain composition of the vaccine was only relevant for cross-neutralization against one of the Asian strains, suggesting potential intra-serotypic divergences for this pattern.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bd9b14d94689c386761c4830ef47013720bccf881da2bd6b4fc2313c1ab40079","category":"Interdisciplinary"}