{"title":"Dietary Alpha‐Monolaurin for Nile Tilapia (Oreochromis niloticus): Stimulatory Effects on Growth, Immunohematological Indices, and Immune‐Related Gene Expressions","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3155447?af=R","date":1683788400000,"content":"<p>Alpha-monolaurin is reported to exhibit strong antiviral and antibacterial effects. This paves the way for its use as a new generation of feed additives. The experiment was carried out to examine the effects of the inclusion of alpha-monolaurin as a feed additive for Nile tilapia (<i>Oreochromis niloticus</i>) growth and immune response. Four diets were formulated to include alpha-monolaurin at 0, 2, 4, and 6 g alpha-monolaurin kg<sup>−1</sup> diets and fed to the Nile tilapia (initial weight, 3.19 ± 0.11 g) for 70 days. Compared to those of the control group, the final body weight, weight gain rate, specific growth rate, and efficiency of feed of fish fed 4 and 6 g alpha-monolaurin kg<sup>−1</sup> diets were (<i>P</i> ≤ 0.05) higher. The diet supplemented with a 2 g alpha-monolaurin kg<sup>−1</sup> diet (<i>P</i> ≤ 0.05) improved endogenous amylase and lipase more than other treatments. The intestinal villus length, width, and goblet cell number were increased (<i>P</i> ≤ 0.05) in fish fed a 6 g alpha-monolaurin kg<sup>−1</sup> diet. The same treatment displayed decreased (<i>P</i> ≤ 0.05) AST and ALT and increased total protein, albumin, and globulin. The highest levels of IgG and IgM were also noted in fish fed a 6 g alpha-monolaurin kg<sup>−1</sup> diet. The highest values of hematocrit, hemoglobin, and red blood cell and white blood cell counts were seen in fish fed either a 4 or 6 g alpha-monolaurin kg<sup>−1</sup> diet. The highest levels of thyroxine, triiodothyronine, and growth hormone were recorded in fish fed a 6 g alpha-monolaurin kg<sup>−1</sup> diet. Likewise, the same treatment recorded the highest levels of SOD, CAT, GSH, and GPx but the lowest MDA value. Diets supplemented with 4 g or 6 g alpha-monolaurin kg<sup>−1</sup> displayed the highest gene expressions of IFN-<i>γ</i> and IL-1<i>β</i>; however, HP70 genes were downregulated. In summary, the study showed that monolaurin may exert immunostimulatory effects on the immune system of the Nile tilapia by modulation of the host immune response and through metabolite production.</p>","author":"Marwa M. Ali, \nMohamed A. Elashry, \nEman Y. Mohammady, \nMohamed R. Soaudy, \nHoda S. El-Garhy, \nMohamed A. El-Erian, \nAhmed Mustafa, \nMohamed Abouelsoud, \nJanice A. Ragaza, \nEhab R. El-Haroun, \nMohamed S. Hassaan, \nUmar Khan","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bda1e973af9618a2ccd0c003f72e1d2462425860dae17bf3673e79921977eb36","category":"Environment"}