{"title":"Ultrasound‐assisted annealing treatment to improve physicochemical and digestive properties of banana flour","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13488?af=R","date":1712064639000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Banana flour can provide a solution to people with gluten intolerance, as it is gluten-free. Native banana flour may have limited functionality in certain applications. In this study, banana flour was modified by ultrasonic (US) and annealing (ANN) treatments at four incubation time spans, namely 12, 24, 36 and 72 h, separately or combined sequentially (US–ANN) to enhance the physicochemical and digestive properties.</p>\n<h2>RESULTS</h2>\n<p>US led to exposed granular surfaces and damaged non-starch components. Both treatments, at extended incubation time, increased crystallinity, resulting in a narrower starch gelatinization temperature range. The swelling power was significantly lower for ANN and US–ANN compared to US alone, providing a delay of gelatinization temperature. However, none of the treatments affected the gelatinization enthalpy. Furthermore, US increased peak viscosity, breakdown, final viscosity and setback whereas the opposite results were obtained for ANN and US–ANN. Additionally, US prior to ANN significantly increased the resistant starch (RS) content for annealing times over 24 h, especially for the US–ANN treatment for 72 h, which provided the highest RS content (49.3%) compared to ANN treatment for 72 h (44.0%) and native flour (36.3%).</p>\n<h2>CONCLUSIONS</h2>\n<p>US prior to ANN treatment offers an alternative method to improve the functional and digestive properties of banana flour, extending the range of applications. © 2024 Society of Chemical Industry.</p>","author":"Thewika Keeratiburana, \nNattika Siangwengwang, \nWipha Somphunga, \nTian Fu, \nAndreas Blennow","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bda55f0c50064ad44327de1f0a4fdc6ae9f321455e564c2a671f85b705ae6724","category":"Environment"}