{"title":"Phenological coding of Crambe abyssinica Hochst. according to the BBCH system","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12891?af=R","date":1712896825000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bbb93891-cbcd-4770-89ca-4f20010d3242/aab12891-toc-0001-m.png\" alt=\"Phenological coding of Crambe abyssinica Hochst. according to the BBCH system\" />\n<p>In the present study, a proposed scale of the phenological growth stages of crambe was applied according to the Biologische Bundesanstalt Bundessortenamt und Chemische Industrie coding system was applied.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Crambe (<i>Crambe abyssinica</i> Hochst.) is an oilseed crop domesticated in the Mediterranean region that is becoming increasingly important worldwide. Crambe is now considered as an alternative to bioenergy crops and oleochemicals, because of its ability to acclimatise under inhospitable conditions. Despite the interest in the agronomic characteristics and applications of this crop, research on crambe is still scarce and has focused only on production, taking into account the phenological stages of this species. Therefore, a single criterion for quantifying the phenology of the species can be a useful tool for both researchers and growers. In the present study, a proposed scale of the phenological growth stages of crambe was applied according to the BBCH (Biologische Bundesanstalt, Bundessortenamt und Chemische Industrie) coding system. The phenological stages were described using the one- and two-digit decimal coding of the BBCH system and corresponded to stage 0: germination; stage 1: leaf development; stage 2: lateral sprout formation; stage 5: inflorescence emergence; stage 6: flowering; stage 8: fruit ripening and stage 9: senescence. Growth stages 3 and 4 (main stem elongation and development of collectable vegetative parts, respectively) have been omitted. Figures have been included to illustrate the main stages, and plant growth has been represented by a technical botanical illustration. The BBCH system has been effective in providing phenological data on crambe, allowing for better growing management of the crop under varying climatic conditions, as well as contributing to the standardisation of research methods on the species.</p>","author":"Luiz Sória‐Teixeira, \nJeniffer Narcisa‐Oliveira, \nRenata do Nascimento Santos, \nCarla Rodrigues, \nReginaldo Costa, \nRubia Reneta Marques, \nVitor Hugo Brito","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"bdb2618953a53868e9c6bd8aad5e2e9dd8722ab73bf6b0e6e2d25bcc48b0dd7d","category":"Environment"}