{"title":"Refuge identification as a climate adaptation strategy to promote fish persistence during drought","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12860?af=R","date":1725901776000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/db819ffe-298d-44c7-adce-a56e2517e5e6/faf12860-toc-0001-m.png\" alt=\"Refuge identification as a climate adaptation strategy to promote fish persistence during drought\" />\n<p>Drought refuges are useful for increasing fish resistance and resilience to drought in a changing climate with increased human water regulation. We identify potential drought refuges and discuss management approaches and challenges. Explicitly incorporating fish requirements with surface water delineation will help advance the protection, creation and evaluation of drought refuge as a climate adaptation strategy.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change is leading to global increases in extreme events, such as drought, that threaten the persistence of freshwater biodiversity. Identification and management of drought refuges, areas that promote resistance and resilience to drought, will be critical for preserving and recovering aquatic biodiversity in the face of climate change and increasing human water use. Although several reviews have addressed the effects of droughts and highlighted the role of refuges, a need remains on how to identify functional refuges that can be used in a drought management framework to support fish assemblages. We synthesize literature on drought refuges and propose a framework to identify and manage functional refuges that incorporate species physiological tolerances, behaviours and life-history strategies. Stream pools, perennial reaches and off-channel habitat were identified as important drought refuges for fish. The ability of refuges to improve species resistance and resilience to drought requires careful consideration of the biology of the target species and targeted management to promote persistence, quality and connectivity of refuges. Case studies illustrate that management of drought refuges can be challenging because of competing demands for water, incomplete knowledge of ecological requirements for target species and the increasing occurrence of multi-year droughts. Climate adaptation is increasingly important, and drought refuges can increase fish resistance and resilience to climate-related drought across the riverscape.</p>","author":"Annika W. Walters, \nNiall G. Clancy, \nThomas P. Archdeacon, \nSongyan Yu, \nJane S. Rogosch, \nElizabeth A. Rieger","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"bdb53d2a6d2ae3821730ea77518afad3db69e4c7bfbe129b1e424d7e02173d5e","category":"Environment"}