{"title":"อวดบ้านครับ","link":"https://iannnnn.com/2021/2959","date":1633795147000,"content":"<p>คือยังงี้ครับ</p>\n\n\n\n<p>เมื่อ 2 เดือนก่อน Facebook Messenger ของผมก็มีโนติฯ เด้งขึ้นมา กดดูชื่อ เป็นผู้ชาย (ตัดทิ้ง #ผิด) ทักมาด้วยความสุภาพ </p>\n\n\n\n<p><em>ผมเป็นนักศึกษาปีสองมาจากสถาปัตย์ลาดกระบังนะครับ พอดีผมได้รับโปรเจคจากอาจารย์มาให้ออกแบบบ้านพักอาศัยสองชั้น โดยมีuserเป็นครอบครัวนึง แล้วพี่แอนตรงกับโจทย์พอดี ผมจึงขอพี่แอนเป็น userในเป็นโปรเจคนี้ พี่แอนพอจะสะดวกเป็นผู้ใช้งานในโปรเจคผมมั้ยครับ</em></p>\n\n\n\n<p>โอ้ว! จริงดิ</p>\n\n\n\n<p>ผมถึงกับลุกขึ้น นึกขึ้นได้เลยนั่งลงอีกครั้ง แล้วกดน้ำ (รู้เลยว่าขี้อยู่) ตั้งใจอ่านอีกที… น้องเขาเอาจริงแฮะ</p>\n\n\n\n<p>ผมตอบตกลง น้องเขาเลยส่งแบบสอบถามมาให้กรอก อ่านดูแล้วเป็นสำนวนของน้องเองที่สอบถาม requirements ต่างๆ ที่บ่งบอกว่าเจ้านั้นใส่ใจกระบวนการเก็บข้อมูลของผู้อยู่อาศัยได้ดีมาก โอเคเลย ถ้าเป็นแบบนี้ข้าถือว่าน่าสนุกนัก และขอร่วมงานกับเจ้าด้วยความยินดี</p>\n\n\n\n<p>อันนี้คือเปิดหัวแบบสอบถาม ซึ่งเป็นตัวบอกวัตถุประสงค์ของโปรเจกต์นี้ ลองอ่านดูครับ</p>\n\n\n\n<p><em><strong>โครงการบ้านพักอาศัยในฝัน</strong><br />บ้านหรือที่อยู่อาศัย คือ ปัจจัยหนึ่งในการดำรงชีวิตของเรา เป็นที่สำหรับการพักผ่อนและการอยู่ร่วมกันของคนในครอบครัว ในช่วงเวลาที่ผ่านมาในอดีตชีวิตที่เร่งรีบส่งผลให้ในระหว่างวันเราต้องเดินทางออกไปทำงานนอกบ้าน เราจึงได้ใช้เวลาส่วนใหญ่อยู่กับบ้านแค่ในช่วงเวลาหลังเลิกงานหรือวันหยุดสุดสัปดาห์</em><br /><em>แต่ในปัจจุบัน สถานการณ์แพร่ระบาดของโรค COVID-19 บ้านนอกจากจะเป็นที่อยู่อาศัยและที่พักผ่อนแล้ว บ้านยังเป็นส่วนหนึ่งของการทำงาน เป็นสถานที่สำหรับการสร้างสรรค์งานและคุณค่าแห่งตัวตนของผู้อยู่อาศัยใช้ชีวิตในเวลา 24 ชั่วโมงของแต่ละวันได้อย่างมีคุณค่าและเกิดประโยชน์ต่อการดำรงชีวิตสูงสุดและปลอดภัย</em></p>\n\n\n\n<p>ผมนึกย้อนกลับไปสมัยตัวเองเรียนสร้างบ้านเหมือนกัน (แต่นั่นมันยี่สิบกว่าปีมาแล้ว…) ตอนปีหนึ่งปีสอง ก็มีโปรเจกต์ประมาณนี้เช่นกันครับ คือเป็นโปรเจกต์สร้างบ้านโดยมีโจทย์กำกับ เช่น บอกบุคลิก รสนิยม ลักษณะเฉพาะ หรือความต้องการของเจ้าของบ้าน เสร็จแล้วให้นึกศึกษาจับเอาข้อมูลเหล่านั้นมาประเมิน เพื่อออกแบบมาเป็นบ้านที่สมบูรณ์ และเทลเลอร์เมดสุดๆ สำหรับเจ้าของบ้าน</p>\n\n\n\n<p>ผ่านไปยี่สิบปีนิดๆ เดี๋ยวนี้ไม่ต้องมโนเองแล้ว อยากทำบ้านให้ใคร ก็ทักเขาไปเลย เออดี! สนุก!</p>\n\n\n\n<p>ต้องบอกก่อนนะครับว่า ตอนนี้ผมก็มีบ้าน มีรถ มีลูกเมีย มีหนี้สินอยู่แล้วไม่น้อย ตัวบ้านนั้นผมออกแบบแค่คร่าวๆ และงานที่เหลือนอกนั้นจ้างเพื่อนที่เรียนมาด้วยกันนี่แหละทำให้ 5555555 เพราะผมไม่เก่ง เดี๋ยวทำแล้วพังขึ้นมาจะว่ายังไงดีล่ะ</p>\n\n\n\n<p>ทีนี้พอเป็นบ้านของตัวเอง ก็เลยต้องกำหนดไปอย่างเต็มที่ว่าชอบอะไร ไม่ชอบอะไร อะไรที่เป็นเรา อะไรที่ไม่ใช่ ซึ่งบักเต้ย (สถาปนิก) ก็มาบอกทีหลังว่างานบ้านมึงนี่เป็นงานที่ทำง่ายมากเลยนะ เพราะเจ้าของบ้านสรุปมาให้แล้ว ออกแบบเองอีกครึ่งนึง หน้าที่กูคือจบแบบแล้วรับเงินอย่างเดียว … เออว่ะ รู้สึกเสียเปรียบ นี่ไปเสียเวลาเรียนทำไมวะตั้งห้าปี (ก็เรียนเพื่อเอาไว้คุยกับมึงรู้เรื่องไง)</p>\n\n\n\n<p>เนื่องจากรู้ว่าตัวเองมีรสนิยมด้านสถาปัตยกรรมค่อนข้างเฉพาะ ไม่เหมือนผู้คนทั่วไปนัก (คือไม่เอาลอฟต์ ไม่เอามินิมัล ไม่เอาเกาหีล ไม่เอาคลีน ไม่เอาโมเดิร์น ฯลฯ แต่เอาอยู่สบายนะ ฯลฯลฯลฯ) สุดท้ายก็ออกมาเป็นบ้านที่ลงตัวที่สุดทั้งด้านดีไซน์ ฟังก์ชัน และงบประมาณ (<em>สำคัญมาก</em>) เท่าที่ตัวเองจะสามารถกินขี้ปี้นอนได้ทุกคืนวันแล้วครับ</p>\n\n\n\n<p>อ้ะ แปะลิงก์ เผื่อใครจะจ้างมัน <a href=\"https://www.facebook.com/media/set/?set=a.786173471507308&amp;type=3\" target=\"_blank\">เชิญดูที่นี่จ้ะ</a></p>\n\n\n\n<p>กลับมาที่งานของน้อง</p>\n\n\n\n<p>คำถามทีลิสต์มานี่น่าสนใจนะครับ ใครคิดจะมีบ้าน หรือสร้างบ้านเป็นของตัวเอง ลองหยิบลิสต์นี้เอาไว้เป็นโจทย์พื้นฐานในการสรุปงานออกแบบก็ได้ น้องเขาลิสต์แพ็กเริ่มต้นจากการสัมภาษณ์พูดคุยกันผ่านแชตไว้ให้ดังนี้ :</p>\n\n\n\n<p><em><strong>พื้นที่ใช้สอยหลัก</strong></em><br /><em>(หากพี่แอนต้องการปรับเปลี่ยน สามารถพิมบอกได้เลยนะครับ)</em></p>\n\n\n\n<ul><li>ห้องนอนสำหรับผู้ใช้อาคารหลัก มีส่วนแต่งตัวและห้องน้ำส่วนตัว</li><li>ห้องนอนสำรอง มีส่วนแต่งตัว ห้องน้ำส่วนตัว เตรียมเผื่อไว้สำหรับทายาท หรือญาติมาเยี่ยมเยียน</li><li>ห้องน้ำรวม ห้องน้ำส่วนกลางที่ใช้ร่วมกัน</li><li>ส่วนพักผ่อนสำหรับครอบครัว ห้องสำคัญที่ทุกคนในครอบครัวมักลงมาทำกิจกรรมร่วมกันเสมอ<br />ทั้งในวันธรรมดา และในวันหยุดสุดสัปดาห์</li><li>พื้นที่หรือห้อง สำหรับความเชื่อหรือความศรัทธาทางศาสนา หรือความเชื่ออื่น ๆ (สามารถปรับเป็นห้องอื่นๆได้ครับ)</li><li>ส่วนทำงานของเจ้าของบ้าน เป็นส่วนสำคัญที่เจ้าของบ้านต้องการแยกออกมาเป็นสัดส่วน และ<br />สอดคล้องกับอาชีพของผู้ใช้อาคาร เน้นการออกแบบที่คำนึงถึงบรรยากาศที่ดีที่ตอบสนองการทำงาน<br />ได้ตลอดเวลา</li><li>ส่วนรับประทานอาหาร ต้องการโต๊ะที่สามารถรองรับได้ขนาด 4-6 ที่นั่ง และมีพื้นที่สำหรับเก็บ<br />ภาชนะสำหรับรับประทานอาหารอยู่ในบริเวณใกล้เคียง</li><li>ห้องครัว เนื่องจากต้องทำอาหารสำหรับสมาชิกทุกคน จึงต้องการครัวไทยที่สามารถทำอาหารได้<br />หลากหลาย และมีการระบายอากาศที่ดี</li><li>บริเวณซักผ้าและรีดผ้า ประกอบด้วยเครื่องซักผ้า ที่เก็บเสื้อผ้าที่รอรีด และราวแขวนผ้าที่รีดแล้ว<br />รวมถึงพื้นที่ตากผ้าและรีดผ้า</li><li>ห้องเก็บของภายในบ้าน สำหรับเก็บของใช้ภายในบ้าน</li><li>ห้องเก็บของภายนอกบ้าน สำหรับเก็บของใช้ภายนอกบ้าน</li><li>ที่จอดรถ</li></ul>\n\n\n\n<p>เนี่ย พอมีจุดเริ่มปั๊บ สเต็ปที่จะไปต่อได้ก็คือ อันไหนเอา อันไหนไม่เอา ก็มาขีดมาคุยกันต่อได้เลย</p>\n\n\n\n<p>หลังจากนั้นก็เป็นแบบสอบถามครับ เป็นชุดคำถามที่แงะรสนิยม หรือทัศนคติของเจ้าของบ้านออกมา เช่น (ผมลิสต์มาบางคำถามพอ เดี๋ยวยาว แต่ก็ยาวแหละ ปีนึงจะเขียนบล็อกที) :</p>\n\n\n\n<ul><li>บ้านในความหมายของพี่แอน (จำไม่ได้ว่าตอบอะไร ต้องมีคำว่าขี้และนอนแน่ๆ)</li><li>นิยามความเป็นตัวเอง (กูจะตอบยังไง)</li><li>อยากให้มีห้องสำหรับทำงานภายในบ้านเป็นสัดเป็นส่วนหรือไม่ (มีจ้า)</li><li>[น้องลิสต์รายชื่อห้องมาเพียบ แล้วถามว่า] อยากได้ห้องอะไรเพิ่มอีกเป็นพิเศษ อาจจะเป็นห้องจัด podcast หรือ ห้องเลี้ยงแมว เป็นต้นครับ (อ่านถึงตรงนี้ก็คิดว่า เออ ดีนะไม่ต้องจ่ายตังค์จริง น้องเลยกดมาให้เต็มสูบ)</li><li>เป็นคนที่จำเป็นต้องใช้เครื่องปรับอากาศมั้ยครับ (เออ อันนี้พิเศษ บ้านจริงๆ ปัจจุบันของเรา ผู้อยู่บ้านทั้งวันทั้งคืนนั้น ไม่ต้องเปิดแอร์เลย! ดีจัง ลมธรรมชาติจงเจริญ!)</li><li>ปกติแล้วใช้เวลากับส่วนไหนของในบ้านมากที่สุด (น่าจะห้องหนังสือ ตอนที่เขียนบล็อกนี้ก็ใช่)</li><li>สิ่งยึดเหนี่ยวจิตใจภายในบ้าน อาทิเช่น การนับถือศาสนา ของสะสม งานอดิเรก กิจกรรมที่ชอบ เป็นต้น (ไม่เอาห้องพระ แต่เอาห้องการ์ตูน)</li><li>ปัญหาที่เจอในบ้านที่อาศัยอยู่ปัจจุบัน ที่อยากแก้ไข เช่น พื้นที่ส่วนตัวน้อยไป เพื่อนบ้านเสียงดัง เป็นต้น (อันนี้เป็นข้อที่เราไม่ค่อยนึกถึง แต่สำคัญ แต่ละคนจะมีเพนพอยต์ไม่เหมือนกัน ถ้าคุยประเด็นนี้ก็ยาว ได้เสาเสาเสา 10 อีพีเต็ม)</li><li>ทำอาหารกินเองไหม</li><li>เมียทำงานอะไร</li><li>อะไรที่ชอบเหมือนกันกับเมีย (นั่นแน่)</li><li>ขับขี่รถอะไรบ้างไหม</li><li>ลูกแยกนอนยัง</li><li>มีแขกหรือญาติมา(นอน)บ่อยไหม</li><li>ชอบวัสดุอะไรเป็นพิเศษไหม เช่น ไม้ เหล็ก ปูน หิน เป็นต้น (ข้อนี้ดี ขอชม)</li><li>สไตล์งานสถาปัตย์ที่ชอบเป็นพิเศษ อาทิเช่น โมเดิร์น โมเดิร์นวินเทจ มินิมัล ลอฟต์ เนเชอรัล หรืออื่นๆ (ฉันยังรู้จักไม่ครบทุกคำเลย)</li><li>นอกบ้านนอกจากต้นไม้และหญ้าแล้วจะเอาอะไรอีกไหม (สวน จำไม่ได้ว่าตอบอะไร รู้สึกจะสวนอังกฤษรกๆ ซึ่งตอนนี้ก็ทำอยู่ แต่ไปทำที่คาเฟ่นั้นน่ะ ที่ลูกค้ามาดราม่าบ่อยๆ น่ะ)</li></ul>\n\n\n\n<p>ประมาณนี้ครับ เห็นไหม ดีเนอะ น้องใส่ใจเรา เนี่ยปลื้มเลย จากคนที่ขาดการดูแลเอาใจใส่…</p>\n\n\n\n<p>…</p>\n\n\n\n<p>หลังจากน้องหายไป 1 เดือนเศษๆ เสียงโนติก็ดังขึ้นมาอีกครั้ง (เขียนบรรยายไปงั้นแหละ ที่จริงคือเปิดสั่น)</p>\n\n\n\n<p>สวัสดีครับพี่แอน<br />พอดีว่าผมทำเสร็จแล้วครับพี่แอน ไหนๆ ก็เสร็จแล้ว อยากให้ user ได้เห็นงานไฟนอล<br />ไม่รู้ว่าจะตรงกับที่พี่แอนคิดรึเปล่า ผมรู้สึกว่าแอบใส่ความเป็นตัวเองไปเยอะเลยครับ 5555</p>\n\n\n\n<p>ไหนๆๆๆๆๆ หูผึ่ง อยากเห็น ขอดูๆๆๆ</p>\n\n\n\n<p>แล้วน้องก็ส่งลิงก์นี้มา (<a href=\"https://www.facebook.com/pongsuriya.sakonpuyalak/posts/1196669034180500\" target=\"_blank\">กดดูเต็มๆ ที่นี่ มีหลายมุม</a>)</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/01-1024x768.jpeg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/01-1024x768.jpeg 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/01-300x225.jpeg 300w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/01-768x576.jpeg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/01.jpeg 1440w\" /></figure>\n\n\n\n<p>เย็ดเข้เท่จริงๆ ไม่เคยคิดมาก่อนว่าตัวเองจะได้มีบ้านที่มีสไลเดอร์บนหลังคา อ้าวไม่ใช่เหรอ แต่ใช่ละกัน</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/02-1024x768.jpeg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/02-1024x768.jpeg 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/02-300x225.jpeg 300w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/02-768x576.jpeg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/02.jpeg 1440w\" /></figure>\n\n\n\n<p>เนี่ยดูดิๆๆๆๆๆ เห็นต้นไม้ใหญ่รอบบ้านแล้วชอบเลย โอ้โห นั่นทางเดินรอบบ้าน นั่นผนังอิฐเปิดช่องลม จ๊าฟอย่างนี้ ฉันจะไม่เปิดแอร์ไปตลอดชีวิต!</p>\n\n\n\n<p>แล้วน้องก็ส่งคลิปมา เฮ้ย บ้านเสร็จแล้ว สร้างจริงๆ แล้วด้วย!</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>ถึงจะเป็นการเก็บข้อมูลเจ้าของบ้านเพียงครั้งเดียว (ถ้าโลกแห่งความจริงคงต้องเก็บประมาณ 37 ครั้ง) แต่น้องก็ยังรีดเอาความต้องการของเจ้าของบ้าน ไปบวกกับความอยากได้อยากมีของตัวเอง 5555555555555 ใส่เข้ามาอย่างไม่ยั้ง ออกมาสวยเลย ลงตัวเลย ส่งให้เมียดู เมียชอบมาก อยากมี ขอเลยได้ไหมหลังนี้</p>\n\n\n\n<p>ที่สำคัญคืองานปีสองนั้นยังเป็นโปรเจกต์ในจินตนาการอยู่ จึงไม่มีข้อจำกัดเรื่องงบประมาณ อันเป็นข้อจำกัดสำคัญในโลกแห่งความจริง 55555555</p>\n\n\n\n<p>โอ๊ย การได้เห็นตัวเองรวยนี่มันเท่จังโว้ย</p>\n\n\n\n<p>ที่ชอบจนต้องจดไว้คือการมีคอร์ดกลางบ้าน และห้องเวิร์กช็อป (ที่ในชีวิตจริงตอนนี้ยังไม่มี แต่ถ้าวันนึงแก่ตัวลงไป ลูกมีผัวหมดแล้ว จะแยกไปสร้างบ้านอยู่กันสองตายายที่ต่างจังหวัด คิดว่าน่าจะมีไว้สักหน่อย) (ส่วนห้องหนังสือตอนนี้มีแล้ว แต่มีเท่าไหร่ก็ไม่พอเหอะ)</p>\n\n\n\n<p>สุดท้าย พอขอให้น้องไปเขียนสรุปโปรเจกต์หน่อย อยากเห็น text หรือ process งานว่าหลังจากที่เราคุยกันแล้ว งานมันพัฒนาไปอย่างไรบ้าง อยากรู้กระบวนการคิด กระบวนการออกแบบ น้องตอบตกลง สักพักก็ส่งมาเป็นลิงก์นี้ครับ</p>\n\n\n\n<figure><div>\n<div></div>\n</div></figure>\n\n\n\n<p>บ้านพักอาศัยของครอบครัวคุณแอน สมาชิกรุ่นใหญ่ของรายการ Podcast ชื่อดัง เสาเสาเสา สามโคกเรดิโอ สมาชิกในบ้านประกอบไปด้วย คุณแอน ภรรยา และลูกสาววัยเด็กทั้งสองคน<br />.<br />บ้านที่มีพื้นที่สำหรับเด็กๆ ในบ้านได้วิ่งเล่นสบายๆ มีเฉลียงไม้ไว้นั่งเล่นพักผ่อน ห้องเก็บหนังสือที่เป็นงานอดิเรกของคุณแอน<br />.<br />แผงฟาซาดเหล็กสนิมขนาดใหญ่สะดุดตาบริเวณหน้าบ้าน บ้านทรงตัว U เพื่อให้สามารถรับลมธรรมชาติได้อย่างเต็มที่ คอร์ดกลางบ้านมีต้นไม้ที่ให้ร่มเงาและความร่มรื่นกับบ้าน ทุกส่วนของบ้านสามารถมีประติสัมพันธ์กับคอร์ดกลางบ้านได้ทั้งหมด<br />.<br />พร้อมกับจุดเด่นของหลังคา Greenroof ที่มีทางลาดเชื่อมจากหลังคาชั้น 1 ไปยังหลังคาชั้น 2 นอกจากสร้างจุดเด่นให้กับบ้านแล้วยังช่วยบังความร้อนที่เข้าสู่ตัวอาคาร เปลี่ยนพื้นที่ของหลังคาจากที่โล่งๆ นำมาใช้ให้เกิดประโยชน์สูงสุด โดยสามารถขึ้นไปทำกิจกรรมได้หลากหลายอย่าง และบริเวณขอบของ Greenroof ยังสามารถปลูกพืชผักสวนครัวเพื่อนำมาประกอบอาหารได้อีกด้วย</p>\n\n\n\n<p><strong>Location</strong> : Lat Krabang Bangkok<br /><strong>Design</strong> : Pongsuriya Sagonpuwarug<br /><strong>User</strong> : Prachya Ann Singhto</p>\n\n\n\n<p>ขอแซวอีกนิด ถ้าจะปลูกกะเพรากินเอง ไม่ต้องเอาไว้บนหลังคาบ้านหรอก เอาตังค์ส่วนนั้นไปซื้อในตลาดได้ชาตินึงเลย!</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03-1024x576.jpeg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03-1024x576.jpeg 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03-300x169.jpeg 300w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03-768x432.jpeg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03-1536x864.jpeg 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2021/10/03.jpeg 1920w\" /></figure>\n\n\n\n<p>แล้วเป็นอะไรมากไหม ปีนหลังคาขึ้นไปนั่งฟินกลางแดดเนี่ย แดดลาดกระบังนะครับ!</p>\n\n\n\n<p>โอ๊ย อยากเขียนถึงเยอะๆ เลย แต่เมื่อยมือแล้ว ไม่ได้พิมพ์ยาวมานาน งั้นจบด้วยการบ่นเป็นคนแก่ดีกว่า</p>\n\n\n\n<p>อิจฉาน้องๆ สถาปัตย์ในยุคนี้เหมือนกันนะครับ ที่ตอนนี้ไม่ต้องทำแบบสมัยลุง ที่ต้องมัวเสียเวลาต่อคิวยืมหนังสือหา ref จากห้องสมุด ที่มีอยู่อย่างจำกัดมากๆ หรือไม่ก็พอเพื่อนรวยๆ ไปซื้อหนังสือ หรือนิตยสารดีๆ ของฝรั่งมาดู ก็ต้องต่อคิวแย่งกันดู เสร็จแล้วงานมันก็งอกเงยออกไปได้ไม่มาก เพราะพรมแดนของจินตนาการมันถูกจำกัดไว้ด้วยอะไรหลายๆ อย่าง</p>\n\n\n\n<p>แต่พอเดี๋ยวนี้ มีตัวอย่าง แรงบันดาลใจ ข้อมูลเปรียบเทียบดีๆ ทั้งเทคนิค ดีไซน์ คอนเซปต์ ไปยันปรัชญาการออกแบบที่โคตรของโคตรมหาศาลจากโลกอินเทอร์เน็ต ทำให้เรียนสนุก ทำงานสนุกขึ้นเยอะเลย</p>\n\n\n\n<p>ขอบใจเจ้ามากๆ นะน้องต้าร์ ขอฝากความหวังของสถาปนิกเลือดใหม่ไว้กับเจ้า ส่วนข้า (ที่ไปเรียนเสียเปล่ามา 5 ปี เพื่อมาจ้างเพื่อนออกแบบ) ก็ขออยู่บ้านที่มีสไลเดอร์บนหลังคา และขึ้นไปรับแดดบ่ายๆ แบบนี้แหละ อากาศดีจังโว้ย!</p>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"bdc069bdb4ca4abee91e1d28f65de729b8ad5c10efd1298e7f38f7bfd3e3324b","category":"Thai"}