{"title":"TrueKinetix TrueBike In-Depth Review","link":"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html","date":1620216777000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4444.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4444_thumb.jpg\" /></a></p>\n<p>There’s a strong chance you’ve never heard of the <a href=\"https://truekinetix.com/\">TrueBike by TrueKinetix</a>, despite being a full functioning, shipping, and retail-available smart indoor bike that works with any ANT+ or Bluetooth Smart compatible app out there, like <a href=\"https://www.dcrainmaker.com/2020/03/cycling-indoor-trainer-app-guide.html\">Zwift, TrainerRoad, and plenty of others</a>. The reason for likely not knowing about it is somewhat simple: They’re a small company with relatively limited distribution today, only within a few countries in Europe – the Netherlands and Belgium. However, later this year they’ll start expansion into North America and the rest of Europe. As such, it’s always interesting to look at smaller options from time to time to see how (or if) they can compete with bigger players, and as you’ll see here, cases where they can be a bit more scrappy to implement things others might be hesitant to.</p>\n<p>The TrueBike is unique in that there’s an actual drivetrain with an actual chain, inside the gearbox. It’s also got a large battery to be able to operate without a power plug, plus, it’s got a smallish screen up-front. Oh, and it has WiFi – something that somehow most other smart bikes don’t have.</p>\n<p>For this review, I’m going to focus on my most recent month or so with the TrueBike. But I also spent a month or two last year with it as well on an earlier near-final edition. These days, the unit is in full production and shipping normally – so that’s the experience I’ll focus on.</p>\n<p>In the world of indoor cycling bikes, there are essentially two categories. Those indoor bikes that ride atop fully open standards and allow connectivity and control to/from any app (e.g. Wahoo/Tacx/Stages/Wattbike), and those that utilize proprietary platforms and closed ecosystems (e.g. Peloton, NordicTrack, etc…). In general, I prefer the open standards variants, but there are pros and cons to each. The TrueBike is fully in the ‘open standards’ category, but it also has an app that runs on the bike itself, allowing you to do structured workouts there, without the need of other apps, if you want. Or, you can use both it and apps like Zwift at the same time, as I often did.</p>\n<p>Finally, note that this bike is a media loaner. Once I’m done here they’ll pick it back up in the same TrueKinetix van they dropped it off with. Quick and easy. If you found this review useful, consider <a href=\"https://www.dcrainmaker.com/support\">becoming a DCR Supporter</a>, which helps the site here and basically just makes you awesome.</p>\n<h3><span>The Basics:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4430.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4430_thumb.jpg\" /></a></p>\n<p>Will start off this section noting the there was no ‘unboxing’ section. That’s because like a Peloton Bike, the TrueBike includes delivery from the company itself, including bringing it inside and ensuring it’s setup and good to go. So a TrueKinetix van rolled up one day, and they carried the bike inside, screen still wrapped in protective plastic. This delivery and initial setup is included for all TrueBike purchases.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/TrueBikeDelivery1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/TrueBikeDelivery1_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/TrueBikeDelivery2.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/TrueBikeDelivery2_thumb.jpg\" /></a></p>\n<p>They’ll also leave with you with this simple bound manual:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4454.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4454_thumb.jpg\" /></a></p>\n<p>And you know? Thank you. Just effin thank-you for having a simple printed 15-page manual that has quick answers to tons of questions. It’s written in a to-the-point Dutch manner, with little fluff or unneeded information. I’ve been able to find the answers to almost everything I need in here from a normal day to day usage standpoint, and it’s even got a nifty office supply store plastic cover on it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4456.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4456_thumb.jpg\" /></a></p>\n<p>Sure, it’s not some super-fancy glue-bound book made in a factory 10,000km away. But here’s the thing: None of the other bikes I’ve tested (which is all of them) have anything remotely like this in paper. I’ve kept this floating nearby the bike for quick reference, whereas for other bikes I have to spend 25 minutes on Google or massive downloadable PDF’s finding things. Sometimes simplicity is the right answer, regardless of whether or not it looks like an end of semester report binder. I like it.</p>\n<p>In any case, here’s the bike:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4390.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4390_thumb.jpg\" /></a></p>\n<p>It doesn’t come with pedals, I installed those. In my case I’ve been using various power meter pedals, as a way to compare accuracy for the accuracy section. This has included <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">Favero Assioma</a>, <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">Garmin Rally</a>, and <a href=\"https://www.dcrainmaker.com/2017/11/garmin-vector-3-power-meter-review.html\">Garmin Vector 3</a> (spindles converted to Rally). I think even the <a href=\"https://www.dcrainmaker.com/2019/03/powertap-pedals-review.html\">PowerTap P2 pedals flirted with it for a ride or two one day</a>. They’re promiscuous like that.</p>\n<p>At the back of the bike you’ll find the power supply system and wheels to roll it around. There’s a power cord that comes from that to plug-in and charge up the battery:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4462.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4462_thumb.jpg\" /></a></p>\n<p>You can either leave it plugged in (as I have largely done), or, it’ll run for 1.5 hours on the internal battery. However, in actuality it’s longer than that – because you’re pedaling charges the battery. More specifically, the bike while powered up consumes about 50w of energy according to the company, however, if you’re sitting at 250w pedaling along – you’re actually now powering the bike, with a chunk leftover. In fact, the company is even working on a small device to allow you to contribute back to your power system. While for a single household that’s probably not worth the effort, it might be for a larger cycling studio. Either way, the company says it’s part of its larger efforts to be greener – including that the plastic portions of the bike (such as the cover over the power system) are all recycled plastic.</p>\n<p>As always, here’s the bottom of the power brick. I do this so when you can’t figure out which brick is which lying around, this is the one that came with the TrueBike:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4463.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4463_thumb.jpg\" /></a></p>\n<p>We’ll get back to the entire purpose of that giant chunk of bike in the back, in a moment.</p>\n<p>Above that you’ve got the seatpost. This is vertically adjustable via a hex wrench:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4465.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4465_thumb.jpg\" /></a></p>\n<p>What’s kinda cool though is that they keep the hex wrench in a little holder below the seat:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4467.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4467_thumb.jpg\" /></a></p>\n<p>You can see above that said holder also includes two water bottle holders. As a triathlete, I appreciate this line of thinking. But at the same time, from a road cyclist standpoint, having bottles in the frame is handier in terms of reach, as well as not clipping them with my legs when I mount/dismount. And in fact, just yesterday I managed to snap one of the plastic water bottle cages when dismounting, forgetting I had loaded two bottles up there for photos. Sigh.</p>\n<p>The saddle is adjustable fore/aft along a rail, and then the saddle itself can be adjusted/tilted by using those two screws you see in the picture, one fore and one aft:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4487.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4487_thumb.jpg\" /></a></p>\n<p>Meanwhile, up on the front you’ve got the handlebars arrangement. The entire handlebar setup can be pulled out, akin to the seatpost. There’s a single cord tucked inside that then runs to the keypad, and then onto the shifter. On the top you’ll see a small keypad of sorts. This allows you to navigate the menus in the display. Sure, it looks a bit not-2021, but sorta like the manual – it works perfectly.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4470.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4470_thumb.jpg\" /></a></p>\n<p>Meanwhile, you’ve got shifters with legit shifting buttons and nice clicky-click sounds on the handlebars. We’ll talk more about that later in lots of detail.</p>\n<p>Then finally, there’s a long shaft that protrudes outwards away from the bike, capped with a small screen. This screen runs the bike’s training platform atop Linux, which allows you to do structured workouts on it, change settings, and see your current stats.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4477.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4477_thumb.jpg\" /></a></p>\n<p>It supports multiple users, each with all their own profile settings. You can use the keypad to easily navigate the menus, it works pretty well in practice.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4480.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4480_thumb.jpg\" /></a></p>\n<p>All these are stored in the TrueKinetix cloud, which also stores copies of all your workouts. It’s here on this screen you can change settings on the bike, as well as create structured workouts and look at past workouts.</p>\n<p>When you open up your profile on the bike it’s tied to a pin number (4 digits), but you can toggle that off using the online cloud. I mean, unless you really don’t trust the people in your house to rack up free miles on Zwift. Frankly, if my wife wants to use my Zwift account to pad my mileage – go forth! But of course, this is designed more for gym scenarios:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-3.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-3.png\" /></a></p>\n<p>So, stepping back for a second to look at the footprint of the bike, the entire thing is measured at 162cm long. This is a fair bit longer than the KICKR Bike at ‘only’ 120cm long. I note this because while the TrueBike display can be handy, it’s also somewhat cumbersome when moving around.</p>\n<p>x<a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4399.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4399_thumb.jpg\" /></a></p>\n<p>Realistically it doesn’t impact were you put the bike, because it’s not as if you’d have it any closer to a large screen on a wall anyway, but it blocks the path when trying to get in front of the bike or such. This is different than most indoor bikes with screens, where the screen is mounted closer and higher up (and usually bigger). Of course, the benefit to a screen out this far, and attached at the base of the bike platform is that the bike frame can have a bit of movement without impacting the screen itself. as you can see, they’re attached at two entirely different points.</p>\n<p>Now, TrueKinetix’s claim to fame, the thing they talk a lot about is their drivetrain system. Specifically, their motorized system, which they say adjusts the drivetrain some 1,000 times a second to more accurately mimic the the inertia of riding outdoors. And those adjustments are based on sensors that monitor the system 10,000 times per second (again, according to TrueKinetix):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-4.png\" /></a></p>\n<p>Yet, this isn’t a electromagnetic system like most higher end smart bikes. Instead, as you can see quite easily, it’s a chain and crankset attached to a motor:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4509.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4509_thumb.jpg\" /></a></p>\n<p>The challenge of course with a chain is that it eventually requires some element of maintenance, whereas virtually all other indoor smart bikes require essentially no interior maintenance in normal use.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4510.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4510_thumb.jpg\" /></a></p>\n<p>The main benefit they say (aside from the road feel), is that they control extremely high levels of power at very low cadences – down to 30RPM, whereas most bikes struggle in that area (and, that’s true). Of course, why you’d need to output 1,200w at 30RPM is beyond me, but hey…</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-5.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-5.png\" /></a></p>\n<p>Obviously, you’ve concluded I sound skeptical here. And it’s not because there’s anything bad about the road feel, it’s just that I don’t think it’s some holy grail. It just doesn’t seem appreciably different than a Wahoo KICKR Bike – except, it’s a heck of a lot louder than that. Again, to be clear, the TrueBike’s road-feel is largely quite good, I’m not going to nitpick it, it’s on par with others.</p>\n<p>I’m just not convinced that trade-off is worth it, especially in the noise department. For that, this is by far the loudest smart bike I’ve tested to date. It’s equally as loud as any wheel-on trainer. And don’t take my word for it, here’s a simple video in my admittedly echo-laden studio showing it. But again, quiet this is not.</p>\n<p></p>\n<p>Now, to wrap up this section I’ve got a quick little summary of things I do and don’t like about the bike from a basics standpoint (I’ve done this on every smart bike review to date). I hesitate to call this a pros and cons list, though that’s more or less what it is. I’m sticking it here in the middle of the review so people that just skip to the end without reading will miss it (and thus hopefully read the whole review to make an informed decision – nuance matters). I’ll ignore any accuracy likes/dislikes in this section and keep it more on practical things, also ignoring spec-specific things too. Basically, this is more of a practical list of likes/dislikes:</p>\n<p><u><strong>Things I like:</strong></u></p>\n<p>– Delivery experience is as easy as it gets – they roll it into your home, and you do nothing except create an account/pin.<br />\n– No frame to thigh rubbing anywhere, easily fits me and my thighs (some other bikes rub)<br />\n– Double water bottle cage holders<br />\n– Multiuser profiles built in<br />\n– WiFi connectivity for automatic firmware updates<br />\n– The display is more useful than I expected it to be, including for gearing<br />\n– No wires sticking out anywhere<br />\n– Shifting is pretty good overall</p>\n<p><u><strong>Things I dislike:</strong></u></p>\n<p>– The stock front headtube is pretty short, especially for Dutch riders (but they have other custom sizes available)<br />\n– The lack of gear customization isn’t as good as it could be<br />\n– Also the lack of shifting types (e.g. SRAM/Shimano/Campagnolo)<br />\n– I find the seat height adjustment a bit finicky sometimes (prone to slippage if not super-tight)<br />\n– No on-bike storage spot for a phone (such as a Zwift companion app)<br />\n– No USB ports for powering a phone<br />\n– ERG mode stability (as discussed in accuracy section)</p>\n<p>You’ll see the same list formatting on all my indoor bike reviews. With that, onto the details of rider setup, and then shifting.</p>\n<h3><span>Bike &amp; Rider Fit Setup:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4406.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4406_thumb.jpg\" /></a></p>\n<p>As the TrueBike arrives completely pre-built, there’s little for you to do except to get the bike properly fit to you. In effect, that’s no different than a regular bike, but in the case of a regular bike you buy a specific bike size. Whereas with an indoor bike, you buy a one-size-fits-all solution, and then need to have the flexibility in that bike to make it work for your specific bike fit. And in the context of this as a bike review, I’m not going to tell you how to fit your bike to you. There’s smart people for that. Instead, I’m going to focus on the ways the bike can be tweaked for fit purposes.</p>\n<p>With the TrueBike, you can adjust the bike in the following ways:</p>\n<p>1) Saddle height (up/down) – hex wrench (with wrench located next to it)<br />\n2) Saddle position (forward/back/tilt) – hex wrench<br />\n3) Handlebar height (up/down) – hex wrench<br />\n4) Handlebar position (forward/back) – hex wrench<br />\n5) Seat tilt – hex wrench (technically also an extra +/- ~20mm of slide fore/aft there too)<br />\n6) Crank length on purchase: 170/172.5/175mm<br />\n7) Color on purchase: It’s offered in either a blue/black, or silver/black</p>\n<p>There are no adjustable crank lengths on the bike itself (as with the Wahoo/Tacx/Stages bikes), instead, you purchase it with the crank length size you want. Additionally, the other thing you determine on purchase is which color you want. This entire review is shown on the silver/black variant (aka Stealth), but there’s also this Blue variant:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-6.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-6.png\" /></a></p>\n<p>Now, going back to the ways you can tweak the sizing, here’s a gallery showing each of those contact points. The TrueBike also has markers on the right side of the bike, indicating exact heights/positions:</p>\n\n<a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html/dsc_4465\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4465-1-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html/dsc_4470\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4470-1-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html/dsc_4483\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4483-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html/dsc_4487\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4487-1-200x132.jpg\" /></a>\n\n<p>Now at present, TrueKinetix doesn’t have a website for sizing or fit recommendations. Wattbike, Stages, and Wahoo all have sites or apps that handle this, ranging from a few pages of paper to a full app workflow (Wahoo) that you take a picture of your existing outdoor bike setup and the app figures out the exact measurement positions for your positions inside. In the meantime, TrueKinetix says that they support riders from 165cm to 200cm, and a max rider weight of 125kg. But, that they can make shorter or longer seat and handlebar tubes to accommodate riders outside that range. Also, they said that coming in a few months their app (which isn’t available yet) will also allow you to take photos of your bike and get correct measurements, akin to what Wahoo has.</p>\n<p>In the meantime, you’ll need to do it by hand. Which, probably gets to the least ideal parts of the bike. To begin, there are no quick release handles as you noticed by now. So everything has to be done by hex wrench. For a product that is so centered around being multi-user, this key part is the least multi-user of any bike I’ve tested. To switch between my wife and I, I’ve gotta spend considerable time adjusting each bolt with the hex wrench, and getting them ultra-tight.</p>\n<p>x<a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4492.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4492_thumb.jpg\" /></a></p>\n<p>I’ve found that if they’re not ultra-tight, it’ll randomly slip. I had one ride recently where in the last 5 mins of the ride the saddle slipped. Thus, I thought I was good, but apparently not. Again, having quick handles to adjust this would help here some too. Granted, I had similar slip issues with the Wattbike ATOM 2020 as well.</p>\n<p>Now in each of my smart bike reviews I’ve noted an interesting challenge which is the ‘thigh gap’ problem. Basically, some of the bikes (namely Tacx and Wahoo) have seat posts or top-tubes that extend across where your thighs would rub. The Wattbike ATOM 2020 and Stages SB20 bike don’t have this issue. If you look at this older photo I took a year or two ago, you can see how this can be an issue in bikes with high top-tubes that are thicker than a normal bike.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2019/10/DSC_8419-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2019/10/DSC_8419_thumb-1.jpg\" /></a></p>\n<p>And then look at the measurements for those (Wattbike 2020 at far right is 50.45mm):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2020/07/DSC_6641.jpg\"><img src=\"https://media.dcrainmaker.com/images/2020/07/DSC_6641_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2019/10/DSC_8436.jpg\"><img src=\"https://media.dcrainmaker.com/images/2019/10/DSC_8436_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2019/10/DSC_8437.jpg\"><img src=\"https://media.dcrainmaker.com/images/2019/10/DSC_8437_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2020/10/WattbikeFrame.jpg\"><img src=\"https://media.dcrainmaker.com/images/2020/10/WattbikeFrame_thumb.jpg\" /></a></p>\n<p>Here’s the measurement for the TrueBike, at 46.11mm:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4495.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4495_thumb.jpg\" /></a></p>\n<p>So in the case, while the TrueBike does have a high top-tube, it’s not a thick one, and thus, I had no inner thigh rub issues. Perfect!</p>\n<p>Now, what about triathletes or time-trialists? Well the bike does have a small standard-curved area in between the center point and the rest of the handlebars (which are flatter), that might fit some aerobars. This section seems to be about 10mm wide though, which isn’t side enough for my Redshift clip-on aerobars. However, the company does sell an aerobar kit for 125EUR, which seems pretty reasonable. Here’s a stock photo of it from them:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image002.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image002_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00214.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00214_thumb.jpg\" /></a></p>\n<p>Finally, when it comes to multi-user scenarios, the TrueBike stores your weight and all settings (including gearing) within your profile. When you power up the bike, you choose which profile, and that in turn updates your settings:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-7.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-7.png\" /></a></p>\n<p>However, that doesn’t send that information to trainer apps like Zwift or such via ANT+ or Bluetooth Smart, but it does impact the feel of your ride on the TrueBike, akin to how Wahoo/Tacx/Wattbike work, by better simulating the inertia for a rider of your weight.</p>\n<h3><span>Shifting, Gearing, and Steering:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4442.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4442_thumb.jpg\" /></a></p>\n<p>Next we’ve got all things handlebar driven: Shifting, gearing, and steering. Yes, steering.</p>\n<p>I’ve long argued that one of the most important pieces in a smart indoor bike is the shifting – more so than almost anything else, and thankfully, the TrueBike largely delivers here. The reason I’m so firm on the importance of shifting is that it’s the single biggest way you interact with the bike, in terms of replicating the outdoor experience. Sure, you pedal with your feet and legs – but the shift experience is what will make or break a bike every time. Just like crappy shifting outside makes or brakes a ride/bike.</p>\n<p>The TrueBike has two sets of shift buttons on each handlebar side, along with normal-feeling brakes. The shifters here aren’t quite as perfectly nailed in size/design as the larger and more common paddles of the Wahoo KICKR Bike, but the TrueBike is still far ahead of the buttons on the Tacx/Wattbike bikes. And it, as with before, comes down to clickiness. I want click. I want crispy, and I want physical clarity that doesn’t require me to look at the handlebars, or remember another shifting style. You can see the two buttons on the inside of each shifter:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4472.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4472_thumb.jpg\" /></a></p>\n<p>Now in my ideal world these would be bigger buttons, and more like traditional shift paddles. But hey, I can live. I like that they aren’t covered by a silicone/rubber sheath (Wattbike), and that they instantly respond. The right buttons control your virtual rear cassette, and the left ones shift your virtual front chainrings. In fact, on the small screen in front of you, you’ll see the two gearings displayed on the left and right sides:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4498.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4498_thumb.jpg\" /></a></p>\n<p>This might sound like a trivial thing, but it’s super important on smart bikes. Because you have zero physical gearing to look at on the bike itself, you often need a frame of reference with respect to what gearing you’re in – and how much range you have left. On a real bike you instinctively know, likely due to the slight differences in the sound – as well as the fact you can simply glance down. But indoors, it’s all virtual. There’s no physical gears, it just mimics them.</p>\n<p>So the shifting here is quick and responsive – and I like that.</p>\n<p>However, at present, the TrueBike is also somewhat limited in how you can setup that gearing. Don’t get me wrong, these cover virtually all the common configurations, but you’re essentially just picking one option from the two lists:</p>\n<p><strong><u>Chainring options:</u></strong><br />\n36-53<br />\n39-53<br />\n36-52<br />\n34-50<br />\n30-39-53</p>\n<p><strong><u>Cassette Options:</u></strong><br />\n11-23<br />\n12-25<br />\n11-27<br />\n11-30<br />\n11-32</p>\n<p>This is more than the only two options Wattbike has (11-speed or 22-speed), but far less than what Tacx, Wahoo, or Stages offer. In those cases, they allow almost limitless configuration of the gearing, including creating pretty much any virtual cassette/chainring combination you can think of.</p>\n<p>Further, in some of those cases, they allow changing the shift methods too. Meaning, on a Wahoo KICKR Bike for example, I can emulate a SRAM eTAP setup, or a Campagnolo setup, or a Shimano Di2 Setup. So in the case of eTAP, a concurrent left/right hold would shift the front chainring, whereas otherwise I’d use the left/right sides individually to just go up/down the cassette. Certainly, this isn’t the biggest blocker in the world – but it is handy to have your shifting match your real-world bike.</p>\n<p>Note that these are configured through the web interface on the TrueKinetix platform. The current handlebar/saddle positions don’t do anything. I get the feeling they were looking at automation there at one point, but that it’s not something hardware-wise in any of the bikes today.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-8.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-8.png\" /></a></p>\n<p>Note that Zwift does not show the virtual gearing for the TrueBike like they do for the Wattbike Atom. Just as Zwift doesn’t show it for any other smartbike for no particular known reason. But again, with the TrueBike showing it on the small screen in front of you (which is always on), then it’s not really an issue per se.</p>\n<p>Now, where it gets interesting is steering. The TrueBike does support steering in Zwift. You’ll pair it up via the usual Zwift steering pairing menu, which is the little steering wheel at the lower left corner of the pairing screen:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h46m56s496.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h46m56s496_thumb.png\" /></a></p>\n<p>Note that this doesn’t work with Apple TV at this time for the TrueBike, as you run out of Apple TV connections (and it wasn’t working via the companion app for me). Perhaps there’s ways around that, but for now I just used a desktop computer instead for it.</p>\n<p>To steer with the TrueBike you simply pull the corresponding brake lever. To go left, you pull the left one, to go right, you pull the right one. It’s somewhat video-game like, but then again, so is the way it works on the KICKR Bike (<a href=\"https://www.dcrainmaker.com/2021/01/zwift-rolls-out-steering-to-wahoo-kickr-smart-bike.html\">more on how that works here</a>). Ideally, you’d have a steering column, akin to how the <a href=\"https://www.dcrainmaker.com/2020/08/zwift-steering-elite-sterzo-smart.html\">movement works on the Sterzo Smart</a>, but hey, this works.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4473.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4473_thumb.jpg\" /></a></p>\n<p>Now with the steering here the brake lever isn’t variable in how quickly it steers. Meaning, you’ll hear the ‘click’ as you get the brake lever to the half-way marker. At that point, the bike will virtually steer itself left/right. The longer you hold, the faster it steers across the Zwift roadway. Versus is you just tap the brakes once, it’ll move 1/16th of the way across the road (left or right), into what are virtual ‘lanes’ within Zwift (similar to how it works on the KICKR Bike). So if you were as bored as I was, you could single-tap slowly 16 times to get from one side of the road to the next. Or, you can just hold the brake for about 1.5 seconds, and then boom, you’re on the other side of the road.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h49m45s156.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h49m45s156_thumb.png\" /></a></p>\n<p>It works seemingly just fine for me in the few times I’ve used it. As with the other Zwift steering implementations, you’ll get better as the finesse of it over time. So I’d rate myself about a C+ in the finesse department at this point with it. You can see below, me using steering to switch sides of the road here, as well as the steering logo illuminated in the banner.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h50m01s140.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h50m01s140_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h50m11s687.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h50m11s687_thumb.png\" /></a></p>\n<p>Now the most notable piece in this entire is that technically speaking, TrueKinetix implemented the steering spec following the <a href=\"https://www.youtube.com/watch?v=BPVFjz5zD4g\">Keith Wakeham documentation of it</a>, rather than the Zwift proper API. At present, Zwift makes companies pay them money to access steering within Zwift. So Elite licenses it, Wahoo licenses it, and so on. And TrueKinetix says they’re happy to go into those discussions – but that they got tired of waiting for non-answers from Zwift. They say they’ve been waiting months for simple e-mail responses, and thus eventually just gave up and implemented it.</p>\n<p>This falls in-line <a href=\"https://www.dcrainmaker.com/2021/04/zwift-tech-tidbits-trainer-certifications-and-steering-hardware-slowdowns-retailer-program-zwifthub-and-more.html\">with my post last week</a>, where I pointed out that multiple companies were waiting on Zwift for hardware-related things. Zwift conceded that they were significantly behind there in hardware certification, they say due to COVID-19.  But I’ve gotta wonder: It seems far more likely to me that Zwift is instead stalling as long as possible on various hardware initiatives, likely to make it more <a href=\"https://www.dcrainmaker.com/2021/03/zwift-plans-three-at-home-fitness-hardware-products.html\">appealing to buy their planned Zwift trainers &amp; bikes</a> instead. Or, maybe COVID is really impacting their ability to answer e-mails. I don’t know.</p>\n<p>What I do know though is that a small startup company managed to implement the spec in a few days, test it, and have it working. And a company with a recent $500 million dollar investment round continues to ghost virtually every hardware company in the business when it comes to new features.</p>\n<p>In any event, the last area to briefly touch on is that there aren’t at present any auxiliary shifting ports/buttons that can be added elsewhere on the bike. At present only Stages offer this with their Stages SB20 bike (useful for triathletes installing aerobars), but, perhaps it’s something that TrueBike can offer down the road, since they do offer a aerobar kit for the TrueBike.</p>\n<h3><span>App Compatibility:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4518.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4518_thumb.jpg\" /></a></p>\n<p>The TrueBike <a href=\"https://www.dcrainmaker.com/2018/05/whats-baseline-on-a-smart-trainer-in-2018.html/\">follows all of the industry norms</a> as you’d expect from most trainers/smart bikes these days.  As you probably know, apps like Zwift, TrainerRoad, SufferFest, Rouvy, FulGaz, Kinomap, and many more all support most of these industry standards, making it easy to use whatever app you’d like.  If trainers or apps don’t support these standards, then it makes it far more difficult for you as the end user.</p>\n<p>The TrueBike transmits data on both ANT+ &amp; Bluetooth Smart as well, allowing interactive resistance control across both ANT+ &amp; Bluetooth Smart.  By applying resistance control, apps can simulate climbs as well as set specific wattage targets.</p>\n<p>To be specific, the TrueBike supports the following protocol transmission standards:</p>\n<p><strong>ANT+ FE-C (Trainer Control):</strong> This is for controlling the trainer via ANT+ from apps and head units. Read <a href=\"https://www.dcrainmaker.com/2016/07/everything-you-ever-wanted-to-know-about-ant-fe-c-and-bike-trainers.html\">tons about it here</a>. This also includes speed.<br />\n<strong>ANT+ Power Meter Profile: </strong>This broadcasts as a standard ANT+ power meter, with cadence data as well<br />\n<strong>Bluetooth Smart FTMS (Trainer Control):</strong> This allows apps to control the TrueBike over Bluetooth Smart (with cadence/power data)<br />\n<strong>Bluetooth Smart Power Meter Profile:</strong> This broadcasts as a standard BLE power meter with cadence</p>\n<p>Between all these standards you can basically connect to anything and everything you’d ever want to. Be it a bike computer or watch, or an app – it’ll be supported.</p>\n<p>The TrueBike also bakes in the cadence data (like everyone else). This is handy if you’re connecting to Zwift on an Apple TV, due to Apple TV’s two concurrent Bluetooth Smart sensor limitation (plus the Apple TV remote).  While you can use the Zwift mobile companion app for additional sensors, I find that can be sometimes a bit flaky.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h47m24s049.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h47m24s049_thumb.png\" /></a></p>\n<p>In addition, as discussed in the earlier section, it also broadcasts as a steering device for Zwift, and you’ll see the offset shown in the lower left side. Though, the offset is technically all or nothing (click the button, it triggers one lane shift, rather than a variable amount).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h47m02s849.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-10h47m02s849_thumb.png\" /></a></p>\n<p>It’s the earlier power standards that also allow you to connect via head units too. For example the Garmin Edge, Stages Dash L50/M50, Hammerhead Karoo, and Wahoo units, all support ANT+ FE-C for trainer control, so you can re-ride outdoor rides straight from your bike head unit to your trainer. For example, for my accuracy testing section, I recorded the data on a Garmin Edge 530 &amp; 1030 Plus, as well as the trainer apps.  From there I’m able to save the file and upload it to whatever platform I like.</p>\n<p>The TrueBike does not transmit left/right balance at this point (correctly), as seen below after a workout paired to the Garmin Edge, it simply transmits an even 50/50 split. Ideally, it wouldn’t transmit a power balance value at all unless it transmitted something. This should be trivial for them to add though, given they have this data. Also, it doesn’t currently transmit speed as part of the power channel either (also trivial for them to add).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-9.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-9.png\" /></a></p>\n<p>Further, it does not transmit torque effectiveness or pedal smoothness…but you’ll probably never use those anyways. Though, again, it’d be trivial for them to add it, since they have the data already.</p>\n<p>However, when using the TrueBike’s own screen, you’ll get additional pedal smoothness related data in the form of the so-called ‘peanut’ chart, which shows your pedal stroke:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h02m12s596.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h02m12s596_thumb.png\" /></a></p>\n<p>In fact, you’ll also get this data later on within the TrueKinetix online platform/training log:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-10.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-10.png\" /></a></p>\n<p>For me, in my testing, I used Zwift and TrainerRoad as my two main apps (which are the two main apps I use personally). In the case of Zwift, I used it in regular riding mode (non-workout mode, aka SIM mode) as well as ERG mode (workout mode). Whereas in the case of TrainerRoad I used it in a structured workout mode. I dig into the nuances of these both within the power accuracy section. I used it with both Apple TV (for Zwift), and a Mac (for TrainerRoad &amp; Zwift). I had zero issues when it came to using the TrueBike in Zwift in terms of connectivity or such. Everything worked as expected, including gradient responsiveness was solid.</p>\n<p>And here paired up in TrainerRoad using Bluetooth Smart on a Mac:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h06m54s407.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h06m54s407_thumb.png\" /></a></p>\n<p>From a functional/technology standpoint, the TrueBike and TrainerRoad worked just fine in terms of controlling power and changing resistance levels.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h08m36s467.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h08m36s467_thumb.png\" /></a></p>\n<p>However, similar to the Wattbike Atom 2020 – the TrueBike isn’t super stable in ERG mode. My bet is that, like Wattbike, they haven’t quite figured out how to really harness all the power in their drive system. In Wattbike’s case, they acknowledged it was something they were working on (just as Wahoo and Tacx both had to work on it). In TrueKinetix’s case, they look at it as a more realistic simulation of the road and a power meter. I’ll explain why that isn’t the case in just a second.</p>\n<p>Here’s an example of a TrainerRoad workout. Ignoring the random two moments I stopped (more on that in a second), you’ll see that it’s a fairly non-precise line. This workout wasn’t hard for me, so it’s not my ability to maintain the power levels:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h07m46s280.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h07m46s280_thumb.png\" /></a></p>\n<p>You can see just how far off the power is in many cases, the target for this interval is 286w, and yet it’s at 371. The yellow line above shows the power values.</p>\n<p>And indeed, here’s a Zwift workout from today in ERG mode, also, significant variability:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image001-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image001_thumb-1.jpg\" /></a></p>\n<p>Now, as I said, TrueKinetix argues that their system is more precise and responsive than a normal trainer or smart bike, and thus it shows the variability in power more accurately to what you’d see outside. Except, that sidesteps the entire point of ERG mode: To not be variable.</p>\n<p>That’s literally the singular reason ERG mode exists: Holding a specific power level, and holding it well.</p>\n<p>And yes, other bikes can do that. And it’s not because those other bikes are faking the power numbers, because I know they aren’t since I’m actually measuring/comparing it to external power meters. Thus, in those cases the bike is simply doing a better job at holding power despite my bodies continual slight fluctuations. After all – that’s again the point of ERG mode: To hold an exact wattage.</p>\n<p>From a practicality standpoint though, the main issue is that you end up working harder, since while the overall average is very close to the target for that interval, you’re still having to put out significantly more power for a second or three at a time. So it’s effectively a never-ending micro-interval workout rather than a single consistent one. It’s more noticeable on longer workouts, or workouts where you’re at the edge of your capabilities, than easier workouts.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-11.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-11.png\" /></a></p>\n<p>Of note however is that with a lot of focus, I can get it to stabilize fairly well after perhaps 7-10 seconds following a power shift (e.g. from 150w to 300w). However, even the slightly change in my pedal stroke will throw things back 70w+ out of whack. Mind you though, this is actually better than the Wattbike ATOM 2020 or Stages Bikes, which no matter how much you try and focus on pedal smoothness, it’s nearly impossible to ERG stability. Said differently, TrueKinetix is in a better spot than those units from an ERG mode stability standpoint.</p>\n<p>This isn’t something you notice in regular SIM mode (non-workout mode) riding around in Zwift, because the bike isn’t being told to hold a specific wattage. Thus, in that case it works out just fine.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h19m44s130.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h19m44s130_thumb.png\" /></a></p>\n<p>Since we’re talking about apps, what about the small TrueBike screen in front of you? It’s probably best to think of that as a second-screen, rather than a primary one. When an app (like Zwift) first loads up, it’ll ask for trainer control, or, you can simply let it passively access the power data.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h01m49s062.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h01m49s062_thumb.png\" /></a></p>\n<p>Once in the training mode, you can press start to record the session, which goes to the TrueKinetix cloud afterwards and can also be sync’d to Strava. The small screen primarily displays your power/cadence metrics, gearing, and can also connect to ANT+ &amp; Bluetooth Smart HR straps.</p>\n<p>Effectively the screen is divided into two halves, for which you can change the chart and assign it to various metrics by pressing the buttons on the keypad, in real-time. So you can see your cadence (average, lap average, current, etc…), as well as power, or</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h02m28s785.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vlcsnap-2021-05-05-11h02m28s785_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0019.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0019_thumb.jpg\" /></a></p>\n<p>Here you can see post work-out, the heart rate and power plots:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4437.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4437_thumb.jpg\" /></a></p>\n<p>The platform also has a small pile of structured workouts built into it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0015.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0015_thumb.jpg\" /></a></p>\n<p>And, technically speaking you can also build your own structured workouts on it too. But, I’d rather punch myself in the baseballs with a cactus than try and use the tiny keypad to painstakingly program each and every interval using this. Every single character you see on this screen is just for the first interval, and has to be navigated using the keypad, like writing a manifesto on a bank ATM machine.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0017.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0017_thumb.jpg\" /></a></p>\n<p>Thankfully, TrueKinetix seems to understand this, and is already working on a graphical editor for their web platform, that’ll make it easy to transmit workouts to this. Hopefully they also allow simple import of workouts in too, from platforms like TrainingPeaks or Today’s Plan.</p>\n<p>Lastly, switching topics entirely, the TrueBike requires no calibration, nor has any provision for calibration. This is akin to other electromagnetic trainers and smart bikes (like the Tacx NEO series/Wahoo KICKR Bike/Wattbike ATOM 2020). So these options won’t show up (or if they do, they won’t function) in trainer apps, since calibration doesn’t exist.</p>\n<p>Ok, with that I think we’ve covered all the app compatibility aspects, let’s dive a bit deeper into the power accuracy bits.</p>\n<h3><span>Power Accuracy Analysis:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4520.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4520_thumb.jpg\" /></a></p>\n<p>As usual, I put the bike up against a number of power meters to see how well it handled everything from resistance control accuracy, to speed of change, to any other weird quirks along the way. In the case of indoor bikes it’s a bit more tricky to have 2-3 <em>other</em> power meters, since you typically can’t swap out the crankset or rear hubs. So you have to rely upon other power meter pedals.</p>\n<p>No problem, I’ve got plenty of those. I’ve had the bike set up with two main configs over the past month:</p>\n<p>Config 1: With Favero Assioma Duo pedals<br />\nConfig 2: With Garmin Rally dual pedals<br />\nConfig 3: With a secondary set of Garmin Rally dual pedals</p>\n<p>Within this timeframe I’ve also seen multiple firmware versions. I include rides on the most recent production firmware version. They have made one change about 10 days ago or so to how it broadcasts power outbound with apps, though that doesn’t change the underlying power accuracy, it just changed the smoothing rate.</p>\n<p>Now when evaluating accuracy there’s really two things I’m looking at:</p>\n<p><strong>1) Overall power accuracy:</strong> If the unit says it’s doing 250w, is it actually doing that?<br />\n<strong>2) ERG target power stability/accuracy:</strong> If a structured workout has a section that goes from 150w to 250w, how long does it take to get to 250w, and does it stabilize properly?</p>\n<p>These are different things, but I group them here because sometimes they’re related. Now, to spoil some of this section, the TLDR here is:</p>\n<p><strong>1) Overall power accuracy:</strong> Great, zero issues on the TrueBike.<br />\n<strong>2) ERG target power stability/accuracy: </strong>Not great. Not horrific, but not great.</p>\n<p>So, let me explain. First, let’s look at overall power accuracy. For that we’ll start with one of many Zwift sessions, which use SIM mode whereby the grade goes up and down dependent on the terrain (if in a structured workout then it uses ERG mode, just like TrainerRoad). You can see <a href=\"https://analyze.dcrainmaker.com/#/public/ecfa24cd-1fc9-4ef5-5f2b-235cfc0dcea5\">that data set here</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-12.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-12.png\" /></a></p>\n<p>Now it’s a little bit hard to see what’s going on here because it’s such a variable ride. I was with a group, so, there’s a lot more variability as you shift around within the group. So let’s zoom in on a random section:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-13.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-13.png\" /></a></p>\n<p>Now while these look nearly identical (and they are), one of the things I noticed in all my sets is a bit of oscillation, likely due to the motor compensating almost too quickly. You see it doesn’t impact power accuracy, it’s just your rides won’t look quite as stable as some other units. One could argue the bike is reacting faster than most bikes – and certainly, that might indeed be the case.</p>\n<p>While in the above screenshot the TrueBike appears to overshoot the Favero pedals, in the below case it’s the opposite. With only two power meters possible, I don’t know which is absolutely correct.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-14.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-14.png\" /></a></p>\n<p>When I look at the mean-max plots for these rides though, they’re scary good:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-15.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-15.png\" /></a></p>\n<p>Oh, and cadence on that set? Looks solid. exactly 1RPM away from the Favero Assioma pedals in most cases. I didn’t have a magnet based cadence sensor on this ride to know which was precisely the correct one.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-16.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-16.png\" /></a></p>\n<p>Moving to another Zwift ride, you can see basically more of the <a href=\"https://analyze.dcrainmaker.com/#/public/3fd1b663-0b70-4b87-6d2d-e9d73ea7c8c7\">same in this data set</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-17.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-17.png\" /></a></p>\n<p>As we zoom into one of the sections with the group, we see the variability of the group, but also the closeness of the power data. Again, with any power comparison, you’re going to have slight second to second differences due to recording and transmission rates of multiple devices. But this is pretty solid.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-18.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-18.png\" /></a></p>\n<p>If we look at a couple of sprints, these are very close numbers for two values at 800w for only a second or two. This is actually pretty rare to pull off with zero smoothing applied:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-19.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-19.png\" /></a></p>\n<p>And yes, cadence looks good here too:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-20.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-20.png\" /></a></p>\n<p>So, let’s shift over to some ERG mode data instead. We’ll start with a TrainerRoad set. Now in this case, you’ll see a large gap in the minute, that’s when the bike simply stopped transmitting power over Bluetooth Smart to TrainerRoad, mid-interval. The only solution was to reboot the bike. TrueKinetix says they’re working to track down this bug, and they’ve only see it one other time with one customer. I’ve only had it happen to be once as well. <a href=\"https://analyze.dcrainmaker.com/#/public/8caecff6-d865-4fe1-4100-4a7fb094dea6\">Here’s that data set</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-21.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-21.png\" /></a></p>\n<p>Now as we talked about earlier, it’s simply not smooth. Or even remotely smooth and stable. These intervals should have been at 334 watts, but it’s kinda all over the map. Though, responsiveness isn’t bad. A touch on the slow side at about 3-4 seconds to go from 160 watts to 334. Typically I’d like to see about 1.5-2.5s Any faster and it’s like hitting a wall, and any slower and you lose too much of the interval. But knowing the TrueBike has plenty of power to pull this off, I suspect they can continue to tweak this a bit more.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-22.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-22.png\" /></a></p>\n<p>But look at this longer 6 minute interval, this should be easy-peasy smooth. But it’s everywhere. And this doesn’t mean there’s an accuracy issue. No, the power is very close to the Favero pedals on this one, though a tiny bit higher than I would have expected to be honest – but it’s hard to know if that’s a one-off Favero or TrueBike issue.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-23.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-23.png\" /></a></p>\n<p>And I know TrueKinetix would say this is simply the reality of me as a human and my pedaling stability. And yes, that’s true if we were outdoors. But the entire point of ERG mode (for the last 2+ decades) is stability. This is simply a case of the machine not doing its job. It’s job is power stability, not mimicking the outdoor road. It can do that all it wants in SIM mode, go forth! But not in ERG mode.</p>\n<p>Finally, just to cap things off, an ERG mode workout on Zwift from yesterday. You <a href=\"https://analyze.dcrainmaker.com/#/public/14e9d25c-b4f1-440c-4ce0-f0aad0780cc5\">can see that below</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-24.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-24.png\" /></a></p>\n<p>And as you can pretty easily see, just like with TrainerRoad in ERG mode, accuracy isn’t the issue. Stability is. Those 2×10-minute chunks were relatively easily, and my cadence was near perfect the entire time stability wise. It should easily hold these butter smooth.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-25.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-25.png\" /></a></p>\n<p>I suspect at the end of the day, this is sorta like the challenges that Wattbike has/had with the ATOM 2020 – the engine is so powerful they have to figure out how to tame it a bit. Wahoo and Tacx both struggled with the same thing out of the gate on their bikes, and through software updates over time they tamed the beast.</p>\n<p>The good news though is that the hard piece – accuracy – is nailed here. I’m not seeing anything that concerns me across months of riding on it, and plenty of data sets against plenty of pedals. Either for cadence or power.</p>\n<p><em>(Note: All of the charts in these accuracy portions were created using the DCR Analyzer tool.  It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks and plenty more. You can use it as well for your own gadget comparisons, <a href=\"http://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span>Indoor Smart Bike Comparisons:</span></h3>\n<p>Stepping back to the larger landscape of smart bikes, here’s a blow by blow spec comparison between them. In this case for this table, I’m focused on the bikes capable of 3rd party app integration. For example, you can’t pair a Peloton bike directly to Zwift or TrainerRoad, so that’s not here.</p>\n<div>\n<table>\n<thead>\n<tr><th><span>Function/Feature</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th></tr>\n</thead>\n<tfoot>\n<tr>\n<td>Copyright DC Rainmaker - Updated May 5th, 2021 @ 8:35 am <a href=\"#\">New Window</a> <a href=\"#\">Back to less results<span></span></a></td>\n</tr>\n</tfoot>\n<tbody>\n<tr><td> Price for trainer</td><td>€3,425</td><td>$2,599</td><td>$2899</td><td>$3,199</td><td>$3,499</td></tr>\n<tr><td> Trainer Type</td><td>Indoor Bike</td><td>Indoor Bike</td><td>Indoor Bike</td><td>Indoor Bike</td><td>Indoor Bike</td></tr>\n<tr><td> Available today (for sale)</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Availability regions</td><td>Netherlands/Belgium (North America/Europe Winter 2021-22)</td><td>UK/South Africa/Australia/Scandinavia/USA</td><td>Global</td><td>Global</td><td>Limited Initially</td></tr>\n<tr><td> Wired or Wireless data transmission/control</td><td>Wireless</td><td>Wireless</td><td>Wireless</td><td>Wireless</td><td>Wireless</td></tr>\n<tr><td> Power cord required</td><td>No</td><td>Yes</td><td>Yes</td><td>No</td><td>Yes</td></tr>\n<tr><td> Flywheel weight</td><td>Motor driven</td><td>9.28KG/20.4lbs</td><td>50lbs</td><td>Simulated/Virtual 125KG</td><td>13bs/5.9kgs</td></tr>\n<th><span>Resistance</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Can electronically control resistance (i.e. 200w)</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Includes motor to drive speed (simulate downhill)</td><td>Yes</td><td>No</td><td>No (but kinda)</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Maximum wattage capability</td><td>1,500w</td><td>2,500w</td><td>3,000w</td><td>2,200w @ 40KPH</td><td>2,200w @ 40KPH</td></tr>\n<tr><td> Maximum simulated hill incline</td><td>15%</td><td>25%</td><td></td><td>25%</td><td>20% (and -15% downhill)</td></tr>\n<th><span>Features</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Ability to update unit firmware</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Measures/Estimates Left/Right Power</td><td>Yes</td><td>Yes</td><td>Yes (actually measured independently)</td><td>Yes</td><td>No</td></tr>\n<tr><td> Can rise/lower bike or portion thereof</td><td>No</td><td>No</td><td>No</td><td>No</td><td>Yes</td></tr>\n<tr><td> Can directionally steer trainer (left/right)</td><td>Yes (with compatible apps)</td><td>Planned late 2020</td><td>Yes (with compatible apps)</td><td>YES (WITH COMPATIBLE APPS)</td><td>Yes (with compatible apps)</td></tr>\n<tr><td> Can rock side to side (significantly)</td><td>No</td><td>No</td><td>No</td><td>No</td><td>No</td></tr>\n<tr><td> Can simulate road patterns/shaking (i.e. cobblestones)</td><td>No</td><td>No</td><td>No</td><td>Yes</td><td>No</td></tr>\n<th><span>Accuracy</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Includes temperature compensation</td><td>Yes</td><td>Yes</td><td>Yes</td><td>N/A</td><td>Yes</td></tr>\n<tr><td> Support rolldown procedure (for wheel based)</td><td>N/A</td><td>No</td><td>Cross-references power meter data</td><td>N/A</td><td>N/A</td></tr>\n<tr><td> Supported accuracy level</td><td></td><td>+/- 2%</td><td>+/- 1.5%</td><td>+/- 1%</td><td>+/- 1%</td></tr>\n<th><span>Trainer Control</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Allows 3rd party trainer control</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Supports ANT+ FE-C (Trainer Control Standard)</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Supports Bluetooth Smart FTMS (Trainer Control Standard)</td><td>Yes</td><td>Yes</td><td>YEs</td><td>Yes</td><td>Yes</td></tr>\n<th><span>Data Broadcast</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Transmits power via ANT+</td><td>Yes</td><td>Yes</td><td>YEs</td><td>Yes</td><td>Yes (added Sept 30th, 2020)</td></tr>\n<tr><td> Transmits power via Bluetooth Smart</td><td>Yes</td><td>Yes</td><td>YEs</td><td>Yes</td><td>Yes</td></tr>\n<tr><td> Supports Multiple Concurrent Bluetooth connections</td><td>No</td><td>No</td><td></td><td>No, just one</td><td>Yes, 3 Concurrent</td></tr>\n<tr><td> Transmits cadence data</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td><td>Yes</td></tr>\n<th><span>Indoor Bike Features</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Brake levers or buttons</td><td>Yes</td><td>No</td><td>Yes</td><td>Brake Levers</td><td>Yes</td></tr>\n<tr><td> Shifting type</td><td>Normal bike levers</td><td>Buttons</td><td>Buttons</td><td>Button Based</td><td>Normal bike levers</td></tr>\n<tr><td> Can customize shifting (Shimano/SRAM/Campagnolo)</td><td>No</td><td>No</td><td>Yes (not yet SRAM)</td><td>In future update</td><td>Yes (Shimano/SRAM/Campagnolo)</td></tr>\n<tr><td> Can customize gearing</td><td>Yes (both cassette and chainrings)</td><td>11-speed or 22-speed</td><td>Yes</td><td>Yes</td><td>Yes (both cassette and chainrings)</td></tr>\n<tr><td> Supported Crank Lengths</td><td>170/172.5/175mm</td><td>170mm</td><td>165/170/172.5/175mm</td><td>170/172.5/175mm</td><td>165/167.5/170/172.5/175mm</td></tr>\n<tr><td> Display</td><td>Yes, full screen</td><td>No</td><td>No</td><td>Yes</td><td>Small display near top-tube</td></tr>\n<tr><td> USB Ports</td><td>No (planned for future</td><td>No</td><td>Two Ports (Fast Charging)</td><td>2 USB Ports (2AMP)</td><td>1 USB port</td></tr>\n<th><span>Purchase</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Amazon</td><td></td><td></td><td></td><td><a href=\"https://www.amazon.com/Tacx-Neo-Bike-Smart-Trainer/dp/B07W8YXR93?dchild=1&amp;keywords=Tacx+Neo+bike+smart&amp;qid=1612445168&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=dcb5353cf32c9a37860d44cf29262bb5&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\">Link</a></td><td></td></tr>\n<tr><td> Backcountry.com</td><td></td><td></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2Fstages-cycling-smart-bike%3Fskid%3DSGCA040-ONECOL-ONESIZ%26ti%3DU2VhcmNoIFJlc3VsdHM6c3RhZ2VzIGJpa2U6MToxOnN0YWdlcyBiaWtl\" target=\"_blank\">Link</a></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2FStore%2Fcatalog%2FproductLanding.jsp%3FproductId%3DTAC002Q\" target=\"_blank\">Link</a></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2Fwahoo-fitness-kickr-bike\" target=\"_blank\">Link</a></td></tr>\n<tr><td> Competitive Cyclist</td><td></td><td></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2Fstages-cycling-smart-bike\" target=\"_blank\">Link</a></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2FStore%2Fcatalog%2FproductLanding.jsp%3FproductId%3DTAC002Q\" target=\"_blank\">Link</a></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2Fwahoo-fitness-kickr-bike\" target=\"_blank\">Link</a></td></tr>\n<tr><td> REI</td><td></td><td></td><td></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F152297%2Ftacx-neo-bike-simulator\" target=\"_blank\">Link</a></td><td><a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F142195%2Fwahoo-fitness-kickr-bike-trainer\" target=\"_blank\">Link</a></td></tr>\n<tr><td> Wiggle</td><td></td><td></td><td><a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;clickref=&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fstages-cycling-smart-bike-indoor-trainer%2F\" target=\"_blank\">Link</a></td><td><a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;clickref=&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Ftacx-bike-smart-indoor-trainer%2F\" target=\"_blank\">Link</a></td><td><a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;clickref=&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fwahoo-kickr-bike-smart-trainer\" target=\"_blank\">Link</a></td></tr>\n<th><span>DCRainmaker</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th><tr><td> Review Link</td><td><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">Link</a></td><td><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Link</a></td><td><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Link</a></td><td><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Link</a></td><td><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Link</a></td></tr>\n</tbody>\n</table>\n\n</div>\n<div><table>\n<thead>\n<tr><th><span>Function/Feature</span></th><th><span><a href=\"https://www.dcrainmaker.com/2021/05/truekinetix-truebike-review.html\" target=\"_blank\">TrueKinetix TrueBike</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/10/wattbike-smart-review.html\" target=\"_blank\">Wattbike ATOM 2020</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\" target=\"_blank\">Stages Bike (SB20)</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html\" target=\"_blank\">Tacx NEO Bike Smart</a></span></th><th><span><a href=\"https://www.dcrainmaker.com/2019/12/wahoo-kickr-bike-in-depth-review.html\" target=\"_blank\">Wahoo KICKR Bike</a></span></th></tr>\n</thead>\n<tfoot>\n<tr>\n<td>Copyright DC Rainmaker - Updated May 5th, 2021 @ 8:35 am <a href=\"#\">New Window</a> <a href=\"#\">Expand table for more results<span></span></a></td>\n</tr>\n</tfoot>\n<tbody>\n<tr><td>Price for trainer</td><td>€3,425</td><td>$2,599</td><td>$2899</td><td>$3,199</td><td>$3,499</td></tr>\n<tr><td>Availability regions</td><td>Netherlands/Belgium (North America/Europe Winter 2021-22)</td><td>UK/South Africa/Australia/Scandinavia/USA</td><td>Global</td><td>Global</td><td>Limited Initially</td></tr>\n<tr><td>Power cord required</td><td>No</td><td>Yes</td><td>Yes</td><td>No</td><td>Yes</td></tr>\n<tr><td>Flywheel weight</td><td>Motor driven</td><td>9.28KG/20.4lbs</td><td>50lbs</td><td>Simulated/Virtual 125KG</td><td>13bs/5.9kgs</td></tr>\n<tr><td>Includes motor to drive speed (simulate downhill)</td><td>Yes</td><td>No</td><td>No (but kinda)</td><td>Yes</td><td>Yes</td></tr>\n<tr><td>Maximum wattage capability</td><td>1,500w</td><td>2,500w</td><td>3,000w</td><td>2,200w @ 40KPH</td><td>2,200w @ 40KPH</td></tr>\n<tr><td>Maximum simulated hill incline</td><td>15%</td><td>25%</td><td></td><td>25%</td><td>20% (and -15% downhill)</td></tr>\n<tr><td>Measures/Estimates Left/Right Power</td><td>Yes</td><td>Yes</td><td>Yes (actually measured independently)</td><td>Yes</td><td>No</td></tr>\n<tr><td>Can rise/lower bike or portion thereof</td><td>No</td><td>No</td><td>No</td><td>No</td><td>Yes</td></tr>\n<tr><td>Can directionally steer trainer (left/right)</td><td>Yes (with compatible apps)</td><td>Planned late 2020</td><td>Yes (with compatible apps)</td><td>YES (WITH COMPATIBLE APPS)</td><td>Yes (with compatible apps)</td></tr>\n</tbody>\n</table>\n\n</div>\n\n<p>Oh, and before you ask why I haven’t included some products into the above – here’s the quick and dirty answers:</p>\n<p><strong>Peloton Bike:</strong> It’s not a ‘smart’ bike in the sense of the above, it doesn’t allow you to set a specific power level (it does tell you the current power level). Nor does it have 3rd party app compatibility.</p>\n<p><strong>Peloton Bike+:</strong> Now this could legitimately be added above. However, it has no 3rd party app compatibility, so it seems odd to add it above for now. But you can read <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">my full review of that here</a>.</p>\n<p><strong>SRM Bike:</strong> I just don’t see this as a competitor in this space. At $5,000, it’s mostly for various research purposes and is designed in that realm.</p>\n<p><strong>VirtuPro:</strong> At present this bike isn’t compatible with any 3rd party apps, and in nearly a year since I last chatted with them, I haven’t seen any concrete evidence that’s changed. Here’s my post <a href=\"https://www.dcrainmaker.com/2018/08/virtupros-indoor-smart-bike-the-bike-zwift-is-investing-in-first-look.html\">from nearly 3 years ago</a>.</p>\n<p>Again, I’m more than happy to add products into the database. In general, my rule of thumb is I want hands-on time (or butts-on in this case), and I want some realistic level of clarity on delivery time frames.</p>\n<h3><span>Summary:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4430-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4430_thumb-1.jpg\" /></a></p>\n<p>As with any indoor bike, there are always two sides to the coin. The first side is the hardware. It’s the most visible aspect of it. It’s also arguably one of the more personal aspects. Some people love the look of one bike, while others hate it. But of course it extends beyond that, there’s hardware features. For example, the shifters here are factually more capable than a Tacx NEO Bike. Yet, factually not as capable as the Wahoo KICKR Bike. It’s black and white, and not up for debate or personal feel. Whereas other elements like drivetrain road feel are more subjective. Same goes for whether or not you want a display on the bike. Still, overall at the hardware level, the TrueBike is actually fairly competitive to most bikes. The only one it’s a messy debate on is the KICKR Bike, as the TrueBike lacks the up/down motion and more versatile fit aspects (and the shifting). Of course, the KICKR Bike lacks the display, and all the features it brings with it.</p>\n<p>Next is the software. And this one is a far more complicated pickle to unravel. The TrueBike packs an astounding amount of 2nd-gen features into a 1st-gen bike. For example, I wouldn’t have expected to see user profiles on a first gen release, but the TrueBike has that, and even has a menu for changing profiles easily and saving/naming your paired heart rate sensors. It’s got an entire online platform for viewing and executing structured workouts from and on the bike itself. Nobody else has that (Wattbike does, but only on their commercial bike, the WattBike Atom X). Whether or not you’ll use that instead of another app, I don’t know. Heck, I can even setup two-factor authentication on the bike, for when keeping my wife off the bike with a simple four-digit pin apparently just won’t do. Of course, there’s also elements that are less well refined. You can only change between a few virtual gearsets, and you can’t change shifting styles (e.g. to SRAM/Shimano/Campy). But again – it’s the *ONLY* open-standards bike in this category with WiFi that magically updates itself just like your phone.</p>\n<p>Now – the big question for those in the regions that TrueKinetix sells to is: For basically the same price – this or the KICKR Bike? And that’s a far more difficult question to answer. Many of the added features I just touched on are features you’re unlikely to use day to day in a single-person setup. They’re geared towards multi-user setups. And sure, the KICKR supports multiple riders too, but it requires taking your phone and ensuring it’s changed over to your profile. But the KICKR also has more fit versatility than the TrueBike does. Of course, for the primarily Dutch audience of the TrueBike, that’s probably less an issue.</p>\n<p>Longer term though, I have a funny feeling we’ll see <a href=\"https://truekinetix.com/\">TrueKinetix</a> move faster than Wahoo in adding features – though obviously, Wahoo has a lot already done. TrueKinetix has many ideas for features for this year, ranging from the practical (handles to adjust seatpost/handlebar) to the more advanced (no display option with a mobile app instead). Plus of course their planned distribution expansion into North America and the rest of Europe. All of which is to say that it’s still early days for the TrueBike and TrueKinetix bike, but they definitely aren’t bad days. It’s a solid bike that most riders would be happy with, and sure, like every single first generation smart bikes has a few quirks or things that could be polished – but none of them are show-stoppers.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"bdc317ab404cc7c0950de38d33040f14b987f2b1718eee1876c2f32ec3f495b7","category":"Cycling"}