{"title":"Fish 3D Locomotion app: a user‐friendly computer application package for automatic data calculation and endpoint extraction for novel tank behavior in fish","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15860?af=R","date":1721034939000,"content":"<h2>Abstract</h2>\n<p>This paper introduces the Fish 3D Locomotion app (F3LA), a Python-based, Graphical User Interface (GUI)-equipped tool designed to automate behavioral endpoint extraction in zebrafish locomotion assays. Building on our previous work, which utilized a specialized aquatic tank with a mirror and a single camera for fish movement tracking in three dimensions, F3LA significantly enhances data processing efficiency. Its accuracy was tested by reanalyzing and comprehensively comparing the calculated data with the previously published data from prior publications. From the comparison results, 90% of endpoints showed a similar statistical difference result. These minor differences were due to the different starting points for the dataset and updated calculation formulas that are implemented in F3LA. In addition, shoaling area or shoaling volume calculations are also included in F3LA as a new feature that can serve as sensitive indicators of social cohesion, group dynamics, or stress responses, offering insights into neuropsychological conditions or the effects of pharmacological interventions. Furthermore, F3LA offers a marked improvement over manual operations, being at least five times faster, while maintaining consistent accuracy as it reduces human-induced errors, ensuring a higher degree of reliability in the results. Finally, the potency of F3LA was tested to evaluate the toxicities of 14 rare earth elements (REEs) to the adult zebrafish behaviors. Based on the results, our findings suggested that each tested REE altered fish behaviors in different patterns and magnitudes to each other. However, among the tested light rare earth elements (LREEs), neodymium was demonstrated to cause more relatively severe behavior alterations than other LREEs, indicated by the statistically higher value of entropy (0.2695 ± 0.04977 (mean with a standard deviation)) than the control group (0.2352 ± 0.05896). Meanwhile, in terms of heavy rare earth elements (HREEs), erbium seemed to lead to more distinct behavior toxicities than other HREEs, which was shown by the statistically lower level of fractal dimension (2.022 ± 0.3412) than the untreated group (2.255 ± 0.1661). Taken together, F3LA's development marks a significant advance in high-throughput toxicological and pharmacological assessments in zebrafish, leveraging three-dimensional locomotion data for a more comprehensive analysis of fish behavior performance, providing a significant contribution to research in various fields.</p>","author":"Cao Thang Luong, \nGilbert Audira, \nKevin Adi Kurnia, \nChih‐Hsin Hung, \nChung‐Der Hsiao","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"bdc5a9ca9c20164791b28d9ee4453d61e775321ac263788e3572946046f07fd0","category":"Environment"}