{"title":"The App Store isn’t perfect, but it’s no reason to switch to Android","link":"https://www.macworld.com/article/343143/macalope-app-store-fleeceware-ios-android-switch.html","date":1618304400000,"content":"\n<div>\n<section><div></div></section><p>Are you still using iOS? Well, you might want to stand up because the Forbes contributor network and performative throwing-things-at-the-wall-to-see-if-they-stick circuit says it’s time to head for the door.</p>\n\n\n\n<p>According to Gordon Kelly, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/gordonkelly/2021/04/10/apple-iphone-app-store-fleeceware-scam-iphone-12-pro-max/&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">“Apple Just Gave Millions Of iPad, iPhone Users A Reason To Leave.”</a> (Tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/MacFan2410/status/1381003484942761985&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">Alex</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/gordonkelly/2021/04/10/apple-iphone-app-store-fleeceware-scam-iphone-12-pro-max/?sh=7c2df60a1911&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">JoJoGabo</a>.)</p>\n\n\n\n<p>Again. Because according to Kelly, this exact thing happens <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/gordonkelly/2020/05/21/apple-iphone-ipad-privacy-siri-recordings-ios-upgrade-iphone-11-pro-max-update/&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">on a</a> <a href=\"https://www.macworld.com/article/3435578/exploited-exploits-the-missing-details-of-the-iphone-hack.html\">regular basis</a> for <a href=\"https://www.macworld.com/article/3433950/of-frying-pans-and-fires-despite-mistakes-apple-s-still-better-on-privacy.html\">one reason</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/gordonkelly/2019/08/24/apple-iphone-ipad-privacy-siri-recordings-ios-upgrade-iphone-xs-max-xr-update/?sh=71592161017c&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">another</a>. It’s a miracle anyone uses iOS anymore.</p>\n\n\n\n<blockquote><p>Compounding news that the App Store has a serious problem with fleeceware (apps designed to trick money from users), a senior Apple engineer has been quoted admitting App Store security is grossly inadequate and leaves iPhone and iPad users dangerously exposed to scams. Moreover, new research shows this problem is far worse on iOS than Android.</p></blockquote>\n\n\n\n<p>Kelly gets this from <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.avast.com/fleeceware-apps-on-mobile-app-stores-avast&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">a report from Avast</a>, an ad analytics company. But Avast itself makes no claims in its report about which platform is “worse”, simply noting the numbers, that they found 134 fleeceware apps on iOS and 70 on Android, with iOS users being taken for $365 million and Android users $38 million. Each platform had the same number of downloads of fleeceware apps, about 500,000.</p>\n\n\n\n<p>It’s possible that Avast simply didn’t want to weigh in on which platform was worse, but it’s also possible Avast knew something about its methodology (which it does not detail) that could make cross-platform comparisons difficult. It shouldn’t be terribly surprising that fleecing iOS customers is more lucrative and, therefore, iOS is more of a target. iOS users have always spent more on apps than Android users.</p>\n\n\n\n<blockquote><p>For years, Apple has marketed the superior greater security of its products (and the App Store in particular) compared to rivals and fans have long been prepared to pay the company’s premium prices to benefit from it. Unless serious changes are made, however, that time might be coming to an end.</p></blockquote>\n\n\n\n<p>Apple has over a billion users on iOS, not counting iPadOS. The fact that 0.05 percent of them got cheated is, yes, inexcusable but is unlikely to cause any kind of dramatic change in usage. Not to excuse Apple’s lack of action, but if all those iOS users Kelly is saying have “a reason to leave” actually do switch, it’s perfectly possible that we’d just see a switch from iOS scams making more money to Android scams making more money, if all else stayed the same.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>IDG</p></div>\n\n\n\n<p>All else doesn’t have to stay the same, however. Apple could and absolutely should be doing something more about this. Leave Android out of it — because this analysis doesn’t take into account any number of other factors such as privacy and apps that steal through malware rather than a legitimate payment mechanism — it’s still an unacceptable situation that Apple should fix.</p>\n\n\n\n<p>Avast makes its own suggestions about what Apple and Google could do to make it harder for scammers to rip off customers, such making in-app purchase amounts more obvious and requiring a second confirmation to initiate a subscription after a trial period. There are some relatively simple safeguards Apple could put in place. The fact that it hasn’t is why the ghost of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.goodreads.com/quotes/21810-it-is-difficult-to-get-a-man-to-understand-something&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">Upton Sinclair</a> cannot rest peacefully.</p>\n\n\n\n<p>These revelations are particularly rich as Tim Cook goes on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/us/podcast/sway/id1528594034?i=1000515797139&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">podcasts</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/04/12/tim-cook-epic-games-interview/&amp;xcust=1-1-343143-0-0-0&amp;sref=https://www.macworld.com/feed\">gets interviewed elsewhere</a> about how awesome and innovative the App Store is. If Apple is going to continue to mandate that apps use its own payment mechanism, then it sure as a <em>Star Wars</em> character “having a bad feeling about this” ought to make sure it’s doing everything it can to protect people from getting cheated.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bdc9ec5a436a608762db5849df35fa2c30025a8d31d809856faa9d643b9ff0af","category":"Apple"}