{"title":"Apple Hearing Study Suggests An Estimated 1 in 3 Americans Are Regularly Exposed to Excessive Noise","link":"https://www.macrumors.com/2023/04/27/apple-hearing-study-noise-exposure/","date":1682633220000,"content":"An estimated 1 in 3 Americans are exposed to harmful levels of noise on a regular basis, based on data gathered as part of the <a href=\"https://sph.umich.edu/applehearingstudy/\">Apple Hearing Study</a>. In recognition of International Noise Awareness Day, University of Michigan researchers working on the hearing study in partnership with Apple <a href=\"https://sph-umich.shinyapps.io/ahs-inad-2023/\">shared a blog post</a> noise exposure.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/excessive-noise-apple-watch.jpg\" alt width=\"1500\" height=\"844\" />\r<br />\nExtrapolating data collected from 130,000 Apple Hearing Study volunteers who contributed readings from their Apple Watch between November 2019 and December 2022, the University of Michigan estimated that 77 million adults across the United States are consistently exposed to high noise levels.\r<br />\n\r<br />\nAccording to the World Health Organization and the United States Environmental Protection Agency, an annual average noise exposure level of 70 decibels (dBA) poses no risk for hearing loss, but exposure over 70 dBA can result in damage to hearing.\r<br />\n\r<br />\nThe study assumes that people with repeated daily average noise exposures over 70 dBA likely have an annual noise exposure over 70 dBA, which researchers say can result in hearing issues, irritation, heart problems, and sleep disturbances, in addition to impacting mental health. Higher noise levels for longer time periods can increase risk.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2019/06/watchosnoise.jpg\" alt width=\"800\" height=\"619\" />\r<br />\nThe Apple Watch has a built-in feature for detecting environmental sound level, and it collects data to tabulate an average daily environmental sound exposure level. The information collected by the watch can be located in the Hearing section of the Health app.\r<br />\n\r<br />\nThe Health app will let you know if your noise exposure levels are below 75 dB on average and are \"OK,\" or if you have been repeatedly exposed to higher levels of sound that can impact your health. At 80 dB, 40 hours of exposure over seven days could potentially result in damage, but at 120 dB, 14 seconds over seven days could cause problems. The Apple Watch is able to send an alert when it detects a harmful noise level so you can move to a quieter location.\r<br />\n\r<br />\nPeople in Puerto Rico, Delaware, Rhode Island, Mississippi, and Connecticut experienced the highest noise pollution levels, and adults aged 35 to 44 were more likely to be exposed to high noise levels compared to those in other age groups.\r<br />\n\r<br />\nAdditional details about the study can be found in the full blog post on the <a href=\"https://sph-umich.shinyapps.io/ahs-inad-2023/\">University of Michigan website</a>. To cut down on hearing damage, researchers recommend that those regularly exposed to excessive noise pollution move away from noisy areas and take \"quiet breaks,\" buy quiet appliances, and wear ear muffs and ear plugs when possible.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-research/\">Apple Research</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/27/apple-hearing-study-noise-exposure/\">Apple Hearing Study Suggests An Estimated 1 in 3 Americans Are Regularly Exposed to Excessive Noise</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-hearing-study-suggests-an-estimated-1-in-3-americans-are-regularly-exposed-to-excessive-noise.2388012/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bdc9786ef68f5819a26e93724baff73a72bdd1b4a5f167120bf5665ac4d00295","category":"Apple"}