{"title":"Total triterpenoids from apple peels exert pronounced anti‐breast‐cancer activity in vivo and in vitro","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13745?af=R","date":1721036119000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Apples are among the most nutritionally valuable fruits and have a history of use in traditional Chinese medicine. Triterpenoids, the primary bioactive compounds found in apples, demonstrate significant antitumor activity.</p>\n<h2>RESULTS</h2>\n<p>Following enrichment and optimization, the total content of major triterpenoids in total triterpenoids from apple peels (ATT) reached 5.76 g kg<sup>−1</sup>. The growth of MDA-MB-231 xenograft tumors was significantly inhibited after treatment with ATT. Network pharmacology analysis conclusively identified a close association between the antitumor effect of ATT and the phosphatidylinositol 3-kinase–protein kinase B (PI3K-Akt) signaling pathway. Experimental validation using MDA-MB-231 cells and a xenograft nude mouse model confirmed that ATT suppressed tumor cell proliferation effectively by modulating the PI3K-Akt signaling pathway, which was consistent with the findings from network pharmacology. The total triterpenoids from apple peels also induced cell apoptosis by mediating the PI3K-Akt signaling pathway.</p>\n<h2>CONCLUSION</h2>\n<p>The total triterpenoids from apple peels can inhibit tumor cell proliferation and induce cell apoptosis effectively through the PI3K-Akt signaling pathway, suggesting that ATT holds promise as a prospective therapeutic agent for breast cancer treatment. © 2024 Society of Chemical Industry.</p>","author":"Wanyu Yan, \nCong Chen, \nYuanru Zheng, \nJingwen Xu, \nYihai Wang, \nXiangjiu He","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bdcaa81547aa27f47bc4eaee47ae75b91ce26136e0ed1a7aadbee9335ca40b6a","category":"Environment"}