{"title":"Artificial Neural Networks to Predict Metabolic Syndrome in Adolescents","link":"https://www.preprints.org/manuscript/202408.1032/v1","date":1723682717000,"content":"Background/Objectives: the prevalence of metabolic syndrome (MetS) is increasing worldwide, and an increasing number of cases are diagnosed in younger age groups. This study aimed to propose predictive models based on demographic, anthropometric and clinical non-invasive variables to predict MetS in adolescent. Methods: a total of 2,064 adolescents aged 18-19 from São Luís-Maranhão-Brazil were enrolled. Demographic, anthropometric, and clinical variables were considered, and three criteria for diagnosing MetS were employed: Cook et al. (2003), De Ferranti et al. (2004), and the International Diabetes Federation (IDF, 2007). A feed-forward artificial neural network (ANN) was trained to predict MetS. Accurate, sensitivity, and specificity were calculated to assess the ANN performance. The ROC curve was constructed, and the area under the curve was analyzed to assess the discriminatory power of the networks. Results: the prevalence of MetS in adolescents ranged from 5.7% to 12.3%. The ANN that used the Cook et al. criterion performed best in predicting MetS. ANN 5, which included age, sex, waist circumference, weight, and systolic and diastolic blood pressure, showed the best performance and discriminatory power (sensitivity, 89.8%; accuracy, 86.8%). ANN 3 considered the same variables, except for weight, and exhibited good sensitivity (89.0%) and accuracy (87.0%). Conclusions: using non-invasive measures allows for predicting MetS in adolescents, thereby guiding the flow of care in primary healthcare and optimizing the management of public resources.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bdcbd78c976ad7f4a7e5d0ba58d0be51bebe09e3c536cb1376b943eeebe7f9d8","category":"Interdisciplinary"}