{"title":"Skyller และ AIS ประสานเทคโนโลยี Sensor IoT และโดรนดับเพลิง เพื่อรับมือไฟป่าอย่างทันท่วงที","link":"https://www.blognone.com/node/125614","date":1635910200000,"content":"<div><div><div><p>ปัญหาไฟป่าเป็นปัญหาที่ลุกลามมาตลอดในช่วงหลายปีที่ผ่านมา โดยเฉพาะในเขตพื้นที่ภาคเหนือของไทย ที่มีสภาพอากาศแห้งแล้ง เป็นเหตุให้เกิดประกายไฟและการลุกลามของไฟป่าได้ง่าย ยังรวมถึงกิจกรรมของคนในพื้นที่ที่ก่อให้เกิดไฟลุกลามอยู่บ่อยครั้ง เช่น การจุดไฟเผาพื้นที่ให้โล่งเพื่อเดินทางเข้าไปเก็บของป่า การเผาไร่ก็เพื่อกำจัดวัชพืชหรือเศษซากพืชที่เหลืออยู่ภายหลังการเก็บเกี่ยว</p>\n<p>ไฟป่าเมื่อเกิดขึ้นและลุกลามเป็นวงกว้างก่อให้เกิดความเสียหายต่อระบบนิเวศในพื้นที่ รวมถึงส่งผลให้เกิดหมอกควัน และมลพิษทางอากาศ  PM 2.5 ที่รุนแรงเป็นประจำในช่วงปลายปี ส่งผลกระทบต่อประชาชนในพื้นที่ ส่งผลต่อสุขภาพที่ต้องใช้ชีวิตท่ามกลางมลพิษ และกระทบต่อการท่องเที่ยว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e03254b647109b72807cfd67cd2cd834.jpg\" /></p>\n<p>จากปัญหาเหล่านี้ Skyller หนึ่งในหน่วยธุรกิจภายใต้ บริษัท เอไอ แอนด์ โรโบติกส์ เวนเจอร์ส จำกัด หรือ ARV บริษัทในเครือบริษัท ปตท. สผ. ผู้นำด้านการตรวจสอบอุตสาหกรรมและโครงสร้างพื้นฐานด้วยโดรนและระบบ AI ได้ร่วมกับ AIS ทดสอบการใช้งานระบบ Sensor IoT ร่วมกับโดรนดับเพลิง เพื่อตรวจจับสัญญาณไฟและดับไฟป่าในเบื้องต้น ช่วยให้เจ้าหน้าที่รับมือไฟป่าได้เร็วขึ้น ลดปัญหาความรุนแรงของไฟป่าและผลเสียต่างๆที่ตามมา</p>\n<p>AIS ได้ลงมือศึกษาหาแนวทางเพื่อช่วยเหลือเจ้าหน้าที่ให้รับมือไฟป่าได้อย่างรวดเร็วในช่วงหลายปีที่ผ่านมา ทีม AIS NEXT ซึ่งเป็นหน่วยงานขับเคลื่อนนวัตกรรมของเอไอเอส ได้พัฒนาระบบ Sensor IoT ที่สามารถตรวจจับสัญญาณควัน ความร้อน อุณหภูมิและความชื้น และส่งสัญญาณแจ้งเตือนถึงเจ้าหน้าที่ซึ่งใช้เวลาน้อยกว่า 30 นาที จากปกติต้องใช้เวลา 3 - 6 ชม. ทำให้หลายครั้งการจัดการเรื่องไฟป่าเป็นไปอย่างล่าช้า</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a63994947b12511f4b9820cb63b52ada.jpg\" /></p>\n<p>ด้วยระบบการทำงานประสานกันของ Sensor IoT ที่ติดตั้งกระจายตามจุดเสี่ยงที่เกิดไฟป่าเป็นประจำ ร่วมกับโดรนดับเพลิงอัจฉริยะ ช่วยให้เจ้าหน้าที่รับมือไฟผ่าได้อย่างรวดเร็วและแม่นยำกว่าเดิม การสื่อสารและทำงานที่รวดเร็วนี้ จะช่วยลดปัญหาที่เกิดจากการสื่อสารข้อมูลเชื่องช้า ที่อาจทำให้ไฟลุกลามขยายพื้นที่เป็นวงกว้างโดยที่ไม่อาจควบคุมได้ แต่เมื่อข้อมูลถูกส่งมาโดยเร็ว การรู้เร็ว วางแผนเร็ว เจ้าหน้าที่ก็จะสามารถจัดกำลังคนและจัดการดับไฟป่าได้อย่างทันท่วงที</p>\n<p>หลังจาก Sensor IoT ส่งสัญญาณแจ้งเตือน เจ้าหน้าที่สามารถสั่งการโดรนดับเพลิงที่บินรวมกันเป็นฝูง (Swarm Drone) พร้อมลูกบอลสารเคมีดับเพลิง เพื่อเข้าไปปฏิบัติงาน First Response ป้องกันและควบคุมเพลิงในเบื้องต้นก่อนได้ โดยโดรนจะสามารถตรวจจับจุดความร้อน (Hot Spot) ได้แม่นยำ เพื่อปล่อยลูกบอลดับเพลิงลงจุดที่เกิดไฟไหม้ ลดความรุนแรงของไฟในเบื้องต้น เพื่อชะลอเวลาในการเข้าควบคุมสถานการณ์ได้อย่างทันท่วงที และสามารถทำแนวกันไฟเพื่อป้องกันไม่ให้ไฟลุกลาม</p>\n<p>ระบบโดรนดับเพลิงสามารถตั้งค่าและดูผลการทำงานผ่านแพลตฟอร์ม Skyller เจ้าหน้าที่สามารถนำข้อมูลมาวางแผนและวิเคราะห์การทำงานต่อไปได้ เช่น เกิดปัญหาไฟป่าเพลิงไหม้ที่บริเวณใด จุดเกิดเหตุอยู่ตรงไหน มีอาณาเขตกว้างใหญ่เพียงใด เพื่อจะตีกรอบในการสร้างแนวกันไฟเพื่อใช้ดับเพลิง รวมถึงวางแผนการจัดการอย่างมีประสิทธิภาพ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a597f4e99485e2bb027bd153002d3273.jpg\" /></p>\n<p>Skyller และ AIS ได้ร่วมกันทำการทดสอบครั้งแรกของประเทศไทย เป็นการผสานการทำงานระหว่างระบบ Sensor IoT และ โดรนดับเพลิงพร้อมระบบ AI เข้ามาช่วยจัดการดับเพลิงเบื้องต้นเพื่อไม่ให้ไฟลุกลาม ซึ่งนวัตกรรมนี้จะช่วยอำนวยความสะดวกให้เจ้าหน้าที่ อาสาสมัคร หน่วยกู้ภัย เฝ้าระวังในการรับมือ และวางแผนจัดการปฏิบัติภารกิจเมื่อเกิดไฟป่าได้ และจะช่วยลดความรุนแรงของสถานกาณ์ไฟป่าของประเทศไทยหากมีการนำเทคโนโลยีนี้ไปขยายผลในวงกว้างตามจุดที่เกิดไฟป่าซ้ำเป็นประจำทุกปี</p>\n<p>นอกจากฝูงโดรนปล่อยลูกบอลดับเพลิงแล้ว Skyller ยังพัฒนาโดรนดับเพลิงที่สามารถเอาสายของอุปกรณ์ดับเพลิงทั่วไปจากรถดับเพลิงมาต่อเชื่อม และสามารถบินฉีดน้ำหรือโฟมดับเพลิงบนอาคารสูงเพื่อดับไฟในบริเวณที่อาจเข้าถึงยาก หรือ มีอันตรายหากใช้เจ้าหน้าที่ควบคุมเพลิง นอกจากนี้ยังสามารถใช้ดับเพลิงในอาคาร หรือโกดังขนาดใหญ่ที่ต้องการความรวดเร็วในการเข้าถึง และอาจจะเข้าถึงได้ยาก โดยหวังใช้เทคโนโลยีในการรับมือและแก้ปัญหาภัยพิบัติได้อย่างครอบคลุม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/560b8079eaca9e22e31d928af86cc712.jpg\" /></p>\n<p>ด้วยเทคโนโลยีเหล่านี้ที่ Skyller และ AIS ร่วมกันทดสอบ นับว่าเป็นอีกหนึ่งความสำเร็จในความร่วมมือกันทางเทคโนโลยี เพื่อแก้ปัญหาในวงกว้าง และส่งเสริมให้เกิดความปลอดภัยในแต่ละพื้นที่ เช่น อุทยานแห่งชาติ กรมป่าไม้ รวมถึงตึกสูง หรืออาคารขนาดใหญ่ เช่น โรงงาน โรงแรม อุตสาหกรรม หรือแม้แต่บ้านเรือนประชาชน ทุกกลุ่มธุรกิจในพื้นที่ใกล้เคียงก็ได้รับความปลอดภัยให้กับชีวิตและทรัพย์สินด้วย</p>\n<p>หากท่านสนใจ สามารถอ่านรายละเอียดเพิ่มเติม และติดต่อเราได้ที่ <a href=\"https://bit.ly/31b7MAi\">Skyller.co</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/skyller\">Skyller</a></div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/drone\">Drone</a></div><div><a href=\"/topics/arv\">ARV</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bdd2eecda698319ad3c6136cb726d89e959cd395829f40fae7f8d63256c1c295","category":"Thai"}