{"title":"Potentials of invasive <i>Bidens pilosa</i>, <i>Conyza bonariensis</i> and <i>Parthenium hysterophorus</i> species based on germination patterns and growth traits","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309568","date":1725544800000,"content":"<p>by Rahmah Al-Qthanin, Asmaa M. Radwan, AbdElRaheim M. Donia, Mohamed A. Balah</p>\r\n\r\nInvasive alien species drive extensive ecological changes and cause unexpected risks worldwide. Perceptive germination requirements and the growth function of invasive species are crucial for understanding their invasion and subsequent dissemination in various environmental conditions. Therefore, the germination response of invasive <i>Conyza bonariensis</i>, <i>Parthenium hysterophorus</i>, and <i>Bidens pilosa</i> of Asteraceae family were examined under alternating temperature regimes and some environmental factors. The prevailing germination ability occurs highest at moderate-temperature regimes at 20/30°C attained by 94.83% (<i>C</i>. <i>bonariensis</i>) and at 20/25 SS by 96.28% (<i>P</i>. <i>hysterophorus</i>) and high-temperature regimes at 25/30°C reached 92.94% (<i>B</i>. <i>pilosa</i>) respectively. The half germination percentage (G<sub>50</sub>) was -0.406 MPa and 2878.35 ppm (<i>B</i>. <i>pilosa</i>), -0.579 MPa and 2490.9 ppm (<i>C</i>. <i>bonariensis</i>), and<i>—</i>0.32 MPa and 2490.8 ppm (<i>P</i>. <i>hysterophorus</i>) affected by osmotic pressure and salt stress (NaCl) respectively. The highest growth plasticity characteristics were identified in total dry mass attained at 0.968 (<i>C</i>. <i>bonariensis</i>), 0.985 (<i>B</i>. <i>pilosa</i>) and 0.957 (<i>P</i>. <i>hysterophorus</i>) respectively. The relative growth, net assimilation and plasticity index appeared higher in both <i>B</i>. <i>pilosa</i>, and C. <i>bonariensis</i> than <i>P</i>. <i>hysterophorus</i> in the invaded area. In conclusion, germination and growth traits are precisely functional factors that correlate to invasion success under stressed conditions, and zones, and also lead to successful control plans for invasive species and ecological protection.","author":"Rahmah Al-Qthanin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bdd85615bdb425a4891f1a0714d38d37d6fb1bc25346ab26509fea05edce4517","category":"Interdisciplinary"}