{"title":"Adobe Launches Creative Cloud Express App With Drag-and-Drop Content Creation","link":"https://www.macrumors.com/2021/12/13/adobe-creative-cloud-express/","date":1639412656000,"content":"Adobe today <a href=\"https://blog.adobe.com/en/publish/2021/12/13/introducing-creative-cloud-express\">announced</a> the launch of <a href=\"https://www.adobe.com/express/\">Creative Cloud Express</a>, an app and web-based service that allows for drag-and-drop content creation, ranging from social media posts to marketing materials like logos, flyers, and banners.  \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/adobe-creative-cloud-express.jpg\" />\r\n<br />\r\nCreative Cloud Express offers thousands of templates, 20,000 fonts, 175 million royalty-free Adobe stock images, and other design assets. \"Quick Actions\" powered by Adobe Sensei machine learning allow users to remove backgrounds from photos, trim and merge videos, turn videos into GIFs, convert/export PDFs in a few clicks, and more.\r\n<br />\r\n\r\n<br />\r\nAdobe's head of Creative Cloud, Scott Belsky:<blockquote>Creative Cloud Express is perfect for people with no creative training. But it's also a great addition to the toolkit of creative professionals. If you just want to make a social media post, produce a simple flyer, resize an image, or craft a quick thumbnail image for your Premiere Pro video, Creative Cloud Express is the fast and easy way to go. And Creative Cloud and Creative Cloud Express are connected through Libraries, Shared Templates and Shared Brands, which makes it easy for creative pros to share work with people with less formal training.</blockquote>The free version of Creative Cloud Express includes basic editing and photo effects, access to a limited collection of design assets, and 2GB of cloud storage. For <a href=\"https://www.adobe.com/express/pricing\">$9.99 per month or $99.99 per year</a>, users can get access to the entire collection of design assets, premium \"Quick Actions\" like Refine Cutout and Resize, the ability to convert and export to and from PDFs and other file types, 100GB of cloud storage, and more.\r\n<br />\r\n\r\n<br />\r\nCreative Cloud Express is also included with existing Creative Cloud Single App plans over $20.99 per month and the Creative Cloud All Apps plan.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nCreative Cloud Express is <a href=\"https://www.adobe.com/express/\">available on the web</a> and as an <a href=\"https://apps.apple.com/us/app/creative-cloud-express-design/id1051937863\">iPhone and iPad app on the App Store</a>. The app was previously known as Adobe Spark Post.<div>Tag: <a href=\"https://www.macrumors.com/guide/adobe/\">Adobe</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/13/adobe-creative-cloud-express/\">Adobe Launches Creative Cloud Express App With Drag-and-Drop Content Creation</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/adobe-launches-creative-cloud-express-app-with-drag-and-drop-content-creation.2327322/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=apNcqzCtFP8:ssjB0WxxooU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=apNcqzCtFP8:ssjB0WxxooU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bddfb9cf2aff03df611a428516b384e5e5e00c116841dff033dc2b97eab5bd03","category":"Apple"}