{"title":"Evaluation of Larval Sea Lamprey Petromyzon marinus Growth in the Laboratory: Influence of Temperature and Diet","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5547340?af=R","date":1706860800000,"content":"<p>Conservation aquaculture provides a means for promoting environmental stewardship, useful both in the context of restoring native species and limiting the production of invasive species. Aquaculture of lampreys is a relatively recent endeavor aimed primarily at producing animals to support the restoration of declining native populations. However, in the Laurentian Great Lakes, where sea lamprey <i>Petromyzon marinus</i> are invasive, the ability to acquire a reliable source of certain life stages would be a significant benefit to those controlling their populations and studying the species. Here, we apply methodologies developed for Pacific lamprey <i>Entosphenus tridentatus</i> restoration to investigate the feasibility of rearing larval sea lamprey under laboratory conditions. In two experiments lasting 3 and 9 months, we tested the effects of different dietary sources and water temperature (ambient and controlled) on the survival and growth of wild-caught larvae. Rearing conditions had no effect on mortality, as larval survival was 100% in both experiments. Growth was significantly affected by water temperature, with the highest average daily growth rates observed at 22 and 15°C (0.14 mm day<sup>−1</sup>) and lowest at 8°C (0.06 mm day<sup>−1</sup>). Diets of yeast alone (0.19 and 0.21 g L<sup>−1</sup>) performed better than those comprising a mixture of yeast and other material when fed 3 times weekly (rice flour, wheat flour, fish meal; 0.19 and 0.32 g L<sup>−1</sup>). Averaged across the three constant temperatures (8, 15, and 22°C), larvae fed on yeast grew 0.13 mm day<sup>−1</sup> and 0.01 g day<sup>−1</sup>, whereas on yeast + fish meal, they grew 0.09 mm day<sup>−1</sup> and 0.01 g day<sup>−1</sup>. At ambient temperature (4–20°C), larvae fed on yeast grew 0.15 mm day<sup>−1</sup> and 0.01 g day<sup>−1</sup>, whereas those fed on yeast + wheat flour grew 0.13 mm day<sup>−1</sup> and 0.008 g day<sup>−1</sup> and those fed on yeast + rice flour grew 0.12 mm day<sup>−1</sup> and 0.009 g day<sup>−1</sup>. An experimental duration of 90 days was sufficient to detect significant changes to larval sea lamprey growth stemming from temperature variation. Overall, rearing of sea lamprey in captivity appears feasible at low density (31–32 g m<sup>−2</sup> and 17–25 larvae m<sup>−2</sup>), but uncertainties remain regarding the most appropriate means of providing adequate feed for these fish in high-density conditions.</p>","author":"John B. Hume, \nSkyler Bennis, \nTyler Bruning, \nMargaret F. Docker, \nSara Good, \nRalph Lampman, \nJacques Rinchard, \nTrisha Searcy, \nMichael P. Wilkie, \nNicholas S. Johnson, \nJianguang Qin","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bddfd1bb5d704000d22b9006c4323c7d8c39a5bd9470b3c240b0a3dfd49674b5","category":"Environment"}