{"title":"In Vitro Quality Assessment of Glibenclamide Tablets: Reference, Generic and Similar Drugs","link":"https://www.preprints.org/manuscript/202409.0976/v1","date":1726133100000,"content":"Introduction: Pharmaceutical tablets are solid forms administrated orally and they constitute 80% of the market because of its best stability and ease of large-scale production, adherence and treatment. The Brazilian Legislation establishes that for a drug to be registered as a similar or generic drug is necessary to verify the pharmaceutical equivalence in relation to the reference drug, indicated by ANVISA, through quality control tests, ensuring that the drug is approved with satisfactory quality. Objective: to evaluate the reference, generic and similar glibenclamide tablets through quality control tests, comparing the results with each other and relate clinical impacts on the patient in the face of changes in the quality control of medicines. Methodology: tests of average weight, friability and disintegration were done, according to the Brazilian Pharmacopoeia VI Edition, in uncoated tablets of Glibenclamide 5mg Reference (Daonil), Generic (Glibenclamide) and Similar (Glionil), and the results obtained were compared with the that advocates the scientific literature. Results: Data referring to the average weight: Reference 0.1591g, Generic 0.1002g and Similar 0.0996g; For friability: Reference value 0.54%, Generic value 0.49% and Similar value 0.28%. The disintegration tests showed the following times: Reference 35 seconds, Generic 29 seconds and Similar 33 seconds. Conclusion: the tests to which the glibenclamide tablets were submitted showed results within the parameters established by the Brazilian Pharmacopoeia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bde360c107ca88460c2316c5baf78932865697cca865251140255c9d2eeb057d","category":"Interdisciplinary"}