{"title":"Hint the Hidden Heirloom","link":"https://neizod.dev/2023/08/19/hint-hidden-heirloom.html","date":1692402503000,"content":"<p>Consider a magic trick where 8 volunteers are randomly selected from the audience. The selected volunteers are lined up on the stage, each possessing a stool. The magician picks an object as a treasure,  a heirloom maybe (whether it’s a coin, a card, <a href=\"//en.wikipedia.org/wiki/One_Ring\">one ring</a>, etc.), and gives it to the group, then leaves the room. The group decides for one person to “hide” the treasure in their pocket, then return to their stool. Now each of them has their own free will to either sit down or just stand still. The magician’s assistant, witnessing the entire event, selects exactly one volunteer and instructs him/her to sit down if he/she is already standing, or vice versa. Afterward, the magician returns to the stage and accurately points out the volunteer who possesses the treasure. (Of course, there’s no mean of communication between the magician and the assistant.)</p>\n\n<blockquote>\n  <table>\n  <tr>\n    <th>treasure?</th>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n  </tr>\n  <tr>\n    <th>stand?</th>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n    <td>\n      <div></div>\n      \n    </td>\n  </tr>\n  <tr>\n    <th>name:</th>\n    <td>A</td>\n    <td>B</td>\n    <td>C</td>\n    <td>D</td>\n    <td>E</td>\n    <td>F</td>\n    <td>G</td>\n    <td>H</td>\n  </tr>\n</table>\n  <div>\n  <div>\n    <h3>assistant</h3>\n    <div>\n      <div>protocol:</div>\n      <div>\n        <div>\n          \n            \n            \n            \n          \n        </div>\n        <div></div>\n      </div>\n      <div>go!</div>\n    </div>\n    <p> </p>\n  </div>\n  <div>\n    <h3>magician</h3>\n    <div>\n      <div>protocol:</div>\n      <div>\n        <div>\n          \n            \n            \n            \n          \n        </div>\n        <div></div>\n      </div>\n      <div>go!</div>\n    </div>\n    <p> </p>\n  </div>\n</div>\n  \n\n  \n\n  <p>Interactive simulation of this magic trick</p>\n</blockquote>\n\n<p>How could this magic work? In other words, what is the protocol the magician and the assistant agreed in prior so they can “hint” the right person using only one alteration over a seemingly random information?</p>\n\n<p>Side note: I’ve seen this magic trick countless times. IIRC, the very first time was w/ my com-sci friends. Besides, TED-Ed already covered this <a href=\"//youtu.be/i0WH4SFpeB8\">riddle</a> with an excellent solution two years ago. However, I find their solution to be too magical. Therefore, I’d like to present you yet another lengthily train-of-thought on how to tackle the problem.</p>\n\n<h2>Trivial case</h2>\n\n<p>We may first take a look at the most trivial case. What if everyone sat down initially? The assistant would only need to pick the one with the treasure to stand up. That’s the most straightforward technique. Right?</p>\n\n<p>What if everyone is standing instead? Well, this technique still works, since the assistant can just call the one with the treasure to sit down.</p>\n\n<p>How about only one standing? We can see that this technique is not possible anymore, since the assistant must change one person. So after that either two person standing or no one standing. Either way, the information is loss.</p>\n\n<p>Since we cannot generalize this technique to every initial sit-stand combination, we can’t be sure if the correct solution produce the same result. Still, it’s a good start to have them and we’ll note those two solutions for future use.</p>\n\n<h2>Left or right?</h2>\n\n<p>When faced with such challenges, one approach is to take a step back and <em>relax</em>. Both in relaxing our mind and the constraints of the puzzle. What if we don’t need to pin point the one who keep the treasure, for now. But we just only need to tell which side of the stage the treasure belongs to?</p>\n\n<p>Let’s consider the previous unsolved case of one standing volunteer. It is easy to see that there are 4 possibilities initially: the standing person is on either on the left or right side of the stage, and also the treasure.</p>\n\n<blockquote>\n  <p><img src=\"/images/algorithm/hint-treasure/table.png\" alt /></p>\n\n  <p>All possibilities when considered only left-right</p>\n</blockquote>\n\n<p>We only need to categorize the possibilities into 2 groups, after we order one person to stand up/sit down, so now there are 0 or 2 persons standing.</p>\n\n<p>How about we make a rule that the side with persons standing should contains the treasure? We can see that this rule is quite redundant since if there are persons standing on the left side, then there should be no persons stand on the right side, and vice versa. And this rule will be useless when the initial standing person is on the different side of the treasure. Because</p>\n\n<ol>\n  <li>if we order the standing person to sit down, we lost information (no one standing),</li>\n  <li>if we order another person on the same side to stand up, we give wrong hint, and</li>\n  <li>if we order another person on the different side to stand up, we lost information (both side standing).</li>\n</ol>\n\n<p>So, what if we just check only one side, say, the right side. If we see persons standing on the right side, then we say that the treasure is on the right side, otherwise the treasure is on the left? This rule is just work, since</p>\n\n<ol>\n  <li>treasure left, standing left: we order another person on the left to stand up,</li>\n  <li>treasure left, standing right: we order the standing person to sit down,</li>\n  <li>treasure right, standing left: we order another one on the right to stand up, and</li>\n  <li>treasure right, standing right: we order another one on the right to stand up.</li>\n</ol>\n\n<p>Let’s check with our trivial case. If everyone sat down, we can just order one on the correct side to stand up. And… uh oh, this rule broke again when everyone is already standing in the first place.</p>\n\n<p>What is the natural way to “fix” this issue? Well, recalled the solution to the case of everyone standing, we let one with treasure sit down. So the side with treasure has odd number of people standing instead.</p>\n\n<blockquote>\n  <p><img src=\"/images/algorithm/hint-treasure/alteration.png\" alt /></p>\n\n  <p>Example alteration that yields a consistent hinting system</p>\n</blockquote>\n\n<p>Thus, we modify the rule to <em>count</em> how many people standing up on the right side instead. If the number of people is odd, then we say that the treasure is on the right side.</p>\n\n<p>A quick check on this new rule confirms that it solves the case of one person standing initially, as well as those two trivial cases. In fact, it pass every case where arbitrary number of people standing initially. Because no matter the initial configuration, if the right side has an incorrect number of people standing, then we order one person on the right side to stand/sit (and if the right side is correct in the first place, we just order a person on left side instead).</p>\n\n<h2>Recursionization</h2>\n\n<p>Now we know how to solve the problem in the relaxed setting, we of course want to generalize it back to the original setting. So our problem is, after we know the correct left/right side, how can we narrow the search space down further more?</p>\n\n<p>We can directly adapt the previous technique right away. That is we would like to split the group of 8 people into two half, then ask which half the treasure belongs to. The main different is that we don’t want to split them into the same previous left/right group.</p>\n\n<p>What is the most natural way, or even the easiest way to do that? If we think recursively, it is obvious that we can split each previous left/right group into another left/right group again. The 2nd layer of left/right group to narrow down the treasure to 2 person.</p>\n\n<p>Of course, we need the 3rd layer to pin-point the person with the treasure.</p>\n\n<blockquote>\n  <p><img src=\"/images/algorithm/hint-treasure/algorithm.png\" alt /></p>\n\n  <p>Put it all together for an algorithm</p>\n</blockquote>\n\n<p>And that’s it. This is the protocol to <em>hint</em> at which person is holding the treasure. To recap the algorithm, let’s us first label the volunteers from left to right with binary number from 000 to 111. Ultimately, we want to find volunteers with label in form of $\\underline{abc}$ (here, variables with underline indicate that it is a number with each variable treated as a digit, not a multiplied by juxtaposition). So that we can make alteration and perform revelation.</p>\n\n<p>Our first goal is to find the 3-digit binary number $\\underline{\\ell mr}$ for the volunteer to sit/stand. The assistant need to do these steps:</p>\n\n<ol>\n  <li>Count how many standing volunteers whose leftmost digit is 1 (100, 101, 110, 111).</li>\n  <li>For odd count: check if the treasure belongs to this group? If yes then set $\\ell$ to 0, otherwise set to 1.</li>\n  <li>For even count: check if the treasure belongs to this group? If yes then set $\\ell$ to 1, otherwise set to 0.</li>\n  <li>Repeat step 1-3, but this time consider volunteers whose middle digit is 1, and store the result in variable $m$.</li>\n  <li>Repeat step 1-3, but this time consider volunteers whose rightmost digit is 1, and store the result in variable $r$.</li>\n  <li>Order the volunteer with label $\\underline{\\ell mr}$ to stand up/sit down.</li>\n</ol>\n\n<p>Our second goal is to find the label $\\underline{LMR}$ for the correct person with the treasure. The magician follows this protocol:</p>\n\n<ol>\n  <li>Count how many standing volunteers whose leftmost digit is 1 (100, 101, 110, 111).</li>\n  <li>If the count is odd, then set $L$ to 1, otherwise set to 0.</li>\n  <li>Repeat step 1-2, but this time consider volunteers whose middle digit is 1, and store the result in variable $M$.</li>\n  <li>Repeat step 1-2, but this time consider volunteers whose rightmost digit is 1, and store the result in variable $R$.</li>\n  <li>Point that the volunteer with label $\\underline{LMR}$ must possess the treasure.</li>\n</ol>\n\n<h2>Bitwise XOR scheme</h2>\n\n<p>The previous protocol already answer our curiosity on how one can make the magic works. However, it is quite hard to pull off in the real magic since the protocol is a bit complicated. Luckily, there is an equivalent way to do this using <a href=\"//en.wikipedia.org/wiki/Exclusive_or\"><em>exclusive or</em></a> (XOR, binary operation: $\\oplus$) on binary numbers.</p>\n\n<p>We first consider the magician’s protocol (since it is easier). By reusing the 3-digit binary number $\\underline{LMR}$ for the correct person who held the treasure, we have these equations for each digit</p>\n\n\\[\\begin{matrix}\nL &amp;=&amp; \\bigoplus\\lbrace &amp;&amp;&amp;&amp; {\\color{green}X_{100}}, &amp; {\\color{blue}X_{101}}, &amp; {\\color{indigo}X_{110}}, &amp; \\color{purple}X_{111} &amp; \\rbrace, \\\\\nM &amp;=&amp; \\bigoplus\\lbrace &amp;&amp; {\\color{orange}X_{010}}, &amp; {\\color{olive}X_{011}}, &amp;&amp;&amp; {\\color{indigo}X_{110}}, &amp; \\color{purple}X_{111} &amp; \\rbrace, \\\\\nR &amp;=&amp; \\bigoplus\\lbrace &amp; {\\color{red}X_{001}}, &amp;&amp; {\\color{olive}X_{011}}, &amp;&amp; {\\color{blue}X_{101}}, &amp;&amp; \\color{purple}X_{111} &amp; \\rbrace,\n\\end{matrix}\\]\n\n<p>where $X_k$ of value 1 represents that the volunteer $k$ is standing <em>after</em> the assistant order someone to sit/stand. Thus the magician can just compute</p>\n\n\\[\\begin{align}\n\\underline{LMR}\n&amp;= 100{\\cdot}L \\;\\oplus\\; 010{\\cdot}M \\;\\oplus\\; 001{\\cdot}R \\\\\n&amp;= \\bigoplus\\begin{bmatrix}\n&amp;&amp;&amp; 100\\color{green}X_{100} &amp; 100\\color{blue}X_{101} &amp; 100\\color{indigo}X_{110} &amp; 100\\color{purple}X_{111} \\\\\n&amp; 010\\color{orange}X_{010} &amp; 010\\color{olive}X_{011} &amp;&amp;&amp; 010\\color{indigo}X_{110} &amp; 010\\color{purple}X_{111} \\\\\n 001\\color{red}X_{001} &amp;&amp; 001\\color{olive}X_{011} &amp;&amp; 001\\color{blue}X_{101} &amp;&amp; 001\\color{purple}X_{111} \\\\\n\\end{bmatrix} \\\\\n&amp;= \\bigoplus \\lbrace {\\color{red}001X_{001}}, {\\color{orange}010X_{010}}, {\\color{olive}011X_{011}}, {\\color{green}100X_{100}}, {\\color{blue}101X_{101}}, {\\color{indigo}110X_{110}}, {\\color{purple}111X_{111}} \\rbrace \\\\\n&amp;= \\bigoplus_k k {\\cdot} X_k.\n\\end{align}\\]\n\n<p>In other words, the magician just XOR label of everyone who’s standing up to find to correct person.</p>\n\n<p>We can also simplify assistant’s protocol for $\\underline{\\ell mr}$ in a similar manner too. Let $x_k$ represent volunteer $k$ is sat/standing <em>before</em> the assistant made an order. Thus, the system of equations are</p>\n\n\\[\\begin{matrix}\n\\ell &amp;=&amp; \\bigoplus\\lbrace &amp; L, &amp;&amp;&amp;&amp; {\\color{green}x_{100}}, &amp; {\\color{blue}x_{101}}, &amp; {\\color{indigo}x_{110}}, &amp; \\color{purple}x_{111} &amp; \\rbrace, \\\\\nm &amp;=&amp; \\bigoplus\\lbrace &amp; M, &amp;&amp; {\\color{orange}x_{010}}, &amp; {\\color{olive}x_{011}}, &amp;&amp;&amp; {\\color{indigo}x_{110}}, &amp; \\color{purple}x_{111} &amp; \\rbrace, \\\\\nr &amp;=&amp; \\bigoplus\\lbrace &amp; R, &amp; {\\color{red}x_{001}}, &amp;&amp; {\\color{olive}x_{011}}, &amp;&amp; {\\color{blue}x_{101}}, &amp;&amp; \\color{purple}x_{111} &amp; \\rbrace.\n\\end{matrix}\\]\n\n<p>Which summarized to</p>\n\n\\[\\underline{\\ell mr} = \\left( \\bigoplus_k k{\\cdot}x_k \\right) \\oplus \\underline{LMR}.\\]\n\n<p>That is the assistant will do everything as same as the magician: XOR everyone who’s standing up. Then make another extra step: XOR the result with the correct person who hid the treasure.</p>\n\n<h2>Multiple way to hint</h2>\n\n<p>As a rule of thumb, magic tricks should be performed only once. Otherwise, they are prone to be <em>solved</em> by the audience, making the magic feel less <em>magical</em>… (but it depends; for us mathematicians, knowing the trick makes it feel more <em>magical</em>, right?)</p>\n\n<p>Luckily, this magic trick can be performed more than once. The easiest way is to swap the representation for sit/stand. In the previous protocol, we let stand = 1 and sit = 0. To deceive some audience who think they’ve already figured out the trick, we can flip the protocol to stand = 0 and sit = 1 instead.</p>\n\n<p>And that’s just one way to obscure the trick. In fact, we can choose any permutation for labeling volunteers. Thus, there are $8!$ distinct ways to obfuscate the protocol.</p>\n\n<p>Lastly, the trick can be adapted to work with a different number of volunteers too, as long as the number of volunteers is in form of $2^n$. Why? Well, maybe I’ll leave it as an exercise…</p>\n\n<p>Have fun performing this magic trick IRL 😊</p>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"bde6bfa8f10c98627eb7c48e4c8c331bafded07be6f750f383898be9721d2caf","category":"Thai"}