{"title":"Correlation of Albumin, Red Cell Distribution Width and Other Biochemical and Hematological Parameters with Glycated Hemoglobin in Diabetic, Prediabetic and Non-diabetic Patients","link":"https://www.preprints.org/manuscript/202407.0565/v1","date":1720422250000,"content":"Diabetes mellitus is a chronic metabolic disease that affects over 10.5 percent of the global adult population. Biochemical and hematological parameters such as albumin (ALB) and red cell dis-tribution width (RDW) have been shown to be altered in diabetic patients. This study aims to cor-relate hematological and biochemical parameters with glycated hemoglobin (HbA1c). 777 adult individuals (372 women and 405 men, aged 19-85 years) were divided into three groups: 218 par-ticipants with HbA1c &lt; 5.7% (group A: non diabetic), 226 with HbA1c ≥ 5.7% and &lt; 6.5% (group B: prediabetic) and 333 with HbA1c ≥ 6.4% (group C: diabetic). Biochemical and hematological parameters were compared among the 3 groups. Analysis of variance was performed to deter-mine the correlations of the parameters among groups. ALB and sodium (Na) levels were signifi-cantly decreased in group C compared to groups A (ALB: 3.8 g/dL vs. 4.1 g/dL, p &lt; 0.0001, Na: 138.4 mmol/L vs. 139.3 mmol/L, p &lt; 0.001), and B (ALB: 3.8 g/dL vs. 4.0 g/dL, p &lt; 0.0001, Na: 138.4 mmol/L vs. 139.6 mmol/L, p &lt; 0.0001), while RDW-standard deviation (RDW-SD) and urea were increased in group C compared to group A ( RDW: 45.8 vs. 43.9 fL, p &lt; 0.0001, Urea: 55.6 mg/dL vs. 38.5 mg/dL, p &lt; 0.0001) . Mean platelet volume (MPV) was increased in group C com-pared to group A (9.3 fL vs. 9.1 fL, p &lt; 0.05, respectively). Τhe increase of RDW-SD from group A towards B and C demonstrates the impact of hyperglycemia on red blood cells. RDW may be re-garded as a potential innovative biomarker for improving risk assessment of developing diabetes. These results highlight the potential role of these parameters as an indication for prediabetes that would alert for measurement of HbA1c.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bdea3d30bb0c36f5619dda8ec7c009020622438602e6ecfeb527b991fb03e373","category":"Interdisciplinary"}