{"title":"Seasonal variation in attraction to plant volatiles by Cacopsylla pyricola (Foerster) (Hemiptera: Psyllidae)","link":"https://academic.oup.com/ee/article/53/4/677/7679483?rss=1","date":1716336000000,"content":"<span><div>Abstract</div>Pear psylla, <span>Cacopsylla pyricola</span> (Foerster) (Hemiptera: Psyllidae), occurs as 2 seasonal morphotypes. Summerforms occur on pear (<span>Pyrus communis</span> L.; Rosales: Rosaceae) where they are a significant pest. The larger and darker winterform morphotype develops in response to shortening daylengths and begins winter in reproductive diapause characterized by the absence of ovarian development. Diapausing winterforms often leave pear to overwinter on coniferous shelter plants and then return to pear in late winter and early spring to begin depositing the eggs that produce the first summerform generation. <span>Cacopsylla pyricola</span> adults are attracted to the color of foliage most of the year, but little is known about the role of plant volatiles in host finding and in seasonal dispersal between host and shelter plants by the psyllid. We used a Y-tube olfactometer and choice assays to investigate the response by <span>C. pyricola</span> adults to volatiles emitted by pear and an evergreen tree (cypress) often used as a shelter plant by wintering <span>C. pyricola</span>. Attraction to pear and cypress volatiles varied by season, tree phenology, and psyllid physiology. <span>Cacopsylla pyricola</span> were attracted to cypress volatiles and preferred to settle on cypress shoots during winter and early spring but then shifted to a marked preference for the pear developmental host in late spring and summer. Female <span>C. pyricola</span> exhibited stronger responses to pear volatiles than did males. Our study is the first to show that plant volatiles have a role in host finding by <span>C. pyricola</span> and provides a foundation for research on chemical ecology and management of <span>C. pyricola.</span></span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"bdf39420f1d0e00159f1586f447d0f5d4310944894e956bf2f3852b27b7618e2","category":"Environment"}