{"title":"PSV-5 Influence of an oregano-based essential oil on growth performance and carcass traits of beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_2/274/7664864?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to determine the influence of an oregano-based essential oil on growth performance, health outcomes, and carcass characteristics of yearling beef steers finished in an all-natural program. Single-sourced yearling steers [n = 128; initial body weight (BW) = 335 ± 7.98 kg] were allotted to 16 pens (n = 8 pens/treatment with 8 steers/pen). Steers were blocked by initial BW grouping in a Randomized Complete Block Design (n = 8 blocks total). Groups consisted of 1) control group fed no oregano-based essential oil product (CON) and 2) group fed 4 g/steer daily of By-O-Reg+ Beef (Advanced Ag Products, Canton, SD; OEO). Steers were individually weighed on d 0 (arrival), d 38, d 66, d 108, and d 149 for growth performance measures. Steers were transitioned from a 70% concentrate diet to a diet that contained 90% concentrate over 14 d and remained on the finishing diet until harvest on d 149. The finishing diet provided 1.37 Mcal/kg of NEg. Steers were evaluated daily for indications of disease or visible digestive disorders by a trained technician blinded to the treatments. Steers were fed until visually assessed to have 1.27 cm rib fat and were shipped for harvest at a commercial processing facility. Liver scores and hot carcass weights were recorded at the time of harvest and steer identity was maintained throughout the harvest process. Following an approximately 24 h chilling period, carcass data were recorded, and USDA Yield and Quality Grade were determined. Health outcomes were not influenced by dietary treatment (<span>P</span> ≥ 0.18). Inclusion of OEO did not influence (<span>P</span> ≥ 0.73) carcass-adjusted final BW, DMI, average daily gain (ADG), gain:feed, observed dietary NEm or NEg, observed-to-expected dietary NEm or NEg. In addition, no differences (<span>P</span> ≥ 0.30) were observed between treatment groups for hot carcass weight, dressing percentage, ribeye area, rib fat thickness, calculated yield grade, marbling score, estimated empty body fat percentage, or distribution of USDA Yield and Quality Grades. The OEO treatment tended (<span>P</span> = 0.11) to have a decreased percentage of normal liver scores compared with CON. Collectively, growth performance and carcass traits of yearling steers finished in an all-natural program in this experiment were not influenced by dietary inclusion of an oregano-based essential oil.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"be0a17aca0390b8d5b6ac0f6da4dde4215fb8e30e3e24d8144a4acbf69a66ab0","category":"Environment"}