{"title":"DNA Barcoding of Catfishes (Order: Siluriformes) with New Records of Two Species from Eastern Nepal","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/4907672?af=R","date":1724060093000,"content":"<p>The freshwater bodies of Nepal host a great deal of fish diversity; however, the molecular study of Nepalese fish is still in its early stages. Conservation management tactics require knowledge of the real species composition, often impeded by descriptions of intermittent species based on traditional taxonomy. Catfish, one of the most overfished taxa on the planet, are abundant and heavily exploited in the eastern region of Nepal. Hence, actual catfish diversity in this region needs to be examined using a combined morphological and molecular DNA barcoding approach. In this study, we sequenced the cytochrome oxidase subunit I (COI) gene in Nepalese fish species for the first time and used it for molecular identification. Altogether, 99 specimens representing 29 species belonging to 21 genera and 8 families were successfully barcoded. They were found to be 98.5–100% identical to the known sequences deposited in the GenBank and BOLD databases. Of these, two species, <i>Amblyceps arunachalense</i> and <i>Erethistoides sicula</i>, were recorded for the first time in Nepal. Out of 29 species, one species was found to be Endangered, one species under Vulnerable, two species under Near Threatened, one species under Data Deficient, and 24 species under Least Concern. The intraspecific genetic distances within species ranged from 0 to 5%. The highest intraspecific genetic distances (Kimura 2-parameter) were found among the individuals of two species, namely, <i>E. sicula</i> (4%) and <i>Glyptothorax telchitta</i> (5%), indicating the presence of putative (sub)species. The interspecific genetic distances among the catfishes in eastern Nepal ranged between 8.47% (between <i>Glyptothorax trilineatus</i> and <i>G. cavia</i>) and 26.38% (between <i>Amblyceps arunachalense</i> and <i>Chaca chaca</i>). The GC content at the 1<sup>st</sup>, 2<sup>nd</sup>, and 3<sup>rd</sup> positions of the codons was found to be 42.4%, 49.3%, and 43.8%, respectively. These findings will support future initiatives for fish resource inventory, monitoring, and management. It is also an important input to the DNA barcode library of catfish in the eastern region of Nepal.</p>","author":"Jash Hang Limbu, \nDipak Rajbanshi, \nLaxman Khanal, \nWang Hui, \nRam Chandra Adhikari, \nSunita Thapa, \nJin Quan Yang, \nChenhong Li, \nPronob Das","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"be16bab4113dc76ea42e948c6cc2a40c40fc87c28c626d48038d0fc070d2aa3c","category":"Environment"}