{"title":"Swelling, Rupture and Endosomal Escape of Biological Nanoparticles per se and Those Fused with Liposomes in Acidic Environment","link":"https://www.preprints.org/manuscript/202404.1124/v1","date":1713336029000,"content":"Biological nanoparticles (NPs), such as extracellular vesicles (EVs), exosome-mimetic nanovesicles (EMNVs) and nanoghosts (NGs), are perspective non-viral delivery vehicles for all types of therapeutic cargo. Biological NPs are renowned for their exceptional biocompatibility and safety, alongside their ease of functionalization, but a significant challenge arises when attempting to load therapeutic payloads, such as nucleic acids (NAs). One effective strategy involves fusing biological NPs with liposomes loaded with NAs, resulting in hybrid carriers that offer the benefits of both biological NPs and the capacity for high cargo loads. Despite their unique parameters, one of the major issues of virtually any nanoformulation is the ability to escape degradation in the compartment of endosomes and lysosomes which determines the overall efficiency of nanotherapeutics. In this study, we fabricated all major types of biological and hybrid NPs and studied their response to acidic environment observed in endolysosomal compartment. In this study, we show that EMNVs display increased protonation and swelling relative to EVs and NGs in an acidic environment. Furthermore, the hybrid NPs exhibit an even greater response compared to EMNVs. Short-term incubation of EMNVs in acidic pH corresponding to late endosomes and lysosomes again induces protonation and swelling, whereas hybrid NPs are ruptured, resulting in the decline of their quantities. Our findings demonstrate that in an acidic environment, there is enhanced rupture and release of vesicular cargo observed in hybrid EMNVs that are fused with liposomes compared to EMNVs alone. This was confirmed through PAGE electrophoresis analysis of mCherry protein loaded into nanoparticles. In vitro analysis of NPs colocalization with lysosomes in HepG2 cells demonstrated that EMNVs mostly avoid endolysosomal compartment whereas hybrid NPs escape it over time. To conclude, (1) hybrid biological NPs fused with liposomes appear more efficient in the endolysosomal escape via the mechanism of proton sponge associated with scavenging of protons by NPs, influx of counterions and water, and rupture of endo/lysosomes, but (2) EMNVs are much more efficient than hybrid NPs in actually avoiding endolysosomal compartment in human cells. These results reveal biochemical differences across four major types of biological and hybrid NPs, and indicate that EMNVs are more efficient in escaping or avoiding endolysosomal compartment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"be1707ca4cf0b45d0b2f7c7d7e597562e533c7cfe00231b0c1adf9a337a908f4","category":"Interdisciplinary"}