{"title":"Tejay van Garderen will be a DS with EF Education-Nippo","link":"https://cyclingtips.com/2021/08/tejay-van-garderen-will-be-a-ds-with-ef-education-nippo/","date":1628881379000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/tvg_giro-650x501.jpg\" /></div><h2>Tejay van Garderen will be a DS with EF Education-Nippo</h2><p>\n</p><p>Tejay van Garderen may not be racing anymore, but he’ll still be working with EF Education-Nippo after this season nonetheless.</p>\n\n\n\n<p>EF announced on Friday that the 33-year-old American would be joining the team as a sport director in 2022.</p>\n\n\n\n<p>“At the Giro, I spoke to Matti Breschel and he was the one telling me, ‘If opportunities come, say yes. You might think you want to take a year off and figure things out but opportunities don’t come very often,’” Van Garderen said via a team press release.</p>\n\n\n\n<p>“It all happened really fast. I almost still can’t believe I’m not a bike racer anymore but I’m really excited with the direction everything’s taken.”</p>\n\n\n\n<p>Van Garderen, whose career palmares includes two fifth-place overall finishes at the Tour and a Giro d’Italia stage win to go with two overall wins at the USA Pro Challenge, one overall win at the Tour of California, two stage wins at the Volta a Catalunya, and plenty of other big results in stage races, retired from racing earlier this year after the US national championships. Hanging up the wheels, however, would not be the end of his time spent working in the sport.</p>\n\n\n\n<p>“When you’re a bike racer, you think, ‘Once I’m done racing I’m just going to put the sport behind me’ and start the next chapter,” Van Garderen said. “But when I was facing my own cycling mortality, I realized I’m still not done with the sport. I want to stay involved, I want to stay connected, I want to be with the guys and help in any way I can and if I can’t help with my legs anymore, then I want to help with my mind and my experience. Being a director, that’s the best way to do it.”</p>\n\n\n\n<p>Van Garderen will be getting his start down the path towards his future role as a DS soon. According to EF, he is set to work with the team at the upcoming Vuelta a España, “where he’ll be shadowing the team and learning the ropes.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/tejay-van-garderen-will-be-a-ds-with-ef-education-nippo/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"be1b463f038a09b4a3384149ca720e393d7831ffbeb64249edc013f854c49317","category":"Cycling"}