{"title":"DeepMind เปิดตัวปัญญาประดิษฐ์ Gopher ใหญ่กว่า GPT-3 ถึง 60% ถามตอบใกล้เคียงมนุษย์, แต่มั่นใจเกินตัว","link":"https://www.blognone.com/node/126231","date":1639038109000,"content":"<div><div><div><p>DeepMind เปิดตัวปัญญาประดิษฐ์สถาปัตยกรรมใหม่สำหรับการทำความเข้าใจภาษามนุษย์ โดยทดสอบสถาปัตยกรรมนี้หลายขนาด ตั้งแต่ 44 ล้านพารามิเตอร์ไปจนถึง 280,000 ล้านพารามิเตอร์ โดยตั้งชื่อโมเดลใหญ่ที่สุดนี้ว่า Gopher ซึ่งใหญ่กว่าโมเดล GPT-3 ของ OpenAI ถึง 60%</p>\n<p>Gopher ทำคะแนนทดสอบความเข้าใจภาษา (Massive Multitask Language Understanding - MMLU) ได้เหนือกว่า GPT-3 แทบทุดหมวด บางหมวดเช่นมนุษยศาสตร์นั้นเริ่มเข้าใกล้คนจริงๆ (คะแนนสูงกว่า 70 คะแนนเทียบกับมนุษย์ที่ได้ประมาณ 90 คะแนน)</p>\n<p>ทาง DeepMind ยกตัวอย่างบทสนทนาถามตอบเรื่องเซลล์ ตัว Gopher สามารถตอบคำถามได้อย่างตรงประเด็น ได้ใจความ แต่ขณะเดียวกันก็รายงานปัญหาว่า Gopher นั้นไม่สามารถแสดงความไม่แน่ใจเวลาที่หาคำตอบไม่ได้ แต่กลับให้คำตอบอย่างผิดๆ ออกมาแทน</p>\n<p>งานวิจัยครั้งนี้ DeepMind ออกรายงานถึงความเสี่ยงของโมเดลปัญญาประดิษฐ์ด้านภาษาขนาดใหญ่ออกมาพร้อมกัน โดยระบุความเสี่ยง 6 ด้าน ได้แก่</p>\n<ul>\n<li>ปัญญาประดิษฐ์ใช้ภาษาเหยียด</li>\n<li>ตัวปัญญาประดิษฐ์ทำข้อมูลหลุด</li>\n<li>ปัญญาประดิษฐ์สร้างข้อมูลเท็จหรือชี้นำผิด</li>\n<li>ปัญญาประดิษฐ์ถูกมนุษย์ใช้เป็นเครื่องมือด้านมืด</li>\n<li>มนุษย์เชื่อใจปัญญาประดิษฐ์เกินไป มองว่าเป็นมนุษย์</li>\n<li>ผลกระทบด้านสิ่งแวดล้อมและเศรษฐกิจจากปัญญาประดิษฐ์ (ทำให้คนตกงาน หรือเหลือแต่ทงานที่แยกลง)</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9b4853afb9545dbf26acef7854bd5d64.png\" /></p>\n<p>ที่มา - <a href=\"https://deepmind.com/blog/article/language-modelling-at-scale\">DeepMind</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/deepmind\">DeepMind</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"be203c49184e479ce3b2ec7e83f768c3c226225fdf0eecae698425e2261cc895","category":"Thai"}