{"title":"Assessing the importance of nitric acid and ammonia for particle growth in the polluted boundary layer","link":"http://pubs.rsc.org/en/Content/ArticleLanding/2024/EA/D3EA00001J","date":null,"content":"<div><p><img src=\"/services/images/RSCpubs.ePlatform.Service.FreeContent.ImageService.svc/ImageService/image/GA?id=D3EA00001J\" /></p></div><div><i><b>Environ. Sci.: Atmos.</b></i>, 2024, <b>4</b>,265-274<br /><b>DOI</b>: 10.1039/D3EA00001J, Paper</div><div><img alt=\"Open Access\" src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/open_access_blue.png\" /> Open Access</div><div><a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\"> <img src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/CCBY-NC.png\" alt=\"Creative Commons Licence\" /></a>  This article is licensed under a <a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\">Creative Commons Attribution-NonCommercial 3.0 Unported Licence.</a></div><div>Ruby Marten, Mao Xiao, Mingyi Wang, Weimeng Kong, Xu-Cheng He, Dominik Stolzenburg, Joschka Pfeifer, Guillaume Marie, Dongyu S. Wang, Miriam Elser, Andrea Baccarini, Chuan Ping Lee, Antonio Amorim, Rima Baalbaki, David M. Bell, Barbara Bertozzi, Lucía Caudillo, Lubna Dada, Jonathan Duplissy, Henning Finkenzeller, Martin Heinritzi, Markus Lampimäki, Katrianne Lehtipalo, Hanna E. Manninen, Bernhard Mentler, Antti Onnela, Tuukka Petäjä, Maxim Philippov, Birte Rörup, Wiebke Scholz, Jiali Shen, Yee Jun Tham, António Tomé, Andrea C. Wagner, Stefan K. Weber, Marcel Zauner-Wieczorek, Joachim Curtius, Markku Kulmala, Rainer Volkamer, Douglas R. Worsnop, Josef Dommen, Richard C. Flagan, Jasper Kirkby, Neil McPherson Donahue, Houssni Lamkaddam, Urs Baltensperger, Imad El Haddad<br />Inhomogeneities in temperature and ammonia concentrations can cause rapid growth of nanoparticles in polluted environments.<br />The content of this RSS Feed (c) The Royal Society of Chemistry</div>","author":"","siteTitle":"RSC - Environ. Sci.: Atmos. latest articles","siteHash":"b867d9b4b5f728e74e06cca615229dba14353d44551887cf7b6cd9c876c909ab","entryHash":"be237fcc2cca9a0a252cb7652096c6b55a6a577fa85d79d9c02635e5edb5d775","category":"Environment"}