{"title":"Grim Fandango Remastered","link":"https://markpeak.net/grim-fandango-remastered/","date":1635739517000,"content":"<p>หนึ่งในเกมคาใจของชีวิตที่เล่นไม่จบคือ Grim Fandango เกมผจญภัย 3D เกมเดียวของค่าย LucasArts (เพราะออกแล้วเจ๊ง หลังจากนั้นเลิกทำเกมผจญภัยไปเลย)</p>\n<p>เกมออกขายครั้งแรกในปี 1998 และสร้างเสียงฮือฮาไม่น้อยในยุคนั้นด้วยกราฟิกที่แปลกใหม่จากเดิม แถมมีสไตล์การนำเสนอที่น่าสนใจเพราะใช้ “กระดูก” จากเทศกาล Day of the Dead ของเม็กซิโก (ก่อนหน้า<a href=\"https://markpeak.net/coco/\">การ์ตูน Coco</a> หรือ James Bond ภาค Spectre เป็นสิบๆ ปี)</p>\n<p>ในยุค 1998 ซื้อมาเล่นด้วยเหมือนกัน แต่ด้วยความอ่อนด้อยเรื่องภาษา บวกกับความยากของตัวเกมด้วย (ปริศนาแบบอิหยังวะมากๆ) เลยเล่นไม่จบ และเป็นความคาใจมานานกว่า 20 ปี</p>\n<p>แต่เมื่อปี 2014 <a href=\"https://www.blognone.com/node/63582\">เกมผจญภัยของ LucasArts ถูกนำกลับมารีมาสเตอร์อีกครั้ง</a> ด้วยฝีมือของ <a href=\"https://www.blognone.com/node/110236\">Double Fine Studio</a> บริษัทใหม่ของ Tim Schafer ผู้กำกับเกมนี้ เลยมีโอกาสได้ซื้ออีกรอบ และฮึดนั่งเล่นจนจบสักทีในปี 2021 (ใช้เวลารวม 23 ปี อาเมน)</p>\n<p></p>\n<p>เนื้อเรื่องของ Grim Fandango คือในโลกหลังความตาย Land of the Dead คนที่ตายแล้วจะต้องเดินทางไปสู่ดินแดนสุดท้าย (Land of Eternal Rest หรือ Ninth Underworld) ด้วยวิธีการต่างๆ ตามแต่กรรมดีของแต่ละคนทำไว้ก่อนตาย ถ้ากรรมดีเยอะหน่อยก็นั่งรถด่วนความเร็วสูง Number Nine ไปแบบสบายๆ แต่ถ้าทำดีไว้น้อย ก็ต้องเดินเท้าไปซึ่งต้องใช้เวลาหลายปี</p>\n<p>พระเอกของเราคือ Manuel Calavera หรือ “Manny” (Calavera แปลว่ากระดูกในภาษาสเปน) เป็นตัวแทน (travel agent) ของกระทรวงความตาย (Department of Death) ที่คอยจัดสรร “ตั๋วเดินทาง” ให้กับคนตายที่เข้ามาใหม่</p>\n<p>ปัญหาคือคนตายที่เขาได้รับมอบหมายมา มักเป็นคนตายเกรดต่ำ ในขณะที่เพื่อนร่วมงานของเขา Domino มักได้คนตายเกรดดีๆ ทำผลงานได้ดีกว่าเสมอ และมาข่มเหงเหยียดหยามเขาอยู่ตลอดเวลา</p>\n<p>จนกระทั่ง Manny สามารถแย่ง “ลูกค้า” มาจาก Domino ได้สำเร็จหนึ่งคนคือ Meche นางเอกของเรื่อง ทำให้ Manny ค้นพบว่ามีขบวนการคอร์รัปชั่นโกงตั๋วคนตายซ่อนอยู่เบื้องหลัง Department of Death แต่การเข้าไปพัวพันกับเรื่องยุ่งๆ เหล่านี้ ทำให้ Manny ต้องชีวิตหักเห เดินทางออกไปสู่เส้นทางไป Ninth Underworld นานถึง 4 ปี</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/10/grim.jpg\" /></p>\n<p>เกมแบ่งเนื้อเรื่องออกเป็น 4 องค์ โดยแต่ละองค์ห่างกัน 4 ปี แต่เหตุการณ์เกิดในวันเดียวกันคือ วันคืนวิญญาณที่อนุญาตให้คนตายกลับไปเยี่ยมโลกคนเป็นได้ (Day of the Death) โดยเหตุการณ์แต่ละองค์ Manny อยู่ในสถานที่แตกต่างกันไป</p>\n<ul>\n<li>Year 1 – อยู่ในเมืองหลัก El Marrow ที่ตั้งของกระทรวงความตาย</li>\n<li>Year 2 – เมืองท่าริมทะเล Rubacava</li>\n<li>Year 3 – เหมืองริมขอบโลก Edge of the World</li>\n<li>Year 4 – ทางเข้า Ninth Underworld และกลับมา El Marrow อีกครั้ง</li>\n</ul>\n<p>เกมเวอร์ชันต้นฉบับเปลี่ยนจากอินเทอร์เฟซแบบ point and click ที่เป็นเอกลักษณ์ของ LucasArts มาเป็นการควบคุมด้วยคีย์บอร์ด 100% (tank control) แต่ภายหลังแฟนๆ ก็หาวิธี mod มันกลับมาเป็น point and click อีกครั้ง ซึ่งเกมเวอร์ชันรีมาสเตอร์ก็นำ mod ตัวนี้เข้ามาผนวกในเกมด้วย (เลือกควบคุมได้ทั้งสองแบบ) ในมุมของผมแล้วคิดว่า point and click สะดวกกว่ามาก แต่ในเกมรีมาสเตอร์ก็มี achievement ชื่อ tank control ให้เล่นเกมจบด้วยวิธีนี้ โดยอธิบายว่า Tim (Schafer) สั่งมา 555</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/10/grim-achievement.jpg\" /></p>\n<p>นอกจากปรับวิธีควบคุม ปรับปรุงกราฟิก (เล็กน้อย) เพิ่มระบบ achievement แบบเกมสมัยใหม่ เพิ่มแกลเลอรีภาพสเกตช์และคอมเมนต์จากผู้สร้าง ตัวเกมเพลย์ก็ยังเหมือนต้นฉบับทุกอย่าง</p>\n<p>หลังจากได้มาเล่นตอนแก่ ก็พบว่าที่เล่นไม่จบสมัยเด็กๆ ไม่ใช่เพราะภาษาอย่างเดียว แต่เป็นเพราะเกมมันยากด้วย ยากมากแบบ absurd คือปริศนาบางอันมันไม่สามารถคิดได้ด้วยสมองคนปกติเลย (อ่านรีวิวแล้วทุกคนก็ด่าแบบเดียวกันหมด) โดยเฉพาะ Year 2 ในเมือง Rubacava ที่ฉากมันกว้างมาก มีความเป็นไปได้หลายรูปแบบมาก การเดาไปเรื่อยๆ ไม่ช่วยอะไรเท่าไรนัก สุดท้ายก็ต้องเปิด walkthrough คู่ไปด้วยอยู่ดี (ผมใช้<a href=\"https://www.eurogamer.net/articles/2015-01-27-grim-fandango-remastered-walkthrough-3685\">เวอร์ชัน Eurogamer</a> ที่ไม่เปิดเผยเนื้อเรื่องมากนัก เอาไว้อ่านตอนติดขัดจริงๆ ซึ่งกว่าจะเล่นจบก็เปิดเป็นสิบๆ รอบ)</p>\n<p>ในปี 1998 เกมกราฟิก 3D แบบนี้คงดูแปลกใหม่ แต่พอมาเล่นในปี 2021 มันก็โบราณไปมากแล้ว อย่างไรก็ตาม ความเจ๋งของ Grim Fandango ที่ไม่มีวันล้าสมัยคือ เนื้อเรื่องและบทสนทนาอันคมคาย ที่ต้องยอมรับในฝีมือคนเขียน (พร้อมกับด่าไปด้วยเรื่องปริศนา) เมื่อบวกกับวิธีการนำเสนอแนว film noire ผสมโลกความตายแบบเม็กซิกัน (ในเรื่องมีสลับๆ ไปพูดภาษาสเปนอยู่เรื่อยๆ) ทำให้สไตล์ของเกมนั้นโดดเด่นมีเอกลักษณ์มาก และน่าจะถือเป็นจุดพีคสุดของเกมผจญภัยในยุคนั้นแล้ว (หลังจากนั้น ศิษย์เก่า LucasArts ก็แตกสายไปทำเกมใหม่ๆ แต่ก็ไม่มีเกมผจญภัยระดับเดียวกันนี้ออกมาได้อีก)</p>\n<p>แต่เกมเวอร์ชันรีมาสเตอร์ก็มีปัญหาเรื่องประสิทธิภาพของเกมอย่างมาก (เหมือนไม่ค่อยตั้งใจทำ) ตอนเล่นแรกๆ ก็สงสัยว่าทำไมเครื่องกระตุก เพราะเกมเก่าปี 1998 มันไม่น่ามีปัญหานี้ แต่เมื่อไปอ่านใน Steam Community ก็พบว่าคนด่าเต็มไปหมด (555) แถมทาง Double Fine ก็ไม่ยอมแก้บั๊กใดๆ อีกแล้ว ปล่อยให้ผู้เล่นต้องทนกับการกระตุกๆ ไปตลอดทั้งเกม</p>\n<p>แม้มีปัญหาหลายๆ อย่าง ทั้งความยากเรื่องปริศนา และบั๊กของเกม แต่สุดท้ายก็กัดฟันเล่นจบได้สำเร็จ (ผมเล่นๆ หยุดๆ ใช้เวลารวม 12 ชม. ในเกม) ชีวิตก็หมดความคาใจไปอีกหนึ่งเกม</p>The post <a href=\"https://markpeak.net/grim-fandango-remastered/\">Grim Fandango Remastered</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"be3c4a10966db8efa7a0c77f7e1642b004eaedd33857eaf5b68e1d4a83bbfd07","category":"Thai"}