{"title":"Report: Microsoft is working on a low-cost Surface Laptop and “Windows 11 SE”","link":"https://arstechnica.com/?p=1807572","date":1635268646000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/surface-laptop-go-12-a-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/surface-laptop-go-12-a.jpg\">Enlarge</a> <span>/</span> The Surface Laptop Go. (credit: Jeff Dunn)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Microsoft may have another Surface announcement to make before the end of the year, according to <a href=\"https://www.windowscentral.com/microsoft-building-116-inch-low-cost-laptop-designed-k-12-education-markets\">a rumor from Windows Central</a>. The report claims that Microsoft is working on a low-cost, education-focused device, codenamed \"Tenjin,\" designed to compete with Chromebooks in schools. The laptop could be \"announced before the end of this year if plans don't change,\" the report says. It would also run a new variant of Windows 11, dubbed \"Windows 11 SE.\"</p>\n<p>The laptop would come with a low-end quad-core Intel Celeron N4120 processor, \"up to\" 8 GB of memory, an 11.6-inch 1366×768 display, and an all-plastic body. It would eschew the normal Surface Connect port in favor of a single USB-A port, a USB-C port, and a \"barrel-style AC port.\" Presumably, the laptop could charge through either the AC port or the USB-C port, as current Surface devices do.</p>\n<p>Such a laptop would slot in below the <a href=\"https://www.microsoft.com/en-us/d/surface-laptop-go/94fc0bdgq7wv?activetab=pivot:techspecstab\">$549 12.4-inch Surface Laptop Go</a> in Microsoft's lineup, and accomplishing that in today's supply-crunched, chip-shortage-afflicted PC market would definitely require some cost-cutting. That would explain the device's use of a two-year-old, underpowered Celeron processor and a low-resolution 16:9 display, breaking with the Surface lineup's longstanding tradition of using screens with a taller 3:2 aspect ratio. The laptop may not even be available through typical retail channels, mirroring a strategy Microsoft already uses with certain business-focused Surface configurations and specific models like the <a href=\"https://www.microsoft.com/en-us/surface/business/surface-pro-7-plus\">Surface Pro 7+</a>. Only offering the machine in bulk to educational institutions could further reduce the price.</p></div><p><a href=\"https://arstechnica.com/?p=1807572#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807572&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"be3e55d42d99d5e5c852b17c59947487d19a15a55f0bb4c6ea3c514a1d736edd","category":"Tech"}