{"title":"Samsung says it will stop loading down its $1,000 smartphones with ads","link":"https://arstechnica.com/?p=1788148","date":1629318020000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Samsung-Galaxy-S21-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Samsung-Galaxy-S21.jpg\">Enlarge</a> <span>/</span> A Samsung phone.  (credit: Ron Amadeo)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Samsung says it will cut down on the ads it shows in its smartphones. The news was first reported by Korean news agency <a href=\"https://www.yna.co.kr/view/AKR20210817140800017\">Yonhap</a> and later confirmed by Samsung to <a href=\"https://www.theverge.com/2021/8/18/22630332/samsung-ads-default-stock-apps-weather-pay-theme-confirmed\">The Verge</a>. The official line from the industry giant is \"Samsung has made a decision to cease the advertisement on proprietary apps including Samsung Weather, Samsung Pay, and Samsung Theme.\" The company added: \"The update will be ready by later this year.”</p>\n<p>Samsung ships Android on all of its smartphones, but it changes everything with a \"One UI\" skin and includes several Samsung-developed packed-in apps. A lot of these apps—like Bixby, Samsung Health, and Weather—contain big banner apps, sometimes right at the top of the app where you would normally expect to find an app logo or navigation information. The worst are notification ads, where some Samsung app will make your phone beep and spawn a notification that entices you to buy a new gadget or install a new app.</p>\n<p>When you're spending anywhere from hundreds to thousands of dollars on a piece of hardware and are <em>still</em> being advertised to like this, it's not a great feeling. (And for you whataboutists out there—yes, Google also shows ads in some of its apps, but those are in serious, ad-supported web services, like YouTube or Google Maps, and they aren't notification ads. You also <em>paid </em>Samsung ~$1000, while you're using Google services for free.)</p></div><p><a href=\"https://arstechnica.com/?p=1788148#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788148&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"be3f983ee45b5ba3f4e8bd7078514d922cccb04b9b408a488f5046938b3a11c7","category":"Tech"}