{"title":"Burkitt lymphoma: The effect of age, sex and delay to diagnosis on treatment completion and outcome of treatment in 934 Patients in Cameroon","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299777","date":1710165600000,"content":"<p>by Peter Bernard Hesseling, Glenn Mbah Afungchwi, Bernard Wirndzem Njodzeka, Paul Wharin, Francine Nicole Kouya, Mariana Kruger</p>\r\nIntroduction <p>The role of age and sex in the presentation and outcome of endemic Burkitt lymphoma (BL) has not been studied recently. This study analysed these factors in 934 patients with BL who had received cyclophosphamide and intrathecal methotrexate as treatment.</p> Methods <p>Records of 934 children diagnosed with BL from 2004 to 2015 were obtained from our Paediatric Oncology Networked Database (POND) cancer registry. Age at diagnosis, sex, disease stage, time to diagnosis, delay in diagnosis, completion of treatment, rate of abandonment, and one-year survival rates were recorded and statistically analysed.</p> Results <p>The male to female ratio of 1.41 for the study population of 934. The median delay from onset of symptoms to diagnosis was 31 days. The St Jude stage distribution was I = 6.4%, II = 5.9%, III = 71.5% and IV = 16.2%. Significantly more patients presented with stage III disease in age groups 5–9 and 10–14 years than 0–4 years. The overall 1-year survival rate was 53.45%, respectively 77.1% for stage I, 67.9% for stage II, 55.1% for stage III and 32.4% for stage IV disease (p&lt;0.001). There was no significant difference in survival by sex and age group.</p> Conclusion <p>Patients aged under 5 years presented with less-advanced disease, but survival was not affected by age. Sex did not influence delay to diagnosis and overall survival. The long delay between the onset of symptoms and diagnosis emphasises the need for interventions to achieve an earlier diagnosis and a better survival rate.</p>","author":"Peter Bernard Hesseling","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"be4359836daf9733c9d1e3ec8ac823c4a5860076cfc3dfe8acc60a62a75313ac","category":"Interdisciplinary"}