{"title":"The Giro Rosa has been demoted, but don’t expect it to make a difference","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-giro-rosa-has-been-demoted-but-don-t-expect-it-to-make-a-difference","date":1619631450000,"content":"\n      <p><span>The end of Classics season marks the beginning of the run up to the Olympics in earnest. Across both the men’s and women’s calendars the next few months are typically stage race season. But in the absence of The Women’s Tour and the cancellations of both the first edition of Itzulia Women and Ride London, the women’s peloton have just five days of WorldTour racing between now and Tokyo. By contrast, the men have five races, including two Grand Tours. </span></p>\n<div></div>\n<p><span>With the dearth of competition at the highest level in the months preceding the Olympic Games, there are likely to be two camps, one with a run on the .Pro and .1 events by WorldTour riders — which comes with its own set of problems for Continental teams — or an intensive training approach with riders flocking to altitude. </span></p>\n<p><span>One 2.Pro race will prove pivotal: The Giro Rosa. It was stripped of its WWT status last year after failing to provide any live coverage </span><span><span>— a UCI mandate</span> </span>for events at that level. However, by virtue of being the longest on the women’s calendar slotting in just before the Olympics, the race will almost certainly still attract the top-tier of the women's peloton. </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_8713_1024x1024.jpg?v=1619612414\" /></div>\n<p><em><span>Will reigning Giro Rosa and Olympic Champion Anna van der Breggen defend both titles in July? Photo credit: Simon Wilkinson/SWPix.com</span></em></p>\n<p><span>The ineptitude within the Giro Rosa’s organisation and their apparent complacency in their status as the de facto ‘Grand Tour’ for women is widely documented. Last year’s move by the UCI to demote the race was the first instance of any penalty in the face of years of insulting the best of the women’s peloton with sub-par race organisation. The core of the problem is that the race simply has not moved with the times, never providing more than the bare minimum required to run the event.</span></p>\n<p><span>What keeps the riders returning to the Giro Rosa, though, is that if you put on a challenging race, they will come. At 10 stages long it is by far the longest stage race on the women’s calendar. The next-longest races, which are at the UCI limit of six days are: The Women’s Tour, Simac Ladies’ Tour, and the Lotto Thüringen Ladies Tour. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_9170_1_1024x1024.jpg?v=1619612608\" /></div>\n<p><em><span>The Women's Tour has been postponed until October. Photo credit: Alex Whitehead/SWPix.com</span></em></p>\n<p><span>This was not always the case, as Isabel Best <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/true-grit-ore-ida\">highlighted in her piece for Rouleur</a> on the Ore Ida — a women’s race that was held over 17 stages during the 1980s. In the decades later, however (for reasons known only to the UCI) the six-day limit was set and only the Giro Rosa was granted special dispensation to run over a longer, 10-day, period. </span></p>\n<p><span>Although the race has now ostensibly been sent to Aigle’s naughty step, any wane in interest that a demotion to 2.Pro status might have brought about has now been offset by its place on the calendar, with the final stage coming exactly two weeks before the women’s Olympic Road Race. In addition, the lack of a replacement top-tier stage race to take over the Giro’s mantle has meant that it is still the most attractive challenge on the calendar to the WWT teams. </span></p>\n<p><span>Things are looking promising for 2022, with a new 6-day ‘Battle of the North’ race and the much-heralded Women’s Tour de France to come. For now, though, Giro Rosa continues to sit </span><span>— </span>like a cuckoo <span>—</span> as the ‘premier’ tour on the women’s calendar. Still attracting the top riders. Still not releasing details of the race until the last minute. Still making no attempt to provide live coverage. </p>\n<p><span>As a result, fans will miss out on seeing what could be some of the most exciting racing of the season as riders on preternatural pre-Olympic form go wheel-to-wheel on the Italian roads. In turn, the riders themselves will miss out on showcasing women’s racing at its absolute best. At least the Olympics will be televised.</span></p>\n<p><em><span>Cover image: Alex Whitehead/SWPix</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"be4e4aa4e997bbcd792b0eb9c2fc1aa0680dabe3019696c23609d9131c9e393e","category":"Cycling"}