{"title":"BK ZERO isoform HEK293 stably transfected cell lines differing 3’UTRs to assess miR-9 regulation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298966","date":1710856800000,"content":"<p>by Katherine Cordero Padilla, Gerardo Alvarado Monefeldt, Adriel Guevárez Galán, Hector G. Marrero, Mario E. Lloret-Torres, Cristina Velázquez-Marrero</p>\r\n\r\nResearch has identified the large conductance voltage- and calcium-activated potassium channel (BK) as a key regulator of neuronal excitability genetically associated to behavioral alcohol tolerance. Sensitivity to ethanol at the molecular level is characterized by acute potentiation of channel activity. BK isoforms show variations in alcohol sensitivity and are differentially distributed on the plasma membrane surface in response to prolonged exposure. MicroRNA (MiRNA) targeting of alcohol-sensitive isoforms coupled with active internalization of BK channels in response to ethanol are believed to be key in establishing homeostatic adaptations that produce persistent changes within the plasma membrane of neurons. In fact, microRNA 9 (miR-9) upregulated expression is a key event in persistent alcohol tolerance mediating acute EtOH desensitization of BK channels. The exact nature of these interactions remains a current topic of discussion. To further study the effects of miR-9 on the expression and distribution of BK channel isoforms we designed an experimental model by transfecting human BK channel isoforms ZERO heterologous constructs in human embryonic kidney cells 293 (HEK293) cells respectively expressing 2.1 (miR-9 responsive), 2.2 (unresponsive) and control (no sequence) 3’untranslated region (3’UTR) miRNA recognition sites. We used imaging techniques to characterize the stably transfected monoclonal cell lines, and electrophysiology to validate channel activity. Finally, we used immunocytochemistry to validate isoform responsiveness to miR-9. Our findings suggest the cell lines were successfully transfected to express either the 2.1 or 2.2 version of ZERO. Patch clamp recordings confirm that these channels retain their functionality and immunohistochemistry shows differential responses to miR-9, making these cells viable for use in future alcohol dependence studies.","author":"Katherine Cordero Padilla","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"be56e949ffd96904f053bf96e348400caf6d14710ebc9dc0085c9254121fe42e","category":"Interdisciplinary"}