{"title":"The anonymous meta-analysis that’s convincing people to use ivermectin","link":"https://arstechnica.com/?p=1795939","date":1632221153000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1212949657-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1212949657.jpg\">Enlarge</a> <span>/</span> A pharmacist prepares to dispense ivermectin prescriptions.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/may-2020-bolivia-santa-cruz-a-pharmacist-puts-ivermectin-news-photo/1212949657?adppopup=true\">Picture Alliance / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>If you've looked into the controversy regarding the use of ivermectin for treating <a href=\"https://arstechnica.com/tag/covid-19/\">COVID-19</a>, chances are you've come across links to a site called c19ivermectin.com (or one of its many relatives) that claims to host a regularly updated aggregation of all the latest studies into a single meta-analysis of the effects of the drug. We here at Ars have been asked—by email, in the comments, and via our feedback form—to check out c19ivermectin.com, which purports to provide evidence ivermectin is an effective therapy.</p>\n<p>So we have. And we're suggesting you don't, because it's not a reliable source of information.</p>\n<h2>We want an old drug</h2>\n<p>Why is anyone talking about ivermectin at all? Early on in the pandemic, before the development of effective vaccines, there was a rush to find treatments that could be rapidly rolled out to the public. As such, researchers focused on testing drugs that were already approved for other problems, since this would lower the regulatory hurdles and safety testing needed. Plenty of existing drugs were tested in cell culture, and a few were trialed in humans.</p></div><p><a href=\"https://arstechnica.com/?p=1795939#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795939&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"be59decc40905257e5e2129d22cb388f7e4da4a3bbc15fb0567c515b48612571","category":"Tech"}