{"title":"The racialization of pit bulls: What dogs can teach us about racial politics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305959","date":1719583200000,"content":"<p>by Michael Tesler, Mary McThomas</p>\r\n\r\nMany have argued that discrimination against pit bulls is rooted in the breed’s association with Black owners and culture. We theoretically and empirically interrogate that argument in a variety of ways and uncover striking similarities between the racialization of pit bulls and other racialized issues (e.g., poverty and crime) in public opinion and policy implementation. After detailing the reasons to expect pit bulls to be racialized as Black despite dog ownership in the U.S. generally being raced as white, the article shows: (1) Most Americans associate pit bulls with Black people. (2) Anti-Black attitudes, in general, are significant, independent, predictors of both anti-pit views and of preferring other breeds over them; (3) stereotypes of Black men as violent, in particular, are significant, independent, predictors of both anti-pit views and of preferring other breeds over them. (4) Implicit racialization through a national survey experiment further eroded support for legalizing pits, with the treatment effect significantly conditioned by respondent’s race. And (5) state-level racial prejudice is a significant negative predictor of enacting legislation to preempt breed-specific bans. We conclude with our findings’ broader insights into the nature of U.S. racial politics. Michael Tesler, mtesler@uci.edu, corresponding author, is Professor of Political Science at UC Irvine; Mary McThomas, mary.mcthomas@uci.edu, is Associate Professor of Political Science at UC Irvine. An earlier version of this paper was presented at the American Political Science Association’s annual meeting. We thank Maneesh Arora, Rachel Bernhard, Nathan Chan, Louis Pickett, David Sears, DeSipio, Adam Duberstein, Jane Junn, Claire Kim, Jessica Manforti, J. Scott Matthews, Justin.","author":"Michael Tesler","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"be5eb53bb9c32ad18029e3be514ae61267401386ff4422664ccf313b6528a1a8","category":"Interdisciplinary"}