{"title":"Tim Cook isn’t always right, but his Facebook fight is right on","link":"https://www.macworld.com/article/342585/macalope-tim-cook-apple-privacy-facebook-ad-tracking.html","date":1617703200000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>It&rsquo;s time to spend a half hour with Tim Cook.</p>\n\n\n\n<p>No, don&rsquo;t get up. We&rsquo;re doing this.</p>\n\n\n\n<p>Shh. It&rsquo;ll be fun.</p>\n\n\n\n<p>Don&rsquo;t worry, you don&rsquo;t have to be conversational. Kara Swisher does the heavy lifting in her <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/us/podcast/sway/id1528594034?i=1000515797139&amp;xcust=1-1-342585-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">interview with Cook</a> on her Sway podcast. The discussion ranges from <a href=\"https://www.macworld.com/article/342432/tim-cook-not-planning-on-staying-with-apple-through-the-decade.html\" data-type=\"URL\" data-id=\"https://www.macworld.com/article/342432/tim-cook-not-planning-on-staying-with-apple-through-the-decade.html\">privacy to the App Store to AR to autonomous vehicles</a> to Cook being called &ldquo;Tim Apple&rdquo;. The Macalope suggests you go give it a listen because it&rsquo;s a good interview and he hates to just repeat parts of it, but at the same time Tim Cook does not take the Macalope&rsquo;s calls.</p>\n\n\n\n<p>Admittedly, the Macalope just walks out into the field and yells &ldquo;TIM!&rdquo; But he never answers. Very inconsiderate.</p>\n\n\n\n<p>Swisher asks Cook about the differences between Apple and Facebook. Privacy is obviously the biggest but Cook also says about harmful content:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&ldquo;We&rsquo;re not pushing things into your feed.&rdquo;</p></blockquote>\n\n\n\n<p>Wellll, okay, the company doesn&rsquo;t push things at people for engagement purposes, and it obviously doesn&rsquo;t push damaging or dangerous content, but it does push unsolicited ads via notifications. Also, search on the App Store is supremely messed up because of advertising, with ads for competing apps appearing above the thing you were looking for. So, mostly yes with a soup&ccedil;on of LOL, dude.</p>\n\n\n\n<p>Cook talks about the importance of privacy to the company as a principle rather than as just a marketing tool.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&ldquo;It&rsquo;s not aimed at a company. It&rsquo;s aimed at a principle.&rdquo;</p></blockquote>\n\n\n\n<p>And if a company happens to get caught in a hail of privacy water balloons and ends up soaked through, well, worse things have happened.</p>\n\n\n\n<p>Some people like to scoff and write Apple&rsquo;s privacy stance off as purely marketing as if you shouldn&rsquo;t fall for the company&rsquo;s callous scheme to get you to use products that protect your privacy because they&rsquo;re only doing it to make money. Even if that were true, <em>the products still protect your privacy</em>.</p>\n\n\n\n<p>Honestly, imagine complaining about a feature of something because &ldquo;the company&rsquo;s only using that feature to sell you the product&rdquo;. What. But you pay for&hellip; and then get&hellip; what?</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060833\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>You can, and should, complain about the stuff Apple does that bothers you, whether it&rsquo;s <a href=\"https://www.macworld.com/article/342321/annoying-apple-problems-fixes-iphone-ios-tvos-siri-voices-remote-battery-life.html\" data-type=\"URL\" data-id=\"https://www.macworld.com/article/342321/annoying-apple-problems-fixes-iphone-ios-tvos-siri-voices-remote-battery-life.html\">battery life, bugs</a>, or the App Store rules. The Macalope&rsquo;s current personal hobby horse (other than his actual hobby horse, a bespoke wooden Pinto made locally with fair trade materials and referred to as Sparkle Sunshine) is how there&rsquo;s only one snooze option for Calendar alerts on Big Sur, which is a regression from the number of options in Catalina.</p>\n\n\n\n<p>Want to snooze something for an hour or a day? Well, you used to be able to but now you can&rsquo;t anymore because progress. So the Macalope is literally using Remote Access to log into a Mac running Catalina to snooze Calendar alerts and IT JUST MAKES HIM SO MAD HE HAS TO KICK! HIS! HOBBY! HORSE!</p>\n\n\n\n<p>Not really. That was an exaggeration. He&rsquo;d never kick you, Sparkle Sunshine. Never.</p>\n\n\n\n<p>There, there. Shhh.</p>\n\n\n\n<p>But complaining about features Apple provides because it sells the device based on that feature? Who are these people?</p>\n\n\n\n<p>Some of Cook&rsquo;s comments, such as the one about the innovation of the App Store, are a little eye-roll-inducing. Apple loves to pretend that the Apple-device-owning world went from buying dusty software boxes from the back of a CompUSA to the App Store as if there was no phase in between when software developers sold online.</p>\n\n\n\n<p>Cook spoke out against side loading, saying that allowing other stores on iOS will create another vector for privacy and security violations.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&ldquo;I think somebody has to curate, right? Because users aren&rsquo;t going to come there and buy things if they don&rsquo;t have trust and confidence in the store.&rdquo;</p></blockquote>\n\n\n\n<p>He does admit that the company isn&rsquo;t perfect at it, which sometimes <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.washingtonpost.com/technology/2021/03/30/trezor-scam-bitcoin-1-million/&amp;xcust=1-1-342585-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">seems</a> like an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/02/11/app-store-scam-apps-how-to-spot/&amp;xcust=1-1-342585-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">understatement</a>.</p>\n\n\n\n<p>But Apple&rsquo;s fight with Facebook is front and center in the interview and it just happens to be in Cook&rsquo;s wheelhouse:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&ldquo;What we&rsquo;re doing, Kara, is giving the user the choice whether to be tracked or not. And I think it&rsquo;s hard to argue against that.&rdquo;</p></blockquote>\n\n\n\n<p>It really is. Not that some people don&rsquo;t try.</p>\n</div></body></html>","author":"The Macalope","siteTitle":"Will.i.am’s new $299 Bluetooth face mask is like AirPods Max for your face","siteHash":"9b69c2794ee2de0dc79c5d7f6e368a14d729fdeed42719a35a808f9b53250431","entryHash":"be6bf517a1bd554da13928854fad2f4b873d97a90821d673b0fac10817408c53","category":"Apple"}