{"title":"Wout van Aert dominates Tour of Britain as World Champs loom","link":"https://cyclingtips.com/2021/09/wout-van-aert-dominates-tour-of-britain-as-world-champs-loom/","date":1631463982000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/GettyImages-1339831616-650x433.jpg\" /></div><h2>Wout van Aert dominates Tour of Britain as World Champs loom</h2><p>\n</p><p>Wout van Aert perfectly negotiated the bunch sprint that ended the Tour of Britain, chalking up his fourth stage win of the week and snatching overall victory from Ethan Hayter (Ineos Grenadiers). Two weeks out from the World Championships road race, Van Aert is looking very good for a home victory.</p>\n\n\n\n<p>“It’s definitely a lot more wins than I expected when I came in this race,” Van Aert said after stage 8. “I hoped to be there on a few stages and also to see what was possible for GC, but taking all these wins is beyond expectations. We had a really nice week and I think my form is where I want it to be.”</p>\n\n\n\n<p>Van Aert’s successful British campaign started on stage 1’s slight uphill sprint into Bodmin, Cornwall. He shut down an early acceleration by Julian Alaphilippe (Deceuninck-QuickStep) to win with relative ease ahead of Nils Eekhoff (DSM) and Gonzalo Serrano (Movistar), taking the first blue leader’s jersey of the race.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/GettyImages-1338467066-1340x893.jpg\" /><figcaption>Wout van Aert (Jumbo-Visma) made sprinting look easy on stage 1 of the Tour of Britain.</figcaption></figure>\n\n\n\n<p>Stage 2 went the way of the breakaway and the race lead with it, as Robin Carpenter (Rally Cycling) soloed to victory in Exeter, but Van Aert would be back in blue before too long.</p>\n\n\n\n<p>After a late puncture spoiled Jumbo-Visma’s chances in the stage 3 TTT, stage 4 took the race through the rolling terrain of North Wales before finishing on the violently steep Great Orme climb. The finale provided quite a spectacle as the road peeled away from the coast, the Irish Sea stretching out behind the riders who ground painfully up the gradient. It came down (or up) to a furious sprint between Van Aert and Alaphilippe, the Belgian champion just edging in front before the pair collapsed from the extreme effort.</p>\n\n\n\n<p>Hayter had suffered on the steep gradients but he’d ridden his own pace to limit his losses, only losing the leader’s jersey by two seconds. It was becoming something of a tennis match between the young Brit and Van Aert, the pair trading blows and trading the jersey as they swapped stage results. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/GettyImages-1339084663-1340x893.jpg\" /><figcaption>Wout van Aert (Jumbo-Visma) and Julian Alaphilippe (Deceuninck-QuickStep) battle for stage 4 victory on the steep climb of Great Orme, Llandudno in North Wales.</figcaption></figure>\n\n\n\n<p>Hayter took back the advantage with victory on stage 5, Van Aert unable to contest the sprint in Warrington after being caught behind a crash in the final corner. But the Belgian surged to a defiant win the very next day, albeit unable to take the jersey off Hayter who finished second.</p>\n\n\n\n<p>The penultimate stage saw Yves Lampaert take Deceuninck-QuickStep’s only win of the week, with Hayter leading the peloton across the line 1:51 after the breakaway, Van Aert glued ominously to his wheel. The Tour of Britain was poised for a dramatic finale – Van Aert had only a four-second deficit to make up on a stage expected to end in a good old-fashioned bunch sprint.</p>\n\n\n\n<p>It was a textbook finish in the end. The breakaway was caught inside the final 10 km, and after Alex Dowsett’s (Israel Start-Up Nation) last-ditch attack – unintentional, as it turns out – came to nothing, a large bunch charged onto Aberdeen’s picturesque Esplanade for the most hotly contested sprint of the week.</p>\n\n\n\n<p>André Greipel (Israel Start-Up Nation) led from the front with a nostalgic burst of pace, Mark Cavendish (Deceuninck-QuickStep) coming up alongside him, but Van Aert went from boxed in to race win faster than anyone could react. Meanwhile, Hayter ran out of steam and finished 11th, relinquishing the race lead to Van Aert who won overall by just six seconds.</p>\n\n\n\n<p>It’s now just a week before the 2021 World Championships kick off in Flanders, Belgium, running from 19th to 26th September. Van Aert will race both the ITT (19th) and the road race (26th) on roads he knows well, and with a stellar team behind him. After winning four distinct stages in Britain, not to mention the success he’s enjoyed throughout the 2021 season, he’s cemented his status as top favourite to take the rainbow bands in two weeks’ time.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/wout-van-aert-dominates-tour-of-britain-as-world-champs-loom/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"be6df9a0ebe2a55897cda41c6547d6d929e8867865c821f1205af3e6aa7aa4ae","category":"Cycling"}