{"title":"Association between PM<sub>10</sub> exposure and risk of myocardial infarction in adults: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301374","date":1714572000000,"content":"<p>by Kleiton Strobl, Syed Asad Irfan, Hassan Masood, Noor Latif, Om Kurmi</p>\r\nBackground <p>Air pollution has several negative health effects. Particulate matter (PM) is a pollutant that is often linked to health adversities. PM<sub>2.5</sub> (PM with an aerodynamic diameter of ≤2.5μm) exposure has been associated with negative cardiovascular (CV) outcomes. However, the impact of PM<sub>10</sub> (PM with an aerodynamic diameter of ≤10μm) exposure is often overlooked due to its limited ability to pass the alveolar barrier. This study aims to assess the association between PM<sub>10</sub> exposure and risk of myocardial infarction (MI) amongst adults (≥18 years of age) as this has been poorly studied.</p> Methods <p>The study protocol was published on the International Prospective Register of Systematic Reviews (PROSPERO) (CRD42023409796) on March 31, 2023. Literature searches were conducted on 4 databases (Ovid Medline, Embase, CINAHL (Cumulative Index to Nursing and Allied Health Literature), and Web of Science) on January 17, 2023, for studies looking at associations between PM and MI. English studies from all time periods were assessed. Studies selected for review were time-series, case-crossover, and cohort studies which investigated the risk of MI as an outcome upon PM<sub>10</sub> exposure. The quality of evidence was assessed using Cochrane’s Grading of Recommendations, Assessment, Development and Evaluation (GRADE) approach. Data for different risk outcomes (risk ratio (RR), odds ratio (OR), hazard ratio (HR)) and 3 lags was meta-analyzed using an inverse variance statistical analysis using a random effects model. The pooled effect sizes and the 95% confidence intervals (CIs) were reported in forest plots.</p> Results <p>Among the 1,099 studies identified, 41 were included for review and 23 were deemed eligible for meta-analysis. Our analysis revealed that there is an increased risk (OR = 1.01; 95% CI:1.00–1.02) of MI with a 10 μg/m<sup>3</sup> increase in PM<sub>10</sub> after a lag 0 and lag 1 delay.</p> Conclusions <p>Our findings indicate that PM<sub>10</sub> exposure is associated with an increased risk of MI. This can aid in informing environmental policy-making, personal-level preventative measures, and global public health action.</p>","author":"Kleiton Strobl","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"be704234628d7b7f6a2fa81a48b1b30fffbf0851cea26cf04072cca8853daf16","category":"Interdisciplinary"}