{"title":"Craig Federighi ชี้แจงเอง เรื่องระบบสแกนภาพใน iPhone ยอมรับว่ามีกระแสตีกลับ","link":"https://www.blognone.com/node/124220","date":1628868501000,"content":"<div><div><div><p>Craig Federighi หัวหน้าฝ่ายวิศวกรรมซอฟต์แวร์ของแอปเปิล ให้สัมภาษณ์พิเศษกับ The Wall Street Journal ในประเด็น<a href=\"https://www.blognone.com/node/124093\">ระบบสแกนภาพอนาจารเด็ก</a>ในโทรศัพท์ (CSAM) ซึ่งมี<a href=\"https://www.blognone.com/node/124109\">กระแส</a>ตีกลับ<a href=\"https://www.blognone.com/node/124115\">แสดงความกังวล</a>อยู่มาก แม้แต่ใน<a href=\"https://www.blognone.com/node/124215\">กลุ่มพนักงานของแอปเปิล</a>เอง</p>\n<p>โดย Craig บอกว่ากระแสตอบรับที่ออกมามีความเข้าใจในด้านลบอยู่มาก เขาจึงอยากชี้แจงให้ทุกคนเห็นข้อดีและเข้าใจสิ่งที่แอปเปิลทำอยู่ ประเด็นแรกคือแอปเปิลเปิดตัว 2 ฟีเจอร์ใหม่พร้อมกัน นั่นคือ ระบบสแกนภาพโป๊เด็ก<a href=\"https://www.blognone.com/node/124139\">ที่มีการอัปโหลดขึ้น iCloud</a> และ<a href=\"https://www.blognone.com/node/124099\">ระบบวิเคราะห์หาภาพโป๊ใน Message</a> สำหรับผู้ปกครองใช้ตรวจสอบเด็ก โดยสองฟีเจอร์นี้ทำงานแยกขาดจากกันเด็ดขาด ไม่เกี่ยวข้องกันแต่อย่างใด</p>\n<p>Craig ลงรายละเอียดของส่วนการสแกนภาพโป๊เด็ก โดยย้ำว่าจะสแกนเฉพาะภาพที่อัปโหลดขึ้น iCloud เท่านั้น จึงไม่มีการสแกนหาภาพที่ระดับโทรศัพท์ และระบบจะตรวจจับภาพที่เข้าข่ายโดยจับคู่กับฐานข้อมูลภาพโป๊เด็กที่มี ซึ่งมาจากองค์กรที่มีการตรวจสอบข้อมูล และต้องมีจำนวนภาพถึงระดับหนึ่งเท่านั้น (ในข่าวระบุว่า 30) แอปเปิลจึงจะได้รับการแจ้งเตือนเพื่อเข้าไปตรวจสอบบัญชี ฉะนั้นรูปที่ไม่เข้าเกณฑ์เช่น ภาพลูกที่บ้านนั่งเล่นในอ่างอาบน้ำ ซึ่งมีคนตั้งคำถามเป็นจำนวนมาก หรือภาพโป๊อื่น ๆ ก็จะไม่ถูกตรวจสอบในกรณีนี้ รวมทั้งรูปในฐานข้อมูลที่อ้างอิงก็เป็นหน่วยงานที่ทำด้าน CSAM โดยเฉพาะ จึงไม่ต้องกังวลว่าจะมีการสอดแทรกข้อมูลเพื่อตรวจสอบในแง่อื่นหรือไม่</p>\n<p>ส่วนระบบของ Message ที่ให้ผู้ปกครองรับการแจ้งเตือนเมื่อเด็กรับส่งภาพโป๊นั้น การแจ้งเตือนจะส่งให้กับผู้ปกครองเท่านั้น แอปเปิลจะไม่รับทราบเรื่องนี้ และผู้ใช้ต้องกดยินยอมก่อนการใช้งาน</p>\n<p>ที่มา: <a href=\"https://www.wsj.com/articles/apple-executive-defends-tools-to-fight-child-porn-acknowledges-privacy-backlash-11628859600\">The Wall Street Journal</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/be5615413cd6cd6240adc016b5a7fd95.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/privacy\">Privacy</a></div><div><a href=\"/topics/craig-federighi\">Craig Federighi</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"be79884225716d45a1e1af4a1fd2ebd77faa2f91f1c3aafee20f0b9b8d47cd2e","category":"Thai"}