{"title":"New insights into the nexus between international trade, urbanization, nonrenewable energy consumption, and environmental quality in China: Evidence from Multivariate Threshold Regression","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12438?af=R","date":1708997374000,"content":"<h2>Abstract</h2>\n<p>International trade (TRADE), urbanization (URB), and nonrenewable energy consumption (NRE) can pose significant impacts on environmental quality and economic growth. In addition, TRADE and URB can influence the transition to cleaner energy within an economy. China is one of the largest economies with a massive contribution to global carbon emissions. Thus, there is a need for a comprehensive study that could explore the interrelationships between TRADE, URB, NRE, and environmental quality to assist economic and environmental policymaking in the country. This study explores these relationships and also reveals the precise threshold levels that these factors should not exceed to protect the environment and promote sustainability. The time series data from the Chinese economy from 1980 to 2021 are analyzed by using the Multivariate Threshold Regression (MThR) model. The findings revealed that TRADE has a detrimental impact on environmental quality in the low regime whereas a positive effect in the high regime. In contrast, NRE negatively affects the environment in both regimes, while URB positively influences the environmental quality in both regimes. Furthermore, the threshold levels of variables required to influence sustainability and promote environmental quality were revealed as 46.74% of GDP for TRADE, 45.20% of the total population for URB, and 23448.2TWh for NRE. Moreover, TRADE leads the transition from traditional to modern energy consumption, while URB does not play a leading role in the energy transition. Based on the results, policies are recommended to promote sustainable development.</p>","author":"Ali Sohail, \nBabar Nawaz Abbasi, \nZahoor Ahmed","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"be7a282be5b6942a70374bd3479b1da4425589fd067bc8159193aad123ac15c9","category":"Environment"}