{"title":"Gravel racing explained: everything you need to know about cycling’s newest race discipline","link":"https://www.bikeradar.com/features/routes-and-rides/gravel-racing/","date":1637323239000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/Unbound-4-72a3949.jpg?quality=45&amp;resize=620,413\" />                                            <p><span>Gravel bikes have exploded in popularity in recent years. These wide-tyred, drop-bar machines open up a whole new world of riding possibilities and have also spawned a new bike racing discipline – gravel racing. </span></p>\n<p>There are now gravel races across all four corners of the globe, from single-day events to multi-stage epics. Crucially, however, gravel racing centres around fun and community just as much as it does competition.</p>\n<p>If you’re keen to dip your toe into the blossoming world of gravel racing but don’t know where to start, here’s everything you need to know, including race formats, what you need to get started, why you should give it a go and five of our favourite events.</p>\n<h2>What is gravel racing?</h2>\n<p>Defining any part of <a href=\"https://www.bikeradar.com/advertising-feature/what-is-gravel-riding/\">gravel riding</a> can be difficult and, with such varied formats, terrain and approaches, that’s the case for gravel racing, too.</p>\n<p>However, gravel racing sits somewhere between road, cyclocross and mountain bike racing, and tends to take place on open gravel roads, dirt double tracks and snaking singletrack, often with some stretches of paved road to link off-road segments.</p>\n<p>Gravel races are rapidly gaining popularity across the world with a variety of formats, each offering a different flavour and designed to suit a range of riding styles. From day-long races over relatively smooth gravel roads to enduro courses peppered with short and spicy singletrack, there’s something to suit everyone.</p>\n<p>As a relatively new racing discipline, gravel racing has a strong ethos of inclusivity and fun. Although the racing is very competitive at the pointy end (especially with the recent influx of current and ex-pro road cyclists at many popular races), there’s still a keen emphasis on participation, regardless of speed.</p>\n<p>Unlike road racing or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-country-racing-guide/\">cross-country racing</a>, gravel races don’t tend to be categorised by ability, so you’re much more likely to see a mass start rather than separate races for ages, genders and bike types. You’re unlikely to find cash pay-outs for podium places at gravel races, but many do have quirky trophies.</p>\n<h3>Gravel-racing formats</h3>\n<p>There are three popular formats when it comes to gravel racing, each taking elements from other disciplines.</p>\n<h4>Single-stage gravel races</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Unbound is arguably the best-known gravel race in the world.</span></figcaption><span> <i>Andy Chastain</i></span></div>\n<p>The first and most straightforward format is the single-stage race, where participants compete from the start to the finish line, just like a <a href=\"https://www.bikeradar.com/advice/nutrition/21-tips-for-first-time-gran-fondo-riders/\">gran fondo</a> or mountain bike marathon race.</p>\n<p>These tend to vary greatly in distance, including much longer events, such as Unbound Gravel’s 206-mile epic.</p>\n<h4>Enduro-style gravel races</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Having been pioneered by the Grinduro series, enduro-style gravel races are extremely popular.</span></figcaption><span> <i>Stephen Smith / smithphoto.co.uk</i></span></div>\n<p>Enduro-style gravel events, pioneered by the Grinduro series, are popular with many riders thanks to the blend of social riding and racing.</p>\n<p>Just like MTB <a href=\"https://www.bikeradar.com/features/beginners-guide-to-enduro-racing/\">enduro racing</a>, riders only compete against the clock during specified segments of the course, which could be climbs, descents, technical tracks or rolling sections.</p>\n<p>For the rest of the course, riders can take a more leisurely pace if they wish, as the winners are determined by the riders with the lowest aggregate times over the enduro sections only.</p>\n<h4>Multi-stage gravel races</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Multi-stage races provide the opportunity to test yourself day after day.</span></figcaption><span> <i>John Gibson Pictures / @gibbymtbphoto</i></span></div>\n<p>For riders looking for endurance-focused racing, stage races such as the TransRockies Gravel Royale offer a multi-day format that will test the legs day after day.</p>\n<p>These multi-stage races can either be self-supported like most bikepacking races, or supported with kit transfers and overnight accommodation options, just like some cross-country MTB or road stage races.</p>\n<section><div>\n        <h3>How fast are gravel races?</h3>\n<p>The general pace of a gravel race depends on the format, course profile, terrain and, of course, whether you’re looking at the race leaders or riders who choose to adopt more of a ‘party pace’.</p>\n<p>At some of the fastest and most competitive gravel races, often in North America, average speeds can reach eye-watering levels, like ex-road pro Ian Boswell’s 20mph average over 10 hours in the saddle to win Unbound Gravel in 2021.</p>\n<p>\n\n    </p></div>\n    </section><h2>Why we love gravel racing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gravel racing – and gravel riding as a whole – is often seen as an antidote to established disciplines.</span></figcaption><span> <i>Wilderness Trail Bikes</i></span></div>\n<p>Thrilling, fun and sociable: as a new discipline, the gravel-racing community has had the opportunity to develop as a 21st century cycling sport independent of historical perceptions and the restrictions of governing body rules <em>(Editor’s note: the UCI has announced an officially sanctioned series of mass-participation events plus a gravel World Championships for 2022).</em></p>\n<p>Everyone is welcome when it comes to gravel racing. Ultimately, gravel races cater for a wide variety of riders and ability levels – perhaps more so than any other bike-racing discipline. If you’re keen, you’re in.</p>\n<p>Ride whatever bike you like, wear what you like, ride as fast or as slow as you like – gravel is often seen as a much-needed antidote to the unwritten rules spurred from other types of cycling sport.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The spirit of gravel racing is as much about having fun as it is performance.</span></figcaption><span> <i>John Gibson Pictures / @gibbymtbphoto</i></span></div>\n<p>By moving away from traffic onto quieter roads and car-free tracks, gravel riding, and indeed racing, can take you to some spectacularly remote and wild places. Gravel riding tends to take you further from the beaten track than road cycling and typically covers greater distances than most mountain bike races.</p>\n<p>Gravel racing gives you the opportunity to get whatever you want out of it, whether that’s the camaraderie of getting around a mammoth course and riding into the early hours of the next day to finish, or blasting around mountainside dirt trails in the hope of a podium position.</p>\n<p>What’s true for most riders, though, is that the unique community is key to making gravel racing special.</p>\n<h2>Do you need a gravel bike?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can expect to see a wide variety of bikes at a gravel race.</span></figcaption><span> <i>Andy McCandlish</i></span></div>\n<p>In a word, no. Although most events and courses will be geared towards gravel bikes, you could certainly use a mountain bike or cyclocross bike.</p>\n<p>You’re likely to see a range of different steeds at gravel races, from <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/\">aero road bikes</a> fitted with wide tyres for the smoothest of dirt courses (yes, really; check out Peter Stetina’s 2019 Belgian Waffle Ride win aboard his Trek Madone), to MTB tandems and awesome adapted cycles at accessible courses such as the Dukes Weekender.</p>\n<p>Where the course is known to be more technical, you might even prefer to ride a mountain bike, if you have one in your fleet. A lot of it comes down to personal preference and the terrain you’re likely to encounter.</p>\n\n<h2>Three bike setup tips</h2>\n<p>If you’re looking to get your bike fine-tuned ahead of an event, here are three setup tips to consider.</p>\n<h3>Tyre choice is key</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tyre choice is key for gravel racing. Consider the terrain you’re likely to encounter and choose your tyres accordingly.</span></figcaption><span> <i>Wilderness Trail Bikes</i></span></div>\n<p>As your main contact with the ground, your tyres are the single component that can make the biggest difference to your ride. Think about how suited your tyres are to the course: is it likely to be wet or dry, rough or smooth, and how much is off-road vs road?</p>\n<p>There’s plenty of choice when it comes to gravel rubber, including different <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">wheel sizes</a> and a broad range of tyre widths, so take a look at our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">best gravel tyres</a> to narrow down your options.</p>\n<p>If you haven’t yet ditched your <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tubes</a>, consider switching to <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a>. Investing in a <a href=\"https://www.bikeradar.com/features/how-to-set-up-road-tubeless-tyres/\">tubeless setup</a> can give you increased puncture protection and will also allow you to run lower tyre pressures for better grip. Both are important for off-road riding.</p>\n<h3>Be comfortable</h3>\n<p>Whether it’s a relatively short race or multiple days on the bike, you’ll need to be happy with your <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-position/\">bike position</a> in order to get the most out of your ride and stay comfortable.</p>\n<p>Make sure you practise with your chosen setup before the event, whether that’s different components or a more aggressive bike fit.</p>\n<p>For longer endurance races, consider using <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-bars-and-clip-ons/\">clip-on aero bars</a> (if permitted) for additional hand-position options and to reduce drag.</p>\n<h3>Check your gearing</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pay attention to your gearing setup to give yourself options both on climbs and the flat.</span></figcaption><span> <i>Wilderness Trail Bikes</i></span></div>\n<p>Heading to the mountains or sticking to the flatlands? Make sure that you have the right <a href=\"https://www.bikeradar.com/news/bikeradar-podcast-1x-vs-2x-gravel/\">gravel gearing</a> at either end of your range, so you can put the power down on faster sections and also spin your way up steeper inclines.</p>\n<p>If you’re carrying <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a>, you’ll also need an easy enough gear to compensate for the additional weight.</p>\n<h2>What else do you need to get started?</h2>\n<p>The good news is that you actually need very little to get into gravel racing.</p>\n<p>However, just like any cycling discipline, you will need to make sure you have the tools and spares required for <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">fixing a puncture</a>. If you’re running a tubeless setup, you’ll need to know how to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-repair-tubeless-puncture/\">repair a tubeless tyre</a>, in case you do get a cut the sealant can’t deal with.</p>\n<p>The basics to carry include a mini-pump (capable of delivering enough volume to inflate your tyres), a spare tube or two, tyre boot, inner tube patches and tubeless tyre plugs. It’s also a really good idea to take a basic first aid kit with you.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> As with any ride or race, make sure you have the essentials to keep yourself fed, watered and with two wheels turning.</span></figcaption><span> <i>Wilderness Trail Bikes</i></span></div>\n<p>Make sure you have a couple of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bottle-cages/\">bottle cages</a> on your bike so you can carry plenty of water between resupply points, and have a good idea of what nutrition works for you on the bike.</p>\n<p>Whether you use <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless or flat pedals</a> will depend on your riding style and what you’re comfortable with. If you use clipless pedals, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bike-shoes/\">gravel bike shoes</a> are designed to provide a stiff platform for putting the power down, while still providing off-bike grip and plenty of comfort for long rides. Most gravel shoes use an <a href=\"https://www.bikeradar.com/advice/buyers-guides/shimano-spd-vs-spd-sl/\">SPD-style cleat</a> compatible with <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-pedals/\">mountain bike pedals</a>.</p>\n<p>If you’re embarking on a multi-stage race, you’ll likely need more kit, including <a href=\"https://www.bikeradar.com/features/routes-and-rides/heres-what-you-need-for-a-bikepacking-adventure/\">bikepacking gear</a> or camping equipment to carry or be transferred between stages. With that in mind, if you’re new to gravel racing, it might be best to start out with a single-stage or enduro event.</p>\n<h2>Five of the best gravel races</h2>\n<p>Finally, here are five of our favourite gravel races to seek out for yourself.</p>\n<h3>Grinduro</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Grinduro series is now spread across six race weekends worldwide.</span></figcaption><span> <i>Stephen Smith / smithphoto.co.uk</i></span></div>\n<p>Founded in California in 2015, Grinduro now boasts no fewer than six race weekends worldwide, including events in Canada, Japan, Wales, Switzerland and Australia. They all share the same gravel enduro format – and a strong emphasis on the after-party, as well as the race.</p>\n<p>Grinduro courses have a reputation for being a bit spicier than most gravel races, so you’re likely to see a few more mountain bikes lining up at the start than many other gravel events.</p>\n\n<h3>Unbound Gravel</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The town of Emporia, Kansas comes alive for the epic Unbound gravel race.</span></figcaption><span> <i>Andy Chastain</i></span></div>\n<p>Perhaps the best-known gravel event in the world, the 206-mile <a href=\"https://www.bikeradar.com/features/pro-bike/unbound-2021-bikes/\">Unbound Gravel race</a> in Emporia, is a huge day out over the flint hills of Kansas.</p>\n<p>There are a number of other courses too, including 100, 50 and 25-mile options, plus a junior event. And don’t forget the new Unbound XL – more than 350 miles of gravel racing.</p>\n<p>It’s not just the distances that are huge at Unbound Gravel – the event attracted more than 4,000 participants in 2021. The buzz around this small Midwest town is electric, with all the local businesses, from bars to diners, getting on board to welcome gravel racers from all over the world.</p>\n<h3>Dukes Weekender</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Dukes Weekender is comprised of a timed hill climb on a closed road, as well as a gravel enduro.</span></figcaption><span> <i>Duke's Weekender</i></span></div>\n<p>Set in the Scottish gravel paradise that is Gravelfoyle (aka Aberfoyle) in the Loch Lomond &amp; The Trossachs National Park, the Dukes Weekender is a two-stage gravel race including a timed hill climb and gravel enduro.</p>\n<p>Named after the Duke’s Pass – the road linking Aberfoyle and Loch Katrine that forms the hill climb course – the family-oriented weekend event also features evening entertainment and a 14km mini enduro for children.</p>\n<h3>Bohemian Border Bash</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Bohemian Border Bash follows a 1,300km route through Germany, Poland and the Czech Republic.</span></figcaption><span> <i>Bohemian Border Bash</i></span></div>\n<p>Stretching for more than 1,300km around Bohemia, and passing through Germany, Poland and the Czech Republic in the process, the Bohemian Border Bash is an almighty single-stage gravel race (which might also be referred to as a bikepacking race).</p>\n<p>Riders follow the fixed route either as a solo entry or a pair, aiming to complete the loop in the shortest time possible. Not only do you need to conquer the distance, but you’ll need to look after yourself along the way, finding your own resupply and overnight spots.</p>\n<h3>TransRockies Gravel Royale</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The TransRockies serves up jaw-dropping views of the Canadian Rockies.</span></figcaption><span> <i>John Gibson Pictures / @gibbymtbphoto</i></span></div>\n<p>Crossing the Canadian Rockies over four days, with some 375 kilometres of racing and 7,000 metres of elevation gain in between, the TransRockies Gravel Royale is the most luxurious supported gravel stage race you could imagine.</p>\n<p>You’ll be fed and watered at the start and end of every day, as well as at checkpoints along the way. You’ll also arrive at camp each night with your tent set up ready for you.</p>\n<p>Make use of the showers, bike wash, massage therapists and sports physios travelling with you, to ensure both your body and bike stay in top working order.</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"be8b436ff9738e2ca25d6ee185e7eedf19ec0ff3805e3e43a8fbc75f6311ac31","category":"Cycling"}