{"title":"OpenAI Launches Official ChatGPT App for iPhone and iPad","link":"https://www.macrumors.com/2023/05/18/openai-chatgpt-ios-app/","date":1684432597000,"content":"OpenAI today <a href=\"https://openai.com/blog/introducing-the-chatgpt-app-for-ios\">announced the launch</a> of an official ChatGPT app for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. OpenAI's ChatGPT has been accessible <a href=\"https://openai.com\">on the web</a> and has been made available on iOS through multiple third-party apps, many of which are <a href=\"https://www.macrumors.com/2023/04/25/chatgpt-scam-apps-mac-app-store/\">little better than scam apps</a>, but this legitimate version will give users a safe way to use ChatGPT on the go.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/chatgpt-for-iphone.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nChatGPT is an AI-based chatbot that uses generative artificial intelligence to answer questions and provide advice on all manner of subjects. OpenAI says that ChatGPT can help with all of the following:\r<br />\n<ul>\r<br />\n \t<li>Instant answers: Get precise information without sifting through ads or multiple results.</li>\r<br />\n \t<li>Tailored advice: Seek guidance on cooking, travel plans, or crafting thoughtful messages.</li>\r<br />\n \t<li>Creative inspiration: Generate gift ideas, outline presentations, or write the perfect poem.</li>\r<br />\n \t<li>Professional input: Boost productivity with idea feedback, note summarization, and technical topic assistance.</li>\r<br />\n \t<li>Learning opportunities: Explore new languages, modern history, and more at your own pace.</li>\r<br />\n</ul>\r<br />\nHistory is synced across devices, so you can see your ChatGPT interactions both on the web and on iOS devices, and it integrates the Whisper speech recognition system.\r<br />\n\r<br />\nAs of right now, ChatGPT for iOS is limited to the United States, but OpenAI plans to bring it to additional countries in the coming weeks. The company says that the app will see continuous feature and safety improvements based on user feedback.\r<br />\n\r<br />\nThe ChatGPT app is free to use, but it does cost $19.99 per month for the ChatGPT Plus service. That is the same price available through the web, with Plus providing availability even when demand is high, faster response times, and priority access to new features such as GPT-4, the more advanced version of ChatGPT.\r<br />\n\r<br />\nAn OpenAI account is required to use the ChatGPT app, and it can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/app/openai-chatgpt/id6448311069\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/chatgpt/\">ChatGPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/18/openai-chatgpt-ios-app/\">OpenAI Launches Official ChatGPT App for iPhone and iPad</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/openai-launches-official-chatgpt-app-for-iphone-and-ipad.2389902/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"be8f53733a470626069a14ac3ea891076b01e3ff3c428df88c97b7d8b8379c42","category":"Apple"}