{"title":"Announcing Amazon SageMaker Canvas – a Visual, No Code Machine Learning Capability for Business Analysts","link":"https://aws.amazon.com/blogs/aws/announcing-amazon-sagemaker-canvas-a-visual-no-code-machine-learning-capability-for-business-analysts/","date":1638295312000,"content":"<p>As an organization facing business problems and dealing with data on a daily basis, the ability to build systems that can predict business outcomes becomes very important. This ability lets you solve problems and move faster by automating slow processes and embedding intelligence in your IT systems.</p> \n<p>But how do you make sure that all teams and individual decision makers in the organization are empowered to create these machine learning (ML) systems at scale, and without depending on other data science and data engineering teams? As a business user or data analyst, you’d like to build and use prediction systems based on the data that you analyze and process every day, without having to learn about hundreds of algorithms, training parameters, evaluation metrics, and deployment best practices.</p> \n<p>Today, I’m excited to announce the general availability of <span>Amazon SageMaker Canvas</span>, a new visual, no code capability that allows business analysts to build ML models and generate accurate predictions without writing code or requiring ML expertise. Its intuitive user interface lets you browse and access disparate data sources in the cloud or on-premises, combine datasets with the click of a button, train accurate models, and then generate new predictions once new data is available.</p> \n<p>SageMaker Canvas leverages the same technology as <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> to automatically clean and combine your data, create hundreds of models under the hood, select the best performing one, and generate new individual or batch predictions. It supports multiple problem types such as binary classification, multi-class classification, numerical regression, and time series forecasting. These problem types let you address business-critical use cases, such as fraud detection, churn reduction, and inventory optimization, without writing a single line of code.</p> \n<p><strong><span>SageMaker Canvas in Action</span></strong><em><strong><br /> </strong></em>Imagine that I’m an e-commerce manager who needs to predict whether or not a product will be shipped on time. The datasets at my disposal consist of a product catalog and the historical shipping dataset, both in CSV format.</p> \n<p>First, I enter the SageMaker Canvas application where all of my models and datasets are created and inspected.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-empty-1024x541.png\" /></p> \n<p>I select <strong>Import</strong>, and upload two CSV files: <em>ProductData.csv</em> and <em>ShippingData.csv</em>. I have 120 products and 10,000 shipping records.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-csv-products-1024x400.png\" /></p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-csv-shipping-1024x101.png\" /></p> \n<p>I could also fetch data from <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> or connect to other cloud or on-premises data sources, such as <a href=\"https://aws.amazon.com/redshift/\">Amazon Redshift</a> or Snowflake. For this use case, I prefer to upload 1.6 MB of data directly from my computer.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/24/sagemaker-canvas-dataset-upload-1024x406.png\" /></p> \n<p>Before confirming the import, I have a chance to preview the two datasets, their columns, and their respective values. For example, each product has a <em>ComputerBrand</em>, <em>ScreenSize</em>, and <em>PackageWeight</em>. In addition to useful columns such as <em>ShippingOrigin</em>, <em>OrderDate</em>, and <em>ShippingPriority</em>, each record in the shipping dataset also contains <em>OnTimeDelivery</em>, which is either <em>On Time</em> or <em>Late</em>. This column will be used by SageMaker Canvas to generate a prediction model based on historical data.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-review-1024x437.png\" /></p> \n<p>After a few seconds of processing, the datasets are ready, and I decide to join them to create a single dataset containing both product and shipping information. This is an optional step that often lets you increase the precision of a prediction model.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-list-1024x236.png\" /></p> \n<p>Now I can simply drag and drop the two datasets: SageMaker Canvas will automatically identify the shared <em>ProductId</em> column and apply an Inner Join transformation.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-join-1024x323.png\" /></p> \n<p>The join preview lets me visualize the resulting columns, identify missing or invalid values, and optionally deselect unwanted columns.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-dataset-join-preview-1024x586.png\" /></p> \n<p>I select <strong>Save joined data</strong> and provide a new name for this joined dataset, which now includes 16 columns and 10,000 records.</p> \n<p>Next, I want to create a model and start by selecting <strong>New model</strong> in the <strong>Models</strong> section on the left menu. I call it <em>On Time Prediction Model</em>.</p> \n<p>The first step is selecting a dataset.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/19/canvas-model-select-1024x606.png\" /></p> \n<p>I select a target column that my model will predict: <em>OnTimeDelivery</em>.</p> \n<p>SageMaker Canvas shows me the value distribution and already recommends the most appropriate model type: two categories classification.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/sagemaker-canvas-model-build-1-1024x567.png\" /></p> \n<p>Before proceeding with the model training, I have the option to generate an analysis report. This analysis gives me two very important pieces of information: the estimated accuracy and the impact of each column.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/sagemaker-canvas-model-preview-1024x552.png\" /></p> \n<p>The estimated accuracy of 99.9% gives me confidence, but then I notice that the highest impact is provided by the <em>ActualShippingDays</em> column. Unfortunately, this column is not available in advance and I can’t use it for my predictions. So I deselect it and run the analysis again.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/sagemaker-canvas-model-preview-ok-1024x561.png\" /></p> \n<p>The new estimated accuracy is 94.2%, which is still pretty high. The most impactful columns are <em>ShippingPriority</em>, <em>YShippingDistance</em>, <em>XShippingDistance</em>, and <em>Carrier</em>. This is great because all of this information is available in advance and can be used for a prediction. On the other hand, product-related columns, such <em>PackageWeight</em> and <em>ScreenSize</em>, have very small impacts on the prediction. This means that in the future I could simplify the overall process by feeding only shipping information into the training and prediction phases.</p> \n<p>I’m happy with the analysis insights. Therefore, I decide to proceed and build a prediction model by selecting the <strong>Standard build option</strong>.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/24/sagemaker-canvas-model-training-1024x385.png\" /></p> \n<p>Now I can go for a walk, attend a few productive meetings, or simply spend some time with family. SageMaker Canvas is doing all of the work for me, training hundreds of models behind the scenes. It will select the best performing one, so that I can start generating accurate predictions in a couple of hours. Of course, the training duration will vary depending on the dataset size and problem type.</p> \n<p>After about an hour and a half, the model is ready and the console lets me analyze its accuracy and the column impacts visually. I’m also happy to see that the model predicts the correct value 95.8% of the time, which is even higher than the estimated accuracy.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/sagemaker-canvas-model-analysis-1-1024x463.png\" /></p> \n<p>Optionally, I could also inspect advanced metrics such as Precision, Recall, F1 Score, and so on. These metrics help me understand how the model is performing and what kind of false positives and false negatives I can expect from this model.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/sagamaker-canvas-advanced-metrics-1024x552.png\" /></p> \n<p>From here, I could share the model into <a href=\"https://aws.amazon.com/sagemaker/studio/\">Amazon SageMaker Studio</a> or continue using the Canvas UI to generate new predictions.</p> \n<p>I decide to continue with the intuitive UI and select <strong>Predict</strong>. Now I can work with individual records or with a dataset for batch predictions.</p> \n<p>When selecting <strong>Single prediction</strong>, SageMaker Canvas simplifies my life and lets me start from an existing record. I modify the column values and get immediate feedback on the prediction and the corresponding feature importance.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/24/sagemaker-canvas-predict-single-record-1024x478.png\" /></p> \n<p>This quick feedback loop and intuitive UI allows me to use the ML model without having to write custom code. In case I decide to integrate the model into an automated production system, the Amazon SageMaker Studio integration lets me share the model easily with other data scientists in my team.</p> \n<p><span><strong>Generally Available Today</strong></span><br /> SageMaker Canvas is generally available in US East (Ohio), US East (N. Virginia), US West (Oregon), Europe (Frankfurt), and Europe (Ireland). You can start using it with your local datasets, as well as data already stored on Amazon S3, Amazon Redshift, or Snowflake. With just a few clicks, you’ll prepare and join your datasets, analyze estimated accuracy, verify which columns are impactful, train the best performing model, and generate new individual or batch predictions. We’re excited to hear your feedback and help you solve even more business problems with ML.</p> \n<p><a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/canvas.html\">Check out the new SageMaker Canvas documentation here</a>.</p> \n<p>— <a href=\"https://twitter.com/alex_casalboni\">Alex</a></p>","author":"Alex Casalboni","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"be91ca9c87ddfce16e747be3d1489b604f31270c8cf960760452607a552b85d1","category":"Tech"}