{"title":"Effect of green infrastructure on restoration of pollination networks and plant performance in semi‐natural dry grasslands across Europe","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14592?af=R","date":1708923667000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5e902abc-3e9b-49df-8bf5-16f90fa179af/jpe14592-toc-0001-m.png\" alt=\"Effect of green infrastructure on restoration of pollination networks and plant performance in semi-natural dry grasslands across Europe\" />\n<p>Our findings provide evidence of the necessity to enhance ecosystem functions while avoiding biotic homogenisation. Restoration programs should aim at increasing landscape connectivity which influences plant communities, pollinator assemblages and their interaction patterns. To avoid generalist species taking over from specialists in restored grasslands, we suggest reinforcing the presence of specialist species in the latter, for instance by means of introductions, as well as increasing the connectivity to source populations.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAgricultural intensification, afforestation and land abandonment are major drivers of biodiversity loss in semi-natural grasslands across Europe. Reversing these losses requires the reinstatement of plant–animal interactions such as pollination. Here we assessed the differences in species composition and patterns of plant-pollinator interactions in ancient and restored grasslands and how these patterns are influenced by landscape connectivity, across three European regions (Belgium, Germany and Sweden).\n\nWe evaluated the differences in pollinator community assemblage, abundance and interaction network structure between 24 ancient and restored grasslands. We then assessed the effect of surrounding landscape functional connectivity (i.e. green infrastructure, GI) on these variables and tested possible consequences on the reproduction of two model plants, <i>Lotus corniculatus</i> and <i>Salvia pratensis</i>.\n\nNeither pollinator richness nor species composition differed between ancient and restored grasslands. A high turnover of interactions across grasslands was detected but was mainly due to replacement of pollinator and plant species. The impact of grassland restoration was consistent across various pollinator functional groups, whereas the surrounding GI had differential effects. Notably, bees, butterflies, beetles, and dipterans (excluding hoverflies) exhibited the most significant responses to GI variations. Interestingly, networks in restored grasslands were more specialised (i.e. less functionally redundant) than in ancient ones and also showed a higher number of insect visits to habitat-generalist plant species. Landscape connectivity had a similar effect, with habitat-specialist plant species receiving fewer visits at higher GI values.\n\nFruit set in <i>S. pratensis</i> and <i>L. corniculatus</i> was unaffected by grassland type or GI. However, the fruit set in the specialist <i>S. pratensis</i> increased with the number of pollinator visits, indicating a positive correlation between pollinator activity and reproductive success in this particular species.\n\n<i>Synthesis and applications.</i> Our findings provide evidence of the necessity to enhance ecosystem functions while avoiding biotic homogenisation. Restoration programs should aim at increasing landscape connectivity which influences plant communities, pollinator assemblages and their interaction patterns. To avoid generalist species taking over from specialists in restored grasslands, we suggest reinforcing the presence of specialist species in the latter, for instance by means of introductions, as well as increasing the connectivity to source populations.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLa intensificación agrícola, la forestación y el abandono de tierras son factores clave en la pérdida de biodiversidad en pastizales semi-naturales en toda Europa. Revertir estas pérdidas requiere restablecer interacciones planta-animal, como la polinización. En este estudio, evaluamos las diferencias en la composición de especies y patrones de interacciones planta-polinizador en pastizales antiguos y restaurados, y cómo estos patrones son influenciados por la conectividad del paisaje en tres regiones europeas (Bélgica, Alemania y Suecia).\n\nExaminamos las diferencias en el ensamblaje de la comunidad de polinizadores, su abundancia y la estructura de la red de interacciones planta-polinizador en 24 pastizales antiguos y restaurados. Luego, evaluamos el efecto de la conectividad funcional del paisaje circundante (es decir, infraestructura verde, GI) en estas variables y evaluamos posibles consecuencias en la reproducción de dos plantas modelo, <i>Lotus corniculatus</i> y <i>Salvia pratensis</i>.\n\nNo hubo diferencias en la riqueza de polinizadores ni en la composición de especies entre los pastizales antiguos y restaurados. El impacto de la restauración de pastizales fue consistente en diversos grupos funcionales de polinizadores, mientras que la GI circundante tuvo efectos diferenciales. Destacadamente, abejas, mariposas, escarabajos y dípteros (excluyendo sírfidos) mostraron las respuestas más significativas a las variaciones en la GI. Curiosamente, las redes en pastizales restaurados fueron más especializadas (menos funcionalmente redundantes) que en los antiguos y también mostraron un mayor número de visitas de insectos a especies de plantas generalistas de hábitat. La conectividad del paisaje tuvo un efecto similar, con especies de plantas especializadas recibiendo menos visitas a mayores valores de GI.\n\nLa producción de frutos en <i>S. pratensis</i> y <i>L. corniculatus</i> no se vió afectada por el tipo de pastizal o la GI. Sin embargo, la producción de frutos en la especialista <i>S. pratensis</i> aumentó con el número de visitas de polinizadores, indicando una correlación positiva entre la actividad de polinización y el éxito reproductivo en esta especie.\n\n<i>Síntesis y aplicaciones</i>. Nuestros resultados evidencian la necesidad de evitar la homogeneización biótica. Los programas de restauración deben apuntar a aumentar la conectividad del paisaje, que influye en las comunidades de plantas y polinizadores y sus patrones de interacción. Para evitar que especies generalistas desplacen a especialistas en pastizales restaurados, sugerimos reforzar la presencia de especies especialistas en estos, por ejemplo, mediante introducciones, así como aumentar la conectividad con poblaciones fuente.\n</p>","author":"Anna Traveset, \nCarlos Lara‐Romero, \nSilvia Santamaría, \nGema Escribano‐Ávila, \nJames M. Bullock, \nOlivier Honnay, \nDanny A. P. Hooftman, \nAdam Kimberley, \nPatricia Krickl, \nJan Plue, \nPeter Poschlod, \nSara A. O. Cousins","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"beba7d87b56ffcc635a711ac2472061ee9fb199ff2db1b9b8fbe561c85f074b7","category":"Environment"}