{"title":"The Impact of Exposure Dosage and Host Genetics on the Shedding Kinetics of Flavobacterium psychrophilum in Rainbow Trout","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14026?af=R","date":1728458028000,"content":"<h2>ABSTRACT</h2>\n<p><i>Flavobacterium psychrophilum</i>, the causative agent of bacterial cold water disease (BCWD), is one of the leading pathogens in rainbow trout (<i>Oncorhynchus mykiss</i>) aquaculture. To date, there is little knowledge of the transmission kinetics of <i>F. psychrophilum</i> over the course of infection. In particular, how transmission is affected by host genotype and pathogen exposure dosage are not well studied. In order to fill in these knowledge gaps, we exposed two divergently selected lines of rainbow trout (ARS-Fp-R and ARS-Fp-S) to a range of dosages of <i>F. psychrophilum</i> (strain CSF117-10). We then measured mortality and bacterial shedding to estimate transmission risk at multiple time points since initial infection. As dosage increased, the number of fish shedding and the amount of bacteria shed increased ranging from 0% to 100% and 10<sup>3</sup> to 10<sup>8</sup> cells fish<sup>−1</sup> h<sup>−1</sup>, respectively. In addition, we found that disease resistance (survival) was not correlated with transmission risk blocking, in that 67% of fish which shed bacteria experienced no clinical disease. In general, fish mortality began on Day 3, peaked between Days 5–7 and was higher in the ARS-Fp-R line. Results from this study could be used to develop epidemiological models and improve disease management, particularly in the context of aquaculture and selective breeding.</p>","author":"Darbi R. Jones, \nJeremy Everson, \nTimothy D. Leeds, \nGregory D. Wiens, \nAndrew R. Wargo","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"bebd441c5468fa508a660f1aadd2f2e4cd5cb96c14da0b6f610a5cf007f48667","category":"Environment"}