{"title":"Thousands of workers go on strike at Ford, GM, and Stellantis plants","link":"https://arstechnica.com/?p=1968645","date":1694787927000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1667308774-800x524.jpg\" alt=\"Members of the UAW (United Auto Workers) picket and hold signs outside of the UAW Local 900 headquarters across the street from the Ford Assembly Plant in Wayne, Michigan on September 15, 2023.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1667308774-scaled.jpg\">Enlarge</a> <span>/</span>  The US auto workers' union announced the start of a strike at three factories just after midnight on Friday, September 15, as a deadline expired to reach a deal with employers on a new contract. (credit: Photo by MATTHEW HATCHER/AFP via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Almost 13,000 workers are on strike at three US car factories today after a midnight deadline came and went without an agreement between the United Auto Workers and Ford, General Motors, and Stellantis. It's the first time in the UAW's history that it has initiated strike action at all of the Big Three domestic car companies simultaneously, as negotiations on a new contract failed.</p>\n<p>UAW's strike action has been <a href=\"https://uaw.org/stand-strike-begins-big-three/\">narrowly targeted</a>. Although the union represents about 146,000 members, most of them are staying at their jobs. But 5,800 Stellantis workers at the company's Jeep plant in Toledo, Ohio, are now on strike, as are 3,600 GM workers at a plant in Wentzville, Missouri, plus 3,300 at Ford's factory in Wayne, Michigan.</p>\n<p>The union and automakers had been trying to reach a compromise before the 4-year-old contract between them expired on Thursday night. Among other things, the union has been looking to end the tiered pay structure in the industry where new hires into a job earn less. It is also seeking the restoration of cost-of-living increases and an end to automakers subverting union jobs with temporary workers.</p></div><p><a href=\"https://arstechnica.com/?p=1968645#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1968645&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bec2144b34faaf6f112a7f0ef038b651e0e5d56e11646e9ed86122ce96ba4e9a","category":"Tech"}