{"title":"Operational indicators for pulmonary tuberculosis diagnosis in people living with HIV before and after Xpert MTB/RIF implementation in the state of São Paulo, Brazil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305063","date":1717768800000,"content":"<p>by Mariana Gaspar Botelho Funari de Faria, Rubia Laine de Paula Andrade, Karina Fonseca de Sousa Leite, Rafaele Oliveira Bonfim, Ana Beatriz Marques Valênça, Antônio Carlos Vieira Ramos, Thais Zamboni Berra, Ricardo Alexandre Arcêncio, Maria Josefa Perón Rujula, Jaqueline Garcia de Almeida Ballestero, Erica Chimara, Antônio Ruffino Netto, Dulce Maria de Oliveira Gomes, Valdes Roberto Bollela, Aline Aparecida Monroe</p>\r\n\r\nTuberculosis (TB) in people living with HIV (PLHIV) is usually paucibacillary and the smear microscopy has limitations and may lead to high proportions of non-confirmed pulmonary tuberculosis (NC-PTB). Despite culture being the reference method, it usually takes 6 to 8 weeks to produce the results. This study aimed to analyze the effect of a rapid molecular test (Xpert) in the confirmatory rate of PTB among PLHIV, from 2010 to 2020, in São Paulo state, Brazil. This is an ecological study with time series analysis of the trend and the NC-PTB rates before and after Xpert implementation in 21 municipalities. The use of Xpert started and gradually increased after 2014, while the rate of NC-PTB in PLHIV decreased over this time, being more significant between late 2015 and mid-2017. The city of Ribeirão Preto stands out for having the highest percentage (75.0%) of Xpert testing among PLHIV and for showing two reductions in the NC-PTB rate. The cities with low Xpert coverage had a slower and smaller decrease in the NC-PTB rate. Despite being available since 2014, a significant proportion of PLHIV suspected of PTB in the state of São Paulo did not have an Xpert ordered by the doctors. The implementation of Xpert reduced the NC-PTB rates with growing effect as the coverage increased in the municipality.","author":"Mariana Gaspar Botelho Funari de Faria","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bec23a9d898e6c27ee47a235f2277c04db597ec62db2c1f45a68693cd96ce1a1","category":"Interdisciplinary"}