{"title":"Prevalence of oral rehydration solution use and its determinants in the treatment of diarrhea among under-five children in sub-Saharan Africa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303193","date":1714744800000,"content":"<p>by Sulaimon T. Adedokun, Sanni Yaya</p>\r\nBackground <p>Diarrhea is the second leading cause of under-five deaths claiming half a million children every year. Most of these deaths occurred in sub-Saharan Africa and South Asia. Oral rehydration solution (ORS) has been described as the most effective treatment of diarrhea. However, only 36% of children with diarrhea received ORS in sub-Saharan Africa. This study examined the factors associated with ORS use for children with diarrhea in the sub-region.</p> Methods <p>Demographic and Health Surveys (DHS) data sets of 31 countries in sub-Saharan Africa were used in this study. The data involved 30,102 under-five children with diarrhea. The multivariable analysis involved binary logistic regression.</p> Results <p>Prevalence of ORS use was 38% in sub-Saharan Africa with countries such as Namibia (71.8%), Zambia (66.4%) and Malawi (63.8%) having the highest rates. Use of ORS was most common among children whose mothers had secondary or higher education (45%), were exposed to media (41%) and attended antenatal care (41%). ORS use was significantly associated with secondary or higher education (OR = 1.63; 95%CI: [1.47–1.81]; p&lt;0.001), exposure to media (OR = 1.17; 95%CI: [1.07–1.27]; p&lt;0.001), antenatal care attendance (OR = 2.33; 95%CI: [1.08–1.27]; p&lt;0.001), child’s age (OR = 1.46; 95%CI: [1.35–1.59]; p&lt;0.001), child’s size at birth (OR = 1.08; 95%CI: [1.00–1.17]; p&lt;0.05), household size (OR = 1.28; 95%CI:[1.06–1.54]; p&lt;0.05) and source of drinking water (OR = 1.18; 95%CI: [1.09–1.29]; p&lt;0.001).</p> Conclusion <p>This study revealed a 38% prevalence of ORS use during diarrhea episodes in sub-Saharan Africa. This is low as it is less than the 44% recorded for developing countries as a whole. While this study emphasises the need for a further study on effects of severity of diarrhea on ORS use and factors determining differences in ORS use among countries, it also calls for interventions that will increase use of ORS is sub-Saharan Africa. Such interventions should include increase in literacy rate among girls and women, increase in the proportion of women with access to media, involvement of health workers in programmes that would promote antenatal care utilization among women at community level and provision of social amenities like pipe-borne water.</p>","author":"Sulaimon T. Adedokun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bec97e1abc7dea7b0da02c2afaa7224c26ce9f04a857fa27d4c093e2933357ca","category":"Interdisciplinary"}