{"title":"Cycling Plus January issue on sale now! Subscribe and save 51% on a year’s subscription","link":"https://www.bikeradar.com/news/cycling-plus-latest-issue-gift/","date":1638266400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/BR_blog_image_387_new1-3d282f8.jpg?quality=45&amp;resize=620,413\" />                                            <p><strong>The latest <em>Cycling Plus</em> comes complete with a glossy pull-out 2022 wall calendar to get your year off to a flyer.</strong></p>\n<div>\n    <img /></div>\n<p>In the main magazine’s unrivalled bike tests, we go electric with the testing of four super commuter ebikes that, as car replacements, should be part of our planet’s low-carbon future.</p>\n<p>We also have first ride reviews of the Merida Scultura V Team race bike and the alloy all-rounder Kinesis R2.</p>\n<p>Plus, if you <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPP387&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=xmasoffer_cpp387&amp;utm_content=promotional-article&amp;style=brand\" target=\"_blank\">subscribe today you can save 51% off the shop price</a>.</p>\n<h2>New gear</h2>\n<div>\n    <img /></div>\n<p>Upgrades come in the shape of the G-Shock GSW-H1000 watch, Kask Moebius WG11 helmet, and Santini Delta jersey and bibs. And with winter here to stay for a while, we test the best front lights on the market.</p>\n<h2>In-depth features</h2>\n<div>\n    <img /></div>\n<p>In Features, we partake in some cold play and show you how to inject some fun into your winter riding, report from the 10<sup>th</sup> anniversary of the Haute Route Alps multi-day sportive and profile the steepest climbs in Britain.</p>\n<h2>Big Ride: Swiss Alps</h2>\n<div>\n    <img /></div>\n<p>In the Big Ride spot, we’re in the Swiss Alps Valais region with our sights set on the beautiful beast of the Col du Sanetsch.</p>\n<p>In our Training Zone section, our Masterclass focusses on the world of indoor training and how to get the most out of your turbo trainer, while we have recipes to boost your immunity as the cold weather sets in.</p>\n<h2>2022 calendar</h2>\n<div>\n    <img /></div>\n<p>This issue also sees the return of our annual wall calendar. You guessed it – it’s the turn of 2022!</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div>\n<p><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPP387&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=xmasoffer_cpp387&amp;utm_content=promotional-article&amp;style=brand\" target=\"_blank\">Subscribe to Cycling Plus magazine today</a> and you’ll get 51% off a year’s subscription.</p>\n<p>Whether you’re looking at investing in a new bike, trying a different kind of cycling or searching for new gear to make those days on the road more comfortable, <em>Cycling Plus</em> is the magazine for you.</p>\n<p>You’ll find inspiring features from across the UK and around the world on every page, plus interviews with the movers and shakers in cycling.</p>\n<p>Remember, <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPP387&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=xmasoffer_cpp387&amp;utm_content=promotional-article&amp;style=brand\" target=\"_blank\">subscribe today</a> and you’ll save 51%.</p>\n<p>Otherwise, check out the Cycling Plus <a href=\"https://www.facebook.com/CyclingPlusMagazine/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/cyclingplus/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/cyclingplus\" target=\"_blank\">Twitter</a> accounts for all of the latest news from the magazine team.</p>\n<section><div>\n        <h4>Why subscribe?</h4>\n<ul><li>Save 51% off every issue if you subscribe</li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Club</li>\n</ul><p>\n\n    </p></div>\n    </section><p><em>*Offer open to new UK customers subscribing to the print edition only. Full details of the Direct Debit Guarantee will be provided and are available on request. You will receive 13 issues per year. Your subscription will start with the next available issue. If at any time you are dissatisfied please notify us in writing and we will refund you for all unmailed issues. 51% saving based on buying 13 issues at full UK shop price. Offer ends: 21/12/21.</em></p>","author":"Matt Baird","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"becc439f241b6ca4128455982fdf713aec5ddc231fdd756169957ed224c831a0","category":"Cycling"}