{"title":"The next Mac Pro: New Apple and Intel silicon models are in the works","link":"https://www.macworld.com/article/347010/2022-mac-pro-design-apple-intel-silicon-processor-design-ram-graphics-storage-price-release.html","date":1623178033000,"content":"\n<div>\n<section><div></div></section><p>Apple’s <a href=\"https://www.macworld.com/article/230287/mac-pro-features-specifications-prices-faq.html\">Mac Pro was introduced in 2019</a>, and updates usually come out in increments—new graphics options here, SSD module upgrades, there, etcetera. But the Mac Pro will undergo a major update when Apple releases its own System on a Chip (SoC) for the workstation. This article keeps track of the reported updates for the Mac Pro, so go to this page when you want to see what could be coming.</p>\n\n\n\n<h2>2022 Mac Pro: Design and sizes</h2>\n\n\n\n<p>The current Mac Pro design was introduced in 2019 but we could see some changes when Apple unveils the Mac Pro with Apple silicon. According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-15/apple-plans-redesigned-imac-new-mac-pro-smaller-mac-pro-cheaper-monitor&amp;xcust=1-1-347010-0-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg’s Mark Gurman</a>, the Mac Pro that uses Apple’s own SoC will be “half the size” of the current Mac Pro, have an aluminum case, and could remind people of the <a href=\"https://www.macworld.com/article/227581/behold-the-g4-cube-apples-most-epic-computer-ever.html\">Power Mac G4 Cube</a>.</p>\n\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/power-mac-g4-cube.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>The revamped Mac Pro might remind people of the Power Mac G4 Cube.</p></figcaption></figure></div><p>Apple</p></div>\n\n\n\n<p>Gurman also reports that Apple won’t discontinue the current Mac Pro design and that the company will update it with Intel processors. This model will be available along with new Apple SoC Mac Pro.</p>\n\n\n\n<h2>2022 Mac Pro: Apple silicon</h2>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips&amp;xcust=1-1-347010-0-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg’s Mark Gurman</a>, the Apple silicon Mac Pro could be available with 20 or 40 computing cores, with 16 performance cores and four efficiency cores in the former (Apple’s codename for this SoC is Jade 2C-Die), and 32 performance cores and eight efficiency cores in the latter (codename Jade 4C-Die). If you consider that the <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-apple-silicon-touch-bar-sd-card-reader-magsafe-price-release.html\">rumored 14- and 16-inch MacBook Pro</a> could have a 10-core SoC with eight performance cores and two efficiency cores, could it be possible that Apple is taking the MacBook Pro SoC and installing two or four of them in the Mac Pro? We’ll have to wait and see.</p>\n\n\n\n<p>For the short term, Apple is going to have both Intel processors and Apple silicon available in the Mac Pro. No details on what Intel processors Apple will be upgrading to have been released.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/mac-pro-2019-and-pro-display-xd.jpg?quality=50&amp;strip=all\" /></figure><p>IDG</p></div>\n\n\n\n<h2>2022 Mac Pro: Intel silicon</h2>\n\n\n\n<p>While Apple has promised to transition to its own silicon within two years, Tim Cook has also promised to continue supporting Macs with Intel chips as well. With the Mac Pro, that could mean an updated model with new processors. After <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/realmrpippy/status/1402316211619123202&amp;xcust=1-1-347010-0-0-0&amp;sref=https://www.macworld.com/feed\">Brendan Shanks on Twitter</a> spotted references to Intel’s Ice Lake processors in the Xcode 13 beta, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1402330560656252936&amp;xcust=1-1-347010-0-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg reporter Mark Gurman confirmed</a> that “Apple has indeed been working on an update to the Intel Mac Pro. We assume that would be a model with the existing design but a faster processor and possibly update graphics.</p>\n\n\n\n<h2>2022 Mac Pro: Graphics</h2>\n\n\n\n<p>The Apple silicon Mac Pro will use the graphics on the SoC instead of graphics cards by AMD, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips&amp;xcust=1-1-347010-0-0-0&amp;sref=https://www.macworld.com/feed\">according to Gurman</a>. The graphics could have 64 or 128 processing cores—that’s a huge increase from the eight graphics cores in Apple’s M1 SoC used in the Mac mini, 24-inch iMac, MacBook Air, and 13-inch MacBook Pro.</p>\n\n\n\n<p>The Intel-based Mac Pro models will continue to use AMD graphics, but no reports have surfaced that cover what possible upgrades are in store, if any. Nor do we know how long Apple will continue to sell non-Apple silicon Macs.</p>\n\n\n\n<h2>2022 Mac Pro: RAM and specs</h2>\n\n\n\n<p>The current Intel Mac Pro offers up 1.5TB of DDR4 ECC memory in 12 user-accessible DIMM slots, but the unified<a href=\"https://www.macworld.com/article/234843/m1-macs-memory-isnt-what-it-used-to-be.html\"> memory in the M1 Macs is quite different</a>. The RAM isn’t just soldered onto the motherboard on the M1 MacBook and iMac—it’s built directly into the chip, making it faster and more efficient. We don’t know if Apple will take a similar approach with the Mac Pro, however. The users who want such a machine demand customization options that MacBook and Mac mini users don’t necessarily need, so it’s possible that Apple offers slots like the Macs of old.</p>\n\n\n\n<p>But more likely is a dramatic rethinking of what a Pro desktop is. The unified memory is a big part of what makes the M1 Macs so fast, but tying the memory to the chip would drive up the purchase price significantly. The Mac Pro already starts at $5,999, but if you buy RAM through Apple it could add as much as $14,000 to the price. So if Apple doesn’t allow aftermarket memory, it’s also likely to limit the build-to-order options at checkout.</p>\n\n\n\n<p>Apple currently offers up to 8TB of storage in the Mac Pro, and we expect the storage options to remain the same. The ports likely won’t change either, as Apple already four USB ports (two Thunderbolt 3 and two USB 3) and a pair of ehernet ports. However, the Mac Pro has eight PCIe x16-sized slots that support many different types of PCIe cards, so you can easily add more ports. We assume Apple will allow expansion slots on an M1 Mac Pro, but compatibility is a question.</p>\n\n\n\n<h2>2022 Mac Pro: Price and release</h2><p>The current Mac Pro starts at $5,999 and we assume the Apple silicon-based Mac Pro will stick with that general price point. Apple’s M1 Mac prices haven’t fluctuated much from their Intel predecessors, so the new Mac Pro will almost certainly be a super-high-end machine for professionals. Rumors say it will arrive some time in 2022, and we expect a WWDC announcement, which was where the 2019 and 2013 models were launched. There’s an outside chance that we could get a sneak peek at this year’s show, but it’s more likely that the unveiling is a year away.</p>\n</div>","author":"Macworld Staff","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bed156147b4b54546cca9c5fcce1e36f71892fb13d732fc6a3111a8f041da499","category":"Apple"}