{"title":"Brain high-throughput multi-omics data reveal molecular heterogeneity in Alzheimer’s disease","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002607","date":1714485600000,"content":"<p>by Abdallah M. Eteleeb, Brenna C. Novotny, Carolina Soriano Tarraga, Christopher Sohn, Eliza Dhungel, Logan Brase, Aasritha Nallapu, Jared Buss, Fabiana Farias, Kristy Bergmann, Joseph Bradley, Joanne Norton, Jen Gentsch, Fengxian Wang, Albert A. Davis, John C. Morris, Celeste M. Karch, Richard J. Perrin, Bruno A. Benitez, Oscar Harari</p>\r\n\r\nUnbiased data-driven omic approaches are revealing the molecular heterogeneity of Alzheimer disease. Here, we used machine learning approaches to integrate high-throughput transcriptomic, proteomic, metabolomic, and lipidomic profiles with clinical and neuropathological data from multiple human AD cohorts. We discovered 4 unique multimodal molecular profiles, one of them showing signs of poor cognitive function, a faster pace of disease progression, shorter survival with the disease, severe neurodegeneration and astrogliosis, and reduced levels of metabolomic profiles. We found this molecular profile to be present in multiple affected cortical regions associated with higher Braak tau scores and significant dysregulation of synapse-related genes, endocytosis, phagosome, and mTOR signaling pathways altered in AD early and late stages. AD cross-omics data integration with transcriptomic data from an <i>SNCA</i> mouse model revealed an overlapping signature. Furthermore, we leveraged single-nuclei RNA-seq data to identify distinct cell-types that most likely mediate molecular profiles. Lastly, we identified that the multimodal clusters uncovered cerebrospinal fluid biomarkers poised to monitor AD progression and possibly cognition. Our cross-omics analyses provide novel critical molecular insights into AD.","author":"Abdallah M. Eteleeb","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"bed3de4f239b0d177bd92ee8e91cb465ad9f4a2b250ee1f3de7894b20dae7633","category":"Environment"}