{"title":"Quantifying Treatments as Usual and with Technologies in Neu-Rorehabilitation of Individuals with Spinal Cord Injury","link":"https://www.preprints.org/manuscript/202408.0357/v1","date":1722928113000,"content":"Several technologies have been introduced into neurorehabilitation programs to en-hance traditional treatment of individuals with Spinal Cord Injury (SCI). Their effec-tiveness has been widely investigated but their adoption has not been properly quanti-fied. The aim of this study is to assess the distribution of conventional (Treatment As Usual – TAU) and technology-aided (Treatment With Technologies – TWT) treatments, conveniently grouped based on different therapeutic goals, in a selected SCI unit. Data from 104 individuals collected in 29 months were collected in a custom database and categorized according to both the conventional American Impairment Scale classifica-tion and a newly developed multifactor (MF) clustering approach, that considers addi-tional sources of information (the lesion level, the level of independence in the activi-ties of daily living and the hospitalization duration). Results indicated an average technology adoption of about 30%. Moreover, the MF clusters were less overlapped and the differences in TWT adoption were more pronounced than in AIS-based clus-tering. MF clustering was capable of grouping individuals based both on neurological features and functional abilities. In particular, individuals with motor complete inju-ries were grouped together, whereas individuals with sensorimotor incomplete SCI were collected separately based on the lesion level. Analyzing TWT adoption, we found that in case of motor complete SCI, TWT for muscle tone control and modulation were mainly selected while the other types of TWT were seldom adopted. Even for in-dividuals with incomplete SCI the most frequent rehabilitation goal was muscle tone modulation, regardless of the AIS level, and technologies to improve walking ability and balance control were mainly used for individuals with thoracic or lumbar lesions. Analyzing TAU distribution, we found that the highest adoption of muscle tone mod-ulation strategies was reported in case of individuals with motor complete SCI, i.e. in cases when almost no gait training was pursued. In case of cervical motor incomplete SCI, compared to thoracic and lumbar incomplete SCI, there was a greater focus on muscle tone control and force recruitment in addition to walking, than on balance training.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bedadb5460936b6f9326f2bf166a411d60deb6c7c0afbb15865c1ec2a2e30694","category":"Interdisciplinary"}