{"title":"“<i>When we have served meat</i>, <i>my husband comes first</i>”: A qualitative analysis of child nutrition among urban and rural communities of Rwanda","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306444","date":1721138400000,"content":"<p>by Maria Qambayot Albin, Gloria Igihozo, Shuko Musemangezhi, Edith Nachizya Namukanga, Theogene Uwizeyimana, Gebremariam Alemayehu, Abebe Bekele, Rex Wong, Chester Kalinda</p>\r\nBackground <p>Stunting among children under five years of age is a global public health concern, especially in low-and middle-income settings. Emerging evidence suggests a gradual reduction in the overall prevalence of stunting in Rwanda, necessitating a qualitative understanding of the contributing drivers to help develop targeted and effective strategies. This qualitative study explored the lived experiences of women and men to identify key issues that influence childhood nutrition and stunting as well as possible solutions to address the problem.</p> Methods <p>Ten (10) focus group discussions (FGDs) were conducted with fathers and mothers of children under five years of age from five districts, supplemented by forty (40) in-depth interviews (IDIs) with Nurses and Community Health Workers (CHWs). Transcripts were coded inductively and analysed thematically using Dedoose (version 9.0.86).</p> Results <p>Three themes emerged: (1) Awareness of a healthy diet for pregnant women, infants, and children with subthemes Knowledge about maternal and child nutrition and feeding practices; (2) Personal and food hygiene is crucial while handling, preparing, and eating food with subthemes, food preparation practices and the feeding environment (3) factors influencing healthy eating among pregnant women, infants, and children with subthemes; Barriers and facilitators to healthy eating among pregnant women and children.</p> Conclusion <p>Several factors influence child stunting, and strategies to address them should recognise the cultural and social contexts of the problem. Prioritisation of nutrition-based strategies is vital and should be done using a multifaceted approach, incorporating economic opportunities and health education, especially among women, and allowing CHWs to counsel households with conflicts.</p>","author":"Maria Qambayot Albin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bedaa47a4c92d2c4ff7e6c499d1efbdd04f59c105917a86329a5787bb085a089","category":"Interdisciplinary"}