{"title":"Path analysis reveals combined winter climate and pollution effects on the survival of a marine top predator","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14159?af=R","date":1723008051000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/816b708d-91c3-41db-9cc1-f2d324c12a2a/jane14159-toc-0001-m.png\" alt=\"Path analysis reveals combined winter climate and pollution effects on the survival of a marine top predator\" />\n<p>Anthropogenic pressure on the world's oceans is increasing. By combining classical CMR modelling with path analysis, we estimated the relative effects of two key threats to seabirds, climate change and pollution, on the survival of a declining population of gulls breeding in the Arctic.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMarine ecosystems are experiencing growing pressure from multiple threats caused by human activities, with far-reaching consequences for marine food webs. Determining the effects of multiple stressors is complex, in part, as they can affect different aspects of biological organisation (behaviour, individual traits and demographic rates). Determining the combined effects of stressors, through different biological pathways, is key to predict the consequences for the viability of populations threatened by global change.\n\nDue to their position in the food chain, top predators such as seabirds are considered more sensitive to environmental changes. Climate change is affecting the prey resources available for seabirds, through bottom-up effects, while organic pollutants can bioaccumulate in food chains with the greatest impacts on top predators. However, knowledge of their combined effects on population dynamics is scarce.\n\nUsing a path analysis, we quantify the effects of climate change and pollution on the survival of adult great black-backed gulls, both directly and through effects of individuals' body mass.\n\nWarmer ocean temperatures in gulls' winter foraging areas in the North Sea were correlated with higher survival, potentially explained by shifts in prey availability associated with global climate change. We also found support for indirect negative effects of organochlorines, highly toxic pollutants to seabirds, on survival, which acted, in part, through a negative effect on body mass.\n\nThe results from this path analysis highlight how, even for such long-lived species where variance in survival tends to be limited, two stressors still have had a marked influence on adult survival and illustrate the potential of path models to improve predictions of population variability under multiple stressors.\n</p>","author":"Kate Layton‐Matthews, \nKjell Einar Erikstad, \nHanno Sandvik, \nManuel Ballesteros, \nKevin Hodges, \nMichel D. S. Mesquita, \nTone K. Reiertsen, \nNigel G. Yoccoz, \nJan Ove Bustnes","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"bee302cbb4544edc0906685da1a7fd18671739551d33cd3900bea4d6c7fb2d33","category":"Environment"}