{"title":"Performance Evaluation of Small Wind Turbines under Variable Winds of Cities; Case Study Applied to an Ayanz Wind Turbine with Screw Blades","link":"https://www.preprints.org/manuscript/202409.0842/v1","date":1726040628000,"content":"Small wind turbines placed at City locations are affected by variable speed winds that frequently also change the direction. Architectural constructions, buildings of different height and abrupt orography of Cities make the winds that occur at City locations, more variable than in flat lands or at sea. However, performance of Small-wind turbines under this type of variable winds is not deeply studied in specialized literature. Therefore, this article analyses this important issue, also considering three types of power conversion configurations utilized in small-wind turbines; the generally used Maximum Power Point Tracking (MPPT) configuration, the simple only-rectifier configuration and an intermediate configuration in terms of complexity called Pseudo-MPPT. This general-purpose analysis is applied to a specific type of wind turbine, i.e. the Ayanz wind turbine with screw blades, which presents very adequate characteristics for city locations such as; safety, reduced visual and acoustic impacts and birds’ casualties avoidance. Thus, a wide simulation and experimental tests-based analysis is carried out, identifying which are the main factors affecting to the maximization of energy production of small-wind turbines in general and the Ayanz turbine in particular. It is concluded that depending how the wind turbine is designed in terms of these identified main factors, the simple Pseudo-MPPT power conversion configuration could even extract more energy than more complex MPPT configurations, especially in quickly varying wind situations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bee844938ff0a4fc3c5acda55ac2ed6b1cf337373512a91e8ef1d4afd66e6321","category":"Interdisciplinary"}