{"title":"Nissan’s all-wheel drive Ariya is finally on sale, and Ars has driven it","link":"https://arstechnica.com/?p=1924478","date":1678978626000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/DSC_0581-800x600.jpeg\" alt=\"A red Nissan Ariya\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/DSC_0581-scaled.jpeg\">Enlarge</a> <span>/</span> Ars drove an early front-wheel drive Ariya last year, but now the all-wheel drive version is finally ready for these shores. (credit: Stephen Edelstein)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Nissan provided flights from New York to San Francisco and back, plus two nights in a hotel so we could drive the Ariya. Ars does not accept paid editorial content.</aside>\n<p>The 2023 Nissan Ariya was meant to be Nissan's EV comeback, regaining ground the automaker lost after delaying a follow-up to the pioneering <a href=\"https://arstechnica.com/cars/2017/12/the-all-new-2018-nissan-leaf-driven/\">Leaf</a> by expanding into the popular crossover SUV segment. But Nissan has left what may be the Ariya's key feature on the table until now.</p>\n<p>When US Ariya deliveries began in late 2022, Nissan only shipped <a href=\"https://arstechnica.com/cars/2022/03/what-we-learned-by-driving-the-prototype-nissan-ariya-ev-crossover/\">front-wheel drive models</a>, leaving the launch of its new e-4ORCE dual-motor all-wheel drive powertrain until a later date. Now the Ariya e-4ORCE is finally here, with cars scheduled to reach dealerships in the coming weeks. It's billed as not only providing the all-wheel drive option important to any crossover, but also a greater focus on handling quality than most rivals.</p>\n<p>Adding a second motor powering the rear axle in addition to the standard front motor—both motors are of identical design—the Ariya e-4ORCE is rated at 389 hp (290 kW) and 442 lb-ft (600 Nm) of torque, compared to 238 hp (177 kW) and 221 lb-ft (300 Nm) in the front-wheel drive Ariya.</p></div><p><a href=\"https://arstechnica.com/?p=1924478#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1924478&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bee956630bf9733938c02e6886e75711467579a0e4e417827ae199c009de74cd","category":"Tech"}