{"title":"Spotify Desktop App Updated With Redesigned 'Your Library' and 'Now Playing' Views","link":"https://www.macrumors.com/2023/06/21/spotify-desktop-app-redesigned/","date":1687339563000,"content":"If you open up Spotify's desktop app on a Mac or PC today, things should look a lot more \"mobile.\" That's because the company has redesigned the \"Your Library\" and \"Now Playing\" interfaces to make them more aligned with Spotify's smartphone app. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/spotify-desktop-redesign.jpg\" alt width=\"1312\" height=\"731\" />\r<br />\n\"Your Library\" is now located in the sidebar to let you access saved music and podcasts. Spotify says its research has shown that the new library helps users save time by providing a better overview, while making it easier to switch between playlists.  Users can also now move and pin the playlists in the Library, as well as drop songs into the editable listed playlists. \r<br />\n\r<br />\nElsewhere, the \"Now Playing\" view takes up the right-hand side of the app, showing the currently playing song or podcast. <a href=\"https://newsroom.spotify.com/2023-06-20/spotify-desktop-experience-redesign-your-library-now-playing-views-customize/\">According to Spotify</a>, \"You can even find more information about the song and artist here, as well as information on tour dates and merch — making it easier to connect with your favorite artists and discover more about them. For select podcasts, you can even follow transcripts as you listen.\"\r<br />\n\r<br />\nBy default, Friend Activity is now hidden, but easily accessible via a new Friends icon beside the user profile icon in the top-right corner of the window. You can also now hide the library by clicking \"Your Library\" for a more compact layout. \r<br />\n\r<br />\nPreviously, the only way to find playlists was through the search bar, where users had to trawl through not only their own content, but results from the entire Spotify catalog. Now, when it’s expanded, the new Library design allows users to toggle through their dedicated music, podcast, and audiobook feeds and search Your Library exclusively.\r<br />\n\r<br />\nSpotify says the desktop app revamp began rolling out on Tuesday and will eventually make its way to all users over the next week.<div>Tag: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/21/spotify-desktop-app-redesigned/\">Spotify Desktop App Updated With Redesigned 'Your Library' and 'Now Playing' Views</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-desktop-app-updated-with-redesigned-your-library-and-now-playing-views.2393693/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"beefeff2d171777e027661f909dfef036545380cb81812f36c2de7c0a7cbf278","category":"Apple"}