{"title":"Effects of Selenium and Cadmium on Human Liver and Kidney Functions in Exposed Black Shale Areas","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001040?af=R","date":1713767833000,"content":"<h2>Abstract</h2>\n<p>Animal experiments suggest that selenium (Se) may alleviate cadmium (Cd) toxicity in animal liver and kidneys, but its effect on human liver and kidneys remains uncertain. In China, areas with black shale have shown elevated levels of Se and Cd. According to the USEPA (U.S. Environmental Protection Agency) evaluation method, the soil and rice in these areas pose significant risks. In black shale regions such as Enshi and Zhuxi County, residents who long-term consume local rice may surpass safe Se and Cd intake levels. Significantly high median blood Se (B-Se) and urine selenium (U-Se) levels were detected in these areas, measuring 416.977 μg/L and 352.690 μg/L and 104.527 μg/L and 51.820 μg/L, respectively. Additionally, the median blood Cd (B-Cd) and urine Cd (U-Cd) levels were markedly elevated at 4.821 μg/L and 3.848 μg/L and at 7.750 μg/L and 7.050 μg/L, respectively, indicating substantial Cd exposure. Nevertheless, sensitive liver and kidney biomarkers in these groups fall within healthy reference ranges, suggesting a potential antagonistic effect of Se on Cd in the human body. Therefore, the USEPA method may not accurately assess Cd risk in exposed black shale areas. However, within the healthy ranges, residents in the Enshi study area had significantly greater median levels of serum creatinine and cystatin C, measuring 67.3 μmol/L and 0.92 mg/L, respectively, than those in Zhuxi did (53.6 μmol/L and 0.86 mg/L). In cases of excessive Se and Cd exposure, high Se and Cd levels impact the filtration function of the human kidney to some extent.</p>","author":"Minglong Li, \nLiang Qiu, \nXunru Ai, \nKeyuan Xu, \nMin Peng, \nGuogen Sun, \nKai Zhang, \nChuying Huang","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"bef50351f307537b1992d260d3ab9ac2ce85e3f5849e96f4e534fd60bc15a623","category":"Environment"}