{"title":"Effects of aircraft noise exposure on self-reported health through aircraft noise annoyance: Causal mediation analysis in the DEBATS longitudinal study in France","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307760","date":1724767200000,"content":"<p>by Minon’tsikpo kossi KODJI, Lise GIORGIS-ALLEMAND, Sylviane LAFONT, Émilie LANOY, Anne-Sophie EVRARD</p>\r\nBackground <p>Previous studies reported an association between transportation noise and self-reported health status (SRHS). They also suggested a mediating role of noise annoyance using conventional statistical methods. These methods are subject to bias in longitudinal studies with time-dependent exposure, mediator and confounding factors. This study aims to investigate the mediating role of aircraft noise annoyance in the effect of aircraft noise on SRHS using a causal inference approach to address time-dependent variables issues.</p> Methods <p>We used data from 881 participants in all three visits in the DEBATS longitudinal study conducted around three French airports. Participants over 18 years of age reported their self-perceived health status, aircraft noise annoyance, and noise sensitivity by completing a questionnaire at three visits in 2013, 2015 and 2017. Noise maps were used to estimate aircraft noise levels outside their homes. Marginal structural models with inverse probability weighting were used to estimate the total effect of aircraft noise levels on SRHS and its decomposition into direct and indirect effect through aircraft noise annoyance.</p> Results <p>This study showed a deleterious effect of aircraft noise on SRHS. The odds ratio (OR) corresponding to the total effect and comparing the highest aircraft noise category (≥60 dBA) to the reference category (&lt;50 dBA) was significant (OR<sub>poor/fair_SHRS</sub> = 1.25 (95%CI: 1.06 to 2.08)). It also showed no direct effect of aircraft noise levels on SRHS, but an indirect effect through annoyance. This indirect effect increased as aircraft noise levels increased, with a statistically significant OR when comparing the highest noise category (≥60 dBA) to the lowest (&lt;50 dBA) (OR<sub>poor/fair_SHRS</sub> = 1.16 (95%CI: 1.03 to 1.52)). Nearly 66% of aircraft noise’s effect on SRHS was mediated by aircraft noise annoyance.</p> Conclusion <p>This study supports the deleterious causal effect of aircraft noise on SRHS. The results highlight the important mediating role of aircraft noise annoyance in the causal pathway from exposure to aircraft noise to poor/fair SRHS.</p>","author":"Minon’tsikpo kossi KODJI","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"beff5d5bcc3d2f6fdd4efcccc26109a2822eff732d995969b913d7626dae179a","category":"Interdisciplinary"}