{"title":"Apple Argued Safari Is Three Different Browsers to Avoid Regulation","link":"https://www.macrumors.com/2023/11/04/apple-argued-safari-is-three-different-browsers/","date":1699112671000,"content":"Apple <a href=\"https://ec.europa.eu/competition/digital_markets_act/cases/202344/DMA_100027_197.pdf\">recently claimed</a> that Safari is three different browsers in effort to avoid regulation in the European Union (via <a href=\"https://www.theregister.com/2023/11/02/apple_safari_browser/\"><em>The Register</em></a>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/safari-icon-blue-banner.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nThe claim came as part of a <a href=\"https://ec.europa.eu/competition/digital_markets_act/cases/202344/DMA_100027_197.pdf\">response</a> to the European Union in August, just before the European Commission designated many of Apple's iOS, <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, and Safari as <a href=\"https://www.macrumors.com/2023/09/06/app-store-safari-and-ios-designated-gatekeepers/\">gatekeeper platforms</a>. This classification means that Apple now has to ensure that these platforms fall in line with the Digital Markets Act's requirements, such as allowing browser engines other than WebKit and the installation of third-party app stores.\r<br />\n\r<br />\nIt has now emerged that after being informed that Safari was likely to fall under the DMA's regulations, Apple filed formal a response to the European Union claiming that Safari is, in fact, \"three distinct web browsers.\" The company's claim is based on the argument that Safari for iOS, iPadOS, and macOS are entirely different and serve different purposes.\r<br />\n\r<br />\nOn example cited by Apple is Safari's sidebar feature on iPadOS and macOS, allowing users to see opened tabs, tab groups, bookmarks, and browsing history. Since this feature is unavailable in the version of Safari for iOS, Apple claimed that it is a distinctly different browser. The company added that each version of Safari serves different purposes for users depending on the device upon which it is accessed.\r<br />\n\r<br />\nThe European Commission went on to point out that Safari's functionality and underlying technologies are near-identical across platforms. The Commission even highlights Apple's own marketing materials for its Continuity feature, which appear to contradict the company's claims, touting the tag line \"Same Safari. Different device.\" As a result, the Commission rejected Apple's claim and insists that \"Safari qualifies as a single web browser, irrespective of the device through which that service is accessed.\"\r<br />\n\r<br />\nApple is now obliged to ensure that Safari adheres to the DMA's requirements, such as by allowing non-WebKit-based browsers on iOS and iPadOS. Companies that do not adhere to the new regulations risk facing EU investigations, substantial fines, and the imposition of \"behavioral or structural remedies.\" The fines can amount to 10 percent of a company's global turnover, with a 20 percent penalty for repeat violations. Questions remain about whether Apple's argument about Safari being three different browsers violates the DMA's Anti-Circumvention provision that forbids subdividing a platform's market share to avoid regulation. <div>Tags: <a href=\"https://www.macrumors.com/guide/safari/\">Safari</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/europe/\">Europe</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/04/apple-argued-safari-is-three-different-browsers/\">Apple Argued Safari Is Three Different Browsers to Avoid Regulation</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-argued-safari-is-three-different-browsers-to-avoid-regulation.2409850/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bf0555204f275108b301410e9771bd84d6570c63ea0f047af2a128bc103c671d","category":"Apple"}