{"title":"Hematophagous ectoparasites affect nestling size and physiology, but not apparent survival","link":"http://link.springer.com/10.1007/s10336-023-02115-2","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Parasitism results in substantial costs to hosts, which can manifest in a variety of ways. Ectoparasites, especially those that are hematophagous, can deplete the host’s nutritional resources and induce costly immunological responses. Such costs can be especially relevant to neonatal animals, who also have to invest in growth and development. We used a cavity-nesting songbird species (House Sparrows; <em>Passer domesticus</em>) to address three main objectives related to the costs of ectoparasitism. First, we examined how abundance of ectoparasitic taxa in nests varied as a function of season. We found that fleas and blowflies were the primary ectoparasites, and were found nearly exclusively in the first or second half of the breeding season, respectively. Second, we used the insecticide permethrin to manipulate ectoparasite abundance and measured nestling body mass, circulating levels of nutrients (i.e., glucose, glycerol, and triglycerides), oxidative damage (i.e., d-ROMs), antibody levels (i.e., IgY), survival during the nestling stage, and detection of juveniles after they left the nest (i.e., post-fledging). An experimental reduction of parasites resulted in nestlings that circulated higher levels of hemoglobin and IgY, and were also likely to fledge earlier. Third, we tested if metrics collected during the nestling period predicted probability of detection post-fledging. We found a positive correlation between nestling triglyceride levels and likelihood of detection during the post-fledging stage. Thus, ectoparasitic taxa vary seasonally and have a measurable impact on nestling physiology. However, short-term survival or dispersal may be shaped predominately by nutrition, rather than ectoparasitism.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"bf0738f381bf2ebdc8aee7c1f29d26e7a8e9d67d33eaa7c351d1ba6979e0b378","category":"Environment"}