{"title":"Apple Registers 'xrOS' Wordmark Ahead of WWDC Headset Unveiling","link":"https://www.macrumors.com/2023/05/16/apple-registers-xros-headset-wordmark/","date":1684222611000,"content":"Apple has registered a wordmark for \"<a href=\"https://www.macrumors.com/guide/xros/\">xrOS</a>\" in New Zealand, the first time the company has indirectly revealed both the name of the operating system for its upcoming headset and the official font and styling that accompanies it.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/xros-wordmark.jpeg\" alt width=\"2874\" height=\"1684\" />\r<br />\nSpotted by <a href=\"https://twitter.com/ParkerOrtolani/status/1658291551431270402?s=20\">Parker Ortolani</a>, the ‌xrOS‌ wordmark registered with the New Zealand Intellectual Property Office shows that Apple will use its San Francisco typeface in ‌xrOS‌ marketing, just as it does for macOS, iOS, watchOS, and tvOS.\r<br />\n\r<br />\n\"‌xrOS‌\" is meant to stand for \"extended reality.\" Extended reality represents both the augmented and virtual reality functions the headset will support. The name was already <a href=\"https://www.macrumors.com/2022/12/01/apple-headset-operating-system-xros/\">confirmed</a> by internal Apple sources last year via <em>Bloomberg</em>, and Apple has also been trademarking ‌xrOS‌ in several countries through a hidden shell company.\r<br />\n\r<br />\nApple internally called the headset software \"Reality OS\" or \"rOS\" when it was in development, but with a launch approaching, it ultimately decided to update the public name to the less generic \"‌xrOS‌\" name.\r<br />\n\r<br />\n‌xrOS‌ will have an iOS-like interface that will feel immediately familiar to Apple users as it will resemble the look of the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. There will be a Home screen with app icons that can be rearranged, as well as customizable widgets.\r<br />\n\r<br />\nThe headset will have new versions of existing apps like Maps and Messages, which have been redesigned for an AR/VR experience. Apple is also creating a software development kit so third-party apps can be created for the headset.\r<br />\n\r<br />\nApple is expected to unveil the headset to the public during its WWDC keynote event on Monday, June 5. For everything we know about the device, click the roundup link below.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/apple-registers-xros-headset-wordmark/\">Apple Registers 'xrOS' Wordmark Ahead of WWDC Headset Unveiling</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-registers-xros-wordmark-ahead-of-wwdc-headset-unveiling.2389644/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bf0de20416200913539d0cdbc06134d7b1e105ab2a752a7ea6af84e9a1166f67","category":"Apple"}