{"title":"In Tokyo, Coryn Rivera will ride for her father, Wally","link":"https://cyclingtips.com/2021/07/in-tokyo-coryn-rivera-will-ride-for-her-father-wally/","date":1626778227000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033302-044-650x433.jpg\" /></div><h2>In Tokyo, Coryn Rivera will ride for her father, Wally</h2><p>\n</p><p>Racing at the Olympic Games is a dream most cyclists – most athletes – have. It’s the absolute pinnacle of the sport, the most televised event, the most anticipated. For some sports, like women’s cycling, it is one of the rare times the world can watch the spectacle. Before live coverage of races was more prevalent, the Olympic road race and the World Championships were the only women’s races to be found on television.</p>\n\n\n\n<p>For Coryn Rivera, representing the USA at the Olympic Games had always been a dream. Growing up, Rivera shared this dream with her dad, Wally. The two would ride together, push each other farther. As Rivera grew up and Wally started coaching her on the bike, it became clear Rivera had that special something that makes a champion. </p>\n\n\n\n<p>“We both shared a passion for cycling and I think also shared a passion for just being good at anything that we do,” Rivera told CyclingTips. “Whatever we put our minds to, I think we always kind of went 110%.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CRWe1PjD8dd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CRWe1PjD8dd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by C O R Y N. R I V E R A. (@corynrivera)</a></p></div></blockquote> \n\n\n\n<p>Rivera won her first national title in 2006, at the age of 14. Well, she won her first <em>three</em> national titles – she swept the entire Junior National Championship weekend with victories in the road race, time trial, and criterium. </p>\n\n\n\n<p>Years passed and Rivera kept improving, kept winning. Suddenly that dream of racing at the Olympic Games was no longer a dream: it was a goal.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00028285-003-1340x893.jpg\" /><figcaption>Coryn Rivera winning Prudential RideLondon Classique in 2017.</figcaption></figure>\n\n\n\n<p>Wally coached his daughter through the early years and was also present at nearly all of her junior races. “He would figure out what the goal was in preparing for a race and then kind of replicate what a race would be like in training and in the day-to-day,” Rivera said. “And then, he was always at my races. For Nationals it was like the summer vacation in the motorhome.”</p>\n\n\n\n<p>Soon Rivera was travelling overseas to race. Wally went with her to her first Junior World Championships in Russia in 2009, but driving a motorhome around the USA is a lot easier than flying to Europe. Eventually, Rivera was on her own. Wally still made it to the big stuff though. </p>\n\n\n\n<p>“I went to a lot of different collegiate nationals and also world championships and stuff,” Rivera said. “They’ve always had my back.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00031085-057-1340x893.jpg\" /><figcaption>Rivera on the podium after stage 6 of the Thuringen – Rundfahrt Ladies Tour in 2019.</figcaption></figure>\n\n\n\n<p>One of the highlights of Rivera’s career was the 2018 USA National Road Championships. Her parents hadn’t originally planned to come, but a few days before the race Rivera’s dad texted her asking which hotel she was staying in. Wally had just acquired the new Model 3 Tesla. “I think he really wanted to go on a road trip and see was it really possible to go road trip with an electric car,” Rivera said with a laugh. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/BkY2Uihn0jQ/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/BkY2Uihn0jQ/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by C O R Y N. R I V E R A. (@corynrivera)</a></p></div></blockquote> \n\n\n\n<p>Rivera’s career, like that of most professional athletes, has gone through high highs and low lows. After a few moderately successful years on America’s top racing team, UnitedHealthcare Professional Cycling, Rivera was not tapped for the Olympic Games in Rio de Janeiro. It had been a goal and the blow was what Rivera needed to make the jump to a European team. </p>\n\n\n\n<p>In 2017 she joined Team Sunweb and right off the bat the move paid dividends. In her first year with the Dutch team, she became the only American, male or female, to have won the Tour of Flanders. The same year she won the Ronde van Vlaanderen she won a stage of the Amgen Tour of California and was part of the winning world championships team time trial squad.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00027810-246-1340x853.jpg\" /><figcaption>Rivera after winning the Ronde van Vlaanderen in 2017.</figcaption></figure>\n\n\n\n<p>The following year she won two stages and the overall at the OVO Energy Tour. In 2019 she won two stages of the Lotto Belgium Tour and was 10th in the World Championships road race. Her bid for a spot on the Tokyo 2020 team was looking good.</p>\n\n\n\n<p>But then 2020 happened. With the pandemic in full swing, Rivera returned home to California. The racing was up in the air, and no one knew what the season would look like. Mid-summer, when racing started to pick up again in Europe, Rivera flew back to pick up where the season had come to an abrupt end in February.</p>\n\n\n\n<p>“I had crashed during training,” Rivera recalled. “We were at altitude camp in Austria and I got a concussion. So then I stepped out of some of the races that I normally would have done really well at<em>.</em></p>\n\n\n\n<p>“Last year was mediocre. I still got a couple of fourth places at the Giro, so not so terrible, but not usually how I race.”</p>\n\n\n\n<p>The season ended and Rivera went back home without any wins. That was a first for her since 2014, and even then she won criteriums and other non-UCI races in the USA. </p>\n\n\n\n<p>In December of 2020, Rivera’s whole family picked up COVID-19, everyone except for Coryn herself. While Rivera was at her first team camp for the 2021 season Wally was transferred into a hospital in California. </p>\n\n\n\n<p>“It was really hard and [I] made the call to go home in February,” she said. “He was doing better those last three weeks, so we were pretty hopeful and his goal was just to wake up from sedation,” said Rivera. “But, yeah, it just never came.”</p>\n\n\n\n<p>In March of 2021, Wally passed away.</p>\n\n\n\n<p>Rivera missed the first three months of the 2021 season to be with her family. She returned to racing in Europe for a handful of one-days and the Ceratizit Festival Elsy Jacobs in April and May. Afterwards, she returned home. The Olympic team was still her number-one goal for the season, but the team was less of a guarantee than it had been two years earlier. Still, Rivera did what she knew – she put her head down and rode her bike.</p>\n\n\n\n<p>In June, Rivera was named to the USA Olympic team for Tokyo. The dream she and Wally had been talking about for years and years was finally a reality. “It would have been cooler if my dad was still around, but I just have to keep reminding myself that he is always around and he’s everywhere,” Rivera said. “A lot of things remind me of him, and I know he is still proud.</p>\n\n\n\n<p>Wally had moved from the Philippines to start a new life for his family. His daughter Coryn, a former national champion, picked to compete at the Olympic Games for the USA, is living the American Dream. </p>\n\n\n\n<p>“This has been a really, really difficult time in my life, without a doubt,” Rivera said. “Probably the hardest thing I am currently still also going through, but still really trying to make the most of the present moment and also honouring my dad in the best way that I can. But things are shaping up now. My form is better. I made the Olympic team.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00030094-032-1340x893.jpg\" /><figcaption>Rivera pictured during the World Championships in 2018.</figcaption></figure>\n\n\n\n<p>On July 11, 2021 Rivera snatched her first victory since the final stage of the Lotto Belgium Tour in 2019. She won the final stage of the Giro Donne, an emotional win to say the least. After the finish she told the camera <a href=\"https://cyclingtips.com/2021/07/coryn-rivera-wins-final-giro-donne-stage-with-an-angel-on-her-shoulder/\" target=\"_blank\">she had an angel on her shoulder</a>, guiding her through the race. </p>\n\n\n\n<p>Days later Rivera flew to Japan to compete at the Olympic Games.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CRMSirgF39r/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CRMSirgF39r/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by C O R Y N. R I V E R A. (@corynrivera)</a></p></div></blockquote> \n\n\n\n<p>Cycling for Rivera is her job, but it’s so much more than that. “For cycling, I think we both really enjoyed it,” she said. “And also we both really wanted to do well. So it’s something that we took all the way. And yeah, I’m just really grateful for that.”</p>\n\n\n\n<p>On the bike, and in life, Rivera’s dad is still with her. Her biggest cheerleader, pushing her forward, encouraging her to keep fighting every day. Five days prior to the road race in Tokyo, Rivera has found her form and is, without doubt, a favourite for the win on Sunday. </p>\n\n\n\n<p>Wally can’t drive his Tesla or the motorhome to Tokyo for the Olympic road race, but he will be there, with his daughter, as she takes on the event. “I know my dad is with me everywhere now,” she said. “He doesn’t have to drive across the country to see me.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/in-tokyo-coryn-rivera-will-ride-for-her-father-wally/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bf1e05362f5b365f64bb7f7d33e4c0c787555ee973ad55b58810022cdc548563","category":"Cycling"}