{"title":"Characterization of bacterial communities associated with seabed sediments in offshore and nearshore sites to improve Microbiologically Influenced Corrosion mitigation on marine infrastructures","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309971","date":1725458400000,"content":"<p>by Daniele Ghezzi, Gianmarco Mangiaterra, Arianna Scardino, Mauro Fehervari, Mauro Magnani, Barbara Citterio, Emanuela Frangipani</p>\r\n\r\nMicrobiologically Influenced Corrosion (MIC) is one of the main threats for marine infrastructures, leading to severe safety and environmental risks associated with structural failures and/or leakages of dangerous fluids, together with potential huge economic losses and reputational damage for the involved parts. For a safe design and a proper installation of infrastructure systems in contact with the seabed, a deep knowledge of the site-specific microbial community of the sediments should be beneficial. Therefore, in addition to the simple detection or the sole quantification of Sulphate-Reducing Bacteria (SRB), the whole characterization of the microbial members involved in MIC phenomena is desirable. In this study, 16S rRNA-based comparison between bacterial communities thriving in offshore and nearshore marine sediments was performed, with a focus on the main bacterial groups putatively responsible for MIC. The nearshore sediments were significantly enriched in bacterial members associated with human and organic compounds contamination belonging to the <i>Bacteroidota</i>, <i>Desulfobacterota</i>, and <i>Firmicutes</i> phyla, while the offshore sediments hosted <i>Alphaproteobacteria</i>, <i>Nitrospinota</i>, and <i>Nitrospirota</i> members, representative of a low anthropogenic impact. Quantitative PCR targeting the <i>dsrA</i> gene and detailed community analyses revealed that the nearshore sediments were significantly enriched in SRB mainly affiliated to the <i>Desulfobulbus</i> and <i>Desulfosarcina</i> genera potentially involved in biocorrosion, compared to the offshore ones. These results suggest that the bacterial community associated with the high concentration of organic compounds derived by an elevated anthropogenic impact is likely to favour MIC. Such observations highlight the importance of microbiological investigations as prevention strategy against MIC processes, aiming both at characterizing sites for the establishment of new infrastructures and at monitoring those already installed.","author":"Daniele Ghezzi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf1fc66481f91af9e5de6f5217c3543fd6b280f35e75311042a2c172ddf52f71","category":"Interdisciplinary"}