{"title":"Notre Dame des Cyclistes: an unlikely cycling Mecca","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/notre-dame-des-cyclistes-an-unlikely-cycling-mecca","date":1688557537000,"content":"\n      <p>The small town of Labastide d’Armagnac is hardly a place you would think of when looking for a cycling Mecca. Yet for nearly 70 years, it has been just that, thanks to a little church on the outskirts of town, christened Notre Dame des Cyclistes. And on stage four of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, the race paid homage to this offbeat but revered destination as it passed by mid-way through the stage.</p>\n<div></div>\n<p><span>“We have 831 jerseys hanging here. I still have 260 in boxes but I simply don’t have the space to hang them here,” says Claude Nadeau, president of the Association Les Amis de Notre Dame des Cyclistes, who now oversees the chapel dedicated to cyclists. </span></p>\n<p>It was the chaplain Abbe Joseph Massie who transformed this 12th-century church into Notre Dame des Cyclistes back in 1959, to honour his passion for cycling. Popular French cyclist Henri Anglade was the first to offer one of his jerseys, and word quickly spread around the peloton. Since then, the Tour de France has often passed by and even held a stage start here in 1989. Again, on stage four of this year’s Tour, the race paid homage to the chapel, placing its intermediate sprint just in front.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg04_Notre_Dame_des_Cyclistes02__tdf_2023.jpg?v=1688550051\" alt />Starting in Dax and finishing in Nogaro, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/bore-de-france\">stage four of this year’s Tour was a sleepy stage for much of the day</a>, with few attacks, as the riders seemed to agree that a cruise through this corner of southern France was needed after the action-packed opening stages in the Basque Country. Meanwhile, many of those following the race used the opportunity to drive up the road and stop at this unassuming landmark.</p>\n<p><span>“The Abbe Massie wasn't just passionate about cycling, he was crazy about it,” explained Nadeau. “And after seeing the church on Madonna del Ghisallo in Italy, he wanted to have a church in France that was dedicated to cyclists.”</span></p>\n<p><span>Indeed, once inside, every inch of these ancient walls is covered with jerseys. Those of the biggest stars in the history of the sport adorn the entryway, and their jerseys of Fausto Coppi, Louison Bobet, Luis Ocaña, Eddy Merckx and Miguel Indurain are all framed here, along with those of contemporary champions like Arnaud Démare. Inside the chapel itself, hundreds of amateur jerseys line the walls. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg03_Notre_Dame_des_Cyclistes05__tdf_2023.jpg?v=1688557511\" alt />“I know I have a jersey somewhere here,” said former professional Thomas Davy, who raced for the Castorama and Banesto teams back in the 1990s. “I rode up here when I was just getting into cycling, and later when I was a professional, sent one of my jerseys to them. Notre Dame des Cyclistes may be off the beaten track, but everybody knows about it.”</span></p>\n<p><span>Seemingly every detail here is dedicated to cyclists and the rich history of the sport. Even the small stained glass windows depict legendary moments in the history of the Tour de France, like when Fausto Coppi passed a water bottle to Gino Bartali on their iconic breakaway in the Alps during the 1949 Tour or the epic duo between Jacques Anquetil and Raymond Poulidor on the Puy de Dôme in the 1964 race. While these windows may not rival those of legendary cathedrals like Chartres, they are endearing and utterly unique.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg04_Notre_Dame_des_Cyclistes10__tdf_2023.jpg?v=1688549999\" alt />“It was actually Henri Anglade who designed them,” says Nadeau. “He just loved this church. Luis Ocaña was even married here. It’s just a special place that has such a long history with the sport.”</span></p>\n<p>Soon enough, however, Nadeau was out the door as he didn’t want to miss the Tour when it passed. The pastoral quality of the stage soon evaporated as the peloton charged into the race automobile track in Nogaro, setting the stage for a high-speed sprint, not to mention a<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/crashes-chaos-and-carnage-the-ill-fated-tour-de-france-stage-four-finale\"> crash-infested finale</a>. </p>\n<p><span>But for a time, mid-way through the stage, those following this year’s Tour had a unique opportunity to reflect on one of the sport’s quiet memorials. </span></p>\n<p><span>“It’s a place of contemplation,” said Groupama-FDJ manager Marc Madiot after the stage. </span>Madiot was actually looking for Ocaña’s brother as Ocaña was his childhood hero before he turned professional himself in the 1980s. “It’s just a special place.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"bf20c17ca63eee5b9ddf00e52d3cb612879bdfb2bc42fe430abe7842099cd13a","category":"Cycling"}