{"title":"Review: Old is a mostly solid film undermined by jarring twist ending","link":"https://arstechnica.com/?p=1782046","date":1627155934000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>A family on a tropical holiday discovers that the secluded beach where they are relaxing for a few hours is somehow causing them to age rapidly in <em>Old</em>, a new thriller from M. Night Shyamalan. </p></div>\n<p>Director M. Night Shyamalan has a well-known fondness for his signature surprise twist endings. When those twists work organically, we get classics like <em>The Sixth Sense</em> and <em>Unbreakable</em>. When they don't—well, if you're lucky, you get something like his new film, <a href=\"https://en.wikipedia.org/wiki/Old_(film)\"><em>Old</em></a>, in which everything that comes before is sufficiently compelling that you can almost shake off a jarring final twist that feels so forced, it's almost like it belongs in an entirely different movie.</p>\n<p><strong>(This being an M. Night Shyamalan film where surprise twists are tantamount, I have taken great pains to avoid spoilers. There is nothing discussed in the review below that has not already been revealed in the film’s trailers.)</strong></p>\n<p><em>Old</em> is based on a French graphic novel called <em>Sandcastle</em>, written by Pierre Oscar Levy (also a documentary filmmaker) and illustrated by Frederik Peeters. It's about a group of 13 people who find themselves trapped on a mysterious, secluded beach where time moves much more quickly—so quickly that young children reach puberty in a matter of hours, and everyone will reach old age and die within 24 hours. Shyamalan received a copy of the book as a Father's Day gift and was immediately touched by how it humanely grappled with the all-too-human fear of aging and the relentless passage of time.</p></div><p><a href=\"https://arstechnica.com/?p=1782046#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782046&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bf2147df7408594f0841ad1edfe3448f6aa1508d1a6a0eb225255d94c9559d58","category":"Tech"}