{"title":"Psychosocial correlates of parents’ willingness to vaccinate their children against COVID-19","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305877","date":1719237600000,"content":"<p>by Hyunmin Yu, Stephen Bonett, Ufuoma Oyiborhoro, Subhash Aryal, Andrew Kim, Melanie L. Kornides, John B. Jemmott, Karen Glanz, Antonia M. Villarruel, José A. Bauermeister</p>\r\nBackground <p>Public health guidance recommended that children who are 6 months or older be vaccinated against COVID-19 in June of 2022. In the U.S., 56% of children under 17 had not received the COVID-19 vaccination in 2023. We examine parents’ willingness to vaccinate their children against COVID-19 using the theory of planned behavior in order to design effective strategies to promote vaccine uptake.</p> Methods <p>The Philadelphia Community Engagement Alliance is part of an NIH community-engaged consortium focused on addressing COVID-19 disparities across the U.S. We surveyed 1,008 Philadelphia parents (mean age 36.86, SD 6.55; 42.3% racial/ethnic minorities) between September 2021 and February 2022, a period when guidance for child vaccination was anticipated. Structural Equation Modeling analysis examined associations between parental willingness and vaccine-related attitudes, norms, and perceived control. Covariates included parents’ COVID-19 vaccination status, race/ethnicity, gender, and survey completion post-CDC pediatric COVID-19 vaccination guidelines. Subgroup analyses by race/ethnicity and gender were conducted.</p> Results <p>Our model demonstrated good fit (χ2 = 907.37, df = 419, <i>p</i>&lt;0.001; comparative fit index [CFI] = 0.951; non-normed fit index [NNFI] = 0.946; root mean square error of approximation [RMSEA] = 0.034 with 95% CI = 0.030–0.038). Attitudes (β^ = 0.447, <i>p</i>&lt;0.001) and subjective norms (β^ = 0.309, <i>p</i> = 0.002) were predictors of intention. Racial/ethnic minority parents exhibited weaker vaccination intentions (β^ = -0.053, <i>p</i> = 0.028) than non-Hispanic White parents.</p> Conclusions <p>Parents’ attitudes and norms influence their vaccination intentions. Despite the survey predating widespread child vaccine availability, findings are pertinent given the need to increase and sustain pediatric vaccinations against COVID-19. Interventions promoting positive vaccine attitudes and prosocial norms are warranted. Tailored interventions and diverse communication strategies for parental subgroups may be useful to ensure comprehensive and effective vaccination initiatives.</p>","author":"Hyunmin Yu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf2ab18283d947e0d70b2f480790d79838e52fdac1a0dd0b570049b2ba3029cd","category":"Interdisciplinary"}