{"title":"Acoustic performance analysis of wooden structure building wall by integrating BIM technology and impedance tube method","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308481","date":1723212000000,"content":"<p>by Jia Yin, Xiangren Ai</p>\r\n\r\nWith the increasing demand for building acoustic performance, accurately evaluating the acoustic performance of building walls has become an important research topic. However, existing research has mostly focused on general building materials such as concrete, iron and steel, and glass. For wooden structure wall, due to the sound absorption performance of the materials themselves and the complexity of structural design, the analysis of their acoustic performance is still relatively weak. Moreover, there is a lack of quantitative description of their spectral characteristics and acoustic impedance. To analyze the acoustic performance of wooden structure building walls, Building Information Model (BIM) and impedance tube method were integrated to construct a building wall performance testing system with BIM technology. The impedance tube method was applied and testing functions for sound absorption and insulation performance were designed. The outcomes indicated that in the error test, the error range between the experimental group and the control group was [0.01, 0.18], indicating a high reliability of the experimental results. In the calculation of sound insulation of different specimens at different sound frequencies, when the frequency was 1600Hz, the sound insulation of the control group and experimental group was 65.30dB and 70.14dB, proving the effectiveness of the design method. The above results demonstrate the practicality of integrating BIM technology and impedance tube method in the acoustic performance analysis of wooden structure building walls. This study provides strong technical support for reducing the indoor environment of wooden buildings and improving the comfort of people’s living environment.","author":"Jia Yin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf2d11911de3c188cce7a598513b83772c96061b5a72713a59db526cbfcbc62e","category":"Interdisciplinary"}