{"title":"Temperature‐Dependence Assumptions Drive Projected Responses of Diverse Size‐Based Food Webs to Warming","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003852?af=R","date":1710396300000,"content":"<h2>Abstract</h2>\n<p>Food web projections are critical for evaluating potential risks to ecosystems and fisheries under global warming. The temperature dependence of biological processes and regional differences in food web structure are two important sources of uncertainty and variation in climate forced projections of fish communities, but we do not know their magnitude or relative contribution. Here we systematically evaluated a range of different assumptions about temperature-dependence on rates, including size-dependent effects, controlling food intake, metabolism, and non-predation mortality in fishes using species-resolved size spectrum food web models that link individual-level physiological processes to population and community dynamics. We simulated the physiological effect of warming in a range of size-structured food web models calibrated to different marine ecosystems and in simplified trait-based models. Higher food intake in warmed conditions increased total fish biomass, catches, and mean body weight, but these effects were offset by the negative effects of warming on metabolism and mortality, which combined resulted in lower total biomasses and catches for most food webs. These effects were enhanced when warming increased metabolic rates more than food intake, and the outcomes were also sensitive to size dependency of temperature responses. Importantly, these general patterns were not uniform across all food webs—individual functional groups and fish species within food webs responded to warming in different ways depending on their position in the food web and its structure. Hence, caution is warranted when generalizing food web or species outcomes to warming because they are mediated by community interactions. Uncertainty related to temperature dependence and ecological interactions will impact food web projections and should be represented in climate change projections.</p>","author":"J. C. P. Reum, \nP. Woodworth‐Jefcoats, \nC. Novaglio, \nR. Forestier, \nA. Audzijonyte, \nA. Gårdmark, \nM. Lindmark, \nJ. L. Blanchard","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"bf331866538fc5aeb0936fe2312bcdb7961ca804df4651fe85034e3b9f67a553","category":"Environment"}