{"title":"Well, here’s another FineWoven mess Apple’s gotten into","link":"https://www.macworld.com/article/2081435/iphone-15-finewoven-cases-criticism.html","date":1695724200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Hmm, thanks to FineWoven, could it be time for the return of the “gate”? FineWovengate seems too long but Casegate doesn’t seem specific enough.</p>\n\n\n\n<p>Yes, although the iPhone 15 Pro seems to be a hit, the same cannot be said for Apple’s new “premium” case for the new devices.</p>\n\n\n\n<p>According to The Verge:</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2023/9/20/23882255/apple-iphone-15-finewoven-case-wallet-bad&amp;xcust=1-1-2081435-1-0-0&amp;sref=https://www.macworld.com/feed\">“The new FineWoven iPhone cases are very bad”</a></p>\n\n\n\n<p>Now, you might think “Oh, The Verge. They didn’t even like it when Apple removed the headphone jack!” That’s a weird thing to say but, yeah, they did go on about it for a long time, but The Verge isn’t the only one saying this.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mastodon.macstories.net/@viticci/111119387802099507#.&amp;xcust=1-1-2081435-1-0-0&amp;sref=https://www.macworld.com/feed\">Federico Viticci</a> put his FineWoven case down on a bar table and discovered the next day that it was now stained. His conclusion:</p>\n\n\n\n<blockquote>\n<p>I honestly think this is the worst accessory Apple’s ever produced and I may just throw this out now. (Great for the environment!)</p>\n</blockquote>\n\n\n\n<p>Well, as long as you don’t burn it it’s probably still slightly better for the environment than the comparable leather case. Of course, if people just run out and buy a leather case after throwing out a FineWoven case… this could turn into a real carbon points mess.</p>\n\n\n\n<p>Speaking of burning the case, that’s exactly what iFixIt did in <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/News/82789/unweaving-the-mystery-apples-finewoven-case-under-the-microscope&amp;xcust=1-1-2081435-1-0-0&amp;sref=https://www.macworld.com/feed\">its teardown</a>, amongst such other tests such as putting it under a microscope, scratching it, and staining it with coffee, oil, and hot sauce. General conclusion: do not do any of these things to a FineWoven case. When you receive yours, it’s probably best to just keep it mint-in-the-box. Try to avoid looking at it. Definitely don’t use harsh words around it.</p>\n\n\n\n<p>The Macalope was trying to think of other accessories Apple has made that have been less than spectacular. <a href=\"https://www.macworld.com/article/173204/ipodsocks.html\">iPod Socks</a> were just unnecessary. Apparently, some people actually liked the <a href=\"https://www.macworld.com/article/194643/macat25-worstproducts.html#:~:text=6.-,Apple%20USB%20Mouse,-The%20%E2%80%9Chockey%20puck\">hockey puck mouse</a>. The <a href=\"https://www.macworld.com/article/233907/why-cant-apple-make-a-good-mouse.html\">Magic Mouse</a> with the charging port on the bottom still worked as a mouse. The AirPower charging mat probably would have given these cases a run for their money <a href=\"https://www.macworld.com/article/230469/apple-airpower-features-specs-price-faq.html\">if it had ever been released</a>.</p>\n\n\n\n<p>Not only are the cases apparently highly scratch and stain-prone, but the USB-C port hole is too small for many third-party USB cables and some cases appear to have the hole <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/2023/09/finewoven-case-letdown/&amp;xcust=1-1-2081435-1-0-0&amp;sref=https://www.macworld.com/feed\">misaligned</a>. They are only off by a matter of millimeters, but this is Apple we’re talking about here. Being off by millimeters is not supposed to be in its vocabulary.</p>\n\n\n\n<p>The Macalope feels like we’re about two days away from a FineWoven case spontaneously bursting into flames.</p>\n\n\n\n<p>These all might seem like minor complaints. After all, the cases still protect the iPhone, which is their main job. And they don’t require a bovine sacrifice to make them, which is their other main job. But remember that Apple sells this case for $59 in an era where you can probably acquire a smartphone case on Amazon just for writing a positive review about it (they make it up on volume).</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macalope\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p>Long story short, if you were considering buying a FineWoven case, you might want to consider other options, like wrapping your iPhone in an old newspaper. Same net effect but a lot cheaper. The Macalope has long been a case-less iPhone user anyway, so he was never going to consider Apple’s pricey grease magnet even if the company made it for his lowly iPhone 13 mini.</p>\n\n\n\n<p>All of this certainly bodes well for the Apple Watch FineWoven Magnetic Link bands which you can now order from Apple for the low price of $99! Looking forward to seeing how they do with body oils and sweat, as well as anything else you might come into contact with while wearing one.</p>\n\n\n\n<p>Sorry, the Macalope typed that before he really considered all the disgusting things it really could be.</p>\n\n\n\n<p>Well, whatever you want to call this scandal, at least there’s nothing wrong with the iPhone 15 Pros themselves which-</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/threads/sharp-edge-between-glass-and-titanium-frame.2403849/&amp;xcust=1-1-2081435-1-0-0&amp;sref=https://www.macworld.com/feed\">“iPhone 15 Pro: Sharp edge between glass and titanium frame”</a></p>\n\n\n\n<p>Oh, <em>that</em>. Well, look, that’s only an issue on some devices and isn’t a problem at all if… uh… if…</p>\n\n\n\n<p>…if you use a case.</p>\n\n\n\n<p>Um.</p>\n\n\n\n<p>Hey, you know what’s really great? Kettle corn.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bf3453f39e2323e8f9dd0da2820910460481b8cf9fd14b13c23515e39763abb2","category":"Apple"}