{"title":"Porsche finds yet another way to slice the 911: The 2022 911 Carrera GTS","link":"https://arstechnica.com/?p=1796509","date":1632261686000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/2022-Porsche-911-GTS-1-980x735.jpg\" /></div>\n        <p>\n          Porsche has always shown a degree of creativity in its ability to tweak and slice the 911 to suit different customers. The new 911 GTS exemplifies that.                      [credit:\n                        Jonathan Gitlin                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><aside>Porsche provided flights to Atlanta and a night in a hotel so we could drive the 911 Carrera GTS and 911 Targa 4 GTS, but the Targa got a flat tire. It was only supposed to be one night, but a massive thunderstorm cancelled all the flights to DC the evening I was supposed to go home. Ars does not accept paid editorial content.</aside><p>ATLANTA—When it comes to cars that car nerds can obsess about, few cars get close to the Porsche 911. And with good reason: from that <a href=\"https://www.porsche.com/international/accessoriesandservice/classic/models/911-f/911-f-901/\">first show car in 1963</a> until today, Porsche has refined and evolved the 911 into a bewildering array of variants and versions. For example, only one turbocharged 911 is called the 911 Turbo, even though today, almost all 911s use turbocharged engines. I find it almost mystifying how well the company is able to tweak the same recipe to make cars that, to the outsider, look identical but drive completely differently and are bought by different customers.</p>\n<p>Nothing exemplifies this (or confuses me more) than today's car in question, the 2022 911 GTS. Those three letters usually appear in combination on the back of a 911 in the run-up to the car's midlife refresh, or the change from one generation to another. But the 911 GTS isn't a single variant; it's really a range within a range, with five different 911 GTSes, each with the choice of two transmissions to pick from. See what I mean about confusion?</p>\n<h2>One engine, two transmissions, three body styles</h2>\n<p>All 911 GTSes use the same 3.0L turbocharged flat-six engine, mounted behind the rear axle, as is the tradition with the 911. In the GTS it has received a modest increase of 30 hp (22 kW) and 30 lb-ft (41 Nm) over the <a href=\"https://arstechnica.com/cars/2019/11/evolution-not-revolution-for-the-new-2020-porsche-911-carrera-s/\">Carrera S</a> and now outputs 473 hp (353 kW) and 420 lb-ft (570 Nm). The increase is thanks to an increase in boost pressure—18.6 psi (1.3 bar) versus 16 psi (1.1 bar) in lesser 911s—but Porsche has also fitted a new dual-mass flywheel to cope with the added torque.</p></div><p><a href=\"https://arstechnica.com/?p=1796509#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1796509&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bf3b2bce8308c192a3e9ba86d6ce3d0d75bcf444b63a301328a241ac73654484","category":"Tech"}