{"title":"Vizio TV buyers are becoming the product Vizio sells, not just its customers","link":"https://arstechnica.com/?p=1764690","date":1620856889000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/vizio-tv-800x493.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/vizio-tv.png\">Enlarge</a> <span>/</span> Vizio's 65-inch 4K OLED TV. (credit: <a href=\"https://www.vizio.com/en/tv/oled/OLED65-H1\">Vizio</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Over the past several years, TV-maker Vizio has achieved a reputation among home theater enthusiasts as the company that makes TVs that provide superior picture quality relative to their cost. While the most expensive TVs from Samsung and LG beat Vizio's in quality assessment by reviewers, Vizio is widely regarded as one of the best bang-for-buck brands.</p>\n<p>But for consumers, those competitive prices may come with a downside: becoming subject to targeted advertising and monetized personal data collection. As reported previously <a href=\"https://www.engadget.com/vizio-q1-earnings-inscape-013937337.html\">on Engadget</a>, Vizio just posted its first public earnings report, wherein it revealed that profits from the part of its business that is built around collecting and selling user data as well as targeting advertising at users totaled $38.4 million in the quarter.</p>\n<p>That's less than the $48.2 million of profit generated by device sales in the same quarter, but data and advertising profits grew significantly year-over-year while actual device sales grew comparatively slowly. These digital products are still nowhere close to device sales in total revenue, however; the data and ad-related business unit (dubbed Platform+) added up to only 7.2 percent of global revenue.</p></div><p><a href=\"https://arstechnica.com/?p=1764690#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1764690&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bf4abbe53d4baa69b6c1f43758f41d593816c395650b28717f62a710c61fb648","category":"Tech"}