{"title":"Lidar DEM and Computational Mesh Grid Resolutions Modify Roughness in 2D Hydrodynamic Models","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037165?af=R","date":1720335600000,"content":"<h2>Abstract</h2>\n<p>Topography and the computational mesh grid are fundamental inputs to all two-dimensional (2D) hydrodynamic models, however their resolutions are often arbitrarily selected based on data availability. With the increasing use of drone technology, the end user can collect topographic data down to centimeter-scale resolution. With this advancement comes the responsibility of choosing a resolution. In this study, we investigated how the choice of mesh grid and digital elevation model (DEM) resolutions affect 2D hydrodynamic modeling results, specifically water depths, velocities, and inundation extent. We made pairwise comparisons between simulations from a 2D HEC-RAS model with varying mesh grid resolutions (1 and 2 m) and drone-based lidar DEM resolutions (0.1, 0.25, 0.5, 1, and 2 m) over a 1.5 km reach of Stroubles Creek in Blacksburg, Virginia. The model was rerun for up to ±4% change in floodplain roughness to determine how the DEM and mesh grid changes relate to an equivalent change in roughness. We found that the modeled differences from resolution change were equivalent to altering floodplain roughness by up to 12% for depths and 44% for velocities. The largest differences in velocity were concentrated at the channel-floodplain interface, whereas differences in depth occurred laterally throughout the floodplain and were not correlated with lidar ground point density. We also found that the inundation boundary is dependent on the DEM resolution. Our results suggest that modelers should carefully consider what resolution best represents the terrain while also resolving important riparian topographic features.</p>","author":"Elizabeth M. Prior, \nNathan Michaelson, \nJonathan A. Czuba, \nThomas J. Pingel, \nValerie A. Thomas, \nW. Cully Hession","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"bf500b4ab36244aa540a5c47ee74580933905a698c64d79d043ba0b32e231e6b","category":"Environment"}