{"title":"ผลทดสอบชิปบน Galaxy S21 Ultra: Exynos 2100 ยังแพ้ Snapdragon 888 อยู่","link":"https://www.blognone.com/node/121189","date":1613359783000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>ประเด็น Exynos vs Snapdragon มีมายาวนานหลายปี กับการที่ผลิตภัณฑ์เดียวกัน ราคาเดียวกัน แต่ผู้ใช้กลับได้ประสิทธิภาพต่างกันจากชิปสองรุ่นที่ใช้ มาปีนี้ Samsung ก็ยังใช้ชิปสองรุ่นเหมือนเดิมคือ Exynos 2100 และ Snapdragon 888 แต่ Samsung หันมาใช้แกนประสิทธิภาพสูง Cortex-X1 บนชิป Exynos 2100 แทนแกนประสิทธิภาพสูงตระกูล Exynos ของซัมซุงเองแบบในรุ่นก่อนๆ แล้ว</p>\n<p>ปีนี้ Exynos 2100 ใช้แกน Cortex-X1, Cortex-A78 และ Cortex-A55 และมีจำนวนเท่ากับ Snapdragon 888 คือ 1, 3 และ 4 แกนตามลำดับ มีสัญญาณนาฬิกาสูงสุดของแกน X1 อยู่ที่ 2.91GHz แกน A78 ที่ 2.81GHz, A55 ที่ 2.20GHz ใช้จีพียู Mali G78MP14 ความเร็ว 854MHz และผลิตโดยกระบวนการผลิต 5nm ของ Samsung</p>\n<p>ส่วน Snapdragon 888 มีสัญญาณนาฬิกาสูงสุดของแกน X1 อยู่ที่ 2.84GHz แกน A78 ที่ 2.42GHz, A55 ที่ 1.80GHz ใช้จีพียู Adreno 660 ความเร็ว 840MHz และผลิตด้วยกระบวนการผลิต 5nm ของ TSMC</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8c5f1d358b778852e944ce3309c2ae1c.png\" alt=\"\" /></p>\n<p>ผลทดสอบจากเว็บไซต์ <a href=\"https://www.anandtech.com/show/16463/snapdragon-888-vs-exynos-2100-galaxy-s21-ultra\">Anandtech</a> แสดงให้เห็นว่า Snapdragon 888 ยังนำ Exynos อยู่ในหลายๆ ด้าน เพราะแคช L2 บนแกน Cortex-X1 ของ Snapdragon 888 ให้มาถึง 1MB ส่วน Samsung ใส่มาแค่ 512KB และแม้ Samsung จะเพิ่ม system level cache ขึ้น แต่ก็ทำให้ความหน่วง (latency) สูงขึ้น กว่า Exynos 990 เล็กน้อย (136ns จาก 121ns ในรุ่นก่อน)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f488024f7a992d8f4d39883ec96f83cf.png\" ></p>\n<p>ผลทดสอบด้านประสิทธิภาพ แม้ Exynos 2100 จะมีประสิทธิภาพด้านการทำงานแบบ single-thread สูงกว่า Exynos 990 ถึง 27% แต่ก็ยังแพ้ Snapdragon 888 อยู่ ในการทดสอบส่วนใหญ่ แถมยังกินไฟมากกว่า รวมถึงร้อน และ throttle ไวกว่า ทำให้ประสิทธิภาพโดยรวมแย่กว่าอีกด้วย แม้ Exynos 2100 จะมีความเร็วสัญญาณนาฬิกาแกน X1 สูงสุด มากกว่า SD888 แต่ Anandtech ก็ถึงกับต้องทำการทดสอบโดยเอาไปใส่ตู้เย็น ถึงจะเร่งความเร็วแซง SD888 ที่ทดสอบโดยวางไว้ใต้พัดลม 40 มิลลิเมตรได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/76e536240792c6f43eecf96eb410f77b.png\" ><em>สัญญาณนาฬิกาของทั้งสองรุ่นในการทดสอบ หมวด Exynos 2100 มีทดสอบใน Freezer ด้วย</em></p>\n<p>ในด้านจีพียูทั้ง Mali-G78 และ Adreno มีปัญหาด้านความร้อน โดยจะสามารถรันที่ความเร็วสูงสุด ด้วย peak power ประมาณ 8-9W ได้เพียงไม่กี่วินาทีเท่านั้น ก่อนจะ throttle ลงมาอยู่ที่ประมาณ 3W แต่สุดท้ายแล้วประสิทธิภาพของ Mali-G78 ก็ยังแพ้ Adreno 660 ในการทดสอบส่วนใหญ่อยู่ แม้ Mali-G78 บน Exynos 2100 จะมีประสิทธิภาพมากขึ้นกว่า Mali-G77 ใน Exynos 990 ถึง 40% ก็ตาม</p>\n<p>ส่วนในด้านแบตเตอรี่ S21 Ultra รุ่นที่ใช้ Snapdragon 888 ก็ยังชนะ Exynos 2100 อยู่ โดยรุ่น Snapdragon 888 ใช้งานได้ราว 10 ชั่วโมงครึ่ง บนการทดสอบ PC Mark Work 2.0 ขณะที่รุ่น Exynos 2100 อยู่ได้ราว 9 ชั่วโมง ส่วนในการทดสอบเล่นอินเทอร์เน็ตด้วย WiFi รุ่น Snapdragon 888 อยู่ได้ ราว 15 ชั่วโมง ในขณะที่รุ่น Exynos 2100 อยู่ได้ประมาณ 13 ชั่วโมง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/31c2b11b768fa91f1a9ede7c03e1fae0.jpg\" ><br />\nสุดท้ายแล้ว Exynos 2100 แม้จะดีขึ้นกว่า Exynos 990 พอสมควร แต่ก็ยังแพ้ Snapdragon 888 อยู่เหมือนเคย ทั้งในด้านประสิทธิภาพ และการใช้พลังงาน แต่ Anandtech ก็ชี้ให้เห็นว่าชิปทั้งสองรุ่น พบปัญหาด้านความร้อน และ throttling บ่อยมาก ซึ่งอาจเป็นผลมาจากการกดดันของชิป A14 ของ Apple ที่ประสิทธิภาพนำไปไกล ทำให้ทั้ง Snapdragon และ Samsung ต้องอัดฉีดประสิทธิภาพมากขึ้นเป็นพิเศษ แม้ระบบระบายความร้อนของสมาร์ทโฟน จะยังเป็นแบบเดิมๆ คงต้องติดตามดูกันต่อไปในปีนี้ ว่าการพัฒนาจะเป็นไปในทิศทางใด</p>\n<p>ที่มา - <a href=\"https://www.anandtech.com/show/16463/snapdragon-888-vs-exynos-2100-galaxy-s21-ultra\">Anandtech</a></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/galaxy-s21\">Galaxy S21</a></div><div class=\"field-item odd\"><a href=\"/topics/snapdragon\">Snapdragon</a></div><div class=\"field-item even\"><a href=\"/topics/exynos\">Exynos</a></div><div class=\"field-item odd\"><a href=\"/topics/soc\">SoC</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bf56b04ea6d7cd2b9ddb196eb04f3ab09086cc919b686866941d126c9b5cc5e6","category":"Thai"}