{"title":"Ameliorative impacts of Sinapic acid against monosodium urate crystal-induced gouty arthritis and inflammation through different signaling pathways","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae130/7737696?rss=1","date":1724198400000,"content":"<span><div>Abstract</div>As known, gout a metabolic disease due to the urate crystals deposition in the joints and affect human health and state. Humans are looking for safe natural remedies from plants with safe, low cost and high effect on their health. Sinapic acid (SA) is found in plants and used as phytoconstituent in human diets. SA has strong antioxidant activity, bone-regenerative, anti-cancer, anti-allergic, and antidiabetic effects. The current study was outlined to confirm the anti-gout potential of SA against monosodium urate crystals (MSU)-induced gouty arthritis in mice. Positive gouty arthritis was conducted by administration of colchicine and MSU in the hind paw. SA was orally administered to negative and positive MSU arthritic mice at 25 and 50 mg/kg, one-hour before MSU injection (100 μg/kg intra-articular). At the end of the experiment, sampling was done for serum, histopathology, oxidative stress and gene expression analysis. The results showed that SA significantly recovered the joint edema and recovered MSU crystals-showed histopathological changes. The production of cytokines, leukocyte recruitment, oxidative stress, and nucleotide-binding domain, leucinerich–containing family, pyrin domain–containing-3 (NLRP3)-inflammasome genes expressions were increased in positive arthritic mice and ameliorated significantly by SA administration. Moreover, SA showed ameliorative impacts on air pouch model of mice as reported by the down regulation in the expression of inflammation related blood cells, proinflammatory cytokines and other transcriptional genes. In conclusion, sinapic acid showed a potential therapeutic use against side effects accompanying gouty arthritis and is good as a supplement against inflammation associated disorders.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"bf5628c507032c6ee0e0231d1f0aaa10664cf729906007e483345839ef5f368a","category":"Environment"}