{"title":"Today Is the Launch of Max, and It Sucks Even More Than I Thought It Would","link":"https://twitter.com/sigjudge/status/1660991982095745024?s=61&t=IO0gpJ6MMbM8xFDvXZt-Nw","date":1684874741000,"content":"\n<p>Sigmund Judge, on Twitter:</p>\n\n<blockquote>\n  <p>Max launches today, and with it brings yet another chapter in the\nbattle between Warner/Discovery executives and Apple TV customers.</p>\n\n<p><a href=\"https://twitter.com/StreamOnMax\">@StreamOnMax</a> switches away from Apple’s native video player in\nthe continued pursuit of creating an inferior product...</p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/2023/04/warner_max\">I told you</a> these Warner “Bros” Discovery executives are morons. On all the good platforms, you have to install an altogether new app. Why not just update the existing HBO Max app with (<a href=\"https://twitter.com/gilbert/status/1660878157162090496\">yet another</a>) a new name and icon? Because they’re morons. (Even better: when I launch the old HBO Max app on my Apple TV, it doesn’t tell me anything about the new app — it just shows an error screen saying “Something went wrong.”)</p>\n\n<p>This much moronity I expected. But it gets worse. As Judge documents, with the new app they’ve <a href=\"https://9to5mac.com/2023/05/23/hbo-max-app-tvos-apple-tv/\">once again</a> dropped tvOS’s excellent native video player for a custom video player that utterly sucks: “up next” support in the TV app is now broken or missing, HDR and frame-rate match are gone, the new video player doesn’t support the Siri remote’s jog support, no picture-in-picture, and no support for the wonderful “What did they just say?” feature (speak that to your Siri remote and the video jumps back 10 seconds or so and temporarily enables subtitles).</p>\n\n<p>HBO Max was a really good tvOS app. Max is a poor one.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/23/max-tvos\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"bf57982c1fdd937e1ef58599c350e99e40a641de119928998761fcbd913e7f51","category":"Tech"}