{"title":"Atom Computing is the first to announce a 1,000+ qubit quantum computer","link":"https://arstechnica.com/?p=1978158","date":1698156174000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/atom_array-800x800.jpg\" alt=\"A dark blue background filled with a regular grid of lighter dots\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/atom_array.jpg\">Enlarge</a> <span>/</span> The qubits of the new hardware: an array of individual atoms. (credit: Atom Computing)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Today, a startup called Atom Computing announced that it has been doing internal testing of a 1,180 qubit quantum computer and will be making it available to customers next year. The system represents a major step forward for the company, which had only built one prior system based on neutral atom qubits—a system that operated using only 100 qubits.</p>\n<p>The error rate for individual qubit operations is high enough that it won't be possible to run an algorithm that relies on the full qubit count without it failing due to an error. But it does back up the company's claims that its technology can scale rapidly and provides a testbed for work on quantum error correction. And, for smaller algorithms, the company says it'll simply run multiple instances in parallel to boost the chance of returning the right answer.</p>\n<h2>Computing with atoms</h2>\n<p>Atom Computing, as its name implies, has chosen neutral atoms as its qubit of choice (there are other companies that are working with ions). These systems rely on a set of lasers that create a series of locations that are energetically favorable for atoms. Left on their own, atoms will tend to fall into these locations and stay there until a stray gas atom bumps into them and knocks them out.</p></div><p><a href=\"https://arstechnica.com/?p=1978158#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1978158&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bf57f0413150ad50067a43851b2c6b518cf212ab5ded088acb1f7d35054ad11a","category":"Tech"}