{"title":"Effects of naringenin on oxidative damage and apoptosis in liver and kidney in rats subjected to chronic mercury chloride","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24164?af=R","date":1706943300000,"content":"<h2>Abstract</h2>\n<p>Mercury chloride is a type of heavy metal that causes the formation of free radicals, causing hepatotoxicity, nephrotoxicity and apoptosis. In this study, the effects of naringenin on oxidative stress and apoptosis in the liver and kidney of rats exposed to mercury chloride were investigated. In the study, 41 2-month-old male Wistar-Albino rats were divided into five groups. Accordingly, group 1 was set as control group, group 2 as naringenin-100, group 3 as mercury chloride, group 4 as mercury chloride + naringenin-50, and group 5 as mercury chloride + naringenin-100. For the interventions, 1 mL/kg saline was administered to the control, 0.4 mg/kg/day mercury (II) chloride to the mercury chloride groups by i.p., and 50 and 100 mg/kg/day naringenin prepared in corn oil to the naringenin groups by gavage. All the interventions lasted for 20 days. Mercury chloride administration was initiated 1 h following the administration of naringenin. When mercury chloride and the control group were compared, a significant increase in plasma urea, liver and kidney malondialdehyde (MDA) levels, in kidney superoxide dismutase (SOD), glutathione peroxidase (GSH-Px), glutathione-S-transferase (GST) activities (<i>p</i> &lt; .001), and a significant decrease in liver and kidney glutathione (GSH) levels (<i>p</i> &lt; .001), in liver catalase (CAT) activity (<i>p</i> &lt; .01) were observed. In addition, histopathological changes and a significant increase in caspase-3 levels were detected (<i>p</i> &lt; .05). When mercury chloride and treatment groups were compared, the administration of naringenin caused a decrease aspartate transaminase (AST), alanine transaminase (ALT), lactate dehydrogenase (LDH) (<i>p</i> &lt; .01), urea, creatinine levels (<i>p</i> &lt; .001) in plasma, MDA levels in liver and kidney, SOD, GSH-Px, GST activities in kidney (<i>p</i> &lt; .001), and increased GSH levels in liver and kidney. The addition of naringenin-100 increased GSH levels above the control (<i>p</i> &lt; .001). The administration of naringenin was also decreased histopathological changes and caspase-3 levels (<i>p</i> &lt; .05). Accordingly, it was determined that naringenin is protective and therapeutic against mercury chloride-induced oxidative damage and apoptosis in the liver and kidney, and 100 mg/kg naringenin is more effective in preventing histopathological changes and apoptosis.</p>","author":"Merve Kahramanoğullari, \nMine Erişir, \nMine Yaman, \nTuba Parlak Ak","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"bf5aa4b1f5b6bdb5444b378737c62d809c0f3c16496aa965516af13c0f26b1a2","category":"Environment"}