{"title":"Apple collabs with Lady Gaga and Dua Lipa for remix lessons","link":"https://www.macworld.com/article/352216/apple-collabs-with-lady-gaga-and-dua-lipa-for-remix-lessons.html","date":1627579169000,"content":"<div>\n<section><div></div></section><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/07/garageband-features-new-sound-packs-from-dua-lipa-lady-gaga-and-top-producers/&amp;xcust=1-1-352216-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple has announced</a> a collaboration with two of today’s hottest music artist, Lady Gaga and Dua Lipa. It comes in the form of two new Remix Sessions for the iOS/iPadOS version of GarageBand (sorry, Mac users). In addition, Apple is making available seven new Producer Packs full of beats, loops, and instruments created by some of the music industry’s top producers. </p>\n\n\n\n<p>The new free offerings are timed to coincide with the launch of <em>Watch the Sound with Mark Ronson</em> on <a href=\"https://www.macworld.com/article/230863/apple-tv-originals-shows-series-movies-release-dates-news-actors-directors.html\">Apple TV+</a>, which premieres on Friday, July 30. That documentary series gives the inside story behind the creation and production of some of today’s most popular music. There’s even an eighth Producer Pack available that serves as a companion piece to the show, allowing users to experiment with sounds and instruments inspired by it.</p>\n\n\n\n<p>The Lady Gaga and Dua Lipa tie-in comes in the form of two Remix Sessions: in-app tutorials that let you follow along to learn how to use GarageBand. The video sessions are led by an Apple Retail Creative Pro, and let you follow along using Live Loops to remix “Break My Heart” by Dua Lipa and “Free Woman” by Lady Gaga.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/garageband-remix.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Video tutorials show you how to remix a Lady Gaga or Dua Lipa song, using Live Loops of the track’s real instruments, beats, and vocals.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>In addition to the two remix tutorials, the seven Producer Packs give users access to content created by top music producers: Boys Noize, Mark Lettieri, Oak Felder, Soulection, Take A Daytrip, Tom Misch, and TRAKGIRL. Apple says these packs are, “bursting with hundreds of royalty-free loops, beats, instruments, drum kits, synth patches, and samples that embody the sound and vibe of each producer.”</p>\n\n\n\n<p>The exclusive “Watch the Sound With Mark Ronson” Producer Pack is meant as a companion to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://tv.apple.com/us/show/watch-the-sound-with-mark-ronson/umc.cmc.56ka6i8ccv7tsatj6nd1uo808?ctx_brand=tvs.sbd.4000&amp;xcust=1-1-352216-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple TV+ docuseries</a> that premieres on July 30. According to Apple, it features, “GarageBand versions of the music technology featured in every episode, from sampling to drum machines, synths to reverb, and vocal effects to distortion.”</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bf5b3ff2952f2e8ad8ff2b3a6e1f190d9f395ff78519406371537d4b60fd28d0","category":"Apple"}