{"title":"Choline and Essential Fatty Acids Inadequate Intake in Latin American Childbearing Age Women as a Regional Pre‐Conceptional Disadvantage. ELANS Results","link":"https://www.preprints.org/manuscript/202408.0283/v1","date":1722860242000,"content":"Choline and essential fatty acids (EFA) are vital for fetal brain development, supporting pregnancy, and maintaining hormonal balance. They also promote overall health. The childbearing years present a window of opportunity to increase the intake of these key nutrients and develop healthy dietary habits. Survey data were collected for the Estudio Latinoamericano de Nutrición y Salud (ELANS), including participants from Argentina, Brazil, Chile, Colombia, Costa Rica, Ecuador, Peru, and Venezuela (n=9,218; 15-65 years old). Women of childbearing age were extracted from the largest database (n=3,704). The aims of this study were to evaluate the intake of choline and essential fatty acids in women of childbearing age, identify their food sources, and determine if supplements containing choline and EFA were available across the ELANS countries. In general, choline intake was inadequate in all countries, while essential fatty acids intake was normal or above requirements. Chile had the lowest intake of choline and Colombia the highest. The results showed that some countries had more inadequate choline intake than others. Consuming a larger quantity of eggs helped reduce choline inadequacy, as did including eggs and fish in the diet. The intake of essential fatty acids, including ALA, EPA, and DHA, showed variability. The contributions of EPA and DHA were lower than that of ALA, and the results differed by age group. In conclusion, choline intake is inadequate and EFA intake is variable among women of childbearing age in the ELANS study. More awareness and education are needed to achieve better intake of these nutrients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bf5f7aee807649f93b327be621e391b90c2b0402892fa34fd4292d8dadc987cc","category":"Interdisciplinary"}