{"title":"North and South in Medieval Iberia: A historical and environmental estimate through isotopic analyses","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304313","date":1717596000000,"content":"<p>by José Francisco Martín-Alonso, Zita Laffranchi, Marco Milella, Lorenza Coppola-Bove, Luis A. Mena-Sánchez, Sylvia A. Jiménez-Brobeil</p>\r\n\r\nThe Middle Ages in the Iberian Peninsula is a period of special interest for studying the relationship of climate change with historical and socioeconomic processes. Between the 8<sup>th</sup> and 15<sup>th</sup> centuries AD, the Peninsula was characterized not only by complex political, cultural, and social transitions but also by major variations in the climate. The objective of this study was to examine differences in diet and mobility between distinct populations of the Peninsula and explore the possible relationship of diet, mobility, and culture with environmental variables and geographical settings. For this purpose, we obtained stable isotopic ratios of carbon and oxygen (δ<sup>13</sup>C and δ<sup>18</sup>O) from the enamel apatite of first upper incisors from 145 individuals at eight archeological sites that represent both Christian and Islamic communities and both rural and urban social settings. Results revealed a dietary difference between Christian and Islamic populations, observing a greater contribution of C<sub>4</sub> plants, possibly sorghum, in the diet of the latter, especially in a rural setting. The disparity in oxygen isotopic ratios between populations from the North and South of the Peninsula is consistent with modern climatic differences between these regions. In this line, intraregional variability in oxygen isotopic ratios may hint at diachronic occupation phases under varying climatic conditions. The few isotopic outliers in our sample suggest overall low mobility levels.","author":"José Francisco Martín-Alonso","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf6255fe817b6a872d42b82dccb68fa4087b3be04461329c0c6a9048f962ce2c","category":"Interdisciplinary"}