{"title":"Inadequate mentoring in undergraduate research experiences: Exploring protective factors","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15186?af=R","date":1724520566000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/230be636-b252-4c22-981a-15266ff2647a/nyas15186-gra-0001-m.png\" alt=\"Inadequate mentoring in undergraduate research experiences: Exploring protective factors\" />\n<p>This study examines instances of negative mentoring among undergraduate researchers within STEM education, and specifically, the common yet subtle issue of inadequate mentoring characterized by a faculty mentor's failure to provide their mentee with adequate research, educational, career-related, or emotional support.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study examines instances of negative mentoring among undergraduate researchers within STEM education, and specifically, the common yet subtle issue of inadequate mentoring characterized by a faculty mentor's failure to provide their mentee with adequate research, educational, career-related, or emotional support. Using data from the Mentor-Relate survey of 514 participants in the National Science Foundation Research Experiences for Undergraduates program, we identify prevalent patterns of inadequate mentoring and examine protective factors against it. Results indicate that inadequate research support is the least prevalent form, while inadequate educational and career guidance is more common, and inadequate emotional support is the most prevalent. Enhanced faculty mentoring skills emerge as a protective factor, with culturally responsive mentoring and gender concordance also playing significant protective roles. Less hierarchical mentoring structures, such as multiple faculty mentors, offer better emotional support. These findings underscore the importance of comprehensive mentor training and culturally sensitive practices to mitigate inadequate mentoring in undergraduate research experiences. By promoting inclusive and supportive mentoring environments, institutions can maximize the transformative potential of undergraduate research experiences for all participants.</p>","author":"Danielle X. Morales, \nSara E. Grineski, \nTimothy W. Collins","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"bf67fd59d51b27f8ff24a4c074c93a8a9eba431720ead4bcf85803472343647f","category":"Environment"}