{"title":"Knowledge, attitudes and practices towards COVID-19 among healthcare workers: A cross-sectional survey from Kiambu County, Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0297335","date":1710252000000,"content":"<p>by Prabhjot Kaur Juttla, Moses Ndiritu, Ferdinand Milliano, Alfred Owino Odongo, Magoma Mwancha-Kwasa</p>\r\nBackground <p>The knowledge possessed by healthcare workers (HCWs), along with their attitudes and practices play a vital role in effectively managing a pandemic. This is crucial considering that HCWs are exposed to great risk at the forefront of such crises. We aimed to describe the knowledge, attitude, and practices (KAP) of HCWs during the COVID-19 pandemic in Kiambu county, Kenya.</p> Methods <p>A cross-sectional study using a structured questionnaire was conducted from 11th March 2021 to 12th August 2021. Bloom’s cutoff points were used to determine KAP scores (&gt;80%: good, 60–79%: medium and &lt;60% poor). Multivariable ordinal logistic regression analyses were conducted, calculating adjusted odds ratios (AOR) at a 95% confidence interval. Spearman’s rank correlations were used to examine the relationship between KAP scores.</p> Results <p>438 HCWs participated in the study, majority of whom were female (64.5%), had obtained a diploma (59.6%) and were informed through government websites (78.6%). 43.0% had good knowledge, 17.5% good attitudes, and 68.4% good practice. 23.0% had medium knowledge, 35.6% medium attitude, 15.7% medium practice, while 34.0% had poor knowledge, 46.9% poor attitude and 15.9% poor practice. Only 68.9% of the caregivers correctly recognized the county’s COVID-19 isolation centre and only 7.9% chose the two correct documents for the entry of data for a suspected COVID-19 case. Furthermore, the general attitude towards their own personal safety and their training regarding PPEs (17.8% and 23.8% strongly agreed with the contrary) were less compelling. There was a significant positive association between obtaining information from international government sites [AOR: 1.382 (1.058–1.807); p = 0.0178)] and good knowledge. Referring to local government sites for information regarding COVID-19 produced better attitudes [AOR: 1.710 (1.194–2.465); p = 0.0036] and produced almost twice the odds of having better practice [AOR: 1.800 (1.181–2.681); p = 0.0048]. There was a significant correlation between knowledge and practice (<i>r</i> = -0.330, p = 2.766×10<sup>−11</sup>), and knowledge and attitude (<i>r</i> = -0.154, p = 6.538×10<sup>−3</sup>).</p> Conclusion <p>This study emphasizes the substantial impact that governing bodies have on shaping favorable KAP. As a result, it’s crucial for local government platforms to prioritize the dissemination of up-to-date information that aligns with international standards. This information should be tailored to the specific region, focusing on addressing deficiencies in healthcare practices and patient management. The identification of a significant number of HCWs lacking confidence in managing COVID-19 patients and feeling unprotected underscores a clear need for improvement in their understanding and implementation of preventive measures. This gap can be bridged by adequately equipping HCWs with locally manufactured PPEs. This aspect is crucial for pandemic preparedness, and we further advocate for the creation of a locally produced repository of medical equipment. These actions are pivotal in improving future crisis management capabilities.</p>","author":"Prabhjot Kaur Juttla","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf70d514eb12babf03fa9b425586ba816c2916ba0fc6a0cdccbf3ee6ff25c170","category":"Interdisciplinary"}