{"title":"Apple's EU App Store Changes: iPads, TestFlight, Default Stores and More","link":"https://www.macrumors.com/2024/01/26/apple-eu-app-ecosystem-tidbits/","date":1706303742000,"content":"Apple announced an overwhelming number of changes <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">to the app ecosystem</a> in the European Union yesterday, and with the flood of information, there may have been a few details that were overlooked by developers and device users.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/App-Store-vs-EU-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nWe've rounded up a handful of lesser-known details that offer some clarification on what these updates mean for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and other products.\r<br />\n\r<br />\n<h2>The iPad and Other Devices</h2>\r<br />\nThe Digital Markets Act required Apple to make changes to both \"iOS\" and to the \"<a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>,\" with the European Commission defining iOS as the operating system that runs on the ‌iPhone‌, and the \"‌App Store‌\" as a cross-platform entity that operates on all of Apple's operating systems.\r<br />\n\r<br />\nFor that reason, some of the changes that Apple is making are exclusive to the ‌iPhone‌, while others are coming to iOS, iPadOS, macOS, tvOS, and watchOS.\r<br />\n<h3>Limited to the iPhone</h3>\r<br />\n<ul>\r<br />\n \t<li><strong>Alternative app marketplaces</strong> - Alternative app marketplaces will only be available on the ‌iPhone‌, not the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, so there will not be an option to install a third-party app store on an ‌iPad‌. There will also be no way to install an app from an alternative app store on an ‌iPad‌. Alternative marketplace apps will be ‌iPhone‌ only.</li>\r<br />\n \t<li><strong>App notarization</strong> - Notarization is linked to alternative app marketplaces and will apply to iOS apps, not iPadOS apps.</li>\r<br />\n \t<li><strong>Alternative browser engines</strong> - Allowing browsers to use an alternative engine is a feature that is also ‌iPhone‌ only. Chrome, for example, would only be able to use a non-WebKit engine for its Chrome for ‌iPhone‌ app, not the Chrome for ‌iPad‌ app.</li>\r<br />\n \t<li><strong>NFC access</strong> - Banking and wallet apps on ‌iPhone‌ can access NFC technology and users can set alternative contactless payment apps as default.</li>\r<br />\n</ul>\r<br />\n<h2>App Store Changes for iOS, iPadOS, macOS, watchOS, and tvOS</h2>\r<br />\n<ul>\r<br />\n \t<li><strong>Apple's new business terms</strong> - The new business terms, which come with a Core Technology Fee and reduced ‌App Store‌ commissions, are applicable to all platforms.</li>\r<br />\n \t<li><strong>Third-party payments</strong> - Developers can opt out of In-App Purchases, instead using a third-party payment service provider for digital goods and services.</li>\r<br />\n \t<li><strong>App Store labels</strong> - When an app uses alternative payment processing, it will say so on the ‌App Store‌ product page and on an in-app disclosure sheet that warns customers that a developer is directing them to transact with an alternative payment processor.</li>\r<br />\n \t<li><strong>Payment link-outs</strong> - Developers can include a link to allow users to complete a transaction on the developer's website, and can also let users know about promotions, discounts, and deals available outside of their apps.</li>\r<br />\n</ul>\r<br />\n\r<br />\n<h2>Default App Marketplaces</h2>\r<br />\n‌iPhone‌ users in Europe can choose to set an alternative app marketplace as the default on their device as required under the DMA. This feature doesn't do much other than show results from the alternative app marketplace in Spotlight search when the search contains something that is available in that marketplace.\r<br />\n\r<br />\n<h2>App Marketplace Requirements</h2>\r<br />\nApp marketplaces need to provide Apple with proof of solvency in the form of a $1m euro letter of credit. While apps installed through marketplaces do not have to pay a 0.50 euro Core Technology Fee for the first 1 million \"first installs\" of an app, that does not apply to app marketplaces. The fee has to be paid right away.\r<br />\n\r<br />\nDevelopers who want to create an app marketplace need to have a presence in the European Union.\r<br />\n\r<br />\nApp marketplaces only have to pay the Core Technology Fee for app marketplace installs. The fee for individual apps will be paid by those apps, not by the marketplace that they're on.\r<br />\n\r<br />\nAn app marketplace may not have just a single app in it, because there is a requirement that marketplaces be fair to developers. Marketplaces can set requirements, such as all games or all educational apps, but all apps in that category must be able to apply to be a part of that marketplace.\r<br />\n\r<br />\n<h2>App Marketplace Installation</h2>\r<br />\nAn app marketplace will be able to be installed as an app through Safari or another web browser, from the app marketplace's developer.\r<br />\n\r<br />\n<h2>App Marketplace Limitations and Features</h2>\r<br />\nMarketplace apps are compatible with core iOS features. They will show up in Spotlight, can work with most Screen Time features, and are included in <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> backups.\r<br />\n\r<br />\nScreen Time purchase restrictions will not be available for app marketplace apps, nor will Family Purchase Sharing or universal purchase.\r<br />\n\r<br />\nApple will not market alternative app stores, or present them as options to users. Developers will need to create their own audience for their marketplaces. Apple also will have no say in refunds or subscription management tools, as the user must go to the marketplace for these options.\r<br />\n\r<br />\n<h2>Managing Alternative Marketplace Apps</h2>\r<br />\nIf an alternative marketplace app is deleted from an ‌iPhone‌, the apps that were installed through that marketplace won't be able to be updated until the marketplace is reinstalled.\r<br />\n\r<br />\nUsers will be able to see which marketplace an app was downloaded from in the Settings app.\r<br />\n\r<br />\n<h2>Adopting Apple's New Business Terms</h2>\r<br />\nDevelopers who opt in to Apple's new business terms, including the Core Technology Fee and reduced commissions, cannot go back to the prior system. It is a one-time change.\r<br />\n\r<br />\nAgreeing to the new business terms is done on a per-account level, not per-app.\r<br />\n\r<br />\n<h2>Notarization and Review</h2>\r<br />\nWhile Notarization will scan for malware, viruses, and ensure that an app does what it says it does, Apple will have less control over content. Copyright violations, IP theft, and other violations will need to be reported to individual app marketplaces, not to Apple.\r<br />\n\r<br />\n<h2>TestFlight</h2>\r<br />\nDevelopers can use TestFlight to test an app that is being developed for an alternative marketplace, even if that app will not be distributed through the ‌App Store‌.\r<br />\n\r<br />\n<h2>NFC</h2>\r<br />\nThe NFC changes apply to countries in the European Economic Area, not just EU countries. The European Economic Area also includes Iceland, Liechtenstein, and Norway, countries that are not in the European Union.\r<br />\n\r<br />\n<h2>Other Questions</h2>\r<br />\nHave other questions about how the app ecosystem in the EU has changed? Let us know in the comments below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/26/apple-eu-app-ecosystem-tidbits/\">Apple's EU App Store Changes: iPads, TestFlight, Default Stores and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-eu-app-store-changes-ipads-testflight-default-stores-and-more.2417535/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bf74118c2c6dc8743600803bdbd5f676671c7e8e82c339717f24ea4156486cbc","category":"Apple"}