{"title":"PSIV-12 Effects of creep-feeding supplementation on growth performance during the rearing and finishing phases of grazing Nellore young bulls","link":"https://academic.oup.com/jas/article/102/Supplement_3/555/7757788?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The study aimed to evaluate the effect of creep-feeding on growth performance of beef young bulls (n = 40) when they were subjected to an intensive rearing and finishing system. The experiment lasted 325 d, from May/2022 to April/2023, the calves were born in September/2021 and creep-feeding supplementation lasted 170 d, from December/2021 to May/2022. The experimental design used was a randomized block [blocked by body weight (BW) of calves in the beginning of supplementation]. The experimental units were the paddocks (4 paddocks per treatment, and 5 animals per paddock). The treatments consisted of supplementation on creep-feeding system or not during the nursing phase: control (mineral supplement ad libitum) and creep-feeding treatment (energetic protein supplement, 5 g/kg BWּ animal<sup>-1</sup>ּ d<sup>-1</sup>). After weaning, all the bulls were managed similarly with an energetic protein supplement (10 g/ kg BWּ animal<sup>-1</sup>ּ d<sup>-1</sup>) during the grazing intensive rearing phase, and 15 gּ/kg BWּ animal<sup>-1</sup>ּ d<sup>-1</sup>during the grazing intensive finishing phase) until slaughter. The bulls were allocated to grazing area of <span>Urochloa brizantha</span> cv. <span>Marandu</span>. The data were analyzed using the MIXED procedures of SAS (SAS Institute Inc., Cary, NC, USA, version 9.4). The bulls subjected to creep-feeding system had greater BW at beginning of rearing phase (+14 kg) and beginning of rainy season (+18 kg; <span>P</span> = 0.03; Figure 1). At beginning of finishing phase and slaughter, the bulls had the same BW (<span>P</span> ≥ 0.71; Table 1). The back and rump fat thickness measures showed tendency to be different between the treatments (<span>P</span> ≤ 0.10), where creep-fed animals were greater. Probably, creep-fed bulls slowed down their BW gain during the rainy season on rearing and finishing phases, due to presenting a change in the gain composition. Creep-feeding may have influenced the puberty of these bulls, and caused them to begin deposition of fat earlier than those that did not receive creep-feeding. Thus, the animal tends to balance BW with changes in the gain composition, and the percentage of muscle tissue tends to reduce, while the proportion of fat tends to increase. Creep-feeding supplementation increased the animals weaning weight by 14 kg but, it was not able to influence the slaughter weight due to changes in the gain composition.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"bf78b5464b80e95da370eac41bd8eecdf4e3aac6efabefd8c79ddef1226ba316","category":"Environment"}