{"title":"Freehubs explained: standards, compatibility and how a freehub works","link":"https://www.bikeradar.com/advice/buyers-guides/freehubs/","date":1691157600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/10-03-06SNY0013-a85b4ed.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Hunt Alloy SL Disc wheelset on tarmac\" title=\"Hunt Alloy SL Disc\" />                                            <p>It’s a small component we tend to take for granted, but the freehub is an essential part of most bikes and does a vital job. The freehub transmits your pedal power to the road or trail and gives your legs a rest while you’re still moving.</p>\n<p>For many riders, it’s a case of fit and forget, but there’s a lot going on with your freehub. It’s got some tricky mechanical parts that are hidden away inside it, which will sometimes need a little tender loving care to keep them working well.</p>\n<p>If you always swap like for like when <a href=\"https://www.bikeradar.com/advice/workshop/how-to-replace-cassette/\">replacing your bike’s cassette</a>, you may not need to worry much about freehub compatibility, but that too is trickier than it seems.</p>\n<p>We’ll start off by explaining the different types of freehub and how their internals work, then later look at freehub standards and cassette compatibility.</p>\n<h2>What is a freehub?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Hunt 54 Aerodynamicist Carbon Disc wheelset\" title=\"Hunt 54 Aerodynamicist Carbon Disc wheelset\" /></div><div><figcaption><span><i></i> The silver section in this picture is the exterior of the freehub.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>Most bikes allow you to stop pedalling but keep moving, or “coast”. For bikes equipped with <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-gears/\">derailleur gears</a>, that’s usually thanks to a freehub.</p>\n<p>The freehub is an extension of the right-hand side of the rear wheel’s hub.</p>\n<p>It contains a system that engages with the wheel when you’re pedalling, to propel you forward, and which disengages when you stop pedalling so that the wheel continues to turn without the gears and pedals turning. There’s a mechanism within the freehub body that engages and disengages the wheel from the gear sprockets.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle installing SRAM Rival cassette on SRAM XDR freehub body\" title=\"Oscar Huckle installing SRAM Rival cassette on SRAM XDR freehub body\" /></div><div><figcaption><span><i></i> Freehub bodies have splines that allow for cassettes to be properly aligned to the wheel.</span></figcaption><span> <i>Gary Walker / Our Media </i></span></div>\n<p>On its outer surface, a freehub has a set of splines, onto which the cassette (i.e. the gear sprockets) is slid when a bike is assembled. In general, the cassette comprises a set of individual sprockets or clusters of sprockets.</p>\n<p>The number of sprockets on the cassette is often referred to as its speeds; for example, 11-speed and 12-speed for the latest <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">mountain bike groupsets</a> have 11 or 12 cogs on the back.</p>\n<p>These sprockets are often held firmly in place by a lockring that threads into the end of the freehub (although we’ll explain some exceptions below).</p>\n<section><div>\n        \n<h3>Points of engagement and angle of engagement</h3>\n<p>You’ll see some brands quoting points of engagement and others referring to the angle of engagement for their hubs. The number of points of engagement is the number of discrete positions in which the freehub can lock to the wheel in each complete turn of the wheel, once you stop freewheeling and start to pedal.</p>\n<p>A complete turn of the wheel is 360 degrees, so the angle of engagement is 360 divided by the number of points of engagement.</p>\n<p>So a freehub with 36 points of engagement, for example, will have a 360/36 = 10-degree angle of engagement. If there are 72 points of engagement, the angle of engagement drops to 5 degrees.</p>\n<p>\n\n    </p></div>\n    </section><h2>How a freehub works</h2>\n<p>The vast majority of freehubs use one of two different systems – pawl or ratchet – to engage the freehub with the wheel when you’re pedalling, and disengage it when you’re freewheeling.</p>\n<p>Within each, there are lots of variations in how they’re engineered and there are some well-known specialist designs such as Chris King hubs.</p>\n<p>We’ll explain both systems here, then weigh up the pros and cons of each.</p>\n<h2>Freehub types</h2>\n<h3>Pawl freehubs</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Freehub pawls\" title=\"Freehub pawls\" /></div><div><figcaption><span><i></i> A pawl freehub consists of sprung levers that mesh with a toothed drive.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>In a pawl freehub, the engagement/disengagement mechanism consists of several sprung levers, called pawls, which are angled outward in one part of the bike’s hub and mesh with a toothed drive ring in the other part of the hub to transmit power to the wheel.</p>\n<p>The springs push the pawls outward from their housings when you’re pedalling. Once you freewheel, the angle of the pawls means that they are pushed back against the springs and slide over the teeth, giving the characteristic clicking sound.</p>\n<p>The number of pawls varies between freehub designs and can be anything from two to six.</p>\n<p>They’re usually in the freehub and pushed outward into teeth in the hub, but there are also designs where the pawls are on the inside edge of the hub flange and face inwards towards teeth on the freehub (like some older Reynolds designs), and ones where the pawls are on the centre of the hub body and mesh with teeth on the outside edge of the freehub (such as some <a href=\"https://www.bikeradar.com/brand/mavic/\">Mavic</a> wheels).</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Many more pawls — and points of engagement — than your daddy's hub\" title=\"1410302308640-16zypc725do30-1815939\" /></div><div><figcaption><span><i></i> More pawls means more points of engagement.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>For some riding, a high number of points of engagement (and hence a small angle of engagement) is considered desirable. The simplest way for a manufacturer to achieve this is to increase the number of teeth on the drive ring.</p>\n<p>However, the teeth will need to be smaller, as will the pawls, so some brands use pawls with multiple teeth to spread the loads, or they offset the pawls in a multi-phase configuration so that not all pawls engage simultaneously, thereby reducing the angle of engagement.</p>\n<p>Halo freehubs take the multiple-teeth approach to give you 120 points of engagement. Rather than the more usual flat profile, its pawls are wedge-shaped, so that pedalling force pushes them harder against the teeth in the hub.</p>\n<p>It’s worth noting that all your pedalling torque is transmitted through the pawls, so they’re under quite a lot of force and need to be maintained regularly to continue to work effectively, particularly if you’re riding in wet or dirty conditions or haven’t used your wheels for some time.</p>\n<h3>Ratchet freehubs</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"DT Swiss freehub ratchet\" title=\"DT Swiss freehub ratchet\" /></div><div><figcaption><span><i></i> A ratchet design uses a pair of inter-connecting rings with teeth on their inner faces.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>A ratchet freehub has a pair of rings with teeth on their inner faces that are concentric around the axle and are pushed together to transmit the pedalling force to the rear wheel. The two ratchet rings are usually pressed together by large springs that encircle the freehub and sit behind one or both of the rings.</p>\n<p>One or both of the ratchet rings can slip in and out on the freehub on splines machined into their outer edges, which mesh with teeth in the freehub and/or hub body.</p>\n<p>The ratchet’s teeth are angled, so when you’re freewheeling the angled faces of each ring slip over each other, sliding against the force from the springs. When you pedal, the flat faces mesh with one another to transmit your driving force to the wheel.</p>\n<p><a href=\"https://www.bikeradar.com/brand/dt-swiss/\">DT Swiss</a> freehubs are all now built on the ratchet system and come with between 18 and 54 points of engagement. For some freehubs, you can buy replacement ratchets that let you alter the number of points of engagement.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rear hub with freehub removed\" title=\"FLF-May-2020-DT-Swiss-Mon-Chasseral-5\" /></div><div><figcaption><span><i></i> DT Swiss freehubs are all built on the ratchet system.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>In the standard DT Swiss Ratchet system and the entry-level Ratchet LN, both ratchets can move in the hub and are pushed together by springs.</p>\n<p>In the newer <a href=\"https://www.bikeradar.com/news/dt-swiss-240-hubs/\">Ratchet EXP</a>, one ratchet ring threads into the wheel hub, while the second slides in and out on splines inside the freehub to engage or disengage the freewheel, pushed by a single spring. This system is lighter and is used on DT Swiss’s high-end wheels.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Chris King components\" title=\"Chris King components\" /></div><div><figcaption><span><i></i> Chris King hubs use a ratchet system it calls ‘RingDrive’.</span></figcaption><span> <i>Chris King Components</i></span></div>\n<p><a href=\"https://www.bikeradar.com/brand/chris-king/\">Chris King</a> hubs have a ratchet system that works in a similar way, but with either 45 or 72 points of engagement, for ultra-fast take-up, once you start to pedal. With this design, it’s the inboard ratchet that slides on the hub to engage the freewheel, giving Chris King hubs their characteristic bulge on the right side.</p>\n<p>Chris King’s ratchet slides on angled splines in the hub rather than the straight in and out ones of DT Swiss’s hubs.</p>\n<p>That means that the harder you pedal, the harder the two ratchets are forced together, so there’s even less chance of them slipping. Chris King claims its system can handle up to three times the torque load of some competitors it’s tested.</p>\n<p>Zipp, too, uses a ratchet system, with 36 teeth, in its top-end Cognition hubs fitted to its NSW wheels. Rather than a spring, it uses six magnets to push the inboard ratchet ring outwards in the hub to engage with the ratchet in the freehub.</p>\n<section><div>\n        \n<h3>Pawl vs ratchet </h3>\n<p>Whereas pawl freehubs have a few discrete points of contact between the ends of the pawls and the teeth with which they mesh, in a ratchet-based system there are a wider number of contact points spread in a ring around the inside of the freehub. </p>\n<p>In theory, the larger number of ring-based contacts in a ratchet should be more reliable and transmit force better, although in practice pawl-based systems are well enough engineered that this is unlikely to be an issue if they’re maintained regularly.</p>\n<p>There’s more potential for wear with a pawl system, as there are a small number of mating surfaces rather than the multiple intermeshing teeth of the ratchet. If one of the pawls fails or doesn’t engage effectively, there’s a greater risk of damage to the freehub’s internals and the freehub failing.</p>\n<p>In some situations, a smaller angle of engagement is beneficial for faster take-up once you start to pedal. It’s particularly useful for climbing off-road. On the other hand, on <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/\">full-suspension mountain bikes</a>, it can accentuate kickback, where the compression of the suspension pulls the chain and cranks backwards, also putting extra stress on the freehub’s internals, which could fail.</p>\n<p>Ratchets might seem the obvious choice for high-stress applications, but if the angle of engagement is the priority, an offset pawl system may be better. Industry Nine uses six offset pawls in its Hydra freehubs which, combined with a 115-tooth drive ring, produce a huge 690 points of engagement, giving an angle of engagement of just over half a degree.</p>\n<p>\n\n    </p></div>\n    </section><h2>Freehub bearings</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ceramic ball bearings\" title=\"Ceramic ball bearings\" /></div><div><figcaption><span><i></i> Some freehubs use ceramic bearings, but most use steel.</span></figcaption><span> <i>CeramicSpeed</i></span></div>\n<p>A freehub will typically turn on its own sealed bearings, and often has inboard and outboard bearings to support the load. That’s in addition to the bearings in the wheel axle, although DT Swiss, for example, moves the right-hand wheel bearing to sit inside the inboard ratchet in its Ratchet EXP hubs, to help shoulder the load.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Hunt 4 Season Aero wheelset review\" title=\"Hunt 4 Season Aero wheelset review\" /></div><div><figcaption><span><i></i> Cartridge bearings are easier to replace than loose bearings.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Most freehubs use replaceable cartridge bearings but some, such as Shimano and Campagnolo, use loose ball bearings sealed within the freehub body.</p>\n<p>Shimano freehubs can be serviced to an extent, but when they’re worn out, you’ll officially need a whole new freehub as they’re not designed to be disassembled, even if it is technically possible. Freehubs from Campagnolo and other brands are easier to service.</p>\n<p>Many wheels will use steel bearings, but more expensive wheels will sometimes use <a href=\"https://www.bikeradar.com/features/ceramic-bearings/\">ceramic bearings</a> for their claimed performance benefits.</p>\n<h2>Freehub vs freewheel</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The bike also came fitted with a White Industries ENO freewheel for those afraid to live #fixiefamous\" title=\"11spd-17th-march-2017-6-_-1489493469297-y0i4ytyn0gy8-3f55447\" /></div><div><figcaption><span><i></i> Freewheels have the ratchet built into the sprocket; here it is shown on a singlespeed.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>You’ll often see freewheels mentioned. A freewheel has its ratchet mechanism built into the set of sprockets, rather than it being part of the wheel’s hub.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Efforts to remove the body of the freewheel proved fruitless\" title=\"get-b-update-3-1525170297136-1x01n3hnsd9id-646e258\" /></div><div><figcaption><span><i></i> Freewheels screw onto the hub unlike cassettes, which slide onto freehub bodies.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The freewheel is screwed onto threads that form a rigid part of the hub using a special tool that meshes with slots in the freewheel’s body.</p>\n<p>Freewheels pre-date freehubs. They’re still found on older bikes and the majority of modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\">singlespeed bikes</a>. They’ve been superseded by the freehub on multi-speed bikes though, because it’s lighter and more compact, so it can handle smaller sprockets and wider gear ranges.</p>\n<p>Freehubs move the bearings further outboard, which reduces the chance of you bending an axle.</p>\n<p>You’re also throwing the ratchet away every time you change a freewheel, but keeping it when you change the cassette on a freehub system.</p>\n<h2>Freehub standards</h2>\n<p>Now we’ve had a look at the internals of the freehub, let’s turn to the outside of the freehub – the part on which your cassette mounts.</p>\n<p>There are many different standards used by the different drivetrain makers – that’s mainly <a href=\"https://www.bikeradar.com/brand/shimano/\">Shimano</a>, <a href=\"https://www.bikeradar.com/brand/sram/\">SRAM</a> and <a href=\"https://www.bikeradar.com/brand/campagnolo/\">Campagnolo</a> – as well as different ones for mountain bike and road bike freehubs.</p>\n<p>Some are inter-compatible but many aren’t, even if they are designed for the same number of sprockets, so understanding what type of freehub you have or need is key when changing a cassette, changing the freehub or buying a new wheelset.</p>\n<h3>Shimano Hyperglide</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"DT Swiss ERC 1400 DICUT wheel\" title=\"DT Swiss ERC 1400 DICUT wheels\" /></div><div><figcaption><span><i></i> Shimano’s Hyperglide is a popular freehub design.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>The most common freehub design is Shimano Hyperglide. It has 9raised splines on the outside of the freehub body that match slots on the cassette sprockets.</p>\n<p>Two of these splines use a different width and spacing from the others, which means that you can’t mount your sprockets the wrong way around or in an incorrect position.</p>\n<p>Modern Hyperglide freehub bodies will fit an 11-speed Shimano/SRAM-compatible cassette for <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">road bike wheels</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"gravel road wheel hub\" title=\"DT Swiss GRC1400 05\" /></div><div><figcaption><span><i></i> Many freehub bodies offer some compatibility between different ‘speeds’.</span></figcaption><span> <i>Warren Rossiter/Immediate Media</i></span></div>\n<p>You can also use Shimano-standard cassettes with 8, 9 or 10  speeds, but will need to fit a 1.85mm spacer on the inboard side of the cassette to fit, plus an additional 1mm spacer for 10-speed cassettes.</p>\n<p>You’ll also need to use a spacer if you want to run an MTB cassette on an 11-speed road freehub, as Shimano/SRAM MTB freehubs are slightly narrower.</p>\n<p>Before 11-speed came along, Hyperglide freehubs were shorter and usually accepted 8, 9 or 10-speed cassettes (though 10-speed cassettes require a spacer). However, certain Shimano wheels and hubs came with 10-speed-only freehubs, which were not backwards-compatible.</p>\n<p>With Shimano’s move to 12-speed in its newest <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9200-review/\">Dura-Ace Di2 R9200</a> groupsets, the components company has updated its Hyperglide freehub design.</p>\n<p>Shimano has reduced the width of the splines but increased the number of them to increase surface area and therefore reduce the chances of sprockets ‘biting’ into the freehub body.</p>\n<p><a href=\"https://www.bikeradar.com/news/shimano-ultegra-di2-r8100/\">Ultegra R8100</a> cassettes use the same 11-speed HG freehub as previous generations.</p>\n<h3>Shimano Micro Spline</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Roval Traverse 29 Alloy mountain bike wheels\" title=\"Roval Traverse 29 Alloy wheels-7\" /></div><div><figcaption><span><i></i> Micro Spline gave Shimano the freedom to use alloy rather than steel for the freehub body.</span></figcaption><span> <i>Alex Evans / Our Media</i></span></div>\n<p>Designed for use with the Japanese brand’s 12-speed MTB cassettes, the <a href=\"https://www.bikeradar.com/features/shimano-decided-to-create-a-freehub-standard/\">Shimano Micro Spline</a> hub has 23 splines which are broadly similar to those on the new 12-speed road freehub.</p>\n<p>However, the Micro Spline design means that cassettes can have a small sprocket of 10 teeth, rather than the 11 teeth smallest sprocket that Hyperglide can accommodate.</p>\n<p>Though they may look similar, Shimano’s new 12-speed Dura-Ace freehubs and Micro Spline are different, and cassettes are not interchangeable across either system.</p>\n<h3>SRAM XD</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Zipp 3ZERO MOTO mountain bike wheelset\" title=\"zipp freehub\" /></div><div><figcaption><span><i></i> XD freehubs are sometimes called ‘XD drivers’.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/features/sram-xd-driver-body-explained/\">SRAM XD</a> system was originally designed to accommodate mountain bike cassettes with a 10-tooth smallest sprocket. It has a shorter body than a normal 11-speed Shimano/SRAM freehub.</p>\n<p>The cassette connects to the freehub with a combination of short splines and a threaded area on the freehub body.</p>\n<p>When fitting a new cassette, you need to ensure that the splines in the cassette mesh with the freehub, then tighten the cassette onto the threads using a standard cassette tool. The design means that there’s no separate lock ring.</p>\n<p>You’ll often hear an XD freehub called an XD driver – it means the same thing.</p>\n<h3>SRAM XDR</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Zipp 30 Course road bicycle wheels\" title=\"Zipp-Course-30-wheels-5\" /></div><div><figcaption><span><i></i> The SRAM XDR freehub is wider than SRAM XD.</span></figcaption><span> <i>Alex Evans / Our Media</i></span></div>\n<p>SRAM’s XDR (XD Road) standard is essentially the same as XD and operates in the same way, but is 1.85mm wider, to accommodate the 12-speed road cassettes in its eTap AXS wireless <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic groupsets</a>.</p>\n<p>Its extra width means that you can fit a SRAM XD MTB cassette to an XDR freehub if you fit a 1.85mm spacer inboard of the cassette. But it means that you can’t fit an XDR cassette to a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-wheels/\">mountain bike wheelset</a> with an XD freehub body.</p>\n<h3>Campagnolo FW</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano and Campagnolo options are available for all the wheels – the freehub clicks quietly\" title=\"1418116001591-1f8mvleup5955-bc553b8\" /></div><div><figcaption><span><i></i> Campagnolo freehub bodies are rarely seen.</span></figcaption><span> <i>Oli Woodman / Our Media</i></span></div>\n<p>A standard Campagnolo freehub is compatible only with Campagnolo cassettes, as it has deeper splines than a Shimano/SRAM freehub body.</p>\n<p>Like Shimano/SRAM, there’s differential spline spacing to ensure that you can only mount the individual cassette sprockets in one position and one orientation. There’s also a different lock ring, incompatible with Shimano’s, used to secure the cassette on the freehub.</p>\n<p>Campagnolo uses a single freehub design for 9-, 10-, 11- and 12-speed cassettes, while the newest N3W freehub also accepts 13-speed cassettes.</p>\n<h3>Campagnolo N3W</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"N3W freehub\" title=\"Campagnolo Ekar groupset\" /></div><div><figcaption><span><i></i> The N3W freehub, pictured, is a shortened version of Campagnolo’s existing road design.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Campagnolo’s latest N3W freehub body standard has been designed for compatibility with the <a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo Ekar</a> gravel bike groupset. It’s 4.4mm shorter than an FW freehub body, so it’s a bit lighter, but has the same pattern of splines.</p>\n<p>The shorter body lets Campagnolo offer 13-speed Ekar cassettes with sprockets down to nine teeth, giving you a really wide range with its 9-36, 9-42 or 10-44 tooth cassette options.</p>\n<p>The good news is that the N3W freehub is backwards-compatible with Campagnolo’s standard road-going cassettes, via an adapter that slots onto the end of the N3W freehub body. Campagnolo says that its wheelsets will in future come with an N3W freehub body as standard.</p>\n<h2>Freehub compatibility</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Halo Vortex MTC Enduro mountain bike wheelset\" title=\"halo freehub\" /></div><div><figcaption><span><i></i> Popping the freehub on and off is nice and easy.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>You’ll see from the above that there are some opportunities to use some freehubs with cassettes for which they weren’t designed, usually using spacers to add the extra width required to fit a narrower cassette to a wider freehub.</p>\n<p>Opportunities to extend a freehub to fit a wider cassette are more limited though, with only the Campagnolo N3W system providing an adaptor to allow this.</p>\n<p>Many <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/\">wheelset</a> makers sell wheels with the option to choose different freehub standards though, so if you know what type of cassette you plan to use, you can buy a compatible wheelset.</p>\n<p>Although some wheelsets only have a single freehub option available, it’s increasingly common to be able to buy a separate freehub to match your wheels and allow you to switch standards.</p>\n<h2>How to service a freehub</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Hunt 4 Season Aero wheelset review\" title=\"Hunt 4 Season Aero wheelset review\" /></div><div><figcaption><span><i></i> Servicing a freehub is more straightforward than it may initially seem.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>We have a dedicated, and detailed, article on <a href=\"https://www.bikeradar.com/advice/workshop/how-to-overhaul-your-freehub/\">how to service a freehub</a>. Although it’s one of the more fiddly bike maintenance tasks, it’s not beyond the capabilities of a home mechanic.</p>\n<p>Some freehubs are designed for tool-free removal from the wheel, while others require specialist tools. DT Swiss’s freehubs need a complete set of different tools to disassemble them, whereas you can get at some others with just a standard set of Allen keys.</p>\n<p>When servicing your freehub, there are usually lots of small parts to keep tabs on, particularly in pawl-based systems, so working systematically and carefully is key.</p>\n<p>You also need to use the right lubrication when you reassemble your freehub. Heavy grease is likely to gum up the internals and could cause your freehub to fail; most hub makers specify their own lightweight lubricants.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"bf7c1e7d7cf29e23454d59d700274b37e6a16e40a4849ffb7bcad310672576f5","category":"Cycling"}