{"title":"Design and evaluation of a pneumatic actuation unit for a wasp-inspired self-propelled needle","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306411","date":1719928800000,"content":"<p>by Jette Bloemberg, Bruce Hoppener, Bram Coolen, Aimée Sakes, Paul Breedveld</p>\r\n\r\nTransperineal laser ablation is a minimally invasive thermo-ablative treatment for prostate cancer that requires the insertion of a needle for accurate optical fiber positioning. Needle insertion in soft tissues may cause tissue motion and deformation, resulting in tissue damage and needle positioning errors. In this study, we present a wasp-inspired self-propelled needle that uses pneumatic actuation to move forward with zero external push force, thus avoiding large tissue motion and deformation. The needle consists of six parallel 0.25-mm diameter Nitinol rods driven by a pneumatic actuation system. The pneumatic actuation system consists of Magnetic Resonance (MR) safe 3D-printed parts and off-the-shelf plastic screws. A self-propelled motion is achieved by advancing the needle segments one by one, followed by retracting them simultaneously. The advancing needle segment has to overcome a cutting and friction force, while the stationary needle segments experience a friction force in the opposite direction. The needle self-propels through the tissue when the friction force of the five stationary needle segments overcomes the sum of the friction and cutting forces of the advancing needle segment. We evaluated the prototype’s performance in 10-wt% gelatin phantoms and <i>ex vivo</i> porcine liver tissue inside a preclinical Magnetic Resonance Imaging (MRI) scanner in terms of the slip ratio of the needle with respect to the phantom or liver tissue. Our results demonstrated that the needle was able to self-propel through the phantom and liver tissue with slip ratios of 0.912–0.955 and 0.88, respectively. The prototype is a promising step toward the development of self-propelled needles for MRI-guided transperineal laser ablation as a method to treat prostate cancer.","author":"Jette Bloemberg","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bf80998969cb24173d2d21ed6362baa1610ee2249e1d5aa73e2ab6d01c731450","category":"Interdisciplinary"}