{"title":"Tour de France 2021 Stage 15 Preview - Andorra's Mountains","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-15-preview-trip-to-andorra","date":1625851109000,"content":"\n      <p><span>The Tour de France hits the big mountains again. The GC riders must be on form if they are to remain in contention, though the breakaway looks likely to win another mountain test. </span></p>\n<p><span>Tadej <span>Pogačar </span>holds supreme control over the Tour de France with over five minutes in hand over the next best rider in the general classification.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b>Tour de France 2021 Guide</b></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/tour-de-france-2021\"><b>Tour de France 2021 articles</b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP15_1024x1024.jpg?v=1625843291\" />Stage 15 profile</span></i></p>\n<p><span>After leaving Céret, the road heads uphill for the first 15km. This gives the breakaway a good chance to form. </span></p>\n<p><span>A short descent carries the riders to kilometre 35. The riders will then crawl uphill for the next 60km, crossing the intermediate sprint in Olette. The first category Montée de Mont-Louis is categorised at 8.4km and 5.7%, though the climb continues past the KOM point at slightly lower gradients for almost 10km.</span></p>\n<p><span>The gruelling effort will come to an end just under 95km into the stage where a long downhill follows. The Col de Puymorens is only second category and 5.8km in length, though again, the lead-in to the ascent takes place on a long false flat which makes the effort more testing. </span></p>\n<p><span>After a brief descent, the Port d'Envalira begins, carrying the Tour de France into Andorra. The ascent is over 10km in length though again, the average gradient doesn’t exceed 6%. Before reaching the peak of the climb, the riders must prepare for the 20km+ descent into the final climb. Although it isn’t the longest of the day, it could well be the most strenuous.</span></p>\n<p><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_ETP15_PROFILS_PARTICULIERS_COL_DE_BEIXALIS_1024x1024.jpg?v=1625843272\" />Col de Beixalis profile</span></em></p>\n<p><span>The Col de Beixalis is 6.4km and averages well over 8%. The second and third kilometres are the most challenging — this 2km spell averages over 11%. Although some demanding percentages follow, this is where the strongest riders could make their move. </span></p>\n<p><span>After cresting the climb, the final 15km sees the riders descend into the capital city of Andorra, Andorre-la-Vieille. The first 10km of the descent are highly technical with plenty of hairpin switchbacks which gives an advantage to the most fearless descenders.</span></p>\n<p><span><span>With over 4,500 metres of climbing, the GC favourites must be on a good day to remain in contention.</span></span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210709TDF1021-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1625843228\" />Image credit: A.S.O./Pauline Ballet</span></i></p>\n<p><span>Stage 15 precedes the second and final rest day, which could encourage the GC teams to be aggressive.</span></p>\n<p><b>Jonas Vingegaard</b><span> was the strongest climber of the GC favourites on Mont Ventoux. The Dane wasn’t able to sustain his advantage on the descent to </span><span>Malaucène, but his show of strength means he will be very closely marked here. Although <span>Primož Roglič</span> has dropped out, Jumbo-Visma still have </span><b>Sepp Kuss </b><span>and </span><b>Wout van Aert</b><span> present. They could act as his primary l<span>ieutenants</span>, or even chase stage victory via the breakaway.</span></p>\n<p><b>Tadej </b><b>Pogačar</b><span> holds over five minutes on the rest and looks in consummate control of the Tour de France. A technical, downhill finish may deter the defending champion from being aggressive. After showing some minor signs of weakness on Mont Ventoux, Pogačar’s main objective here will be ensuring he doesn't concede</span><span> time to any major contenders, rather than increasing his lead further.</span></p>\n<p><b>Rigoberto Urán, Richard Carapaz </b><span>and </span><b>Wilco Kelderman</b><span> are the other GC contenders to look out for.</span></p>\n<p><span>Considering </span><span>Pogačar’s major lead at the top, UAE Team Emirates will be leaned on to control the breakaway throughout. On a stage which features so much ascending, this task will be very difficult to carry out within a single team. This gives the breakaway another great chance of winning a mountain stage.</span></p>\n<p><span>Team BikeExchange had a disastrous stage 13, where Simon Yates and Lucas Hamilton were forced to abandon the Tour de France. BikeExchange are depleted, but still boast </span><b>Esteban Chaves </b><span>in their squad. The Colombian is a talented climber and as he has dropped away from GC contention, he is free to join the breakaway where he can chase stage victory.</span></p>\n<p><span>EF Education - Nippo are supporting </span><b>Rigoberto </b><b>Urán </b><span>who has had a fine Tour de France so far. However, they are still looking for a stage victory and joining the breakaway is their best chance of achieving that. </span><b>Ruben Guerreiro </b><span>and </span><b>Sergio Higuita</b><span> are both very talented climbers. Crucially, they can both descend very well too, which will be pivotal in the final 15km. </span></p>\n<p><span>The other breakaway candidates with a chance include </span><b>David Gaudu, Dylan Teuns, Ion Izagirre, Nairo Quintana, Mike Woods </b><span>and </span><b>Patrick Konrad. </b></p>\n<p><i><span>Cover image: <span>A.S.O./Charly Lopez</span></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"bf8bcdb2af74c5375bf213186bd8e811f0900eb3d00aacbeded85b55b72a7c26","category":"Cycling"}