{"title":"Maintenance of species boundaries amid hybridization in two island gingers with similar ecological niches","link":"https://academic.oup.com/evolut/article/78/3/526/7502711?rss=1","date":1703635200000,"content":"<span><div>Abstract</div>Understanding species boundaries maintenance in the face of hybridization/introgression is an intriguing yet complex topic in evolutionary biology. The underlying mechanisms, however, remain elusive. To address this, we propose to investigate the role of climatic shifts in shaping genetic structure and influencing species boundaries. We combine multilocus genetic data and species distribution modeling to explore how past and current climatic shifts affect the genetic structure and demographic history of two Taiwan endemic gingers, <span>Zingiber pleiostachyum</span> and <span>Z. shuanglongense</span>. We identified a well-delimited genetic structure with evidence of admixture, indicating incomplete reproductive isolation between the two gingers. This is likely due to secondary contact and range overlap during the last glacial maximum, leading to sporadic instances of hybridization. Niche overlap tests based on climate and soil data indicate that these two gingers occupy similar but nonidentical ecological niches. Furthermore, we found that the considerable differences in their current geographic distribution and altitude preferences might have resulted from different seed dispersal capabilities and competitive exclusion due to their similar niche preferences. Our results reveal a model where altitudinal differentiation and dispersal strategy synergistically reinforce the species divergence, thereby illuminating the importance of these factors in shaping and maintaining the island’s biodiversity.</span>","author":"","siteTitle":"Evolution Current Issue","siteHash":"a2040112c8b98efe6d76767c53ee42b7ea8ce26086ad99269623cfcce66a3405","entryHash":"bf8dc68cb9c6cd390a023679ca2482e03baaf23c8af2146b1ab8efd94b2e1412","category":"Environment"}