{"title":"Assessment of Groundwater Storage Depletion using GRACE and Land Surface Models in Mzimba District, North Malawi","link":"https://www.preprints.org/manuscript/202406.0149/v1","date":1717497237000,"content":"Climate change and over-exploitation are imposing unprecedented threats to the groundwater resource. Globally, groundwater reserves have depleted to the extent that well yield have decreased, pumping cost have risen, and land have irreversibly subsided. In Malawi, groundwater quantity is a national problem, specifically in Mzimba district due to severe droughts. In this study, the spatial and temporal trends of groundwater depletion was assessed using Gravity Recovery and Climate Experiment (GRACE) data and Land Surface Models (LSM) from Global Land Data Assimilation System (GLDAS) and Global Surface Water Explorer (GSWE). The results show that 1. Groundwater storage is depleting at an average rate of-1.0 ± 0.06 cm yr-1(0.1043 km3yr-1) in the study area with high rate of up to -1.2 cm yr-1(0.12516 km3 yr-1) in the western side and as low as –0.4 cm yr-1(0.04172 km3 yr-1) in the eastern part. 2. Groundwater storage increases from -13 cm in November up to 15 cm between May and April. 3. Drought is the primary cause of such depletion trends with correlation between active evapotranspiration and groundwater depletion, and downward surface shortwave radiation and groundwater depletion, at -0.577 and -0.678 respectively. The results from the study reveals the need for the scientific community and the general public to consider groundwater recharge strategies specifically by mitigating climate change to reduce prolonged droughts. The study suggests the need to establish a stand-alone groundwater assessment and monitoring authority for enhanced conservation efforts of the water resource in the country.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bf8f9758759f0ca9a5335314b7f45956404b8d4077cd4a3d0c1ae9d84de646f9","category":"Interdisciplinary"}