{"title":"Riot Games เผยความคืบหน้า Project L เกมไฟติ้งในจักรวาล League of Legends","link":"https://www.blognone.com/node/125946","date":1637572414000,"content":"<div><div><div><p>เมื่อปี 2019 <a href=\"https://www.blognone.com/node/112613\">Riot Games ผู้สร้าง League of Legends เปิดตัวเกมใหม่หลายเกมพร้อมกัน</a> โดยใช้โค้ดเนมว่า \"Project\" ตามด้วยตัวอักษรต่างๆ ซึ่งเกมหนึ่งในนั้นคือ <a href=\"https://www.blognone.com/node/114961\">Project A กลายมาเป็นเกม Valorant</a> และประสบความสำเร็จไม่น้อย</p>\n<p>เกมที่เหลือที่เปิดตัวพร้อมกันคือ \"Project L\" เกมไฟติ้งที่ใช้ตัวละครจาก League of Legends กลับเงียบหายไปนานหลายปี ซึ่งล่าสุด Riot Games ออกมาอัพเดตความคืบหน้าของเกม พร้อมโชว์ตัวอย่างใหม่แล้ว (อีกเกมคือ Project F เป็นแนว action RPG ยังไม่มีความเคลื่อนไหว)</p>\n<p>คำอธิบายของ Riot Games คือใช้เวลาค้นคว้าอยู่นานเพื่อหา \"แนวทางที่ใช่\" เพราะโจทย์ของบริษัทคือสร้างเกมไฟติ้งที่เล่นได้นานหลายปี หรืออาจเป็นสิบปีเลยด้วยซ้ำ จึงต้องลงทุนเรื่องเวลานานเพื่อหารูปแบบของเกมที่คิดว่าเวิร์คที่สุด</p>\n<p>ข้อมูลคร่าวๆ ของ Project L คือเป็นเกมไฟติ้งแบบแท็กทีม 2 ตัวละคร (เหมือนเกม Tekken Tag Tournament หรือซีรีส์ Marvel ของ Capcom) แนวทางการควบคุมจะยึดหลัก \"เรียนรู้ง่าย แต่เก่งได้ยาก\" (easy to learn, hard to master) ส่วนตัวละครจะนำมาจาก League of Legends แต่ปรับท่าไม้ตายให้เหมาะกับเกมไฟติ้งมากขึ้น (งานภาพก็ปรับจากเวอร์ชันเก่าเล็กน้อย ให้เป็น cell-shade แบบตัดเส้นขอบตัวละครมากขึ้น)</p>\n<p>ประเด็นอื่นที่ Riot พูดถึงคือระบบการเล่นมัลติเพลเยอร์ ที่บริษัทลงทุนกับเทคโนโลยีเครือข่ายให้ตอบสนองได้ดีและเป็นธรรมกับผู้เล่นทั้งสองฝ่าย บริษัทระบุว่าใช้เทคโนโลยีที่ทีมวิจัยกลางสร้างขึ้นมาสำหรับเกมอื่นๆ ของ Riot ด้วย และในการเล่นทดสอบ ทีมงานก็เล่นกันผ่านเครือข่ายเป็นปกติด้วย</p>\n<p>Riot ออกตัวว่าเกมเพลย์ที่นำมาโชว์ยังเป็นแค่ส่วนหนึ่งของเกมเท่านั้น (ภาษาในวงการเรียก vertical slice) ยังต้องใช้เวลาอีกนานกว่าพัฒนาเป็นเกมเต็มรูปแบบ ซึ่ง Riot ยืนยันแล้วว่าออกไม่ทันปี 2022 แน่นอน แต่ก็ยังไม่ระบุว่าจะเป็นปีไหน (2023 หรือ 2024) และสัญญาว่าจะมาอัพเดตความคืบหน้าอีกรอบในช่วงครึ่งหลังของปี 2022</p>\n<p>ที่มา - <a href=\"https://www.riotgames.com/en/news/project-l-dev-finding-our-game\">Riot Games</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/league-legends\">League of Legends</a></div><div><a href=\"/topics/riot-games\">Riot Games</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"bf8faaa42bc83cf7ffaf5fc62edd4d2bdf8d63b81c46214d5f92e9a9b476400a","category":"Thai"}