{"title":"A novel anthocyanin indicator film with rosmarinic acid copigmentation having enhanced stability and pH indicator ability for monitoring pork freshness","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13148?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Anthocyanin-based pH-sensing films have been widely fabricated for potential application in monitoring food freshness. However, the color fading of anthocyanins limits their application for the food industry due to their low stability. In addition, the color sensitivity and pH indicator ability of anthocyanin-based films currently available are not satisfied and need to be improved.</p>\n<h2>RESULTS</h2>\n<p>Chitosan/xanthan gum (CX)-based colorimetric films with addition of purple cabbage anthocyanin (PAN) and different amounts of rosmarinic acid (RA) were fabricated. RA copigmentation in chitosan/xanthan gum–purple cabbage anthocyanin–rosmarinic acid (CX-P-RA) films significantly improved the stability and pH response sensitivity of PAN, and the combined copigmentation of RA and xanthan gum exhibited an additive effect. The addition of RA significantly improved the tensile strength and elongation at break, thermal stability, antioxidant and antibacterial activities of CX-P-RA films. Moreover, addition of RA enhanced the pH sensitivity and colorimetry of CX-P-RA films, which exhibited a good response to different pH values. CX-P-RA2 film was tested to monitor the freshness of pork. It showed visible color changes during the storage of pork. In addition, the ∆<i>E</i> of CX-P-RA2 film was highly correlated with changes in total volatile basic nitrogen in pork (<i>R</i>\n<sup>2</sup> = 0.951).</p>\n<h2>CONCLUSION</h2>\n<p>These results indicated that CX-P-RA2 film can be used as a pH-sensing indicator with good stability and high sensitivity for real-time monitoring of pork freshness. © 2023 Society of Chemical Industry.</p>","author":"Min Lu, \nYing Cai, \nXiaoe Chen, \nYangguang Wang, \nGaofeng Yuan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"bf9dc0e9cf229303d09a2bea693228df75ceea3e32c23b4bcc138ee1813bf8e4","category":"Environment"}