{"title":"Α {Silk@Gallic‐Acid} hybrid material with controllable antioxidant hydrogen‐atom‐transfer activity","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400043?af=R","date":1719811573000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b7702b39-5c17-409d-919c-eca3b8b27ab4/appl202400043-gra-0001-m.png\" alt=\"Α {Silk@Gallic-Acid} hybrid material with controllable antioxidant hydrogen-atom-transfer activity\" /><p>A silk@gallic acid hybrid material was synthesized and fully characterized. It shows antioxidant activity and long-term reusability. It is demonstrated SFd@GA can be employed for at least 15 cycles retaining up to 98% of its HAT efficiency.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Silk fiber, often acclaimed as the pinnacle of textile materials, finds contemporary applications in the textile industry, health, and cosmetics. Gallic acid (GA) is a well-established natural antioxidant. In the present study, a novel hybrid material SFd@GA was conceptualized and produced via surface grafting of GA onto degummed silk-fibers (SFd). Successful covalent-grafting of gallic acid onto the silk fabric surface was confirmed through Fourier-transform infrared, Raman, thermogravimetric analysis (TG-DTA), and scanning electron microscopy (SEM). electron paramagnetic resonance spectroscopy demonstrates that gallic moieties grafted on SFd@GA retain their radical/redox activity. The antioxidant capacity of the hybrid material SFd@GA was validated by quantitative analysis of antioxidant hydrogen-atom-transfer (HAT) to DPPH radicals. Our data reveal a 550% increase in antioxidant-HAT activity of SFd@GA versus natural intact silk fiber, and a 1400% increase in antioxidant-HAT activity compared to the degummed silk fiber. The paramount discovery of the present work lies in the capacity for repeated utilization of the hybrid material SFd@GA, without any discernible compromise in its antioxidant-HAT activity. Specifically, we show that SFd@GA can be employed for at least 15 consecutive cycles, retaining &gt;98% of its HAT efficiency, for up to many days of storage under ambient conditions. We discuss this expositional performance via the controllable Hat-activity process that we propose.</p>","author":"Annita Theofanous, \nYiannis Deligiannakis, \nMaria Louloudi","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"bf9ed49144691a2a33cb76a4c67c525164ba6eff23769bb680556c549c60a2b5","category":"Environment"}