{"title":"The Hyundai Ioniq 5 is the best EV we drove in 2021","link":"https://arstechnica.com/?p=1821361","date":1639717310000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/2022-Hyundai-Ioniq-listing-800x600.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/2022-Hyundai-Ioniq-listing.jpg\">Enlarge</a> <span>/</span> Hyundai's striking new Ioniq 5 EV was worth the wait. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Hyundai provided flights to San Diego and two nights in a hotel so we could drive the Ioniq 5. Ars does not accept paid editorial content.</aside>\n<p>SAN DIEGO—In 2020, Hyundai Motor Group revealed that it had developed a new platform built <a href=\"https://arstechnica.com/cars/2020/12/everything-we-know-about-hyundai-and-kias-new-electric-vehicle-platform/\">solely for battery electric vehicles</a>. The company's smaller, earlier EVs have gotten impressively close to Tesla levels of powertrain efficiency, and these days, the Korean automaker is at the head of the class in terms of quality and reliability.</p>\n<p>So the excitement was palpable when we learned that this new \"Electric-Global Modular Platform\" (or E-GMP) was intended for larger, more powerful EVs with either rear- or all-wheel drive. The platform would use an 800 V electrical architecture and would provide 18-minute fast-charging and the ability to power AC devices. The anticipation only grew when we got our first look at the Hyundai Ioniq 5—the first of those EVs—<a href=\"https://arstechnica.com/cars/2021/02/this-crisp-looking-crossover-is-hyundais-next-ev-the-ioniq-5/\">back in February</a>.</p>\n<p>In fact, if I had been paying more attention at the 2019 Frankfurt Auto Show, I would have seen the Ioniq 5, barely disguised as a concept called the \"45.\" The design team, led by SangYup Lee, channeled some of Giorgetto Giugiaro's angular and boxy energy into the Ioniq 5's proportions. The 45 concept was meant to pay homage to a 1974 concept that Giugiaro created for the Korean brand, but to my eyes, it's more reminiscent of a 1980s Lancia Delta, except scaled up by 19 percent.</p></div><p><a href=\"https://arstechnica.com/?p=1821361#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821361&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bf9fcf7674ebb3df018663d183328c342a17186c387baa1216bc0c5fa47ad30b","category":"Tech"}