{"title":"Standard metrics for characterizing episodic salinization in freshwater systems","link":"https://onlinelibrary.wiley.com/doi/10.1002/lom3.10629?af=R","date":1719488303000,"content":"<h2>Abstract</h2>\n<p>Salinization threatens freshwater resources and freshwater-dependent wetlands in coastal areas worldwide. Many research efforts focus on gradual or chronic salinization, but the phenomenon is also episodic in nature, particularly in small streams and artificial waterways. In surface waters, salinization events may coincide with storms, droughts, wind tides, and other episodic events. A lack of standardized quantitative methods and metrics for describing and discussing episodic salinization hinders cross-disciplinary efforts by scientists and others to analyze, discuss, and make recommendations concerning these events. Here, we present a set of metrics that use statistics which describe flow characteristics in rivers and streams as a template for empirically describing and characterizing salinization events. We developed a set of metrics to quantify the duration, magnitude, and other characteristics of episodic salinization, and we apply the metrics to extensive time-series data from a field site in coastal North Carolina. We then demonstrate the utility of these metrics by coupling them with ancillary data to perform an unsupervised classification that groups individual salinization events by their primary meteorological driver. We provide simple and flexible code needed to compute metrics in any environment experiencing salinization events in hopes that it will facilitate more standardized approaches to the quantification and study of widespread freshwater salinization.</p>","author":"J. A. Neville, \nR. E. Emanuel, \nN. G. Nelson, \nE. S. Bernhardt, \nM. Ardón","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"bfa35c4a2cd608be25c5e196e7ed3307237fa732026828dfde5b62126ab2ace3","category":"Environment"}