{"title":"Dietary lipid affects growth, feed utilization, liver histology and physiological biochemistry of juvenile Yangtze sturgeon, Acipenser dabryanus, an endangered sturgeon in the Yangtze River","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16063?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>The supply of a balanced portion of nutrition is vital for the success of the restocking program of the Yangtze sturgeon, an endangered sturgeon in the Yangtze River, however, knowledge of the nutritional requirement of this endangered species is scarce. The present study was performed to investigate the optimum dietary lipid requirement of the Yangtze sturgeon juveniles (initial weight, 184.24 ± 6.79 g). Five isonitrogenous diets containing a mixture of fish oil and soybean oil (1:1 ratio) at five different levels (35, 63, 90, 124 and 168 g/kg) were prepared and each prescribed diet was hand-fed to triplicate groups of fish for 50 days. Results showed that feed intake of fish was not affected, but growth and feed utilization rate increased and then declined with the increment of dietary lipid content. Similar trends were observed for the activities of enzymes involved in lipid digestion and metabolism. The lipid content of fish dorsal muscle and liver together with serum triglyceride content was linearly elevated with increasing inclusion of dietary lipid. The inclusion of 12.4% dietary lipid significantly reduced the content of deamination product ammonia in serum. Excessive lipid intake caused noticeable hepatocellular vacuolation as shown by histological staining. Based on the regression analysis between growth response and dietary lipid levels, the optimum dietary lipid level of juvenile Yangtze sturgeon was estimated to be 141.67 g/kg diet.</p>","author":"Qingfei Li, \nHuantao Qu, \nYacheng Hu, \nJingshu Wang, \nYuanjin Yang","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"bfa78e143478a39abfdc2e030aaabcf1addfefe3113459c6c5fba7198ae6791e","category":"Environment"}