{"title":"Phase 1 randomized trials to assess safety, pharmacokinetics, and vaginal bleeding associated with use of extended duration dapivirine and levonorgestrel vaginal rings","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304552","date":1717596000000,"content":"<p>by Sharon L. Achilles, Clifton W. Kelly, Craig J. Hoesley, Diana L. Blithe, Jill Brown, Barbra A. Richardson, Brid Devlin, Craig W. Hendrix, Samuel M. Poloyac, Mark A. Marzinke, Holly Gundacker, Devika Singh, Jeanna M. Piper, Sherri Johnson, John Steytler, Beatrice A. Chen, on behalf of the MTN-030/IPM 041 and MTN-044/IPM 053/CCN019 Protocol Teams for the Microbicide Trials Network and the Contraceptive Clinical Trials Network </p>\r\nBackground <p>Vaginal rings formulated to deliver two drugs simultaneously have potential as user-controlled, long-acting methods for dual prevention of HIV and pregnancy.</p> Methods <p>Two phase 1 randomized trials (MTN-030/IPM 041 and MTN-044/IPM 053/CCN019) respectively enrolled 24 and 25 healthy, HIV-negative participants to evaluate safety, pharmacokinetics, and vaginal bleeding associated with use of a vaginal ring containing 200mg dapivirine (DPV) and 320mg levonorgestrel (LNG) designed for 90-day use. MTN-030/IPM 041 compared the DPV/LNG ring to a DPV-only ring (200mg) over 14 days of use. MTN-044/IPM 053/CCN019 compared continuous or cyclic use of the DPV/LNG ring over 90 days of use. Safety was assessed by recording adverse events (AEs). DPV and LNG concentrations were quantified in plasma, cervicovaginal fluid, and cervical tissue. Vaginal bleeding was self-reported.</p> Results <p>There were no differences in the proportion of participants with grade ≥2 genitourinary AEs or grade ≥3 AEs with DPV/LNG ring vs. DPV ring use (p = .22), or with DPV/LNG ring continuous vs. cyclic use (p = .67). Higher plasma DPV concentrations were observed in users of DPV/LNG compared to DPV-only rings (C<sub>max</sub> p = 0.049; AUC p = 0.091). Plasma DPV and LNG concentrations were comparable with continuous and cyclic use (C<sub>max</sub> p = 0.74; AUC p = 0.25). With cyclic use, median nadir plasma DPV concentration was approximately 300 pg/mL two days after removal and median t<sub>1/2</sub> for cervicovaginal fluid DPV concentration was 5.76 hours (n = 3). Overall bleeding experiences did not differ between continuous and cyclic users (p = 0.12).</p> Conclusions <p>The extended duration DPV/ LNG rings were well tolerated and the observed DPV concentrations in plasma and cervicovaginal fluid when used continuously exceeded concentrations observed in previous DPV ring efficacy studies. LNG concentrations in plasma were comparable with other efficacious LNG-based contraceptives. Genital DPV concentrations had a short half-life and were thus not well sustained following ring removal.</p>","author":"Sharon L. Achilles","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bfa8612ab7311ed3450f510724959ddbdc66a208bda9d131d694f84cf0bcf8a0","category":"Interdisciplinary"}