{"title":"Dirty bike lanes broke Houston’s new street sweeper, Colorado e-bike rebates, and more – Urbanist Update","link":"https://www.cyclingtips.com/2023/05/urbanist-update-e-bike-rebates/","date":1683735767000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-subsizided-street-parking.jpg?width=1200\" alt=\"Dirty bike lanes broke Houston's new street sweeper, Colorado e-bike rebates, and more – Urbanist Update\" /></figure><p><i>Welcome to the <a href=\"http://cyclingtips.com/tag/urbanist-update\" target=\"_blank\">Urbanist Update</a>. My job here might be as tech editor, but I’ve also spent tons of time studying transportation, city planning, and engineering. Here are some of the things I’ve found interesting over the past week related to biking in cities, cycling infrastructure, and urbanism.</i></p>\n<p><i>What is urbanism? In short, it is the study of how the inhabitants of an urban area interact with their towns and cities. If you care about building sustainable communities that let you live a happy and healthy life, then this is the spot for you. <a href=\"https://www.cyclingtips.com/tag/urbanist-update/\" target=\"_blank\">See previous Updates here</a>.</i></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-paris-bike-lanes.jpg?width=730\" alt=\"Urbanist Update paris bike lanes\" width=\"1024\" height=\"668\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-paris-bike-lanes.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-paris-bike-lanes.jpg?width=190 190w\" /><figcaption><span>(Photo: LUDOVIC MARIN / AFP via Getty Images)</span></figcaption></figure>\n<h2><span>Bike plan: the government announces an investment of 2 billion euros by 2027</span></h2>\n<p><span>The French government is set to spend two billion euros ($2.2 billion) through 2027 in a multi-faceted plan to not only improve cycling infrastructure in the country but boost cycling through the country. </span></p>\n<p><span>Here are the exact numbers from a story </span><a href=\"https://www.lemonde.fr/societe/article/2023/05/04/plan-velo-le-gouvernement-annonce-un-investissement-de-2-milliards-d-euros-d-ici-a-2027_6172122_3224.html\"><span>first shared by Le Monde</span></a><span>. They’re hoping to add 30,000 km (around 18,600 miles) of bike lanes with an emphasis on provincial cities and rural areas for a total of 80,000 km (49,700 miles) of safe bike lanes and paths. A quarter of the budget will go toward bicycle purchasing subsidies, both for new and second-hand bikes. </span></p>\n<p><span>Money will also go toward equipping 100 percent of its state sites with secure bicycle parking in nearly 90,000 secure locations. Funds will also be apportioned for new programs with the goal of training children aged 6 to 11 on bicycle riding etiquette and technique. </span></p>\n<p><span>Further, the plan aims to add “footrests at the edge of the road to allow cyclists to stop at traffic lights without having to get off the saddle.” Sounds like a dream.</span></p>\n<p><span>Oh, and the United States?</span><a href=\"https://www.nytimes.com/2023/05/08/us/politics/biden-mccarthy-debt-limit-meeting.html\"><span> It’s expected to run out of cash if the debt ceiling isn’t raised any further</span></a><span>. So cool.</span></p>\n<figure>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-Houston-Street-Sweeper.webp?width=730\" alt=\"Urbanist Update Houston Street Sweeper\" width=\"1366\" height=\"768\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-Houston-Street-Sweeper.webp?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-Houston-Street-Sweeper.webp?width=190 190w\" /><figcaption><span>(Photo: Houston Public Works)</span></figcaption></figure>\n</figure>\n<h2><span>‘Space City Sweeper,’ tasked with cleaning Houston’s bike lanes, back on streets after becoming clogged with debris</span></h2>\n<p>Most separated bike lanes require a miniature street sweeper to pick up glass and debris from the lanes and pathways. Houston purchased their first mini street sweeper last year and dubbed it the ‘Space City Sweeper’ by a community naming contest. <a href=\"https://www.houstonpublicmedia.org/articles/news/houston/2023/05/08/451087/houston-bike-lane-sweeper-clogged-debris/\" target=\"_blank\">Houston Public Media reports</a> the sweeper, which cost nearly $150,000, broke down after just nine service orders.</p>\n<p>Why’s that? The sweeper encountered heavy debris and malfunctioned. Translation: Houston bike lanes were so dirty that they broke the purpose-built street sweeper.</p>\n<p>There are a number of ways separated bike lanes, multi-use paths, and pedestrian islands can and should be maintained. Sweeping debris, salting them after a snowfall, and generally maintaining them just as one would any other road is essential for mass adoption.</p>\n<p>Cities that receive heavy snowfall, like Madison, WI, Minneapolis, MN, and Salt Lake City, UT all ensure that bike lane maintenance is prioritized and coordinated between agencies. This needs to be the case everywhere, even in places like Houston. Fortunately, the city looks like they’re learning and adapting.</p>\n<p>Bike lanes are cool. We need more of them. But cities also need to maintain them just as they would any other road, they just need the popular support to find the money to make it happen. I certainly wouldn’t want Space City Sweeper to have any more issues.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-subsizided-street-parking.jpg?width=730\" alt=\"Urbanist-Update-subsizided-street-parking\" width=\"1024\" height=\"685\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-subsizided-street-parking.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-subsizided-street-parking.jpg?width=190 190w\" /><figcaption><span>(Photo: Qian Weizhong/VCG via Getty Images)</span></figcaption></figure>\n<h2><span>Why free street parking could be costing you hundreds more in rent</span></h2>\n<p><span>Your city likely has something called parking minimums. If you’re driving a car regularly, these parking spaces make parking your car easy. But if there’s no car in those parking spots, you’re left with slabs of concrete and asphalt that could be used for housing, public space, or anything else. Worse yet, those parking spaces aren’t free: you’re paying more than you think for them.</span></p>\n<p><span>The </span><a href=\"https://www.washingtonpost.com/climate-environment/2023/05/02/eliminating-parking-minimums-liveable-cities/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWJpZCI6IjI3NzM0NTA4IiwicmVhc29uIjoiZ2lmdCIsIm5iZiI6MTY4MzI1OTIwMCwiaXNzIjoic3Vic2NyaXB0aW9ucyIsImV4cCI6MTY4NDU1NTE5OSwiaWF0IjoxNjgzMjU5MjAwLCJqdGkiOiIzMTNmN2E1Yi1jOTE5LTRkMDgtYTEzYS1jMTZiMDJiNTFiZmQiLCJ1cmwiOiJodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vY2xpbWF0ZS1lbnZpcm9ubWVudC8yMDIzLzA1LzAyL2VsaW1pbmF0aW5nLXBhcmtpbmctbWluaW11bXMtbGl2ZWFibGUtY2l0aWVzLyJ9.ytbL-Ywlpwzyz7gcaZbV6Q93yEX9zIlu5qulJuBBVW8\"><span>Washington Post</span></a><span> recently put out a story that outlines just how much parking spaces cost. A Seattle-area study adds about $246 to each apartment’s monthly rent regardless of whether or not you own a car. </span><a href=\"https://www.mba.org/news-and-research/research-and-economics/research-institute-for-housing-america\"><span>Another study by the Mortgage Bankers Association</span></a><span> says parking spaces outnumber people in Seattle by over two to one.</span></p>\n<p><span>Think about how much adding in parking costs developers, who need to account for parking minimums either with street parking or by including their own parking into their lots. </span><span>Those extra costs might not make building housing feasible, particularly in already-dense areas, and they take away from the flexibility that developers, homeowners, and business owners deserve. </span></p>\n<p><span>More housing and businesses in the same space means denser neighborhoods, fewer heat islands, and fewer cars. All of the above makes riding a bike for utility that much easier.</span></p>\n<p><span>I want to make clear that I’m not calling this the end-all solution. Smart transit planning and even smarter human-centric street design must happen in conjunction so people can still get around easily. People are still going to drive around, but we must make alternatives available to more people at a better price point. Getting rid of parking minimums is a good place to start.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-e-bike-rebate-in-colorado.jpg?width=730\" alt=\"Urbanist-Update-e-bike-rebate-in-colorado\" width=\"1024\" height=\"700\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-e-bike-rebate-in-colorado.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Urbanist-Update-e-bike-rebate-in-colorado.jpg?width=190 190w\" /><figcaption><span>(Photo: RJ Sangosti/MediaNews Group/The Denver Post via Getty Images)</span></figcaption></figure>\n<h2><span>Denver proved the power of e-bike rebates. Now, the discounts are going statewide</span></h2>\n<p><span>If you live in the Denver, Colorado area, you’ve probably heard of the e-bike rebate pilot program launched last year. And as it turns out, soon every Coloradoan could receive a $450 tax rebate on an e-bike beginning in 2024. </span></p>\n<p><a href=\"https://www.cpr.org/2023/05/04/colorado-e-bike-rebates-bill/\" target=\"_blank\"><span>The story </span></a><span><a href=\"https://www.cpr.org/2023/05/04/colorado-e-bike-rebates-bill/\">reported by Colorado Public Radio</a> estimates that the program would cost the state around $100 million before it expires in 2033. This number feels high, though the $450 number feels about average when compared to the incentives other North American cities offer up according to the </span><a href=\"https://docs.google.com/spreadsheets/d/1C-sYcwLrQFsr8r2A6RiAP2RwGsBNwr1BKOF_HJvCsVU/edit#gid=0\"><span>Portland State TREC</span></a><span>. Here’s the kicker, though: this rebate isn’t means-tested and anyone can apply for the rebate regardless of income. Further, the legislation doesn’t restrict combining the rebate with other existing e-bike rebates. </span></p>\n<p><span>This is the most comprehensive statewide rebate I’ve seen anywhere. Rachel Hultin, the acting policy director with Bicycle Colorado, hopes it will lead to people pushing for more bike paths and bike lanes. I personally hope that Colorado cities anticipate the opportunity and build more bike paths that incentivize people to get out of their cars and into bicycles. </span></p>\n<p><a href=\"https://streetsblog.libsyn.com/episode-430-e-bikes-to-freedom\"><span>And if you want to listen to how Denver has reacted to the city’s e-bike rebate program</span></a><span>, the ever-timely Talking Headways podcast interviewed Mike Salisbury of Denver’s Office of Climate Action for exactly that reason.</span></p>\n<blockquote>\n<section><a href=\"https://www.tiktok.com/@colemanbar?refer=embed\" target=\"_blank\">@colemanbar</a> Always wear your helmet. Resources linked below ↓ https://www.nyc.gov/html/dot/html/bicyclists/bikemaps.shtml https://www.nycbikemaps.com/ <a href=\"https://www.tiktok.com/tag/biketok?refer=embed\" target=\"_blank\">#biketok</a> <a href=\"https://www.tiktok.com/tag/biking?refer=embed\" target=\"_blank\">#biking</a> <a href=\"https://www.tiktok.com/tag/nyc?refer=embed\" target=\"_blank\">#nyc</a> <a href=\"https://www.tiktok.com/tag/bikelane?refer=embed\" target=\"_blank\">#bikelane</a> <a href=\"https://www.tiktok.com/tag/bikesafety?refer=embed\" target=\"_blank\">#bikesafety</a> <a href=\"https://www.tiktok.com/tag/fyp?refer=embed\" target=\"_blank\">#fyp</a> <a href=\"https://www.tiktok.com/music/Lofi-Hip-Hop-6823187068915550209?refer=embed\" target=\"_blank\">♬ Lofi Hip Hop – HipHopBeatster &amp; LOFI RADIO &amp; Chill Hip Hop</a></section>\n</blockquote>\n<p></p>\n<h2><span>Introducing a usability score for bike lanes in New York City</span></h2>\n<p><span>New York City has a fast-growing network of usable bike lanes, and TikTok account @<a href=\"https://www.tiktok.com/@colemanbar\" target=\"_blank\">colemanbar</a> has started rating each bike lane in the city.</span></p>\n<p><span>Bike lanes are scored on three criteria: convenience, condition, and safety receiving a triple score to show how important that is. Top-scoring lanes can receive a total of 50 possible points. </span></p>\n<p><span>One could argue that this type of scoring is subjective, but this scoring of 1st Avenue (and 2nd Avenue in conjunction) in Manhattan is pretty spot on with my experiences using it. Bike-specific signals are great as are lanes protected, and protected lanes provide plenty of space between people getting out of cars and people biking.</span></p>\n<p><span>I particularly like this example as it shows the effectiveness of a bike lane that not only spans 6 miles (10 km), but thoughtfully connects different parts of the city in a way that makes going from the Lower East Side to Harlem fairly simple. It isn’t enough for a city to just plop down bike lanes where convenient; bike lanes should connect whole neighborhoods and mirror travel habits.</span></p>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bfafc7a6b3f588fc0aa96ddf6981da1bf491f05cf8b5ffa3af7b3043c9b62e8e","category":"Cycling"}