{"title":"Unique photosynthetic strategies employed by closely related Breviolum minutum strains under rapid short-term cumulative heat stress","link":"https://academic.oup.com/jxb/article/75/13/4005/7651021?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>The thermal tolerance of symbiodiniacean photo-endosymbionts largely underpins the thermal bleaching resilience of their cnidarian hosts such as corals and the coral model <span>Exaiptasia diaphana</span>. While variation in thermal tolerance between species is well documented, variation between conspecific strains is understudied. We compared the thermal tolerance of three closely related strains of <span>Breviolum minutum</span> represented by two internal transcribed spacer region 2 profiles (one strain B1–B1o–B1g–B1p and the other two strains B1–B1a–B1b–B1g) and differences in photochemical and non-photochemical quenching, de-epoxidation state of photopigments, and accumulation of reactive oxygen species under rapid short-term cumulative temperature stress (26–40 °C). We found that <span>B. minutum</span> strains employ distinct photoprotective strategies, resulting in different upper thermal tolerances. We provide evidence for previously unknown interdependencies between thermal tolerance traits and photoprotective mechanisms that include a delicate balancing of excitation energy and its dissipation through fast relaxing and state transition components of non-photochemical quenching. The more thermally tolerant <span>B. minutum</span> strain (B1–B1o–B1g–B1p) exhibited an enhanced de-epoxidation that is strongly linked to the thylakoid membrane melting point and possibly membrane rigidification minimizing oxidative damage. This study provides an in-depth understanding of photoprotective mechanisms underpinning thermal tolerance in closely related strains of <span>B. minutum</span>.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"bfb1e1123eff768864eb5b03536103b1359d50a9266daf3bdfee28b4ca960cda","category":"Environment"}