{"title":"Consumption patterns and factors associated with inappropriate prescribing of benzodiazepines in Primary Health Care settings","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309984","date":1725458400000,"content":"<p>by Maria Olívia Barboza Zanetti, Iara dos Santos, Júlia Casanova Durante, Fabiana Rossi Varallo, Leonardo Régis Leira Pereira, Adriana Inocenti Miasso</p>\r\nBackground <p>Benzodiazepines are frequently prescribed to treat anxiety and insomnia, but long-term use has been associated with the development of dependence, tolerance, and cognitive decline, especially among older adults. This study aimed to investigate the pattern of consumption and factors associated with inappropriate prescribing of benzodiazepines in primary health care.</p> Methods <p>This is a cross-sectional analytical study, using dispensing records of diazepam, clonazepam, and nitrazepam from public pharmacies in a Brazilian municipality between 2018 and 2022. Metrics for benzodiazepine consumption were DDD (Defined Daily Dose) and DDD/1000PD (per 1000 population per day). Long-term/prolonged benzodiazepine use was defined as consuming at least 90 DDD and at least 2 dispensations per year. To ascertain associations between long-term use and predictor variables, a multivariate logistic regression model was utilized.</p> Findings <p>A total of 40402 participants were included, with an average age of 55 years (SD = 0.30), 38.5% were older aged. Diazepam and nitrazepam exceeded the daily dose recommended. There was a reduction in diazepam consumption during the study period, as calculated by DDD/1.000PD, while the consumption of other benzodiazepines remained stable. However, a significant increase in diazepam consumption is noted when considering the last decade. Prolonged use was observed in 29.1% of participants, with a significant prevalence among the older people (34.8% of them were long-term users) and advancing age was identified as a risk factor for long-term use. Higher PDDs were also associated with long-term use and aging. Participants who used different benzodiazepines during the period had a higher risk of prolonged use.</p> Conclusions <p>These results provide insights into the prevalence of problematic utilization of benzodiazepines in primary health care. Authorities and health care providers must take steps to encourage gradual cessation of prolonged benzodiazepine prescriptions and the embrace of suitable strategies for addressing anxiety and insomnia within primary health care settings.</p>","author":"Maria Olívia Barboza Zanetti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bfb9a0577d1518ebdcf0f96a9ee6a611c729ef04ed94dca00e5b58f6274c6a4f","category":"Interdisciplinary"}