{"title":"Want to back CeramicSpeed’s Driven shaft-drive concept? Now you can","link":"https://cyclingtips.com/2021/04/want-to-back-ceramicspeeds-driven-shaft-drive-concept-now-you-can/","date":1619424038000,"content":"<p>Remember that “Driven” ultra-low-friction shaft-drive drivetrain that <a href=\"https://cyclingtips.com/2018/07/ceramicspeed-driven-drivetrain/\" target=\"_blank\">CeramicSpeed revealed at Eurobike 2018</a> and then had <a href=\"https://cyclingtips.com/2019/09/ceramicspeed-driven-can-shift/\" target=\"_blank\">wirelessly shifting gears by Eurobike 2019</a>? </p>\n\n\n\n<p>Well, CeramicSpeed has now split off ‘Driven Technologies Inc’ as a standalone company with Jason Smith (CTO of CeramicSpeed and founder of FrictionFacts) at the helm as CEO. Driven plans to continue developing its novel 99%-efficient product to fruition, and the company is seeking buy-in from seed investors to make it a reality. </p>\n\n\n\n<p>Have you been holding onto US$1,000 (or more) for your chance to become the part-owner of a drivetrain start-up? Well, this story is for you. </p>\n\n\n\n<h2>Driven in 2021 </h2>\n\n\n\n<p>It was September 2019 when the world last saw CeramicSpeed’s Driven setup. At that point, CeramicSpeed had progressed it from a rideable singlespeed sample to a system built into big-brand bikes that could shift five gears via an ingenious method. And while that shifting system couldn’t be ridden, it did offer promising progress for the concept. You can read all about <a href=\"https://cyclingtips.com/2019/09/ceramicspeed-driven-can-shift/\" target=\"_blank\">Driven’s shifting function</a> in our coverage from Eurobike 2019 (or watch the video below). </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Fast forward to today and the team at CeramicSpeed – along with assistance from a student engineering team from the University of Colorado in Boulder – has been working on a stronger driveshaft, miniaturization of the electronics, and developing the snap shift feature (which is used to decrease shifting time). “We’re also investigating a novel approach to increase the strength of the bearing interface between the pinions and cogs,” said the project founder and new Driven CEO, Jason Smith. “This bearing interface is the magic of Driven, but the present design doesn’t support powerful rider loads. The new approach is very promising however I can’t share more information at this time.”  </p>\n\n\n\n<p>The Driven team has also been modelling a new rear wheel and rear hub assembly. “The traditional drivetrain constrains the rear wheel with the requirements of a freehub and width for a wide cassette,” Smith said. “If the freehub and wide cassette constraints are removed, what could become of the real estate in the width of the rear hub area?”</p>\n\n\n\n<p>Smith is confident that the Driven system can be made as reliable as current derailleur and chain drivetrains. “You need to remember that the present rear derailleur drivetrain is rather complex,” he said. “The rear derailleur actually ‘derails’ the chain. The springs and pulley wheels take up extra chain length. Plus cross-chaining, which puts a chain at extreme and inefficient angles when it’s designed to perform best in a straight line. And then there is the whole wear issue due to the chain, rings, and cogs being exposed to the elements.</p>\n\n\n\n<p>“One might say that it’s taken over 100 years for the traditional rear derailleur drivetrain to get to the present level of rideability. And today we are all used to this drivetrain. It’s what we use, it’s durable and reliable, and it’s what we’ve been programmed to accept as the best. But is it really the best we can do?  I don’t think so. Ultimately, Driven is a more simple method of transferring power, without the complexity which was necessary 100 years ago.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Ceramicspeed-Driven-Specialized-Venge-9-1340x754.jpg\" /><figcaption>The Driven concept aims to remove almost all sliding components from the drivetrain. </figcaption></figure>\n\n\n\n<p>Compared to a derailleur drivetrain, Driven claims its system has the potential to be more mechanically efficient, <a href=\"https://cyclingtips.com/2019/08/ceramicspeeds-shaft-drive-drivetrain-now-confirmed-aero/\" target=\"_blank\">more aerodynamic</a>, cheaper to produce, less complex, and all while being fully enclosed. </p>\n\n\n\n<p>The team has been busy progressing the Driven concept, but it is worth noting that COVID slowed the rate of progression compared to what we saw between 2018 and 2019. “COVID threw a wrench in the plans with lab and workplace shutdown,” Smith said. “Given the creation of the new company, Driven Technologies, with a new facility in Boulder, and the ingress of funds, we’ll be able to get back to the rapid pace of development seen in the past with Driven.” </p>\n\n\n\n<p>The goal for the Driven team is to have the system ready for production by 2023. Of course there’s a long road ahead before that happens, and that’s where the seed funding comes in. </p>\n\n\n\n<h2>Seed funding </h2>\n\n\n\n<p>CeramicSpeed’s initial plan for the Driven technology was to engineer it to a workable concept, then sell it off entirely to an interested party. And while such talks were apparently had with some large companies, no agreements were reached. </p>\n\n\n\n<p>“We realized we needed to continue the development of Driven, but we couldn’t put all of the eggs – as in CeramicSpeed R&amp;D dollars – into the Driven basket,” Smith said. “This is where CeramicSpeed made the decision to carve out ownership of Driven to assist with development funding.</p>\n\n\n\n<p>“A common concern was that Driven is not quite developed enough. With acquisitions, an acquiring company usually likes to have a product at a slightly more mature level than Driven is at this point. This is where <a href=\"https://www.seedinvest.com/driven/seed\" target=\"_blank\">SeedInvest</a> comes in.”</p>\n\n\n\n<p>In the most basic sense, SeedInvest is a crowd-sourced funding platform that lets almost anyone play the role of an angel investor. In Driven’s case, the company is offering seed investment buy-in from US$1,000 (or more) with equity-based <a href=\"https://www.seedinvest.com/blog/startup-investing/how-convertible-notes-work\" target=\"_blank\">convertible notes</a> given in exchange. </p>\n\n\n\n<p>That investment won’t reward you with a workable product like you’d see with Kickstarter or similar, but rather you’ll be banking on the growth and success of Driven as a company over the next 24 months (or thereabouts). In the meantime, you’ll simply be able to scoff at people’s waxed chains and tell them the CEO of the company you have equity in made such things popular. </p>\n\n\n\n<p>Driven hopes to raise a minimum of US$300,000 and up to a maximum of US$1 million. That minimum is expected to cover six to nine months of research and development operations before another round of funding would be required. Meanwhile if the maximum figure is raised then the company expects to have enough funding to see the product through to manufacturing. Either way, the company expects its value to increase as the timeline progresses. </p>\n\n\n\n<p>Of course, seed investing in a start-up that’s yet to have a finished product – and, of course, no sales to date – means risk. However as is often the case with risk, the reward can be great. </p>\n\n\n\n<h2> Driven in the future </h2>\n\n\n\n<p>Ok, so let’s assume everything goes to plan and Driven has a saleable product by 2023. What does that look like? </p>\n\n\n\n<p>According to Smith, the likely first adopter for the Driven technology will be triathletes. “Driven is legal for triathlon competition, but is currently not allowed for cycling competition per the UCI rulebooks. With this in mind, it is much more cost effective to take Driven straight into triathlon competition as a growth area,” explained Smith of a lucrative market he knows well through both the success of CeramicSpeed and previous ventures. </p>\n\n\n\n<p>As for road cycling use, Smith says that UCI approval is in the works. “CeramicSpeed is a member of the WFSGI [World Federation of the Sporting Goods Industry],” he said. “We’re working with WFSGI to put a proposal in front of the UCI for consideration. The goal is to have Driven approved for UCI ‘Test in Competition’ status by 2022 race season.” </p>\n\n\n\n<p>Of course, having it approved for cycling competition is only one hurdle; perhaps the larger step yet to overcome is one of bike compatibility. Bikes are currently designed around chain and derailleur-based systems, and a shaft drive has its own requirements. “At some point Driven and OEMs will need to partner to produce a Driven-compatible frame, and this is dependent to a large extent on the OEMs,” Smith said.</p>\n\n\n\n<p>“The business plan relies on the public demand driving the OEMs to want to partner. If Driven proves itself, OEMs will want to be the first on the market with a Driven-equipped bike.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Ceramicspeed-Driven-Specialized-Venge-1-1340x754.jpg\" /><figcaption>CeramicSpeed partnered with both Specialized and Canyon to show off the Driven concept at Eurobike 2019. However, those show bikes were not rideable. </figcaption></figure>\n\n\n\n<p>In the short term, Smith speculates that Driven will produce a limited number of demo and race bikes to prove the concept. “It’s important to state that Driven Technology does not intend to become a bicycle manufacturer in the long term – we intend to be a drivetrain company.” </p>\n\n\n\n<p>The entry into the premium triathlon and road space is of course just a short-term goal for Driven. “We are aiming for Driven to be used in all segments, including bikes and e-bikes,” Smith said. “That is the ultimate long-term goal. The next step would be to design a ‘lower-end’ offering for commuters. The volume is no doubt in the fleet &amp; bike-share [space], both traditional powered and e-assist. These bikes benefit from a no/low maintenance drivetrain, with high longevity. Driven aims to fulfil this need, and provide added efficiency.” </p>\n\n\n\n<p>There are bikes on the market today that employ shaft drives and internally geared hubs, and while the low-maintenance and longevity offered is desirable, they also happen to be incredibly inefficient. “In my professional opinion, the rider is losing 20-25% of his/her pedaling power through this drivetrain,” said Smith, arguably the world’s leading opinion on bicycle drivetrain efficiency. “Driven would be a perfect candidate for this application.”</p>\n\n\n\n<p>There’s no hiding the fact Smith is excited for what Driven’s future holds, and certainly the next two years are likely to be make-or-break for the idea. “Going back to the high-performance market – Driven will need to prove itself and stay in the spotlight,” he said. “This will most likely happen through high-performance applications. A few race podiums and Driven will be looked at as more than just a concept.” </p>\n\n\n\n<p>The Driven technology is excitingly different and could genuinely be a disruptor in the market. Of course, there’s no hiding the long and bumpy road ahead which has some dominant (and historically aggressive) competition along the way. Whether this is an investment for you will depend on your willingness to go against the chain. </p>\n\n\n<p>    </p><div>\n    <div>\n\t<em>The seed funding is first-come, first-served. The offering is first being promoted to those in the cycling world, and will then be opened up to SeedInvest’s user base. You can learn more at <a href=\"https://www.seedinvest.com/driven/seed\" target=\"_blank\">seedinvest.com</a>. </em>    </div>\n    </div>\n\t<p></p>\n\n\n\n\n<p>The post <a href=\"https://cyclingtips.com/2021/04/want-to-back-ceramicspeeds-driven-shaft-drive-concept-now-you-can/\">Want to back CeramicSpeed’s Driven shaft-drive concept? Now you can</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bfbab0826a0a19bfea792712b46c6778fe3c65d33f93ed7ec4b0522511d3ea4e","category":"Cycling"}