{"title":"Integrated phycoremediation and modified PES-PVP fiber with biosynthesized n-AgO from Arabidopsis thaliana extract for remediating shrimp wastewater","link":"http://link.springer.com/10.1007/s13762-024-05525-8","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Despite the economic benefits of phycoremediation in wastewater treatment, existing scientific reports have highlighted its limited efficacy in contaminant removal. Similarly, membrane separation faces significant challenges due to associated fouling, hindering its widespread application. Addressing these issues, this study introduces an innovative approach utilizing <em>Arabidopsis thaliana</em> (AT) extract as a dual-function capping and reducing agent to synthesize bio-based silver nanoparticles (n-AgO), eliminating the need for additional reducing agents. The process involved homogenizing 300 g of fresh AT leaves with 500 mL of DI water, filtering the extract, and subsequently mixing 100 mL of this extract with 50-mL AgNO<sub>3</sub>, followed by agitation and centrifugation, resulting in n-AgO with an average size of ≈10 nm and a face-centered cubic crystalline structure confirmed using X-ray dispersive spectroscopy. These nanoparticles were then applied to modify polyethersulfone-polyvinylpyrrolidone (PES-PVP) hollow fibers at varying loadings using the non-solvent-induced phase technique. The resultant membranes were characterized using scanning electron microscopy, Fourier transforms infrared spectroscopy, contact angle, and porosity analysis. Assessment using shrimp wastewater as an influent demonstrated that the 0.50-g n-AgO modified PES-PVP exhibited the highest flux recovery ratio (FRR) of 0.932 and significantly reduced irreversible fouling compared to neat PES-PVP. Integration of <em>Chlamydomonas</em> sp. phycoremediation achieved substantial ammonia removal (87.94%) and TSS exclusion (61.41%), but the integration with the 0.50-g n-AgO modified membrane significantly enhanced the overall remediation efficiency to over 94%. Statistical analysis confirmed the significance of this improvement (<em>P</em> ≤ 0.05, <em>F</em> value of 13.49). This study highlights the potential of hybrid phycoremediation with modified membranes in wastewater treatment, emphasizing the need for further exploration into optimizing hybrid performance and extending assessments to diverse pollutants for broader applicability.</p>\n                    <span>\n                      <h3>Graphical abstract</h3>\n                      <p>\n      <span>\n                        <span>\n                          <img src=\"https://static-content.springer.com/image/MediaObjects/13762_2024_5525_Figa_HTML.png\" />\n                        </span>\n                      </span></p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"bfc3b47c3cb039d6044bacda8828833834df76d66b283ea7012cf5bfb4de6449","category":"Environment"}