{"title":"Cancer-wide <i>in silico</i> analyses using differentially expressed genes demonstrate the functions and clinical relevance of <i>JAG</i>, <i>DLL</i>, and <i>NOTCH</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307943","date":1722261600000,"content":"<p>by Jung Yun Kim, Nayoung Hong, Seok Won Ham, Sehyeon Park, Sunyoung Seo, Hyunggee Kim</p>\r\n\r\nNotch ligands [jagged (JAG) and, delta-like (DLL) families] and receptors [NOTCH family] are key regulators of Notch signaling. NOTCH signaling contributes to vascular development, tissue homeostasis, angiogenesis, and cancer progression. To elucidate the universal functions of the JAG, DLL, and NOTCH families and their connections with various biological functions, we examined 15 types of cancer using The Cancer Genome Atlas clinical database. We selected the differentially expressed genes (DEGs), which were positively correlated to the JAG, DLL, and NOTCH families in each cancer. We selected positive and negative hallmark signatures across cancer types. These indicated biological features associated with angiogenesis, hypoxia, KRAS signaling, cell cycle, and MYC targets by gene ontology and gene set enrichment analyses using DEGs. Furthermore, we analyzed single-cell RNA sequencing data to examine the expression of JAG, DLL, and NOTCH families and enrichment of hallmark signatures. Positive signatures identified using DEGs, such as KRAS signaling and hypoxia, were enriched in clusters with high expression of JAG, DLL, and NOTCH families. We subsequently validated the correlation between the JAG, DLL, and NOTCH families and clinical stages, including treatment response, metastasis, and recurrence. In addition, we performed survival analysis to identify hallmark signatures that critically affect patient survival when combining the expression of JAG, DLL, and NOTCH families. By combining the DEG enrichment and hallmark signature enrichment in survival analysis, we suggested unexplored regulatory functions and synergistic effects causing synthetic lethality. Taken together, our observations demonstrate the functions of JAG, DLL, and NOTCH families in cancer malignancy and provide insights into their molecular regulatory mechanisms.","author":"Jung Yun Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bfd02257d0899c5fa1fb07215337745ab1ef84a7fbf54bcbc2eba61f2fafd749","category":"Interdisciplinary"}