{"title":"DIY bike fit with the MyVeloFit app","link":"https://cyclingtips.com/2021/04/diy-bike-fit-with-the-myvelofit-app/","date":1618037188000,"content":"<p>Canadian startup MyVeloFit has announced an artificial intelligence-powered bike fitting app that uses video to capture marker-less motion tracking. The app is said to enable cyclists to check their position and get suggested adjustments to improve comfort and efficiency without leaving their home.&nbsp;</p>\n\n\n\n<p>All a rider needs to check their bike fit is a bike, a stationary trainer, a steady camera or phone, and the MyVeloFit app.&nbsp;</p>\n\n\n\n<p>In the past decade, bike fitting has experienced a boom, and new technology has brought advancements to the bike fitting process. One such technology is motion sensors and movement trackers, which usually require a visit to a trained bike fitter who has the necessary hardware and software. MyVeloFit is now claiming to offer motion-tracking technology for all cyclists to check their position by themselves.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-1340x754.jpg\" alt=\"\" class=\"wp-image-512337\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/bottom_squat.jpg 1349w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The MyVeloFit process begins with a rider mobility assessment, just as any good bike fit should.</figcaption></figure>\n\n\n\n<p>Designed to replicate the process a rider would experience when visiting a bike fitter, the app first assesses rider mobility, followed by an on-bike assessment using artificial intelligence and proprietary motion tracking to pinpoint joints and track movement patterns.&nbsp;</p>\n\n\n\n<p>The app then creates a report based on this initial assessment and provides key joint angle measurements at three points in the pedal stroke. The app also identifies excess movement points and provides a slider scale for numerous measurement points, showing where a rider currently sits within acceptable ranges for their chosen discipline.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-1340x754.jpg\" alt=\"\" class=\"wp-image-512301\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/MyVeloFit-4.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The app provides a visual representation of how the rider&#8217;s current fit falls within accepted ranges for specific disciplines. </figcaption></figure>\n\n\n\n<p>Lastly, the app provides precise adjustment recommendations for saddle height, fore/aft, handlebar position etc. before repeating the assessment process to assess the updated position.</p>\n\n\n\n<p>MyVeloFit&#8217;s website features step-by-step guides on how to conduct a fit plus information on a host of common bike fit issues. </p>\n\n\n\n<p>The app currently offers fitting for road, mountain biking, time trialling, triathlon, indoor spin bikes and hybrid bikes.&nbsp;</p>\n\n\n\n<p>MyVeloFit is based in Ottawa, Canada and was created by bike fitting veterans Jesse Jarjour and Justin Goulding. They say they intend for the app to be used by individual riders, bike shops, coaches and healthcare practitioners. </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;<em>Our goal isn&#8217;t to replace bike fitters, but to make data driven bike fit more accessible and easier for anyone to assess their position and make informed changes on their own.&#8221;</em></p></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/270-1340x754.jpg\" alt=\"\" class=\"wp-image-512339\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/270-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/270-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/270-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/270-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/270-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/270.jpg 1349w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The stick figure marking key joint positions will be familiar to anyone who has had a motion tracking bike fit. </figcaption></figure>\n\n\n\n<p>As riders, we are increasingly aware of the importance of a good bike fit. From injury prevention to power production, a proper bike fit is essential to keep us riding regardless of discipline, age, or gender.</p>\n\n\n\n<p>However, many of us ride ill-fitted bikes until injury or pain forces us to visit a bike fitter (and usually a physio). While I don&#8217;t imagine the app will ultimately replace bike fitters, it could offer riders a means to achieve safer positions and prevent injuries. The app creators seem to agree.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>&#8220;We believe professional bike fitters play a critical role in solving complex fit issues for many riders with injury, significant mobility issues, or specific performance goals. However, our experience is that the many riders simply need an accurate and reliable way to find a great position, but in a more convenient and accessible package. &#8220;</em></p></blockquote>\n\n\n\n<p>The MyVeloFit app has three pricing options starting with an entry-level free option. The mid level &#8220;enthusiast&#8221; package comes in at US$35 and offers all the features of the top level &#8220;pro&#8221; package but limits access to two weeks and a single profile. The &#8220;pro&#8221; package offers unlimited use for 12 months and is priced at US$75.&nbsp;</p>\n\n\n\n<p>For more information, visit <a target=\"_blank\" href=\"https://www.myvelofit.com/\" rel=\"noreferrer noopener\">MyVeloFit.com</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/diy-bike-fit-with-the-myvelofit-app/\">DIY bike fit with the MyVeloFit app</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bfdaa7deeed04473db49e8d0458b608c0b77a80504e0d3fa4c6a247df5c18692","category":"Cycling"}