{"title":"Technology-based group exercise interventions for people living with dementia or mild cognitive impairment: A scoping review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305266","date":1718287200000,"content":"<p>by Lillian Hung, Juyong Park, Hannah Levine, David Call, Diane Celeste, Dierdre Lacativa, Betty Riley, Nathanul Riley, Yong Zhao</p>\r\n\r\nOlder people living with dementia or mild cognitive impairment (MCI) are more vulnerable to experiencing social isolation and loneliness due to their cognitive and physical impairments. Increasingly integrating technology into group exercises contributed to the improved resilience and well-being of older adults living with dementia and MCI. The purpose of this scoping review was to identify the various types, feasibility, outcome measures, and impacts of technology-based group exercise interventions for people with dementia or MCI. We utilized the Joanna Briggs Institute approach, a three-step process. A comprehensive literature search on five databases—CINAHL, MEDLINE, Embase, Web of Science, and PsycInfo—until January 2024 yielded 1,585 publications; the final review included 14 publications that recruited a total of 379 participants, with mean age of 69 (SD = 4.21) years to 87.07 (SD = 3.92) years. Analysis of data showed three types of technology-based group exercise interventions for people with dementia or MCI: (a) exergames, (b) virtual cycling or kayak paddling, and (c) video-conferencing platforms. In addition, we identified three key impacts: (a) feasibility and accessibility; (b) physical, psychosocial, and cognitive benefits; and (c) adaptations necessary for persons with dementia or MCI. Our study suggests that technology-based group exercise interventions are feasible and acceptable to persons with dementia or MCI. Future studies should involve individuals with dementia and their caregivers in the design and implementation of technology-based group exercise programs.","author":"Lillian Hung","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"bfee7a25d315ca7116cf76356ea9fb8fc9261bc16c029470d3f32b6a2856c86a","category":"Interdisciplinary"}