{"title":"Report: Apple’s ‘Scary Fast’ event will live up to its name","link":"https://www.macworld.com/article/2115095/apple-scary-fast-event-m3-pro-max-macbook-pro.html","date":1698180176000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In a somewhat surprising announcement, <a href=\"https://www.macworld.com/article/2114818/apple-scary-fast-event-m3-imac-macbook-pro.html\">Apple sent out invitations</a> Tuesday for its Halloween Eve Scary Fast event focused on the Mac. And according to Ming-Chi Kuo, the event will certainly live up to its name.</p>\n\n\n\n<p>Echoing <a href=\"https://www.macworld.com/article/2113582/m3-mac-event-imac-macbook-pro-october.html\">early reports from Bloomberg’s Mark Gurman</a>, Kuo reports that the event will focus on the “M3 series MacBook Pro,” which presumably includes the 13-inch M3, and 14-inch and 16-inch M3 Pro, and M3 Max models. It would be the first time Apple launched all three chips at the same time, having previously waited months between the M3 and the higher-end versions.</p>\n\n\n\n<figure><div>\n<blockquote><p>I believe M3 series MacBook Pro will be Oct 30th media event's focus. I previously predicted a launch this year is unlikely due to limited 4Q23 shipments (less than 400-500k units in total). If new MBPs launch in Nov-Dec, tight supply will last into 1Q24 unless demand weakens. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/R6tVIYyQop&amp;xcust=1-1-2115095-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/R6tVIYyQop</a></p>— éƒ­æ˜ŽéŒ¤ (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1716871328794620072?ref_src=twsrc%5Etfw&amp;xcust=1-1-2115095-1-0-0&amp;sref=https://www.macworld.com/feed\">October 24, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Apple waited a full year between the M1 (November 2020) and the M1 Pro and M1 Max (November 2021), and more than seven months between the M2 (June 2022), and the M2 Pro and M2 Max (January 2023). Apple launched the final chip in the M2 family, the M2 Ultra, at WWDC in June.</p>\n\n\n\n<p>The M3 family of chips will reportedly be manufactured using the same 3nm process as the A17 in the iPhone 15 Pro. It is expected to bring speed boosts of roughly 20 percent, and possibly bring significant graphics and efficiency advancements. Gurman has previously reported that Apple has been testing chips with up to 16 CPU cores and 40 GPU cores.</p>\n\n\n\n<p>New M3 iMacs are also expected at the Scary Fast event, which will be held at the unusual time of 5 p.m. PT on Monday, October 30.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"bfeeacbeea5a5cdec0dd70cd939b3ceef70994a957d31694828f249a79ae8d3b","category":"Apple"}