{"title":"Seeking Adventure In My Own Backyard: Tour Costa de Hermosillo – Daniel Zaid","link":"https://theradavist.com/2021/07/seeking-adventure-in-my-own-backyard-tour-costa-de-hermosillo/?utm_source=rss&utm_medium=rss&utm_campaign=seeking-adventure-in-my-own-backyard-tour-costa-de-hermosillo","date":1627473618000,"content":"<p>La Costa de Hermosillo is the name for a vast expanse of land that covers from the west of the city of Hermosillo all the way to the coast of the Gulf of California, 100 km (60 miles) away. Once part of the territory where the Comca’ac Natives thrived, nowadays it’s mainly used for agriculture; during the 19th century, the Comca’ac, most frequently called “Seri” which means “people of the sand” in Yaqui language, were persecuted and almost wiped out completely by the Mexican army and ranchers who had interest in this territory, and the few survivors of the already dispersed Comca’ac Nation were progressively displaced further and further towards the coast till they reached the land they occupy today, where water is scarce and life conditions are harsh. Rain is not often seen around here, and agriculture is only possible via drilling wells and bringing water from other parts. La Costa de Hermosillo is flat as it is possible for land to be, so making long distances by bike in this region is a matter of keeping your bars straight and moving early, because it’s usually around noon that the wind picks up.</p>\n<p><span></span></p>\n<p>With summer fast approaching I can’t help but feel that every day that’s below 40°C (100°F) and I’m not out riding all day is a wasted day, but at the same time, it’s been hard for me to find the motivation to get out even for short rides. Even though it could be said that the Costa de Hermosillo is my backyard, there’s several places I haven’t been to because it takes hours of flat, straight riding to get to the coast where a more interesting landscape can be found. Feeling a little inspired, I made a route to connect a few new-to-me beaches and convinced my friend Arturo to leave his doctorate responsibilities and join me which assured me a wheel I could suck on; Arturo is the only member of my small riding group of friends, the Sonora Gravel Social Club, that has a sporty approach to bikes and is often seen on podiums in local races. He is equally comfortable riding fixed gear on a city night ride, mountain bike on singletrack, and exploring the local dirt roads with frequent stops when we ride together. With a couple of overnighters on his touring résumé, this would be his first multi-day bikepacking experience.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/Tour-Costa-de-Hermosillo-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Arturo comes over to my house and we fit his flashy Ibis Hakka MX gravel bike for touring. A stem riser gives enough clearance for a small Fabio’s Chest to sit on the bars while also adding a bit of comfort, and like 300 grams to his carbon bike. The next morning we take the road to Bahía de Kino, one I always say I don’t ever want to repeat because I’ve ridden it so many times but here I find myself once again. Our first destination is a beach named San Nicolás, known for its sand dunes, some 130 km (80 miles) away; we agree on riding the first 90 km of pavement as fast as we can to get to the part we’re interested on, stopping only half way to fill our bags to capacity as we won’t have any services for the next 24 hours. We can feel the wind rapidly increase and a few hours later we reach the detour where the dirt begins and a crosswind becomes a full on headwind on a flat, desolate 25 km stretch of road that connects fish farms, a power plant and finally, Rancho San Nicolás, a private ranch that must be crossed to get to the beach and the dunes.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/Tour-Costa-de-Hermosillo-5.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>There’s usually a $300 pesos (roughly $15 USD) fee for accessing this place, which most people do by car, but the man at the entrance says there’s no charge for us because we rode our bikes here. “You have earned it! Also, I can tell when someone is coming with bad intentions or to damage the place and you don’t look like that.” We thank him and head for the last few kilometers until the sand makes us dismount and push our bikes but at last, the dune appears behind a small hill.</p>\n<p>While I walk on the dune the wind plays with the sand making figures in the air; light comes into my eyes from all directions as the sun shines in the sky and reflects on the sand and the sea. In the evening we watch the sun set behind the mountain range of Isla Tiburón, the biggest island in México and a sacred place for the Comca’ac. We make camp trying to hide from the wind but it changes direction from time to time, so during the night I turn left and right in my sleeping bag depending on where the fistfuls of sand thrown at my face come from. The next morning we ride among a blooming forest of Cardón cacti, some of them around 10 meters (32 feet) tall which according to <a href=\"http://dspace.cibnor.mx:8080/bitstream/handle/123456789/1715/delgado_m.pdf?sequence=1&amp;isAllowed=y\">this study</a> could be between 80 and 100 years old.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/Tour-Costa-de-Hermosillo-7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As we take the dirt road out of San Nicolás expecting to have a tailwind we are soon reminded that nature isn’t there to fulfill our expectations: the wind is blowing so strong that we can barely keep 8 km (5 miles) per hour and it brings us to a halt as soon as we stop pedaling. It takes us three hours and a mango break to make it back to the highway, where we realize we don’t have enough water to reach our next planned resupply point (also, I’m not completely sure it exists) so we head to Bahía de Kino, a beach town with full services 15 km to the west, and spend the rest of the day hiding under a palapa.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/Tour-Costa-de-Hermosillo-19.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The following day we leave at 4 am to make some distance before the sun and the wind wake up, with another 130 km day ahead of us. Some time later our stomachs awaken and we stop for a quick breakfast; Arturo disappears into some cacti, toilet paper in hand, but when he comes back he’s limping. “Did a choya attack you?”, I joke. But he isn’t smiling. A recent knee injury reappeared as he was getting up from the squat and now he can barely walk. He rides for a little bit to see how the knee feels, but after a few kilometers it’s evident he won’t be able to continue and he decides to hitchhike back to Hermosillo, and I continue by myself. As I leave Arturo behind I realize it’s been a long time that I don’t go on a solo tour, since all my recent trips have been with my partner Karla or a friend. Do I even know how to ride by myself anymore?</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/Tour-Costa-de-Hermosillo-12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>What will I do at camp all alone? I focus on the flat road ahead of me, keeping a straight line and making 90 degree turns every 10 or 15 kilometers. At midmorning I arrive at the planned resupply point, verifying its existence, and take a break under the shade. I check my phone and find out that some friends are going to car camp on a beach not too far away, named El Himalaya probably because it’s the one hill in the area; I’ve never been to that place, so I decide to join them. I think for a second that I might be changing plans just to avoid being on my own, but I excuse myself saying it’s been a while of not being able to see them. With the temperature rising quickly there isn’t much time to ponder, so I get back on the bike and ride, feeling my energy renewed because of the expectation of seeing friends.</p>\n<p></p>\n<p><em>With this ride, I concluded the exploration of a proposed one-week bike touring route available for Hermosillo locals and whoever decides to come visit. It’s probably best to avoid doing it during the summer months because of the heat, and during any official vacation time such as Holy Week because these places get packed and people drink and drive.</em></p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"bff4f25da802089f285e48f595f7f6a34ea35b37c6d126a11f26538ff01322e3","category":"Cycling"}