{"title":"Unusual Metal-Organic Multicomponent Ni(II) and Mononuclear Zn(II) Compounds Involving Pyridine Dicarboxylates: Supamolecular Assemblies and Theoretical Studies","link":"https://www.preprints.org/manuscript/202408.1099/v1","date":1723704946000,"content":"Herein, we have reported the synthesis and characterization [single crystal X-ray diffraction technique, spectroscopic etc.] of two new Ni(II) and Zn(II) coordination compounds viz. [Ni(2,6-PDC)2]2[Ni(en)2(H2O)2]2[Ni(en)(H2O)4]·4H2O (1) and [Zn(2,6-PDC)(Hdmpz)2] (2) (where, 2,6-PDC = 2,6-pyridinedicarboxylate, en = ethylene-1,2-diamine, Hdmpz = 3,5-dimethyl pyrazole). Compound 1 is found to crystallize as a multicomponent Ni(II) compound with five discrete complex moieties; whereas, compound 2 is a mononuclear compound of Zn(II). Deep analysis of the crystal structure of compound 1 unfolds unusual dual enclathration of guest complex cationic moieties within the supramolecular host cavity stabilized by anion‒π, π-stacking, N‒H⋯O, C‒H⋯O and O‒H⋯O hydrogen bonding interactions. Interestingly, further enclathration of a complex cationic moiety is observed within another supramolecular host cavity formed involving anionic complex moieties and lattice water molecules in 1. Again, the crystal structure of compound 2 is stabilized by the presence of unconventional C‒H⋯π(chelate ring) interactions along with C‒H⋯O, C‒H⋯N hydrogen bonding, π-stacking, C‒H⋯π(pyridyl) interactions. These non-covalent interactions have been further studied theoretically using density functional theory (DFT) calculations, molecular electrostatic potential (MEP) surfaces, non-covalent interaction (NCI) plot index and quantum theory of atoms in molecules (QTAIM) computational tools. The computational study displays that π-stacking or H-bonds greatly tune the directionality of compound 1 although non-directional electrostatic forces dominate energetically. For compound 2, combined QTAIM/NCI plot analysis confirms the presence of unconventional C‒H⋯π(chelate ring) interaction along with other weak interactions obtained from the crystal structure analysis. Further, the individual energy contributions of these weak yet significant non-covalent interactions have also been determined computationally.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"bff5ccbe2bff75207cc99747336502ad485120f2183ce70a60577471416260f7","category":"Interdisciplinary"}