{"title":"Isotope effects of O2 consumption in a deep lake as means for understanding partitioning of O2 demand among microorganisms, particles, and sediment","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12543?af=R","date":1713603156000,"content":"<h2>Abstract</h2>\n<p>The isotopic ratio <sup>18</sup>O/<sup>16</sup>O of dissolved O<sub>2</sub> in aquatic systems is affected by the preferential biological uptake of <sup>16</sup>O (<i>ε</i>). Studies over the past six decades reveal that during incubation experiments, the isotopic effect of microorganism respiration (<i>ε</i>\n<sub>organism</sub>) varies in the range of −18‰ to −22‰. In contrast, natural variations in the deep-ocean O<sub>2</sub> concentration and δ<sup>18</sup>O levels show a considerably weaker effect (~ −10‰). The differences between these observations have been explained to result from either O<sub>2</sub> uptake by sediments or organic particles that, due to diffusion-limited respiration, are expected to weakly fractionate oxygen isotopes, by mixing processes or by weak fractionation at low temperatures. To gain better insight, we studied oxygen demand and δ<sup>18</sup>O in the deep, cold hypolimnion of Lake Stechlin between 2018 and 2021 as well as in various laboratory incubations. Our incubation results demonstrate an <i>ε</i>\n<sub>organism</sub> of about −24‰. Simple model calculations demonstrate a sediment O<sub>2</sub> demand isotope effect (<i>ε</i>\n<sub>SOD</sub>) of about −8.4‰, and a variated water-column O<sub>2</sub> demand isotope effect (<i>ε</i>\n<sub>WOD</sub>) which is lower than <i>ε</i>\n<sub>organism</sub>, ranging from −13.9‰ in 2019 to −23‰ in 2021. Accompanying experiments indicate that the lower magnitude of <i>ε</i>\n<sub>WOD</sub> may be related to respiration at organic particles lending to a weaker fractionation effect. Thus, variations in <i>ε</i>\n<sub>WOD</sub> may reflect a changing partitioning of hypolimnion oxygen uptake between suspended particles and their containing microorganisms. Based on own incubation experiments with <i>Daphnia</i> carcasses, we discuss how possible changes of particle rigidity might influence <i>ε</i>\n<sub>WOD</sub>.</p>","author":"Israela Musan, \nHezi Gildor, \nThomas Gonsiorczyk, \nHans‐Peter Grossart, \nBoaz Luz","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"bff8bf67f528e63f8caa5a6600ce957efedcbb7b8a75c19e560cb62280073466","category":"Environment"}