{"title":"Parameterization of height–diameter and crown radius–diameter relationships across the globe","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae005/7595929?rss=1","date":1706745600000,"content":"<span><div>Abstract</div>The tree height–diameter at breast height (H–DBH) and crown radius–DBH (CR–DBH) relationships are key for forest carbon/biomass estimation, parameterization in vegetation models and vegetation–atmosphere interactions. Although the H–DBH relationship has been widely investigated on site or regional scales, and a few of studies have involved CR–DBH relationships based on plot-level data, few studies have quantitatively verified the universality of these two relationships on a global scale. This study evaluated the ability of 29 functions to fit the H–DBH and CR–DBH relationships for six different plant functional types (PFTs) on a global scale, based on a global plant trait database. Results showed that most functions were able to capture the H–DBH relationship for tropical PFTs and boreal needleleaf trees relatively accurately, but slightly less for temperate PFTs and boreal broadleaf trees (BB). For boreal PFTs, the S-shaped Logistic function fitted the H–DBH relationship best, while for temperate PFTs the Chapman–Richards function performed well. For tropical needleleaf trees, the fractional function of DBH satisfactorily captured the H–DBH relationship, while for tropical broadleaf trees, the Weibull function and a composite function of fractions were the best choices. For CR–DBH, the fitting capabilities of all the functions were comparable for all PFTs except BB. The Logistic function performed best for two boreal PFTs and temperate broadleaf trees, but for temperate needleleaf trees and two tropical PFTs, some exponential functions demonstrated higher skill. This work provides valuable information for parameterization improvements in vegetation models and forest field investigations.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"bffa19f6f55f0498259f1afb8188aab304ac13bcc8ea08b8aa96afe7eea0a56c","category":"Environment"}