{"title":"Prey morphotype and abundance controls plastid retention and bloom dynamics for a mixotrophic dinoflagellate","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12708?af=R","date":1728543223000,"content":"<h2>Abstract</h2>\n<p><i>Dinophysis</i> is an obligate mixotroph that relies on consumption of the ciliate, <i>Mesodinium rubrum</i>, to grow and form harmful algal blooms (HABs). In this study, blooms of <i>Dinophysis acuminata</i> in two NY, USA, estuaries were studied over the course of 3 yr (2019–2021) using discrete samples and an Imaging FlowCytobot (IFCB) to capture images of plankton 20–150 <i>μ</i>m. The darkness of <i>Dinophysis</i> images on the IFCB was used to quantify the “fullness” or feeding state of <i>Dinophysis</i> cells. Culture experiments performed to ground truth this approach revealed a highly significant correlation (<i>R</i> = 0.98; <i>p</i> &lt; 0.001) between the darkness of <i>Dinophysis</i> cells and the abundance of <i>Mesodinium</i>. With a quantitative scale developed to track the fullness of <i>Dinophysis</i> cells, ecosystem observations revealed the percentage of “full” <i>Dinophysis</i> cells increased during blooms of a large-morphotype <i>Mesodinium</i> that preceded the initiation of <i>Dinophysis</i> blooms. A smaller morphotype <i>Mesodinium</i> appeared during <i>Dinophysis</i> bloom peaks suggesting they supported bloom maintenance. While the relative abundance of diatoms was elevated before <i>Dinophysis</i> blooms, other dinoflagellates and tintinnids increased in abundance during these HABs indicating they emerged within a consortium of heterotrophs and mixotrophs that may have collectively filled the same open niche as <i>Dinophysis</i>. This study reveals the manner in which different <i>Mesodinium</i> populations co-bloom with <i>Dinophysis</i> to support plastid acquisition, bloom initiation, and bloom maintenance and contextualizes these changes within the larger plankton community succession associated with these HABs.</p>","author":"Megan Ladds, \nHeidi M. Sosik, \nChristopher J. Gobler","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"bffa083b88f094010e0e902820c8cd82b3bd0b93e18bf9d8f2dbdfe3bbfecac5","category":"Environment"}