{"title":"A Novel Hybrid Deep Learning Framework for Evaluating Field Evapotranspiration Considering the Impact of Soil Salinity","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036809?af=R","date":1725705576000,"content":"<h2>Abstract</h2>\n<p>Accurate evaluation of evapotranspiration (<i>ET</i>) is crucial for efficient agricultural water management. Data-driven models exhibit strong predictive <i>ET</i> capabilities, yet significant limitations like naive extrapolation hamper wider generalization. In this perspective, we explore a novel hybrid deep learning (<i>DL</i>) framework to integrate domain knowledge and demonstrate its potential for evaluating <i>ET</i> under the influence of soil salinity. Specifically, we integrated physical constraints from process models (Penman-Monteith or Shuttleworth-Wallace) and salinity-induced stomatal stress mechanisms into the <i>DL</i> algorithm, and evaluated its performance by comparing four diverse scenarios. Results demonstrate that hybrid <i>DL</i> framework offers a promising alternative for <i>ET</i> estimation, achieving comparable accuracy to pure <i>DL</i> during training and validation. Nonetheless, due to the limited available measurements, data-driven model may not adequately capture plant responses to salt stress, leading to significant prediction biases observed during independent testing. Encouragingly, the hybrid <i>DL</i> model (<i>DL-SS</i>) integrating Shuttleworth-Wallace and salinity-induced stomatal stress mechanisms demonstrated enhanced interpretability, generalizability, and extrapolation capabilities. During testing, <i>DL-SS</i> consistently showed optimal performance, yielding root mean square error (<i>RMSE</i>) values of 37.4 W m<sup>−2</sup> for sunflower and 39.2 W m<sup>−2</sup> for maize. Compared to traditional Jarvis-type approaches (<i>JPM</i> and <i>JSW</i>) and pure <i>DL</i> model during testing, <i>DL-SS</i> achieved substantial reductions in <i>RMSE</i> values: 51%, 33%, and 43% for sunflower, and 45%, 31%, and 35% for maize, respectively. These findings highlight the importance of integrating prior scientific knowledge into data-driven models to enhance extrapolation capability of <i>ET</i> modeling, especially in salinized regions where conventional models may struggle.</p>","author":"Yao Rong, \nWeishu Wang, \nPeijin Wu, \nPu Wang, \nChenglong Zhang, \nChaozi Wang, \nZailin Huo","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"c000521208be0bec8e2aecd18b1aeb53d7c8dd382beb5eb36f8515d234a4737d","category":"Environment"}