{"title":"Prior to the Chicxulub impact, rainforests looked very different","link":"https://arstechnica.com/?p=1753773","date":1617300023000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/554660main_forest20110531-43_1024-768-800x600.jpg\" alt=\"Image of a tropical forest.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/554660main_forest20110531-43_1024-768.jpg\" class=\"enlarge-link\" data-height=\"768\" data-width=\"1024\">Enlarge</a> (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.nasa.gov/topics/earth/features/forest20110531-i.html\">NASA/JPL-Caltech</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Colombia’s rainforest looked very different 66 million years ago. At present, the humid and biodiverse ecosystem is jam-packed with plants and is covered in a thick, light-blocking canopy of leaves and branches. Notably, there are no dinosaurs. But prior to the dinosaurs going away with the Chicxulub impact, signaling the end of the Cretaceous Period, things looked very different. The area’s plant coverage was relatively sparse, and a bevvy of conifers called it home.</p>\n<p>Using the fossilized remains of plants, a team of researchers studied the past of the rainforest and how the asteroid gave rise to the rainforests of today. The study, published in Science on April 1, was led by scientists at the Smithsonian Tropical Research Institute (STRI) in Panama and supported by scientists at the Negaunee Institute for Plant Conservation Science and Action at the Chicago Botanic Garden.</p>\n<p>“Forests disappeared because of the ecological catastrophe... and then, the returning vegetation was mostly dominated by flowering plants,” said Mónica Carvalho, first author and joint postdoctoral fellow at STRI and at the Universidad del Rosario in Colombia, in an interview with Ars.</p></div><p><a href=\"https://arstechnica.com/?p=1753773#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753773&comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c00b5c6827cf722d8065bb914add766e70652d0e6fe1506d77898ba4876b3b97","category":"Tech"}