{"title":"Clinical evaluation of platelet-rich plasma therapy for osteonecrosis of the femoral head: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304096","date":1716559200000,"content":"<p>by Guimei Guo, Wensi Ouyang, Guochen Wang, Wenhai Zhao, Changwei Zhao</p>\r\nObjective <p>This meta-analysis aims to assess the efficacy and safety of platelet-rich plasma (PRP) for osteonecrosis of the femoral head (ONFH).</p> Methods <p>We comprehensively searched randomized controlled trials in PubMed, Web of Science, EMBASE, the Cochrane Central Register of Controlled Trials, Chinese National Knowledge Infrastructure, China Science and Technology Journal Database, WanFang, and Chinese BioMedical Literature Database from inception until October 25, 2024. The literature on the clinical efficacy of autologous PRP for ONFH was collated. According to the inclusion and exclusion criteria, the literature was screened, quality evaluated and the data was extracted. Meta-analysis was carried out with the software Review Manager 5.4.1 software and Stata 17.0 software. In addition, potential publication bias was detected by the funnel plot test and Egger’s test. The GRADE system was used to evaluate the quality of evidence for outcome indicators.</p> Results <p>Fourteen studies involving 909 patients were included in this study. Compared with non-PRP, PRP exhibited significant improvements in the Harris hip score (HHS) at 3 months (MD = 3.58, 95% Cl: 1.59 to 5.58, P = 0.0004), 6 months (MD = 6.19, 95% Cl: 3.96 to 8.41, P &lt; 0.00001), 12 months (MD = 4.73, 95% Cl: 3.24 to 6.22, P &lt; 0.00001), ≥ 24 months (MD = 6.83, 95% Cl: 2.09 to 11.59, P = 0.0003), and the last follow-up (MD = 6.57, 95% Cl: 4.81 to 8.33, P &lt; 0.00001). The PRP also showed improvement in HHS compared to baseline than the non-PRP at 3 months (MD = 3.60, 95% Cl: 1.26 to 5.94, P = 0.003), 6 months (MD = 6.17, 95% Cl: 3.74 to 8.61, P &lt; 0.00001), 12 months (MD = 5.35, 95% Cl: 3.44 to 7.25, P &lt; 0.00001), ≥ 24 months (MD = 8.19, 95% Cl: 3.76 to 12.62, P = 0.0003), and the last follow-up (MD = 6.94, 95% Cl: 5.09 to 8.78, P &lt; 0.00001). The change in visual analog scale (VAS) score 3 months post intervention (MD = -0.33, 95% Cl: -0.52 to -0.13, P = 0.001), 6 months (MD = -0.69, 95% Cl: -0.90 to -0.48, P &lt; 0.00001), 12 months (MD = -0.75, 95% Cl: -1.05 to -0.46, P &lt; 0.00001), ≥ 24 months (MD = -1.05, 95% Cl: -1.20 to -0.89, P &lt; 0.00001), and the last follow-up (MD = -0.75, 95% Cl: -0.97 to -0.54, P &lt; 0.00001). The PRP also showed a decrease in VAS score compared to baseline than the non-PRP at 3 months (MD = -0.29, 95% Cl: -0.41 to -0.17, P = 0.003), 6 months (MD = -0.63, 95% Cl: -0.96 to -0.30, P = 0.0002), 12 months (MD = -0.78, 95% Cl: -1.22 to -0.33, P = 0.0006), ≥ 24 months (MD = -1.11, 95% Cl: -1.27 to -0.96, P &lt; 0.00001), and the last follow-up (MD = -0.74, 95% Cl: -1.05 to -0.43, P &lt; 0.00001). Additionally, it was found that the PRP group had the advantages in the following aspects: collapse rate of the femoral head (RR = 0.33, 95% Cl: 0.17 to 0.62, P = 0.0006), rate of conversion to total hip arthroplasty (RR = 0.37, 95% Cl: 0.18 to 0.74, P = 0.005), and overall complications (RR = 0.33, 95% Cl: 0.13 to 0.83, P = 0.02). The GRADE evidence evaluation showed overall complication as very low quality and other indicators as low quality.</p> Conclusion <p>There is limited evidence showing benefit of PRP therapy for treatment of ONFH patients, and most of this evidence is of low quality. Caution should therefore be exercised in interpreting these results. It is recommended that future research involve a greater number of high-quality studies to validate the aforementioned conclusions.</p> Systematic review registration <p>https://www.crd.york.ac.uk/prospero/ #recordDetails, CRD42023463031.</p>","author":"Guimei Guo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0110ab74f1a74472cbd6aed8faf7415b66ae1e1a55556b91bc99ddd8b4188d0","category":"Interdisciplinary"}