{"title":"Google is killing most of Fitbit’s social features today","link":"https://arstechnica.com/?p=1927005","date":1679943465000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/37-800x450.jpg\" alt=\"Fitbit's now-dead Challenges feature. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/37.jpg\">Enlarge</a> <span>/</span> Fitbit's now-dead Challenges feature.  (credit: <a href=\"https://sherwinfong.com/fitbit-challenges\">Sherwin Fong</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Today's the day for Google's biggest change yet to Fitbit: It's shutting down some more features. As Google announced in <a href=\"https://community.fitbit.com/t5/Fitbit-Challenges-Adventures/Open-groups-Challenges-and-Adventures-will-no-longer-be-available-as-of/td-p/5335863\">February</a>, the popular fitness gamification features, Fitbit \"Challenges\" and \"Adventures,\" are being shut down today. Google is also removing the \"Open Group\" social networking feature.</p>\n<p>Getting motivated to work out is tough for some people, so Fitbit's software included a few ways to gamify fitness to keep people interested. Challenges were introduced <a href=\"https://web.archive.org/web/20191102102926/https://blog.fitbit.com/say-hello-to-a-new-way-to-stay-motivated/\">in 2014</a> as a way to share and compare your step counts with friends, hopefully motivating both of you to get more exercise. The feature came with badges that could be earned for specific tasks and trophies for winning a battle. Adventures were <a href=\"https://web.archive.org/web/20220705175149/https://blog.fitbit.com/join-fitbit-on-an-adventure-in-yosemite-national-park/\">announced</a> in 2017 as location-specific challenges that highlighted local places that were good for exercise and hiking, like national parks and landmarks. You could tackle these areas solo at your own pace or participate in multiplayer \"Adventure Races\" where you could track your hiking speed or progress against other Fitbit users. This seems like something that would only get better with Google Maps integration. Oh, well.</p>\n<p>Adventures, Challenges, and all player-earned trophies and badges are going away today. The Fitbit community on Reddit has been <a href=\"https://www.reddit.com/r/fitbit/search?q=adventures&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=relevance&amp;t=all\">furious</a> over the feature removals, with the most popular post of the past year being <a href=\"https://www.reddit.com/r/fitbit/comments/114mfuo/make_it_100_clear_why_youre_cancelling_your/\">a call</a> to cancel your Fitbit Premium subscription over the changes. On Twitter, <a href=\"https://twitter.com/fitbit/status/1640020944084148225\">Fitbit tried</a> celebrating the company's birthday yesterday, but nearly all the replies were about the feature shutdown and what other services people should switch to. <a href=\"https://www.reddit.com/r/fitbit/comments/123j5vx/challenges_and_adventures_gone/\">Several users</a> have confirmed today that the features are dead.</p></div><p><a href=\"https://arstechnica.com/?p=1927005#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927005&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c011c95432b8c5d1d34221adc88c8b69e277522831196ae6cc20d893434ee355","category":"Tech"}