{"title":"How Cubans make island Internet work for them","link":"https://arstechnica.com/?p=1740469","date":1612962004000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Jaime_Santos_holding_USB-800x600.jpg\" alt=\"Jaime Santos-Menéndez, a Havana-based documentary filmmaker, has a much different workflow than creatives in the United States.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Jaime_Santos_holding_USB.jpg\" class=\"enlarge-link\" data-height=\"3024\" data-width=\"4032\">Enlarge</a> <span class=\"sep\">/</span> Jaime Santos-Menéndez, a Havana-based documentary filmmaker, has a much different workflow than creatives in the United States. (credit: Cassandra Brooklyn)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>As countless Cubans have proudly told me over the years, \"Cubans invent.\" They use creative workarounds to get by in an environment with limited access to outside resources. Glass beer bottles are sawed off to become drinking glasses; helmets transform into flowerpots; shoestrings and bottle caps are affixed to doors as makeshift locks.</p>\n<p>And with a growing need for online access to function in the modern world, Cubans have been inventing new ways to connect to the Internet, too.</p>\n<p>Jaime Santos-Menéndez, a Havana-based documentary filmmaker, has often lacked the money to pay for Wi-Fi cards, and so, like most Cubans, he came up with a workaround. For years, Santos-Menéndez relied on his mother, a state-employed biochemist, to receive messages for him at her office via her government email account. Friends were instructed to email his mother's work account, she downloaded the messages to a USB drive, and she gave it all to Santos-Menéndez to view on his home computer. He would then respond to messages, load his outgoing emails onto the USB drive, and rely on his mother to send them from her office the next day.</p></div><p><a href=\"https://arstechnica.com/?p=1740469#p3\">Read 38 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1740469&comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c01f0640611783143ce12aabbec7504824594535081b01b30dca2aa061425504","category":"Tech"}