{"title":"Intra- and inter-limb strength imbalance and asymmetry in soccer: A comparison of elite senior and junior players","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302474","date":1714140000000,"content":"<p>by Robert Śliwowski, Thierry Paillard, Łukasz Bojkowski, Witold Dudziński, Mikołaj Patek, Jakub Marynowicz</p>\r\n\r\nEvaluation of muscle strength imbalance can be an important element in optimizing the training process of soccer players. The purpose of the study was to examine isokinetic peak torque (PT) and total work (TW) exerted by both knee extensors (quadriceps or Q) and flexors (hamstrings or H), intra-limb imbalance and the magnitude and direction of inter-limb asymmetry in top elite senior (n = 109) and junior (n = 74) soccer players. An isokinetic dynamometry was used to measure maximum peak torque of quadriceps (PT-Q) and hamstrings (PT-H) at an angular velocity of 60° ·s<sup>-1</sup>, as well as the total work for extensors (TW-Q) and flexors (TW-H) at an angular velocity of 240° ·s<sup>-1</sup> in the dominant (DL) and non-dominant leg (NDL) during concentric muscle contraction. Intra-limb imbalance and inter-limb asymmetries were calculated using a standard equation. Statistical analysis using t-test and Mann-Whitney U-test revealed: (a) no differences (<i>p</i> &gt; 0.05) between groups for PT-Q and PT-H, (b) greater strength levels (<i>p</i> &lt; 0.05) for TW-Q and TW-H of senior players than juniors, and (c) no differences (<i>p</i> &gt; 0.05) between groups for intra-limb imbalance and inter-limb asymmetry. Additionally, Pearson’s chi-kwadrat (χ2) analysis showed no differences (<i>p</i> &gt; 0.05) between groups for intra-limb imbalance and inter-limb asymmetry in relation to the ’normative’ values accepted in the literature that indicate an increase in the risk of knee injury. This study shows that isokinetic assessment can be an important tool to identify imbalances/asymmetries and to develop strategies to reduce the risk of muscle injury.","author":"Robert Śliwowski","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0315129d9b629b134d554965386f91333b74d435344037bf69c17f2b25f9b33","category":"Interdisciplinary"}