{"title":"Apple Attempts to Block 'Nearly Identical' Logo From Trademarking","link":"https://www.macrumors.com/2021/04/07/apple-block-nearly-identical-logo-trademark/","date":1617798407000,"content":"Apple is opposing the trademarking of a bottled water business's logo since it argues that it can be easily mistaken for its own (via <a href=\"https://lawstreetmedia.com/tech/apple-files-opposition-to-apple-shaped-graphic-trademark-filing/\"><em>Law Street</em></a>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/georgette-logo-dispute-2.jpg\" alt=\"\" width=\"800\" height=\"450\" class=\"aligncenter size-full wp-image-792837\" />\r\n<br/>\r\nApple filed <a href=\"https://www.docketalarm.com/cases/TTAB/91268572/Apple_Inc._v._Georgette_LLC/1/\">a notice of opposition</a> with the Trademark Trial and Appeal Board against Georgette LLC's logo, asserting that its brand will be damaged if the applicant's logo is registered because of dilution and the likelihood of consumer confusion, mistake, or deception.\r\n<br/>\r\n\r\n<br/>\r\nGeorgette's logo depicts a whole apple with the words \"I am Arcus\" over it, and with two leaves. Apple's logo, on the other hand, has a bite out of its right-hand side, and a single leaf. Apple says that the applicant's logo \"features a stylized apple design with a right-angled, detached leaf, rendering it visually similar to Apple's famous Apple Marks.\"<blockquote>Consumers encountering Applicant's Mark are likely to associate the mark with Apple. Applicant's Mark features a stylized apple design with a right-angled, detached leaf, rendering it visually similar to Apple’s famous Apple Marks. Indeed, the overall shape of Applicant's apple design is nearly identical to the shape of the Apple Logo</blockquote>An image enclosed in the filing overlays Georgette's logo with Apple's logo, to reveal that they are even dimensionally similar. \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/georgette-logo-dispute-comparison.jpg\" alt=\"\" width=\"1183\" height=\"826\" class=\"aligncenter size-full wp-image-792831\" />\r\n<br/>\r\nApple argues that since 1977 it has used its logo, which has gone on to become distinctive and gain a high level of consumer recognition and goodwill.<blockquote>Applicant's Mark readily calls to mind Apple's famous Apple Logo given the visual similarities, and the Apple Marks are so famous and instantly recognizable that the similarities in Applicant's Mark will overshadow any minor differences and cause the ordinary consumer to believe that Applicant is related to, affiliated with or endorsed by Apple.</blockquote>Beyond the obvious similarities between Apple's logo and that of Georgette, Apple is also arguing that it sells \"goods related to beverages\" featuring its logo, including mugs, thermal bottles, and water bottles, such as those available to customers exclusively at the <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> Visitor Center. Since Georgette wants to trademark its logo for \"purified drinking water; bottled water,\" Apple believes this is even greater grounds to refuse the application.\r\n<br/>\r\n\r\n<br/>\r\nLast year, Apple initiated <a href=\"https://www.macrumors.com/2020/08/08/legal-action-against-company-with-pear-logo/\">trademark litigation</a> with a small company called \"Prepear,\" arguing that its pear-shaped logo was too similar to its own mark. Prepear ultimately <a href=\"https://www.macrumors.com/2021/02/09/prepear-settles-apple-trademark-dispute/\">changed its logo</a> to bring the dispute to an end, but Apple continues to fiercely guard the trademark of its logo.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/trademark/\">trademark</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/04/07/apple-block-nearly-identical-logo-trademark/\">Apple Attempts to Block &#039;Nearly Identical&#039; Logo From Trademarking</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-attempts-to-block-nearly-identical-logo-from-trademarking.2290900/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=g--85QRIZ2U:YubKB5VPh0k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=g--85QRIZ2U:YubKB5VPh0k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/g--85QRIZ2U\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c034806df9b0a62ad502a7187503895bf21437f85c30abced20f266369dde9c1","category":"Apple"}