{"title":"Effector MoSDT1 enhances Magnaporthe oryzae virulence and plays a dual role in regulating rice defense","link":"https://academic.oup.com/plphys/article/196/2/1042/7709980?rss=1","date":1720483200000,"content":"<span><div>Abstract</div>C<sub>2</sub>H<sub>2</sub> zinc effectors are a class of pathogen proteins that play a dual role in plant–pathogen interactions, promoting pathogenicity and enhancing plant defense. In our previous research, we identified <span>Magnaporthe oryzae</span> Systemic Defense Trigger 1 (MoSDT1) as a C<sub>2</sub>H<sub>2</sub> zinc effector that activates rice (<span>Oryza sativa</span>) defense when overexpressed in rice. However, its regulatory roles in pathogenicity and defense require further investigation. In this study, we generated an <span>MoSDT1</span> overexpressing strain and 2 knockout strains of <span>M. oryzae</span> to assess the impact of <span>MoSDT1</span> on pathogenicity, rice defense, and phenotypic characteristics. Our analyses revealed that MoSDT1 substantially influenced vegetative growth, conidia size, and conidiation, and was crucial for the virulence of <span>M. oryzae</span> while suppressing rice defense. MoSDT1 localized to the nucleus and cytoplasm of rice, either dependent or independent of <span>M. oryzae</span> delivery. Through RNA-seq, scRNA-seq, and ChIP-seq, we identified that MoSDT1 modulates rice defense by regulating the phosphorylation and ubiquitination of various rice signaling proteins, including transcription factors, transcription repressors, kinases, phosphatases, and the ubiquitin system. These findings provide valuable insights into the regulatory mechanisms of C<sub>2</sub>H<sub>2</sub> zinc finger effector proteins and offer important foundational information for utilizing their target genes in disease resistance breeding and the design of targets for disease management.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"c036afa1c465f8969578ac625b167e526e98a1ed3f711436936337aa56143823","category":"Environment"}