{"title":"Prevalence, treatment, and outcomes of hepatitis C in an MDR/RR-TB trial cohort","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003057","date":1727186400000,"content":"<p>by Jocelyn Jansen van Vuuren, Tim Crocker-Buque, Catherine Berry, Dzmitry Viatushka, Ruzilya Usmanova, Bern-Thomas Nyang’wa, Nargiza Parpieva, Irina Liverko, Varvara Solodovnikova, Animesh Sinha</p>\r\n\r\nTuberculosis (TB) and chronic hepatitis C virus infection (HCV) remain significant global health challenges, especially in low- and middle-income countries. In Eastern Europe, a considerable percentage of multi-drug resistant (MDR) and rifampicin resistant (RR) TB populations show high HCV prevalence. Current WHO guidelines do not routinely advise HCV testing during MDR-TB treatment, despite HCV being a risk factor for drug-induced liver complications in TB patients. This study investigates the co-treatment of MDR/RR-TB and HCV, using data from the TB-PRACTECAL trial. Data were collected as part of the TB-PRACTECAL clinical trial. All participants were screened for HCV at baseline. Participants who were HCV antibody positive and those who were treated for hepatitis C with Direct Acting Antivirals (DAAs) were extracted and compared to overall cohort characteristics. The characteristics of participants concomitantly treated with direct-acting antivirals are described including hepatitis treatment outcomes and adverse events. Among 552 participants from Belarus, Uzbekistan, and South Africa, 24 (4.3%) were HCV antibody positive. Unfavourable TB treatment outcomes were noted in 106/523 (22%) of the HCV-negative, 8/18 (44%) of the HCV-seropositive, and 2/7 (29%) of HCV-confirmed participants treated with DAAs. Of the six participants who received concurrent HCV and MDR/RR TB treatment, three were cured of HCV and three had no post-treatment HCV RNA test, five completed TB treatment and one discontinued treatment due to a severe adverse reaction. Concurrent treatment of MDR-TB and HCV, including in HIV patients, showed promising outcomes with no significant adverse events. The findings support the potential benefits of integrating HCV care into MDR-TB management.","author":"Jocelyn Jansen van Vuuren","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c03c18759cfa311df9969d20f07aedd4b48cdd92355da7a994a75939e74846fa","category":"Environment"}