{"title":"Modelling of Real Gas Compression Using the Finite Volume Thermofluid Network Methodology and Mean-Line Approach for Centrifugal Compressors","link":"https://www.preprints.org/manuscript/202403.1655/v1","date":1711517960000,"content":"A novel compressible real gas 1D finite volume thermofluid network modelling methodology is proposed that can be applied in the analysis of supercritical CO2 (sCO2) power cycles. It is applied to simulate centrifugal compressor performance via a mean line approach that directly solves the mass, energy, and momentum balance equations for the discretized flow channels within the machine along with the associated loss models, component characteristics, and applicable compressible real gas equation of state. This can be integrated seamlessly with the rest of the power cycle components like pipes, valves, heat exchangers, etc., thereby eliminating the need for static performance maps and the associated difficulties to ensure similarity over the whole range of operation. This direct simulation of the internal flows also makes it possible to do integrated cycle design optimization that includes the geometry of the compressors, and to simulate fast transients for dynamic analysis. The methodology was applied to simulate well-documented air and sCO2 centrifugal compressors and compared the generated results with that of conventional thermofluid network incompressible and compressible ideal gas approaches. The results indicate that the proposed compressible real gas approach can capture the stagnation pressure changes and isentropic efficiencies with good accuracy for both cases over the whole range of mass flow rates and shaft rotational speeds. In contrast, the conventional thermofluid network incompressible and compressible ideal gas approaches are only applicable in selected regions of the fluid property regime and suffer from discretization errors and inappropriate treatment of the relationship between stagnation and static pressures. Furthermore, comparative analyses between the newly proposed approach and the traditional mechanical energy balance method are performed, showing that the latter approach needs to be discretized more finely through the compression process to correctly capture the polytropic compression path shape, whereas the former more accurately captures the stagnation pressure changes through the analyzed compressors with only a single increment per compressor component.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c03e5ec3623ec8a5fdba13a307f930919e05d2c9b00ea6e5677e4b91e4aaa385","category":"Interdisciplinary"}