{"title":"Social support and ideal cardiovascular health in urban Jamaica: A cross-sectional study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003466","date":1722348000000,"content":"<p>by Alphanso L. Blake, Nadia R. Bennett, Joette A. McKenzie, Marshall K. Tulloch-Reid, Ishtar Govia, Shelly R. McFarlane, Renee Walters, Damian K. Francis, Rainford J. Wilks, David R. Williams, Novie O. Younger-Coleman, Trevor S. Ferguson</p>\r\n\r\nRecent studies have suggested that high levels of social support can encourage better health behaviours and result in improved cardiovascular health. In this study we evaluated the association between social support and ideal cardiovascular health among urban Jamaicans. We conducted a cross-sectional study among urban residents in Jamaica’s south-east health region. Socio-demographic data and information on cigarette smoking, physical activity, dietary practices, blood pressure, body size, cholesterol, and glucose, were collected by trained personnel. The outcome variable, ideal cardiovascular health, was defined as having optimal levels of ≥5 of these characteristics (ICH-5) according to the American Heart Association definitions. Social support exposure variables included number of friends (network size), number of friends willing to provide loans (instrumental support) and number of friends providing advice (informational support). Principal component analysis was used to create a social support score using these three variables. Survey-weighted logistic regression models were used to evaluate the association between ICH-5 and social support score. Analyses included 841 participants (279 males, 562 females) with mean age of 47.6 ± 18.42 years. ICH-5 prevalence was 26.6% (95%CI 22.3, 31.0) with no significant sex difference (male 27.5%, female 25.7%). In sex-specific, multivariable logistic regression models, social support score, was inversely associated with ICH-5 among males (OR 0.67 [95%CI 0.51, 0.89], p = 0.006) but directly associated among females (OR 1.26 [95%CI 1.04, 1.53], p = 0.020) after adjusting for age and community SES. Living in poorer communities was also significantly associated with higher odds of ICH-5 among males, while living communities with high property value was associated with higher odds of ICH among females. In this study, higher level of social support was associated with better cardiovascular health among women, but poorer cardiovascular health among men in urban Jamaica. Further research should explore these associations and identify appropriate interventions to promote cardiovascular health.","author":"Alphanso L. Blake","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c0404c9a6425685c986bdc278aa165d7a4d5b2c4e296950c9958853130de0245","category":"Environment"}