{"title":"Blood Flow Restriction Exercise as a Novel Conservative Standard in Patients with Knee Osteoarthritis &ndash; A Narrative Review","link":"https://www.preprints.org/manuscript/202406.1865/v1","date":1719404237000,"content":"Knee osteoarthritis is a prevalent joint disease affecting millions of individuals globally. While total knee arthroplasty  is an effective treatment for advanced stages of KOA, it may not be suitable for earlier stages or younger patients. Supervised exercise therapy has proven to be the first line treatment of preference in tackling pain and disability caused by KOA. However, the high intensities required to induce positive muscle adaptations are not indicated in this population as this is often accompanied by pain, discomfort, and frustration; leaving low load resistance training as the only feasible method of treatment.\nRecently, the use of blood flow restriction training  began to emerge as a substitute for high load resistance training. With BFRT, a cuff is applied around the proximal aspect of the affected limb, causing partial arterial and full venous occlusion, thereby inducing localized hypoxia and accumulation of metabolites, mimicking the effects of high load resistance training, albeit with low loads. Consequently, BFRT might offer a suitable and more effective alternative for KOA patients who are not (yet) eligible for TKA, compared to the traditional exercise therapy.\nThis review aims to summarize the current evidence as regards the application of Blood Flow Restriction in exercise therapy of knee osteoarthritis patients, with particular consideration of the underlying mechanisms and its safety, as well as general guidelines for practical implementation into clinical practice. In doing so, this narrative review aims to create a framework allowing the translation from theory to practice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c0484fbe04af7a1417add4233aa4c16547d5b1f00ed68a0393d655db465b2350","category":"Interdisciplinary"}