{"title":"'Physically I wasn’t done, but mentally I was' - Victoria Pendleton on leaving cycling and what came next","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/physically-i-wasn-t-done-but-mentally-i-was-victoria-pendleton-on-leaving-cycling-and-what-came-next","date":1701870457000,"content":"\n      <p><em>This article was originally published in Rouleur Issue 119, April 2023. To support our journalism, <a href=\"https://www.rouleur.cc/pages/subscribe\" target=\"_blank\">please consider subscribing</a>.</em></p>\n<p>The Old Testament tells of Adam and Eve, who lived in innocence in Paradise until a serpent enticed Eve to eat forbidden fruit from the tree of knowledge. As punishment for her disobedience, God banished them from Paradise. Ever since Eve’s transgression in the Garden of Eden, snakes in Christian tradition have been associated with lies, evil and temptation. But in other cultures, like ancient Greece, Egypt and indigenous North America, snakes symbolise fertility, rebirth and renewal.</p>\n<div></div>\n<div></div>\n<p>This is what Victoria Pendleton is talking about within the first ten minutes of our Zoom call. She’s explaining why, ever since she retired from professional cycling at the end of 2012, she has been steadily covering her body with tattoos of snakes.</p>\n<p>“Snakes shed their skin and they move on and evolve,” she says. “I really appreciate that sentiment because that feels like my life. I didn’t want to stay stuck telling people I won medals. I wanted to keep moving forward and trying new things, being brave and stepping into new sports and new realms.</p>\n<p>“When I was mountaineering and in Bolivia doing some training, one of the mountain guides was actually from a background of healers. She explained to me some of the totems and the sandstone carvings. We were chatting about snakes and she told me that the snake seems like a very humble creature because it can’t get any closer to Mother Nature. The belly is literally on the ground. A lot of people think they’re quite sinister, but she flipped that on its head. I took that with me.”</p>\n<p>For Pendleton, 42, being outdoors and close to nature has consistently been a healing force in her life. It’s something she has relied on repeatedly when she has been going through difficult periods, notably when she was a professional track sprinter. In her ten-year career, Pendleton won the world sprint title six times (2005, 2007-10, 2012), two team sprint titles (2007-08) and a keirin title (2007), as well as seven more World Championship medals.</p>\n<p>“Being outdoors and having sport and physical activity is the one thing that keeps me on the straight and narrow, quite frankly,” she says. “Whenever I’ve struggled, it has been the reset factor. I didn’t realise how important it was to me when I was an athlete. Maybe as I’m getting older, I’m able to recognise that more.”</p>\n<p>Pendleton adds that there were numerous things she feels like she rarely had time to think about or reflect on when she was living life as an athlete. She speaks of time moving quickly, as if she was on a hamster wheel that never stopped turning, always thinking of the next race, the next target or the next Olympics.</p>\n<p>“I think that’s why it doesn’t feel real when I look back at that part of my life,” she says. “The adrenaline was always so high. You’re always striving, striving, striving. You have such tunnel vision that you don’t really build very many real pictures or memories in your brain. I was just doing the training and doing the racing and it’s all mushed into one.</p>\n<p>“I wish I could have sat back at times and gone, oh my goodness, check this out. I was so afraid – I was made to feel afraid – that if I took my foot off the gas, I would lose my form, I’d lose my condition and lose my focus.”</p>\n<p>It’s this experience that has driven Pendleton to take small steps back into the world of cycling in recent years, hoping she can make a difference for the young track sprinters who now find themselves in the position she was in more than a decade ago.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CAuldPhoto-LeCol-Switzerland-4937_1024x1024.jpg?v=1701870268\" />“I’m really lucky that I met the girls on the Great Britain sprint squad just prior to them going to the Paris World Championships last year. I was asked if I would like to be a mentor by Keith Sharpe (Head of Coaching and Leadership Development at British Cycling). He said, it’s a real shame that you were lost from the sport. I felt quite emotional being asked to do that. “I told the girls, the one thing I really regret is not taking time to breathe and appreciate everything,” says Pendleton.</p>\n<p>“I really wish I’d taken more time off. I never really had a bad injury, or a bad crash that kept me out of training for too long. I never got a chance to be on the other side and feel like I was hungry for it again, like I really wanted to get back in and appreciate what I’ve got. I was very fortunate that physically, I was resilient to the training. From 1989 to 2012 I didn’t miss a single race.”</p>\n<p>Despite being long retired, Pendleton explains she still feels a pang of anxiety each time she sets foot in a velodrome. While doing commentary in recent years, the sound of the beeps counting down before a timed event begins and the sight of the riders waiting in the holding area and in the start gate still remind her of how “gut-wrenchingly nervous” she would feel ahead of an event.</p>\n<p>Track sprinting is one of the most mentally taxing cycling disciplines. In an event which is short and intense, margins are so minute that every pedal stroke matters. So much of sprinting is based on tactics and mentality, there are few moments in the sport as tense as when two track sprinters are being held on the start line, staring at each other before going to battle.</p>\n<p>“You look over the wrong shoulder and it’s done. Then you have to live with that. You can’t make any amends,” says Pendleton. “That doesn’t get any easier even as your performance gets better. The stakes just get higher.”</p>\n<p>Pendleton notes that she has seen big changes in the way British Cycling now coaches young sprint athletes compared to the days she was on the programme. She describes the methods used for post-race analysis as almost unrecognisable, whereby athletes are able to collaborate with coaches, rather than it being a power dynamic where coaches just tell their athletes what to do.</p>\n<p>“I could see this kind of athlete-coach relationship building within the women’s endurance team while I was there and that’s now moved into the sprint as well, which is something I’ve never seen before. I was like, wow, you’re asking their opinion? This is amazing. It’s a very grown-up way to be coached.</p>\n<p>“I don’t think we had the expertise at the time or the knowledge to do that when I was racing. You just do what you can with what you’ve got. As coaching and understanding human performance has evolved, it’s more of a collaborative environment. I like that. It doesn’t mean riders are any less committed or dedicated to what they do. In fact, they’re more involved and more heard. That’s something I really wish I could have had.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CAuldPhoto-LeCol-Switzerland-4520_1024x1024.jpg?v=1701870295\" /></p>\n<p>It’s not just in track sprinting that Pendleton has noticed progression in women’s cycling; she notes that the level and number of female riders performing at a high level across the board has developed unimaginably in her lifetime.</p>\n<p>“I got asked a few times if I wanted to move to the road in my career,” says Pendleton. “Whenever I did endurance training, I could hold my own. But I just felt like, during my 20s, for example, I couldn’t participate in a sport where I stood next to my male counterpart and he’s on a six or seven-figure salary and I’m living like a student.</p>\n<p>“That was one of the reasons I started with the track originally, because I was like, at least there’s a level of equality there. We didn’t get paid much for a start, but there’s not a lot between what the men and women get paid. On the road I was like, until the scene is a fair scene, it wouldn’t be something I’d be interested in getting involved with.”</p>\n<p>The offerings that Pendleton got during her track career to move over to the road scene came due to her unique physicality for a track sprinter. Unlike many of her competitors, she had a petite frame and physique, usually the smaller rider compared to whoever she was racing against. This was one of reasons, says Pendleton, that she never truly felt like she fitted in, in the world of track sprinting.</p>\n<p>“At the very beginning people told me you’re too skinny and you haven’t got the right mentality to be a champion. A lot of people told me that I wasn’t going to make it, more so than they ever told me that I was,” she says.</p>\n<p>“I felt, on the whole, I was always battling against a stereotype that I didn’t really fit into and was never going to. People said, she’s too girly, she’s too emotional, she’s too feminine.</p>\n<p>“I was mocked by other female riders, like, Russian riders would come and tap me or pinch me on the bum. I always wonder what it would have been like if someone said to me: ‘You’ve got this and you’re exactly how you should be.’”</p>\n<p>Pendleton reveals that she even got asked to shave off her hair so she could become more aerodynamic. “I always responded, but I’m doing the job well, why does anything else matter?”</p>\n<p><span>These were all contributing factors that led Pendleton to step away from cycling in 2012 after the London Olympics. It was in those Games that she won the gold medal in the keirin, as well as silver in the sprint. It’s rare to see a rider leave the sport when they are at the very top, but Pendleton says that her mental state meant she had no choice but to retire.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CAuldPhoto-LeCol-Switzerland-6978_1024x1024.jpg?v=1701870348\" />“I was just so exhausted, I couldn’t even envision carrying on. The environment wasn’t working for me any more, it was too hard to bear. Physically, I wasn’t done, but mentally I was. That’s always going to be a battle I’ll play through my head, which is probably why I’ve taken up so many ridiculous sports since retiring, because I never, ever will feel like I gave myself enough opportunity to really show what I could do.</p>\n<p>“From the very moment the London Olympics came to a close, it was a huge relief. It was frightening, because after having lived and trained and been in the system your entire adult life, deciding what to do tomorrow can be daunting. Having that freedom to do whatever you want can be quite paralysing in some ways, rather than empowering.”</p>\n<p>Pendleton explains that she found solace in horse racing soon after she stopped cycling. It was in that community that she finally felt accepted, without any pressure of having followed in the footsteps of her father, something that had bothered her throughout her cycling career. Becoming a jockey gave Pendleton a renewed purpose, plan and routine again after retiring from bike racing.</p>\n<p>“I was in an environment where I was being coached, which felt very comfortable, although they were different surroundings and sport. I was learning a new language. The words and the terms that people use in horse racing are foreign if you don’t know them,” explains Pendleton.</p>\n<p>“I rode 92 different horses in one year trying to get as many different experiences as possible because every one teaches you something different. I completely immersed myself in learning something new. Learning to ride horses was really empowering and really enabling because it made me realise that I can do other things.”</p>\n<p>It’s not just riding that Pendleton has dabbled in since leaving cycling; she has also tried mountaineering, surfing and motorcycling to name just a few. She is drawn to high-paced, risky activity.</p>\n<p>“A lot of it is adrenaline. There’s something about being in a really, really focused state of mind. It’s dangerous, or like on a horse, it’s quite unpredictable. You have to be really focused, and that is a completely quiet time,” she says.</p>\n<p>“I don’t really love racing that much. What I like is the training and improving and learning. It’s being able to see yourself gaining, becoming stronger and faster, becoming more competent as a jockey or getting a bigger motorcycle. There’s always something to push for. I don’t think I’ll ever stop doing that.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CAuldPhoto-LeCol-Switzerland-8555_1024x1024.jpg?v=1701870370\" />Next, Pendleton says she would like to learn how to freedive, something that she describes as the ultimate sport for self control. It’s all about meditation and breathing, requiring total focus.</p>\n<p>“I also tried paddleboarding recently,” she says. “My partner said, are you sure that’s really exciting with enough adrenaline for you? I think he was right. That won’t be my next hobby!”</p>\n<p>Among all her goals, hobbies and ambitions, Pendleton has recently rediscovered cycling too, after deciding to stay away from the sport for a long time. She has become an ambassador for clothing brand Le Col, recently designing a new collection for the British brand which is inspired by her love of snakes.</p>\n<p>“Le Col actually first made me a jersey with Pendleton written on it and for the first time ever in my life, it had the world champs bands. I’ve never had any because I left cycling as a reigning world champion, so I never rode the stripes on my jersey, or on my collar or on my sleeves,” says Pendleton. “It made me feel really proud.”</p>\n<p>The relationship with Le Col has helped Pendleton become reacquainted with the cycling world and ignited a desire in her to become more involved in the community.</p>\n<p>“It would be nice to contribute in some way, for all the people that helped me on my journey,” she says. “There were a lot of naysayers, but there were a few people who really helped and supported me. I would love to be able to return the favour to a new generation of cyclists, or just empower women to do stuff.</p>\n<p>“I want to help people realise that whatever you want to do, as dangerous and daring as it might be, it’s never too late to start something new. That’s how I really live my life. I’m not going to live by other people’s constraints or what people say you should be doing as a 42-year-old woman, I just do what I want to do. I’m still up against it, people are fascinated by the fact that I haven’t got kids and that I still want to ride a 1200cc motorcycle around a racetrack. They wonder why. I say, why not?”</p>\n<p>As for her professional cycling career, Pendleton is able to look back at what she accomplished with a sense of pride. It seems that she is at peace with the part of her life she spent on two wheels, grateful for the person it made her into, even though there were bumps in the road.</p>\n<p>“It was a fantastic period of my life and I will always feel so grateful to be part of that golden age of cycling where every time we stepped up, it got better and better. It was dreamlike,” says Pendleton.</p>\n<p>“It was magical in many ways. I don’t think that will ever happen again in the sport of track cycling. It will never be that dramatic, we can’t go back that far. As a nation, to become so respected in cycling, I feel lucky to be a tiny part of that and I appreciate it. I stepped away at the top and I’m grateful for that. It is hard to be the very best at what you do and then to become ordinary in that brief moment. But I’ll always say, it’s better to burn out brightly than fade away.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c04e939df89dbf72b79393a769f7bdde7022b6aeebeda9a32cd1ff3d7fb2c6b5","category":"Cycling"}