{"title":"T-Mobile's Smartphones Coming to 2,300 Walmart Locations Across the U.S.","link":"https://www.macrumors.com/2021/09/13/t-mobile-expanding-to-walmart-stores/","date":1631564397000,"content":"T-Mobile <a href=\"https://www.t-mobile.com/news/offers/t-mobile-and-metro-by-t-mobile-coming-to-walmart\">today announced</a> that its T-Mobile and Metro by T-Mobile smartphones will soon be available in more than 2,300 Walmart locations across the United States, significantly expanding T-Mobile's footprint.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/t-mobile-walmart.jpg\" />\r\n<br />\r\nT-Mobile devices will be listed on Walmart.com, though customers will need to visit a Walmart store to make a purchase. The rollout follows the availability of T-Mobile devices in Best Buy retail stores and the Best Buy website earlier this year.\r\n<br />\r\n\r\n<br />\r\nPrior to becoming available in Walmart and Best Buy, T-Mobile iPhones were only available from Apple or direct from T-Mobile's website and stores, which prevented customers from taking advantage of deals offered by brick and mortar retailers.<blockquote>\"In many parts of the country, limited competition when it comes to wireless service leaves some people with few options for plans or access to the benefits of 5G,\" said Jon Freier, Executive Vice President, T-Mobile Consumer Group. \"5G for All means T-Mobile is bringing real choice and competition in wireless to many Americans. And even though online shopping continues to grow, we know that retail stores remain one of the primary places where wireless customers pick up devices and service. We're working to expand our retail footprint across the country to meet more people in more places every day.\"</blockquote>Metro by T-Mobile smartphone displays will be available in Walmart retail locations on Monday, October 18. Standard T-Mobile smartphones and plans will be available in Walmart stores starting on Monday, November 1.<div>Tag: <a href=\"https://www.macrumors.com/guide/t-mobile/\">T-Mobile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/13/t-mobile-expanding-to-walmart-stores/\">T-Mobile's Smartphones Coming to 2,300 Walmart Locations Across the U.S.</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/t-mobiles-smartphones-coming-to-2-300-walmart-locations-across-the-u-s.2310599/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HnepEOaiO-I:TnBkfp366ak:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HnepEOaiO-I:TnBkfp366ak:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/HnepEOaiO-I\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c05fb0867c3af6bd9f01fcaa26f421897a563610325661b1335df10ec414f6a0","category":"Apple"}