{"title":"Remains of planet that formed the Moon may be hiding near Earth’s core","link":"https://arstechnica.com/?p=1980396","date":1698862776000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/image-800x450.png\" alt=\"Image of a distorted orange sphere on a black background, with a trail of orange material spreading out in the foreground.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/image.png\">Enlarge</a> <span>/</span> Modeling has shown how material ejected from the Earth by a massive collision could have formed the Moon. Now the models are being used to look at what happened inside the Earth. (credit: <a href=\"https://www.nasa.gov/solar-system/collision-may-have-formed-the-moon-in-mere-hours-simulations-reveal/\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Seismic waves created by earthquakes as they travel through the planet's interior change speed and direction as they move through different materials. Things like rock type, density, and temperature all alter the travel of these waves, allowing scientists to gradually build up a picture of the Earth's crust and mantle, spotting things like the rise of plumes of hot mantle material, as well as the colder remains of tectonic plates that dropped off the surface of the Earth long ago.</p>\n<p>There are some things that show up in these images, however, that aren't easy to explain. Deep in the Earth's mantle there are two regions where seismic waves slow down, termed large low-velocity provinces. This slowdown is consistent with the materials being higher density, so it's not really a surprise that they're sitting near the core. But that doesn't explain why there are two distinct regions of them or why they appear to contain material that has been there since the formation of the Solar System.</p>\n<p>Now, a team of scientists has tied the two regions' existence back to a catastrophic event that happened early in our Solar System's history: a giant collision with a Mars-sized planet that ultimately created our Moon.</p></div><p><a href=\"https://arstechnica.com/?p=1980396#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980396&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c067a0360c3d84a6c1b9c3c79ebdc255198c4ad9448483948c461ed3ba2b326e","category":"Tech"}