{"title":"A scoping review of health systems resilience assessment frameworks","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003658","date":1727100000000,"content":"<p>by Sushma Marita Dsouza, Anuradha Katyal, Shrikant Kalaskar, Mehnaz Kabeer, Latika Rewaria, Sreemeena Satyanarayana, Krishna Reddy Nallamalla, Maulik Chokshi</p>\r\n\r\nHealth system resilience is a prerequisite for effectively managing cataclysmic events adversely affecting health outcomes. The COVID-19 pandemic reasserted the importance of having resilient health systems and called for a relook at the existing framework that measures health system resilience. Mixed methods were used in this study. The review started with the measurement of health systems resilience and its context. Ebola epidemic triggered the importance, hence our search focused on published literature from 2014 to 2021. Based on the review, a semi-structured tool was developed for key in-depth interviews of seven experts from different countries. The frameworks focused on climate change, disaster management, health systems, city-specific resilience, and e-resilience were reviewed. In-depth interviews highlighted that resilient health systems need to engage the private sector, priority areas like leadership and governance, health resources, and a unified agenda for global collaboration. From experts’ point of view, the inherent nature of health systems to respond to shock was clearly defined as the resilient health system. Health systems resilience definition needs to be defined, based on which assessment indicators will be identified. Indicators need to evolve continuously and be able to measure resilience at sub-national, national, regional, and global levels.","author":"Sushma Marita Dsouza","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c074bc6f0914653823bfaeb6c387b2acdf12ff05a160f5e5dfa687772d08ea11","category":"Environment"}