{"title":"Virgin Orbit pauses all operations","link":"https://arstechnica.com/?p=1924517","date":1678980032000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/P1047032-scaled-1-800x504.jpg\" alt=\"Virgin Orbit was founded by Sir Richard Branson. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/P1047032-scaled-1.jpg\">Enlarge</a> <span>/</span> Virgin Orbit was founded by Sir Richard Branson.  (credit: Virgin Orbit)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's been a rough first quarter of 2023 for Virgin Orbit, Sir Richard Branson's US-based flagship satellite launch company. First, the company had a <a href=\"https://arstechnica.com/science/2023/01/virgin-orbits-launcherone-rocket-suffers-anomaly-fails-to-reach-orbit/\">disastrous UK launch attempt</a> in January; the launch failed after a problem with the rocket's second-stage engine. The company's already precarious financial situation went critical in the wake of that failure. As Ars' Eric Berger <a href=\"https://arstechnica.com/science/2023/01/even-before-mondays-launch-failure-virgin-orbits-finances-were-dismal/\">reported at the time</a>, several financial analysts predicted that the company would run out of money sometime in March.</p>\n<p>Those analysts proved quite prescient. BBC News <a href=\"https://www.bbc.com/news/science-environment-64973383\">reports</a> that the beleaguered company will pause its operations on Thursday and furlough almost all its staff, although the company did not officially confirm the furloughs to BBC News. In a statement, the company merely said, \"Virgin Orbit is initiating a company-wide operational pause, effective March 16, 2023, and anticipates providing an update on go-forward operations in the coming weeks.\" Shares dropped 18.8 percent to 82 cents (72p) in extended trading in response to the news.</p>\n<p>Per our <a href=\"https://arstechnica.com/science/2023/01/even-before-mondays-launch-failure-virgin-orbits-finances-were-dismal/\">prior coverage</a>, Virgin Orbit started as an idea in 2011 by Branson as an offshoot of his Virgin Galactic space business, with the goal of fully utilizing the <em>White Knight</em> aircraft. Eventually, it was decided that the company, formally created in 2017, would use its own aircraft, a modified Boeing 747-400 named <em>Cosmic Girl</em>, as a platform from which it could drop and launch small rockets. It was funded for most of a decade by the Virgin Group, the multinational company that owns and operates Branson's various businesses, as well as an Emirati state-owned holding company Mubadala Investment Company.</p></div><p><a href=\"https://arstechnica.com/?p=1924517#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1924517&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c0893d9c632b515266e49627bdc35378924fb07b7d4515ed7f0292b86ab68555","category":"Tech"}