{"title":"Apple Watch Sales Ban Reinstated in U.S. Effective Tomorrow","link":"https://www.macrumors.com/2024/01/17/apple-watch-sales-ban-reinstated/","date":1705520491000,"content":"Apple's motion to stay an Apple Watch sales ban for the duration of its appeal was denied today by the U.S. Court of Appeals for the Federal Circuit, according to a <a href=\"https://www.scribd.com/document/699619677/Federal-Circuit-Denies-Apple-Motion-to-Stay\">court document</a> viewed by <em>MacRumors</em>. Apple's interim stay will be lifted as of January 18 at 2 p.m. Pacific Time, the filing indicates, meaning the sales ban will be reinstated tomorrow.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Watch-Series-9.jpg\" width=\"2880\" height=\"1620\" />\r<br />\nThe order means that Apple will once again no longer be able to sell Apple Watch models with blood oxygen sensing in the U.S., including the Series 9 and Ultra 2. The ban <a href=\"https://www.macrumors.com/2023/12/21/apple-watch-removed-from-online-store/\">first began last month</a>, but it was <a href=\"https://www.macrumors.com/2023/12/27/apple-watch-series-9-and-ultra-2-sales-ban-paused/\">quickly paused</a> after Apple received an interim stay.\r<br />\n\r<br />\nThe U.S. International Trade Commission last year <a href=\"https://www.macrumors.com/2023/10/27/us-trade-tribunal-apple-watch-ban-masimo/\">ordered the import and sales ban</a> after ruling that Apple violated Masimo's pulse oximetry patents with the Apple Watch's blood oxygen sensing feature, first introduced on the Series 6 model in 2020. Masimo has accused Apple of <a href=\"https://www.macrumors.com/2023/04/18/apple-masimo-legal-battle/\">stealing trade secrets and poaching employees</a>.\r<br />\n\r<br />\nApple will likely sell modified Apple Watch Series 9 and Ultra 2 models <a href=\"https://www.macrumors.com/2024/01/15/apple-watch-blood-oxygen-app-removal/\">without the Blood Oxygen app</a> in the U.S. to sidestep the sales ban, while it continues to appeal.\r<br />\n\r<br />\n\"Apple's claim that its redesigned watch does not contain pulse oximetry is a positive step toward accountability,\" a Masimo spokesperson told <em>MacRumors</em>. \"It is especially important that one of the world's largest and most powerful companies respects the intellectual property rights of smaller companies and complies with ITC orders when it is caught infringing.\"\r<br />\n\r<br />\nAs a longer-term measure, <a href=\"https://www.bloomberg.com/news/articles/2024-01-15/apple-to-remove-watch-blood-oxygen-app-to-avoid-ban-masimo-says\"><em>Bloomberg</em>'s Mark Gurman</a> recently reported that Apple is preparing a software update that would adjust the Blood Oxygen app's algorithms, in an attempt to avoid Masimo's patented technology. It's unclear if this effort will be successful, and the legal battle between Apple and Masimo is likely far from over.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/17/apple-watch-sales-ban-reinstated/\">Apple Watch Sales Ban Reinstated in U.S. Effective Tomorrow</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-sales-ban-reinstated-in-u-s-effective-tomorrow.2416628/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c09e1609e08fa18a98542c03f92126c15112f987631ac444a51284efe11384da","category":"Apple"}