{"title":"New – Sustainability Pillar for AWS Well-Architected Framework","link":"https://aws.amazon.com/blogs/aws/sustainability-pillar-well-architected-framework/","date":1638468316000,"content":"<p><a href=\"https://aws.amazon.com/architecture/well-architected/\">The AWS Well-Architected Framework</a> has been helping AWS customers improve their cloud architectures since 2015. The framework consists of design principles, questions, and best practices across multiple pillars: <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/operational-excellence-pillar/welcome.html\">Operational Excellence</a>, <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/security-pillar/welcome.html\">Security</a>, <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/reliability-pillar/welcome.html\">Reliability</a>, <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/performance-efficiency-pillar/welcome.html\">Performance Efficiency</a>, and <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/cost-optimization-pillar/welcome.html\">Cost Optimization</a>.</p> \n<p>Today we are introducing a new <a href=\"https://docs.aws.amazon.com/wellarchitected/latest/sustainability-pillar/sustainability-pillar.html\">Sustainability Pillar</a> to help organizations learn, measure, and improve their workloads using environmental best practices for cloud computing.</p> \n<p>Similar to the other pillars, the Sustainability Pillar contains questions aimed at evaluating the design, architecture, and implementation of your workloads to reduce their energy consumption and improve their efficiency. The pillar is designed as a tool to track your progress toward policies and best practices that support a more sustainable future, not just a simple checklist.</p> \n<p><span><strong>The Shared Responsibility Model of Cloud Sustainability</strong></span><br /> The <a href=\"https://aws.amazon.com/compliance/shared-responsibility-model/\">shared responsibility model</a> also applies to sustainability. AWS is responsible for the sustainability <em>of</em> the cloud, while AWS customers are responsible for sustainability <em>in</em> the cloud.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/shared-responsibility-model-sustainability.png\" /></p> \n<p>The sustainability <em>of</em> the cloud allows AWS customers to <a href=\"https://d39w7f4ix9f5s9.cloudfront.net/d1/80/283b833847df8ee4fe9661e0dd8f/11061-aws-451research-advisory-bw-cloudefficiency-eu-2021-r2-final-2.pdf\">reduce associated energy usage by nearly 80%</a> with respect to a typical on-premises deployment. This is possible because of the much higher server utilization, power and cooling efficiency, custom data center design, and continued progress on the path to powering AWS operations with 100% renewable energy by 2025. But we can achieve much more by collectively designing sustainable architectures.</p> \n<p>We are introducing the new Sustainability Pillar to help organizations improve their sustainability <em>in</em> the cloud. This is a continuous effort focused on energy reduction and efficiency of all types of workloads. In practice, the pillar helps developers and cloud architects surface the trade-offs, highlight patterns and best practices, and avoid anti-patterns. For example, selecting an efficient programming language, adopting modern algorithms, using efficient data storage techniques, and deploying correctly sized and efficient infrastructure.</p> \n<p>Specifically, the pillar is designed to support organizations in developing a better understanding of the state of their workloads, as well as the impact related to defined sustainability targets, how to measure against these targets, and how to model where they cannot directly measure.</p> \n<p>In addition to building sustainable workloads in the cloud, you can use AWS technology to solve broader sustainability challenges. For example, reducing the environmental incidents caused by industrial equipment failure using <a href=\"https://aws.amazon.com/monitron/\">Amazon Monitron</a> to detect abnormal behavior and conduct preventative maintenance. We call this sustainability <em>through </em>the cloud.</p> \n<p><strong><span>Well-Architected Design Principles for Sustainability in the Cloud<br /> </span></strong>The Sustainability Pillar includes design principles and operational guidance, as well as architectural and software patterns.</p> \n<p>The design principles will facilitate good design for sustainability:</p> \n<ul> \n <li><strong>Understand your impact</strong> – Measure business outcomes and the related sustainability impact to establish performance indicators, evaluate improvements, and estimate the impact of proposed changes over time.</li> \n <li><strong>Establish sustainability goals</strong> – Set long-term goals for each workload, model return on investment (ROI) and give owners the resources to invest in sustainability goals. Plan for growth and design your architecture to reduce the impact per unit of work such as per user or per operation.</li> \n <li><strong>Maximize utilization</strong> – Right size each workload to maximize the energy efficiency of the underlying hardware, and minimize idle resources.</li> \n <li><strong>Anticipate and adopt new, more efficient hardware and software offerings</strong> – Support upstream improvements by your partners, continually evaluate hardware and software choices for efficiencies, and design for flexibility to adopt new technologies over time.</li> \n <li><strong>Use managed services</strong> – Shared services reduce the amount of infrastructure needed to support a broad range of workloads. Leverage managed services to help minimize your impact and automate sustainability best practices such as moving infrequent accessed data to cold storage and adjusting compute capacity.</li> \n <li><strong>Reduce the downstream impact of your cloud workloads</strong> – Reduce the amount of energy or resources required to use your services and reduce the need for your customers to upgrade their devices; test using device farms to measure impact and test directly with customers to understand the actual impact on them.</li> \n</ul> \n<p><span><strong>Well-Architected Best Practices for Sustainability<br /> </strong></span>The design principles summarized above correspond to concrete architectural best practices that development teams can apply every day.</p> \n<p>Some examples of architectural best practices for sustainability:</p> \n<ul> \n <li>Optimize geographic placement of workloads for user locations</li> \n <li>Optimize areas of code that consume the most time or resources</li> \n <li>Optimize impact on customer devices and equipment</li> \n <li>Implement a data classification policy</li> \n <li>Use lifecycle policies to delete unnecessary data</li> \n <li>Minimize data movement across networks</li> \n <li>Optimize your use of GPUs</li> \n <li>Adopt development and testing methods that allow rapid introduction of potential sustainability improvements</li> \n <li>Increase the utilization of your build environments</li> \n</ul> \n<p>Many of these best practices are generic and apply to all workloads, while others are specific to some use cases, verticals, and compute platforms. I’d highly encourage you to dive into these practices and identify the areas where you can achieve the most impact immediately.</p> \n<p>Transforming sustainability into a non-functional requirement can result in cost effective solutions and directly translate to cost savings on AWS, as you only pay for what you use. In some cases, meeting these non-functional targets might involve tradeoffs in terms of uptime, availability, or response time. Where minor tradeoffs are required, the sustainability improvements are likely to outweigh the change in quality of service. It’s important to encourage teams to continuously experiment with sustainability improvements and embed proxy metrics in their team goals.</p> \n<p><strong><span>Available Now<br /> </span></strong>The AWS Well-Architected Sustainability Pillar is a new addition to the existing framework. By using the design principles and best practices defined in the Sustainability Pillar Whitepaper, you can make informed decisions balancing security, cost, performance, reliability, and operational excellence with sustainability outcomes for your workloads on AWS.</p> \n<p><a href=\"https://docs.aws.amazon.com/wellarchitected/latest/sustainability-pillar/sustainability-pillar.html\">Learn more about the new Sustainability Pillar.</a></p> \n<p>— <a href=\"https://twitter.com/alex_casalboni\">Alex</a></p>","author":"Alex Casalboni","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"c0b9be38d65116fdbb5c17d3f9f9a730d1c88544ffa79104aeb3083f888dd459","category":"Tech"}