{"title":"The role of Zambia’s expansive Inter-agency Coordinating Committee (ICC) in supporting evidence-based vaccine and health sector programming","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002820","date":1717077600000,"content":"<p>by Zoe Sakas, Katie Rodriguez, Kyra A. Hester, Roopa Darwar, Bonheur Dounebaine, Anna S. Ellis, Simone Rosenblum, Kimberley R. Isett, Walter Orenstein, Matthew C. Freeman, William Kilembe, Robert A. Bednarczyk</p>\r\n\r\nNew vaccines, technologies, and regulations, alongside increased demand for vaccines, all require prioritization and coordination from key players within the vaccine sector. Inter-agency Coordinating Committees (ICC) support decision-making and coordination at the national-level and act as key drivers for sustainable improvements in vaccination programming. We utilized a previous qualitative case study, which investigated critical success factors for high routine immunization coverage in Zambia from 2000–2018, specifically to study the Zambian ICC. Qualitative data were collected between October 2019 and February 2020, including key informant interviews (n = 66) at the national, provincial, district, and health facility levels. Thematic analysis was applied to understand the role of the Zambian ICC and its impact on the policy environment over time. Within our study period, the ICC demonstrated the following improvements: 1) expanded membership to include diverse representation; 2) expanded scope and mandate to include maternal and child health in decision-making; and 3) distinct roles for collaboration with the Zambia Immunization Technical Advisory Group (ZITAG). The diverse and expansive membership of the Zambian ICC, along with its ability to foster government commitment and lobby for additional resources, supported improvements in immunization programming. The Zambian ICC holds considerable influence on government agencies and external partners, which facilitates procurement of funding, policy decisions, and strategic planning.","author":"Zoe Sakas","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c0cc7edc96ad00843a51047f44798125e7e01aafc4b0783ca34ffb1d577e9ee5","category":"Environment"}