{"title":"AirTag 'Lost Mode' Vulnerability Can Redirect Users to Malicious Websites","link":"https://www.macrumors.com/2021/09/28/airtag-lost-mode-vulnerability/","date":1632869223000,"content":"The AirTag feature that allows anyone with a smartphone to scan a lost AirTag to locate the contact information of the owner can be abused for phishing scams, according to a new report shared by <a href=\"https://krebsonsecurity.com/2021/09/apple-airtag-bug-enables-good-samaritan-attack/\">KrebsOnSecurity</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/f1618938547.jpg\" />\r\n<br />\r\nWhen an AirTag is set in Lost Mode, it generates a URL for https://found.apple.com and it lets the AirTag owner enter a contact phone number or email address. Anyone who scans that AirTag is then directed automatically to the URL with the owner's contact information, with no login or personal information required to view the provided contact details.\r\n<br />\r\n\r\n<br />\r\nAccording to KrebsOnSecurity, Lost Mode does not prevent users from injecting arbitrary computer code into the phone number field, so a person who scans an AirTag can be redirected to a phony <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> login page or another malicious site. Someone who does not know that no personal information is required to view an AirTag's information could then be tricked into providing their ‌iCloud‌ login or other personal details, or the redirect could attempt to download malicious software.\r\n<br />\r\n\r\n<br />\r\nThe AirTag flaw was found by security consultant Bobby Raunch, who told KrebsOnSecurity that the vulnerability makes <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> dangerous. \"I can't remember another instance where these sort of small consumer-grade tracking devices at a low-cost like this could be weaponized,\" he said.\r\n<br />\r\n\r\n<br />\r\nRauch contacted Apple on June 20, and Apple took several months to investigate. Apple told Rauch last Thursday that it would address the weakness in an upcoming update, and asked him not to talk about it in public.\r\n<br />\r\n\r\n<br />\r\nApple did not answer his questions about whether he would receive credit or whether he qualified for the bug bounty program, so he decided to share details on the vulnerability because of Apple's lack of communication.<blockquote>\"I told them, 'I'm willing to work with you if you can provide some details of when you plan on remediating this, and whether there would be any recognition or bug bounty payout',\" Rauch said, noting that he told Apple he planned to publish his findings within 90 days of notifying them. \"Their response was basically, 'We'd appreciate it if you didn't leak this.'\"</blockquote>Last week, security researcher Denis Tokarev made several zero-day iOS vulnerabilities public after Apple ignored his reports and failed to fix the issues for several months. Apple <a href=\"https://www.macrumors.com/2021/09/27/apple-apologizes-for-ignoring-ios-vulnerabilities/\">has since apologized</a>, but the company is continuing to receive criticism for its bug bounty program and the slowness with which it responds to reports.<div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airtags.232\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/28/airtag-lost-mode-vulnerability/\">AirTag 'Lost Mode' Vulnerability Can Redirect Users to Malicious Websites</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airtag-lost-mode-vulnerability-can-redirect-users-to-malicious-websites.2314264/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=pF6RetypE0U:tAqZGzw382M:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=pF6RetypE0U:tAqZGzw382M:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/pF6RetypE0U\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c0cd25e20367e1df5c6f6a6272c89071ebfbf7c50a7cd35f632523305f951938","category":"Apple"}