{"title":"Apple patches Log4Shell iCloud vulnerability that set internet ‘on fire’","link":"https://www.macworld.com/article/559108/icloud-patch-log4shell-exploit.html","date":null,"content":"<div>\n<section><div></div></section><p>Late last week, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.lunasec.io/docs/blog/log4j-zero-day/&amp;xcust=1-1-559108-1-0-0&amp;sref=https://www.macworld.com/feed\">cybersecurity firm LunaSec</a> uncovered a critical vulnerability in the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://logging.apache.org/log4j/2.x/security.html&amp;xcust=1-1-559108-1-0-0&amp;sref=https://www.macworld.com/feed\">open-source Log4j library</a> that could give hackers the ability to run malicious code on remote servers. Countless apps and services were said to be vulnerable by the exploit, known as Log4Shell, including iCloud, Minecraft, and countless others.</p>\n\n\n\n<p>According to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://eclecticlight.co/2021/12/12/last-week-on-my-mac-when-the-internet-caught-fire/comment-page-1/&amp;xcust=1-1-559108-1-0-0&amp;sref=https://www.macworld.com/feed\">Eclectic Light Company</a>, Apple has patched the iCloud hole. The site reports that researchers were able to demonstrate the vulnerability when connecting to iCloud through the web on December 9 and December 10, the same vulnerability no longer worked on December 11. The exploit doesn’t appear to have affected macOS.</p>\n\n\n\n<p>The vulnerability was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.minecraft.net/en-us/article/important-message--security-vulnerability-java-edition&amp;xcust=1-1-559108-1-0-0&amp;sref=https://www.macworld.com/feed\">exploited in Minecraft</a> before Microsoft patched it over the weekend. According to security researchers, a hacker merely had to do was paste a seemingly innocuous message into the chat box to compromise Minecraft’s servers. Similar methods of exploitation can be used to hack into any app running the free software. Check Point estimates that some 850,000 attacks were attempted within just 72 hours of the initial outbreak. It’s not clear if Apple’s iCloud was among the targeted systems.</p>\n\n\n\n<p>It’s unclear how many apps are affected by the bug, but the use of log4j is extremely widespread. Crowdstrike’s Adam Meyers said the vulnerability has been “fully weaponized” and tools were readily available to exploit it. “The internet’s on fire right now,” he added shortly after the exploit was made public. </p>\n\n\n\n<p>The Apache Software Foundation, which runs the project, rated it a 10 on its risk scale due to the ease of which it could be exploited and the widespread nature of the tool. The Log4j library is used around the web for logging, a universal practice among web developers. Apache has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://logging.apache.org/log4j/2.x/security.html&amp;xcust=1-1-559108-1-0-0&amp;sref=https://www.macworld.com/feed\">pushed out an update</a>, but the ubiquitousness of the Java tool means many apps are still vulnerable. CEO of cybersecurity firm Tenable Amit Yoran called it “the single biggest, most critical vulnerability of the last decade.” </p>\n\n\n\n<p>However, even if you use one of the affected apps, your Mac won’t be at risk. When exploited, the bug affects the server running Log4j, not the client computers, although it could theoretically be used to plant a malicious app that then affects connected machines. However, if you host your own server and run any sort of logging methods on your Mac, you should run the fix, as you might be at risk and not know it.</p>\n\n\n\n<p><strong>Update 12/14:</strong> <em>Check Point reports that some 850,000 attacks have been waged since the Log4Shell exploit was publicized.</em></p>\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c0d228c221ec96f84324f97358495fb168c1dd9719781c1215ea60568186080a","category":"Apple"}