{"title":"Penetration of Non-Adhesive Gel-Like Embolic Materials During Dural Vessels Embolization According to Characteristics of Tantalum Powder","link":"https://www.preprints.org/manuscript/202410.1839/v1","date":1729695497000,"content":"Tantalum powder is included into the composition of Non-Adhesive Gel-like Embolic Materials (NAGLEMs) for X-ray opacity. The duration of X–ray opacity during embolization is primarily associated with the particle size, which differs in the most used NAGLEMs - ONYX (Medtronic) and SQUID (Balt). NAGLEMs are widely used for embolization of branches of the middle meningeal artery (MMA) in patients with chronic subdural hematomas (CSDH). Considering the size (5-15 microns) of the target dural vessels, we assumed that not only the viscosity of NAGLEMs, but also the size and shape of tantalum granules may be important for the penetration of these gel-like embolic agents and determine their behavior. We obtained a significant difference – the sample SQUID 18 contains medium-sized granules, which are ten times smaller than the tantalum granules in the sample ONYX 18- 0.443± 0.086 (M ± SD) vs 5.2± 0.33 (M ± SD). Tantalum granules in SQUID 18 have a regular spherical shape, in ONYX 18 they have an irregular angular shape. When comparing the behavior of gel-like embolic agents of the same viscosity during MMA embolization in patients with CSDH (an average age of 62.2 ± 14.3 years), in the group, where SQUID 18 (n=8) was used, the gel-like embolic agent in dural vessels demonstrated significantly greater penetration ability compared with the group where ONYX 18 (n=8) was used. Accordingly, not only the viscosity of NAGLEMs, but also the size and shape of tantalum granules can have a significant effect on the penetration ability of gel compositions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c0dda0d6f8ab0fb900c62629eed4f1b6591bc72b28d8f5a83380bcb87cb802d2","category":"Interdisciplinary"}