{"title":"Giulio Ciccone leaves the Giro d’Italia ahead of stage 18","link":"https://cyclingtips.com/2021/05/giulio-ciccone-leaves-the-giro-ditalia-ahead-of-stage-18/","date":1622127765000,"content":"<p>Giulio Ciccone (Trek-Segafredo) was unable to start stage 18 of the Giro d’Italia after crashing on Wednesday.</p>\n\n\n\n<p>The two-time Giro stage winner was one of many riders caught up in a crash with around 25 km to go on stage 17, the same pile-up that brought down <a href=\"https://cyclingtips.com/2021/05/remco-evenepoel-is-out-of-the-giro-ditalia-after-crashing-on-stage-17/\">Remco Evenepoel</a>. Ciccone was able to get back on his bike without much delay and finished the stage in 28th, holding on to a top 10 position on GC.</p>\n\n\n\n<p>Along with teammates Amanuel Ghebreigzabhier and Vincenzo Nibali who also hit the deck, Ciccone was assessed by medical staff after the finish and again on the morning of stage 18, the team announcing that he had “suffered a heavy contusion to the lumbar area of his back and left hand”. All three were present at the sign-on in Rovereto, but Trek-Segafredo then made a late decision to withdraw the young Italian.</p>\n\n\n<blockquote>\n<p>Unfortunately <a href=\"https://twitter.com/giuliocicco1?ref_src=twsrc%5Etfw\">@giuliocicco1</a> won’t start stage 18. The rider had a hard night with a fever. He initially signed his presence at the podium but, after a further evaluation by team doctor, considering his heavily weakened state, the team decided to stop him to safeguard his health <a href=\"https://t.co/t4hhxYohqC\">pic.twitter.com/t4hhxYohqC</a></p>\n<p>— Trek-Segafredo (@TrekSegafredo) <a href=\"https://twitter.com/TrekSegafredo/status/1397850300514459650?ref_src=twsrc%5Etfw\">May 27, 2021</a></p></blockquote>\n<p> </p>\n\n\n<p>Usually a stage hunter, Giulio Ciccone was having a great race as joint leader with former Giro winner Nibali, showcasing his characteristic attacking style as early as stage 3, while also maintaining the consistency required to hold a top-10 position overall.</p>\n\n\n\n<p>He leaves the 2021 Giro d’Italia empty-handed but having proven himself as a possible GC contender.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/giulio-ciccone-leaves-the-giro-ditalia-ahead-of-stage-18/\">Giulio Ciccone leaves the Giro d’Italia ahead of stage 18</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c0de448662bfbca902d36ab24a9fed4348e4250b8dc327669951886089cd665b","category":"Cycling"}