{"title":"Chinese herbal compound preparation Qing-Xin-Jie-Yu granules for intermediate coronary lesions in patients with stable coronary artery disease: Study protocol for a multicenter, randomized, double-blind, placebo-controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307074","date":1721138400000,"content":"<p>by Luying Chen, Lulu Dai, Jiawei Xu, Lian Duan, Xiaoxia Hou, Lu Zhang, Libo Song, Fangfang Zhao, Yuerong Jiang</p>\r\nIntroduction <p>Despite the available secondary preventive treatments, the management of stable coronary artery disease (SCAD) remains challenging. Intermediate coronary lesion (ICL), defined as luminal stenosis between 50% and 70%, is a key stage of SCAD. However, existing therapeutic strategies are limitated in delaying plaque progression and associated with various adverse effects and economic burdens. Qing-Xin-Jie-Yu Granules (QXJYG) with proven anti-platelet, anti-inflammatory, and lipid-lowering effects may compensate for the drawbacks of current treatments and can be tested as a complementary therapy. Therefore, this study aims to investigate the efficacy and safety of QXJYG in treating ICL, with a particular focus on its impact on myocardial ischemia and plaque progression.</p> Materials and methods <p>This is a multicenter, randomized, double-blind, placebo-controlled trial. A total of 120 participants with ICL will be randomly assigned to two groups in a 1:1 ratio. In addition to basic medications, the intervention group will receive QXJYG, while the control group will receive a placebo for over 6 months, followed by a 12-month follow-up. The primary efficacy outcome is computed tomography-derived fractional flow reserve. The secondary outcomes include the degree of coronary stenosis, coronary artery calcification score, Gensini score, Seattle Angina Questionnaire score, high-sensitivity C-reactive protein, matrix metalloproteinase-9, blood lipids, and carotid artery ultrasound parameters. Major adverse cardiovascular events are recorded as endpoints. The safety outcomes include composite events of bleeding, laboratory test results, and adverse events. Clinical visits are scheduled at baseline, every 2 months during the treatment, and after a 12-month follow-up.</p> Discussion <p>This trial is anticipated to yield reliable results to verify the efficacy and safety of QXJYG in the treatment of ICL, which will provide novel insights to help address the prevailing therapeutic dilemma of ICL, thereby facilitating for the management of SCAD.</p> Trial registration <p>Chinese Clinical Trial Registry, ChiCTR2200059262. Registered on April 27, 2022.</p>","author":"Luying Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0e18b0484b2bd417578f7afb57705c876bf475a406dd2bc212cd641f5944aca","category":"Interdisciplinary"}