{"title":"Adoption of antithrombotic stewardship and utilization of clinical decision support systems—A questionnaire-based survey in Dutch hospitals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306033","date":1718978400000,"content":"<p>by Jetske Graafsma, Joanna E. Klopotowska, Hieronymus J. Derijks, Ewoudt M. W. van de Garde, Rien H. L. Hoge, Marieke J. H. A. Kruip, Karina Meijer, Fatma Karapinar-Carkit, Patricia M. L. A. van den Bemt</p>\r\n\r\nAntithrombotics require careful monitoring to prevent adverse events. Safe use can be promoted through so-called antithrombotic stewardship. Clinical decision support systems (CDSSs) can be used to monitor safe use of antithrombotics, supporting antithrombotic stewardship efforts. Yet, previous research shows that despite these interventions, antithrombotics continue to cause harm. Insufficient adoption of antithrombotic stewardship and suboptimal use of CDSSs may provide and explanation. However, it is currently unknown to what extent hospitals adopted antithrombotic stewardship and utilize CDSSs to support safe use of antithrombotics. A semi-structured questionnaire-based survey was disseminated to 12 hospital pharmacists from different hospital types and regions in the Netherlands. The primary outcome was the degree of antithrombotic stewardship adoption, expressed as the number of tasks adopted per hospital and the degree of adoption per task. Secondary outcomes included characteristics of CDSS alerts used to monitor safe use of antithrombotics. All 12 hospital pharmacists completed the survey and report to have adopted antithrombotic stewardship in their hospital to a certain degree. The median adoption of tasks was two of five tasks (range 1–3). The tasks with the highest uptake were: drafting and maintenance of protocols (100%) and professional’s education (58%), while care transition optimization (25%), medication reviews (8%) and patient counseling (8%) had the lowest uptake. All hospitals used a CDSS to monitor safe use of antithrombotics, mainly via basic alerts and less frequently via advanced alerts. The most frequently employed alerts were: identification of patients using a direct oral anticoagulant (DOAC) or a vitamin K antagonist (VKA) with one or more other antithrombotics (n = 6) and patients using a VKA to evaluate correct use (n = 6), both reflecting basic CDSS. All participating hospitals adopted antithrombotic stewardship, but the adopted tasks vary. CDSS alerts used are mainly basic in their logic.","author":"Jetske Graafsma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0e3f5305b0361184f03082406f92bddff21b8b8dc05806c5827cb147483e31a","category":"Interdisciplinary"}