{"title":"Empirical assessment of methane emissions, socioeconomic factors, and infant mortality in Europe","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12385?af=R","date":1704439759000,"content":"<h2>Abstract</h2>\n<p>The 2030 United Nations Sustainable Development Goals (SDG) Target 3.9 aims to “<i>reduce the number of deaths and illnesses from hazardous chemicals and air</i>, <i>water and soil pollution and contamination.</i>” Methane belongs to the class of greenhouse gases and it is a harmful ambient atmospheric pollutant with adverse effects on human health. Hence, this paper aligns with SDG 3 and 11 to analyze the impact of methane emissions on infant mortality rate in Europe. Using an unbalanced panel data on 53 European countries from 1990 to 2018, we probe if the impact differs by union membership. Consistent findings from static and dynamic panel data techniques reveal that: methane emissions exhibit mortality-inducing properties on the full sample, European Union (EU) and non-EU countries by 0.041%, 0.037%, and 0.047%, respectively; EU countries show lower mortality rates relative to non-EU countries by −0.164%; and mortality rate is persistent. Additional sensitivity checks by including nitrous oxide as a regressor indicates that it picks up the mortality effects of methane emissions due to collinearity (in the static analysis) but the aggravating impact of methane is upheld in the dynamic model. Likewise, the results are sustained when we control for outliers by excluding Russia (the largest emitter in Europe) and robustness checks using under-5 mortality rate uphold the mortality-increasing effect of methane emissions. Based on our empirical investigations, adequate policy recommendations are provided to help in stemming the harmful effects of methane emissions on the environment such that it reduces its adverse effect on infant mortality rate in Europe. These outcomes enrich the health economics and child health literature, and policy recommendations are discussed.</p>","author":"Bosede Ngozi Adeleye, \nAviral Kumar Tiwari","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"c0e6a3d6a51156758ccfa09b17ec78322fc6417d02594230fd20a70861a7a4fb","category":"Environment"}