{"title":"How does urbanization affect natural selection?","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14667?af=R","date":1727675937000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/eb76d0ad-90f7-4f0c-9d53-15990d942ae1/fec14667-toc-0001-m.png\" alt=\"How does urbanization affect natural selection?\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/20/is-natural-selection-really-stronger-in-cities/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUrbanization is one of the most significant contributors to the Anthropocene, and urban evolutionary ecology has become an important field of research. While it is commonly assumed that cities impose new and stronger selection, the contradictory assertion that selection may be relaxed in cities is also frequently mentioned, and overall, our understanding of the effects of urbanization on natural selection is incomplete.\n\nIn this review, we first conduct a literature search to find evidence for patterns of natural selection on phenotypic traits including morphology, physiology, behaviour and life history, in urban and non-urban populations of animals and plants. This search reveals that coefficients of natural selection in the context of urbanization are scarce (<i>n</i> = 8 studies providing selection gradients/differentials that include a total of <i>n</i> = 200 coefficients) and a lack of standardized methods hinders quantitative comparisons across studies (e.g. with meta-analysis). These studies, however, provide interesting insight on the agents shaping natural selection in cities and improve our mechanistic understanding of selection processes at different spatial scales.\n\nWe then perform a second literature search to review genomic studies assessing selection intensity in cities, on the genome of non-human natural populations. While this search returns 383 articles, only 34 of these truly investigate footprints of selection associated with urbanization, and only one study provides urban genetic selection coefficients. Here again, we find highly heterogeneous approaches, yet some studies provide strong evidence of genomic footprints of urban adaptation.\n\nIn neither the phenotypic nor genomic literature review were we able to quantitatively assess natural selection across urban versus non-urban habitats. Thus, we propose a roadmap of how future studies should provide standardized metrics to facilitate mega- or meta-analyses and explore generalized effects of urbanization on selection.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/20/is-natural-selection-really-stronger-in-cities/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Résumé</h2>\n<p>\n\nL'urbanisation est l'une des grandes transformations planétaires de l'Anthropocène, et l'écologie évolutive urbaine est devenue un domaine de recherche majeur. S'il est communément admis que les villes entrainent une sélection naturelle nouvelle et plus forte, l'affirmation contradictoire selon laquelle la sélection peut être relâchée dans les villes est également fréquemment mentionnée. Dans l'ensemble, notre compréhension des effets de l'urbanisation sur la sélection naturelle est incomplète.\n\nDans cette étude, nous examinons la littérature ayant évalué des patrons de la sélection naturelle agissant sur les traits phénotypiques, notamment la morphologie, la physiologie, le comportement et les traits d'histoire de vie, dans des populations urbaines et non-urbaines d'animaux et de plantes. Cette recherche révèle que les coefficients de sélection naturelle dans le contexte de l'urbanisation sont rares (n = 8 études fournissant des gradients/différentiels de sélection pour un total de <i>n</i> = 200 coefficients) et que l'absence de méthodes normalisées entrave les comparaisons quantitatives entre les études (par ex. méta-analyse). Ces études identifient toutefois des agents qui façonnent la sélection naturelle dans les villes et améliorent notre compréhension mécaniste des processus de sélection à différentes échelles spatiales.\n\nUne deuxième recherche bibliographique porte sur les études génomiques évaluant l'intensité de la sélection dans les villes, dans des populations naturelles non humaines. Parmi les 383 articles issus de cette recherche, seuls 34 ont véritablement étudié les empreintes de la sélection associée à l'urbanisation, et une seule étude fournit des coefficients de sélection génétique en milieu urbain. Les approches sont, ici encore, très hétérogènes, même si certaines études fournissent des preuves solides d'empreintes génomiques de l'adaptation urbaine.\n\nL'analyse de la littérature phénotypique et génomique ne nous permet pas de comparer quantitativement la sélection naturelle dans les habitats urbains <i>versus</i> non urbains. Nous proposons donc une feuille de route sur la manière dont les études futures pourraient fournir des métriques standardisées pour faciliter les méga- ou méta-analyses, et explorer les effets généralisés de l'urbanisation sur la sélection.\n</p>","author":"Anne Charmantier, \nTracy Burkhard, \nLaura Gervais, \nCharles Perrier, \nAlbrecht I. Schulte‐Hostedde, \nMegan J. Thompson","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"c0ec6092c88614eafaab7fef9d7d282c3a418d72c34ab2f469297648ab4e7623","category":"Environment"}