{"title":"A qualitative exploration of the over-the-counter availability of oral contraceptive pills in Australia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305085","date":1718028000000,"content":"<p>by Zobaida Ahmed, Yuanyuan Gu, Kompal Sinha, Mutsa Mutowo, Natalie Gauld, Bonny Parkinson</p>\r\nIntroduction <p>The prevention of unintended pregnancy is a public health issue affecting women worldwide. In Australia, women are required to get a prescription to obtain the oral contraceptive pill (OCP), which may limit access and be a barrier to its initiation and continuing use. Changing the availability of the OCP from prescription-only to over-the-counter (OTC) is one solution, however, to ensure success policymakers need to understand women’s preferences. Telehealth services also might serve as an alternative to obtain prescriptions and increase accessibility to OCPs. This study aims to explore the preferences for OTC OCPs among Australian women, and whether the expansion of telehealth impacted women’s preferences.</p> Methods <p>A mixed methods approach was used to explore women’s preferences regarding access to the OCP. Focus group discussions (FGDs) were conducted to organically identify the preferences followed by an empirical ranking exercise. Three FGDs in two phases were conducted, pre and post-expansion of telehealth in Australia due to the COVID-19 pandemic. Convenience sampling was employed. The technique of constant comparison was used for thematic analysis where transcripts were analysed iteratively, and codes were allowed to emerge during the process to give the best chance for the attributes to develop from the data.</p> Results <p>Thematic analysis revealed that women perceived OTC availability of OCPs as a mechanism to increase the accessibility of contraception by reducing cost, travel time, waiting time, and increasing opening hours. They also believed that it would increase adherence to OCPs. However, some potential safety concerns and logistical issues were raised, including pharmacist training, access to patient’s medical history, the ability to discuss other health issues or undertake opportunistic health screening, adherence to checklists, and privacy in the pharmacy environment. Following the expansion of telehealth, accessibility issues such as opening hours, travel time, and location of the facility were considered less important.</p> Conclusions <p>The participants expressed their support for reclassifying OCPs to OTC, particularly for repeat prescriptions, as it would save valuable resources and time. However, some safety and logistical issues were raised. Women indicated they would balance these concerns with the benefits when deciding to use OTC OCPs. This could be explored using a discrete choice experiment. The expansion of telehealth was perceived to reduce barriers to accessing OCPs. The findings are likely to be informative for policymakers deciding whether to reclassify OCPs to OTC, and the concerns of women that need addressing to ensure the success of any policy change.</p>","author":"Zobaida Ahmed","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0ef8939b8628f0b7241f93aa36f76bdf69837426ea493c8981b553364c7bc4a","category":"Interdisciplinary"}