{"title":"Consul Enterprise Long-Term Support (LTS) improves operational efficiency","link":"https://www.hashicorp.com/blog/consul-enterprise-long-term-support-lts-improves-operational-efficiency","date":1709748000000,"content":"<p>We are pleased to announce a Long-Term Support (LTS) release program for HashiCorp Consul Enterprise, starting with versions 1.15 and 1.18. Going forward, the first major release of each calendar year, typically in late February, will be an LTS release.</p>\n\n<h2>The challenge: balancing operational overhead and risk</h2>\n\n<p>Organizations often face a dilemma related to maintaining and updating mission-critical software.</p>\n\n<p>On one side is the cost of <em>action</em>. No matter how technically simple or reliable an upgrade is, all upgrades involve effort and risk. To minimize risk, major upgrades may need months to plan, test, approve, and deploy. Frequent upgrades may be too costly in terms of operational burden. And every major upgrade has some risk, no matter how much due diligence is performed.</p>\n\n<p>On the other side is the cost of <em>inaction</em>. All software has defects and security vulnerabilities that are discovered and fixed in future versions. Without upgrading, organizations remain susceptible to emerging issues that introduce risk to their business.</p>\n\n<p>How can an organization balance the costs of action versus inaction in upgrading mission critical software, such as HashiCorp Consul?</p>\n\n<h2>The solution: Long-Term Support releases</h2>\n\n<p>With Consul Enterprise LTS releases, organizations can reduce both operational overhead <em>and</em> risk. It enables organizations to receive critical fixes in minor releases without having to upgrade their major version more than once a year.</p>\n\n<p>Consul Enterprise is the first of several HashiCorp commercial products to offer LTS releases with the following key characteristics:</p>\n\n<ul>\n<li><strong>Extended maintenance:</strong> Two years of critical fixes provided through minor releases</li>\n<li><strong>Efficient upgrades:</strong> Support for direct upgrades from one LTS release to the next, reducing major version upgrade risk and improving operational efficiency</li>\n</ul>\n\n<p>Consul Enterprise LTS releases offer several key advantages compared to the industry standard and to standard Consul releases, as shown in this table:</p>\n\n<table>\n  <tr>\n   <td><strong>Characteristic</strong>\n   </td>\n   <td><strong>Industry standard</strong>\n   </td>\n   <td><strong>Consul Enterprise standard release</strong>\n   </td>\n   <td><strong>Consul Enterprise LTS release</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>Release lifetime\n   </td>\n   <td>7 - 15 months\n   </td>\n   <td>12 months\n   </td>\n   <td><strong>24</strong> months\n   </td>\n  </tr>\n  <tr>\n   <td>Maximum upgrade jump\n   </td>\n   <td>+2 major versions\n   </td>\n   <td>+2 major versions\n   </td>\n   <td><strong>+3</strong> major versions (from one LTS to the next)\n   </td>\n  </tr>\n  <tr>\n   <td>Average time between major version upgrades\n   </td>\n   <td>3 - 6 months\n   </td>\n   <td>4 - 8 months\n   </td>\n   <td><strong>12</strong> months\n   </td>\n  </tr>\n</table>\n\n<h2>Getting started with Consul Enterprise LTS</h2>\n\n<p>LTS is available now to all Consul Enterprise customers with self-managed deployments. To upgrade your Consul Enterprise deployment to an LTS version (1.15 or 1.18), refer to Consul’s <a href=\"https://developer.hashicorp.com/consul/docs/upgrading/instructions\">upgrade documentation</a>. If you currently have Consul Enterprise 1.15 deployed, you’re already running a maintained LTS version — no further action is required at this time.</p>\n\n<p>Once you’re running a maintained version of Consul Enterprise LTS, HashiCorp <a href=\"https://developer.hashicorp.com/consul/docs/enterprise/long-term-support#annual-upgrade-to-next-lts-release\">recommends upgrading once a year to the next LTS version</a>. This upgrade pattern ensures your organization is always operating a maintained release, minimizes major version upgrades, and maximizes predictability for your planning purposes.</p>\n\n<p>For more information, refer to the <a href=\"https://developer.hashicorp.com/consul/docs/enterprise/long-term-support\">Consul Enterprise LTS documentation</a> and to <a href=\"https://www.hashicorp.com/long-term-support\">HashiCorp’s multi-product LTS statement</a>.</p>\n\n<h2>Next steps for HashiCorp Consul</h2>\n\n<ul>\n<li>Get started with Consul through our many <a href=\"https://developer.hashicorp.com/consul/tutorials\">tutorials</a> for both beginners and advanced users.</li>\n<li>Learn more about <a href=\"https://developer.hashicorp.com/consul/docs/enterprise\">Consul Enterprise’s capabilities</a> by starting a <a href=\"https://www.hashicorp.com/products/consul/trial\">free trial</a>.</li>\n</ul>\n","author":"Jared Kirschner","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"c0ef2b00b616bd7a912932c1b801b2d75b9b5dd795155e78be85f559c7a4fb36","category":"Tech"}