{"title":"A Novel Energy Replenishment Algorithm to Increase Network performance of Rechargeable Wireless Sensor Network","link":"https://www.preprints.org/manuscript/202409.0622/v1","date":1725865401000,"content":"The emerging wireless energy transfer technology enables sensor nodes to maintain perpetual operation. However, maximizing the network performance while preserving short charging delay is a great challenge. In this work, a Wireless Mobile Charger (WMC) and a Directional Charger (DC) are deployed to transmit wireless energy to the sensor node to improve the network's throughput. To the best of our knowledge, this is the first work to optimize the data sensing rate and charging delay by joint scheduling of MC and DC. We prove we can transmit maximum energy to each sensor node to obtain our optimization objective. In our proposed work, a DC selects a total horizon of  equipped with DCs, which selects the horizon of each specific area with  based on its antenna orientation. DC's orientation is scheduled for each time slot. Furthermore, multiple MCs are used to transmit energy for sensor nodes which cannot be covered by DCs. We divided the Rechargeable Wireless Sensor Network into several zones via the Voronoi diagram. We deployed a static DC and one MC charging location in each zone to provide wireless charging service jointly. We obtain the optimal charging location of MCs in each zone by solving Mix Integral Programming for energy transmission. The optimization objective of our proposed research is to sense maximum data from each sensor node with the help of maximum energy. The lifetime of each sensor network can increase, and the end delay can be maximized with joint energy transmission. Extensive simulation results demonstrate that our RWSNs are designed significantly to improve network lifetime over the baseline method.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c0f020a87fe73069783ba8ae48502e4944c7cad92ed0d219760fbcb428376a5d","category":"Interdisciplinary"}