{"title":"Association of lymphocyte count and serum albumin concentration with telomere length in Chinese sanitation workers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311736","date":1728568800000,"content":"<p>by Xingxu Song, Dafeng Lin, Dianpeng Wang, Shaofan Weng, Shuyi Qiu, Wei Zhou, Aipin Xiao, Naixing Zhang</p>\r\nObjective <p>This study aimed to examine the association between inflammation-related indicators (IRIs) and telomere length (TL) in Chinese sanitation workers.</p> Methods <p>This study adopted a case-control design, conducted from January to December 2022 in Shenzhen, a city in eastern China. A total of 80 sanitation workers, as well as 80 matched controls, were randomly recruited from the Luohu district of Shenzhen city in China. Their blood samples were collected and analyzed for the IRIs and TL in the Medical Laboratory of Shenzhen Prevention and Treatment Center for Occupational Diseases. The relationship between IRIs and TL was analyzed using multivariate linear regression, and their dose-response relationship was explored using restricted cubic spline analysis.</p> Results <p>The systemic inflammatory index (SII), platelet-to-lymphocyte ratio (PLR), and neutrophil-to-lymphocyte ratio (NLR) were significantly elevated in the sanitation workers in comparison to the controls. Moreover, the lymphocyte count (LYM), serum albumin concentration (ALB), and TL were found to be lower in the sanitation workers compared to the controls (<i>P</i> &lt; 0.05). After adjusting for potential confounding variables, LYM was negatively correlated with TL in the sanitation workers (β = -0.31, 95% CI: -0.57, -0.05), whereas no correlation was observed in the controls. Furthermore, ALB demonstrated a non-linear relationship with TL in sanitation workers.</p> Conclusion <p>We found higher novel inflammatory markers (SII, PLR, and NLR) in the sanitation workers, and identified a correlation between LYM and ALB with shortened TL in them, providing new evidence for the effect of elevated inflammation on accelerated aging in Chinese sanitation workers.</p>","author":"Xingxu Song","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c0f6caebe70b7cd3d03bee689517b3926f57b35fc83080d36601204ccaf0a9d3","category":"Interdisciplinary"}