{"title":"Searching for solutions to a crisis decades in the making","link":"https://arstechnica.com/?p=1809038","date":1635683735000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1310201727-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1310201727.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/worker-at-a-recycling-processing-facility-royalty-free-image/1310201727?adppopup=true\">Makiko Tanigawa / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Island Press is “the nation’s leading publisher on environmental issues.” In its latest release, <i><span><a href=\"https://www.amazon.com/dp/1642831379/?tag=arstech20-20\">Thicker than Water</a>, </span></i><span>Erica Cirino, a photojournalist and licensed wildlife rehabilitator, explores what becomes of plastic—all 8 billion or so tons of it that humans have manufactured in the last 70-ish years.</span></p>\n<p>Plastic’s greatest strength is also its greatest flaw: it takes eons to break down. It breaks <i><span>apart</span></i><span>, into smaller and smaller micro- and nano-sized particles. But unlike natural materials like wood and glass, plastic doesn't break down into its constituent chemicals. Those micro- and nano-sized particles are still plastic. According to Alice Zhu, a graduate student</span> studying plastics at the University of Toronto, this is because the carbon-carbon bonds that form the backbone of most plastic polymers require an immense amount of energy to break apart. And because these bonds are in synthetic arrangements, there are no microorganisms that can break most of them down (yet).</p>\n<h2>The big asymmetry</h2>\n<p><span>There is a marked disconnect between how long plastic sticks around and how long we get utility from it. Many single-use items, like straws and cutlery, are used for only minutes; thin plastic bags, like those needlessly wrapped around produce and almost everything we order online (and even plastic cutlery), are immediately thrown away. This thin plastic is made of low-density polyethylene, which is the most difficult kind to recycle and emits more climate-warming methane and ethylene when exposed to sunlight than other, harder types of plastic. It is also one of the most commonly produced.</span></p></div><p><a href=\"https://arstechnica.com/?p=1809038#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809038&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c0fa6321bb49583d2d407004a617f689e6553f60a32a8ac8e3cff6078d8504e7","category":"Tech"}