{"title":"Strigolactone-induced degradation of SMXL7 and SMXL8 contributes to gibberellin- and auxin-mediated fiber cell elongation in cotton","link":"https://academic.oup.com/plcell/article/36/9/3875/7719051?rss=1","date":1721779200000,"content":"<span><div>Abstract</div>Cotton (<span>Gossypium</span>) fiber length, a key trait determining fiber yield and quality, is highly regulated by a class of recently identified phytohormones, strigolactones (SLs). However, the underlying molecular mechanisms of SL signaling involved in fiber cell development are largely unknown. Here, we show that the SL signaling repressors MORE AXILLARY GROWTH2-LIKE7 (GhSMXL7) and GhSMXL8 negatively regulate cotton fiber elongation. Specifically, GhSMXL7 and GhSMXL8 inhibit the polyubiquitination and degradation of the gibberellin (GA)-triggered DELLA protein (GhSLR1). Biochemical analysis revealed that GhSMXL7 and GhSMXL8 physically interact with GhSLR1, which interferes with the association of GhSLR1 with the E3 ligase GA INSENSITIVE2 (GhGID2), leading to the repression of GA signal transduction. GhSMXL7 also interacts with the transcription factor GhHOX3, preventing its binding to the promoters of essential fiber elongation regulatory genes. Moreover, both GhSMXL7 and GhSMXL8 directly bind to the promoter regions of the <span>AUXIN RESPONSE FACTOR</span> (<span>ARF</span>) genes <span>GhARF18-10A</span>, <span>GhARF18-10D</span>, and <span>GhARF19-7D</span> to suppress their expression. Cotton plants in which <span>GhARF18-10A</span>, <span>GhARF18-10D</span>, and <span>GhARF19-7D</span> transcript levels had been reduced by virus-induced gene silencing (VIGS) displayed reduced fiber length compared with control plants. Collectively, our findings reveal a mechanism illustrating how SL integrates GA and auxin signaling to coordinately regulate plant cell elongation at the single-cell level.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"c0fbcc3668e5c0a3d83f08eeb5a2c3bd9662355231fea5d60ff9424299c0798b","category":"Environment"}