{"title":"เข้าสู่ยุค VS Code ผ่านเบราว์เซอร์ บริษัท Gitpod โอเพนซอร์สเซิร์ฟเวอร์ให้ทุกคนใช้งาน","link":"https://www.blognone.com/node/125078","date":1633320805000,"content":"<div><div><div><p>นอกจาก GitHub และ GitLab ที่คุ้นชื่อกัน ยังมีบริษัทที่ชื่อขึ้นต้นด้วย Git อีกรายคือ <a href=\"https://www.gitpod.io/\">Gitpod</a> เป็นสตาร์ตอัพหน้าใหม่จากเยอรมนีที่เพิ่งก่อตั้งเมื่อปี 2020</p>\n<p>สิ่งที่ Gitpod ทำคือการสร้าง developer environment บนคลาวด์ที่พร้อมให้นักพัฒนาเรียกใช้งานแบบรีโมทในทันที ไม่ต้องเสียเวลามาเซ็ตสภาพแวดล้อม ติดตั้งโมดูลซอฟต์แวร์ หรือรอสั่งคอมไพล์ ถือเป็นคู่แข่งโดยตรงกับ <a href=\"https://www.blognone.com/node/124221\">GitHub Codespaces ที่เปิดตัวในปีที่แล้วเช่นกัน</a></p>\n<p>บริการของ Gitpod มีทั้งการโฮสต์ dev environment บนคลาวด์ และเครื่องมือพัฒนาคือ VS Code/JetBrains IDE ผ่านเบราว์เซอร์ (เรียกง่ายๆ ว่าชนกับ GitHub Codespaces ทุกอย่าง) โดย Gitpod โฆษณาว่าระบบของตัวเองทำงานเร็วกว่า และราคาถูกกว่าของ GitHub มาก (ราคารุ่นมาตรฐานเหมาจ่ายที่ 25 ดอลลาร์ต่อเดือน ส่วน GitHub ต้องจ่ายตามปริมาณ VM) อีกทั้งเปิดชิ้นส่วนต่างๆ ของบริษัทออกมาเป็นโอเพนซอร์สด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b89664ee92d108c6a2db790363a7a51d.jpg\" /></p>\n<p>ล่าสุด Gitpod โอเพนซอร์สระบบที่ใช้รัน VS Code ผ่านเบราว์เซอร์ออกมาในชื่อ <a href=\"https://github.com/gitpod-io/openvscode-server/\">OpenVSCode Server</a> เพื่อให้คนที่สนใจสามารถรัน VS Code ผ่านเบราว์เซอร์เองโดยไม่ต้องผ่าน Gitpod</p>\n<p>Gitpod บอกว่าระบบเซิร์ฟเวอร์นี้สามารถรัน VS Code รุ่นมาตรฐานได้โดยไม่ต้องปรับแต่ง ไม่ต้องแพตช์ ช่วยลดภาระของการดูแลโค้ดลง โครงการนี้ยังได้รับการสนับสนุนจาก GitLab, VMware, SAP, SUSE และบริษัทอื่นๆ ที่สนใจมาใช้ระบบนี้ด้วย ในขณะที่โซลูชันของ GitHub Codespaces ยังเก็บไว้ใช้เอง ไม่ได้เปิดซอร์สโค้ดออกมา การเปิดซอร์สของ Gitpod จะช่วยสร้างมาตรฐานให้กับวงการ VS Code บนเบราว์เซอร์แทน</p>\n<p>ที่มา - <a href=\"https://www.gitpod.io/blog/openvscode-server-launch\">Gitpod</a>, <a href=\"https://thenewstack.io/gitpod-openvscode-server-brings-visual-studio-code-to-the-browser/\">The New Stack</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gitpod\">Gitpod</a></div><div><a href=\"/topics/visual-studio-code\">Visual Studio Code</a></div><div><a href=\"/topics/open-source\">Open Source</a></div><div><a href=\"/topics/ide\">IDE</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c103b160ced7d3edc99ea06e2b8cff6e99e30da27539af5cf3dc9421118afba9","category":"Thai"}