{"title":"Taking control: Eddie Dunbar’s road to redemption","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/eddie-dunbar-s-road-to-redemption","date":1679385600000,"content":"\n      <p><span>For 22 uninterrupted minutes, Eddie Dunbar has been narrating his entire story of four years at Ineos Grenadiers, summarising almost every race he did in chronological order, barely stopping to breathe nor to allow any follow-up questions. The only time he pauses, midway through, is to apologise. “Sorry, I’m just rambling on now.”</span></p>\n<div></div>\n<p><span>But this is no long-winded monologue without a purpose; the Irishman, in his thick Corkonian tones, is getting a lot off his chest, liberated to share his inner thoughts, lacing his speech with honesty. His reflective nature takes him on a journey of gratefulness and thankfulness, and then to one of disappointment, frustration and just a hint of what-could-have-been. </span></p>\n<p><span>In four years with the British superteam, Dunbar raced just one Grand Tour (the 2019 <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>; 22nd on GC) and nine WorldTour stage races – a paltry return for someone who was granted ‘future star of cycling’ status in his teens.</span></p>\n<p><span>No memory is as painful as the call he received from the team’s deputy principal Rod Ellingworth just before last year’s Giro d’Italia. “I’d won Coppi e Bartali in March and had shown myself there with my best ever power numbers</span><b>.</b><span> I took a short break after the Tour of the Alps as planned, and I was absolutely flying afterwards in training. I thought I was going to the Giro,” he says.</span></p>\n<p><span>“I’d sat down for dinner at my girlfriend’s house in Ireland when I got a call from Rod. I assumed it was a call to say this is what we’re aiming for in the Giro and where he saw me fitting into the team. But he said I’d missed out. I was completely shocked. I didn’t really know what to say to him.” This was the fourth time Dunbar had been omitted from a Grand Tour squad, but this one stung the most.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1410649024.jpg?v=1678965387\" alt /></span><span>He continues: “Being professional at that level, you normally get a reason when you ask why, and you can go away and work on it if there is something. But to this day I still don’t have an answer. I want to be a better bike rider, to improve, and if you don’t get that information why it happened, it’s hard to progress.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-heartwarming-story-of-how-romain-bardet-s-old-bike-is-carrying-the-hopes-of-oman-s-national-champion-the-disciplined-one\"><em><strong>Read more: The heartwarming story of how Romain Bardet's old bike is carrying the hopes of Oman's National Champion</strong></em></a></p>\n<p><span>What riled Dunbar further was his subsequent race schedule. “The thing that most annoyed me is that if you’re looking at it from a performance point of view, I was peaking for the Giro, so then as a coach or a rider, you [should] sit down and plan,” he says. He made it clear that the Critérium du Dauphiné and Tour de Suisse were now his main aims, but the team were sending him to race the Tour de Hongrie first. “I said to my coach if you want me to be good in the Dauphiné and to perform with my [would-be] Giro legs, I can’t do Hungary. That was a good time to stop for a week, absorb the work I’d done and build up slowly for those races.”</span></p>\n<p><span>His pleas fell on deaf ears, though, and he went to Hungary and won, proving he had the form to compete at the Giro which was running concurrently. “I didn't want to do it, but it was reassuring that all the preparation I had done with my coach for the Giro was right, I was in a good condition.”</span></p>\n<p><span>But like he predicted, there was a catch: when he went to the Dauphiné in June, his body was too tired to perform. “It got to June and I had one really bad day at the Dauphiné and my GC ambitions were gone,” he bemoans. “I did try but my body wasn’t there like it was a few weeks previously. I was so fatigued. And then after that my season was pretty much sewn up.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1402456753.jpg?v=1678965717\" alt /></span><span>It was an upsetting end to four years at Ineos that he summarises as “up and down, some good bits, some bad bits.” Sky, as they were then known, had signed him out of the ashes of Aqua Blue in the autumn of 2018 – “they did everything they could and helped me massively,” he says – and 2019 “was really successful, really solid with a lot of top-10 and consistency”. As Sky became Ineos, Dunbar was surprisingly selected for the Giro and he signed a three year contract. “The Giro was never on the cards so that was massive, and then we agreed on a three year deal,” he reflects. “I was thinking at that age (22) I can grow into a leader; that is what I envisioned.”</span></p>\n<p><span>But then the foot was depressed from the accelerator and the gear stick remained firmly planted in neutral for the next three years.</span><span> A saddle sore “the size of a golf ball” ruled him out of the 2019 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> and a change of coach in 2020, coinciding with the Covid calendar, proved a disaster.</span></p>\n<p><span>A broken collarbone then left him beaten in the spring of 2021. “F**k, I was bad mentally,” he rues. He recovered to help Richard Carapaz win the Tour de Suisse and was the first reserve for the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> team. “I should have done the Tour that year. It was the best condition I had ever been in,” he insists. Contracting Covid at the Tokyo Olympics then derailed his season further. “My eyes were on the Vuelta, but I was overlooked there.” </span></p>\n<p><span>Then came 2022, another Grand Tour rejection, and with it the curtain on four rollercoaster seasons with Ineos. “I was very lucky Sky signed me from Aqua Blue and will always be thankful.” But, ultimately, his progression was stunted.</span><span> The positives he can take from it is that he performed when given the chance. “I got two opportunities to lead Ineos in four years, and both times I won.”</span></p>\n<p><span>Dunbar was frequently touted as Ireland’s next big hope as a teenager, but his sporting exploits aren’t limited to cycling. In late 2021, he put on his running shoes and raced against some of Ireland’s best at the Newmarket 5km. He finished in a time of 15.25, at an average pace of 3.05. “I was ahead for the first 500m – it was like being in the breakaway!” he laughs. “The first kilometre I clocked 2-42, and then 2-46. But the speed was killing me and I needed to back off, so I dropped my pace to 3-10, knowing I can run comfortably at that. I finished 15th in the end against a high-quality field.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-many-things-we-learned-from-the-early-season-races\"><em><strong>Read more: What have we learned from the opening men's races so far?</strong></em></a></p>\n<p><span>As a kid, he ran cross-country races at a provincial level, and played Gaelic football and hurling. It was, and still is, rugby that animates him though. “Someone asked me a few weeks ago what I’d watch if there was cycling or rugby on the TV. Especially if it’s Ireland or Munster, I’d pick rugby every day,” he says. “I’m always watching rugby videos or listening to rugby podcasts. I’m fascinated by it.”</span></p>\n<p><span>That sporting background has aided him as a cyclist, he believes. “I was speaking to a knee surgeon at the Tour of Britain one year, and he said that running has a very similar effect to being out of the saddle on the bike, with the same weight bearing and the same muscles being used. When you look at the cyclists who do a bit of running, it’s true. You’ve got the cyclocross guys pushing 1,000 watts out of the saddle; Michael Woods, a former runner, is always standing up; and it’s the same for Adam and Simon Yates.”</span></p>\n<p><span>The latter is now his team-mate at Jayco-AlUla, and though their calendars will mostly differ, they could be used as a one-two attack at the Vuelta later this year. Before that, Dunbar has to get back to racing after fracturing his hand on his team debut at the Volta a Valenciana, and he will then race the Giro.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1461318650.jpg?v=1678965208\" alt /></span><span>“I’ve only done one Grand Tour and that was four years ago!” he says incredulously. “I just need to get more exposure to WorldTour racing because I haven’t done much for four years. That will make the biggest difference to me.”</span><span><br /></span><span><br /></span><span>There were plenty of teams sniffing around him when his contract was up, including Jumbo-Visma, but it was Jayco-Alula’s openness and freedom that made him pen a deal until the end of 2025 with the Australian team. “The main thing is the control I have over what I do. I like to take responsibility for how I perform, and Jayco feel that,” he says. </span></p>\n<p><span>“They’re relaxed, a more chilled out approach to cycling, but very professional, and that fits in with my personality. They treat you like a person. You are an adult: you know what you have to do in a bike race, and they will help you in whatever way they can. There’s a lot of trust in the rider to go away, ride themselves into shape, and the race program won’t change at the last minute. It ticked all the boxes that I was looking for, and a three year deal is incredible.</span></p>\n<p><span>“I’ve got an opportunity to go out, work hard, put in a lot of effort, lead this team in big races, and help other guys win races. The platform, the race program and the help is there. I’m 26 years old now. I’ve learned a lot – now it’s important to put it all into practice.”</span></p>\n<p><em><span>Cover image courtesy of Jayco-Alula</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c111da806a77b332b06ab1adb5ff1ca310555697b08e107bdd6580e406b1e73d","category":"Cycling"}