{"title":"Visualization and Quantification of Facemask Leakage Flows and Interpersonal Transmission with Varying Face Coverings","link":"https://www.preprints.org/manuscript/202406.0352/v1","date":1717753469000,"content":"Although mask-wearing is now widespread, knowledge of how to quantify or improve its performance remains surprisingly limited and largely based on empirical evidence. The objective of this study was to visualize the expiratory airflows from facemasks and evaluate aerosol transmission between two persons. Different visualization methods were explored, including the Schlieren optical system, laser/LED-particle imaging system, thermal camera, and vapor-SarGel system. The leakage flows and escaped aerosols were quantified using a hotwire anemometer and a particle counter, respectively. The results show that mask-wearing reduces the exhaled flow velocity from 2~4 m/s (with no facemask) to around 0.1 m/s, thus decreasing droplet transmission speeds. Cloth, surgical, and KN95 masks showed varying leakage flows at the nose top, sides, and chin. The leakage rate also differed between inhalation and exhalation. The neck gaiter has low filtration efficiency and high leakage fractions, providing low protection efficiency. There was considerable deposition in the mouth-nose area, as well as the neck, chin, and jaw, which heightened the risk of self-inoculation through spontaneous face-touching. A face shield plus surgical mask greatly reduced droplets on the head, neck, and face, indicating that double face coverings can be highly effective when a single mask is insufficient. The vapor-SarGel system provided a practical approach to study interpersonal transmission under varying close contact scenarios or with different face coverings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c11154a455a733fc0bb6f8f2b02a872426fb9fd18e656a898d038a0e007c1d1f","category":"Interdisciplinary"}