{"title":"Topography and soil variables drive the plant community distribution pattern and species richness in the Arjo-Diga forest in western Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307888","date":1722952800000,"content":"<p>by Tariku Berihun Tenaw, Tamrat Bekele Gode, Ermias Lulekal Molla, Zemede Asfaw Woldemariam</p>\r\n\r\nUnderstanding plant community characteristics, distributions, and environmental relationships is crucial for sustainable forest management. Thus, this study examined the relationships between plant community composition and topographic and soil variables within the Arjo-Diga forest. Vegetation data were collected from 72 nested plots (30 × 30 m<sup>2</sup> and 2 × 2 m<sup>2</sup>) systematically laid along nine transects spaced 300 to 700 m apart. Environmental variables, including soil properties and anthropogenic disturbance, were recorded within each main plot. Agglomerative hierarchical cluster analysis and canonical correspondence analysis (CCA) using R software were employed to identify distinct plant community types and examine their relationships with environmental factors. The Shannon‒Wiener diversity index was calculated to quantify and compare species diversity among the identified community types. The analysis revealed five distinct plant community types: 1: <i>Maesa lanceolata-Ehretia cymosa</i>, 2: <i>Trichilia dregeana-Flacourtia indica</i>, 3: <i>Acacia abyssinica-Millettia ferruginea</i>, 4: <i>Combretum collinum-Croton macrostachyus</i>, and 5: <i>Terminalia macroptera-Piliostigma thonningii</i>. The CCA results highlighted the significant influence (p &lt; 0.05) of altitude, CEC, TN, and disturbance on species distribution and plant community formation. The findings indicate that variation in plant communities is closely associated with altitude, TN, and CEC, as well as with disturbance factors such as human interventions, with elevation being the most influential factor. Based on these findings, it is recommended that conservation plans consider the effects of human interventions to address the challenges in conserving forests in the future. Additionally, further research efforts should focus on mitigating disturbance factors and understanding the environmental variables that affect forests to improve their protection.","author":"Tariku Berihun Tenaw","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c11379db49cd72a357cee4bf0e026be5a6c9c16d7264e7cf7fd06cb8f145ef77","category":"Interdisciplinary"}