{"title":"Distinguishing Axillary Lymphadenopathy after COVID-19 Vaccination from Malignant Lymphadenopathy","link":"https://www.preprints.org/manuscript/202404.1454/v1","date":1713869927000,"content":"Objectives: To study the differences between malignant hypermetabolic axillary lymphadenopathy (MHL) and COVID-19 vaccine-associated axillary hypermetabolic lymphadenopathy (VAHL) using clinical imaging. Methods: A total of 1,096 patients underwent Positron Emission Tomography-Computed Tomography (PET-CT) between June 1, 2021 and April 30, 2022, at Ehime University Hospital. In total, 188 patients with axillary lymphadenopathy after the COVID-19 vaccination were evaluated. The patients were classified into three groups such as VAHL (n=27), MHL (n=21), and equivocal hypermetabolic axillary lymphadenopathy (EqHL; n=140). Differences in lymph nodes (LNs) swellings were statistically analyzed using clinical imagings (echography, CT, and 18F-FDG PET) statistically. Results: MHL included a higher female population (90.5%) owing to a higher frequency of breast cancer frequency (80.9%). Axillary LNs of MHL did not show any LN fatty hilums (0%); however, those of VAHL and EqHL did (15.8 and 36%, respectively). After the logistic regression analysis of the patients who had axillary lymphadenopathy without any LN fatty hilums, the minor axis length and ellipticity (minor axis/major axis) in the largest axillary LN, SUVmax, and Tissue-to-Background Ratio (TBR) were useful in distinguishing malignant lymphadenopathies. Receiver-operating characteristic (ROC) analysis indicated that a cut-off value of ≥7.3 mm for the axillary LN minor axis (sensitivity: 0.714, specificity: 0.684) and of ≥0.671 for ellipticity (0.667 and 0.773, respectively) in the largest LN with the highest SUVmax and TBR were predictive of MHL. Conclusion: Axillary lymphadenopathy ≥7.3 mm of the minor axis and ≥0.671 of ellipticity in LN without fatty hilum suggests malignancy even in patients who have received COVID-19 vaccination. Further examinations such as 18F-FDG PET are recommended for such patients","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c113d88812445404148acbf698c3bdaa03a2a637c59210f9c7fafeb7507b1c1c","category":"Interdisciplinary"}