{"title":"Historical mitochondrial genome introgression confounds species delimitation: evidence from phylogenetic inference in the Odorrana grahami species complex","link":"https://academic.oup.com/cz/article/69/1/82/6530281?rss=1","date":1645056000000,"content":"<span><div>Abstract</div>Species delimitation is essential to informing conservation policy and understanding ecological and evolutionary processes. Most of our recent gains in knowledge on animal diversity rely on morphological characteristics and mitochondrial (mt) DNA variation. Concordant results based on both have led to an unprecedented acceleration in the identification of new species and enriched the field of taxonomy. However, discordances are also found commonly between morphological and mtDNA evidence. This confounds species delimitation, especially when gene flow or mt genome introgression has occurred. Here, we illustrate how mt genome introgression among species of the <span>Odorrana grahami</span> complex confounds species delimitation using the combined evidence of morphological characters, mt variation, and thousands of nuclear single-nucleotide polymorphisms (SNPs) from genotyping-by-sequencing (GBS). Fifty-eight samples across the distribution of the <span>O. grahami</span> complex were included. The mtDNA matrilineal genealogy indicated 2 clades, with <span>O. grahami</span> and <span>Odorrana junlianensis</span> clustered together. In contrast, all nuclear evidence including gene trees, species trees, and genetic structure analyses based on GBS data support 3 species with distinct genetic clusters. These 3 distinct genetic clusters also correspond to distinct morphological characters. They affirm the distinct taxonomic entities of both <span>O. grahami</span> and <span>O. junlianensis</span>, as well as a third clade distinct from either. Which species the third clade belongs to remains unclear and will require further testing. The nuclear genomic loci contradict the COI evidence, with indications of rampant historical mt genome introgression among the species of the <span>O. grahami</span> complex. These discordant signals previously confused species delimitation efforts in this group. Based on these findings, we recommend the integration of independent data, especially nuclear genomic evidence, in species delimitation so as to be robust against the pitfalls of mt introgression.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"c11335becdd578b59134ade7fe3c1744f55dc2bff37e7e0ec15145be981f458f","category":"Environment"}