{"title":"จุดจบสายมุด ราคาเกมบน Steam ของอาเจนติน่าและทูร์เคีย พุ่งขึ้นสูงสุด 2900%","link":"https://www.blognone.com/node/136891","date":1700649378000,"content":"<div><div><div><p>Valve เปลี่ยนราคาเกมบน Steam ของอาเจนติน่า และทูร์เคีย (Turkey) เป็นราคาแบบภูมิภาค ทำให้ราคาเกมใน Steam กลายเป็นดอลลาร์สหรัฐ จากเดิมที่เคยเป็นเปโซและลีรา เป้าหมายของ Valve ในการเปลี่ยนราคาครั้งนี้คือการป้องกันไม่ให้นักพัฒนาเกมต้องปรับราคาอย่างต่อเนื่องเพื่อให้ทันกับความผันผวนที่ของสกุลเงินของทูร์เคีย และอาร์เจนตินา</p>\n<p>เว็บไซต์ SteamDB ที่เอาไว้ดูราคาเกมอย่างง่ายบน Steam เผยให้เห็นราคาที่เพิ่มขึ้นอย่างน่าตกใจ เช่น Far Cry 5 มีราคาเพิ่มขึ้นประมาณ 240% จากราว 14.12 ดอลลาร์ขึ้นเป็น 48 ดอลลาร์ ส่วน Stardew Valley ราคาแพงขึ้นถึง 2,900% ในอาร์เจนตินา (ราคาเปโซของเกมก่อนหน้านี้อยู่ที่ประมาณ 0.50 ดอลลาร์) แต่ก็ไม่ใช่ทุกเกมที่ราคาจะเพิ่มขึ้นหลัก 1000% ยกตัวอย่างเกม Baldur's Gate 3 และ Starfield ที่ราคาเพิ่มขึ้น 24% จนทำให้ผู้ใช้งานใน 2 ประเทศหลายคนตกใจและคร่ำครวญบน Reddit ว่าเป็นจุดจบของ Steam และบางคนถึงกับบอกว่าจะกลับไปโหลดเถื่อน</p>\n<p>แต่ก็มีบางเกมที่ราคาลดลง เช่น Diablo 4 ที่ราคาลดลงจาก 79.13 ดอลลาร์เป็น 70 ดอลลาร์ ลดลง 11% ซึ่งอาจมีเหตุผลมาจากตัวเกมที่ไม่ได้การกำหนดราคาเฉพาะสำหรับพื้นที่ ดอลลาร์ - ละตินอเมริกา และ ดอลลาร์ - ตะวันออกกลางและแอฟริกาเหนืออยู่ก่อนแล้ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b36b80cc9304ce35d8fc71b1be04f2f9.jpg\" /></p>\n<p>การเปลี่ยนราคาเกมครั้งนี้ของ Steam นั้นดูเหมือนจะไม่ใช่การแก้ปัญหาที่ต้นเหตุเท่าไหร่ เพราะราคาใหม่นี้ไม่สอดคล้องกับค่าครองชีพของอาเจนติน่า และทูร์เคีย ซึ่งมีข้อมูลว่าค่าแรงขั้นต่ำในตุรกีอยู่ที่ประมาณ 11,000 ลีราหรือราว400 ดอลลาร์ ในขณะที่อาร์เจนตินาอยู่ที่ประมาณ 146,000 เปโซหรือ 415 ดอลลาร์ ซึ่งสถานการณ์ทางเศรษฐกิจของ 2 ประเทศก็ไม่น่าจะดีขึ้นในเร็ว ๆ นี้ ทำให้แม้แต่การเปลี่ยนแปลงราคาเพียงเล็กน้อยของสินค้าก็อาจทำให้ชาวผู้ซื้อชาวอาร์เจนตินา และทูร์เคียรู้สึกไม่สบายใจได้</p>\n<p>ปัญหานี้อาจแก้ไขได้ยาก เพราะก่อนหน้านี้ความผันผวนสูงของสกุลเงินอาร์เจนตินาและทูร์เคีย ส่งผลให้เกมมีราคาถูก ซึ่งเป็นเรื่องยากที่นักพัฒนาจะตามผันผวนนี้ทัน และทำให้เกิดนักมุดที่มาจากภูมิภาคอื่นเข้ามาหาประโยชน์ได้อย่างง่ายดาย</p>\n<p>ที่มา - <a href=\"https://www.pcgamer.com/today-is-the-end-of-steam-argentina-and-turkey-floored-by-new-steam-price-hikes-as-high-as-2900/?utm_campaign=socialflow&amp;utm_source=twitter.com&amp;utm_medium=social\">PC Gamer</a>, <a href=\"https://www.reddit.com/r/Steam/comments/1805rta/today_is_the_end_of_steam_for_both_turks_and/?utm_source=embedv2&amp;utm_medium=post_embed&amp;utm_content=whitespace&amp;embed_host_url=https://www.pcgamer.com/today-is-the-end-of-steam-argentina-and-turkey-floored-by-new-steam-price-hikes-as-high-as-2900/\">Reddit</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/steam\">Steam</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c11823374ccba05b79833e72e28d24d65e67c221aed1c4697d58adfe7ceb74e0","category":"Thai"}