{"title":"Research on the coupling relationship and interaction between urbanization and eco-environment in urban agglomerations: A case study of the Chengdu-Chongqing urban agglomeration","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301287","date":1711634400000,"content":"<p>by Weilong Wu, Ying Huang, Yuzhou Zhang, Bo Zhou</p>\r\n\r\nUrban agglomerations are emerging as new regional units for national participation in global competition and the international division of labor. However, they face increasingly severe resource and eco-environment pressures during urbanization. The coordination of the relationship between urbanization and the eco-environment has attracted global attention. In this study, we used Coupling Coordination Degree and Vector Autoregression models to examine the dynamic evolution, coupling relationships, coordinated development patterns, and interaction mechanisms between urbanization and the eco-environment. The results indicate that: (1) The level of urbanization in the Chengdu-Chongqing Urban agglomeration was relatively low, and the region showed a good eco-environment background. However, rapid urbanization is gradually straining the carrying capacity of the eco-environment. (2) A close and stable coupling relationship exists between urbanization and the eco-environment, which has reached an advanced coupling stage. The status of coordinated development among cities differs considerably, and multiple stable forms may exist simultaneously. (3) Urbanization has a substantial impact on environmental changes, whereas the restrictive effect of the eco-environment on urbanization development is not particularly notable. (4) Various interactive relationships exist between the urbanization and eco-environment subsystems, including positive promotion and negative constraint effects. The positive promotion effect mainly manifests between the economic, social, and ecological response subsystems, while the negative constraint effect is most evident in the mutual coercion and inhibition between the regional urbanization, economic urbanization, ecological status, and ecological pressure subsystems. These findings have important policy implications for decision makers exploring the path of coordinated and sustainable development in urbanization and the eco-environment in Urban agglomerations.","author":"Weilong Wu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c11bb5ecf340b0a65c353d0ec2f66a9e1a37a2ad308c949359241b8864ba8017","category":"Interdisciplinary"}