{"title":"Microbial Community Analysis of Caproic Acid-Producing Bacteria in Sub-High-Temperature Daqu","link":"https://www.preprints.org/manuscript/202409.0444/v1","date":1725533136000,"content":"To investigate the composition of caproic acid-producing bacterial communities in sub-high-temperature Daqu, we analyzed four different Daqu samples from Sichuan. After enriching the samples with a specialized medium, we performed high-throughput sequencing of 16S rRNA gene amplicons on the metagenomic DNA from both the Daqu samples and the enrichment cultures. Our analysis focused on identifying and characterizing the caproic acid-producing bacterial communities present in Daqu. The results revealed that enrichment increased both the diversity and abundance of potential caproic acid-producing bacteria in Daqu. The predominant caproic acid-producing bacteria, with a relative abundance greater than 1%, included Clostridium sensu stricto 18 (2.19% to 69.00%), Clostridium sensu stricto 15 (1.76% to 7.65%), as well as smaller amounts of Clostridium sensu stricto 12, Clostridium sensu stricto 1, Clostridium sensu stricto 10, Clostridium sensu stricto 7, and Caproiciproducens. Specifically, Q1 Daqu was characterized by the presence of Clostridium sensu stricto 18 and Clostridium sensu stricto 15. Q2 Daqu featured Clostridium sensu stricto 1, Caproiciproducens, and Clostridium sensu stricto 18. Q3 Daqu included Clostridium sensu stricto 18 and Caproiciproducens. Q4 Daqu contained Clostridium sensu stricto 18 and Clostridium sensu stricto 1. These findings indicate that there are variations in the composition of caproic acid-producing bacterial communities among different sub-high-temperature Daqu samples from Sichuan. This preliminary analysis provides a theoretical basis for further studies on caproic acid bacteria in Daqu and offers insights into the development of high-quality Daqu, which may enhance the quality of Nongxiangxing liquor.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c11ed1ac09b90bf0275f234b2eca8b5cb5f08bcc7c00abfa59f2f74de918980c","category":"Interdisciplinary"}