{"title":"Increase collaboration and securely share cloud knowledge with AWS re:Post Private","link":"https://aws.amazon.com/blogs/aws/increase-collaboration-and-securely-share-cloud-knowledge-with-aws-repost-private/","date":1701029023000,"content":"<p>Today we’re launching <a href=\"https://aws.amazon.com/repost-private\">AWS re:Post Private</a>, a fully managed knowledge service to accelerate cloud adoption, improve productivity, and drive innovation. re:Post Private allows organizations to increase collaboration and access knowledge resources built for your cloud community. It includes curated collections of technical content and training materials from AWS. The content is tailored specifically for your organization’s use cases, along with private discussion and collaboration forums for the members of your organization and your AWS account team.</p> \n<p>As its name implies, you can think of it as a private version of <a href=\"https://repost.aws/\">AWS re:Post</a>, with private content and access limited to people that belong to your organization and your AWS Account team.</p> \n<p>Organizations of all sizes and verticals are increasingly moving their operations to the cloud. To ensure cloud adoption success, organizations must have the right skills and structure in place. The optimal way to achieve this is by setting up a centralized cloud center of excellence (CCOE). A CCOE is a centralized governance function for the organization and acts in a consultative role for central IT, business-unit IT, and cloud service consumers in the business. <a href=\"https://www.gartner.com/smarterwithgartner/execute-your-cloud-strategy-with-a-cloud-center-of-excellence\">According to Gartner</a>, a CCOE has three pillars: governance, brokerage, and community. The community pillar establishes the cloud community of practice (COP) that brings together stakeholders and facilitates cloud collaboration. It helps organizations adapt themselves for cloud adoption by promoting COP member interaction and facilitating cloud-related training and skills development.</p> \n<p>AWS re:Post Private facilitates the creation, structure, and management of an internal cloud community of practice. It allows you to build a custom knowledge base that is searchable, reusable, and scalable. It allows community members to post private questions and answers and publish articles. It combines the benefits of traditional forums, such as community discussion and collaboration, with the benefits of an integrated information experience.</p> \n<p>AWS re:Post Private is a fully managed service: there is no need to operate complex knowledge management and collaboration technologies or to develop custom solutions.</p> \n<p>AWS re:Post Private also facilitates your interactions with <a href=\"https://aws.amazon.com/contact-us/\">AWS Support</a>. You can create a support case directly from your private re:Post, and you can convert case resolution to reusable knowledge visible to all in your organization.</p> \n<p>You choose in which AWS Region re:Post Private stores your data and who has access. All data at rest and in transit is encrypted using industry-standard algorithms. Your administrator chooses between using AWS-managed encryption keys or keys you manage and control.</p> \n<p>Your organization’s Technical Account Managers are automatically added to your private re:Post. You can select other persons to invite among your organization and AWS teams, such as your AWS Solutions Architect. Only your private re:Post administrators need an AWS account. All other users can federate from your organization’s identity provider, such as Microsoft Active Directory.</p> \n<p><span><strong>Let’s see how to create a re:Post Private</strong></span><br /> To get started with AWS re:Post Private, as an administrator, I point my browser to the re:Post <a href=\"https://console.aws.amazon.com/repost-private/home\">section of the AWS Management Console</a>. I select <strong>Create private re:Post</strong> and enter the information needed to create a private re:Post for my organization, my team, or my project.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/2023-11-21_11-25-48.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/2023-11-21_11-25-48.png\" alt=\"AWS re:Post Private - create 1\" width=\"800\" height=\"379\" /></a></p> \n<p>I can choose the <strong>Data encryption</strong> parameters and whether or not I enable <strong>Service access for Support case integration</strong>. When I’m ready, I select <strong>Create this re:Post</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/2023-11-21_11-25-56.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/2023-11-21_11-25-56.png\" alt=\"AWS re:Post Private - create 2\" width=\"800\" height=\"433\" /></a></p> \n<p>Once the private re:Post is created, I can grant access to users and groups. User and group information comes from <a href=\"https://aws.amazon.com/iam/identity-center/\">AWS IAM Identity Center</a> and your identity provider. Invited users receive an email inviting them to connect to the private re:Post and create their profile.</p> \n<p>That’s pretty much it for the administrator part. Once the private re:Post is created, I receive an endpoint name that I can share with the rest of my organization.</p> \n<p><span><strong>Let’s see how to use re:Post Private<br /> </strong></span>As a member of the organization, I navigate to re:Post Private using the link I received from the administrator. I authenticate with the usual identity service of my organization, and I am redirected to the re:Post Private landing page.</p> \n<p>On the top menu, I can select a tab to view the contents for <strong>Questions</strong>, <strong>Community Articles</strong>, <strong>Selections</strong>, <strong>Tags</strong>, <strong>Topics</strong>, <strong>Community Groups</strong>, or <strong>My Dashboard</strong>. This should be familiar if you already use the public knowledge service <a href=\"https://repost.aws/\">AWS re:Post</a> that adopted a similar structure.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-15-48.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-15-48.png\" alt=\"AWS re:Post Private - Landing page 1\" width=\"800\" height=\"574\" /></a></p> \n<p>Further down on the page, I see the popular topics and the top contributors in my organization.I also have access to<strong> Questions </strong>and <strong>Community Groups</strong>. I can search the available content by keyword, tags, author, and so on.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-16-24.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-16-24.png\" alt=\"AWS re:Post Private - Landing page 2\" width=\"800\" height=\"589\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-16-31.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-11-22_11-16-31.png\" alt=\"AWS re:Post Private - Landing page 3\" width=\"800\" height=\"533\" /></a></p> \n<p><span><strong>Pricing and availability<br /> </strong></span>You can create your organization’s AWS re:Post Private in the following AWS Regions: US West (Oregon) and Europe (Frankfurt).</p> \n<p>AWS re:Post Private is available to customers having an AWS <a href=\"https://aws.amazon.com/premiumsupport/plans/\">Enterprise or Enterprise On-Ramp support plan</a>. re:Post Private offers a free tier that allows you to explore and try out standard capabilities for six months. There is no limit on the number of users in the free tier, and content storage is limited to 10 GB. When you reach the free storage limit, the plan is converted to the paid standard tier.</p> \n<p>With AWS re:Post Private Standard tier, you only pay for what you use. We charge based on the number of users per month. Please visit the <a href=\"https://aws.amazon.com/repost-private/pricing\">re:Post Private pricing page</a> for more information.</p> \n<p>Get started today and activate <a href=\"https://console.aws.amazon.com/repost-private/home\">AWS re:Post Private</a> for your organization.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"c130da58c45937f5ee771ea3d87c10e2166cb52e2c82e6fcf7a129933044d4c5","category":"Tech"}