{"title":"Baldur’s Gate 3 early impressions: You’ll spend whole weeks in here and love it","link":"https://arstechnica.com/?p=1958537","date":1691075740000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/SHADOWHEART-800x450.png\" alt=\"Paladin in armor holding a strange object\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/SHADOWHEART.png\">Enlarge</a> <span>/</span> Her name is Shadowheart, she's a half-elf, she's obsessed with a strange object, and she's not quick to trust people. I get the feeling I am going to spend 100 more hours with her. (credit: Larian Studios)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>There's a fortified encampment of druids you come across early in <em><a href=\"https://fave.co/43WqAxQ\" target=\"_blank\">Baldur's Gate 3</a>. </em>Just outside the camp's gate, there are travelers, under attack from goblins, begging to be let in. There's a chance you could save the travelers, but there will be casualties. This latest attack pushes the current leader of the camp to expel all the refugee <a href=\"https://en.wikipedia.org/wiki/Tiefling\">tieflings</a> it had previously taken in, both to fortify the camp with an elaborate ritual and because many believe the nomads' presence is the cause of these latest attacks.</p>\n<p>Your party is let through the gate. What you're there to do, technically, is find a healer. But what you <em>can</em> do inside is a remarkable amount of role-playing. Role-playing of the kind familiar to any player of <em>Dungeons &amp; Dragons</em>. Role-playing like you might have done in the Baldur's Gate games of 20 years ago or the Divinity series that brought developer Larian into the <em>D&amp;D</em> fold. It's the kind of crunchy, infinitely replayable, \"Half-orc ranger with Gloom Stalker subclass\" game that makes you feel like your choices matter, both to the world and how the gameplay unfolds. The wait has been long, the anticipation strong, but even from a short dive into the release version of the game, it all seems worth it.</p>\n<div><img alt=\"Raise your sword to the skies and take on fate—if you can pass this constitution check. Otherwise, you might try sitting down.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/PARTY.png\" /><p>Raise your sword to the skies and take on fate—if you can pass this constitution check. Otherwise, you might try sitting down. (credit: Larian Studios)</p></div>\n<h2>Patch-y, but worth playing now</h2>\n<p><em>Baldur's Gate 3 </em>is \"a huge RPG designed to be played over many weeks,\" according to a statement sent to reviewers with early game codes. \"Early\" ended up being about four days, with a new patch arriving nearly every day. With other things to write about and the typical sleep, food, and middle-aged life tasks required of me, I'm not nearly as far as I'd like to be in the game. Technically, I could have been playing the true Early Access of the game since late 2020, having access to the first act and roughly 25 hours of the game, but I did not (and Early Access players' saves and progress will not transfer over to the full game). My impressions come from about six to seven hours of gameplay, including a lot of time spent in the character creation tool before deciding to run with the stock characters.</p></div><p><a href=\"https://arstechnica.com/?p=1958537#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958537&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c136fb1a98ac5840cbafe4a42a5f60473f88a97e34a57dacd119e17ee8910376","category":"Tech"}