{"title":"New Brunswick’s mental health action plan: A quantitative exploration of program efficacy in children and youth using the Canadian Community Health Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301008","date":1717768800000,"content":"<p>by Yuzhi (Stanford) Yang, Moira Law, Ziba Vaghri</p>\r\n\r\nIn 2011, the New Brunswick government released the <i>New Brunswick Mental Health Action Plan</i> 2011–2018 (<i>Action Plan)</i>. Following the release of the <i>Action Plan</i> in 2011, two progress reports were released in 2013 and 2015, highlighting the implementation status of the <i>Action Plan</i>. While vague in their language, these reports indicated considerable progress in implementing the <i>Action Plan</i>, as various initiatives were undertaken to raise awareness and provide additional resources to facilitate early prevention and intervention in children and youth. However, whether these initiatives have yielded measurable improvements in population-level mental health outcomes in children and youth remains unclear. The current study explored the impact of the <i>Action Plan</i> by visualizing the trend in psychosocial outcomes and service utilization of vulnerable populations in New Brunswick before and after the implementation of the <i>Action Plan</i> using multiple datasets from the Canadian Community Health Survey. Survey-weighted ordinary least square regression analyses were performed to investigate measurable improvements in available mental health outcomes. The result revealed a declining trend in the mental wellness of vulnerable youth despite them consistently reporting higher frequencies of mental health service use. This study highlights the need for a concerted effort in providing effective mental health services to New Brunswick youth and, more broadly, Canadian youth, as well as ensuring rigorous routine outcome monitoring and evaluation plans are consistently implemented for future mental health strategies at the time of their initiation.","author":"Yuzhi (Stanford) Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c137b06c59ae0424e4ec4eae0a8d44c7298d6cec554f5e93d9d8f71dd46dc094","category":"Interdisciplinary"}