{"title":"Long‐Term Monitoring of the Annual Irrigated Cropland Extent in Fragmented and Heterogeneous Arid Landscapes Using Machine Learning and Landsat Imagery","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036945?af=R","date":1718780400000,"content":"<h2>Abstract</h2>\n<p>Understanding the long-term spatiotemporal evolution of irrigated cropland is essential for water resource management, but this knowledge remains elusive in most water-stressed arid areas. In this study, we introduced an integrated framework for long-term and field-scale mapping of annual irrigated cropland in arid and semiarid regions. This framework combines the k-means algorithm with a semiautomatically trained random forest classifier for initial classification and employs the Bayesian Updating of Land Cover algorithm for subsequent postprocessing. Taking the Heihe River basin in northwestern China as the experimental area, we generated 30-m annual irrigated cropland maps spanning from 1990 to 2020 based on Landsat imagery and the Google Earth Engine. Comprehensive validation confirmed the reliability of this approach, with the overall accuracy of the annual maps ranging from 83% to 88.3% (mean: 86.6%). Our data set provides an unprecedentedly long-term and fine-scale perspective for understanding the continuous spatial and temporal dynamics of irrigated cropland in the Heihe River basin, surpassing previous studies in Central Asia and northwestern China. Notably, a rapid expansion of irrigated areas is occurring in the basin, especially in the water-stressed midstream and downstream areas. This finding points to potential ecological risks in the foreseeable future due to water resource constraints.</p>","author":"Meibao Tan, \nYouhua Ran, \nMin Feng, \nGuotao Dong, \nDeyan Du, \nGaofeng Zhu, \nYanyun Nian, \nXin Li","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"c13cd670e2b6739e2e4e3fb1b0beb4d4c9220ec2ce34f3917205d438eedd6512","category":"Environment"}