{"title":"Smartphone App-Based Remote Monitoring Challenges in Patients with Cardiac Resynchronization Therapy Defibrillator &ndash; a Multicenter Study","link":"https://www.preprints.org/manuscript/202410.0586/v1","date":1728392666000,"content":"Background/Objectives: Remote monitoring (RM) of cardiac implantable electronic devices for adults offers improved patient outcomes. However, bedside transmitters utilized so far are not optimal due to limited patient adherence. The goal of this study was to evaluate the efficacy of RM regarding the connectivity of smartphone app-based solutions, adherence to planned automatic follow-ups, and occurrence of alert-based events. Methods: We evaluated the adult heart failure (HF) population with implanted cardiac resynchronization therapy defibrillator (CRT-D) divided into two arms: with app-based RM (abRM) and without app-based RM (control). Results: A total of 81 patients (median age of 69.0) were included in our study. 65 patients received a CRT-D with abRM functionality, and 16 did not. 12 patients had no smartphone, and 2 provided no consent, resulting in their transfer to the control group. Finally abRM arm consisted of 51 patients, while 30 patients were in the control group. Median period of follow-up lasted 12 months. Among abRM patients, 98.0% successfully transmitted their first scheduled follow-up, and 80.4% were continuously monitored. Alert-based events were mainly related to arrhythmic events and device functionality with significantly shorter median time to notification (1 day vs. 101 days; p&amp;lt;0.0001) in the abRM group. Conclusions: Our study showed a high level of compliance with timely initial transmission and adherence to scheduled remote follow-ups. Patient enrollment eligibility was a major challenge due to the limited accessibility of smartphones in the population. App-based RM demonstrated an accurate notification of events and patient-initiated transmissions in emergencies, regardless of location.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c140e882c51e94b6cb7e35940186fa71244409867a7de47e50ed4d64b45d8e7a","category":"Interdisciplinary"}