{"title":"Seven Mistakes To Avoid In Your Technical Interviews","link":"https://smashingmagazine.com/2021/04/mistakes-technical-interviews/","date":1618563600000,"content":"<p>I have failed many technical interviews. Year after year would pass and I would slowly progress in my technical interviewing skills. It wasn’t until I received my dream job offer from Spotify and had passed the Google technical interviews that I realized how much I had learned over the preceding years. Finally, my studying had paid off! This was also around the time that many developers began losing their jobs due to COVID.</p>\n<p>“If I have difficulty passing data structures and algorithms interviews with a computer science degree,” I thought, “I can’t imagine how overwhelming these concepts must be for self-taught developers.” So for the past year, I’ve made it my mission to make data structures and algorithms approachable for <em>everyone</em>. </p>\n<p>I found it incredibly difficult to find one resource for learning everything about the technical interview process. From the recruiter's phone call to the systems design interview to negotiating a job offer, there was no <strong>all-encompassing technical interview resource</strong>, so I decided to create one.</p>\n<h3>A Note About Remote Interviews</h3>\n<p>Due to the global pandemic, many companies have gone fully remote. This is great as it allows candidates across the world to apply, but this can be daunting for candidates who have little-to-no experience with online interviews.</p>\n<p>Here are a few tips for your virtual interviews.</p>\n<ul>\n<li><strong>Arrive early.</strong><br />There is nothing more panic-inducing than going to join an online meeting and realizing you need to download an entire package of drivers to run the program. I recommend creating an account with the meeting application ahead of time and running a test meeting with a friend to ensure you have access to the application and feel comfortable using the online controls.</li>\n<li><strong>Use headphones.</strong><br />I always recommend using headphones for your remote technical interviews. They’ll help reduce background noise and ensure you hear the instructors clearly.</li>\n<li><strong>Charge your computer.</strong><br />Remote meeting tools can quickly drain your computer battery, especially if you’re live coding. To combat this, have your computer plugged in for the entirety of the interview if possible.</li>\n<li><strong>Test your camera.</strong><br />While remote interviews allow us to be in a safe and familiar environment, we can often forget to remove unsavory items from the background of our video frame. I always suggest running a test meeting to check your video frame and remove the dirty laundry from the background. You can also use a virtual background for your remote interview if your background is not ideal.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f90b6cc0-6037-4d85-b486-cd35eed2f37b/setup.png\" /></p>\n<h3>The Technical Interview Process</h3>\n<p>When you begin the technical interview process with a company, your recruiter should inform you about what you should expect from the process. One reason why technical interviews are so anxiety-inducing is the lack of <strong>process standardization</strong>. A technical interview at one company can look incredibly different from a technical interview at another company. But there are some commonalities between technical interview processes that you can prepare for.</p>\n<p>Here is a generalized version of the technical interview process that you’re likely to see in your upcoming interviews.</p>\n<h4>Recruiter Phone Interview</h4>\n<p>Your first interview will be a recruiter phone interview. During this call you’ll discuss the job, the company, and what you can expect from the interview process. <strong>Do not take this interview lightly</strong>: all interviews in the technical interview process are vital to landing you a job offer. If you don’t seem excited about the role a recruiter might not move you forward to the next phase of the process.</p>\n<p>If you’re applying to many different job openings, I recommend keeping a spreadsheet of the roles, companies, recruiter information, and any relevant information. You should refer back to your notes prior to the recruiter phone interview to ensure you’re well-informed and leave a great impression.</p>\n<h4>Technical Screening</h4>\n<p>If the recruiter's phone interview goes well you will likely move into a technical screening interview. This interview may be asynchronous where you don’t interact with a human interviewer and instead complete the coding challenge on a platform with a time limit, or you may have a live interviewer.</p>\n<p>Companies typically conduct technical screenings to ensure a candidate has the <strong>baseline technical knowledge</strong> required to thrive in a role. It can be expensive to fully interview every single candidate so a technical screening is a way to reduce the candidate pool.</p>\n<p>You will be coding in this interview so it’s important to feel confident in your foundational programming language.</p>\n<h4>Take Home Project</h4>\n<p>Some companies require a take-home coding project in lieu of a coding challenge, or in addition to a coding challenge (again, all processes are different so consult your recruiter for the specifics). </p>\n<p>Coding projects are a polarizing topic: some candidates love them while other candidates find them unfair. On one side, coding projects allow you to <strong>showcase your skills</strong> in a more natural environment, using the tools you love. On the other hand, these projects can be a way for a company to receive free (often unpaid) labor. </p>\n<p>Many candidates with families, multiple jobs, or other time-consuming commitments likely don’t have the time necessary to complete a take-home coding project, which can lead to an unfair advantage for candidates without the same responsibilities.</p>\n<p>If you’re tasked with a take-home project and do not have the time required to devote to it, you can ask the recruiter if there is an alternative. It might also be worth asking if you will be compensated for your time spent on this interview (some companies will pay you, although all of them should).</p>\n<h4>On-Site Interviews</h4>\n<p>The “on-site” interview phase is likely the last phase before ultimately receiving a job offer or a rejection. Many companies used to fly candidates to their offices for a full day of interviews, but due to the pandemic, these interviews are being held virtually.</p>\n<p>Many candidates find the on-site interviews to be the most stressful as it requires you to take a vacation day from your current role to complete them. You will likely have three or four interviews (typically a half-day) consisting of a <strong>process/values/collaboration interview</strong> (how do you collaborate with your team, how do you resolve conflicts) and coding interviews.</p>\n<p>The on-site interviews are stressful so remember to take breaks and decompress before each interview.</p>\n<h4>Notes On The Interview Process</h4>\n<p>The technical interview process is intense and can leave you burned out. Make sure you’re taking time to decompress after each interview and reflect on how it went. Were there interviews you struggled with more than others? If so, focus on those areas for your next interview process; some recruiters will even provide you with interviewer feedback so you can hyperfocus your studying. </p>\n<p>You should also <strong>reflect on how you felt</strong> during the interview process. Did the interviewers make you feel safe and comfortable? Was this even a work environment you would thrive in? Remember that technical interviews are a two-way street.</p>\n<p>Now that we’ve detailed the technical interview process, let’s dive into the seven mistakes candidates commonly make, and tips for avoiding them.</p>\n<h3>Mistake #1: Not Communicating Effectively</h3>\n<p>Technical interviews are supposed to measure your communication and problem-solving abilities, not necessarily whether you achieved the optimal, working solution to a coding challenge. Problem-solving is all about communication, but did you know that <strong>each culture has a different definition</strong> of what it means to be a “good communicator?”</p>\n<p>There are two different types of communication:</p>\n<ul>\n<li><strong>Low-context</strong><br />Very explicit, redundant, and straight to the point. Messages are stated clearly and should be interpreted at face value.</li>\n<li><strong>High-context</strong><br />More ambiguous where listeners are expected to read between the lines (or read the air) and interpret the hidden message.\nLow-context communication is </li>\n</ul>\n<p>During a technical interview, it’s imperative to practice low-context communication, regardless of how you’re used to communicating. If you need a moment to think, tell your interviewer. If you need help, ask for it!</p>\n<p>Often candidates don’t move on to the next interview phase because they failed to communicate effectively. If you think of the interview as a conversation rather than an exam, you’re more likely to communicate effectively.</p>\n<h3>Mistake #2: Not Admitting When You Don’t Know The Answer</h3>\n<p>If you don’t know the answer to something, admit it! Interviewers appreciate when a candidate is self-aware and humble enough to admit they don’t know the answer to something. It’s much better to admit you don’t know something than to “BS” your way through it.</p>\n<p>If you’re unsure how to answer a question you can say, “To be honest I’m not sure. If I had to make an educated guess I would say...” People don’t want to work with “know-it-all”s; they want to <strong>work with real humans</strong> who can admit they don’t know the answer.</p>\n<h3>Mistake #3: Cramming The Night Before An Interview</h3>\n<p>Let’s be honest: we’ve all crammed for an interview the night before. It’s exhausting to make time to interview but the reality is that interviewing is a skill (sadly) and it must be practiced. </p>\n<p>Although you might feel like you’ve learned something whilst cramming the night before an interview, this learning is volatile and superficial. Our brain only encodes information into short-term memory when we cram the night before an interview. This means that all that information you just “learned” will dissipate quickly after the interview. Thus, it’s better for your <strong>long-term memory</strong> to do a little studying in the weeks leading up to an interview than cram the night before.</p>\n<p>Additionally, you’re more likely to regurgitate information than actually understand it. It will become apparent very quickly if you’re just reciting information you memorized as opposed to working through a solution.</p>\n<p>One strategy for effective learning is to use context-switching as a tool. While switching contexts in the midst of learning a new skill seems ineffective, it’s actually the most effective learning tool. When you <strong>context-switch during learning</strong>, it’s more difficult for our brain to recall information, ultimately strengthening the encoded information and making it easier to recall in the long run.</p>\n<p>If you want to read more about effective learning methods here are a few resources that helped me:</p>\n<ul>\n<li>“<a href=\"https://jamesclear.com/atomic-habits\">Atomic Habits</a>,” James Clear </li>\n<li>“<a href=\"https://www.coursera.org/learn/learning-how-to-learn\">Learning How To Learn</a>,” Coursera course</li>\n<li>“<a href=\"https://www.goodreads.com/book/show/18770267-make-it-stick\">Make It Stick </a>,” Peter C. Brown, Henry L. Roediger III, Mark A. McDaniel</li>\n</ul>\n<h3>Mistake #4: Memorizing Code For Algorithms &amp; Data Structures</h3>\n<p>Candidates often feel they must memorize code for algorithms and data structures, but the reality of it is you likely won’t have to code these things from scratch. Regurgitating code is not a useful skill and your interviewer will be able to tell you’ve simply memorized a solution. Instead, you should aim to understand the process of what you’re accomplishing.</p>\n<p>Additionally, you don’t need to learn every single sorting and searching algorithm ever invented. Instead, you can determine the <strong>optimal solution</strong> for different data structures and learn the concepts behind it. For example, if you’re asked to sort an array of integers, you might know that a divide-and-conquer algorithm like merge sort or quick sort is a great solution. If you understand the concept of how an algorithm or data structure works, you can build the solution.</p>\n<p>Lastly, most coding interviews will be conducted in the <strong>foundational programming language</strong> (even if a company is looking for a React/Vue.js developer): you likely will not be asked to code using a framework or library, so make sure you’re confident in your foundational programming knowledge.</p>\n<h3>Mistake #5: Overlooking The “Cultural Fit” Interview</h3>\n<p>All interviews throughout the technical interview process are important, however, there seems to be a focus on data structures and algorithms. And while data structures and algorithms are an important area to study, you should give the other interviews in the process the same attention: <strong>Don’t prioritize</strong> data structures and algorithms over other “easier” interviews like the “collaboration and process.</p>\n<p>The “culture fit” interview is meant to discern how you collaborate and handle conflicts in a team. You’ll likely receive questions such as:</p>\n<blockquote>“Tell me about a time a project you were working on failed. Why did it fail and how did you move forward?”<br /><br />or<br /><br />“Tell me about a time you had a conflict with a team member. How did you resolve it?”</blockquote>\n\n<p><strong>Write down</strong> your responses to these questions and practice answering them out loud. You don’t want to sound rehearsed but you want to be succinct and not ramble. Keep your response to a few sentences. Additionally, eye contact and body language are important. </p>\n<p>Try not to fidget and focus on making eye contact with your interviewer!</p>\n<h3>Mistake #6: Starting With The Optimized Solution</h3>\n<p>Unless you are 110% confident in the most optimized solution for a coding challenge, you don’t have to start with the most optimized solution. Candidates often think they have to start with an optimal solution and it trips them up. They get stuck and can’t move forward. Instead, start with a non-optimal solution and say:</p>\n<blockquote>“I know this isn’t the most performant solution but I would like to get a working solution and refactor it for performance later in the interview.”</blockquote>\n\n<p>Your interviewer will <strong>appreciate your honesty</strong> and regard to performance. You’ll also be able to make progress more quickly, and in an interview, small wins can have a huge impact on your self-confidence and overall performance.</p>\n<h3>Mistake #7: Overlooking Programming Foundations</h3>\n<p>Candidates for front-end developer roles neglect their HTML and CSS skills to prioritize JavaScript, but more interviews are testing knowledge of the foundational programming skills so don’t neglect them.</p>\n<p>We often forget the foundations and skip to the more expert-level framework and libraries but this can hinder our interview performance. Interviews are conducted in the <strong>foundational languages</strong> (i.e. JavaScript, not React/Vue.js), so don’t neglect the foundations.</p>\n<h3>Conclusion</h3>\n<p>Everyone has anxiety over the technical interview process but by being mindful of these seven mistakes, you can improve your chances of landing a job offer.</p>\n<p>Once you do receive a job offer you can decide whether or not you want to negotiate. There are many things you can <strong>negotiate</strong>: paid time off: working hours, equity, signing bonus, job title, and salary are just a few.</p>\n<p>When negotiating a job offer it’s important to do your research. How much does someone in this role (and in this geographic location) make annually? You can use <a href=\"https://www.glassdoor.com/index.htm\">Glassdoor</a> to do some market research.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/66a0ceae-8ae7-48f2-8a84-8cc43b99a4b3/glassdoor.png\" /></p>\n<p>You should also recognize that the recruiter has constraints and might not be able to get you a higher salary. Instead, you can ask for a signing bonus or equity, but be prepared for them to say they can’t increase your offer.</p>\n<p>You should focus on “why” you should receive additional salary or benefits; <strong>what do you bring to the table</strong> that someone else won’t?</p>\n<p>Lastly, don’t give a recruiter an ultimatum, i.e. “If you don’t give me this salary, I will walk away.” Instead, focus on the fact that you <em>want</em> to join the team but need an improvement/change to the offer to accept.</p>\n<p>Here’s an example email you could use to ask for a base salary increase:</p>\n<blockquote>“Thank you so much for the offer. I’m genuinely thrilled and looking forward to joining the team. Before I accept the offer I’d like to discuss the base salary. I am an active member in the technical community and teach numerous courses online with X learning platforms. I know that my extensive knowledge of Y will greatly benefit the team. As such I’m looking for a base salary in the range of A to B. Please let me know if we can make this work and I’ll sign the offer right away!”</blockquote>\n\n<p>If you don’t get a job offer, don’t worry! Almost everyone gets rejected for a position at one time or another; you’re not alone! Take some time to <strong>reflect on your interviews</strong> and determine what areas you can improve for the next round of interviews.</p>\n<p>If you want to learn more about data structures, algorithms, coding projects, culture fit interviews, systems design interviews, and more, check out my new book, “<a href=\"https://technicalinterviews.dev/\">De-Coding The Technical Interview Process</a>”. This book has been a passion of mine for the past year and has helped many developers land a job offer (including myself)!</p>\n<p>Be patient with yourself. You can do this!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"c1430239bddb93ff566a09cc622b8769348f2e36669bfb4c38cc0d7df8c12e66","category":"Tech"}