{"title":"Is human albumin injection the best choice to treat hypoalbuminemia?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311949","date":1729519200000,"content":"<p>by Yingqin Shi, Hai Song, Lingzhi Fang, Fuxi Wu, Bo Qiu, Dongdong Tian, Caixia Liu, Hailing Di</p>\r\nBackground <p>Currently, there is an irrational use of drugs in the treatment of hypoproteinemia. This study evaluates the value of 12 injections to provide a basis for drug selection for the treatment of hypoproteinemia.</p> Methods <p>The content of the first restrictive amino acid, the comprehensive quality of the total essential amino acid, and the closeness to the whole egg protein or FAO/WHO model were evaluated to compare their value in the amino acid synthesis of human serum albumin. A comparison was made between the matching degree of HA and therapeutic amino acids with the human plasma amino acid profile. Furthermore, the value and safety of synthetic human serum albumin were compared.</p> Results <p>The lowest synthetic value of human serum albumin was 18AA-V, and the highest was 18AA-II. The CS values of HA, 18AA-V, 18AA-II, 18AA-Ip, 18AA-II<sub>p</sub>, and 19AA-I<sub>p</sub> were 0.18, 0.58, 0.78, 0.55, 0.54, and 0.59, respectively. The similarity to egg protein was 0.81, 0.92, 0.94, 1.00, 1.18, and 1.18, respectively. The proximity values to FAO/WHO standards were 0.81, 0.85, 0.90, 1.36, 1.54, and 1.54, respectively. The changes in 3AA and the amino acid profile were matched when liver function was abnormal. When the renal function was abnormal, 9AA was matched. During trauma, 18AA-VII was matched. The amino acid profile of HA did not correspond.</p> Conclusion <p>Patients with normal liver and kidney function should choose compound balanced amino acid injection, while patients with abnormalities should choose 3AA. Patients with renal dysfunction should choose 9AA. Trauma patients should choose 18AA-VII.</p>","author":"Yingqin Shi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c1443534a44c8e92d9e3622ad9d849c772a8ba698e70803d3674e3f0d5ab47ff","category":"Interdisciplinary"}