{"title":"High-throughput viable circulating tumor cell isolation using tapered-slit membrane filter-based chipsets in the differential diagnosis of ovarian tumors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304704","date":1717509600000,"content":"<p>by Nam Kyeong Kim, Dong Hoon Suh, Kidong Kim, Jae Hong No, Yong Beom Kim, Minki Kim, Young-Ho Cho</p>\r\nObjective <p>To evaluate the diagnostic performance of circulating tumor cells (CTCs) using tapered-slit membrane filter (TSF)-based chipsets for the differential diagnosis of adnexal tumors.</p> Methods <p>A total of 230 women with indeterminate adnexal tumors were prospectively enrolled. The sensitivity, specificity, and accuracy of the CTC-detecting chipsets were analyzed according to postoperative pathological results and compared with those of cancer antigen (CA)-125 and imaging tests.</p> Results <p>Eighty-one (40.3%) benign tumors, 31 (15.4%) borderline tumors, and 89 (44.3%) ovarian cancers were pathologically confirmed. The sensitivity, specificity, and accuracy of CTC-detecting chipsets (75.3%, 58.0%, and 67.1%) for differentiating ovarian cancer from benign tumors were similar to CA-125 (78.7%, 53.1%, and 66.5%), but lower than CT/MRI (94.2%, 77.9%, and 86.5%). “CTC or CA125” showed increased sensitivity (91.0%) and “CTC and CA-125” revealed increased specificity (77.8%), comparable to CT/MRI. CTC detection rates in stage I/II and stage III/IV ovarian cancers were 69.6% and 81.4%, respectively. The sensitivity to detect high-grade serous (HGS) cancer from benign tumors (84.6%) was higher than that to detect non-HGS cancers (68.0%).</p> Conclusion <p>Although the diagnostic performance of the TSF platform to differentiate between ovarian cancer and benign tumors did not yield significant results, the combination of CTC and CA-125 showed promising potential in the diagnostic accuracy of ovarian cancer.</p>","author":"Nam Kyeong Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c147929e1331633334015b1ff0454110ee96201d391564ad37fcd167e0b332c5","category":"Interdisciplinary"}