{"title":"Doxorubicin causes cachexia, sarcopenia, and frailty characteristics in mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301379","date":1713794400000,"content":"<p>by Paola Sanches Cella, Ricardo Luís Nascimento de Matos, Poliana Camila Marinello, Júlio Cesar da Costa, Felipe Arruda Moura, Ana Paula Frederico Rodrigues Loureiro Bracarense, Patricia Chimin, Rafael Deminice</p>\r\n\r\nWhile chemotherapy treatment can be lifesaving, it also has adverse effects that negatively impact the quality of life. To investigate the effects of doxorubicin chemotherapy on body weight loss, strength and muscle mass loss, and physical function impairments, all key markers of cachexia, sarcopenia, and frailty. Seventeen C57/BL/6 mice were allocated into groups. 1) Control (n = 7): mice were exposed to intraperitoneal (i.p.) injections of saline solution. 2) Dox (n = 10): mice were exposed to doxorubicin chemotherapy cycles (total dose of 18 mg/kg divided over 15 days). The body weight loss and decreased food intake were monitored to assess cachexia. To assess sarcopenia, we measured muscle strength loss using a traction method and evaluated muscle atrophy through histology of the gastrocnemius muscle. To evaluate physical function impairments and assess frailty, we employed the open field test to measure exploratory capacity. Doxorubicin administration led to the development of cachexia, as evidenced by a significant body weight loss (13%) and a substantial decrease in food intake (34%) over a 15-day period. Furthermore, 90% of the mice treated with doxorubicin exhibited sarcopenia, characterized by a 20% reduction in traction strength (p&lt;0,05), a 10% decrease in muscle mass, and a 33% reduction in locomotor activity. Importantly, all mice subjected to doxorubicin treatment were considered frail based on the evaluation of their overall condition and functional impairments. The proposed model holds significant characteristics of human chemotherapy treatment and can be useful to understand the intricate relationship between chemotherapy, cachexia, sarcopenia, and frailty.","author":"Paola Sanches Cella","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c14996af6911a0f5e539cc24b417fdf58b6c7b58c57604919fa90f94762698c6","category":"Interdisciplinary"}