{"title":"Apple Unveils Apple Watch Ultra 2 Featuring Faster S9 Chip, New Ultra Wideband Chip, and Apple's Brightest Ever Display","link":"https://www.macrumors.com/2023/09/12/apple-announces-apple-watch-ultra-2/","date":1694540099000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/09/apple-unveils-apple-watch-ultra-2/\">announced</a> an all-new second-generation Apple Watch Ultra, offering all of the features of the original Ultra, plus a faster new S9 SiP chip, a new double tap gesture, Apple's brightest display ever, expanded altitude range, quicker on-device Siri, Precision Finding for iPhone, and new capabilities for water adventures. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/f-5f029b4b52ddaec2ea2ddee21051b69a6c9e8959.jpg\" alt width=\"1600\" height=\"898\" />\r<br />\nThe Apple Watch Ultra 2 has a brighter display at 3,000 nits – 50 percent brighter than the first generation of Apple Watch Ultra and the brightest display Apple has ever designed. For dark rooms or early mornings, the display can now lower to just one nit so as not to disturb people close by. Flashlight also benefits from the new display architecture, according to Apple, as rotating the Digital Crown temporarily doubles the brightness to better light up the immediate environment.\r<br />\n\r<br />\nThe Apple Watch Ultra also features an S9 chip, which has 60% more transistors and is 30% faster than the S8 chip used in the original Apple Watch Ultra. In addition, the S9 chip has a four-core neural engine for 2x faster neural tasks, according to Apple. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Watch-Ultra-2-hero-230912.jpg\" alt width=\"2880\" height=\"1620\" />\r<br />\nThere's a new second-generation Ultra Wideband chip in the Ultra that makes it easier to use the Apple Watch Ultra to find an iPhone 15, and it also supports Precision Finding. Apple Watch Ultra 2 also has a new 4-core Neural Engine that can process machine learning tasks up to twice as fast as the original Apple Watch Ultra.\r<br />\n\r<br />\nThe Apple Watch Ultra 2 also has a new gesture that uses just the watch hand for when your hands are full. Double tap allows you to tap your index finger and thumb together to do things like answer a call, end a call, snooze an alarm, play or pause music, and more. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Watch-Ultra-2-double-tap-gesture-230912.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nThe new double tap gesture is enabled by the faster Neural Engine in Apple Watch Ultra 2, which processes data from the accelerometer, gyroscope, and optical heart sensor with a new machine learning algorithm. The algorithm detects the unique signature of tiny wrist movements and changes in blood flow when the index finger and thumb perform a double tap. Double Tap will be available next month, according to Apple.\r<br />\n\r<br />\nThere's also a new Modular Ultra watch face, which takes advantage of the large display, using the outermost edge to present real-time data, including seconds, altitude, or depth. It offers the most complications of any Apple digital watch face to customize for sports, outdoor adventures, and ocean and water activities. It also feature a Night mode, which now turns on automatically in the dark thanks to the ambient light sensor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Watch-Ultra-2-Modular-Ultra-watch-face-230912_inline.jpg.large_2x.jpg\" alt width=\"1306\" height=\"1306\" />\r<br />\nApple Watch Ultra 2 runs watchOS 10, which delivers redesigned apps, the new Smart Stack, new cycling experiences, features to help explore the outdoors, and the new Modular Ultra watch face. Apple Watch Ultra 2 has the same 36-hour battery life with regular use and up to 72 hours in Low Power Mode.\r<br />\n\r<br />\n<blockquote>\"This year we've made our most rugged and capable Apple Watch even better,\" said Jeff Williams, Apple's chief operating officer. \"Apple Watch Ultra 2 is our most advanced Apple Watch, with great performance and feature updates. It's perfect for anyone who wants our biggest, brightest display, longest battery life, and best GPS of any Apple Watch, all in a stunning design.\"</blockquote>The Apple Watch Ultra 2 starts at $799. Customers in Australia, Canada, France, Germany, India, Japan, the UAE, the U.K., the U.S., and more than 40 other countries and regions can <a href=\"https://www.apple.com/uk/apple-watch-ultra-2/\">order Apple Watch Ultra 2 today</a>, with availability in stores beginning Friday, September 22.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/september-2023-apple-event/\">September 2023 Apple Event</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_Ultra\">Apple Watch Ultra (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/12/apple-announces-apple-watch-ultra-2/\">Apple Unveils Apple Watch Ultra 2 Featuring Faster S9 Chip, New Ultra Wideband Chip, and Apple's Brightest Ever Display</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-unveils-apple-watch-ultra-2-featuring-faster-s9-chip-new-ultra-wideband-chip-and-apples-brightest-ever-display.2401176/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c155814905e7291745e3dc5cc5f1a56c2d1be4c6f320b946c1695ddb0e2fea03","category":"Apple"}