{"title":"112 Effects of maternal body condition on colostrum, foal weight, and foal IgG concentration","link":"https://academic.oup.com/jas/article/102/Supplement_3/279/7757163?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Foals are born with little to no immunity and rely on maternal colostrum to develop adequate circulating immunoglobulin G (IgG) concentrations in the periparturient period. Colostrum directly impacts the health of the foal, and there are limited data assessing how maternal metabolism and body condition impacts IgG in colostrum and in the foal postnatally. To determine the influence of maternal body condition score (BCS) and cresty neck score (CNS) on glucose and insulin metabolism in the pregnant mare, colostrum composition, and colostrum and foal IgG concentrations, light breed mares (n = 6) were divided into two groups based on BCS and CNS at 315 ± 0.45 d of gestation. The groups were identified as moderately obese (MO; n = 3, BCS) and lean (LN; n = 3). Mares were fasted overnight and then underwent an intravenous (iv) glucose tolerance test at 315 ± 0.45 d gestation. Blood samples were collected at -30, -15 and 0 min and mares were administered dextrose iv [0.3 g/kg body weight (BW)] over 3.7 ± 0.17 min followed by an intravenous infusion of insulin (0.3 mU/kg BW) 20-min later. Additional blood samples were collected 2, 5, 10, 15, 20, 25, 30, 45, 60, and 120 min after initiation of dextrose infusion. At parturition, a colostrum sample was collected before foals nursed and analyzed for protein and fat, and IgG concentration. A foal blood sample was collected 18 h after birth to determine passive transfer of IgG. Placental, mare, and foal weights were measured at birth. Data were analyzed using a t-test with significance at <span>P</span> ≤ 0.05 and a tendency at 0.05 &lt; <span>P</span> ≤ 0.10. The MO group had greater BCS (<span>P</span> = 0.01) and CNS (<span>P</span> = 0.01) than the LN group. Moderately obese mares tended to have 9% greater glucose area under the curve (AUC) after dextrose (<span>P</span> = 0.10) and a 9% greater glucose AUC after insulin infusion (<span>P</span> = 0.10) than LN mares. Colostrum IgG concentrations, and protein and fat content (<span>P</span> ≥ 0.3) did not differ between groups. Foal serum IgG concentrations, foal BW, and placental weights were similar between groups (<span>P</span> ≥ 0.8). The ratios between foal BW and placenta weight, and between foal BW and mare BW were similar between groups (<span>P</span> ≥ 0.3). Moderately obese maternal BCS and CNS scores may decrease maternal glucose clearance during late gestation but did not impact colostrum quality or foal IgG concentrations within 24 h postpartum. As the equine fetus matures later in gestation than other livestock species and relies heavily on glucose uptake from the placenta, it is critical to increase our understanding of the impacts of maternal obesity and glucose clearance on foal development and pre- and post-natal health.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c155368804d38252da56c140976764a2ff7b6a1a661a4e053e5a0bd25ce17859","category":"Environment"}