{"title":"Giro d'Italia 2023 stage eight preview - a punchy circuit finish","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-eight-preview","date":1683909869000,"content":"\n      <p><b>Distance: </b><span>207km<br /></span><b>Start location: </b><span>Terni<br /></span><b>Finish location: </b><span>Fossombrone <br /></span><b>Start time: </b><span>11:15 CEST<br /></span><b>Finish time (approx): </b><span>17:14</span><b> </b>CEST</p>\n<p><span>The Via Flaminia is an ancient Roman road first constructed by the censor Gaius Flaminius during the 3rd century BC, that spans all the way from Rome to Rimini on the Adriatic coast. It’s a prime example of the carefully planned and expansive network of roads that helped connect the Roman empire, and many of the routes, including this one, are still in use today.</span></p>\n<p>One of the towns on the Via Flaminia is Terni, which is where the peloton will set off from at the start of stage eight. Known as Interamna during Roman times in relation to its geographical location between two riders, Terni was an important municipium that was home to clergyman St Valentine in the third century AD — as in, the Saint Valentine now synonymous with roses and chocolates exchanged on February 14th, canonised by the Catholic church for his martyrdom at the hands of the Romans for aiding persecuted Christians. Terni isn’t exactly what you’d call a romantic getaway, however. It was heavily industrialised during the nineteenth century, so much that it was nicknamed The Steel City, and since then was heavily bombed during World War Two. <br /><br />To complete Via Flaminia, the Romans had to figure out a way to get through the Apennine mountains, and in AD77 emperor Vespasian commissioned a tunnel to be built through the narrowest part of the Furlo Pass gorge. It’s an outstanding feat of engineering, which the riders pass through today on their way to their destination of Fossombrone, and one that is a triumph of efficiency, taming the geographical landscape for ease of access — something that the sport of cycling, by seeking out the hardest routes to get to places, can represent the opposite of. </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_eight.jpg?v=1683628202\" alt /></div>\n\n<p><span><em>Stage eight profile sourced on the Giro d'Italia website </em></span></p>\n<p><span>The roads will be mostly flat as they head northwards from Umbria and into Marche, the first 140km up to the Furlo Pass, but upon passing through and into the finishing circuit in Fossombrone, the terrain gets much punchier. The Muro dei Cappuccini will be climbed twice, the second time crested just 6km from the finish, and in between will be the Monte delle Cesane. Although the vital numbers of either don’t look especially intimidating (the former last just 2.8km and averages 7.9%, the latter 7.8km at 6.5%), they don’t tell the full story, as both feature brief ramps that nearly touch 20%. These are the kind of walls that could be launchpads for attacks from GC riders who are feeling bold, particularly the last ascent of Cappuccini given its proximity to the finish. </span></p>\n<p>This same finish was used at the 2019 Tirreno-Adriatico, when Primož Roglič attacked on the Cappuccini, and only two other riders, Adam Yates and Jakob Fuglsang, were able to follow him, gaining over 20 seconds over their GC rivals. And there was also a dramatic battle for the stage win, as Astana's Alexey Lutsenko defied the odds to take victory despite crashing not once but twice in the finale.</p>\n<h3>Contenders</h3>\n<p><span>The stage is set for a possible breakaway (early or late), but there are two teams – Trek-Segafredo and Jayco-Alula – who could stop them if they really wanted to put in the work to bag themselves another victory with their versatile sprinters. </span></p>\n<p><span>Establishing himself as one of the best puncheurs in the world, Trek-Segafredo's </span><strong>Mads Pedersen</strong><span> is a rider who will certainly be in the mix for a podium place. Finally securing a stage win on the sixth day of the Giro, the Dane will be bolstered with confidence going into this stage. </span></p>\n<p>It might have been his first Giro victory in eight years, but stage three winner <strong>Michael Matthews</strong> (Jayco-Alula) is a rider who could double up on his success during this stage. His fellow Australian <strong>Simon Clarke</strong> (Israel-Premier Tech) is a rider who will be able to scale the route's punchier climbs and will also be looking to redeem himself with a stage win after his heartbreaking loss in Napoli.</p>\n<p>Other punchy climbers, like the Ardennes Classics revelation <strong>Ben Healy</strong> (EF Education-EasyPost), could find an opportunity to attack late during stage eight, or his teammates <strong>Magnus Cort</strong> and <strong>Alberto Bettiol</strong> could be in contention from a break. The likes of <strong>Diego Ulissi</strong> (UAE Team Emirates), <strong>Toms Skujiņš, </strong>and <strong>Bauke Mollema</strong> (both Trek-Segafredo), are all also extremely capable over this kind of terrain.</p>\n\n<p><span>Or might history repeat itself with </span><strong>Primož Roglič</strong><span> (Jumbo-Visma) taking another win in </span><span>Fossombrone, f</span><span>ollowing his winning formula from the 2019 Tirreno-Adriatico. Still behind his rivals in the GC standings, this could provide him with a prime opportunity get closer to the pink jersey. However, </span><strong>Remco Evenepoel</strong><span> (Soudal -Quick-Step) will be keen to keep a buffer between himself and the Slovenian. But with a time trial on stage nine, the world champion might be looking to have an easier day in the saddle. </span></p>\n<h3>Predictions</h3>\n<p>We are backing <strong>Michael Matthews</strong> to take a second win following his victory on stage three. His wins often come when there is a hill or a low mountain to climb, followed by a quick descent to the finish, and stage eight is just that. </p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c16090b3dddd47b56c455e8457f0e13ef87ae9415d6a5a0a1f9c0b36790d9c5f","category":"Cycling"}