{"title":"Threatening the endangered: Uncovering endangered elasmobranchs and factors perpetuating the Tanzanian shark‐fin trade","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13275?af=R","date":1714633200000,"content":"<h2>Abstract</h2>\n<p>Despite global conservation efforts, elasmobranchs still face increased fishing pressure due to high demand for their products. Although certain species have been afforded international and local protection, the high value of their products in international markets incentivises the trade of protected species covertly within marketed fish products. To address the problem, we amplified fragments of the cytochrome oxidase subunit I gene (approximately 595 base pairs) from 164 elasmobranch fins collected from fish markets in Tanzania to test whether protected species and those of conservation concern are among these specimens. Similarly, we conducted 130 in-depth key informant interviews with stakeholders involved in the elasmobranch-fin trade to gather diverse perspectives on the factors perpetuating the trade. Our findings revealed fifteen elasmobranch species, with requiem sharks (Carcharhinidae) and wedgefishes (Rhinidae) accounting for 44.1% and 33.8% of the fins, respectively. Alarmingly, over 70% of the traded fins originated from threatened elasmobranchs, with 36.8% sourced from critically endangered species. Unexpectedly, almost 9% of the traded fins were sourced from two nationally protected species, <i>Carcharhinus longimanus</i> and <i>Alopias pelagicus</i>, highlighting the existence of regulatory gaps that require immediate attention. Similarly, 91.2% of traded fins were sourced from CITES-listed species, emphasising the severity of the problem. The interviews highlighted technological challenges in tracking the trade, limited awareness of trade impacts on elasmobranch sustainability, scarce surveillance resources, inadequate training to identify routes and offenders and lack of public support as the main factors perpetuating the trade. Addressing these issues necessitates a total ban on elasmobranch-fin trade, coupled with increased funding for enforcement agencies, providing specialised training for law enforcement personnel, launching public awareness campaigns and promoting community-based monitoring and collaboration with international organisations. By doing so, Tanzania can effectively safeguard the sustainability of threatened elasmobranchs and advance global conservation efforts for these fishes.</p>\n<h2>Résumé</h2>\n<p>Malgré les efforts de conservation déployés à l'échelle mondiale, les élasmobranches sont toujours soumis à une pression de pêche accrue en raison de la forte demande de leurs produits. Bien que certaines espèces bénéficient d'une protection internationale et locale, la valeur élevée de leurs produits sur les marchés internationaux encourage le commerce d'espèces protégées secrètement parmi les produits de la pêche commercialisés. Pour résoudre ce problème, nous avons amplifié des fragments du gène de la sous-unité I de la cytochrome oxydase (environ 595 paires de bases) à partir de 164 nageoires d'élasmobranches collectées sur des marchés aux poissons en Tanzanie, afin de vérifier si les espèces protégées et celles dont la conservation est préoccupante se trouvent parmi ces spécimens. De même, nous avons mené 130 entretiens approfondis avec des intervenants impliqués dans le commerce des nageoires d'élasmobranches afin de recueillir divers points de vue sur les facteurs qui perpétuent ce commerce. Nos résultats ont révélé quinze espèces d'élasmobranches, les requins requiem (Carcharhinidae) et les raies wedgefish (Rhinidae) représentant respectivement 44.1% et 33.8% des nageoires. Fait alarmant, plus de 70% des nageoires commercialisées provenaient d'élasmobranches menacés, dont 36.8% d'espèces en danger critique d'extinction. De manière inattendue, près de 9 % des nageoires commercialisées provenaient de deux espèces protégées au niveau national, <i>Carcharhinus longimanus</i> et <i>Alopias pelagicus</i>, ce qui met en évidence l'existence de lacunes réglementaires nécessitant une attention immédiate. De même, 91.2% des nageoires commercialisées provenaient d'espèces inscrites à la CITES, ce qui souligne la gravité du problème. Les entretiens ont mis en évidence les défis technologiques liés au suivi du commerce, la sensibilisation limitée sur les conséquences du commerce sur la durabilité des élasmobranches, la rareté des ressources de surveillance, la formation inadéquate pour identifier les itinéraires et les contrevenants et le manque de soutien public comme étant les principaux facteurs de perpétuation du commerce. Pour résoudre ces problèmes, il faut interdire totalement le commerce des nageoires d'élasmobranches, tout en augmentant le financement des agences chargées de l'application de la loi, en dispensant une formation spécialisée au personnel chargé de l'application de la loi, en organisant des campagnes de sensibilisation du public, en encourageant la surveillance au niveau communautaire et en collaborant avec les organisations internationales. Ce faisant, la Tanzanie peut protéger efficacement la durabilité des élasmobranches menacés et faire progresser les efforts de conservation de ces poissons à l'échelle mondiale.</p>","author":"Cyrus Rumisha, \nDeusdedith Barongo, \nJackson L. Saiperaki, \nSilvia F. Materu, \nRobinson H. Mdegela","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"c16422129b03c1635ac8901f53f1a5bb8128876387f83d10fd9063b3d482ba73","category":"Environment"}