{"title":"Health literacy among patients with non-communicable diseases at a tertiary level hospital in Nepal- A cross sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304816","date":1717423200000,"content":"<p>by Hari Joshi, Bhoj Raj Kalauni, Kiran Bhusal, Rabindra Bhandari, Aastha Subedi, Buna Bhandari</p>\r\n\r\nHealth literacy (HL) is crucial in achieving the Sustainable Development Goal of reducing one-third of premature mortality by 2030 from Non-Communicable Diseases (NCDs) and improving Universal Health Coverage. Low health literacy is linked to poor health outcomes, and evidence shows that levels of limited HL are high, even among highly educated individuals. This study aims to assess HL levels and related factors among patients with NCDs at Tribhuvan University Teaching Hospital (TUTH) in Nepal. A cross-sectional survey was conducted at TUTH among 303 patients with NCDs with Cardiovascular Diseases, Chronic Obstructive Pulmonary Disease, Diabetes Mellitus, Hypertension, Epilepsy, Asthma and Cancer who came for follow-up from December 2022 to February 2023. Data was collected via face-to-face interviews by the trained enumerators using a structured Health Literacy Questionnaire (HLQ) containing 44 items (divided into nine domains). Multivariate logistic regression analysis was performed using SPSS version 26, with statistical significance at 0.05, to determine the associated factors of HL. The mean ±SD age of the respondents was 47.4±16.18 years. More than half of the respondents were female (56.1%). The patients had higher HL in all HL domains except ‘Navigating the healthcare system’. Educational status was significantly associated with six out of nine HL domains. Co-morbidity, attendance at health-related seminars, regular physical activity, and social connectedness were associated with at least one of the domains of HL. This study identified the important factors of HL, such as socio-demographic and medical factors among patients with NCDs. This highlights the need for a comprehensive approach to address identified gaps in HL, considering its multifaceted and composite nature and promoting interventions to improve HL in high-risk populations.","author":"Hari Joshi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c181a643b4abafc3c7e2d6d7d93d065ed31599eb78a61330fb264581bf8e441b","category":"Interdisciplinary"}