{"title":"Devil’s Cardigan: The 2023 Australian Gravel National Championships – Scott Mattern & Kristina Vackova","link":"https://theradavist.com/australian-gravel-national-championships/","date":1698318028000,"content":"<p><em>Picture an island 42 degrees south of the equator deep in the middle of winter. Surrounded by great oceans, it is battered by cold rain, snow, and wind. The Roaring Forties haunt the island like the growls of a Devil. Born out of these challenging conditions, <a href=\"https://www.devilscardigan.com.au/\" target=\"_blank\">The Devils Cardigan</a> seemed the only name fit to describe the Australian Gravel National Championships. </em></p>\n<p><em>Read on for Scott Mattern’s recap of Tasmania’s annual off-road rite of passage and how he made it devilishly difficult by combing both the 50km and 100km distances…<span></span></em></p>\n<p><img loading=\"lazy\" width=\"2004\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?w=2004&amp;quality=75 2004w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=1024,681&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=2000,1330&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=768,511&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=1800,1197&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=1335,888&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=700,466&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-34.jpg?resize=1536,1022&amp;quality=75 1536w\" /></p>\n<h3>The Perfect Fit</h3>\n<p>There is nothing more satisfying than trying something on to find that it’s a perfect fit. And yet, what is a perfect fit? Before you step into something new or slip it over your head, how do you know how it will look and feel? Fit is such a personal and subjective preference, with a range of parameters that determine the final verdict for any particular person. Because fit is different for everybody, designing something to be universally loved is pretty challenging (if not impossible). However, there are are few steps and components to consider during the design process.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-46.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Based on that last paragraph, most readers might assume this article is about designing clothing. While I am here, in fact, to talk about a bike route, please humor this analogy to guide you through the story. Although there appears to be no connection, designing a bike route is actually a lot like the design of clothing.</p>\n<p>To achieve the perfect fit, we can agree a bike route needs to look and function like the designer intended. Like the favorites in your closet, when designed successfully, bike routes should be able to express a distinct style: be that short and tight, loose, and long, or even oversized. Like picking up a concert t-shirt, one’s personal meaning with a route is based on the experiences gained through riding and comes down to the subjectivity of the individual. So, imagine if a bike route was a piece of clothing, a cozy cardigan no less. Let’s look at what defines a perfect fit for the Devil’s Cardigan route, held each year in Lutruwita, Tasmania.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-15.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Sweater Weather</h3>\n<p>A perfect fit is a design that not only looks good but also functions as intended. “Fit for purpose,” you might say. If something is fit for purpose, what that intended purpose is then becomes important. If the intended fit was supposed to be tight, but the end result is boxy and droopy, then we agree this is not a good fit. However, if it was supposed to be larger and looser, then it might be perfect. It’s also appropriate to point out that a perfect fit is determined by not only the designer’s vision for a piece but also how the end user wants to wear it.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-44.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The next key consideration is the material used (and yes, this applies to the aforementioned bike route too!). No matter how well-designed, an article of clothing will not fit perfectly unless the material used aligns with this design and matches the intended purpose. Material construction can become quite complicated, so for the purpose of this analogy, let’s choose some simple categories: “smooth and silky,” “tough and hard-wearing,” and “rough and chunky” will serve nicely as some broad buckets. Note: another important consideration is how weather-resistant and insulating your materials of choice might be.</p>\n<p>Finally, once you have a design prepared, materials chosen, and fabric cut, there is the matter of bringing your vision to life. And that takes stitching. Stitching may seem like a minor detail, but no matter how good the design and amazing the chosen material is, if not stitched properly it will just fall apart.</p>\n<p></p>\n<p>The Devil’s Cardigan route design encompasses two day-ride courses: the shorter 50km route, or the 100km route that shares the opening stretch with its shorter companion, then splits off before looping back to finish at the same point. The design’s intended “fit” or purpose? A challenging mid-winter gravel race that—as the name suggests—provides a dark experience that the devil would be proud enough to wear.</p>\n<p></p>\n<p>In the two previous years, the race has definitely delivered the intended “sweater weather” conditions, and then some. Year one had near-freezing conditions with bouts of rain and sleet-like scuds. Year two served up near gale-force winds. So, in the weeks preceding, year three was anybody’s guess. The weather forecast ahead of the race looked grim; rain fell in near biblical proportions. A 50km ride in these predicted conditions was looking rough, let alone the full 100km. Flowing rivers appeared across the course that had not been there the day before.</p>\n<p>As evening settled on the eve of the race, it looked like there might be a break in the weather. The rain eased, and the wind backed off and a small ember of hope for better race day conditions began to glow. Entries on offer for race day were the short and tight 50km loop or the longer and looser 100km. But I had my own ideas for my perfect fit: a bit more length and width, what I think you could call oversized. I decided to combine both the 50km and 100km loop for an attempt on what I was dubbing the 150km XL Cardigan. As it was technically unsanctioned, I would have to start early and alone in order to align my attempt on the two laps with the timing of the existing longer race, which commenced at 8 a.m.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>This brings me to how I found myself at 4 a.m. on race morning: awake, listening, and considering the merit of trying on the XL Cardigan but also looking for a reason to stay in bed and not venture out in the dark for the first 50km lap. But, with now near-perfect conditions, I had no excuse.</p>\n<p>The early morning was cool but not cold by Tasmanian standards, with a thick fog blanketing my surroundings. The bicycle and I cut a lone figure in the dark of the pre-dawn hours. The surface under my tires quickly gave way to gravel, which then gave way to logging roads, as I climbed up into the fog.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-9.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The lights that I had so carefully chosen to illuminate my path during the first lap were refracted by the fog, and hindered rather than helped my visibility. As I broke out of the fog, I was greeted to a clear sky full of stars. The incline slowly backed off and the logging road intersected back gravel roads once again. Ascending turned to descending. All was quiet aside from the sounds of the abundant wildlife darting its way across my path. I feel alone on these roads.</p>\n<p>The comparison of this quiet and calm first lap would later be starkly juxtaposition to the loud chaotic coral of the second 100km lap, which I would soon ride with the rest of the competitors. The previous days of heavy rain left its mark on the single-track portion of the route and turned it into one steady trickling creek. What should have been a highlight became a challenging and gritty grind to end the ride back and start before commencing the second lap.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-14.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Fifty kilometers down and 100 to go; what started as short and tight was soon to be long and loose. With a brief window, I grabbed a warm drink and a second breakfast before the final lap. Grouped in with everybody else, my quiet little ride became a chaotic whirlwind of 400 riders poised to commence their ride. By this time, the sun had risen and a foggy glow showed the promise of day. The second lap felt familiar but different in the daylight and the madness of sharing the roads with 400 other riders. What was a solo ride morphed into a race for the green and gold, for the Australian gravel national jersey no less.</p>\n<p>Alliances were made with other riders and we shared the load of grinding through the miles. Most of the ride is now lost in a blur of bar-chewing climbs and bone-rattling descents, but interspersed are brief, golden moments of noticing the light rays that glinted through the trees and the fog. Cold clear blue skies greeted us over the tops of each climb. The race also held seconds-long greetings between friends both new and old; these kind of shared experiences are only made possible by a ride such as this.</p>\n<p><img loading=\"lazy\" width=\"2004\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?w=2004&amp;quality=75 2004w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=1024,681&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=2000,1330&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=768,511&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=1800,1197&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=1335,888&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=700,466&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Devils-Cardigan-49.jpg?resize=1536,1022&amp;quality=75 1536w\" /></p>\n<p>The extra miles took their toll and the ability to stay at the pointy end of the ride faded, but I settled into what was the perfect ride fit for me. I finished the ride just as others with a smile, a congratulations, and a cold beer.</p>\n<p>Be it short and tight, long and loose, or oversized, a first place or last, simply finishing what was the perfect fit for each rider provides a satisfying glow.</p>\n<p>Seeing faces light up when a fit comes together like this, as a designer and route-maker, the confidence it brings is visible. From bike route to a favorite sweater, ultimately, a good fit is what makes the wearer feel their best and makes you return to it again and again.</p>\n<p><em>The Devils Cardigan has been confirmed as the Australian Gravel National Championship for 2024. Be sure to check in <a href=\"https://www.devilscardigan.com.au/\">here</a> for more info on next year’s event!</em></p>\n<p>The post <a href=\"https://theradavist.com/australian-gravel-national-championships/\">Devil’s Cardigan: The 2023 Australian Gravel National Championships</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"c18b987b5f1c5e1b0e2bc3537859e64328b76a985a1aac71f777e09204817a14","category":"Cycling"}