{"title":"The Study of Crystallization Kinetics and Chemical Changes in Ge4Sb4Te5 through Transmission Electron Microscope","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.838/7719958?rss=1","date":1721779200000,"content":"<span>Phase-change materials are currently being investigated for many important applications including phase-change memory [<a href=\"#ozae044.838-B1\">1</a>]. The most studied alloy is Ge<sub>2</sub>Sb<sub>2</sub>Te<sub>5</sub>, which exists in several polymorphs such as a metastable face-centered-cubic structure (FCC) cubic at ∼150 <sup>°</sup>C and a stable hexagonal at ∼300 <sup>°</sup>C have been observed after heating the initially amorphous phase [<a href=\"#ozae044.838-B2\">2</a>]. These structural changes happen at a very rapid pace and therefore capturing the dynamics of the processes is key to understand the corresponding functional behaviors such as electrical and optical properties [<a href=\"#ozae044.838-B3\">3-5</a>]. For example, the degree of crystallinity is expected to influence the electrical resistivity in phase-change materials and therefore its quantification is important to correlate the electrical resistivity measurements. Moreover, investigation of concurrent chemical changes vis-à-vis structural modifications is another issue to address in this class of materials. Lower amorphous to crystalline transformation temperatures in Ge<sub>2</sub>Sb<sub>2</sub>Te<sub>5</sub> is a drawback for their usage in high temperature applications. Ge-rich GST alloys are reported to possess higher crystallization temperatures accompanied with phase separation [<a href=\"#ozae044.838-B6\">6</a>]. Moreover, chemical segregation has also been noted prior to crystallization events in these alloys [<a href=\"#ozae044.838-B3\">3</a>,<a href=\"#ozae044.838-B7\">7</a>,<a href=\"#ozae044.838-B8\">8</a>]. In this paper, we present in-situ heating investigation of Ge<sub>4</sub>Sb<sub>4</sub>Te<sub>5</sub> alloy (GST-445) thin film of thickness ∼30 nm deposited on Protochips inside TEM from room temperature to 400 <sup>°</sup>C. Studies on crystallization temperatures, phase evolutions and associated compositional changes have been carried out and results are compared with those of Ge<sub>2</sub>Sb<sub>2</sub>Te<sub>5</sub> alloy. For examples, a sample was heated in steps of 25 <sup>°</sup>C from room temperature to 100 <sup>°</sup>C followed by in steps of 10 <sup>°</sup>C from 150 <sup>°</sup>C onwards. This sample was observed to remains amorphous up to 140 <sup>°</sup>C and the first sign of crystallization was observed at ∼150 <sup>°</sup>C when investigated by following selected area diffraction (SAD) patterns during heating inside the TEM. With further heating, growth of the initially nucleated grains has been observed. A representative SAD pattern and corresponding bright-field TEM image acquired at 180 <sup>°</sup>C is shown in Figure 1(a) and 1(b), respectively. The spotty rings (cf. Figure 1(a)) suggested the random nucleation and growth of crystals and could be indexed as those of FCC-Ge<sub>2</sub>Sb<sub>2</sub>Te<sub>5.</sub> Figure 2 shows the processed snapshots using custom written Python script of the in-situ acquired images by employing K3 IS camera at room temperature, 50 <sup>°</sup>C, 100 <sup>°</sup>C, and 140 <sup>°</sup>C during heating from room temperature to 140 <sup>°</sup>C inside the Titan. These images clearly indicates that domains of crystalline regions are observed even at room temperature in GST-445, which could not be detected in SAD diffraction patterns in Tecnai F30. Samples were examined for their structure and chemistry employing a FEI Tecnai F30 and Cs-corrected Titan ETEM. Morphological and structural evolutions were captured during heating inside the Titan equipped with a high-speed camera (K2/K3 IS) under low-dose conditions to minimize the beam induced changes in the samples. For chemical analysis STEM-EDS and STEM-EELS characterizations are performed [<a href=\"#ozae044.838-B9\">9</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"c19864e6bd85b615b6a260d1483ec302256ce6ed3ba58b60c4d6d998b92e498a","category":"Environment"}