{"title":"Imaging Point Defects in Quantum Materials Using Multislice Electron Ptychography","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.742/7720015?rss=1","date":1721779200000,"content":"<span>Structural defects are widely used to modify and optimize the properties of quantum materials. Point defects, including vacancies and substitutional or interstitial dopants in bulk samples, are among the most prevalent yet least explored defect categories by transmission electron microscopy (TEM), primarily due to the challenges associated with their direct imaging. Due to the transmission geometry of TEM, weak signals from point defects have to be distinguished from the intense background signal scattered from the matrix. In order to maintain a sufficient contribution from point defects while minimizing the channeling effect of multiple electron scattering, all direct imaging techniques, such as high-angle annular dark-field (HAADF) imaging, rely on thin samples of less than a few nanometers in thickness and heavy dopants within a light-element matrix [<a href=\"#ozae044.742-B1\">1-3</a>]. Point defects of light elements, such as H, Li, O, are critical to the physical properties of many quantum materials but have not been extensively studied. Recent developments in multislice electron ptychography (MEP) using a 4D-STEM setup, Fig. 1(A), solve the inverse multiple electron scattering problem computationally and allow three-dimensional depth sectioning [<a href=\"#ozae044.742-B4\">4</a>]. The detection of single interstitial atomic dopants in thick samples has been demonstrated by both simulations [<a href=\"#ozae044.742-B4\">4</a>] and experiments [<a href=\"#ozae044.742-B5\">5</a>]. In this talk, I will report our recent advances in MEP, especially in the quantification of chemical concentration and the improvement of depth resolution.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"c19eedf725f73a301d6165043daacf308d595e2a5db273c925fa8dbc53303156","category":"Environment"}