{"title":"TypeTaxonScript: sugarifying and enhancing data structures in biological systematics and biodiversity research","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae017/7628625?rss=1","date":1710374400000,"content":"<span><div>Abstract</div>Object-oriented programming (OOP) embodies a software development paradigm grounded in representing real-world entities as objects, facilitating a more efficient and structured modelling approach. In this article, we explore the synergy between OOP principles and the TypeScript (TS) programming language to create a JSON-formatted database designed for storing arrays of biological features. This fusion of technologies fosters a controlled and modular code script, streamlining the integration, manipulation, expansion, and analysis of biological data, all while enhancing syntax for improved human readability, such as through the use of dot notation. We advocate for biologists to embrace Git technology, akin to the practices of programmers and coders, for initiating versioned and collaborative projects. Leveraging the widely accessible and acclaimed IDE, Visual Studio Code, provides an additional advantage. Not only does it support running a Node.js environment, which is essential for running TS, but it also efficiently manages GitHub versioning. We provide a use case involving taxonomic data structure, focusing on angiosperm legume plants. This method is characterized by its simplicity, as the tools employed are both fully accessible and free of charge, and it is widely adopted by communities of professional programmers. Moreover, we are dedicated to facilitating practical implementation and comprehension through a comprehensive tutorial, a readily available pre-built database at GitHub, and a new package at npm.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"c1ab14690e367e2f555b85c6dfed20dc80144579cbd53a571a1c821e5734a128","category":"Environment"}