{"title":"Real-time Monitoring of Cable Sag and Overhead Line Parameters Based on a Distributed Sensor Network and Implementation in a Web server and IoT","link":"https://www.preprints.org/manuscript/202405.1414/v1","date":1716305127000,"content":"Based on the need for real-time sag monitoring of Overhead Power Lines (OPL) for electricity transmission, this article presents the implementation of a hardware and software system for online monitoring of OPL cables and cable sag determination. The mathematical model based on differential equations and the methods of algorithmic calculation of OPL cable sag are presented. Considering that, based on the mathematical model presented, the calculation of OPL cable sag can be done in different ways depending on the sensors used, and the presented application uses a variety of sensors. Therefore, a direct calculation is made using one of the different methods. Subsequently, the verification relations are highlighted directly and, respectively, the calculation by the alternative method, which uses another group of sensors, to generate both a verification of the calculation and the functionality of the sensors, thus obtaining a defect observer of the sensors. The hardware architecture of the OPL cable online monitoring application is presented, together with the main characteristics of the sensors and communication equipment used. The configurations required to transmit data using the ModBUS and ZigBee protocols are also presented. The main software modules of the OPL cable condition monitoring application are described, which ensure the monitoring of the main parameters of the power line and the visualisation of the results both on the electricity provider's intranet using a web server and MySQL database, and on the Internet using an Internet of Things (IoT) server. This categorisation of the data visualisation mode is done in such a way as to ensure a high level of cyber security. Starting from the mathematical model of the OPL cable sag calculation, it goes through the stages of creating such a monitoring system, from the numerical simulations carried out using Matlab to the real-time implementation of this monitoring application. The main modules of the application software are: the software module for reading quantities from the sensor network through a ModBUS Input/Output (I/O) server, the software module for real-time calculation of the OPL cable sag, the software module for read/write operations based on MySQL type data, the software module for transferring data to the user's intranet through a web server, and the software module for viewing data by authorised users based on user and password through an IoT server. The development software environments used are Matlab and Laboratory Virtual Instrument Engineering Workbench (LabVIEW).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c1ad1c7fa47f3d2b40c57ef7b553d2de23a8c450021b998ab5914264cf0c1ef3","category":"Interdisciplinary"}