{"title":"Exploring the prevalence of childhood adversity among university students in the United Kingdom: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308038","date":1724853600000,"content":"<p>by Jackie Hamilton, Alice Welham, Gareth Morgan, Christopher Jones</p>\r\nObjectives <p>The focus of this review was to systematically review and meta-analyse the prevalence of ACEs among university students in the UK.</p> Method <p>The systematic searching of six electronic databases (conducted February 2024) identified ten relevant articles (peer-reviewed articles of a quantitative nature that included ACE prevalence). PROSPERO reference: CRD42022364799.</p> Results <p>Pooled prevalence for number of ACEs endured was 55.4% (95% CI: 32.4% - 78.4%; I<sup>2</sup> &gt; 99.5%) for one or more, and 31.6% (7.5% - 55.6%; I<sup>2</sup> &gt; 99.5%) for three or more. Pooled prevalence was: 15.9% (7.0% - 24.7%; I<sup>2</sup> &gt; 94.5%) for physical abuse; 27.0% (18.1% - 35.9%; I<sup>2</sup> &gt; 94.5%) for emotional abuse; 12.1% (5.2% - 19.0%; I<sup>2</sup> &gt; 94.5%) for sexual abuse; 8.4% (1.7% - 15.1%; I<sup>2</sup> &gt; 95.4%) for physical neglect, and 30.0% (21.5% - 38.5%; I<sup>2</sup> &gt; 95.4%) for emotional neglect. Pooled prevalence for household dysfunction categories were: 34.4% (22.8% - 46.0%) for parental separation; 18.4% (10.1% - 26.8%) for domestic violence; 35.2% (23.6% - 46.8%) for mental health difficulties; 21.4% (12.9% - 29.9%) for substance use; and 5.7% (2.3% - 9.1%) for incarceration (I<sup>2</sup> &gt; 88.8% for all household dysfunction items). Significant heterogeneity was observed between studies for most categories of adversity, and it was not possible to explain/reduce this variance by removing small numbers of influential/discrepant studies. Further analyses suggested potential influences of measurement tool used, country of data collection, and age and sex of participants.</p> Conclusion <p>Results demonstrate considerable, largely unaccounted-for, heterogeneity in estimates of the prevalence of ACEs, impeding confidence in any summary statistics. Conclusions must be tentative due to analyses being underpowered given small numbers of papers, as well as potential confounds, meaning results may not be truly representative. However, results do suggest high prevalence rates which warrant further investigation, with appropriate support offered to students.</p>","author":"Jackie Hamilton","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c1b173ef8cd06fe43facdec1a3ac327043351f04fc440bdd7a14aaea25b97851","category":"Interdisciplinary"}