{"title":"Wind turbine with line-side PMSG FED DC-DC converter for voltage regulation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305272","date":1719583200000,"content":"<p>by B. Nagi Reddy, Radhika Jalli, K. Sai Prudhviraj, K. Badrinath Shetty, Ch. Rami Reddy, Hossam Kotb, Ahmed Emara, Mohammed Alruwaili</p>\r\n\r\nThis article represents a novel study of the design and analysis of a wind turbine system that includes a line-side permanent magnet synchronous generator (PMSG) with an ultra-step-up DC-DC converter for voltage regulation. Integrating renewable energy sources such as wind power into the grid requires efficient and reliable power conversion systems to handle fluctuating power and ensure a stable power supply. The wind turbine system utilizes a PMSG, which offers several advantages over traditional induction generators, including higher efficiency, reduced maintenance, and better power quality. The line-side configuration allows for increased control and flexibility, allowing the system to respond dynamically to grid conditions. This wind turbine system involves the integration of a grid-side PMSG-fed DC-DC converter between the PMSG and the grid. The converter enables a seamless flow of electricity between the wind turbine and the grid. By actively controlling the intermediate circuit voltage, the converter efficiently regulates the output voltage of the wind turbine and thus enables constant power generation regardless of fluctuating wind speeds. The simulation outcomes illustrate the efficacy of the proposed system in achieving voltage regulation and seamless integration with the grid. Performance is evaluated under various operating conditions and compared to conventional wind turbines.","author":"B. Nagi Reddy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c1b3793074e14697d30ea461fa3c9e3a1808b165fa98f44842bc45ea36a7f860","category":"Interdisciplinary"}