{"title":"Sam Altman ชี้แจงประเด็น Elon Musk ฟ้องร้อง - เพราะมีคนคอยจ้องโจมตีเราอยู่ตลอดอยู่แล้ว","link":"https://www.blognone.com/node/138497","date":1709338836000,"content":"<div><div><div><p>Jason Kwon หัวหน้าฝ่ายยุทธศาสตร์ของ OpenAI ออกอีเมลถึงพนักงานทุกคน หลังจาก <a href=\"https://www.blognone.com/node/138492\">Elon Musk หนึ่งในผู้ร่วมก่อตั้ง OpenAI ยื่นฟ้อง</a>ซีอีโอ Sam Altman และ Gregory Brockman ประธานบอร์ด ข้อหาละเมิดสัญญา นำ GPT-4 ไปแสวงหากำไรโดยไม่เปิดเผยโครงสร้าง ซึ่งไปจากแนวทางตอนก่อตั้ง โดย Kwon บอกว่าสิ่งที่คนใน OpenAI มีเป้าหมายและกำลังทำอยู่ ไม่ใช่เรื่องที่ Musk พยายามกล่าวหา ทั้งการบอกว่า GPT-4 เป็น AGI (AI ใช้งานได้ทั่วไป) หรือการบอกว่าบริษัทเป็นบริษัทในเครือไมโครซอฟท์</p>\n<p>ซีอีโอ Sam Altman ก็ส่งอีเมลอธิบายจากเหตุการณ์เดียวกัน บอกว่าปีนี้จะเป็นที่ยากลำบากปีหนึ่งของบริษัทแน่นอน เพราะมีคนคอยจ้องโจมตีเราอยู่ตลอดอยู่แล้ว</p>\n<p>อีเมลของ Kwon ยังชี้แจงข้อกล่าวหาแต่ละข้อของ Musk แบบละเอียดดังนี้</p>\n<ul>\n<li><strong>GPT-4 เป็น AGI:</strong> จริงอยู่ว่า GPT-4 ทำงานตามคำสั่งได้หลายอย่าง แต่ก็ยังห่างไกลมากจากงานทั้งหมดที่มนุษย์ทำได้ GPT-4 ยังไม่เข้าใกล้จุดนั้น</li>\n<li><strong>OpenAI ละเลยภารกิจหลักในการสร้าง AI สำหรับมนุษยชาติ:</strong> ความท้าทายขององค์กรยังคงเป็นการสร้าง AGI ที่เป็นประโยชน์ต่อทุกคน ซึ่งในระหว่างการพัฒนานั้นเทคโนโลยีสามารถทำเงินได้ จึงผสานผลประโยชน์เพื่อให้ได้เงินทุนเพิ่มเติม และนำมาพัฒนาสิ่งใหม่ ๆ ต่อ</li>\n<li><strong>OpenAI ปฏิบัติเหมือนเป็นบริษัทลูกของไมโครซอฟท์:</strong> ภารกิจของ OpenAI คือวิจัยและสร้างผลิตภัณฑ์ ไมโครซอฟท์คือคู่แข่งรายหนึ่งของเราเช่นกัน มีผลิตภัณฑ์ที่ทับซ้อนและแข่งขันโดยตรง</li>\n</ul>\n<p>ที่มา: <a href=\"https://www.axios.com/2024/03/01/openai-rejects-elon-musk-lawsuit-claims\">Axios</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e368d657dc525c7cbbbd2b08b21c08ca.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/sam-altman\">Sam Altman</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c1b909d3f825689c8c8533c2d7298a685e9be073e145c7cebf88aeb1b65a80b1","category":"Thai"}