{"title":"Kyle’s Sklar Touring Fat Bike in 29+ Mode – john watson","link":"https://theradavist.com/2021/04/kyles-sklar-touring-fat-bike-in-29-mode/?utm_source=rss&utm_medium=rss&utm_campaign=kyles-sklar-touring-fat-bike-in-29-mode","date":1619438413000,"content":"<p>With the snow melting and the season ripe for desert ramblings, <a href=\"https://www.instagram.com/hinterlanded/?hl=en\" target=\"_blank\">Kyle Klain</a> took his 2016 NAHBS-built <a href=\"https://www.sklarbikes.com/\" target=\"_blank\">Sklar</a> fatbike and converted it to 29+. After spending all winter with fatbike 26+ tires, the bike has undergone quite the transformation. This weekend while celebrating my 40th birthday in Southeastern Utah, I documented this stunning build in the morning sun. Check it out in detail below…<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/SonyTest-356.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/04/SonyTest-360.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>About the Frame</strong></p>\n<p>This was one of Adam Sklar’s early fatbikes. He built a handful before deciding not to offer them anymore. It was built for Colin Frazer and Adam built himself one. Living in Bozeman, they were both curious about this platform but shortly after building the bikes, they both decided they weren’t really into fatbikes. </p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-14.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-33.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Adam included this bike in his 2016 NAHBS showcase and it sports a beautiful paintjob by <a href=\"http://www.blackmagicpaint.com/sklar-fat-bike\" target=\"_blank\">Black Magic Paint</a>. Adorned with treeline and other random insignia, it’s a real sleeper of a livery. You can get lost looking at it in various lighting. My personal favorite detail is the chainstay treeline. Rudi and the team really knocked it out of the park with this one!</p>\n<p>Colin held onto the bike for a while, kicking around the idea of using it for a desert touring bike but unfortunately, it sat in my office storage in Los Angeles for a few years being unridden. He eventually sold it and the new owner decided fatbikes weren’t for him either, so it ended up online for sale again. Then my good friend Kyle Klain here in Santa Fe bought the bike, not knowing the backstory…</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-10.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Kyle’s Build</strong></p>\n<p>So one day I’m at my computer working and Kyle sends me a text, exclaiming that he needs to sell his old fatbike because he just picked up a new Sklar. I knew Adam made only a handful of those bikes and I had a suspicion I knew which one he bought. Low and behold, Colin’s old fatbike ended up in Kyle’s possession. We spent the winter months riding our snow-covered trails with our fatbikes – his wife Kim has a sweet Rocky Mountain – and enjoying our fresh powder days but once the snow melted, he had big plans for the build. </p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-52.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-20.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>He started with a <a href=\"https://roguepanda.com/\" target=\"_blank\">Rogue Panda</a> custom framebag and a new fork. The OG Sklar fork hit the downtube, one of the unfortunate byproducts of a hurried NAHBS deadline, so he picked up a Fatback fork for it. Then came the new 29+ wheelset with a Shutter Precision fatbike-spaced hub. Raceface cranks, <a href=\"https://www.ovejanegrabikepacking.com/\" target=\"_blank\">Oveja Negra</a> bags, XT mech, Sun Ringlé wheels, Magura brakes, <a href=\"https://www.sinewavecycles.com/products/sinewave-cycles-beacon\" target=\"_blank\">Sinewave Beacon</a> lamp with a custom fabricated mount, a Thomson post, and stem rounded out the build. </p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-15.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-59.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>A pair of <a href=\"https://www.doombars.com/\" target=\"_blank\">DOOM Bars</a> from down the hill in Albuquerque was the literal icing on the cake!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-27.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><em>He took his fatbike and converted it to a perfect desert rambler. The 29+ platform bodes well with the fat frame clearances, raising the bottom bracket height slightly but keeping the steering nimble. A big critique of fatbikes are their wide q-factor, an argument I personally don’t understand. Kyle shares the same sentiment. Riding with your feet as wide as your hips is not only better for your knees but is largely more efficient. I like the analogy of doing leg presses or squats in the gym. You want your feet to be wide to push the weight and with a desert bike, you’ll be doing exactly the same thing, as many tours require multiple liters of water…</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-5.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This weekend, Kyle broke this bike in, sharing some of his favorite desert locales with a small group of friends, pedaling from our camp to hidden gems, through deep sand, and over slickrock escarpments. It was a dreamy experience. Here’s to many more weekends of dusty feet and red-dirt caked drivetrains…</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/Kyles-Sklar-Touring-Bike-6.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Got any questions? Drop them in the comments!</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"c1c4e64212105e9c26cea5202a04129b09be62503b7ab470b2ffe42c1e9a18cc","category":"Cycling"}