{"title":"Exploring the determinants of risk behavior for transfusion transmissible infections among first-time blood donors in Mandalay General Hospital, Myanmar","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304134","date":1716472800000,"content":"<p>by Myo Zin Oo, Soe Sandi Tint, Nutchar Wiwatkunupakarn, Alessio Panza, Chaisiri Angkurawaranon, Kyaw Min Oo</p>\r\nIntroduction <p>Blood donation is vital to healthcare, but it must be kept safe by mitigating the risk of transfusion transmissible infections (TTIs). The objective of this study was to investigate the factors that influence risk behavior for transfusion transmissible infections among first-time blood donors at Mandalay General Hospital, Myanmar.</p> Methods <p>This study utilized a cross-sectional study design using secondary data. Mandalay city and Mandalay Blood Bank in Mandalay General Hospital were purposely selected and a total of 406 first-time blood donors participated. A structured questionnaire administered by an interviewer was used. The questionnaire contained background characteristics, knowledge on TTIs, attitude toward TTIs, and TTIs risk behaviors. To examine the determinants (background characteristics, knowledge, and attitude) that affect risk behavior, inferential statistics techniques that included the chi-squared test, bivariable logistic regression, and multivariable logistic regression were applied. A p-value of less than 0.05 signified statistical significance.</p> Results <p>Among 406 first-time blood donors, 52.9% were under 20 years old, and 53.7% were male. Most had undergraduate education (77.6%), were married (84.2%), and were students (55.7%). Additionally, 76.8% hadn’t received the hepatitis B vaccine. Blood groups were distributed as follows: B (40.0%), O (33.8%), A (23.4%), AB (8.9%). About 15.8% showed high knowledge level, and 63.6% had high attitude. Notably, 29.3% exhibited high-risk behavior for TTIs. Age was associated with lower risk behavior (OR = 1.54, 95% CI: 0.99, 2.38, <i>p</i> = 0.049), but lost significance in multivariable regression (<i>p</i> = 0.214). Knowledge on TTIs didn’t show significance. However, high attitudes were significantly associated with lower risk behavior (OR = 11.4, 95% CI: 1.25, 103.83, <i>p</i> = 0.017, retained in multivariable regression, <i>p</i> = 0.012).</p> Conclusion <p>Findings of this study contribute in the development of programs that ensure a safe and reliable blood supply chain. To improve blood safety standards among first-time blood donors, this study highlights the value of targeted education and screening processes, placing particular emphasis on acquiring knowledge and positive attitude toward blood donation and risk behavior.</p>","author":"Myo Zin Oo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c1c653d80aff1d004b60eb47da80819bed23193d2b2a6c6948a63b1a92d8d06f","category":"Interdisciplinary"}