{"title":"สัมผัส ThinkStation และ ThinkPad เวิร์คสเตชั่นจาก Lenovo ที่ตอบโจทย์การทำงานไฮบริดพร้อมพลังจาก GPU NVIDIA ระดับมืออาชีพ","link":"https://www.blognone.com/node/134490","date":1687485600000,"content":"<div><div><div><p>การทำงานทุกวันนี้ต้องการประสิทธิภาพและพลังที่เพิ่มขึ้นเพื่อรองรับความซับซ้อนของชิ้นงาน แต่ก็ต้องสอดคล้องกับการทำงานที่มีลักษณะเป็นไฮบริด มีขนาดเล็กใช้งานได้หลากหลายด้วยเช่นกัน ทำให้ Lenovo พัฒนาเวิร์คสเตชั่นชุดใหม่ที่ตอบโจทย์การทำงานได้ดียิ่งกว่าเดิม ทั้งส่วนของ ThinkStation ทำงานได้เต็มประสิทธิภาพและ ThinkPad ที่เหมาะกับการทำงานแบบพกพา เรียกว่า ผ่านการออกแบบมาเป็นอย่างดี</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1993c87798fdf08e1c49783de858de58.jpg\" /></p>\n<p>แน่นอนว่าขุมพลังภายในเวิร์คสเตชั่นของ Lenovo ชุดนี้ มาพร้อมกับใบรับรอง ISV ผู้ใช้งานสามารถกำหนดค่าเวิร์คสเตชันที่ออกแบบเฉพาะและสร้างขึ้นจากส่วนประกอบที่ล้ำสมัย ใช้ โปรเซสเซอร์ Intel Core เจนเนอเรชั่น 13 รุ่นใหม่ล่าสุด และ GPU NVIDIA RTX ระดับมืออาชีพ มั่นใจแบบจัดเต็มเรื่องการทำงาน และปิดท้ายด้วยระบบปฏิบัติการรุ่นล่าสุดทั้ง Windows 11 และ Linux</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0628a0b2205c0293c241fb90e7169dce.jpg\" /></p>\n<p><strong>ThinkStation P3 พลังแห่งการทำงานที่เหนือล้ำ</strong></p>\n<p>เริ่มต้นกันที่ ThinkStation P3 ได้รับการออกแบบมาเพื่อรองรับการทำงานแบบไฮบริด มีทั้งประสิทธิภาพและความสามารถเต็มเปี่ยม ประกอบด้วยรุ่น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c11f38b588bd0918714f6b542b3c1db0.jpg\" /></p>\n<ul>\n<li><strong>ThinkStation P3 Tower</strong> มีแชสซีที่กว้างขึ้น รองรับการตั้งค่าที่หลากหลายได้มากขึ้น มาพร้อมกับโปรเซสเซอร์ Intel Core เจนเนอเรชั่น 13 รุ่นใหม่ล่าสุด รองรับกราฟิกระดับ NVIDIA RTX A5500 รองรับหน่วยความจำ DDR5 ได้สูงสุด 128GB จัดเก็บข้อมูลได้ 6 ไดรฟ์ เพิ่มพื้นที่จัดเก็บได้สูงสุด 26TB สำหรับแอปพลิเคชั่นที่มีข้อมูลจำนวนมาก มีช่องขยาย PCIe จำนวน 4 ช่องและรองรับพาวเวอร์ซัพพลายที่มีขนาดใหญ่สูงสุด 1100W และมาในราคาที่จับต้องได้</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a8812cfb72e72dd8524b61e8adfd0096.jpg\" /></p>\n<ul>\n<li><strong>ThinkStation P3 Ultra</strong> เวิร์คสเตชั่นอัจฉริยะที่อัดแน่นด้วยขุมพลังในแชสซีขนาดกระทัดรัด เล็กกว่า 4 ลิตร ปรับให้เข้ากับพื้นที่ทำงานแบบไฮบริดได้เป็นอย่างดี มีกราฟฟิก NVIDIA RTX A5500 และอุปกรณ์เสริม BMC (baseboard management controller) ที่จะเปิดตัวในปลายปีนี้ จะมีความสามารถที่ช่วยให้ควบคุมและตรวจสอบและจัดการระบบได้จากระยะไกล</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/12cbaa69b0f956829e0faf241b831425.jpg\" /></p>\n<ul>\n<li><strong>ThinkStation P3 Tiny</strong> ออกแบบมาเพื่อใช้งานในพื้นที่จำกัด ด้วยพื้นที่ขนาด 1 ลิตร แต่ไม่ต้องห่วงเรื่องความทรงพลัง ได้รับการรับประกันการรับรอง ISV มาพร้อมกราฟิก NVIDIA T1000 รองรับจอแสดงผลสูงสุด 6 จอ มีส่วนช่วยเพิ่มศักยภาพการทำงานให้กับสถาปนิกและวิศวกร, นักวิเคราะห์การเงิน, ผู้เชี่ยวชาญด้านสุขภาพ และการศึกษา STEM ได้จากทุกที่</li>\n</ul>\n<p>โดยสรุปแล้ว บอกได้เลยว่า ThinkStation P3 คือเวิร์คสเตชั่นรุ่นใหม่ล่าสุด ที่เป็นรุ่นระดับเริ่มต้นที่ทรงพลังที่สุดของ Lenovo เหมาะกับผู้ใช้งานทั้งในด้านสาขาวิศวกรรมและสถาปัตยกรรม, การเงิน, การศึกษาขั้นสูง รวมถึงแอปพลิเคชันทางการแพทย์ ก็สามารถปรับแต่งและกำหนดค่า ThinkStation P3 ใหม่ได้ตามความต้องการของแต่สายอาชีพ</p>\n<p><strong>ThinkPad P Series พลังระดับพรีเมียมกับการพกพาได้อย่างอิสระ</strong></p>\n<p>สำหรับ ThinkPad P Series ได้รับการออกแบบมาให้มีพลังในการทำงานอย่างเต็มเปี่ยม มีความทนทานและปลอดภัยมากขึ้น เพื่อรองรับการใช้งานแบบพกพา นำเสนอโซลูชั่นที่ได้รับการรับรอง ISV มีราคาให้เลือกหลากหลายตามความต้องการและจุดประสงค์การใช้งาน ตัวเครื่องมีการใช้วัสดุรีไซเคิลและวัสดุพลาสติก (PCC) มากขึ้นในผลิตภัณฑ์ เพื่อสนับสนุนเศรษฐกิจหมุนเวียน ในการนำวัสดุหลังการใช้งานมารีไซเคิลและใช้กับผลิตภัณฑ์เลอโนโว 100% ภายในปี 2025 ประกอบด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/aa268d70ef9c326bc4370ca903dd0dcd.jpg\" /></p>\n<ul>\n<li><strong>ThinkPad P16 Gen 2</strong>: แล็ปท็อปทรงพลัง หน้าจอขนาด 16 นิ้วของ Lenovo มาพร้อมโปรเซสเซอร์ Intel Core HX-series เจนเนอเรชั่น 13 ใหม่ล่าสุด มอบกราฟิกประสิทธิภาพสูงอย่าง NVIDIA RTX 5000 Ada Generation GPU สำหรับเวิร์คสเตชันแบบพกพา เหนือชั้นทั้งในด้านความเร็ว สมรรถนะ และประสิทธิภาพ พื้นที่จัดเก็บข้อมูล PCIe Gen 5 รองรับ I/O และ DDR5 สูงสุด 192GB จึงมั่นใจได้ว่าแม้ข้อมูลจะมีความซับซ้อน แต่เวิร์คสเตชันรุ่นนี้จะมอบประสิทธิภาพความลื่นไหลให้เต็มพิกัดอย่างแน่นอน</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0e12d4665cf7a7f8895abb83c5e6eb24.jpg\" /></p>\n<ul>\n<li><strong>ThinkPad P1 Gen 6</strong>: เวิร์คสเตชันที่มาพร้อมคุณสมบัติที่ทรงพลัง คล่องตัว และดีไซน์โฉบเฉี่ยวบางเบาพิเศษด้วยน้ำหนัก 1.78 กก. ผู้ใช้งานสามารถกำหนดค่าด้วยหน้าจอสัมผัส OLED ขนาด 16 นิ้ว พร้อมฟีเจอร์ลดแสงสีฟ้า ลดอาการปวดล้าต่อดวงตา การปรับสีจากโรงงานจะมอบภาพที่คมชัดมากขึ้น รวดเร็วมากขึ้นด้วย WiFi-6E และอุปกรณ์เสริม 4G LTE เพื่อให้การเชื่อมต่อจากพื้นที่ห่างไกลให้มีความเสถียรมากขึ้น กล้องเว็บแคมความคมชัด 5MP กราฟิกระดับสูง NVIDIA RTX 5000 Ada Generation GPU ในรุ่นเวิร์คสเตชันแบบพกพา หรือ NVIDIA GeForce RTX 4090</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3a06ed4f1bdf55f5e342bfeb9a610a6f.jpg\" /></p>\n<ul>\n<li><strong>ThinkPad P16v i Gen 1</strong>: P16v รุ่นใหม่ ออกแบบมาเพื่อลดช่องว่างระหว่างเวิร์คสเตชันระดับเริ่มต้นและระดับไฮเอนด์ โดยมีประสิทธิภาพในการจัดการงานที่ซับซ้อนจำนวนมากอย่างง่ายดาย บนการใช้งานโปรเซสเซอร์ระดับสูงอย่าง Intel Core H เจนเนอเรชั่น 13 และ NVIDIA RTX 2000 Ada Generation GPU สำหรับเวิร์คสเตชันแบบพกพา อุ่นใจเพิ่มอีกระดับเมื่อมีช่องระบายความร้อนคู่ ช่วยให้เครื่องเย็น เพิ่มความคล่องตัวให้แก่ผู้ใช้งาน</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/048781af257c45ab92d18f22f1c61e4d.jpg\" /></p>\n<ul>\n<li><strong>ThinkPad P14s i Gen 4 and P16s i Gen 2</strong>: เวิร์คสเตชันที่มาพร้อมตัวเลือกหน้าจอในขนาด 14 และ 16 นิ้ว มอบอายุการใช้งานแบตเตอรี่ ที่ช่วยเพิ่มประสิทธิภาพการใช้งานให้ผู้ใช้อย่างยาวนาน เครื่องมาในสีดำและสีเทาสตอร์มเกรย์ให้เลือก พร้อมตัวเลือกหน้าจอ OLED และหน้าจอลดแสงสีฟ้า เอาใจผู้ใช้งานเว็บแคมด้วยกล้องความละเอียดขนาด 5MP และ NVIDIA RTX A500 GPU เพิ่มประสิทธิภาพสูงสุดในการทำงานให้แก่ผู้ใช้งาน</li>\n</ul>\n<p>โดยสรุปแล้ว ThinkStation และ ThinkPad เวิร์คสเตชั่นรุ่นใหม่จาก Lenovo ได้รับการออกแบบมาอย่างดีเพื่อรองรับการทำงานแบบไฮดบริดและงานพกพาแบบอิสระ มีให้เลือกหลากหลายรุ่นตามจุดประสงค์การใช้งาน จะเป็นรุ่นเริ่มต้นที่ทรงพลัง พร้อมการทำงานด้านกราฟิกด้วย GPU NVIDIA หรือจะเป็นรุ่นที่มีประสิทธิภาพสูงขึ้น ก็สามารถเลือกได้ตามความต้องการ</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/lenovo\">Lenovo</a></div><div><a href=\"/topics/thinkstation\">ThinkStation</a></div><div><a href=\"/topics/thinkpad\">ThinkPad</a></div><div><a href=\"/topics/nvidia\">NVIDIA</a></div><div><a href=\"/topics/advertising\">Advertising</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c1d1d69afd75960e4dd23d44334f430d1b09a99ad692971b7275657e6274bac6","category":"Thai"}