{"title":"Assessing the impact of dietary polystyrene nanoplastics on growth performance, immunological parameters, and antioxidant defense in zebrafish (Danio rerio)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13046?af=R","date":1704674913000,"content":"<h2>Abstract</h2>\n<p>This trial was performed in order to investigate the response of zebrafish (<i>Danio rerio</i>) to dietary exposure to polystyrene nanoplastics (PS-NPs) under laboratory conditions on fish growth and health. Healthy zebrafish (n=240) were divided into 12 tanks and fed with diets including 0 (T0), 100 (T1), 500 (T2), and 1000 (T3) mg kg<sup>−1</sup> synthesized polystyrenes nanoplastics (PS-NPs) for 30 days. At the end of trial, fish fed the PS-NPs supplementation showed weight gain percentages of 79.45%, 70.35%, and 61.88% for T1, T2, and T3 groups, respectively, compared with 87.39% in the control fish. The SOD, GPX and MDA activities and cortisol levels increased by 47%, 32% and 35% and 46%, respectively, especially at high-dose administration (<i>p</i> &lt; 0.05). The expression of GPX (T2-81% and T3-82%) and SOD (T2-101% and T3-187%) were remarkably upregulated in T2 and T3 groups. Moreover, the relative gene expression of HSP70, interleukin-1 (IL1), Interferon γ (IFN-γ) and tumor necrosis factor-α (TNF-α) increased by 178%, 202%, 154% and 307%, respectively, especially at high-dose administration (<i>p</i> &lt; 0.05). The results of the present study demonstrated that exposure to PS-NPs especially at high concentrations (500 and 1000 mg kg<sup>−1</sup> of diet) negatively influenced growth, health status-, antioxidant-, and immunity-related gene expression responses of zebrafish.</p>","author":"Ehsan Ahmadifar, \nPoulin Shohreh, \nNaser Kalhor, \nMohsen Shahriari Moghadam, \nSevdan Yilmaz, \nSedigheh Mohammadzadeh, \nMostafa Khajeh, \nSafoura Abarghouei","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"c1d8b2f12a0562677855f97935eeedb49fd5aa9bb259aa6d5db4f3e27f8880f1","category":"Environment"}