{"title":"In the Drops: American Classic tyres, Knog's posh bell, Peaty's valves and the gloomy void in my millennial soul","link":"https://www.cyclist.co.uk/in-depth/10277/american-classic-tyres","date":1637769289000,"content":"<span>\n      <span><a href=\"/authors/matthew-loveridge\">Matthew Loveridge</a></span>\n  </span><div>  \n  <div>      <div><span>26 Nov 2021</span></div>    </div></div><p>\nThis week's round-up up of new bike gear, plus Sally Rooney and babies being born</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/knog-oi-luxe-bell-2.jpg?itok=Y_G-9tNE\" />  </div>\n<div>\n      <p>Happy Friday folks, and what a day it is, as today we celebrate the traditional pagan festival of Black Friday, when we burn a 55in TV in a giant wicker wallet and give thanks to the #brands for their benevolence. By which I mean, head to our <a href=\"https://www.cyclist.co.uk/buying-guides/10251/best-cycling-deals\" target=\"_blank\">Black Fridays cycling deals</a> page and spend some money, please, because you're worth it. </p>\n<p>This week winter has finally set in here in the UK, and we've got your back with advice on the <a href=\"https://www.cyclist.co.uk/buying-guides/769/buyers-guide-best-winter-cycling-socks\" target=\"_blank\">best winter cycling socks</a> and a feature looking at <a href=\"https://www.cyclist.co.uk/in-depth/10268/spin-classes-for-cyclists\" target=\"_blank\">whether spin classes are beneficial for cyclists</a>.</p>\n<p>Just as CEO and founder Simon Mottram announced he's to step down, we published our <a href=\"https://www.cyclist.co.uk/in-depth/10194/rapha-headquarters-london\" target=\"_blank\">look behind the scenes Rapha</a>, surely one of the most influential cycling brands of the last decade. </p>\n<p>Evans Cycles' in-house brand <a href=\"https://www.cyclist.co.uk/pinnacle/10271/pinnacle-cycling-shoes\" target=\"_blank\">Pinnacle announced new £50 road shoes</a>, <a href=\"https://www.cyclist.co.uk/news/10276/danilith-nokere-koerse-prize-money\" target=\"_blank\">another bike race moved to equal prize money</a> for men and women, and the <a href=\"https://www.cyclist.co.uk/reviews/10005/vielo-v1-alto-review\" target=\"_blank\">Vielo V+1 Alto</a> gravel bike impressed us with with its combination of racy manners and versatility. </p>\n<p>The <a href=\"https://www.cyclist.co.uk/in-depth/10279/cyclist-magazine-podcast-episode-44-fiona-kolbinger-is-a-special-bike-rider\" target=\"_blank\">Cyclist podcast spoke to ultra-cycling mega-talent Fiona Kolbinger</a>, we looked into <a href=\"https://www.cyclist.co.uk/in-depth/10247/cycling-on-my-period-nutrition-training\" target=\"_blank\">how being on your period affects your cycling</a>, and we put together a handy explainer for anyone wondering <a href=\"https://www.cyclist.co.uk/in-depth/10269/cycling-hour-record\" target=\"_blank\">what the Hour record actually is</a>, and who holds the current titles. </p>\n<h2>American Classic tyres</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/american-classic-tyres-1.jpg\" />  </div>\n</div>\n<p>Remember American Classic? The US brand was known for its lightweight road wheelsets and it officially ceased operations around the start of 2018. </p>\n<p>Now it's back, with a range of road and gravel tyres to cover a variety of tastes, at seriously tempting prices.</p>\n<p>The Torchbearer and Timekeeper road models come in a choice of tubed ($30/approx £22.50) and tubeless ($35/approx £26) variants, while the Aggregate, Kimberlite, Krumbein, Udden and Wentworth are aimed at gravel, are all tubeless-ready, and cost $35.</p>\n<p>There's also an urban slash e-bike tube-type model called the Lamplighter which, again, is $30. </p>\n<p>I won't bore you with every detail of the range, but here are select highlights.</p>\n<p>\n</p><div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/american-classic-tyres-4.jpg\" />  </div>\n</div>\n<p></p>\n<p>The Torchbearer is a fairly stout-looking all-weather road tyre and the 700c×28mm tubeless model weighs 349g on my scales.</p>\n<p>\n</p><div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/american-classic-tyres-3.jpg\" />  </div>\n</div>\n<p></p>\n<p>The Timekeeper is a race tyre and this fetching tan-wall tube-type weighs 198g for a 700c×25mm, a respectably low number. </p>\n<p>\n</p><div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/american-classic-tyres-2.jpg\" />  </div>\n</div>\n<p></p>\n<p>The Aggregate is a mixed-terrain gravel and all-road tyre that looks like a potential rival for Schwalbe's popular G-One Allround or G-One Bite, with a moderately closely spaced pattern of small knobs on the tread. This 700c×40mm tyre weighs 546g.</p>\n<p>\n</p><div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/american-classic-tyres-5.jpg\" />  </div>\n</div>\n<p></p>\n<p>The Wentworth is aimed at looser dirt and gravel, and features a fairly tight pattern of low-profile knobs with raised tread blocks for cornering bite off-road. This 700c×40mm model weighs 517g on my scales.</p>\n<p>That's just the tip of the iceberg with these tyres – there are five different gravel tread options alone, and both 700c and 650b wheels are catered for. </p>\n<p>We can't pass judgement without trying them, but on the face of it American Classic's tyres look very promising. </p>\n<p>Before you get too excited, I'm afraid it’s bad news for those of us in Europe – currently the tyres are only available direct from the brand in North America, or via Amazon US. </p>\n<p>That said, shipping from the US looks pretty reasonable, and the tyres really are keenly priced.</p>\n<ul>\n<li><strong>From $30 (approx £22.50)</strong></li>\n<li><strong>Buy now from <a href=\"https://www.amazon.com/AMERICAN-CLASSIC-Wentworth-Tubeless-Bicycle/dp/B097C98NRS/?&amp;tag=cyclist-21\" target=\"_blank\">Amazon.com</a></strong></li>\n<li><strong>For full details, head to <a href=\"https://www.amclassic.com/\" target=\"_blank\">American Classic</a></strong></li>\n</ul>\n<p>\n</p><div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/10251/best-cycling-deals\">Best cycling deals 2021: Black Friday bike and kit discounts</a></div>      <div><a href=\"/in-depth/10269/cycling-hour-record\">What is the cycling Hour Record?</a></div>      <div><a href=\"/buying-guides/4343/best-road-bike\">Best road bikes: the best bikes on the market from under £1,000 to over £10,000</a></div>    </div></div><p></p>\n<h2>Knog Oi Luxe bell</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/knog-oi-luxe-bell-1.jpg\" />  </div>\n</div>\n<p><a href=\"https://www.cyclist.co.uk/buying-guides/4484/the-best-bicycle-bells\" target=\"_blank\">Bicycle bells</a> were once deeply unsexy things, but that arguably all changed when the <a href=\"https://www.condorcycles.com/products/spurcycle-bell\" target=\"_blank\">Spurcycle bell</a> launched and <a href=\"https://en.wikipedia.org/wiki/Veblen_good\" target=\"_blank\">Veblen good</a> dingers became a thing.</p>\n<p>Knog launched the road bike-specific (and far cheaper) Oi bell to much fanfare in 2016 but, with the best will in the world, it wasn't very good (the basic Oi has since been updated, we should note.)</p>\n<p>The Knog Oi Luxe is a much more premium offering, made from sturdy materials with delightful machining. </p>\n<p>Full disclosure: the Oi Luxe is not in any way new, it's been on the market for around two years, but it passed us by and I'm here to shine a little light on this humble path-clearer.</p>\n<p>The Oi Luxe is available in two sizes, of which this is the larger, to fit pretty well any handlebar. It's a wraparound design with a pleasing CNC-machined ringer and a brass dinger.</p>\n<p>The shim that rests against the bar is faux leather, and the lower part of the mount is grooved so cables can be routed through it if desired, rather than over it. </p>\n<p>It's probably not worth fretting about the weight of your bell, but this one weighs 43g on my scales. More importanty, it has a pleasantly musical tone.  </p>\n<ul>\n<li><strong>RRP £34.99</strong></li>\n<li><strong>Buy now from <a href=\"https://www.wiggle.co.uk/knog-oi-luxe-bike-bell\" target=\"_blank\">Wiggle</a> (£26.99)</strong></li>\n</ul>\n<h2>Peaty’s × Chris King Mk2 tubeless valves</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/peatys-tubeless-valves-1.jpg\" />  </div>\n</div>\n<p>If you're more about supping flat whites than hucking to flat, the name Steve 'Peaty' Peat might not hold much currency, but the Sheffield-born rider is one of the most recognisable figures in UK mountain biking, as well as co-founder of his eponymous brand. </p>\n<p>Peaty's now offers tubeless valves in properly long lengths that make them an appealing prospect for deep-section carbon rims – the ones I have here are 80mm.</p>\n<p>As you'd expect from a mountain bike brand, they're available in a variety of bright, anodised colours and, usefully, one valve cap serves as a Presta core remover while the other is a 3.4mm spoke wrench.</p>\n<p>The valves are made from aluminium and as a result they're pretty light at 15g on my scales. Really though, you shouldn't worry about the weight of your valves. Use that mental processing power for literally anything else, please. </p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/peatys-tubeless-valves-2.jpg\" />  </div>\n</div>\n<p>One unique selling point is these valves are designed to work with tyre inserts, with grooves in the base to ensure air and sealant flow isn't blocked.</p>\n<p>Inserts are virtually unheard of in road circles, but they're widely used in mountain biking as a means to protect rims and reduce the number of punctures. Gravel-specific inserts have begun to appear on the market and you can expect to hear more about them in coming years.</p>\n<ul>\n<li><strong>RRP from £24.99</strong></li>\n<li><a href=\"https://www.sigmasports.com/item/Peatys/x-Chris-King-MK2-Tubeless-Valves-Pair/SR7W\" target=\"_blank\"><strong>Buy now from Sigma Sports (£15)</strong></a></li>\n</ul>\n<h2>What we're into this week: Millennial angst and comfort watching</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/sally-rooney-beautiful-world-where-are-you-book-1.jpg\" />  </div>\n</div>\n<p>Remember back in 2020 when everyone was hot for <em>Normal People</em> and sales of men's chain necklaces soared? The BBC drama was based on Irish writer Sally Rooney's second novel, wherein two gloomy millennials repeatedly drift in and out of each other's lives in a deeply frustrating but strangely compelling fashion. </p>\n<p>The novel is curiously flat and detached in its tone and, having subsequently read Rooney's debut <em>Conversations With Friends, </em>this is very much her brand.</p>\n<p>This week I finished her third book <em>Beautiful World, Where Are You </em>and I have feelings.</p>\n<p>It's perfectly natural that the books we grew up reading weren't really ours, because they reflected the voices of generations past. Sally Rooney has been described by tedious pundits as <em>the</em><em> </em>millennial writer and, irritatingly, I think they might be right. </p>\n<p>Her latest novel captures a sense of millennial unease with the state of the world and our place in it better than anything else I've read.</p>\n<p>I'm 32 and therefore just old enough to remember how the vague optimism of the nineties seemed to evaporate post-9/11 as crisis after crisis unfolded and norms once taken for granted crumbled. </p>\n<p>I am not a total pessimist but, if these aren't the end times, it sure feels like them sometimes. Anyway, the book was good. I recommend it as long as you don't object to a complete absence of speech marks. </p>\n<p>For a radical, synchromesh-destroying gear change, I'm also going to recommend the BBC's long-running drama <em>Call the Midwife,</em> which details the experiences of midwives in London's East End, beginning in the 1950s. <em> </em></p>\n<p>I ignored this show for years on grounds that it probably wasn't my kind of thing, but I couldn't have been more wrong. </p>\n<p>While you could argue there are only so many ways to watch babies being born, it's so much more than just that.</p>\n<p>The characters are great and the storylines heartwarming but, while it sometimes tends towards the saccharine, it never shies away from the harsh realities of its subjects' lives and it tackles serious issues including back-street abortion and thalidomide. Recommended viewing. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"MLoveridge","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"c1e0737fb9ea2d94547ebbada61752b0db274b1117a1af6b2edb6f2fd4890e20","category":"Cycling"}