{"title":"Contact-tracing software could accurately gauge COVID-19 risk","link":"https://arstechnica.com/?p=1992331","date":1703100584000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1227446665-800x533.jpg\" alt=\"A woman wearing a face mask and checking her phone.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1227446665-scaled.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/mask-wearing-woman-touching-her-face-while-walking-royalty-free-image/1227446665?phrase=covid+contact+tracing+app\">Maridav</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It’s summer 2021. You rent a house in the countryside with a bunch of friends for someone’s birthday. The weather’s gorgeous that weekend, so mostly you’re all outside—pool, firepit, hammock, etc.—but you do all sleep in the same house. And then on Tuesday, you get an alert on your phone that you’ve been exposed to SARS-CoV-2, the virus that causes COVID-19. How likely are you to now have it?</p>\n<p>To answer that question, a group of statisticians, data scientists, computer scientists, and epidemiologists in the UK analyzed 7 million people who were notified that they were exposed to COVID-19 by the NHS COVID-19 app in England and Wales between April 2021 and February 2022. They wanted to know if—and how—these app notifications correlated to actual disease transmission. Analyses like this can help ensure that an app designed for the next pathogen could retain efficacy while minimizing social and economic burdens. And it can tell us more about the dynamics of SARS-CoV-2 transmission.</p>\n<h2>Over 20 million quarantine requests</h2>\n<p>The NHS COVID-19 app was active on 13 to 18 million smartphones per day over 2021. It used Bluetooth signals to estimate the proximity between those smartphones while maintaining privacy and then alerted people who spent 15 minutes or more at a distance of 2 meters or less from a confirmed case. This led to over 20 million such alerts, each of which came with a request to quarantine—quite a burden.</p></div><p><a href=\"https://arstechnica.com/?p=1992331#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992331&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c1e4b9fd5a9f7d181d240a3e30d95143da8ff2bae6e781c0b67b1ace876060b8","category":"Tech"}