{"title":"GPS velocities and uniform slip rates across Siulak and Dikit segments: implication to segmentation and seismic moment deficits along Sumatran fault system","link":"http://link.springer.com/10.1007/s11600-024-01326-2","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>The Siulak and Dikit segments of the Sumatran fault system, where historical major earthquakes of Ms 7.6 in 1909, Mw 7.2 in 1995 and Mw 6.6 in 2009 occurred, are distinctive and tectonically active, yet tectonic investigation such trench-parallel motions of both segments still is challenging to be better understand and important to constrain seismic hazard. We aim to better estimate slip rates as well as locking depths using GPS velocities and determine the cumulative energy stored at the segments. We processed raw GPS data from 31 GPS stations originating from the Indonesian continuous operating reference system (Ina-CORS), the Sumatran GPS array (SuGAr), and IGS networks for 2016–2021 including UNIB stations including two UNIB stations using GAMIT/GLOBK software. The daily GPS solutions were constrained into the ITRF-2014 frame, and the GPS velocities were translated into the Sunda Block. We modeled trench-parallel GPS velocities using 1-D screw dislocation elastic model following a Bayesian approach with Metropolis MCMC sampler to estimate optimum fault parameters. Our result inferred that estimated slip rates are 20.71 [− 2.20, + 2.95] mm/yr with a locking depth of 21.62 [− 11.98, + 14.16] km in the Siulak segment and 20.21 [− 2.42, + 2.95] mm/yr with a locking depth of 21.72 [− 13.10, + 14.77] km in the Dikit segment. Our analysis demonstrates both segments having a uniform slip rate, suggesting that the segments may share similar tectonic settings. In addition, the two segments are capable of generating a magnitude six to seven or greater earthquake if a single earthquake occurs in 50 to 200 years periods.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"c1eefe9454339d21c277eddec386f0baf0ceffe5e583a6527b9c25da7351f69d","category":"Environment"}