{"title":"Tuberculosis care provided by private practitioners in an urban setting in Indonesia: Findings from a standardized patient study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003311","date":1717509600000,"content":"<p>by Bony Wiem Lestari, Panji F. Hadisoemarto, Nur Afifah, Susan McAllister, Deny Fattah, Argita D. Salindri, Reinout van Crevel, Megan Murray, Philip C. Hill, Bachti Alisjahbana</p>\r\n\r\nIn Indonesia, government-owned Community Health Centers (CHCs) spearhead tuberculosis (TB) care at the primary level, but a substantial proportion of individuals with pulmonary TB also seek care from Private Practitioners (PPs). However, little is known about PPs’ practice in managing patients with TB-associated symptoms. To avoid bias associated with self-administered surveys, we used standardized patients (SPs) to evaluate PPs’ adherence to the national TB guidelines. Four clinical scenarios of individuals presenting complaints suggestive of TB, accompanied by different sputum smear results or TB treatment histories were developed. We assigned 12 trained SPs to PPs practicing in 30 CHC catchment areas in Bandung city, Indonesia. For comparison, two scenarios were also presented to the CHCs. A total of 341 successful SP visits were made to 225 private general practitioners (GPs), 29 private specialists, and 30 CHCs. When laboratory results were not available, adherence to the recommended course of action, i.e., sputum examination, was low among private GPs (31%) and private specialists (20%), while it was requested in 87% of visits to the CHCs. PPs preferred chest X-ray (CXR) in all scenarios, with requests made in 66% of visits to private GPs and 84% of visits to private specialists (vs. 8% CHCs). Prescriptions of incorrect TB drug regimens were reported from 7% and 13% of visits to private GPs and specialists, respectively, versus none of the CHCs. Indonesian PPs have a clear preference for CXR over microbiological testing for triaging presumptive TB patients, and inappropriate prescription of TB drugs is not uncommon. These findings warrant actions to increase awareness among PPs about the importance of microbiological testing and of administering appropriate TB drug regimens. SP studies can be used to assess the impact of these interventions on providers’ adherence to guidelines.","author":"Bony Wiem Lestari","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c1f0d1a1281948e4983bba9b291b6d1f2d037b405d852459631c672f05841f69","category":"Environment"}