{"title":"Salesforce มุ่งเน้น AI, Data, CRM ผลักดันภาคธุรกิจใช้เทคโนโลยี ยอมรับการจัดการข้อมูลในองค์กรยังไม่ดีทำให้การใช้ AI ยังเป็นเรื่องยาก","link":"https://www.blognone.com/node/134884","date":1689685659000,"content":"<div><div><div><p>Salesforce ผู้ให้บริการแพลตฟอร์มด้าน CRM และได้พัฒนาแพลตฟอร์มด้าน AI อีกหลากหลายโซลูชั่นเพื่อให้กับองค์กรธุรกิจ เปิดเผยว่า ปีนี้ Salesforce มุ่งเน้นใน 3 ส่วนที่เป็นพื้นฐานสำคัญของเทคโนโลยีในองค์กร คือ AI, Data และ CRM โดยเชื่อว่าจะสร้างความเปลี่ยนแปลงให้เกิดขึ้นเป็นรูปธรรม แต่ยังมีความท้าทายคือ องค์กรไทยที่การจัดการข้อมูลยังไม่ดีเท่าที่ควร มีความซับซ้อน กระจัดกระจาย ขาดการเชื่อมโยง ทำให้การนำ AI เข้ามาใช้งานจริงยังเป็นเรื่องยาก</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/aScNqJw.jpg\" /></p>\n<p>รบส สุวรรณมาศ ผู้นำด้านโซลูชั่น เซลส์ฟอร์ซ ประเทศไทย บอกว่า AI สำหรับไทยจะมีการใช้งานแพร่หลายมากขึ้นในระดับบุคคล แต่ในระดับองค์กร การใช้งานที่เป็นกรณีศึกษา หรือมีผลเป็นรูปธรรม เป็นสิ่งที่ต้องผลักดัน เพื่อให้องค์กรมีความพร้อมโดยเฉพาะเรื่องข้อมูล ซึ่งเป็นหัวใจสำคัญของการใช้งาน AI</p>\n<p>ดังนั้น Salesforce ซึ่งเป็นผู้เชี่ยวชาญด้าน CRM จึงเน้นใน 3 ส่วน คือ AI, Data และ CRM ซึ่ง CRM คือพื้นฐานในการรวบรวมข้อมูลอยู่แล้ว จากนั้นจะจัดการให้เป็น Data ที่สามารถใช้งานได้จริง และนำไปสู่เทคโนโลยี AI การจะปลดล็อกเป้าหมายเหล่านี้ได้ ต้องมีระบบที่เรียกว่า Trusted AI คือถูกนำมาใช้อย่างมีจริยธรรม โดยหลักการ Trusted AI มี 5 ส่วน คือ Accuracy, Safety, Transparent, Empowering และ Sustainable</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/oA4Jf2w.jpg\" /></p>\n<p>สำหรับโซลูชั่นด้าน AI ของ Salesforce มีที่สามารถใช้งานได้แล้วและมีอีกหลายส่วนที่อยู่ระหว่างการทดสอบ เพื่อให้มั่นใจว่าจะช่วยประสิทธิภาพให้กับองค์กร เช่นฃล</p>\n<ul>\n<li>Einstein GPT Trust Layer พร้อมใช้งานตั้งแต่วันนี้เป็นต้นไป (มิถุนายน 2023)</li>\n<li>Service GPT พร้อมใช้งานตั้งแต่วันนี้เป็นต้นไป (มิถุนายน 2023)</li>\n<li>Sales GPT พร้อมใช้งานตั้งแต่วันนี้เป็นต้นไป (มิถุนายน 2023)</li>\n<li>Marketing GPT เริ่มทดสอบการใช้งานเดือนมิถุนายน 2023 และจะพร้อมให้บริการในเดือนกุมภาพันธ์ 2024</li>\n<li>Commerce GPT กำลังทดสอบการใช้งานในขณะนี้ และจะพร้อมให้บริการในเดือนกรกฎาคม 2023</li>\n<li>Apex GPT เริ่มทดสอบการใช้งานในเดือนมิถุนายน 2023</li>\n<li>Flow GPT จะเริ่มทดสอบการใช้งานในเดือนตุลาคม 2023</li>\n<li>Slack GPT กำลังอยู่ในเบต้า และจะพร้อมให้บริการช่วงปลายปีนี้</li>\n<li>Tableau GPT จะเริ่มทดสอบการใช้งานในเดือนพฤศจิกายน 2023</li>\n</ul>\n<p>สำหรับความท้าทายในปีนี้ของ Salesforce ในประเทศไทย คือ Salesforce เริ่มต้นลุยตลาดในไทยมากขึ้นด้วยการเปิดสำนักงานอย่างเป็นทางการในปี 2021 มีพนักงานพร้อมให้บริการหลายสิบคนในประเทศ และมีผู้เชี่ยวชาญจากต่างประเทศเข้ามาให้บริการกับลูกค้า เพื่อสร้างความใกล้ชิดกันมากขึ้น โดยประเทศไทยถือเป็นประเทศที่มีการเติบโตและมีการใช้งานมากที่สุดในภูมิภาคนี้ หากไม่นับสิงคโปร์</p>\n<p>แต่สิ่งที่ Salesforce ต้องการให้เกิดขึ้นคือ มีกรณีศึกษา (Use case) ที่เป็นรูปธรรม ใช้แล้วเกิดประโยชน์จริง พร้อมกับสร้างการรับรู้เกี่ยวกับเทคโนโลยี AI ว่า ไม่ได้มาแทนที่คน แต่มาเพื่อเพิ่มพลังในการทำงานให้มากขึ้น ซึ่งลักษณะขององค์กรในไทยมีความเป็น Traditional อยู่ไม่น้อย ซึ่งต้องการการเปลี่ยนแปลงพอสมควร เพื่อให้สามารถเติบโตต่อไปได้ เป็นสิ่งที่ Salesforce ต้องการเข้าไปช่วย</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/salesforce\">Salesforce</a></div></div></div>","author":"blognone","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c1f932923aa83f692e0c396d090089c1e472fae58a3171ec705deb82ade1ab0c","category":"Thai"}