{"title":"Navigating vaccination choices: The intersecting dynamics of institutional trust, belonging and message perception among Congolese migrants in London, UK (a reflexive thematic analysis)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002620","date":1720620000000,"content":"<p>by Alison F. Crawshaw, Tushna Vandrevala, Felicity Knights, Anna Deal, Laura Muzinga Lutumba, Sarah Nkembi, Lusau Mimi Kitoko, Caroline Hickey, Alice S. Forster, Sally Hargreaves</p>\r\n\r\nThe COVID-19 pandemic disproportionately impacted intersectionally marginalised migrants, revealing systemic disparities in health outcomes and vaccine uptake. Understanding the underlying social and structural factors influencing health behaviours is necessary to develop tailored interventions for migrants, but these factors have been seldom explored. This qualitative study aimed to explore contextual factors shaping COVID-19 vaccination decision-making among Congolese migrants in the UK.A community-based participatory research study was designed and led by a community-academic partnership in London, UK (2021–2022). Peer-led, semi-structured interviews were conducted in Lingala with 32 adult Congolese migrants and explored beliefs, perceptions and lived experiences of migration, healthcare, vaccination and the COVID-19 pandemic. Reflexive thematic analysis generated two themes and a model conceptualising the vaccination decision-making process. Participants and community partners were financially compensated; ethics was granted by the University of London ethics committee (REC: 2021.0128).Participants highlighted the incompatibility of lockdown restrictions with their communal culture, which intensified feelings of exclusion and alienation. Concerns about COVID-19 vaccination were attributed to safety and effectiveness, partly informed by experiences and legacies of racial discrimination and exploitation. Inequality in the pandemic response and COVID-19 outcomes heightened participants’ sense that their views and needs were being overlooked, and government sources and information were perceived as coercive. Our model depicts the interplay between institutional trust, belonging, and message perception, which shaped participants’ vaccination decisions and led to (non-)engagement with COVID-19 vaccination. This research enhances understanding of how social and contextual factors may influence migrants’ engagement with health interventions. It underscores the importance of partnering with migrant communities to understand their needs in context and co-design tailored interventions and inclusive messaging strategies that promote trust and belonging. Implementing systemic changes to address structural inequalities will be crucial to create an environment that supports engagement with health-protective behaviours and enhances health outcomes among migrant communities.","author":"Alison F. Crawshaw","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c202f9c3c50a122e40fbedbb9f7a3eed2c57353e1d708e50eb02293a8b5e4413","category":"Environment"}