{"title":"Microstructure and Shear Mechanical Properties of Fractured Rock Mass Reinforced by Aeolian-Sand (AS) Cement Mortar after Freeze-Thaw (F-T) Cycles","link":"https://www.preprints.org/manuscript/202404.0090/v1","date":1711975236000,"content":"The rock joint fissure slope in cold regions is prone to deformation and failure problems such as relaxation, tension and collapse under freeze-thaw (F-T) cycles. Based on the ideology of clean production and promoting the structural integrity of geotechnical projects in cold areas, this study designed and prepared aeolian-sand (AS) to replace part of river sand as a filling mortar material by taking advantage of the low cost and easy availability of AS. Investigations were carried out to determine the impact of varying proportions of AS in mortar on the microstructure and shear properties of the mortar-rock interface under F-T cycles. Therefore, F-T cycle testing, nuclear magnetic resonance (NMR) testing and shear testing were carried out on grout with different proportions of AS. The results show that the right proportion of AS replacement could enhance the shear deformation resistance and F-T resistance of the mortar-rock interface, and 30% proportion is the optimal proportion. By increasing of F-T cycles, the three types of specimens showed different degrees of particle spalling, shedding and cracking. The slurry-rock interface layer in the A (0%) group exhibited the most severe F-T deterioration, while the B (15%) group showed a lesser degree, and the C (30%) group performed the best. T2 spectrum curve and total spectrum area change law from the microscopic point of view to verify the 30% AS proportion mortar-rock interface F-T resistance is the strongest, followed by 15% AS proportion mortar, the weakest is ordinary mortar. The degradation of the mortar-rock bond is primarily due to the conversion of solid to liquid phases and the movement of internal water caused by fluctuating temperatures. The extent of F-T deterioration in the slurry-rock interface layer is greatly affected by the varying proportions of AS. The shear strength and shear stiffness of specific proportion of AS decreased with the increase of F-T cycles. For same F-T cycles, the shear strength and shear stiffness of group C (30%) were the highest, followed by group B (15%) and group A (0%). The grout material not only reinforces the F-T joint fissure slope, but also reduces the cost of grout reinforcement and promotes the clean production of geotechnical structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c2133ac6f09715c1f34bc9fb5504e1fd4486d69ebb97cc4271336f1cf73e1922","category":"Interdisciplinary"}