{"title":"Study of the Relationship Between the Area of the Rectus Femoris Measured by Ultrasound and Psoas Muscle Index (PMI) and Skeletal Muscle Index (SMI) Measured by Opportunistic CT in Oncological Surgical Patients","link":"https://www.preprints.org/manuscript/202410.1787/v1","date":1729732592000,"content":"Summary Introduction: The psoas muscle index (PMI) and the skeletal mass index (SMI), as determined by computed tomography (CT), are the reference methods for assessing muscle mass. An alternative method is to measure the area of the rectus femoris muscle using ultrasonography (US).Objective : The objective of this study is twofold: firstly, to assess whether ultrasound imaging of the rectus femoris has an adequate correlation with psoas muscle index (PMI) and skeletal mass index (SMI) measurements obtained from computed tomography (CT) scans of oncosurgical patients at the L3 level; and secondly, to establish a cut-off point for diagnosing low muscle mass using this ultrasound technique. Material and methods: A retrospective cross-sectional observational study was carried out on oncosurgical patients referred to the nutrition consultation of the General University Hospital of Castellón over a four-year period. Malnutrition was diagnosed according to the GLIM criteria, muscle mass was assessed by ultrasound using a Mindray device, and skeletal muscle index (SMI) and appendicular skeletal muscle mass (PMI) were measured by computed tomography at the third lumbar vertebra (L3). Patients lacking a CT scan or with a CT scan performed more than one month after the ultrasound examination were excluded. Results: The study cohort comprised 43 patients (31 males), with a mean age of 64.7 ± 6.72 years, a mean BMI of 23.7 ± 4.31 kg/m², and a mortality rate of 25.6%. Most of the evaluations were conducted post-surgically (65.1%), with a notable prevalence of radical cystectomy and hepatic surgery. A total of 53 ultrasound evaluations were conducted, with an average area of 2.96 cm² [2.47-4.2] and adipose tissue of 0.55 cm [0.1-0.99] *. Additionally, computed tomography (CT) scans were performed to assess skeletal muscle mass (SMM) using the SMI/height method, yielding an average area of 38.4 cm² [31.6- 54.7)The median values for the variables were as follows: 272 [207-390] HU,PMI area of 4.31 m² [3.71-5.94] * and 86 [69-103] * HU density in PMI. All data were expressed as median and interquartile range. The Pearson correlation coefficients between US and SMI/height, SMI/height and PMI/height, and US and PMI/height were 0.70, 0.750, and 0.548, respectively. All these coefficients were statistically significant (p &lt; 0.001). Following the established criteria for low muscle mass for SMI (1) and PMI (2), a ROC curve analysis was conducted on US, with a cutoff point for low muscle mass of 3.6 cm² , AUC 0.770 with 70% and specificity 100%.Respect PMI , the cut-off was 3.29 cm 2 and the area under the curve was 0.609, with a sensitivity of 42.55% and a specificity of 100%. Conclusions: The results of this study indicate that there is a significant correlation between SMI, PMI, and the area in cm² measured by US in the rectus femoris according to the protocol of García-Almeida et al. (3). The positive correlation between ultrasound and computed tomography (CT) imaging in our sample, which yielded comparable results to those reported by (4), suggests that ultrasonography may serve as a viable alternative to CT for the detection of low muscle mass. This study is the first to establish a cutoff point for ultrasonography in comparison to SMI and PMI. Further studies are required, utilising a semi-automatic method to circumvent measurement bias and encompassing a larger patient cohort, in order to detect cutoff points pre- and post-surgery for cystectomy and hepatic surgery, as well as cutoff points by sex.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c216348fcefc0595767d38c6154c05e3ae3f44cb1b1a8a2b3ee96d4f088b4323","category":"Interdisciplinary"}