{"title":"The effect of calcaneus and metatarsal head offloading insoles on healthy subjects’ gait kinematics, kinetics, asymmetry, and the implications for plantar pressure management: A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303826","date":1715954400000,"content":"<p>by Jiawei Shuang, Athia Haron, Garry Massey, Maedeh Mansoubi, Helen Dawes, Frank L. Bowling, Neil D. Reeves, Andrew Weightman, Glen Cooper</p>\r\nBackground <p>The global number of people with diabetes is estimated to reach 643 million by 2030 of whom 19–34% will present with diabetic foot ulceration. Insoles which offload high-risk ulcerative regions on the foot, by removing insole material, are the main contemporary conservative treatment to maintain mobility and reduce the likelihood of ulceration. However, their effect on the rest of the foot and relationship with key gait propulsive and balance kinematics and kinetics has not been well researched.</p> Purpose <p>The aim of this study is to investigate the effect of offloading insoles on gait kinematics, kinetics, and plantar pressure throughout the gait cycle.</p> Methods <p>10 healthy subjects were recruited for this experiment to walk in 6 different insole conditions. Subjects walked at three speeds on a treadmill for 10 minutes while both plantar pressure and gait kinematics, kinetics were measured using an in-shoe pressure measurement insole and motion capture system/force plates. Average peak plantar pressure, pressure time integrals, gait kinematics and centre of force were analysed.</p> Results <p>The average peak plantar pressure and pressure time integrals changed by -30% (-68% to 3%) and -36% (-75% to -1%) at the region of interest when applying offloading insoles, whereas the heel strike and toe-off velocity changed by 15% (-6% to 32%) and 12% (-2% to 19%) whilst walking at three speeds.</p> Conclusion <p>The study found that offloading insoles reduced plantar pressure in the region of interest with loading transferred to surrounding regions increasing the risk of higher pressure time integrals in these locations. Heel strike and toe-off velocities were increased under certain configurations of offloading insoles which may explain the higher plantar pressures and supporting the potential of integrating kinematic gait variables within a more optimal therapeutic approach. However, there was inter-individual variability in responses for all variables measured supporting individualised prescription.</p>","author":"Jiawei Shuang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c21d94966739d6cb035f7ca8f3a4f87143da867199fe6431f89cde491813090d","category":"Interdisciplinary"}