{"title":"How Long Can the Spiral Arms of Disc Galaxies Be Optically Observed?","link":"https://www.preprints.org/manuscript/202311.0134/v2","date":1719984856000,"content":"With the galaxy J101652.52 as a model galaxy, this paper studied on the temporal duration of optically observed spiral patterns in disc galaxies is based on the finite reservoir of hydrogen available without replenishment following the initial formation of these well-isolated galaxies. The galaxy J101652.52 exhibits a grand design spiral pattern of two wide open spiral arms with perfect central symmetry, has only rear side trail effect, which clearly indicates that there is no corotation circle, therefore, the Density wave theory proposed for the spiral arm formation may not be applicable in this galaxy.  The results reveal a gradual decline in observable spiral arms regardless of any spiral arm formation mechanism. This reduction occurs after half-loop rotation (as defined in the paper) as hydrogen reserves deplete, hindering new star formation. Ultimately, spiral patterns may possibly become optically invisible at normal conditions after a full-loop rotation (as defined in the paper) with hydrogen depletion, even if the formation mechanism remains active. The spiral galaxies with spiral arms decoupled from galactic bars or having soft spiral structures shall have similar results as long as that the spiral pattern rotation speed is significant different from the galactic matter rotation speed. Most of observed spiral galaxies have soft spiral structures, their spiral patterns dynamically change constantly. The results of this study support the idea of short-lived spiral patterns compared to the lifespan of the spiral galaxies. The spiral arm formation may occur once like the onetime firework show in a galaxy’s life based on the limited availability of hydrogens. A concise, universally applicable mechanism for spiral arm formation across various galaxies should exist which provides a single mathematical formula to describe the broad range of morphologies of the spiral arms with few adjustable parameters. Some exceptions may be explained within this framework. Furthermore, the observed data on spiral pattern and galactic bar rotation speeds in the Milky Way require rigorous verification, particularly concerning the winding problem.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c22c01ee6c66c930cb1cd5975e65466264fb9d1bed18a866351d0584b47e9822","category":"Interdisciplinary"}