{"title":"Upcoming game turns Quest VR headsets into real-life laser tag machines","link":"https://arstechnica.com/?p=1789644","date":1629911727000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/spt-dx-listing-800x433.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/spt-dx-listing.png\">Enlarge</a> <span>/</span> Coming September 9. We've only played a few minutes of this, but rest assured, Ars Technica will absolutely have a review of this real-world VR laser tag option upon the game's launch on Oculus Quest VR headsets. (credit: I-Illusions)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>If you own <a href=\"https://arstechnica.com/gaming/2019/04/oculus-quest-review-2019s-best-new-gaming-system-is-wireless-affordable-vr/\">either</a> of the <a href=\"https://arstechnica.com/gaming/2020/09/review-we-do-not-recommend-the-299-oculus-quest-2-as-your-next-vr-system/\">Oculus Quest VR headset</a> models, you're about to get one heck of a must-buy gaming option... especially if you have access to a massive play space and a friend with a Quest system.</p>\n<p><a href=\"https://www.spacepiratetrainer.com/\"><em>Space Pirate Trainer</em></a>, one of the first arcade-shooter games to launch on <a href=\"https://arstechnica.com/gaming/2016/04/htc-vive-review-you-can-now-buy-your-own-holodeck-simulator-v-1-0/\">the HTC Vive VR system</a> in 2016, has continued receiving support on newer VR systems in the years since. The game's next update, launching on September 9, is its biggest yet—and it's entirely free for existing game owners. Dubbed <em>Space Pirate Trainer Arena</em>, the long-teased mode is currently an Oculus Quest exclusive, and it requires a massive play space and up to two untethered VR systems to enable real-world laser tag.</p>\n<p>In the real world, you and a friend will stand on opposite sides of a large play space, like an indoor tennis or basketball court, and map out a Quest \"chaperone\" space for your system, no smaller than 10 m x 10 m (33 ft x 33 ft). Once the game starts, onlookers will see the two of you flailing around with headsets, looking like danged fools. In the VR space, however, your and your friend's play will sync up, and you'll each see a far more complicated virtual battlefield full of walls, hallways, and other architecture, as if you're inside an elaborate laser tag arena—with the object of finding and blasting your opponent before they do the same to you.</p></div><p><a href=\"https://arstechnica.com/?p=1789644#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789644&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c232d1d94fa088b5cad959a89987e95fae3b26ed0ac8947f064aee7dca65b65c","category":"Tech"}