{"title":"Using single‐cell RNA sequencing and bulk RNA sequencing data to reveal a correlation between smoking and neutrophil activation in esophageal carcinoma patients","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24312?af=R","date":1714743537000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Cigarette smoking is considered as a major risk factor for esophageal carcinoma (ESCA) patients. Neutrophil activation plays a key role in cancer development and progression. However, the relationship between cigarette smoking and neutrophils in ESCA patients remained unclear.</p>\n<h2>Methods</h2>\n<p>Single-cell RNA sequencing (scRNA-seq) and bulk RNA sequencing data were obtained from public databases. Uniform manifold approximation and projection (UMAP) was used to perform downscaling and clustering based on scRNA-seq data. The module genes associated with smoking in ESCA patients were filtered by weighted gene co-expression network analysis (WGCNA). Using the “AUCell” package, the enrichment of different cell subpopulations and gene collections were assessed. “CellChat” and “CellphoneDB” were used to infer the probability and significance of ligand–receptor interactions between different cell subpopulations.</p>\n<h2>Results</h2>\n<p>WGCNA was performed to screened module genes associated with smoking in ESCA patients from MEdarkquosie, MEturquoise, and MEgreenyellow. Next, eight cell clusters were identified, and using the AUCell score, we determined that neutrophil clusters were more active in the gene modules associated with smoking in ESCA patients. Two neutrophil subtypes, <i>Neutrophils 1</i> and <i>Neutrophils 2</i>, exhibited greater enrichment in inflammatory response regulation, intercellular adhesion, and regulation of T cell activation. Furthermore, we found that neutrophils may pass through <i>AMPT</i>-(<i>ITGA5</i> + <i>ITGB1</i>) and <i>ICAM1</i>-<i>AREG</i> in order to promote the development of ESCA, and that the expression levels of the receptor genes insulin-degrading enzyme and <i>ITGB1</i> were significantly and positively correlated with cigarette smoking per day.</p>\n<h2>Conclusion</h2>\n<p>Combining smoking-related gene modules and scRNA-seq, the current findings revealed the heterogeneity of neutrophils in ESCA and a tumor-promoting role of neutrophils in the tumor microenvironment of smoking ESCA patients.</p>","author":"Yunhuan Ba, \nXinyu Gu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"c23318d68e1b8976937a541d045ef79e3d38504141de646dd10f8f0081e10cc3","category":"Environment"}