{"title":"Shimano Dura-Ace R9200 groupset review","link":"https://www.cyclist.co.uk/reviews/10286/shimano-dura-ace-r9200-groupset-review","date":1638282282000,"content":"<span>\n      <span><a href=\"/authors/james-spender\">James Spender</a></span>\n  </span><div>  \n  <div>      <div><span>Tuesday, November 30, 2021 - 15:06</span></div>    </div></div><p>\nTime to smash the champers on the best groupset Shimano has ever made</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/shimano_dura-ace_9200_review_01.jpg?itok=q_wGiB91\" />  </div>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.5</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£3,513</div>    </div></div><div>\n      <p> <a href=\"https://www.cyclist.co.uk/reviews/9947/shimano-dura-ace-r9200-and-ultegra-r8100-shimano-finally-goes-12-speed\" target=\"_blank\">It's finally here</a> – all hail Shimano Dura-Ace R9200. But what's new besides its semi-wireless nature? From the top (take a deep breath)…</p>\n<p>Lever hoods point inwards slightly, offer 4.6mm longer reach, are slightly taller and shift buttons are longer and wider spaced. Shifting is a claimed 58% faster at the rear, 45% faster at the front; the front mech has a 33% smaller frontal area; the groupset is now 12-speed; brake pads are 10% further from the rotor to reduce noise, and lever control offers 13% more modulation; the dual-sided power meter accuracy has improved from +/-2% to +/-1.5%; the disc rotors and chain are now shared with Shimano's top-tier mountain bike group, XTR; brake bleeding is possible without removing the caliper from the frame thanks to a new bleed port; and there is a raft of new gear ratios and crank lengths.</p>\n<p>Plus rim brake groups will exist but wired only, not semi-wireless, and mechanical shifting is no longer an option, period (the same is true for the new Ultegra too).</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/shimano_dura-ace_9200_review_02.jpg\" />  </div>\n</div>\n<h2>Shimano Dura-Ace R9200: the changes that matter</h2>\n<p>The changes I could instantly detect lie in the ergonomics and brake feel. The slightly curving-in hood position offers a more natural hand position, and although I prefer the smaller hoods of the outgoing 9100 for looks, the general feel of the new R9200 levers is great.</p>\n<p><strong>• Read our <a href=\"/shimano/1391/shimano-dura-ace-9100-groupset-review\" target=\"_blank\">Shimano Dura-Ace R9100 review</a></strong></p>\n<p> </p>\n<p>It might seem strange to cite this first, but it's the thing I noticed first and I think the thing any prospective Dura-Ace R9200 customer will notice first. Lever ergonomics is paramount – just ask Lizzie Deignan and her bloodied Paris-Roubaix bars.</p>\n<p>So well done Shimano, and further praise for the tweaked button positions and spacing. Shifting is now that much easier in the drops, the buttons easier to reach, and you could almost reliably find the right gear wearing oven gloves.</p>\n<p>What is much less noticeable – to me at any rate – is the addition of the 12th sprocket. Other riders will disagree and they'd no doubt be right, but my cadence is not nuanced enough to feel the difference. I never find myself searching out smaller jumps with existing 11-speed cassettes. That said, I'd make the same judgement of SRAM (12-speed) and Campagnolo (12, or its 1× Ekar, 13-speed).</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/6069/how-to-buy-a-gravel-bike\">How to buy a gravel bike</a></div>      <div><a href=\"/tutorials/743/how-to-keep-cycling-through-winter\">Winter cycling tips: Keep riding through the cold months</a></div>      <div><a href=\"/buying-guides/561/how-to-prepare-your-bike-for-winter-cycling\">How to prepare your bike for winter cycling</a></div>      <div><a href=\"/tutorials/4340/best-turbo-trainer-workouts-to-improve-your-cycling\">Best turbo trainer workouts and sessions to improve your cycling</a></div>    </div></div><p>\nBeyond that, the other major improvement on offer here is the braking – the Dura-Ace R9200 discs now finally feel on a par with what I've long held to be the best road discs in the business: Campagnolo.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/shimano_dura-ace_9200_review_03.jpg\" />  </div>\n</div>\n<p>To achieve this, Shimano has adopted its Servo Wave tech from its mountain bike groups. What that means is a clever set of brake lever pivots makes initial piston travel quick before slowing it down as the pads contact the rotor.</p>\n<p>This reduces the length (in time) of the free stroke while increasing modulation – that is, the speed and intensity to which braking power is applied. The result is the brake feel is much less binary and is now smoother and more controllable. On the bike it's a marked improvement.</p>\n<p>However, I can't say the 10% increase in pad distance helped as much with brake noise as Shimano wants to suggest. As is so often with discs, what sounds perfectly set up in the workshop can end up pink-pinking away mid-ride, and wet weather braking still elicits performances from the elephant orchestra.</p>\n<p>Again, though, I'd level this at SRAM and Campagnolo too. What is it about disc brakes and noise?</p>\n<h2>Shimano Dura-Ace R9200: Need to know?</h2>\n<p>The rest of the changes here are much less apparent. That half a per cent accuracy increase in the power meter? Honestly I'd never have noticed, but it's nice to know, and I did find pairing the dual-sided meter to a Wahoo head unit to be incredibly painless.</p>\n<p>The increased shift speed? I'd say Dura-Ace R9100 felt immediate enough already, although an interesting touch is the system now goes to sleep after 15 minutes and it takes a button press to wake it up.</p>\n<ul>\n<li><a href=\"https://www.sigmasports.com/item/Shimano/Dura-Ace-FC-9200-P-Power-Meter-Chainset/VNPD\" target=\"_blank\"><strong>Buy the Shimano Dura-Ace 9200 groupset from Sigma Sports here</strong></a></li>\n</ul>\n<p>The charge port is is now located in the rear mech and has a much more satisfying interface than before, and Shimano assures me it has been rigorously tested to guarantee against corrosion and water ingress.</p>\n<p>Plus it means there's no longer a need for mismatched bar plugs as the junction box has now been subsumed into the rear mech. Which all brings us back to the wireless thing. As a user, will you notice?</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/shimano_dura-ace_9200_review_04.jpg\" />  </div>\n</div>\n<p>If you fit Dura-Ace R9200 to a bike, yes you will. The wiring is much simpler as only mechs and battery are hardwired – the levers pair wirelessly (although interestingly they have plugs to be hardwired too).</p>\n<p>And if you are a shift freak you might just notice the additional shift speed, since signals travel faster wirelessly than through Shimano's wires. But beyond that, I'd say it brings next to no functional difference when riding.</p>\n<p>In terms of weight, all this new tech has added 35g to the groupset, but at a claimed 2,439g it's still the lightest electronic disc groupset out there (SRAM's top tier is 2,518g, Campagnolo’s 2,505g).</p>\n<ul>\n<li><a href=\"https://www.sigmasports.com/item/Shimano/Dura-Ace-FC-9200-P-Power-Meter-Chainset/VNPD\" target=\"_blank\"><strong>Buy the Shimano Dura-Ace R9200 groupset from Sigma Sports here</strong></a></li>\n</ul>\n<p>Which all begs the question, is Dura-Ace R9200 worth it? If you already have a R9100-equipped bike, I'd say probably not – again the fault of just how good the R9100-series is. But if you're buying a new bike, Dura-Ace R9200 is the best groupset Shimano has made yet.</p>\n<p><strong>Photography:</strong> Patrik Lundin</p>\n<h2>Spec</h2>\n<table>\n<tbody>\n<tr>\n<td>Model</td>\n<td>Shimano Dura-Ace R9270 Di2</td>\n</tr>\n<tr>\n<td>Weight  </td>\n<td>2,439g (claimed)</td>\n</tr>\n<tr>\n<td>Cassette options</td>\n<td>11-28, 11-30, 11-34</td>\n</tr>\n<tr>\n<td>Chainring options</td>\n<td>50/34, 52/36, 54/40</td>\n</tr>\n<tr>\n<td>Crank length options</td>\n<td>160mm (non-power meter cranksets only), 165mm, 170mm, 172.5mm, 175mm, 177.5mm</td>\n</tr>\n<tr>\n<td>Contact</td>\n<td><a href=\"https://bike.shimano.com/en-EU/product/component/dura-ace-r9200.html\" target=\"_blank\">shimano.com</a></td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a> </p>\n  </div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"c24ebec84916eca984e018e93423cb5ace813bae93eca90b647a0dc3d7a37281","category":"Cycling"}