{"title":"Acute freshwater CO2 exposure does not impair seawater transfer in three different sizes of Atlantic salmon (Salmo salar) subjected to different photoperiod manipulations","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15957?af=R","date":1728388150000,"content":"<h2>Abstract</h2>\n<p>There is a growing interest in Atlantic salmon (<i>Salmo salar</i>) aquaculture to extend the time fish are reared in freshwater (FW) recirculating aquaculture systems (RAS), producing larger FW salmon that can then be induced to undergo smoltification before transfer into marine net pens for grow-out and harvest. Smolts can be produced by photoperiod (PT) manipulation in RASs, but little is known about how delaying smoltification to larger body sizes affects susceptibility to elevated CO<sub>2</sub> levels (hypercapnia), which can occur at high stocking densities in FW RAS or during transport from FW RAS rearing facilities to marine net pens. To address this, Atlantic salmon were reared from hatch to one of three different sizes (~230, ~580, or ~1300 g) in FW (3 ppt) under continuous light (24:0, light:dark). Once fish reached the desired sizes, a group of salmon were maintained on continuous light 24L:0D to serve as a control salmon. A second group of salmon were exposed to 8 weeks of 12L:12D and then to 4 weeks of 24L:0D to serve as PT treatment salmon, which is the PT manipulation commonly used in Atlantic salmon aquaculture to induce smoltification. At the end of PT manipulation, both control and PT treatment salmon were exposed to 0% or 1.5% CO<sub>2</sub> (30 mg/L) for 96 h in FW and then transferred to air-equilibrated seawater (SW, 35 ppt, normocapnia). Salmon were sampled at the end of the 96-h FW CO<sub>2</sub> exposure and at 24 h and 7 days in SW for measurements of blood ion/acid–base status, muscle water content (MWC), and gill and kidney Na<sup>+</sup>/K<sup>+</sup> ATPase (NKA) activity. Exposure to 96 h of CO<sub>2</sub> in FW resulted in acid–base disturbances in fish from all three size classes, with decreases in blood pH and increases in blood PCO<sub>2</sub> and plasma [HCO<sub>3</sub>\n<sup>−</sup>] but no mortality. Despite these large acid–base disturbances in FW, after transfer to normocapnic SW, there were no significant effects of CO<sub>2</sub> exposure on extracellular blood pH, intracellular red blood cell pH, or plasma osmoregulatory status for all three sizes of post-smolt salmon. In general, SW transfer was associated with significant increases in plasma ions and osmolality, as well as gill and kidney NKA activity after 24 h and 1 week in SW with no significant impacts between different sizes of salmon. Thus, exposure to 30 mg CO<sub>2</sub>/L that mimics levels experienced during transport from FW RAS to an SW transfer site may have minimal effects on Atlantic salmon smolts up to 1300 g.</p>","author":"Le Thi Hong Gam, \nDaniel W. Montgomery, \nDaniel S. Laronde, \nRachael Mackinnon, \nJeffrey G. Richards, \nColin J. Brauner","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"c25adf62af5d2873465d3ba4b54ced2f2d4dbb8ea1a0c212decfdcb4a5cef24a","category":"Environment"}