{"title":"Poor long-term outcomes despite improved hospital survival for patients with cryptococcal meningitis in rural, Northern Uganda","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303805","date":1716300000000,"content":"<p>by Mark Okwir, Abigail Link, Bosco Opio, Fred Okello, Ritah Nakato, Betty Nabongo, Jimmy Alal, Joshua Rhein, David Meya, Yu Liu, Paul R. Bohjanen</p>\r\nBackground <p>Cryptococcal meningitis (CM) remains a major cause of death among people living with HIV in rural sub-Saharan Africa. We previously reported that a CM diagnosis and treatment program (CM-DTP) improved hospital survival for CM patients in rural, northern Uganda. This study aimed to evaluate the impact on long-term survival.</p> Methods <p>We conducted a retrospective study at Lira Regional Referral Hospital in Uganda evaluating long-term survival (≥1 year) of CM patients diagnosed after CM-DTP initiation (February 2017-September 2021). We compared with a baseline historical group of CM patients before CM-DTP implementation (January 2015-February 2017). Using Cox proportional hazards models, we assessed time-to-death in these groups, adjusting for confounders.</p> Results <p>We identified 318 CM patients, 105 in the Historical Group, and 213 in the CM-DTP Group. The Historical Group had a higher 30-day mortality of 78.5% compared to 42.2% in the CM-DTP Group. The overall survival rate for the CM-DTP group at three years was 25.6%. Attendance at follow-up visits (HR:0.13, 95% CI: [0.03–0.53], <i>p</i> &lt;0.001), ART adherence (HR:0.27, 95% CI: [0.10–0.71], <i>p</i> = 0.008), and fluconazole adherence: (HR:0.03, 95% CI: [0.01–0.13], <i>p</i> &lt;0.001), weight &gt;50kg (HR:0.54, 95% CI: [0.35–0.84], <i>p</i> = 0.006), and performance of therapeutic lumbar punctures (HR:0.42, 95% CI: [0.24–0.71], <i>p</i> = 0.001), were associated with lower risk of death. Altered mentation was associated with increased death risk (HR: 1.63, 95% CI: 1.10–2.42, <i>p</i> = 0.016).</p> Conclusion <p>Long-term survival of CM patients improved after the initiation of the CM-DTP. Despite this improved survival, long-term outcomes remained sub-optimal, suggesting that further work is needed to enhance long-term survival.</p>","author":"Mark Okwir","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c262f20d0299d32731dd942921fb9fc372dacb3b018a33d34f0b9f9182952e28","category":"Interdisciplinary"}