{"title":"The kinase Rio1 and a ribosome collision-dependent decay pathway survey the integrity of 18S rRNA cleavage","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3001767","date":1714053600000,"content":"<p>by Melissa D. Parker, Elise S. Brunk, Adam J. Getzler, Katrin Karbstein</p>\r\n\r\nThe 18S rRNA sequence is highly conserved, particularly at its 3′-end, which is formed by the endonuclease Nob1. How Nob1 identifies its target sequence is not known, and in vitro experiments have shown Nob1 to be error-prone. Moreover, the sequence around the 3′-end is degenerate with similar sites nearby. Here, we used yeast genetics, biochemistry, and next-generation sequencing to investigate a role for the ATPase Rio1 in monitoring the accuracy of the 18S rRNA 3′-end. We demonstrate that Nob1 can miscleave its rRNA substrate and that miscleaved rRNA accumulates upon bypassing the Rio1-mediated quality control (QC) step, but not in healthy cells with intact QC mechanisms. Mechanistically, we show that Rio1 binding to miscleaved rRNA is weaker than its binding to accurately processed 18S rRNA. Accordingly, excess Rio1 results in accumulation of miscleaved rRNA. Ribosomes containing miscleaved rRNA can translate, albeit more slowly, thereby inviting collisions with trailing ribosomes. These collisions result in degradation of the defective ribosomes utilizing parts of the machinery for mRNA QC. Altogether, the data support a model in which Rio1 inspects the 3′-end of the nascent 18S rRNA to prevent miscleaved 18S rRNA-containing ribosomes from erroneously engaging in translation, where they induce ribosome collisions. The data also demonstrate how ribosome collisions purify cells of altered ribosomes with different functionalities, with important implications for the concept of ribosome heterogeneity.","author":"Melissa D. Parker","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"c26aeae101a0e32fab8dee0796644c3cb67a8f41ea7fb41f186f52003966d8e9","category":"Environment"}