{"title":"Sterol Biosynthesis Contributes to Brefeldin-A-Induced Endoplasmic Reticulum Stress Resistance in Chlamydomonas reinhardtii","link":"https://academic.oup.com/pcp/article/65/6/916/7326022?rss=1","date":1697846400000,"content":"<span><div>Abstract</div>The endoplasmic reticulum (ER) stress response is an evolutionarily conserved mechanism in most eukaryotes. In this response, sterols in the phospholipid bilayer play a crucial role in controlling membrane fluidity and homeostasis. Despite the significance of both the ER stress response and sterols in maintaining ER homeostasis, their relationship remains poorly explored. Our investigation focused on <span>Chlamydomonas</span> strain CC-4533 and revealed that free sterol biosynthesis increased in response to ER stress, except in mutants of the ER stress sensor Inositol-requiring enzyme 1 (IRE1). Transcript analysis of <span>Chlamydomonas</span> experiencing ER stress unveiled the regulatory role of the IRE1/basic leucine zipper 1 pathway in inducing the expression of <span>ERG5</span>, which encodes C-22 sterol desaturase. Through the isolation of three <span>erg5</span> mutant alleles, we observed a defect in the synthesis of <span>Chlamydomonas</span>’ sterol end products, ergosterol and 7-dehydroporiferasterol. Furthermore, these <span>erg5</span> mutants also exhibited increased sensitivity to ER stress induced by brefeldin A (BFA, an inhibitor of ER–Golgi trafficking), whereas tunicamycin (an inhibitor of <span>N</span>-glycosylation) and dithiothreitol (an inhibitor of disulfide-bond formation) had no such effect. Intriguingly, the sterol biosynthesis inhibitors fenpropimorph and fenhexamid, which impede steps upstream of the ERG5 enzyme in sterol biosynthesis, rescued BFA hypersensitivity in CC-4533 cells. Collectively, our findings support the conclusion that the accumulation of intermediates in the sterol biosynthetic pathway influences ER stress in a complex manner. This study highlights the significance and complexity of regulating sterol biosynthesis during the ER stress response in microalgae.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"c2720d46de985e260b490fbf5053c6a3701b3ce257e2ade4811a1244dc6bc1fd","category":"Environment"}