{"title":"FTC ขวางดีล NVIDIA ซื้อ Arm บอกว่าปิดกั้นการแข่งขัน มีโอกาสกีดกันคู่แข่งสูง","link":"https://www.blognone.com/node/126123","date":1638494814000,"content":"<div><div><div><p>คณะกรรมการการค้าของสหรัฐ (Federal Trade Commission หรือ FTC) ลงมติ 4-0 ขวาง<a href=\"https://www.blognone.com/node/118404\">ดีล NVIDIA ซื้อกิจการ Arm มูลค่า 4 หมื่นล้านดอลลาร์</a> ตามความคาดหมาย ด้วยเหตุผลว่าการซื้อกิจการจะทำให้เกิดการกีดกันคู่แข่ง ปิดกั้นการแข่งขันและนวัตกรรม</p>\n<p>FTC ให้เหตุผลว่าโมเดลธุรกิจของ Arm คือการขายไลเซนส์และเทคโนโลยีให้ผู้ผลิตชิปรายต่างๆ ซึ่งเป็นคู่แข่งของ NVIDIA ด้วย และบริษัทเหล่านี้ก็แชร์ความลับทางการค้ากลับไปให้ Arm เช่นกัน ดังนั้น Arm ต้องรักษาความเป็นกลาง หาก NVIDIA กลายเป็นเจ้าของ Arm ย่อมทำให้สภาวะนี้เสียไป และส่งผลกระทบต่ออุตสาหกรรมจำนวนมาก เช่น ระบบรถยนต์ไร้คนขับ, การ์ดเครือข่ายรุ่นใหม่ที่เป็น DPU SmartNIC และซีพียู Arm สำหรับเซิร์ฟเวอร์</p>\n<p>ขั้นถัดไป คณะกรรมการ FTC จะส่งเรื่องไปยังศาลชอง FTC เอง (FTC มีอำนาจตัดสินคดีเอง) โดยมีกำหนดไต่สวนในวันที่ 9 สิงหาคม 2022</p>\n<p>นอกจาก FTC ซึ่งเป็นหน่วยงานกำกับดูแลในสหรัฐอเมริกาแล้ว ดีล NVIDIA-Arm ยังมีแนวโน้มที่จะถูกสกัดกั้นในอีกหลายประเทศ เช่น <a href=\"https://www.blognone.com/node/124357\">CMA ของสหราชอาณาจักรก็แสดงความกังวลต่อดีลนี้ แม้กระบวนการสอบสวนยังไม่เสร็จสิ้นก็ตาม</a> นอกจากนี้ FTC ยังระบุว่าพูดคุยกับหน่วยงานแบบเดียวกันของ EU, ญี่ปุ่น และเกาหลีใต้ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ed53e0387a07f937e181344faabdddb1.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger\">FTC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nvidia\">NVIDIA</a></div><div><a href=\"/topics/ftc\">FTC</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/arm\">Arm</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c277cdf42595c7aa9d693270464a7abbbe32072fb031cbf8b0b71564b427d466","category":"Thai"}