{"title":"รีวิว Mi 11 Ultra กล้องดี สเปกแรง มีจอเล็กให้เซลฟี่ด้านหลัง แต่ตัวเครื่องหนักอึ้ง","link":"https://www.blognone.com/node/122545","date":1620313518000,"content":"<div><div><div><p>หลังจากผู้เขียน<a href=\"https://www.blognone.com/node/121686\">รีวิว Xiaomi Mi 11</a> ที่ไม่ค่อยมีอะไรใหม่ไปเมื่อเดือนมีนาคมที่ผ่านมา ล่าสุด Xiaomi ก็ได้ออก Mi 11 Ultra เรือธงรุ่นจัดเต็ม ที่ใส่ฟีเจอร์มาเหมือนพยายามลบคำสบประมาทที่ว่าไม่มีอะไรใหม่ เพราะนอกจากกล้องหลัก 50MP, กล้องซูม periscope 5x, กล้องอัลตร้าไวด์มุมมอง 128 องศา ที่ปัจจุบันครองอันดับ 1 ด้านกล้องถ่ายภาพมือถือบน <a href=\"https://www.dxomark.com/xiaomi-mi-11-ultra-camera-review-large-sensor-power/\">DxoMark</a> แล้ว ยังใส่หน้าจอเล็กด้านหลังเพิ่มเอาไว้ข้างกล้องอีกด้วย</p>\n<p>จอด้านหลังนี้เป็นจอขนาด 1.1 นิ้ว ความละเอียด 126x294 พิกเซล เป็นจอแบบเดียวกับ Mi Smart Band 5 ทำหน้าที่เป็นจอแสดงนาฬิกากับสถานะอื่นๆ ได้ เวลาที่วางเครื่องคว่ำหน้า และยังเป็นจอเสริมสำหรับใช้กล้องหลังถ่ายภาพเซลฟี่ได้</p>\n<p>ภายใน Mi Ultra 11 มาพร้อมชิปเรือธง Snapdragon 888 เช่นเดียวกันกับ Mi 11 และให้แบตเตอรี่มาใหญ่ถึง 5,000 mAh แบบจุใจ ส่วนในด้านแรมหน่วยความจำ เครื่องที่ผู้เขียนรีวิวจะเป็นรุ่นแรม 12GB หน่วยความจำภายในประเภท UFS 3.1 ความจุ 256GB และเป็นตัวเครื่องสีดำ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/02a039859265eed17960a65cce0a83ae.jpg\" /></p>\n<p>ปัจจุบัน Mi 11 Ultra วางจำหน่ายในไทยแล้ว เมื่อวันที่ <a href=\"https://www.blognone.com/node/122524\">5 พฤษภาคมที่ผ่านมา</a> ในราคา 33,990 บาท (Mi 11 ธรรมดา 27,999 บาท) แต่มีจำนวนจำกัดแค่ 100 เครื่องเท่านั้น และยังไม่แน่ว่าจะมีมาเพิ่มในอนาคตหรือไม่</p>\n<p><strong>แกะกล่อง</strong></p>\n<p>Mi 11 Ultra มาในกล่องสีดำเรียบหรู สวนทางเทรนด์เรือธงด้วยการแถมที่ชาร์จชาร์จเร็ว 67W แบบ GaN มาให้เช่นเคยพร้อมสาย USB-C to USB-C ที่สามารถชาร์จแบตเตอรี่ 5000 mAh ของ Mi 11 Ultra ได้ 89% ภายใน 30 นาที และชาร์จเต็มภายใน 37 นาทีเท่านั้น และยังมีเคสพลาสติก TPU แถมมาให้ เช่นเดียวกับมือถือ Xiaomi รุ่นอื่น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c8be18b151f1931ab29fc935879fea4d.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/993086140ae3f49a6cbef2c1005c402b.jpg\" /></p>\n<p><strong>ตัวเครื่อง และรูปลักษณ์ภายนอก</strong></p>\n<p>หน้าจอ OLED ขนาด 6.81 นิ้ว ความละเอียด WQHD+ (1440 x 3200 พิกเซล) อัตรารีเฟรชสูงสุด 120Hz มีระบบ adaptive refresh rate ปรับลดเหลือ 90Hz, 60Hz และ 30Hz ได้ตามคอนเทนต์ สีสันสดใส สว่างเตะตามาก เพราะมีความสว่างสูงสุดที่ 900nits และ 1700nits ในโหมด HDR ที่รองรับทั้ง Dolby Vision และ HDR10+ รวมถึงรองรับการแสกนลายนิ้วมือใต้หน้าจอแบบออปติคัล และด้านหน้าครอบด้วยกระจก Gorilla Glass Victus</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/70e8170f2fcc6f96f5ea51cf50d1f026.jpg\" /></p>\n<p>ขอบจอด้านบนและล่างบางมาก ขอบจอด้านข้างเป็นแบบโค้ง แต่โค้งไม่มากนัก ไม่เป็นอุปสรรคต่อการใช้งาน หรือทำให้เกิดการสัมผัสโดยไม่ตั้งใจ กล้องหน้าเป็นแบบเจาะรู อยู่มุมบนซ้ายของหน้าจอ ไม่ทำให้รู้สึกเกะกะ</p>\n<p>สิ่งที่ทำให้ติดขัดในการใช้งานพอสมควรน่าจะเป็นโมดูลกล้องด้านหลังที่ยื่นออกมาจากตัวเครื่องมากพอสมควร และมีขนาดใหญ่มาก รวมถึงมีน้ำหนัก 234 กรัม ซึ่งเมื่อเทียบกับ iPhone 12 Pro น้ำหนัก 190 กรัมที่ผู้เขียนรู้สึกว่าหนักแล้ว ก็ยังหนักมากกว่าถึง 44 กรัมเลยทีเดียว แถมน้ำหนักส่วนมากก็อยู่ที่ครึ่งบนของตัวเครื่อง (น่าจะมาจากโมดูลกล้องและจอด้านหลัง) ทำให้เวลาถือ รู้สึกเกะกะมือ และเหมือนศูนย์ถ่วงเอียงไปด้านบนพอสมควร</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e404b030b28dc7c7f6387f3586fa0b79.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/57138ede61ce8e1d5b609429fefa4a94.jpg\" /></p>\n<p>ด้านซ้ายของตัวเครื่องไม่มีปุ่มใดๆ ด้านขวามีปุ่มเพิ่ม-ลด เสียง และปุ่มพาวเวอร์ ด้านบนล่างเป็นลำโพงที่จูนเสียงโดย harman/kardon ให้เสียงที่ดังสะใจ ไม่แตกแม้เปิดสุด แต่เสียงเบสก็ไม่หนานัก ออกไปทางโทนใสๆ พุ่งๆ มากกว่า แต่ก็ดูวิดีโอที่มีเสียงคนพูดบน Youtube หรือซีรีส์ Netflix ได้สบาย พอร์ตชารร์จ USB-C และช่องใส่ซิมจะอยู่ด้านล่างของตัวเครื่อง น่าเสียดายที่ไม่รองรับ microSD card แต่ความจุเริ่มต้น 256GB ก็น่าจะพอแบบเหลือเฟือ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3d739d39fcc32010b5ec4eb8fe6aaa53.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/9fc93e1316fbb253b69cd3a6870f30cf.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/115b47652ffc609b31ee2fbdeae253f2.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/a12f40099edc14f4779357f123bf44d0.jpg\" /></p>\n<p><strong>ประสิทธิภาพและประสบการณ์การใช้งาน</strong></p>\n<p>Mi 11 Ultra มาพร้อม MiUI 12.0.1 รันครอบอยู่บน Android 11 ซึ่ง UI ของ Xiaomi ยุคหลังๆ แทบจะไม่มี bloatware เกะกะติดมาด้วยแล้ว และโฆษณาก็น้อยลงมากจนกลายเป็น UI ของฝั่ง Android ที่สะอาดสะอ้านใช้งานได้อีกเจ้า ภาพด้านล่างเป็นตัวอย่างแอปที่ติดตั้งมาให้ในเครื่องทั้งหมด และข้อมูลตัวเครื่องจากหน้า About กับแอป Geekbench 5</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e249f78fe565e9d09f973fc4698f1373.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/bd0bb82212a340387de1f169529f1f56.jpg\" /></p>\n<p>การทดสอบบน Geekbench 5 ชิป Snapdragon 888 ทำคะแนนได้ Single Core ได้ 1,125 คะแนน และ Multi Core ได้ 3,623 คะแนน สูงกว่า Mi 11 รุ่นธรรมดาที่ผู้เขียนรีวิวไปพอสมควร ซึ่งได้คะแนน 900 และ 3047 คะแนน พอสมควร อาจเป็นเพราะแรมที่เพิ่มมาเป็น 12GB และปัจจัยอื่นเช่น การระบายความร้อน ความเร็วหน่วยความจำ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a4b0230f7fba89703a26d40bcad0d98e.jpg\" /></p>\n<p><strong>กล้องถ่ายภาพ</strong></p>\n<p>กล้องหลังหลักที่มีขนาดใหญ่ เพราะใช้เซ็นเซอร์ภาพ ISOCELL GN2 ของ Samsung ที่มีขนาด 1/1.12 นิ้ว ความละเอียดอยู่ที่ 50MP รูรับแสง f/2.0 กล้องรองสองกล้องเป็นกล้องอัลตร้าไวด์ 48MP f/4.1 และกล้องซูม periscope 48MP f/2.2 ซูมได้ 5x ไฮบริดซูมสูงสุด 120x ส่วนกล้องหน้าเป็นแบบเจาะรู 20 MP, f/2.2 ไม่มีอะไรพิเศษ มีโหมด Beauty ติดมาเช่นเคย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/402f49b37ce9bd3dd5e8040bce5473d5.jpg\" /></p>\n<p><strong>ตัวอย่างภาพถ่าย</strong></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/32c068729a4fb90db90ae1e1fb35fd29.jpg\" /><em>ภาพจากกล้องหลัก</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cdd48a308f4726a4cab5abc1af20989f.jpg\" /><em>ภาพจากกล้องหลัง เมื่อเปิด Night Mode</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9830287f75effeb8e1fd5f231c9ce08b.jpg\" /><em>ภาพจากกล้องอัลตร้าไวด์</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4cf554b524d2232471265827df5c6be2.jpg\" /><em>ภาพจากเลนส์เทเล ซูม 5x</em></p>\n<p>สำหรับกล้องซูม 5x ภาพยังชัดเจน แต่เมื่อลองนำมาทดสอบซูมแบบไฮบริด 120x ภาพค่อนข้างแตกเป็นวุ้น และถ่ายภาพยากพอสมควร เพราะสั่นนิดเดียวภาพก็หลุดไปจากจุดที่อยากถ่ายแล้ว หลังจากนั้นผู้เขียนจึงลดการซูมลงมาเรื่อยๆ และพบว่าการซูมที่ 50x น่าจะเป็นระดับการซูมสูงสุดที่ภาพยังใช้งานได้จริง นอกจากนี้ในการทดสอบถ่ายภาพ ผู้เขียนพบว่าบริเวณโมดูลกล้องอุ่นขึ้นอย่างรู้สึกได้ การประมวลผลภาพน่าจะใช้ประสิทธิภาพเครื่องหนักพอสมควร</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bd7e7f25a190674a3c2cfacb7797cbac.jpg\" /><em>ภาพจากกล้องหลัก ก่อนทดสอบการซูมยอดเสาในกรอบสีแดง</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bcba9587bf99512b722d6e01de22e1cc.jpg\" /><em>ซูม 120x</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c2130e95e11755f21148c0a8107f0ccd.jpg\" /><em>ซูม 50x</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/56b7f945327efa665de4138f659da0ad.jpg\" /><em>ตัวอย่างภาพจากกล้องหน้า</em></p>\n<p><strong>การใช้งานหน้าจอเล็กด้านหลัง</strong></p>\n<p>สำหรับการใช้หน้าจอเล็กด้านหลังเพื่อถ่ายภาพเซลฟี่ Mi 11 Ultra จะไม่ได้ตั้งค่าเปิดการใช้งานฟีเจอร์นี้มาจากโรงงาน ผู้ใช้จะต้องเข้าไปเปิดเองในการตั้งค่าตอนถ่ายภาพ ซึ่งผู้เขียนพบว่าหากพยายามถ่ายเซลฟี่โดยยืดสุดแขน จอพรีวิวนี้จะเลิกเกินกว่าจะมองเห็นไปหน่อย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bbf91dd6542072f7e82e94eb8965189a.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/649a9ccca58c960f169717cc6edef81e.jpg\" /><img src=\"https://www.blognone.com/sites/default/files/externals/8cfbdedd68f33df4151addc87ed8a462.jpg\" /></p>\n<p>ส่วนการใช้งานเพื่อบอกสถานะ หรือแสดงภาพอื่นๆ แทนจอ Always On Display สามารถเข้าไปตั้งค่าได้ที่ Rear Display Theme โดยจะสามารถแสดงข้อความ นาฬิกา สถานะแบตเตอรี่ แสดงว่ามี notifications ค้างอยู่หรือไม่ หรือจะใช้รูปตัวเองก็ได้ วิธีเปิดดูคือแตะที่ส่วนจอด้านหลังแบบสองครั้งติดกันแบบดับเบิ้ลแทป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6815350e6d3bc1aa8f21ea06f2754682.jpg\" /></p>\n<p><strong>สรุป</strong></p>\n<p>Mi 11 Ultra ยังสมกับชื่อรุ่น Ultra ของ Xiaomi อยู่ ด้วยกล้องที่ใส่มาแบบจัดเต็ม และหน้าจอด้านหลัง ที่ล้ำกว่า Mi 11 ธรรมดา รวมถึงมือถือรุ่นอื่นๆ แต่พอมาจับใช้งานจริงแล้ว ประโยชน์ที่ได้มาเช่นการถ่ายภาพที่ดีขึ้น หรือจอพรีวิวด้านหลัง อาจไม่คุ้มกับโมดูลกล้องที่ใหญ่เทอะทะ และน้ำหนักที่มากขึ้น ซึ่งเป็นอุปสรรคต่อการใช้งานเป็นเวลานาน</p>\n<p>Mi 11 Ultra มีวางจำหน่ายแค่ 100 เครื่องเท่านั้น ซึ่งยังไม่แน่ชัดว่าเป็นการลองตลาด เพื่อเตรียมนำมาจำหน่ายเพิ่ม หรือต้องการให้เป็นแบบจำนวนจำกัดจริงๆ แต่ในราคา 33,990 บาท ผู้เขียนมองว่าข้อเสียของตัวเครื่อง อาจจะมีเยอะเกินไปสำหรับผู้ใช้งานทั่วไป แต่จะเหมาะมากกับผู้ที่ต้องการใช้งานเป็นมือถือเครื่องที่สอง สำหรับใช้แทนกล้องถ่ายภาพ หรือผู้ที่ต้องการฟีเจอร์ที่จัดเต็มที่สุดของ Xiaomi เท่านั้น</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/review\">Review</a></div><div><a href=\"/topics/xiaomi\">Xiaomi</a></div><div><a href=\"/topics/mi-11-ultra\">Mi 11 Ultra</a></div><div><a href=\"/topics/mobile\">Mobile</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c27f07429e6bcf0f9ce5415d267883c09fe41e5706a110c844742832f99a7904","category":"Thai"}