{"title":"An exploratory study of the impact of CT slice thickness and inter-rater variability on anatomical accuracy of malunited distal radius models and surgical guides for corrective osteotomy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311805","date":1728568800000,"content":"<p>by Emilia Gryska, Per Fredrikson, Katleen Libberecht, Charlotte Stor Swinkels, Peter Axelsson, Anders Björkman</p>\r\n\r\nHigh-resolution CT images are essential in clinical practice to accurately replicate patient anatomy for 3D virtual surgical planning and designing patient-specific surgical guides. These technologies are commonly used in corrective osteotomy of the distal radius. This study evaluated how the virtual radius models and the surgical guides’ surface that is in contact with the bone vary between experienced raters. Further, the discrepancies from the reference radius of surgical guides and radius models created from CT images with slice thicknesses larger than the reference standard of 0.625mm were assessed. Maximum overlap with radius model was measured for guides, and absolute average distance error was measured for radius models. The agreement between the lower-resolution guides surface and the raters’ guide surface was evaluated. The average inter-rater guide surface overlap was -0.11mm [95% CI: -0.13–0.09]. The surface of surgical guides designed on CT images with a 1mm slice thickness deviated from the reference radius within the inter-rater range (0.03mm). For slice thicknesses of 1.25mm and 1.5mm, the average guide surface overlap was 0.12mm and 0.15mm, respectively. The average inter-rater radius surface variability was 0.03mm [95% CI: 0.025–0.035]. The discrepancy from the reference of all radius models created from CT images with a slice thickness larger than the reference slice thickness was notably larger than the inter-rater variability but, excluding one case, did not exceed 0.2mm. The results suggest that 1mm CT images are suitable for surgical guide design. While 1.25mm slices are commonly used for virtual planning in hand and forearm surgery, slices larger than 1mm may approach the limit of clinical acceptability. Discrepancies in radius models were below 1mm, likely below clinical relevance.","author":"Emilia Gryska","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c27f3ca748a12a72142e130da416d69ae7596099f5b99202712c128b19a37ce5","category":"Interdisciplinary"}