{"title":"Archaeologists found the site of Harriet Tubman’s family home","link":"https://arstechnica.com/?p=1760318","date":1619531398000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/51120384405_7392fd3785_k-800x600.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/51120384405_7392fd3785_k.jpg\">Enlarge</a> <span>/</span> Julie Schablitsky searches for artifacts at the site.  (credit: <a href=\"https://www.flickr.com/photos/mdotnews/albums/72157718947113581\"> Tim Pratt, MDOT</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In the years before the American Civil War, Harriet Tubman led dozens of enslaved people to freedom through the network of safe houses known as the Underground Railroad. During the war, she scouted, spied, and led military raids against Confederate forces. Now, archaeologists have pinpointed the Maryland childhood home where she learned her fieldcraft.</p>\n<p>Tubman’s father Ben Ross inherited the 10-acre tract of land from his former enslaver in the late 1830s. “She would’ve spent time here as a child, but also she would’ve come back and been living here with her father in her teenage years, working alongside him,” said Schabitsky in a recent press conference announcing the find.</p>\n<p>“This was the opportunity she had to learn about how to navigate and survive in the wetlands and the woods,” said Schabitsky. “We believe this experience was able to benefit her when she began to move people to freedom.” Her experience with her father also taught her the region’s coastal shipping routes and probably provided her with useful contacts.</p></div><p><a href=\"https://arstechnica.com/?p=1760318#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760318&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c28106a0523e9c36543d4ca2e8bc1f0c5a4b28c514f3d69fe55ceb9977ae8ea6","category":"Tech"}