{"title":"Here is what’s in my bikepacking and overnight riding gear list","link":"https://www.cyclingtips.com/2023/04/bikepacking-overnight-riding-gear-list/","date":1680905320000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-side-profile-of-open-wide-gravel-bike-with-campagnolo-ekar-2.jpg?width=1200\" alt=\"Here is what's in my bikepacking and overnight riding gear list\" /></figure><p>Riding long distances on mixed terrain is hard on gear, but it can be especially challenging when trying to ride through the night. Here is all the gear I appreciated using while riding 280 miles of the <span>2023 <a href=\"https://bikesordeath.com/east-texas-showdown/\" target=\"_blank\">East Texas Showdown</a></span>, a ride where I was fortunate enough to not have any breakdowns, gear failures, or general mechanicals.</p>\n<p><i><span>(Howdy! I’m Alvin, and I participated in the East Texas Showdown, specifically the 280-mile Slowdown. I’ll cover the gear I brought that I particularly liked below, but </span></i><a href=\"https://www.cyclingtips.com/2023/03/ets-2023-setup/\" target=\"_blank\"><i><span>I broke down every single gear choice and my reason why</span></i></a><i><span> in my lead-up story. <a href=\"https://www.cyclingtips.com/2023/04/280-miles-of-east-texas-showdown/\" target=\"_blank\">See my post-ride story as well</a> if you’re curious.)</span></i></p>\n<p>No gear setup is perfect, and I certainly don’t prescribe what I did for everyone. However, if you’re hoping to ride long distances as I did through bikepacking, ultra-endurance cycling, or even a multi-day tour, I think this list could be helpful.</p>\n<h2><strong>The lighting was perfect</strong></h2>\n<p><span>I would say the thing I was most concerned about going into this ride wasn’t finding food or even riding through the night: it was having enough lighting through the night. I was unfamiliar with the terrain, and I didn’t want to miss the sand pit at the bottom of a descent because of poor lighting. Enter my lighting setup. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-magicshine-rm3000-front-light-and-handlebar-setup-1340x893.jpg?width=730\" alt=\"EastTexasShowdown2023_post\" width=\"1340\" height=\"893\" /><figcaption>The RN3000 offered plenty of light, It doubled as a battery pack to charge the Wahoo Elemnt Bolt computer as well.</figcaption></figure>\n<p><span>The lights I used were the Magicshine RN3000, MJ 902S, and SEEMEE 200 taillight. I’ll have a full review for each of these lights with more time using them, as this was the first time I used all three. Lots of lumens do not make for a good headlight, but these have so much light that it may not matter. Up to 3000 lumens each for my headlight and my helmet light, and 75 lumens flash out back meant that I could see the whole road in pitch black. </span></p>\n<p><span>Most folks will wonder, “hey Alvin, how did you power all those lights AND your computer?” I brought a power bank with me to power both my headlights and my Wahoo ELEMNT Bolt computer, but I ended up not even using the power bank. What I ended up doing was using the MJ 902S power bank as an extended power bank itself. I used a right-angle USB-C cable to charge the computer. One charge remarkably got me through the night with a backlight on and into the day. Good job on battery life, Wahoo!</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-handlebar-setup-with-wahoo-computer-and-magicshine-light-1340x893.jpg?width=730\" alt=\"EastTexasShowdown2023_post-handlebar-setup-with-wahoo-computer-and-magicshine-light\" width=\"1340\" height=\"893\" /><figcaption>My computer and front light. The Spurcycle bell was an essential choice as well. Not pictured is a Magicshine Seeme 200 taillight and an MJ902 light I mounted to my helmet.</figcaption></figure>\n<p><span>And as an aside for the Wahoo: I ended up splitting the 280-mile course into two smaller routes. I split up the course into different files because I wanted turn-by-turn directions; if you use too big a course file that has more than 100 turns, the computer will only give you breadcrumb mapping and won’t announce upcoming turns.</span></p>\n<h2><strong>Nutrition nailed</strong></h2>\n<p><span>It can be really challenging to figure out how much you’re going to eat on a ride. I’ve set a reminder on my computer to eat or drink something every 20 minutes, and after some time, hearing the beep elicits a response to reach for my drink or for a snack.</span></p>\n<p><span>Strava thinks I burned about 8800 calories, and Wahoo’s app thinks I burned closer to 14,000 calories. Considering the mud, wind, and my lack of a power meter, I think the number is closer to the Wahoo estimate. I am no expert, but everything I’ve learned from folks smarter than me told me I needed to aim for a minimum of 200 calories an hour, 70 grams of carbs, 500 mg of sodium, and one bottle of water per hour. I largely succeeded in that. No bonking and no energy-related problems, fortunately. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-revelate-top-tube-bag-with-energy-snacks-1340x893.jpg?width=730\" alt=\"EastTexasShowdown2023_post-revelate-top-tube-bag-with-energy-snacks\" width=\"1340\" height=\"893\" /><figcaption><span>A top tube bag is a sturdier place from which to grab snacks than a handlebar bag is, at least for me. This Revelate Mag Tank also has a magnetic clasp that makes opening and closing the bag while riding on gravel relatively easy.</span></figcaption></figure>\n<p><span>I used Tailwind Nutrition’s Endurance Mix as my drink mix. It wasn’t my first time using it, but I was pleasantly surprised. Some drink mixes give me gut issues, and others leave your hands extra sticky. Not the case here. It offers some carbs, calories, just enough sugar, and a bit of flavor that makes drinking water a bit more enjoyable after hours in the saddle. This was my first long ride using Tailwind’s Endurance Mix, but it won’t be the last. </span></p>\n<p><span>The rest of my nutrition came from three things: rice cakes, occasional energy chews, and gumbo. I really only went on one long ride to figure out how my body would respond to this Skratch Labs rice cake recipe, but they were really a good choice here. Rice cakes are easy to chew and swallow, especially as bars and gels harden with cold temperatures. The gumbo is self-explanatory.</span></p>\n<h2><strong>The trick to not getting cold is moving</strong></h2>\n<p><span>Riding through the night means accounting for a wide array of temperatures. I outlined each of the layers I intended to bring in an earlier story, and I ended up using every layer at some point, for better or worse. </span></p>\n<p><span>Layering is essential for riding in variable temperatures, and the lighter the layer, the easier it is to not overheat. My layers worked well while on the bike, and my lightweight, packable windbreaker kept me warm enough to ride through the night. </span></p>\n<p><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/EastTexasShowdown2023_nighttimespeed.jpg?width=730\" alt=\"EastTexasShowdown2023_nighttimespeed\" width=\"1200\" height=\"1600\" /></p>\n<p><span>Time off the bike usually meant I quickly got cold, a full-bodied reminder to keep on moving.</span></p>\n<p><span>Would I change any of my layers? No. I loved having my cargo bib shorts which add some pockets to the side of the bib shorts. Everything else worked well. For future events, I will likely bring an additional lightweight layer to use to better stay warm when I’m off the bike.</span></p>\n<h2><strong>How’d the bike do?</strong></h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-back-side-profile-of-open-wide-gravel-bike-with-campagnolo-ekar-1340x893.jpg?width=730\" alt=\"EastTexasShowdown2023_post-back-side-profile-of-open-wide-gravel-bike-with-campagnolo-ekar\" width=\"1340\" height=\"893\" /><figcaption><span>Riding through a water crossing seemed to clean up the drivetrain quite a bit.</span></figcaption></figure>\n<p><span>I rode my personal bike, an Open Wide. The terrain for East Texas Showdown may have been muddy and slick early on, but the dirt roads are, generally speaking, smooth and fast. I felt that my 40mm semi-slick Pirelli Cinturato Gravel H tires did everything I wanted to without issue, and I wouldn’t change a thing there.</span></p>\n<p><span>Do I recommend 40mm semi-slick tires for everyone? Probably not, especially if you’re not trying to finish the ride as quickly as possible. Something with more volume is likely a good choice; even if it is slower, your back will thank you.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/EastTexasShowdown2023_post-pirelli-cinturato-gravel-h-tire-on-open-wide-bike-1340x893.jpg?width=730\" alt=\"EastTexasShowdown2023_post-pirelli-cinturato-gravel-h-tire-on-open-wide-bike\" width=\"1340\" height=\"893\" /><figcaption><span>The Pirelli Cinturato Gravel H tires in a 40 mm have a light tread pattern and roll quickly. Are they my go-to gravel tire for riding in Texas? Good question.</span></figcaption></figure>\n<h2><strong>Final Thoughts</strong></h2>\n<p><span>I firmly believe that you don’t need the latest and greatest in bicycle tech to enjoy cycling. You don’t even need the good stuff. The right gear, however, will make or break how much you enjoy cycling, and exponentially so on endurance and bikepacking rides like East Texas Showdown. Unfortunately, there’s not one right kit to bring for a specific situation, but what I brought came pretty close for me.</span></p>\n<p><span>Learn more about East Texas Showdown at </span><a href=\"https://bikesordeath.com/east-texas-showdown/\"><span>bikesordeath.com/east-texas-showdown/</span></a><span>. </span></p>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c286494c2a90214748857ab99565575c55db2a377cb82b29077137dc545c73ba","category":"Cycling"}