{"title":"Gene redundancy and gene compensation of insulin-like peptides in the oocyte development of bean beetle","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302992","date":1715090400000,"content":"<p>by Yongqin Li, Zheng Fang, Leitao Tan, Qingshan Wu, Qiuping Liu, Yeying Wang, Qingbei Weng, Qianquan Chen</p>\r\n\r\nBean beetle (<i>Callosobruchus maculatus</i>) exhibits clear phenotypic plasticity depending on population density; However, the underlying molecular mechanism remains unknown. Compared to low-density individuals, high-density individuals showed a faster terminal oocyte maturity rate. Four insulin-like peptide (ILP) genes were identified in the bean beetle, which had higher expression levels in the head than in the thorax and abdomen. The population density could regulate the expression levels of <i>CmILP1-3</i>, <i>CmILP2-3</i>, and <i>CmILP1</i> as well as <i>CmILP3</i> in the head, thorax, and abdomen, respectively. RNA interference results showed that each <i>CmILP</i> could regulate terminal oocyte maturity rate, indicating that there was functional redundancy among <i>CmILPs</i>. Silencing each <i>CmILP</i> could lead to down-regulation of some other <i>CmILPs</i>, however, <i>CmILP3</i> was up-regulated in the abdomen after silencing <i>CmILP1</i> or <i>CmILP2</i>. Compared to single gene silencing, silencing <i>CmILP3</i> with <i>CmILP1</i> or <i>CmILP2</i> at the same time led to more serious retardation in oocyte development, suggesting <i>CmILP3</i> could be up-regulated to functionally compensate for the down-regulation of <i>CmILP1</i> and <i>CmILP2</i>. In conclusion, population density-dependent plasticity in terminal oocyte maturity rate of bean beetle was regulated by <i>CmILPs</i>, which exhibited gene redundancy and gene compensation.","author":"Yongqin Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c28d474026d2dea5842c8650dc845709b72e1ebcae0f0d3537d2cdd5b3cfbec2","category":"Interdisciplinary"}