{"title":"They’ve begun: Attacks exploiting vulnerability with maximum 10 severity rating","link":"https://arstechnica.com/?p=1973010","date":1696370013000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/caution-tape-800x600.jpeg\" alt=\"They’ve begun: Attacks exploiting vulnerability with maximum 10 severity rating\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/caution-tape.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ransomware hackers have started exploiting one or more recently fixed vulnerabilities that pose a grave threat to enterprise networks around the world, researchers said.</p>\n<p>One of the vulnerabilities has a severity rating of 10 out of a possible 10 and another 9.9. They reside in <a href=\"https://www.ipswitch.com/ftp-server\">WS_FTP Server</a>, a file-sharing app made by Progress Software. Progress Software is the maker of MOVEit, another piece of file-transfer software that was recently hit by a critical zero-day vulnerability that has led to the compromise of more than 2,300 organizations and the data of more than 23 million people, <a href=\"https://www.emsisoft.com/en/blog/44123/unpacking-the-moveit-breach-statistics-and-analysis/\">according to</a> security firm Emsisoft. Victims include Shell, British Airways, the US Department of Energy, and Ontario’s government birth registry, BORN Ontario, the latter of which led to the compromise of information for 3.4 million people.</p>\n<h2>About as bad as it gets</h2>\n<p>CVE-2023-40044, as the vulnerability in WS_FTP Server is tracked, and a separate vulnerability tracked as CVE-2023-42657 that was patched in the same <a href=\"https://community.progress.com/s/article/WS-FTP-Server-Critical-Vulnerability-September-2023\">September 27 update</a> from Progress Software, are both about as critical as vulnerabilities come. With a severity rating of 10, CVE-2023-40044 allows attackers to execute malicious code with high system privileges with no authentication required. CVE-2023-42657, which has a severity rating of 9.9, also allows for remote code execution but requires the hacker to first be authenticated to the vulnerable system.</p></div><p><a href=\"https://arstechnica.com/?p=1973010#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973010&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c291c21235063c9bdc9edd261e7e95d26acf10b27c7fa572a56b533e94e545ef","category":"Tech"}