{"title":"Reforming Sustainability-Linked Bonds by Strengthening Investor Trust","link":"https://www.preprints.org/manuscript/202405.1454/v1","date":1716381283000,"content":"This paper explores the emergence of Sustainability-Linked Bonds (SLBs) as an innovative instrument to finance sustainability objectives. SLBs have emerged as a transformative financial instrument, establishing an explicit link between cost of funding and sustainability objectives. SLBs were first launched in 2019 and represent 7% of labelled bonds, still dominated by the more established green bonds. Issuance of SLBs now exceeds $250 billion. Following initial enthusiasm, they are now facing criticism. In the context of the growth of sustainable finance and concerns of greenwashing, this paper investigates ways to enhance the design of SLBs. Drawing on literature and expert interviews, the findings highlight the strong potential of SLBs to contribute to sustainability financing, especially in hard-to-abate sectors. The paper identifies the key positive attributes of SLBs and their limitations in five areas: key performance indicators’ (KPI) selection, sustainability performance targets’ (SPT) calibration, bond characteristics, reporting practices, and resource requirements. Recommendations to financial intermediaries, issuers and policy makers include defining standardized KPIs based on a materiality assessment, requesting SPTs to be supported by science and in line with an issuer’s core strategy, tailored step-up mechanisms and avoidance of call loopholes, and stricter reporting. SLBs represent an opportunity to add rigor to sustainable finance and better price externalities, where material topics have an explicit impact on cost of funding and credit ratings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c294e0add40a9a580cd637151b6e01b1cb0aa28f8f45d8c4b59719539ba44878","category":"Interdisciplinary"}