{"title":"91 The effect of increasing oat groat levels on nursery pig performance, digesta pH, and fecal consistency and physicochemical properties in young pig diets","link":"https://academic.oup.com/jas/article/102/Supplement_2/246/7664798?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Post-weaning growth delay in pigs is a well-documented challenge associated with the stressors inherent in the weaning process. Oat-based dietary interventions have shown potential in improving fecal consistency, increasing feed intake, and improving feed efficiency. However, the direct effect of oat groats on the fecal physicochemical properties and dry matter (DM) is largely unknown. The experimental objective was to evaluate increasing inclusions of oat groats in young pig diets on pig performance, digesta pH, and fecal consistency and physicochemical properties. Newly weaned pigs (n = 128) with an initial body weight (BW) of 5.4 ± 0.27 kg were randomly assigned to one of four treatments (n = 8 split sex pens) for a 35-d study. Dietary treatments consisted of 0%, 5%, 10% or 15% inclusion of oat groats at the expense of corn. Treatments were applied across 2 dietary phases and a common diet fed during phase 3: d 0-7 (phase 1), d 7-21 (phase 2), d 21-35 (phase 3). On d 7, 14, 21, 28, and 35, pigs and feeders were weighed, pen fecal samples were collected, and fecal scores were evaluated using a 4-point scale (1 = solid, 2 = semi-solid, 3 = semi-liquid, 4 = liquid). Fresh fecal samples were analyzed for water binding capacity (WBC), and fecal DM. On d 14, one pig per pen closest to the mean BW was necropsied, and ileal, cecal, and colonic digesta pH were measured. Continuous data were analyzed as a linear mixed model (PROC MIXED) with treatment and period as fixed effects, and initial BW as a covariate where appropriate. Orthogonal polynomial contrasts were used to determine the linear and quadratic effects of increased inclusion. Fecal scores were analyzed using odd logistic regression. There was a linear increase in average daily gain (ADG) and average daily feed intake (ADFI) as oat groat inclusion increased from d 0-7 and d 7-14 (Linear <span>P</span> &lt; 0.05). However, from d 14 to 21, and d 21 to 35 there was no longer an impact of oat inclusion on ADG (<span>P</span> &gt; 0.782) or ADFI (<span>P</span> &gt; 0.405). Feed efficiency did not differ among treatments (<span>P</span> &gt; 0.71). Oat groat inclusion had no effect on fecal scores throughout the study (<span>P</span> = 0.743). However, fecal DM% increased as oat groat inclusion did on d 7 and 14 (Linear <span>P</span> &lt; 0.01), and fecal WBC tended to be increased in 5% and 10% oat groat diets (Diet; <span>P</span> = 0.063). Ileal and colonic pH did not differ among treatments, but cecal pH tended to be less in pigs fed 10 and 15% oat groats (<span>P</span> = 0.089). In conclusion, increasing oat groats in nursery diets increased ADFI, ADG, and altered fecal DM, but did not impact feed efficiency.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c299c4091598b52bc65daa8041b6ed163ab794dda3c0541f9635154cc4eb60c0","category":"Environment"}