{"title":"Lung ultrasound is associated with distinct clinical phenotypes in COVID-19 ARDS: A retrospective observational study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304508","date":1717423200000,"content":"<p>by Roy Rafael Dayan, Maayan Blau, Jonathan Taylor, Ariel Hasidim, Ori Galante, Yaniv Almog, Tomer Gat, Darya Shavialiova, Jacob David Miller, Georgi Khazanov, Fahmi Abu Ghalion, Iftach Sagy, Itamar Ben Shitrit, Lior Fuchs</p>\r\nBackground <p>ARDS is a heterogeneous syndrome with distinct clinical phenotypes. Here we investigate whether the presence or absence of large pulmonary ultrasonographic consolidations can categorize COVID-19 ARDS patients requiring mechanical ventilation into distinct clinical phenotypes.</p> Methods <p>This is a retrospective study performed in a tertiary-level intensive care unit in Israel between April and September 2020. Data collected included lung ultrasound (LUS) findings, respiratory parameters, and treatment interventions. The primary outcome was a composite of three ARDS interventions: prone positioning, high PEEP, or a high dose of inhaled nitric oxide.</p> Results <p>A total of 128 LUS scans were conducted among 23 patients. The mean age was 65 and about two-thirds were males. 81 scans identified large consolidation and were classified as “C-type”, and 47 scans showed multiple B-lines with no or small consolidation and were classified as “B-type”. The presence of a “C-type” study had 2.5 times increased chance of receiving the composite primary outcome of advanced ARDS interventions despite similar SOFA scores, Pao2/FiO2 ratio, and markers of disease severity (OR = 2.49, %95CI 1.40–4.44).</p> Conclusion <p>The presence of a “C-type” profile with LUS consolidation potentially represents a distinct COVID-19 ARDS subphenotype that is more likely to require aggressive ARDS interventions. Further studies are required to validate this phenotype in a larger cohort and determine causality, diagnostic, and treatment responses.</p>","author":"Roy Rafael Dayan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c2a1ea658720e02806155a01656be01f663f6e1a7e1fecc31ab99894694ec4c3","category":"Interdisciplinary"}