{"title":"Efficient water oxidation under mild alkaline conditions with ruthenium(IV)-iron(VI) catalysts","link":"http://link.springer.com/10.1007/s10311-024-01706-6","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Metal oxides are used as catalysts in energy and environmental applications. For instance, ruthenium(IV) oxides are oxygen evolution reaction catalysts in water splitting that have been investigated under highly acidic or alkaline conditions. Still, their stability and activity are limited under such harsh conditions. High-valent ruthenium ligand (L) complexes Ru<sup>IV</sup>-L and Ru<sup>V</sup>-L have been extensively studied for oxygen evolution reaction in non-aqueous environments. The new approach used herein is the combination of two high-valent ruthenium(IV) oxide (Ru<sup>IV</sup>) and iron(VI) (Fe<sup>VI</sup>O<sub>4</sub><sup>2−</sup>, Fe<sup>VI</sup>) that yielded efficient oxygen evolution reaction activity under mild alkaline aqueous conditions, at pH 8.2 and 9.0. The easily available ruthenium(III) ion (Ru<sup>III</sup>) reacted with Fe<sup>VI</sup> at a molar ratio of 0.25 ([Ru<sup>III</sup>]:[Fe<sup>VI</sup>]) to produce in situ Ru<sup>IV</sup> and unconsumed Fe<sup>VI</sup> mixture solution, which had an onset potential around 1.40 V with a shift in onset potential of 260 mV and 150 mV with respect to Ru<sup>III</sup> and Fe<sup>VI</sup> alone, respectively. The unique mixed solution of Ru<sup>IV</sup>-Fe<sup>VI</sup> had less resistance to perform the catalytic reaction. Here, we show that combining high-valent ruthenium(IV) oxide and iron(VI) under mild alkaline aqueous conditions exhibits superior performance for oxygen evolution reaction, making it a potential candidate for water splitting reaction.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"c2b52d304c6815aa2f4a063c494fda39c6a54f83886eae23a3859e6ad74109c5","category":"Environment"}