{"title":"ไม่ใช่แค่ ChatGPT เจาะลึก Fusion Solutions ใช้ Azure OpenAI มาพัฒนาการทำงานเชิงธุรกิจได้อย่างไร","link":"https://www.blognone.com/node/133197","date":1680085800000,"content":"<div><div><div><p>กระแส ChatGPT น่าจะทำให้คนจำนวนมากเห็นแนวทางการทำงานร่วมกับปัญญาประดิษฐ์ในรูปแบบต่างๆ ได้มากมาย โดยเฉพาะการใช้ปัญญาประดิษฐ์ช่วยเหลือเราในฐานะผู้ช่วยที่สามารถช่วยเราค้นคว้าเนื้อหาต่างๆ ปรับแต่งบทความ หรือแม้แต่โปรแกรมเมอร์ก็อาจจะใช้ Copilot ช่วยเขียนโค้ดทำให้เราสามารถทำงานได้เร็วขึ้น แต่การใช้งานเหล่านี้ก็มักใช้งานเหมือนปัญญาประดิษฐ์ทำหน้าที่ช่วยเหลือคนที่ทำงานอยู่เท่านั้น แต่ศักยภาพของปัญญาประดิษฐ์ในยุคใหม่เหล่านี้อาจจะสามารถทำหน้าที่แทนมนุษย์บางส่วนได้ทันที โดยเฉพาะในโลกธุรกิจที่มีการะบวนการทำงานอยู่หลายส่วน มีโปรเซสต่างๆ ที่ต้องอาศัยคนทำงานมาประมวลข้อมูล ตอบคำถามคนที่เกี่ยวข้อง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/34ea1cdebebc99fd8d8ecd1ba5facf47.png\" /></p>\n<p>ทางไมโครซอฟท์และ Fusion Solutions ก็นำเสนอถึงแนวทางใช้งาน Azure OpenAI Service ซึ่งทำให้องค์กรสามารถใช้ API เพื่อเข้าถึงปัญญาประดิษฐ์ระดับเดียวกับ ChatGPT มาใช้งานในรูปแบบใหม่ๆ ที่จะปรับปรุงการทำงาน เพิ่มประสิทธิภาพในการให้บริการ, การวิเคราะห์ข้อมูล, หรือแม้แต่การฝึกฝนนักเรียนหรือพนักงาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ae3f9f8784266e45131d326a85dc5a99.png\" /></p>\n<p>ทาง Fusion Solutions สาธิตแนวทางแรกคือการใช้ OpenAI ทำแชตบอทที่สามารถเข้าใจข้อมูลสินค้า โดยตอบกลับในชุดข้อมูลที่เรากำหนดเท่านั้น เช่น ตอบข้อมูลที่เกี่ยวกับร้านค้าของเรา โดยไม่พูดถึงสินค้าหรือบริษัทอื่นๆ ต่างจาก ChatGPT ปกติที่ตอบเรื่องทั่วไปโดยไม่มีข้อจำกัด</p>\n<p>ความแตกต่างของ Azure OpenAI ที่ใช้ในการยิง API ตามปกติ กับ ChatGPT คือ OpenAI API นั้นไม่ได้มีความจำและเมื่อผู้ใช้ถามคำถามโดยอ้างถึงข้อความเก่าๆ ที่พูดคุยกันนั้นก็จะทำให้คำตอบผิดไป ทาง Fusion ระบุว่าสามารถทำ short-term memory ให้กับแชตบอทได้แล้ว และเมื่อใช้ OpenAI API ร่วมกับ API อื่นๆ ของไมโครซอฟท์ เช่น entity extaction ก็จะทำให้แชตบอทสามารถตอบคำถามได้ตรงประเด็นยิ่งขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ce46db897909640fdd8a71754ce80e19.png\" /></p>\n<p>รูปแบบการใช้งานต่อมาที่ Fusion Solutions เสนอคือการใช้ OpenAI API เป็นส่วนประกอบหนึ่งของระบบทำงานอัตโนมัติที่ใช้แทนการเขียนโปรแกรมที่ซับซ้อน เช่น การที่ลูกค้าส่งอีเมลเข้ามาติดต่อบริษัท และเจ้าหน้าที่ต้องรายงานว่าอีเมลที่ลูกค้าติดต่อเข้ามานี้เป็นการติดต่อเรื่องอะไร ปัญญาประดิษฐ์สามารถจัดหมวดหมู่ได้อย่างแม่นยำว่าลูกค้ารายได้ติดต่อรูปแบบใดบ้าง เช่น ลูกค้าขอโปรไฟล์บริษัท, ขอนัดประชุม, หรือถามคำถามอื่นๆ ข้อมูลที่ได้นี้สามารถนำไปประมวลผลต่อเพื่อสร้างโมเดลจัดลำดับความน่าจะเป็นว่าลูกค้ารายใดน่าจะกำลังเตรียมซื้อสินค้า</p>\n<p>รูปแบบนี้สามารถใช้ร่วมกับบริการปัญญาประดิษฐ์อื่นๆ เช่น การแปลงเสียงเป็นข้อความ (Speech-to-Text) เพื่อนำข้อมูลเสียงมาประมวลรูปแบบเดียวกันนอกเหนือจากอีเมลที่เป็นข้อความอยู่แล้ว ทำให้เราสามารถประมวลข้อมูลโทรศัพท์หรือ call center ต่างๆ ได้ด้วยเพื่อหาข้อมูลเชิงธุรกิจ (business intelligence) จากข้อมูลที่องค์กรมีอยู่แล้ว</p>\n<p>การทำงานอีกรูปแบบหนึ่งคือใช้ OpenAI API เปลี่ยนคำถามตอบจากข้อความที่พนักงานเคยถามตอบกับลูกค้าไว้ก่อนแล้ว ทำให้สามารถสร้างชุดข้อมูลคำถามตอบขนาดใหญ่ได้ในเวลาอันสั้น เปิดทางสำหรับการฝึกแชตบอทที่จะทำงานได้ระดับเดียวกับมนุษย์มากยิ่งขึ้น</p>\n<p>การจัดการความรู้ในองค์กรเป็นอีกประเด็นหนึ่งที่มีความท้าทาย องค์กรมักมีเอกสารภายในที่เป็นประสบการณ์ของคนในองค์กรต่อเนื่องกันมาแต่ไม่สามารถนำข้อมูลเหล่านี้กลับมาใช้งานได้เพราะเอกสารเยอะเกินไป ความรู้เหล่านี้เป็นเอกสารเฉพาะทางที่ปัญญาประดิษฐ์ทั่วไปอย่าง ChatGPT ไม่เคยเห็นข้อมูลทำให้ไม่สามารถตอบคำถามเฉพาะได้ ทาง Fusion Solutions อาศัยฟีเจอร์ <a href=\"https://platform.openai.com/docs/guides/embeddings\">Embeddings</a> ของ OpenAI API ที่สามารถแปลงเอกสารออกมาเป็น vector และเมื่อผู้ใช้ถามคำถามต่างๆ ก็จะสามารถค้นหาเอกสารที่เกี่ยวข้องออกมาได้อย่างรวดเร็ว หลังจากนั้นสามารถนำข้อมูลที่เกี่ยวข้องนี้ใส่เข้าไปยังปัญญาประดิษฐ์</p>\n<p>การใช้ Embedding เพื่อแยกเอกสารจำนวนมาก เปิดทางให้ แชตบอทที่ปกติ OpenAI API มีข้อจำกัดไม่สามารถใส่ข้อมูลลงไปพร้อมกับคำถามได้มากนัก สามารถค้นเอาเฉพาะข้อมูลที่เกี่ยวข้องมาประมวลผล และตอบคำถามที่ซับซ้อนโดยมีเอกสารอ้างอิงข้อมูลให้ปัญญาประดิษฐ์สามารถดูก่อนจะสรุปคำตอบได้เสมอ แนวทางนี้ทำให้ผู้ใช้สามารถคุยกับแชตบอทได้อย่างเป็นธรรมชาติแต่สามารถค้นหาข้อมูลเฉพาะในองค์กรได้อย่างมีประสิทธิภาพไปพร้อมๆ กัน</p>\n<p>การสร้างแพลตฟอร์มเพื่อการศึกษา เนื่องจาก ChatGPT สามารถคุยได้อย่างเป็นธรรมชาติ เมื่อใช้งานร่วมกับปัญญาประดิษฐ์สำหรับแปลงเสียง เป็นข้อความ (speech-to-text) และแปลงข้อความเป็นเสียง (text-to-speech) ก็จะเหมือนมีครูสอนภาษาที่สามารถพูดคุยได้แทบทุกเรื่อง ทาง Fusion Solutions ทดลองสร้างแอปพลิเคชั่นทดสอบ และนำไปลองให้เด็กๆ พูดคุยพบว่าดึงความสนใจเด็กๆ ได้ดี</p>\n<p>จากแนวทางทั้งหมดน่าจะทำให้เห็นได้ว่า กระแส ChatGPT นั้นจะไม่หยุดอยู่แค่การใช้งานส่วนบุคคลเท่านั้นแต่ปัญญาประดิษฐ์ที่เข้าใจภาษามนุษย์จะช่วยเปิดแนวทางการทำงานระหว่างมนุษย์ร่วมกับคอมพิวเตอร์ในรูปแบบใหม่ๆ อย่างรวดเร็ว สำหรับผู้สนใจนำปัญญาประดิษฐ์ OpenAI API มาปรับปรุงกระบวนการทำงานในองค์กรติดต่อ Fusion Solution ติดต่อได้ที่เบอร์ 02-440-0408 หรืออีเมล์ sales@fusionsol.com หรือเข้าไปที่ Line: @fusionsolution</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/microsoft-azure\">Microsoft Azure</a></div><div><a href=\"/topics/openai\">OpenAI</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c2bb0e3ad6af70a9abec11f28f831dd55b476d85fe47d922ac06dad60d0c5264","category":"Thai"}