{"title":"Association between dietary inflammatory index and NT-proBNP levels in US adults: A cross-sectional analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304289","date":1717596000000,"content":"<p>by Teng-Chi Ma, Feng Gao, Xin-Lu Liu, Chen-Xi Wang, Qiang Liu, Jing Zhou</p>\r\nBackground <p>With cardiovascular diseases standing as a leading cause of mortality worldwide, the interplay between diet-induced inflammation, as quantified by the Dietary Inflammatory Index (DII), and heart failure biomarker NT-proBNP has not been investigated in the general population.</p> Methods <p>This study analyzed data from the National Health and Nutrition Examination Survey (NHANES) 1999–2004, encompassing 10,766 individuals. The relationship between the DII and NT-proBNP levels was evaluated through multivariable-adjusted regression models. To pinpoint crucial dietary components influencing NT-proBNP levels, the LASSO regression model was utilized. Stratified analyses were then conducted to examine the associations within specific subgroups to identify differential effects of the DII on NT-proBNP levels across diverse populations.</p> Results <p>In individuals without heart failure, a unit increase in the DII was significantly associated with an increase in NT-proBNP levels. Specifically, NT-proBNP levels rose by 9.69 pg/mL (95% CI: 6.47, 12.91; p &lt; 0.001) without adjustments, 8.57 pg/mL (95% CI: 4.97, 12.17; p &lt; 0.001) after adjusting for demographic factors, and 5.54 pg/mL (95% CI: 1.75, 9.32; p = 0.001) with further adjustments for health variables. In participants with a history of heart failure, those in the second and third DII quartile showed a trend towards higher NT-proBNP levels compared to those in the lowest quartile, with increases of 717.06 pg/mL (95% CI: 76.49–1357.63, p = 0.030) and 855.49 pg/mL (95% CI: 156.57–1554.41, p = 0.018). Significant interactions were observed in subgroup analyses by age (&lt;50: β = 3.63, p = 0.141; 50–75: β = 18.4, p&lt;0.001; &gt;75: β = 56.09, p&lt;0.001), gender (men: β = 17.82, p&lt;0.001; women: β = 7.43, p = 0.061),hypertension (β = 25.73, p&lt;0.001) and diabetes (β = 38.94, p&lt;0.001).</p> Conclusion <p>This study identified a positive correlation between the DII and NT-proBNP levels, suggesting a robust link between pro-inflammatory diets and increased heart failure biomarkers, with implications for dietary modifications in cardiovascular risk management.</p>","author":"Teng-Chi Ma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c2c8599e57c034d028af4ea9fc16ebe0c4bf5f8b303c34c6832cb2433d167594","category":"Interdisciplinary"}