{"title":"สรุปรายการข้อมูลคนไทยบน Raidforums พบข้อมูลผู้ใช้ CP Freshmart อีก 5.9 แสนรายการ ไม่ทราบที่มาอีก 30 ล้านรายการ","link":"https://www.blognone.com/node/124622","date":1631010560000,"content":"<div><div><div><p>นอกจาก<a href=\"https://www.blognone.com/node/124609\">ข้อมูลที่หลุดจากโรงพยาบาลเพชรบูรณ์</a>แล้ว เมื่อค้นเว็บบอร์ด Raidforums ต่อ ยังสามารถพบข้อมูลจากประเทศไทยที่น่าเป็นห่วงอีกหลายรายการ</p>\n<p>ผู้ใช้ THJAX ประกาศขายข้อมูลที่ระบุว่ามาจาก<a href=\"https://cpfreshmartshop.com/\">เว็บไซต์ CP Freshmart</a> ประกอบด้วยชื่อ-นามสกุล, อีเมล, ชื่อผู้ใช้, ที่อยู่, เบอร์โทร, วันเดือนปีเกิด, และรหัสผ่านแบบแฮช ทั้งหมดกว่า 5.9 แสนรายการ (594,585 แถว) โดยมีตัวอย่างเป็นไฟล์เอ็กเซลให้ดาวน์โหลด 1,000 รายการ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/32dc887b8d0fb3fa953476d95ac9f89e.jpg\" /></p>\n<p>ส่วนอีกรายการเป็นข้อมูลไม่เปิดเผยที่มาจากผู้ใช้ osintguy อ้างว่ามีข้อมูลกว่า 30 ล้านรายการ โดยมีตัวอย่างเป็นไฟล์ .txt ภายในมีข้อมูล ชื่อ นามสกุล เบอร์โทรศัพท์ ที่อยู่ หมายเลขบัตรประชาชน เพศ และวันเดือนปีเกิด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f6f780fa98fe7a15b36480ae91e89a3e.jpg\" /></p>\n<p>ทั้งสองรายการให้ติดต่อกลับเพื่อขอข้อมูลเพิ่มเติม ปัจจุบันมีคอมเม้นต์ในฟอรั่มขอข้อมูลเพิ่มเติมมากพอสมควร ผู้เขียนทดลองดาวน์โหลดไฟล์ตัวอย่างของทั้งสองกระทู้ พบว่ามีข้อมูลดังประชาชนตามที่กล่าวอ้างจริง แต่ไม่ทราบว่ามีจำนวนถึงตามที่อ้างไว้หรือไม่</p>\n<p>ปัจจุบันประเทศไทยยังมีการบังคับใช้ <a href=\"http://www.ratchakitcha.soc.go.th/DATA/PDF/2562/A/069/T_0052.PDF\">พรบ. คุ้มครองข้อมูลส่วนบุคคล</a> ยังไม่ครบทุกหมวด หลังมีมติ ครม. <a href=\"https://www.blognone.com/node/116310\">เลื่อนบังคับใช้ พ.ร.บ.คุ้มครองข้อมูลส่วนบุคคลไปอีก 1 ปี</a>เป็นครั้งที่สอง เมื่อช่วงเดือนพฤษภาคมที่ผ่านมา หลังเคยเลื่อนมาแล้ว<a href=\"https://www.blognone.com/node/116310\">รอบหนึ่งในเดือนพฤษภาคมปี 2020</a></p>\n<p>ที่ผ่านมากระทรวง DE ยังอยู่ระหว่างการทำกฎหมายลำดับรองและแนวปฎิบัติของอุตสาหกรรม 7 ด้าน คือ การท่องเที่ยว, สาธารณสุข, การศึกษา, ค้าปลีกและค้าออนไลน์, คมนาคมและขนส่ง, อสังหาริมทรัพย์, และหน่วยงานของรัฐ โดยกระบวนการทั้งหมดนี้ยังไม่เรียบร้อย</p>\n<p>กระทรวง DE ระบุเพิ่มเติมว่าภาคธุรกิจอย่าง สภาอุตสาหกรรมแห่งประเทศไทย, สภาหอการค้าแห่งประเทศไทย, และกลุ่มสมาคมด้านการท่องเที่ยว ได้ขอให้รัฐบาลบรรเทาผลกระทบจากความไม่พร้อมต่อกฎหมายนี้ก่อน ทางกระทรวง DE จึงได้เสนอให้ครม. เลื่อนการบังคับใช้กฎหมายนี้ออกไป ทำให้แม้กฎหมายบังคับใช้แล้วแต่ก็ไม่มีการเอาผิดผู้ดูแลข้อมูลแต่อย่างใด</p>\n<p>ที่มา - Raidforums</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c2c8a75cb9b6247871d3f40ce2f41a61b44389ffb986683cf5709e502750ccb6","category":"Thai"}