{"title":"Petrographic Characterization and Derivation of Sedimentary Environments and Coal Use from Petrographic Composition: Morupule, Mmamabula, and Mabesekwa Coalfields, Botswana","link":"http://link.springer.com/10.1007/s11053-024-10365-x","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>The Ecca equivalent coal deposits in the Morupule, Mmamabula, and Mabesekwa coalfields exist within the Kalahari Karoo Basin of the Karoo Super Group. Only the Morupule coal has proved its potential for power generation; while, the utilization value of the Mmamabula and Mabesekwa coals is yet to be determined. The current study presents petrographical characteristics of the three seams from each coalfield. Reflected light microscopy combined with scanning electron microscopy was used in the study. The analyses revealed that the Morupule and Mabesekwa coals are rich in inertinite; while, the Mmamabula coal is rich in vitrinite. The vitrinite reflectance indicates that the coal rank stretches between high volatile bituminous B and high volatile bituminous A. The compositions of macerals and coal facies indicate variations in the depositional conditions for the three studied coalfields. The Morupule and Mabesekwa coals were accumulated in a terrestrial bedmont dry forest swamp through fluvial vegetation transportation; while, the Mmamabula coal was deposited in a limnic upper plain wet forest swamp through alluvial vegetation transportation. Hydrological conditions were rheotrophic except in the Mmamabula South, which had ombrotrophic conditions. Based on petrographic compositions, coals from the Mmamabula East, Mmamabula South, Morupule East Main, Morupule West Main and Morupule South would be suitable for carbonization, gasification and liquefaction processes. However, several challenges with coals from the Mmamabula South, Mabesekwa Seam B, Mabesekwa Seam C and Mabesekwa Seam E would be encountered during carbonization, gasification and liquefaction due to high ash content and inert semifusinite content.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"c2ce37516f8075474cf5ed9abdd273f49f2944be115abee3dae3ab7ced9b2b8d","category":"Environment"}