{"title":"Revisiting the Ford Mustang Mach-E—how’s the pony EV doing 3 years later?","link":"https://arstechnica.com/?p=1989783","date":1702079085000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2023-Ford-Mustang-Mach-E-premium-awd-1-800x600.jpg\" alt=\"A Ford Mustang Mach-E, head-on\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2023-Ford-Mustang-Mach-E-premium-awd-1-scaled.jpg\">Enlarge</a> <span>/</span> The Ford Mustang Mach-E is now in its third year of production, so it felt like a good idea to see how it's maturing. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When Ars <a href=\"https://arstechnica.com/cars/2021/02/ford-mustang-mach-e-review-the-peoples-pony-goes-electric/\">first drove the then-new Ford Mustang Mach-E back in early 2021</a>, the car was an attention magnet. Now, almost three years later, the Mustang Mach-E is a much more common sight on our roads, but so are other electric crossovers from most of Ford's usual rivals, including the sales juggernaut that is the Tesla Model Y. We decided to book a few days with a Mustang Mach-E to see how (or if) this equine EV has matured since launch.</p>\n<p>Originally, Ford had been working on a much more boring battery electric car until Tesla started delivering its Model 3s, at which point a hastily convened \"Team Edison\" set to work adding some much-needed brio to the design, rethinking Ford's EV strategy in the process.</p>\n<p>Giving this midsize crossover EV a Mustang name tag remains divisive—I expect a reasonable percentage of comments to this story will be people showing up to complain, \"It ain't no real Mustang.\" The crossover's name is what it is, and there are plenty of Mustang styling cues, but even with the designers' trick of using black trim to make you ignore the bits they don't want you to see, there's no denying the proportions are pretty far from coupe-like.</p></div><p><a href=\"https://arstechnica.com/?p=1989783#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989783&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c2d37fb8be8229c14750c5ea2ed9bf86cfbffca8dd19c73ffdc6dc151fe80c3a","category":"Tech"}