{"title":"First Ride Review: Veolo Bike Trailer – Hailey Moore","link":"https://theradavist.com/veolo-bike-cargo-trailer-review/","date":1707997784000,"content":"<p><em>After a successful Kickstarter campaign at the end of 2023, the <a href=\"https://veolo.de/\" target=\"_blank\">Veolo</a> bike trailer is moving to production—available for pre-order now with an expected arrival time of May 2024. <a href=\"https://theradavist.com/tag/hailey-moore/\" target=\"_blank\">Hailey Moore</a> has been looking for an analog system for carrying more commuting cargo by bike and was intrigued by the Veolo’s lightweight build, modest storage footprint, and hefty carrying capacity. </em></p>\n<p><em>Read on for her first-ride review of this German-made bike trailer…<span></span></em></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-13.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-13.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-13.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-13.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-13.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Costco is tantalizingly close to my house. I have serious doubts that anyone has ever described Costco in those terms, but at six miles one-way (mostly bike path, no less) I have convinced myself that it’s worth attempting by bike. Not that I love going to Costco, but you know, inflation and all that. Although we don’t have a cargo bike or an ebike, my partner and I gave Costco-by-bike the ‘ol college try on our touring bikes, outfitting them with front and rear racks and panniers. Even so, it wasn’t really a fruitful mission as the nature of buying in bulk is that everything’s just that: bulky. So, we’ve been making our quarterly-ish mega runs in the car.</p>\n<p>I’m just using Costco as an example of my high-capacity commuting woes (I could just as well be talking about the post office; or taking a pair of wheels to a bike shop; or making a run to the plant store). I would like to reduce my <em>overall</em> use of cars when possible, but I’m not really interested in solving this problem with an ebike. I like the<em> idea</em> of ebikes, from an environmental standpoint, but also just from a life-enjoyment standpoint. Anecdotally, I can say that on just about any given day I’m happier if I get to carry out the minutiae of errands by bike then by car.</p>\n<p>But, I also know myself and even if I wanted to throw down some coin for an ebike right now, I’m ultimately just not that interested in doing the requisite research to make a smart purchasing decision. Plus, I’m even less interested in an ebike’s maintenance: once you introduce a battery, motor, and any integrated electronics into the equation, there’s the whole serviceability component. I have a hard enough time keeping my analog bikes running smoothly, not to mention two aging vehicles (<em>you know</em>, John Watson), so the last thing I want is another thing that will potentially introduce problems that I am not equipped to solve. What I needed was some low-tech; what I needed was a trailer.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-4.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-4.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-4.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-4.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-4.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Last fall, the German-based company Veolo reached out to The Radavist about testing their then-Kickstarter campaign project, the Veolo bike trailer. According to brand, the design of the trailer focuses on handling and ease of use, through the trailer’s attachment system, lightweight construction, and supplemental accessories that increase its versatility. By seeking to eliminate barriers to use—storability, installation hassle, weight—Veolo is positioning their namesake trailer as a competitive alternative to dedicated cargo bikes, e-cargo bikes, and as a capable bike-touring accessory. Their Kickstarter campaign was a success and the trailer has now moved to official production (estimated availability May 2024), however the version I received for testing was a prototype. Here’s an overview of the production-specced model:</p>\n<p><img loading=\"lazy\" width=\"1191\" height=\"842\" src=\"https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_01.png?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_01.png?w=1191&amp;quality=75 1191w, https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_01.png?resize=768,543&amp;quality=75 768w\" /> <img loading=\"lazy\" width=\"842\" height=\"596\" src=\"https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_02.png?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_02.png?w=842&amp;quality=75 842w, https://media.theradavist.com/uploads/2024/02/2024_Veolo_Bike_Trailer_drawing_02.png?resize=768,544&amp;quality=75 768w\" /></p>\n<p><em>All measurements shown in millimeters</em></p>\n<h3>Quick Hits</h3>\n<ul>\n<li>High-strength CNC-machined, damped aluminum frame with cast and milled connectors</li>\n<li>Two 60 Shore-hardness elastomers provide 45 mm travel</li>\n<li>Aluminum tub with two tension straps</li>\n<li>Removable &amp; swiveling 35 mm drawbar* with connection for Thule coupling</li>\n<li>20-inch wheels with thru axle</li>\n<li>Weight: 8.5 kg / 18.7 lb</li>\n<li>Max load capacity max. 80 kg/ 175 lb</li>\n<li>Dimensions: see drawings above</li>\n<li>Price: $863 USD</li>\n</ul>\n<p>(*The drawbar I received was non-swiveling and only 30 mm in diameter; the specs listed above reflect the current design.)</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-1.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-1.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Installation</h3>\n<p>As with most bike trailers, the first step to installing the Veolo is swapping the rear axle to one that allows installation of the trailer’s Thule coupler hitch attachment on the non-driveside of the bike. This is essentially a ball-and-socket system and, once the coupler is installed with the axle, you just have to slot in the ball, fixed to the end of the trailer’s drawbar, to connect the trailer and bike. A pin locks into the drawbar side of the connection to prevent the trailer from bouncing out. Some manufacturers make custom axles for their trailers, but Veolo refers customers to find a compatible axle at The Robert Axle Project.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-7.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-7.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-7.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-7.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-7.jpg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-6.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-6.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-6.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-6.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-6.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The 20-inch wheels easily slot into and out of the trailer body, thanks to their integrated locking axles, whose pins are released or engaged by depressing a rubberized cap on each wheel’s hub. Once the drawbar is locked in and the wheels are set, you’re ready to roll.</p>\n<h3>In Use</h3>\n<p>Fittingly, my first outing with the trailer was a trip to Costco. Empty, it weighs just under 19 lb and, aside from the trailer’s expected slow take-off, once both bike and trailer were rolling, I barely thought about it while riding. However, I was quickly reminded of the trailer’s wider footprint—it’s 76.5 cm, or about 30 inches, across—when I accidentally took a couple turns too tightly and clipped a curb with a wheel (no harm done!).</p>\n<p>The drawbar, or arm, of the trailer extends from the non-driveside of the bike, which means the trailer tracks behind the bike just left of center. When riding on the shoulder of a road, I tried to stay even further right to ensure the trailer was also safely within the white line, especially because I didn’t have one of those tall flags.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-9.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-9.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-9.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-9.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-9.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>While I didn’t find parking to be an issue in the concrete jungle of the Costco shopping center, I definitely could see the extended footprint being hard to finagle at tight bike racks, or outside of smaller storefronts. The trailer drawbar is also a cinch to remove from the included Thule coupler. If I owned the Veolo and used it routinely, I’d certainly pack an extra small lock to secure the trailer. Veolo’s website includes the option of upgrading to a locking <a href=\"https://veolo.de/products/weber-achskupplung?variant=47450006028628\" target=\"_blank\">Weber axle coupling</a> ($104) which is also recommended for carrying especially heavy loads.</p>\n<p>Shopping complete, it was time to put the trailer to the real test under weight. Before riding, I was pretty astounded to see Veolo’s claim that its trailer can carry up to 80 kg, or ~175 lb. That is some serious hauling. As a result, I loaded it down indiscriminately.</p>\n<p>There’s about 500 ft of elevation gain in the 12-mile round-trip Costco ride, so not too hilly but not dead flat either. At a relaxed effort, I felt marginally impacted by the weight of the trailer when it was unloaded on a few little rollers on the way out, but after packing it with 90 lb of groceries, you better believe I noticed on the way home.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-8.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-8.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-8.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-8.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-8.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>I’d never ridden with a trailer before test-riding the Veolo so my only frame of reference for carting cargo by bike was bike touring, and overloading front baskets while commuting. As you might expect, riding with a trailer feels very different. Because of the wheels, once the trailer is moving it has its own momentum that is separate, and on a slight delay, from that of you and the bike. While climbing—at least with 90 lb—this had the effect of creating a halting, herky-jerky kind of tug. It wasn’t crazy but it was definitely noticeable. I found it easiest to minimize this by staying in a pretty spinny gear; riding out of the saddle while climbing felt too jolting to be comfortable. On descents, the trailer’s momentum was less noticeable until I started braking, where it then felt like the trailer’s speed would catch up to me and lightly continue to nudge me forward until it also slowed. I also asked Tony to keep an eye on the wheels from behind; under a heavy load and at high speeds, they had a bit of a wobble. When I reached out to Veolo about this, the founder and head product designer, Johann, told me that the wheel tolerances had been reduced since this prototype iteration.</p>\n<p>All this to say, I found that I needed to be a little more gradual in coming to a complete stop, at least from higher speeds. I’m not totally sure what would happen if you had to slam on the brakes while riding fast with the trailer weighed down, but I opted not to find out on my test ride.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-10.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-10.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-10.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-10.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-10.jpg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-11.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-11.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-11.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-11.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-11.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>According to Veolo, the included 60 Shore elastomers that give the trailer its max 45 mm of suspension are rated for loads up to 50 kg (110 lb); above that Veolo recommends changing out the elastomers to the 70-Shore option that they offer on their site. Still, it’s worth noting that many of the cargo trailers I’ve seen are rated to carry half, or less, of the weight that the Veolo claims to support. Based on my experience riding with 90 lb, I can’t say that I’d personally be interested in pulling much more. Even so, I think what’s most remarkable is that before weighing the Costco haul, I had guessed that I’d only towed 60 lb in the trailer—90 just seemed inconceivable. From my bikepacking experience, I know that a 45+ lb bike feels pretty dang heavy to pedal, so it’s actually quite impressive how much (more) weight a trailer will tolerate, without that weight translating to the rider the same that it does on a bag-laden bike. That being said, although Veolo (and other brands) market the trailer as an accessory to make any bike a touring bike, on or off road, I can’t see it being a system that I’d want to adopt if adding racks and bags were an alternative.</p>\n<p>That doesn’t mean there’s not more-exciting-than-Costco use cases! If the weather had been more cooperative of late here in Colorado, I would have loaded the trailer with a climbing rope and rack and pedaled to Eldorado Canyon (also six miles one-way) for some trad climbing. With the addition of Veolo’s packaging hangers ($207), this trailer is also fit for hauling larger items; in the climbing vein, it’s easy to envision a crashpad lashed down on the hangers, with climbing bags stashed underneath. If you live near a lake or the coast, load ‘er up with chairs and a cooler and call it a day. Finally, by purchasing one, or a couple, extra compatible thru axles, you can make quick work of swapping the Veolo between bikes so it can be shared among household members.</p>\n<h3>So is it better than an e-cargo bike, cargo bike, or other trailers?</h3>\n<p>There’s a lot of factors that go into answering this question, but I think primary among them is: what problem are you attempting to solve by introducing a new way to carry cargo? Or, put differently, what problems are you trying to avoid? For me, I know that low-maintenance, space efficiency, and being lightweight are all top priorities; I have less interest in becoming the owner of a whole new bike that serves a pretty niche role (well, that is, unless it’s a fat bike ; ) ) and will likely be another possession that needs servicing. I also don’t have kids or pets to transport, and I work from home, so all of my commuting around town is errand-based. For those criteria, the Veolo seems nearly unmatched. I say “seems” because, I have to admit, the $863 price tag feels staggering.</p>\n<p>When the Veolo first appeared on my radar, you could make a pledge to the Kickstarter campaign for $526 and that would get you a trailer once the project had moved to production. That price seems about spot on. As compared to the compelling Burley Coho® XC ($489.95), the cost of a Veolo is quite high, but I was surprised to learn that the latter is comparably priced to Tout Terrain’s Mule trailer (~$805). Still, the Veolo purports to be able to carry much greater loads than either, with the Coho maxing out at 70 lb, and the Mule finding its limit at 84 lb. And, the Veolo accommodates higher-volume items, regardless of weight. Plus, as a final point of comparison, both the Mule and Coho are built around a single wheel—I’d have to think that the Veolo’s dual-wheel base provides a sturdier platform for said unwieldy items.</p>\n<p>The price tag can be further explained by the fact that the trailer is almost completely manufactured, and fully assembled, by Veolo in Leipzig. As Johann explained, “As with any bicycle, we also have to source a few parts from abroad. The wheels and the curved, forged element in the middle of the trailer come from Taiwan. The insert tray is made in Poland. All other parts such as the aluminum tubes, CNC parts, elastomers, etc. come from Germany. We put everything together. Glue it, coat it, pack it, do quality control, etc. Like with Sour Bikes or Veloheld.”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-2.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-2.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-2.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-2.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-2.jpg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"1333\" height=\"2000\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-3.jpg?fit=1200,2000&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-3.jpg?w=1333&amp;quality=75 1333w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-3.jpg?resize=1200,1800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-3.jpg?resize=768,1152&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-3.jpg?resize=1024,1536&amp;quality=75 1024w\" /></p>\n<p>Without getting into a total deep dive on cargo bikes and other carrying solutions, the Veolo costs a little over half of an Omnium Cargo V3 frameset ($1,529) or Surly Big Dummy frameset ($1,599). (The BFD has a combined rider and cargo weight limit of 400 lb, and the Omnium is similar with a 385 lb limit rating.) Going the Crust Clydesdale route (which Tony just did) entails buying the $355 Clydesdale fork, a 20-inch wheel, and tires; all of which will probably set you back in the $500-ballpark. At the beginning of the article, I said that I wasn’t interested in researching ebikes, but for the sake of this review, I’ll briefly add that a <a href=\"https://theradavist.com/globe-haul-st-review/\" target=\"_blank\">Specialized Globe Haul ST</a> is, impressively, priced at $2,800, is rated for 419 lb of carrying capacity (rider included), and has been ranked the among the top current e-cargo offering (the fine print is that while the rear rack is fixed, the front and pannier racks are each $100).</p>\n<p>I’m laying all of this out just to compile information, not to necessarily make a judgment call on which is the best solution. That will differ greatly person-to-person. But, in just standing over and looking down the rabbit hole of offerings, I’m reminded again of what attracted me to the Veolo in the first place: its simplicity. After purchasing the trailer and any desired accessories, at least you know there’s not going to be any mechanics’ fees.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-12.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-12.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-12.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-12.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/2024_VEOLO_Bike_Trailer_Review-12.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>TL;DR</h3>\n<p>Made by the German brand of the same name, the Veolo bike trailer is a nimble, dual-wheel, cargo bike trailer constructed of machined aluminum and designed to carry hefty loads. The wheels are easily detachable, making the trailer more convenient to store between uses and the coupling axle attachment means you can outfit multiple bikes with compatible axles for use with the trailer. Finally, it’s a compelling solution to give existing bikes extra cargo capacity, rather than purchasing a dedicated cargo bike.</p>\n<h3>Pros</h3>\n<ul>\n<li>Lightweight</li>\n<li>Integrated 45 mm suspension with two elastomer hardnesses to choose from</li>\n<li>Wheels easily detach from trailer body and can be stowed inside</li>\n<li>Accessories like waterproof bag, weber axle coupling, wall mounts, packing hangers and XXL drawbar increase range of uses</li>\n<li>Can swap between bikes by purchasing additional thru axles</li>\n</ul>\n<h3>Cons</h3>\n<ul>\n<li>Expensive at $865</li>\n<li>All accessories are sold separately, adding to the cost</li>\n<li>Bike handling is impacted by heavy loads while climbing</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>The post <a href=\"https://theradavist.com/veolo-bike-cargo-trailer-review/\">First Ride Review: Veolo Bike Trailer</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Hailey Moore","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"c2de78989d4ec52e4847d14e7e67c857457db7c6748882ca01402dbac7f455ed","category":"Cycling"}