{"title":"Risk factors for urinary tract infection in elderly patients with type 2 diabetes: A protocol for systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310903","date":1727359200000,"content":"<p>by Hairong Jia, Wenhao Su, Jiaqi Zhang, Zhaoyang Wei, Pepertual Tsikwa, Yanru Wang</p>\r\nIntroduction <p>Type 2 diabetes mellitus (T2DM) is a frequent chronic condition among the elderly, which increasing their susceptibility to infection. Urinary tract infection (UTI) is one of the most prevalent infections among older people with T2DM. However, the association between geriatric T2DM and the risk of UTI has not been thoroughly researched and is still contentious. Consequently, this protocol describes a systematic review to pinpoint the primary risk factors for UTI among elderly T2DM. Our goal is to improve recommendations for the creation of targeted treatment interventions by examining risk factors for UTI in elderly individuals with T2DM.</p> Methods and analysis <p>We will search 4 English literature databases (PubMed, Embase, Web of Science, and Cochrane Library) and 3 major Chinese databases (CNKI, WanFang, and VIP) from the establishment of the database to June 20, 2024. Systematic evaluation and meta-analysis will be conducted on cohort and case-control studies exploring the occurrence and risk determinants of UTI in individuals diagnosed with T2DM. The main focus will be on identifying the risk factors for UTI in elderly diabetic patients. Two researchers will independently review articles, collect data, and evaluate the quality and potential bias of study inclusion. We will use RevMan V.5.4 software to analyze the data. The quality of the included studies will be assessed using the Newcastle-Ottawa scale. In addition, the GRADE (Grade of Recommendations, Assessment, Development, Evaluation) method will be used to examine the quality of evidence for each exposure and outcome of interest.</p> Discussion <p>This study aims to illuminate the various risk factors associated with UTI in older patients diagnosed with T2DM. By this thorough investigation, we hope to provide a more comprehensive reference for medical professionals and researchers, thereby supporting the implementation of effective preventive strategies against UTI and improving overall nursing outcomes for this specific patient population.</p> Trail registration <p>PROSPERO (CRD42024559129).</p>","author":"Hairong Jia","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c2de56150b50a70512a11f47aac092ea37d2a7256579d31cd16c81bb11f42174","category":"Interdisciplinary"}