{"title":"Psychometric evaluation of the Polish adaptation of the Body Appreciation Scale-2 for Children (BAS-2C)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309945","date":1726149600000,"content":"<p>by Karolina Kubicka, Agata Trzcińska, Małgorzata Gambin</p>\r\n\r\nPositive body image is crucial in fostering self-esteem, mental well-being, and positive social functioning. However, our understanding of its development and role in school-aged children remains limited due to a scarcity of measures available for this age group across various countries and cultures. To bridge this gap, the aim of this study was to adapt the Body Appreciation Scale-2 for Children (BAS-2C) for Polish children aged 8–13 years. A total of 206 children completed BAS-2C to measure positive body image, the Figures Rating Scale to measure body satisfaction, and the Self-Perception Profile for Children to measure self-esteem. Parents provided information about their child’s weight and height, which enabled analysis of a child’s BMI. The results showed that the Polish version of BAS-2C exhibited a unidimensional factor structure, invariance across sex and age groups, and also provided evidence of very good internal consistency, test-retest reliability, and construct validity. BAS-2C scores were correlated positively with Figures Rating Scale, physical appearance and global self-esteem and were related negatively to age and BMI index, and weight group. Moreover, our research indicates that in older children, there are stronger correlations between positive body image and both global and physical appearance self-esteem, compared to younger children. The Polish version of BAS-2C has excellent psychometric properties and is appropriate for use with children aged 8–13 years.","author":"Karolina Kubicka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c2f1c1bbec7b17c71b4f1f6cadf7acd7a424c49446e754f53c9026ed56e52d44","category":"Interdisciplinary"}