{"title":"New opportunities for grassland species in warming temperate winters","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14677?af=R","date":1729155009000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/883d6daf-7f46-4ba6-a5e1-8952f8fc837b/fec14677-toc-0001-m.png\" alt=\"New opportunities for grassland species in warming temperate winters\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/04/green-winter-leaves-of-herbs-can-photosynthesize-and-survive-freezing-temperatures/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTemperate winters are getting warmer, the length of the growing season is increasing and mid-winter fluctuations of warm and freezing temperatures are more frequent. Although typically winter dormant, some herbaceous perennials can maintain or grow green leaves during the winter and more species may do so as winters become warmer. For wintergreen leaves to provide an advantage, they must be able to photosynthesize during the warm spells but also withstand freezing temperatures and fluctuations between the two conditions.\n\nTo understand the leaf traits of wintergreen herbs, we studied three widely distributed perennial species: <i>Bellis perennis</i>, <i>Plantago lanceolata</i> and <i>Trifolium repens</i>. For contrast between winter and growing season leaves, we measured three common leaf economic traits (LDMC, SLA and leaf N content). To assess freezing tolerance, we measured the ice nucleation temperature and LT50 after frost exposure in winter leaves. To confirm photosynthetic ability, we measured photosynthetic efficiency (<i>Fv</i>/<i>Fm</i> value) in winter and late spring. Additionally, we surveyed the green and dead leaf coverage for herbaceous species in a lawn community from winter to early summer (four surveys in total). We used our observations to determine phenological categories and compared them to historical observations of wintergreenness.\n\nAll three species had denser leaves with lower nitrogen content in winter than in the growing season and relatively high tolerance of freezing temperatures (average of −8°C ice nucleation temperature and −15°C LT50). Both winter and growing season leaves were capable of photosynthesis, but the efficiency was greater for growing season leaves. In the community survey, a majority of the plant species had green leaves in winter, and many were without dead winter leaves. Many wintergreen herbs had previously been labelled ‘summer green’.\n\nWith these initial investigations into the traits and phenology of wintergreen herbs, we confirm that wintergreen leaves have different traits from typical growing season leaves and are capable of both photosynthesis and freezing tolerance. Wintergreen herbs have a broad range of phenological strategies and differ from observations 20 years ago. In many temperate regions, winter is becoming a new growing season and thus should be included in phenological studies.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/04/green-winter-leaves-of-herbs-can-photosynthesize-and-survive-freezing-temperatures/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"F. Curtis Lubbe, \nAndrea Kučerová, \nMartin Bitomský, \nJitka Klimešová","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"c2fb626645e906a7d8df69462d3f0dbe5d793ef640234d32e9b62539f6816dfe","category":"Environment"}