{"title":"The Need for Indigenous Games to Combat Noncommunicable Diseases in South Africa: A Narrative Review","link":"https://www.preprints.org/manuscript/202403.1723/v1","date":1711612338000,"content":"The prevalence of Noncommunicable Diseases (NCDs) in South Africa is increasing annually, with the burden projected to escalate by 2030. Devastatingly, factors such as lifestyle changes, urbani- sation, and an aging population significantly contribute to a rising burden of Cardiovascular disease (CVDs), diabetes, and cancer which directly impact the mortality and morbidity rates seen in South Africa. Recognising this, the South African government has seen the need for emphasis on developing policies and interventions tar- geting physical inactivity to prevent and manage NCD, particularly cost-free and easy to administer training protocols. However, phys- ical inactivity remains a significant issue, leading to various health concerns in rural communities, including injuries and Fetal Alcohol Spectrum Disorders (FASD). Despite effort to promote physical ac- tivity, the prevalence of NCDs continues to rise, necessitating target- ed interventions to ensure equitable healthcare among South African citizens. On the Contrast, preservation and promotion of traditional games is vital as they offer indigenous populations accessible and culturally relevant means to maintain health and wellness. In this regard, it is important to recognize the importance of preserving and promoting traditional games as they potentially serve as a method for indigenous people to maintain their health and wellness in a way that is accessible and culturally relevant to them. These games have gained popularity in South Africa, with initiatives underway to show- case them globally fostering cultural exchange. Further, revitalizing and conserving these games can cultivate a culture of health and wellbeing in South Africa.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c303603c31651a2b03c9e8cced183f867a300385d806cff8919d9b99715cdbed","category":"Interdisciplinary"}