{"title":"Valorization of artichoke outer petals by using ultrasound‐assisted extraction and natural deep eutectic solvents (NADES) for the recovery of phenolic compounds","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13158?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In the present study, natural deep eutectic solvents (NADES) as a novel green tool were used for the recovery of bioactive compounds with respect to the valorization of artichoke outer petals. NADES coupled with ultrasound-assisted extraction was applied by varying the type of hydrogen bond acceptors (choline chloride or betain) and hydrogen bond donors (sucrose, lactic acid, citric acid, oxalic acid and glycerol) in the NADES mixtures. Thereafter, extraction efficacy was assessed in terms of total phenolic content, antioxidant capacity and individual phenolic composition and their levels by comparing the results obtained by NADES with those for a reference methanolic extract.</p>\n<h2>RESULTS</h2>\n<p>Based on the results of the present study, the use of choline chloride and lactic acid mixtures was superior for obtaining extracts with high levels of phenolic compounds (12.96 g GAE kg<sup>−1</sup> DW) and high antioxidant potential (60.68 g TE kg<sup>−1</sup> DW). In addition, gallic acid, syringic acid, chlorogenic acid, ferulic acid, sinapic acid, luteolin, apigenin, rutin and quercetin were detected in all extracts by chromatographic evaluation. As major phenolic compounds, chlorogenic acid and ferulic acid were found to be maximum in lactic acid-based NADES mixtures.</p>\n<h2>CONCLUSION</h2>\n<p>The present study reveals the potential treatment of various plants, wastes or by-products with NADES combined with an ultrasonication method for the extraction of bioactive compounds with enhanced recovery and selectivity, with the aim of incorporating them into various food and pharmaceutical formulations. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Gulay Ozkan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c313609cf95316f87638d881d54077c957f7daa26a29566c601cd84d65bdc18f","category":"Environment"}