{"title":"Critical stage and key natural mortality factors of Hypothenemus hampei in commercial coffee plantations","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12871?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a3b07809-30a7-4815-a430-91649c3076b5/aab12871-toc-0001-m.png\" alt=\"Critical stage and key natural mortality factors of Hypothenemus hampei in commercial coffee plantations\" />\n<p>Predators ants, parasitoids, entomopathogenic fungi, and malformations during the <i>Hyphothenemus hampei</i> life cycle caused 75.34% of the mortalities seen within their populations. Adult mortality is the principal factor that regulates the size of populations of this insect. Predatory ants were the key mortality factor for <i>H</i>. <i>hampei</i>.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The coffee berry borer, <i>Hypothenemus hampei</i> (Ferrari) (Coleoptera: Scolytidae), is one of the most important coffee pests, and is present in almost all countries producing this crop, causing annual losses of US$350 million. Natural factors regulate <i>H</i>. <i>hampei</i> populations in coffee crops. Ecological life table analysis is a robust tool that allows the estimation of the mortality caused by these factors. Therefore, the main objective of this study was to determine the critical stage and the key mortality factors affecting <i>H</i>. <i>hampei</i> in the field. Data for constructing life tables were collected over 2 years in six coffee plantations in the regions of Paula Cândido and Viçosa, Minas Gerais State, Brazil. The average mortality of <i>H</i>. <i>hampei</i> was 75.34% ± 5.85%. The mortality at each developmental stage was 24.32% ± 2.83% (eggs), 7.29% ± 1.01% (first instar), 11.58% ± 1.46% (second instar), 9.68% ± 1.10% (third instar), 7.45% ± 1.01% (pupa), and 15.02% ± 1.29% (adult; <i>n</i> = 124). The mortality factors observed and quantified in this study were parasitism by <i>Prorops nasuta</i> (Hymenoptera: Bethylidae), predation by ants (<i>Crematogaster</i> spp., <i>Pheidole</i> spp. and <i>Solenopsis</i> spp.), physiological disorders and fungal infection by <i>Beauveria bassiana</i> and <i>Metarhizium anisopliae</i>. The critical mortality stage of <i>H</i>. <i>hampei</i> was the adult stage. The key factors for mortality of <i>H</i>. <i>hampei</i> adults were predatory ants, followed by <i>B</i>. <i>bassiana</i> and malformations (these insects had deformities in the head, wings, legs, or abdomen). This information is essential to conserve the activities of natural enemies and, thus maintain <i>H</i>. <i>hampei</i> natural mortality factors in coffee plantations, reducing damage to the crops and the need for excessive insecticide interventions.</p>","author":"Mateus Chediak, \nGerson Adriano Silva, \nDaiane das Graças do Carmo, \nDamaris Rosa de Freitas, \nLeandro Bacci, \nEraldo Lima, \nRichard Ian Samuels, \nMarcelo Coutinho Picanço","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"c31cadf8eabf88d7fcdb49c7aceb7f95532cdd627b62b265a57836997252ed97","category":"Environment"}