{"title":"The effect of methylphenidate on anaesthesia recovery: An experimental study in pigs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302166","date":1713276000000,"content":"<p>by Alessandro Mirra, Fabiana Micieli, Mirjam Arnold, Claudia Spadavecchia, Olivier Louis Levionnois</p>\r\nIntroduction <p>Due to the lack of specific antagonists for general anaesthetics, the pharmacological stimulation of the arousal pathways might contribute to reduce recovery time. We aimed at assessing the effect of methylphenidate on physiological parameters, nociceptive withdrawal reflex thresholds, electroencephalographic variables and time of reappearance of reflexes in pigs undergoing propofol anaesthesia.</p> Materials and methods <p>Two experiments have been performed. Five (experiment 1) and sixteen (experiment 2) healthy juvenile pigs were anaesthetised with propofol. In experiment 1, saline, methylphenidate 10 mg/kg or methylphenidate 20 mg/kg was administered intravenously at the end of propofol administration, using a cross-over design. In experiment 2, saline (n = 8) or methylphenidate 20 mg/kg (n = 8) was administered immediately after extubation. In both experiments, physiological parameters, nociceptive withdrawal reflex thresholds, electroencephalographic variables and time of reappearance of reflexes were assessed. Comparison among groups was performed using either the two-way repeated measures ANOVA followed by Bonferroni-Test or the t-test in case of parametric data, and either the Kruskal-Wallis test or the Mann-Whitney Rank Sum test in case of non-parametric data. A p value &lt; 0.05 was considered statistically significant.</p> Results <p>No clinically relevant changes were observed in both experiments for physiological parameters, nociceptive withdrawal reflex thresholds and electroencephalographic variables.</p> Conclusions <p>Methylphenidate does not shorten or modify anaesthesia recovery in pigs, when the sole propofol is administered.</p>","author":"Alessandro Mirra","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c31c0407f35aabfa0cb53ea256d3698e76cbb3516bc22b82c7fd809d228b0d34","category":"Interdisciplinary"}