{"title":"Out of the frying pan into the fire: Predicted warming in alpine streams suggests hidden consequences for aquatic ectotherms","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17364?af=R","date":1718175600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ef7a6584-510c-49f8-bb2f-ad853592974a/gcb17364-toc-0001-m.png\" alt=\"Out of the frying pan into the fire: Predicted warming in alpine streams suggests hidden consequences for aquatic ectotherms\" />\n<p>We modelled water temperatures and calculated cumulative degree days (CDDs) in an alpine stream catchment under current and two future climate scenarios. Our models predict that the rate and total amount of degree day accumulation will increase, water temperatures will become more homogeneous across the landscape, and specific CDDs will occur earlier in the season. CDDs that currently occur toward the end of autumn, when air temperatures are cold, are likely to arrive in summer under future climates, when air temperatures may be upwards of 12°C warmer; potentially impacting ecological processes that are intricately linked with CDDs.</p>\n<br />\n<h2>Abstract</h2>\n<p>Thermal regimes of aquatic ecosystems are predicted to change as climate warming progresses over the next century, with high-latitude and high-elevation regions predicted to be particularly impacted. Here, we have modelled alpine stream water temperatures from air temperature data and used future predicted air temperature trajectories (representative concentration pathway [rcp] 4.5 and 8.5) to predict future water temperatures. Modelled stream water temperatures have been used to calculate cumulative degree days (CDDs) under current and future climate conditions. These calculations show that degree days will accumulate more rapidly under the future climate scenarios, and with a stronger effect for higher CDD values (e.g., rcp 4.5: 18–28 days earlier [CDD = 500]; 42–55 days earlier [CDD = 2000]). Changes to the time to achieve specific CDDs may have profound and unexpected consequences for alpine ecosystems. Our calculations show that while the effect of increased CDDs may be relatively small for organisms that emerge in spring–summer, the effects for organisms emerging in late summer–autumn may be substantial. For these organisms, the air temperatures experienced upon emergence could reach 9°C (rcp 4.5) or 12°C (rcp 8.5) higher than under current climate conditions, likely impacting on the metabolism of adults, the availability of resources, including food and suitable oviposition habitat, and reproductive success. Given that the movement of aquatic fauna to the terrestrial environment represents an important flux of energy and nutrients, differential changes in the time periods to achieve CDDs for aquatic and terrestrial fauna may de-couple existing predator–prey interactions.</p>","author":"M. E. Shackleton, \nA. R. Siebers, \nP. J. Suter, \nO. Lines, \nA. Holland, \nJ. W. Morgan, \nE. Silvester","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"c3243fd504543614dc7e177922c500d746030991d84f3cd5103cfed02754fbeb","category":"Environment"}