{"title":"Abiotic origins of self‐organized ridge‐runnel patterns on tidal flats","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12581?af=R","date":1718718951000,"content":"<h2>Abstract</h2>\n<p>Striking large-scale spatial patterns in ecosystems, generated by self-organization through biotic and abiotic feedback processes, influence ecosystem functioning and response to global environmental change. A remarkable example of this are the regular ridge-runnel patterns found on tidal flats, which play an important role in mudflat-marsh transitions. Yet the mechanisms driving their formation, and whether they are abiotic or biotic in origin, have not been elucidated. The underlying mechanisms are unraveled in this study through a combination of field measurements and targeted laboratory experiments. In the field, we find that on the ridges of the pattern, the sediment bed level is less dynamic and more resistant to erosion than in the runnels. In laboratory flume experiments, we find that erosion-resistant surfaces, like those found on the ridges, can arise on time scales of hours to days due to the drying of the cohesive sediment bed, while this is prevented in waterlogged sediments in runnels. A disturbance-recovery experiment on benthic algae then confirms that biological processes require a longer developmental period than the time scale at which we have observed drying-induced erosion resistance to develop. Together, these results demonstrate that ridge-runnel patterns begin from an abiotic initiation point that can subsequently provide a template for further biological establishment and self-organization. Recognition of abiotic processes as catalysts of self-organization can improve our understanding of ecosystem responses to environmental changes.</p>","author":"Gregory S. Fivash, \nMarte M. Stoorvogel, \nJaco C. de Smit, \nFloris van Rees, \nJeroen van Dalen, \nTim J. Grandjean, \nRoeland C. van de Vijsel, \nTjeerd J. Bouma, \nStijn Temmerman, \nJim van Belzen","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"c3261240b42e89d10588277d8d84d3c8ee5067d4ffb4024311aaa9ed9a7fbab7","category":"Environment"}