{"title":"Attitudes towards advance care planning amongst community-based older people in England","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306810","date":1724248800000,"content":"<p>by Sara Spear, Ed Little, Alan Tapp, Clive Nancarrow, Yvette Morey, Stella Warren, Julia Verne</p>\r\nBackground <p>Advance care planning has been advocated as a way for people to have their wishes recorded and respected in relation to types of treatment and place of care. However, uptake in England remains low.</p> Aims <p>To examine the views of older, well, adults towards Advance Care Plans (ACPs) and planning for end-of-life care, in order to inform national policy decisions.</p> Methods <p>A mixed methods approach was adopted, involving individual and mini-group qualitative interviews (n = 76, ages 45–85), followed by a quantitative survey (n = 2294, age 55+). The quantitative sample was based on quotas in age, gender, region, socio-economic grade, and ethnicity, combined with light weighting to ensure the findings were representative of England.</p> Results <p>Knowledge and understanding of advance care planning was low, with only 1% of survey respondents reporting they had completed an ACP for themselves. Common reasons for not putting wishes into writing were not wanting/needing to think about it now, the unpredictability of the future, trusting family/friends to make decisions, and financial resources limiting real choice.</p> Conclusion <p>Whilst advance care planning is seen as a good idea in theory by older, well, adults living in the community, there is considerable reticence in practice. This raises questions over the current, national policy position in England, on the importance of written ACPs. We propose that policy should instead focus on encouraging ongoing conversations between individuals and all those (potentially) involved in their care, about what is important to them, and on ensuring there are adequate resources in community networks and health and social care systems, to be responsive to changing needs.</p>","author":"Sara Spear","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c3328c24dff9d9faabdc540690768d385ae2a280a0f07f27577d249aa95c83e0","category":"Interdisciplinary"}