{"title":"iFixit tells the sad story of how Samsung “ruined” its upcycling program","link":"https://arstechnica.com/?p=1767078","date":1621873594000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/11-1-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/11-1.jpg\">Enlarge</a> <span>/</span> iFixit appears in Samsung's original upcycling video.  (credit: <a href=\"https://www.youtube.com/watch?v=Z9ujIbdi33g\">Samsung</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Lost in the hubbub of Google I/O last week was <a href=\"https://www.ifixit.com/News/50450/samsung-galaxy-upcycling-unlocked-smartphone-smarthome-project\">this blog post</a> from Kevin Purdy of iFixit, which tells the inside story of how Samsung announced a \"revolutionary\" upcycling program in 2017, delayed it for years, and eventually gutted it before shipping a pale imitation of the original idea. iFixit was actually involved in the initial 2017 announcement, and the repair outfit says that after endorsing the original idea with its brand and stamp of approval, Samsung never delivered on its promises.</p>\n<p>Despite the 2017 announcement of an upcycling program, the code didn't ship until April 2021, when Samsung finally launched a beta version of \"<a href=\"https://arstechnica.com/gadgets/2021/04/samsung-starts-official-smartphone-upcycling-program/\">Galaxy Upcycling at Home</a>.\" This program lets users turn end-of-life Samsung phones into smart home sensors that could be paired with Samsung's SmartThings ecosystem. In our launch coverage of Galaxy Upcycling at Home, we called it \"a very modest starting point.\" It was nice to see Samsung thinking about the piles of e-waste it dumps into the world, so we tried to be nice, but turning a many-hundred-dollar phone into a light sensor or sound sensor seemed like a waste.</p>\n<p>We also hoped that the program would dramatically expand, say, by allowing users to unlock the bootloaders of devices Samsung decided to no longer support so that the community could keep them running and relevant. The Raspberry Pi is a good benchmark for what an open device can be like, with thousands of uses and a ton of custom-build operating systems. A retired smartphone could easily match this functionality, plus it has a touchscreen, speakers, a battery, and usually more horsepower than a Pi.</p></div><p><a href=\"https://arstechnica.com/?p=1767078#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767078&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c3414a6808e14c202ea8a575e37e98620ee08e5cc998a80a173db8e450918196","category":"Tech"}