{"title":"How to Use Your WhatsApp Account Across Multiple Phones","link":"https://www.macrumors.com/how-to/use-whatsapp-account-multiple-phones/","date":1683895670000,"content":"Previously, WhatsApp has allowed users of the encrypted messaging platform to link up to four devices to their account, but only one of those devices could be a smartphone.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Whatsapp-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nHappily, that's now changed, and WhatsApp has introduced the ability to use the same account on multiple phones. So now you can link another phone as one of up to four additional devices, the same as when you link with WhatsApp on web browsers, tablets, and desktops.\r<br />\n\r<br />\nWhether it's an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or an Android phone you choose to add, each linked phone connects to WhatsApp independently, ensuring that your personal messages, media, and calls are end-to-end encrypted. Just be aware that if your primary phone is inactive for a long period of time, you will be automatically logged out of all your companion devices.\r<br />\n\r<br />\nFollow the steps below to set up your additional phone with your WhatsApp account, after which you'll be able to switch between phones without signing out and pick up your chats where you left off. \r<br />\n<ol><li><a href=\"https://apps.apple.com/app/whatsapp-messenger/id310633997\">Download</a> and launch WhatsApp on the additional phone you want to use.</li>\r<br />\n<li>\r<br />\n</li><li>Instead of entering the phone number associated with your WhatsApp account, tap the <strong>Link to existing account</strong> option to generate a QR code.</li>\r<br />\n<li>On your primary phone, open WhatsApp and go to <strong>Settings -&gt; Linked Devices</strong>.</li>\r<br />\n<li>Tap the <strong>Link a device</strong> option and scan the QR code using your phone's camera.</li></ol>It's as simple as that. Once the QR code is scanned and the sync is complete, you'll be able to see all the conversations that you've ‌had on your original phone. You'll also have the ability to send and receive text and voice-based messages, get involved in group chats, and have access to all of the other things that you're used to doing on your ‌primary phone, just now on your companion phone as well.<div>Tag: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/use-whatsapp-account-multiple-phones/\">How to Use Your WhatsApp Account Across Multiple Phones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-to-use-your-whatsapp-account-across-multiple-phones.2389343/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c34afd280ee69265f79fbcf8f4bd4d8dac91931c998b7f7954e0d9e3d6bf3416","category":"Apple"}