{"title":"NVIDIA รายงานผลประกอบการไตรมาส รายได้โต 3 เท่า ทำสถิติสูงสุดบริษัท ตามความต้องการชิป AI","link":"https://www.blognone.com/node/136875","date":1700614382000,"content":"<div><div><div><p>NVIDIA รายงานผลประกอบการของไตรมาสที่ 3 ตามปีการเงินบริษัท 2024 สิ้นสุดวันที่ 29 ตุลาคม 2023 รายได้รวม 18,120 ล้านดอลลาร์ เพิ่มขึ้น 206% เมื่อเทียบกับไตรมาสเดียวกันในปีก่อน และเพิ่มขึ้น 34% เมื่อเทียบกับไตรมาสก่อนหน้านี้ เป็นสถิติสูงสุดของบริษัทในไตรมาสเดียว มีกำไรสุทธิอยู่ที่ 9,243 ล้านดอลลาร์</p>\n<p>Jensen Huang ซีอีโอ NVIDIA กล่าวว่าการเติบโตที่แข็งแกร่งนี้สะท้อนว่า ทั้งอุตสาหกรรมได้เปลี่ยนผ่านมาใช้การประมวลผลด้วยจีพียูและใช้ Generative AI มากขึ้น สิ่งที่เราเห็นตอนนี้อย่างสตาร์ทอัพด้าน LLM, เทคโนโลยีในบริการบนอินเทอร์เน็ต และคลาวด์ เป็นการเริ่มต้นแรก ในยุคถัดไปจะมีทั้งคลาวด์ AI สำหรับแต่ละท้องถิ่น, บริษัทพัฒนาซอฟต์แวร์จะใช้ AI ช่วยทำงานมากขึ้น และองค์กรจะนำ AI มาช่วยทำงานมากขึ้น ซึ่งฮาร์ดแวร์แลพแพลตฟอร์มของ NVIDIA คือพื้นฐานที่รองรับการเติบโตนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2be1fc661efc00bf47a7f799d60ee532.png\" /></p>\n<p>รายได้แยกตามกลุ่มธุรกิจที่สำคัญ กลุ่ม Data Center เติบโตโดดเด่นทำสถิติตามคาด เพิ่มขึ้น 279% เป็น 14,514 ล้านดอลลาร์ จากสินค้าและบริการใหม่ที่เปิดตัวในช่วงที่ผ่านมา ส่วนกลุ่ม Gaming 2,856 ล้านดอลลาร์ เพิ่มขึ้น 15%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f1666946238e0188e98bd3f71b8c54e2.png\" /></p>\n<p>Colette Kress ซีเอฟโอ NVIDIA ให้ข้อมูลเพิ่มเติมกับนักวิเคราะห์ถึงผลกระทบที่สหรัฐฯ <a href=\"https://www.blognone.com/node/136386\">สั่งแบนการส่งออกชิป AI</a> ไปจีน มีผลตั้งแต่เดือนตุลาคม ว่ารายได้ส่วนนี้ย่อมลดลงอย่างมีนัยยะสำคัญ รวมทั้งลดลงมากกว่าการเติบโตที่แข็งแกร่งจากภูมิภาคอื่นรวมกัน ตอนนี้ NVIDIA กำลังทำงานร่วมกับลูกค้าทั้งในตะวันออกกลางและจีนบางราย เพื่อขอใบอนุญาตเป็นกรณี รวมถึงสร้างศูนย์ข้อมูลที่ลดการขอใบอนุญาต</p>\n<p>ที่มา: <a href=\"https://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-third-quarter-fiscal-2024\">NVIDIA</a> และ <a href=\"https://www.cnbc.com/2023/11/21/nvidia-nvda-q3-earnings-report-2024.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nvidia\">NVIDIA</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c3515c45b7dc28f49d25672e9df4155167eea6e4c1034778cd2a1b9bbb0b06d0","category":"Thai"}