{"title":"δ13C of bulk organic matter and cellulose reveal post-photosynthetic fractionation during ontogeny in C4 grass leaves","link":"https://academic.oup.com/jxb/article/75/5/1451/7378313?rss=1","date":1699315200000,"content":"<span><div>Abstract</div>The <sup>13</sup>C isotope composition (δ<sup>13</sup>C) of leaf dry matter is a useful tool for physiological and ecological studies. However, how post-photosynthetic fractionation associated with respiration and carbon export influences δ<sup>13</sup>C remains uncertain. We investigated the effects of post-photosynthetic fractionation on δ<sup>13</sup>C of mature leaves of <span>Cleistogenes squarrosa</span>, a perennial C<sub>4</sub> grass, in controlled experiments with different levels of vapour pressure deficit and nitrogen supply. With increasing leaf age class, the <sup>12</sup>C/<sup>13</sup>C fractionation of leaf organic matter relative to the δ<sup>13</sup>C of atmosphere CO<sub>2</sub> (Δ<sub>DM</sub>) increased while that of cellulose (Δ<sub>cel</sub>) was almost constant. The divergence between Δ<sub>DM</sub> and Δ<sub>cel</sub> increased with leaf age class, with a maximum value of 1.6‰, indicating the accumulation of post-photosynthetic fractionation. Applying a new mass balance model that accounts for respiration and export of photosynthates, we found an apparent <sup>12</sup>C/<sup>13</sup>C fractionation associated with carbon export of –0.5‰ to –1.0‰. Different Δ<sub>DM</sub> among leaves, pseudostems, daughter tillers, and roots indicate that post-photosynthetic fractionation happens at the whole-plant level. Compared with Δ<sub>DM</sub> of old leaves, Δ<sub>DM</sub> of young leaves and Δ<sub>cel</sub> are more reliable proxies for predicting physiological parameters due to the lower sensitivity to post-photosynthetic fractionation and the similar sensitivity in responses to environmental changes.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"c35182024d07bd25c850a80aac08720aeae1ea3cf98b93717aa71feb8664be58","category":"Environment"}