{"title":"Apple PR legend Katie Cotton, who worked closely with Steve Jobs, has died","link":"https://www.macworld.com/article/1781746/apple-pr-legend-katie-cotton-dies.html","date":1681215056000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Katie Cotton, who was Apple’s Vice President of worldwide communications for 18 years until she retired from the company in May 2014, died on April 6. Her <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://obits.lehighvalleylive.com/us/obituaries/etpa/name/kathryn-cotton-obituary?id=51601641&amp;xcust=1-1-1781746-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">obituary</a> states that she passed peacefully “surrounded by family and close friends.” Born in 1965, she was 57 or 58.</p>\n\n\n\n<p>Cotten was well-known as one of the leaders in public relations and marketing, joining Apple in 1996, shortly after the return of Jobs. She was instrumental in shaping Apple’s communications strategy and the culture of secrecy in the company. Cotton was known for her fierce control of how Apple was portrayed by the press and was also the gatekeeper who controlled access to Apple’s late CEO and co-founder Steve Jobs.</p>\n\n\n\n<p>“We’re deeply saddened by Katie’s passing,” Apple said in a statement to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-04-11/katie-cotton-who-led-apple-s-media-strategy-for-18-years-dies#xj4y7vzkg&amp;xcust=1-1-1781746-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Bloomberg</a>. “She was an extraordinary person and she made countless contributions over the course of her two-decade career at Apple. Our thoughts are with her loved ones and everyone who had the opportunity to work with her.” Apple’s current vice president of worldwide communications is Kristin Huguet Quayle, who has been with the company since 2005.</p>\n\n\n\n<p>As Macworld contributor Christopher Breen <a href=\"https://www.macworld.com/article/223338/apple-prs-katie-cotton-departs-what-it-coud-mean-for-the-press.html\">wrote</a> on her retirement back in 2014, Cotton and Apple “largely turned public relations on its head,” with a strategy that saw the company “present products and announcements as special events—which the world at large (and journalists in particular) then clamor to learn more about.” </p>\n\n\n\n<p>Since her retirement, which was to allow her to spend more time with her family, Cotton had been raising awareness for mental health education for children by volunteering in local community organizations. She is survived by her children, Ethan and Isabelle Mimeles, and life partner Jim Wells.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c35473323846682bd0edaee3ec7fa712fe7f2103572bee98a394176cfe271127","category":"Apple"}