{"title":"Assessment of Platelet Aggregation and Thrombin Generation in Patients with Familial Chylomicronemia Syndrome Treated with Volanesorsen: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202407.0557/v1","date":1720422630000,"content":"Background: The antisense oligonucleotide against APOC3 mRNA volanesorsen was recently introduced to treat Familial Chylomicronemia Syndrome (FCS). Cases of decreased platelet count are reported among patients treated with volanesorsen.  The aim of the study is to evaluate platelet function and thrombin generation (TG) assessment in FCS patients receiving volanesorsen. We performed a cross-sectional study on FCS patients treated with volanesorsen. Methods: changes in PLC were assessed from baseline to Tw12 and Tw36. To assess TG, samples were processed by CAT (with PPP-reagent LOW). The results were expressed by the trombogram graphic (thrombin variation over time); lagTime; Endogenous Thormbin Potential(ETP); peak; time to reach peak(ttpeak), startTail e velocity Index. Platelet aggregation was assessed by testing different agonists using turbidimetry method. Results: Four FCS patients and 4 matched healthy controls were included in the present study. Changes in PLC at Tw12 was 30% and 34% at T36w. Thrombin generation results show values in normal range (for patients and controls respectively lagTime:10,42±4,40 and 9,25±0,99; ttPeak:14,33± 4,01 and 13,10±0,67; startTail:32,13±3,54 and 29,46±1,69; velocityIndex:20,21±3,63 and 33,05±13,21; ETP 599,80±73,47 and 900,2±210,99; peak value 76,84±1,07 and 123,30±39,45) and no significant difference between cases and controls. Platelet aggregation test showed values in range with no significant difference with healthy controls Conclusions: Our study showed for the first time that no significant changes in the general haemostasis assessed by TG and in platelet function have been observed in FCS patients receiving volanesorsen.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c3629fa49fdfd9542d2e63da23896affb70020b99c2a2f01257d3b17ca65c9e6","category":"Interdisciplinary"}