{"title":"A systematic review on the level of risk perception of diabetes mellitus: The role of environmental factor","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308152","date":1722348000000,"content":"<p>by Miaw Yn Jane Ling, Norfazilah Ahmad, Azimatun Noor Aizuddin, Mohd Hasni Ja’afar</p>\r\nBackground <p>Risk perception plays important role in motivating preventive health behaviours. The objective of this systematic review was to explore the level of diabetes risk perception among individuals with and without apparent risk for diabetes, and to consider the effect of environmental factors on the level of diabetes risk perception.</p> Methods <p>This systematic review was reported according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. The literature search was carried out through PubMed, Web of Science, and Scopus. Original articles written in English and published between 2013 and 2023 were considered. Study quality was appraised using the Mixed Methods Appraisal Tool. Narrative synthesis was undertaken due to methodological heterogeneity in the included studies.</p> Results <p>A total of 13 cross-sectional studies, two randomized controlled trials, two cohort studies, two mixed methods studies and one quasi-experiment with a control group were included. An overall low level of diabetes risk perception was reported particularly in those without apparent risk for diabetes. The 20 included studies reported widely varied measures for calculating diabetes risk perception. The influence of environmental factors on the risk perception of diabetes was highlighted.</p> Limitations <p>The use of study-specific and non-validated measures in the included studies weakens the authors’ ability to compare across studies. The role of language and publication bias within this systematic review should be acknowledged as we included only English-language studies published in peer-reviewed journals. Another limitation is the exclusion of dimensions of risk perception such as optimistic bias as search terms.</p> Conclusion <p>The overall low risk perception of diabetes calls for urgent need of public health interventions to increase the risk perception of diabetes. In the future, researchers should ensure the validity and reliability of the measures being used. The influence of environmental factors on the diabetes risk perception indicates that diabetes preventive interventions targeting environmental factors may be effective in increasing the risk perception of diabetes.</p>","author":"Miaw Yn Jane Ling","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c367f6185bb37e64d198f2960e659750eb8c74983096eabb94007805416ddc83","category":"Interdisciplinary"}