{"title":"All Bodies on Bikes Teams Up with SBT GRVL To Bring Body Inclusivity Programming to Gravel Racing","link":"https://theradavist.com/2021/11/all-bodies-on-bikes-teams-up-with-sbt-grvl-to-bring-body-inclusivity-programming-to-gravel-racing/?utm_source=rss&utm_medium=rss&utm_campaign=all-bodies-on-bikes-teams-up-with-sbt-grvl-to-bring-body-inclusivity-programming-to-gravel-racing","date":1635874669000,"content":"<p><img src=\"https://media.theradavist.com/uploads/2021/11/90776981-6089-4673-A6F1-F50DB18CBD80.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><a href=\"https://www.instagram.com/marleyblonsky/?hl=en\" target=\"_blank\">Marley Blonsky</a> is using her platform, <a href=\"https://www.allbodiesonbikes.com/\" target=\"_blank\">All Bodies On Bikes</a>, to bring awareness and accessibility to one of America’s most famous gravel events, SBT GRVL. Read on below for a full press release about how you can enter for a chance to win one of fifteen spots for non-traditional athletes…<span></span></p>\n<p>15 Spots will be Reserved for a Cohort of Non-Traditional Athletes who will be Supported in their Preparation and Training</p>\n<p>All Bodies on Bikes, a grassroots group founded by self-proclaimed “fat-cyclist” Marley Blonsky, has teamed up with Colorado’s SBT GRVL race to offer 15 non-traditional athletes a supported <a href=\"https://sbtgrvl.com/\" target=\"_blank\">SBT GRVL</a> weekend adventure.</p>\n<p>SBT GRVL is one of the premiere gravel bike events in the country, featuring some of the finest gravel roads around. The weekend includes an expo with many of the top brands in cycling, opportunities to ride alongside pros during multiple shakedown rides, and a strong focus on advocacy.</p>\n<p>Applications for the program open on Wednesday, Oct. 27th, and close Friday, Nov. 12th at midnight. Selected participants for the 2022 cohort will receive free registration for SBT GRVL 2022 for the distance of their choice (37, 64, 105, or 142 miles). They will be mentored by a cohort of other All Bodies on Bikes athletes, including co-founders Marley Blonsky and Kailey Kornhauser. Leading up to SBT GRVL, athletes will take part in monthly training calls with professional cycling coaches, gravel biking champions, endurance event veterans, and the team behind SBT GRVL. Athletes will participate in an All Bodies on Bikes Panel during the SBT GRVL Expo. All Bodies on Bikes and SBT GRVL will provide optional group housing in Steamboat during the weekend of the event.</p>\n<p><em><strong> About All Bodies on Bikes:</strong> All Bodies on Bikes was founded in 2020 and is a social, educational, and industry-wide movement to create and foster size inclusive bike communities. All Bodies on Bikes envisions a world where anyone, regardless of body size, weight, or perceived fitness level can safely enjoy a bike ride in a way that is joyful to them. To make that vision a reality, All Bodies on Bikes maintains a social community, with a strong presence on Facebook and Instagram, increasing representation of larger bodies in cycling. All Bodies on Bikes hosts social bike rides where everyone is welcome to move their bodies joyfully at a pace that is comfortable and safe for them. To date, we have led 15 rides in 10 cities from coast to coast, with more than 1500 participants. All Bodies on Bikes provides educational resources, consulting, and leadership to the bike industry and cycling community at large on best practices in size inclusive bike communities through workshops, consulting, and educational seminars. All Bodies on Bikes + SBT GRVL is currently seeking sponsorships to help defray the costs associated with travel, equipment, and housing. Please contact Marley for sponsorship or donation inquiries. More information on the program, eligibility guidelines, FAQs and applications are available at <a href=\"https://www.allbodiesonbikes.com/sbtgrvl\" target=\"_blank\">allbodiesonbikes.com/sbtgrvl</a></em></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"c36894e1afb9cf3e56c66f52871774b9bb88666c6823bb3e2f3ae3f799e6c427","category":"Cycling"}