{"title":"Businessweek Cover Story on Apple Under Tim Cook","link":"https://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs","date":1613096920000,"content":"\n<p>Feature story for Businessweek, by Austin Carr and Mark Gurman:</p>\n\n<blockquote>\n  <p>Cook came to Apple in 1998 after a dozen years at IBM Corp. and a six-month stint at Compaq and seemed, at least to old Apple hands, devoid of any obvious personality. He’d work 18‑hour days and send emails all through the night. When he wasn’t at the office he seemed to live at the gym. Unlike Jobs, he had no pretensions to being an artist. “Tim was always pure work: grind, grind, grind, grind,” says one former Apple executive who worked with Cook in his early years at the company and who, as with other sources in this story, spoke on the condition of anonymity because of nondisclosure agreements and fear of corporate reprisals. “I always found him exceptionally boring.”</p>\n</blockquote>\n\n<p><a href=\"/misc/2021/02/bw-cover.jpeg\">The magazine cover</a> is a play on Cook’s obvious contrasts with Steve Jobs: “Here’s to the sensible ones, the team players, the problem solvers, the round pegs in the round holes…”</p>\n\n<p>Is Cook boring, though? His public persona certainly is staid. He’s very rarely knocked off what feel like prepared talking points in his public remarks. And even <a href=\"https://daringfireball.net/linked/2020/12/12/cook-outside\">when he opens up</a>, he doesn’t reveal <em>much</em>. But is he boring, or just so intensely private and self-controlled that he comes across as a bit of a cipher to those who aren’t close to him?</p>\n\n<p>This Businessweek piece is a good report — very fair, and rings true. There’s not much new in it for close followers of Apple, but it’s a good primer for those who aren’t. It ably addresses what I see as Apple’s and Tim Cook’s biggest risk: the almost indescribable scope of the company’s reliance on China for manufacturing. Here’s a bit:</p>\n\n<blockquote>\n  <p>[Foxconn founder Terry] Gou always seemed happy to accommodate,\noften building entire factories to handle whatever minimalist-chic\ndesign specs Apple threw at Foxconn. Jon Rubinstein, a senior vice\npresident for hardware engineering during Jobs’s second tour at\nApple, recalls almost having a heart attack in 2005 when he went\nwith Gou to see a new factory in Shenzhen for the iPod Nano — a\ntiny device 80% smaller than Apple’s original MP3 player — only\nto find an empty field. Within months, though, a large structure\nand production line were in place. “In the U.S. you couldn’t even\nget the permits approved in that time frame,” he says.</p>\n</blockquote>\n\n<div>\n<a  title=\"Permanent link to ‘Businessweek Cover Story on Apple Under Tim Cook’\"  href=\"https://daringfireball.net/linked/2021/02/11/businessweek-apple-cook\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c36c2224431440c4b4cc11335d0a4b2935b8210695b341a014b953b3fc8ea82e","category":"Tech"}