{"title":"อินเทลชนะโครงการ ก.กลาโหมสหรัฐ อุดหนุนเงินสร้างโรงงานผลิตชิปบนแผ่นดินสหรัฐ","link":"https://www.blognone.com/node/124382","date":1629774807000,"content":"<div><div><div><p>อินเทล ชนะการคัดเลือกโครงการของกระทรวงกลาโหมสหรัฐ (Department of Defense) ที่ต้องการสร้างโรงงานผลิตเซมิคอนดักเตอร์บนแผ่นดินสหรัฐอเมริกา</p>\n<p>โครงการนี้มีชื่อว่า <a href=\"https://nstxl.org/opportunity/rapid-assured-microelectronics-prototypes-commercial-ramp-c/\">Rapid Assured Microelectronics Prototypes - Commercial (RAMP-C)</a> เป็นการผลักดันให้เกิด ecosystem ของการผลิตชิปเชิงพาณิชย์ในสหรัฐอเมริกา ตาม<a href=\"https://www.blognone.com/node/122144\">นโยบายของรัฐบาลโจ ไบเดน ที่ต้องการดึงโรงงานผลิตชิปกลับมายังสหรัฐ</a> แก้ปัญหาทั้งความมั่นคงเรื่องซัพพลายเชน และแก้ปัญหาชิปขาดตลาด</p>\n<p>แนวคิดของโครงการ RAMP-C คือ กระทรวงกลาโหมสหรัฐต้องการจ้างโรงงานผลิตชิปที่อยู่บนแผ่นดินสหรัฐ (on-shore) ที่สามารถผลิตชิปขนาดเล็กกว่า 7 นาโนเมตร ซึ่งปัจจุบันไม่มีโรงงานผลิตชิปแบบนี้อยู่ในสหรัฐเลย เหตุเพราะบริษัทเซมิคอนดักเตอร์สัญชาติอเมริกันเกือบทั้งหมดเป็นแบบ fabless แล้ว ส่วนโรงงานที่มีเหลืออยู่ ก็ไม่ได้มีเทคโนโลยีก้าวหน้าที่สุดในโลก อย่างโรงงานของอินเทลก็เองยังทำได้แค่ 10 นาโนเมตรเท่านั้น</p>\n<p>ทางออกจึงเป็นการสนับสนุนเงินจากภาครัฐ เพื่อให้เกิดโรงงานผลิตชิปเชิงพาณิชย์ลักษณะนี้ ซึ่งอินเทลเป็นผู้ชนะของโครงการ RAMP-C นี้</p>\n<p>อินเทลจะใช้ธุรกิจโรงงานรับจ้างผลิตชิป Intel Foundry Services มารับงานนี้ โดยจับมือกับพาร์ทเนอร์คือ IBM, Cadence, Synopsys และ<a href=\"https://www.blognone.com/node/123907\">ใช้เทคโนโลยีการผลิตระดับอังสตรอม Intel 18A ตามที่เคยประกาศไว้</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/99be2a2da9cb28e0ffba1357b712679f.jpg\" /></p>\n<p>ภาพโรงงานใหม่ล่าสุดของอินเทล Fab 42 ที่แอริโซนา</p>\n<p>ที่มา - <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/intel-wins-us-project-develop-foundry-ecosystem.html\">Intel</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div><div><a href=\"/topics/military\">Military</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c373bb9498305b4be0550b1db7a7ef8c0947950a1cb0027a0f133c759ca456b9","category":"Thai"}