{"title":"Predicting the Electrical Conductivity of Partially Saturated Frozen Porous Media, a Fractal Model for Wide Ranges of Temperature and Salinity","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034845?af=R","date":1711367072000,"content":"<h2>Abstract</h2>\n<p>The quantitative determination of liquid water content and salinity in soils is crucial for the preservation of hydrological environments and engineering infrastructures, especially in frozen regions. Electrical conductivity, as a fundamental physical parameter in electrical and electromagnetic non-destructive techniques, varies significantly with the physical and chemical properties, such as pore water conductivity, salinity, water saturation, and temperature. In this study, accounting for pore size and tortuous length following fractal distributions, we develop a new capillary bundle model for variation of electrical conductivity as a function of temperature in broad water saturation and salinity ranges. In this new model, we consider the contributions of bulk and surface conductivities to the total electrical conductivity. To test this model, a series of laboratory experiments were carried out for different initial water saturations and salinities using an electrical resistance apparatus and a nuclear magnetic resonance method. The experimental results show that unfrozen water saturation and ionic concentration affect the electrical conductivity of unsaturated frozen soils. Furthermore, the proposed model is capable of fitting the main trends of the experimental data from the literature and acquired in this study in unfrozen-frozen conditions for different water contents. Relying on the proposed model, we also determine the expression of the apparent formation factor, which is significantly sensitive to porosity, water saturation, and temperature. The predicted values of the apparent formation factor also agree very well with the experimental data. This new capillary bundle model provides a new perspective in interpreting electrical monitoring to easily deduce changes in key variables in the cryosphere such as liquid water content and moisture gradients.</p>","author":"Haoliang Luo, \nDamien Jougnot, \nAnne Jost, \nJidong Teng, \nAida Mendieta, \nGang Lin, \nLuong Duy Thanh","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"c37388da315340f7395abf86a8b3e47def926ea6bf2ec57dbe95aa8628f21750","category":"Environment"}