{"title":"[WSJ] พบพฤติกรรมใหม่ ผู้ค้าใน Amazon ส่งอีเมลซ้ำๆ มากดดันลูกค้าที่รีวิวแย่ให้ลบรีวิวออก","link":"https://www.blognone.com/node/124129","date":1628494894000,"content":"<div><div><div><p>Wall Street Journal รายงานเผยให้เห็นพฤติกรรมใหม่ของผู้ค้าขายบน Amazon มีการติดต่อกับลูกค้าที่ให้รีวิวแย่ผ่านอีเมล เพื่อเสนอข้อแลกเปลี่ยน หรือเงินคืนเพื่อแลกกับการลบรีวิวออก และถ้าไม่ลบ ทางผู้ค้าก็จะส่งอีเมลมาอีกเรื่อยๆ</p>\n<p>WSJ ได้สัมภาษณ์หนึ่งในผู้ที่ได้รับผลกระทบคือ Katherine Scott เธอเล่าให้ฟังว่า เธอเขียนรีวิววิจารณ์สเปรย์น้ำมันสำหรับใช้ในครัวเพราะไม่มีประสิทธิภาพอย่างที่โฆษณาไว้ หนึ่งสัปดาห์ต่อมา มีคนอ้างว่าเป็นตัวแทนฝ่ายบริการลูกค้าจากผู้ขายติดต่อทางอีเมลเพื่อเสนอเงินคืนแลกกับการลบรีวิวของเธอ</p>\n<p>ในอีเมลยังบอกด้วยว่า เรายินดีคืนเงินเต็มจำนวน เมื่อเราไม่ได้รับการตอบกลับ เราจะถือว่าคุณไม่เห็นมัน และจะส่งอีเมลต่อไป และเราหวังว่าคุณจะพิจารณาการลบความคิดเห็นนั้นๆ ส่วนผู้ที่ได้รับผลกระทบคนอื่นให้สัมภาษณ์ไปในทางเดียวกันว่า ร้านค้าเสนอเงินให้ 20-30 ดอลลาร์เพื่อให้ลบรีวิว หลายๆ ครั้งเงินที่เสนอให้ก็มากกว่าราคาสินค้าแล้ว และยังคงใช้พฤติกรรมส่งอีเมลมากดดันซ้ำๆ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/762eaed8cbaca32f28bb680153b6cafb.png\" /><br />\nภาพประกอบจาก <a href=\"https://www.aboutamazon.com/news/retail/top-selling-items-on-amazon-in-2021-reflect-a-shifting-america\">Amazon</a></p>\n<p>WSJ รายงานเรื่องของ Katherine Scott ไปยัง Amazon ก็พบว่าทั้งแบรนด์หายไปจากหน้า Amazon แล้ว</p>\n<p>นโยบาย Amazon ระบุเรื่องการแชร์ข้อมูลกับผู้ค้าภายนอกว่า Amazon จะเผยแพร่เฉพาะข้อมูลส่วนบุคคลของลูกค้าที่เกี่ยวข้องกับธุรกรรมเหล่านั้น เฉพาะผู้ขายที่ผ่านการรับรอง จะสามารถใช้บริการส่งข้อความระหว่างผู้ซื้อและผู้ขายได้ แต่ใช้เป็นที่อยู่อีเมลเข้ารหัสแทน ไม่ใช้ชื่ออีเมลตรงๆ ของลูกค้า</p>\n<p>ส่วนวิธีที่ผู้ค้าภายนอกได้อีเมลลูกค้ามานั้น คาดว่ามาจากบริษัทที่มีบริการค้นหาอีเมลโดยเฉพาะ หนึ่งในบริษัทที่ WSJ พบว่ามีบริการลักษณะนี้คือ Matic Chain มีบริการแยกอีเมลสำหรับผู้ขายของ Amazon โดยเฉพาะ อีกบริษัทคือ ZonBoost ที่โฆษณาบนหน้าเว็บของตัวเองว่ามีระบบ Reviewer Lookup หรือค้นหาอีเมลของผู้เขียนรีวิวบน Amazon เลยทีเดียว</p>\n<p>หากใครพบพฤติกรรมดังกล่าว ทาง Amazon แนะนำให้เขียนอีเมลมาร้องเรียนที่ help@amazon.com หรือคลิก Report Abuse ที่หน้าร้านค้า</p>\n<p>ที่มา - <a href=\"https://gizmodo.com/heres-how-amazon-third-party-sellers-reportedly-hound-c-1847446648\">Gizmodo</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c379e25f700a55adf5ff2d5a114e029ae5804f109e7271c5074ead9f27faaa7c","category":"Thai"}