{"title":"Density-dependent habitat selection and warming determine the spatial distribution of haddock (Melanogrammus aeglefinus) on Georges Bank","link":"https://academic.oup.com/icesjms/article/81/5/961/7650027?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>In an ever-changing environment, detecting shifts in the spatial distribution of marine fish and understanding the relative importance of climate change and biotic factors impacting fish distributions can improve fisheries management. Coincident with the significant increase in Haddock (<span>Melanogrammus aeglefinus</span>) abundance to a historically high levels on Georges Bank (GB) in the last decade, extreme ocean temperature increase was also observed in this region. In this study, the possible seasonal and inter-annual spatial distribution changes of haddock were investigated with &gt;50 years of bottom trawl survey data collected in spring and fall on GB. These data were analyzed using models with spatial, different temporal, and spatio-temporal autocorrelation structures. To characterize the directional changes in haddock spatial distribution, the Center of Gravity (CG) and Area of Occupancy (AO) in each season were estimated from the best model selected by Akaike Information Criteria (AIC). The results showed substantial range expansion/contraction and distribution changes in both spring and fall over time. The relative role of density dependence, age structure, and climate change in affecting haddock distribution was evaluated using a generalized additive model (GAM). It was found that density-dependent habitat selection made the greatest contribution to the variations of AO in both seasons, which is consistent with the MacCall’s Basin model theory. Rising ocean temperatures played a major role in shaping a northward distribution shift in fall. GB is the southern edge of haddock distribution in the Northwest Atlantic, continued warming from climate model projections in the next 50 years in this region could make it difficult to define stock boundaries between GB and adjacent Canadian and US domestic management areas. This would subsequently impact fishery management of haddock.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"c37984f9be47a63dffcdb2921f7ac2df11821f264b13ce149853c9fbbb0f90a7","category":"Environment"}