{"title":"Pro to parent: The e-bike does it all","link":"https://www.cyclist.co.uk/sponsored/9767/pro-to-parent-the-e-bike-does-it-all","date":1624021465000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>18 Jun 2021</span></div>    </div></div><p>\nTracy Moseley is a decorated downhill mountain bike racer and an enthusiastic e-bike advocate, for both pro and personal reasons</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/bosch_advertorial_01.jpg?itok=0S-EpIbi\" />  </div>\n<div>\n      <p> <strong>Tracy Moseley is a decorated racer on the downhill mountain biking circuit – and an enthusiastic advocate for the e-bike, for both pro and personal reasons. Here she explains why</strong></p>\n<p>There are few mountain bike riders with as busy a trophy cabinet as Tracy Moseley.</p>\n<p>Owing to mountain biking’s criminally low profile in the UK, she may not be a household name, but be assured that to chalk up four Downhill and Enduro World titles is a superhuman feat that takes both physical and mental determination along with a truck load of bravery.</p>\n<p>To put it into a sporting context, Tracy’s run on the podiums of cycling is akin to Michael Schumacher’s Formula One reputation or the multi-year heroics of track cyclist Chris Hoy.</p>\n<p>Except in Tracy’s case the track was often littered with obstacles and so unpredictable that most of us wouldn’t dare set foot on it, let alone take it at unnerving speed on two wheels.</p>\n<h3>New power generation</h3>\n<p>For most of Tracy’s professional career, which began in 1995, the electric bike wasn’t widely available or used.</p>\n<p>With her record of racking up podium finishes it’s unlikely she would ever have needed the assistance of an electric motor, but today she is Trek’s ambassador for pedal-assisted bikes.</p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/06/bosch_advertorial_02.jpg\" />  </div>\n</div>\n<p>Why take such an active role in promoting the e-bike?</p>\n<p>‘It was 2017 or thereabouts that the intrigue set in and I wanted to try the e-bike,’ she says.</p>\n<p>‘A lot of people around the industry had negativity towards them, even as late as that – but when the 29in wheel arrived people similarly asked, “What do we need this for?”</p>\n<p>‘I was one of the first to race a 29er and there was horror at the time, but I think you can’t knock things until you try it. The 29in wheel we now know is a hit – as are e-bikes.’</p>\n<p>The catalyst for greater electric bike use was Tracy’s career break during her pregnancy in 2017 to 2018.</p>\n<p>While there was professional interest on the track before that, the lightbulb moment, she says, came during that period where her fitness regime – not to mention her willpower to get out – was restricted.</p>\n<p>‘It was amazing to have the Bosch CX motor as an option in my bike collection for the latter part of my pregnancy,’ she says now.</p>\n<p>‘The Trek Rail e-bike I have enabled me to get around by bike and, sometimes, to feel that I could get up on the hillside to get some fresh air.’</p>\n<p>After her son, Toby, was born, Tracy returned to competition with the first e-bike world championships in 2019.</p>\n<p>‘Then last year I competed in my first Enduro world series e-bike race too,’’ she says. ‘As my sponsor Trek was keen to have race representation and someone to help steer the e-bike racing ship. Since my experience has been so positive that’s been my role – to shape the sport.’</p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/06/bosch_advertorial_03.jpg\" />  </div>\n</div>\n<p>But it’s not the sport side that really excites Tracy as much as it is the broader potential of the electric bike to help more people experience the highs that are often just out of reach.</p>\n<p>Having an e-bike has helped Tracy stay active while balancing her other full-time job of parenthood.</p>\n<p>‘For my current lifestyle time management is key. Often I only have an hour to squeeze in a decent ride and with the e-bike I can make that happen.</p>\n<p>‘That’s been the most amazing thing, to remove the doubt about whether it’s worth getting out.</p>\n<p>‘I also now take Toby to and from nursery by e-bike,’ she adds. ‘He sits on the front in his seat. That is incredible for family adventures too.’</p>\n<p>Tracy also tends to hop on the e-bike for local shopping trips. ‘I go everywhere I can by e-bike, certainly any distance that it is possible not to drive. I wouldn’t have chosen to do so many journeys this way before.’</p>\n<h3>Forever young</h3>\n<p>As a new mum Tracy found the power assistance of an e-bike made it easier to rebuild strength, as well as to find the motivation when the energy levels were low – issues to which many new parents will be able to relate.</p>\n<p>But the accessibility of an e-bike will help anyone to enjoy the outdoors and make the most of active mobility.</p>\n<p>In fact, in her role as an ambassador for Trek Tracy has seen all types of people, of all ages, slot an e-bike into their lifestyles.</p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/06/bosch_advertorial_04.jpg\" />  </div>\n</div>\n<p>That includes a group you might not think of as e-bike riders: children – although kids’ e-bikes have been a surprisingly controversial topic.</p>\n<p>‘Like many others when I first saw e-bikes for kids I thought it was wrong. My thoughts were that kids should get the most exercise possible.</p>\n<p>‘Yet I have begun to see a place for it. For the family unit, that assistance gives them the chance to experience more. They can enjoy a 10km instead of 5km ride and still maintain some strength.</p>\n<p>‘If we can get Toby to the top of a big hill, for him it would be a big achievement – and it’s amazing as a day out.’</p>\n<p>Of course the weight of an e-bike is not ideal for kids, so parents should be prepared to help them and guide their use of the controls on the flats before taking on adventures.</p>\n<p>That, says Tracy, applies to any adults who are new to e-bikes too. Her advice is to get to grips with a new bike on familiar terrain on the first few rides.</p>\n<p>‘As much as many enjoy that full-power feeling, I recommend not going straight to turbo,’ she says. ‘Learn to control lower power modes. Bosch’s computers are really easy to get to grips with.</p>\n<p>‘Make sure you can stop and start comfortably on steep terrain. That first pedal stroke can lurch if you go straight for the turbo, so start lower and work your way up on motor feel.</p>\n<p>‘From there, build your speed in comparison to your ability. That’s really important. Be aware you are on an e-bike, so on average you’ll be going a bit faster.</p>\n<p>‘With that in mind, be aware how that feels to other trail users – you may be going faster than people expect. And be courteous. Everyone deserves to enjoy the outside space.’</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/06/bosch_advertorial_05.jpg\" />  </div>\n</div>\n<h3>Increased coverage</h3>\n<p>Because she knows a thing or two about going fast, we ask Tracy what changes the e-bike has brought to the pro circuit.</p>\n<p>While the obvious training perks of getting more laps in go without saying, it is the people off-track who she believes may have gained the most.</p>\n<p>‘There is a big increase in professionals off-track using the bikes to cover races, such as photographers who just couldn’t cover the same ground previously, so it’s become a really useful tool to many workers,’ she points out.</p>\n<p>‘It makes 100% sense for those guys. They can get ahead of racers now and it’s incredible what they achieve. What’s more, they physically finish the day in better shape.</p>\n<p>‘Why wouldn’t you take that advantage? It’s not like you’re cheating, it’s just a better tool for the job,’</p>\n<p>Bike design has come on leaps and bounds in the time since Tracy began racing.</p>\n<p>The advent of 1x drivetrains has in turn allowed improvements in frame design, which in turn has opened the door for vastly improved mid-motor electric bike design and Bosch has been at the forefront of that technological innovation.</p>\n<p>Geometries have changed and are now often longer, lower and slacker, giving a more planted feel on the trail. If you place a modern mountain bike alongside a build of the late 90s, the differences are stark.</p>\n<p>So as someone of that vintage, to what extent does Tracy think adding pedal assistance has improved the experience for the rider?</p>\n<p>In fact, Tracy admits, it might actually be an electric bike race that gave her one of the most memorable (and previously unattainable) experiences.</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/06/bosch_advertorial_06.jpg\" />  </div>\n</div>\n<p>‘I rode a three-day e-bike race in August 2019 . It was the most epic thing ever. We started and finished in Verbier, but the ride allowed us four batteries a day and you carried one with you in a backpack.</p>\n<p>‘That, I will admit, is heavy when we were covering 100km a day, with 5,000m of climbing to boot! This was the first time I had ascended alpine terrain on an e-bike and it was amazing how far each battery went considering the significant elevation.</p>\n<p>‘Some of the stuff we climbed was so steep and technical, but the ability of the e-bike was incredible. We quickly learned techniques on the go to stop the front wheel lifting on steep sections.</p>\n<p>‘That was a real test of what’s possible and it was hugely tiring despite the assistance, so we got our workouts – but what a ride.’</p>\n<h3>Positive outcomes</h3>\n<p>Despite Tracy’s long and glittering career, there is a sense that her work as an e-bike ambassador for Trek is returning some of the most positive experiences yet – not least because it allows her the opportunity to give others some of the very same joy she has experienced on two wheels.</p>\n<p>She concludes: ‘The biggest thing is seeing how an e-bike allows people to connect again with the outdoors and with friends who are perhaps already cyclists, or just fitter.</p>\n<p>‘It allows them to do something together, removing so many barriers. For the non-cyclist to experience the same things I have, that’s what I love to see.’</p>\n<p>• <strong><a href=\"https://www.bosch-ebike.com/en/\" target=\"_blank\">Click here for more information on Bosch eBike Systems</a></strong><span> </span> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/e-bikes\">E-bikes</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"c37a224a296c54bfa71c23236f3b72178f211690f20b64337377a90bd5b8e1a5","category":"Cycling"}