{"title":"Gravitational lens gives us a third estimate of the Universe’s expansion","link":"https://arstechnica.com/?p=1939056","date":1683919911000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/image-4.jpeg\" alt=\"Image of a field full of stars and galaxies\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/image-4.jpeg\">Enlarge</a> <span>/</span> The arc of thin, distorted objects around the center of this image is a clear indication of gravitational lensing. (credit: <a href=\"https://twin-cities.umn.edu/news-events/first-its-kind-measurement-universes-expansion-rate-weighs-longstanding-astronomy\">Patrick Kelly, University of Minnesota</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Anyone who has ever measured something twice, like the width of a doorway, and gotten two different answers knows how annoying it can be. Now imagine you're a physicist, and what you're measuring tells us something fundamental about the Universe. There are a number of examples like this—we can't seem to get measurements to agree on <a href=\"https://arstechnica.com/science/2018/05/how-long-can-a-neutron-survive-outside-an-atom/\">how long neutrons survive</a> outside of atomic nuclei, for example.</p>\n<p>But few of these are more fundamental to the Universe's behavior as disagreements over what's called the <a href=\"https://en.wikipedia.org/wiki/Hubble%27s_law\">Hubble Constant</a>, a measure of how quickly the Universe is expanding. We've measured it using information in the cosmic microwave background and gotten one value. And we've measured it using the apparent distance to objects in the present-day Universe and gotten a value that differs by about 10 percent. As far as anyone can tell, there's nothing wrong with either measurement, and there's no obvious way to get them to agree.</p>\n<p>Now, researchers have managed to make a third, independent measure of the Universe's expansion by tracking the behavior of a gravitationally lensed supernova. When first discovered, the lens had created four images of the supernova. But sometime later, a fifth appeared, and that time delay is influenced by the Universe's expansion—and thus the Hubble constant.</p></div><p><a href=\"https://arstechnica.com/?p=1939056#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939056&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c3867c493af8d912853d2a39ab244c9dbe560dd466c8a712dcdbb0cdb3a9f524","category":"Tech"}