{"title":"iOS Tip: ‘Smart Activation’ for Do Not Disturb Turns Off Notification During Screen Recordings","link":"https://mastodon.social/@gruber/111370259598983988","date":1699395871000,"content":"\n<p>Earlier today I was making a screen recording on my iPhone to share with a friend, and during the recording, a notification for a text message arrived. It wasn’t particularly personal, but I made another take of the screen recording anyway. This has happened to me numerous times before — sort of a Murphy’s Law thing, like buttered toast always seeming to fall wrong-side down. It occurred to me that Do Not Disturb should turn on automatically when you’re recording your screen, and I posted the idea to Mastodon.</p>\n\n<p>Glad I did. Because <a href=\"https://social.panic.com/@cabel/111370655233510063\">Cabel Sasser replied</a> that it already worked like that for him, and then Jason Walke — my favorite person in the world today — <a href=\"https://social.lol/@jwalke/111370698605974156\">explained that this is enabled by turning on “Smart Activation” for Do Not Disturb mode</a>.</p>\n\n<p>Go to Settings → Focus → Do Not Disturb, and under “Set a Schedule”, tap Add Schedule and enable Smart Activation. Now, when you start a screen recording, Do Not Disturb turns on automatically, and it turns itself off a few seconds after you finish recording. I’m not sure what else triggers Smart Activation — the description in Settings is pretty vague — but for screen recordings this is just what I wanted.</p>\n\n<p>(<a href=\"https://mastodon.social/@rjj/111370303568327667\">Ryan Jones chimed in with a good idea</a>: an option to automatically beautify the status bar in screen recordings: removing any extraneous icons (like the Do Not Disturb moon), showing perfect cellular and Wi-Fi signal strength, and having the battery show 100 percent. “Presenter Mode” more or less.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/07/smart-activation-do-not-disturb\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c388da959d92c700f8bf4c46a7fd67abcce1bc0440547fb9aa493851c66ca26f","category":"Tech"}