{"title":"Affinity Creative Apps Gain Memory Optimization Update Making Some Tasks Up to 10 Times Quicker","link":"https://www.macrumors.com/2021/08/05/affinity-v1-10-update-memory-optimization/","date":1628168385000,"content":"Serif today <a href=\"https://affinity.serif.com/press/newsroom/superpower-your-creativity-with-the-new-affinity-v1-10/\">announced</a> across-the-board updates for its popular suite of <a href=\"https://affinity.serif.com/\">Affinity</a> creative apps, including Affinity Photo, Affinity Designer, and the <a href=\"https://affinity.serif.com/en-gb/press/newsroom/affinity-publisher-is-apples-mac-app-of-the-year/\">Apple award-winning</a> Affinity Publisher for Mac, all of which were among the first professional creative suites to be <a href=\"https://www.macrumors.com/2020/11/12/serif-updates-affinity-apps-for-m1-chip/\">optimized</a> for Apple silicon.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/110-affinity-publisher-pages.jpg\" />\r\n<br />\r\nFor Affinity Publisher, a total rewrite of memory management now enables instant loading times for very large documents, even those with thousands of pages and many gigabytes' worth of linked images. These rewrites have also allowed for smooth live editing and fast scroll, pan and zoom across the whole document.\r\n<br />\r\n<blockquote>\"We've been excited to see the scale of some of the projects our customers are creating in Affinity Publisher, and knew we could do better to ensure the app remained fast when pushed to the limits,\" said Ashley Hewson, Managing Director of Affinity developer Serif. \"We completely reimagined our memory-handling architecture and the result is that there's really no limit to the size of document you can work on while maintaining that stunning performance.\"</blockquote>This performance improvement also extends to Affinity Designer, where the benefit will be most felt by users who import PDF files generated in a CAD app or similar that include hundreds of thousands of objects. Even with less-complex projects, though, everything should feel a lot smoother and snappier, according to the developers.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/110-affinity-designer-outline-view.jpg\" />\r\n<br />\r\nElsewhere, Affinity Photo has received \"extensive\" performance tweaks, so users can expect greater efficiency when blending layers together, while retaining a non-destructive workflow. This version also introduces some options to ensure editing speed remains slick even after building up a complex stack of hundreds of pixel and vector layers, and filter effects, while still maintaining the full layer stack.\r\n<br />\r\n\r\n<br />\r\nLastly, IDML import in Affinity Publisher is said to be up to four times faster, text flow speeds have nearly doubled, a series of other smaller tweaks and stability improvements have been made to the Affinity suite for version 1.10.\r\n<br />\r\n\r\n<br />\r\nThe update is available across all Affinity apps on macOS, Windows and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> from today and is free to existing users. All Affinity apps are currently available to purchase individually for $60 each on the <a href=\"https://affinity.serif.com/\">Affinity website</a>, no subscriptions required.<div>Tags: <a href=\"https://www.macrumors.com/guide/affinity-photo/\">Affinity Photo</a>, <a href=\"https://www.macrumors.com/guide/affinity-designer/\">Affinity Designer</a>, <a href=\"https://www.macrumors.com/guide/affinity-publisher/\">Affinity Publisher</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/05/affinity-v1-10-update-memory-optimization/\">Affinity Creative Apps Gain Memory Optimization Update Making Some Tasks Up to 10 Times Quicker</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/affinity-creative-apps-gain-memory-optimization-update-making-some-tasks-up-to-10-times-quicker.2306603/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fcfb_LR3SYw:nQgP5Vi0PDc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fcfb_LR3SYw:nQgP5Vi0PDc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/fcfb_LR3SYw\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c389e4428b60841798b5c1d611a7d4c17ddd9ac9c595e80fadbb69cf51af888d","category":"Apple"}