{"title":"Taxon‐specific response of natural enemies to different flower strip mixtures","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14761?af=R","date":1724046587000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/ab7350e6-e1c5-42a5-8490-5c5f5ad9398c/jpe14761-toc-0001-m.png\" alt=\"Taxon-specific response of natural enemies to different flower strip mixtures\" />\n<p>We found taxon-specific responses of natural enemies to different flower strips, which provide guidance for the floral composition of flower strips in order to maximize their effectiveness for natural pest control. We suggest the use of perennial mixtures with high proportion of flower heads (Asteraceae) and disk flowers (esp. Apiaceae, Rubiaceae, Brassicaceae) in particular, but also flag blossoms (Fabaceae) as these flower types were positively associated with several natural enemy groups. However, since we found mixed responses to flower types, specific flower strip composition will ultimately depends on its objective.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nFlower strips are a prominent agri-environmental scheme with the central objective to promote biodiversity and maintain associated ecosystem services. The promotion of natural enemies by increasing resource availability through flower strips is a promising approach for integrated pest management.\n\nIn a 3-year field study, two annual and two perennial flower strip mixtures, as well as a grass mixture, were tested regarding their attractiveness for natural enemies at three different study sites in Germany. Natural enemies were sampled annually in nine sampling rounds at a 10-day rhythm using sweep netting and pitfall traps. To assess available floral resources, we estimated the species-specific flower cover and classified species into flower types.\n\nFlower strip mixtures differed in their attractiveness to natural enemies. Treatment effects on arthropod activity density were most pronounced in the second and third year. Overall, perennial were more attractive than annual flower strip mixtures for most natural enemies, however, the response to flower strip mixtures varied significantly among taxa. For example, perennial flower strips showed a two- to fourfold increase of plant-dwelling spider and parasitoid wasp activity density as well as higher numbers of juvenile stages of predatory bugs and rove beetles compared to annual flower strips. In contrast, annual flower strip mixtures showed the highest attractiveness for ground beetles. Moreover, different natural enemy taxa were associated with varying flower strip characteristics such as flower type proportion, herbivore availability and plant species richness.\n\n<i>Synthesis and applications</i>. We found taxon-specific responses of natural enemies to different flower strips, which provide guidance for the floral composition of flower strips in order to maximize their effectiveness for natural pest control. We suggest the use of perennial mixtures with high proportion of flower heads (Asteraceae) and disk flowers (esp. Apiaceae, Rubiaceae, Brassicaceae) in particular, but also flag blossoms (Fabaceae) as these flower types were positively associated with several natural enemy groups. However, since we found mixed responses to flower types, specific flower strip composition will ultimately depends on its objective.\n</p>","author":"Simon Blümel, \nLukas Beule, \nNicolai Bissantz, \nWolfgang H. Kirchner, \nVerena Haberlah‐Korr","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"c38957465c952860c43cbd6f539ddd6be03f3c52cc37469d1b756eddf507174d","category":"Environment"}