{"title":"Andrew and Lee do The Wheel of Time episode five: Funerals everywhere!","link":"https://arstechnica.com/?p=1817626","date":1638538812000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200224_THIJAN_00191_v1_thumb.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200224_THIJAN_00191_v1_thumb.jpg\">Enlarge</a> <span>/</span> Rand and Mat finally make it to Tar Valon. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p></p><aside>\n  <h2>The Wheel of Time season one</h2>\n\t<ul>\n\t    <li><a href=\"https://arstechnica.com/gaming/2021/12/the-wheel-of-times-fifth-episode-is-bookended-by-funerals/\">Andrew and Lee do <em>The Wheel of Time</em> episode five: Funerals everywhere!</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/wheel-of-time-book-reader-recap-episode-4-who-is-the-dragon-reborn/\">Andrew and Lee continue watching <em>The Wheel of Time</em>—and it’s getting real</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/two-book-readers-recap-the-first-three-episodes-of-amazons-the-wheel-of-time/\">Andrew and Lee dissect <em>The Wheel of Time’s</em> television premiere</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/ars-is-reviewing-amazons-the-wheel-of-time-series/\">Ars is reviewing Amazon’s <em>The Wheel of Time</em> series</a></li>\n    </ul>\n  <span><a href=\"https://arstechnica.com/series/the-wheel-of-time-season-one/\">View more stories</a></span>\n</aside>\n<br />\nAndrew Cunningham and Lee Hutchinson have spent decades of their lives with Robert Jordan and Brandon Sanderson's <em>Wheel of Time</em> books, and they're bringing that knowledge to bear as they <a href=\"https://arstechnica.com/gaming/2021/11/ars-is-reviewing-amazons-the-wheel-of-time-series/\">recap each episode</a> of Amazon's new <em>WoT</em> TV series. These recaps won't cover every element of every episode, but they will contain major spoilers for the show and the book series. If you want to stay unspoiled and haven't read the books, these recaps aren't for you.<p></p>\n<p>New episodes of <em>The Wheel of Time</em> will be posted to Amazon Prime subscribers every Friday.</p>\n<div><strong>Lee</strong>: Greetings, dear readers! Part five marks the start of the second half of our eight-episode season, and we pick up with a funeral—the aftermath of the attack that closed out <a href=\"https://arstechnica.com/gaming/2021/11/wheel-of-time-book-reader-recap-episode-4-who-is-the-dragon-reborn/\">episode four</a>. White seems to be the funerary color in the world of the <em>Wheel of Time</em>, and the dead are shrouded in it as we close out the pre-credits scene with a cool overhead shot showing a circular arrangement of graves. Straight-down overhead views and circles are a strong recurring visual motif this season—and this isn’t the last time we’ll see a similar shot.\n<p>And after that, we get a big, month-long time skip—and then we’re off to Tar Valon!</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00712_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00712_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00712_1_thumb.jpg\">Ahh, <span>Minas Tirith</span> Tar Valon!</a> (credit: Amazon Studios)</p></div>\n<div><strong>Andrew</strong>: For book-readers, being in Tar Valon this early will drive home just how far off the map we now are, in terms of adapting <em>Eye of the World</em>. Many of our characters, particularly Rand and Mat and Egwene and Perrin, are all caught up in plots that actually aren't too dissimilar from the book's version of events. But we are far, far away from Caemlyn, the city that anchors these story beats in <em>EotW</em>, which means we're either skipping or delaying some major character introductions, and also that inter-Aes-Sedai scheming is a bigger part of the story.</div>\n<div><strong>Lee</strong>: Can I do the Comic Book Guy thing and talk about Tar Valon’s appearance just a bit?\n<p>I promise not to make this kind of pooh-poohing a habit, but the show’s Tar Valon doesn’t really match my headcanon appearance. I see no flowing Ogier masonry, no fluted bridges and connecting towers. The up-close shots of the city streets with their dirty white stonework look like they were borrowed from Minas Tirith in <em>Return of the King</em>. And the White Tower itself is an artless stump of half-melted wax—like if you put the book’s version of the White Tower in a microwave and let it just kind of... collapse on itself. If there’s an architectural antecedent to the design we see on screen, it’d be something like Angkor Wat—except without the grace or beauty. Sorry, Amazon, but the Shining City is a swing and a miss for me.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00917_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00917_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200213_THIJAN_00917_1_thumb.jpg\">Poor Logain. He's maybe looking a little, how do you say, <em>mad</em>.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Andrew</strong>: Huh, the look of Tar Valon didn't jump out at me as <em>wrong</em>, though I see what you mean. It's Minas Tirith by way of King's Landing. It could definitely be trying harder to be its own thing. But I'll admit that I was mostly checking to make sure they had faithfully recreated the island's, uh, <a href=\"https://www.reddit.com/r/WetlanderHumor/comments/jawje3/stolen_from_the_the_wheel_of_time_shaitanposting/\">distinctive topography</a> (we only really see the city in profile, but it seems like yes?).\n<p>We have talked a few times about the differences in how the One Power is depicted in this show, and I came away from this episode mulling something that is kind of separate from that but also kind of not? Everything we see about Warder culture on this show is modeling an emotionally open and vulnerable version of masculinity that is really sticking out to me as a reader of the books. Most (if not all) of these men spend the books talking about duty and self-sacrifice and how they're all too DANGEROUS to have friends or lovers. No one ever takes their childhood friend by the shoulder and just asks <em>how they're holding up</em>. Book-Lan gives Nynaeve the Pee-Wee Herman \"<a href=\"https://www.youtube.com/watch?v=mKLizztikRk\">I'm a loner, Dottie, a rebel</a>\" speech pretty much verbatim.</p>\n<p>But in the show we are regularly seeing groups of men having emotionally mature conversations, and crying, and just <em>being there for each other</em>? We briefly noted it <a href=\"https://arstechnica.com/gaming/2021/11/wheel-of-time-book-reader-recap-episode-4-who-is-the-dragon-reborn/\">last week</a>, in that moment where Rand checks in on Mat because he's worried about him. I am sure that this is going to piss off some element of the fandom, anyone who believes this affected machismo is something to emulate and not (as the books ultimately depict it!!) a character flaw. But I've found it strikingly refreshing.</p>\n</div>\n<div><a name=\"page-2\"></a></div>\n<div><strong>Lee</strong>: Absolutely—it’s a great update to the books’ more 1990s-esque take on stoic sword-bros in high fantasy (though let’s revisit this when the characters eventually get to the Borderlands, since that will likely introduce us to a set of much less talkative sword-bros).\n<p>But I love the bits of Warder culture we get to see—both the campfire camaraderie and also how they behave back at the Tower. They’re a proud group with their own traditions and their own place among the Aes Sedai. The books never give us much of a peek into what Warders are like behind closed doors, surrounded by safe company, and the humanity on display when Lan and Stepin are talking about what comes next for Stepin—and what “adventures” he might have if Alanna of the Green Ajah bonds him—is my favorite part of the episode. All the more so because of what happens next.</p>\n<p>Though, speaking of favorite things—we gotta talk about Loial. Are you ready to talk about Loial? Because Loial shows up!</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200217_THIJAN_00663_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200217_THIJAN_00663_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200217_THIJAN_00663_1_thumb.jpg\">Warders share quality bro time.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Andrew</strong>: I am honestly astonished by the amount of time we have spent on some of this Warder stuff, pretty much all of which is totally new, in a show that is trying to adapt a 700-page novel in eight episodes. It's a good thing, creatively, that the show is willing to strike out on its own? But still. I'm assuming we're getting this much of it because the show wants to use it to heighten some Moiraine-Lan drama later. Otherwise I am not totally sure what we're doing here even if I'm enjoying it moment to moment.\n<p>But speaking of things that this episode does not get to spend enough time with! Loial, son of Arent, son of Halan, played by Hammed Animashaun. I love him. I want more of him. But this episode does have to breeze past him pretty quickly, which is a little weird for what I believe is our first indication anywhere that friendly non-human species inhabit this world.</p>\n<p>Sidebar: What do Ogier look like in your headcanon? In my head Loial <a href=\"https://disney.fandom.com/wiki/James_P._Sullivan\">looks like Sully from Monsters Inc</a>, for some reason. But I think the show's depiction of him as a sort of large exceptionally hairy man with exaggerated features and a downward-modulated voice isn't bad (think a larger, more huggable version of Worf from <em>Star Trek</em> and you're pretty much there).</p>\n</div>\n<div><strong>Lee</strong>: My Loial headcanon image is kind of fuzzy, honestly! If I had to pin it down, I’d say it’s probably something like the cover art for the ancient Piers Anthony Xanth novel <a href=\"https://en.wikipedia.org/wiki/Ogre,_Ogre\"><em>Ogre, Ogre</em></a>—which I suppose is fitting enough. In fact, Rand even mispronounces Loial’s species when he blurts out “You’re an ogre!”\n<p>Having Rand say that is also a great way to surface the idea to show viewers that <em>Wheel of Time</em> is set in a world where each past age eventually comes again—time, we are told, is a seven-spoked wheel, and each spoke represents an age. The implication is that the myths and tales about ogres that we know in our own 21st-century modern age might have sprung from the Ogier of Rand’s time. (And there are reciprocal myths mentioned in the books, like Thom Merrilin’s tale of the giants <a href=\"https://en.wikipedia.org/wiki/Moscow\">Mosk</a> and <a href=\"https://en.wikipedia.org/wiki/United_States\">Merk</a> fighting with <a href=\"https://en.wikipedia.org/wiki/Intercontinental_ballistic_missile\">spears of fire</a>, or Egwene’s talk of the hero <a href=\"https://en.wikipedia.org/wiki/John_Glenn\">Lenn</a>, who flew to the Moon in the belly of <a href=\"https://en.wikipedia.org/wiki/Lunar_Module_Eagle\">an eagle made of fire</a>).</p>\n<p>Showrunner Rafe Judkins has said that Animashuan’s appearance as Loial is mostly practical effects and make-up, which is done both to control VFX costs and also to give Animashuan and the other actors the ability to inhabit the roles and act off of each other in a more natural way. (One only has to read Ewan McGregor’s <a href=\"https://screenrant.com/star-wars-prequels-dialogue-visual-effects-ewan-mcgregor-response/\">laments</a> about extensive green-screen acting to see the value in sticking with physical, practical effects whenever possible.)</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00571_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00571_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00571_1_thumb.jpg\">\"Yer a wizard, Nynaeve!\"</a> (credit: Amazon Studios)</p></div>\n<div><strong>Andrew</strong>: Speaking of myths, when Rand and Loial are talking about <em>The Travels of Jain Farstrider</em>, did you catch that Jain is a \"she\" in this version of the story? Curious to see if they take that change to its logical conclusion in like... nine seasons.</div>\n<div><strong>Lee</strong>: Indeed, there are implications! I dig it.\n<p>Speaking of things to catch—there was another Padan Fain whistle in this episode. Did you catch it?</p>\n</div>\n<div><strong>Andrew</strong>: I was 90% sure I saw him! And now I am 100% sure. It's a game of Where's Waldo, if Waldo were a murderous embodiment of an ancient evil.\n<p>OK, all of our characters have converged or are converging on Tar Valon here, anyone you want to mention in particular? Rand and Mat mostly cool their heels in a hotel while Mat succumbs to KNIFE MADNESS, which the show characters still suspect is channeling madness.</p>\n</div>\n<div><strong>Lee</strong>: And Mat definitely doesn’t want Nynaeve checking his tongue, since that seems to be where the <s>X-Files Black Oil</s> KNIFE MADNESS Spirit hangs out.\n<p>Though at this point we might need to shift gears a bit, because we <em>gotta</em> talk about poor Perrin and Egwene and their little session at the hands of Child Valda.</p>\n</div>\n<div><a name=\"page-3\"></a></div>\n<div><strong>Andrew</strong>: I think they've gotten short shrift in our conversation so far because what they're doing has stuck more closely to the events of the books, and that is both true and not true in this episode. The biggest change is probably that Perrin's whole wolf thing has not been fully spelled out by anybody yet. But, yes, the Whitecloak encounter has also been tweaked to give us more of our favorite sadist.</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200129_THIJAN_00590_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200129_THIJAN_00590_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200129_THIJAN_00590_1_thumb.jpg\">Egwene must make a choice: she dies, or Perrin dies. Fortunately, she chooses the secret third option: \"Wolves eat everyone.\"</a> (credit: Amazon Studios)</p></div>\n<div><strong>Lee</strong>: Sadist is definitely the right word—I think Valda cutting on Perrin’s back might be the goriest thing we’ve seen so far. And it’s pretty horrifying. It definitely works.\n<p>I feel like at this point it’s pretty clear we’re not going to see Elyas Machera for a while, if ever. Show-watchers who haven’t read the books probably won’t miss him, but Elyas is a fan favorite. His role in the books is to explain stuff to Perrin (and us!) about why Perrin is suddenly going all <em>Teen Wolf</em>, but so far the show is doing a perfectly fine job without him. If I were a bettin’ man, I’d say we’ll likely hear Elyas’ exposition dumps from Moiraine when the time comes—it feels like having her Know Things<img src=\"https://s.w.org/images/core/emoji/11/72x72/2122.png\" /> about Perrin’s wolfishness would be an appropriate alternative to introducing another dialogue-heavy character in the back half of the season. We’re already getting Loial, after all, and of the two, Loial is more important.</p>\n</div>\n<div><strong>Andrew</strong>: I am also about 50/50 on whether the show is going to cut out the Ways, which would honestly be fine by me. The Ways sections in the books are creepy and atmospheric and all, but the show has already been fine with using time jumps to elide physical distance, and both goodies and baddies end up developing multiple alternate fast-travel mechanisms soon enough.\n<p>This episode has also done nothing to disabuse me of my Liandrin-as-composite-character-who-includes-Elaida theory, since we have totally skipped over Caemlyn, and we get clear confirmation in this episode that Liandrin is a political operator who has been gathering support in the White Tower. But it's saying something that I'm already so uncertain about where the show is going to go, despite having read all the books multiple times, because removing even a minor character from the series' teetering Jenga tower of named characters ripples out and has huge story implications.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00165_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00165_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_105_200219_THIJAN_00165_1_thumb.jpg\">Plots are afoot at the White Tower.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Lee</strong>: Absolutely agree on Liandrin being a composite—I’m going to go ahead and say we’re probably safe promoting that idea from headcanon to almost-certainly-actual-canon. They’ve made a great choice in Kate Fleetwood, because she plays Liandrin with a very <em>unsettling</em> manner. Like, you’re not quite sure <em>why</em> she’s so weird and creepy, but she’s <em>definitely</em> weird and creepy. (Though, as you say, the long-term implications of merging those two characters are... well, let’s just say “complicated” and leave it there.)</div>\n<div><strong>Andrew</strong>: And she's also capable of adding <em>shades</em> to her weird creepiness! She can turn on the \"listen, I'm your friend in this situation\" charm when she needs to; it's not all-ice-all-the-time.\n<p>The episode is bookended by funerals—we start by burying the Aes Sedai and Warders who were killed by Logain's followers, and we end with a funeral ritual for Stepin in the White Tower.</p>\n<p>(Two other show-inventions on this note that I liked, as we wrap up: how Kerene's Great Serpent ring is melted down at the White Tower, presumably into the same pool of molten material used to make new rings for new Aes Sedai—I don't believe this is mentioned in the main books at all, but it fits well with the series' cyclical motifs. Also Álvaro Morte's Logain is communicating volumes with his blank, post-gentling stare).</p>\n</div>\n<div><strong>Lee</strong>: Stepin has that big Isuldur-cast-it-into-the-fire energy.\n<p>The funeral ritual with Lan’s howls of grief was very powerful—and having Moiraine (and Alanna, to a lesser degree) join in is yet another signal to viewers just how strong and deep the Aes Sedai/Warder bond is. It’s a thing beyond marriage, beyond family—it’s a commingling of personhood, almost. Moiraine gets emotional when Lan drinks, because she can feel it through the bond. And when he grieves, that too leaks through back to Moiraine.</p>\n<p>I dig it. It works for me.</p>\n</div>\n<div><strong>Andrew</strong>: Yeah. Many of our commenters said last week that they've been enjoying the show more as it goes, and I think that's been true for me, too. It still isn't the next <em>Game of Thrones</em>, in terms of its cultural cachet and critical reception. But now that we're really in the thick of things, I'm enjoying myself pretty unreservedly. Until next week!</div>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Wheel-icon-e1637336031883.jpg\" /><p>(credit: <a href=\"https://wot.fandom.com/wiki/Category:Chapter_art\">WoT Wiki</a>)</p></div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1817626\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1817626&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c390149064045ac5322820ff7915b014ce04e1b5eb09ec894329f5f11bbad98f","category":"Tech"}