{"title":"Global evidence for joint effects of multiple natural and anthropogenic drivers on soil nitrogen cycling","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17309?af=R","date":1715764308000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c372c1a0-50d6-4664-9fb9-349f3cfadceb/gcb17309-toc-0001-m.png\" alt=\"Global evidence for joint effects of multiple natural and anthropogenic drivers on soil nitrogen cycling\" />\n<p>The stable N isotope (δ<sup>15</sup>N) has emerged as a useful tool for integrating N cycling processes into a single metric. Early studies hold that climatic conditions predominantly control soil δ<sup>15</sup>N and N cycling, whereas our comprehensive analysis reveals prevalent joint effects of climatic conditions, plant N-use strategies, soil properties, and other natural and anthropogenic forcings on global soil δ<sup>15</sup>N. Considering the joint effects of multiple drivers is critical for better understanding and assessing the Earth's N balance.</p>\n<br />\n<h2>Abstract</h2>\n<p>Global soil nitrogen (N) cycling remains poorly understood due to its complex driving mechanisms. Here, we present a comprehensive analysis of global soil δ<sup>15</sup>N, a stable isotopic signature indicative of the N input–output balance, using a machine-learning approach on 10,676 observations from 2670 sites. Our findings reveal prevalent joint effects of climatic conditions, plant N-use strategies, soil properties, and other natural and anthropogenic forcings on global soil δ<sup>15</sup>N. The joint effects of multiple drivers govern the latitudinal distribution of soil δ<sup>15</sup>N, with more rapid N cycling at lower latitudes than at higher latitudes. In contrast to previous climate-focused models, our data-driven model more accurately simulates spatial changes in global soil δ<sup>15</sup>N, highlighting the need to consider the joint effects of multiple drivers to estimate the Earth's N budget. These insights contribute to the reconciliation of discordances among empirical, theoretical, and modeling studies on soil N cycling, as well as sustainable N management.</p>","author":"Yong Zhang, \nXiaoli Cheng, \nCesar Terrer, \nWoo‐Jung Choi, \nJi Chen, \nYiqi Luo, \nPhilippe Ciais","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"c3a7e6af2b569d94eb62884081c9fcd4b9fc92eb57b2ebbccb770da7b18131eb","category":"Environment"}