{"title":"Calculator, Mail, other built-in apps get a Windows 11 facelift in latest beta","link":"https://arstechnica.com/?p=1786883","date":1628800449000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Screenshot-2021-08-12-160659-800x442.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Screenshot-2021-08-12-160659.png\">Enlarge</a> <span>/</span> Get excited! The new Calculator app is here!!  (credit: Andrew Cunningham)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Microsoft is giving the Windows 11 treatment to <a href=\"https://blogs.windows.com/windows-insider/2021/08/12/first-set-of-windows-app-updates-rolling-out-to-windows-insiders-for-windows-11/\">a handful of core apps</a> in the next Insider Preview build of the upcoming operating system. Mail, Calendar, the Calculator, and the Snipping Tool are all being revamped, and if you're running the latest Insider Preview, you should be able to grab these updates from within the Windows Store app starting today.</p>\n<p>The changes in Mail, Calendar, and Calculator appear to be largely cosmetic, ejecting the squared-off corners of Windows 8 and 10 for a softer, more rounded look that fits in with the rest of the operating system. The one \"new\" app is a revamp of the Snipping Tool that unifies the features of the old Snipping Tool and the Windows 10 Snip &amp; Sketch app (this update brings the useful side effect of finally getting rid of the annoying message telling you that the Snipping Tool is going away every time you open it up).</p>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/SnippingLight.png\" /></div>\n        <p>\n          The new Snipping Tool updates its predecessor's Windows 7-era UI while integrating the features of Windows 10's duplicative Snip &amp; Sketch tool.                       [credit:\n                        <a href=\"https://www.microsoft.com/\">Microsoft</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The new Snipping Tool still gives you buttons for changing what kind of screenshot you're trying to take and whether you want it to happen on a delay. Its annotating tools for screenshots have been given a more modern facelift, too (the old ones were stuck in the Windows 7 era). Snip &amp; Sketch users can continue to access that handy UI by using the Windows + Shift + S keyboard shortcut.</p></div><p><a href=\"https://arstechnica.com/?p=1786883#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786883&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c3a8eb076ce8dee9b8901b340ac0a14ce71312cfa757a539496379b9bd748775","category":"Tech"}