{"title":"Measuring norm pluralism and perceived polarization in US politics","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae413/7821168?rss=1","date":1728950400000,"content":"<span><div>Abstract</div>Recent research has shown how norms shape political and economic decision-making. Much of this work assumes that a single norm influences the behavior of all people, but in fact, many situations are characterized by the existence of competing normative viewpoints. We apply a method for measuring belief in the simultaneous existence of multiple norms. Such multiplicity arises naturally when norms are associated with distinctive groups, and thus political polarization can be characterized, in part, as a product of diverging norms between groups. We thus assess the validity of our measurement technique by testing whether it can recover polarization on seven salient political issues on which US Democrats and Republicans tend to hold different views. We then compare the norms elicited by our method to the norms of Democrats and Republicans elicited in a separate sample using an established and validated—but methodologically less rich—measurement approach. Our study uncovers a wide range of co-existing views between and within political groups. Partisans understand their group’s norms and hold personal views that align with them. They can also recognize the diversity and polarization in US public opinion by identifying norms specific to political parties and acknowledging the variety of views within their own parties, which may indicate internal divisions. This research underscores the importance of nuanced approaches to political norms that go beyond party lines. By acknowledging a plurality of views, we can encourage productive discussions and bridge ideological divides.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"c3b9c66d37e0861c6e4b75aa3aa71d85f81f064b8098572474806d1bb78dccd3","category":"Interdisciplinary"}