{"title":"Apple CEO Tim Cook Teases AR/VR Headset and More in New Interview","link":"https://www.macrumors.com/2023/04/03/apple-ceo-tim-cook-teases-ar-vr-headset/","date":1680527609000,"content":"Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> has seemingly teased the company's upcoming mixed-reality headset in an <a href=\"https://www.gq.com/story/tim-cook-global-creativity-awards-cover-2023\">extensive interview</a> with <em>GQ</em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/Tim-Cook-Apple-Park-Feature.jpg\" alt width=\"1052\" height=\"591\" />\r<br />\nCook features on the cover of <em>GQ</em>'s Global Creativity Awards 2023 issue. The interview with <em>GQ</em>'s Zach Baron, titled \"‌Tim Cook‌ Thinks Different,\" delves into multiple aspects of Cook's career, premiership, and personal life. Explaining why Apple may, hypothetically, be interested in AR/VR hardware, Cook said: <blockquote>If you think about the technology itself with augmented reality, just to take one side of the AR/VR piece, the idea that you could overlay the physical world with things from the digital world could greatly enhance people's communication, people's connection. It could empower people to achieve things they couldn't achieve before. We might be able to collaborate on something much easier if we were sitting here brainstorming about it and all of a sudden we could pull up something digitally and both see it and begin to collaborate on it and create with it. And so it's the idea that there is this environment that may be even better than just the real world—to overlay the virtual world on top of it might be an even better world. And so this is exciting. If it could accelerate creativity, if it could just help you do things that you do all day long and you didn’t really think about doing them in a different way.</blockquote>Cook went on to suggest that measuring physical objects and placing digital art on walls are just the start of the potential use-cases for AR, seemingly implying that there are far greater possibilities. Baron then raised the fact that in 2015 Cook told <em>The New Yorker</em> that he was highly skeptical of Apple manufacturing smart glasses, similar to Google Glass, as an early AR product. At the time, Cook said:<blockquote>We always thought that glasses were not a smart move, from a point of view that people would not really want to wear them. They were intrusive, instead of pushing technology to the background, as we've always believed. We always thought it would flop, and, you know, so far it has.</blockquote>Now, Cook admitted that he is willing to say that he was wrong:<blockquote>My thinking always evolves. Steve taught me well: never to get married to your convictions of yesterday. To always, if presented with something new that says you were wrong, admit it and go forward instead of continuing to hunker down and say why you're right.</blockquote>Baron then asked Cook if the fact that neither Google Glass nor Meta's Quest headsets have made considerable impact among consumers would make him skeptical of Apple offering a product in the AR/VR space. Cook responded that Apple has a history of succeeding in areas where people have doubted it:<blockquote>Pretty much everything we've ever done, there were loads of skeptics with it. If you do something that's on the edge, it will always have skeptics. [...] Can we make a significant contribution, in some kind of way, something that other people are not doing? Can we own the primary technology? I'm not interested in putting together pieces of somebody else's stuff. Because we want to control the primary technology. Because we know that's how you innovate.</blockquote>Read the <a href=\"https://www.gq.com/story/tim-cook-global-creativity-awards-cover-2023\">full interview</a> for more information about Cook's thoughts on leadership, his public image, comparing himself with Steve Jobs, working at <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a>, his pay, and more.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/03/apple-ceo-tim-cook-teases-ar-vr-headset/\">Apple CEO Tim Cook Teases AR/VR Headset and More in New Interview</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-ceo-tim-cook-teases-ar-vr-headset-and-more-in-new-interview.2385746/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c3c991873189152d1a75326f5518dc4aed8f42ca9c282b14a2e04154f97e5aec","category":"Apple"}