{"title":"Berkshire Hathaway’s Stock Price vs. 32-Bit Integers","link":"https://www.wsj.com/articles/berkshire-hathaways-stock-price-is-too-much-for-computers-11620168548","date":1620265546000,"content":"\n<p>Alexander Osipovich, reporting for The Wall Street Journal (<a href=\"https://apple.news/A_tQAYYS_T2ulTqFrr6jUFg\">News+ link</a>):</p>\n\n<blockquote>\n  <p>Berkshire Hathaway Inc. is trading at more than $421,000 per Class\nA share, and the market is optimistic. That’s a problem. […] On\nTuesday, Nasdaq Inc. temporarily suspended broadcasting prices for\nClass A shares of Berkshire over several popular data feeds. Such\nfeeds provide real-time price updates for a number of online\nbrokerages and finance websites.</p>\n\n<p>Nasdaq’s computers can only count so high because of the compact\ndigital format they use for communicating prices. The biggest\nnumber they can handle is $429,496.7295. Nasdaq is rushing to\nfinish an upgrade later this month that would fix the problem.</p>\n</blockquote>\n\n<p>That number will look familiar to the programmers among you: it’s the limit of an unsigned 32-bit integer. Using 32-bit integers for share prices, with four digits reserved for decimals, isn’t that crazy, though, given that no other stock in the U.S. has a share price that’s even <em>close</em> to the limit:</p>\n\n<blockquote>\n  <p>The U.S. stock with the second-highest share price, home builder\nNVR Inc., is trading just above $5,100 a share. Using compact\nformats that take up less memory can make software more efficient,\na high priority in the world of electronic stock trading.</p>\n\n<p>At the root of the problem is Mr. Buffett’s decadeslong refusal to\nexecute a stock split of Berkshire’s Class A shares. The\n90-year-old billionaire has signed birthday cards to friends with\nthe message, “May you live until Berkshire splits,” according to\nFortune magazine.</p>\n</blockquote>\n\n<p><strong>Update:</strong> Worth noting that they’re not using integers to store fractional values — what they’re doing is using 10,000ths of a dollar as their integral unit. The decimal gets shifted left by four digits simply to display prices as dollar values, but the math is all done in 10,000ths of a dollar units.</p>\n\n<p>Not sure what their fix is going to be, but going to 64-bit integers would let them handle per-share prices up to $1,844,674,407,370,955.1615 — over $1.8 quadrillion — which should buy them some time, even if Berkshire continues to grow yet refuses to split.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/05/05/berkshire-32-bit-ints\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c3d1727e1d9fa8f0c8503d73c1f657cd4bd17a18defc8f42eb6e4130202894db","category":"Tech"}