{"title":"Exploring perception and attitude of nursing students towards interprofessional education in Saudi Arabia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311570","date":1728050400000,"content":"<p>by Zeinab A. Abusabeib, Nadiah A. Baghdadi, Noura A. Almadni, Hala K. Ibrahim</p>\r\nIntroduction <p>Interprofessional education is a process designed to facilitate knowledge exchange between healthcare professionals with the aim of improving learning, collaboration, and patient care. It helsps students gain a better understanding of communication, teamwork, and each profession’s role. This study aims to examine Saudi undergraduate nursing students’ attitudes and readiness for engagement in high-fidelity simulation interprofessional education and practice after training nurse educators in HFS.</p> Methodology <p>A descriptive cross-sectional study was conducted among 311 nursing students. The process of sampling was done by convenience and was not probabilistic. Participants were asked to complete a self-administered questionnaire. The survey included demographic information as well as the Readiness for Interprofessional Learning Scale.</p> Results <p>There was a positive attitude toward Interprofessional education among nursing students and a reasonable level of readiness. The Readiness for Interprofessional Learning Scale score was significantly associated with academic years (p ≤ 0.05).</p> Conclusion <p>Nursing students have a positive attitude towards interprofessional education and are willing to engage in high-fidelity simulation activities. The integration of high-fidelity simulation in interprofessional education can significantly benefit nursing students by enhancing their clinical skills, decision-making abilities, and teamwork dynamics in a controlled environment.</p>","author":"Zeinab A. Abusabeib","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c3d3ad331ec8c9e540b2343100e0c3d5aad709824d482ed92b2f63ec0c20cf15","category":"Interdisciplinary"}