{"title":"เฟซบุ๊กโชว์ปัญญาประดิษฐ์แปลภาษาแบบหลายภาษา คุณภาพการแปลชนะโมเดลภาษาเดียว","link":"https://www.blognone.com/node/125827","date":1636828601000,"content":"<div><div><div><p>เฟซบุ๊ก (Meta) ประกาศความสำเร็จในการพัฒนาโมเดลปัญญาประดิษฐ์สำหรับการแปลภาษาหลายภาษา (multilingual translation) ที่ชนะโมเดลปัญญาประดิษฐ์แปลภาษาที่เจาะจงคู่ภาษาถึง 10 คู่ภาษาจาก 14 คู่ภาษา</p>\n<p>แนวทางของเฟซบุ๊กสร้างโมเดลแปล 7 ภาษาเป็นภาษาอังกฤษ และโมเดลสำหรับแปลภาษาอังกฤษเป็นภาษาทั้ง 7 นั้นฝึก โดยโมเดลทั้งสองโดยใช้เทคนิคต่างๆ เช่น การค้นหาเอกสารที่แปลแล้วในเว็บ, หรือการใช้เอกสารภาษาเดียวเพื่อฝึกจากปัญญาประดิษฐ์แปลภาษาที่มีอยู่แล้ว (back translation), และการปรับแต่งโมเดลด้วยข้อมูลเฉพาะทาง (in-domain finetuning)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/32d54c3ad7d3ea41ce38ce27ed2b84c1.jpg\" /></p>\n<p>โมเดลที่ใช้งานมีขนาดถึง 52,000 ล้านพารามิเตอร์  เฉพาะการฝึกโมเดลต้องใช้เทคนิคแบ่งข้อมูลเพื่อประหยัดแรมในชิปกราฟิก โดยเทคนิคนี้ทีมวิจัยของเฟซบุ๊กก็<a href=\"https://engineering.fb.com/2021/07/15/open-source/fsdp/\">เคยรายงานเมื่อกลางปีที่ผ่านมา</a></p>\n<p>ระบบแปลภาษาที่เฟซบุ๊กนำเสนอตอนนี้ยังแปลภาษาไม่กี่ภาษามาเป็นภาษาอังกฤษ และแปลภาษาอังกฤษกลับไปเป็นภาษาเหล่านั้น แต่ทีมวิจัยเชื่อว่าแนวทางการสร้างโมเดลที่แปลได้หลายๆ ภาษาพร้อมกันนี้เป็นอนาคตของการพัฒนาปัญญาประดิษฐ์แปลภาษา และในอนาคตโมเดลเช่นนี้ก็อาจจะสามารถใช้งานแทนโมเดลปัญญาประดิษฐ์แปลภาษานับพันๆ ตัวที่ใช้งานอยู่มาใช้งานโมเดลเดียว</p>\n<p>ที่มา - <a href=\"https://ai.facebook.com/blog/the-first-ever-multilingual-model-to-win-wmt-beating-out-bilingual-models/\">Facebook</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c3e890c1b6d9a9e315b356638855dcf317090359f5ae633844fe66c9efbb6ed5","category":"Thai"}