{"title":"Analysis of Socioeconomics and Occupational Dimensions of Shrimp Farmers of Tamil Nadu","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/2457208?af=R","date":1696489200000,"content":"<p>Studies on socioeconomic, communication media usage, occupational, and sociopsychological attributes of farmers are prerequisite for planning, designing, and successful implementation of sustainable management strategies of a sector which is true for <i>Penaeus vannamei</i> shrimp farming also. The state of Andhra Pradesh in India ranks first in shrimp farming. However, Tamil Nadu state has a lot of potential and is slowly catching with third position, so the baseline profile of shrimp farmers of Tamil Nadu was collected through interviews with 316 shrimp farmers in Nagapattinam, Mayiladuthurai, Thanjavur, and Thiruvallur districts. Most shrimp farmers were men of middle-age, with experience ranging from 1 to 5 years with secondary school to graduate level education. About 89.36% of shrimp farmers had taken loans for the purpose of shrimp farming whereas 78.16% were depending on income from shrimp farming as a repayment source. The benefit–cost ratio of shrimp farming was 2.2 indicating profitability so 79.37% of them were able to save money. However, for 86.53% this was a major expenditure too indicating its vital role in their life. For acquiring information for shrimp farming, 40% relied on friends and 24% relied on fellow farmers. Shrimp farmers were well-versed with the present-era mass-media and through smartphones they acquired information from apps like YouTube. Innovation proneness, scientific orientation, and economic motivation were found to be high in about 30% of farmers. Proper planning is essential for sustainable shrimp farming and sustaining the socioeconomic benefits. The studied attributes play an important role in formulation, designing, and successful implementation of sustainable shrimp farming.</p>","author":"S. Agnes Daney Angela, \nArpita Sharma, \nHisham Abdelrahman","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"c3e88a96adf5ec6625840dc554771b4d943499bac2bf671e9fd128b395a81321","category":"Environment"}