{"title":"Rice requires a chromatin remodeler for Polymerase IV-small interfering RNA production and genomic immunity","link":"https://academic.oup.com/plphys/article/194/4/2149/7441630?rss=1","date":1700611200000,"content":"<span><div>Abstract</div>Transgenes are often spontaneously silenced, which hinders the application of genetic modifications to crop breeding. While gene silencing has been extensively studied in Arabidopsis (<span>Arabidopsis thaliana</span>), the molecular mechanism of transgene silencing remains elusive in crop plants. We used rice (<span>Oryza sativa</span>) plants silenced for a 35S::<span>OsGA2ox1</span> (<span>Gibberellin 2-oxidase 1</span>) transgene to isolate <span>five elements mountain</span> (<span>fem</span>) mutants showing restoration of transgene expression. In this study, we isolated multiple <span>fem2</span> mutants defective in a homolog of <span>Required to Maintain Repression 1</span> (<span>RMR1</span>) of maize (<span>Zea mays</span>) and <span>CLASSY</span> (<span>CLSY</span>) of Arabidopsis. In addition to failing to maintain transgene silencing, as occurs in <span>fem3</span>, in which mutation occurs in <span>NUCLEAR RNA POLYMERASE E1</span> (<span>OsNRPE1</span>), the <span>fem2</span> mutant failed to establish transgene silencing of 35S::<span>OsGA2ox1</span>. Mutation in <span>FEM2</span> eliminated all RNA POLYMERASE IV (Pol-IV)–FEM1/OsRDR2 (RNA-DEPENDENT RNA POLYMERASE 2)-dependent small interfering RNAs (siRNAs), reduced DNA methylation on genome-wide scale in rice seedlings, caused pleiotropic developmental defects, and increased disease resistance. Simultaneous mutation in 2 <span>FEM2</span> homologous genes, <span>FEM2-Like 1</span> (<span>FEL1</span>) and <span>FEL2</span>, however, did not affect DNA methylation and rice development and disease resistance. The predominant expression of <span>FEM2</span> over <span>FEL1</span> and <span>FEL2</span> in various tissues was likely caused by epigenetic states. Overexpression of <span>FEL1</span> but not <span>FEL2</span> partially rescued hypomethylation of <span>fem2</span>, indicating that <span>FEL1</span> maintains the cryptic function. In summary, FEM2 is essential for establishing and maintaining gene silencing; moreover, FEM2 is solely required for Pol IV–FEM1 siRNA biosynthesis and de novo DNA methylation.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"c3eaed01d194538d2115715da4720ed3ddaec8907a765ff80421be74b29aa105","category":"Environment"}