{"title":"Comparison of High-Resolution Digital Elevation Models for Customizing Hydrological Analysis of Urban Basins: Considerations, Opportunities, and Implications for Stormwater System Design","link":"https://www.preprints.org/manuscript/202410.1177/v1","date":1728976513000,"content":"Understanding hydrological processes is vital for managing phenomena such as floods and droughts and incorporating them into planning processes, as urbanization and the consequent increase in impervious surfaces have reduced natural landscapes, negatively impacting water infiltration and increasing surface runoff, which has led to more frequent urban floods. Recent research highlights the growing need to develop hydrological solutions at increasingly specific urban scales, emphasizing the importance of data collection, modeling, and micro-basin delineation, which are crucial for analyzing runoff behavior, sediment transport, and water quality. Topographical data is fundamental for hydrological analysis and can be collected through on-site surveys using tools such as total stations and GPS. However, these methods can be costly and time-consuming. Alternatively, remote sensing techniques, such as Digital Elevation Models (DEMs), offer cost-effective and efficient ways to gather topographical information. DEMs, often combined with Geographic Information Systems (GIS), represent elevation data and are widely available for free from various global agencies. These tools are invaluable in hydrological studies, as they help to model basin morphology and surface runoff patterns accurately. However, although there are models with global coverage, their resolutions are only occasionally optimal for hydrographic analysis. Additionally, some countries have regulatory agencies and institutions that generate geographic information, including DEMs, from national to local scales.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c3eb00b880c3ecf45f1f49cf2da6ec481ee2e2467886d4f9bb41ee81a01acda5","category":"Interdisciplinary"}