{"title":"Early Changes in Eating Behavior Patterns and Their Relationship with Weight Outcomes in Patients Undergoing Bariatric Surgery","link":"https://www.preprints.org/manuscript/202410.1170/v1","date":1728974661000,"content":"Background/objective: Background: Eating behaviors (EB) correlate with weight loss after bariatric surgery (BS). Therefore, investigation of EB could guide interventions before the achievement of insufficient weight outcomes. Method: A prospective cohort of 85 patients undergoing Roux-en-Y Gastric Bypass (RYGB, 84.7% female, mean age 44.7±9.3 years) was included. After six months from RYGB, EB patterns, including cognitive restraint (CR), uncontrolled (UE) and emotional eating (EE), were assessed using the Three-Factor Eating Questionnaire R21 (TFEQ-R21). History, physical examination, and anthropometric assessment were collected pre- and 12 months postoperative. Patients were divided based on the percentage of excess weight loss (%EWL&amp;lt;80% or ≥80%) and EB patterns were correlated with weight outcomes at 12 months. Results: The %EWL≥80% group demonstrated significantly higher scores in CR and EE compared to %EWL&amp;lt;80% (p&amp;lt;0.001 and p=0.01, respectively). UE scores were similar between groups (p=0.41). At 12 months postoperative, the %EWL≥80% group had negative correlations between CR and BMI and positive correlations between CR and EWL (rho=-0.33 and rho=0.29; p=0.04). Multiple logistic regression considering %EWL≥80% as the aim outcome revealed that CR had a significant influence (OR=1.037; p=0.058), while age (OR=0.962; p=0.145), sex (OR=2.984; p=0.135), UE (OR=0.995; p=0.736), and EE (OR=1.017; p=0.296) did not. Conclusion: EBs influence outcomes after BS, and a model using TFEQ-R21 predicted them. CR six months post-surgery was the strongest predictor of higher EWL at 12 months. Further research is needed to understand the relationship between restrictive EB and BS outcomes, possibly identifying strategies to prevent disordered EB in patients with higher scores.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c3f526080925160d85982802c38e645f656e5101113869f75ba5ae1d291078ef","category":"Interdisciplinary"}