{"title":"The Harrowing Tale of Chuck Geschke’s 1992 Kidnapping","link":"https://www.losaltosonline.com/news/sections/news/215-news-briefs/20556-J18583","date":1619051103000,"content":"\n<p>The obituaries for Adobe cofounder Chuck Geschke all mention his 1992 kidnapping, but they make it seem like it wasn’t all that serious. It was, in fact, crazy serious. This 4-part 2009 series for The Los Altos Town Crier, by Anne Chappell Belden, has the details:</p>\n\n<blockquote>\n  <p>“Do you work here?” the man asked.</p>\n\n<p>“Yes, can I help you?” Chuck asked and instinctively moved toward\nhim. The man pulled his map aside and revealed a gun. “You’re\ncoming with me,” the man said. By then Chuck was within arms reach\nso he did not protest when the man grabbed his arm and directed\nhim into the car. He would later replay this moment dozens of\ntimes, questioning his decision to obey.</p>\n\n<p>With the gun jammed against Chuck’s ribs, the man said, “You’re\nbeing kidnapped. I want you to keep your eyes down.” He took two\nduct tape cut-outs and placed them over Chuck’s eyes. He covered\nthose with a pair of sunglasses, so no one could see from outside\nthat Chuck was blindfolded. As the car pulled away, his abductor\ntold Chuck, “If you attempt to do anything, like get away from\nus, we’ll kill you. We know where your family is. We’ll kill\nthem, too.”</p>\n</blockquote>\n\n<p>Links to parts <a href=\"https://www.losaltosonline.com/news/sections/news/215-news-briefs/20555-J18584\">two</a>, <a href=\"https://www.losaltosonline.com/news/sections/news/215-news-briefs/19811-J18582\">three</a>, and <a href=\"https://www.losaltosonline.com/news/sections/news/215-news-briefs/20557-J18585\">four</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/21/geshke-kidnapping\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c3f6bae28f02d196dff8ebdbea21baa7295499c5463a216b3eaa0300e0432cfe","category":"Tech"}