{"title":"Clive Thompson: ‘The Metaverse Is Already Here — It’s Minecraft","link":"https://debugger.medium.com/the-metaverse-is-already-here-its-minecraft-99c89ed8ba2","date":1636142765000,"content":"\n<p>Clive Thompson:</p>\n\n<blockquote>\n  <p>The truth is, a thriving metaverse already exists. It’s incredibly\nhigh-functioning, with millions of people immersed in it for hours\na day. In this metaverse, people have built uncountable custom\nworlds, and generated god knows how many profitable businesses and\nsix-figure careers. Yet this terrain looks absolutely nothing the\nlike one Zuckerberg showed off.</p>\n\n<p>It’s Minecraft, of course.</p>\n</blockquote>\n\n<p>I think this is a compelling argument. But the big difference from Zuckerberg’s stated vision is that Minecraft isn’t even just one metaverse. Minecraft alone is like millions of metaverses. Zuckerberg is talking about One True Metaverse that connects the entire world. Something, obviously, akin to Facebook’s position among “social networks”.</p>\n\n<p>Thompson:</p>\n\n<blockquote>\n  <p>This hackability is part of why the game has remained so vibrant:\nPlayers are constantly revitalizing Minecraft and inventing new\nthings you can do inside it. Third-party folks build tools like\n<a href=\"https://www.minecraftskins.com/skin-editor/\">skin editors</a> to make it easier for players to be creative.</p>\n\n<p>As a piece of software, Minecraft isn’t open-source, but it’s\n<em>very</em> friable and gas-permeable around the edges. Mojang was\nwilling to give their players a lot of control, and it’s part of\nwhy people are devoted to the game.</p>\n\n<p>I could be wrong, but I honestly can’t imagine many of the big\ntech metaverses allowing this sort of Xtreme tinkerability.</p>\n</blockquote>\n\n<p>I would argue that Minecraft’s sensational and enduring popularity isn’t <em>despite</em> the fact that it is not open source, but <em>because</em> it is not open source. Open source is not a panacea — far from it. An open source Minecraft, would likely, in my opinion, devolve into something akin to <a href=\"https://calvinandhobbes.fandom.com/wiki/Calvinball\">Calvinball</a>, where the only rule is that there are no permanent rules. A closed system that encourages and enables a rich amount of user-hackery <em>within a set of reasonable constraints</em> is almost certainly more fun and rewarding than an anything-goes free-for-all.</p>\n\n<p>(<a href=\"https://kottke.org/21/11/the-metaverse-is-here-its-called-minecraft\">Via Kottke</a>.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/05/metaverse-minecraft\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c3ffa54470026fd34206e55a1f16ed39770bc51c0a7c9677f0351b67a6abad68","category":"Tech"}