{"title":"PSII-17 Effect of protease supplementation on amino acids digestibility of soybean meal fed to growing pigs of different ages","link":"https://academic.oup.com/jas/article/102/Supplement_2/286/7664711?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Protease supplementation can increase amino acids (AA) availability; however, the effectiveness of protease in swine diets varies and has been associated with the type and dose of protease, dietary ingredients, and potentially animal age. This study investigated the interactive effect of protease inclusion level and pig age on standardized ileal digestibility (SID) of protein (CP) and AA of soybean meal (SBM) fed to growing pigs. A corn starch–based diet was formulated with SBM as the sole source of AA and containing titanium as an indigestible marker. Protease was supplemented at 0, 15,000; 30,000 and 45,000 NFP/kg of feed (ProAct 360). An N-free diet was used to estimate basal ileal endogenous AA losses. Ten cannulated pigs (body weight = 21 kg ± 2 kg) were assigned to experimental diets in a duplicate 5 × 5 Latin square design. In Phase I (23 to 30 kg-pigs, 90 ± 17 d of age), ileal digesta was collected in 5 periods of 7 d (5 d adaptation and 2 d ileal digesta collection). In Phase II (50 to 65 kg-pigs. 140 ± 17 d of age), using the same diets, ileal digesta was collected in 5 more periods of 7 d. Pigs were fed at 4% of body weight (BW) adjusted at the end of each period. Diets and ileal digesta were analyzed for CP, AA, and titanium and SID was calculated. Orthogonal polynomial contrasts were used to determine the linear and quadratic effects of protease supplementation. The combined data were analyzed as 4 x 2 factorial, including the fixed effects of protease inclusion (excluding N-free diet), age, and their interactions. In phase I, increasing levels of protease resulted in linear improved (<span>P</span> &lt; 0.1) of SID for the majority of indispensable AA (Except Arg, His, Met + Cys, and Trp) and the average of dispensable AA. In phase II, the SID of Ile, Leu, Met, Met + Cys, Val, the average of indispensable AA, and the majority of dispensable AA was quadratically improved. Overall (Phase I and II), the SID of Ile, Leu, Met + Cys, Val, Cys, Glu, Tyr, and the average of dispensable AA was quadratically improved (<span>P</span> &lt; 0.1). In most cases, the supplementation of 30,000 NFP/kg of feed resulted in the greatest AA digestibility improvements. However, the linear response in the first phase for some AA suggests that diets for younger pigs could be supplemented with a greater level (45,000 NFP/kg of feed). There were no interactions between protease levels and age. Younger pigs had improved (<span>P</span> &lt; 0.1) SID of CP and most AA (Except Cys, Gly, and Ser). In conclusion, dietary protease supplementation can improve SID of AA in soybean mean independent of pig age. Pigs age can influence AA digestibility where younger pigs have greater AA digestibility.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c4074d2acfea1397775f29881a9bf74decd4b2ac86aaaac3920239713754b6c5","category":"Environment"}