{"title":"Simultaneous Hot and Dry Extreme‐Events Increase Wetland Methane Emissions: An Assessment of Compound Extreme‐Event Impacts Using Ameriflux and FLUXNET‐CH4 Site Data Sets","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GB008201?af=R","date":1726297200000,"content":"<h2>Abstract</h2>\n<p>Wetlands are the largest natural source of global atmospheric methane (CH<sub>4</sub>). Despite advances to our understanding of changes in temperature and precipitation extremes, their impacts on carbon-rich ecosystems such as wetlands, remain significantly understudied. Here, we quantify the impacts of extreme temperature, precipitation, and dry events on wetland CH<sub>4</sub> dynamics by investigating the effects of both compound and discrete extreme-events. We use long-term climate data to identify extreme-events and 45 eddy covariance sites data sets sourced from the FLUXNET-CH<sub>4</sub> database and Ameriflux project to assess impacts on wetland CH<sub>4</sub> emissions. These findings reveal that compound hot + dry extreme-events lead to large increases in daily CH<sub>4</sub> emissions. However, per event, discrete dry-only extreme-events cause the largest total decrease in CH<sub>4</sub> emissions, due to their long duration. Despite dry-only extreme-events leading to an overall reduction in CH<sub>4</sub> emissions, enhanced fluxes are often observed for the first days of dry-only extreme-events. These effects differ depending on wetland type, where marsh sites tend to be sensitive to most types of extreme-events. Lagged impacts are significant for at least the 12 months following several types of extreme-events. These findings have implications for understanding how extreme-event impacts may evolve in the context of climate change, where changes in the frequency and intensity of temperature and precipitation extreme-events are already observed. With increasing occurrences of enhanced CH<sub>4</sub> fluxes in response to hot-only extreme-events and hot + wet extreme-events and fewer occurrences of reduced CH<sub>4</sub> fluxes during cold-only extreme-events, the impact of wetland CH<sub>4</sub> emissions on climate warming may be increasing.</p>","author":"T. J. R. Lippmann, \nY. van der Velde, \nK. Naudts, \nG. Hensgens, \nJ. E. Vonk, \nH. Dolman","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"c40d2e7f5b28042c0724b08ffc5c0e83e5b344188cd8f3505a1195320ab25505","category":"Environment"}