{"title":"Six-year monitoring of pesticide resistance in the Colorado potato beetle (<i>Leptinotarsa decemlineata</i> Say) during a neonicotinoid restriction period","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303238","date":1715004000000,"content":"<p>by Frantisek Kocourek, Petr Dolezal, Ervin Hausvater, Tereza Horska, Bruno Sopko, Petr Sedlak, Vladimira Sedlakova, Jitka Stara</p>\r\n\r\nThe Colorado potato beetle (CPB; <i>Leptinotarsa decemlineata</i>) is an important potato pest with known resistance to pyrethroids and organophosphates in Czechia. Decreased efficacy of neonicotinoids has been observed in last decade. After the restriction of using chlorpyrifos, thiacloprid and thiamethoxam by EU regulation, growers seek for information about the resistance of CPB to used insecticides and recommended antiresistant strategies. The development of CPB resistance to selected insecticides was evaluated in bioassays in 69 local populations from Czechia in 2017–2022 and in 2007–2022 in small plot experiments in Zabcice in South Moravia. The mortality in each subpopulation in the bioassays was evaluated at the field-recommended rates of insecticides to estimate the 50% and 90% lethal concentrations (LC<sub>50</sub> and LC<sub>90</sub>, respectively). High levels of CPB resistance to <i>lambda</i>-cyhalothrin and chlorpyrifos were demonstrated throughout Czechia, without significant changes between years and regions. The average mortality after application of the field-recommended rate of <i>lambda</i>-cyhalothrin was influenced by temperature before larvae were sampled for bioassays and decreased with increasing temperature in June. Downwards trends in the LC<sub>90</sub> values of chlorpyrifos and the average mortality after application of the field-recommended rate of acetamiprid in the bioassay were recorded over a 6-year period. The baseline LC<sub>50</sub> value (with 95% confidence limit) of 0.04 mg/L of chlorantraniliprole was established for Czech populations of CPBs for the purpose of resistance monitoring in the next years. Widespread resistance to pyrethroids, organophosphates and neonicotinoids was demonstrated, and changes in anti-resistant strategies to control CPBs were discussed.","author":"Frantisek Kocourek","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c4156bf048392d6f6747d8462eac6909b64c253fdee237c0e08cadf7f3ae44d4","category":"Interdisciplinary"}