{"title":"How To Organize Product-Related Assets And Collaborate Better","link":"https://smashingmagazine.com/2021/05/product-records-organization-collaboration-best-practices/","date":1620381300000,"content":"<p>So, you start working on a new product. It’s crucial to set a well-organized environment — that is, the space where you and your team interact with all <strong>product-related files and documents</strong> — right away. The amount of your assets will only grow with time, and it becomes almost unbearable to find and fix the right assets on-the-go (except perhaps for small amendments). Besides, a random structure may slow down your workflow or collapse at a certain stage of your product growth.</p>\n<p>If there are already specific rules about product assets management in your team (guidelines, principles and a preferable software), then this article might not be that applicable for your case. But if there’s nothing specific in place just yet, or you start building your product environment from scratch, then the information below can save you a lot of time and stress.</p>\n<p>At this point, you might get a feeling that the above-stated issues would concern only product owners and managers. Actually, it’s not quite true: to achieve a really <strong>effective collaboration</strong>, it’s necessary for the entire product team, including not only managers but also  researchers, designers, and editors as well, to be on the same page when it comes to the way of how workspace and assets are organized. That’s why for every team member, it’s worth to invest some time learning about product assets management and agree on collaboration rules.  </p>\n<p>The good news is that there are some <strong>well-established guidelines</strong> and best practices around the topic. I have learned some principles the hard way, and below you’ll find an overview of what worked and didn’t work for me. I’m a startup co-founder now, so I handle my own product, and I used to be the managing director of content departments of large teams. In part, I led an e-learning product with 700 students and 20 lecturers, and built a 10-members remote editorial team from scratch two times.</p>\n<p>It may take you a while to understand why certain ways of working are necessary, but, speaking from my experience, it will pay back. The article will be useful for product specialists in small teams that start building their environment from scratch, or want to revise their product records management skills.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a34dbba4-5f7f-45f7-ad74-40100c856b2f/2-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Compare the two folders above. One is a folder with random files displayed in a Google Drive, and the other provides some structure for all your assets across folders. Of course, it would be easier for you to find, say, your July report for investors if everyone on the team named and structured their assets consistently.</p>\n<p>Let’s have a look at how to do that.</p>\n<h3>Product Records 101</h3>\n<p>So, as designers and developers, we know how to organize and maintain our code and design assets, but what about overall product records at large? There are plenty of common assets that would fall under the \"<strong>Product records</strong>\" category:</p>\n<ul>\n<li>Market research, business plans</li>\n<li>UX assets: UX tests, copy docs, etc.</li>\n<li>Editorial policy</li>\n<li>Development timeline</li>\n<li>Various specifications</li>\n<li>Contracts, invoices and templates</li>\n<li>Presentations, pitch decks, one-pagers, etc.</li>\n<li>Investors' reports</li>\n</ul>\n<p>It all boils down to adopting a shared understanding of the company’s culture, so that every team member is aligned, and can follow along in their work to avoid costly mistakes. It includes managing documents, working with content, dealing with reports, keeping testing records, collaboration and discussions. </p>\n<p>Let’s explore some of the principles that could help get there. And we’ll start with the mindset.</p>\n<h3>Mindset</h3>\n<p>These are some basic principles when building the environment:</p>\n<ul>\n<li>The records should be accessible <em>any</em> time for <em>everybody</em> who is authorized; there shouldn’t be any “head keeper” of product records (a bottleneck, actually).</li>\n<li>The records should be accessible from <em>anywhere</em>.</li>\n<li>The records should be robust, i.e. it should be hard to break something irreversibly by accident.</li>\n<li>The access control should be pre-defined, understandable, and easily manageable.</li>\n<li>It should be easy to jump in for newcomers.</li>\n<li>It should be easy to hand out the assets to outside collaborators.</li>\n</ul>\n<p>But how do we achieve all of it in practice? </p>\n<h3>Concepts And Tools</h3>\n<p>First, let’s define the subject more precisely. When speaking of environment, we are speaking about product assets, not tasks. To understand what piece of information actually is an <em>asset</em>, and what is a <em>task</em>, we need to ask ourselves whether this information would be relevant during the whole product lifecycle, or will it be archived as soon as it is resolved.</p>\n<p>Usually, we use content applications for long-term assets, and task managers for time-limited activities.</p>\n<p>What applications do we choose? Any: it’s your personal preference. We can use any tools in any combination — we just need to make sure that it’s a cloud application that synchronizes across different users and devices.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/33df345b-2f08-44f3-abe2-feafddf30966/8-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Personally, I’m a fan of Google Drive because of its simplicity, accessibility and ease of use for my not-so-tech-savvy colleagues. A good alternative to Google Drive tools is Dropbox and Dropbox Paper. And there’s Notion, another popular application — it’s a combination of a task manager and a content keeper. Of course, it’s not an exhaustive list, but they work well for me.</p>\n<p>OK, enough talking, let’s organize our files.</p>\n<h3>How To Create A Well-Organized Workspace</h3>\n<h4>Start With A Simple Arrangement And Adjust It Later</h4>\n<p>So, you have several files that you want to organize. Don’t spend too much time and effort to create a perfect set of folders or sections at once. Start with the simplest arrangement, then watch how you use your workspace, and add, merge, or remove folders or sections on-the-go.</p>\n<p>Why? </p>\n<p>First, you never know how your product will evolve, and second, keep in mind that all organizational activities are still secondary ones, so we probably don’t want to get exhausted with preparations before we come down to our work tasks. So it’s a good idea to start with a general structure and watch how you’re using it for a while — and then review it. In iterations.</p>\n<p>In part, it’s a good idea to create a folder called <em>Sandbox</em> and move all the documents that don’t fit in already defined categories — e.g. if you spend more than 3s wondering where to place or localte them. You can define new rules for these documents later.</p>\n<h4>Have A Weekly 10-min Clean-up</h4>\n<p>I can’t express what a time-saver it is! I <em>really</em> mean it. Schedule the 10-minutes clean-up for every week, and use this time to go through your records, adjust file names, check their consistency, or tweak the structure of your folders and sections.</p>\n<p>Oh, is everything perfect? Well, you can use this time to get a coffee or meditate for a while — it’s really useful in all aspects.</p>\n<h3>The Principles of Files Navigation</h3>\n<h4>Create An Index Document With Links To Everything</h4>\n<p>When the amount of documents and assets grows, it’s a good idea to create an overview page of all sets that exist in the folder. Think of it as a front page of your project that reveals all the main components of it.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/66f35989-e35a-4043-ba64-1b7912de2a45/18-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>What would you include in such a document?</p>\n<ul>\n<li><strong>Onboarding Tips</strong><br />A guide that may feature a list of your team members and their roles, i.e., the information you want to pass to a newcomer. To create it, the next time you onboard a new team members, pay attention and record all the messages you send to them. Create a template of these messages, organize them and put them together.</li>\n<li><strong>Design Files</strong><br />Links to Figma or Sketch files, illustrations, etc.</li>\n<li><strong>Information Architecture</strong><br />Usually, a link to Miro or Airtables.</li>\n<li><strong>Product Assets</strong><br />A Google Drive or Dropbox folder link.</li>\n<li><strong>Tech Stack</strong><br />An explanation of the technical setup used for a product, perhaps with important tools to install or use.</li>\n<li><strong>Press Kit And Marketing Materials</strong><br />Your branding material, interface demo snapshots, and similar assets.</li>\n<li><strong>Presentations, One-Pagers, Pitches</strong><br />Anything you usually send out to tell more about your product, or pitch your idea.</li>\n<li><strong>Business Assets</strong><br />100-day plan, unit economy calculation, etc.</li>\n<li>Other resources and documents that you actively use. </li>\n</ul>\n<p>Such a list eliminates unnecessary questions and rounds of emails with lost attachments. It also proves especially precious when you’re on a call and want to quickly open a file and share it with your colleagues.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2f505a4e-c155-458d-9901-c7e4d7a73d44/21-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>One thing to avoid though is copying assets from one folder to another, or from one application to another. We’ll discuss it later in the article.</p>\n<h4>Use Tags In Document Names</h4>\n<p>When you create a document, consider adding a <em>prefix</em>, or <em>tag</em>, in its title. A tag reflects categories that the document belongs to.</p>\n<p>This way, you’ll navigate files more easily and won’t get confused if you are simultaneously working on similar documents from different projects — say, when you have an index document in your [First] and [Second] projects.</p>\n<p>It also helps to navigate between them with dozens of open browser tabs.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3a2ffa45-9238-4b0f-a485-644d1adf274c/16-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Some useful tags:</p>\n<ul>\n<li><strong>[Draft]</strong> or <strong>[WIP]</strong>: for documents that are still in progress.</li>\n<li><strong>[Old]</strong> or <strong>[Arch]</strong>: for documents that are no longer relevant.</li>\n<li><strong>[EN]</strong>, <strong>[ES]</strong>, or <strong>[UA]</strong>: for multi-lingual documents.</li>\n<li><strong>[Jessy]</strong>: if you’re working with outside collaborators.</li>\n<li>Last but not least, an abbreviation of your project name (e.g. <strong>[SM]</strong> for Smashing Magazine, and so on).</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2cbbd860-a145-4198-a63e-61dafad37adf/14-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Again, start with those tags that suit you and add more if necessary. Just keep their consistency in mind — say, if you use the tag [WIP] for documents that aren’t ready yet, stick to it and don’t use [Draft] in such cases. Sounds obvious, but sometimes happens unconsciously. Otherwise, it’ll be hard to find necessary files later.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/79daa865-7ce7-433f-984b-7920f0ac99b9/5-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>The same guideline also applies to folder names.</p>\n<h3>Principles Of Editing</h3>\n<h4>Use Emoji For Smart Statuses</h4>\n<p>This might sound a bit uncommon, but emojiscan be a great visual navigation tool because they are different from the rest of the content. For example, you could add emoji in headings or tables to indicate the current status of a document. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7d31aa7c-ee8f-43e0-bfd9-968dfd392665/1-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>You could use emoji for your sections or folders. And it also could work in very different settings — e.g. in UI editing apps, such as Figma or Sketch.</p>\n<p>In fact, you could come up with a <strong>special system of labeling</strong>: say, a green circle for finished items and an orange diamond for work in progress (don’t forget about accessibility: the elements should differ not only in color but in shape as well). Also, consider adding a legend for everyone to consult if necessary.</p>\n<h4>Highlight And Comment On Changes</h4>\n<p>If you change some part of a document, it’s a good practice to let your teammates know about the changes when they see the document next time.</p>\n<p>For this, we use highlights.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4677431a-3015-4c28-a276-0dfbe902a70b/19-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>You can also highlight the parts on which you’re currently working. It’s especially helpful when you’re working with large files and have several unfinished and scattered chunks. This way, you reduce the chances to miss out on some unfinished parts since you’ll spot them when revising the file. It works for all kinds of documents actually — from Google Docs articles to Figma boards.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/770fa1a5-db0a-44e5-b87b-7794e7fc095c/15-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Besides, at every point, your colleagues will know at what stage each part actually is. </p>\n<h4>Use Default Styles</h4>\n<p>There is always a temptation to set your own fonts and colors in a doc. But generally, there’s no use in it, just an extra effort. So, agree on generaly type setting, and stick to these default styles for your internal documentation.</p>\n<h4>Be Careful With Markup</h4>\n<p>Every app supports anchors, bookmarks, cross-links, and other types of content elements that you can refer to.</p>\n<p>For example, when you share a large document, you might want to point to a particular place there. In apps like Google Docs you can add a bookmark and it will generate a sharing link to that bookmark. On opening such a link, the cursor will jump to the bookmark with a small delay.</p>\n<p>There are the same <strong>anchor links for comments</strong>, too.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/533b3c4e-d4b9-4580-8340-528bee2d3ccc/3-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>They’re all useful features, but keep in mind that these elements are not that robust compared to a regular link, pasted in the body of the document or message. For example, if you look at the image below, in the message to the left I added links to Google Docs bookmarks without any notes. If the bookmark disappears, the person will be redirected to the beginning of the page and will have no idea what spot was meant.</p>\n<p>In the message to the right, I used bookmarks as a supporting tool and added a short description of what parts should be updated. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d2370a3e-679e-44ea-bf36-47ba886769d7/6-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>So, the golden rule I tend to stick to is to use <strong>links to bookmarks</strong> and alike as a supportive tool, but still note the <em>spot-in-question</em>, i.e. the context of what is linked to.</p>\n<p>The same applies to <strong>references</strong> inside a document or a page: if you need to add a link redirecting somewhere, don’t forget to explain the item you’re referring to.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6c39946f-9a41-4bac-a136-3c8b7a4e0d01/12-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Actually, I borrowed this principle from my university course in translation. It’s called <em>infoglut</em>, and it states that if you need to get a message across asynchronously, you should <strong>enclose the main concept at least twice</strong> there. This way you minimize the chances of misinterpretation if some bits of the message are lost.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f056097a-cccd-4e6c-b593-2b4f12e51749/11-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>It’s not about redundancy — it’s about being robust.</p>\n<h3>Version Control Principles</h3>\n<h4>Keep Only One Up-To-Date Version</h4>\n<p>If a document should be featured in two places simultaneously, never duplicate it. Instead, use links or shortcuts.</p>\n<p>The same applies to any asset. Especially when you use several tools at a time. For example, if you make an index list of your product assets (the “front page”) in a Google Doc, then don’t create a corresponding list of links in a Notion workspace and vice versa.</p>\n<p>The reason is simple: avoid doubling the effort to <strong>keep both files up-to-date</strong>. You’re just more likely to come to a frustrating situation when you have two active files that differ a little this way.</p>\n<h4>Don’t Multiply Assets</h4>\n<p>If you have a document that falls under several categories — say, you have a copy doc of your landing page in your <em>Design</em> folder and want to add it to your proofreader’s folder so they can edit it, — avoid duplicating this document.</p>\n<p>Instead, make a shortcut.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/af678f85-a01a-4b67-a57a-5a1192981a85/4-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>In the example above, I’m using a native shortcut tool in Google Drive but of course you can create a document with a link to the file in another applications the same way.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/88eef598-5a28-4d45-aacd-f3faa11f4ab2/13-product-records-organization-collaboration-best-practices.png\" /></p>\n<h4>Don’t Delete Outdated Documents — Add Backlinks</h4>\n<p>Ah, that’s another useful tip that proved to be handy for me. Say, you’ve revised the entire document, and now the previous version is no longer relevant.</p>\n<p>What to do with the outdated document? Don’t delete it — there’s a good chance that you will be opening this link since it’s already saved in your browser history, or that it is bookmarked by one of your colleagues, or it is linked in another file.</p>\n<p>However, it’s not an option to leave it as is. What to do in such a case? Well, there are a few options.</p>\n<ol>\n<li><strong>Change its appearance</strong>; say, make the text color magenta or apply strikethrough style (or both).</li>\n<li>Add a <strong>tag</strong> in the filename, like [OLD] or [Arch].</li>\n<li>Add an <strong>explanation</strong> and link to the new version.</li>\n</ol>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2031d3d0-02c4-4c47-9e05-849c9b82d138/17-product-records-organization-collaboration-best-practices.png\" /></p>\n<h3>Access Management Principles</h3>\n<h4>Create All New Documents In The Team Folder</h4>\n<p>What differs between an offline folder and a cloud folder? Collaboration options, of course! Ask your colleagues to make a habit of creating new documents within a team folder instead of moving them there afterwards. It just saves unnecessary emails and text messages.</p>\n<h4>Share Items Via A Sharing Tool</h4>\n<p>If you work in a browser window and need to share a link to a file, your first hunch will be to copy it from the address bar. </p>\n<p>But be careful. In many apps, this way you will share the link to your <strong>private workspace</strong> but not for the public version of the file. Or just share a restricted document, not giving the right access. Of course, this will end up with people waiting for your approval, or unnecessary emails which you have to process one-by-one.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1c362eb5-c5c8-40fe-9595-0f5ba4f7d000/20-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>Make it a habit to share files and documents via their <strong>native sharing tool</strong>. At some point, it will literally save your life (or, at least, your vacation.)</p>\n<h3>Collaboration Principles</h3>\n<p>This section is specific primarily to cloud content editors.</p>\n<h4>Don’t Resolve Others’ Comments — Reply Done Instead</h4>\n<p>Say, you’re an author and you’re discussing some points with your editor. You made some changes and believe that the discussion is over. In that case, <strong>don’t resolve their comments</strong> — just reply DONE and always let the person who started the conversation resolve it.</p>\n<p>This way, the person can check the final result and, if they agree with it, resolve the issue themselves. Or, if it were you who started the discussion, then you’ll be able to accept or reject the changes without re-reading the whole document, trying to spot the changes made.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/501cf24a-f5c4-45bd-8769-41f26c3fbe90/22-product-records-organization-collaboration-best-practices.png\" /></p>\n<h4>Be Careful With Comments And Suggestions</h4>\n<p>Suggestions and comments allow an editor to <strong>suggest their changes</strong> without altering the original text, but a viewer won’t see them if they access the document in a view-only or guest mode.</p>\n<p>So use comments and suggestions <strong>only for team collaboration</strong> but not for leaving regular annotations in the document. For such cases, I prefer leaving my annotations in the body of the text in different fonts and colors.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/eddfb658-0e71-4d24-9001-65f7135d867f/7-product-records-organization-collaboration-best-practices.png\" /></p>\n<h3>More Tips For a Productive Workflow</h3>\n<h4>Use Shortcuts</h4>\n<p>This piece of advice isn’t very unexpected, but I just can’t help repeating it. For me, the easiest way to learn new shortcuts is to pick, say, a <strong>set of three</strong> at a time, use them until it becomes fully automated for you, and only then go for another portion of three. Don’t try to encompass all of them at once, it’s way too difficult.</p>\n<p>Thus, if you work with Google Drive, then look at these five most useful ones:</p>\n<ul>\n<li>Cmd/Ctrl + F to find some text.</li>\n<li>Cmd/Ctrl + Alt/Option + h1/h2/h3 to make corresponding headings.</li>\n<li>Cmd/Ctrl + Shift + C to show the word and character count statistics of the document and the selected piece.</li>\n<li>Cmd/Ctrl + Enter for a page break.</li>\n<li>Cmd/Ctrl + Shift + X for strikethrough text style.</li>\n</ul>\n<p>You can also take a look at the <a href=\"https://support.google.com/docs/answer/179738?co=GENIE.Platform%3DDesktop&amp;hl=en\">whole list of Google Drive shortcuts</a>.  </p>\n<p>If we take Notion, these are my favourite ones: </p>\n<ul>\n<li>All <code>/</code> (slash) commands that create certain content blocks; <code>/todo</code> is on the top of my list.</li>\n<li>Cmd/Ctrl + A to select a block where my cursor is.</li>\n<li>Using <code>[[ + page name</code> to create a link to it.</li>\n</ul>\n<p>The Notion team also provides a <a href=\"https://www.notion.so/Learn-the-shortcuts-66e28cec810548c3a4061513126766b0\">comprehensive list of all the Notion shortcuts</a>.</p>\n<p>This is what works best for my flow, but surely you can think of another set that suits your needs best. </p>\n<h4>Set Up A Separate Email Folder For Notifications</h4>\n<p>A separate email folder will help you avoid being overwhelmed with identical emails and miss the important ones. But I’d strongly recommend not turning off email notifications. What to do, then? Separate folders with rules. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/23145ede-c005-4c34-9c63-1c31d04eb3d5/10-product-records-organization-collaboration-best-practices.png\" /></p>\n<p>I leave notification badges but I have all such emails automatically marked as read. Plus, with such a system in place, you can automatically group emails and get an overview of what requires my attention and what has been work in progress.</p>\n<h4>Use A Grammar Correction Extension</h4>\n<p>A grammar correction tool highlights your typos and suggests better ways to formulate your sentences. There are several products with a desktop app and/or a browser extension that works in every content environment.</p>\n<h3>A Product Assets Folder Structure With A Template</h3>\n<p>Right now, I’m working on my own startup and we’re constantly applying all these principles to our file management processes. I’ve simplified our structure and made a <strong>default folder you can use</strong> and customize:</p>\n<ul>\n<li><a href=\"https://www.dropbox.com/s/u81u02irff256mb/SM-Product-Assets.zip?dl=0\">Download the Product Assets template</a> (ZIP, Dropbox)</li>\n</ul>\n<p>With this template, you can easily replicate the same structure in your favorite cloud app — be it Dropbox, Google Drive, or pretty much anything else. If you want to try the Notion app, <a href=\"https://www.notion.so/Notion-Template-Gallery-181e961aeb5c4ee6915307c0dfd5156d\">start by using their templates</a> (“Company home” or “Product Wiki” are useful for long-term assets and “Roadmap” can be used as a task management tool), and adjust it on the go. If you use a different app, you can look at both structures and create your perfect combined workspace. </p>\n<p>Let’s get the assets organized! And please share your best practices in the comments!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"c41773adc7ee46e917088e7a41f616a7e6a5f46ed63fd3a9aa0723472f636416","category":"Tech"}