{"title":"Google says bumpy Pixel 8 screens are nothing to worry about","link":"https://arstechnica.com/?p=1986396","date":1701111857000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/C6OD5Vt-980x1307.jpeg\" /></div>\n          <p>\n            Those are some strange bumps at the top of the screen.                           [credit:\n                              <a href=\"https://www.reddit.com/r/GooglePixel/comments/176zb1v/weird_bumps_under_screen/\">temperlancer</a>\n                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Pixel phones <a href=\"https://arstechnica.com/gadgets/2023/01/google-pixel-7-users-say-defective-camera-lens-will-spontaneously-shatter/\">always</a> <a href=\"https://arstechnica.com/gadgets/2020/11/google-says-the-pixel-5s-uneven-panel-gaps-are-nothing-to-worry-about/\">seem</a> to ship with some bizarre hardware malady, and this year it's that not all the parts fit inside the phone quite right. Some users are reporting \"bumpy\" screens on their Pixel 8 and 8 Pros. The bumps aren't in the top surface, which is still smooth glass, but in the OLED display <em>under</em> the glass, which can show raised, usually circular bumps. It looks like components inside the phone are pressing up against the back of the OLED display, resulting in visible bumps under the right lighting conditions. Google gave a statement about the issue to <a href=\"https://9to5google.com/2023/11/22/pixel-8-pro-display-bumps/\">9to5Google</a> and says it's nothing to worry about.</p>\n<blockquote><p>Pixel 8 phones have a new display. When the screen is turned off, not in use and in specific lighting conditions, some users may see impressions from components in the device that look like small bumps. There is no functional impact to Pixel 8 performance or durability.</p></blockquote>\n<p>That's certainly an interesting take. All phones come with \"new\" displays, so what exactly does that first sentence mean? The bumps definitely aren't on every Pixel 8, and even the bumpy displays aren't noticeable in normal usage. The pictures and videos out there all involve people shining flashlights into a turned-off display, so it's not the end of the world. It's just worrying to have the delicate OLED panel be <em>dented</em> by internal components. Is this going to be ok long-term? Does this make the glass or OLED panel more susceptible to breaking after a shock? It's certainly not normal phone construction.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-12.29.10-PM-1.jpg\"><img alt=\"We count eight puncture marks in the back of this Pixel 8 Pro display. Check out the &lt;a href=&quot;https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-12.29.10-PM-1.jpg&quot;&gt;full-res version.&lt;/a&gt;\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-12.29.10-PM-1-980x735.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-12.29.10-PM-1.jpg\">We count eight puncture marks in the back of this Pixel 8 Pro display. Check out the </a><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-12.29.10-PM-1.jpg\">full-res version.</a> (credit: <a href=\"https://youtu.be/0poyvpB7Fkw?t=193\">JerryRigEverything</a>)</p></div>\n<p>Match up anyone's pockmark video with a teardown and you'll usually be able to spot the offending item. It's usually screw heads, spring clips designed to ground some component to the display copper, or the corners of some other component poking through. No one item accounts for every pockmark, so the components seem just a little too close to the display on some models. YouTuber <a href=\"https://youtu.be/0poyvpB7Fkw?t=193\">JerryRigEverything</a> actually took apart a Pixel 8 Pro that had a bumpy screen. It wasn't noted in the video, but freeze-frame it and you'll see some pretty alarming indents in the copper sheet on the back of the display that you can try to match up to the other half of the phone. They are almost puncture marks!</p></div><p><a href=\"https://arstechnica.com/?p=1986396#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986396&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c41921d6ddf52a2373d4db7b32f5522cda339cb8788bec14f90455679adcbec7","category":"Tech"}