{"title":"Information Value Model Based Mapping of Updated Spatial and Temporal Landslide Susceptibility: A Case Study from East Sikkim District, India&rsquo;s Northeastern Himalayas","link":"https://www.preprints.org/manuscript/202404.0066/v1","date":1712054883000,"content":"The Indian Himalayan Region (IHR), due to its topography, geography, and active\ntectonics, a rough mountain zone, is among the most vulnerable zones to the landslip\ndanger. The most cutting-edge and accurate ways for creating a landslip susceptibility\nmodel (LSM) are advanced statistical techniques. The goal of the current work was to\nuse advanced statistical techniques to analyse and evaluate the updated landslip\nsusceptibility for East District in the NE Himalayas of Sikkim, India. The spatiotemporal\nlandslip inventory for the years are produced using literature surveys, historical\nsatellite imageries and on-site observations. Slope, aspect, elevation, curvature, plane\ncurvature, profile curvature, topographic wetness index (TWI), lithology, distance to\nfaults, distance to streams, distance to roads, normalised difference vegetation index\n(NDVI), rainfall, drainage density and land use/ land cover (LULC) are some of the\ntopographic, environmental, geologic, and anthropogenic factors that were included in\nthe spatial database. These LCFs were chosen to study the area's periodic landslip\nvulnerability. An inventory of 151 landslides from historical published records, field\nvisits and Imagery interpretations, respectively, were used in the experimental design.\nInformation Value Model (IVM), was used to evaluate the vulnerability to landslides as\ndetermined by fifteen LCFs. The goal of the study is to reduce the number of fatalities\nand possible economic harm caused by the region's frequent slope instabilities. It is\nexpected that the application of statistical algorithms would assist relevant authorities\nand organisations in properly planning for and managing the region's landslip threat.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c42145d71ddcabccc5e8425c474495933a9ab73a495ef35094e1d53485c645d0","category":"Interdisciplinary"}