{"title":"Apple Gives Developers More Insight Into App Performance With Over 50 New Analytics Reports","link":"https://www.macrumors.com/2024/03/05/apple-new-developer-analytics-reports/","date":1709667955000,"content":"Alongside the app ecosystem changes that Apple is making in the European Union to comply with the Digital Markets Act, Apple has introduced new analytics information that's available to developers around the world.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/09/apple-developer-banner.jpeg\" width=\"1024\" height=\"572\" />\r<br />\nThere are more than 50 reports that are available through the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> Connect API, with these reports aimed at giving developers more insight into their app performance. Apple added ‌App Store‌, iOS, and CloudKit data analytics that provide hundreds of new metrics.\r<br />\n\r<br />\nSome of the new reports <a href=\"https://www.macrumors.com/2024/01/25/apple-developer-analytics-expansion/\">were shared</a> back when Apple's app changes were first announced in January.\r<br />\n<ul>\r<br />\n \t<li><strong>App Store Engagement</strong> - Apple is offering additional insight into the number of users on the ‌App Store‌ that interact with a developer's app or share it with other people.</li>\r<br />\n \t<li><strong>App Store Commerce</strong> - Developers can get more information on downloads, sales and proceeds, pre-orders, and transactions made with the In-App Purchase system.</li>\r<br />\n \t<li><strong>App Usage</strong> - Apple now provides more information on crashes, active devices, installs, app deletions, and more.</li>\r<br />\n \t<li><strong>Frameworks Usage</strong> - Developers can get info on their app's interaction with iOS features like <a href=\"https://www.macrumors.com/guide/home-screen/\">Widgets</a>, <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a>, and PhotoPicker.</li>\r<br />\n \t<li><strong>Performance</strong> - Apple offers insights into how apps perform and how users are interacting with specific app features.</li>\r<br />\n</ul>\r<br />\nThe CloudKit console is also being updated with data about Apple Push Notifications and File Provider.\r<br />\n\r<br />\nApple anonymizes the data that is used in the new report options, and developers can also now grant third-party access to their performance reports.\r<br />\n\r<br />\nMore information on the new analytics reports will be provided by Apple later today.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/05/apple-new-developer-analytics-reports/\">Apple Gives Developers More Insight Into App Performance With Over 50 New Analytics Reports</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-gives-developers-more-insight-into-app-performance-with-over-50-new-analytics-reports.2421140/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c42c3ba2173e9ff70b1b03c1352ace525b478d9e0f0c3a157b4ba0d47952ca57","category":"Apple"}