{"title":"iOS 14.5: How to Automatically Download New Podcast Episodes and Follow Shows","link":"https://www.macrumors.com/how-to/download-apple-podcast-episodes-automatically/","date":1619569319000,"content":"In iOS 14.5, Apple has made some notable changes to its native Podcasts app. Some of these changes reflect the fact that Apple <a href=\"https://www.macrumors.com/2021/04/20/apple-announces-apple-podcast-subscriptions/\">announced</a> an optional paid podcast subscription service (beginning May 2021), while others are interface improvements to make it easier to find, follow, and listen to new episodes. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Apple-Podcasts-iOS-14-5.jpg\" />\r\n<br />\r\nOne example of these changes is the new Smart play button, which is designed to help you automatically start episodic shows from the latest episode and serialized shows from the beginning of each series. The Smart play button also display Resume if you've already listened to some of an episode but have yet to finish it.\r\n<br />\r\n\r\n<br />\r\nAnother notable change is in the Search tab, which now offers quick access to Top Charts and categories below the search input field, much like <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> search. Other tweaks include larger podcast artwork and a rejigged show page that has a more logical arrangement and is more aesthetically appealing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/podcast-app-design-changes.jpg\" />\r\n<br />\r\nPerhaps most importantly, the way you \"subscribe\" to shows and download episodes has changed. Keep reading to learn how.\r\n<br />\r\n\r\n<br />\r\n<h2>How to Follow Shows</h2>\r\n<br />\r\nIn previous versions of iOS, you could \"subscribe\" to shows in Apple's Podcasts app. But now that Apple offers a paid podcast subscription mode, it has removed the \"subscribe\" language from the app entirely and replaced it with Follow options, which should make things less confusing.\r\n<br />\r\n\r\n<br />\r\nDespite the new terminology, following a podcast offers the same functionality as subscribing had before it. Namely, it means that you'll stay up-to-date with new show episodes as they're published and you'll be able to download them individually.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/ios-14-5-podcasts.jpg\" />\r\n<br />\r\nTo follow a show, select one by browsing the <strong>Podcasts</strong> section, or search for one using the <strong>Search</strong> tab, then tap the <strong>plus</strong> (<strong>+</strong>) icon in the top-right corner of the Show's page. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/podcast-app-ios-14-5.jpg\" />\r\n<br />\r\nTo stop following a show, tap the <strong>tick icon</strong> and select <strong>Unfollow Show</strong>. You can also follow or unfollow shows by using the dropdown options that appear when you tap the <strong>More icon</strong> (three dots in a circle).\r\n<br />\r\n\r\n<br />\r\n<h2>How to Automatically Download New Episodes</h2>\r\n<br />\r\nIn previous versions of the Podcasts app, you had to add a show to your library before you could download new episodes. In iOS 14.5 and later, that's no longer the case, and you can download individual episodes right from a show's page. \r\n<br />\r\n\r\n<br />\r\nTo download an episode, tap the <strong>ellipsis icon</strong> (three dots) to the right of its card and select <strong>Download Episode</strong> from the pop-up menu. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/podcast-app-download-episodes-e1619540745497.jpg\" />\r\n<br />\r\nAlternately, you can long press on an episode and the same pop-up menu will appear with the <strong>Download Episode</strong> option at the bottom. If the episode is already downloaded, the option appears as <strong>Remove Download</strong> instead.\r\n<br />\r\n\r\n<br />\r\nIf you're already following a show, you can turn off automatic downloads: Tap the <strong>tick icon</strong> at the top of a show page and select <strong>Turn Off Automatic Downloads</strong>. To turn them back on again, tap the <strong>down arrow icon</strong> that replaced the tick icon, and select <strong>Turn On Automatic Downloads</strong>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a>, <a href=\"https://www.macrumors.com/roundup/ipados-14/\">iPadOS 14</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/podcasts/\">Podcasts</a>, <a href=\"https://www.macrumors.com/guide/ios-14-5-features/\">iOS 14.5 Features</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/download-apple-podcast-episodes-automatically/\">iOS 14.5: How to Automatically Download New Podcast Episodes and Follow Shows</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-14-5-how-to-automatically-download-new-podcast-episodes-and-follow-shows.2293613/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qnjbOfHGvDg:kBuUmC-rMwg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qnjbOfHGvDg:kBuUmC-rMwg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/qnjbOfHGvDg\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c43a699a3080d86e0ee106c1a5aa25545682da170cfabc326c471c3240e31730","category":"Apple"}