{"title":"How does a motor or cognitive dual-task affect our sense of upper limb proprioception?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299856","date":1710943200000,"content":"<p>by Amanda L. Ager, Ann M. Cools, Dorien Borms, Jean-Sébastien Roy</p>\r\nBackground <p>Daily upper limb activities require multitasking and our division of attention. How we allocate our attention can be studied using dual-task interference (DTi). Given the vital role proprioception plays in movement planning and motor control, it is important to investigate how conscious upper limb proprioception is impacted by DTi through cognitive and motor interference.</p> Purpose <p>To examine how dual-task interference impacts conscious upper limb proprioception during active joint repositioning tasks (AJRT).</p> Methods <p>Forty-two healthy participants, aged between 18 and 35, took part in this cross-sectional study. Participants completed two AJRT during three conditions: baseline (single task), dual-cognitive task (serial subtractions), and dual-motor task (non-dominant hand movements). The proprioceptive error (PE; difference between their estimation and targeted position) was measured using an AJRT of 75% and 90% of maximum internal rotation using the Biodex System III<sup>TM</sup> and the Upper Limb Proprioception Reaching Test (PRO-Reach). To determine if PEs differed during dual-task interference, interference change scores from baseline were used with one sample <i>t</i>-tests and analyses of variance.</p> Results <p>The overall mean PE with the Biodex was 4.1° ± 1.9 at baseline. Mean change scores from baseline reflect a mean improvement of 1.5° ± 1.0 (<i>p</i> &lt; .001) during dual-cognitive task and of 1.5° ± 1.2 (<i>p</i> &lt; .001) during dual-motor task. The overall mean PE with the PRO-Reach was 4.4cm ± 1.1 at baseline. Mean change scores from baseline reflect a mean worsening of 1.0cm ± 1.1 (<i>p</i> &lt; .001) during dual-cognitive task and improvement of 0.8cm ± 0.6 (<i>p</i> &lt; .001) during dual-motor task. Analysis of variance with the Biodex PEs revealed an interference effect (<i>p</i> &lt; .001), with the cognitive condition causing greater PEs compared to the motor condition and a criterion position effect (<i>p</i> = .006), where 75% of maximum IR produced larger PEs during both interference conditions. An interference effect (<i>p</i> = .022) with the PRO-Reach PEs was found highlighting a difference between the cognitive and motor conditions, with decreased PEs during the contralateral motor task.</p> Conclusion <p>Interference tasks did impact proprioception. Cognitive interference produced mixed results, whereas improved proprioception was seen during motor interference. Individual task prioritization strategies are possible, where each person may choose their own attention strategy when faced with dual-task interference.</p>","author":"Amanda L. Ager","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c4455a5025519a16aee2e602cbbcca0dd1afb9a7d2e25bc07a1e1a6e2bd9e5ee","category":"Interdisciplinary"}