{"title":"Meta ปฎิเสธข้อเสนอ Oversight Board ให้ระงับบัญชีเฟชบุ๊ก ฮุน เซน อดีตนายกกัมพูชา","link":"https://www.blognone.com/node/135528","date":1693454262000,"content":"<div><div><div><p>Meta ปฏิเสธข้อแนะนำจาก <a href=\"https://www.blognone.com/node/119945\">Oversight Board (คณะกรรมการอิสระตรวจสอบอำนาจการใช้นโยบายของ Facebook)</a> ที่เสนอให้ระงับบัญชีของฮุนเซนอดีตนายกรัฐมนตรีกัมพูชา (เพิ่งลาออกเมื่อเดือนที่แล้ว) เนื่องจากมีการโพสต์วิดีโอข่มขู่ฝ่ายตรงข้าม</p>\n<p>กรณีดังกล่าวเกิดขึ้นเมื่อเดือนมกราคมที่มีผู้ใช้หลายคนรายงานวิดีโอ ซึ่งมีเนื้อหาระบุอดีตนายกฮุน เซน บอกว่าผู้ที่กล่าวหาว่าพรรคประชาชนกัมพูชา (CPP) ซื้อเสียงในปี 2565 ในการเลือกตั้งท้องถิ่น ควรถูกยื่นฟ้องร้องดำเนินคดีตามกฎหมาย ไม่เช่นนั้นจะถูกรุมทุบตี (face a beating) จากเหล่าผู้สนับสนุนพรรค CPP</p>\n<p>ต่อมาในเดือนมิถุนายน Oversight board แนะนำให้ทาง Meta ระงับบัญชีของอดีตนายกฮุน เซนเป็นเวลา 6 เดือน จากกรณีโพสต์คลิปวิดีโอที่ถูกระบุว่าละเมิดด้านการคุกคามและทาง Meta ตกลงที่จะลบวิดีโอออกจากแพลตฟอร์มเฟชบุ๊ก และจะดำเนินการพิจารณาข้อเสนอของ Oversight board ที่แนะให้ระงับบัญชีของฮุนเซน</p>\n<p>ล่าสุดวันจันทร์ Meta ประกาศปฎิเสธข้อเสนอระงับบัญชีอดีตนายกฮุน เซน โดยระบุว่า “ทางบริษัทพิจารณาแล้วว่า “การระงับบัญชีที่อยู่นอกเหนือกรอบการบังคับใช้กฎระเบียบ ซึ่งไม่สอดคล้องกับนโยบายของเรา รวมถึงระเบียบในการจำกัดบัญชีของบุคคลสาธารณะในช่วงที่เกิดเหตุการณ์ความไม่สงบ”</p>\n<p>Oversight board ยังคงมีการเรียกร้องให้ทาง Meta ยังยั้งการใช้แพลตฟอร์มจากบุคคลสาธารณะที่ใช้ประโยชน์จากแพลตฟอร์มเพื่อปลุกปั่นความรุนแรง และให้แน่ใจว่าจะไม่ถูกนำไปใช้ในทางที่ผิด</p>\n<p>ทางเพจเฟชบุ๊กของกระทรวงโทรคมนาคมของกัมพูชาได้โพสต์แสดงความยินดีสำหรับผลการตัดสินของเฟชบุ๊ก และกล่าวว่าข้อเสนอแนะจากทาง Oversight board มีลักษณะเป็นการแทรกแซงการเมืองในกัมพูชา</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f80c58dc8ef5f93887ceea3d9b260c13.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.straitstimes.com/asia/meta-rejects-recommendation-to-suspend-former-cambodia-pm-from-facebook?utm_source=twitter&amp;utm_medium=social-organic&amp;utm_keyword=dlvr.it\">Straits Time</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/politics\">Politics</a></div><div><a href=\"/topics/cambodia\">Cambodia</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c45369665ddef8aad748a596ec0a4fbcb207901fd584b2b6ea317cc73818eb15","category":"Thai"}