{"title":"An interactive visualization and data portal tool (PALTIDE) for relative sea level and palaeotidal simulations of the northwest European shelf seas since the Last Glacial Maximum","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3615?af=R","date":1720420898000,"content":"<h2>ABSTRACT</h2>\n<p>Relative sea level (RSL) predictions based on glacial isostatic adjustment (GIA) simulations and palaeotidal predictions generated by hydrodynamic models using GIA-generated palaeotopographies are available in the published literature, and datasets are available via data repositories. However, these data are often difficult to extract for specific locations or timeslices, requiring users to request datasets from corresponding authors. To overcome the intractability of these data and to enable users to interrogate datasets themselves without requiring offline requests, we have developed PALTIDE, an online visualization tool with intuitive user interface accessible at <a target=\"_blank\" href=\"https://shiny.bangor.ac.uk/paleotidal/\">https://shiny.bangor.ac.uk/paleotidal/</a>. The model domain for this interactive visualization tool is the northwest European continental shelf, covering the period from the Last Glacial Maximum (LGM) to the present day, and is based on previous GIA simulations by Bradley and colleagues and hydrodynamic simulations using Regional Ocean Modelling System (ROMS) published by Ward and colleagues. The tool is developed in R and utilizes a number of packages including <i>shiny</i> and <i>bslib</i> for the frontend, and <i>arrow</i>, <i>raster</i> and the <i>tidyverse</i> for backend data processing. The tool enables visualizations and data downloads for RSL, tidal amplitude and tide-dependent parameters for any location within the model domain over 1000-year timesteps from the LGM to the present.</p>","author":"James Scourse, \nSophie Ward, \nAdam Wainwright, \nSarah Bradley, \nJerome Keaton Wilson, \nJessica Guo","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"c46f3081135a7293f709355578bf3b6260bf590dba617ab0c89dc92f8085870e","category":"Environment"}