{"title":"Factors associated with COVID-19 vaccine hesitancy and uptake among populations in the West department of Haiti","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002864","date":1728914400000,"content":"<p>by Martine Etienne-Mesubi, Babatunji Oni, Nancy Rachel Labbe-Coq, Marie Colette Alcide-Jean-Pierre, Delva Lamarre, Darwin Dorestan, Marie-Ange Bien-Aime, Venice Dorce, Cory Freivald, Cowan Angell, Yingjie Wang, Jenevieve Opoku, Bryan Shaw, Deus Bazira</p>\r\nIntroduction <p>The COVID-19 pandemic in Haiti led to increased challenges for a population concurrently dealing with natural and social disasters, poor quality health care, lack of clean running water, and inadequate housing. In 2022, the population of Haiti was 11.4 million. While half a million vaccines for COVID-19 were donated by the United States to the government of Haiti, less than 5% of the population agreed to be vaccinated. This resulted in thousands of unused doses that were diverted to other countries. The purpose of this study was to evaluate population characteristics related to vaccine uptake in order to inform future interventions to improve COVID-19 vaccine uptake as well as inform strategies to safeguard against future global health security threats.</p> Methods <p>This was a mixed-methods, cross-sectional study conducted in the West Department of Haiti within peri-urban communes. Participants consisted of adults in this setting responding to a survey from June 15 to July 18, 2022. The survey assessed demographic information, household characteristics, religious beliefs, past vaccine use, and current COVID-19 vaccine status. Multivariate regression modeling was conducted to assess predictors of vaccine hesitancy. Qualitative focus group discussion participants were recruited and focus group discussions were conducted between August-September 2022 among community groups, religious leaders and health professionals to provide additional, community-level context on perceptions of the COVID-19 pandemic and vaccines.</p> Results <p>A total of 1,923 respondents completed the survey; of which a majority were male (52.7%), between the age of 18–35 (58.5%), had a medical visit within the last year (63.0%) and received the COVID-19 vaccine (46.1%). Compared to those who had been COVID-19 vaccinated, participants who had not been vaccinated were more likely to be male (57.7% vs 46.8%, p &lt; .0001), have completed secondary education (30.5% vs 16.6%, p &lt; .001), unemployed (20.3% vs 7.3%, p &lt; .0001) and had a medical visit 3 or more years ago (30.2% vs 11.2%, p &lt; .0001). Unvaccinated COVID-19 participants were also more likely to have never received any other vaccine (36.1% vs22.5%, p &lt; .0001), have a religious leader speak out against the vaccine (20.0% vs 13.1%, p &lt; .0001), not believe in the effectiveness of the vaccine (51.2% vs 9.1%, p &lt; .0001) and did not trust the healthcare worker administering the vaccine (35.2% vs 3.8%, p&lt;0.0001).</p> Conclusion <p>These results show that targeted interventions to religious leaders and health care workers on how to engage with the community and share clearer messages around the COVID-19 vaccination may result in increased vaccine uptake. Results also shed light on how activities surrounding vaccinations can be tailored to meet client needs addressing the misinformation encountered to achieve greater health impact thereby safeguarding the population against future global health security threats.</p>","author":"Martine Etienne-Mesubi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c4745d0bd8364fd0b9fa2f206e6d8f4c2aa2da9950b87271d36a504f162cf328","category":"Environment"}