{"title":"How to win a Grand Tour time trial (and why some teams are so dominant)","link":"https://cyclingtips.com/2021/05/how-to-win-a-grand-tour-time-trial-and-why-some-teams-are-so-dominant/","date":1620692308000,"content":"<p>Filippo Ganna (Ineos Grenadiers) was the dominant rider in the stage 1 time trial of this year’s Giro d’Italia, taking the win by 10 seconds and with it the first pink jersey. On the teams front Jumbo-Visma and Deceuninck-Quickstep ruled the roost with both teams placing three riders in the top 10. Zoom out a little further and Ineos had three riders in the top 13. That’s nine of the top 13 from just three teams.</p>\n\n\n\n<p>That stat got us wondering: what does it take to be successful in modern Grand Tour time trials and why are some teams so dominant? </p>\n\n\n\n<p>With the opening stage being just 9 km long, the Giro could not be won in this opening time trial. And, barring accident, the Giro wasn’t likely to be definitively lost there for any GC contenders either. Nonetheless, it was an opportunity for GC riders to take an early advantage in the race for pink. Why then did some teams fail to perform as a whole? </p>\n\n\n\n<h2>Team dominance</h2>\n\n\n\n<p>As the stage 1 ITT unfolded, it became clear some teams had done their homework in preparation for the stage. Others seemed intent on treating it as a rest day before the race even began. </p>\n\n\n\n<p>If we rank teams by the sum of their top five placings, Deceuninck-QuickStep was statistically the best team with a total of 82. Close behind were Ineos and Jumbo-Visma tied on 89. Then we see a large gap to Astana in fourth at 134, but interestingly we see another cluster of teams from Bahrain in fifth at 177 to Qhubeka-Assos in eighth on 190. This cluster also includes EF Education-Nippo and UAE-Team Emirates. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Giro-stage-one-TT-comparison-1340x754.jpg\" /><figcaption>Teams in the Giro TT ranked by the sum of the placings of their top five riders.</figcaption></figure>\n\n\n\n<p>Admittedly five riders may be too many to include in this dataset – it may include riders who were merely trying to get through the time trial to start the race proper on stage 2. However, what it does show us is the variance between the top teams on Saturday, the cluster of teams in the middle focusing TT resources only on their GC contenders, and then a large number of teams at the back end of the results list with very little or no focus on time trials. </p>\n\n\n\n<p>In fact, eight teams didn’t place a single rider in the top 50 of the stage 1 time trial, and this was nearly nine as Team DSM just scraped inside the top 50 with a 46th place for Nicolas Roche. This might seem insignificant, maybe even tactical – these teams are saving their riders for other more specific objectives later in the race – but is that the whole story? </p>\n\n\n\n<p>DSM and Trek have GC contenders and as such would really have been hoping for better. Many of the others teams in the lower half of this dataset are wildcard invites and lower-ranked WorldTour teams; the very teams who have already shown themselves in breakaways this week. With a <a href=\"https://cyclingtips.com/2021/05/taco-van-der-hoorn-winner-against-all-odds/\" target=\"_blank\">successful breakaway comes a stage win</a> for an individual but also potentially the pink jersey for another rider. A good ride in a 10-minute time trial will cost little in the grand scheme of things but could set a rider up to be the best placed on GC of a small group fighting for stage honours. </p>\n\n\n\n<p>It seems strange then that some teams are collectively so far off the mark in such a short TT. Could there be larger forces at play? Could these differences be down to team objectives, equipment, preparation, and attention to detail? Are smaller teams suffering a compounding effect in the race of truth? </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Van-emden-Giro-TT-1340x754.jpg\" /><figcaption>Jumbo-Visma riders, like Jos van Emden, were on song in the opening TT.</figcaption></figure>\n\n\n\n<h2>Focus </h2>\n\n\n\n<p>Professional cycling has changed dramatically in the past decade. The marginal gains culture has taken grip, and many teams put much more emphasis on performance planning and preparation. </p>\n\n\n\n<p>Ahead of the Giro’s Grande Partenza in Belfast in 2014, I was asked to give some performance management staff from QuickStep and Specialized a guided tour of the route more than a month in advance. The staff visited Belfast on a data collection mission to help with performance planning and modelling ahead of the team time trial. The team wanted to see the exact route, its technical demands, weather conditions, and create a specific plan for the team time trial.</p>\n\n\n\n<p>This is the level of detail the top teams adopted fully seven years ago. Fast forward to 2021 and things are even more advanced. Some teams have aerodynamicists, physiologists, performance directors, data scientists, and even strategy engineers on staff or consultancy contracts. Having access to this level of expertise means teams can plan and optimise to an extremely high level for every time trial, while teams with smaller budgets have to pick and choose where to spend their preparation dollars.  </p>\n\n\n\n<p>We assume every team brings the same level of detail to these time trial stages, but the reality is most likely quite different. Smaller teams don’t have the budget, staff numbers, or aforementioned specialist staff to undertake such detailed preparation. Furthermore, teams with no clear GC favourites or time trial specialists may find it even more difficult to dedicate resources to time trial preparation. </p>\n\n\n\n<p>Team time trials, or the lack thereof, also has an effect. If the ASO or RCS include a team time trial stage, teams are more likely to emphasise time trial preparation for the team as a whole. With not a single team time trial at WorldTour level this season, teams can afford to scale back the number of riders getting this specialist, time-consuming, and costly preparation.</p>\n\n\n\n<p>Teams also pay very close attention to weather ahead of a time trial. A change in temperature, precipitation, wind, or air pressure can all hugely impact a time trial. With no prologue or GC placings established, teams had the freedom to start their riders in any order for Saturday’s stage 1 of the Giro. Teams with information on these variables are likely to put their best time triallists and GC contenders into the fastest time slots in terms of weather. </p>\n\n\n\n<p>Based on what we already know, if a team was unaware or not concerned with weather influences, it could further disadvantage its already disadvantaged riders in the race against the clock.</p>\n\n\n\n<h2>Rider ability</h2>\n\n\n\n<p>This one almost goes without saying, but let’s say it anyway. A team of high-mountain specialists – a la the Euskaltel-Euskadi team of old – is unlikely to place multiple riders in the top 10 of a flat time trial. Talent comes in many forms. While natural climbers come into their own in the high mountains, no level of preparation will put them in contention for a short, sharp, 9 km flat time trial. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/85A_6683-1340x894.jpeg\" /><figcaption>Remco Evenepoel is said to have one of the lowest CdA on the WorldTour.</figcaption></figure>\n\n\n\n<p>The modern time trial rider is also much more focused on their time trialling position and their Watts/CdA (like W/kg for time trialling and much more critical in flatter events). Top time trial riders with the team support mentioned earlier will have their positions dialled and tested. Some riders may even have a position specifically for short time trials such as this. </p>\n\n\n\n<p>Remco Evenepoel (Deceuninck-QuickStep) is rumoured to have a CdA of around 0.17 m², while a non-specialist with an unoptimised position could be as high as 0.21 m². This may not seem like a big difference, but if we assume to achieve a top 10 on Saturday a rider would have needed somewhere north of 2,500 watts/CdA then we are looking at 425 W for the more aero rider and a massive 525 W for the less aero rider to do the exact same time, all else being equal. </p>\n\n\n\n<p>Beyond morphology and physiology, there’s good-old-fashioned bike handling. Take a look back at Filippo Ganna’s time trial again and watch how fast he takes every corner. He looks like he is on rails and is clearly fully committed. </p>\n\n\n\n<p>Compare Ganna to riders less focused on time trials. The further we look down the results sheet the more of a compounding effect we see. Riders with less chance of achieving a result will of course not be capable of riding as fast as Ganna. If that rider is then further disadvantaged by a less-than-optimal approach to time trialling, this speed difference will be even greater.</p>\n\n\n\n<p>Slower on the straights means the rider is carrying less speed into a corner. With no chance of winning, the rider is also less willing to push the limits and that compounding effect is even greater. At the risk of stating the obvious, the less chance a rider is given to go fast, the slower they will ultimately go.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/85E_2072-1340x754.jpeg\" /></figure>\n\n\n\n<h2>Equipment</h2>\n\n\n\n<p>Equipment – including bikes, wheels, helmets, clothing, etc. – plays a huge role in modern-day time trialling success. Ineos has made no secret of the fact it will use non-sponsor-correct wheels when required (check out this week’s CyclingTips podcast and YouTube video for more on this) and we can see from Saturday’s time trial Jumbo-Visma is now prepared to do the same. While Shimano officially sponsors both teams, both teams used Aerocoach front wheels and either Princeton Carbon works or Roval rear wheels in the time trial. </p>\n\n\n\n<p>Further to this we now see more teams with specialist equipment for time trials. Top riders are no longer content with the standard round aero bar extensions. Instead, custom-made variants from Wattshop, Aerocoach, and MOST are a regular sight at the sharp end of the time trial results sheet. Look a bit further down the finishing order and the differences are noticeable. It’s another case of less-talented TT riders setting off at an even greater disadvantage.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Giro-stage-one-comparison-1340x754.jpg\" /><figcaption>Giro stage 1 teams ranked by the sum of top-five placings on the stage (green), best rider position (grey) and estimated team budget (blue).</figcaption></figure>\n\n\n\n<p>Clothing is another area of marginal gains that has received quite a lot of attention in recent years. Ineos and Castelli caused a stir a few years back with their “vortex generator” fabric textures. More recently they got creative with base layers to create a similar effect without falling foul of the UCI regulations that came about following that controversial technology.  </p>\n\n\n\n<p>We also have it on good authority some teams may be using non-sponsor-correct clothing in the time trials. Some manufacturers such as NoPinz and Vorteq Sports will create non-branded skinsuits if the price is right. More frequently, teams turn to these suppliers for time-trial-specific overshoes and gloves and we even see teams with separate clothing suppliers for time trial day.</p>\n\n\n\n<p>The differences between the slowest and fastest skinsuits in the WorldTour peloton at the moment could be estimated at about 7-10 W. These savings can be pushed out even further with custom suits and accessories from third-party manufacturers. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Filippo-Ganna-Giro-TT-Pinarello-Bolide-2-1340x754.jpg\" /><figcaption>Non-sponsor-correct wheels? </figcaption></figure>\n\n\n\n<p>While differences in time trialling equipment did exist in years gone by, this was somewhat policed by teams being committed to staying in their sponsors’ good books. Ineos and Jumbo have proved they will bring in third-party equipment if and when that kit is deemed to be faster. Other teams now seem more open to secondary sponsors specifically to support with time trial optimisation. Then we have the smaller teams where smaller in budget means no opportunity to buy fancy kit; where smaller in stature means the risk of annoying and losing a sponsor for next year is too great; and where smaller in support staff means the details don’t get sweated to the same nth degree. </p>\n\n\n\n<p>In summary, with differing levels of focus, specialist equipment and staff, different budgets, plus no team time trials all year, the top time trialling teams will inevitably place more riders towards the pointy end of the results sheet. As the saying goes “a rising tide lifts all boats”. Similarly, teams less focused on time trials will likely further exacerbate their time trialling woes. I guess a falling tide lowers all boats? </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/how-to-win-a-grand-tour-time-trial-and-why-some-teams-are-so-dominant/\">How to win a Grand Tour time trial (and why some teams are so dominant)</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c474d23055848761ef19d356442fd4e050462d8ddc13f0ee6b3d9a2da62b3516","category":"Cycling"}