{"title":"Betaine ameliorates doxorubicin‐induced cardiomyopathy by inhibiting oxidative stress, inflammation, and fibrosis through the modulation of AMPK/Nrf2/TGF‐β expression","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24291?af=R","date":1713865415000,"content":"<h2>Abstract</h2>\n<p>Doxorubicin (DOX) is a broad-spectrum antibiotic with potent anti-cancer activity. Nevertheless, despite having effective anti-neoplasm activity, its use has been clinically restricted due to its life-threatening side effects, such as cardiotoxicity. It is evident that betaine has anti-oxidant, and anti-inflammatory activity and has several beneficial effects, such as decreasing the amyloid-β generation, reducing obesity, improving steatosis and fibrosis, and activating AMP-activated protein kinase (AMPK). However, whether betaine could mitigate DOX-induced cardiomyopathy is still unexplored. Cardiomyopathy was induced in male Sprague Dawley rats using DOX (4 mg/kg dose with a cumulative dose of 20 mg/kg, <i>i.p.</i>). Further, betaine (200 and 400 mg/kg) was co-treated with DOX through oral gavage for 28 days. After the completion of the study, several biochemical, oxidative stress parameters, histopathology, western blotting, and qRT-PCR were performed. Betaine treatment significantly reduced CK-MB, LDH, SGOT, and triglyceride levels, which are associated with cardiotoxicity. DOX-induced increased oxidative stress was also mitigated by betaine intervention as the SOD, catalase, MDA, and nitrite levels were restored. The histopathological investigation also confirmed the cardioprotective effect of betaine against DOX-induced cardiomyopathy as the tissue injury was reversed. Further, molecular analysis revealed that betaine suppressed the DOX-induced increased expression of phospho-p53, phospho-p38 MAPK, NF-kB p65, and PINK 1 with an upregulation of AMPK and downregulation of Nrf2 expression. Interestingly, qRT-PCR experiments show that betaine treatment alleviates the DOX-induced increase in inflammatory (TNF-α, NLRP3, and IL-6) and fibrosis (TGF-β and Acta2) related gene expression, halting the cardiac injury. Interestingly, betaine also improves the mRNA expression of Nrf2, thus modulating the expression of antioxidant proteins and preventing oxidative damage. Here, we provide the first evidence that betaine treatment prevents DOX-induced cardiomyopathy by inhibiting oxidative stress, inflammation, and fibrosis by regulating AMPK/Nrf2/TGF-β expression. We believe that betaine can be utilized as a potential novel therapeutic strategy for preventing DOX-induced cardiotoxicity.</p>","author":"Sumeet Kumar Singh, \nPoonam Yadav, \nDhaneshvaree Patel, \nSampat Singh Tanwar, \nAbhishek Sherawat, \nAmit Khurana, \nJasvinder Singh Bhatti, \nUmashanker Navik","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"c47630f2fd2743504071f93dd66be8927693b4465929258397bf086807cedce3","category":"Environment"}