{"title":"FDA approves first CRISPR therapy—here’s how it works against sickle cell","link":"https://arstechnica.com/?p=1989840","date":1702078034000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/11690-800x904.jpg\" alt=\"This digitally colorized scanning electron micrograph (SEM) revealed some of the comparative ultrastructural morphology between normal red blood cells (RBCs), and a sickle cell RBC (left) found in a blood specimen of an 18-year-old female patient with sickle cell anemia.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/11690.jpg\">Enlarge</a> <span>/</span> This digitally colorized scanning electron micrograph (SEM) revealed some of the comparative ultrastructural morphology between normal red blood cells (RBCs), and a sickle cell RBC (left) found in a blood specimen of an 18-year-old female patient with sickle cell anemia. (credit: <a href=\"https://phil.cdc.gov/Details.aspx?pid=11690\">CDC</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Food and Drug Administration on Friday <a href=\"https://www.fda.gov/news-events/press-announcements/fda-approves-first-gene-therapies-treat-patients-sickle-cell-disease\">approved two gene therapies to treat sickle cell disease</a>, one of the which is the first CRISPR/Cas9-based treatment to win regulatory approval in the US.</p>\n<p>The announcement is a landmark in the treatment of sickle cell disease, a devastating condition in which red blood cells deform into a sickle shape and clog up blood vessels. Sickle cell disease affects around 100,000 people in the US, most commonly African Americans. It leads to anemia, vaso-occlusive events and crises (painful episodes in which small blockages starve tissue of oxygen), strokes, progressive and irreversible organ damage, decreased quality of life, and early death.</p>\n<p>Until today, treatments have been limited. A bone marrow transplant from a genetically matched sibling can cure the condition more than 90 percent of the time, but only around 20 percent of people with the disease have such a genetically matched sibling donor. There are also multiple drugs available and supportive care, but these mainly reduce the severity of the disease. The new gene therapy treatments, on the other hand, have shown to be highly effective at preventing vaso-occlusive events and crises.</p></div><p><a href=\"https://arstechnica.com/?p=1989840#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989840&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c48112754e264930cf60c0dff2edb6b34f0430950cd849a4c7f2bb4526edbb84","category":"Tech"}