{"title":"How Two‐Dimensional Heterocovariance Spectroscopy and Data Fusion Level out the Inadequacies of Compact Spectrometers","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400175?af=R","date":1729491220000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/05fda938-99f4-454f-ae29-e4c73547ae6f/appl202400175-gra-0001-m.png\" alt=\"How Two-Dimensional Heterocovariance Spectroscopy and Data Fusion Level out the Inadequacies of Compact Spectrometers\" /><p>This study employs two-dimensional heterocovariance and data fusion to enhance the model-building process of an acid-catalyzed esterification, which is monitored with near-infrared (NIR), nuclear magnetic resonance (NMR), and Raman compact spectrometers.\n</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>Over the past decade, sensors and compact spectrometers have emerged as a powerful means for real-time monitoring of chemical and biochemical processes in the field of process analytical technologies (PATs). This is largely attributed to cost-efficiency and their robustness in near-line applications. In comparison to more sophisticated laboratory instruments, these devices exhibit limited sensitivity and resolution. In this study, a combination of near-infrared, low-field <sup>1</sup>H nuclear magnetic resonance and compact Raman spectrometers were employed for the process monitoring of the acid-catalyzed esterification of isoamyl alcohol and acetic acid to isoamyl acetate. The resulting real-time data were transformed and visualized for interpretation using two-dimensional heterocovariance spectroscopy. The data were also subjected to pretreatment, concatenation, and multivariate analysis in accordance with low- and mid-level data fusion. The spectral interpretation derived from heterocovariance spectroscopy provided support for the data pretreatment during data fusion. By applying these computational techniques, the inherent limitations of sensitivity and resolution associated with compact spectroscopic instruments could be overcome, thereby facilitating the interpretation of data and yielding further insights into the process under study. A comparison of the process parameters resulting from the applied methods indicated that consistent data could be obtained. This study demonstrates that heterocovariance spectroscopy and data fusion allow to enhance compact, less expensive analytical instruments for process monitoring and to acquire process knowledge. This, in turn, enables material, financial, and energy resources to be conserved.</p>","author":"Lukas Mahler, \nChristian Mayer, \nMartin Jaeger","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"c486590dde4835b9259b33b5dae5ed7c050e91180ac37af87dc6b89fd5c5e362","category":"Environment"}