{"title":"Zwift: your complete guide","link":"https://www.bikeradar.com/features/zwift-your-complete-guide/","date":1698764400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/01/2020-12-14_1800290_clean-5123e28.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"2020-12-14_1800290_clean\" title=\"2020-12-14_1800290_clean\" />                                            <p>Zwift is an online cycling game and training platform that enables users to ride, train and compete in a virtual world.</p>\n<p>Aimed at eliminating the excruciating boredom of simply sitting on the trainer and staring at the wall, Zwift has exploded in popularity since its release in 2014.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\" target=\"_blank\">Indoor cycling</a> is all the rage at the moment. It seems as though every cycling brand now has something to offer this burgeoning market, with recent releases including <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">indoor bikes</a> from <a href=\"https://www.bikeradar.com/news/wahoo-kickr-bike/\">Wahoo</a>, <a href=\"https://www.bikeradar.com/news/stages-bike/\">Stages</a>, <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-neo-bike-smart-review/\" target=\"_blank\">Tacx</a> and <a href=\"https://www.bikeradar.com/news/srm-smartit-indoor-training-bike/\">SRM</a>, and indoor-specific cycling clothing.</p>\n<p>There are a number of different <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling apps</a> available, but Zwift is arguably the most fully featured, and almost certainly the most popular – reports suggest more than half a million people have signed up for an account so far.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift eRacing\" title=\"Zwift eRacing\" />\n\n</div><div><figcaption><span><i></i> eRacing is now popular. While it’s obviously not the same as racing a bike out on the road, it’s a great way to get a hard workout.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>More and more features are being added to Zwift, which is mostly great because it brings a lot of value to an already impressive package. However, it can also make knowing how and where to start quite daunting.</p>\n<p>There’s no need to worry though. We’ve done a mountain of research and have put together a comprehensive guide to the virtual training and racing platform. Here’s everything you need to know about Zwift.</p>\n<h2>What is Zwift?</h2>\n<p>Zwift is an online, interactive training and racing platform. By pedalling on an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">indoor trainer</a>, you drive your avatar around a virtual course. The harder you pedal, the faster you go.</p>\n<p>Zwift has twelve different worlds (more on these later), and within each you can navigate the roads as you go.</p>\n<p>You can ride with thousands of other riders on Zwift. You can join group rides and races – and even get a draft from other riders – or just join one of the worlds and jump on with other riders when you want to. You can also do structured power-based workouts.</p>\n<p>It features a multitude of gamified elements that encourage you to ride longer and harder, with the goal of increasing your fitness. After all, Zwift’s catchphrase is ‘Fun is fast’.</p>\n<p>Of course, if that doesn’t sound like your cup of tea, there are many other great <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">apps</a> to try, such as <a href=\"https://www.bikeradar.com/advice/buyers-guides/wahoo-systm-guide/\">Wahoo Systm</a>, <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">TrainerRoad</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/rouvy-everything-you-need-to-know/\">Rouvy</a>.</p>\n<h2>How does Zwift work?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"Zwift\" />\n\n</div><div><figcaption><span><i></i> There’s an app available for Apple TV, if you feel like setting up your bike in the middle of your living room. A smart trainer, such as the Wahoo Kickr shown here, will help you get the most out of Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift takes the input from your bike – either via a power meter, a smart trainer or just a speed/cadence sensor using ANT+ or Bluetooth – and uses an algorithm to translate your input data into your avatar’s speed on the virtual course.</p>\n<p>It takes into account your weight, your power or calculated power, the road or trail gradient and the draft, or lack thereof, from other riders.</p>\n<p>You can use Zwift on a computer (PC or Mac), an iPhone, an iPad or an Android smartphone or tablet.</p>\n<p>Zwift is now also compatible with Apple TV, so if you’ve got one of those (and your partner/roommate doesn’t mind), you can set yourself up right in front of the TV.</p>\n<section>\n    <div>\n        \n<h2>How much does Zwift cost?</h2>\n<p>Initially, it’s free; though long term, sadly not.</p>\n<p>You can get a free fourteen-day trial if you register for a Zwift account online, but after your trial period ends it costs £12.99 / $14.99 per month to continue using it.</p>\n<p>\n\n    </p></div>\n    </section>\n\n<h2>What equipment do I need to use Zwift?</h2>\n<p>The basic list of equipment you need is:</p>\n<ul>\n<li>A bike (or smart bike)</li>\n<li>A trainer or a set of rollers</li>\n<li>An ANT+ or Bluetooth measurement tool: a power meter, smart trainer or speed/cadence sensor</li>\n<li>A computer, smartphone or tablet with Bluetooth or ANT+ (or an ANT+ USB dongle)</li>\n</ul>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"Zwift\" />\n\n</div><div><figcaption><span><i></i> You can set up Zwift on a compatible iOS or Android device.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>As the main source of input data for the virtual world, the ANT+ or Bluetooth measurement tool you use is really the key piece of equipment (after your bike, obviously).</p>\n<p>If you’re really committed to your indoor training (and have the required cash lying around), then you can get a dedicated indoor bike.</p>\n<p>High-end smart bikes such as the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/stages-cycling-sb20-smart-bike-review/\">Stages Cyling SB20</a>, <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wattbike-atom-next-generation-review/\">Wattbike Atom</a> and <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-bike-review/\">Wahoo Kickr Bike</a>, offer fully integrated indoor training solutions for those looking to squeeze every last watt out of their virtual training and racing sessions.</p>\n<div>\n    <div>\n        <div>\n            <div>\n                <blockquote>\n    <span></span>Zwift will use the data from your power meter to calculate your in-game speed<span></span>\n    </blockquote>\n            </div>\n        </div>\n    </div>\n</div>\n\n<p>A <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-turbo-trainers-for-indoor-training/\">smart trainer</a> is the next option. Like an indoor smart bike, a smart trainer will measure your power directly and transmit that data straight to Zwift.</p>\n<p>Beyond simply measuring power, smart trainers are also able to simulate course gradients – changing the resistance according to the slope – and can be controlled by Zwift in Workout mode to make sure you’re hitting the prescribed wattages of a training session (again, more on this later).</p>\n<p>Smart trainers still aren’t cheap, but prices have come down in recent years as the market has become more competitive. If you want to know <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-the-most-out-of-zwift-on-a-budget/\">how to get the most out of Zwift on a budget</a>, be sure to check out our guide.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley riding a time trial bike indoors on a smart trainer\" title=\"20220103_SB_5DSR_MG_5003\" />\n\n</div><div><figcaption><span><i></i> A smart trainer paired to Zwift provides a highly immersive indoor cycling experience.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>If you have a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a>, you can make do with any kind of trainer or rollers. Zwift will use the data from your power meter to calculate your in-game speed, but obviously you’ll miss out on simulated gradients and controlled Workouts that come with using an indoor training bike or smart trainer.</p>\n<p>A speed/cadence sensor is the most basic option and allows you to use your regular bike (with no power meter) attached to a conventional trainer. Zwift will then crunch the numbers to estimate your power. It’s not the most accurate or realistic option, of course, but it does have one major advantage: it’s the cheapest way to get started on Zwift.</p>\n<p>For more on this topic, check out our guide to the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">best Zwift setups for every rider</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Companion App\" title=\"Zwift Companion App\" />\n\n</div><div><figcaption><span><i></i> The Zwift Companion app for iOS and Android devices allows you to control your avatar and access other functionality such as messaging and joining events, without having to reach for your computer.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>How do I get started on Zwift?</h2>\n<p>First, you need to sign up for an account.</p>\n<p>Using your Mac or PC, you can do it online on the <a href=\"https://www.zwift.com/\" target=\"_blank\">Zwift website</a>. On a tablet or smartphone, you can download the Zwift app from the <a href=\"https://apps.apple.com/gb/app/zwift/id1134655040\">Apple App Store</a> or <a href=\"https://play.google.com/store/apps/details?id=com.zwift.zwiftgame&amp;hl=en\">Google Play</a>, and sign up through that.</p>\n<p>You can sign up for a subscription (£12.99 / $14.99 per month) straight away or start a free fourteen-day trial.</p>\n<p>If you’re using a computer or Apple TV for Zwift, we also recommend downloading the Zwift Companion app from the <a href=\"https://apps.apple.com/gb/app/zwift-companion/id934083691\" target=\"_blank\">App Store</a> or <a href=\"https://play.google.com/store/apps/details?id=com.zwift.android.prod&amp;hl=en_GB\" target=\"_blank\">Google Play</a>. This app puts a number of convenient features at your fingertips, such as changing the direction of your avatar and messaging other Zwifters.</p>\n<p>The Companion app is also a great way of exploring and signing up for the many events that Zwift offers – such as group rides, group workouts and races.</p>\n<p>Once that’s all set up, and you have the app running, you need to pair your devices. These should appear on screen as clickable options once you’ve woken them up.</p>\n<p>Next, you simply choose which world you want to ride in.</p>\n<h2>What about Zwift hardware?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub Classic\" title=\"Zwift Hub Classic\" />\n\n</div><div><figcaption><span><i></i> The Zwift Hub Classic is a budget smart trainer supplied with the cassette of your choice.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>More recently, Zwift has released a number of its own hardware options, including the Zwift Hub, Zwift Play and Zwift Cog.</p>\n<p>The Zwift Hub is the brand’s own-label direct-drive smart trainer, which retails at £549 / $599 / €599, and includes your first year of Zwift membership (worth £149.99 / $149.99 / €149.99).</p>\n<p>When it was launched in September 2022, the Zwift Hub was one of the most competitively priced direct-drive smart trainers, and our BikeRadar <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/zwift-hub-review/\">Zwift Hub review</a> certainly found an excellent build quality for the price, along with easy setup and minimal noise.</p>\n<p>The good news is the Zwift Hub is also compatible with other indoor training apps, as well as hardware from other brands continuing to be compatible with Zwift.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub One with Zwift Cog\" title=\"Zwift Hub One with Zwift Cog\" />\n\n</div><div><figcaption><span><i></i> The updated Zwift Hub One is fitted with the Zwift Cog in place of a freehub and cassette.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>While the Zwift Hub was originally supplied with your choice of cassette, aiming to streamline the setup process for users, the brand has since released another nifty bit of tech: the Zwift Cog.</p>\n<p>The <a href=\"https://www.bikeradar.com/features/zwift-cog-first-look/\" target=\"_blank\">Zwift Cog</a> replaces the cassette on the Zwift Hub smart trainer, enabling you to use ‘almost any’ bike with an 8-12 speed drivetrain. Rather than shifting between gears on your bike, you can select from the wide range of 24 virtual gears by using the Zwift Hub’s virtual shifting, which is activated using the Zwift Click wireless shifter included.</p>\n<p>You can now choose between the Zwift Hub with a cassette of your choice, the <a href=\"https://uk.zwift.com/collections/all/products/zwift-hub-classic?variant=43271106167024\" target=\"_blank\">Zwift Hub Classic</a>, or the more recent model with the Zwift Cog pre-installed, the <a href=\"https://uk.zwift.com/collections/all/products/zwift-hub-one?variant=44147381960944\" target=\"_blank\">Zwift Hub One</a>, for the same price. If you already have the Zwift Hub Classic, you can buy the Zwift Cog and Click upgrade kit for £59.99 / $59.99 / €59.99.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Play\" title=\"Zwift Play\" />\n\n</div><div><figcaption><span><i></i> The Zwift Play controllers are compatible with drop handlebars only.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/news/zwift-play/\" target=\"_blank\">Zwift Play controllers</a> can also activate Zwift’s virtual shifting and can be used with or without the Zwift Cog. These drop-handlebar mounted controllers look just like video game controllers, and essentially eliminate the need for a touchscreen or keyboard and mouse.</p>\n<p>Functionality ranges from steering and shifting to navigating menus, using PowerUps, changing workout intensity and more.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/training/gadgets/zwift-play-first-ride-review/\" target=\"_blank\">Zwift Play</a> can be purchased separately for £149 / $149 / €149.</p>\n<h2>What courses can I ride on Zwift?</h2>\n<p>There are currently 10 different worlds in regular use on Zwift:</p>\n<ul>\n<li>Watopia</li>\n<li>France</li>\n<li>Innsbruck</li>\n<li>London</li>\n<li>Makuri Islands</li>\n<li>New York</li>\n<li>Paris</li>\n<li>Richmond</li>\n<li>Yorkshire</li>\n<li>Scotland</li>\n</ul>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift London\" title=\"Zwift London\" />\n\n</div><div><figcaption><span><i></i> In addition to Watopia, Zwift’s ‘always on’ world, there is a rotating list of guest worlds such as London…</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Each of these <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-worlds/\" target=\"_blank\">Zwift worlds</a> has a number of preset courses for you to ride, or you can just pedal freely around each map.</p>\n<p>There is a catch, though. On any particular day, there will only be three worlds available to ride: Watopia (Zwift’s original and most fully featured virtual world) and two ‘guest worlds’ (two of the others).</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift New York\" title=\"Zwift New York\" />\n\n</div><div><figcaption><span><i></i> …and a futuristic take on New York.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>This might sound restrictive, but Zwift is designed to be a social platform, and this stops the user base spreading out too thinly across the platform. With this feature in place, you’ll always have other people to ride with (and against).</p>\n<p>If you want to know when a particular world will be available to ride, you can see the schedule for the coming month on the right of the World Choice screen.</p>\n<p>Alternatively, you can schedule rides with your friends in any of the 10 worlds using the Meetups feature in the Zwift Companion app (more on this later).</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"New Zwift Scotland World\" title=\"New Zwift Scotland World\" />\n\n</div><div><figcaption><span><i></i> The Scotland World is one of the latest in Zwift’s ever-expanding collection, celebrating the 2023 World Championships in Glasgow.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>There are also two other event-only world maps:</p>\n<ul>\n<li>Bologna</li>\n<li>Crit City</li>\n</ul>\n<p>These two maps are not part of Zwift’s regular ‘guest world’ rotation and can only be accessed via in-game events such as races (more on Zwift racing below).</p>\n<h2>How do I join a group ride on Zwift?</h2>\n<p>Once set up and ready to go, you can start exploring Zwift’s virtual worlds as you please, but there’s also the option to join a group ride.</p>\n<p>When you log in to Zwift, you’ll see a list of upcoming rides and races on the upper-right of the Mac/PC screen. On the Companion app, you can see a more detailed list with descriptions, times and more information. You can also go to <a href=\"http://zwift.com/events/\" target=\"_blank\">zwift.com/events</a> for a full list.</p>\n<p>To join, just click the ride. On most group rides you can self-select the level of intensity, from A to D (we’ve outlined what these categories mean in the racing section below). Group rides are categorised to ensure everyone rides together.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"2021-01-16_0937296_clean\" />\n\n</div><div><figcaption><span><i></i> Zwift group rides make indoor riding sociable.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you are not yet riding, you can receive a reminder. If you are already riding and an event is starting soon, you can join, and when the start time gets close, your avatar will be transported to the start line, where you can warm up on a virtual trainer while waiting to start.</p>\n<p>In the start corral, you can see the other riders who will be doing the event and your instant message chats will be seen only by others in that group.</p>\n<p>Most events have a ride leader you can follow, and you can read their comments on screen as you go. For mellower rides, the group leader often communicates to keep the group together.</p>\n<h2>RoboPacers</h2>\n<p>If you don’t want to join an organised event but still want someone to ride with, you can now choose to ride with a RoboPacer (formerly known as a Pace Partner). These are bots that ride around Watopia and the Makuri Islands at a predetermined pace.</p>\n<p>Riders can join and leave at any time, for a convenient and impromptu group ride. The size of the group each bot has with them depends on how many other Zwifters are choosing to ride with them at any point in time.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Nine Zwift RoboBots set the pace for group or solo riding\" title=\"Nine Zwift RoboBots set the pace for group or solo riding\" />\n\n</div><div><figcaption><span><i></i> Nine Zwift RoboPacers set the pace for group or solo riding</span></figcaption><span> <i>Zwift</i></span></div>\n<p>There are currently nine RoboPacers, all 75kg and 175cm tall, but each riding at different power outputs:</p>\n<ol>\n<li><strong>Taylor:</strong> 1.1w/kg</li>\n<li><strong>Bernie:</strong> 1.5w/kg</li>\n<li><strong>Miguel:</strong> 1.8w/kg</li>\n<li><strong>Maria:</strong> 2.2w/kg</li>\n<li><strong>Coco:</strong> 2.6w/kg</li>\n<li><strong>Yumi:</strong> 2.9w/kg</li>\n<li><strong>Jacques:</strong> 3.2w/kg</li>\n<li><strong>Genie:</strong> 3.7w/kg</li>\n<li><strong>Constance:</strong> 4.2w/kg</li>\n</ol>\n<p>RoboPacers now also use dynamic pacing, which sees them increase their power output by 10 per cent on climbs, and decrease it by 20 per cent on descents. This helps the group dynamics more accurately reflect how people ride in the real world.</p>\n<p>For full details on which routes the RoboPacers are riding, visit <a href=\"https://support.zwift.com/pace-partners-faq-ryiF4hdWw\" target=\"_blank\">Zwift.com</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"2021-03-12_1037110_clean\" />\n\n</div><div><figcaption><span><i></i> RoboPacer bots are an ideal way to join an on-demand group ride.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>Can I race on Zwift?</h2>\n<p>Yes, you can race on Zwift. Doing so is as easy as joining any other event or group ride on the calendar – you simply choose a race from the events list, choose which category you want to compete in and sign up.</p>\n<p>Categories for racing are based on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power (FTP)</a>, in watts per kilogram (w/kg):</p>\n<ul>\n<li>A = 4.0w/kg and above</li>\n<li>B = 3.2–3.9w/kg</li>\n<li>C = 2.5–3.1w/kg</li>\n<li>D = 2.4w/kg and below</li>\n</ul>\n<p>If you don’t know your FTP, you can use one of the FTP tests available on Zwift’s Workouts page – full details can be found in our <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">how to take an FTP test on Zwift</a> guide.</p>\n<p>Once you’ve selected a category and signed up for a race, Zwift will automatically take you to the race start when the race is about to begin.</p>\n<p>Have your water bottles, an XL fan and towel ready, because if you have to stop mid-race, you’ll get dropped and left behind immediately.</p>\n<p>Make sure you give yourself plenty of time to get warmed up too, as <a href=\"https://www.bikeradar.com/features/opinion/6-things-ive-learned-zwift-racing/\" target=\"_blank\">Zwift races</a> are notorious for starting fast – some people even pump up the watts just before the start to get a jump on everyone else.</p>\n<p>Be aware that drafting also happens, even in virtual racing! Try to use this to your advantage, just like in the real world.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift racing\" title=\"405483-zwifterclubhouse_posters_critcity-d01da7-original-1635519389\" />\n\n</div><div><figcaption><span><i></i> Zwift races are often held on short courses, such as Crit City, which makes for extremely intense racing.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>What does w/kg mean?</h2>\n<p>W/kg simply means ‘watts divided by kilograms’. It’s also known as your ‘<a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-to-weight-ratio/\">power-to-weight ratio</a>’, and it’s a key figure in determining performance on a bike in both Zwift and the real world.</p>\n<p>On a flat road, the absolute amount of power someone can produce is a key metric. But when the road goes uphill you also have to overcome the force of gravity, and the greater your total mass (body and bike), the more power is required to accelerate to, or maintain, a certain speed.</p>\n<div>\n    <div>\n        <div>\n            <div>\n                <blockquote>\n    <span></span>Zwift uses your w/kg at FTP firstly to determine how fast your avatar moves in the virtual world, especially uphill<span></span>\n    </blockquote>\n            </div>\n        </div>\n    </div>\n</div>\n\n<p>With that in mind, the wattage you can produce per kilo of body weight becomes the key metric on any significant hill.</p>\n<p>Zwift uses your w/kg at FTP firstly to determine how fast your avatar moves in the virtual world, especially uphill. Beyond that, it also uses w/kg at FTP to set categories and intensity levels for group rides, races, workouts and training plans.</p>\n<p>As you might have figured out, it’s pretty easy to cheat the system by simply entering your weight as lower than it really is. But, as the old saying goes, you’d only be cheating yourself…</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"2021-09-14_1449331\" />\n\n</div><div><figcaption><span><i></i> The w/kg you can produce is a primary determinant of how fast you can climb in Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>What are PowerUps?</h2>\n<p>PowerUps are one example of <a href=\"https://www.bikeradar.com/features/opinion/indoor-cycling-gamification/\" target=\"_blank\">gamification</a> on Zwift. They give you either an immediate quantity of experience points (XP), or a way to temporarily boost your avatar’s speed.</p>\n<p>They’re awarded randomly whenever you pass through a start/finish, KOM/QOM or sprint arch. A bit like on <em>Mario Kart</em>, if you already have an unused PowerUp when you pass through an arch, you won’t get another.</p>\n<p>There are currently nine different PowerUps in Zwift:</p>\n<ul>\n<li><b>Large Bonus:</b> Instantly gives you 250 XP points</li>\n<li><b>Small Bonus:</b> Instantly gives you 10XP points</li>\n<li><b>Feather Lightweight:</b> Symbolised by a feather, this reduces your weight by 10 per cent for 15 seconds. Best saved for use on a steep climb, where it will make the biggest difference to your speed</li>\n<li><b>Truck Draft Boost: </b>Symbolised by a van, increases the effect of drafting other riders by 50 per cent for 30 seconds. This is a PowerUp for riding at speed on the flats, where drafting has the biggest effect</li>\n<li><b>Helmet Aero Boost: </b>Reduces your avatar’s aerodynamic drag by 25 per cent for 15 seconds. This is useful when riding solo on the flat or at high speeds</li>\n<li><b>Breakaway Burrito:</b> Makes you ‘undraftable’ for 10 seconds. Best used when trying to break away from a group, only available in events</li>\n<li><b>Invisibility: </b>Symbolised by a ghost, this makes you invisible to other riders for 10 seconds. Best used when trying to break away from a group or solo rider – try to establish a gap before you reappear and everyone realises what you’ve done. Only available in events, and will not work within 400 metres of the finish line</li>\n<li><strong>Steamroller: </strong>This power-up is limited to off-road events in Watopia’s Jungle Circuit and offers a significant reduction to your avatar’s rolling resistance for 30 seconds. It essentially makes riding on dirt roads as easy as riding on tarmac</li>\n<li><strong>Anvil:</strong> The opposite of the Featherweight PowerUp, the Anvil makes your avatar heavier for 30 seconds. Best used on descents to maximise your speed, though will only work on declines of -1.5% and below</li>\n</ul>\n<p>PowerUps can be activated at any time by hitting the spacebar on your computer, or via the Zwift Companion app – just touch the on-screen PowerUp icon. Once activated, timed PowerUps will show a timer for how long your PowerUp has left to run.</p>\n<p>If you’re in the middle of a structured workout, or on a TT bike, you can only acquire Small and Large Bonus PowerUps – so you can’t use them to make your training any easier, sadly.</p>\n<h2>Can I use Zwift for structured workouts?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Training Plans\" title=\"Training Plans\" />\n\n</div><div><figcaption><span><i></i> There are lots of different training plans, each with a different goal. You can choose a broad plan for building general fitness, or pick something more specific.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Absolutely, this is one of Zwift’s key features.</p>\n<p>Zwift has hundreds of structured workouts (which are essentially interval training sessions) to choose from – or you can build your own – and you can even sign up for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">long-term training plans</a>.</p>\n<p>You can choose a plan to target specific events or weaknesses, such as ‘TT-Tune Up’ – which, as the name suggests, focuses on the aerobic power and top-end fitness required for time trialling.</p>\n<p>Or there are broader plans such as ‘FTP Builder’, designed to increase your general fitness and Functional Threshold Power in a short amount of time.</p>\n<p>These <a href=\"https://www.bikeradar.com/advertising-feature/zwift-fast-track-training/\" target=\"_blank\">training plans</a> have been put together by real coaches and are designed to be flexible, so if life gets hectic, you can easily move sessions around to fit in with everything going on in the real world.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift's training plans\" title=\"Zwift's training plans\" />\n\n</div><div><figcaption><span><i></i> Zwift’s training plans can be adjusted for duration to fit your needs.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>All structured training on Zwift is based around your w/kg at FTP, so you really need some sort of power measuring device – a smart indoor bike, smart trainer or power meter – to get the most out of this feature.</p>\n<p>If you’re on a smart indoor bike, or a smart trainer, then there’s an option to allow Zwift to control the resistance in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG mode</a>.</p>\n<p>This will override any changes in course gradient and change the resistance according to the specified wattages in the workout. This is a great way to ensure you’re hitting the prescribed wattage and getting the most out of every training session.</p>\n<p>If you don’t have a power measuring device, Zwift will try to approximate your power output using data from your speed/cadence sensor and information about whatever trainer you’re using. As these numbers are just estimates, though, the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a> and data generated won’t be as accurate as they could be.</p>\n<h2>How do I do a Zwift workout?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift workout\" title=\"2021-05-24_1712241\" />\n\n</div><div><figcaption><span><i></i> After you’ve selected the workout you want to do, Zwift will guide you through it, giving you a target power (and sometimes cadence) for each interval.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>To do a workout on Zwift, log in, then click on ‘Training’ underneath the ‘World Choice’ section in the middle of the window.</p>\n<p>This will open up a new window, where you’ll see two tabs. One for single workouts and another for training plans with multiple sessions.</p>\n<p>If you’ve already set your FTP, then you can simply select a workout and get going.</p>\n<p>If you’re new to Zwift, it’s worth doing an FTP test to get an accurate baseline figure for Zwift to base your workouts around.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Training Plans\" title=\"Zwift Training Plans\" />\n\n</div><div><figcaption><span><i></i> To try to prevent you from overtraining, workouts in a Zwift training plan only unlock after a specified amount of recovery time has passed.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>In addition to workouts that you do on your own, at any time, there are also scheduled group workouts. Like a group ride in the real world, these start at fixed times (and you have to sign up for them in advance via the events page) and involve multiple participants.</p>\n<p>Unlike the group rides and races, though, group workouts keep everyone together in a group. As long as you are pedalling, you stay in the bunch.</p>\n<div>\n    <div>\n        <div>\n            <div>\n                <blockquote>\n    <span></span>The group chat function works well in group workouts<span></span>\n    </blockquote>\n            </div>\n        </div>\n    </div>\n</div>\n\n<p>As with the individual workouts, your efforts are based on your FTP. However, in group workouts, Zwift tethers everyone together so the end result is like being in an indoor cycling class: you are all following the same workout together, but at different individual efforts according to your fitness.</p>\n<p>The group chat function works well here, in that the only messages you see (and send) are to the group.</p>\n<h2>How do I upload my Zwift rides to Strava?</h2>\n<p>You can link your Zwift account with <a href=\"https://www.bikeradar.com/brand/strava/\">Strava</a>, and ensure your efforts appear on the KOM/QOM leaderboards.</p>\n<p>There are two ways to do it. On the Zwift Companion app (on an iOS or Android device ) or via <a href=\"http://zwift.com\" target=\"_blank\">zwift.com</a>.</p>\n<p>On the Zwift Companion app, tap ‘More’ in the bottom right corner, then tap into ‘Settings’. From there, tap ‘Connections’ and you’ll find Strava at the top of the list. Simply tap the + icon and you’ll be asked to enter your login details for Strava.</p>\n<p>Once that’s done, your accounts will be synced and your Zwift rides will upload to Strava automatically.</p>\n<div></div>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift\" title=\"2021-09-12_0943381\" />\n\n</div><div><figcaption><span><i></i> Each world contains a multitude of virtual Strava KOM/QOMs to post times on, including the monstrous Alpe du Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>You’ll know you’re connected if the Strava logo appears in colour and the + sign has changed to a tick.</p>\n<p>On zwift.com, the process is very similar. Log in to your account, then click on ‘Settings’ in the top-left corner.</p>\n<p>In Settings, click on ‘Connections’. Click on ‘Connect’ under the Strava logo and enter your Strava log-in details when prompted.</p>\n<p>You’ll then automatically be directed back to Zwift, where the Strava logo should now be in colour, instead of greyed out.</p>\n<h2>How do I customise my Zwift avatar and bike?</h2>\n<p>Yes, we’re all individuals! In Zwift, you can customise the appearance of your rider and your bike. Head to the Preferences section of the menu and you can toggle through a number of choices for how your avatar and bike look in the ‘Drop Shop’.</p>\n<p>As you ride and complete challenges, you’ll earn XP and in-game currency (known as Drops). As you level up, you’ll unlock more bikes and wheels on which to spend the currency you earn. Be warned, though, if you want the best bikes, you’ll need to put in a lot of hours on the bike (<a href=\"https://www.bikeradar.com/news/cameron-jeffers-esports-disqualified/\">unless you’re willing to resort to more nefarious means</a>).</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Drop Shop\" title=\"Zwift Drop Shop\" />\n\n</div><div><figcaption><span><i></i> Zwift allows you to customise the look of your avatar and you can also spend in-game currency, earned through riding, on new bikes and wheels in the Drop Shop.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Locked bikes and wheels can also be more aerodynamic or lighter (and sometimes both) than the basic kit available when you start. So the kit you unlock will actually make a difference to your avatar’s speed in the virtual world, not just how it looks.</p>\n<p>To <a href=\"https://www.bikeradar.com/news/ride-in-bikeradar-kit-on-zwift/\">unlock the BikeRadar kit in Zwift</a>, simply press “P” after you sign in and enter the code “BIKERADAR”. The kit will then be available for your avatar via the normal customisation options.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift group ride\" title=\"2020-04-30_1847376_clean\" />\n\n</div><div><figcaption><span><i></i> You can unlock the BikeRadar kit for free in Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>How do I chat in Zwift?</h2>\n<p>When using a computer, press ‘M’ and then just start typing. Your messages will be seen by riders near you.</p>\n<p>When using the Zwift Companion app, you can use the Group Text button to chat with riders in your same group or race. You can also hit the chat box next to an individual rider to send a private message.</p>\n<p>The easiest way is probably using the talk-to-text function on an Android or iOS device. To do this, hit the mic icon after you have brought up the message box.</p>\n<h2>How do I set up a group ride?</h2>\n<p>The quickest way to set up a private group ride with your followers is to use the <a href=\"https://zwift.com/news/19189-zwift-how-to-ride-with-friends\" target=\"_blank\">Zwift Meetups</a> feature in the Zwift Companion app. Head to the Events page, tap the Meetups icon at the top of the page then tap ‘Create Meetup’.</p>\n<p>From there, you’ll have a number of options to customise the ride; the date and time you want to ride, where you want to ride, route, distance/duration, whether to automatically keep everyone tethered together or not… and whether you want the Meetup to be a race!</p>\n<p>Once you’ve decided on those details, you just need to invite people from your list of followers (you can only invite Zwifters who follow you to a Meetup ride currently), add some ride details so invitees know what they’re being invited to and then tap Create Meetup.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Meetups\" title=\"Zwift_Companion App_Meetups\" />\n\n</div><div><figcaption><span><i></i> You can use the Meetups feature in the Zwift Companion app to quickly schedule private group rides.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>When it’s time for your Meetup, just log into Zwift a few minutes beforehand and Zwift will automatically transport you to the start of the ride.</p>\n<p>Zwift also recently changed things so that you can still join a ride up to 30 minutes after the Meetup has begun (provided it’s not a race), so there’s no need to worry if you’re running a little late.</p>\n<h2>Can I report riders for bad behaviour?</h2>\n<p>On the whole, Zwift is pretty civil, but you might encounter a few problems.</p>\n<p>For starters, it is impossible to crash or be crashed by someone. If you feel like someone is acting inappropriately, you can flag them with the Zwift Companion app.</p>\n<p>You can also flag other riders for foul language, harassment or suspicious power output. This last category Zwift has set as ‘flier’ – basically meaning if you see someone flying past you at a sustained 8+ watts per kilogram, then something is up.</p>\n<p>Zwift has power profiles for world-class performances for various durations. So if a rider gets flagged, and Zwift looks at their file and sees they are indeed producing phenomenal power, then the rider will receive a message along the lines of ‘hey, you should be pro!’, with a recommendation to check their settings and a notification that their ride is invisible to other riders.</p>\n<p>That rider will still be able to complete their ride and see other people in the game, but they will just be invisible to others.</p>\n<p>Two things can cause supernatural power in Zwift: inaccurately entering weight (and thus altering that w/kg figure) or having a trainer improperly set up.</p>\n<h2>Steering</h2>\n<p>One of the more recent innovations on Zwift is the <a href=\"https://www.bikeradar.com/news/winter-2023-zwift-update/\" target=\"_blank\">steering functionality</a>. Originally restricted to a small off-road course in the Titan’s Grove area of Watopia, it’s now possible to use steering across the entirety of the game.</p>\n<p>In order to take advantage of this new feature, you’ll need a compatible device, such as the Zwift Play controllers or the <a href=\"https://www.bikeradar.com/news/elite-sterzo-smart/\">Elite Sterzo Smart steering plate</a> (which costs £84.99 / $103 / €98).</p>\n<p>Some <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">smart indoor bikes</a>, such as the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-bike-smart-bike-review/\">Wahoo Kickr Bike</a> and <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-neo-bike-smart-review/\">Tacx Neo Bike</a>, also have integrated controls for in-game steering as well.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift steering\" title=\"zwift-steering-partnerpack-02-v2\" />\n\n</div><div><figcaption><span><i></i> Elite’s Sterzo Smart steering plate is a front-wheel riser block that enables you to steer your avatar manually in Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>With steering enabled, you’ll be able to choose your line more deliberately (to take a racing line, for example), or move out of a group to prevent other riders from drafting you.</p>\n<p>However, it also means that your avatar will no longer be able to ride through other avatars – you’ll have to steer around them instead.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift steering\" title=\"zwift_steering_blog_body_06-1\" />\n\n</div><div><figcaption><span><i></i> Zwift has added steering to all worlds in the game, but you’ll need the right kit to access the feature.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>You’ll also have to pay close attention to the riders in front because you’ll need to steer yourself into the draft in order to get the maximum advantage.</p>\n<p>Event organisers can choose to have steering turned on or off, so make sure to double check this when signing up.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c4869a4fa4929cafccdf0ec23ebf021f5ae19c73a3e222376620e1d8e934f2d0","category":"Cycling"}