{"title":"Buyer’s guide to internal gear hubs | Everything you need to know","link":"https://www.bikeradar.com/advice/buyers-guides/internal-gear-hubs/","date":1686056417000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1432036890894-1tf6oui8t7sc5-b1a1e4d-e1685715315931.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"The Rohloff hub puts all those delicate cogs and shifty bits inside the hub of the rear wheel, where they can’t be soaked in mud or ripped off by an angry tree\" title=\"1432036890894-1tf6oui8t7sc5-b1a1e4d\" />                                            <p>An internal gear hub provides multiple gears on a bicycle in an enclosed unit housed within the rear hub.</p>\n<p>Almost all bikes with gears now feature a <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">derailleur</a> system. But for a long time, internal gear hubs – also known as ‘hub gears’ – were the preferred gear-shifting mechanism.</p>\n<p>You can still buy a variety of bikes with internal gear hubs, but they’re most commonly seen on bikes designed for urban riding.</p>\n<p>Here, the ability to shift when stationary and the low maintenance requirements offer an attractive advantage over other types of <a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\">drivetrain</a>.</p>\n<p>Gear hubs also work well with <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a>, with some gear hubs offering completely automatic transmissions.</p>\n<p>Although two- and three-speed gear hubs are still available, newer systems offer seven, eight or 14 gears – there’s even a continuously variable option.</p>\n<p>The gear spread on modern internal gear hubs can be as great as, or greater than, most derailleur systems.</p>\n<p>In this in-depth buyer’s guide, we’ll outline everything you need to know about internal gear hubs, their advantages and disadvantages, how they compare to derailleur drivetrains, and the options available.</p>\n<h2>What is an internal gear hub and how do they work?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Raleigh Motus Tour commuter eBike\" title=\"Raleigh Motus Tour - 04\" /></div><div><figcaption><span><i></i> As the name suggests, on an internal gear hub, the gears are housed inside the rear hub of the bicycle.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Internal gear hubs provide between two and 14 gear ratios via a set of gears housed within a bicycle’s rear hub.</p>\n<p>The hub is usually turned via a singlespeed drivetrain, with a single rear sprocket transferring power to the hub.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rohloff speedhub cut away\" title=\"Rohloff speedhub cut away\" /></div><div><figcaption><span><i></i> Internal gear hubs are… complex.</span></figcaption><span> <i>Rohloff</i></span></div>\n<p>Exactly how an internal gear hub works differs from model to model but, generally speaking, inside the hub are sets of planetary gears, like those used in many automatic car gearboxes.</p>\n<p>The gear wheels are engaged constantly, with shifting locking and unlocking clutches to change which gears are active, while those not in use idle within the hub.</p>\n<p>In older systems, shifting was initiated via a cable from the handlebars that ran to the centre of the hub.</p>\n<p>Some gear hubs still use this mechanism, but there are now also electronic and wireless shift internal gear hubs available.</p>\n<p>In some cases, the gear hub also incorporates a coaster brake, where the brake is operated by backpedalling, or a drum brake (Shimano’s variant is called a roller brake). Other gear hubs have standard mounts for a <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-rotors/\">disc brake rotor</a>, while some use rim brakes for stopping power.</p>\n<h2>What are the benefits of an internal gear hub</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The Precede comes complete with a rear rack that’s rated to a weighty 25kg load capacity\" title=\"Canyon Precede ON CF 9 09\" /></div><div><figcaption><span><i></i> Internal gear hubs can be very reliable.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The major benefit of an internal gear hub is that its gears are… internal.</p>\n<p>That means they’re protected from the weather, resulting in low maintenance requirements.</p>\n<p>The Rohloff gear hub, for example, only needs an oil change every year to keep it working in tip-top condition, according to the brand.</p>\n<p>Shimano says its hubs should be serviced every two years after an initial 12-month service.</p>\n<p>You will still need to maintain the external part of the drivetrain. However, as these are usually singlespeed, they are generally easier to clean and maintain than a derailleur drivetrain.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/workshop/cross-chaining/\">straight chainline</a> of the ‘singlespeed’ external portion of the drivetrain means there’s less wear on the chain and fewer frictional losses.</p>\n<p>Manufacturers can also use wider, heavier-duty drivetrain components, which are generally more durable.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The Shimano Alfine 8-speed hub is matched to a Gates belt drive\" title=\"svenebike_11-1522756138630-drmti0cr45t6-95b2e32\" /></div><div><figcaption><span><i></i> Hub gears are often paired with belt drives.</span></figcaption><span> <i>Warren Rossiter / Immediate Media</i></span></div>\n<p>That simple chainline also means internal gear hubs can be paired with a belt drive. These can provide almost maintenance-free performance and tend to be cleaner than a chain, too.</p>\n<p>Another benefit of an internal gear hub is that the planetary gears are always engaged.</p>\n<p>This means shifts can be very smooth and less routine adjustment is required. You can also change gears while not pedalling, which is helpful, particularly when stopped at traffic lights.</p>\n<p>Internal gear hubs can transmit high loads, so they’re a good option to use with an <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a>.</p>\n<p>Gear changes are typically faster than with a derailleur system too, and if an electronic hub gear is used, automatic gear changes on electric bikes are even possible.</p>\n<h2>What are the drawbacks of an internal gear hub?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"A hub gear from Sturmey-Archer on the The Light Blue Parkside commuter road bike\" title=\"The Light Blue Parkside 05\" /></div><div><figcaption><span><i></i> Internal gear hubs are neat, but they can be heavy.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The main drawback of an internal gear hub is its weight.</p>\n<p>Even the simplest systems start at around 1kg. More complex systems with more than three speeds can exceed 2kg.</p>\n<p>The exception is the Classified two-speed hub gear system at around 500g (more on this system below). Classified claims it’s only around 20g heavier than a typical double chainset and front derailleur it’s designed to replace.</p>\n<p>Internal gear hubs can also be expensive. A Rohloff 14-speed gear hub is priced at over £1,000/$1,500 and a Classified system costs around £2,000/$2,500.</p>\n<p>Shimano’s gear hubs are a lot cheaper, costing around £250/$250.</p>\n<p>Although that’s not a lot of cash in cycling component terms, for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">hybrid bikes</a> where they’re typically used, it’s a significant chunk of additional cost for a new bike.</p>\n<p>Hubs from the likes of Sturmey-Archer can be had for as little as £70, but these are generally quite heavy.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Cannondale Trail SE 4 hardtail mountain bike\" title=\"Cannondale Trail SE4 - cassette\" /></div><div><figcaption><span><i></i> You can swap cassettes to provide different gearing on a derailleur drivetrain.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>Whereas, with a derailleur system, it’s comparatively easy to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-replace-cassette/\">replace your cassette</a> with one that gives you a different set of gear ratios, with a gear hub you’re stuck with the range the hub provides. However, you can make the total range easier or harder by swapping the freewheel and/or chainrings.</p>\n<p>If something does go wrong, maintenance is more complex and likely to be more expensive than a derailleur system.</p>\n<p><a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">Fixing a puncture</a> is also, generally, a lot more difficult than with a derailleur. Most hubs are held in place with 15mm nuts, which means you’ll need to take a spanner with you on a ride.</p>\n<h2>Are hub gears reliable?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Best hybrid bikes\" title=\"Canyon Commuter\" /></div><div><figcaption><span><i></i> Internal gear hubs are used commonly on urban bikes because they can be very reliable.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Because they’re weatherproofed, hub gears are usually highly reliable.</p>\n<p>The orbital gears inside them are engaged continuously and so, unlike derailleur sprockets, not subject to wear and load on the teeth from shifting.</p>\n<p>A major cause of problems with derailleur systems is the derailleur hanger getting out of alignment, resulting in mis-shifts and noisy running.</p>\n<p>Misalignment of the gears themselves in a hub is unlikely to occur – it’s only external parts, such as shift cables, that might get damaged or corroded and need replacement. This can affect shift quality.</p>\n<p>Derailleurs are also prone to damage. Without dangly bits, gear hubs are better protected.</p>\n<h2>Internal gear hub vs derailleur</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Hub and drive belt on child's bike\" title=\"early rider hub gear\" /></div><div><figcaption><span><i></i> With no exposed components, internal gear hubs are less prone to damage.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The main differentiators between gear hubs and derailleur systems are the additional weight and price of the gear hub.</p>\n<p>However, gear hubs can also be less efficient than well-maintained derailleur systems because there’s more friction in the mechanism.</p>\n<p>Rohloff claims its efficiency is comparable to a derailleur system though, at between 95 and 98.5 per cent. It points out that derailleur gears’ efficiency is highly dependent on component wear and the degree of cross-chaining.</p>\n<p>For some riders, the ease of altering the available gear ratios and spread a derailleur system provides with a change of cassette may be an attraction. However, it’s not likely to be a significant factor for the majority of bikes in which gear hubs are used.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Ultegra R8100 12-speed drivetrain with a chainstay protector on an Allied Echo gravel bike\" title=\"Shimano Ultegra R8100 12-speed drivetrain with a chainstay protector on an Allied Echo gravel bike\" /></div><div><figcaption><span><i></i> A 2×12 drivetrain may offer more gears, but not necessarily greater range than an internal gear hub.</span></figcaption><span> <i>Josh Patterson / Our Media</i></span></div>\n<p>High-end derailleur systems offer more gear ratios than a gear hub, although it should be noted that with a double chainset there’s usually some overlap of ratios.</p>\n<p>Note more gear ratios doesn’t necessarily equate to a greater range. You may, theoretically, have more options in a given range, but not necessarily more range.</p>\n<p>A gear hub, on the other hand, is usually designed to provide a more even progression of gears, even if the total number is lower.</p>\n<p>The highest-spec gear hubs offer as much or more range between lowest and highest ratios as a derailleur system too, although the range from lower-priced systems may be smaller.</p>\n<h3>Internal gear hub vs gearbox</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinion P-series gearbox internal components cutaway.\" title=\"Pinion P-series gearbox internal components cutaway.\" /></div><div><figcaption><span><i></i> Though they use similar tech, gearboxes and internal gear hubs are different things.</span></figcaption><span> <a href=\"https://pinion.eu/en/p-line/\"><strong>Pinion</strong></a></span></div>\n<p>Another option for internal gearing for bicycles is a gearbox. This uses similar tech to a gear hub, but places the gears at the crankset end of the drivetrain.</p>\n<p>It has similar advantages of reliability and ability to shift while stationary, but the same drawbacks of weight and price relative to a derailleur system. The central placement does assist with weight distribution though.</p>\n<p>Pinion is the best-known gearbox manufacturer.</p>\n<p>Its gearboxes are made in Germany and provide up to 18 speeds. They require a bicycle frame designed specifically for the gearbox though and, like the Rohloff gear hub, are expensive.</p>\n<h2>Which bikes use an internal gear hub?</h2>\n<p>Internal gear hubs are an option offered on some new bikes in place of a derailleur.</p>\n<p>These are typically urban hybrids, where weatherproofing, high reliability and low maintenance are advantages.</p>\n<p>Other bikes where you may find an internal gear hub include cargo bikes, for similar reasons, and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-hybrid-bikes/\">electric hybrid bikes</a>. In both these cases, the high torque throughput and ease of shifting are advantages.</p>\n<p>You can find niche examples of pretty much every type of bike available with an internal gear hub. They crop up on some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-touring-bike-how-to-choose-the-right-one-for-you/\">touring bikes</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a>, for example.</p>\n<h2>Can I convert my bike to use an internal gear hub?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"At the back, the Trekking Step-Through features Shimano's ALFINE 8s internal gearing and an Alfine chain tensioner\" title=\"1439426943247-f8dzxirstjkw-ebee9ee\" /></div><div><figcaption><span><i></i> A chain tensioner is required on bikes with vertical dropouts.</span></figcaption><span> <i>David Rome / Immediate Media</i></span></div>\n<p>Yes, you can convert most bikes to use an internal gear hub, because gear hubs are available to fit standard hub spacings.</p>\n<p>Bear in mind that, in addition to the hub itself, you’re going to need it built up into a wheel. You could reuse your existing wheel rims, but you’ll need new spokes, because a gear hub is typically wider than a derailleur or singlespeed hub.</p>\n<p>Wheel building is an art and, unless you have experience, best left to an expert, which means more expense. You can find ready-built wheels incorporating a gear hub, but they’re not commonly available.</p>\n<p>Bikes designed around an internal gear hub will include some way of tensioning the chain – usually horizontal dropouts that enable you to slide the wheel back and forth, tensioning the chain.</p>\n<p>If your bike was designed for a derailleur system, you will almost certainly need a chain tensioner.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"kona honzo esd adjustable dropouts\" title=\"kona honzo esd adjustable dropouts\" /></div><div><figcaption><span><i></i> Adjustable dropouts, horizontal track ends or a chain tensioner are required to tension the chain on an internal gear-hub equipped bike.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Most derailleur bikes use vertical dropouts, which offer no fore or aft movement. The derailleur, instead, tensions the chain.</p>\n<p>A chain tensioner is, usually, a sprung pulley that tensions the lower run of the chain. These are typically inexpensive and work well.</p>\n<p>You’re also going to have to ditch the front derailleur if you have multiple chainrings.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano normally pair the Nexus rear hub with a twist shifter but Trek have instead subbed in a trigger shifter from the Alfine range\" title=\"1326713773714-1atyp6oqgobhy-2c237fe\" /></div><div><figcaption><span><i></i> Internal gear hub shifters use a different cable-pull ratio compared to a derailleur shifter.</span></figcaption><span> <i>James Huang/Future Publishing</i></span></div>\n<p>In addition, shifters for derailleurs tend to use different cable-pull ratios compared to internal gear hubs, so you’ll need new shifters too.</p>\n<p>If you want a gear hub with a roller or coaster brake incorporated, you’ll need to anchor the action arm to your frame.</p>\n<p>In some cases, the frame needs to be designed specifically to work with this – a standard frame may not be built strongly enough to handle the extra load from the brake arm.</p>\n<h2>Who makes internal gear hubs?</h2>\n<p>The main brands selling traditional multi-speed hub gears are Rohloff from Germany, with its expensive 14-speed hub; Shimano with a range of options that have between three and eight speeds, and the ever-trusty Sturmey-Archer, which produces hubs with between three and eight gears.</p>\n<p>Most hub gears are aimed at leisure riders and commuters, but a newer system is the Classified hub. It’s lightweight, wireless electronic and offers just two gears, but it’s a performance option designed to work as a replacement for a double chainset and front derailleur.</p>\n<h3>Rohloff internal gear hubs explained</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rohloff makes internal gear hubs... and that's about it.\" title=\"1442278674126-44m55syyd8s1-66973c8\" /></div><div><figcaption><span><i></i> Rohloff makes internal gear hubs… and that’s about it.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>German brand Rohloff makes only one product – its near-legendary Speedhub.</p>\n<p>The Speedhub packs in 14 gears with a 526 per cent gear range.</p>\n<p>There’s a huge range of variants, which can be used with disc or rim brakes.</p>\n<p>There are electronic and mechanical shifting options available, as well as versions compatible with fat bikes. Mountain bikers are also catered for with Boost-spaced axles.</p>\n<p>Rohloff vaunts its hub’s low maintenance – an annual oil change is the only service requirement, according to the brand.</p>\n<p>It says it also works well with electric bikes and offers shifting in 180 milliseconds.</p>\n<p>It is, however, very expensive, costing in excess of £1,000/$1,500. It’s also heavy, weighing close to 2kg depending on the variant.</p>\n<h3>Shimano internal gear hubs explained</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shand Leveret Shimano Alfine internal gear hub\" title=\"Shand Leveret Shimano Alfine internal gear hub\" /></div><div><figcaption><span><i></i> Alfine is Shimano’s flagship internal gear hub.</span></figcaption><span> <i>Russel Burton / Immediate Media</i></span></div>\n<p>Shimano offers three hub gear systems.</p>\n<p>Its flagship product is the Alfine range, which is available in 8- and 11-speed variants.</p>\n<p>The 11-speed Alfine hub has a 409 per cent gear range and can be used on electric and non-electric bikes.</p>\n<p>It weighs just under 1.7kg and accepts a disc brake rotor.</p>\n<p>The 8-speed variant has a similar weight and a 307 per cent gear range.</p>\n<p>As well as mechanical-shift versions, the Alfine hubs are available in Di2 electronic shifting incarnations.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Alfine Di2 hub\" title=\"Shimano Alfine Di2 hub\" /></div><div><figcaption><span><i></i> Shimano also produces Di2 variants of Nexus and Alfine.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>The Shimano Nexus gear hub is available with three, seven or eight speeds.</p>\n<p>The maximum gear range is 307 per cent for the eight-speed hub, for which there are mechanical shifting and Di2 options.</p>\n<p>Weights are around 1.6kg, but the seven-speed hub’s steel casing means that that gear hub weighs around 2kg. The three-speed variant has mechanical shifting only and weighs under 1kg.</p>\n<p>Shimano also has a hub gear system as part of its STEPS ebike drivetrains.</p>\n<p>This is five-speed and is available in electronic and mechanical shift versions. Versions with roller or coaster brakes are also available.</p>\n<p>The electronic shift versions can be set up to work with the motor’s electronics to provide automatic shifting.</p>\n<h3>Sturmey-Archer internal gear hubs explained</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Sturmey-Archer_7847\" title=\"Sturmey-Archer_7847\" /></div><div><figcaption><span><i></i> Sturmey-Archer is one of the oldest names in the internal gear hub market.</span></figcaption><span> <a href=\"https://en.wikipedia.org/wiki/Sturmey-Archer#/media/File:Sturmey-Archer_7847.jpg\"><strong>Ashley Pomeroy / Creative Commons</strong></a></span></div>\n<p>If you’ve poked around in your grandparents’ shed, at least in the UK, you may have found a rusty steel bike with a Sturmey-Archer rear hub gear.</p>\n<p>The brand has been around for over 100 years, with its principal product being its three-speed hub gear, operated by a weedy-looking shift lever bolted to the handlebars.</p>\n<p>Almost any bike with more than one gear that was made in the UK used to have a Sturmey-Archer hub, right up until the French invasion with their new-fangled derailleurs in the 1950s (a French word and an invention that actually pre-dated the hub gear).</p>\n<p>Times move on and Sturmey-Archer now makes hub gears with up to eight speeds and coloured anodised options. It also still offers combination gear/drum brake hubs.</p>\n<p>Sturmey-Archer hubs use the same planetary gear system as Rohloff and Shimano. Weights for Sturmey-Archer hubs start at around 1kg.</p>\n<h3>Classified internal gear hubs</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"ANTWERPEN , BELGIE - MARCH 28 : Classified - Product shooting On 28, March, 2023 in Antwerpen , Belgie, 28/03/2023 © Gregory Van Gansen/Imagetting\" title=\"Product shooting @ Classified Cycling 28/3/23\" /></div><div><figcaption><span><i></i> Classified is a relatively new entrant to the gear hub market.</span></figcaption><span> <i>Classified</i></span></div>\n<p>A relative newcomer to the internal gear hub market is Belgian brand Classified.</p>\n<p>Whereas the other internal gear hubs above are intended to replace your rear derailleur and cassette, the Classified system replaces your front derailleur and double chainrings.</p>\n<p>It is designed to work with a rear derailleur and Classified’s own 11- or 12-speed cassette.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"ANTWERPEN , BELGIE - MARCH 28 : Classified - Product shooting On 28, March, 2023 in Antwerpen , Belgie, 28/03/2023 © Gregory Van Gansen/Imagetting\" title=\"Product shooting @ Classified Cycling 28/3/23\" /></div><div><figcaption><span><i></i> Classified hubs are controlled by a satellite shifter, but can also be integrated into Shimano Di2 shifting.</span></figcaption><span> <i>Classified</i></span></div>\n<p>A Classified hub gives you just two gear ratios, equivalent to the two offered by a double chainset, with riders able to choose the equivalent ratios to those provided by a standard, semi-compact, compact or sub-compact double chainset, dependent on the size of single chainring chosen.</p>\n<p>The Classified system is claimed to be faster than a front derailleur, plus the gears are engaged constantly, so you can shift under load and there’s no risk of a mis-shift or slipped chain when changing ratios.</p>\n<p>It’s actuated by a wireless connection between an electronic shift lever and the hub. You can also run a satellite shifter, enabling the Classified hub to work with mechanical groupsets.</p>\n<p>Classified claims a similar weight to a standard 2×11 or 2×12 derailleur system, eliminating one of the disadvantages of other hub gear systems.</p>\n<p>It is now also available for mountain bikes.</p>\n<h3>Enviolo continuously variable gear hubs</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Enviolo Automatiq Sport hub on the Canyon Precede ON CF 9 eBike boasts a very wide gear range\" title=\"Canyon Precede ON CF 9 07\" /></div><div><figcaption><span><i></i> Enviolo’s automatic internal hub boasts a very wide gear range.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Enviolo gear hubs work a little differently from other systems, providing continuously variable gearing.</p>\n<p>Rather than gear cogs, balls inside the hub transmit power. The axis of rotation of the balls is changed either manually via a twist shift or automatically. This enables stepless variation of the gear ratio.</p>\n<p>With the automatic system, you specify your desired cadence and the hub automatically adjusts the gearing to keep it at the defined level. When you stop, it will automatically down-shift for an easier start.</p>\n<p>It can be hooked up to an ebike system’s controller to provide a single point of control. Enviolo gears offer between 256 and 380 per cent gear range.</p>\n<p>There are disc, rim and roller brake options, and models designed for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-cargo-bike/\">electric cargo bikes</a> that can handle loads of up to 100Nm. The weight of an Enviolo hub starts at around 2kg and heads up to 2.4kg-plus for the heavy-duty options.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c48908a0cd402bdbe2eb296fe889b9e652864994a1eb33260076145b2dea1ced","category":"Cycling"}