{"title":"Spatially explicit Bayesian hierarchical models improve estimates of avian population status and trends","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad056/7454691?rss=1","date":1701216000000,"content":"<span><div>Abstract</div>Population trend estimates form the core of avian conservation assessments in North America and indicate important changes in the state of the natural world. The models used to estimate these trends would be more efficient and informative for conservation if they explicitly considered the spatial locations of the monitoring data. We created spatially explicit versions of some standard status and trend models applied to long-term monitoring data for birds across North America. We compared the spatial models to simpler non-spatial versions of the same models, fitting them to simulated data and real data from 3 broad-scale monitoring programs: the North American Breeding Bird Survey (BBS), the Christmas Bird Count, and a collection of programs we refer to as Migrating Shorebird Surveys. All the models generally reproduced the simulated trends and population trajectories when there were many data, and the spatial models performed better when there were fewer data and in locations where the local trends differed from the range-wide means. When fit to real data, the spatial models revealed interesting spatial patterns in trend, such as recent population increases along the Appalachian Mountains for the Eastern Whip-poor-will (<span>Antrostomus vociferus</span>), that were much less apparent in results from the non-spatial versions. The spatial models also had higher out-of-sample predictive accuracy than the non-spatial models for a selection of species using BBS data. The spatially explicit sharing of information allows fitting the models with much smaller strata, allowing for finer-grained patterns in trends. Spatially informed trends will facilitate more locally relevant conservation, highlight areas of conservation successes and challenges, and help generate and test hypotheses about the spatially dependent drivers of population change.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"c48e34baca063812e6dd42269364b929edf69bdaebb3c7fd31f53f432fbafa99","category":"Environment"}