{"title":"It’s very important to update your Apple device this week","link":"https://www.macworld.com/article/2008072/ios-ipados-macos-watchos-tvos-safari-security-updates.html","date":1690367400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s still going to be a few weeks until we get the next round of new products, but Apple is hard at work on the software running on our existing devices. This week alone, Apple released new betas for iOS 17, macOS 14, watchOS 10, and the rest of the software updates coming this fall, as well as a slew of updates to the current operating systems.</p>\n\n\n\n<p>On Monday, Apple released <a href=\"https://www.macworld.com/article/1923832/ios-16-6-beta-features-release-date.html\">numerous updates</a> for both new and old devices going all the way back to the iPhone 6s. They are free of new features, but they include numerous security updates, several of which are critical:</p>\n\n\n\n<p><strong>iOS 16.6 and iPadOS 16.6</strong> <br />Security updates: 16</p>\n\n\n\n<p><strong>iOS 15.7.8 and iPadOS 15.7</strong><br />Security updates: 10</p>\n\n\n\n<p><strong>macOS Ventura 13.5</strong><br />Security updates: 29</p>\n\n\n\n<p><strong>macOS Monterey 12.6.8</strong><br />Security updates: 15</p>\n\n\n\n<p><strong>macOS Big Sur 11.7.9</strong><br />Security updates: 12</p>\n\n\n\n<p><strong>watchOS 9.6</strong><br />Security updates: 12</p>\n\n\n\n<p><strong>tvOS 16.6</strong><br />Security updates: 8</p>\n\n\n\n<p>Across the various updates, there are several patches for high-risk vulnerabilities affecting all of the operating systems. Specifically, two of the flaws may have been actively exploited and one is a new zero-day. The WebKit flaw was previously addressed in the Rapid Security Response updates for iOS 16, iPadOS 16, and macOS Ventura, but is new to the other OSes:</p>\n\n\n\n<p><strong>Kernel</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> An app may be able to modify sensitive kernel state. Apple is aware of a report that this issue may have been actively exploited against versions of iOS released before iOS 15.7.1.</li>\n\n\n\n<li><strong>Description:</strong> This issue was addressed with improved state management.</li>\n\n\n\n<li><strong>CVE-2023-38606:</strong> Valentin Pashkov, Mikhail Vinogradov, Georgy Kucherin (@kucher1n), Leonid Bezvershenko (@bzvr_), and Boris Larin (@oct0xor) of Kaspersky</li>\n</ul>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.</li>\n\n\n\n<li><strong>Description:</strong> The issue was addressed with improved checks.</li>\n\n\n\n<li><strong>WebKit Bugzilla:</strong> 259231<br /><strong>CVE-2023-37450: </strong>an anonymous researcher</li>\n</ul>\n\n\n\n<p>In addition to those two bugs, there are several other WebKit patches that address flaws that “may lead to arbitrary code execution” or disclose personal information to hackers. So it’s fair to say these are among the most important updates of the year, so if you have an Apple device made after 2015, you should update it ASAP.</p>\n\n\n\n<p>To update your device, head over to the Settings app (or System Settings/Preferences on a Mac) and select <em>General</em> &gt; <em>Software Update</em>, then <em>Install</em> and follow the prompts. </p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c49dd9654fd6863ba7d48db2bb87c6d2087ab73ea0aadfbc1addc1a8ca903c3b","category":"Apple"}