{"title":"Yes, that’s a paywall you (maybe) just hit","link":"https://cyclingtips.com/2021/11/yes-thats-a-paywall-you-maybe-just-hit/","date":1635969900000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/CORVOS_00024839-128-650x433.jpg\" /></div><h2>Yes, that's a paywall you (maybe) just hit</h2><p>\n</p><p>Dear CyclingTips readers,</p>\n\n\n\n<p>CyclingTips now has a paywall, of sorts. </p>\n\n\n\n<p>Deep breaths, everyone. </p>\n\n\n\n<p>This is big for us. It’s big for the whole CT family and our millions of readers. It’s more than a little frightening. CyclingTips has been fully free for everyone for a long time, and we’ve always been very proud of that. So, allow me to explain why this, and why now. </p>\n\n\n\n<p>Technically, we are implementing what’s called a metered paywall. You’ve come across these before in places like the New York Times (in fact Cyclingnews added one just last week). Readers will be able to view a certain number of stories every month before it kicks in, at which point you’ll need to subscribe to keep reading. That cost will be 75 cents per week, US $3.99 per month. (This story doesn’t count toward your total, by the way.) </p>\n\n\n\n<p>This is a lower cost than our full VeloClub membership, and doesn’t come with all the same perks. But it does remove the wall, quickly and cheaply. </p>\n\n\n\n<p>The core question you’re probably asking is ‘why are we implementing a paywall’? </p>\n\n\n\n<p>Our members have contributed to an immeasurable improvement to CyclingTips since VeloClub was launched. We’ve seen the positive effect that this change of business model has had on our overall service, and we’re doubling down on this premise. </p>\n\n\n\n<p>We chose this type of paywall very carefully, based on a few fundamental beliefs. </p>\n\n\n\n<p>The first belief is that our members make us better. Working directly for readers who financially support our service is better than any alternative. </p>\n\n\n\n<p>That is the core of VeloClub. VeloClub is the reason we have a growing network of podcasts, the reason Iain Treloar can focus on his Bovines of the Pros beat instead of churning sponsored content. It’s why we have José Been and Abby Mickey and Amy Jones and why our coverage of women’s cycling is constantly improving. Aren’t you glad James Huang writes reviews for you, and not for ad interests? I certainly am. </p>\n\n\n\n<p>VeloClub is why CyclingTips is different. It would be impossible for this site to exist as-is without those willing to pay for what we produce. </p>\n\n\n\n<p>Our second belief is that everybody should be able to access any story we write, podcast we record, or video we edit. And our third belief is that what we create and publish has value. </p>\n\n\n\n<p>This is the hard part. Those last two beliefs exist in conflict. That conflict is why a metered paywall makes the most sense to us. </p>\n\n\n\n<p>A metered paywall keeps CyclingTips free to anybody passing through – the millions of bike people who will visit a couple times per month or per year – while simultaneously standing up for the value of what we create. It asks readers who appreciate our work and engage with it frequently to support that work financially. </p>\n\n\n\n<p>The only folks who will run up against our paywall are our “super users.” Readers who come back many times per week, or even per day. So if you hit it, we want to make you part of the club. </p>\n\n\n\n<p>This is a big moment for us. Big and scary. There’s going to be a lot of shouting in my inbox this week, and maybe we’ll deserve some of it. But I’m hopeful most of you out there will see what we’ve seen – that when we work for our readers, directly for them, we make better stuff. This is another step in that direction. That’s what we all want, right?</p>\n\n\n\n<p>Thanks for reading. If you have questions, <a href=\"mailto:editor@cyclingtips.com\">my inbox</a> is always open. Or drop a comment below. </p>\n\n\n\n<p>Caley Fretz</p>\n\n\n\n<p>Editor in Chief  |  CyclingTips</p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/yes-thats-a-paywall-you-maybe-just-hit/\">Read More</a>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c4a339a2da81dcbe7bf8d00e944eecd11546a7f896ba62f0da064f99b20adf9c","category":"Cycling"}