{"title":"Apple Maps vs. Google Maps: Which Is Better?","link":"https://www.macrumors.com/2024/03/01/apple-maps-vs-google-maps/","date":1709305843000,"content":"<a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a> has been providing navigational guidance to Apple users for almost 13 and a half years now, and much has changed about the app in that time. However, according to data from Canalys, the overwhelming majority of iPhones in the U.S. still have Google Maps downloaded as an alternative to ‌Apple Maps‌, which comes preinstalled on all iPhones. We want to hear from <em>MacRumors</em> readers. Which do you prefer to get you from A to B?\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/Apple-Maps-vs-Google-Maps-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nLaunched in September 2012, ‌Apple Maps‌ was quickly <a href=\"https://www.macrumors.com/2012/09/20/apples-new-ios-6-maps-app-drawing-significant-criticism/\">criticized</a> for having incomplete and inaccurate mapping data, which led some <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users on dangerous routes. Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> offered a <a href=\"https://www.macrumors.com/2012/09/28/tim-cook-publishes-open-letter-on-maps-for-ios-6/\">rare public apology</a> for the frustration it caused customers, and iOS chief Scott Forstall was <a href=\"https://www.macrumors.com/2012/10/29/scott-forstall-reportedly-forced-out-of-apple/\">ousted</a> just one month later.\r<br />\n\r<br />\nSince then, Apple has made significant improvements to ‌Apple Maps‌, building in new features and correcting lingering errors. Real-time traffic information and navigation options for pedestrians were added to Maps in 2013, which is also the same year Maps was extended to OS X. In 2015, Maps was updated with \"Nearby,\" a feature that offers up local points of interest and transit directions in a handful of cities.\r<br />\n\r<br />\nIn early 2020, Apple completed an overhaul of its maps in the United States, adding significantly greater detail including updated buildings, parks, sports fields, pools, and more. A Look Around feature in select cities is similar to Google's Street View, and the updated maps have been rolling out to more countries in the time since. In iOS 15, Apple introduced immersive walking directions shown in augmented reality, curated guides for select cities, real-time transit updates, and more road details for enhanced driving navigation. In iOS 16 it gained multi-stop routing. And in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, Apple made it possible to download maps for offline use – something Google Maps users have been able to do for quite some time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/Apple_Apple-Maps_New-Ways_09272021_big.jpg.large_2x.jpg\" width=\"1960\" height=\"1290\" />\r<br />\nHave Apple's incremental improvements been enough for it to be considered an equal to Google Maps in users' eyes? Of course, Google developers have not stood idly by watching ‌Apple Maps‌' gradual evolution. Google has introduced several enhancements aimed at enriching the user experience through advanced AI technology and more immersive visualization tools, and has even taken a leaf or two out of Apple's book.\r<br />\n\r<br />\nOne notable recent update in this regard is the Immersive View for Routes, which provides a comprehensive preview of a user's journey, whether they are driving, walking, or cycling. Launched last year, the tool combines billions of Street View and aerial images to create an intricate digital representation of the world, allowing users to visually navigate through bike lanes, sidewalks, intersections, and parking spaces along their route. It also includes a dynamic time slider indicating how conditions such as air quality and weather change throughout the day, helping users plan their trips with more precision.\r<br />\n\r<br />\nAnother significant improvement is the integration of Lens in Maps, an evolution of the Search with Live View feature. Leveraging AI and augmented reality, Lens in Maps helps users get their bearings in a new location by providing information about nearby amenities like ATMs, transit stations, and dining options. The feature has since been expanded to over 50 cities.\r<br />\n\r<br />\nGoogle Maps has also rolled out updates to make navigation maps more reflective of real-world conditions. These include more detailed and realistic representations of buildings and improved lane guidance on highways. For electric vehicle owners, Google Maps also offers information on charging stations, including compatibility details, charger speed, and the last usage time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/google-maps-immersive-view.jpg\" width=\"1060\" height=\"666\" />\r<br />\nDespite these concurrent improvements to Google Maps, their combined effect hasn't stopped users coming away impressed by how far Apple's navigational guidance has come. Based on anecdotal reports, the app is increasingly recommended by users for its cleaner view versus the more cluttered design of Google Maps.\r<br />\n\r<br />\nLikely thanks to its disastrous launch, ‌Apple Maps‌ still gets a bad rap among some users, but Apple's continued efforts to improve the app appear to have helped reverse some of those opinions. \"Maps has come a long way, and people have noticed,\" Craig Federighi, Apple's head of software, said at WWDC 2023. Are you more or less likely to use ‌Apple Maps‌ these days? Let us know in the comments.<div>Tags: <a href=\"https://www.macrumors.com/guide/google-maps/\">Google Maps</a>, <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/01/apple-maps-vs-google-maps/\">Apple Maps vs. Google Maps: Which Is Better?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-maps-vs-google-maps-which-is-better.2420799/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c4a5a8df95a70160782afa637a4fb34dd1ad8f3977c6b03da2e009035eaf0942","category":"Apple"}