{"title":"กลุ่มขวาจัดรุมรีพอร์ตนักข่าวบน Twitter จนโดนปิดหลายบัญชี จากนโยบายห้ามแชร์ภาพและวิดีโอส่วนตัว","link":"https://www.blognone.com/node/126153","date":1638674580000,"content":"<div><div><div><p>Twitter เพิ่งออกกฎ<a href=\"https://www.blognone.com/node/126085\">แชร์ภาพวิดีโอส่วนตัวต้องได้รับอนุญาตก่อน</a> และหลังจากบังคับใช้กฎนี้ก็เริ่มพบปัญหาแล้ว โดยสำนักข่าว Washington Post ได้รายงานว่ามีนักข่าวและนักวิจัยกลุ่มหนึ่งที่รายงานข้อมูลเกี่ยวกับกลุ่มขวาจัดโดนปิดบัญชี Twitter จากการมีผู้รายงานโดยอ้างกฎข้อนี้เข้ามาเป็นจำนวนมาก</p>\n<p>ในรายงานระบุว่า หลังจากที่กฎโดยซีอีโอคนใหม่ของ Twitter ประกาศใช้งาน กลุ่มขวาจัดและกลุ่มนิยมคนขาวสุดโต่งได้ทวีตให้ผู้ติดตามช่วยรายงานบัญชีที่ระบุนีโอนาซี, รายงานกลุ่มหัวรุนแรง และเผยแพร่เอกสารผู้เข้าร่วมกิจกรรมปลุกระดมสร้างความเกลียดชัง พร้อมแนบขั้นตอนรายงานบัญชีเหล่านี้ให้ผู้ติดตามช่วยกัน ทำให้บัญชีบางส่วนที่โดนถล่มรายงานถูกระงับโดย Twitter จึงเกิดความกังวลว่านโยบายใหม่จะขัดขวางการรายงานกิจกรรมเกี่ยวกับผู้นิยมขวาจัดและผู้นิยมความรุนแรง ทำให้คนกลุ่มนี้ได้เปรียบเนื่องจากสามารถปกปิดตัวตนได้</p>\n<p>Trenton Kennedy โฆษกของ Twitter รายงานว่า ทางบริษัทได้รับรายงานประสงค์ร้ายจำนวนมาก และทีมงานของ Twitter ทำงานพลาดไปหลายครั้ง ซึ่งเขาเองไม่ได้ระบุว่ามีรายงานเข้ามากี่ครั้ง แต่ Twitter ได้ระงับบัญชีผิดพลาดไป 12 บัญชี และจะออกรายงานการตรวจสอบในภายหลัง</p>\n<p>Twitter ระบุว่ากฎเรื่องภาพส่วนตัวตั้งขึ้นมาเพื่อป้องกันการใช้สื่อข่มขู่คุกคามตัวบุคคล พร้อมทั้งยกตัวอย่างกรณีภาพที่<strong>ไม่เข้าข่าย</strong>เป็นภาพส่วนตัว  ได้แก่ ภาพที่เป็นสาธารณะอยู่แล้ว หรือเผยแพร่โดยสื่อกระแสหลัก, ภาพที่เป็นประโยชน์ต่อการถกเถียง การพูดคุยกันของสาธารณะ, ภาพเหตุการณ์ที่กำลังเกิดขึ้น รายงานจากสถานที่จริง และภาพที่บุคคลในภาพเป็นบุคคลสาธารณะ แต่หลายบัญชีที่ถูกระงับในครั้งนี้รายงานภาพสาธารณะซึ่งเป็นภาพของบุคคลสาธารณะ ถือเป็นการกระทำที่ไม่เข้าข่ายต้องระงับบัญชี</p>\n<p>ที่มา - Washington Post (<a href=\"https://www.washingtonpost.com/technology/2021/12/03/twitter-admits-error-in-account-suspensions/\">1</a>, <a href=\"https://www.washingtonpost.com/technology/2021/12/02/twitter-media-rule-used-by-extremists/\">2</a>)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bcc6ddc72a0343181af32edced8ab74f.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c4ac3c4767bd55da692ffdd620e53eefc04f463b466f5b33fc04395b19b65746","category":"Thai"}