{"title":"Sustainability Language Found in Forest Plans and Its Mathematical Modeling Potential","link":"https://www.preprints.org/manuscript/202407.0059/v1","date":1719821762000,"content":"Over the last fifty years, management plans have become more descriptive with regard to potential sustainability of forest systems, raising questions about the feasibility of implementing management activities and ensuring sustainability of a wide variety of ecosystem services. To assess this issue, we conducted a survey among forest planning and operation research communities to understand their perceptions regarding the potential of a sample of sustainability statements currently used in forest plans to be incorporated into optimization models or other mathematical operations. The results revealed that only a few statements from the sample were deemed to have relatively mature or firm methodologies and data to enable inclusion in modern mathematical models for land use optimization. These statements were mostly related to economic sustainability, offering quantifiable information such as a non-declining flow of wood products over time and limits on the amount of timber harvested per decade. In contrast, sociocultural and, to some extent, ecological statements regarding sustainability were generally perceived to be more difficult to translate into mathematical modeling efforts. Particularly challenging were statements corresponding to sustaining natural or scenic characteristics of a forest. These findings may be attributed to various factors, including a lack of measurable indicators for sustainability and a potential lack of understanding about the modeling components and their interactions with planned management activities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c4b0c09299c7194205fd76717ddefd9d2d22dce5cebab047994c8d70594af316","category":"Interdisciplinary"}