{"title":"You Can Log Your Moods and Emotions in iOS 17","link":"https://www.macrumors.com/2023/06/05/ios-17-mood-logging/","date":1686011242000,"content":"The <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> Health app introduces a new feature that allows you to keep track of your emotions and moods over time, so you can get an idea of your overall mental wellbeing.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/ios-17-mood-logging.jpg\" alt width=\"2000\" height=\"1299\" />\r<br />\nWith the ‌iOS 17‌ Health app, you can quickly make a note of your state of mind each day. There's an option to choose a feeling ranging from Very Unpleasant to Very Pleasant, and then a list of words that you can use to hone in on your general mood.\r<br />\n\r<br />\nFrom there, you can select a reason for the way that you're feeling, such as work, partner, hobbies, money, health, family, and more. Logging a mood takes just a few seconds, and the Health app will aggregate the data over time.\r<br />\n\r<br />\nMood logging can also be done on an Apple Watch running <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a> through the Mindfulness app. On the watch, if you open up the Mindfulness app, there's a new \"Log State of Mind\" option. Tapping it lets you log how you're feeling right now or how you've felt throughout the day.\r<br />\n\r<br />\nApple says that it also plans to link your mood reports to your activities like Workouts and sleep so you can see what might have an impact, plus the company plans to provide standardized mental health assessments so you can see your risk for anxiety or depression.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/ios-17-mood-logging/\">You Can Log Your Moods and Emotions in iOS 17</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/you-can-log-your-moods-and-emotions-in-ios-17.2391758/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c4b1af33e740369594982654ce7bb5437920ff0ed39beab7f27e15c62447e3da","category":"Apple"}