{"title":"KBTG เปิดตัว Tech Kampus ร่วมพัฒนาหลักสูตรในมหาวิทยาลัย เตรียมความพร้อม นศ. สู่ตลาดจริง","link":"https://www.blognone.com/node/122042","date":1617607607000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>หนึ่งในปัญหาใหญ่ของวงการไอทีคือ ขาดแคลนบุคลากร นักพัฒนาซอฟต์แวร์, วิศวกร, คนทำ AI, คนทำงานด้านไซเบอร์ซีเคียวริตี้ ล้วนแล้วแต่เป็นตำแหน่งที่ตลาดงานต้องการสูง แต่การเตรียมความพร้อมบุคลากรยังไม่สามารถป้อนตลาดงานได้ทัน</p>\n<p>KBTG บริษัทเทคโนโลยีในเครือธนาคารกสิกรไทยเห็นปัญหานี้ ได้เปิดตัวโครงการ Tech Kampus เพื่อส่งเสริมคุณภาพการศึกษาทางด้านเทคโนโลยีในประเทศไทย สร้างบุคลากรรุ่นใหม่ที่เปี่ยมศักยภาพ โดย KBTG จะเข้าไปร่วมมือกับมหาวิทยาลัย เพื่อพัฒนาหลักสูตร ยกระดับคุณภาพการศึกษาในสาขา Data Science และ Artificial Intelligence (AI) รวมทั้งต่อยอดและผลิตงานวิจัยใหม่ๆ ทางด้านเทคโนโลยี</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e8c1e0b701fd7a4b853d5fc075cf6c00.jpeg\" ></p>\n<p>ในโครงการ Tech Kampus นั้น KBTG ร่วมมือกับ 2 องค์การภาครัฐ คือศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ (NECTEC) และสมาคมปัญญาประดิษฐ์ประเทศไทย  (AIAT)</p>\n<p>ด้าน 7 มหาวิทยาลัย ประกอบด้วย สถาบันเทคโนโลยีแห่งเอเชีย คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย คณะเทคโนโลยีสารสนเทศ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง มหาวิทยาลัยเกษตรศาสตร์ วิทยาลัยนวัตกรรม มหาวิทยาลัยธรรมศาสตร์ มหาวิทยาลัยซีเอ็มเคแอล และวิทยาลัยนานาชาติ มหาวิทยาลัยมหิดล</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/38bb6c688aaadd4cf684db0ff7dd660f.jpeg\" ></p>\n<p>นอกจากร่วมพัฒนาหลักสูตรแล้ว KBTG ยังเปิดรับนิสิตนักศึกษาเข้ามาเรียนรู้และเข้ามาฝึกงานกับทาง KBTG วิจัยเทคโนโลยีใหม่ๆ และเตรียมความพร้อมสู่โลกทำงาน เพื่อทักษะที่ตรงกับความต้องการของตลาดแรงงานด้านไอทีมาใช้งานจริง</p>\n<h3>เมื่อการร่วมมือระหว่างภาคการศึกษาและเอกชน คือสิ่งจำเป็น</h3>\n<p>ในงานเปิดตัวโครงการ Tech Kampus มีเสวนาจากคณาจารย์ เรื่องความสำคัญของการจัดทำหลักสูตรการศึกษาด้าน Data Science/AI ระดับอุดมศึกษาในประเทศไทยและพูดถึงภาพรวมความร่วมมือระหว่างภาคการศึกษาและภาคธุรกิจ ได้มุมมองที่น่าสนใจ ดังนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4bf29a83f754df08a0e7dd35722c8c60.jpeg\" ></p>\n<p><strong>ดร. อักฤทธิ์ สังข์เพชร ผู้อำนวยการหลักสูตรคาร์เนกีเมลลอน มหาวิทยาลัยซีเอ็มเคแอล (CMKL University)</strong> บอกว่าที่ผ่านมา ทางสถาบันดำเนินการเรียนการสอนด้วยการร่วมมือกับเอกชนเสมอ เพื่อให้นักศึกษาได้มีที่ปล่อยของ หนึ่งในหลักสูตรที่พัฒนาคือ Computer Engineering นำผู้เชี่ยวชาญทั้งไทยและต่างประเทศมาตีโจทย์และแก้ไขปัญหาประเทศด้วยกัน ซึ่งทางสถาบันจะขยายหลักสูตรนี้ไปยังปริญญาตรีด้วย</p>\n<p><strong>ผศ.ดร. รัชฎา คงคะจันทร์ ผู้อำนวยการหลักสูตรวิทยาศาสตร์บัณฑิตสาขาวิทยาศาสตร์และนวัตกรรมข้อมูล มหาวิทยาลัยธรรมศาสตร์</strong> ให้แง่คิดว่า อาจารย์ผู้สอน มีความพยายามตั้งใจสอนอย่างดีที่สุด เปรียบเหมือนช่างตัดเสื้อที่พยายามตัดให้เนี้ยบที่สุด แต่ในขณะเดียวกัน คนตัดเสื้อก็ต้องดูเทรนด์แฟชั่นในขณะนั้น การมีเอกชนเข้ามาร่วมมือกับมหาวิทยาลัยจะช่วยให้เรารู้ว่าเทรนด์เป็นอย่างไรบ้าง</p>\n<p><strong>อ.สมโชค เรืองอิทธินันท์ รองหัวหน้าภาควิชาวิทยาการคอมพิวเตอร์ และประธานหลักสูตรปริญญาตรีสาขาวิทยาการคอมพิวเตอร์ มหาวิทยาลัยเกษตรศาสตร์</strong> ยอมรับว่า อนาคต มหาวิทยาลัยไม่พ้นต้องปรับตัว ซึ่งภาคเอกชนเขาปรับตัวอยู่ตลอดเวลาอยู่แล้ว ทางมหาวิทยาลัยต้องผลักดันนโยบายร่วมมือกับเอกชนอย่างจริงจัง การ reskill ก็เป็นประเด็นสำคัญที่ควรนำมาพิจารณา เนื่องจากหลักสูตรเก่าๆ หลักสิบปีไม่ตอบโจทย์ตลาดงานปัจจุบันแล้ว คนที่เรียนจบไปนานควรกลับมาพึ่งมหาวิทยาลัยได้เมื่อต้องการ reskill ใหม่</p>\n<p><strong>ผศ.ดร. ฆนัท ตั้งวงศ์ศานต์ สาขาวิทยาการคอมพิวเตอร์ วิทยาลัยนานาชาติ มหาวิทยาลัยมหิดล</strong> มองว่า การร่วมมือกับเอกชนช่วยให้นักศึกษารู้ตัวได้เร็วขึ้นว่าตัวเองอยากทำอะไร และคณาจารย์จะได้มีโอกาสทำงานวิจัยที่ออกไปใช้งานจริงได้มากขึ้น</p>\n<p><strong>ศ.ดร. ธนารักษณ์ ธีระมั่นคง นายกสมาคมปัญญาประดิษฐ์แห่งประเทศไทย</strong> บอกว่า แต่ละสถาบันการศึกษามีแนวโน้มปรับตัวอยู่แล้ว การที่ KBTG เข้ามาร่วมมือตรงๆ จะกลายเป็นโครงการนำร่องและนโยบายนี้จะสามารถขยายไปยังมหาวิทยาลัยอื่นๆ ต่อไป</p>\n<h3>สรุป</h3>\n<p>เรืองโรจน์ พูนผล ประธาน KBTG ระบุว่า เป้าหมายระยะยาวของธนาคารกสิกรไทยคือ One of the World Digital Bank ซึ่งทางธนาคารไม่สามารถไปได้ด้วยตัวคนเดียวได้ เราต้องร่วมกับหน่วยงานอื่น โดยเฉพาะสถาบันการศึกษา เพื่อขอแรงมาช่วยให้บริษัทขับเคลื่อนต่อไปได้</p>\n<p>Tech Kampus ถือเป็นอีกก้าวสำคัญ และไม่ได้มีมีเป้าหมายเพียงหาบุคลากรที่ตอบโจทย์ความต้องการของบริษัทเท่านั้น แต่ยังมีความสำคัญกับการศึกษาและเศรษฐกิจของประเทศ ที่อนาคต นักศึกษาจะได้เรียนรู้ทักษะเทคโนโลยีที่เอาไปใช้งานจริง ตรงกับเทรนด์โลกได้จริงเมื่อเข้าสู่วัยทำงาน และที่สำคัญคือ สามารถอยู่รอดได้ในภาวะ disruption</p>\n<p>หากสถาบันใดสนใจเข้าร่วมโครงการ KBTG Tech Kampus สามารถติดต่อได้ที่ kbtgtechkampus@kbgt.tech</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/kbtg\">KBTG</a></div><div class=\"field-item odd\"><a href=\"/topics/education\">Education</a></div><div class=\"field-item even\"><a href=\"/topics/thailand\">Thailand</a></div><div class=\"field-item odd\"><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c4b3865166e62b64940de4938b2dd17ed04c7c350654dfae62fd0217d6cb7101","category":"Thai"}