{"title":"สถิติแพ็กเกจยอดนิยมบน npm พบ 1 ใน 5 เป็นแพ็กเกจล้าสมัย ถูกทิ้งแล้ว หาต้นทางไม่เจอ","link":"https://www.blognone.com/node/137777","date":1705823898000,"content":"<div><div><div><p>บริษัทวิจัยความปลอดภัย Aqua Security เก็บสถิติแพ็กเกจยอดนิยมบน npm จำนวน 50,000 รายการแรกมาวิเคราะห์ แล้วพบว่าแพ็กเกจสัดส่วน 8.2% มีสถานะเป็นล้าสมัย (deprecated) อย่างเป็นทางการแล้ว (หมายถึงนักพัฒนาเจ้าของแพ็กเกจนั้นประกาศ deprecated อย่างชัดเจน)</p>\n<p>อย่างไรก็ตาม ถ้านับแพ็กเกจอื่นที่อาจไม่ deprecated อย่างเป็นทางการ แต่มีสถานะคล้ายๆ กัน เช่น ตัว repository ทั้งอันบน GitHub ถูกปรับเป็น archived ไม่ใช้งานแล้ว, ตัว repository ถูกลบออกจาก GitHub แต่แพ็กเกจยังอยู่ใน npm, แพ็กเกจไม่ได้มีลิงก์ไปยัง repository ต้นทางด้วย สัดส่วนแพ็กเกจที่ล้าสมัย-ใช้งานไม่ได้จะเพิ่มเป็น 21% หรือราว 1/5 ของแพ็กเกจทั้งหมดเลยทีเดียว</p>\n<p>Aqua Security บอกว่าแพ็กเกจที่ล้าสมัยเหล่านี้มีความเสี่ยงด้านความปลอดภัย เพราะนักพัฒนาไม่อุดรูรั่วให้อีกแล้ว แม้มีคนค้นพบช่องโหว่แล้วแจ้งไปก็ตาม ทางออกขององค์กรจึงควรกำหนดนโยบายว่าแพ็กเกจใดบ้างที่ไม่ควรใช้งานอีกต่อไป และ Aqua Security เองก็ออกเครื่องมือ <a href=\"https://github.com/Aqua-Nautilus/Dependency-Deprecated-Checker\">Dependency Deprecation Checker</a> มาช่วยตรวจสอบแพ็กเกจให้ด้วย</p>\n<p>ปัญหาเรื่องช่องโหว่ของแพ็กเกจบน npm เป็นเรื่องที่ถูกพูดถึงมากขึ้นเรื่อยๆ ในช่วงหลัง โดยต้นสังกัดอย่าง GitHub เองก็มีมาตรการหลายอย่างมาช่วยยกระดับความปลอดภัย เช่น <a href=\"https://www.blognone.com/node/126991\">บังคับนักพัฒนาต้องล็อกอินแบบ 2FA เพื่อป้องกันการยัดไส้มัลแวร์ลงในแพ็กเกจ</a></p>\n<p>ที่มา - <a href=\"https://blog.aquasec.com/deceptive-deprecation-the-truth-about-npm-deprecated-packages\">Aqua Security</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ef4c186426c4dc96dfde43d6c3732a85.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/npm\">NPM</a></div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/github\">GitHub</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c4b54f9043c0006ecc728b5794c5da050a095bb1036039e4a7a0104f4d495975","category":"Thai"}