{"title":"Pieters and Robeet take wins at Nokere Koerse: Daily News","link":"https://cyclingtips.com/2021/03/pieters-and-robeet-take-wins-at-nokere-koerse-daily-news/","date":1616018763000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Wednesday saw riders racing on cobbles and climbs in Belgium at Nokere Koerse, where Amy Pieters rode to the victory in the women&#8217;s race and Ludovic Robeet took the win in the men&#8217;s race.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Pieters takes Nokere Koerse victory</h3>\n\n\n\n<p><strong>Amy Pieters</strong> took her first win of the season on Wednesday at <strong>Nokere Koerse</strong>, besting <strong>Grace Brown</strong> and <strong>Lisa Klein</strong> in Kruisem.</p>\n\n\n\n<p>The 120 km race from Deinze saw the trio of escapees leave the pack behind with around 50 km still to go on bumpy Belgian roads. Although the pack never allowed the gap to grow particularly wide, Pieters, Brown, and Klein worked well together in the wind and the rain to hold on as the kilometers ticked down. The trio started the third of three laps on a finishing circuit with less than 20 seconds on the peloton but they held off the chasers to fight for the win in a sprint in a cobbled finale.</p>\n\n\n\n<p>Pieters was the clear winner at the line, with Brown settling for second on the same time in Klein in third, four seconds back. 20 seconds later, <strong>Lotte Kopecky</strong> led the chasers over the line in fourth.</p>\n\n\n\n<p><strong>Top 10</strong></p>\n\n\n\n<p>1 PIETERS Amy (SD Worx) 3:13:53<br>2 BROWN Grace (Team BikeExchange)<br>3 KLEIN Lisa (Canyon SRAM Racing) 0:04<br>4 KOPECKY Lotte (Liv Racing) 0:20<br>5 WIEBES Lorena (Team DSM)<br>6 D&#8217;HOORE Jolien (SD Worx)<br>7 CONFALONIERI Maria Giulia (Ceratizit-WNT Pro Cycling)<br>8 NORSGAARD Emma (Movistar Team)<br>9 BASTIANELLI Marta (Alé BTC Ljubljana)<br>10 MAJERUS Christine (SD Worx) 0:23</p>\n\n\n\n<p>You can <a href=\"https://www.eurosport.com/cycling/nokere-koerse/2021/nokere-koerse-cycling-2021-highlights-amy-pieters-wins-as-breakaway-survives_vid1449624/video.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">watch highlights here</a>.</p>\n\n\n\n<h3>Robeet nabs Nokere Koerse win</h3>\n\n\n\n<p><strong>Ludovic Robeet</strong> took his first pro one-day win on Wednesday at Nokere Koerse.</p>\n\n\n\n<p>Robeet was part of the main break of the day, which formed a little over an hour into the 195 km race from Deinze to Nokere. The eight escapees built an advantage that topped out at around four minutes before the peloton began closing the gap. Although the gap was down to a minute with 30 km to go, the chasers would not manage to close down everyone up the road. With around 15 km to go, Robeet and <strong>Damien Gaudin</strong> attacked out of the escape and built a small gap that would hold into the finale as the pack caught the rest of the breakaway riders. There were attacks and counterattacks in the bunch, but Robeet and Gaudin continued to hold on out front. There were also crashes, with <strong>Mark Cavendish</strong> and then his Deceuninck-Quick-Step teammate <strong>Jannik Steimle</strong> among those hitting the deck.</p>\n\n\n\n<p>Inside the last 2 km, Robeet put in a big dig and distanced Gaudin, and he held on to take the win by three seconds. Gaudin settled for runner-up honors with <strong>Luca Mozzato</strong> winning the sprint for third.</p>\n\n\n\n<p><strong>Top 10</strong></p>\n\n\n\n<p>1 ROBEET Ludovic (Bingoal &#8211; Wallonie Bruxelles) 4:33:37<br>2 GAUDIN Damien (Team Total Direct Energie) 0:03<br>3 MOZZATO Luca (B&amp;B Hotels p/b KTM) 0:05<br>4 MEEUS Jordi (BORA &#8211; hansgrohe)<br>5 VAN ASBROECK Tom (Israel Start-Up Nation)<br>6 STEWART Jake (Groupama &#8211; FDJ)<br>7 WALSCHEID Max (Team Qhubeka ASSOS)<br>8 HALVORSEN Kristoffer (Uno-X Pro Cycling Team)<br>9 NARVÁEZ Jhonatan (INEOS Grenadiers)<br>10 BARBIER Rudy (Israel Start-Up Nation)</p>\n\n\n\n<p>You can <a href=\"https://www.eurosport.com/cycling/nokere-koerse/2021/nokere-koerse-2021-news-highlights-ludovic-robeet-takes-victory-as-peloton-misjudges-chase_vid1449766/video.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">watch highlights here</a>.</p>\n\n\n\n<h3>Steimle will undergo surgery after crash</h3>\n\n\n\n<p><strong>Deceuninck-Quick-Step</strong> said after <strong>Nokere Koerse</strong> on Wednesday that <strong>Jannik Steimle</strong> would &#8220;be on the sidelines after suffering several injuries at the Belgian one-day race.&#8221; According to the team, evaluations at the hospital determined that Steimle &#8220;had suffered an AC luxation of his right shoulder,&#8221; for which he will need to undergo surgery.</p>\n\n\n\n<p>He also suffered &#8220;a fractured rib, a minor pneumo, and concussions,&#8221; and will spend the night in the hospital under observation.</p>\n\n\n\n<h3>Woods commits to carbon-neutral season</h3>\n\n\n\n<p><strong>Mike Woods</strong> has announced that he has committed to racing <strong>carbon neutral</strong> this season. The 34-year-old Canadian said that he calculated his carbon footprint to be 60 tons of CO2, with 33 of those coming from race travel, and that he will decrease those numbers through a combination of lifestyle changes like reducing his use of plastics and rethinking travel and making financial contributions to carbon offsets.</p>\n\n\n\n<p>“This is a hugely important and complex issue with no quick fix but my goal is to educate myself, take responsibility for my lifestyle, and to inspire my fans, partners and fellow pros along the way,” Woods said.</p>\n\n\n\n<h3>Kelderman will start his season at the Volta a Catalunya</h3>\n\n\n\n<p><strong>Wilco Kelderman</strong>, who was injured in a collision with an SUV earlier this year, will make his first racing start of the season at the <strong>Volta a Catalunya</strong>. In an interview with <a href=\"https://www.ad.nl/wielrennen/wilco-kelderman-ik-kreeg-die-nekkraag-om-en-dacht-nee-niet-weer-he~a66115ce/\" target=\"_blank\" rel=\"noreferrer noopener\">Algemeen Dagblad</a>, Kelderman described the crash that left him with a fractured vertebra and said that his recovery had gone well after he had to spend some time wearing a neck brace.</p>\n\n\n\n<p>&#8220;After ten days, that brace could also be removed. In retrospect, I can happily say that it was better than expected,&#8221; Kelderman said. &#8220;That it could have ended much worse. I have also been at an altitude training camp at the Sierra Nevada for two and a half weeks. Normally you start such a camp with a higher level, but I actually feel really good. Fortunately, I have not lost too much fitness.&#8221;</p>\n\n\n\n<p>Kelderman, who joined <strong>Bora-Hansgrohe</strong> for this season after transferring from <strong>Sunweb</strong>, will start his season at the Volta a Catalunya, where he said he does not expect to contend for the overall, before heading to the Itzulia Basque Country, the Amstel Gold Race, Liège-Bastogne-Liège, Brabantse Pijl, the Critérium du Dauphiné, and the Tour de France.</p>\n\n\n\n<h2>Moving Pictures</h2>\n\n\n\n<p>Adam Blythe is a man of many talents. He can ride his bike quite fast, he&#8217;s a natural as a commentator, and, apparently, he&#8217;s quite good at bunny-hopping stairs.</p>\n\n\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">This was bloody hard word.. surely a British record for hopping up steps?? Probably not even close am i? Or is this the first attempt? If so, il take it!!! <a href=\"https://twitter.com/hashtag/victory?src=hash&amp;ref_src=twsrc%5Etfw\">#victory</a> <a href=\"https://t.co/i6TPBotuDG\">pic.twitter.com/i6TPBotuDG</a></p>\n<p>— Adam Blythe (@AdamBlythe89) <a href=\"https://twitter.com/AdamBlythe89/status/1372224188308668421?ref_src=twsrc%5Etfw\">March 17, 2021</a></p>\n</blockquote>\n<p> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n\n<h2>In case you missed it &#8230;</h2>\n\n\n\n<ul><li>In his latest video, Dave Everett <a href=\"https://cyclingtips.com/2021/03/cycling-monopoly-review-pass-go-collect-200-buy-the-roubaix-velodrome/\" target=\"_blank\" rel=\"noreferrer noopener\">unboxes</a> the cycling-themed<strong> Monopoly</strong> game Koers Course.</li><li>James Huang <a href=\"https://cyclingtips.com/2021/03/3t-exploro-racemax-review-a-one-bike-solution-with-one-big-downside/\" target=\"_blank\" rel=\"noreferrer noopener\">reviews</a> the <strong>3T Exploro RaceMax</strong>.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/pieters-and-robeet-take-wins-at-nokere-koerse-daily-news/\">Pieters and Robeet take wins at Nokere Koerse: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c4b979f47de7e1994e54630243e95c1d5066035df212353fd43b2582dc9421db","category":"Cycling"}