{"title":"Kuo: Apple Vision Pro to Sell Out Fast, Leading to Long Shipping Delays","link":"https://www.macrumors.com/2024/01/09/kuo-apple-vision-pro-may-sell-out-fast/","date":1704803849000,"content":"Apple on Monday <a href=\"https://www.macrumors.com/2024/01/08/apple-announces-february-2-vision-pro-launch/\">announced</a> it would begin accepting pre-orders for its new Vision Pro headset on January 19, with an official launch in the U.S. to follow on February 2. But if you're in the market for one, you may have to move fast, according to Apple analyst Ming-Chi Kuo.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Apple-Vision-Pro-Dual-Loop-Band-Teal-Feature.jpg\" width=\"1960\" height=\"1102\" />\r<br />\n\"Thanks to the demand from Apple's core fans and heavy users, the Vision Pro should sell out soon after it is available for pre-order or sale, resulting in a longer shipping time,\" said Kuo in his <a href=\"https://medium.com/@mingchikuo/對於vision-pro預購與發售-投資人該關注什麼-what-investors-should-look-for-in-the-vision-pro-pre-order-and-launch-6cb2fae053c8\">latest report</a> covering Apple's announcement, which the analyst <a href=\"https://medium.com/@mingchikuo/2024年消費電子產業三大關鍵投資趨勢-android庫存回補-vision-pro與ai-pc-手機-three-key-consumer-electronics-investment-42e680eb253b\">accurately predicted</a> ahead of time. \r<br />\n\r<br />\n\"However, whether the demand for Vision Pro can be sustained after the novelty wears off is even more important, depending on whether Vision Pro's product positioning and key applications are clear and correct,\" added the analyst.\r<br />\n\r<br />\nKuo noted that Apple may need to reveal more details about the headset in the run-up to pre-order or launch to help maintain sales momentum and attract developers. Currently, <a href=\"https://www.macrumors.com/2024/01/08/vision-pro-lens-inserts-to-start-at-99/\">ZEISS lens inserts</a> starting at $99 are the sole other optional purchase for the Vision Pro headset that Apple has announced.\r<br />\n\r<br />\nBeyond that, Apple has said only that the Vision Pro will be available \"starting at $3,499 with 256GB of storage,\" suggesting customers will be offered a series of configuration options at increasing price points. \r<br />\n\r<br />\nIncluded with the Vision Pro headset is a Solo Knit Band, a Dual Loop Band, a Light Seal, two Light Seal Cushions, a cover for the front of the device, a polishing cloth, battery unit, USB-C charging cable, and USB-C power adapter. Despite these details, other questions remain. \r<br />\n\r<br />\nFor example, Apple previously said the Vision Pro could be used indefinitely if the battery was itself plugged into an external power source, but that text has since been removed from the Vision Pro product page. Apple will likely offer additional battery units for purchase, but even this has not yet been officially confirmed by the company.\r<br />\n\r<br />\nApple is expected to make fewer than 400,000 units in 2024, with previous reports suggesting that Apple has been forced to make \"drastic cuts\" to its <a href=\"https://www.macrumors.com/2023/07/03/apple-vision-pro-drastic-production-cuts/\">production forecasts</a> because of difficulties with manufacturing. \r<br />\n\r<br />\nApple plans to start offering Vision Pro <a href=\"https://www.macrumors.com/2024/01/08/apple-vision-pro-demos-february-2/\">demonstrations</a> at Apple retail stores in the U.S. on the official launch date of the device, Friday, February 2.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/kuo-apple-vision-pro-may-sell-out-fast/\">Kuo: Apple Vision Pro to Sell Out Fast, Leading to Long Shipping Delays</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-vision-pro-to-sell-out-fast-leading-to-long-shipping-delays.2415852/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c4b9f0277cffcd4d3d0574ede468818fedf6441395318d72a0cdbd4e228e0b50","category":"Apple"}