{"title":"Combining Masculinizing Resistance, Rotation, and Biocontrol to Achieve Durable Suppression of the Potato Pale Cyst Nematode: A Model","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70012?af=R","date":1726729200000,"content":"<h2>ABSTRACT</h2>\n<p>The pale cyst nematode, <i>Globodera pallida</i>, is a pest that poses a significant threat to potato crops worldwide. The most effective chemical nematicides are toxic to nontarget organisms and are now banned. Alternative control methods are therefore required. Crop rotation and biological control methods have limitations for effectively managing nematodes. The use of genetically resistant cultivars is a promising alternative, but nematode populations evolve, and virulent mutants can break resistance after just a few years. Masculinizing resistances, preventing avirulent nematodes from producing females, might be more durable than blocking resistances, preventing infection. Our demo-genetic model, tracking both nematode population densities and virulence allele frequencies, shows that virulence against masculinizing resistance may not be fixed in the pest population under realistic agricultural conditions. Avirulence may persist despite the uniform use of resistance. This is because avirulent male nematodes may transmit avirulent alleles to their progeny by mating with virulent females. Additionally, because avirulent nematodes do not produce females themselves, they weaken the reproductive rate of the nematode population, leading to a reduction in its density by at least 20%. This avirulence load can even lead to the collapse of the nematode population in theory. Overall, our model showed that combining masculinizing resistance, rotation, and biocontrol may achieve durable suppression of <i>G. pallida</i> in a reasonable time frame. Our work is supported by an online interactive interface allowing users (i.e., growers, plant health authorities, researchers) to test their own control combinations.</p>","author":"Israël Tankam Chedjou, \nJosselin Montarry, \nSylvain Fournet, \nFrédéric M. Hamelin","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"c4bbdc6fdb83b648d4bd366affad6cd48a1065cfb334604aecb8e86a4f855d64","category":"Environment"}