{"title":"Audi is entering F1 in 2026—its head of technology tells us why","link":"https://arstechnica.com/?p=1944079","date":1685727316000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/A224489_large-800x600.jpg\" alt=\"An F1 car in Audi livery\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/A224489_large-scaled.jpg\">Enlarge</a> (credit: Audi)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In August of last year, we were somewhat shocked when <a href=\"https://arstechnica.com/cars/2022/08/audi-will-build-f1-engines-entering-the-sport-in-2026/\">Audi confirmed that it would enter Formula 1 in 2026</a>. Rumors had swirled for many years that Volkswagen Group was considering entering the sport with one or more of its brands, even as Audi and then Porsche racked up win after win in other categories. But those rumors never seemed to go anywhere, earning a kind of vaporware status similar to <a href=\"https://arstechnica.com/tag/duke-nukem-forever/\">the infamous <em>Duke Nukem Forever</em></a>.</p>\n<p>That game <em>did</em> eventually see the light of day, though, and so too will Audi's F1 ambitions when it takes over the Sauber team as F1 ushers in a new set of technical regulations. We recently spoke with Oliver Hoffmann, Audi's board member for technical development, who told us more about the company's F1 plans and how entering that sport should help some of its road cars.</p>\n<p>Audi will be new to F1 when it joins the sport in three years, but it's certainly not new to motorsport. In the 1980s, it made a name for itself—and its \"quattro\" all-wheel drive technology—in the World Rally Championship. More recently, <a href=\"https://arstechnica.com/cars/2016/10/audis-legendary-le-mans-program-to-end-in-2016/\">it dominated endurance racing for almost two decades</a>, winning the 24 Hours of Le Mans 13 times between 2000 and 2016, plus two World Endurance Championships and nine American Le Mans Series championships. While doing so, it proved the value of new technology that transferred to its road cars—direct injection gasoline engines, direct injection turbo diesel engines, hybrid powertrains, and laser beam headlights, to name just a few.</p></div><p><a href=\"https://arstechnica.com/?p=1944079#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944079&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c4bfa0539e7c3a5639e548fd9ed990bec87b4e4cc010cd047cd7f2b9d24337a6","category":"Tech"}