{"title":"Miron Ronde van Drenthe 2023 Preview - Route, predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/miron-ronde-van-drenthe-preview-route-predictions-and-contenders","date":1678297740000,"content":"\n      <p><span>It’s indicative of the ever-expanding nature of the Women’s WorldTour calendar that this year’s edition of the Ronde Van Drenthe constitutes the sixth round of the series – by contrast, it was the second race on the schedule last year. As the WWT is well underway, the riders in the women's peloton have had a chance to find their form and to look at one another, and with teams bringing stacked line-ups to play it promises to be a scintillating fight to the line.</span></p>\n<div></div>\n<p><span>The 2023 Ronde Van Drenthe takes place on 11</span><span>th</span><span> March. Where <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop Het Nieuwsblad</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> offer opportunities for the punchier riders and cobbled specialists, the Ronde Van Drenthe provides a contrast in that it ordinarily ends in a bunch sprint. The race still presents a variety of challenges, including a selection of cobbled sectors and repeated ascents of the VAM-berg, but the final will likely come down to a gallop for the line, and teams are sending their biggest hitters along for the ride.</span></p>\n<p><span>The past two editions have been won by Lorena Wiebes. The Dutch rider, then riding for Team DSM, won on home soil in 2022 beating Elisa Balsamo in a fixture that’s becoming renowned as an early season sprint royale, a race that is always likely to offer a big opportunity for the fast women who can handle the rigours of some cobbles and bergs along the way. </span></p>\n<h3>Route</h3>\n<p><span>Taking place in the Drenthe province in the north of the Netherlands, the women’s edition of the race dates back to 2007. This year will be the 16</span><span>th</span><span> edition of the event, which has been a WWT-sanctioned race since 2016. </span></p>\n<p><span>152.7km in length, the 2023 edition of the Ronde van Drenthe takes a new route through the province, beginning in Emmen and travelling to the same destination as last year’s race, in Hoogeveen. The route is primarily flat, although it features a number of cobbled sectors – nine in total – all spaced along the first 60km of the route. </span></p>\n<p><span>The conditions could also play a part in the outcome of the day, with cold, wet and windy weather forecast. Dependent on wind direction, teams may have to pay close attention in the event of echelons.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1384557502_1024x1024.jpg?v=1678297203\" alt /></span><em><span>The cobbles and the VAM-berg play an important part in the Ronde van Drenthe (Image: Getty/Luc Claessen)</span></em></p>\n<p><span>The primary obstacle for the riders is the VAM-berg. The manmade climb, built on top of a landfill site, is 500m in length with an average gradient of 4.2% but featuring pitches of up to 20%. The first ascent comes after 80km, and the route takes in three ascents of the berg in total which may thin out the bunch. Last year’s breakaway was caught with just one kilometre remaining, but this year’s race features one less ascent of the VAM-berg, and with over 40km remaining from the final ascent to the finish line in Hoogeveen, on relatively flat roads, there should be ample time for any straggling sprint teams to catch those who might have tried to force a split on one of the climbs. </span></p>\n<p><span>The peloton will cross the finish line in Hoogeveen with 30km still to go and complete a circuit, with an intermediate sprint in Zuidwolde adding some interest with just 12km remaining. The run-in to the line is completely flat and will allow sprint teams to assemble their trains ready for the almost inevitable outcome – a bunch sprint.</span></p>\n<h3>\n<b></b><span>Contenders</span>\n</h3>\n<p><span>The Ronde van Drenthe offers arguably the first opportunity on European soil of the year for the pure sprinters of the women’s peloton to go head-to-head. In perhaps the most highly anticipated rivalry of the season,<strong> Charlotte Kool</strong> of Team DSM overcame the challenge of her former teammate <strong>Lorena Wiebes</strong> twice in the UAE Tour, and the pair will reprise their head-to-head in the Netherlands. Kool can rely on a strong and assured lead-out train, with Team DSM teammate Pfeiffer Georgi delivering Kool to both her wins so far this season. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1464738865_1024x1024.jpg?v=1678297330\" alt /></span><em><span>Charlotte Kool and Lorena Wiebes go head-to-head at the UAE Tour (Image: Getty/Tim de Waele)</span></em></p>\n<p><span>Team SD Worx have had an incredible start to their classics campaign, opening their account with wins at both Omloop Het Nieuwsblad and Strade Bianche, and will be keen to continue their dominance in Drenthe. Last year, <strong>Lotte Kopecky</strong> rode against Lorena Wiebes for the win, so to have both in the same side this year is a formidable prospect for the rest. Either could win, and having <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-shocking-sprint-one-wild-horse-and-trouble-at-team-sd-worx-what-was-going-on-at-strade-bianche-donne\">engineered a stunning 1-2 at Strade Bianche</a>, there’s every chance it could play out that way again on Saturday. </span></p>\n<p><span>A rider who may have a few words to say about a Kool v Wiebes head-to-head is former World Champion <strong>Elisa Balsamo</strong>. The Italian, riding for Trek-Segafredo, just missed out to Wiebes in last year’s edition and will be hoping to improve on second this year and spoil the Dutch party.<strong> Marta Bastianelli</strong> of UAE Team ADQ is another in-form rider who fares well on cobbles – the Italian veteran won Le Samyn Des Dames last week so clearly has good legs ahead of this Saturday’s race.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1470233428_1024x1024.jpg?v=1678297453\" alt /></span><em><span>Marta Bastianelli wins Le Samyn Des Dames (Image: Getty/David Stockman)</span></em></p>\n<p><span>There are plenty of outsiders who pose a threat, in addition to the headline acts. Other contenders to watch include <strong>Lotta Hentala</strong> for AG Insurance-Soudal. One of the peloton’s newest WWT-ratified teams, Natascha den Ouden’s side have had a strong start to the season and Hentala’s return to the peloton has seen her narrowly miss out twice to Elisa Balsamo at Setmana Ciclista, so expect her to mount a significant challenge to the likes of Wiebes and Kool.<strong> Marjolein van 't Geloof</strong> of Human Powered Health came 6</span><span>th</span><span> at Le Samyn Des Dames and has a strong sprint, young Belgian <strong>Shari Bossuyt</strong> of Canyon//SRAM is handy on the cobbles, and Italians <strong>Letizia Paternoster</strong> (Team Jayco Alula) and <strong>Rachele Barbieri</strong> (Liv Racing TeqFind) could pose challenges if they find their form at the right time.</span></p>\n<h3>Prediction</h3>\n<p><span>Despite a dazzling array of fierce competition, we’re backing Charlotte Kool to take her fourth WWT win of the season at Ronde van Drenthe. With a committed and well-drilled lead-out train who are comfortable on the cobbles, and her confidence high having already proven she can beat Lorena Wiebes, we think it will be the rider from Team DSM who will raise her arms in Hoogeveen. </span></p>\n<p><em><span>Cover image: Getty</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c4c1bff8c05a10ba363ee5eaea3b1fae8b1af27d5b994e27672a739fba3ffd1c","category":"Cycling"}