{"title":"PSIV-11 The inhibitory activity of phyto-phenolic compounds on ammonia-producing ruminal bacteria","link":"https://academic.oup.com/jas/article/102/Supplement_3/545/7757591?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Antibiotic resistance has progressively increased over time, thus necessitating the discovery of sustainable, novel antimicrobials. Ammonia producing bacteria (APB) are predominant organisms occupying many niches in the rumens of cattle and soil. The objective of this study was to discover target phyto-phenolic compounds (PPCs) that can act as replacements for existing antimicrobials, as well as at what concentration ranges may be optimal for inhibition of APB growth. In recognition of this discovery, producers may have alternative antimicrobial compounds for use in managing APB and common silage spoilage organisms. To shed light on this matter, inhibitory concentrations (IC) and ammonia assays were implemented. ICs analyzed the inhibitory action of six structurally similar PPCs: thymol, eugenol, carvacrol, hydro-cinnamic acid (H-CA), trans-cinnamic acid (T-CA), and phloroglucinol. Five APB (SR, MD1, F, BG1, and B14) were exposed to five concentrations of phytochemicals via a 10% v/v serial dilution: 10, 1, 0.1, 0.01, 0.001 mM. Following serial dilution, the bacteria were incubated ~24h at 39°C in a water bath, and visually inspected for growth. Ammonia assays utilized the least, fully inhibitory concentration of each phytochemical identified via the inhibitory concentration experiments. Ammonia concentrations were determined using the phenolic acid/hypochlorite method. All protocols utilized anaerobic sterile technique. All experiments were repeated in triplicate and significant results (<span>P</span> &lt; 0.05) were determined using a one-way ANOVA with Tukey’s post hoc test utilizing OriginPro statistical software. Inhibition results revealed that eugenol, thymol, and carvacrol were successful in inhibiting bacterial growth at a concentration range of 10 mM to 1 mM. However, phloroglucinol was not fully inhibitory at any concentration tested against any bacteria. Eugenol, thymol, carvacrol were fully inhibitory at either 10 mM or 1 mM for all organisms tested except BG1, where it was only inhibitory at 10 mM. Ammonia analyses determined that eugenol and carvacrol greatly reduced ammonia production for all species tested except for B14, a generalist, which had no measurable changes in ammonia for any of the treatments including control. Thymol reduced ammonia production for MD1, BG1, and SR. Additionally, H-CA and T-CA decreased ammonia production of SR compared with control but not as much as eugenol or carvacrol. Results suggested that the growth of APB was generally inhibited by the greatest concentrations of PPCs (10 mM to 1 mM) tested here. Additionally, phloroglucinol did not inhibit bacterial growth therefore it was not included in the ammonia analyses. Eugenol and carvacrol significantly reduced ammonia production in all organisms, therefore indicating possible antimicrobial candidates to be further investigated. In comparison with carvacrol and eugenol, T-CA and H-CA made a modest to negligible reduction in ammonia. Phyto-phenolic compounds that were successful in inhibiting bacterial growth and reducing ammonia production demonstrate several promising target antimicrobials.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c4c6618b9aafbba14a769c688c2e72aca45a0436c2c7b4212dc869cf3fb7ea65","category":"Environment"}