{"title":"Comparative study of pure and mixed phase sulfurized‐carbon black in battery cathodes for lithium sulfur batteries","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400034?af=R","date":1721724857000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/251242a6-2781-47e3-8090-768d445a7b32/appl202400034-gra-0001-m.png\" alt=\"Comparative study of pure and mixed phase sulfurized-carbon black in battery cathodes for lithium sulfur batteries\" /><p>The detailed electrochemical characteristics and comparison of sulfurized carbon black and sulfurized baked carbon black corresponding to α-sulfur and mixed-sulfur phases, cathodes for Li-S battery are demonstrated.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Lithium-sulfur battery (LSB) chemistry is regarded as one of the most promising contenders for powering next-generation electronics, including electric vehicles. This is due to its high theoretical capacity, the use of inexpensive and environmentally friendly materials, and its alignment with climate-smart manufacturing principles. Sulfur, the electroactive element in LSBs, undergoes lithiation to form a series of polysulfides, each contributing to the battery's energy density. However, this chemistry encounters several challenges, particularly concerning the stability of sulfur. Recent studies have shown that the presence of a full gamma phase of sulfur in an LSB cathode significantly enhances the capacity and overall cell performance. However, despite the advantages of cathodes with gamma sulfur, the characteristics of LSBs with mixed crystal phases of sulfur (alpha, beta, and gamma) have not been extensively studied. In this context, we developed a simple and cost-effective synthesis method to produce both single-phase (alpha) and mixed-phase sulfur (primarily a mixture of alpha and gamma, with a trace of beta) and conducted their detailed physical and electrochemical characterization for use as electroactive cathode materials in LSBs. The cells fabricated using sulfur-carbon black as the cathode delivered a specific capacity of approximately 640 mAh/g at a current density of 275 mA/g, demonstrating excellent cyclic stability over 50 cycles with a capacity retention of around 97%. This performance is superior to that of the sulfur-baked carbon black composite cathode, which achieved 440 mAh/g at the same current density.</p>","author":"Surjit Sahoo, \nDebayan Chatterjee, \nSubhasish Basu Majumder, \nKh M Asif Raihan, \nBrice LaCroix, \nSuprem R. Das","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"c4c849a55f902e5434aad017bb7c8085fc71d81aa492fac63feda149f3bc5351","category":"Environment"}