{"title":"Shedding light on the increased carbon uptake by a boreal forest under diffuse solar radiation across multiple scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17275?af=R","date":1713250800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8b8b0c92-dedc-46e8-9505-04df2999e5d6/gcb17275-toc-0001-m.png\" alt=\"Shedding light on the increased carbon uptake by a boreal forest under diffuse solar radiation across multiple scales\" />\n<p>As the climate changes, we expect to see regional and global increases in cloud cover and variations in aerosols; thus, the amount of time plant canopies spend under diffuse radiation rather than direct sunlight is expected to increase. Our analysis of long-term monitoring data over 10 years found a consistent pattern of increasing ecosystem carbon assimilation, which scaled with shoot &amp; forest floor photosynthesis, associated with increasing diffuse radiation. This implies that ongoing atmospheric changes causing variations in solar radiation reaching the ground have the potential to significantly affect carbon fixation by forest ecosystems.</p>\n<br />\n<h2>Abstract</h2>\n<p>Solar radiation is scattered by cloud cover, aerosols and other particles in the atmosphere, all of which are affected by global changes. Furthermore, the diffuse fraction of solar radiation is increased by more frequent forest fires and likewise would be if climate interventions such as stratospheric aerosol injection were adopted. Forest ecosystem studies predict that an increase in diffuse radiation would result in higher productivity, but ecophysiological data are required to identify the processes responsible within the forest canopy. In our study, the response of a boreal forest to direct, diffuse and heterogeneous solar radiation conditions was examined during the daytime in the growing season to determine how carbon uptake is affected by radiation conditions at different scales. A 10-year data set of ecosystem, shoot and forest floor vegetation carbon and water-flux data was examined. Ecosystem-level carbon assimilation was higher under diffuse radiation conditions in comparison with direct radiation conditions at equivalent total photosynthetically active radiation (PAR). This was driven by both an increase in shoot and forest floor vegetation photosynthetic rate. Most notably, ecosystem-scale productivity was strongly related to the absolute amount of diffuse PAR, since it integrates both changes in total PAR and diffuse fraction. This finding provides a gateway to explore the processes by which absolute diffuse PAR enhances productivity, and the long-term persistence of this effect under scenarios of higher global diffuse radiation.</p>","author":"Santa Neimane‐Šroma, \nMaxime Durand, \nAnna Lintunen, \nJuho Aalto, \nT. Matthew Robson","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"c4d45c1c596a42ee07bf60a60ba448ce50909d001cd6659239bc27f923db43a9","category":"Environment"}