{"title":"287 The effect of cooling pad and Moringa oleifera on lactating sows under heat stress","link":"https://academic.oup.com/jas/article/102/Supplement_2/228/7664745?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Lactating sows and their litters are particularly vulnerable to heat stress (HS). HS decreases sow fertility, feed intake, milk production, and litter growth. Approaches are needed to mitigate the negative effects of HS on animal welfare and reduce oxidative damage to tissues associated with HS. Recently, electronic cooling pad (ECP) were designed to remove heat through conductive cooling. The objective of this study was to test the efficacy of ECP and feeding an antioxidant, <span>Moringa oleifera</span> (4% of the diet, M), to sows from late gestation to weaning on their welfare and production performance. A study was conducted using a 2 by 2 factorial arrangements of treatments with mixed parity Yorkshire x Landrace sows (n = 48) mated to Duroc sires. The sows were exposed to moderate HS conditions from gestation d 100 to d 21 of lactation (weaning). To achieve moderate HS analogous to a summer day, farrowing room temperature was increased incrementally from 800 to 1100 h to 32º C and slowly decreased to 26 ºC from 1700 to 2000 h. Sows were limit-fed their specific diets during gestation (1.36 kg 2X/d) and fed for ad-libitum feed intake post farrowing. Treatments included HS+control corn-soy meal diet (CS), HS+M, ECP+CS, ECP+M (n = 12/treatment). Sow RR and RT were measured four times daily (0600, 1300, 1600, 1900 h) and sow feed intake during lactation was measured along with body weight (BW) change from farrowing to weaning. Birth litter size was determined, and growth of standardized litters (n = 13 piglets/sow) was measured. Milk was collected during active farrowing (d 0) and on d 3 and d 14 post-farrowing and analyzed for macronutrient content. The use of ECP decreased lactating sow RR (Lsmeans HS = 66.5 bpm, ECP = 28.2 bpm, <span>P</span> ≤ 0.0001), RT (Lsmeans HS = 39.2 ºC, ECP = 38.8 ºC, <span>P</span> = 0.003), and lactation BW loss (Lsmeans HS = -21.67, ECP = -5.1 kg <span>P</span> = 0.002). ECP by time-of-day interactions (<span>P</span> &lt; 0.01) existed for RR and RT with ECP having a greater impact from 1300 to 1900 h than at 0600 h. ECP increased lactation feed intake (<span>P</span> &lt; 0.02). An ECP by diet interaction (<span>P</span> = 0.0004) indicated ECP increased lactation feed intake for the sows fed the CS diet (6.48 kg/d vs 4.42 kg/d, <span>P</span> = 0.0004) but did not affect feed intake of sows fed the M diet. Treatment did not affect litter weaning weight (<span>P</span> = 0.14). M increased percent fat in milk (Lsmeans M = 12.28, CS = 11.06, <span>P</span> = 0.05) across all days of lactation. The reduction in sow RR and RT combined with increased feed intake and decreased loss of BW during lactation indicate that ECP improved sow wellbeing in the HS environment. Neither cooling nor M affected litter growth, despite increased fat content of milk of M supplemented sows and increased feed intake of ECP-CS sows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c4da19c60e2d4146791370282e6a27e99b1c7f533e3a7437dbe17bffeb13de52","category":"Environment"}