{"title":"Differential Responses of Soil Microbial and Carbon‐Nitrogen Processes to Future Environmental Changes Across Soil Depths and Environmental Factors","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004085?af=R","date":1718456035000,"content":"<h2>Abstract</h2>\n<p>Accurately predicting carbon-climate feedbacks relies on understanding the environmental factors regulating soil organic carbon (SOC) storage and dynamics. Here, we employed a microbial ecological model (MEND), driven by downscaled output data from six Earth system models under two Shared Socio-economic Pathways (SSP1-2.6 and SSP5-8.5) scenarios, to simulate long-term soil biogeochemical processes. We aim to analyze the responses of soil microbial and carbon-nitrogen (C-N) processes to changes in environmental factors, including litter input (L), soil moisture (W) and temperature (T), and soil pH, in a broadleaf forest (BF) and a pine forest (PF). For the entire soil layer in both forests, we found that, compared to the baseline period of 2009–2020, the mean SOC during 2081–2100 increased by 40.9%–90.6% under the L or T change scenarios, versus 5.2%–31.0% under the W change scenario. However, soil moisture emerged as a key regulator of SOC, MBC and inorganic N dynamics in the topsoil of BF and PF. For example, W change led to SOC gain of 5.5%–37.2%, compared to the SOC loss of 15.5%–18.0% under L or T scenario. Additionally, a further reduction in soil pH by 0.2 units in the BF, representing the acid rain effect, significantly resulted in an additional SOC gain by 14.2%–21.3%, compared to the LTW (simultaneous changes in the three factors) scenario. These results indicate that the results derived solely from topsoil may not be extrapolated to the entire soil profile. Overall, this study significantly advances our comprehension of how different environmental factors impact the dynamics of SOC and the implications they have for climate change.</p>","author":"Kefeng Wang, \nGangsheng Wang, \nRuosong Qu, \nWenjuan Huang, \nGuoyi Zhou, \nMing Yue, \nChanghui Peng","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"c4e795cdf53cfa1782a86e511dc0e19c815aa1ea26623f76bea0227ff5f7f827","category":"Environment"}