{"title":"SAP เปิดตัว AppGuyver เครื่องมือพัฒนาแอพแบบ No-Code ไม่ต้องเขียนโค้ด ต่อ SAP API ได้","link":"https://www.blognone.com/node/125916","date":1637313565000,"content":"<div><div><div><p>ตลาดการพัฒนาแอพแบบไม่ต้องเขียนโค้ด (no-code) หรือเขียนโค้ดน้อย (low-code) เป็นตลาดที่กำลังมาแรงในช่วงปีหลังๆ โดยบริษัทยักษ์ใหญ่อีกรายที่เข้ามาร่วมในตลาดนี้คือ SAP</p>\n<p>สัปดาห์นี้ SAP เปิดตัว SAP AppGyver เครื่องมือพัฒนาแบบ no-code อย่างเป็นทางการ (เข้าสถานะ general available) โดยมาจากการซื้อกิจการบริษัท AppGyver เมื่อต้นปีนี้ และผนวกรวมเครื่องมือตัวนี้เข้ามาอยู่บนแพลตฟอร์ม SAP Business Technology Platform (SAP BTP) ซึ่งเป็นชื่อเรียกรวมๆ ของซอฟต์แวร์ SAP เกือบทุกตัวเรียบร้อยแล้ว เชื่อมต่อกับ API ของ SAP ได้เลย</p>\n<p>AppGyver เป็นเครื่องมือการสร้างแอพแบบลากแล้ววาง ใช้ได้ผ่านหน้าเว็บ <a href=\"https://appgyver.com/\">appgyver.com</a> เปิดให้ใช้งานฟรีทั้งหมด (ก่อนหน้านี้มีเวอร์ชัน Pro แบบเสียเงิน แต่เปิดฟรีหมดหลังขายให้ SAP) เมื่อสร้างแอพในระบบ AppGyver แล้วสามารถแปลงเป็นแอพมือถือ เว็บแอพ หรือแม้กระทั่งรันบนสมาร์ททีวีได้ ปัจจุบัน AppGyver มีผู้ใช้งานประมาณ 1 แสนราย ตัวอย่างองค์กรใหญ่ๆ ที่นำไปใช้งานแล้วคือ DHL</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b4e104b70ff83bf5042a463b5ca3c532.png\" /></p>\n<p>นอกจาก AppGyver ที่เป็นเครื่องมือระดับ no-code แล้ว SAP ยังมีเครื่องมือสร้างแอพระดับ low-code คือ <a href=\"https://www.blognone.com/node/113194\">SAP Business Application Studio ที่ออกมาได้สักระยะหนึ่งแล้ว</a> (มาแทน SAP Web IDE ตัวเดิม) โดยใช้เอนจินของ Eclipse Theta ที่ใช้ VS Code เป็นฐานอีกที</p>\n<p>ที่มา - <a href=\"https://www.sap.com/about/events/teched-news-guide/low-code-no-code-pro-code.html\">SAP</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sap\">SAP</a></div><div><a href=\"/topics/development\">Development</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div><div><a href=\"/topics/no-code\">No-Code</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c4eeaed91ad9c00097d6bd37d7cd8ebdea7b7b3738e77bee9fd0885e7d8248b3","category":"Thai"}