{"title":"Predicting Surface Roughness and Grinding Forces in UNS S34700 Steel Grinding: A Machine Learning and Genetic Algorithm Approach to Coolant Effects","link":"https://www.preprints.org/manuscript/202410.0205/v1","date":1727875034000,"content":"In the realm of digitalization, data play a crucial role across various scientific fields, from physics to engineering. Analyzing data with advanced technologies like artificial intelligence enhances en-gineers' ability to make informed judgments on product quality. This study aligns with the digital-ization trend by implementing formula generation, generalization, and optimization using genetic algorithms and three machine learning approaches: support vector regression, Gaussian process regression, and artificial neural networks, on a grinding process dataset from a previous study on UNS S34700 steel. The study introduces new approaches by considering three different grinding wheels and four cooling and lubrication solutions as influential process parameters, previously considered qualitative and fixed in earlier literature. Additionally, seven different depths of cut were implemented to measure surface roughness and grinding forces (tangential and normal). Qualitative data were encoded into quantitative data using standard techniques. By enhancing genetic algorithm optimization, a relational formula with 25 coefficients was developed to describe the relationship between input parameters and outputs. Three machine learning algorithms were evaluated for predicting the relationship between predictors and responses. The flexibility and scalability of these methods, combined with the relational formula, provide a sophisticated ap-proach for future expansions. The formula evaluation achieved around 85% accuracy for surface roughness and 90% for grinding forces. In machine learning approaches, the GPR method reached model stability with an R² of around 0.98 and a mean accuracy of 93%, while the ANN reached an R² of around 0.96 and a mean accuracy of 90%. This shows that machine learning approaches are more suitable than formula generalization. The scalability and flexibility of machine learning help generalize with more data variety, while the formula evaluation only accepted current data sets. Furthermore, ML methods achieve high accuracy and are suitable for predicting future data, aligning with digitalization and trend prediction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c50238ca6165cb68eb45f364d8d3d929523dd12a349d12dc56b587010048fa3d","category":"Interdisciplinary"}