{"title":"Back to the Village: Assessing the Effects of Naturalness, Landscape Types, and Landscape Elements on the Restorative Potential of Rural Landscapes","link":"https://www.preprints.org/manuscript/202405.1586/v1","date":1716530903000,"content":"Rural landscapes are acknowledged for their potential to restore human health due to their natural characteristics. However, few studies have systematically analysed the impact of naturalness, landscape types, and combinations of landscape elements on restorativeness using both subjective and objective measurements. This study investigated the restorative effects of various rural landscapes in Guangzhou, employing electroencephalography and eye-tracking technologies to record physiological responses and using the Restorative Components Scale and the Perceived Restorativeness and Naturalness Scale to evaluate psychological responses. The results indicated the following: (1) There was a significant positive correlation between perceived naturalness and restorativeness, surpassing the impact of actual naturalness. (2) Different landscape types had a varying impact on mental health at the equal perceived naturalness. Natural forest landscapes and artificial forest landscapes exhibited the most substantial restorative effects among the natural and semi-natural landscapes examined, respectively, while settlement landscapes showed the highest restorative potential among the artificial landscapes. (3) Restorative properties varied across landscape elements, with identical elements yielding different benefits in different environments. Trees and water significantly enhanced restorativeness, whereas constructed elements such as roads and infrastructure reduced it. This study provides a scientific basis for restorative rural landscape design to enhance mental health and well-being.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c50d07911e47c9ecdc65a3e4880e9c2842c80f6ab0bf75cff03f847a3005b7b5","category":"Interdisciplinary"}