{"title":"Network pharmacology and experimental verification to decode the action of Qing Fei Hua Xian Decotion against pulmonary fibrosis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305903","date":1719237600000,"content":"<p>by Hao-Liang Ke, Rui-Jie Li, Chao-Chao Yu, Xiu-Ping Wang, Chao-Yan Wu, Ying-Wen Zhang</p>\r\nBackground <p>Pulmonary fibrosis (PF) is a common interstitial pneumonia disease, also occurred in post-COVID-19 survivors. The mechanism underlying the anti-PF effect of Qing Fei Hua Xian Decotion (QFHXD), a traditional Chinese medicine formula applied for treating PF in COVID-19 survivors, is unclear. This study aimed to uncover the mechanisms related to the anti-PF effect of QFHXD through analysis of network pharmacology and experimental verification.</p> Methods <p>The candidate chemical compounds of QFHXD and its putative targets for treating PF were achieved from public databases, thereby we established the corresponding “herb-compound-target” network of QFHXD. The protein–protein interaction network of potential targets was also constructed to screen the core targets. Furthermore, Gene ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analysis were used to predict targets, and pathways, then validated by in vivo experiments.</p> Results <p>A total of 188 active compounds in QFHXD and 50 target genes were identified from databases. The key therapeutic targets of QFHXD, such as PI3K/Akt, IL-6, TNF, IL-1β, STAT3, MMP-9, and TGF-β1 were identified by KEGG and GO analysis. Anti-PF effects of QFHXD (in a dose-dependent manner) and prednisone were confirmed by HE, Masson staining, and Sirius red staining as well as in vivo Micro-CT and immunohistochemical analysis in a rat model of bleomycin-induced PF. Besides, QFXHD remarkably inhibits the activity of PI3K/Akt/NF-κB and TGF-β1/Smad2/3.</p> Conclusions <p>QFXHD significantly attenuated bleomycin-induced PF via inhibiting inflammation and epithelial-mesenchymal transition. PI3K/Akt/NF-κB and TGF-β1/Smad2/3 pathways might be the potential therapeutic effects of QFHXD for treating PF.</p>","author":"Hao-Liang Ke","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c51737b2dc67f0c8f8b324e61317842e3f8ce9608a0e1b8d592c664ee340aced","category":"Interdisciplinary"}