{"title":"Google lays off “hundreds” more as ad division switches to AI-powered sales","link":"https://arstechnica.com/?p=1996432","date":1705442946000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/google-logo-800x533.jpg\" alt=\"A large Google logo at a trade fair.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/google-logo.jpg\">Enlarge</a> (credit: Getty Images | Alexander Koerner)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In December, we <a href=\"https://arstechnica.com/gadgets/2023/12/report-google-ads-restructure-could-replace-some-sales-jobs-with-ai/\">heard that job cuts</a> might be coming for Google's ad sales division, and it's here. <a href=\"https://www.businessinsider.com/google-is-laying-off-hundreds-of-employees-in-its-advertising-team-2024-1\">Business Insider</a> reports Google is laying off \"hundreds of employees\" from the ad sales team. The cuts are mostly in the \"Large Customer Sales\" (LCS) team, which serves the company's biggest advertising clients.</p>\n<p>We expected this. <a href=\"https://www.theinformation.com/articles/google-plans-ad-sales-restructuring-as-automation-booms\">The Information</a> detailed that layoffs would come to Google's Ad division this month. That report said that many of those are being laid off or reassigned because AI is replacing them<em>. </em>Google has been packing Google Ads—its most important product—with tons of generative AI features lately. One is a natural-language chatbot that helps people navigate the large selection of ad products; another is a system that can just <em>make</em> ad assets like images and text on its own based on a budget and goals given by the ad purchaser. Google's generative AI ad system is part of a product called \"Performance Max\" which works by autonomously remixing and tweaking your ads using the click-through rate as an instant feedback system. Google used to have humans do sales guidance for its products, create art assets, and decide on text and layouts, but now AI can do it a thousand times a second.</p>\n<p>For Google, this is the latest in an increasing number of layoffs since last year. <a href=\"https://arstechnica.com/gadgets/2024/01/google-lays-off-hundreds-more-employees-strips-google-assistant-features/\">Last week</a>, there were \"hundreds\" laid off from the hardware, Google Assistant, and AR divisions. Before that, there were layoffs in Google News, and before that, layoffs came to recruiting, Waze, Waymo, a robot division, and generally all across Google.</p></div><p><a href=\"https://arstechnica.com/?p=1996432#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1996432&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c5235f69a888a13277529ed2de9e3a87b55eb9a35fbb371b8121180ef5a4fac2","category":"Tech"}