{"title":"Gino Mäder saves the trees","link":"https://cyclingtips.com/2021/08/gino-mader-saves-the-trees/","date":1629154869000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/gino-mader-saves-the-trees-1-of-1-2-650x433.jpg\" /></div><h2>Gino Mäder saves the trees</h2><p>\n</p><p>At the end of the world, with the existential dread of climate change upon us, with news every few months that brings despair and debate alike, to talk about the sport of professional cycling seems so irrelevant, so small, and so niche, and yet, like every human activity that consumes and burns carbon cycling plays a part in the warming of the world. Finally, however, cycling’s starting to actually <em>do </em>its part too, if just in small ways.  </p>\n\n\n\n<p>At the beginning of the year, the UCI changed the long-standing rules around littering within the peloton, creating designated zones for waste disposal, enforced by fine, to deter riders from throwing their bottles and trash all over the course’s lovely landscapes. Coupled with, for example, the omission of plastic water bottles at the Vuelta this year, these are just a few of the environmental strides cycling has made, marking what is perhaps a turn towards a more sustainable version of the sport. While a step in the right direction, these small measures are only a tiny chip in what’s a pretty carbon-heavy enterprise, with each team requiring an entire fleet of vehicles, riders requiring flights all around the world to races and training camps, not to mention the carbon footprints of the helicopters, officials, and, yes, even us journalists, just to name a few elements.</p>\n\n\n\n<p>Perhaps spurred by the climate reports recently released by the UN, which paint the grim picture of a “code red for humanity,” the peloton itself has started to speak out, beginning with Gino Mäder, of Bahrain Victorious, who, taking advantage of the spectacle of the Vuelta, has decided to do his part. </p>\n\n\n\n<p>A stage winner in the Giro d’Italia and Tour de Suisse this year, Mäder posted on Twitter yesterday:</p>\n\n\n\n<figure><div>\n<blockquote><p><a href=\"https://twitter.com/lavuelta?ref_src=twsrc%5Etfw\">@lavuelta</a><br /><br />Each rider I beat on every stage equals 1 euro that I‘ll spend to an environmental organisation.<br /><br />To decide where the money should go, write in the comments where it‘s best invested! The comment with the most likes at the end of the three weeks get‘s chosen.</p>— Gino Mäder (@maedergino) <a href=\"https://twitter.com/maedergino/status/1426849658169663488?ref_src=twsrc%5Etfw\">August 15, 2021</a></blockquote>\n</div></figure>\n\n\n\n<p>The young Swiss talent is the latest in a number of riders who have raised their voices about social issues, a movement that can be credited with Tao Geoghegan Hart, who, after his victory in the Giro d’Italia used his platform to speak about racism and issues of diversity in the sport, a campaign he, like Mäder, put his own money for. (Geoghegan Hart <a href=\"https://cyclingtips.com/2021/08/meet-red-walters-the-geoghegan-hart-funded-stagiaire-at-axeon/\">sponsored cyclist Red Walters as a stagiaire at Hagens Berman Axeon</a>, the development team led by Axel Merckx.) Hart’s outspokenness on matters of equality was recently joined by Groupama FDJ’s Jacopo Guarnieri, who said to <em>Cycling Weekly, </em>“The first openly gay rider will have my support.” </p>\n\n\n\n<p>As for why Mäder, 24, chose environmental activism as his pet issue, he told told a select number of journalists including <em>CyclingTips </em>at the start this morning: “Well it’s a really recent [problem]. And I think it’s about time. We also spread awareness in the peloton, in the cycling community, because we couldn’t do our sport without a healthy environment. We couldn’t do what we love without also protecting the planet and it’s about time that we each individually, we just try to our best. Obviously we are not perfect.” He laughed, in good spirits, adding, “And I don’t think I’ll be perfect anytime soon, but I try to do my best. Uh, and now it’s now it’s money. That’s gonna help hopefully. And, also my time — it’s also me personally, my time that I can invest.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/gino-mader-saves-the-trees-1-of-1-1340x893.jpg\" /><figcaption>Gino Mader wins stage 6 of the Giro d’Italia. (Photo by Stuart Franklin/Getty Images)</figcaption></figure>\n\n\n\n<p>At the start of the stage, Mäder had already racked 282 euros (now 450) towards the cause, a number that will likely go up even more as he spends time at the front for his teammate Mikel Landa, for whom he will be an important climbing domestique. “But,” Mäder added mischievously, “I’ve got some ideas how to make it more.” For example, if he wins a stage, Mäder plans to double his daily donation, and he still has some “extra rules to my contribution” that he’ll share later. It’s a bit of a game to him, really, a little bit of extra motivation for the long days ahead. When asked how he even came up with such an idea, Mäder admitted that he’d been thinking about it for a while, and he implicitly chastised his colleagues for not doing something earlier: “Well, the time would have been maybe like 10 years ago, but I wasn’t in the role. I really wanted to do something this year. I was thinking whether it’s going to be like the amount of kilometers I do in the race, the amount of training kilometers whatsoever, and this kind of gets the competitive aspect as well.” </p>\n\n\n\n<p>So far, hundreds of people have suggested charities in the comments of Mäder’s post, featuring environmental causes from all over the world ranging from land conservation to ocean cleanup to political campaigns against those in power whose environmental policies are lackluster at best and despotic at worse. (Currently the entries with the most likes include Justdiggit, an organization devoted to rewilding Africa, and the French conservation society, Foundation Yves Rocher.) For Mäder, each comment is a way for him to spread awareness while also proving to be an educational opportunity: “The more charities I have in the comments,” he said, “the more I also learn about them, which is a win-win in the end.” </p>\n\n\n\n<p>Will the lanky climbing specialist (who currently sits eleventh on GC in the Vuelta, just ahead of his team leader Mikel Landa) be able to save the world? Debatable, and considering he rides for a team sponsored by Bahrain, a notorious petrostate, honestly, it’s the least he can do. However, one thing is clear: the more riders who speak out on social issues the better, for it breaks the long-held omerta of “no politics in sports”, one that has gripped the still conservative world of cycling for almost its entirety. When more and more cyclists use their status for good, in small ways and in big, that’s a win for the rest of the peloton and its future, which is made better, not worse, by its intersection with the political – and warming – world in which it is embedded.  </p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/gino-mader-saves-the-trees/\">Read More</a>","author":"Kate Wagner","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c5240d1139314a10611159470a2b5f8790eb0ff4feef48aa3cb1c2d3b5263892","category":"Cycling"}