{"title":"Dietary of different forms of Humulus scandens on growth performance and intestinal bacterial communities in piglets","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txad139/7492757?rss=1","date":1703289600000,"content":"<span><div>Abstract</div>The present study was aimed at elucidating the effects of feeding different forms of <span>Humulus scandens</span> (Hu) on performance and bacterial communities in piglets. A total of 160 piglets were divided into four groups: (1) a control (CG, basal diet); (2) a basal diet with Hu pulp (HS), basal diet + Hu pulp; (3) a basal diet with Hu juice (HSJ), basal diet + Hu juice; and (4) a basal diet with Hu residue (HSR), basal diet + Hu residue. Results showed that HS, HSJ, and HSR supplementation led to rich average daily gain (<strong>ADG</strong>) and poor feed conversion ratio (<strong>FCR</strong>) during 28 to 70 d of age, increased 120 d body weight (<strong>BW</strong>), average daily feed intake (<strong>ADFI</strong>) and ADG and decreased FCR during 71 to 120 d of age. Three experiment groups presented greater (<span>P</span> &lt; 0.05) IgA, IgG, and IgM and lower (<span>P</span> &lt; 0.05) glucose, and blood urea nitrogen. The content of diamine oxidase significantly decreased (<span>P</span> &lt; 0.05) in HS group. The crude  protein and crude fiber digestibility were improved (<span>P</span> &lt; 0.05) in HS group and the Ca digestibility was increased (<span>P</span> &lt; 0.05) in HS and HSJ groups. HSR supplementation improved the abundance of <span>Firmicutes</span> and decreased the abundance of <span>Bacteroidetes</span>. Hu supplementation with different forms increased the proportion of <span>Lactobacillus</span> in cecum content. These results indicated that supplemental feeding of Hu with different forms improved serum immunity, nutrient digestibility, and bacterial communities in piglets, promoting growth and development, which may be regarded as a reference for developing novel feed resources for piglets.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"c529740f228baace75321b283c264773b8ca5292dec85abe280dc5e865857af4","category":"Environment"}