{"title":"Different selection regimes explain morphological evolution in fossorial lizards","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14557?af=R","date":1715144986000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/52b7fac0-5232-4fee-b593-4c9ff9133858/fec14557-toc-0001-m.png\" alt=\"Different selection regimes explain morphological evolution in fossorial lizards\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/19/head-and-body-shape-differ-according-to-the-soil-type-the-lizards-dig-in/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIndependent origins of similar phenotypes are ubiquitous to the evolutionary process and evoke strong and recurrent environmental associations. Snakelike lizards evolved multiple times and are often portrayed as limb-reduced and body-elongated outcomes from shared selection associated with fossoriality.\n\nHowever, a refined evaluation including specific head traits and subtle differences in subterranean microhabitats unveils some degree of uniqueness even among lineages traditionally interpreted as phenotypically similar. Here, we address regimes of selection in fossorial lizards accounting for differences in the burrowing substrate and emphasizing head shape in addition to body and limbs.\n\nWe assembled an ecomorphological database comprising 213 species from all major lizard clades, and then characterized contemporary morphological diversity and modelled phenotypic evolution to test the hypothesis that fossoriality encompasses at least two distinct selection regimes.\n\nWe identified two ecomorphological groups within the fossorial lizards: moist-soil fossorial and dry-soil fossorial. Both groups evolved towards distinct adaptive optima concerning head shape and limb size. Despite some degree of uniqueness, these groups also share similar patterns in specific traits. Dry-soil fossorial lizards present less morphological variation than moist-soil fossorial, possibly due to the combination of distinct sets of selective pressures with shared ancestry.\n\nOur study provides evidence that an often-interpreted general adaptive regime (e.g. fossoriality) may in fact comprise enough ecological and functional diversity to elicit several distinct ecomorphological associations despite overall convergence among phenotypic traits.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/19/head-and-body-shape-differ-according-to-the-soil-type-the-lizards-dig-in/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Vinicius Anelli, \nMelissa Bars‐Closel, \nAnthony Herrel, \nTiana Kohlsdorf","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"c545eaf270430cbdb2ecbe3ad21ecd9384c49619242e826f69384204831dd349","category":"Environment"}