{"title":"Exploring the perceptions of faculty members about research courses in undergraduate pharmacy curriculum: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305946","date":1719324000000,"content":"<p>by Aaliah Aly, Ola Hishari, Derek Stewart, Ahmed Awaisu, Sara Elshami, Banan Mukhalalati</p>\r\nIntroduction and objective <p>The commitment of pharmacy graduates to patient care and research is crucial to advancing pharmaceutical science and practice. Consequently, the value of involving undergraduate pharmacy students in research has been increasingly recognized. Given that the College of Pharmacy at Qatar University offers two undergraduate pharmacy research courses, it is relevant to explore the perception of faculty members of the delivery, impact, facilitators, barriers, and suggested improvements in these courses. This exploration will help to improve the existing curriculum and to highlight the prospective impact of student involvement in undergraduate pharmacy research courses on the personal and professional growth of students, as well as on the progressive evolution of the pharmacy profession.</p> Methods <p>A qualitative exploratory case study was performed in which five virtual focus groups were conducted. All eligible faculty members from the clinical pharmacy and pharmaceutical science departments with experience supervising students who had taken one or two undergraduate pharmacy research courses were invited to participate. The focus group questions were based on the Theoretical domain framework of behavioral determinants. Verbatim transcription was performed, and the collected data were thematically analyzed using the computer-assisted coding software NVivo®.</p> Results <p>Of the 26 eligible faculty members, 21 participated in this study. Five deductive themes were identified: social professional role and influences, beliefs about capabilities, skills, beliefs about consequences and goals, and environmental resources and behavioral regulations. Overall, faculty members identified themselves as assessors and mentors. Participants expected students to possess independence, responsibility, and motivation. They believed that students generally required more practical research skills. Several benefits of incorporating students into undergraduate research have been highlighted, including increased publication productivity and quality. However, several hurdles to undergraduate research in pharmacy have been identified, including limited resources, limited timeframes, and sometimes delayed ethical approval.</p> Conclusion <p>Faculty members expressed optimism regarding the undergraduate research courses. However, some logistical concerns, including the lengthy ethical approval process and resource availability, must be addressed to optimize the effectiveness of these courses.</p>","author":"Aaliah Aly","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c546673a1a0a1cf15e43d63fb8912af15ab4786ff2ef5cb4b1e9557d003a87ae","category":"Interdisciplinary"}