{"title":"Effectiveness of Three Front-of-Pack Food Labels in Guiding Consumer Identification of Nutrients of Concern and Purchase Intentions in Kenya: A Randomized Controlled Trial","link":"https://www.preprints.org/manuscript/202409.1723/v1","date":1727085617000,"content":"Background: Front-of-pack-labels (FOPLs) on packaged foods provide consumers with essential information about the nutritional content of food products, enabling them to make informed choices and align their dietary habits with their health goals. However, evidence on the comprehensibility, use, and effectiveness of FOPLs remains limited, particularly in low- and middle-income countries like Kenya. Objective: In this study, we assessed the effectiveness of three FOPLs in helping consumers identify excess nutrients of concern in packaged food products and their potential influence on food purchases in Kenya. Methods: A total of 2198 shoppers with diverse backgrounds were recruited from selected supermarkets in three Kenyan main cities (Nairobi, Mombasa, Kisumu) and a small town (Garissa). Participants were randomized to three FOPLs: Red and green Octagon label (RG), Red and Green Octagon with icons (RGI) and a black Octagon Warning label (WL). In the control phase, participants were shown unlabeled images of packaged food products and they responded to a set of questions. In the experimental phase, the same product images were presented with one of the three front-of-pack labels they were randomized to, and participants answered the same questions again. Differences in the proportions of participants correctly identifying the nutrients of concern and the changes in intention to purchase unhealthy foods before and after exposure to FOPLs were analyzed using frequency tables and Chi-Square tests. The effectiveness of the three FOPLs was further assessed using a modified Poisson regression. Results: Results showed that exposure to FOPLs significantly improvement participants' ability to correctly identify nutrients of concern across various food categories. Additionally, FOPLs reduced consumers’ intentions to purchase unhealthy foods, with the Warning Labels (WL) emerging as particularly effective in enhancing consumers' understanding of product healthiness and reducing the intention to purchase unhealthy foods compared to the other two FOPLs. Conclusion: These findings underscore the potential role of FOPLs, particularly the WL as an effective regulatory tool for promoting healthier food choices in Kenya.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c547eca0f2330323d70e9c1eb3f463605be6df6a786443de72b10c897d1f4e29","category":"Interdisciplinary"}