{"title":"Suunto 9 Peak: Everything you ever wanted to know","link":"https://www.dcrainmaker.com/2021/05/suunto-9-peak-everything-you-ever-wanted-to-know.html","date":1621933200000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4799.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4799_thumb.jpg\" /></a></p>\n<p>In many ways, the Suunto 9 Peak is unlike anything Suunto has ever introduced before. Yet in other ways, it’s like everything Suunto has before it. Some differences are glaringly obvious, like the sleek new watch design – throwing away the often chunky Suunto exterior style, while somehow feeling distinctly Suunto. While other differences are only seen after a run: <strong>Absolutely perfect GPS tracks</strong>. <strong>So perfect that you’d think they might be fake</strong>.</p>\n<p>And, in a way, they kinda are. But, mostly in a good way. Potentially the most innovative thing to hit GPS watches in years, Suunto’s new ‘Snap to Route’ functionality will keep not just your GPS tracks perfectly aligned to your plan route, but also ensure that your pacing and distance data matches that of the course, especially useful for urban/city races with poor GPS signals. As I’ll explain later in the post, while this technology isn’t without its caveats, I’ve gotta believe it’s something that would be hugely beneficial to large numbers of marathon runners – especially for races like the NYC Marathon or similar.</p>\n<p>Beyond that and visible hardware changes, the Suunto 9 Peak also includes fast charging, a blood oxygen sensor, a new optical heart rate sensor, and wireless firmware updates (no more desktop computer required). Plus a handful of other smaller software tweaks. Sure, it’s not a vastly new watch when it comes to features. But the original Suunto 9 has seen <a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html\">various firmware updates along the way itself</a>, including a new Tour mode that was introduced back in March, and of course consistent app updates to the Suunto smartphone app – to the point where it’s getting viable to use (compared to the now-retired Movescount).</p>\n<p>In this post I’ll dive into my first week using the watch and all the new features. This has included a slate of runs, rides, and indoor workouts too. Though, I’ll mostly focus on the outside workouts. Since the device isn’t slated to start shipping until later in June, I’ll save my full review for then – and hopefully by then I’ll be able to get in some more mountainous workouts with it too. So as usual, this isn’t a proper final review, but rather a first look. Also as usual, they’ll get their media loaner watch back after all this, and I’ll go out and buy my own. You can hit up the links at the bottom if you find this post useful.</p>\n<h3><span>What’s new:</span></h3>\n<p></p>\n<p>The Suunto 9 Peak is in many ways still the same software you’d find on a previous Suunto 9 unit. Thus it’s a full-featured multisport watch that connects to Bluetooth sensors and syncs all that data to your phone via the Suunto App, and then onwards to TrainingPeaks, Strava, and countless other partners. If you’ve had a Suunto 3/5/9 watch in the past (or a Suunto Spartan series watch), you’ll be pretty familiar with the core of the Suunto 9 Peak – most of it hasn’t changed.</p>\n<p>However, there are a pile of things that have changed, and I’ve tried to consolidate all of them into this simple bulleted list:</p>\n<p>– New exterior design, far thinner at 10.6mm (compared to 15.4mm on the Suunto 9 Baro)<br />\n– New 1.2” trans reflective display<br />\n– New optical heart rate sensor from LifeQ (same company as on Suunto 7)<br />\n– New blood oxygen/Sp02 sensor<br />\n– New magnetic charging cable design (doesn’t need to be precisely placed anymore)<br />\n– New fast charging (1hr to full, versus 4hrs to full previously)<br />\n– New Snap to Route GPS track option<br />\n– New Tour Mode (this technically was added to Suunto 9 Baro two months ago though)<br />\n– New wireless firmware updates over Bluetooth Smart<br />\n– New ambient light sensor for automatic backlight illumination<br />\n– New light (white) watch face themes (as opposed to black only)<br />\n– New Suunto App first use pairing (to sync in your profile + date/time)<br />\n– New SuuntoPlus Ghost Runner screen option<br />\n– New standard 22mm watch straps (woot!)<br />\n– All Suunto 9 units include a barometric altimeter (previously, the lower-end Suunto 9 didn’t)</p>\n<p>Got all that? Good.</p>\n<p>Pricing wise, there’s two simple pricing tiers – one at $699/699EUR which is for the titanium models, which are 15% lighter (54g vs 62g), while the $569/569EUR models are stainless steel. All models have a barometric altimeter, and identical battery/feature specs. You’re simply paying for the bezel/weight/case/strap differences here.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image002.gif\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image002_thumb.gif\" /></a></p>\n<p>On the Suunto 9, as noted all units include a barometric altimeter. This is notable not because that’s of course the way it should be in 2021 at this price point (or even 5 years ago), but because Suunto explicitly noted it in their press materials, saying “We have decided that all our flagship products will contain the barometric altitude without needing to state that in the name (like we did with the previous Suunto 9 [Baro])”. That’s good – and I’m happy to see both that, as well as the reduced naming confusion.</p>\n<p>Finally, Suunto is slating to start shipping the Suunto 9 Peak units on June 19th. It’s on/about that date that I’ll release my final in-depth review using the final software (this post is based on final production hardware, just not final firmware).</p>\n<h3><span>Material Differences:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4874.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4874_thumb.jpg\" /></a></p>\n<p>Before we dive into the new GPS snapping feature, let’s just take a quick look at some of the material and size differences, as well as some quick comparisons. The differences are massive compared to the original Suunto 9 units:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4875.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4875_thumb.jpg\" /></a></p>\n<p>And while the original band of the Suunto 9 was technically removable, you still had the beastly watch strap connection towers to contend with, no matter what band you put on there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4877.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4877_thumb.jpg\" /></a></p>\n<p>With the Peak, they’re pretty much normal sized:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4878.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4878_thumb.jpg\" /></a></p>\n<p>Here’s a comparison against the Polar Grit X:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4879.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4879_thumb.jpg\" /></a></p>\n<p>And the Garmin Fenix 6S Pro (that’s the most similar size-wise to the Suunto 9 Peak:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4880.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4880_thumb.jpg\" /></a></p>\n<p>And the COROS Vertix:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4881.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4881_thumb.jpg\" /></a></p>\n<p>Weight-wise, they came in on my little scale at 54g for the titanium, and 62g for the stainless steel:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4882.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4882_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4883.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4883_thumb.jpg\" /></a></p>\n<p>It’s one of the nicest looking watches I’ve had in quite a while. The side bezels almost feel Apple-like, kinda like the new iPad Pro or such, with the flat edges. Or I suppose, like the older iPhones. Either way – I like it.</p>\n<h3><span>Snap to Route GPS:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4797.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4797_thumb.jpg\" /></a></p>\n<p>I suspect for most people, the new Snap to Route feature is probably of most interest, so that’s what I’ll spend a good chunk of time here on. The feature is essentially keeping you ‘on track’ to a predefined GPS route. Thus, it requires you load a route ahead of time to your watch. Meaning, this is great for races or other routes where you’ve got a predetermined plan in advance. But it’s not usable/available for cases where you just go out for a random run/ride without any preset/loaded plan.</p>\n<p>Thus, to begin, you’ll need to sync a route to your watch from the Suunto app. You can create a new route there, or, you can pull in routes from files (aka a GPX file), or <a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html\">from Komoot</a>. For this example, I tapped my way around a map to create a horrifically challenging GPS route under massive 8-12 lane bridges (twice), and then up and down the business district of Amsterdam, with most of the buildings at 20-25 stories tall, and tiny alley-ways and streets between them. Heck, at least when running in NYC you’ve got grand avenues that give GPS a hope and a prayer.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00116.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00116_thumb.png\" /></a></p>\n<p>Next, on the watch you’ll go and choose a sport mode like normal. In my case I selected running, but you can choose whatever you want (as long as it supports routes in general). It doesn’t really matter here. Then, you’ll scroll down to Navigation, and select ‘Snap to Route’:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4811.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4811_thumb.jpg\" /></a></p>\n<p>After that, you’ll choose your routes of choice:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4812.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4812_thumb.jpg\" /></a></p>\n<p>This loads it up just like a normal route would, except, it tells the watch to snap your tracks to that route. So you’ll still get turn-by-turn directions as you would with the recent update, and you’ll still see the route shown on the map too. Here’s the route profile:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4813.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4813_thumb.jpg\" /></a></p>\n<p>It’ll tell you that your GPS track will follow the route:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4816.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4816_thumb.jpg\" /></a></p>\n<p>And now, you can go ahead and press start like normal. You’ll see your track/route as your run and the planned route (or ride/etc..):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4817.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4817_thumb.jpg\" /></a></p>\n<p>At this point, you basically just do what you normally do. There isn’t much of a difference here. Like before, if you go off-track or get lost, it’ll tell you as such. In my case, I followed the track without issue, including through these little gems of small streets, with 25 story buildings on both sides of me. Up and down, street after street:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image001-3.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image001_thumb-3.jpg\" /></a></p>\n<p>Remember, the key thing the Suunto 9 Peak is trying to do here is guard against poor GPS signal/accuracy. And while GPS units do know how many satellites they have, and whether or not that data is more or less trustworthy, those assumptions are not perfect – especially in urban canyons, where reflections off of buildings can lead to unpredictable results. Thus essentially, this technology says “I don’t trust the GPS for minor to moderate disagreements on the GPS track”. So as long as you’re within realm of the GPS track, it stays stuck on it.</p>\n<p>Think of yourself as on a cable above a roadway, on your predefined track. You can meander around a bit, hit up a bush on the side of the road, fill up a water bottle at a fountain – and it won’t change the GPS track. You’re still close enough that the ‘leash’ it has stays snapped to the road. But go far enough away from the roadway, and eventually the leash snaps, and you are set free.</p>\n<p>And, to fast forward to the result, here’s a comparison of what the GPS tracks looked like side by side Suunto 9 Peak (at left) versus an older Suunto 9 Baro (at right):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image001.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image001_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018_thumb.png\" /></a></p>\n<p>And then adding in/versus a newer Gamin Forerunner 745:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00110.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00110_thumb.png\" /></a></p>\n<p>As you can easily see, the tracks look far better on the Suunto 9 Peak. As it’s virtually flawless. I say virtually because there are slight cases where my plotting of the GPS route was imprecise, so it snapped to that too, such as this one corner where I apparently misplaced the dot on the map, so it did too (in real-life I made that corner seamlessly).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00112.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00112_thumb.png\" /></a></p>\n<p>So what happens when you go off-track? Well, it depends. The short version is that eventually it’ll release its grasp of you.</p>\n<p>You can see that most easily here on this little section I did where I ignored the route (and turn), and continued to run along the river a bit longer. At first it ignored me, and then eventually it released its grip and started recording my new GPS track. However, as I started a small loop back towards the route, once I got close enough, it “snapped” me back to the route. In this case, my GPS route doesn’t show the correct place I ran (in highlighter yellow), but did its job of snapping me onto the route (attempting to guard against poor GPS signal).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0014.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0014_thumb.jpg\" /></a></p>\n<p>This is because while the threshold to ‘break away’ from the GPS route is 100m (away), the threshold to rejoin the route is set quite a bit lower, down to 20m. So you can see when I get within 20m of the route again, it snapped me back in. The reason for the lower threshold is to prevent oscillations when you’re near the 100m threshold.</p>\n<p>Inversely, what happens if the route you created was wrong to begin with? Well, your new GPS track will be wrong too – at least if the route is close enough. Take a look at the below. Again, yellow where I actually ran, red where the GPS route (and then subsequent track was). In this case, while creating the route the automatic routing engine in the Suunto App happened to place me in the middle of the cow field. I didn’t catch this when I created the route, since this was a simple farm road I’ve run countless times, and it never occurred to me that it would route me through a cow field on that section. The distance between those two segments was maybe about 100m away. You’ll see that was within the threshold for the algorithm, so it kept me on the pre-determined route:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0016-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0016_thumb-1.jpg\" /></a></p>\n<p>The algorithm seems to handle lollipop-style routes well, as well as numerous crisscrossing of the route. If you thought my city route was devilishly mean, you should check out this route I created, which includes two very close to each other (30-50m) paths/trails and then me switching back and forth on those paths in both directions. The most recent beta firmware has handled this perfectly – correctly getting exactly which path I should be on in which direction and which side:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00114.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00114_thumb.png\" /></a></p>\n<p>Now granted, it helps that it knows distance of where you should be, and can cross-reference that against not just the wrist-based accelerometer distance estimates. And again, this is still early days for the algorithm. I’m hoping we’ll continue to see more and more refinements and tweaks with it going forward to really finesse some of the minor tweaks. For example, I suspect they could narrow down both of my off-route adventures a bit more, and reduce the separation threshold too.</p>\n<p>One has to keep in mind though that this depends on the accuracy of your initial route, as well as the underlying map data. For example – in most cities/towns, that GPS data is very good, because it’s got years of companies going out and ensuring the exact positions of those roads (and even bike paths) match GPS coordinates with highly sophisticated equipment. So that’s great and as long as you run in the same spot/line you created the route, you’re good.</p>\n<p>However, in the mountains, this tends to be far less accurate. Most of the trails are frankly just ‘guesses’, especially when it comes to complex switchbacks against mountainsides. Even on some of the most frequented trails in and around hotspot destinations like Chamonix, you’ll find the trails per the map aren’t exact replications of reality. More like water paintings. Thus, while this can still be used in off-road adventures, it won’t likely be as solid as with more urban routes.</p>\n<p>So let’s quickly recap where it does and doesn’t work well:</p>\n<p>Things it will do well:</p>\n<p>– Big city marathons with lots of buildings and GPS interference<br />\n– Routes where you might have tunnels or bridges, and want clean distance totals<br />\n– Handles trees or such that could block the GPS signal from accurately displaying your route</p>\n<p>Things it won’t do well (or at all):</p>\n<p>– Free-form workouts without a plan<br />\n– Places where the mapped trail accuracy (especially switchbacks) might not be good<br />\n– Fix issues with your own GPS route (such as misplacing points/dots on the map)</p>\n<p>Now it’s funny, I imagine other GPS makers this morning are probably leaning back in their chairs drinking their morning coffee going “How cute Suunto! You fixed GPS accuracy…by simply faking the GPS track!” – along with a side of bewilderment at the brazen nature of the idea. After all, it’s so obvious it’s almost dumb. So much so that undoubtedly Garmin and Polar are saying “Are you $h!tting me? They get credit for that?”.</p>\n<p>Yet, it’s so perfect for the intended use case. If I’m running a race, I don’t give a rat’s behind about my actual GPS track full of errors around big buildings. Instead, I want my pacing and distance during that race to be spot-on, and I want my actual GPS track afterwards to show the route I actually ran, which, for 99.9% of races is where the race course was. Everything else is tech chatter. And to that end, Suunto achieved exactly that – even if they did it via the most hilariously brazen way possible: Taking the answer sheet from the teacher.</p>\n<h3><span>Suunto 9 Peak Newness:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4820.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4820_thumb.jpg\" /></a></p>\n<p>Now beyond the new GPS bits, there’s a slate of new features I’ll do a quick run-through. For this post I’ll skip all the usual basics like how to look at step tracking, or modifying data fields. Those will come in the full review later.</p>\n<p>First up, there’s the new optical heart rate sensor on the back. This sensor is from LifeQ, the same company that produced the sensor for the Suunto 7 series, however, this is a different sensor package.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4822.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4822_thumb.jpg\" /></a></p>\n<p>In my testing, accuracy at this stage seems reasonably good. A couple of minor quibbles here and there in the early portions of runs, but nothing I’m super concerned about at this stage (and again, I’ll have tons more data in my in-depth review):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-57.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-57.png\" /></a></p>\n<p>That new sensor package includes blood oxygen measurement (aka an SpO2 sensor). At present, Suunto has enabled one-off measurements, which would be targeted towards high-altitude usage, more than other uses. For example, today there isn’t an option to turn it on 24×7 or for sleep (like many other wearables). It sounds like that’s Suunto’s ultimate goal, but they’re taking baby steps at first.</p>\n<p>To get an SpO2 reading, you’ll simply swipe down once, which takes you to the heart rate page, then tap on the SpO2 sensor icon, and it’ll take a measurement. For these sorts of things, being super still (and ideally seated) is best.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4825.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4825_thumb.jpg\" /></a></p>\n<p>In my testing, accuracy at this stage (beta firmware) seems iffy at best. Comparing it to a EU medically certified pulse oximeter, produces inconsistent and rather low results, usually off by 6-10 units.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018_thumb-1.jpg\" /></a></p>\n<p>Suunto says they’re working on the firmware here a bit more (meaning, LifeQ is working on firmware more), and hope to see better results by launch. Oh, and there’s the blood oxygen sensor in red:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4828.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4828_thumb.jpg\" /></a></p>\n<p>Next, there’s the new fast charging. This charges your Suunto 9 Peak to 100% in about an hour. Though, that’s a bit of a stretch in that I did from 10% to 90% in about an hour, it’s just those last 10% take a lot longer to trickle charge. Anyway, point being, it charges fast. I topped off a Suunto 9 Peak from 11% to 33% in 7 minutes before a run today.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4857.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4857_thumb.jpg\" /></a></p>\n<p>Also of note, is the charging cable is new. The old cable was sometimes finicky on the magnetic connection and the grooves. This one can be attached just about any way you want, and it’ll snap itself the rest of the way.</p>\n<p>There’s now wireless firmware updates. This means that you no longer have to plug it into a computer to update your watch. Updates come via the Suunto app, and then can be installed via the menu in the watch. Or, you can simply wait till night as long as there’s enough charge, it’ll quietly update it overnight in the background. In the morning you’ll get a message in the Suunto App that your watch was updated with details on what changed.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4884.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4884_thumb.jpg\" /></a></p>\n<p>Similarly, as part of the first time using the watch, the app will sync a bunch of settings over automatically via a new wizard. Some of it is still required on the watch itself (like setting weight and gender), but things like the preferred start day of the week, and even the exact time, are now synced via smartphone (previously the first time you used the watch, you had to go outside and get GPS…now you don’t).</p>\n<p>Next, there’s the new light theme for the watch face. Basically, this puts things on a white background, as opposed to a black background. I thought I’d like this, but then I realized it kinda exposes just how really wide the top empty bezel areas are (in black). So, I switched back to black.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4885.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4885_thumb.jpg\" /></a></p>\n<p>Still, it’s an option – and I appreciate options!</p>\n<p>Next, the Suunto 9 Peak includes an ambient light sensor to detect darkness and adjust the screen brightness automatically. This was most noticeable today while running under a series of large bridges, which made it pretty dark. As I did so (if my wrist was raised), it turned on the backlight. There’s a slew of conditions around this and different behaviors you can tweak, but I’ve been pretty darn happy with the existing default configuration. To be SUPER CLEAR here: The screen is *ALWAYS ON* when on your wrist, no matter what. This is all about backlight brightness.</p>\n<p>Of course, for those geeks who want to tweak, here’s a full chart of how it all works, and ways you can change it:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-58.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-58.png\" /></a></p>\n<p>Finally, there’s the new Ghost Runner feature, which is a SuuntoPlus data field that you can configure on your watch at the start of a workout. This will compare your pace for the first kilometer for the remainder of the run. Meaning, imagine a race that you want to keep a consistent pace on, as long as you run that first split at said pace, then it’ll show you how far ahead/behind you are from that pace, for the remainder of your run.</p>\n<p>Again, as part of my full in-depth review I’ll cover all the normal sections like configuring sport modes, daily activity tracking, sleep tracking, and plenty more. All of which have steadily improved since the original Suunto 9 release, though, in this case all of those are already in the existing Suunto 9 as it stands today (including the recent <a href=\"https://www.dcrainmaker.com/2021/04/suunto-trainingpeaks-training-recovery.html\">TrainingPeaks integration bits outlined here</a>).</p>\n<h3><span>Summary:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4826.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4826_thumb.jpg\" /></a></p>\n<p>Overall, I like the direction Suunto is going. Starting with the hardware, the new form factor is just so much better and cleaner, and far more relevant to what people want. There’s been a notable decline of people that want large chunky watches, and Suunto mirrored those thoughts when I chatted with them. The Suunto 9 Peak nails the design in what is arguably my favorite looking watch in a number of years – just so crispy.</p>\n<p>Next, there’s the new Snap to Route. I’d also say this is probably going to be one of the biggest shifts in the sports tech landscape in terms of running especially, but notably urban running races. I could see this being a huge selling point for many people that live and race near cities, but also just racing in places with poor GPS coverage or accuracy issues. This eliminates that and gets you consistent pacing and distance. Sure, there’s some tweaking Suunto could do longer term to the detach/attach algorithms, but out of the gate the most recent firmware is impressive. That tall building city run I did was impossibly complex, and it nailed it exactly perfectly on the first try. No do-overs here folks.</p>\n<p>Now, while Suunto has made great progress with their app in the last few months, they’ve still got a ways to go to catchup with the likes of Garmin and Polar, and COROS’s recent updates will apply pressure as well. I’m hoping watches like these give Suunto the motivation to keep pouring resources into all aspects of the platform – because one can’t just focus on one aspect, it has to be holistic.</p>\n<p>In any event, I’ll circle back later in June once it starts shipping with my full and final in-depth review packed with all the usual goodness. With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"c55900ec8eeb283fc9cf55170a371db4d7ae68f74f87f7520e85a633e8dc10c7","category":"Cycling"}