{"title":"Powering the Future: Leveraging Carbon Nanotubes, Silicon Nanowires, and MoS2 for Breakthroughs in Hydrogen Production and Li-ion Batteries","link":"https://www.preprints.org/manuscript/202410.0126/v1","date":1727859662000,"content":"This study explores the hydrogen generation potential via water-splitting reactions under UV-vis radiation, by using a synergistic assembly of ZnO nanoparticles integrated with MoS2, single-walled carbon nanotubes (SWNTs), and crystalline silicon nanowires (SiNWs) to create the MoS2-SiNWs-SWNTs@ZnONPs nanocomposites. A comparative analysis of MoS2 synthesized through chemical and physical exfoliation methods revealed that the chemically exfoliated MoS2 exhibited superior performance, thereby being selected for all subsequent measurements. The nanostructured materials demonstrated exceptional surface characteristics, with specific surface areas exceeding 300 m²g⁻¹. Notably, the hydrogen production rate achieved by a composite comprising 5% MoS2, 1.7% SiNWs, and 13.3% SWNTs at an 80% ZnONPs base was approximately 3909 µmol h⁻¹g⁻¹ under 500 nm wavelength radiation, marking a significant improvement of over 40-fold relative to pristine ZnONPs. This enhancement underscores the remarkable photocatalytic efficiency of the composites, maintaining high hydrogen production rates above 1500 µmol h⁻¹g⁻¹ even under radiation wavelengths exceeding 600 nm. Furthermore, the potential of these composites for energy storage and conversion applications, specifically within rechargeable lithium-ion batteries, was investigated. Composites, similar to those utilized for hydrogen production but excluding ZnONPs to address its limited theoretical capacity and electrical conductivity, were developed. The focus was on utilizing MoS2, and SiNWs, and SWNTs, as anode materials for Li-ion batteries. This strategic combination significantly improved the electronic conductivity and mechanical stability of the composite. Specifically, the composite with 56% MoS2, 24% SiNWs and 20% SWNTs offered remarkable cyclic performance with high specific capacitance values, achieving a complete stability of 1000 mA h⁻¹g⁻¹ after 100 cycles at 1 A g⁻¹. These results illuminate the dual utility of the composites, not only as innovative catalysts for hydrogen production but also as advanced materials for energy storage technologies, showcasing their potential in contributing to sustainable energy solutions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c55e6f71f683f2e769ab6d66aad395d0761ffcd6d188dee2f89f0a00ce431b22","category":"Interdisciplinary"}