{"title":"Crop rotational diversity can mitigate climate‐induced grain yield losses","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17298?af=R","date":1715065200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/42ab4d64-6422-47ac-a35a-b7273dc439c7/gcb17298-toc-0001-m.png\" alt=\"Crop rotational diversity can mitigate climate-induced grain yield losses\" />\n<p>Industrial agriculture often relies on one or few crop species grown in monocultures or short crop rotations, making them vulnerable to changes in climatic conditions. Using data from several agricultural experiments in Europe and North America, we show that including more crop species or crop types in rotation can mitigate cereal yield losses caused by increasingly common shifts in climatic conditions, such as increasing temperatures and decreasing precipitation. Hence, increasing crop rotational diversity can support the climate adaptation of the way we produce our food.</p>\n<br />\n<h2>Abstract</h2>\n<p>Diversified crop rotations have been suggested to reduce grain yield losses from the adverse climatic conditions increasingly common under climate change. Nevertheless, the potential for climate change adaptation of different crop rotational diversity (CRD) remains undetermined. We quantified how climatic conditions affect small grain and maize yields under different CRDs in 32 long-term (10–63 years) field experiments across Europe and North America. Species-diverse and functionally rich rotations more than compensated yield losses from anomalous warm conditions, long and warm dry spells, as well as from anomalous wet (for small grains) or dry (for maize) conditions. Adding a single functional group or crop species to monocultures counteracted yield losses from substantial changes in climatic conditions. The benefits of a further increase in CRD are comparable with those of improved climatic conditions. For instance, the maize yield benefits of adding three crop species to monocultures under detrimental climatic conditions exceeded the average yield of monocultures by up to 553 kg/ha under non-detrimental climatic conditions. Increased crop functional richness improved yields under high temperature, irrespective of precipitation. Conversely, yield benefits peaked at between two and four crop species in the rotation, depending on climatic conditions and crop, and declined at higher species diversity. Thus, crop species diversity could be adjusted to maximize yield benefits. Diversifying rotations with functionally distinct crops is an adaptation of cropping systems to global warming and changes in precipitation.</p>","author":"Alessio Costa, \nRiccardo Bommarco, \nMonique E. Smith, \nTimothy Bowles, \nAmélie C. M. Gaudin, \nChristine A. Watson, \nRemedios Alarcón, \nAntonio Berti, \nAndrzej Blecharczyk, \nFrancisco J. Calderon, \nSteve Culman, \nWilliam Deen, \nCraig F. Drury, \nAxel Garcia y Garcia, \nAndrés García‐Díaz, \nEva Hernández Plaza, \nKrzysztof Jonczyk, \nOrtrud Jäck, \nLuis Navarrete Martínez, \nFrancesco Montemurro, \nFrancesco Morari, \nAndrea Onofri, \nShannon L. Osborne, \nJosé Luis Tenorio Pasamón, \nBoël Sandström, \nInés Santín‐Montanyá, \nZuzanna Sawinska, \nMarty R. Schmer, \nJaroslaw Stalenga, \nJeffrey Strock, \nFrancesco Tei, \nCairistiona F. E. Topp, \nDomenico Ventrella, \nRobin L. Walker, \nGiulia Vico","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"c569b9ff0ff27afa336b58a319ef3078b32ec46a690c9ff11127349e4b51d17f","category":"Environment"}