{"title":"Non‐oxidized and oxidized flaxseed orbitides differently induce HepG2 cell apoptosis: involvement of cellular uptake and membrane death receptor DR4","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13315?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Flaxseed orbitides have health-promoting properties, particularly potent anti-cancer activity. However, flaxseed orbitides containing a methionine structure, such as [1-9-NαC]-linusorb B2 (CLB), are easily oxidized to sulfoxide ([1-9-NαC],[1-Rs,Ss-MetO]-linusorb-B2 (CLC)) and sulfone ([1–9-NαC], [1-MetO]-linusorb B2 (CLK)), with CLC having less anti-cancer ability than CLB. It is unclear why oxidized flaxseed orbitides are less effective against cancer than non-oxidized flaxseed orbitide.</p>\n<h2>RESULTS</h2>\n<p>Non-oxidized ([1-9-NαC]-linusorb-B3 (CLA) and CLB) and oxidized (CLC and CLK) flaxseed orbitides were found to significantly upregulate the levels of pro-apoptotic proteins, including Bax/Bcl-2, CytoC, caspase-3, and caspase-8, in a dose-dependent manner, with non-oxidized flaxseed orbitides being more effective than oxidized flaxseed orbitides. Mechanically, the cellular absorption of non-oxidized flaxseed orbitides was higher than that of oxidized flaxseed orbitides. Moreover, the significant fluorescence quenching of DR4 protein by flaxseed orbitides (especially non-oxidized orbitides) indicated the formation of a DR4–orbitide complex. Molecular docking demonstrated that non-oxidized orbitides could easily dock into the active cavity of DR4 protein. Further blocking DR4 significantly reduced the ability of non-oxidized flaxseed orbitides to stimulate caspase-3 expression, whereas oxidized flaxseed orbitides retained this ability.</p>\n<h2>CONCLUSION</h2>\n<p>Non-oxidized flaxseed orbitides are more effective against cancer than oxidized flaxseed orbitides due to higher cellular uptake and activation of the DR4-mediated death receptor signaling pathway. © 2024 Society of Chemical Industry.</p>","author":"Changmei Peng, \nJing Li, \nAixiu Zhao, \nShaoqing Yu, \nLiufeng Zheng, \nZe‐Yuan Deng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c577710d69a7d44749a2c13639f2b9dff3fcc9d7b17aaf496825956cfa952a2b","category":"Environment"}