{"title":"Effects of water and exogenous glucose on apple seedling growth and soil enzyme activity in semiarid area","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13611?af=R","date":1716612798000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Soil water and organic carbon (C) are key factors affecting the growth and development of apple seedlings. The objective of the study was to investigate the effects of different soil moisture and glucose supplies on apple seedling growth and soil enzyme activities. We hypothesized that the growth of apple seedlings was affected by soil water and C content through their effects on root structure, plant physiological properties and soil enzymatic activities. A pot experiment consisting of nine treatments was set up, including three water treatments with soil moisture contents at 75–85% (normal irrigation, CK), 65–75% (light water stress, LS), and 55–65% (mild water stress, MS) of the soil field capacity, in combination with three glucose treatments with carbon/nitrogen (C/N) ratio of 7.5 (C1, no adding glucose), 10 (C2) and 15 (C3), respectively.</p>\n<h2>Results</h2>\n<p>Results showed that the LSC2 treatment significantly increased plant height by 7%, stem diameter by 5% and leaf area by 17%, as compared with LSC1. Also, LSC2 significantly increased root dry weight, root vitality and soil enzyme activities. Moreover, results of leaf photosynthetic, malondialdehyde (MDA), peroxidase (POD), superoxide dismutase (SOD) and proline contents also proved that adding glucose improved the drought resistance of plants.</p>\n<h2>Conclusion</h2>\n<p>LSC2 treatment is more conducive to the growth of apple seedlings, and application of carbon has a good alleviation effect on plant water stress. The study demonstrated that addition of exogenous glucose alleviated light water deficiency, significantly affected root vitality, and promoted apple seedling growth. © 2024 Society of Chemical Industry.</p>","author":"Pingguo Yang, \nJian Liu, \nXiaorong Shi, \nHuaiyu Long, \nLei Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c579f4c1e4fbf531287de2f4fec67b26c23c1ee0d5f1198c4a87ee48ced84555","category":"Environment"}