{"title":"236 The effects of replacing dried distiller’s grains with solubles with heat-treated soybean meal on nutrient intake and digestibility in forage-based diets","link":"https://academic.oup.com/jas/article/102/Supplement_2/211/7664712?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Cattle growth is calculated through dry matter intake, average daily gain and gain:feed measures that assume performance and digestibility are correlated. Hence, evaluating nutrient digestibility and flow provides additional explanations for subsequent growth performance. Therefore, five fistulated Jersey steers [Initial body weight (BW) = 288 ± 22 kg) fitted with ruminal, duodenal, and ileal cannulas were utilized in a 4 × 5 row-column design to determine intake and total tract nutrient digestibility when replacing dried distiller’s grains plus solubles (DDGS) with heat-treated soybean meal (TSBM) in forage-based growing diets. The 56-d study contained 4 periods, each period lasting 14 d [9 d of adaptation and 5 d of collection (d 0 to 4)]. Dietary treatments partially replaced DDGS, included at 16% diet dry matter (DM), with TSBM at increasing inclusion levels of 0 (TSBM0), 4 (TSBM4), 8 (TSBM8), and 12% (TSBM12) DM. Basal diets contained 43.5% corn silage, 36.5% oat hay, and 4% meal supplement (DM). Chromic oxide was incorporated into the diet daily at 0.25% DM as a digesta marker. Steers were housed in individual tie stalls during the 5-d collection period. Treatment diets were fed daily at 0800 h with orts being weighed at 0730 h and subsampled on d 0 to d 4 each period. Fecal collection bags were harnessed to each steer from d 0 to d 4 to collect fecal weight and subsampled twice daily (0700 and 1900 h). Digestibility and feed intake were analyzed utilizing the MIXED procedure of SAS with treatment and period as fixed effects and animal as a random effect. There were no differences (<span>P</span> ≥ 0.14) in DM, organic matter (OM), neutral detergent fiber (NDF), starch and nitrogen (N) intakes among treatments. Fecal DM, OM, NDF, starch, and N output resulted in no treatment effects (<span>P</span> ≥ 0.24). Subsequently, total tract apparent digestibility differences (<span>P</span> ≥ 0.32) were not detected for DM, OM, NDF, and starch content. However, N total tract apparent digestibility was significantly different (<span>P</span> &lt; 0.03) with TSBM0 resulting in less N digestibility than TSBM12 (65.54% and 71.59%, respectively). Replacing a portion of DDGS with TSBM does not result in deleterious digestive effects in forage-based growing diets. As a result, the utilization of DDGS or TSBM as the primary protein source will depend on growth performance, feedstuff availability and economics.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c58b7b9c09bca7784ccf0679a91ea98956acf51fa4d3c961d5a07bd8d46da8c3","category":"Environment"}