{"title":"November 2nd is the 2021 International SingleSpeed Day","link":"https://theradavist.com/2021/11/november-2nd-is-the-2021-international-singlespeed-day/?utm_source=rss&utm_medium=rss&utm_campaign=november-2nd-is-the-2021-international-singlespeed-day","date":1635864155000,"content":"<p>Today, November 2nd, is the 2021 International SingleSpeed Day, founded by Paul from Paul Component Engineering and our friend Amanda <a href=\"https://theradavist.com/2020/11/a-sunset-ride-to-celebrate-international-singlespeed-day/\" target=\"_blank\">last year</a>. Here’s the scoop from the team at Paul (below), read on for how you can win a grip of prizes, and check out <a href=\"https://theradavist.com/2021/11/rigid-and-spellbound-the-sour-bicycles-pasta-party-29er-ssmtb-with-berd-wheels/\" target=\"_blank\">today’s Pasta Party review</a> to commemorate ISSD!…<span></span></p>\n<p>“Every Monday at 11 am, the entire PAUL Component shop staff has an “All-Hands” meeting to catch up on any changes, shop news, or projects. Ever since Covid, this has been held out behind the shop with everybody yelling across the yard to each other. It’s weird, but no weirder than our usual shop vibes.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Fixed-Word-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Last year around this time, Paul announced to everyone that November 2nd was now International Singlespeed Day. We all looked at him like “Huh? Says who?” Then he said it was him and his friend Amanda’s birthday that day, and it was Amanda’s idea, and why the hell not?”</p>\n<p>“Having never created an International Holiday before, I wasn’t quite sure what to do, so I got on the phone with a bunch of framebuilders and friends and said “Hey. It’s Paul’s birthday on November 2nd, and he wants everybody to ride singlespeeds. You down?” And of course, everybody said yes, why the hell not?”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/IMG_9577.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“When the magic day arrived, some folks went riding on singlespeeds with friends or alone, shared their experience on Instagram with the #InternationalSingleSpeedDay hashtag, showed off some cool bikes, wished Paul and Amanda a happy birthday, and everybody had a good time.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/Photo-Oct-20-5-14-01-PM-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“So yeah, let’s do it again! This year we’ll sweeten the pot by choosing our favorite #InternationalSingleSpeedDay IG post, and the winner will receive a PAUL Barbarian hoodie, a handlebar from Oddity, and a prize pack from Squid Bikes. Don’t have a singlespeed bike? Zip-tie your shifters, take the battery off your derailleur, or ride your grandpas beachcruiser? Get creative, there are no rules. Careful though, you might realize in the process that you don’t need a bunch of fancy new-fangled shiftamabobbers to have fun on a bike…”</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"c58bc75bafa4601e88826c813cc1a35bf120393a2ca6c1318f79a51095743c40","category":"Cycling"}