{"title":"A tomato B-box protein regulates plant development and fruit quality through the interaction with PIF4, HY5, and RIN transcription factors","link":"https://academic.oup.com/jxb/article/75/11/3368/7630462?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>During the last decade, knowledge about BBX proteins has greatly increased. Genome-wide studies identified the <span>BBX</span> gene family in several ornamental, industry, and food crops; however, reports regarding the role of these genes as regulators of agronomically important traits are scarce. Here, by phenotyping a knockout mutant, we performed a comprehensive functional characterization of the tomato locus Solyc12g089240, hereafter called <span>SlBBX20</span>. The data revealed the encoded protein as a positive regulator of light signaling affecting several physiological processes during the life span of plants. Through inhibition of PHYTOCHROME INTERACTING FACTOR 4 (SlPIF4)–auxin crosstalk, SlBBX20 regulates photomorphogenesis. Later in development, it controls the balance between cell division and expansion to guarantee correct vegetative and reproductive development. In fruits, SlBBX20 is transcriptionally induced by the master transcription factor RIPENING INHIBITOR (SlRIN) and, together with ELONGATED HYPOCOTYL 5 (SlHY5), up-regulates flavonoid biosynthetic genes. Finally, SlBBX20 promotes the accumulation of steroidal glycoalkaloids and attenuates <span>Botrytis cinerea</span> infection. This work clearly demonstrates that BBX proteins are multilayer regulators of plant physiology because they affect not only multiple processes during plant development but they also regulate other genes at the transcriptional and post-translational levels.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"c58f9424ec218ea259fe2cb5a217ff832a4068763fff9f0e592596d4bd1328b2","category":"Environment"}