{"title":"XSpring เปิด ICO สิริฮับ โทเคนลงทุนอ้างอิงรายรับอสังหาฯ ตัวแรกของไทยที่มี ก.ล.ต. อนุญาต","link":"https://www.blognone.com/node/124862","date":1632225306000,"content":"<div><div><div><p>XSpring Digital แพลตฟอร์มผู้ให้บริการระบบเสนอขายโทเคนดิจิทัล (ICO Portal) เปิดจอง “โทเคนดิจิทัลเพื่อการลงทุนสิริฮับ” (SiriHub Investment Token) แล้ววันนี้ มูลค่าระทมดุน 2,400 ล้านบาท แบ่งเป็น 240 ล้านโทเคน โทเคนละ 10 บาท</p>\n<p>สิริฮับ เป็นโทเคนดิจิทัลอ้างอิงกระแสรายรับจากอสังหาริมทรัพย์ (Real Estate-backed ICO) ในที่นี้คือการนำกระแสรายรับจากค่าเช่าอาคาร “สิริ แคมปัส” สำนักงานใหญ่ของบริษัท แสนสิริ จำกัด (มหาชน) มาแปลงเป็นโทเคนลงทุน อายุโครงการ 4 ปี XSpring ระบุว่าสิริฮับ เป็นโทเคนดิจิทัลเพื่อการลงทุนแบบ Real Estate-backed ICO ตัวแรกในประเทศไทยที่ได้รับอนุญาตโดยสำนักงาน ก.ล.ต.</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/37fbd24568a0318ed95565b30ff662d8.png\" /></p>\n<p>สิริฮับเปิดจองซื้อโทเคนสองแบบคือ สิริฮับ A (SiriHubA) มูลค่าการระดมทุน 1,600 ล้านบาท คาดการณ์ส่วนแบ่งรายได้ไม่เกิน 4.5% ต่อปี (จ่ายทุกไตรมาส) และ สิริฮับ B (SiriHubB) มูลค่าการระดมทุน 800 ล้านบาท คาดการณ์ส่วนแบ่งรายได้ไม่เกิน 8% ต่อปี (จ่ายทุกไตรมาส) ทั้งนี้ส่วนแบ่งที่คาด ไม่ได้เป็นการรับประกันรายได้</p>\n<p>ผู้สนใจสามารถจองโทเคนสิริฮับได้ในแอป XSpring จ่ายเงินได้ผ่านแอป Mobile Banking จองขั้นต่ำ 1 โทเคน (10 บาท) นักลงทุนรายย่อยสามารถจองซื้อได้ไม่เกิน 300,000 บาท นักลงทุนรายใหญ่พิเศษ นักลงทุนสถาบัน นิติบุคคลร่วมลงทุน กิจการเงินร่วมทุน ไม่จำกัดมูลค่าจองซื้อ เปิดจองซื้อวันนี้ถึง 4 ตุลาคมนี้ เวลา 15.30 น. หรือเมื่อถูกจองจนหมด 240 ล้านโทเคน</p>\n<p>อ่านรายละเอียดเพิ่มเติม วิธีการจองซื้อ และข้อกำหนดต่างๆ ได้ที่เว็บไซต์ของ <a href=\"https://www.xspringdigital.com/th/project/sirihub\">XSpring</a> ดาวน์โหลดหนังสือชี้ชวนซื้อโทเคนดิจิทัลได้ที่<a href=\"https://market.sec.or.th/public/ipos/IPOSTD01.aspx?TransID=319985\">หน้าเว็บไซต์ของ ก.ล.ต.</a></p>\n<p>ที่มา - จดหมายประชาสัมพันธ์, <a href=\"https://www.xspringdigital.com/th/project/sirihub\">XSpring</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ico\">ICO</a></div><div><a href=\"/topics/xspring\">XSpring</a></div><div><a href=\"/topics/sansiri\">Sansiri</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c58fd3a2997dd2517cc6789364dfbcfe02c7b50b1a122a33a952f9ebd08f8925","category":"Thai"}