{"title":"Atomic Structure and Binding of Carbon Atoms","link":"https://www.preprints.org/manuscript/201801.0036/v9","date":1558074983000,"content":"Many studies discuss carbon-based materials because of the versatility of its element. They include different opinions for scientific problems and discuss fairly at convincing and compelling levels within the scope and application. A gas-state carbon atom converts into various states depending on its conditions of processing. The electron transfer mechanism in the gas-state carbon atom is responsible to convert it into various states, namely, graphite, nanotube, fullerene, diamond, lonsdaleite and graphene. The shape of ‘energy trajectory’ enables transferring electrons from the left- and right-sides of an atom is like a parabola. That ‘energy trajectory’ is linked to states (filled state and suitable nearby unfilled state) where force-exertion along the poles of transferring electrons is remained balance. So, the mechanism of originating different states of a gas-state carbon atom is under the involvement of energy first. This is not the case for atoms executing confined inter-state electron-dynamics as the force is involved first. Graphite-, nanotube- and fullerene-state atoms ‘partially evolve partially develop’ (form) their structures. These possess one-dimensional, two-dimensional and four-dimensional ordering of atoms, respectively. Their structural formation also comprises ‘energy curve’ having a shape-like parabola. Transferring suitable filled state electron to suitable nearby unfilled state is under a balance force exerting along the poles. The graphite structure under only attained-dynamics of atoms can also be formed but in two-dimension. Here, binding energy between graphite-state carbon atoms is for a small difference of exerting forces along their opposite poles. Structural formation in diamond, lonsdaleite and graphene atoms involve energy to gain required infinitesimal displacements of electrons through which they maintain orientationally-controlled exerting forces along dedicated poles. In this study, the growth of diamond is found to be south to east-west (ground) where atoms bound ground to south. Thus, diamond atoms merge for a tetra-electron ground to south topological structure. Lonsdaleite atoms merge for a bi-electron ground to just-south topological structure. The growth of graphene is found to be north to ground where atoms bound ground to north. Thus, graphene atoms merge for a tetra-electron ground to north topological structure. Glassy carbon exhibits layered-topological structure where, tri-layers of gas-, graphite- and lonsdaleite-state atoms successively bind in repetitive order. Nanoscale hardness is also sketched based on different force-energy behaviors of different state carbon atoms. Here, structure evolution in each carbon state atom explores its own science.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c59165c70ccfabcb94a563f1e3c45d31f4853b1328326b113d66869f9ddca2f1","category":"Interdisciplinary"}