{"title":"อินเดียอาจออกข้อบังคับใหม่ สมาร์ทโฟนต้องลบแอป Pre-installed ได้ทั้งหมด ป้องกันการสอดแนม","link":"https://www.blognone.com/node/133003","date":1678801556000,"content":"<div><div><div><p>สำนักข่าว Reuters อ้างแหล่งข่าวและเอกสารที่ตรวจสอบพบ เผยว่าทางการอินเดียมีแผนออกข้อบังคับ มีกับผู้ผลิตสมาร์ทโฟนที่ขายในประเทศ โดยต้องอนุญาตให้ผู้ใช้งานลบแอปพื้นฐานที่ติดตั้งมาได้ทุกแอป รวมทั้งระบบปฎิบัติการรุ่นใหม่ที่ออกอัพเดต ต้องผ่านการตรวจสอบความปลอดภัยจากทางการก่อน</p>\n<p>รายงานบอกว่าเหตุผลที่ทางการอินเดียเตรียมออกข้อบังคับใหม่นี้ เพื่อป้องกันการสอดแนมข้อมูลผู้ใช้งาน ซึ่งมองว่าเป็นความมั่นคงระดับชาติ ทั้งนี้ในช่วงหลายปีที่ผ่านมา อินเดียได้สั่ง<a href=\"https://www.blognone.com/node/117207\">แบน</a>แอป<a href=\"https://www.blognone.com/node/117669\">จากจีน</a>เป็น<a href=\"https://www.blognone.com/node/118252\">จำนวน</a>มาก โดย<a href=\"https://www.blognone.com/node/120812\">ให้เหตุผล</a>เรื่องความมั่นคง</p>\n<p>ข้อกำหนดเรื่องการอนุญาตให้ลบแอปพื้นฐานได้ ย่อมกระทบกับผู้ผลิตหลายรายที่นิยมลงแอป pre-installed มาให้ก่อน เช่น Xiaomi, ซัมซุง และแอปเปิล ซึ่งในรายของแอปเปิลนั้น แอปบางตัวสามารถซ่อนแต่ไม่สามารถลบได้</p>\n<p>ส่วนข้อกำหนดเรื่องการตรวจสอบระบบปฏิบัติการนั้น รายละเอียดเบื้องต้นจะมีหน่วยงานตัวแทนของรัฐบาลในการตรวจสอบ เมื่อมีการออกอัพเดตใหญ่แต่ละครั้ง ทั้งด้านความเป็นส่วนตัวและความปลอดภัยของข้อมูลในการใช้งาน</p>\n<p>ปัจจุบันส่วนแบ่งการตลาดสมาร์ทโฟนในอินเดีย มี Xiaomi, vivo และ OPPO ครองส่วนแบ่งรวมกันมากกว่าครึ่งหนึ่ง ซัมซุงมีส่วนแบ่ง 20% และแอปเปิล 3%</p>\n<p>ที่มา: <a href=\"https://www.reuters.com/technology/india-plans-new-security-testing-smartphones-crackdown-pre-installed-apps-2023-03-14/\">Reuters</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/898193a0b7c6660973d7e73e249147e6.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/india\">India</a></div><div><a href=\"/topics/smartphone\">Smartphone</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c59f3dd6c6a168534cd9b7529450dd5603afa999456a4d1caa90a3509b9531f4","category":"Thai"}