{"title":"10 products I loved in 2021: Dave Rome","link":"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-dave-rome/","date":1637542968000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Most-Loved-2021-Dave-Rome-collage-650x366.jpg\" /></div><h2>10 products I loved in 2021: Dave Rome</h2><p>\n</p><p>How the heck am I writing one of these again? Where did the year go? </p>\n\n\n\n<p>With just a small handful of adventures away from home, the past year has seen my riding return to exploring local suburbs for hidden trail treasures. Knobby tyres very obviously took preference over slicks, and baggy shorts over lycra. A three-month lockdown that only recently ended saw riding become my prominent form of social escape, and with that, social activities such as afternoon drinks were merged with bikes. </p>\n\n\n\n<p>Off the bike I found myself spinning wrenches even more than usual. I’ve really had to restrain myself with the number of tools included in this round-up.</p>\n\n\n\n<p>Below is a list of products that have left the biggest impression on me over the past year (or beyond). And just like in previous editions of our “10 products” series, the items covered here are those that I see myself recommending and using for years to come. </p>\n\n\n\n<hr />\n\n\n\n<h2>Cervelo Aspero 5 </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cervelo-Aspero-5-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n\n\n\n<p>Gravel riding is a broad spectrum, but I’m happiest with a mix of local exploration, under-biking fun, and go-fast thrills. Overnight trips or credit card touring is the closest I’ll get to bikepacking, and there’s a fine line between <a href=\"https://cyclingtips.com/2018/02/jra-angry-asian-fun-isnt-four-letter-word/\" target=\"_blank\">type-two fun</a> on a gravel bike versus simply grabbing a hardtail for type-one fun. Basically, I prefer gravel bikes that persuade me to go fast, rather than go everywhere.</p>\n\n\n\n<p>To me, the Cervelo Aspero is a brilliant example of a gravel bike that fits my personal desires for the genre. It’s hella fast on smoother off-road terrain, reacts brilliantly to input, and makes you feel like a local legend even if you’ve only ridden that segment once that month. It’s exactly why after my <a href=\"https://cyclingtips.com/2021/04/cervelo-aspero-5-gravel-bike-review/\" target=\"_blank\">review of the Aspero 5</a> I cheekily held onto it for a few more months of riding (and as a testbed for various other products).</p>\n\n\n\n<p>More importantly, a bike like the Cervelo Aspero fitted with a 2x drivetrain and slick tyres comes dangerously close to making me think there’s no need for a pure road bike in my stable (at least while my road racing license is expired). Don’t worry, I ignored such a thought. </p>\n\n\n\n<p>Of course, there are things I don’t love about this bike, and those are covered in my review. But overall, Cervelo has done a brilliant job of creating a capable gravel bike that’s also really great once dressed up as a roadie. There’s no such thing as the perfect quiver-killer, but this thing comes wonderfully close to being such a unicorn. </p>\n\n\n\n<p><strong>Price:</strong> Varies. A higher-end version as tested is US$7,100 / £8,699 / AU$10,500.<br /><strong>More information:</strong> <a href=\"https://www.cervelo.com/en/aspero-5\" target=\"_blank\">Cervelo.com</a> </p>\n\n\n\n<h2>Nepros 1/4″ ratchets and ratchet spinners</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Nepros-ratchet-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n\n\n\n<p>There are many different tool types capable of turning a hex bolt, and a mechanic’s choice is as personal as saddle selection. Personally, I like to have a mixture of regular L-shaped hex keys, P-handles (or sliding T-handles), straight screwdrivers, and bit-ratchets – each offering unique benefits for certain tasks. However, over the past year, I’ve found myself most often reaching for compact ratchets fitted with bit sockets. </p>\n\n\n\n<p>My go-to has become the Nepros 1/4″ ratchets, the premium range from Japanese tool company KTC. These professional-level ratchets don’t just offer chromed perfection, they feature a compact head, a fast-engaging 90T ratchet, and a buttery smooth/light action. Combine this with the company’s own ratchet spinner that allows you to use your fingers to spin loosened fasteners and you have a tool that saves real time and reduces hand fatigue. </p>\n\n\n\n<p>For 1/4″ bit sockets, I use a mixture of PB Swiss and Nepros. And I love these ratchets so much I have three of them, set with 4 mm hex, 5 mm hex, and T25 bit respectively. </p>\n\n\n\n<p>I know this is a very expensive way to work on bikes and I’m not for a second suggesting you need to follow me. But if you prize nice tools then you’ll surely appreciate this recommendation. </p>\n\n\n\n<p><strong>Price: </strong>US$59-US$71 (depending on ratchet length). Socket bits and ratchet spinner are extra.<br /><strong>More information: </strong><a href=\"https://www.nepros.net\" target=\"_blank\">Nepros.net</a></p>\n\n\n\n<h2>CeramicSpeed UFO drip chain lube </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/CeramicSpeed-UFO-Drip-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n\n\n\n<p>This is the third chain lube I’ve suggested over the years of doing these Most Loved features. In <a href=\"https://cyclingtips.com/2017/11/ten-products-loved-2017-david-rome/\" target=\"_blank\">2017 I raved about Smoove</a>, a wax emulsion lube that to this day I still recommend as one of the best value wax lubes on the market. </p>\n\n\n\n<p>Molten Speed Wax, a <a href=\"https://cyclingtips.com/2020/08/how-to-wax-a-chain-an-endless-faq/\" target=\"_blank\">hot melt chain wax</a>, was on <a href=\"https://cyclingtips.com/2018/11/ten-products-i-loved-in-2018-david-rome/\" target=\"_blank\">my list in 2018</a>, and it remains a product I use with many of my personal bikes, especially those kept for fair weather use. </p>\n\n\n\n<p>And now <a href=\"https://cyclingtips.com/2020/11/ceramicspeeds-new-ufo-drip-lube-is-slicker-longer-lasting-and-far-cheaper/\" target=\"_blank\">CeramicSpeed’s UFO Drip</a>, the second generation of this lube, has made my list. I know this stuff is expensive, but I’m in awe of how well this drip lube manages to replicate the silky smoothness and impressive cleanliness of a hot wax product. And that cleanliness means little dirt is attracted into the drivetrain and severe wear is kept at bay. </p>\n\n\n\n<p>I use this lube on my own mountain bike knowing that it’ll keep things perfectly clean and that I can easily re-apply it without opening and subsequently weakening the 12-speed quick link. It’s perhaps not ideal for those regularly riding in adverse conditions, but I’ve been truly impressed by how it handles the often dry, sandy trails, and ‘gravel’ roads surrounding Sydney. Hot-melt wax still has its benefits, but this is a great option for those unwilling to go that path. It’s also superb as a <a href=\"https://cyclingtips.com/2020/08/how-to-wax-a-chain-an-endless-faq/\" target=\"_blank\">top-up lube for hot melt</a> users. </p>\n\n\n\n<p><strong>Price:</strong> US$45 / AU$50 / £37<br /><strong>More information:</strong> <a href=\"https://www.ceramicspeed.com/en/cycling/shop/ufo-products/ufo-drip---new-formula-\" target=\"_blank\">ceramicspeed.com</a></p>\n\n\n\n<h2>MicroShift Advent X and Advent shifting components </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Microshift-Advent-X-Most-Loved-2021-Dave-Rome-1-4-1340x754.jpg\" /></figure>\n\n\n\n<p>From a $45 bottle of chain lube to a handful of drivetrain components that don’t cost much more. MicroShift is absolutely killing it in the low-cost-shifting-parts space, and I’ve been equally impressed with the nine-speed Advent group and the slightly newer (and more expensive) 10-speed Advent X. </p>\n\n\n\n<p>In 1x configurations, both of these groups offer a wide-range cassette, rear derailleurs with an adjustable and serviceable clutch, and a choice of MTB or drop bar shifter (mechanical brake lever). </p>\n\n\n\n<p>As my <a href=\"https://cyclingtips.com/2021/08/microshift-advent-x-gravel-bike-10-speed-groupset-review/\" target=\"_blank\">review of Advent X</a> covered, I didn’t fall in love with the ergonomics of the drop bar shifters, but many others have told me they’re happy with the shape. Meanwhile, the bearing-equipped ‘Pro’ version of the mountain bike shifter leaves me with little to complain about. Both Advent and Advent X have become my go-to recommendation for people looking to update older mountain bikes to 1x shifting without breaking the piggy bank. </p>\n\n\n\n<p>Most importantly, Microshift’s combination of features, function, and price are seeing the brand slowly gain OE (Original Equipment) presence, and such budget-friendly competition against the duopoly that is the two Big S’s is absolutely a good thing for consumers. </p>\n\n\n\n<p><strong>Price:</strong> Varies based on parts needed, but even the most premium option is below US$290 for the rear derailleur, drop bar shifter set and cassette. <br /><strong>More information: </strong><a href=\"https://www.microshift.com/products/groups/advent-x/\" target=\"_blank\">Microshift.com </a></p>\n\n\n\n<h2>CushCore Gravel.CX tyre inserts</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cushcore-gravel-tyre-inserts-Most-Loved-2021-Dave-Rome-2-1340x754.jpg\" /></figure>\n\n\n\n<p>Tyre inserts have singlehandedly shifted my perspective of the capability of gravel bikes. I know – big call. </p>\n\n\n\n<p>The vast majority of my local ‘gravel’ riding is done by linking up segments of road with fire access trails. These trails are often steep, rough, and filled with loose rock. I like the speed of a 40-45 mm gravel tyre on the road, but it can be near impossible to find a tyre pressure that’s comfortable and controlled off-road without becoming so soft that I’m at risk of pinching a tyre and ruining a rim. And that’s where tyre inserts, and more specifically Cushcore, changed the game for me. </p>\n\n\n\n<p>These moulded closed foam inserts have allowed me to safely drop some 5 psi (or more) from my tyres without ever worrying that the rim sidewall is going to suffer. Meanwhile, the additional support on the sidewall keeps the tyre secure. And the result is an amazingly more comfortable, controlled, and traction-filled ride beyond what I ever thought possible with a medium-width gravel tyre. I used to roll into rock-filled descents with a level of caution for my wheels, but Cushcore has all but removed that hesitancy. </p>\n\n\n\n<p>There are of course trade-offs to stuffing a large foam noodle in your tyres. Cushcore adds about 125 g per wheel. It’s fairly expensive. The way it supports the sidewall is likely to add a watt or two to your rolling resistance figures. And it’s not for those who think regular tubeless tyres are already difficult to install. Still, the positives of transforming the off-road capability of a gravel bike have me sold. </p>\n\n\n\n<p><strong>Price:</strong> US$149 / AU$200 / £160 (for a pair, inc valves)<br /><strong>More information:</strong> <a href=\"https://www.cushcore.com/gravel-cx-products/\" target=\"_blank\">Cushcore.com </a></p>\n\n\n\n<h2>EVT 3-in-1 tyre inflator </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/EVT-3-in-1-Most-Loved-2021-Dave-Rome-1-2-1340x754.jpg\" /></figure>\n\n\n\n<p>I get a heap of use from my <a href=\"https://cyclingtips.com/2021/07/a-guide-to-air-compressors-for-bicycles/\" target=\"_blank\">air compressor</a> every time I’m in my workshop, and it’s almost comical how rarely I use floor pumps. For years I made do with a home-hacked tyre inflator for use with my air compressor, but after falling in love with the seal head on EVT’s Bleedin’ tyre gauge, I was persuaded to try one of the brand’s tyre inflators. </p>\n\n\n\n<p>The EVT 3-in-1 inflator looks like it was pieced together in a hardware store from the 1940s. The gauge isn’t protected from being dropped. And wow, is it expensive! But despite all that, this is simply <a href=\"https://cyclingtips.com/2021/07/review-the-best-bicycle-tyre-inflators-to-use-with-an-air-compressor/\" target=\"_blank\">the best tyre inflator </a>(for use with an <a href=\"https://cyclingtips.com/2021/07/a-guide-to-air-compressors-for-bicycles/\" target=\"_blank\">air compressor</a>) I’ve ever laid my hands on. It’s the mix of unimpeded airflow and the slip-fit interface with a Presta valve that have earned it a spot on this list. If EVT ever offers its Presta pump heads as a separate part for fitting to other brands of pumps then you can be sure I’ll be buying more than one of them. </p>\n\n\n\n<p>Certainly, you can file this one under the same category as the Nepros ratchets. It’s really best for those that enjoy working working on bikes with the best tools regardless of the cost (or those that get paid to).</p>\n\n\n\n<p><strong>Price:</strong> US$169 / AU$299 / £TBC<br /><strong>More information:</strong> <a href=\"https://www.efficientvelo.com/tools/3-in-1-inflator\" target=\"_blank\">efficientvelo.com </a></p>\n\n\n\n<h2>Roval Terra CL gravel wheels </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Roval-Terra-CL-gravel-wheels-Most-Loved-2021-Dave-Rome-2-1340x754.jpg\" /></figure>\n\n\n\n<p>We’re now absolutely reaching the point where top-performing wheels can be had at fair prices. There are many examples of such things, but the likes of <a href=\"https://cyclingtips.com/2021/02/scribe-aero-wide-42-disc-brake-road-wheelset-review/\" target=\"_blank\">Scribe’s Aero Wide+ 42 road wheels</a> and <a href=\"https://cyclingtips.com/2021/05/roval-expands-terra-gravel-range-with-affordable-cl-and-c-carbon-wheels/\" target=\"_blank\">Roval’s new Terra CL</a> all-road/gravel wheels are solid proof of my point. </p>\n\n\n\n<p>These mid-level Roval wheels feature the same 25 mm internal width and hooked carbon rims as the company’s US$2,500 flagship model. There’s even a generous warranty which covers being silly. The US$1,100-lower asking price of the CLs is simply the result of cheaper double-butted spokes and DT Swiss 350 hubs. And there’s absolutely nothing off-putting about the well-proven, highly durable, and easily adaptable DT Swiss 350 hubs.  </p>\n\n\n\n<p>I’m overdue to write my review of these versatile all-road/gravel wheels and frankly, it’s going to be a bit of a boring one. Other than the provided tubeless valves which I found to be a little leaky, and the lairy white hub decals, I’m truly struggling to fault these 1,410 g hoops (including tubeless tape and valves). </p>\n\n\n\n<p>Short of picking a wheel that uses a higher-end spoke or a pretty coloured hub, I’m struggling to see what real benefit there is in spending more. </p>\n\n\n\n<p><strong>Price:</strong> US$1,400 / AU$2,600 / £1,400<br /><strong>More information:</strong> <a href=\"https://rovalcomponents.com/products/terra-cl\" target=\"_blank\">rovalcomponents.com</a></p>\n\n\n\n<h2>Coast A9R inspection torch </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Coast-A9R-penlight-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n\n\n\n<p>Having gone through a degenerative eye condition a decade ago I’m left with less-than-awesome eyesight. And while I’ve always found torches helpful with bike repairs, it’s only recently that I’ve started to use them super frequently. </p>\n\n\n\n<p>From helping to inspect the wear on disc brake pads, to guiding internal cables, to aligning disc brake calipers or truing rotors, to reading tiny bearing numbers – a small inspection torch has become an invaluable tool in my toolbox. </p>\n\n\n\n<p>There are countless great torches on the market, and realistically anything will work here. However it’s the narrowly focussed beam and slim pen-like profile of the Coast A9R that I like so much I’ve now bought two of them. </p>\n\n\n\n<p>This USB-rechargeable torch isn’t the cheapest or toughest thing, but its slim profile has proven perfect for shining a light into tight spots of a frame where other torches won’t go. If you’ve ever needed to see past a cable port or down a seat tube then this torch is sure to shine a light on what you’ve been missing.</p>\n\n\n\n<p><strong>Price:</strong> US$50 / AU$75 / £45<br /><strong>More information:</strong> <a href=\"https://coastportland.com/products/a9r\" target=\"_blank\">coastportland.com</a> </p>\n\n\n\n<h2>OneUp EDC mulitool &amp; Backcountry Research Mutherload strap</h2>\n\n\n\n<div>\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/OneUp-EDC-tool-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n</div>\n\n\n\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Backcountry-research-strap-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n</div>\n</div>\n\n\n\n<p>OK, this is actually two products, but my use of them goes hand in hand. And that is to hold all my spares and tools securely and rattle-free on a mountain bike without resorting to adding weight to the saddle or buying a bike with one of those fun hidden down tube hatches. </p>\n\n\n\n<p>The OneUp EDC is one of the original steerer-based multi tools and remains one of the best options. I use the one that requires you to thread the inside of your aluminium steerer tube, but after that you’re left with a wonderfully light and simple system that holds a capable and easily accessed tool. </p>\n\n\n\n<p>Meanwhile, the Backcountry Research Mutherload strap is another product that helped to launch a whole category of competitors. I use the 1.5″ wide Magnum version of this strap to securely hold a Tublito tube, a <a href=\"https://cyclingtips.com/2021/03/spotlight-dynaplug-racer-pro-review/\" target=\"_blank\">Dynaplug Racer Pro tubeless plug tool</a>, and a CO2 canister with a Blackburn head. </p>\n\n\n\n<p>I permanently leave these spares on my bike, and going out for a quick mountain bike spin is as simple as grabbing a water bottle, checking my tyre pressures and then rolling out the door. </p>\n\n\n\n<p>For truly epic rides I’d swap out the CO2 for OneUp’s great EDC mini pump (which made my <a href=\"https://cyclingtips.com/2019/11/ten-products-i-loved-in-2019-dave-rome/\" target=\"_blank\">Most Loved list in 2019</a>). That pump can also host the EDC multi-tool in case you don’t want to (or can’t) fill the wasted space in your fork steerer. </p>\n\n\n\n<p><strong>Price (OneUp EDC):</strong> US$60 (tool only), US$25 (threaded top cap carrier), US$35 (workshop steerer threading tool, ideally find a shop or friend for this one). <br /><strong>More information:</strong> <a href=\"https://www.oneupcomponents.com/collections/edc\" target=\"_blank\">oneupcomponents.com</a></p>\n\n\n\n<p><strong>Price (Backcountry Research Mutherload Magnum strap):</strong> US$24 / AU$46 / £20<br /><strong>More information:</strong> <a href=\"https://backcountryresearch.com/mutherload-frame-mount-strap.html\" target=\"_blank\">Backcountryresearch.com</a></p>\n\n\n\n<h2>Prusa Mini+ 3D printer </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Prusa-Mini-3D-printer-Most-Loved-2021-Dave-Rome-1-1340x754.jpg\" /></figure>\n\n\n\n<p>Lucky last is a 3D printer. I’d wanted a 3D printer for years but it wasn’t until the combination of Sydney being stuck in a lenthy lockdown, and perhaps a few too many Negronis, that I finally gave in to the itch. </p>\n\n\n\n<p>My research journey wasn’t a long one, and just prior to ordering the hugely popular Creality Ender 3 I was persuaded by numerous experienced makers to spend more and get a printer that lets the printing be the project, rather than the printer itself. </p>\n\n\n\n<p>I quickly realised a Prusa would provide the near plug-and-play printing that I sought and within a few hours of receiving it I was printing useable objects. </p>\n\n\n\n<p>It’s still early days for my indoctrination into the world of additive manufacturing, but so far I’m loving how it has opened my eyes to creating small products. In the past I would begrudgingly pay $20 or more to have a tiny esoteric plastic part wastefully shipped my way, whereas now I can let my little orange machine build one up. </p>\n\n\n\n<p>From hard-to-find light brackets, to specialist tools, to little widgets for the bike, to custom tool holders (because I’m a nerd), the possibilities are proving endless, and the learning experience is quickly becoming a hobby in and of itself. Shout-out to VeloClub member Chris Heerschap<a href=\"https://www.thingiverse.com/cmh\"> </a>for helping get me dialled in and for creating plenty of <a href=\"https://www.thingiverse.com/cmh/designs\" target=\"_blank\">useful cycling-related print-for-free downloads</a>.  </p>\n\n\n\n<p><strong>Price:</strong> US$399 (postage and filament are extra)<br /><strong>More information:</strong> <a href=\"https://www.prusa3d.com/product/original-prusa-mini-4/\" target=\"_blank\">prusa3d.com</a> </p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Stay tuned for more ‘Ten Products I loved in 2021’ articles from other members of the CyclingTips team. In the meantime you can catch up on all of <a href=\"https://cyclingtips.com/tag/most-loved-2020/\" target=\"_blank\">last year’s picks</a>. Or go back further into the archives for our round-ups from <a href=\"https://cyclingtips.com/tag/most-loved-2019/\" target=\"_blank\">2019</a>, <a href=\"https://cyclingtips.com/tag/most-loved-2018/\" target=\"_blank\">2018</a>, and <a href=\"https://cyclingtips.com/tag/most-loved-2017/\" target=\"_blank\">2017</a>.</em></p>\n\n\n\n    </div>\n    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-dave-rome/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c5a3f20264d3006ab537359eabea8fbc842c72f646d1a90abf49c68dac736a28","category":"Cycling"}