{"title":"Sucrose, NaCl, and citric acid suppress the metallic sensation of FeSO4","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjad052/7499351?rss=1","date":1703548800000,"content":"<span><div>Abstract</div>Metallic sensation is often described as unpleasant and can reduce acceptance of foods and beverages and compliance with medication. Masking and suppressing aversive sensations can help to improve acceptance of these products, with many successful strategies identified for bitterness. However, there are few studies investigating effective strategies for suppressing metallic sensation. This study aims to assess the effectiveness of mixture suppression to reduce the metallic sensation elicited from ferrous sulfate and examine whether individual differences in metallic sensation are associated with the effectiveness of suppression strategies. To achieve this, participants (<span>n</span> = 121) reported the intensity of suprathreshold concentrations of ferrous sulfate alone and in binary mixtures with three tastants, specifically, sucrose, citric acid, and sodium chloride. The results revealed that metallic sensation ratings were significantly lower for every binary mixture tested compared to ferrous sulfate presented in isolation. For 0.3 mM ferrous sulfate, sucrose was identified to be the most effective compound in suppressing metallic sensation, followed by citric acid and sodium chloride. For the 1.0 mM ferrous sulfate solutions, all tastants were equally effective at suppressing metallic sensation. In addition, there is a significant interaction between the perceived metallic intensity and the effectiveness of each strategy. These findings suggest that sucrose, citric acid, and sodium chloride have the potential to be effective in suppressing metallic sensation.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"c5a5c61a68df63d6b080b7aefe75980cdcc8a17846bbb456c63e16828dd3d64e","category":"Environment"}