{"title":"Topography influences diurnal and seasonal microclimate fluctuations in hilly terrain environments of coastal California","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300378","date":1711720800000,"content":"<p>by Aji John, Julian D. Olden, Meagan F. Oldfather, Matthew M. Kling, David D. Ackerly</p>\r\n\r\nUnderstanding the topographic basis for microclimatic variation remains fundamental to predicting the site level effects of warming air temperatures. Quantifying diurnal fluctuation and seasonal extremes in relation to topography offers insight into the potential relationship between site level conditions and changes in regional climate. The present study investigated an annual understory temperature regime for 50 sites distributed across a topographically diverse area (&gt;12 km<sup>2</sup>) comprised of mixed evergreen-deciduous woodland vegetation typical of California coastal ranges. We investigated the effect of topography and tree cover on site-to-site variation in near-surface temperatures using a combination of multiple linear regression and multivariate techniques. Sites in topographically depressed areas (e.g., valley bottoms) exhibited larger seasonal and diurnal variation. Elevation (at 10 m resolution) was found to be the primary driver of daily and seasonal variations, in addition to hillslope position, canopy cover and northness. The elevation effect on seasonal mean temperatures was inverted, reflecting large-scale cold-air pooling in the study region, with elevated minimum and mean temperature at higher elevations. Additionally, several of our sites showed considerable buffering (dampened diurnal and seasonal temperature fluctuations) compared to average regional conditions measured at an on-site weather station. Results from this study help inform efforts to extrapolate temperature records across large landscapes and have the potential to improve our ecological understanding of fine-scale seasonal climate variation in coastal range environments.","author":"Aji John","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c5a68f8b5e1d11d5fc7c7115c53e792175e01ee9e0295fe7e8c5f7a2feaa0bfa","category":"Interdisciplinary"}