{"title":"Experimental Study on the Importance of Interference in the Spreading Factor and Effects of Collisions for the LoRaWAN Radio Interface","link":"https://www.preprints.org/manuscript/202406.0538/v1","date":1718088065000,"content":"The number of physical devices connected to the Internet such as vehicles, household appliances and other \"things\" has been steadily increasing in recent years, thus forming the basis for the Internet of Things (IoT). IoT ecosystem extends beyond country borders and application domains, combining thousands of versatile devices that differ in terms of their structures, capabilities, and available resources. It is therefore not surprising that the landscape of wireless communication technologies and the degree of IoT devices available today is excessively broad and diverse. Interference between networks leads to frame collisions and consequent packet loss. Frame collisions occur when two or more packets overlap in time and frequency and use the same LoRa parameters, i.e. the same spreading factor (SF), bandwidth (BW) and carrier frequency (CF). When most devices use the same configuration, collision probability is higher. The probability of frame collisions is also affected by traffic characteristics, particularly the periodicity of the transmission and the payload size. Larger payload sizes and more frequent transmissions accumulate with higher time on air (ToA) and channel occupancy [1]. Transmission powers and the location of the gateways also influences this situation. The aim of this experimental work is to verify the effects of collisions and interference in LoRaWAN, regarding the periodicity of transmissions and the payload sizes. The hardware used is an Arduino board programmed in C/C++, a LoRa Bee module operating at a frequency of 868 MHz and a LoRaWAN LG02 gateway. Different scenarios were tested in an outdoor environment, with Line of Sight and Non-Line of Sight, and different variables such as: SFs equal to 7, 9 and 12; distances of 20, 40 and 60 meters and different data sizes of 14, 32 and 51 bytes, over the same channel. The packets with different SF’s and different data sizes were transmitted in a (pseudo) random way, one after the other, overlapping different SFs in the same channel and testing this way (theoretical) orthogonality among them. By fixing the bandwidth in 125 kHz, and testing different SFs we intend to increase the probability of cause packet loss by applying to our connection a combination of emitted power/short distance that leaves an interference power received, strong enough [2] for the effect. We validate our conclusions by analyzing ToA according with RSSI and different data sizes, the RSSI for different SFs and different data sizes and finally the packet loss through the PDR-Packet Delivery Ratio for a better understanding of the reliability of packet transmission in our link.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c5a8cbb308a69dbf9e6f22ec02266630b9805a17d616f19177b1440a4a50c919","category":"Interdisciplinary"}