{"title":"How to find quiet cycling routes near you","link":"https://www.bikeradar.com/features/routes-and-rides/how-to-find-quiet-cycling-routes/","date":1680537600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/BikeRadar-Rides-Central-Perk-08-7694787.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"BikeRadar Rides | Central Perk - two cyclists riding through countryside\" title=\"BikeRadar Rides | Central Perk - 08\" />                                            <p>If you want to find a quiet cycling route, there are a number of resources available to help you explore away from the hum of traffic.</p>\n<p>From maps to apps, finding and following a route doesn’t have to be intimidating, regardless of whether you’re following a signposted route or putting together your own ride.</p>\n<p>The latest <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">cycling apps</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">GPS bike computers</a> mean you can also have a route at your fingertips, with turn-by-turn navigation to make sure you stay on track.</p>\n<p>Here are our favourite resources for planning quiet cycling routes.</p>\n<h2>Use an app</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Features, including Komoot’s Trail View, enable increasingly granular route planning.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>There are many apps that offer routing functionality designed specifically for cyclists.</p>\n<p>In the UK, the OS Maps app also enables you to find both on- and off-road cycling routes with filtering options for length and difficulty.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/guide-to-using-komoot/\">Komoot</a> Highlights recommend sections of road or trails, as well as local highlights as selected by the app’s users and ambassadors. These are usually illustrated with a short description and photos. <a href=\"https://www.bikeradar.com/news/ride-with-gps-popularity-routing/\">Ride with GPS</a> and Strava offer similar functionality.</p>\n<p>Another way to find quiet routes to ride is to look at where other people have ridden. Most cyclists aren’t looking to ride along busy roads, so if you know where most people are riding, chances are it’s a quiet, more enjoyable route.</p>\n<p>Fortunately, you can access this information from heatmaps, which show traces of routes cyclists have used most frequently.</p>\n<p>There are a few sources of these: lots of cyclists use <a href=\"https://www.bikeradar.com/advice/buyers-guides/garmin-edge-bike-computers-buyers-guide-to-all-the-models/\">Garmin bike computers</a> and Garmin gives you heatmaps on its Connect app. Strava does the same, although you’ll need to pay for a Strava subscription to access its <a href=\"https://www.bikeradar.com/news/strava-global-heatmap-3d-terrain/\">heatmaps</a>.</p>\n<h2>Explore the National Cycling Network</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The National Cycle Network contains many gems, such as the West Kernow Way.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>Another really useful resource, if you’re looking for quiet routes, is Sustrans.</p>\n<p>The organisation is responsible for the UK’s <a href=\"https://www.sustrans.org.uk/national-cycle-network/\" target=\"_blank\">National Cycle Network</a> (NCN), which includes a huge number of traffic-free cycle routes that criss-cross the country and range from short stretches to really long adventures. They’re also all well signposted.</p>\n<p>Many NCN routes are traffic-free, and we rate some of these as among the <a href=\"https://www.bikeradar.com/features/routes-and-rides/uk-cycling-highlights-komoot-collection/\">best cycling routes in the UK</a>. Check out our guide to <a href=\"https://www.bikeradar.com/features/routes-and-rides/best-family-cycling-routes-uk/\">the best family-friendly cycling routes</a> for more information.</p>\n<p>Sustrans sells paper versions of many NCN routes on its website. While carrying a physical map in case of GPS failure is prudent when <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-touring-bike-how-to-choose-the-right-one-for-you/\">touring</a> or <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking/\">bikepacking</a>, an NCN overlay is also available in the OS Maps and Komoot apps.</p>\n<p>Openstreetmap, which provides open-source mapping information for apps including Komoot and Ride with GPS, also includes NCN mapping.</p>\n<h2>Use a map</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Paper maps remain popular, but many apps offer the same detail in a digital format.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>Studying a good old-fashioned map is a great way to find quiet cycling routes.</p>\n<p>Ordnance Survey (OS) maps are the most popular and cover the whole of the UK. They offer lots of details about geography, points of interest, roads and bridlepaths.</p>\n<p>OS Maps are available as traditional paper maps or via the subscription-based OS Maps app. This subscription includes every scale of map available, with coverage across the whole of the UK as standard.</p>\n<p>OS Explorer series mapping uses a 1:25,000 scale, where 4cm on the map is equivalent to 1km. Landranger series mapping is produced at a 1:50,000 scale, covering a wider area, with 2cm on the map showing 1km.</p>\n<p>Larger-scale maps can also be used for cycling, but smaller roads may be dropped to maintain clarity.</p>\n<p>On OS mapping, main roads are marked in red or green, and motorways in blue, while B-roads are brown and minor roads are yellow.</p>\n<p>If you’re looking to put together a quiet road-cycling route, link together yellow roads, because these are likely to have the least traffic. The route might be a bit longer than following main roads, but it will be far nicer and there’ll almost certainly be more to see.</p>\n<p>Alternatively, dedicated cycling route maps, such as those from Goldeneye Guides, spare you the effort of plotting a route yourself.</p>\n<h2>Finding off-road routes with a map</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cycling is permitted along bridleways, byways and routes marked with green circles, as above.</span></figcaption><span> <i>OS Maps</i></span></div>\n<p>If you’re in England or Wales, also look out for bridleways. These will be shown on OS mapping as longer green dashes. Short green dashes show footpaths, which aren’t open to cyclists.</p>\n<p>You can also cycle on byways and restricted byways, which are marked by long dashes with cross-bars on them. Lines of green circles denote cycle routes.</p>\n<p>Access laws in Scotland mean you can access pretty much any off-road path.</p>\n<p>Cyclists are only permitted on carriageways in Northern Ireland, and are explicitly forbidden from riding on bridleways.</p>\n<h2>Buy a book</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Authors have done the route-planning work for you.</span></figcaption><span> <i>Jack Thurston / Lost Lanes</i></span></div>\n<p>Some of BikeRadar’s favourite <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-books/\">cycling books</a> compile routes that combine stunning views with low-traffic roads. Thanks to the author’s research, you can copy their loop entirely or ride a section of it as part of a shorter or longer ride. They’ll usually indicate a ride’s difficulty and the terrain it includes, enabling you to pick one that suits your ability and bike.</p>\n<p>Often, the writers consider logistics too, suggesting how to get to the start by public transport, where to stop for on-route supplies and perhaps places you can stay overnight.</p>\n<p><a href=\"https://www.bikeradar.com/features/routes-and-rides/bikeradar-rides-leicestershire-alps/\">Jack Thurston’s <em>Lost Lanes</em></a> series covers most of the UK. GPX files of the routes are downloadable, so you don’t need to lug the book with you. From Emma Kingston’s <em>Bikepacking England </em>to Geoff Allan’s <em>The Scottish Bothy Bible, </em>there are loads more tried and tested adventures waiting for you to embark on.</p>\n<h2>Check council resources</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Closures of local railway lines have provided unexpected benefits for cyclists.</span></figcaption><span> <a href=\"https://www.geograph.org.uk/profile/9181\"><strong>Alan Murray-Rust / Geograph / Creative Commons</strong></a></span></div>\n<p>Tourist offices, national parks and councils usually have plenty of resources if you’re looking for designated cycling routes.</p>\n<p>Often, those include off-road routes such as cycleways and riding trails. Old railway lines dot the landscape and many of these have been turned into bike paths.</p>\n<h2>Go by water</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Towpaths are dependably flat, car-free and easily navigable.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>Canals are often a good option to get from A to B without traffic, particularly ones that go into towns.</p>\n<p>Towpaths are usually very rideable and often tarmacked, so you can zip under roads and emerge where you want to be.</p>\n<p>Towpath quality varies, so it’s worth trying a short run before you commit. Some are quite narrow and bumpy, and parts can get muddy in the winter and after rain. The Canal and Rivers Trust has more information on <a href=\"https://canalrivertrust.org.uk/enjoy-the-waterways/cycling/cycling-faqs\" target=\"_blank\">cycling on towpaths</a>.</p>\n<p>Many rivers have cyclable tracks beside them too.</p>\n<h2>Ask a cyclist</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Local knowledge should point you in the direction of peaceful paths.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>Cyclists are adept at finding cunning routes and cut-throughs to avoid traffic, so asking another rider is a good option.</p>\n<p>They’re sure to have a few preferred routes and directions to get out into the countryside.</p>\n<p>Often, they’ll have them mapped out too and will be happy to share them with you if you’ve got a compatible computer or route-planning app.</p>\n<p>Most cycling clubs will also have local routes.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c5a9ee9e9450043b18d070c60de52f043647ba40e12f62f2333256589fcec705","category":"Cycling"}