{"title":"Opinion: The women’s WorldTour calendar is damaging the sport and urgently needs a rethink","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-the-women-s-worldtour-calendar-is-damaging-the-sport-and-urgently-needs-a-rethink","date":1695200544000,"content":"\n      <p><span>Have you watched any women’s cycling since the World Championships? Have you heard or read much about it? If the answer is no, then don’t beat yourself up about it – it’s not really your fault. The problem lies in a confusing and broken calendar, one that seriously and urgently needs a rethink.</span></p>\n<div></div>\n<div></div>\n<p><span>In May of this year, there were 17 days of racing in the Women’s WorldTour, one stage race each week, with the first, La Vuelta Femenina by Carrefour.es, beginning just eight days after the one-day Classics season ended with <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège-Bastogne-Liège</a>. Before that, the women’s calendar followed a relatively similar pattern to the men’s, opening with races in Australia and the UAE, before a traditional Belgian then Ardennes Classics block.</span></p>\n<p><span>In June came the Tour de Suisse (the only WWT race of that month due to the cancellation of the Women’s Tour), then in July, the races came head-spinningly fast once more. The Giro d’Italia Donne took place at the same time as the men’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> (and was, arguably, incredibly drowned out by the hype around that race) and then the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> followed just under two weeks later. After that, it was time for riders to switch to their national kits and race at the World Championships – and many of them could have just ended their seasons there, as early as mid-August.</span></p>\n<p><span>There have been shorter stage races since then in the form of the Tour of Scandinavia, the Simac Ladies Tour and the Tour de Romandie, as well as the one-day Classic Lorient Agglomération-Trophée CERATIZIT (known widely as GP Plouay). While these races have been great to watch for those who knew they were happening, the three-week men’s <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a <span>España</span></a> has somewhat dominated headlines in the cycling world. In addition, although they have attracted star riders in isolation, none of these events saw a field with all the best riders in attendance in one place, like we saw at the Tour de France Femmes. <img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-01166_1024x1024.jpg?v=1695200250\" /></span></p>\n<p><span>Without meaning any disrespect to the organisers of these races, who have all done the best they can in terms of live coverage and promotion, it’s fair to say that none of the races since the World Championships could really be classed as part of the premier women’s WorldTour calendar. Races such as Trofeo Binda, or the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>, or the Giro d’Italia Donne, or the Tour de France Femmes, among others, can be described as hallmarks of the season. It seems like the second part of the year is crying out for a race that drums up the same type of interest.</span></p>\n<p><span>The women’s peloton is not directly comparable to the men’s due to smaller team sizes and fewer riders in general, but it still seems like the Women’s WorldTour structure could learn a thing or two from how the men’s is laid out. It’s like we’ve had all of the excitement of the year crammed into the first half, with the months after August feeling like an anti-climactic end to what has otherwise been a fantastic season of racing. While professional male riders had a lot to aim for after the Worlds with the Vuelta and with Il Lombardia still to come, the likes of Demi Vollering or Lotte Kopecky could have ended their seasons way back in August with all of their key objectives for the season already ticked off.</span></p>\n<p><span>Not only does the broken women’s cycling calendar make it difficult for fans to remain engaged in racing, it also has led to problems with riders suffering from burn-out midway through the season. Marlen Reusser was vocal when she abandoned the World Championship time trial about <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/sometimes-you-need-to-say-stop-women-s-cycling-s-burnout-problem\">feeling mentally exhausted</a> from the huge number of races she had competed in throughout the season so far, and the likes of Demi Vollering and Cecilie Uttrup Ludwig supported the Swiss rider’s comments. While it’s positive to see the addition of so many races to the women’s WorldTour, they need to be spaced out better with both rider health and fan engagement in mind.<img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-02368_1024x1024.jpg?v=1695200267\" /></span></p>\n<p><span>Annemiek van Vleuten, for example, will retire at the end of this season after a glittering 15-year career in the women’s peloton. The Dutchwoman commented after the World Championships, however, that she felt she had no race to aim for as her final goodbye to the women’s peloton.</span></p>\n<p><span>“I was begging the UCI for a Lombardia, because then I would have gone again to altitude to prepare for Lombardia and I love Italy so that would have been a nice way to say goodbye,” she said. “Our calendar needs revision because we don’t have an autumn. We have a nice spring, we have two stage races and then the guys still have a nice autumn calendar with one-day races and it would be nice if we had a Lombardia. It’s sad that we don’t have it.”</span></p>\n<p><span>Overall, the problem of the Women’s WorldTour calendar is a complex one. The main issue is that there aren’t enough riders in teams to cope with the growing calendar, but this issue is exacerbated when the races are squashed together in quick succession throughout the first part of the year. There’s also the fact that it’s notoriously difficult for women’s races to get the coverage they deserve when they are on at the same time as a men’s Grand Tour – as the Giro Donne and the Tour de Romandie were this year. The Tour de France Femmes is the biggest women’s race in the world, and this isn’t by chance. Its calendar placement right at the end of the men’s Tour means that fans are hungry for more to watch when the men’s race comes to an end, and the women’s race gets a spotlight of its own. </span></p>\n<p><span>The hype for women’s racing that is built up throughout the opening months of the season needs to be leveraged and continued throughout the year. As Van Vleuten herself says, the peloton is crying out for a Monument or Grand Tour later in the season – it’s not only what the Women’s WorldTour needs, but it is what the riders deserve.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c5b3ef5895839cfaf9e37b6c388d18633630a59bd5c50d2c4634120aa4208b5a","category":"Cycling"}