{"title":"The Olympic track bike arms race: who’s riding what at Tokyo 2020?","link":"https://www.bikeradar.com/features/pro-bike/track-cycling-bikes-explained/","date":1627675244000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/WP5_3695-dc09771-e1627569228656.jpg?quality=45&amp;resize=620,413\" />                                            <p>The <a href=\"https://www.bikeradar.com/events/tokyo-2020/\" target=\"_blank\">Tokyo 2020 Olympic Games</a> are upon us and there’s been the usual track bike arms race ahead of the <a href=\"https://www.bikeradar.com/features/track-cycling-explained/\" target=\"_blank\">track racing</a> events. With winning times measured down to the thousandth of a second and riders reaching speeds of more than 70km/h, any features that provide a competitive edge are highly sought after.</p>\n<p>Despite the scale of the Olympics, there’s surprisingly little publicly available information about many track bike designs, which often come from niche makers and are made in really small volumes. National federations are unlikely to reveal their secrets, either.</p>\n<p>That’s changed a little with the UCI’s stipulation that equipment used in competition must be made available for sale, but if you want a German track bike, for example, there’s no info out there on geometry, sizing or significant features.</p>\n<p>Things are a bit different where a commercial partner is involved in development. Look, Argon18 and Felt, for example, publish a lot more information on their bikes because they also sell them to less well-resourced national teams and to amateurs with deep pockets.</p>\n<p>So, who’s riding what on the track at the Tokyo 2020 Olympic Games? Here we’ll cover the machines we expect to be at the pointy end of the racing in the Izu Velodrome, before taking a look at the key features of track bikes generally.</p>\n<h2>Tokyo 2020 Olympic track bikes | Who’s riding what?</h2>\n<p>Let’s take a closer look at the track bikes being used by the leading nations at the Tokyo 2020 Olympic Games.</p>\n<h3>Team GB’s Hope x Lotus HB.T</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The profile of the HB.T is unlike any bike we’ve seen before.</span></figcaption><span> <i>Hope/Lotus</i></span></div>\n<p>Radical design is part-and-parcel of track bike development, but <a href=\"https://www.bikeradar.com/news/hope-lotus-hb-t/\" target=\"_blank\">Team GB’s Hope-developed HB.T</a> is the current pinnacle.</p>\n<p>Team GB used Cervélo bikes at the Rio 2016 Olympics, but Hope and Lotus collaborated to put this machine together in the build-up to Tokyo 2020.</p>\n<p>Lotus has flirted with radical bike design since the 1980s, with Chris Boardman taking gold on the <a href=\"https://www.bikeradar.com/features/throwback-thursday-1996-lotus-sport-110/\" target=\"_blank\">Type 108</a> at the Barcelona Olympics in 1992.</p>\n<p>As with other branches of cycling, the <a href=\"https://www.bikeradar.com/features/interview-jean-wauthier-uci-technical-advisor/\">UCI imposes fairly strict limits on track bike design</a>, with things such as tube profiles having to conform to its limits.</p>\n<p>However, a bike can be up to 80mm wide and Hope took full advantage of this with the splayed fork blades and seatstays on the HB.T.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The space around the wheel is striking.</span></figcaption><span> <i>Hope/Lotus</i></span></div>\n<p>With a larger space between the wheels and the fork and stays, there’s less aerodynamic interference, according to Hope, while the wide stays are also said to smooth airflow over the competitor’s legs, again lowering wind resistance.</p>\n<p>Hope also developed the one-piece moulded monocoque disc wheels to go with the frame (in contrast to most disc wheels, which see the two sides glued together).</p>\n<p>Development of the HB.T has taken more than 7,000 hours, according to Hope – which, along with the advanced construction, helps justify the extraordinary £15,000 price tag.</p>\n<h2>Australia’s Argon 18 Electron Pro</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Australian team will be riding the very handsome Argon 18 Electron Pro.</span></figcaption><span> <i>Argon 18</i></span></div>\n<p>Cycling Australia will be riding custom Argon 18 Electron Pro track bikes equipped with wheels from Zipp.</p>\n<p>Argon 18 has gone the other direction to Hope – rather than spreading out the fork blades, it’s made them super-tight against the front wheel on the 2020 Electron Pro to minimise the bike’s frontal profile.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> There is also a TT/pursuit version of the bike.</span></figcaption><span> <i>Argon 18</i></span></div>\n<p>Argon 18 claims a 30 per cent reduction in fork drag compared to the previous generation Electron Pro, which adds up to a 1-second overall saving in the team pursuit.</p>\n<p>According to the brand, the frameset is beefed up to be three times as stiff at the bottom bracket as recommended by ISO standards and twice as stiff at the cockpit.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The hump on the hooks shrouds a rider’s hands.</span></figcaption><span> <i>Argon 18</i></span></div>\n<p>The bikes also see a neat integrated drop-bar specced for bunch races and sprints. These have a distinct bump midway through the hooks that helps smooth airflow over a rider’s hands. The bikes also get custom extension bars for team pursuit.</p>\n<p>Again, there’s been a vast amount of engineering time spent on the bike – over 4,500 hours according to Argon 18.</p>\n<h2>France’s Look T20</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The new T20 track bike doesn’t look as wild as some of the other new bikes we’ve seen recently, but it does look like it means business.</span></figcaption><span> <i>Look</i></span></div>\n<p>Look’s previous generation R96 track bike was the most popular at the 2016 Rio Olympics, with over 80 bikes in attendance used across nine teams.</p>\n<p>The <a href=\"https://www.bikeradar.com/news/look-t20-track-bike/\">new Look T20</a> is claimed to have increased aero efficiency by 11 per cent. Stiffness is also said to have been improved by between 12 per cent at the head tube and 24 per cent at the bottom bracket. Look says this adds up to a bike length’s advantage in a 200m sprint. It’s also 800g lighter.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The T20 has been made to meet the demands of the French national track cycling team.</span></figcaption><span> <i>Look</i></span></div>\n<p>As with the R96 and Australia’s Argon 18 Electron Pro, the bike uses 12×100mm thru-axles rather than track bolts to retain the wheels, built by Corima, for their more aero profile.</p>\n<p>Whereas many bikes have bespoke 3D printed cockpits, Look’s standard bar and stem are designed to be adjustable using an Allen key.</p>\n<h2>Germany’s FES B16 and B20</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The FES B16 frame used by Germany’s team pursuit squad has a number of custom parts.</span></figcaption><span> <i>Alex Whitehead/SWPix.com</i></span></div>\n<p>Developed by the Institut für Forschung und Entwicklung von Sportgeräten (FES to its friends), Germany will be using the B16 and B20 track bikes for the Olympics.</p>\n<p>The B16 was actually developed for the 2016 Rio Olympics and comes in specific setups for either bunch racing (BR) or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\" target=\"_blank\">time trial</a> and pursuits (TT).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The B20 sees updates from the B16.</span></figcaption><span> <i>PETER PARKS/AFP via Getty Images</i></span></div>\n<p>The B20 is an update on the B16. The new bike is engineered to be lighter, stiffer and more aero than its predecessor – notice a theme here? Again there’s a BR and TT version.</p>\n<p>The bikes are paired up with eight different bar options and three different custom wheelsets, with extra-narrow 70mm front axles and 79mm rear axles on the TT versions, rather than the conventional 120mm rear axles on the bunch race version.</p>\n<p>TT bikes also get a non-standard, narrow 54mm BB30 <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\" target=\"_blank\">bottom bracket</a>.</p>\n<h2>Italy’s Pinarello MAAT</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Pinarello MAAT has a longer than standard top to maximise rider reach within the UCI rules.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>With the Tokyo Olympics postponed by a year, most Olympic track bikes are old news now, and we actually covered the <a href=\"https://www.bikeradar.com/news/pinarello-maat-track-bike/\">Pinarello MAAT</a> back in November 2019.</p>\n<p>It follows Pianrello’s asymmetric design, which it claims evens out forces on the frame from the one-sided forces generated by the chainline.</p>\n<p>The frame has been designed with an extra-long top tube to work in conjunction with a shorter stem. This provides a more stretched out riding position that is still within the UCI’s geometry rules.</p>\n<p>The bike also sees an integrated drop bar that includes protrusions on the top of the hooks. These mimic brake levers to allow riding ‘on the hoods’ with bent arms, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-faster-without-pedaling-harder/\">which can be more aerodynamic than riding in the drops</a>.</p>\n<h2>Malaysia’s Worx WX-R Vorteq Track</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Worx WX-R is, by far, the most expensive bike at the Olympics.</span></figcaption><span> <i>Worx</i></span></div>\n<p>The Worx WX-R Vorteq has the distinction of being the most expensive bike to make a showing at the Tokyo velodrome.</p>\n<p>Developed by UK based Worx and Formula One engineers Vorteq, it’s designed for sprint races and features extra-deep tube profiles with a low frontal area.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The bike is ridden by the Malaysian national team.</span></figcaption><span> <i>PETER PARKS/AFP via Getty Images</i></span></div>\n<p>The fork has an unusual profile, which tapers down to a tiny 12×32mm thru-axle that pairs with custom-built four-spoke or disc wheels.</p>\n<p>The bikes are also specced with a 30cm wide aerodynamic short grip bar, which alone retails for a cool £10,000.</p>\n<p>Even the rail-less saddle has been custom designed specifically to fix with bolts to the extra-strong fixed-position seat mast. This carries an equally high £5,000 price tag. The seat mast is another £3,000. Madness.</p>\n<h2>USA’s Felt TK-FRD</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Team USA rides Felt bikes on the track.</span></figcaption><span> <i>Felt</i></span></div>\n<p>Felt says that its new TK-FRD track bike is designed to be longer and lower than its predecessors – partly to comply with the latest UCI regulations and partly to allow riders to get more aero.</p>\n<p>It’s also reworked its carbon lay-up to make it stiffer and lighter. It has accomplished this by using Textreme carbon fibre, which uses flattened fibre ribbons rather than round section fibres. This is said to increase the ratio of carbon to resin for a lighter build with the same strength.</p>\n<p>There are no fancy ultra-custom parts here, with the bike using conventional 100mm front/120mm rear axle spacing and a 68mm threaded bottom bracket.</p>\n<p>But it does look likely the team will be using the TA-FRD pursuit bike alongside the TK-TRD for its narrower spacing and <a href=\"https://www.bikeradar.com/news/can-you-spot-the-big-difference-with-felts-new-track-bike/\" target=\"_blank\">the unconventional non-driveside drivetrain</a> seen in the pursuit races at the Rio Olympics.</p>\n<p>Felt claims this setup is more aerodynamically efficient than a conventional drivetrain on track circuits, which always run anti-clockwise (left turning).</p>\n<h2>ROC’s BT Ultra</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Russian Olympic Committee team will be riding the BT Ultra at the 2020 Olympics.</span></figcaption><span> <i>ANDY BUCHANAN/AFP via Getty Images</i></span></div>\n<p>Russia’s Olympic Committee has looked to Bike Technologies Australia for its track bikes for Tokyo.</p>\n<p>BT doesn’t give much away, but the Ultra pursuit frame looks like a fairly conventional carbon track bike, with standard axle spacing and, for the ROC, it is kitted out with Campagnolo Ghibli disc wheels.</p>\n<p>BT sells a matching 36cm wide carbon bar with a 148mm drop.</p>\n<p>Many Russian competitors at the UCI Track Cycling Nations Cup in St Petersburg earlier in July were riding Look bikes and another was on a Dolan, though.</p>\n<h2>How much does an Olympic track bike cost?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> There is <em>a lot</em> of money rolling around in this picture.</span></figcaption><span> <i>Will Palmer/SWpix.com</i></span></div>\n<p>With so much custom development for a limited run of bikes, top-end track bikes are very expensive.</p>\n<p>Back in December 2019, we <a href=\"https://www.bikeradar.com/news/olympic-track-bike-prices/\">received a leaked copy</a> of the UCI’s list of prices for track bikes and components to be used by the national federations at the Tokyo Olympics. Topping the list was Malaysia’s Worx WX-R Vorteq Track, at €28,000.</p>\n<p>That makes Team GB’s Hope x Lotus HB.T look like a bit of a bargain at <a href=\"https://www.bikeradar.com/news/hope-track-bike-price/\">£15,500 plus VAT</a>. That’s for the frameset-only though.</p>\n<p>If you want to add the custom printed bar, the price goes up to £17,100 with pursuit bars and £18,200 with drop bars. Wheels start at £2,100 each.</p>\n<p>In contrast, the Look T20 frameset starts at just €6,999.</p>\n<p>The UCI’s rules dictate that bikes used in events must be available for purchase by the general public, so you too can be the owner of an Olympic-standard track bike. Hope asks for a £5,000 deposit to secure your order.</p>\n<h2>What is a track bike?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Track bikes are about as simple as bikes come.</span></figcaption><span> <i>CSG UK</i></span></div>\n<p>Designed for riding laps of the velodrome, track bikes are the often most pared-down bikes you’ll find anywhere. That means no brakes and a single, <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\">fixed gear</a>, so when the bike moves you pedal – there’s no freewheeling.</p>\n<p>The wooden track of a velodrome is very smooth, so considerations and concessions made for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bikes</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bikes</a>, such as comfort, go out of the window.</p>\n<p>Track bikes need to be super-stiff to handle the huge forces put through them by track riders – and especially sprinters.</p>\n<p>They’ll roll on narrow tubular tyres pumped up to a high pressure to minimise rolling resistance (unlike <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">road bike tyre pressure</a>, whereby riders need to take into account imperfections in the road surface).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Chasing aero gains is the key to track cycling success at the pointy end of the sport.</span></figcaption><span> <i>Will Palmer/SWpix.com</i></span></div>\n<p>What doesn’t change with riding on the track is the importance of aerodynamics. As we’ve already alluded, track races are often decided by millimetres and thousandths of a second, so top-level track bike frames are designed to be as slippery as possible.</p>\n<p>As a result, while track bikes are mechanically simple, Olympic-level machines are extremely expensive, particularly because many components are custom-built to fit their riders.</p>\n<p>What’s more, one bike may not be ideal for all track cycling events either and designs can vary depending on whether a bike is designed for pursuit, sprint or bunch racing events, with geometry, aerodynamic and stiffness considerations made accordingly.</p>\n<h3>Track bike frames</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Almost all track frames – at least at an Olympic level – are made of carbon, and put aerodynamic performance ahead of weight considerations.</span></figcaption><span> <i>Bike Technology Australia</i></span></div>\n<p>At the Olympic level, track bike frames are invariably made of carbon fibre and are typically designed to be as aerodynamic as possible, while still falling within the UCI’s regulations for frame tube dimensions.</p>\n<p>Features often include bayonet-mounted forks, whereby the steerer sits externally as part of the fork, rather than using internal <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-headsets/\">headset</a> bearings, thus elongating the bike’s nose for better aerodynamics.</p>\n<p>In simple terms, a narrow frontal profile lowers air resistance, allowing riders to travel faster for less effort, so many track bikes major on this, with really tight fork clearances and narrow axles.</p>\n<p>Hope’s HB.T bike goes the other way, with a wildly splayed fork and chainstays, but that’s very much the exception.</p>\n<p>Stiffness is also key, not least for track sprinters putting out more than 1,500 watts, and track bikes will be designed to accommodate this force, particularly around the <a href=\"https://www.bikeradar.com/features/what-is-a-bottom-bracket/\">bottom bracket</a> and head tube/handlebar.</p>\n<p>The UCI’s 6.8kg weight limit still applies to track bikes. With far fewer components bolted to track bikes compared to road bikes, and no climbing to speak of, frame weight is a lot less of an issue – aerodynamic performance really is the guiding principle here</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Track bikes use horizontal track ends, which allow the chain to be tensioned.</span></figcaption><span> <i>James Huang / BikeRadar</i></span></div>\n<p>Finally, track bike frames have rearward-facing rear dropouts, allowing the chain to be tensioned by moving the rear wheel backward and forward in the frame.</p>\n<p>Some track bikes, including the LOOK T20 used by the French national team, have replaced the traditional bolted wheel axles with thru-axles. The benefit, according to LOOK, comes in reducing weight, increasing stiffness and improving aerodynamics.</p>\n<h3>Track bike gearing</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Track bikes use cogs, and gear changes must be done manually by unthreading the sprocket from the hub.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Track cyclists are, in general, powerfully built and push a big gear, so track bikes are designed to accommodate large cranksets and chainrings.</p>\n<p>For riders, gearing is a balance between the top-end speed required for their event and the ability to get away from the line quickly from a standing start. On the other hand, the ability to pedal at a very high <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> once they’re up to speed is important.</p>\n<p>If the gear’s too big, a rider might struggle to get on top of the gear and risks getting left behind on the start line; too small and they’ll spin out or lack the punch required to make a move in the decisive moment of a race.</p>\n<p>Typically, track bikes have rear sprockets with between 12 and 16 teeth, paired with a chainring with between 44 and 60 teeth. The ‘perfect’ gearing will depend on the individual rider’s physiology and the demands of their event. All track riders will have a solid understanding of gear ratios to fine-tune their setup and last-minute switches prior to an event are a common sight.</p>\n<p>We’d normally expect to see chainring tooth numbers in the mid-50s, so there are more teeth in contact with the chain to spread the load.</p>\n<p>There’s also less link-to-link friction because the movement between links is less than with a smaller diameter chainring.</p>\n<h3>Track bike components</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Track hubs use narrower spacing than road hubs.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Track bikes use beefed-up components to deal with the stresses of track cycling. The drivetrain typically uses a wider chain, chainring and sprocket than other bikes.</p>\n<p>Other components are narrower, though. That includes the bottom bracket and the <a href=\"https://www.bikeradar.com/features/stance-width-what-it-is-and-why-you-should-care/\">stance width</a> of the chainset. Rear-wheel axles are narrower than on a road bike too, with standard track bike axle spacing being 120mm, compared to 135mm for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-axle-standards/\">road bike axle standard.</a></p>\n<p>Example front axle widths on Olympic track bikes include 70mm on Germany’s bikes and as little as 32mm on Malaysia’s super-spendy bike, to reduce the bike’s frontal profile.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Track cycling handlebars tend to be much narrower than those seen on road bikes. To illustrate just how narrow they are, here’s a Worx handlebar fitted with road shifters.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Track cyclists typically use narrow drop handlebars too – down to 30cm for Malaysia’s Worx bike.</p>\n<p>Again, this is in the pursuit of aerodynamics. For pursuit races, the bike will be kitted out with an aero-bar extension, often 3D-printed to fit the individual competitor.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Ghibli is the prototypical track wheel and is used by many riders.</span></figcaption><span> <i>Campagnolo</i></span></div>\n<p>Track bikes are usually equipped with carbon disc wheels with tubular tyres, although wheels with a small number of wide carbon spokes are also a front-wheel option.</p>\n<p>Many wheelsets are developed specifically for each team’s bikes, but Campagnolo Ghibli disc wheels are a popular off-the-shelf option.</p>\n<h3>What about Keirin bikes? What does ‘NJS’ mean?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Keirin racing in Japan is strictly regulated, with both riders and equipment licensed by a central governing body.</span></figcaption><span> <i>Chris McGrath/Getty Images</i></span></div>\n<p>All of the above information relates to UCI-regulated track racing.</p>\n<p>Keirin racing in Japan is highly regulated by the Japan Keirin Autorace Foundation (formerly known as the Nihon Jitensha Shinkōkai, or NJS).</p>\n<p>As well as licensing riders, the body is responsible for setting specifications and approving all frames and components used in competition. Approved components are stamped with a distinctive ‘NJS’ logo.</p>\n<p>These specifications haven’t changed a great deal since the body was founded in 1957, which is why keirin bikes in Japan look so traditional, with skinny steel triple triangle frames and quill stems.</p>\n<p>Keirin racing outside of Japan – including at the Tokyo 2020 Olympics – is not regulated by the same body, so riders are free to choose whatever bike they please.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c5b706e523f4cb336531d12d6a30000c4b9ddbd231e7268355518593a5025516","category":"Cycling"}