{"title":"Design and development of a sensorized hammerstone for accurate force measurement in stone knapping experiments","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310520","date":1726581600000,"content":"<p>by Cecilia Barroso-Medina, Sam C. Lin, Matthew W. Tocheri, Manish Sreenivasa</p>\r\n\r\nThe process of making stone tools, specifically knapping, is a hominin behaviour that typically involves using the upper limb to manipulate a stone hammer and apply concentrated percussive force to another stone, causing fracture and detachment of stone chips with sharp edges. To understand the emergence and subsequent evolution of tool-related behaviours in hominins, the connections between the mechanics of stone knapping, including the delivery of percussive forces, and biomechanics and hominin anatomy, especially in the upper limb, are required. However, there is an absence of direct experimental means to measure the actual forces generated and applied to produce flakes during knapping. Our study introduces a novel solution to this problem in the form of an ergonomic hand-held synthetic hammerstone that can record the percussive forces that occur during knapping experiments. This hammerstone is composed of a deformable pneumatic 3D-printed chamber encased within a 3D-printed grip and a stone-milled striker. During knapping, hammer impact causes the pneumatic chamber to deform, which leads to a change in pressure that is measured by a sensor. Comparisons of recorded pressure data against corresponding force values measured using a force plate show that the synthetic hammer quantifies percussion forces with relatively high accuracy. The performance of this hammerstone was further validated by conducting anvil-supported knapping experiments on glass that resulted in a root mean square error of under 6%, while recording forces up to 730 N with successful flake detachments. These validation results indicate that accuracy was not sensitive to variations up to 15° from the vertical in the hammer striking angle. Our approach allows future studies to directly examine the role of percussive force during the stone knapping process and its relationship with both anatomical and technological changes during human evolution.","author":"Cecilia Barroso-Medina","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c5c6b9669b38e5a8c5b47f46ed73c3b6d0848e7e77c247dd87963907cd4f672d","category":"Interdisciplinary"}