{"title":"PSI-10 Combination of probiotic Bacillus licheniformis and Bacillus coagulans in sow diets improves litter quality and piglet performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/282/7664936?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The aim of this study was to evaluate the effects of a dietary two-strain probiotic on sows, and the subsequent effects on litter quality and piglet performance. The total trial duration was 32 d and started 7 d before farrowing. A total of 160 sows (DanBred x Duroc) were assigned into two dietary treatment groups (80 sows each), considering their body weight, body condition score, and parity (Ø 2.4). Sows in the control group received a basal pelleted diet lacking probiotic supplementation, whereas sows in the probiotic group received an identical diet but supplemented 7 d pre-partum and 25 d post-partum with a two-strain probiotic (total inclusion rate: 1.5 x 10<sup>9</sup> CFU/kg of feed, 0.3 x 10<sup>9</sup> CFU/kg CFU/kg of <span>B</span>. <span>coagulans</span> DSM 32016 and 1.2 x 10<sup>9</sup> CFU/kg of <span>B</span>. <span>licheniformis</span> DSM 33806) produced by Biochem Zusatzstoffe Handels- und Produktionsgesellschaft mbH, Germany. Within 24 h after birth, the litters of all sows in the trial were standardized to 13 piglets by removing weak and low weight individuals (≤ 0.7 kg). Cross-fostering was restricted to the experimental group. Data were subjected to t-Test or non-parametric Mann-Whitney-U-test, <span>P</span> ≤ 0.05 were considered statistically significant. The results indicate a significant reduction of dead-born piglets (<span>P</span> = 0.01), increase of daily litter weight gain (<span>P</span> = 0.002), improvement of piglet weaning weight (<span>P</span> = 0.01), and increase of the total number of weaned piglets (<span>P</span>=0.001) in the probiotic group compared with the control group. Furthermore, the individual daily weight gain (<span>P</span> = 0.003) and final weight of piglets at weaning (<span>P</span> &lt; 0.001) were significantly improved by probiotic supplementation. The body weight loss of sows and feed intake were not statistically different (Table 1). In conclusion, the probiotic combination of <span>Bacillus licheniformis</span> and <span>Bacillus coagulans</span> fed to sows improved litter quality and piglet performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c5cd2ead3252117d901abe4863ff37993bc8ba9dde283dc7e512d9e466208e80","category":"Environment"}