{"title":"Apple Releases iOS 16.4 With New Emoji, Safari Web Push Notifications, Beta Changes, Voice Isolation for Calls and More","link":"https://www.macrumors.com/2023/03/27/apple-releases-ios-16-4/","date":1679936585000,"content":"Apple today released iOS 16.4, the fourth major update to the <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a> operating system that initially came out last September. iOS 16.4 comes two months after the launch of iOS 16.3, an update that added Security Keys for <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/iOS-16.4-Feature-Blue.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\n‌iOS 16‌‌.4 and iPadOS 16.4 can be downloaded on eligible iPhones and iPads over-the-air by going to Settings &gt; General &gt; Software Update. It can take a few minutes for the updates to propagate to all users due to high demand. Apple has also released iOS 15.7.4 for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users who have older devices, with the update offering security improvements.\r<br />\n\r<br />\niOS 16.4 adds 21 total new emoji characters including shaking head, pink heart, blue heart, gray heart, donkey, moose, black bird, goose, wing, jellyfish, hyacinth, and more.\r<br />\n\r<br />\nIt also includes Safari web notifications for websites added to the <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a>, Voice Isolation for clearer cellular phone calls, the return of the Apple Books page turning animation, updates to Podcasts, new <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> architecture, and a number of other small changes and tweaks. Apple's full notes for the update are below:\r<br />\n<blockquote>This update includes the following enhancements and bug fixes:\r<br />\n\r<br />\n- 21 new emoji including animals, hand gestures, and objects are now available in emoji keyboard\r<br />\n- Notifications for web apps added to the Home Screen\r<br />\n- Voice Isolation for cellular calls prioritizes your voice and blocks out ambient noise around you\r<br />\n- Duplicates album in Photos expands support to detect duplicate photos and videos in an iCloud Shared Photo Library\r<br />\n- VoiceOver support for maps in the Weather app\r<br />\n- Accessibility setting to automatically dim video when flashes of light or strobe effects are detected\r<br />\n- Fixes an issue where Ask to Buy requests from children may fail to appear on the parent's device\r<br />\n- Addresses issues where Matter-compatible thermostats could become unresponsive when paired to Apple Home\r<br />\n- Crash Detection optimizations on iPhone 14 and iPhone 14 Pro models</blockquote>\r<br />\niOS 16.4 and iPadOS 16.4 may be some of the last updates that we see to the ‌iOS 16‌ and <a href=\"https://www.macrumors.com/roundup/ipados-16/\">iPadOS 16</a> operating systems as Apple shifts its focus to <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> and iPadOS 17, software that will be announced at the Worldwide Developers Conference that's expected in June.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a>, <a href=\"https://www.macrumors.com/roundup/ipados-16/\">iPadOS 16</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-16.238\">iOS 16</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/27/apple-releases-ios-16-4/\">Apple Releases iOS 16.4 With New Emoji, Safari Web Push Notifications, Beta Changes, Voice Isolation for Calls and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-ios-16-4-with-new-emoji-safari-web-push-notifications-beta-changes-voice-isolation-for-calls-and-more.2384958/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c5dad035ca81a1b3f425578b67d7a78173990cb8f6fb1728185a6658afd87a1a","category":"Apple"}