{"title":"Challenges of Sample Preparations for vEM-CLEM","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.1101/7720373?rss=1","date":1721779200000,"content":"<span>To answer “structure and function” questions in biology, correlative light and electron microscopy (CLEM) would be a powerful technique. Advanced LM technologies allow us to capture activities of cells in live, and volume electron microscopy (vEM) would be applied to further analyze subcellular ultrastructural characteristics [<a href=\"#ozae044.1101-B1\">1</a>, <a href=\"#ozae044.1101-B2\">2</a>]. However, extracting information from biological samples using two different imaging modalities requires some considerations in the sample preparation methods. This paper will focus on the vEM-CLEM workflows from sample preparations to imaging in neuroscience research, and discuss practical pros and cons in two different vEM techniques, serial block face SEM (SBF-SEM) and serial section SEM array tomography (ssSEM-AT). To design vEM-CLEM workflows, we need to consider several points such as, 1) if we need to label a target structure or a type of cells for correlative purpose; if so, if it is possible to genetically express a marker molecule, or an immuno-EM protocol needs to be applied to identify the target structure or cell, 2) how large area and volume we need to cover in the EM imaging and reconstruct three dimensionally to correlate to the LM data; for example, if we need several synapses to analyze, or a single cell, or a group of cells making a network in a certain volume need to be captured, 3) how much resolution is needed to answer the particular biological question; if we need to analyze membrane interactions or we only need to count cell numbers, 4) then we need to have a practical strategy how to correlate LM and EM images to properly extract the information. Tips in sample preparations, in correlation, and in imaging for vEM-CLEM workflows will be discussed using our workflows as case studies [<a href=\"#ozae044.1101-B3\">3-5</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"c5dd053fa99d3400d721b975da1d539cab8a97fdbe386635ea3a71a9539e0bf9","category":"Environment"}