{"title":"Parallels Desktop 19 gets Sonoma-ready, expands OpenGL and Linux support","link":"https://arstechnica.com/?p=1962932","date":1692908205000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Windows-PD-19-800x539.png\" alt=\"A login screen for Windows allowing the use of Touch ID\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Windows-PD-19.png\">Enlarge</a> <span>/</span> You can now use Touch ID to log in to your Windows virtual machine. (credit: <a href=\"https://www.parallels.com/blogs/parallels-desktop-19/\">Parallels</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's an annual tradition to see an update to Mac virtualization software Parallels Desktop a few weeks before the next major macOS release. Like clockwork, we've come to that time again: <a href=\"https://fave.co/3KX7pxj\" target=\"_blank\">Parallels Desktop 19</a> is available now, with a handful of improvements for users who want to run Windows or Linux on their Macs.</p>\n<p>It's not the most radical year-over-year update we've seen, but there are some welcome optimizations and tweaks. The headlining feature is the ability to use Touch ID to sign in to your Windows virtual machine. When you next launch your Windows VM, your Windows password can be saved to your Mac's keychain with a Touch ID-specific record that is unique to your device. It's important to note that this is just for signing into the VM, though; this is not full Touch ID support for all the places Windows Hello appears throughout Microsoft's operating system.</p>\n<p>There are also various tweaks to make Parallels macOS Sonoma-ready, what with Apple's annual OS update coming sometime this fall. For example, a change in Sonoma would have broken the Shared Printing feature that allows you to print from your Windows VM. Parallels' engineers re-configured the feature to get it working within the new release and made some improvements to it.</p></div><p><a href=\"https://arstechnica.com/?p=1962932#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962932&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c5df253e62e2b2cecf091fddd545d0bc7df5a639dbb8853312f6b4b1ba8553f8","category":"Tech"}