{"title":"Variable success in linking micro- and macroevolution","link":"https://academic.oup.com/evolinnean/article/doi/10.1093/evolinnean/kzae016/7738778?rss=1","date":1724284800000,"content":"<span><div>Abstract</div>Attempts to predict macroevolution from microevolution, and microevolution from macroevolution, when natural selection is the main cause have met with varying success. Explanations for failure are numerous, but the reasons are uncertain even when a link is found. Here, I discuss possible explanations for outcomes of three efforts and ways to test them. First, quantitative genetic variation within populations often predicts directions of species divergence with surprising accuracy. Natural selection probably contributes to this pattern, but the evidence suggests that even long-term phenotypic evolution is influenced by enduring genetic biases. Second, the rate of evolution of reproductive isolation repeatedly fails to predict species diversification rates for unknown reasons. Suspicion falls on the influence of ecological and population demographic processes that might play a dominant role in the net rate of accumulation of species, an idea as yet little tested. Third, macroevolutionary patterns in the distribution of phenotypes of species in clades can in principle predict selection coefficients in diverging populations. I use the concept of adaptive landscape to suggest why the macroevolutionary signal of divergent selection is strongest at the time of splitting and why little information about selection coefficients from phylogenetic methods remains in the long run. Estimating adaptive landscapes from first principles would facilitate further efforts to link microevolution and macroevolution.</span>","author":"","siteTitle":"Evolutionary Journal of the Linnean Society Current Issue","siteHash":"3a6bf3189332aa8d860b0369d5aa2ac065f7385b7c3f4543469ad2a55950d26a","entryHash":"c5e1f9e1d6bb0c145faf3f57b1c9ebe586240765112dfe134dc76b30b90e80a5","category":"Environment"}