{"title":"The Steam Deck OLED looks as good as it can get, at least until the real sequel","link":"https://arstechnica.com/?p=1982664","date":1699563447000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/press_oled_front_cocoon-800x450.png\" alt=\"Steam Deck OLED\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/press_oled_front_cocoon.png\">Enlarge</a> (credit: Valve)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Valve has said that a true sequel to the Steam Deck handheld, one with a boost in power, <a href=\"https://arstechnica.com/gaming/2023/03/a-more-powerful-steam-deck-is-a-few-years-off-valve-says/\">is \"a few years\" away</a>. But that apparently doesn't rule out smaller, console-style mid-cycle refreshes. Valve today announced a new OLED version of the Steam Deck that boasts a new screen and a wealth of other small but notable improvements.</p>\n<p>The new OLED Steam Decks will be available at 10 am PT (1 pm ET) on November 16. A 512GB version at $549 replaces its LCD predecessor with the same storage, and a $679 1TB \"Limited Edition\" version, with anti-glare etched glass and a distinct smoky red colorway, is available, though \"Quantities are highly limited\" of the latter. A $399, 256GB LCD Steam Deck will stick around, while the 64GB and 512GB versions of the LCD model are discounted while supplies last.</p>\n<p>There's <a href=\"https://www.steamdeck.com/en/tech/oled\">a heck of a lot that's improved in the OLED Steam Deck</a>, minus one core thing: the power of its chip. Sharp eyes will catch on the spec sheet that the LCD Deck has a 7 nm AMD APU package, with the CPU running 2.4–3.5 GHz, and the GPU 1.0–1.6 GHz. The OLED Deck sports a 6 nm APU, but removes the GPU range, instead implying a consistent 1.6 GHz output. Memory bandwidth has also been boosted from 5,500 to 6,400 MT/s, a 15 percent jump. It's more sustained peak performance, and a bit more bandwidth for frame-rate boosting, but with compatibility maintained.</p></div><p><a href=\"https://arstechnica.com/?p=1982664#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1982664&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c5f16afc3529b22bdb5c57d4f0343b80ee992b61e9299d1125a556e73b14e903","category":"Tech"}