{"title":"Systemic immune-inflammatory indicators and bone mineral density in chronic kidney disease patients: A cross-sectional research from NHANES 2011 to 2018","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302073","date":1714053600000,"content":"<p>by Yuying Jiang, Xiaorong Bao</p>\r\nBackground <p>The purpose of this study was to look at the relationship between the Systemic Immune Inflammatory Index (SII) and bone mineral density (BMD) in the pelvis, left upper and lower limbs, lumbar spine, thoracic spine, and trunk in a chronic kidney disease (CKD) population in the United States.</p> Methods <p>The National Health and Nutrition Examination Survey (2011–2016) yielded 2302 people with CKD aged &gt;18 years. CKD was defined as eGFR less than 90 ml/min/1.73 m<sup>2</sup> or eGFR greater than 90 ml/min/1.73 m<sup>2</sup> with urine ACR greater than 30 mg/L.SII was calculated as PC * (NC / LC) from platelet count (PC), neutrophil count (NC), and lymphocyte count (LC). Multiple logistic regression was used to examine the relationship between BMD and SII at different sites in CKD patients, smoothed curve-fitting and generalized weighting models were used to investigate non-linear relationships, and a two-tailed linear regression model was used to find potential inflection points in the model.</p> Results <p>We discovered a negative correlation between SII and pelvic BMD among 2302 participants after controlling for gender, age, and race [β = -0.008; 95% confidence value -0.008; 95% confidence interval (CI) -0.014, -0.002]. Lower PEBMD was related to increasing SII (trend p = 0.01125). After additional correction, only pelvic BMD remained adversely linked with SII [value -0.006; 95% CI -0.012, -0.000, p = 0.03368]. Smoothed curve fitting revealed a consistent inverse relationship between SII and pelvic BMD. Further stratified analyses revealed a substantial positive negative connection between SII and pelvic BMD in individuals who did not have hypertension, diabetes, a BMI of more than 30 kg/m<sup>2</sup>, or stage 2 CKD. The connection between SII and PEBMD in people without diabetes revealed a strong inverted U-shaped curve.</p> Conclusion <p>In individuals with CKD in the United States, there was a negative connection between the systemic immunoinflammatory index (SII) and pelvic BMD. The SII might be a low-cost and simple test for CKD-related BMD loss.</p>","author":"Yuying Jiang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c5ff6f670cecc4b68d17ed3f04c6365e834af03c05559e5828a1ea38b21565da","category":"Interdisciplinary"}