{"title":"Apple Vision Pro Secondary Head Strap Design 'Yet to Be Finalized'","link":"https://www.macrumors.com/2023/07/07/apple-vision-pro-secondary-head-strap/","date":1688723912000,"content":"When Apple unveiled the Vision Pro at WWDC in June, members of the press invited to try out the headset were able to use an optional secondary head strap that sits across the top of the head. The strap was spotted in Apple's promotional videos for the mixed reality device, but its marketing material made no mention of the accessory. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/vision-pro-over-head-strap.jpeg\" alt width=\"2048\" height=\"1144\" /><div><em>Still from Apple's WWDC keynote video showing over-the-head strap in use</em></div>\r<br />\nThe braided headband that goes around the back of the head has a fit adjustment dial, but the one headband may not be comfortable or secure enough for some users, especially when the device is worn for extended periods of time, which is where the secondary over-the-head strap comes in.\r<br />\n\r<br />\nHowever, it appears as if Apple has not yet fine-tuned the head strap to meet its own standards. According to a <a href=\"https://www.bloomberg.com/news/articles/2023-07-07/apple-vision-pro-headset-to-launch-in-us-stores-by-appointment\">new report</a> by <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>, the secondary strap was introduced after testing determined that some people with smaller body sizes and heads struggle to wear the headset for more than half an hour or thereabouts. However, the design of the strap has \"yet to be finalized,\" says Gurman.\r<br />\n\r<br />\nOne member of the press who got to try the headset in person at <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> was <em>MacRumors</em> videographer Dan Barbera. \"A lot of people probably didn't know this just by looking at some press images, but there is another band that goes over the top of your head,\" said Dan in his <a href=\"https://www.macrumors.com/2023/06/07/apple-vision-pro-hands-on/\">initial impressions video</a>.\r<br />\n\r<br />\nIn his opinion, with the additional strap attached, the Vision Pro is \"not that far off from other headsets in terms of weight,\" but it does \"a really good job of dispersing that weight\" and making it not so front-heavy. \"I do think most people will want to use it,\" he added. Whether it's the same strap design when the product launches remains to be seen.\r<br />\n\r<br />\nApple has not revealed the weight of the Vision Pro, but its decision to offload the battery to an external pack highlights the need to keep the headset as light as possible. Acknowledging that some customers may not wear clothes with pockets capable of storing the battery pack, Apple has also considered asking accessory makers to create shoulder-worn pouches, according to Gurman.\r<br />\n\r<br />\nGurman's latest report also reveals that Apple plans to launch the Vision Pro headset in the <a href=\"https://www.macrumors.com/2023/07/07/apple-vision-pro-launch-uk-canada-end-of-2024/\">U.K. and Canada by the end of 2024</a>, with preparations for the device's complex retail launch in the U.S. early next year already at an advanced stage.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/07/apple-vision-pro-secondary-head-strap/\">Apple Vision Pro Secondary Head Strap Design 'Yet to Be Finalized'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-secondary-head-strap-design-yet-to-be-finalized.2395281/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c614737e83726f35f94e66b2814ba947f06e5db6ca33691f7e587f6b26061652","category":"Apple"}