{"title":"The Wolf of Wall Street","link":"https://markpeak.net/the-wolf-of-wall-street/","date":1690786567000,"content":"<p>กระแส Margot Robbie กำลังมาแรงจากเรื่อง Barbie เลยไปขุดหนังเก่าที่สร้างชื่อให้เธอคือ The Wolf of Wall Street กลับมาดูใหม่อีกครั้ง</p>\n<p>เนื่องจากเป็นการดูรอบที่สอง รู้โครงเรื่องหลักๆ อยู่แล้วเลยไม่ได้ตื่นเต้นมากนัก ประเด็นจากการดูรอบสองเท่าที่นึกได้</p>\n<ul>\n<li>หนังมันยาวมาก 3 ชั่วโมงเต็ม รู้สึกว่ายาวไปแล้วสำหรับยุคนี้ (น่าจะเป็นลายเซ็นประจำตัวของ Scorsese ที่ต้องทำหนังยาวๆ ทุกเรื่อง) พอมาดูอีกรอบก็พบว่ามันมีฉากเยิ่นเย้ออยู่เยอะเหมือนกัน โดยเฉพาะฉาก sex &amp; drug ที่รู้สึกว่าใส่มาจนเฝือ เยอะเกินไปแล้ว</li>\n<li>สิ่งที่ทำได้ดีคือการแสดง โดยเฉพาะของ Leonardo DiCaprio ที่ใส่จนสุดจริงๆ กับการถ่ายฉากใหญ่ๆ เช่น ปาร์ตี้ในออฟฟิศ ปาร์ตี้ในเรือ ที่ทำได้ยิ่งใหญ่อลังการจริง</li>\n<li>พอมาดูหนังที่เกี่ยวกับการขายหุ้นทางโทรศัพท์ในยุคนี้ (2023) เลยพบว่า perception ของคนในยุคนั้น (80s ตอนปลาย) ยินดีคุยกับคนแปลกหน้าในโทรศัพท์อย่างมาก ซึ่งเป็นคนละเรื่องเลยกับคนในยุคปัจจุบันที่เจอแก๊งคอลล์เซ็นเตอร์ (หรือ phone scam ในต่างประเทศ) จนไม่อยากคุยกับคนแปลกหน้าทางโทรศัพท์อีกแล้ว และการทำงานของบริษัท Stratton Oakmont เองก็แทบไม่ต่างอะไรจากแก๊งคอลล์เซ็นเตอร์ในยุคปัจจุบัน</li>\n<li>Margot Robbie นี่สวยจริง ตอนเล่นเรื่องนี้เธออายุแค่ 22-23 ปีเอง (เกิด 1990)</li>\n<li>Jordan Belfort ตัวจริงโผล่มาในหนังด้วยตอนท้าย โดยเล่นเป็นพิธีกรที่เชิญ Leonardo ขึ้นมาพูดเรื่องการขายปากกาบนเวที</li>\n<li>พอมาดูในยุคนี้ ก็มีฟุตเตจเก่าของ Jordan Belfort ยุครุ่งเรือง ว่าของจริงๆ เขาฉลองกันหนักแค่ไหนอย่างไร มาพอให้เห็นภาพด้วย (และพบว่าหนังทำเหมือนอยู่) ต้องขอบคุณอารยธรรม home video ของยุคสมัยนั้น</li>\n</ul>\n<p></p>The post <a href=\"https://markpeak.net/the-wolf-of-wall-street/\">The Wolf of Wall Street</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"c61a67c3b384a8fe4fd63b35c61425391fcb550b9a2b5d320ad24a776fe15fd1","category":"Thai"}