{"title":"Report: 2026 Apple Watch Ultra to get bigger display and higher price tag","link":"https://www.macworld.com/article/2173699/report-2026-apple-watch-ultra-to-get-bigger-display-and-higher-price-tag.html","date":1702667916000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple could update the Apple Watch Ultra to a microLED display that’s larger than the current OLED display, but the upgrade could also result in a higher price tag. That’s according to a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.trendforce.com/news/2023/12/15/trendforces-first-seminar-in-japan-spotlights-tsmc-rapidus-and-japanese-semiconductor-revitalization/&amp;xcust=1-1-2173699-1-0-0&amp;sref=https://www.macworld.com/feed\">report by market analysts at TrendForce</a>.</p>\n\n\n\n<p>TrendForce states that microLEDs can be as high as three times more expensive than OLEDs, and that’s after Apple exerts its “strong bargaining power in the supply chain.” While Apple may be able to reduce costs in other production aspects of the watch, it could likely mean that the price to the consumer will go up.</p>\n\n\n\n<p>One way Apple could attempt to justify the price hike to the consumer is with the larger usable display that microLED will allow. TrendForce states that the display could expand to 2.12 inches (54 millimeters), an increase over the current 1.93 inches (49 mm).</p>\n\n\n\n<p>TrendForce projects Apple’s microLED adoption for 2026. Almost a year ago, Bloomberg’s Mark Gurman <a href=\"https://www.macworld.com/article/1469935/apple-watch-switch-superior-microled-display.html\">reported</a> that Apple will use the technology in 2024, but then that was followed in July by a TrendForce <a href=\"https://www.macworld.com/article/1982361/microled-apple-watch-ultra-manufacturing-problems.html\">report</a> that initially proposed the 2026 timeline for a microLED Apple Watch Ultra.</p>\n\n\n\n<p>Apple currently uses OLED displays for all Apple Watch models. MicroLED displays have thinner panels that are brighter and use less energy. But microLED production has its difficulties; TrendForce states that “Apple’s outstanding ability to integrate new technologies and specifications” could provide a production boost that would “injecting abundant vitality” into microLED manufacturing.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c628f6326df8d50f07c5ead69e3451661d044bda7f61fbb6652cb9af97a08fc0","category":"Apple"}