{"title":"Effects of high temperature on grain quality and enzyme activity in heat‐sensitive versus heat‐tolerant rice cultivars","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13797?af=R","date":1723550332000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>High-temperature (HT) stress significantly affects the quality of rice (<i>Oryza sativa</i> L.), although the underlying the mechanism remains unknown. Therefore, in the present study, we assessed protein components, amino acids, mineral element levels, starch biosynthesis enzyme activity and gene expression of two heat-sensitive and two heat-tolerant genotypes under HT treatment during early (from 1 to 10 days, T1) and mid-filling (from 11 to 20 days, T2) after anthesis.</p>\n<h2>RESULTS</h2>\n<p>Except for one cultivar, most rice varieties exhibited increased levels of amylose, chalky degree and protein content, along with elevated cracked grains and pasting temperatures and, consequently, suppressed amino acid levels under HT stress. HT treatment also increased protein components, macro- (Mg, K, P and S) and microelements (Cu, Zn, and Mo) in the rice flour. Both HT treatments reduced the activity of ADP-glucose pyrophosphate, ground-bound starch synthase, as well as the relative ratio of amylose to total starch, at the same time increasing starch branch enzyme activity. The expression levels of <i>OsAGPL2</i>, <i>OsSSS1</i> and <i>OsSBE1</i> in all varieties exhibited the same trends as enzyme activity under HT treatment.</p>\n<h2>CONCLUSION</h2>\n<p>High temperatures negatively affected rice quality during grain filling, which is related to heat tolerance and grain shape. Altered enzymatic activity is crucial to compensate for the lowered enzyme quality under heat stress. © 2024 Society of Chemical Industry.</p>","author":"Rong Zhou, \nQijuan Hu, \nXiangfeng Meng, \nYue Zhang, \nXingyang Shuai, \nYangfan Gu, \nYueyu Li, \nMoxian Chen, \nBaohua Wang, \nYunying Cao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c63cce76036c19562fe2155f8c8d2265211dc306bb1dffe4caa0e73455b4a7cc","category":"Environment"}