{"title":"507 Effects of simple and complex polycrop mixtures on forage yield and quality, beef cow performance, and methane emissions","link":"https://academic.oup.com/jas/article/102/Supplement_3/138/7757279?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Polycrop mixtures are of increasing interest to western Canadian beef producers as alternative forages for grazing as they may promote plant biodiversity and nutritive value. This 2-yr study evaluated the effects of swath grazing either simple or complex polycrop mixtures on forage yield and quality, beef cow performance, and methane emissions. Forage treatments included 1) CDC Haymaker oat (<span>Avena sativa</span>; Control); 2) CDC Haymaker oat, Goliath brassica (<span>Brassica napus</span>), hairy vetch (<span>Vicia villosa</span>), CDC Jasper pea (<span>Pisum sativum</span>; Simple); and 3) CDC Haymaker oat, Goliath brassica, hairy vetch, CDC Jasper pea, CDC Maverick barley (<span>Hordeum vulgare</span>), Red proso millet (<span>Panicum miliaceum</span>), Teff grass (<span>Eragrostis tef</span>) and Choice chicory (<span>Cichorium intybus</span>; Complex). Dry pregnant beef cows [n = 90; body weight (BW) = 607.2 ± 32.3 kg; body condition score (BCS) = 2.9 ± 0.06] blocked by BW were randomly allocated to 1 of 9 paddocks (10 cows/paddock). Paddocks were randomly assigned 1 of 3 replicated (n = 3) systems. Cow BCS was measured at start (SOT) and end (EOT) of trial. Cow BW was recorded on 2 consecutive days at the SOT and EOT, and every 21 d during trial. Cows grazed for an average of 52 d from October to December (Control 51 ± 9.07 d; Simple 54 ± 9.20 d; Complex 53 ± 12.41 d). Data were analyzed as a completely randomized block design using the mixed model of SAS (9.4). Year and paddock were included as a random effect. Forage dry matter yield (DMY) was similar (<span>P</span> = 0.44) among Control (4,369 kg/ha), Simple (4,053 kg/ha), and Complex (4,245 kg/ha) treatments. Start of trial forage crude protein (CP) and total digestible nutrients (TDN) did not differ (<span>P</span> = 0.18 and <span>P</span> = 0.14) among treatments (Control 13.3% CP and 74.4% TDN; Simple 14.76% CP and 71.51% TDN; Complex 14.95% CP and 74.46% TDN). End of trial forage CP and TDN did not differ (<span>P</span> = 0.57 and <span>P</span> = 0.20) among treatments (Control 13.9% CP and 69.5% TDN; Simple 13.9% CP and 69.9% TDN; Complex 13.2% CP and 72.4% TDN). Cow BCS and average daily gain did not differ among forage treatments (<span>P</span> = 0.60 and <span>P</span> = 0.45, respectively). Cow dry matter intake (DMI) was similar (<span>P</span> = 0.19) among treatments (Control 11.13 kg/d; Simple 9.74 kg/d; Complex 9.96 kg/d). Methane emissions were greatest (<span>P</span> = 0.04) for cows grazing Simple (28.7 CH<sub>4</sub> g/kg DMI) and Complex treatments (28.2 CH<sub>4</sub> g/kg DMI) compared with monoculture oat treatment (22.6 CH<sub>4</sub> g/kg DMI). Study results suggest that simple or complex polycrop mixtures may be used as forage alternatives to a monoculture oat grazing system as they produce adequate biomass and had nutritive value suitable for gestating beef cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c64349ac347f6ce0e276fdb47d01f2d9bb48805bad882513e15ec2dceca0c9c8","category":"Environment"}