{"title":"Bullying victimization among adolescents: Prevalence, associated factors and correlation with mental health outcomes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299161","date":1710770400000,"content":"<p>by Mariem Ghardallou, Ahlem Mtiraoui, Dorra Ennamouchi, Amel Amara, Amel Gara, Maha Dardouri, Chekib Zedini, Ali Mtiraoui</p>\r\nIntroduction <p>Knowledge of the risk factors of bullying victimization in adolescents is crucial for the implementation of preventive measures. This study aimed to determine the prevalence and associated factors of bullying victimization and to identify its correlation with mental health outcomes among middle school students in Tunisia.</p> Methods <p>A cross-sectional study was conducted using a multi-stage cluster sampling technique to recruit a sample of 1111 students from 10 middle schools in El kef (Tunisia). The revised Olweus Bully/Victim Questionnaire was used to assess the prevalence and types of bullying victimization and the perceived efforts of others to counteract bullying. The Strengths and Difficulties Questionnaire (SDQ) was used for screening emotional and behavioral problems. Multivariate logistic regression analysis was conducted to determine associated factors of bullying victimization. Additionally, we tested whether emotional and behavioral problems were present for bullying victims.</p> Results <p>The findings reported that 45.8% (95%CI = 45.5–46.0), of the total number of participants experienced school bullying victimization. Multivariate logistic regression analysis, revealed that repeating a grade (OR = 1.82, 95%CI = 1.31–2.54), having a working father (OR = 17.68; 95%CI = 2.29–136,15), and having a working mother (OR = 1.88, 95%CI = 1.39–2.53) were the factors significantly associated with bullying victimization. Nevertheless, a higher mother’s educational level (OR = 0.76, 95%CI = 0.67–0.88) was a protective factor against bullying victimization. The self-reported SDQ revealed that the total difficulties score was significantly higher among victims (17.46 ± 5.30 vs. 20.86 ± 5.06, p&lt;0.01).</p> Conclusions <p>This study showed that the prevalence of bullying in middle schools was high and it significantly led to mental health problems. National policies for bullying prevention within schools are potentially needed. Improving students’ problem-solving and soft skills is also essential.</p>","author":"Mariem Ghardallou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c64bef14a20e5d2c61f026d5d1c3bb077aae9ff201221b35c566ac7a97ac71de","category":"Interdisciplinary"}