{"title":"CES 2024: Alogic Launches Innovative 'Matrix Ultimate' 3-in-1 Charger and 32-Inch 4K Displays With Optional Touchscreen","link":"https://www.macrumors.com/2024/01/09/ces-2024-alogic-charger-displays/","date":1704809301000,"content":"At <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a> this week, accessory company <a href=\"https://alogic.co/?ref=y2uwzwu\">Alogic</a> is launching several new products in the display and charging categories, with both lineups offering some innovative features.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-clarity-32-display-matrix-ultimate.jpg\" width=\"1600\" height=\"900\" />\r<br />\nFirst, Alogic's new Matrix lineup will offer an array of wireless chargers and power banks such as the Matrix Ultimate that I've had a chance to try out.\r<br />\n\r<br />\nThe <a href=\"https://alogic.co/products/matrix-ultimate-3-in-1-wireless-charger-with-5-000mah-magsafe-power-bank/?ref=y2uwzwu\">Matrix Ultimate</a> is a 3-in-1 folding stand with an integrated power bank. In stand mode, it's a fairly typical 3-in-1 charger, with an official <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> charging pad for your phone plus an elevated Apple Watch charger on behind the device and a spot on the rear portion of the base for AirPods or another Qi device.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-matrix-ultimate-front.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe AirPods charging spot is unfortunately not magnetic, so you'll need to manually ensure your AirPods are properly aligned for charging, but it seems pretty forgiving on the placement and with supported AirPods you can also use the magnetic Apple Watch charger on the stand.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-matrix-ultimate-rear.jpg\" width=\"1600\" height=\"900\" />\r<br />\nBeyond being a typical 3-in-1 charger, the Matrix Ultimate has a few tricks up its sleeve. First, the ‌MagSafe‌ charging pad is actually part of a 5,000 mAh power bank that slides into the stand where it supports the phone and receives fixed power from the base unit. Even in power bank mode, it still supports 15-watt ‌MagSafe‌ charging.\r<br />\n\r<br />\nThe power bank is fairly compact, but it's a little thicker than some other 5,000 mAh options on the market and only the ‌MagSafe‌ pad portion of it sits flush against the back of the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, so it will pop loose from the phone if you press the lower portion of the power bank toward the phone. As a result, this isn't the type of magnetic power bank I would want to leave attached to my phone throughout the day, but for periodic charging while in a fixed location it would be perfectly fine.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-matrix-ultimate-power-bank.jpg\" width=\"1600\" height=\"900\" />\r<br />\nIn addition to the removable power bank, the Matrix Ultimate also features a removable Apple Watch charging puck that connects to the body of the stand via USB-C. The puck supports Apple Watch fast charging, and the removable design gives you the flexibility to take just the Apple Watch charger with you depending on what you need. You can then just plug it directly into a power adapter, a computer USB port, or even the USB-C port on the Matrix Ultimate power bank in order to recharge your watch.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-matrix-ultimate-removables.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe third trick up the Matrix Ultimate's sleeve is that the whole things folds down for travel and can be stored in a felt travel case alongside the provided USB-C to USB-C cable and 30-watt power adapter with folding prongs in the U.S. The whole thing remains a bit on the bulky side due in part to the hardware needed for the removable power bank, but it should still pack easily in most computer bags, backpacks, or suitcases.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-matrix-ultimate-parts.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe Matrix Ultimate is largely constructed of a matte white plastic with a shiny chrome-colored hinge between the stand and base, though this is essentially hidden unless the stand is viewed from the rear. It's <a href=\"https://alogic.co/products/matrix-ultimate-3-in-1-wireless-charger-with-5-000mah-magsafe-power-bank/?ref=y2uwzwu\">priced at $169.99</a> in the U.S. and roughly equivalent amounts in the UK, EU, and Australia. A multi-country model including a 35-watt adapter with plugs for the US, UK, EU, and Australia will be $10 more. Alogic currently has a sale going that knocks 20% off of those prices with coupon code CS20, bringing the U.S. model down to $136.00.\r<br />\n\r<br />\nSecond, the company is expanding its line of Clarity displays to include a trio of 32-inch models. Just like with the <a href=\"https://www.macrumors.com/review/alogic-clarity-pro-touch-displays/\">27-inch Clarity displays</a> released last year, the 32-inch options include a <a href=\"https://alogic.co/products/clarity-max-32-uhd-4k-monitor-with-usb-c-power-delivery/?ref=y2uwzwu\">base model</a>, a <a href=\"https://alogic.co/products/clarity-max-pro-32-uhd-4k-monitor-with-usb-c-power-delivery-and-webcam/?ref=y2uwzwu\">middle-tier model</a> with a motorized retractable 8-megapixel webcam, and a <a href=\"https://alogic.co/products/clarity-max-touch-32-uhd-4k-monitor-with-usb-c-power-delivery-webcam-and-touch-screen/?ref=y2uwzwu\">high-end model</a> with both webcam and touchscreen support.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-32-clarity-display.jpg\" width=\"1600\" height=\"970\" />\r<br />\nAll three displays offer 4K resolution at 60 Hz, which still looks decent at reasonably scaled desktop sizes, but you won't get the true Retina quality you see on higher-density displays like 27-inch 5K displays and you won't get the benefit of higher refresh rates.\r<br />\n\r<br />\nThe 32-inch models all provide up to 65-watts of passthrough power via USB-C to keep your laptop charged, which should be sufficient for most users, although the most powerful MacBook Pro models could draw more than that under heavy load.\r<br />\n\r<br />\nAll three models also have a small USB hub on the rear of the display with a pair of USB-A ports (5 Gbps and 7.5 watts) plus a 3.5mm combo audio jack. If you want or need to use something other than USB-C, the display also include a pair of HDMI 2.1 ports and a DisplayPort 1.4 port\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-32-clarity-display-ports.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe included stand on all Clarity Max models supports tilt and height adjustments, as well as the ability to pivot the display to portrait mode. The display can also be used with 100x100 VESA mounts.\r<br />\n\r<br />\nI've had a brief opportunity to try out the high-end Clarity Max Touch model, and my impressions are very similar to those from the corresponding 27-inch model, just with a bigger display. The touchscreen functionality is highly customizable on a per-app basis with the system able to recognize several different gestures, which is fantastic.\r<br />\n\r<br />\nI still don't see myself using the touchscreen capabilities (which can be used with fingers or a capacitive stylus, but not an <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>) on a full-time basis, but especially in a multi-monitor setup it can be handy to be able to quickly tap on the screen rather than having to move a mouse cursor across multiple displays.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-32-clarity-display-camera.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe retractable webcam offers some nice peace of mind, as once it's tucked away you can be sure that it's not being used to surreptitiously monitor you. And at 8 megapixels, it offers solid quality better than many other built-in webcams found on displays, although it doesn't match what you get when using an ‌iPhone‌ via Continuity Camera.\r<br />\n\r<br />\nThe stand is a high-quality two-piece aluminum design that provides very good stability and smooth adjustments, plus a passthrough to help with cable management. The display itself is constructed of a silver plastic shell on the back with nearly edge-to-edge glass on front. There are definite black bezels on all four sides under the glass, with the bottom being somewhat wider than the other three.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/alogic-32-clarity-display-rear.jpg\" width=\"1600\" height=\"920\" />\r<br />\nThe base <a href=\"https://alogic.co/products/clarity-max-32-uhd-4k-monitor-with-usb-c-power-delivery/?ref=y2uwzwu\">Clarity Max</a> model is priced at $999.99, while the <a href=\"https://alogic.co/products/clarity-max-pro-32-uhd-4k-monitor-with-usb-c-power-delivery-and-webcam/?ref=y2uwzwu\">Clarity Max Pro with retractable webcam</a> is priced at $1,199.99, and the top-of-the-line <a href=\"https://alogic.co/products/clarity-max-touch-32-uhd-4k-monitor-with-usb-c-power-delivery-webcam-and-touch-screen/?ref=y2uwzwu\">Clarity Max Touch with webcam and touchscreen capabilities</a> is priced at $1,399.99, but Alogic's sale currently knocks 20% off of those prices with coupon code CS20.\r<br />\n\r<br />\n<small><em>Note: Alogic provided MacRumors with the Clarity Max Touch display and the Matrix Ultimate for the purpose of this hands-on coverage. No other compensation was received. MacRumors is an affiliate partner with Alogic. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</em></small><div>Tags: <a href=\"https://www.macrumors.com/guide/alogic/\">Alogic</a>, <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/ces-2024-alogic-charger-displays/\">CES 2024: Alogic Launches Innovative 'Matrix Ultimate' 3-in-1 Charger and 32-Inch 4K Displays With Optional Touchscreen</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ces-2024-alogic-launches-innovative-matrix-ultimate-3-in-1-charger-and-32-inch-4k-displays-with-optional-touchscreen.2415857/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c654daaa3dbb87f47fd3181d690b6012468914eef0615bcabff031a7e81d596f","category":"Apple"}