{"title":"Impact of binary mixtures of natural waxes in mechanical properties and microstructure of oleogels","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13449?af=R","date":1709909343000,"content":"<h2>ABSTRACT</h2>\n<h2>Background</h2>\n<p>Solid fats are critical to obtaining a wide range of food texture and quality characteristics, but their consumption is strongly associated with higher cardiovascular disease risks. Structuring unsaturated oils with natural waxes into oleogels (OG) is an innovative solution to develop fat mimics with a healthier profile.</p>\n<h2>Results</h2>\n<p>Soy wax (SW), beeswax (BW), and carnauba wax (CW), have been used in binary mixtures of waxes, to understand their interactions and influence on OG quality properties and microstructural characteristics. In this study, oleogels were produced using binary wax mixtures and analyzed for texture, color, smoke point, microstructure, FTIR, and XRD. Wax combinations led to antagonistic (mixtures with SW) and synergistic interactions (BW/CW) based on their mechanical properties. At the microstructural level BW/CW blends showed a reduction in crystal size and with a more compact structure. XRD and FTIR spectra revealed a packing of orthorhombic perpendicular subcell for most oleogels, whereas SW produced samples with an arrangement with β’ crystals, characteristic of edible solid fats. Additionally, when compared to commercial beef fat, BW/CW mixtures showed similar quality attributes indicating that they could act as fat mimic.</p>\n<h2>Conclusion</h2>\n<p>The combined analysis of microstructure, spectroscopic, and mechanical properties enhanced the understanding of how the nature of the interactions between waxes and lipid phases impact in the final quality of the structured oils.</p>\n<p>The study's insights indicate that binary wax combinations, can efficiently replace solid fats, offering healthier alternatives while preserving desired sensory characteristics.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Neuvis Alejandro Pino, \nLucas Marchetti, \nGabriel Lorenzo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c658c3a7bf556a7b4e95e0a40737d18ee5e0e5c0896845b1f1caaf7dfca2bddb","category":"Environment"}