{"title":"Assessing the Reliability of the Sexual Violence Questionnaire in Sport Among Spanish-Speaking Athletes","link":"https://www.preprints.org/manuscript/202407.2590/v1","date":1722483581000,"content":"The prevalence of sexual harassment and abuse in school sport, specifically from coaches to their athletes remains a concerning and pervasive issue. In an attempt to better understand and prevent specific coach-behaviours associated with such sexual misconduct, researchers have developed the Sexual Violence Questionaire in Sport. While the reliability of this measurement tool has been tested in anglo-saxon cultural contexts, it is not known whether the questionnaire is applicable to other cultural contexts. A sample of 146 (52 female, 94 male) Bachelor students from a university in the Basque Country participated in this cross cross-sectional study. The questionnaire was administered twice over a two-week period to assess test-retest reliability. The internal consistency of the Sexual Violence Questionaire in Sport was high, with Cronbach's alpha values of 0.891 for perceptions and 0.813 for experiences across all participants. Gender-specific analysis showed similar reliability, with females having slightly lower alpha values for perceptions. Significant differences between test and retest were found (10 from perceptions 2 from experiences). However, Cohen’s Kappa analysis showed significant agreement across all items. In conclusion, the study highlights the questionnaire’s overall reliability and suggests its effectiveness as a tool for measuring sexual violence in sports within the Spanish context. Nonetheless, the findings of this study underscore the need for further research to enhance the instrument's stability and to better understand gender differences in perceptions and experiences of sexual violence in sports contexts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c6595f201d66fbc713d87a9feb35413a2785018cf8854d1fb64a385dd2289961","category":"Interdisciplinary"}