{"title":"Facebook เริ่มทดสอบ Novi กระเป๋าเงินดิจิทัลแล้ว ใช้ Stablecoin USDP ในการโอนเงินระหว่างกัน","link":"https://www.blognone.com/node/125359","date":1634657704000,"content":"<div><div><div><p>Facebook ประกาศว่าจะเริ่มทดสอบการใช้งานกระเป๋าเงินดิจิทัล Novi กับผู้ใช้จำนวนเล็ก ๆ เป็นกลุ่มแรก ในอเมริกาและกัวเตมาลา โดยมีวัตถุประสงค์เพื่อดูความพร้อมของระบบดำเนินการ ตลอดจนระบบสนับสนุนลูกค้าทุกส่วนว่าสามารถทำงานได้เป็นอย่างดี</p>\n<p>โครงการกระเป๋าเงินดิจิทัล เปิดตัวตั้งแต่ปี 2019 โดยตอนแรกใช้ชื่อว่า <a href=\"https://www.blognone.com/node/110406\">Calibra</a> เพื่อรองรับเงินสกุล <a href=\"https://www.blognone.com/node/110404\">Libra</a> (ตอนนี้ชื่อ <a href=\"https://www.blognone.com/node/119895\">Diem</a>) แต่ต่อมาก็<a href=\"https://www.blognone.com/node/116586\">เปลี่ยนชื่อเป็น Novi</a> เพื่อไม่ให้สับสนกับชื่อ Libra ในตอนนั้น</p>\n<p>จุดขายของ Novi คือช่วยให้ผู้ใช้งานสามารถโอนและรับเงินได้ทันที ปลอดภัย และไม่มีค่าธรรมเนียม โดยในการทดสอบนี้ Novi จะเน้นไปที่การโอนเงินจากคนที่อยู่อเมริกา ที่ต้องการโอนเงินกลับไปที่กัวเตมาลา แบบสะดวกง่ายเหมือนการส่งข้อความแชตใน Facebook</p>\n<p>ในช่วงทดสอบนี้เงินที่โอนหากันจะเป็น Stablecoin สกุล Pax Dollar หรือ USDP โดย Novi ได้ Paxos และ Coinbase มาเป็นพาร์ตเนอร์ ถึงตรงนี้ก็อาจสงสัยว่าทำไม Novi ถึงไม่ใช้เงิน Diem ในการทดสอบ ซึ่งคำอธิบายคือ Diem ยังอยู่ในขั้นตอนจากหน่วยงานกำกับดูแล แต่ตัวโครงการ Novi ยังคงสนับสนุน Diem อยู่ ส่วนเหตุผลที่ใช้ USDP ในการทดสอบ เพราะเป็น Stablecoin ที่มีการใช้งานมามากกว่า 3 ปี แล้ว จึงเป็นตัวเลือกที่เหมาะสม</p>\n<p>Novi เปิดให้ดาวน์โหลดแอปแล้วทั้งใน App Store และ Google Play เฉพาะอเมริกาและกัวเตมาลา โดยช่วงแรกเมื่อสมัครใช้งานแล้ว ต้องรอการจัดสรร ทั้งนี้บัญชีผู้ใช้งาน Novi จะแยกขาดจากบัญชี Facebook</p>\n<p>ที่มา: <a href=\"https://www.novi.com/file/pilot-version-of-novi-now-available\">Novi</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/569868867245191499c2a1cbaa302fcd.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/novi\">Novi</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c65e506c28b93af7a5147e36d2bd7704afeda41157fb4dfc2fa5a3d696346a4d","category":"Thai"}