{"title":"These solar-powered, origami-inspired robots can change shape mid-flight","link":"https://arstechnica.com/?p=1967123","date":1695917035000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/microflier2-800x533.jpg\" alt=\"Timelapse photo of the \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/microflier2.jpg\">Enlarge</a> <span>/</span> Timelapse photo of the \"microflier\" falling in its unfolded state, which makes it tumble chaotically in the wind. \"Snapping\" into a folded state results in a stable upright descent. (credit: Mark Stone/University of Washington)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>University of Washington scientists have built a battery-free flying robot that stabilizes its descent by changing shape in mid-air—a design that was inspired by origami, according to a <a href=\"https://www.science.org/doi/10.1126/scirobotics.adg4276\">recent paper</a> published in the journal Science Robotics. These microfliers weigh just 400 milligrams, and if there's a nice light breeze, they can travel the length of a football field when dropped by a drone from an altitude of 40 meters (131 feet).</p>\n<p>Miniature robotics is a very active area of research. For instance, earlier this year, <a href=\"https://arstechnica.com/science/2023/02/mini-robot-shifts-from-solid-to-liquid-to-escape-its-cage-just-like-the-t-1000/\">we reported</a> on how engineers <a href=\"https://www.cell.com/matter/fulltext/S2590-2385(22)00693-2?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS2590238522006932%3Fshowall%3Dtrue\">built a soft robot</a> in the shape of a Lego minifig. The robot changes shape by \"melting\" into liquid form in response to a magnetic field, oozing between the bars of its cage before re-solidifying on the other side—just like <a href=\"https://www.youtube.com/watch?v=4sVta4ows78\">the T-1000</a> in <em>Terminator 2: Judgment Day</em>. That robot belongs to a class known as magnetically actuated miniature machines, typically made of soft polymers (like elastomers or hydrogels) embedded with ferromagnetic particles that have programmed magnetization profiles. These kinds of robots can swim, climb, roll, walk, and jump, as well as change their shape simply by altering the corresponding magnetic field.</p>\n<p>As for flying robots, back in 2017, <a href=\"https://arstechnica.com/science/2018/09/this-nifty-flying-robot-can-hover-bank-and-turn-as-deftly-as-a-fruit-fly/\">we reported</a> on Dutch scientists who <a href=\"http://science.sciencemag.org/cgi/doi/10.1126/science.aat0350\">built a flying robot</a> capable of executing the impressive aerodynamic feats flying insects like bees, dragonflies, and fruit flies, particularly when said insects seek to evade predators or the swatting motion of a human hand. Even though the robot was much larger than the average insect, it could hover and fly in any direction (up, down, forward, backward, and sideways), as well as perform banked turns and 360-degree flips, akin to loops or barrel rolls. It also boasted excellent power efficiency, capable of hovering for five minutes or flying more than a kilometer on a single charge.</p></div><p><a href=\"https://arstechnica.com/?p=1967123#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967123&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c66952d6c79cd85e2848ac444f11f998a3eef69a36605b7ea74f3dafdfb99c21","category":"Tech"}