{"title":"Toward a Natural History of Microbial Life","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-070542?TRACK=RSS","date":1721692800000,"content":"<div><p>For most of Earth's history life was microbial, with archaeal and bacterial cells mediating biogeochemical cycles through their metabolisms and ecologies. This diversity was sufficient to maintain a habitable planet across dramatic environmental transitions during the Archean and Proterozoic Eons. However, our knowledge of the first 3 billion years of the biosphere pales in comparison to the rich narrative of complex life documented through the Phanerozoic geological record. In this review, we attempt to lay out a microbial natural history framework that highlights recent and ongoing research unifying microbiology, geochemistry, and traditional organismal evolutionary biology, and we propose six broadly applicable principles to aid in these endeavors. In this way, the evolutionary history of microbial life—once considered only a prelude to the much more storied history of complex metazoan life in the Phanerozoic—is finally coming into its own.\n</p><ul>\n<li><span>▪ \n</span>The outlines of microbial natural history are now starting to appear through the integration of genomic and geological records.\n</li>\n<li><span>▪ \n</span>Microorganisms drive Earth's biogeochemical cycles, and their natural history reflects a coevolution with the planet.\n</li>\n<li><span>▪ \n</span>Past environmental changes have induced microbial biotic transitions, marked by extinction, taxonomic shifts, and new metabolisms and ecologies.\n</li>\n<li><span>▪ \n</span>Microbial evolution can benefit from a historical perspective of processes and successions as established by macropaleontology.\n</li>\n</ul><p></p></div>","author":"Cara Magnabosco, Fatima Husain, Madeline M. Paoletti, Chris Parsons, Jack G. Payette, Sarah L. Schwartz, Erik Tamre and Gregory P. Fournier","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"c669113c256e1b61957d64220b22c7f063481cc1e49328056faf924cee5cd11c","category":"Environment"}