{"title":"Apple's Dan Riccio Reportedly Near Retirement After Vision Pro Launch","link":"https://www.macrumors.com/2024/03/03/apples-dan-riccio-nearing-retirement-report/","date":1709471280000,"content":"Apple's former hardware engineering chief Dan Riccio told colleagues he is \"nearing retirement\" after more than 25 years at the company, according to <a href=\"https://www.bloomberg.com/news/newsletters/2024-03-03/why-was-apple-car-canceled-the-hubris-in-apple-thinking-it-could-outdo-tesla-ltbke5ut\"><em>Bloomberg</em>'s Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/Apple-Dan-Riccio.jpg\" width=\"1600\" height=\"900\" />\r<br />\nJohn Ternus <a href=\"https://www.macrumors.com/2021/01/25/dan-riccio-transitioning-new-project/\">succeeded</a> Riccio as Apple's Senior Vice President of Hardware Engineering in 2021. That year, Apple said Riccio would \"transition to a new role focusing on a new project,\" which Gurman said was the Vision Pro headset.\r<br />\n\r<br />\nHere is how Apple described Riccio when it announced that transition in 2021:<blockquote>Riccio has been a leader in designing, developing, and engineering almost all of Apple's products. From the first generation iMac to the more recent 5G iPhone lineup, M1-based Macs, and AirPods Max, Riccio built the Hardware Engineering teams and scaled Apple's ability to innovate across multiple new product lines with the highest quality. After joining Apple in 1998 as a leader on the Product Design team, Riccio became vice president of iPad Hardware Engineering in 2010, and in 2012 he joined the executive team as the leader of Hardware Engineering.</blockquote>Here is what Riccio said in that press release:<blockquote>Working at Apple has been the opportunity of a lifetime, spent making the world's best products with the most talented people you could imagine. After 23 years of leading our Product Design or Hardware Engineering teams — culminating with our biggest and most ambitious product year ever — it's the right time for a change. Next up, I'm looking forward to doing what I love most — focusing all my time and energy at Apple on creating something new and wonderful that I couldn't be more excited about.</blockquote>Apple launched the Vision Pro in the U.S. <a href=\"https://www.macrumors.com/2024/02/02/apple-vision-pro-launch-day/\">in early February</a>, and it said the headset will be released in additional countries later this year.\r<br />\n\r<br />\nThere is no timeframe for Riccio's retirement, as Gurman said specific details related to his planned departure are still being worked out.<div>Tags: <a href=\"https://www.macrumors.com/guide/dan-riccio/\">Dan Riccio</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/03/apples-dan-riccio-nearing-retirement-report/\">Apple's Dan Riccio Reportedly Near Retirement After Vision Pro Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-dan-riccio-reportedly-near-retirement-after-vision-pro-launch.2420929/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c671465185ff5cb7a947e1e4a5e1f82f9028b509e49c478bfb964c8d85d44c7b","category":"Apple"}