{"title":"Sarah Gigante to join Movistar in 2022","link":"https://cyclingtips.com/2021/08/sarah-gigante-to-join-movistar-in-2022/","date":1629298285000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033013-128-650x424.jpg\" /></div><h2>Sarah Gigante to join Movistar in 2022</h2><p>\n</p><p>Current Australian time trial national champion Sarah Gigante will join Movistar in 2022 after two years with Team TIBCO-SVB. Gigante joins the Spanish team on a three-year deal that means the young talent is secure with one team through the next Olympic cycle. </p>\n\n\n\n<p>“I’m incredibly excited to be joining the Movistar Team next year, for so many different reasons that I can’t even list them all,” said Gigante. I love that the Movistar Team has such a flexible squad that seems to be able to excel in so many types of races.”</p>\n\n\n\n<blockquote><p>“I think I will fit well inside the team for this reason, as the idea of adapting to different and exciting roles, races and situations really appeals to me.”</p></blockquote>\n\n\n\n<p>Gigante first entered the Australian cycling scene when she won both the women’s junior time trial and road race at the National Championships in 2018. The following year Gigante snatched the elite women’s road race title from under the nose of a stacked Mitchelton-Scott team.</p>\n\n\n\n<p>The performance and her first series of races abroad secured Gigante a spot on the American Tibco-SVB team for the 2020 season. </p>\n\n\n\n<p>Although Gigante’s 2020 season hit some bumps in the road she still performed well in the virtual scene and notched some early success in Australia before the season paused in March, including the Australian ITT national title. Her 2021 included another National ITT title and 11th place in the Olympic ITT. </p>\n\n\n\n<p>“Sarah is one of the biggest under-23 prospects in the whole international peloton right now. She’s a really well-rounded athlete, who defends herself brilliantly against the clock, who loves the mountains, and one whom I think will be a huge asset to the team from day one,” said Movistar COO Sebastián Unzué. “Hopefully, the road to 2024 will see her growing strong and establishing herself as one of the biggest names in the sport.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/sarah-gigante-to-join-movistar-in-2022/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c677904626891b5128c9b96618e8f644fa2cdd0f976741f963b213c0609aa9fe","category":"Cycling"}