{"title":"Cat and dog owners’ expectations and attitudes towards advanced veterinary care (AVC) in the UK, Austria and Denmark","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299315","date":1710943200000,"content":"<p>by Sandra A. Corr, Thomas Bøker Lund, Peter Sandøe, Svenja Springer</p>\r\n\r\nModern veterinary medicine offers a level of care to cats and dogs similar to that available to their owners, including blood transfusions, chemotherapy and MRI scans. The potential benefits to the animals of owners who can afford such care are obvious, but there can also be negative consequences if owners with strong emotional attachments to their pets pursue treatments that significantly reduce the quality of the animal’s life while attempting to prolong it. Moreover, caring for a chronically or seriously ill animal can lead to emotional distress and financial and practical challenges for the pet owner. A questionnaire was used to survey cat and dog owners from representative samples of citizens in the UK, Austria and Denmark, to investigate owners’ expectations and attitudes towards advanced veterinary care, and the factors that might influence those views. Overall, 58.4% of the pet owners surveyed believed that their pets should have access to the same <i>treatment options</i> as humans, while 51.5% believed that they should have access to the same <i>diagnostic tests</i> as humans. Owners were most likely to be neutral on the question of whether advanced veterinary care has ‘gone too far’ (45.3%), and to disagree with the statement that advanced care is ‘unnecessary’ (40.1%). In all three countries, the level of attachment owners had to their pets was most strongly associated with attitudes towards advanced care, with owners scoring higher on Lexington Attachment to Pets Scale (LAPS) being more likely to expect advanced care to be available. Other factors such as owner age, living situation (alone or not), income or possession of pet insurance were less consistently with owner attitudes. Our findings will help inform veterinarians and other health care providers about pet owner expectations and attitudes towards advanced veterinary care, and contribute to the debate on increasing specialisation within the profession.","author":"Sandra A. Corr","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c67e76509c5348f4a90a398fca5cc329942c719324fbc85cf45020d38fa6f67f","category":"Interdisciplinary"}