{"title":"A Nondestructive Method for Probing Layer Thicknesses in Early Photographs from Micrometers to Nanometers Using SEM-based μXRF Spectrometry","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.055/7719438?rss=1","date":1721779200000,"content":"<span>In the years following the announcement of the invention of photography in 1839, millions of images were captured of the world with a fidelity never seen, nor imagined before [<a href=\"#ozae044.055-B1\">1</a>]. The impact of this transformative technology extended well beyond portrait studios to scientific observations applied to astrophotography and visible light spectroscopy [<a href=\"#ozae044.055-B2\">2</a>]. Efforts to understand the processes underpinning daguerreotype photography using scanning electron microscopy (SEM) and X-ray microanalysis took place in the late 20<sup>th</sup> century [<a href=\"#ozae044.055-B3\">3</a>, <a href=\"#ozae044.055-B4\">4</a>]. Because the medium is metals-based, many studies have focused on object corrosion and secondary alteration products [<a href=\"#ozae044.055-B5\">5-7</a>]. X-ray diffraction and SEM were also used to identify the stoichiometry of silver mercury amalgam microparticles that scatter light on the surface of the plates and create contrast in daguerreotypes [<a href=\"#ozae044.055-B8\">8</a>], while high resolution analytical electron microscopy has revealed detailed nanochemical aspects of plate surfaces [<a href=\"#ozae044.055-B7\">7</a>, <a href=\"#ozae044.055-B9\">9</a>], and 2-dimensional micro-X-ray fluorescence (μXRF) mapping has proven useful with regard to contrast optimization for degraded photographs [<a href=\"#ozae044.055-B10\">10</a>]. Despite such scientific attention garnered by daguerreotypes, information regarding the thickness of their inherent and environmental layering has not been the subject of examination as far as we are aware. This technique provides a new way to examine the working methods of daguerreotypists, particularly those in the formative years of the process between 1839 and 1842, who were attempting to make images on inferior plate stock in the absence of access to French plates that were regulated by the government to contain pure silver [<a href=\"#ozae044.055-B11\">11</a>] . The purity and thickness of silver, along with sufficient polishing, affect the image formation on the plate. The method can also be used to examine the layer of gilding on plates beyond the qualitative presence of gold typically determined by portable XRF analysis. Insufficient or lightly gilded plates can behave similarly to ungilded plates, resulting in the same soft surface characteristics that render them easily abraded by the slightest touch. By confirming the thickness of gold layers on a daguerreotype, this technique can potentially provide valuable information that would influence conservation treatment and preservation decisions. Additionally, this methodology provides a novel approach at examining silver image deterioration within the layer structure, which can be applicable to studying deterioration mechanisms of daguerreotypes made throughout the Daguerreian era (1839-1860). This information extends curatorial research inquires to better understand production methods, period knowledge sharing and withholding, and the subsequent life of the object. In this study, a nondestructive SEM-based μXRF method is presented that provides information about the thicknesses of the photosensitized silver, protective gilding, and tarnish layers in daguerreotypes.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"c67efa59ad25a6ec71155184e05d82a7973c656d8ce716d860b415cee2c6181d","category":"Environment"}