{"title":"[Financial Times] บริษัทจีนทำระบบติดตามผู้ใช้ iPhone เพื่อทำโฆษณา แต่แอปเปิลปฏิเสธไม่ให้อัพเดตแอป","link":"https://www.blognone.com/node/123573","date":1625459683000,"content":"<div><div><div><p>เป็นอีกความพยายามร่วมกันของบริษัทเทคโนโลยีจีน ที่จะติดตามข้อมูลผู้ใช้งาน iPhone เพื่อทำการโฆษณาเจาะกลุ่มได้ แต่ก็ต้องล้มเหลว โดย Financial Time รายงานว่า  Baidu, Tencent และ TikTok ของ ByteDance ทำงานร่วมกับบริษัทสองแห่งในปักกิ่งเพื่อพัฒนาวิธีการใหม่ในการติดตาม iPhone สำหรับทำโฆษณาที่เรียกว่า CAID สามารถติดตามผู้ใช้ได้ แม้ผู้ใช้งานจะตั้งค่าปฏิเสธไม่ให้​เข้าถึง Advertising Identifier (IDFA)</p>\n<p>ทางบริษัทจีนพยายามทดสอบระบบมาตั้งแต่เดือนมีนาคม และความเคลื่อนไหวล่าสุดคือ แอปเปิลปฏิเสธการอัปเดตแอปจีนใน App Store หลายแอป ที่ตรวจพบว่ามีระบบ CAID โดย ByteDance, Tencent และ Baidu ยังไม่ออกมาแสดงความเห็นอะไรเพิ่มเติมหลังแอปเปิลปฏิเสธไม่ให้อัพเดตแอป</p>\n<p>แอปเปิลไม่ได้ระบุถึงตัว CAID โดยตรงแต่ย้ำว่าข้อกำหนดและแนวทางปฏิบัติของ App Store มีผลบังคับใช้อย่างเท่าเทียมกันกับนักพัฒนาทั่วโลก และ แอปที่ไม่ปฏิบัติตามจะถูกปฏิเสธบนแพลตฟอร์ม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/02362de3349d913b173c81e81671d381.png\" /></p>\n<p>ระบบ CAID เริ่มต้นได้รับการสนับสนุนโดยหน่วยงานโฆษณาในจีน ที่มีสมาชิกกว่า 2,000 คนอย่าง China Advertising Association และสำนักวิจัย China Academy of Information and Communications Technology ซึ่งได้รับการสนับสนุนจากรัฐบาลอีกที</p>\n<p>อย่างไรก็ตาม ยังไม่มีท่าทีชัดเจนจากรัฐบาลจีนว่าพยายามสนับสนุนการใช้ระบบ CAID อย่างเต็มที่ แต่ถ้ามันเกิดขึ้นจริง <a href=\"https://www.blognone.com/node/122728\">แอปเปิลก็จะถูกจีนกดดันอีกครั้ง</a> และเป็นอีกภัยคุกคามความเป็นส่วนตัวของผู้ใช้งานชาวจีน</p>\n<p>iOS 14 มีจุดขายตรงระบบความเป็นส่วนตัว นอกจากระบบ Advertising Identifier (IDFA) แล้ว ยังมี Private Relay หรือบริการแบบ VPN ที่ออกแบบมาเพื่อปกปิดข้อมูลการท่องเว็บ ไม่ให้ ISP และผู้ลงโฆษณาเข้าถึงข้อมูลเพื่อทำการตลาดเจาะกลุ่มได้ <a href=\"https://www.blognone.com/node/123071\">แต่ฟังก์ชั่นนี้ก็ไม่เปิดใช้งานในจีน</a></p>\n<p>ที่มา - <a href=\"https://www.ft.com/content/c79a5f6a-0827-47a4-9b3b-622a81fcc75a?__twitter_impression=true#\">Financial Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone\">iPhone</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/tencent\">Tencent</a></div><div><a href=\"/topics/baidu\">Baidu</a></div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/bytedance\">ByteDance</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c68650c961e09c033c55252c5bed30d08a5eafd5a5ce5408c596823b623a5292","category":"Thai"}