{"title":"An overview of the current status of Lake Jipe and its biodiversity dilemma","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12450?af=R","date":1708501931000,"content":"<h2>Abstract</h2>\n<p>Lake Jipe, is a shared water resource between Kenya and Tanzania located at the East African Coast is under multiple pressures. The present study assessed the current state of Lake Jipe and its biodiversity dilemma. Random sampling was conducted at 14 sampling points set at equidistant parallel to each other. Sampling depths and location coordinates were measured using Solar Transducer and GPSMAPS® 65 s. In situ water quality parameters were measured using YSI Pro Plus multiparameter; water samples for nutrients analysis were collected and preserved in cooler boxes prior transportation to Kenya Marine and Fisheries Research Institute (KMFRI) laboratory for analysis according to ALPHA 2005. Socio-economic data in relation to status of Lake Jipe ecology were generated using Key Informants Interviews at identified beaches along Kenya and Tanzania. Present findings indicated that the lake has receded from the original 108.72 Km<sup>2</sup> to 27.32 Km<sup>2</sup> with annual temperatures, dissolved oxygen and conductivity of 28.58 ± 0.95, 5.19 ± 00 and 799.24 ± 69.41, respectively, for dry season. Wet season recorded 31.21 ± 0.31, 4.16 ± 0.01 and 882.44 ± 57.41 for temperature, dissolved oxygen and conductivity, respectively. Agricultural activities have significantly (90%) contributed to the lake levels decline and further affected the lakes' aquatic biodiversity. Among the most affected are the commercially important endemic fish species of the lake of which <i>Oreochromis jipe</i> has experienced the greatest decline. Overfishing, use of illegal unreported and unregulated fishing gears, intensified fishing along protected fish breeding areas as well as poor management and uncoordinated conservation efforts have significantly contributed to the decline of fish catches from 348 kg of <i>O. jipe</i> in 2016 to 90 kg daily catches in 2022. Consequently, the lake is in the verge of extinction if no action is taken. This calls for awareness on the significance of the L. Jipe ecosystems and its immediate and long-term benefits. Further, there is need to revive and promote alternative economic activities including sustainable aquaculture and agriculture to local communities.</p>","author":"Paul Sagwe Orina, \nMercy Chepkirui, \nTonny Orina, \nLeonard Akwany, \nRasowo Joseph, \nMercy Matuma, \nDomitilah Kyule, \nJohn Okechi, \nJonathan Munguti","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"c68ce32311a348fc056892233e2c61bf31dfe3cc50974a6eb7dd331450a26891","category":"Environment"}