{"title":"EU Asks iMessage Users and Rivals If Service Should Be Regulated","link":"https://www.macrumors.com/2023/10/10/eu-asks-imessage-users-service-regulation/","date":1696935421000,"content":"EU antitrust regulators have asked Apple's users and rivals to rate the importance of Apple's iMessage and Microsoft's Bing versus competing services, reports <em><a href=\"https://www.reuters.com/technology/should-new-tech-rules-apply-microsofts-bing-apples-imessage-eu-asks-2023-10-09/\">Reuters</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/iMessages-Microsoft-feature.jpg\" alt width=\"2446\" height=\"1369\" />\r<br />\nAccording to people familiar with the matter, the European Commission sent out the questionnaires earlier this month, asking if there was anything specific to iMessage and Microsoft's Bing, Edge, and Microsoft Advertising that business users rely on and how they fit into the companies' ecosystems. The survey also asked for the number of users making use of the services.\r<br />\n\r<br />\nThe survey comes after Apple and Microsoft contested the EU regulator labeling them as \"gatekeepers\" ahead of the publication of the first list of services to be regulated by the Digital Markets Act (DMA). Apple last month <a href=\"https://www.macrumors.com/2023/09/05/imessage-isnt-popular-enough-for-regulation/\">argued</a> that iMessage does not meet the number of users required for the DMA's rules to apply, and should not be obliged to comply with it.\r<br />\n\r<br />\nThe legislation introduces new rules that apply to services considered to be core platform services and forces them to open up their various services and platforms to other companies and developers. For example, Apple could be forced to allow third-party companies and rival apps like Meta's WhatsApp to integrate directly with iMessage.\r<br />\n\r<br />\nAnalysts estimate that iMessage has as many as one billion users around the world, but Apple has not disclosed any official numbers about the service for several years. Whether iMessage will be included on the EU's initial list of gatekeeper services will depend on how it defines the market in which it operates.\r<br />\n\r<br />\nApple is expected to add support for <a href=\"https://www.macrumors.com/2023/04/17/app-sideloading-support-coming-ios-17/\">sideloading apps</a> from outside the ‌<a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>‌ on iPhones and iPads in Europe via an update to <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> due to the DMA's requirements, which could ultimately force similar major changes to the way in which the ‌App Store‌, <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, and <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> work on Apple devices. \r<br />\n\r<br />\nSurvey respondents were given less than a week to provide feedback, and the Commission wants to complete its investigation \"within five months,\" according to the report.<div>Tags: <a href=\"https://www.macrumors.com/guide/imessage/\">iMessage</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/10/eu-asks-imessage-users-service-regulation/\">EU Asks iMessage Users and Rivals If Service Should Be Regulated</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eu-asks-imessage-users-and-rivals-if-service-should-be-regulated.2407027/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c69ad822e8e05ecd51af17cc9c91a6596c1468dcb99225cd6f07a532ed66ff6d","category":"Apple"}