{"title":"Suppression of Hippocampal Neurogenesis and Oligodendrocyte Maturation Similar to Developmental Hypothyroidism by Maternal Exposure of Rats to Ammonium Perchlorate, a Gunpowder Raw Material and Known Environmental Contaminant","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24413?af=R","date":1725888130000,"content":"<h2>ABSTRACT</h2>\n<p>The environmental contaminant perchlorate raises concern for hypothyroidism-related brain disorders in children. This study investigated the effects of developmental perchlorate exposure on hippocampal neurogenesis and oligodendrocyte (OL) development. Pregnant Sprague–Dawley rats were administered with ammonium perchlorate (AP) in drinking water at concentrations of 0 (control), 300, and 1000 ppm from gestation day 6 until weaning [postnatal day (PND) 21]. On PND 21, offspring displayed decreased serum triiodothyronine and thyroxine concentrations at 1000 ppm and thyroid follicular epithelial cell hyperplasia at ≥300 ppm (accompanying increased proliferation activity at 1000 ppm). Hippocampal neurogenesis indicated suppressed proliferation of neurogenic cells at ≥300 ppm, causing decreases in type-1 neural stem cells (NSCs) and type-2a neural progenitor cells. In addition, an increase of SST<sup>+</sup> GABAergic interneurons and decreasing trend for ARC<sup>+</sup> granule cells were observed at 1000 ppm. CNPase<sup>+</sup> mature OLs were decreased in number in the dentate gyrus hilus at ≥300 ppm. At PND 77, thyroid changes had disappeared; however, the decrease of type-1 NSCs and increase of SST<sup>+</sup> interneurons persisted, CCK<sup>+</sup> interneurons were increased, and white matter tissue area was decreased at 1000 ppm. Obtained results suggest an induction of hypothyroidism causing suppressed hippocampal neurogenesis (targeting early neurogenic processes and decreased synaptic plasticity of granule cells involving ameliorative interneuron responses) and suppressed OL maturation during the weaning period. In adulthood, suppression of neurogenesis continued, and white matter hypoplasia was evident. Observed brain changes were similar to those caused by developmental hypothyroidism, suggesting that AP-induced developmental neurotoxicity was due to hypothyroidism.</p>","author":"Yuri Sakamaki, \nMomoka Shobudani, \nRyota Ojiro, \nShunsuke Ozawa, \nQian Tang, \nXinyu Zou, \nYuri Ebizuka, \nAyumi Karasawa, \nGye‐Hyeong Woo, \nToshinori Yoshida, \nMakoto Shibutani","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"c69b345fb8274c28f813c91e455eb83ac48dc511504e79185d6f6806ef98d585","category":"Environment"}