{"title":"Association of different milk fat content with coronary artery disease and myocardial infarction risk: A Mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300513","date":1712757600000,"content":"<p>by Jiacan Wu, Guanghong Tao, Hua Xiao</p>\r\nBackground <p>Numerous observational studies have investigated on the correlation of whole, semi-skimmed, and skimmed milk with coronary artery disease (CAD) and myocardial infarction (MI) risk; However, no consensus has been reached and evidence on any causal links between these exposures and outcomes remains unclear. This study aimed to conduct univariate and multivariate Mendelian randomization (MR) analyses, using publicly released genome-wide association study summary statistics (GWAS) from the IEU GWAS database, to ascertain the causal association of milk with various fat content with CAD and MI risk.</p> Methods <p>For the exposure data, 29, 15, and 30 single-nucleotide polymorphisms for whole milk, semi-skimmed milk, and skimmed milk, respectively, obtained from 360,806 Europeans, were used as instrumental variables. CAD and MI comprised 141,217 and 395,795 samples, respectively. We used inverse variance weighted (IVW), weighted median, MR-Egger regression, and MR Pleiotropy Residual Sum and Outlier analyses to determine whether pleiotropy and heterogeneity could skew the MR results. Sensitivity tests were conducted to verify the robustness of the results.</p> Results <p>After adjusting for false discovery rates (FDR), we discovered proof that skimmed milk intake is a genetically predicted risk factor for CAD (odds ratio [OR] = 5.302; 95% confidence interval [CI] 2.261–12.432; <i>P</i> &lt; 0.001; FDR-corrected <i>P</i> &lt; 0.001) and MI (OR = 2.287; 95% CI 1.218–4.300; <i>P</i> = 0.010; FDR-corrected <i>P</i> = 0.009). Most sensitivity assessments yielded valid results. Multivariable MR for CAD and MI produced results consistent with those obtained using the IVW method. There was no causal relationship between whole or semi-skimmed milk, and CAD or MI.</p> Conclusion <p>Our findings indicate that the consumption of skimmed milk may increase the risk of CAD and MI. This evidence may help inform dietary recommendations for preventing cardiovascular disease. Further studies are required to elucidate the underlying mechanisms.</p>","author":"Jiacan Wu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6a8c9b746fc08625060b728c5997691392ac4a7545c82c402157a19f0a660c8","category":"Interdisciplinary"}