{"title":"YouTube’s TikTok clone, “Shorts,” is out of beta and open for all US users","link":"https://arstechnica.com/?p=1762710","date":1620231081000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/14-980x1021.jpg\" /></div>\n        <p>\n          The YouTube Shorts beta. It's like TikTok.                       [credit:\n                        Ron Amadeo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>YouTube's TikTok clone, \"Shorts,\" is <a href=\"https://www.youtube.com/watch?v=1V42uuQgSxU&amp;t=186s\">out of beta</a> and should roll out to everyone in the US by next week. Shorts are 15- to 60-second videos that, on mobile, launch in a full-screen, vertical video interface that users can swipe between. Shorts are just an alternative interface for YouTube videos, and on the desktop site or on a channel page, Shorts appear as regular videos in the normal YouTube interface.</p>\n<p>A big draw for TikTok is the video editor, which comes with all sorts of effects, music, filters, and variable playback speeds. YouTube's Shorts editor doesn't have nearly as many features as Tiktok, but Google says that \"over the next year, we'll be releasing a ton of new filters and effects so you can get the vibe you want.\"</p>\n<p>Even if you don't want to watch Shorts, the most noticeable change from this rollout will be a new \"Shorts\" tab in the mobile app. The tab will live in the bottom app-wide tab bar. This will give users a dedicated space to explore all the TikTok-type content people have been creating, and it provides a blazingly bright app-wide advertisement for the new feature. The bottom tab bar is premium real estate in the YouTube app—it's present on nearly every screen of the app, and it elevates Shorts to the same importance level as \"Subscriptions,\" \"Library,\" and the home page. Previously, Shorts only appeared in an easily ignorable horizontal carousel on the home screen. Shorts will be taking the spot of the \"Explore\" tab, which shows trending videos. The Explore page has been demoted to the home page.</p></div><p><a href=\"https://arstechnica.com/?p=1762710#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762710&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c6c1aa3f31fdf62772bde37a7c254de4bdb3dbc14696b928156d620e81f9a57b","category":"Tech"}