{"title":"Vision Pro teardown reveals ‘virtual nightmare’ of screws and brackets","link":"https://www.macworld.com/article/2226973/vision-pro-teardown-disassembly-screws-display-brackets.html","date":1707142505000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>iFixit has published the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/News/90137/vision-pro-teardown-why-those-fake-eyes-look-so-weird&amp;xcust=1-1-2226973-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">latest</a> of its famous teardowns, where the repairs site disassembles a popular electronic device in order to examine and itemise its internal components. In this case Apple’s new Vision Pro mixed-reality headset–at $3,499 a costly product to tear apart out of sheer curiosity–is the item under examination.</p>\n\n\n\n<p>Apple products are notoriously difficult to take apart, with the company fond of using rare or proprietary screws and lots of glue to thwart tinkerers and DIYers. (We all know how much Apple dislikes the <a href=\"https://www.macworld.com/article/696937/apple-breakfast-may-7-2022.html\">concept of self-repair</a>.) But even by Cupertino’s standards, Vision Pro is unusually resistant to deconstruction, with the site complaining about what it describes as an “insane disassembly process.”</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>“Aside from magnetic part replacement and clever SIM eject functions,” the presenter laments, “not very much of this teardown was effortless. It was actually really effort…ful. Tons of convoluted construction, finicky fasteners, and a bevy of brackets made for a virtual nightmare.”</p>\n\n\n\n<p>iFixit has plenty of experience in this department, and can generally be relied upon to crack the defences of even the most complex devices. But the sheer number of layers, sealed by screws, glue, tape, protective films and attaching brackets, forced the site to spend an entire video just getting inside. The discoveries within will be discussed in another video to be posted later.</p>\n\n\n\n<p>It’s debatable, of course, whether the average Vision Pro customer will even want to open up their expensive headset and start rooting around. This is a <a href=\"https://www.macworld.com/article/2222047/apple-vision-pro-reviews-roundup.html\">state-of-the-art device</a> boasting groundbreaking tech, and perhaps it was always inevitable that it would feature an intimidatingly complex internal design. But there is a principle at stake here: the Right to Repair. Last year, following years of resistance, Apple signalled a <a href=\"https://www.macworld.com/article/2041629/california-right-to-repair-bill-apple-support.html\">softening in its stance</a> on the Right to Repair movement, but anti-user designs like this may give a more accurate insight into the company’s real feelings.</p>\n\n\n\n<p>Apple sells <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/apple-vision-pro/repair&amp;xcust=1-1-2226973-1-0-0&amp;sref=https://www.macworld.com/feed\">AppleCare+ for Vision Pro</a> for the tidy sum of $499, which gets you a $500 discount ($799 vs $299) on front glass repair and a whopping $2,100 discount ($2,399 vs $299) on any other repair. Considering how difficult it is just to take apart and the incredible expense of the Vision Pro—you might want to at least consider it.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c6c5e8388578fb53985d2cd677e02a47d492e5bb5b8dca3b99470ecf474c1f75","category":"Apple"}