{"title":"Amazon ปิดบริการ Newsstand บอกรับหนังสือพิมพ์-นิตยสารอิเล็กทรอนิกส์บน Kindle","link":"https://www.blognone.com/node/133052","date":1679017601000,"content":"<div><div><div><p>เมื่อหลายปีก่อนเราอาจคุ้นเคยกับประโยคว่า สื่อกระดาษอย่างหนังสือพิมพ์หรือนิตยสารควรปรับตัวด้วยการขายเวอร์ชันอิเล็กทรอนิกส์ เช่น e-newspaper หรือ e-magazine แทน แต่วันนี้ประโยคนี้อาจไม่เป็นจริงอีกแล้ว</p>\n<p>Amazon ประกาศยุติบริการ Amazon Newsstand ที่ให้สมัครสมาชิกรับ e-newspaper และ e-magazine บนเครื่องอ่านอีบุ๊กตระกูล Kindle (บริการนี้ยังรวมถึงการสมัครฉบับกระดาษส่งถึงบ้าน โดยจ่ายเงินผ่านระบบของ Amazon ได้ด้วยหากต้องการ)</p>\n<p>ตอนนี้ Amazon Newsstand ปิดรับสมัครสมาชิกใหม่เรียบร้อยแล้ว ส่วนสมาชิกเก่าที่จ่ายเงินไปแล้วจะใช้บริการได้ถึง 4 กันยายน 2023 หากยังมีอายุสมาชิกเหลืออยู่ เจ้าของหนังสือพิมพ์หรือนิตยสารจะหาช่องทางทดแทนให้ (เช่น สมัครกับเว็บไซต์ของนิตยสารนั้นโดยตรง ซึ่งต้องใช้เบราว์เซอร์หรือแอพเฉพาะแทน) ตัวไฟล์หนังสือพิมพ์และนิตยสารฉบับเก่าๆ จะยังอ่านได้แม้บริการปิดไปแล้ว</p>\n<p>Amazon ไม่ได้อธิบายถึงสาเหตุที่ยกเลิกบริการ Kindle Newsstand บอกเพียงว่าเป็นการตัดสินใจที่ยากลำบาก และพยายามปิดบริการเป็นเฟสๆ เพื่อให้เกิดผลกระทบกับลูกค้าน้อยที่สุด</p>\n<p>อีกทางเลือกหนึ่งของลูกค้าคือ ย้ายไปใช้<a href=\"https://www.blognone.com/node/58473\">บริการอ่านอีบุ๊กแบบเหมาจ่าย Kindle Unlimited ที่เปิดมาตั้งแต่ปี 2014</a> ซึ่งสามารถอ่าน e-newspaper และ e-magazine ได้ด้วย แต่บริการนี้มีเฉพาะในสหรัฐอเมริกาเท่านั้น และอาจมีหัวหนังสือไม่เท่ากับใน Kindle Newsstand</p>\n<p>กูเกิลมีบริการสมัครสมาชิกนิตยสารอิเล็กทรอนิกส์รูปแบบเดียวกันผ่าน Google News ซึ่ง<a href=\"https://www.blognone.com/node/113936\">ชิงปิดตัวไปก่อนแล้วตั้งแต่ปี 2020</a></p>\n<p>ที่มา - <a href=\"https://www.amazon.com/kindle-dbs/arp/B0BWPTCP4K?deviceType=A1FG5NAKX0MRJL\">Amazon</a> via <a href=\"https://goodereader.com/blog/kindle/amazon-will-discontinue-newspaper-and-magazine-subscriptions-in-september\">Good Reader</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cb39010e9abdf22aeb15a578b7d36525.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/kindle\">Kindle</a></div><div><a href=\"/topics/e-book\">E-book</a></div><div><a href=\"/topics/digital-media\">Digital Media</a></div><div><a href=\"/topics/digital-magazine\">Digital Magazine</a></div><div><a href=\"/topics/magazine\">Magazine</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c6c5a8454e6bbbce71b6b71739ff918411e830242bc8d22ac6cabd8ce0544d77","category":"Thai"}