{"title":"The 2021 Men's Early Season: The Rouleur Racing Guide","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar","date":1612275768000,"content":"\n      <p><span style=\"font-weight: 400;\">Although not quite in full swing just yet, cycling racing is now underway in 2021. </span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">The cancellation of the Santos Tour Down Under was a setback as the pandemic continues to dismantle sections of the race calendar. </span><span style=\"font-weight: 400;\">However, the Grand Prix la Marseillaise went ahead smoothly, that is for everyone except the Groupama-FDJ riders who took a wrong turn with 30km to go. </span></p>\n<p><span style=\"font-weight: 400;\">Aurélien Paret-Peintre</span><span style=\"font-weight: 400;\"> was the surprise winner in Marseille. It was the first 1.1 category race to go ahead this season. So, with many races looking likely to follow, here is our guide to the early season races in 2021.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/seven-women-s-cycling-races-to-watch-in-2021\">Related – The Women's Cycling Races to Watch</a></strong></em></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-cycling-team-jerseys-2021\"><em><strong>Related – The WorldTour team kits 2021</strong></em></a></p>\n<h4>\n<b>Etoile de </b><b>Bessèges</b><b> - 2.1 (03/02-07/02)</b>\n</h4>\n<p><span style=\"font-weight: 400;\">A five-day stage race in and around the </span><span style=\"font-weight: 400;\">Bessèges</span><span style=\"font-weight: 400;\"> region in Southern France which closely follows the Grand Prix Marseillaise. The startlist often features many that were present in Marseille and is usually dominated by French teams – although that is set to change in 2021. Due to the cancellation and postponement of other races, 12 WorldTour teams are on the startline, including the INEOS Grenadiers, Trek-Segafredo and BORA-hansgrohe. </span></p>\n<p><span style=\"font-weight: 400;\">The first stages suit the punchers and sprinters, but the final stage is a short individual time-trial to Alès. With a lack of large climbs throughout, the time-trial is often critical in deciding the final winner. </span><span style=\"font-weight: 400;\">Benoît Cosnefroy</span><span style=\"font-weight: 400;\"> won in 2020 after winning in Marseillaise too. He’ll miss the event this time due to continued knee pain. Among the favourites are Alberto Bettiol, Tim Wellens, </span><span style=\"font-weight: 400;\">Felix Großschartner</span><span style=\"font-weight: 400;\"> and <span>Michał Kwiatkowski</span>. Egan Bernal is also set to start his first race since dropping out of the Tour de France last year.</span></p>\n<h4><b>Tour de la Provence - 2.Pro (11/02-07/02)</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mollema_1024x1024.jpg?v=1612202921\" alt=\"Bauke Mollema\"></b></p>\n<p><i><span style=\"font-weight: 400;\">Bauke Mollema could be a favourite for the Tour de la Provence (Image credit: </span></i><i><span style=\"font-weight: 400;\">CorVos/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">The early season calendar in France doesn’t slow down, with just three days between Etoile de </span><span style=\"font-weight: 400;\">Bessèges and the</span><span style=\"font-weight: 400;\"> Tour de la Provence. This time, we are stepping up to the .Pro category which is just below WorldTour. Although the teams remain in Southern France, just North of Marseille, the roadbook looks very different due to the inaugural mountain-top finish of the season. Stage three finishes on Mount Ventoux, although not at the peak, the riders will finish at Chalet Reynard, a climb of 9.7km at 9.1%.</span></p>\n<p><span style=\"font-weight: 400;\">Nairo Quintana won the race last year after taking almost 90 seconds on Chalet Reynard. Quintana doesn’t line up this season, but a pure climber is likely to win overall. Alex Vlasov, Bauke Mollema and perhaps Marseillaise winner </span><span style=\"font-weight: 400;\">Aurélien Paret-Peintre</span><span style=\"font-weight: 400;\"> are among the favourites.</span></p>\n<h4>\n<b>Clásica de Almería</b><b> - 1.Pro (14/02)</b>\n</h4>\n<p><span style=\"font-weight: 400;\">The first .Pro one-day classic is set to take place in Spain with the </span><span style=\"font-weight: 400;\">Clásica de Almería</span><span style=\"font-weight: 400;\">. It was promoted from a 1.1 to 1.Pro category race in 2020. The race features around 1,500m of climbing, much of which is on shorter hills earlier in the day meaning a bunch sprint is the most likely outcome.</span></p>\n<p><span style=\"font-weight: 400;\">Pascal Ackermann won in both 2019 and 2020 for BORA-hansgrohe, and looks set to fend-off the likes of Alex Kristoff, Giacomo Nizzolo and Matteo Moschetti in 2021 to make it a hat-trick.</span></p>\n<h4>\n<b>Tour du Haut Var </b><b>- 2.1 (19/02-21/02)</b>\n</h4>\n<p><span style=\"font-weight: 400;\">France’s early-season stage-race fest continues with the </span><span style=\"font-weight: 400;\">Tour du Haut Var</span><span style=\"font-weight: 400;\">. Taking place Friday - Sunday, this long weekend will provide the riders with absolutely no time off. All three stages are demanding and littered with climbs. The final stage is just over 100km, but features the Col de Braus (9.9km at 6.5%) and the Col de la Madone (11km at 6.9%) among others.</span></p>\n<p><span style=\"font-weight: 400;\">Nairo Quintana continued his dominant early season form last year when he backed up his win at the Tour de la Provence with victory here. Without the Colombian on the startline this season, David Gaudu could be the man to watch as he begins his preparation for Paris-Nice and later, the Tour de France.</span></p>\n<h4><b>UAE Tour - WT (21/02-27/02)</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Froome_1024x1024.jpg?v=1612202977\" alt=\"Chris Froome\"></b></p>\n<p><i><span style=\"font-weight: 400;\">Chris Froome is set to make his Israel Start Up Nation debut at the UAE Tour. (Image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Broadway/ASO/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">The UAE Tour is the first of the WorldTour calendar in 2021 after the Santos Tour Down Under was cancelled. This means we will see a supercharged startlist, with Chris Froome, Tadej Pogacar, Caleb Ewan and Adam Yates among others in attendance. </span></p>\n<p><span style=\"font-weight: 400;\">The 2021 route features an individual time-trial for the first time since 2018, with the climbs to Jebel Hafeet and Jebel Jais the two queen stages. The other four stages are flatter and will be contested in a mass-sprint. The only notable emission from the route is the wall of Hatta Dam. </span></p>\n<p><span style=\"font-weight: 400;\">The favourite here has to be the Tadej Pogacar-led UAE-Team Emirates. At the team’s home race, Pogacar will look to improve on his 2nd place overall last season, with Marc Hirschi, Fernando Gaviria and Davide Formolo all set to join him.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/desire-journal/pro-team-bikes-2021\"><strong><em>Related – The best WorldTour bikes 2021</em></strong></a></p>\n<h4><b>Omloop het Nieuwsblad - WT (27/02)</b></h4>\n<p><span style=\"font-weight: 400;\">‘The season doesn’t start until Omloop!’ </span></p>\n<p><span style=\"font-weight: 400;\">The first of the Flanders Classics, Omloop het Nieuwsblad kicks-off Belgium's opening weekend on Saturday. Omloop includes many of the most revered cobbled climbs in Flanders, including the Muur and the Bosberg, both can create a selective group of riders in the final 20 kilometres. </span></p>\n<p><span style=\"font-weight: 400;\">This race is crucial for those looking to focus on the Spring Classics. The 2020 edition saw Trek’s Jasper Stuyven arriving at the finish alongside countryman Yves Lampaert, who was beaten by Stuyven in a sprint. Both men will return this season among the favourites. But they will face fierce competition.</span></p>\n<h4><b>Royal Bernard Drome Classic - 1.Pro (27/02) </b></h4>\n<p><span style=\"font-weight: 400;\">The racing in France doesn’t stop for Belgium’s opening weekend, with two difficult races taking place in the </span><span style=\"font-weight: 400;\">Ardèche </span><span style=\"font-weight: 400;\">region. The </span>Royal Bernard Drome Classic <span style=\"font-weight: 400;\">was introduced in 2013 as 1.1 category event, but has since risen to .Pro status. A gruelling 200km with climbs aplenty, it wouldn't be a surprise to see half the field DNF.</span></p>\n<p><span style=\"font-weight: 400;\">Previous winners include Romain Bardet and Lillian Calmejane. The 2020 edition was decided in a three-up sprint between Vincenzo Nibali, Warren Barguil and Simon Clarke, with the Aussie ending victorious.</span></p>\n<h4><b>Kuurne-Brussels-Kuurne - 1.Pro (28/02)</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Jungels_1024x1024.jpg?v=1612203018\" alt=\"Bob Jungels\"></b></p>\n<p><i><span style=\"font-weight: 400;\">Bob Jungels won Kuurne-Brussels-Kuurne in 2019. (Image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Whitehead/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">Kuurne-Brussels-Kuurne takes place the Sunday after Omloop and completes the opening weekend in Belgium. Although featuring the Oude-Kwaremont, the main difficulties take place further from the finish line, with the final 50km largely flat. This means a sprint is more likely, but the previous two editions have seen a Deceuninck-Quick Step rider go solo late on to win - Bob Jungels did just that in 2019 and Kasper Asgreen in 2020.</span></p>\n<p><span style=\"font-weight: 400;\">The winner should be undeterred by crosswinds or other adverse weather which seem to be ever-present at KBK. We can expect similar contenders to Omloop, leaning slightly towards the sprinters.</span></p>\n<h4>Faun-Ardèche Classic<b> - 1.Pro (28/02)</b>\n</h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cavagna_1024x1024.jpg?v=1612203049\" alt=\"Remi Cavagna\"></b></p>\n<p><i><span style=\"font-weight: 400;\">Remi Cavagna won the Faun-Archeche Classic in 2020. (Image credit: </span></i><i><span style=\"font-weight: 400;\">Allan McKenzie/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">Opening Weekend? What’s that? The </span>Faun-Ardèche Classic <span style=\"font-weight: 400;\">is on.</span></p>\n<p><span style=\"font-weight: 400;\">This is a compelling race in its own right which can be decided in a reduced sprint or long-range attack. The </span><span style=\"font-weight: 400;\">Saint-Romain-de-Lerps</span><span style=\"font-weight: 400;\"> is the major difficulty at 6.1km and 7.2%, but lots of other short climbs will undoubtedly sap the legs of the peloton.</span></p>\n<p><span style=\"font-weight: 400;\">Remi Cavagna went solo early in 2020 and wasn’t seen again, winning by a whopping two minutes and 51 seconds. Only 43 riders finished, with distinct groups few and far between as riders battled just to reach the finish in the wake of Cavagna. More of the same in 2021 please.</span></p>\n<p><em><span style=\"font-weight: 400;\">Cover photo: Alex Broadway/ASO/SWPix.com</span></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c6c72b38af84b0572cdce5e2d82ce86761f0eae1b909518f9332e9783c8f12c6","category":"Cycling"}