{"title":"Daily exposure to stressors, daily perceived severity of stress, and mortality risk among US adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303266","date":1715781600000,"content":"<p>by Dana A. Glei, Maxine Weinstein</p>\r\n\r\nPrior studies of perceived stress and mortality have yielded mixed results, but most are based on one-time measurements of perceived stress. We use daily diary data from the Midlife in the United States study to measure exposure to stressors and perceived severity of stress and investigate their associations with mortality. We also explore whether the associations vary by age and assess whether the associations are stronger for extrinsic than intrinsic mortality, which is more likely to be aging-related. The analysis included 4,756 observations for 2,915 respondents aged 21–95 who participated in at least one of three waves (1996–97, 2004–09, 2017–19) of the National Study of Daily Experiences. Participants reported daily stressors and perceived severity on 8 consecutive evenings at each wave. Mortality was followed through December 31, 2021. In fully-adjusted models, daily exposure to stressors was associated with mortality, but only at younger ages (HR = 1.20 per SD at age 50, 95% CI: 1.01‒1.42). The association was slightly stronger for extrinsic (HR = 1.31 per SD at age 50, 95% CI: 1.01‒1.69) than for intrinsic mortality, which was not significant (HR = 1.24 per SD at age 50, 95% CI: 0.98‒1.56). When we used an alternative measure of daily perceived severity of stress, the demographic-adjusted association appeared to be similar in magnitude, but after careful adjustment for potential confounding with health status, the association weakened and was no longer statistically significant (HR = 1.17 per SD at age 50, 95% CI: 0.99–1.37). Perceived severity was not significantly associated with either extrinsic or intrinsic mortality even at age 50. Most Americans die at older ages, where stress exposure does not appear to be significantly associated with mortality. Nonetheless, our results suggest that stress exposure is more strongly associated with midlife mortality, which has an undue influence on overall life expectancy.","author":"Dana A. Glei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6c989d200544428058344ba2345df6d98a1764bd3bbac6e51e9a92cf05d1623","category":"Interdisciplinary"}