{"title":"Creating insect neopolyploid lines to study animal polyploid evolution","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13706?af=R","date":1725778800000,"content":"<h2>Abstract</h2>\n<p>Whole-genome duplication (polyploidy) poses many complications but is an important driver for eukaryotic evolution. To experimentally study how many challenges from the cellular (including gene expression) to the life history levels are overcome in polyploid evolution, a system in which polyploidy can be reliably induced and sustained over generations is crucial. Until now, this has not been possible with animals, as polyploidy notoriously causes first-generation lethality. The parasitoid wasp <i>Nasonia vitripennis</i> emerges as a stunningly well-suited model. Polyploidy can be induced in this haplodiploid system through (1) silencing genes in the sex determination cascade and (2) by colchicine injection to induce meiotic segregation failure. <i>Nasonia</i> polyploids produce many generations in a short time, making them a powerful tool for experimental evolution studies. The strong variation observed in <i>Nasonia</i> polyploid phenotypes aids the identification of polyploid mechanisms that are the difference between evolutionary dead ends and successes. Polyploid evolution research benefits from decades of <i>Nasonia</i> research that produced extensive reference—omics data sets, facilitating the advanced studies of polyploid effects on the genome and transcriptome. It is also possible to create both inbred lines (to control for genetic background effects) and outbred lines (to conduct polyploid selection regimes). The option of interspecific crossing further allows to directly contrast autopolyploidy (intraspecific polyploidy) to allopolyploidy (hybrid polyploidy). <i>Nasonia</i> can also be used to investigate the nascent field of using polyploidy in biological control to improve field performance and lower ecological risk. In short, <i>Nasonia</i> polyploids are an exceptional tool for researching various biological paradigms.</p>","author":"Saminathan Sivaprakasham Murugesan, \nLeo W. Beukeboom, \nEveline C. Verhulst, \nKelley Leung","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"c6cbdbacbf5f73a6d8c0b5f7cbc165e8553cc941673362428498ffd820683ffe","category":"Environment"}