{"title":"Exploration of the shared pathways and common biomarker in adamantinomatous craniopharyngioma and type 2 diabetes using integrated bioinformatics analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304404","date":1717768800000,"content":"<p>by Yibo Han, Yong Wang, Shuo Li, Kohji Sato, Satoru Yamagishi</p>\r\n\r\nCraniopharyngiomas are rare tumors of the central nervous system that typically present with symptoms such as headache and visual impairment, and those reflecting endocrine abnormalities, which seriously affect the quality of life of patients. Patients with craniopharyngiomas are at higher cardiometabolic risk, defined as conditions favoring the development of type 2 diabetes and cardiovascular disease. However, the underlying common pathogenic mechanisms of craniopharyngiomas and type 2 diabetes are not clear. Especially due to the difficulty of conducting in vitro or in vivo experiments on craniopharyngioma, we thought the common pathway analysis between craniopharyngioma and type 2 diabetes based on bioinformatics is a powerful and feasible method. In the present study, using public datasets (GSE94349, GSE68015, GSE38642 and GSE41762) obtained from the GEO database, the gene expression associated with adamantinomatous craniopharyngioma, a subtype of craniopharyngioma, and type 2 diabetes were analyzed using a bioinformatic approach. We found 11 hub genes using a protein–protein interaction network analysis. Of these, seven (DKK1, MMP12, KRT14, PLAU, WNT5B, IKBKB, and FGF19) were also identified by least absolute shrinkage and selection operator analysis. Finally, single-gene validation and receptor operating characteristic analysis revealed that four of these genes (MMP12, PLAU, KRT14, and DKK1) may be involved in the common pathogenetic mechanism of adamantinomatous craniopharyngioma and type 2 diabetes. In addition, we have characterized the differences in immune cell infiltration that characterize these two diseases, providing a reference for further research.","author":"Yibo Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6cb37171103152dfe6bafcd773b2d836695620dca86f5358a60e3affafc8194","category":"Interdisciplinary"}