{"title":"The expectations humans have of a pleasurable sensation asymmetrically shape neuronal responses and subjective experiences to hot sauce","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002818","date":1728396000000,"content":"<p>by Yi Luo, Terry Lohrenz, Ellen A. Lumpkin, P. Read Montague, Kenneth T. Kishida</p>\r\n\r\nExpectations shape our perception, profoundly influencing how we interpret the world. Positive expectations about sensory stimuli can alleviate distress and reduce pain (e.g., placebo effect), while negative expectations may heighten anxiety and exacerbate pain (e.g., nocebo effect). To investigate the impact of the (an)hedonic aspect of expectations on subjective experiences, we measured neurobehavioral responses to the taste of hot sauce among participants with heterogeneous taste preferences. By identifying participants who “liked” versus those who strongly “disliked” spicy flavors and by providing contextual cues about the spiciness of the sauce to be tasted, we dissociated the effects of positive and negative expectations from sensory stimuli (i.e., visual and gustatory stimuli), which were the same across all participants. Our results indicate that positive expectations lead to modulations in the intensity of subjective experience. These modulations were accompanied by increased activity in brain regions previously linked to information integration and the placebo effect, including the anterior insula, dorsolateral prefrontal cortex, and dorsal anterior cingulate cortex, as well as a predefined “pleasure signature.” In contrast, negative expectations decreased hedonic experience and increased neural activity in the previously validated “Neurological Pain Signature” network. These findings demonstrate that hedonic aspects of one’s expectations asymmetrically shape how the brain processes sensory input and associated behavioral reports of one’s subjective experiences of intensity, pleasure, and pain. Our results suggest a dissociable impact of hedonic information: positive expectations facilitate higher-level information integration and reward processing, while negative expectations prime lower-level nociceptive and affective processes. This study demonstrates the powerful role of hedonic expectations in shaping subjective reality and suggests potential avenues for consumer and therapeutic interventions targeting expectation-driven neural processes.","author":"Yi Luo","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"c6cc1c5d4677b40afafb0dc77404f198a98c7f8258bf6258d1d7e10a5d76d03c","category":"Environment"}