{"title":"Beyond fire: Flower production naturally occurs and is also influenced by leaf removal in a Neotropical savanna herb","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305098","date":1718028000000,"content":"<p>by Heloisa S. Miranda, Pedro H. B. Togni, Ademar B. Dantas-Junior, Cassia B. R. Munhoz, Margarete N. Sato, Augusto C. Franco</p>\r\n\r\nSeveral herbaceous species exhibit mass flowering after fires in Neotropical savannas. However, unequivocal evidence of fire dependency and the consequences for plant reproduction are lacking. In nutrient-poor fire-prone savannas, the damage caused by fire and by other means (e.g., leaf removal, but not necessarily having a negative impact) constrains the maintenance and expansion of plant population by affecting the ability of individuals to recover. Therefore, the compensatory responses of plants to both damages should be convergent in such environments. Using <i>Bulbostylis paradoxa</i>–reported to be fire-dependent to flower–as a model, we investigated the role of fire and leaf removal in anticipating the flowering and reproduction periods, and its possible consequences on seedling establishment. We monitored 70 burned individuals, 70 damaged/clipped, and 35 without damage to estimate time for flowering, seed quality and germination parameters. To expand our sampling coverage, we examined high-resolution images from herbarium collections in the SpeciesLink database. For each herbarium image, we recorded the presence or absence of a fire scar, the month of flowering, and the number of flowering stalks. <i>Bulbostylis paradoxa</i> was fire-stimulated but not dependent on fire to flower, with 65.7% of the individuals flowering in the burned area, 48.6% in the clipped, and 11.4% in the control. This was consistent with the analysis of the herbarium images in which 85.7% of the specimens with flowers had fire scars and 14.3% did not. Burned individuals synchronized flowering and produced more viable seeds. However, the seeds might face a period of unsuitable ecological conditions after early to mid-dry season fires. Flowering of unburned plants was synchronized with the onset of the rainy season. Flexibility in flowering and vegetative reproduction by fragmentation confer to this species, and most likely other plants from the herbaceous layer, the capability of site occupation and population persistence in burned and unburned savanna sites.","author":"Heloisa S. Miranda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6cdd1314fd55cb0569b16945c544211030b061ff9534c39443ed042990aa366","category":"Interdisciplinary"}