{"title":"Energy Storage Improves Power Plant Flexibility and Economic Performance","link":"https://www.preprints.org/manuscript/202404.1666/v1","date":1714036883000,"content":"Most existing coal-fired power plants were designed for sustained operation at full load to maximize efficiency, reliability, and revenue, as well as to operate air pollution control devices at design conditions. Depending on plant type and design, these plants can adjust output within a fixed range in response to the plant operating or market conditions. The need for flexibility driven by increased penetration of variable and non-dispatchable power generation such as wind and solar is shifting the traditional mission profile of thermoelectric power plants in three ways: more frequent shutdowns when market or grid conditions warrant, more aggressive load ramp rates (rate of output change), and lower minimum sustainable load, which provides a wider operating range and helps avoid costly plant shutdowns. Recent studies have shown that flexibility of a coal-fired power plant can be improved by energy storage. The objective of this work was to analyze a set of energy storage options and determine their impact on flexibility and economics of a representative coal-fired power plant. The effect of three energy storage systems integrated with a coal power plant on plant flexibility and economics was investigated. The results obtained in this project show that Energy Storage Systems integrated with a thermal power plant improves plant flexibility and participation in the Energy and Ancillary Services markets which improves plant financial performance.  The study was funded by the U.S. Department Office of Fossil Energy FE-1 under Award Number DE-FE0031903.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c6cd6e622bb6fc068dfaf9329414d4976a87436f9a33e0dc9166c9133cfefa62","category":"Interdisciplinary"}