{"title":"Garmin Edge 840 Cycling GPS In-Depth Review","link":"https://www.dcrainmaker.com/2023/04/garmin-edge840-solar-cycling-gps-in-depth-review.html","date":1681210800000,"content":"<p></p>\n<p>Garmin has just announced the new Edge 840, as well as Edge 540 units. And like last year, with the more expensive Edge 1040, both the 540 and 840 get Solar variants. However, the changes go far beyond just sunny-side-up or not. In fact, arguably, the solar piece is really the least important change. Instead, the huge bulk of the changes are software-focused, effectively matching that of the higher-end Edge 1040 series, bringing in tons of new functionality, including one entirely new-to-Garmin feature: Free-ride ClimbPro. You no longer have to be on a course/route to get up-ahead climb information.</p>\n<p>Of course, it’s not just a buffet of software features, but also some hardware changes, including the switch to USB-C, as well as the addition of multi-band/dual-frequency GPS/GNSS. And for better or worse, the unit got a bit chubbier as well. Hey – you can’t win them all! Note that both new units are near-identical, but this review is focused purely on the Edge 840 model, which has a touchscreen that the Edge 540 lacks. It also has a few other differences outlined in the next section.</p>\n<p>Garmin sent over media loaners to test out. As usual, <strong>this review is not sponsored</strong> (nor does any company get to preview anything I review), and I don’t take any advertiser money from any companies I review. Once this unit goes back, I’ll go out and buy my own for any future testing needs. If you found this review useful, you can use the links at the bottom, or consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And, of course, it makes you awesome.</p>\n<h3><span>What’s New:</span></h3>\n<p></p>\n<p>It’s been four years this month since the Edge 830 came out (alongside the Edge 530). During that time, the 530/830 received an astonishing number of feature updates, alongside the Edge 1030 and then Edge 1030 Plus. My goal in this ‘what’s new’ section isn’t to compare to the Edge 530/830 devices at release, but rather, to compare what’s new on the Edge 840 as of now. Meaning, taking into account all those firmware updates.</p>\n<p>With that in mind, the vast majority of newness here software-wise has already been seen on the Edge 1040 since last summer. There’s really only a couple of features (freeride ClimbPro, ClimbPro Explorer, &amp; to a lesser extent revamped daily suggested workouts for races) that are actually new-new here. And those are also coming to the Edge 1040 in a firmware update shortly. Here’s all the new things:</p>\n<p>– Edge 840 has BOTH touchscreen and full button set (previously only had partial button set)<br />\n– Added multiband/dual-frequency GPS<br />\n– Added solar panels for Edge 540/840 Solar editions<br />\n– Added USB-C connection for charging/sync<br />\n– Made it slightly chubbier to accommodate solar panels (non-Solar edition is also same new dimensions)<br />\n– Completely revamped the user interface everywhere (matches Edge 1040)<br />\n– Added Power Guide race/training pacing feature<br />\n– Added ClimbPro Free-Ride mode, which automatically triggers ClimbPro without a route<br />\n– Added Climb Explorer dashboard for finding nearby climbs<br />\n– Added Connect IQ Widget Glances to Homepage/Dashboard<br />\n– Added Training Status 2.0<br />\n– Added full automatic race/event suggested workouts using a periodized/phased daily plan leading up to event, inclusive of any Garmin wearable data shifts (e.g., automatically reducing planned workout if you got no sleep on a redye flight)<br />\n– Added Course Demands to compare course features to ride needs<br />\n– Added Real-Time Stamina to show energy/distance/duration left during workout<br />\n– Added Location Search Widget<br />\n– Added ‘Recent Finds’ from navigation panel (so things you recently searched for)<br />\n– Added new ‘Bike Shops’ &amp; ‘Water Stops’ categories for navigation search (and completely re-did other categories to mostly get rid of auto stuff)<br />\n– Added Post-Ride ClimbPro Splits on device<br />\n– Added re-scheduling of primary workouts<br />\n– Added support race/event driven Daily Suggested Workouts (expanded from initial Edge 1040 launch)<br />\n– Added paired sensor information to summary page (even for non-Garmin sensors)<br />\n– Added support for Shimano STEPS sensor type (eBike component)<br />\n– Added new consolidated post-ride Highlights screen with PRs<br />\n– Added estimated battery remaining when toggling Battery Saver mode<br />\n– Added manual WiFi sync all button (a ‘do it now’ option, but removed single-ride upload option)<br />\n– Added phone-based config of data fields/data pages<br />\n– Added ability to use phone for typing text on Edge<br />\n– Added ability to manually transfer sensors and device profiles to Edge from phone at any time (not just first setup)<br />\n– Added Garmin Connect IQ App Store on-device marketplace<br />\n– Added LiveTrack Spectator Messaging<br />\n– Changed nearby POI/Things search to be virtually instant<br />\n– Far faster route calculation/recalculation times<br />\n– Increased ClimbPro coloring to show more gradient definition<br />\n– Now automatically changes map popularity type to match activity (I.e., Road vs MTB)<br />\n– Changed screen background default from black to white for improved “readability”<br />\n– Removed horrifically unreliable duplicate Bluetooth pairing process for phones<br />\n– Removed Varia Vision sensor support<br />\n– Removed device transfer (sharing between units)<br />\n– Same 2.6” touchscreen size/resolution as before, however, Garmin says it has improved contrast ratio and color filters<br />\n– Weight is 90g for Edge 840 solar (up from 80g for Edge 830)<br />\n– Battery life up to 48 hours non-solar, 78 hours solar. Up to 34 hours with Multi-Band GPS mode with Solar (battery chart lower down)<br />\n– Simplified Bluetooth phone pairing to single connection (versus previous dual legacy BT and BT smart)</p>\n<p>Additionally, while this is offered on the Edge units, it came much later, but it is still present on the newer units, and wanted to call it out:</p>\n<p>– Paired sensor transfer from existing Garmin Edge units<br />\n– Activity Profile settings transfer from existing Garmin Edge units</p>\n<p>In total, there are three SKUs/variants for both the Edge 540 &amp; Edge 840, they are as follows (which include basically a $50+ price increase over the previous generation):</p>\n<p>– Edge 540 base: $349/€399/£349<br />\n– Edge 540 Solar: $449/€499/£449<br />\n– Edge 540 Performance Bundle (which includes heart rate strap, speed sensor, cadence sensor): $449/€499/£449<br />\n– Edge 840 base: $449/€499/£449<br />\n– Edge 840 Solar: $549/€599/£549<br />\n– Edge 840 Performance Bundle (which includes heart rate strap, speed sensor, cadence sensor): $549/€599/£519</p>\n<p>And the short version of how the Edge 540 vs 840 differs is actually surprisingly simple:</p>\n<p>1) The Edge 840 has a touchscreen display, the 540 does not (both have full sets of buttons)<br />\n2) The Edge 840 has 32GB of storage versus 16GB on the Edge 540<br />\n3) The Edge 840 comes pre-loaded with two regions, the Edge 540 with one pre-loaded (but you can swap/download others after for free)<br />\n4) The Edge 840 can search on-device for specific street addresses and GPS coordinates, the Edge 540 cannot.<br />\n5) The Edge 840 has Trailforks maps pre-activated, versus with the Edge 540 you need to manually activate it once (also free)<br />\n6) The Edge 840 can manually build a multi-step structured workout on-device (using touch), the Edge 540 you need to send from app/3rd party/daily suggested workouts, or use interval builder on-device<br />\n7) The Edge 840 editions cost $100 more</p>\n<p><em>(Side note: If you’re trying to build a complex multi-step workout on-device, something in your day/life/cycling world has gone horrifically wrong, you really don’t want to do this, even on the Edge 840. Trust me, nothing good comes from that rabbit hole.)</em></p>\n<p>Honestly, the only two things that really matter in that above list besides price, for 99% of the people are the touch (and that’s a big deal here), and the bigger storage size if you frequently fly across the pond (any pond).</p>\n<p>Phew, got all that? Good, let’s crack it open.</p>\n<h3><span>In the Box:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6375.jpg\"><img title=\"DSC_6375\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6375_thumb.jpg\" alt=\"DSC_6375\" width=\"720\" height=\"480\" /></a></p>\n<p>There are a couple of different bundles available of the Edge 840, but in my case, I’ve just got the simple Edge 840 Solar base unit kit. Other bundles include things like extra sensors or such.</p>\n<p>Here’s everything unboxed on a table:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6377.jpg\"><img title=\"DSC_6377\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6377_thumb.jpg\" alt=\"DSC_6377\" width=\"720\" height=\"480\" /></a></p>\n<p>Inside you’ll find the Edge 840 itself, along with a lanyard in the event you don’t have full trust in the mount. While mounts do break, I’ve only ever seen that occur during a major crash, or if you’ve overloaded a 3rd party mount with too-heavy items (which doesn’t really apply here). There’s also a small hex wrench in case you need to remove the inside of the mount to add a Garmin battery pack/power bank.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6378.jpg\"><img title=\"DSC_6378\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6378_thumb.jpg\" alt=\"DSC_6378\" width=\"720\" height=\"480\" /></a></p>\n<p>Then we’ve got the included out-front mount. It’s plastic, but is a beefcake plastic, so it’s certainly gonna be pretty difficult to break. It comes with a few different collars, in case you have bigger/smaller handlebars.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6380.jpg\"><img title=\"DSC_6380\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6380_thumb.jpg\" alt=\"DSC_6380\" width=\"720\" height=\"480\" /></a></p>\n<p>Then there’s the rubber quarter-turn mounts that most people use. These have been standard on Garmin bike GPS units for almost 15 years now, and work great. Super quick and easy to switch around between bikes.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6379.jpg\"><img title=\"DSC_6379\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6379_thumb.jpg\" alt=\"DSC_6379\" width=\"720\" height=\"480\" /></a></p>\n<p>And finally, the USB-C charging cable – woot!</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6386.jpg\"><img title=\"DSC_6386\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6386_thumb.jpg\" alt=\"DSC_6386\" width=\"720\" height=\"480\" /></a></p>\n<p>The weight of the Edge 540 Solar is 85g, 840 Solar is 90g, and 1040 Solar edition is 134g. Oh, and if you were to compare it to the Edge 530/830, you’ll see it chunked up a bit, presumably to fit the solar panels in there (Left: Edge 830, Edge 540 Solar, Edge 840 Solar, Edge 1040 Solar)</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6397.jpg\"><img title=\"DSC_6397\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6397_thumb.jpg\" alt=\"DSC_6397\" width=\"720\" height=\"480\" /></a></p>\n<p>And for fun, here’s a lineup with a bunch of units: Wahoo BOLT V2, Edge 830, Edge 540 Solar, Edge 840 Solar, Wahoo ROAM V2, Hammerhead Karoo 2, Garmin Edge 1040 Solar.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6399.jpg\"><img title=\"DSC_6399\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6399_thumb.jpg\" alt=\"DSC_6399\" width=\"720\" height=\"480\" /></a></p>\n<p>Next is getting it all configured and covering some of the basic usability bits.</p>\n<h3><span>Basics and Configuration:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-Review-The-Basics.jpg\"><img title=\"Garmin-Edge-840-Review-The-Basics\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-Review-The-Basics_thumb.jpg\" alt=\"Garmin-Edge-840-Review-The-Basics\" width=\"720\" height=\"480\" /></a></p>\n<p>The biggest physical difference on the Edge 840 compared to the Edge 830 is that it’s got a full set of buttons. Previously, Garmin’s touchscreen devices always had fewer buttons than their untouchable counterparts. However, since Garmin started introducing touchscreens to their Fenix wearables last year, they’ve shifted to a model of ‘equality’ when it comes to touch vs buttons. Basically, you can choose whether you want to use buttons or touch, for virtually every operation. The only notable exception being you have to use a physical button to start/stop a ride.</p>\n<p>You can see the 7 buttons on the Edge 840 below. Essentially the side buttons are for navigation/confirmation in menus, whereas the front/bottom ones are for stop/start/lap. Those bottom buttons are (never?) used in any menus at all, they are only ever for starting/stopping a ride.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ButtonSide1.jpg\"><img title=\"Garmin-Edge840-ButtonSide1\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ButtonSide1_thumb.jpg\" alt=\"Garmin-Edge840-ButtonSide1\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ButtonSide2.jpg\"><img title=\"Garmin-Edge840-ButtonSide2\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ButtonSide2_thumb.jpg\" alt=\"Garmin-Edge840-ButtonSide2\" width=\"355\" height=\"237\" /></a></p>\n<p>Meanwhile, atop you’ve got a touchscreen for all the touching you want to do. I haven’t had any issues in either sunny/hot/sweaty conditions, or everyday Amsterdam rainy conditions using the touchscreen. Same goes for gloves – no problems there as you can see in some of my videos.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image001.jpg\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image001_thumb.jpg\" alt=\"clip_image001\" width=\"720\" height=\"486\" /></a></p>\n<p>In fact, the Edge 840 is probably the first time I’m mostly switching my recommendation towards preferring the 840 vs the 540 (historically I’ve always kinda preferred the 510/520/530 series devices over the 810/820/830 devices), in part because I found the buttons faster. But as the reliability and ease of use of Garmin’s touchscreen has improved, I found it harder and harder to go back to a pure button setup on the Edge 540. Obviously, that’s partially because I’ve become accustomed to the good touchscreen on the 840/1040, but also because…it’s 2023 – touch for certain operations feels natural (like mapping, swiping data pages, or quickly changing data fields mid-ride).</p>\n<p>The other major change is the USB-C charging port on the button. Sure, you’ve got solar panels up top for the Edge 540/840 Solar editions (more on that in the Solar section down below), but frankly those just don’t charge too much. Instead, you’re likely to plug it in, and you can do so here with any USB-C charger (such as your laptop).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-USB-C-Port.jpg\"><img title=\"Garmin-Edge-840-USB-C-Port\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-USB-C-Port_thumb.jpg\" alt=\"Garmin-Edge-840-USB-C-Port\" width=\"720\" height=\"480\" /></a></p>\n<p>The port has a little cover, but it’s also internally waterproofed to IPX7. That means you can crash into a shallow canal (up to 1 meter deep), and then you’ve got 30 minutes to fish it out. Note that like airline safety demonstrations, you should save yourself first from the canal, before saving your accessories.</p>\n<p>Also, there’s a small lanyard hole next to the cover, in case that’s your kind of thing. It’s not my preference, but no judgements.</p>\n<p>On the back of the unit there’s a standard Garmin quarter-turn mount that’s been used for the past 15 years. This mount is found on countless 3rd party mount accessories, and even a number of bikes have it built-in these days.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Back.jpg\"><img title=\"Garmin-Edge840-Back\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Back_thumb.jpg\" alt=\"Garmin-Edge840-Back\" width=\"720\" height=\"480\" /></a></p>\n<p>You’ll also notice the power pins there. Those are compatible with Garmin’s severely outdated battery pack, as well as their brand new <a href=\"https://www.dcrainmaker.com/2022/07/garmin-edge-explore-2-in-depth-review.html#edge-power-mount-bundle\">Garmin Edge Power Mount from last summer (</a>if your bike has power in it, and can power items forever). I’ve used it with the power mount and it worked just fine. When used with the power mount, it’ll disable solar charging. I presume the same for the battery pack.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-PowerMount.jpg\"><img title=\"Garmin-Edge-840-PowerMount\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge-840-PowerMount_thumb.jpg\" alt=\"Garmin-Edge-840-PowerMount\" width=\"720\" height=\"480\" /></a></p>\n<p>Battery-wise, we’ll talk about those claims at the end of this section, and my test results.</p>\n<p>Once you power it on (upper left button), you’ll see your ride profiles up top. By default this is Road/Mountain/Indoor, but you can customize each one, or create your own. They’ve all got their own colors, and within that, you can customize data pages/settings for each of them. This is handy when you want mountain bike metrics different from road cycling metrics, and then perhaps a more reduced set for indoor riding.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-MainHomepage.jpg\"><img title=\"Garmin-Edge840-MainHomepage\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-MainHomepage_thumb.jpg\" alt=\"Garmin-Edge840-MainHomepage\" width=\"720\" height=\"480\" /></a></p>\n<p>Below that you’ll find what is essentially a ‘What’s new’ panel. This shows you the last notable thing to sync to the device, or thing that you’ve done. For example, if you have a structured workout scheduled, it’ll show that. If you just sent a new course/route to the unit, it’ll show that. If you just completed a ride, it’ll show that, and so on.</p>\n<p>Each one of these sections, as you scroll down, is both a menu item, but also a customizable widget. You can add widgets from both Garmin as well as 3rd parties onto it. For example, if you open up the ‘Navigation’ widget, you’ll see where you can load courses, browse the map, or navigate to saved locations. I cover navigation and mapping in the Navigation section down below.</p>\n<p>You can customize this list at the bottom. For example, I added Acute Load, Training Status, and Load Focus to my list.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Edge840-WidgetGlanceTweak.jpg\"><img title=\"Edge840-WidgetGlanceTweak\" src=\"https://media.dcrainmaker.com/images/2023/04/Edge840-WidgetGlanceTweak_thumb.jpg\" alt=\"Edge840-WidgetGlanceTweak\" width=\"720\" height=\"480\" /></a></p>\n<p>Next, you can swipe-down from the top to access a common set of menus whether doing a ride or not. This has controls like changing your ride profile, turning on/off GPS, the battery, screen brightness, sensors, and more. If you tap left/right, you’ll get additional control panels. For example, if you’re in a course, you can stop the course. Or inversely, you can route somewhere like back to home, from this panel. Same goes for stopping/starting a structured workout, or turning on/off bike lights if those are attached. There’s a notifications panel to see missed notifications, a weather page to see that it’s probably still raining outside in Amsterdam, and then both a Strava Segment explorer and a new Climb Explore feature (more on that in the ClimbPro section).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6179.jpg\"><img title=\"DSC_6179\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6179_thumb.jpg\" alt=\"DSC_6179\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6180.jpg\"><img title=\"DSC_6180\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6180_thumb.jpg\" alt=\"DSC_6180\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6182.jpg\"><img title=\"DSC_6182\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6182_thumb.jpg\" alt=\"DSC_6182\" width=\"235\" height=\"157\" /></a></p>\n<p>This is really one of the areas the Edge 840 with the touchscreen really shines compared to the Edge 540 with the buttons. It’s just more cumbersome to navigate these controls menus on the 540. Not hard, but just not dead-quick/easy/simple like on the 840/1040.</p>\n<p>Next, back on the main page you’ll see that three-lined ‘hamburger’ menu option, which opens up the menu itself:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Edge840-Menu.jpg\"><img title=\"Edge840-Menu\" src=\"https://media.dcrainmaker.com/images/2023/04/Edge840-Menu_thumb.jpg\" alt=\"Edge840-Menu\" width=\"720\" height=\"480\" /></a></p>\n<p>That dives into all the different settings areas, this includes tweaking your Activity Profiles, such as the data pages and data fields you want. But that’s also areas like how ClimbPro works, or how nutrition alerts work, and the gazillion different settings that Garmin offers.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Edge840-ActivityProfileOverview.jpg\"><img title=\"Edge840-ActivityProfileOverview\" src=\"https://media.dcrainmaker.com/images/2023/04/Edge840-ActivityProfileOverview_thumb.jpg\" alt=\"Edge840-ActivityProfileOverview\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-CustomizeActivityProfile.jpg\"><img title=\"Garmin-Edge840-CustomizeActivityProfile\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-CustomizeActivityProfile_thumb.jpg\" alt=\"Garmin-Edge840-CustomizeActivityProfile\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ActivityProfile3.jpg\"><img title=\"Garmin-Edge840-ActivityProfile3\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-ActivityProfile3_thumb.jpg\" alt=\"Garmin-Edge840-ActivityProfile3\" width=\"235\" height=\"157\" /></a></p>\n<p>However, all of these things can be configured from the phone now. Like the Edge 1040, you don’t have to do this on the unit itself, but can tweak these quickly from the Garmin Connect Mobile app.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image001.png\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image001_thumb.png\" alt=\"clip_image001\" width=\"235\" height=\"509\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0015.png\"><img title=\"clip_image001[5]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0015_thumb.png\" alt=\"clip_image001[5]\" width=\"235\" height=\"509\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0017.png\"><img title=\"clip_image001[7]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0017_thumb.png\" alt=\"clip_image001[7]\" width=\"235\" height=\"509\" /></a></p>\n<p>In fact, if you had an older Edge device, then all of these would have migrated over as part of the Activity Profile migration setup process that’s offered when setting up a new device. And, even more notable is that new to the Edge 540/840 (and coming to the Edge 1040), is the ability to do both a sensor transfer and activity profile transfer whenever you want, not just during initial setup.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0019.png\"><img title=\"clip_image001[9]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0019_thumb.png\" alt=\"clip_image001[9]\" width=\"177\" height=\"383\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00111.png\"><img title=\"clip_image001[11]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00111_thumb.png\" alt=\"clip_image001[11]\" width=\"177\" height=\"383\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00113.png\"><img title=\"clip_image001[13]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00113_thumb.png\" alt=\"clip_image001[13]\" width=\"177\" height=\"383\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00115.png\"><img title=\"clip_image001[15]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00115_thumb.png\" alt=\"clip_image001[15]\" width=\"177\" height=\"383\" /></a></p>\n<p>That same concept applies to sensors. You can manually set them up from the device itself, or you can have it migrate all your previously paired sensors from other Garmin Edge devices. From a sensor standpoint, the Edge 540/840 support:</p>\n<p>– Heart Rate (ANT+/Bluetooth)<br />\n– Speed/cadence (ANT+/Bluetooth)<br />\n– Garmin VIRB Action Cam (ANT+)<br />\n– ANT+ Cycling Lights (front or rear)<br />\n– ANT+ Cycling Radar Sensors<br />\n– Power meters (ANT+/Bluetooth)<br />\n– Garmin inReach Satellite communicators<br />\n– Garmin Edge remote controls<br />\n– Shimano STEPS<br />\n– eBike (ANT+)<br />\n– ANT+ Shifting (Campagnolo/SRAM)<br />\n– Shimano Di2 (proprietary ANT)<br />\n– Garmin Tempe Sensor (ANT+ temperature sensor)<br />\n– ANT+ FE-C Cycling Smart Trainers/Bikes<br />\n– ANT+ Extended Display</p>\n<p>Basically, it’s the same list as before. As with before, you can pair multiple types of the same sensor (e.g. three power meters on different bikes), each giving them your own names as you see fit.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-SensorSet.jpg\"><img title=\"Garmin-Edge840-SensorSet\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-SensorSet_thumb.jpg\" alt=\"Garmin-Edge840-SensorSet\" width=\"720\" height=\"480\" /></a></p>\n<p>I haven’t had any problems with any sensors during my usage, which has included multiple power meters (Stages LR, Garmin Rally, Garmin Vector 3), multiple heart rate sensors (Polar H10, Garmin HRM-PRO Plus), a few trainers/smart bikes (Wahoo KICKR Bike and Wahoo KIKR V6), and two different radar units (Garmin RVR-315 &amp; Magene L508). All worked as expected.</p>\n<p>Finally, there’s the incident detection and live tracking. You can set this up once, and then you don’t have to worry about it again, it’ll just automatically send an e-mail to your family/friends with a LiveTrack link in case you go missing (or just so they know when you’ll be home). In my case, I’ve set it up to automatically e-mail my wife each time I start a ride.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-SafetyLiveTrackMenus.jpg\"><img title=\"Garmin-Edge840-SafetyLiveTrackMenus\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-SafetyLiveTrackMenus_thumb.jpg\" alt=\"Garmin-Edge840-SafetyLiveTrackMenus\" width=\"720\" height=\"480\" /></a></p>\n<p>She’ll see both my current location as well as the planned route (if loaded). Also, she’ll see how much suffering I’m doing with sensor data like heart rate/cadence/power. I will give Garmin credit where credit is due. LiveTrack a few years ago used to be completely useless and full of connectivity issues and drops. These days, I find it generally quite dependable. Both myself and my wife use it on every ride, almost always without issue.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DCR-LiveTrackRide.png\"><img title=\"DCR-LiveTrackRide\" src=\"https://media.dcrainmaker.com/images/2023/04/DCR-LiveTrackRide_thumb.png\" alt=\"DCR-LiveTrackRide\" width=\"722\" height=\"349\" /></a></p>\n<p>Tied in with that is incident detection, which will detect when you crash. Or, if some other big impact happens. The algorithm is basically using the accelerometers and gyros internally, in conjunction with looking at your speed. The idea being if there’s a big g-force impact and your speed goes to zero, you’ve probably crashed. Whereas inversely, if your speed is maintained after a big impact, then you’ve likely just been riding on normal Belgium pot-hole filled roads. Or, you were hit by a turnip truck and are now lying atop it and the truck is still moving.</p>\n<p>I haven’t had any false-positives with the Edge 540/840 unit, though I do tend to average 1-2 per year, usually when I drop off a sidewalk edge or something and then immediately stop quickly at a light (such as to get around cars/traffic/construction blocking a bike lane). That tends to trip the conditions above. You’ve got 10-15 seconds to cancel the notification, before it sends a very dire text to your loved ones telling them things have gone poorly. It’ll continue tracking your location in the text it sends to them, in case you’re then brought to a hospital, they know where to find you.</p>\n<p>Given that positive note, let’s head outside and start riding with it.</p>\n<h3><span>Riding with it:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Edge840-Mounted-On-Stem.jpg\"><img title=\"Edge840-Mounted-On-Stem\" src=\"https://media.dcrainmaker.com/images/2023/04/Edge840-Mounted-On-Stem_thumb.jpg\" alt=\"Edge840-Mounted-On-Stem\" width=\"720\" height=\"480\" /></a></p>\n<p>The first order of business is simply quarter-turning it onto the mount and turning it on.  From there, you’ll choose the ride profile by just tapping on it, or changing it by tapping the left/right arrows.</p>\n<p>If you want to load up a course, now’s the time to do it via the ‘Navigation’ option, or if you just synced a course, it’ll show up on the ‘What’s New’ widget section. Same goes for any structured training, now’s the time to choose it. Generally speaking, I’ll load the course first, and then load the training, but it doesn’t really matter.</p>\n<p>When loading a course, if you’re not at the course start point, it’ll offer to route you to the beginning of the course. I generally skip this option unless I’m actually not at the start and don’t know how to get there. Also, some of these images are a bit harder to see than I realized, the camera was off-angle. Apologies! In real-life, there’s no issues seeing off-angle like with cameras.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge840-LoadCourse.jpg\"><img title=\"GarminEdge840-LoadCourse\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge840-LoadCourse_thumb.jpg\" alt=\"GarminEdge840-LoadCourse\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-NavigateToBeginning.jpg\"><img title=\"Garmin-Edge840-NavigateToBeginning\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-NavigateToBeginning_thumb.jpg\" alt=\"Garmin-Edge840-NavigateToBeginning\" width=\"355\" height=\"237\" /></a></p>\n<p>Once all that’s settled, you can press the start button and start riding. As noted earlier, the only way to start recording is to press that physical lower right button. This ensures any weird touchscreen things don’t impact the recording of your ride. By default, if you start riding but don’t press any buttons, it’ll notice you’re going somewhere and start chirping to press start. Inversely, auto-pause is on by default, which will pause the timer when you stop (such as at a stop-light). You can change that in the settings.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Edge840-RidingScreens.jpg\"><img title=\"Edge840-RidingScreens\" src=\"https://media.dcrainmaker.com/images/2023/04/Edge840-RidingScreens_thumb.jpg\" alt=\"Edge840-RidingScreens\" width=\"720\" height=\"480\" /></a></p>\n<p>Once riding, you’ll see the data pages as configured. You can either swipe with your hand left/right, or press the up/down buttons on the left side to move from page to page. There’s a lot of pages by default on the Edge units, and some of them can become somewhat duplicates of others. For example, the elevation profile page is handy if you’re riding mostly casual rolling hills, but if you’ve got steeper climbs that trigger ClimbPro, then it’s just sorta in the way. Customization is easy via the app.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h17m31s434.png\"><img title=\"vlcsnap-2023-04-11-13h17m31s434\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h17m31s434_thumb.png\" alt=\"vlcsnap-2023-04-11-13h17m31s434\" width=\"720\" height=\"405\" /></a></p>\n<p>By default, the unit will use the new multi-band/dual-frequency GPS/GNSS. This means higher accuracy, but it also means lower battery life in that mode. This mode is best if you’re spending time in the mountains, cities, or spending time offroad in dense trees. If you’re mostly riding on farm roads or out in suburbia, you can just use the regular mode ‘Balanced’ GPS option to save a bunch of battery life (details in the charts in a second). You can always access this by just swiping down from the top, and remember it’s per-activity profile. So you can go to ‘Balanced’ for your road bike profile, but leave it on Multi-GNSS for your MTB profile.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6202.jpg\"><img title=\"DSC_6202\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6202_thumb.jpg\" alt=\"DSC_6202\" width=\"720\" height=\"480\" /></a></p>\n<p>If you’ve got any timers or alerts, those will appear as you ride. For example, you can set up nutrition/hydration alerts under the ‘Alerts &amp; Prompts’ section, which lets you create independent reminders for both of those, as well as a bunch of other categories like power/cadence/time, and even a ‘Turn-Around’ reminder for a set distance.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6203.jpg\"><img title=\"DSC_6203\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6203_thumb.jpg\" alt=\"DSC_6203\" width=\"720\" height=\"480\" /></a></p>\n<p>These will then show up mid-ride based on how you’ve configured them. For eat/drink alerts, you can also have it be ‘smart’ alerts based on figuring out calories (food), as well as temperatures/intensity (hydration).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6204.jpg\"><img title=\"DSC_6204\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6204_thumb.jpg\" alt=\"DSC_6204\" width=\"720\" height=\"480\" /></a></p>\n<p>Meanwhile, if you trip a Strava Segment, it’ll automatically show you the Strava Live Segment page. Note that you can use Live Segments with courses, but it has to be a Strava Course, so that it bakes the segment into it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0016.jpg\"><img title=\"clip_image001[6]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0016_thumb.jpg\" alt=\"clip_image001[6]\" width=\"720\" height=\"480\" /></a></p>\n<p>In terms of display visibility, I’ve had no real issues in viewing the screen. As with the Edge 1040 Solar, the solar variants are slightly darker than the non-solar variants, due to the solar panel being overlaid atop the screen (across the entire screen at a 15% photovoltaic level). You can’t visually see it, but you do notice it’s slightly darker for the same backlight setting. In some conditions I found I needed to bump-up the backlight from the default ‘Auto’ setting to just a touch bit brighter. But nothing major.</p>\n<p>Once your ride is done, you’ll get two sets of summary pages. The first is focused on training load related metrics, followed by some solar (if applicable) and then sensor pairing bits. After which there’s a second page that covers more of your ride details, including a course outline, total ride stats, and plenty more. No really, a disturbing amount of stats are below, the more you scroll. All the way at the bottom you’ve also got a summarization of your climbs too, for any triggered climbs (via ClimbPro).</p>\n<p>Finally, all of this gets synced to Garmin Connect virtually instantly via Bluetooth or WiFi (or USB if needed), and then onwards to 3rd party apps like Strava/TrainingPeaks/etc. You can see an example of one of my rides here on Garmin Connect:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GarminConnectScreenShot.png\"><img title=\"GarminConnectScreenShot\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminConnectScreenShot_thumb.png\" alt=\"GarminConnectScreenShot\" width=\"722\" height=\"526\" /></a></p>\n<p>So – what about battery life? Well, let’s start with a quick look at the official charts for the Edge 540/840:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge540-840BatteryChart.png\"><img title=\"Garmin-Edge540-840BatteryChart\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge540-840BatteryChart_thumb.png\" alt=\"Garmin-Edge540-840BatteryChart\" width=\"720\" height=\"280\" /></a></p>\n<p>In my case, for rides where I wasn’t doing some sort of screen recording, it was generally burning at a rate of about 25-40 hours, inclusive of some solar activity, but not often a lot. In my case, I would generally fall between the ‘Mid’ and ‘Demanding’ on the chart above, where I had multiband enabled, 1-second recording, and 2 sensors (power/HR), plus sometimes either a structured workout or navigation. I generally did not hang out on the map page (as that burns faster). I also had LiveTrack enabled and Auto backlight usually on/stays on.</p>\n<p>My results for both the Edge 540 &amp; Edge 840 basically match what I saw with the Edge 1040 in relation to Garmin’s battery claims: They were conservative – in some cases, hugely so. Meaning, in every one of my tests my battery burn rate was better than that of Garmin’s claims. Heck, that’s even with screen recording enabled and heavy debug information enabled (in case something went wrong) it surpassed Garmin’s claims (just barely despite all that load).</p>\n<h3><span>ClimbPro &amp; New Free-Ride Mode:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m35s683.png\"><img title=\"vlcsnap-2023-04-11-13h11m35s683\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m35s683_thumb.png\" alt=\"vlcsnap-2023-04-11-13h11m35s683\" width=\"720\" height=\"405\" /></a></p>\n<p>Years ago Garmin introduced ClimbPro, first on their wearables (<a href=\"https://www.dcrainmaker.com/2018/06/garmin-fenix5-plus-5s-5x-in-depth-review.html\">the Fenix 5 Plus</a> in 2018), and then on the Garmin Edge cycling computers starting with the Edge 530/830/1030 series. The goal of ClimbPro was that if you had a course loaded, you’d be able to see the exact profile of the climb both before-hand, as well as during the ride. As you approached the climb it’d count-down, and then once riding on the actual climb it’d show you details like gradient remaining, ascent remaining, and plenty more.</p>\n<p>It continues to be my favorite Garmin feature out of everything they do. It makes it exceptionally easy to see how much suffering you have left.</p>\n<p>The problem though, is that up till now, that required a route/course be loaded, or be doing some sort of pre-planned navigation. Meaning, if you were just doing a regular ride without a course/route loaded, you didn’t get climb information. Last spring, their GPS competitor Hammerhead, took this concept further with their own free-ride mode, <a href=\"https://www.dcrainmaker.com/2022/03/hammerhead-updated-climbr-functionality-no-longer-requires-route.html\">allowing you to just approach a climb on the Karoo 2 bike computer</a>, and see the same climb stats as if you had pre-planned it.</p>\n<p>With the Edge 540/840, Garmin is now joining that camp too. You no longer need to have a route/course loaded. Instead, it’ll automatically attempt to figure out your climb based on the road you’re on, and then show you that route profile. The Edge 1040 will shortly get a firmware update enabling that feature as well.</p>\n<p>In my testing, I’ve been using the Edge 540/840 in free-style ClimbPro mode side-by-side with the Edge 1040 with a course loaded, all of this also side-by-side with the Hammerhead Karoo 2 and Wahoo ROAM 2, to see how they handle.</p>\n<p>First though, a quick look at ClimbPro in regular route mode. Basically, when you load a course, it’ll automatically show you the climbs from that course. These climbs are determined based on them meeting specific criteria for what constitutes a climb, with the minimum threshold being:</p>\n<blockquote><p>“3% gradient and 500m length, with both needing to be satisfied.”</p></blockquote>\n<p>However, you can also configure ClimbPro (per activity profile) to ignore smaller climbs, and only show bigger ones.</p>\n<p>You can see the total number of climbs, and the exact specifications for each climb. While riding, it’ll show you the distance until the next climb. Thus, while the free-ride ClimbPro is great, for longer routes with multiple climbs, it’s nice to know what lies ahead.</p>\n<p>As you approach the climb, you’ll get a warning about 100 meters out, and then the distance will count-down. Once you cross the threshold of the start of the climb, it’ll automatically switch to the ClimbPro page, which includes stats about the climb itself, as seen below:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h21m55s089.png\"><img title=\"vlcsnap-2023-04-11-13h21m55s089\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h21m55s089_thumb.png\" alt=\"vlcsnap-2023-04-11-13h21m55s089\" width=\"720\" height=\"405\" /></a></p>\n<p>All of this worked just fine/as expected for me on both the 540 and 840 – matching exactly what I had on the Edge 1040 also concurrently operating. And in the case of all my climbs, ClimbPro ended at the top of each climb as expected (there’s currently an issue some people are seeing on some climbs on some routes on certain Edge units, seemingly tied to data from Strava, where the climbs can become offset – but for whatever reason, none of my climbs have triggered that).</p>\n<p>So, that brings us to the newness, which are two pieces. The first is the new Climb Explorer drop-down menu, which lets you see nearby climbs. This menu shows you climbs sorted by nearness to you, upwards of 150 of them. It’s actually kinda astounding how many climbs are nearby some places I ride. Who knew?!?</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/P1088418.jpg\"><img title=\"P1088418\" src=\"https://media.dcrainmaker.com/images/2023/04/P1088418_thumb.jpg\" alt=\"P1088418\" width=\"720\" height=\"480\" /></a></p>\n<p>You can then tap on any given one to see more details about it, showing you the normal per-climb ClimbPro page:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/P1088419.jpg\"><img title=\"P1088419\" src=\"https://media.dcrainmaker.com/images/2023/04/P1088419_thumb.jpg\" alt=\"P1088419\" width=\"720\" height=\"480\" /></a></p>\n<p>And then, from there, you can tap again to get directions to the base of that climb, ready for you to suffer.</p>\n<p>Additionally, if you tap the upper right button, you can see the settings, allowing you to create some filters for this list:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6212.jpg\"><img title=\"DSC_6212\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6212_thumb.jpg\" alt=\"DSC_6212\" width=\"720\" height=\"480\" /></a></p>\n<p>Notably, this list populates pretty quickly. You can see this in my main review video. That’s because Garmin has substantially increased the size of their mapset (in GB) to pre-cache/create all of these climbs. It’s actually kinda mind-boggling when you think of it, but this ensures that the data is fast and responsive, versus much slower (compared to creating a ‘Round-Trip’ course/route on demand, which takes forever). However, one minor thing to note is that the minimum threshold here is slightly higher than the 3% for ClimbPro as a whole. At present, the minimum threshold is 3.5% for the Climb Explore feature. Garmin says that this threshold might change over the coming months, pending user feedback.</p>\n<p>All of which eventually gets us to the main new feature of the Edge 540/840, which is the ClimbPro free-ride mode. This means you just ride, and it does its magic. As you’re <em>just riding along</em> it’ll show you a notification as you approach a climb, just like with the course mode:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m21s696.png\"><img title=\"vlcsnap-2023-04-11-13h11m21s696\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m21s696_thumb.png\" alt=\"vlcsnap-2023-04-11-13h11m21s696\" width=\"720\" height=\"405\" /></a></p>\n<p>And then, equally just like regular ClimbPro mode, it’ll show you the stats to the top of the climb:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m28s682.png\"><img title=\"vlcsnap-2023-04-11-13h11m28s682\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m28s682_thumb.png\" alt=\"vlcsnap-2023-04-11-13h11m28s682\" width=\"720\" height=\"405\" /></a></p>\n<p>Literally, it’s exactly the same…except when it’s not.</p>\n<p>Which is to say that the key difference is that it doesn’t actually know where the top of your climb is. For example, I went riding last week in Belgium, up many of the famed cobbled classic climbs. In that case, those are very crispy start/finish climbs. There’s no ambiguity, and having a course loaded on an Edge 1040 vs the climbs in free-style mode on the 540/840, they matched identically.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00118.jpg\"><img title=\"clip_image001[18]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00118_thumb.jpg\" alt=\"clip_image001[18]\" width=\"720\" height=\"540\" /></a></p>\n<p>However, the week before, when riding the climbs of Mallorca, it was a bit more mixed. In some cases, the climbs matched precisely, namely for climbs where again the top was crispy and clear. For example – climbing up Sa Calobra, the end is one known/clear spot with a sign and all. A few meters later, it goes downhill on the other side of the pass. That’s easy.</p>\n<p>But getting to the backside of Sa Calobra from the flatlands? Well, that’s messier. There are multiple routes up, and most of them contain what is mostly regarded as one big climb, followed by some rolling flats for a while, before one more moderate climb. In this case, I saw differences for how it split this up. Coming via Lluc for example, in free-ride mode, it split the climb up at Lluc. I understand why it did this, because the road descends a bit first, then turns there and flattens out – before going back up. But that’s not the way most people define that climb. Most cyclists would say the top is up a bit higher near the road junction. Hammerhead’s free-style mode got this right (the screen recording for that died before I got to this section), as did Garmin’s course variant – but not Garmin’s free-ride ClimbPro.</p>\n<p>But you can see below that the Edge 840 is about to end the climb in a few seconds, whereas the Edge 1040 with the known course knows that it’s another 3.38km to go after this brief downhill section. The Edge 840 assumes I’m taking a turn shortly thereafter.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h23m45s602.png\"><img title=\"vlcsnap-2023-04-11-13h23m45s602\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h23m45s602_thumb.png\" alt=\"vlcsnap-2023-04-11-13h23m45s602\" width=\"722\" height=\"407\" /></a></p>\n<p>A few times, it started a climb too early, for example, on some very flat sections that were only 1-2% in gradient, hundreds of meters (or even kilometers) before the actual climb. Sure, I was barely going up, so on a technicality this is correct, but not from an accepted cyclist’s perspective (which again, in ClimbPro course mode it detected all of these correctly).</p>\n<p>Which isn’t to say it’s bad. Far from it. Again, the vast and overwhelming majority of the time it was spot-on. But at the moment, Hammerhead’s free-ride mode does a better job at detecting the specifics of the start/end points. Inversely, Hammerhead’s CLIMBER mode is far inferior when it comes to the gradient data inside the feature. Meaning, it’s very often wrong about the upcoming gradient – and severely so. A very long-term problem that’s been going on for years, due to bad underlying data. I guess a case of pick your poison.</p>\n<p>Finally, I did have two notable ClimbPro free-ride failures. The first was a case where the road itself ended, and then there was a barrier, followed by a dirt road that went higher. In that case, the free-ride mode told me to keep going, as if I was only half-done with the climb (both Garmin ClimbPro course-mode and Hammerhead Karoo 2 CLIMBER correctly finished the climb). Garmin tracked down this error and it’s already fixed in a firmware update issued last week after my ride. The second error was at the top of Sa Calobra, when the unit started to rapidly increase the remaining gradient, eventually ending up at 105% gradient. Yes, for real. In fact, you can see a similar variant of this bug up to the on the (above/below) Edge 840 screenshot showing “19%” gradient remaining.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h23m45s602-1.png\"><img title=\"vlcsnap-2023-04-11-13h23m45s602\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h23m45s602_thumb-1.png\" alt=\"vlcsnap-2023-04-11-13h23m45s602\" width=\"723\" height=\"406\" /></a></p>\n<p>Garmin tracked this down to some bad data in the mapset itself, and has filed a bug to their map data team to fix this. Why this impacted only ClimbPro free-ride mode and not ClimbPro course-mode I don’t know, but hopefully nobody else gets 105% gradients.</p>\n<p>Either way, overall I’m pretty happy with the free-ride mode, but it’s also clear it’s early days for it. Like with Hammerhead when they launched their free-ride mode, Garmin too says they expect to be tweaking it over the coming months as they get feedback from users. Which is actually exactly what they did when they launched ClimbPro the first time around years ago – over the first few months things changed a bit in terms of what triggered climbs and how they triggered.</p>\n<p>So finally, what about reaction time of the gradient display itself? Meaning, set aside ClimbPro – and focus just on how fast the unit responds to gradient changes. To be really clear here (cause there’s a lot of confusion), this is *100% totally separate from ClimbPro* – the two have literally nothing to do with each other. ClimbPro is all about showing expected gradient based on known map data as you ride it. Whereas the internal sensors are responsible for showing the current gradient, and how fast it responds to situations.</p>\n<p>A common complaint of the Edge 1040 is that it’s historically responded too slowly for some tastes, namely in sharper/steeper climbs. <a href=\"https://www.dcrainmaker.com/2022/03/bike-gps-climing-comparison-wahoo-garmin-hammerhead.html#:~:text=Both%20companies%20publish%20how%20they,a%20minimum%20grade%20of%203%25.\">I actually did an entire video/post on it a year ago</a>. In that video, I basically found that there are cases where it’s slower than their competitors, but also cases where the inverse was true. And further, as noted above, if you did take into account ClimbPro or Hammerhead’s CLIMBER, then those instant gradient differences were mostly moot when looking at ClimbPro.</p>\n<p>Nonetheless, I’ve spent an inordinate amount of effort and time trying to document the differences between these units: Garmin Edge 540/840/1040, Hammerhead Karoo 2, and Wahoo ROAM V2. Basically, doing side-by-side rides of both long-term/slow climbs, but also fast/sharp/steep climbs, with cameras and screen recording going. You can see a tidbit of this in my main review video, with a longer breakout video to come.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h26m52s888.png\"><img title=\"vlcsnap-2023-04-11-13h26m52s888\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h26m52s888_thumb.png\" alt=\"vlcsnap-2023-04-11-13h26m52s888\" width=\"720\" height=\"405\" /></a></p>\n<p>The long and the short of it though is that the Edge 540/840 seem to act slightly faster than the Edge 1040 in some cases, but about the same in others. In relation to the Karoo 2 and ROAM 2, the Karoo 2 is by far the fastest responding gradient changer. In 90% of those cases, it gets it correct far faster, but every once in a while it’ll be suspectable to some wonky gradient response that doesn’t align to reality. The Wahoo ROAM V2 is sorta the middle-ground, generally neither super-fast nor super-slow. Just sorta middle-bear.</p>\n<p>Then you’ve got the Edge units. In cases of more normal climbs, you’re almost never going to notice the differences between all of these units (compared to Karoo/Wahoo), they all slowly increase to match the slowly increasing gradient. However, in short/steep climbs where the road bucks upwards and you swear a bunch, you’ll typically see about 5-10 seconds of lag on the Garmin units. There’s some speculation that this is because Garmin has a 15-second weighted smoothing average in place, likely to reduce errors from things like vibrations or even wind (in fact, I saw some of this impact the Karoo 2’s and Wahoo ROAM’s normally faster responsiveness on a recent ride on cobblestones). This somewhat evens out in that as you flatten back out, it’s still showing higher gradients because of that lag.</p>\n<p>But yeah, if you are frequently riding roads that are basically yelling FU at you, then you might carry that forward to the Garmin Edge series when it shows 0% and you’re actually at 20%. For better or worse, I don’t have any of those roads anywhere around me, perhaps not even in this entire country. I had to travel to Belgium and Mallorca over the past few weeks to find some of those. All of which is documented above.</p>\n<p>Still, it’s important not to overthink some of these issues. While there are vocal critics of Garmin’s gradient responsiveness, the overwhelming majority of people don’t seem to notice/care. Make of that what you want. Would I like it to be faster? Of course. If I had to balance faster responsiveness for brief FU climb gradient changes (Karoo 2) versus more accurate ClimbPro data (Garmin), I’m going to choose the more accurate ClimbPro data every time, since that’s the thing I’m actually looking at for the next 15-75 minutes of climbing. But to each their own – maybe some day we’ll get both.</p>\n<h3><span>Navigation &amp; Mapping:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-NavigationMapping.jpg\"><img title=\"Garmin-Edge840-NavigationMapping\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-NavigationMapping_thumb.jpg\" alt=\"Garmin-Edge840-NavigationMapping\" width=\"720\" height=\"480\" /></a></p>\n<p>This section is all about navigating with the Edge unit, and the built-in maps. To begin, the Edge 540/840/1040 all come with pre-loaded maps, as well as the ability to download cycle-specific maps for free. The main difference between those units is how much storage space you have, and if extra regions are pre-loaded. The Edge 540 comes with 16GB, the Edge 840 with 32GB, and the Edge 1040 with 64GB. But functionality-wise, all three units are identical map data-wise (except for address search I’ll talk about in a second).</p>\n<p>Now, it’s important to note that with the Edge 540/840/1040 getting the new ClimbPro free-ride functionality, the map sizes have exploded. I mean, almost doubled in size. The real-world ramification of that is previously with a 16GB Edge device, you could fit both the US and some chunk of Europe on it. Now, it’s one or the other, hence why the 32GB of the Edge 840 is more useful if you frequently travel.</p>\n<p>Just for context, here’s a look at the European map set sizes now (previously this was about 7-8GB):</p>\n<ol>\n<li>The core cycle map pieces: Roughly 7GB</li>\n<li>The ClimbPro pieces: Roughly 6GB for Europe Central+West</li>\n</ol>\n<p>Plus atop that there’s a small map for Trailforks, of roughly another few hundred MB. I think it’s probably going to be time for Garmin to re-think how they do map downloads on the Edge series. First off, you still have to connect it to your computer. Whereas Wahoo &amp; Hammerhead allow WiFi downloads of maps (Garmin allows WiFi downloads on their wearables for maps). Second, and most notable, Garmin only allows massive region downloads (e.g. all of North America), rather than per-country downloads.</p>\n<p>I think having massive regions is great if you have the storage space, but practically speaking, it’s also a huge strain to download a map update that’s now 14GB in size. Or to download that last minute when travelling. Whereas the other companies allow you to pick a given country in most cases, or states in others. I get Garmin’s desire to sell-up a higher unit here with more storage, but with the new much larger map sizes, this starts to migrate from ‘annoying’ to ‘pain in the ass’, depending on how often you travel.</p>\n<p>Map data aside, one minor but notable difference on the Edge 840/1040 compared to the Edge 540, is that it allows you to search for a specific street address. Garmin (probably rightly) assumes that it’s too much of a pain to type out a full address with buttons, so this feature isn’t offered on the Edge 540.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6217.jpg\"><img title=\"DSC_6217\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6217_thumb.jpg\" alt=\"DSC_6217\" width=\"720\" height=\"480\" /></a></p>\n<p>That said, frankly, outside of demonstrating how the feature works, I’ve simply never had a reason to type in an exact address on a bike computer. Like…ever. It’s just too cumbersome. However, one nifty feature here is that you can use your phone to type in things now. So if Garmin Connect is on your phone, it’ll prompt you to enter the text using your phone keyboard instead if you want, which is usually much faster for people. However, this seems kinda random as to when it appears. Sometimes it works, sometimes not.</p>\n<p>As with the Edge 1040, Garmin revamped the POI database, making it easier to find bike-specific things now. So you’ll see stuff like bike shops, water stops, restrooms, coffee shops, and more. You can still search for all the other stuff like restaurants, hotels, transpiration, etc…. but Garmin has prioritized things you actually want to find on a ride.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6218.jpg\"><img title=\"DSC_6218\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6218_thumb.jpg\" alt=\"DSC_6218\" width=\"720\" height=\"480\" /></a></p>\n<p>You can also use this menu region to simply browse a map. For example, you decide to abandon your ride into the mountains and instead just want to go sit on a beach and eat ice cream. Sure, you could use the café/restaurant option to find an ice cream shop, but it’s just gonna be easier to look at the map and tap the beach and then choose to get directions to it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6220.jpg\"><img title=\"DSC_6220\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6220_thumb.jpg\" alt=\"DSC_6220\" width=\"720\" height=\"480\" /></a></p>\n<p>In most cases though, you’re probably going to follow a course or pre-planned route. You can create courses umpteen number of ways, from on Garmin Connect itself (even on the unit itself), to 3rd party sites like Strava or Komoot, or by loading GPX/TCX/FIT files you downloaded somewhere. You can even re-ride past activities. The world is your oyster here, but that oyster eventually puts you on this menu where you choose a course:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6221.jpg\"><img title=\"DSC_6221\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6221_thumb.jpg\" alt=\"DSC_6221\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6222.jpg\"><img title=\"DSC_6222\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6222_thumb.jpg\" alt=\"DSC_6222\" width=\"355\" height=\"237\" /></a></p>\n<p>Most of these are either Strava or Komoot courses, which automatically sync to Garmin Connect and then to the Edge 540/840 the second I hit save. It’s super efficient.</p>\n<p>Once selected, you’ll see stats about the course, including an overview of the elevation and any climbs via ClimbPro:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6223.jpg\"><img title=\"DSC_6223\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6223_thumb.jpg\" alt=\"DSC_6223\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6224.jpg\"><img title=\"DSC_6224\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6224_thumb.jpg\" alt=\"DSC_6224\" width=\"355\" height=\"237\" /></a></p>\n<p>At this point, you can tap to ride the course, which starts your navigating (once you press start on the activity). You’ll get notified as you approach a turn, no matter which data page you’re on:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h12m14s599.png\"><img title=\"vlcsnap-2023-04-11-13h12m14s599\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h12m14s599_thumb.png\" alt=\"vlcsnap-2023-04-11-13h12m14s599\" width=\"720\" height=\"405\" /></a></p>\n<p>Certainly, you can just stay on the map screen if you want to, but that limits your data field options, and also burns more battery. Instead, a mini-map will overlap over the top of the data page you’re on, with the turn information about 150m before the turn.</p>\n<p>In the event you go off-course, you’ll get a banner offering you two basic options: Pause navigation, or Re-Route. If you ignore it, it’ll automatically re-route for you, rejoining the route where it makes sense. In cases where no obvious re-join exists, it’ll have you backtrack accordingly. You can actually change this behavior if you want. There’s a myriad of settings you never knew existed deep in the Activity Profiles &gt; Profile &gt; Navigation &gt; Routing &gt; Route Recalculation and Course Recalculation options.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h13m08s294.png\"><img title=\"vlcsnap-2023-04-11-13h13m08s294\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h13m08s294_thumb.png\" alt=\"vlcsnap-2023-04-11-13h13m08s294\" width=\"720\" height=\"405\" /></a></p>\n<p>I haven’t had any problems with any of this. As with the Edge 1040, this new layout just works a lot better, especially the pause navigation option. The idea being that if you’re just going a few hundred meters to that ice cream shack by the beach, you don’t need your bike GPS incessantly beeping at you that you’ve screwed up. Then, once you get back on course you can resume navigation. Easy-peasy.</p>\n<p>You can literally see a great example of this here, of me actually taking a photo mid-ride slightly off-course, and it pausing by itself to see what I want to do:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h13m27s771.png\"><img title=\"vlcsnap-2023-04-11-13h13m27s771\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h13m27s771_thumb.png\" alt=\"vlcsnap-2023-04-11-13h13m27s771\" width=\"720\" height=\"405\" /></a></p>\n<p>In terms of the actual routing/re-routing, again, no issues with me going off-course in three different countries now, it all gracefully did what I expected. Even here in Amsterdam in one of the most bike-lane/road-dense locations on planet earth, it handles all of this without issue (something that can still challenge other companies, or some of Garmin’s older devices).</p>\n<p>Same goes for initial route ‘Calculation’, or any immediate re-routing. That now happens pretty much instantly (like the Edge 1040), but that’s also a little bit of changing what’s displayed to you. On older Garmin devices, it’d actually calculate the entire route in front of you. You never had to wait for it, but people assumed you did. It calculates it in order of the route itself, so in reality you could never pedal faster than it could figure out the route – even if it took a few minutes to sort out a 100KM route. Now, most of that re-calculation happens behind the scenes (like their competitors do). There’s no reason to show you something that’s not going to come up until hours later in the ride.</p>\n<p>Now, one area I’d like to see improved is just how courses are organized. I think across all companies, including Garmin, this is just getting messier and messier. With more and more services automatically pushing routes to your device, it becomes cluttered with routes (and copies of routes due to creating duplicates for things like PowerGuide or making a Strava route Public on Garmin Connect). I’d really like to see some attempt at a folder structure here, either automatic or one that I could manually create and is synced with Garmin Connect. I’m not saying I have a clear solution here, but I think it’s fair to say that simply sorting an ever-growing and duplicate course listing isn’t really cutting it anymore.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6226.jpg\"><img title=\"DSC_6226\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6226_thumb.jpg\" alt=\"DSC_6226\" width=\"720\" height=\"480\" /></a></p>\n<p>For example, I’d love to have it automatically folderize routes that start within 5KM of where I am now, and then by distance. Sure, you can sort by nearness to you, or by distance, but not both. Thus, I’ve got routes from Australia or South Africa showing up in the mix when I don’t care about those now.</p>\n<p>But that’s a relatively minor nit in the grand scheme of things. Overall, Garmin is well known for their navigation, and the Edge 540/840 continues the trend the Edge 1040 set, making it the leader in terms of on-bike navigation options. While the Hammerhead Karoo 2 has a prettier display for said maps, Garmin’s feature set is far wider in terms of navigation features. As always, whether or not you use those features is a different question.</p>\n<h3><span>Structured Training &amp; Power Guide:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge840-Training.jpg\"><img title=\"GarminEdge840-Training\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge840-Training_thumb.jpg\" alt=\"GarminEdge840-Training\" width=\"720\" height=\"480\" /></a></p>\n<p>Many of the new features to the Edge 540 &amp; Edge 840 are within the realm of structured training, or at a minimum Training Load &amp; Recovery. Some of these are center-stage, like Acute Load, and some of them are more tangential, like the ability to see a profile of you as a rider. Either way, I’m bundling them all into this section. Additionally, all of these things have previously launched on the Edge 1040, save the new Training Plan bits.</p>\n<p>Beyond these, there are aspects like the new Power Guide (also launched on the Edge 1040), as well as the long-existing structured workouts option, including the ability to ride workouts from 3rd party entities like TrainingPeaks, TrainerRoad, and countless more.</p>\n<p>First up are the newer stats pieces, which are all under the section called ‘My Stats’ on the unit. Alternatively, you can add them as widgets, like I have, for quick glancing. If you have a Garmin, these will (or should anyways), be in sync.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6232.jpg\"><img title=\"DSC_6232\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6232_thumb.jpg\" alt=\"DSC_6232\" width=\"720\" height=\"480\" /></a></p>\n<p>Next up is Training Status, which is comprised of both VO2Max and Acute Load. Of course, my VO2max has been solidly broken on the Garmin platform since last November, and hasn’t changed since then despite both a massive increase in volume since early January, and a substantial increase in FTP. Next is the Acute Load. This load is looking at your last 7 days of training volume, and will show non-cycling workouts on the Garmin platform as well (including ones from Zwift/TrainerRoad/Tacx).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6234.jpg\"><img title=\"DSC_6234\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6234_thumb.jpg\" alt=\"DSC_6234\" width=\"720\" height=\"480\" /></a></p>\n<p>The singular challenge with my VO2Max value being stuck/broken, is that since it’s not rising, it’s very challenging for me to get anything other than ‘Maintaining’ as my training status (such as ‘Productive’). On the flip side, I use Acute Load as arguably the single most important number I look at in terms of training load, as it allows me to roughly baseline my total volume. The green section is my normal training load, called the ‘Tunnel’.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6235.jpg\"><img title=\"DSC_6235\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6235_thumb.jpg\" alt=\"DSC_6235\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6236.jpg\"><img title=\"DSC_6236\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6236_thumb.jpg\" alt=\"DSC_6236\" width=\"355\" height=\"237\" /></a></p>\n<p>Next there’s Exercise Load. This is basically a way of looking at the breakdown of your training load for the past 7 days, in terms of categorization:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6237.jpg\"><img title=\"DSC_6237\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6237_thumb.jpg\" alt=\"DSC_6237\" width=\"720\" height=\"480\" /></a></p>\n<p>Likewise you’ve got Load focus. This is simply looking at a 28-day variant of the previous 7-day Exercise Load chart.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6238.jpg\"><img title=\"DSC_6238\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6238_thumb.jpg\" alt=\"DSC_6238\" width=\"720\" height=\"480\" /></a></p>\n<p>After that, there’s Cycling Ability. This came with the Edge 1040, and gives you scores for each category. The idea here is that from there it can look at any course you load up (e.g., Alpe d’Huez) and tell you whether or not you’ll do well on that course. It’s effectively a way to match your skills to a given course.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6239.jpg\"><img title=\"DSC_6239\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6239_thumb.jpg\" alt=\"DSC_6239\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6240.jpg\"><img title=\"DSC_6240\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6240_thumb.jpg\" alt=\"DSC_6240\" width=\"355\" height=\"237\" /></a></p>\n<p>You can see this here for the Sa Calobra course:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6241.jpg\"><img title=\"DSC_6241\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6241_thumb.jpg\" alt=\"DSC_6241\" width=\"720\" height=\"480\" /></a></p>\n<p>And, if you’re lucky enough to have gone somewhere warm (or high in altitude), you’ll get either heat or altitude acclimation:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6242.jpg\"><img title=\"DSC_6242\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6242_thumb.jpg\" alt=\"DSC_6242\" width=\"720\" height=\"480\" /></a></p>\n<p>There’s also a few other metrics shown, including Recovery Time. This is pretty self-explanatory. The reason this value is this high is I just did a beast of an interval (run) workout this morning, accompanied by a big week in training, as well as another ride this afternoon.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6243.jpg\"><img title=\"DSC_6243\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6243_thumb.jpg\" alt=\"DSC_6243\" width=\"720\" height=\"480\" /></a></p>\n<p>Finally, there’s FTP. In my case, I had set a manual FTP initially, but then let it auto-detect from there:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6246.jpg\"><img title=\"DSC_6246\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6246_thumb.jpg\" alt=\"DSC_6246\" width=\"720\" height=\"480\" /></a></p>\n<p>You can also see metrics like Fitness Age, Intensity Minutes, Stress Score, and more – all buried in the menus that you might not ever see. But, let’s move along to Power Guide.</p>\n<p>Power Guide is basically going to define a specific power pacing plan, for a specific loaded course. It’s vaguely like <a href=\"https://www.bestbikesplit.com/\">Best Bike Split</a>, except not nearly as advanced (BBS takes into account things like aerodynamic properties, wind, etc…). The idea though being you can essentially predict a specific finish time on a specific course, based on your chosen intensity level. The easiest way to start this process is by first having a course loaded in Garmin Connect, and then going into the Power Guide option and selecting said course. From there you can adjust the intensity slider, which changes the estimated finish time, as well as all of the split components seen down below.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6248.jpg\"><img title=\"DSC_6248\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6248_thumb.jpg\" alt=\"DSC_6248\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6250.jpg\"><img title=\"DSC_6250\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6250_thumb.jpg\" alt=\"DSC_6250\" width=\"355\" height=\"237\" /></a></p>\n<p>Garmin divides up these sections based exclusively on gradient. Meaning, here in Amsterdam, when I use Power Guide, it’s basically useless because it’s one giant pancake and one giant segment. Versus using it in Belgium on that super hilly course, it’s constantly targeting different power values for both ups and downs, as well as the flats.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6252.jpg\"><img title=\"DSC_6252\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6252_thumb.jpg\" alt=\"DSC_6252\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6253.jpg\"><img title=\"DSC_6253\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6253_thumb.jpg\" alt=\"DSC_6253\" width=\"355\" height=\"237\" /></a></p>\n<p>Once you’re on the bike, you’ll load up the course first, and then see the option for the Power Guide for that course. At which point you’ll see the targets for each section/split, as well as overall goal against targets. In my case I generally beat each split section, but my overall averages were impacted (lower) because of my desire to take photos of llamas, cobblestones, and pubs. Things I don’t usually do on a race itself.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h12m59s494.png\"><img title=\"vlcsnap-2023-04-11-13h12m59s494\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h12m59s494_thumb.png\" alt=\"vlcsnap-2023-04-11-13h12m59s494\" width=\"720\" height=\"405\" /></a></p>\n<p>It’s a cool concept, and is a good way for most people to pace using a power meter (which is required) without having to spend for a coach. Meaning, if you had a canned/semi-canned training plan, you might not actually have a good idea on the race side. This can fill that gap a bit by letting you adjust the slider pre-race to see estimated finish times. Additionally, if the race starts falling apart (or, you feel it’s waaaay too easy), you can adjust the slider/intensity mid-ride too.</p>\n<p>Now, if you want to use Garmin for your entire training plan, the Edge 540/840 now have the ability to create an entire training plan for your specific race. The Edge 1040 gained this ability last fall to a degree, but it’s been more fully implemented over the last few months atop changes in Unified Training Status, accounting for things like sleep and other training load factors.</p>\n<p>You’ll create your specific event on Garmin Connect, including uploading/specifying the exact course, date, and time. Using that information, it’ll create a specific training plan for that event.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6254.jpg\"><img title=\"DSC_6254\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6254_thumb.jpg\" alt=\"DSC_6254\" width=\"720\" height=\"480\" /></a></p>\n<p>The unit will create a periodized structure, including a base, build, peak, and taper phase.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6256.jpg\"><img title=\"DSC_6256\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6256_thumb.jpg\" alt=\"DSC_6256\" width=\"235\" height=\"157\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6257.jpg\"><img title=\"DSC_6257\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6257_thumb.jpg\" alt=\"DSC_6257\" width=\"235\" height=\"157\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6258.jpg\"><img title=\"DSC_6258\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6258_thumb.jpg\" alt=\"DSC_6258\" width=\"235\" height=\"157\" /></a></p>\n<p>Then each day it’ll give you a specific structured workout to do. If your sleep is too low, it’ll trigger a rest day or other easier workout instead. And you can adjust parameters like your long ride day as well.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6255.jpg\"><img title=\"DSC_6255\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6255_thumb.jpg\" alt=\"DSC_6255\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6260.jpg\"><img title=\"DSC_6260\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6260_thumb.jpg\" alt=\"DSC_6260\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6261.jpg\"><img title=\"DSC_6261\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6261_thumb.jpg\" alt=\"DSC_6261\" width=\"235\" height=\"157\" /></a></p>\n<p>Finally, you may alternatively be using structured training from either Garmin Connect or other 3rd party services/platforms (e.g., Today’s Plan, TrainerRoad, TrainingPeaks, etc…). All of those sync automatically to your Edge, and will show your planned workout on your Edge device.</p>\n<p>Once I head outside, it’ll show me the steps for that as I go along. Here’s one from last week or so, with a set of intervals, showing me my power targets and current status for each of those intervals.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0018.jpg\"><img title=\"clip_image001[8]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0018_thumb.jpg\" alt=\"clip_image001[8]\" width=\"720\" height=\"485\" /></a></p>\n<p>None of this has changed anytime in recent years, it’s all basically the same – and all works pretty well for both myself as well as plenty of others who have used this functionality over the years.</p>\n<h3><span>Solar Power:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6263.jpg\"><img title=\"DSC_6263\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6263_thumb.jpg\" alt=\"DSC_6263\" width=\"720\" height=\"480\" /></a></p>\n<p>Now there are two versions of the Edge 840 – one with solar panels (Edge 840 Solar), and one without (Edge 840). This section is entirely focused on the solar variant, given the title you see just above the pretty picture. The general theory with the Edge 840 Solar is that it’s going to accumulate solar time while you’re riding, as well as just hanging out in the sun not-riding.</p>\n<p>Starting with the solar panel itself, it’s divided into basically two portions. The first is the most obvious portion of the panel at the top/bottom of the screen (the reddish portions above). This is the visible portion, and has a photovoltaic level of 100%. In the most simplified explanation, 100% of the sun’s goodness that hits this portion of the panel gets converted to extra juice (there’s a lot of technical nuances to that, but again, simplicity here).</p>\n<p>However, over the entire display is another solar panel that has a 15% photovoltaic level (a notable increase over the Fenix 7 &amp; Forerunner 955 panels which are 7% photovoltaic levels). This main panel is obviously far larger than the upper/lower panels, but harvests less energy since it’s just 15% versus 100%. But, you can see through it, so it’s essentially invisible to you. That’s what Garmin calls ‘Solar Glass’, because it’s actually glass.</p>\n<p>As one of the data pages while riding, you’ve got a dedicated page for monitoring your solar progress, showing time gained in minutes:seconds, plus a little graph of your solar power:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m07s539.png\"><img title=\"vlcsnap-2023-04-11-13h11m07s539\" src=\"https://media.dcrainmaker.com/images/2023/04/vlcsnap-2023-04-11-13h11m07s539_thumb.png\" alt=\"vlcsnap-2023-04-11-13h11m07s539\" width=\"720\" height=\"405\" /></a></p>\n<p>After you’re riding you’ll see the same thing in some of the summary screens, showing your ride totals. Here’s one from a 3 hour sunny ride in Belgium (below), which matched almost exactly the gains from a different 4hr 21min ride in Mallorca (in the sun) where I also gained 26 minutes.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/P1088357.jpg\"><img title=\"P1088357\" src=\"https://media.dcrainmaker.com/images/2023/04/P1088357_thumb.jpg\" alt=\"P1088357\" width=\"720\" height=\"480\" /></a></p>\n<p>And then inversely, here’s a dark/overcast late afternoon day in Amsterdam, where after riding for 1hr 40 mins, I gained a whopping 2 mins and 54 seconds:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00110.jpg\"><img title=\"clip_image001[10]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00110_thumb.jpg\" alt=\"clip_image001[10]\" width=\"720\" height=\"483\" /></a></p>\n<p>This is also shown in Garmin Connect too, if you want to see total ride time gained during the day. One important thing to remember though, is that you’re still burning battery. Garmin’s solar battery claims are based on 75,000 lux conditions (a measure of brightness), which is another increase over their previous baseline claims of 50,000 lux conditions for their Fenix/Instinct/Forerunner units. This is actually a more useful change, because 50,000 lux conditions really aren’t that high. Even in the winter, on a sunny day in the Netherlands I can hit 70,000 lux. So it’s less about a hot day, and more just about direct sun.</p>\n<p>So what happens when not riding? Well, let’s dig into that. If you tap the upper left button, you can choose to go to sleep or power off. When you press the sleep button, it shows the current solar intensity and current battery life. Here’s me putting it (and the other Solar units) to sleep in the Netherland’s April sun for a few hours.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00112.jpg\"><img title=\"clip_image001[12]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00112_thumb.jpg\" alt=\"clip_image001[12]\" width=\"720\" height=\"397\" /></a></p>\n<p>I came back 3 hours later, in this case about 2 hours of that was mostly unbroken clouds (1:56pm till 4:59pm). The remaining hour was high/thin clouds. In total, here’s what it showed:</p>\n<blockquote><p>Garmin Edge 540 Solar: 39% to 42%<br />\nGarmin Edge 840 Solar: 79% to 79%<br />\nGarmin Edge 1040 Solar: 97% to 97%</p></blockquote>\n<p>Then again two days later, from 1:15PM till 4:08PM in strong direct afternoon sun – apparently gaining almost nothing. I have no idea why one unit above/below gains one day, and the other not. And vice versa. I would say having the Edge 1040 in the upper 90’s may impact charging, since most devices tend to slow-down charging rates above 90%, but I have no idea here.</p>\n<blockquote><p>Garmin Edge 540 Solar: 75% to 75%<br />\nGarmin Edge 840 Solar: 74% to 75%<br />\nGarmin Edge 1040 Solar: 89% to 89%</p></blockquote>\n<p>For the times where I’d I’d gain a couple percent, that does basically translate to about 1-2%/hour riding time. Meaning, if you leave it there an entire day, you could easily get a few hours of actual riding time.</p>\n<p>Note that on the Edge 1040 Solar, there is/was a threshold where really hot days (like summer days), if you left it in the sun when not riding (e.g., on a table) it’d overheat and not solar charge anymore (to be excruciating clear: This only impacts solar charging when it overheats, not operation of the unit, further, this virtually never happens while riding due to the cooling effect of your bike speed). Unfortunately, being April right now, I haven’t had any of those hot days to test the 540 Solar or 840 Solar for the same thing.</p>\n<p>The point being that in theory you could leave your Edge unit by the window in sleep mode and gain battery time the other 8-10 hours of the day it’s sunny out, and theoretically never have to charge your unit. In practice though, I’ve found that a bit tricky. Also, in reality, you could just plug it in for like 5 minutes and get the same as a day of solar. But hey, if you’re doing some crazy bike-across-Africa challenge, then sometimes every little bit matters.</p>\n<h3><span>Accuracy:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge540-840MultiBand.jpg\"><img title=\"Garmin-Edge540-840MultiBand\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge540-840MultiBand_thumb.jpg\" alt=\"Garmin-Edge540-840MultiBand\" width=\"720\" height=\"480\" /></a></p>\n<p>Now, I’m gonna save you a bunch of time – GPS accuracy is basically perfect here. There’s literally nothing of concern in all the riding I’ve done, including in the mountains, through rock canyons, cities, and more. This mirrors what we’ve seen on the Edge 1040 since it launched last summer with multiband GNSS. Like that unit, both the Edge 540 &amp; Edge 840 mirror it in performance, and also slightly best the competition – both the Hammerhead Karoo 2 (no multiband), and the Wahoo ROAM 2 (multiband). It’s usually very very minor differences, but you can see it here and there with just slight cutting of corners by Wahoo/Hammerhead on occasion.</p>\n<p>Getting right into things, here’s my <a href=\"https://analyze.dcrainmaker.com/#/public/90216c58-0b59-4a2b-7908-fcc0e656eb4e\">ride in Mallorca over Sa Calobra</a>. This includes essentially a day of twisty/turny roads etched into the mountainsides. On the whole it’s a challenging, though not horrific, GPS environment. There are some horrifically challenging spots within it though.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS1.png\"><img title=\"SaCalobraGPS1\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS1_thumb.png\" alt=\"SaCalobraGPS1\" width=\"722\" height=\"256\" /></a></p>\n<p>As we look at some of the initial sections getting to Sa Calobra, you can see it’s exactly on the roadway, with only a tiny bit of offset activity by the Wahoo ROAM V2 here and there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS2.png\"><img title=\"SaCalobraGPS2\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS2_thumb.png\" alt=\"SaCalobraGPS2\" width=\"722\" height=\"358\" /></a></p>\n<p>Even on this fast section of mountain switchbacks, virtually all the units remain on the roadway.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS3.png\"><img title=\"SaCalobraGPS3\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS3_thumb.png\" alt=\"SaCalobraGPS3\" width=\"722\" height=\"314\" /></a></p>\n<p>Here’s an aerial photo of this next section, to set the stage:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00116.jpg\"><img title=\"clip_image001[16]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00116_thumb.jpg\" alt=\"clip_image001[16]\" width=\"720\" height=\"510\" /></a></p>\n<p>And then here’s the GPS tracks from that section, which are basically immaculate, including the loop.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS4.png\"><img title=\"SaCalobraGPS4\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS4_thumb.png\" alt=\"SaCalobraGPS4\" width=\"722\" height=\"252\" /></a></p>\n<p>And then later on, we’ve got this famed section where you slide between two rocks that are seemingly collapsing towards each other:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00114.jpg\"><img title=\"clip_image001[14]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00114_thumb.jpg\" alt=\"clip_image001[14]\" width=\"720\" height=\"644\" /></a></p>\n<p>As you can see, the GPS is only different between the units by just a couple meters (note the scale):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS5.png\"><img title=\"SaCalobraGPS5\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraGPS5_thumb.png\" alt=\"SaCalobraGPS5\" width=\"722\" height=\"324\" /></a></p>\n<p>Next, we’ve <a href=\"https://analyze.dcrainmaker.com/#/public/4f6ec452-1f74-4a4e-4abe-2af090ea21e7\">got a ride in Belgium</a> as I bounced around the cobbled classics for a number of hours, this is relatively easy GPS conditions in the grand scheme of life, though, sometimes easy can still be challenging. However, I was actually more interested in the elevation accuracy here. More on that in a second. First, the GPS side of the house:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS1.png\"><img title=\"Cobbles-GPS1\" src=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS1_thumb.png\" alt=\"Cobbles-GPS1\" width=\"722\" height=\"347\" /></a></p>\n<p>If we look at famed cobbled climbs like the Koppenburg, it’s identical across all units:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS2Koppenburg.png\"><img title=\"Cobbles-GPS2Koppenburg\" src=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS2Koppenburg_thumb.png\" alt=\"Cobbles-GPS2Koppenburg\" width=\"722\" height=\"269\" /></a></p>\n<p>So then we try something more tricky, going under a railroad, to see if there’s any crazy wonk in the tunnel. Nope, essentially a wash (maybe a smidge bit of an extra meter or two on some tracks, but nothing to get upset about):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS3.png\"><img title=\"Cobbles-GPS3\" src=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS3_thumb.png\" alt=\"Cobbles-GPS3\" width=\"722\" height=\"348\" /></a></p>\n<p>Even going around this roundabout in town, it correctly nailed the track – under a railroad mind you, where I took the inside curve:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS4.png\"><img title=\"Cobbles-GPS4\" src=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-GPS4_thumb.png\" alt=\"Cobbles-GPS4\" width=\"722\" height=\"430\" /></a></p>\n<p>As for elevation? All within +/- 3 meters of each other the entire time. The Karoo 2 oddly lost the plot about an hour in, for no clear reason. It was totally part of the gang, and then it became an offset outcast for the remainder of the time. I don’t remember seeing that elsewhere, so…ok. I guess I did something to offend it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-Elevation.png\"><img title=\"Cobbles-Elevation\" src=\"https://media.dcrainmaker.com/images/2023/04/Cobbles-Elevation_thumb.png\" alt=\"Cobbles-Elevation\" width=\"722\" height=\"158\" /></a></p>\n<p>Next, we’ll wrap up with another boring iteration in the GPS plots. This time here in Amsterdam:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS1.png\"><img title=\"AmsterdamGPS1\" src=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS1_thumb.png\" alt=\"AmsterdamGPS1\" width=\"722\" height=\"400\" /></a></p>\n<p>Starting off in a section with some tall buildings on both sides. No issues from the Garmin, though a slight blip from the Karoo 2:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS2.png\"><img title=\"AmsterdamGPS2\" src=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS2_thumb.png\" alt=\"AmsterdamGPS2\" width=\"722\" height=\"336\" /></a></p>\n<p>But looking at various twists and turns, including in some towns showed no problems:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS3.png\"><img title=\"AmsterdamGPS3\" src=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS3_thumb.png\" alt=\"AmsterdamGPS3\" width=\"722\" height=\"281\" /></a></p>\n<p>Or again out in the middle of nowhere:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS4.png\"><img title=\"AmsterdamGPS4\" src=\"https://media.dcrainmaker.com/images/2023/04/AmsterdamGPS4_thumb.png\" alt=\"AmsterdamGPS4\" width=\"722\" height=\"278\" /></a></p>\n<p>Look, I could keep creating charts – and maybe I will when I’m sufficiently bored with nothing else to do. But all the charts and all the data plots I’ve looked at are virtually identical/perfect. We might finally be arriving at the point where for cycling GPS units, it’s going to be harder and harder to find GPS faults. Don’t worry though, running GPS still seems to be more challenging.</p>\n<p><em>(Note: All of the charts in these accuracy sections were created using the DCR Analyzer tool.  It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well, </em><a href=\"http://www.dcrainmaker.com/analyzer\"><em>more details here</em></a><em>.)</em></p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Solar.jpg\"><img title=\"Garmin-Edge840-Solar\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Solar_thumb.jpg\" alt=\"Garmin-Edge840-Solar\" width=\"720\" height=\"480\" /></a></p>\n<p>The Edge 840 delivers on what people want: An Edge 1040 in a smaller package. It’s got an identical feature-set to the larger-screened Edge 1040, and in fact, is arguably a more usable device, since it has the full complement of buttons the Edge 1040 lacks. The only differences between the two units are size/battery/screen. That’s it.</p>\n<p>However, more critically, the Garmin Edge series finally delivers what many have been asking for: ClimbPro without a route/course loaded. On the whole, it’s very good. It correctly illustrates the climb as I approach it, and the calculates the pain and suffering till the top. Is it perfect? No, it doesn’t read your mind, yet. It generally gets it right, but every once in a while it just doesn’t guess right. I suspect we’ll see them continue to tweak some of these mind-reading gaps, based on user feedback.</p>\n<p>The remainder of the features all are aimed at filling in the Garmin ecosystem. Things like Stamina to match the wearable side, and Training Status 2.0 to go along with that. Having Power Guide for pacing is legit useful. I could quite conceivably see using it for some races later this spring. And the rest of the core Garmin features you’ve had for years works as before, just a touch bit prettier now (and faster). Inversely, Garmin does need to sort out their map download situation. They’ve built a bit of a behemoth here with all the new map data in the unit, and for those that travel frequently (or even update the maps frequently), the annoyance will grow. I don’t think this is a ‘today’ problem, but a ‘by next year’ type of problem.</p>\n<p>Up till now, I’ve long recommended people buy the cheaper of the two mainstream Edge units, meaning buy the Edge 510/520/530 series instead of the Edge 810/820/830 series. This was largely because the Edge 8xx series lacked the majority of the buttons when you wanted them, and also lacked a compelling use-case for a touch screen. But with the Edge 840, my recommendation is finally changing: Buy the Edge 840 over the Edge 540.</p>\n<p>Now, this isn’t because the Edge 840 is magically more awesome than the Edge 540. But rather, because I’ve just found the button interaction on the Edge 540 oddly cumbersome with the new user interface. Specifically, when doing anything that requires diving back to the main/settings/features homepage menu mid-ride. On the Edge 840 it’s a split-second swipe-down or tap. On the Edge 540, it’s an entire set of dance steps of long-button presses, a bunch of ups/downs, changing button sides, and more. All while not trying to crash.</p>\n<p>As for solar? Honestly, I wouldn’t spend the extra for it unless you ride in sunny weather all the time and need every last bit of juice. In most cases, you’d be able to charge the Edge 840 with the same amount of solar power from a 4-hour ride, in a mere 1-2 minutes via USB-C. I wouldn’t call it a gimmick, but rather, it’s just something only useful for a very small sliver of the population – at best. The good news is, that saves you money to spend on ice cream or something. And ultimately, at this point, the Edge 840 is clearly the cycling computer to try and beat. Well…minus the larger Edge 1040, of course.</p>\n<p>With that – thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Garmin Edge 840 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><img width=\"720\" height=\"722\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-720x722.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-720x722.png 720w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-200x201.png 200w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-1532x1536.png 1532w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent.png 1995w\" /><div><h4><a href=\"https://www.dcrainmaker.com/2023/04/garmin-edge840-solar-cycling-gps-in-depth-review.html\" target=\"_blank\">Garmin Edge 840</a></h4><div><a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226191%2Fgarmin-edge-840-bike-computer\"><span>REI</span> <span>$450</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-840-bike-computer-black-one-size\"><span>Wiggle</span> <span></span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n<p>Here's a few other variants or sibling products that are worth considering:</p>\r\n<div>\n<div><div><h4>Garmin Edge 840 Solar</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P8FCXH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=0e43fd648e451e7b866182a55ea1dc9f&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-200x200.png 200w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-720x720.png 720w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-1536x1536.png 1536w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1.png 2000w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P8FCXH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=0e43fd648e451e7b866182a55ea1dc9f&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$555</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-840-solar-bike-computer-black-one-size\"><span>Wiggle</span> <span></span></a> </div></div><div><div><h4>Garmin Edge 540 Solar</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P2VLKH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f34cfcca3dbc922be7ab1d4c8875be47&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-200x201.png 200w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-720x722.png 720w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-1532x1536.png 1532w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent.png 1995w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P2VLKH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f34cfcca3dbc922be7ab1d4c8875be47&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span></span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226090%2Fgarmin-edge-540-solar-bike-computer\"><span>REI</span> <span>$450</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-540-solar-bike-computer\"><span>Wiggle</span> <span></span></a> </div></div><div><div><h4>Garmin Edge 540</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P37C36?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=b381752081495062db3d473c3440cfc7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-200x198.png 200w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-720x712.png 720w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-1536x1519.png 1536w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent.png 2000w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P37C36?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=b381752081495062db3d473c3440cfc7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$355</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226088%2Fgarmin-edge-540-bike-computer\"><span>REI</span> <span>$350</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-540-bike-computer-black-one-size\"><span>Wiggle</span> <span></span></a> </div></div></div>\n\r\n\r\n\r\n\r\n\r\n<p>And finally, here’s a handy list of accessories that work well with this unit (and some that I showed in the review). Given the unit pairs with ANT+ &amp; Bluetooth Smart sensors, you can use just about anything though.</p>\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Cadence Sensor Gen2 (Dual ANT+/Bluetooth)</a></h4><div><a href=\"https://www.amazon.com/gp/product/B07PJKYXW5/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=338f156d24abadfe46a9063e86e1c32e&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"106\" src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png 125w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-200x170.png 200w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent.png 582w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/gp/product/B07PJKYXW5/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=338f156d24abadfe46a9063e86e1c32e&amp;language=en_US\"><span>Amazon</span> <span>$35</span></a> </div><p>This magnetless Garmin Cadence Sensor attached to your crank arm and transmits cadence over both ANT+ &amp; Bluetooth Smart to apps, watches, or bike computers.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Magnetless Sensors Cadence/Speed Gen2 Bundle (Dual ANT+/Bluetooth)</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cadence-Sensors-Monitor-Pedaling/dp/B07PG9MJ79/ref=as_li_ss_tl?_encoding=UTF8&amp;pd_rd_i=B07PG9MJ79&amp;pd_rd_r=d86486a3-9764-415c-a5f3-90e2352d51a7&amp;pd_rd_w=xum4n&amp;pd_rd_wg=Ssflf&amp;pf_rd_p=0e5324e1-c848-4872-bbd5-5be6baedf80e&amp;pf_rd_r=QCT1JM8APN14TPSJNJ6F&amp;psc=1&amp;refRID=QCT1JM8APN14TPSJNJ6F&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2adcf157ca4245c20c568541d32b66a7&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cadence-Sensors-Monitor-Pedaling/dp/B07PG9MJ79/ref=as_li_ss_tl?_encoding=UTF8&amp;pd_rd_i=B07PG9MJ79&amp;pd_rd_r=d86486a3-9764-415c-a5f3-90e2352d51a7&amp;pd_rd_w=xum4n&amp;pd_rd_wg=Ssflf&amp;pf_rd_p=0e5324e1-c848-4872-bbd5-5be6baedf80e&amp;pf_rd_r=QCT1JM8APN14TPSJNJ6F&amp;psc=1&amp;refRID=QCT1JM8APN14TPSJNJ6F&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2adcf157ca4245c20c568541d32b66a7&amp;language=en_US\"><span>Amazon</span> <span>$65</span></a> </div><p>This is a set of Garmin magnetless speed and cadence sensors. Both transmits over ANT+ &amp; Bluetooth Smart, but the speed sensor also can record rides without a bike computer - perfect for using on a commuter bike.</p>\n</div><div><div><h4>Garmin RTL515 Varia Radar</h4><div><a href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVFX1D/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+Varia+RTL515&amp;qid=1589368752&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5e2e91af1937a3219a2b1c090016b995&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVFX1D/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+Varia+RTL515&amp;qid=1589368752&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5e2e91af1937a3219a2b1c090016b995&amp;language=en_US\"><span>Amazon</span> <span>$150</span></a> </div><p>The Garmin Varia radar alerts you to cars coming up behind you, well before you see them. It's awesome for quieter roads (country roads/mountains), especially on longer rides. It's less useful for city riding.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2020/05/garmin-rtl515-rvr315-cycling-radar-review.html\" target=\"_blank\">Garmin RVR315 Varia Radar</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVP72L/ref=as_li_ss_tl?dchild=1&amp;keywords=RVR315&amp;qid=1591352457&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=bcf86e3409611a03eba6a9aec244f6f5&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVP72L/ref=as_li_ss_tl?dchild=1&amp;keywords=RVR315&amp;qid=1591352457&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=bcf86e3409611a03eba6a9aec244f6f5&amp;language=en_US\"><span>Amazon</span> <span>$130</span></a> </div><p>The Garmin Varia radar alerts you to cars coming up behind you, well before you see them. It's awesome for quieter roads (country roads/mountains), especially on longer rides. It's less useful for city riding. The RVR315 skips the light.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2014/06/garmin-1000-depth-review.html#edge-remote-control\" target=\"_blank\">Garmin Edge Remote</a></h4><div><a href=\"http://www.amazon.com/gp/product/B00JLMRREK/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00JLMRREK&amp;linkCode=as2&amp;tag=dcr07-20&amp;linkId=HTUO67WEOPD4AZVC\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"http://www.amazon.com/gp/product/B00JLMRREK/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00JLMRREK&amp;linkCode=as2&amp;tag=dcr07-20&amp;linkId=HTUO67WEOPD4AZVC\"><span>Amazon</span> <span></span></a> </div><p>The Edge remote allows you to control functions (like data pages/screens, and laps) wirelessly right from your handlebars/drops. Super handy for mountain biking where taking your hands off the bars might be a bad idea.</p>\n</div><div><div><h4>Garmin Edge Snap-on Battery</h4><div><a href=\"https://www.amazon.com/exec/obidos/ASIN/B077C45BGN/dcr07-20/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=58b953f47c8a12d87e335f9faa8b787a&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"114\" src=\"https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-125x114.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-125x114.png 125w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-200x182.png 200w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-720x654.png 720w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery.png 1500w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/exec/obidos/ASIN/B077C45BGN/dcr07-20/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=58b953f47c8a12d87e335f9faa8b787a&amp;language=en_US\"><span>Amazon</span> <span>$129</span></a> </div><p>If you need to go *REALLY* long with a Garmin Edge device, this snap-on/under weatherproof battery pack basically gets you double your battery life. It snaps under your existing Edge with an included mount. It can also be used as a standard USB battery back too (for your phone/etc...).</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2016/02/garmin-scale-review.html\" target=\"_blank\">Garmin Index S2 WiFi Scale</a></h4><div><a href=\"https://www.amazon.com/Garmin-Wireless-Connectivity-Measure-Muscle/dp/B08KC5V33R/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+S2+index&amp;sr=8-2&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3a37b8a02fec21f6211e7b5e11f8c3a4&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-200x200.png 200w, https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent.png 430w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Wireless-Connectivity-Measure-Muscle/dp/B08KC5V33R/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+S2+index&amp;sr=8-2&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3a37b8a02fec21f6211e7b5e11f8c3a4&amp;language=en_US\"><span>Amazon</span> <span>$150</span></a> </div><p>This wifi-connected scale will track your weight and related metrics both on the scale display and in Garmin Connect (plus 3rd party apps like Training Peaks). It'll also then sync your weight to your watch/bike computer, to ensure accurate calorie data.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-DUAL</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG/ref=as_li_ss_tl?ie=UTF8&amp;qid=1549369419&amp;sr=8-2&amp;keywords=HRm-DUAL&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7e7be6310f746798e39bd02156f77f8f&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"52\" src=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png 125w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-200x84.png 200w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205.png 510w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG/ref=as_li_ss_tl?ie=UTF8&amp;qid=1549369419&amp;sr=8-2&amp;keywords=HRm-DUAL&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7e7be6310f746798e39bd02156f77f8f&amp;language=en_US\"><span>Amazon</span> <span>$45</span></a> </div><p>The HRM-DUAL strap transmits not only concurrently on ANT+ &amp; Bluetooth Smart, but actually has two Bluetooth channels, making it perfect for pairing to Zwift at the same time you also have it paired to another device/app via Bluetooth.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2022/07/garmin-hrm-pro-plus-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-PRO Plus</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Pro-Captures-Dynamics-Transmits/dp/B0B3PNFK9H?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3e7b937f2d96da50e05debf31890136e&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-200x199.png 200w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-720x715.png 720w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent.png 1500w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Pro-Captures-Dynamics-Transmits/dp/B0B3PNFK9H?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3e7b937f2d96da50e05debf31890136e&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$90</span></a> </div><p>The HRM-PRO Plus is Garmin's top-end chest strap. It transmits dual ANT+/Bluetooth Smart, but also transmits Running Dynamics &amp; Running Pace/Distance metrics, stores HR data during a swim, and can be used without a watch for other sports. Also, it can transmit XC Skiing Dynamics as well.</p>\n</div></div>\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Garmin Edge 840 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><img width=\"720\" height=\"722\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-720x722.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-720x722.png 720w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-200x201.png 200w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-1532x1536.png 1532w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840-Transparent.png 1995w\" /><div><h4><a href=\"https://www.dcrainmaker.com/2023/04/garmin-edge840-solar-cycling-gps-in-depth-review.html\" target=\"_blank\">Garmin Edge 840</a></h4><div><a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226191%2Fgarmin-edge-840-bike-computer\"><span></span><span>REI</span><span>Buy Now</span> <span>$450</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-840-bike-computer-black-one-size\"><span></span><span>Wiggle</span><span>Buy Now</span> <span></span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n<p>Here's a few other variants or sibling products that are worth considering:</p>\r\n<div>\n<div><div><h4>Garmin Edge 840 Solar</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P8FCXH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=0e43fd648e451e7b866182a55ea1dc9f&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-200x200.png 200w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-720x720.png 720w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1-1536x1536.png 1536w, https://media.dcrainmaker.com/images/2023/04/Garmin-Edge840Solar-Transparent-1.png 2000w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P8FCXH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=0e43fd648e451e7b866182a55ea1dc9f&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$555</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-840-solar-bike-computer-black-one-size\"><span></span><span>Wiggle</span><span>Buy Now</span> <span></span></a> </div></div><div><div><h4>Garmin Edge 540 Solar</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P2VLKH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f34cfcca3dbc922be7ab1d4c8875be47&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-200x201.png 200w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-720x722.png 720w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent-1532x1536.png 1532w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540SolarTransparent.png 1995w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P2VLKH?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=f34cfcca3dbc922be7ab1d4c8875be47&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span></span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226090%2Fgarmin-edge-540-solar-bike-computer\"><span></span><span>REI</span><span>Buy Now</span> <span>$450</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-540-solar-bike-computer\"><span></span><span>Wiggle</span><span>Buy Now</span> <span></span></a> </div></div><div><div><h4>Garmin Edge 540</h4><div><a href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P37C36?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=b381752081495062db3d473c3440cfc7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-125x125.png 125w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-200x198.png 200w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-720x712.png 720w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent-1536x1519.png 1536w, https://media.dcrainmaker.com/images/2023/04/GarminEdge540BaseTransparent.png 2000w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Computer-HRM-Dual-Touchscreen-Navigation-Wearable4U/dp/B0C1P37C36?crid=TYKQUEAXAUYP&amp;keywords=Garmin%2BEdge%2B840&amp;qid=1681302461&amp;sprefix=garmin%2Bedge%2B8%2Caps%2C697&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE5SEJaTDZZWjBLNDkmZW5jcnlwdGVkSWQ9QTA1ODAzMTFZQVNVUVVFUjlSNVcmZW5jcnlwdGVkQWRJZD1BMDUyODEyNzFZTFFIODEyOUc3V0omd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=b381752081495062db3d473c3440cfc7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$355</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F226088%2Fgarmin-edge-540-bike-computer\"><span></span><span>REI</span><span>Buy Now</span> <span>$350</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fgarmin-edge-540-bike-computer-black-one-size\"><span></span><span>Wiggle</span><span>Buy Now</span> <span></span></a> </div></div></div>\n\r\n\r\n\r\n\r\n\r\n<p>And finally, here’s a handy list of accessories that work well with this unit (and some that I showed in the review). Given the unit pairs with ANT+ &amp; Bluetooth Smart sensors, you can use just about anything though.</p>\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Cadence Sensor Gen2 (Dual ANT+/Bluetooth)</a></h4><div><a href=\"https://www.amazon.com/gp/product/B07PJKYXW5/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=338f156d24abadfe46a9063e86e1c32e&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"106\" src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png 125w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-200x170.png 200w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent.png 582w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/gp/product/B07PJKYXW5/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=338f156d24abadfe46a9063e86e1c32e&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$35</span></a> </div><p>This magnetless Garmin Cadence Sensor attached to your crank arm and transmits cadence over both ANT+ &amp; Bluetooth Smart to apps, watches, or bike computers.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Magnetless Sensors Cadence/Speed Gen2 Bundle (Dual ANT+/Bluetooth)</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cadence-Sensors-Monitor-Pedaling/dp/B07PG9MJ79/ref=as_li_ss_tl?_encoding=UTF8&amp;pd_rd_i=B07PG9MJ79&amp;pd_rd_r=d86486a3-9764-415c-a5f3-90e2352d51a7&amp;pd_rd_w=xum4n&amp;pd_rd_wg=Ssflf&amp;pf_rd_p=0e5324e1-c848-4872-bbd5-5be6baedf80e&amp;pf_rd_r=QCT1JM8APN14TPSJNJ6F&amp;psc=1&amp;refRID=QCT1JM8APN14TPSJNJ6F&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2adcf157ca4245c20c568541d32b66a7&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2019/04/Garmin-Speed-Cadence-Sensor-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cadence-Sensors-Monitor-Pedaling/dp/B07PG9MJ79/ref=as_li_ss_tl?_encoding=UTF8&amp;pd_rd_i=B07PG9MJ79&amp;pd_rd_r=d86486a3-9764-415c-a5f3-90e2352d51a7&amp;pd_rd_w=xum4n&amp;pd_rd_wg=Ssflf&amp;pf_rd_p=0e5324e1-c848-4872-bbd5-5be6baedf80e&amp;pf_rd_r=QCT1JM8APN14TPSJNJ6F&amp;psc=1&amp;refRID=QCT1JM8APN14TPSJNJ6F&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2adcf157ca4245c20c568541d32b66a7&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$65</span></a> </div><p>This is a set of Garmin magnetless speed and cadence sensors. Both transmits over ANT+ &amp; Bluetooth Smart, but the speed sensor also can record rides without a bike computer - perfect for using on a commuter bike.</p>\n</div><div><div><h4>Garmin RTL515 Varia Radar</h4><div><a href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVFX1D/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+Varia+RTL515&amp;qid=1589368752&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5e2e91af1937a3219a2b1c090016b995&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2018/04/Garmin-varia-RTL510-transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVFX1D/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+Varia+RTL515&amp;qid=1589368752&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5e2e91af1937a3219a2b1c090016b995&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$150</span></a> </div><p>The Garmin Varia radar alerts you to cars coming up behind you, well before you see them. It's awesome for quieter roads (country roads/mountains), especially on longer rides. It's less useful for city riding.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2020/05/garmin-rtl515-rvr315-cycling-radar-review.html\" target=\"_blank\">Garmin RVR315 Varia Radar</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVP72L/ref=as_li_ss_tl?dchild=1&amp;keywords=RVR315&amp;qid=1591352457&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=bcf86e3409611a03eba6a9aec244f6f5&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2020/06/Garmin-Varia-RVR315-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cycling-Rearview-Audible-Vehicles/dp/B086TVP72L/ref=as_li_ss_tl?dchild=1&amp;keywords=RVR315&amp;qid=1591352457&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=bcf86e3409611a03eba6a9aec244f6f5&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$130</span></a> </div><p>The Garmin Varia radar alerts you to cars coming up behind you, well before you see them. It's awesome for quieter roads (country roads/mountains), especially on longer rides. It's less useful for city riding. The RVR315 skips the light.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2014/06/garmin-1000-depth-review.html#edge-remote-control\" target=\"_blank\">Garmin Edge Remote</a></h4><div><a href=\"http://www.amazon.com/gp/product/B00JLMRREK/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00JLMRREK&amp;linkCode=as2&amp;tag=dcr07-20&amp;linkId=HTUO67WEOPD4AZVC\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-125x92.png\" alt srcset=\"https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2014/04/Garmin-Edge-Remote-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"http://www.amazon.com/gp/product/B00JLMRREK/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00JLMRREK&amp;linkCode=as2&amp;tag=dcr07-20&amp;linkId=HTUO67WEOPD4AZVC\"><span></span><span>Amazon</span><span>Buy Now</span> <span></span></a> </div><p>The Edge remote allows you to control functions (like data pages/screens, and laps) wirelessly right from your handlebars/drops. Super handy for mountain biking where taking your hands off the bars might be a bad idea.</p>\n</div><div><div><h4>Garmin Edge Snap-on Battery</h4><div><a href=\"https://www.amazon.com/exec/obidos/ASIN/B077C45BGN/dcr07-20/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=58b953f47c8a12d87e335f9faa8b787a&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"114\" src=\"https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-125x114.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-125x114.png 125w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-200x182.png 200w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery-720x654.png 720w, https://media.dcrainmaker.com/images/2019/05/Garmin-Edge-External-Battery.png 1500w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/exec/obidos/ASIN/B077C45BGN/dcr07-20/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=58b953f47c8a12d87e335f9faa8b787a&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$129</span></a> </div><p>If you need to go *REALLY* long with a Garmin Edge device, this snap-on/under weatherproof battery pack basically gets you double your battery life. It snaps under your existing Edge with an included mount. It can also be used as a standard USB battery back too (for your phone/etc...).</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2016/02/garmin-scale-review.html\" target=\"_blank\">Garmin Index S2 WiFi Scale</a></h4><div><a href=\"https://www.amazon.com/Garmin-Wireless-Connectivity-Measure-Muscle/dp/B08KC5V33R/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+S2+index&amp;sr=8-2&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3a37b8a02fec21f6211e7b5e11f8c3a4&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent-200x200.png 200w, https://media.dcrainmaker.com/images/2020/10/Garmin-Index-S2-Smart-Scale-transparent.png 430w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Wireless-Connectivity-Measure-Muscle/dp/B08KC5V33R/ref=as_li_ss_tl?dchild=1&amp;keywords=Garmin+S2+index&amp;sr=8-2&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3a37b8a02fec21f6211e7b5e11f8c3a4&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$150</span></a> </div><p>This wifi-connected scale will track your weight and related metrics both on the scale display and in Garmin Connect (plus 3rd party apps like Training Peaks). It'll also then sync your weight to your watch/bike computer, to ensure accurate calorie data.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-DUAL</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG/ref=as_li_ss_tl?ie=UTF8&amp;qid=1549369419&amp;sr=8-2&amp;keywords=HRm-DUAL&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7e7be6310f746798e39bd02156f77f8f&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"52\" src=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png\" alt srcset=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png 125w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-200x84.png 200w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205.png 510w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG/ref=as_li_ss_tl?ie=UTF8&amp;qid=1549369419&amp;sr=8-2&amp;keywords=HRm-DUAL&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7e7be6310f746798e39bd02156f77f8f&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$45</span></a> </div><p>The HRM-DUAL strap transmits not only concurrently on ANT+ &amp; Bluetooth Smart, but actually has two Bluetooth channels, making it perfect for pairing to Zwift at the same time you also have it paired to another device/app via Bluetooth.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2022/07/garmin-hrm-pro-plus-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-PRO Plus</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Pro-Captures-Dynamics-Transmits/dp/B0B3PNFK9H?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3e7b937f2d96da50e05debf31890136e&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-125x125.png\" alt srcset=\"https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-125x125.png 125w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-200x199.png 200w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent-720x715.png 720w, https://media.dcrainmaker.com/images/2022/07/HRM-PRO-Plus-Transparent.png 1500w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Pro-Captures-Dynamics-Transmits/dp/B0B3PNFK9H?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3e7b937f2d96da50e05debf31890136e&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$90</span></a> </div><p>The HRM-PRO Plus is Garmin's top-end chest strap. It transmits dual ANT+/Bluetooth Smart, but also transmits Running Dynamics &amp; Running Pace/Distance metrics, stores HR data during a swim, and can be used without a watch for other sports. Also, it can transmit XC Skiing Dynamics as well.</p>\n</div></div>\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"c6cfeaaeef10944d4da82316985162b897547c020a0355e123159c248f7cdfd0","category":"Cycling"}