{"title":"Spawning induction for Latin American fishes","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12841?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>Aquaculture offers solutions to meet the growing global demand for fish, and reports from the UN-FAO indicate that aquaculture production in Latin America (LA) has grown at rates above the world average in recent years. One of the major constraints in the diversification of LA aquaculture is the control of reproduction in several popular native fish species for which difficulties in captive propagation have not yet been sufficiently overcome. This article reviews the use of hormone treatments to promote reproduction in females of these native fish species. LA has played a key role in the history of development of hormone administration, including the first hormonally induced spawning. That contribution is included in a historical overview of the discovery of the major hormones used in fish culture. The review provides a summary of difficulties to propagate females of various native fishes and the effects of administering hormones to enhance reproduction. Induced spawning of certain freshwater species was mainly achieved with pituitary extracts or human chorionic gonadotropin (hCG), although gonadotropin-releasing hormone analogues (GnRHa) treatments are being researched, and successful studies suggest that low doses may be more effective. Research on new and emerging aquaculture species has applied both gonadotropins (Gths) and GnRHa-based treatments, and GnRHa treatments have shown potential for marine species. However, native marine species new to aquaculture have also been conditioned to spawn spontaneously without hormones. Finally, we proposed future lines of research to examine reproductive strategies and GnRHa-based hormone treatments to improve reproductive control for economically important fish species of LA.</p>","author":"Alejandro S. Mechaly, \nSergio R. Batlouni, \nMariano Elisio, \nEduardo A. Sanches, \nJonathan Chacon Guzmán, \nMinerva Maldonado García, \nAdriana Rodríguez‐Forero, \nPaula Vissio, \nElvira Fatsini, \nJesús Núñez, \nNeil Duncan","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"c6d5a23bc97cc7c45541cb7d551835c37e68bab96751495f71f2d0f8dd836306","category":"Environment"}