{"title":"Role of Acanthopagrus schlegelii MyD88 and IκBα in Inflammation Regulation Against Vibrio parahaemolyticus Infection","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8899152?af=R","date":1729079352000,"content":"<p>MyD88 and I<i>κ</i>B<i>α</i> are inflammation-related genes involved in various immune responses in vertebrate, but their function in <i>Acanthopagrus schlegelii</i> was not clear. In this article, the open reading frame (ORF) of <i>A. schlegelii</i> MyD88 (<i>AsMyD88</i>) is 867 bp, encoding 288 amino acids, and containing a death domain and a TIR domain. The ORF of <i>A. schlegelii κ</i>B<i>α</i> (<i>AsIκBα</i>) is 951 bp, encoding 324 amino acids and containing multiple ANK domains. The results of qRT-PCR showed that <i>AsMyD88</i> was most distributed in the liver, followed by the gill, while <i>AsIκBα</i> was highly distributed in the kidney and muscle. After infection with <i>Vibrio parahaemolyticus</i>, the transcription of <i>AsMyD88</i> in the liver and kidney was significantly increased, and the transcription of <i>AsIκBα</i> in the liver and kidney was inhibited. After the successful overexpression in RAW264.7 cells, it was found that the overexpressed <i>AsMyD88</i> was distributed in both the nucleus and cytoplasm, while the I<i>κ</i>B<i>α</i> was mainly located in the cytoplasm. The expression of p65 was increased, while the expression of I<i>κ</i>B<i>α</i> was decreased after <i>AsMyD88</i> overexpression. Meanwhile, the transcription of inflammatory factors was significantly increased after overexpression of <i>AsMyD88</i>, while the transcription of inflammatory factors was inhibited after overexpression of <i>AsIκBα</i>. The result showed that NF-<i>κ</i>B pathway was activated by <i>AsMyD88</i>. Meanwhile, the phosphorylation of JNK, ERK, and p38 was significantly changed after overexpression of <i>AsMyD88</i> and <i>AsIκBα</i>, respectively. In conclusion, <i>AsMyD88</i> and <i>AsIκBα</i> could regulate cellular inflammatory response to participate in the immune response of fish.</p>","author":"Keran Bi, \nJianlong Yang, \nLei Na, \nChen Huang, \nQian Meng, \nChaofeng Jia, \nZhiwei Zhang, \nQingguo Meng, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"c6d76ebea1d221e57bfb14cbae16cb2f4abc2aeec9a6b74bae28a3027d0deab4","category":"Environment"}