{"title":"แชตบอทไม่ใช่สูตรสำเร็จ Snapchat โดนถล่มรีวิว 1 ดาวหลังจากปล่อยฟีเจอร์ “My AI”","link":"https://www.blognone.com/node/133552","date":1682429729000,"content":"<div><div><div><p>เมื่อสัปดาห์ก่อนทาง Snapchat ได้ปล่อยฟีเจอร์ใหม่ในชื่อ <strong>My AI</strong> ให้ผู้ใช้งานทั่วไปหลังจากเดิมที่จำกันให้เฉพาะสมาชิกแบบจ่ายรายเดือนอย่าง <strong>Snapchat+</strong> ได้ใช้ไปก่อนหน้านี้ โดยระบบ AI ใหม่ของ Snapchat นั้นใช้เทคโนโลยีของ Open AI GPT นั่นเอง</p>\n<p>ซึ่งผู้ใช้งานแอปฯ สามารถ ถาม หรือพูดคุยกับ My AI ได้โดยจะได้รับคำตอบในทันที โดยตัว My AI นั้นจะถูกปักหมุดไว้บนสุดของหน้า Chat ไม่สามารถย้ายหรือลบออกได้ ซึ่งเสียงตอบรับจากผู้ใช้งานนั้นไม่ดีอย่างที่ Snapchat คาดหวังไว้เท่าไหร่ โดยในสัปดาห์ที่ผ่านมาคะแนนเฉลี่ยใน App Store ของ U.S. อยู่ที่ 1.67 ดาว โดยคิดเป็น 75% ของผู้ใช้งาน ให้รีวิวที่ 1 ดาว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/10ae94f848825faa2735ed84be798649.jpg\" /></p>\n<p>เทียบให้เห็นกันจะ ๆ จากข้อมูลของ Sensor Tower ในไตรมาสที่ 1 ของปี 2023 นั้น Snapchat มีคะแนนรีวิวเฉลี่ยใน App Store อยู่ที่ 3.05 ดาว และมีเพียง 35% เท่านั้นที่เป็นรีวิว 1 ดาว ซึ่งจำนวนของผู้ใช้งานที่เข้าไปรีวิวแอปฯ นั้นมีเพิ่มขึ้นถึง 5 เท่าจากสัปดาห์ก่อน</p>\n<p>ซึ่งเสียงรับจากผู้ใช้บางส่วนสามารถหาได้ตาม SNS ต่าง ๆ ไม่ว่าจะเป็น Twitter ที่มีตัวอย่างความคิดเห็นต่อฟีเจอร์นี้ว่า “มีตัวเลือกให้ลบออกไปไหมนะ ? คิดว่าไม่น่าจะมีใครอยากได้ฟีเจอร์นี้นะ” ซึ่งจริง ๆ แล้วฟีเจอร์ My AI สามารถลบออกจาก Chat Feed ได้ครับ แต่ต้องสมัครบริการเสียเงินรายเดือนอย่าง Snapchat+</p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2023/04/24/snapchat-sees-spike-in-1-star-reviews-as-users-pan-the-my-ai-feature-calling-for-its-removal/\">TechCrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/snapchat\">Snapchat</a></div><div><a href=\"/topics/ai\">AI</a></div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c6d8e5d8d0ed623713121b5935b0bef628b8bb30e9e48afeefda1d8ab791ce1c","category":"Thai"}