{"title":"Perception of urban green space among university students in Bangladesh","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311033","date":1727704800000,"content":"<p>by Bijoya Saha, Shah Md Atiqul Haq</p>\r\n\r\nPublic parks and other green areas are crucial components of urban development. Urban management in emerging countries such as Bangladesh faces major challenges, especially because of the socio-environmental impacts of urbanization. Urban management initiatives in developing countries sometimes neglect crucial services for university students, such as study environments and recreational facilities. This study aimed to investigate students’ perceptions of urban green space (UGS) and its potential benefits to our daily lives at Shahjalal University of Science and Technology (SUST) in Sylhet, Bangladesh, We collected data from 438 respondents by using a survey questionnaire-based stated preference approach as a methodological tool, using non-monetary assertions as the basis for the method. The survey included questions about respondents’ social background, the frequency with which they visited green spaces, the benefits of urban green spaces and their perception of urban green spaces. We performed statistical analysis both descriptive and inferential statistics. Our findings suggest that 71.7% of students primarily use street trees and peace gardens as their main sites for urban green spaces. The study suggests that the advantages of urban green spaces, which include physical, mental, and environmental benefits, are strongly associated with criteria such as gender, academic level, and vulnerable to home locality for climate change (CC) or extreme weather events (EWEs). The Binary Logistic regression analysis identified urban life as the most influential factor. The correct classification rate was approximately 74.7%, indicating the model’s strong accuracy in classification. Students who have lived in urban areas for more than 20 years have a reduced awareness of urban green spaces at 5% level of significance. Planning and policymaking for the creation and administration of urban green spaces, considering aspects like land use and environmental sustainability, could benefit from this study.","author":"Bijoya Saha","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6daa55f41bc4931fe1270ed6b9b741e360a8e5dd10bb68b83e50b27372230f7","category":"Interdisciplinary"}