{"title":"Demand side management using optimization strategies for efficient electric vehicle load management in modern power grids","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300803","date":1711029600000,"content":"<p>by Manoj Kumar V., Bharatiraja Chokkalingam, Devakirubakaran S.</p>\r\n\r\nThe Electric Vehicle (EV) landscape has witnessed unprecedented growth in recent years. The integration of EVs into the grid has increased the demand for power while maintaining the grid’s balance and efficiency. Demand Side Management (DSM) plays a pivotal role in this system, ensuring that the grid can accommodate the additional load demand without compromising stability or necessitating costly infrastructure upgrades. In this work, a DSM algorithm has been developed with appropriate objective functions and necessary constraints, including the EV load, distributed generation from Solar Photo Voltaic (PV), and Battery Energy Storage Systems. The objective functions are constructed using various optimization strategies, such as the Bat Optimization Algorithm (BOA), African Vulture Optimization (AVOA), Cuckoo Search Algorithm, Chaotic Harris Hawk Optimization (CHHO), Chaotic-based Interactive Autodidact School (CIAS) algorithm, and Slime Mould Algorithm (SMA). This algorithm-based DSM method is simulated using MATLAB/Simulink in different cases and loads, such as residential and Information Technology (IT) sector loads. The results show that the peak load has been reduced from 4.5 MW to 2.6 MW, and the minimum load has been raised from 0.5 MW to 1.2 MW, successfully reducing the gap between peak and low points. Additionally, the performance of each algorithm was compared in terms of the difference between peak and valley points, computation time, and convergence rate to achieve the best fitness value.","author":"Manoj Kumar V.","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6dc4d0d3e156cfeefe490fc5489d3c88149c5e07d764974f75783c3cf9ca216","category":"Interdisciplinary"}