{"title":"Adsorption mechanism and electrochemical properties of disperse blue 2BLN onto magnetic Cu0.2Zn0.3Co0.5Fe2O4 nanoparticles prepared via the rapid combustion process","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14456?af=R","date":1720691161000,"content":"<h2>Abstract</h2>\n<p>Magnetic Cu<sub>0.2</sub>Zn<sub>0.3</sub>Co<sub>0.5</sub>Fe<sub>2</sub>O<sub>4</sub> nanoparticles were prepared by the rapid combustion method and characterized by scanning electron microscope (SEM), energy dispersive spectroscopy (EDS), x-ray diffraction (XRD), and vibrating sample magnetometer (VSM). The average particle size and the saturation magnetization of the nanoparticles prepared at 400°C with 25 mL absolute alcohol were about 60.9 nm and 50 emu/g. The results of the experiment displayed that the adsorption process agreed with the pseudo-second-order kinetics model (<i>R</i>\n<sup>2</sup> &gt; 0.98) and Langmuir isotherm model (<i>R</i>\n<sup>2</sup> = 0.9982), indicating that the adsorption of DB-2BLN onto magnetic Cu<sub>0.2</sub>Zn<sub>0.3</sub>Co<sub>0.5</sub>Fe<sub>2</sub>O<sub>4</sub> nanoparticles was monolayer chemisorption. Δ<i>H</i> (Δ<i>H</i> = −28.0135 kJ/mol) of the thermodynamic experiment was less than 0, indicating that the adsorption was an exothermic process. The effects of pH, initial concentration of dye, ionic strength, temperature, and adsorbent dosage on the adsorption process of DB-2BLN onto magnetic Cu<sub>0.2</sub>Zn<sub>0.3</sub>Co<sub>0.5</sub>Fe<sub>2</sub>O<sub>4</sub> nanoparticles and the regeneration performance of the nanoparticles were investigated. When the pH was determined to be 2 and the adsorbent dosage was 5 mg, the adsorption capacity reached the maximum. After 7 cycles, the removal rate of DB-2BLN still reached 92.6% of that for the first adsorption, showing excellent regeneration performance. Finally, the electrochemical properties of the magnetic Cu<sub>0.2</sub>Zn<sub>0.3</sub>Co<sub>0.5</sub>Fe<sub>2</sub>O<sub>4</sub> nanoparticles were investigated by cyclic voltammetry (CV) and electrochemical impedance spectroscopy (EIS).</p>","author":"Wenjun Zhou, \nZhixiang Lv, \nYao Wang, \nSheng Luo, \nDan Zhou, \nGuodong Su","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"c6ed780bddc5eb73c1c43454850fcb4de03b71059a2c532fa3441b5c3b8c823f","category":"Environment"}