{"title":"Proposal of a New Procedure for Assessing the Performance of the Self-Healing Polymer-Modified Asphalt Binders with an Integral Vision of the Damage Characteristic Curves","link":"https://www.preprints.org/manuscript/202406.1798/v1","date":1719377817000,"content":"Fatigue performance and self-repairing activity of asphalt binders are two properties that highly influence the fatigue cracking response of asphalt pavement. There are still numerous gaps of knowledge to fill linked with these two characteristics. For instance, current parameters fail to fully accommodate these two bitumen phenomena. This study aims to propose a new procedure to address this issue utilizing the linear amplitude sweep (LAS) test, LAS with rest period (RP) (LASH) test, and simplified viscoelastic continuum damage (S-VECD) model. This research work used four different types of asphalt binders: neat asphalt (NA), self-healing thermoplastic polyurethane (STPU)-modified bitumen (STPB), self-healing poly (dimethyl siloxane) crosslinked with urea bond (IPA1w)-modified bitumen (IPAB), and styrene–butadiene–styrene (SBS)-modified bitumen (SBSB). Before the testing process, all the materials were subjected to short-term and long-term aging. The new procedure showed a superior capacity to analyze and accommodate all bitumen fatigue performances and self-repairing activities compared to the current method. Another finding proved that asphalt binders with higher self-restoration behavior failed to show better fatigue performance. A breakthrough finding demonstrated that asphalt binder fatigue response augmented when the RP was applied at a higher damage intensity (S) value. STPBs and IPABs reached their highest increments of fatigue response, containing 1.0% of STPU and 0.5% of IPA1w, respectively. Those augmentations were 207.54% and 232.64%, respectively.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c6eff3b5b70799a765fd8e3b47e32c9d2edacc2d9823973a9257048b558d13a7","category":"Interdisciplinary"}