{"title":"Genetic dissection of mutagenic repair and T-DNA capture at CRISPR-induced DNA breaks in Arabidopsis thaliana","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae094/7614393?rss=1","date":1708905600000,"content":"<span><div>Abstract</div>A practical and powerful approach for genome editing in plants is delivery of CRISPR reagents via <span>Agrobacterium tumefaciens</span> transformation. The double-strand break (DSB)-inducing enzyme is expressed from a transferred segment of bacterial DNA, the T-DNA, which upon transformation integrates at random locations into the host genome or is captured at the self-inflicted DSB site. To develop efficient strategies for precise genome editing, it is thus important to define the mechanisms that repair CRISPR-induced DSBs, as well as those that govern random and targeted integration of T-DNA. In this study, we present a detailed and comprehensive genetic analysis of Cas9-induced DSB repair and T-DNA capture in the model plant <span>Arabidopsis thaliana</span>. We found that classical nonhomologous end joining (cNHEJ) and polymerase theta-mediated end joining (TMEJ) are both, and in part redundantly, acting on CRISPR-induced DSBs to produce very different mutational outcomes. We used newly developed CISGUIDE technology to establish that 8% of mutant alleles have captured T-DNA at the induced break site. In addition, we find T-DNA shards within genomic DSB repair sites indicative of frequent temporary interactions during TMEJ. Analysis of thousands of plant genome–T-DNA junctions, followed up by genetic dissection, further reveals that TMEJ is responsible for attaching the 3′ end of T-DNA to a CRISPR-induced DSB, while the 5′ end can be attached via TMEJ as well as cNHEJ. By identifying the mechanisms that act to connect recombinogenic ends of DNA molecules at chromosomal breaks, and quantifying their contributions, our study supports the development of tailor-made strategies toward predictable engineering of crop plants.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"c6f0d788940b0e891feb55d43786dbd92fc33a89cc7cf5ffc5d892045e58a58f","category":"Interdisciplinary"}