{"title":"สนุกมั้ยพี่? บิตคอยน์เด้งกลับ หลัง Elon Musk ทวีตว่า Tesla ยังไม่ได้เทขายเหรียญ","link":"https://www.blognone.com/node/122709","date":1621236245000,"content":"<div><div><div><p>หลังทวิตเตอร์ <a href=\"https://twitter.com/CryptoWhale\">Mr.Whale</a> ทวิตสายคริปโตที่มีผู้ติดตามกว่าหนึ่งแสนห้าหมื่นคน ทวีตติดตลกพร้อมแท็กอีลอน มัสก์ ว่า “ไตรมาสหน้าพวกถือบิตคอยน์เซ็งแน่ๆ ถ้าเกิด Tesla เทขายเหรียญออกมา ซึ่งถ้าจะทำก็ไม่แปลกใจ @elonmusk โดนสังคมถล่มซะขนาดนี้” ซึ่งอีลอนมารีพลายว่า “Indeed” หรือ “ใช่เลย” เมื่อคืนนี้ ทำเอาชาวบิตคอยน์หัวปั่น สื่อสำนักต่างๆ ทั้งไทยและเทศ ลงข่าวว่า Tesla อาจขายบิตคอยน์ไปแล้ว ทำตลาดร่วงกราว กระทบไปยังสกุลเงินคริปโตอื่น</p>\n<p>ล่าสุดเมื่อช่วงบ่ายโมง (หรือตีหนึ่ง ตามเวลาเท็กซัส) อีลอนก็ยังไม่หลับไม่นอน ทวิตตอบ <a href=\"https://twitter.com/BTC_Archive/status/1394051036462071808\">Bitcoin Archive</a> ว่าจริงๆ แล้ว Tesla ยังไม่ได้ขายบิตคอยน์ไปนะ ทำตลาดเด้งกลับขึ้นมาอีกครั้ง หลัง Bitcoin Archive พูดถึงผลกระทบของการโพสต์เล่น (shitposting) ของอีลอน ว่าทำตลาดบิตคอยน์ร่วงถึง 20%</p>\n<p>ในช่วงไม่กี่วันที่ผ่านมา ดูเหมือนอีลอน มัสก์ จะกลายเป็นศัตรูหมายเลขหนึ่งของวงการเงินคริปโต ตั้งแต่ออกรายการ <a href=\"https://www.blognone.com/node/122590\">Saturday Night Live แล้วเล่นมุกเหรียญ Doge แค่เล็กน้อย</a> หลังจากนั้นยัง<a href=\"https://www.blognone.com/node/122659\">ทวิตระบุว่า Tesla เลิกรับบิตคอยน์</a> ตามมาด้วยทวิตเตรียม<a href=\"https://www.blognone.com/node/122669\">ปรับปรุงเหรียญ Doge ให้ประหยัดพลังงาน</a> และทวิตอื่นๆ ที่ส่งผลกระทบต่อตลาดเงินคริปโตทั้งทางบวกและลบติดต่อกัน จนชาวคริปโตปวดหัวไปตามๆ กันและอยากให้เขาหยุดสักที</p>\n<p>อย่างไรก็ตาม สาวกเงินคริปโตอาจต้องมองในระยะยาวว่าการที่ทวิตของคนเพียงคนเดียวที่ส่งผลต่อตลาดได้ขนาดนี้ จะแปลว่าตลาดเงินคริปโตปลอดภัยอย่างที่คิดจริงหรือไม่ คงต้องใช้วิจารณญาณ และระมัดระวังในการลงทุนต่อไป</p>\n<p><em>บทความนี้ไม่ใช่คำแนะนำทางการเงิน ผู้ลงทุนควรศึกษาข้อมูลด้วยตนเองเสมอ</em></p>\n<p>ที่มา - <a href=\"https://twitter.com/elonmusk/status/1394001894809427971\">Elon Musk Tweet 1</a>, <a href=\"https://twitter.com/elonmusk/status/1394170030741413888\">2</a></p>\n<blockquote><p>To clarify speculation, Tesla has not sold any Bitcoin</p>\n<p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1394170030741413888?ref_src=twsrc%5Etfw\">May 17, 2021</a></p></blockquote>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8bb14d9978f57f5ca6f03eabb890046b.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/bitcoin\">Bitcoin</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div><div><a href=\"/topics/tesla-motors\">Tesla Motors</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c6f58929948cf85ca0a45a6890cb9692a27735f3e2f03d3f586a992abdb2cb22","category":"Thai"}