{"title":"Influence of temporary emigration on wood turtle (<i>Glyptemys insculpta</i>) detectability, with implications for abundance estimation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302170","date":1713276000000,"content":"<p>by Allyson N. Beard, Donald J. Brown, Eric T. Hileman, Michael T. Jones, Jena M. Staggs, Ron A. Moen, Andrew F. Badje, Christopher M. Lituma</p>\r\n\r\nReliable population estimates are important for making informed management decisions about wildlife species. Standardized survey protocols have been developed for monitoring population trends of the wood turtle (<i>Glyptemys insculpta</i>), a semi-aquatic freshwater turtle species of conservation concern throughout its distribution in east-central North America. The protocols use repeated active search surveys of defined areas, allowing for estimation of survey-specific detection probability (<i>p</i>) and site-specific abundance. These protocols assume population closure within the survey area during the survey period, which is unlikely to be met as wood turtles are a highly mobile species. Additionally, current protocols use a single-pass design that does not allow for separation of availability (<i>p</i><sub>a</sub>) and detectability (<i>p</i><sub>d</sub>). If there are systematic influences on <i>p</i><sub>a</sub> or <i>p</i><sub>d</sub> that are not accounted for in the survey design or data analysis, then resulting abundance estimates could be biased. The objectives of this study were to determine if <i>p</i><sub>a</sub> is a random process and if <i>p</i><sub>a</sub> and <i>p</i><sub>d</sub> are influenced by demographic characteristics. We modified the wood turtle survey protocol used in the upper Midwest to include a double-pass design, allowing us to estimate <i>p</i><sub>a</sub> and <i>p</i><sub>d</sub> using a robust design capture-recapture model. The modified protocol was implemented at 14 wood turtle monitoring sites in Minnesota and Wisconsin between 2017 and 2022. Our results indicated that <i>p</i><sub>a</sub> was non-random and that <i>p</i><sub>d</sub> increased with turtle carapace length. Our study suggests that model assumptions for current wood turtle population models may be violated, likely resulting in an overestimation of abundance. We discuss possible protocol and modeling modifications that could result in more accurate wood turtle abundance estimates.","author":"Allyson N. Beard","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c6f70fa5287db5a04aaf94145a28fafba91bb980c34aa22a9ddb11a599a828ab","category":"Interdisciplinary"}