{"title":"Google Maps อัปเดต เพิ่ม Glanceable directions นำทางทันที ไม่ต้องเข้าโหมด Navigation","link":"https://www.blognone.com/node/134373","date":1686812411000,"content":"<div><div><div><p>Google Maps เพิ่มฟีเจอร์ <strong>Glanceable directions</strong> แสดงลูกศรในแผนที่บอกเส้นทาง และเปลี่ยนเส้นทางอัตโนมัติเมื่อผู้ใช้ออกนอกเส้นทางที่แนะนำ พร้อมกับบอกระยะเวลาที่จะถึงจุดหมาย โดยไม่ต้องเปิดโหมดนำทางก่อน สามารถดูข้อมูลได้ทันทีที่ขอให้ Google Maps แนะนำเส้นทาง หรือจะดูผ่าน lock screen ก็ได้</p>\n<p>Glanceable directions ในโหมดเดิน จักรยาน และรถยนต์ จะเปิดให้ใช้ได้ทั่วโลกภายในเดือนนี้บน Android และ iOS</p>\n<p>นอกจากนี้ยังมีโหมดอีก 2 โหมดที่กูเกิลอัปเดตเพิ่ม คือ <a href=\"https://www.blognone.com/node/133776\">Immersive View</a> แบบจำลองภาพเส้นทางและสถานที่แบบ 3 มิติที่สามารถเลือกแถบเวลาและสภาพอากาศในแต่ละช่วงเวลา ความหนาแน่นของคน รวมถึงยังส่องข้างในร้านอาหารในระแวกนั้นได้ด้วย <a href=\"https://ai.googleblog.com/2023/06/reconstructing-indoor-spaces-with-nerf.html\">NeRF</a> AI สร้างภาพพื้นที่ภายในอาคาร ซึ่งเปิดตัวใหม่ใน 4 เมืองใหม่ ได้แก่ อัมสเตอร์ดัม ดับลิน ฟลอเรนซ์ และเวนิส และกำลังขยายไปยัง 500 สถานที่สำคัญทั่วโลก</p>\n<p>อีกโหมด คือ Recents on desktop ช่วยจัดระเบียบสถานที่ที่เคยค้นหาเอาไว้เป็นไฮไลต์และจะไม่ถูกลบเมื่อปิดหน้าต่างไป เมื่อเลือกจุดหมายปลายทาง 3 แห่งขึ้นไป สามารถสร้างเส้นทางที่กำหนดขึ้นเองซึ่งผ่านจุดหมายที่เลือกไว้ได้ และยังสามารถวางแผนการเดินทางหลายครั้งได้พร้อมกันอีกด้วย โดยจะเปิดให้ใช้ได้ในเดือนหน้า</p>\n<p>ที่มา: <a href=\"https://blog.google/products/maps/google-maps-updates-immersive-view-trip-planning/\">กูเกิล</a></p>\n<p><img alt=\"alt=&quot;Glanceable directions&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/555fa394302b281905474ccc7878b3e8.png\" /></p>\n<p><img alt=\"alt=&quot;3&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/f54d4c98ca8924e51b72b448822272dc.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-maps\">Google Maps</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"Methasit Tubtim","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c702820371e2655de6d63c8c96d7e97585de9db6946b62d1172695ed7f29b6b8","category":"Thai"}