{"title":"Effects of the inoculation dose of Issatchenkia terricola WJL‐G4 on physicochemical properties, active substances, and antioxidant capacity of black, red, and white currant juice","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13464?af=R","date":1710756873000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Due to the high level of organic acids, primarily citric acid, black, red, and white currants have an excessively sour taste, making taste adjustment during processing challenging. This study investigated and evaluated the effects of inoculation does of the acid-reducing yeast <i>Issatchenkia terricola</i> WJL-G4 on several aspect such as physicochemical properties, chromaticity, active substances, and antioxidant capacity. Additionally, a sensory evaluation was also conducted.</p>\n<h2>Results and conclusion</h2>\n<p>The results indicated that when the inoculation dose increased from 2% to 12%, the contents of total phenols, total flavonoids, total anthocyanins, and antioxidant capacity in currant juice decreased. Moreover, a low inoculation dose (2–4%) were beneficial for reserving the contents of total phenols, total flavonoids. Although the levels of most phenolic compounds decreased, the concentrations of caffeic acid, <i>p</i>-coumaric acid, ferulic acid, rutin, and epicatechin were significantly higher than the control after fermentation. Overall acceptability and taste scores of fermented currants were improved compared with those of the control group. This experiment provided an effective solution and theoretical support for solving the problems of sour taste and harsh flavor of currant juice.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Liping Gao, \nYunhan Li, \nShuo Yang, \nYihong Bao, \nTing Luo, \nJinling Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c718adabb74ba2da620e9f878fc410b4bd1a3f0961e2e061a94f4896be961b88","category":"Environment"}