{"title":"Transitioning from Host-Pathogen Dynamics to Social Interactions: Assessing Vaccination Strategies through the IABM Model","link":"https://www.preprints.org/manuscript/202407.0760/v1","date":1720526168000,"content":"This study presents extended Immunity Agent-Based Model (IABM) simulations to evaluate vaccination strategies in controlling the spread of infectious diseases. The application of IABM in the analysis of vaccination configurations is innovative, as a vaccinated individual can be infected depending on how their immune system acts against the invading pathogen, without a pre-established infection rate. Analysis at the microscopic level demonstrates the impact of vaccination on individual immune responses and infection outcomes, providing a more realistic representation of how the humoral response caused by vaccination affects the individual’s immune defense. At the macroscopic level, the effects of different population-wide vaccination strategies are explored, including random vaccination, targeted vaccination of specific demographic groups, and spatially focused vaccination. The results indicate that increased vaccination rates are correlated with decreased infection and mortality rates, highlighting the importance of achieving herd immunity. Furthermore, strategies focused on vulnerable populations or densely populated regions prove to be more effective in reducing disease transmission compared to randomly distributed vaccination. The results presented in this work show that vaccination strategies focused on highly crowded regions are more efficient in controlling epidemics and outbreaks. Results suggest that applying vaccination only in the densest region resulted in the suppression of infection in that region, with less intense viral spread in areas with lower population densities. Strategies focused on specific regions, in addition to being more efficient in reducing the number of infected and dead people, reduce costs related to transportation, storage, and distribution of doses compared to the random vaccination strategy. Considering that, despite scientific efforts to consolidate the use of mass vaccination, the accessibility, affordability, and acceptability of vaccines are problems that persist, investing in the study of strategies that mitigate such issues is crucial in the development and application of government policies that make immunization systems more efficient and robust.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c71db18b3a447ca1a91503590be5db4f1ae7393532bcd8fbdcd2376af052b4e9","category":"Interdisciplinary"}