{"title":"สหรัฐฯ ออกมาตรการฉุกเฉินหลังท่อส่งน้ำมันหลักถูกแฮก คาดว่าถูกมัลแวร์เรียกค่าไถ่ DarkSide","link":"https://www.blognone.com/node/122597","date":1620619602000,"content":"<div><div><div><p>กระทรวงคมนาคมสหรัฐฯออกมาตรการฉุกเฉิน<a href=\"https://www.blognone.com/node/122582\">หลังบริษัท Colonial Pipeline ผู้ดูแลท่อส่งน้ำมันหลักของสหรัฐฯ  ถูกแฮก</a>และยังไม่สามารถกู้ระบบกลับมาได้ ทำให้บริษัทไม่สามารถส่งน้ำมันออกจากโรงกลั่นในเท็กซัสไปยังรัฐอื่นๆ คำสั่งนี้เปิดทางให้บริษัทน้ำมันสามารถส่งน้ำมันทางรถได้โดยไม่ติดกฎระเบียบตามปกติ</p>\n<p>ตอนนี้น้ำมันกลั่นแล้วไม่สามารถส่งไปยังผู้ใช้ปลายทางได้ และหากไม่สามารถเปิดท่อส่งน้ำมันภายในวันอังคารนี้ ผลกระทบจะเริ่มไปถึงรัฐนิวยอร์ค ส่วนทาง Colonial ระบุว่าตอนนี้ท่อส่งน้ำมันหลักของบริษัทนั้นปิดทำการ แต่ยังมีท่อย่อยๆ แบบจุดต่อจุดที่บริษัทดูแลนั้นยังใช้งานได้ตามปกติ</p>\n<p>ทางบริษัทยังไม่เปิดเผยรายละเอียดการโจมตีครั้งนี้ แต่แหล่งข่าวไม่เปิดเผยตัวตนระบุกับสำนักข่าวรอยส์เตอร์ว่าหนึ่งในกลุ่มต้องสงสัยคือกลุ่มดำเนินการมัลแวร์เรียกค่าไถ่ DarkSide ที่ปฎิบัติการอย่างมืออาชีพ มีช่องทางให้เหยื่อติดต่อชัดเจน พร้อมกับการกระจายข่าวให้สื่อมวลชน ขณะที่ James Chappell จากบริษัทความปลอดภัยไซเบอร์ Digital Shadows ระบุว่าหากตัวการเป็น DarkSide จริง ความเป็นไปได้คือกลุ่มแฮกเกอร์นี้ไปซื้อรหัสผ่านการรีโมตเข้าไปทำงาน เช่น รหัส TeamViewer หรือ Microsoft Remote Desktop เพื่อแฮกเครือข่าย</p>\n<p>ที่มา - <a href=\"https://www.bbc.com/news/business-57050690\">BBC</a>, <a href=\"https://www.reuters.com/business/energy/ransom-group-linked-colonial-pipeline-hack-is-new-experienced-2021-05-09/\">Reuters</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/70557b01789aa3b016e5e26ddf967c59.jpg\" /></p>\n<p>ภาพเจ้าหน้าที่ใน<a href=\"https://twitter.com/Colpipe/status/1315659694707482624\">ห้องควบคุมของ Colonial Pipeline</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/usa\">USA</a></div><div><a href=\"/topics/hacking\">Hacking</a></div><div><a href=\"/topics/ransomware\">Ransomware</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c733dd6c98ad9592cc9a1592ec85346f1886758f39adce78bfce4bc5b28156ea","category":"Thai"}