{"title":"A structure-redesigned intrinsically disordered peptide that selectively inhibits a plant transcription factor in jasmonate signaling","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae312/7721056?rss=1","date":1721952000000,"content":"<span><div>Abstract</div>Plant hormone-related transcription factors (TFs) are key regulators of plant development, responses to environmental stress such as climate changes, pathogens, and pests. These TFs often function as families that exhibit genetic redundancy in higher plants, and are affected by complex crosstalk mechanisms between different plant hormones. These properties make it difficult to analyze and control them in many cases. In this study, we introduced a chemical inhibitor to manipulate plant hormone-related TFs, focusing on the jasmonate (JA) and ethylene (ET) signaling pathways, with the key TFs MYC2/3/4 and EIN3/EIL1. This study revealed that JAZ10<sup>CMID</sup>, the binding domain of the repressor involved in the desensitization of both TFs, is an intrinsically disordered region in the absence of binding partners. Chemical inhibitors have been designed based on this interaction to selectively inhibit MYC TFs while leaving EIN3/EIL1 unaffected. This peptide inhibitor effectively disrupts MYC-mediated responses while activating EIN3-mediated responses and successfully uncouples the crosstalk between JA and ET signaling in <span>Arabidopsis thaliana</span>. Furthermore, the designed peptide inhibitor was also shown to selectively inhibit the activity of MpMYC, an ortholog of AtMYC in <span>Marchantia polymorpha</span>, demonstrating its applicability across different plant species. This underscores the potential of using peptide inhibitors for specific TFs to elucidate hormone crosstalk mechanisms in non-model plants without genetic manipulation. Such a design concept for chemical fixation of the disordered structure is expected to limit the original multiple binding partners and provide useful chemical tools in chemical biology research.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"c73abe4465b1ea7695e1ec7a16c5273ff3fb803e9b111102cd5214e910a37637","category":"Interdisciplinary"}