{"title":"466 Dietary microalgae (Chlorella vulgaris) may stimulate GSH-antioxidant system in response to increased deposition of muscle omega-3 polyunsaturated fatty acids in post-weaning piglets","link":"https://academic.oup.com/jas/article/102/Supplement_3/407/7757313?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This work evaluated the effects of dietary inclusion of microalga <span>Chlorella vulgaris</span> on post-weaning piglet growth performance and physiology. Non-castrated male piglets [n = 72; Piétrain × (Large White x Landrace), with 7.4±1.03 kg body weight (BW); 28 d] were blocked by BW and randomly assigned to 24 pens (3 animals/pen, n = 8) and each pen to one of three experimental diets, fed ad libitum: (C) Control diet (wheat/corn/soybean meal-based), (CV2.5) 2.5% <span>C. vulgaris</span> inclusion and (CV5) 5% <span>C. vulgaris</span> inclusion. The trial lasted 5 wk, with BW and feed intake determined weekly. Total tract apparent digestibility (TTAD) was determined using chromic oxide as external marker. Following wk 5 (67 d), one piglet per pen (median BW) was slaughtered and visceral organs, gastrointestinal contents and Longissimus lumborum muscle were sampled. Untargeted <sup>1</sup>H NMR metabolomics study characterized hepatic polar metabolome following CHCl<sub>3</sub>:MetOH:H<sub>2</sub>O extraction. Multivariate analysis (PCA, PLS-DA) and identification of important metabolites enabled pathway analysis. Intramuscular fatty acid composition was determined by gas-liquid chromatography after direct transesterification to methyl-esters and extraction. Growth performance indicators, TTAD, digesta viscosity and pH were determined and analyzed by ANOVA with values reported as average ± SEM and significance at <span>P</span> ≤ 0.05. Diet did not affect average daily BW gain (566 ± 1.6 g/d), average daily feed intake (711 ± 1.8 g/d), nor feed conversion ratio (1.28 ± 0.078). Viscosity of intestinal contents in upper small intestine (3.7 ± 0.19 mPa.s) and ileum (4.8 ± 0.26 mPa.s), as well as pH of stomach (4.1 ± 0.18), upper small intestine (5.7 ± 0.08), ileum (6.6 ± 0.07), cecum (5.7 ± 0.10) and colon contents (6.1 ± 0.08) were unaffected by diets, within each sampling site. Minor negative effects of microalgae inclusion were seen on digestibility of all feed fractions (1 to 9% difference, compared with Control), namely DM, OM, CP, CF, Ash, NDF and DE. In the muscle, animals fed 5% <span>C. vulgaris</span> presented greater concentrations of omega-3 polyunsaturated fatty acids (PUFA, 1.68 ± 0.112 % vs. 1.39 % of total FA) and no effect in omega-6 PUFA concentration, thus a greater ratio of Omega 3 to Omega 6 (0.052 ± 0.022 vs. 0.045), when compared with Control. Multivariate analysis of liver metabolomics showed significant clustering, clearly separating both microalgae-fed groups from Control. The altered metabolic profile suggests activation of antioxidant pathways, as well as carbohydrate and amino acid metabolism with dietary inclusion of <span>C. vulgaris</span>. Particularly, levels of antioxidant metabolic markers as glutathione, sarcosine, betaine and their precursor amino acids point to an enhanced GSH-antioxidant system activation. Overall, results indicate that <span>C. vulgaris</span> inclusion in post-weaning diets up to 5% does not penalize growth performance and can effectively be used in piglet nutrition. Furthermore, hepatic metabolomics suggest important bioactivity imparted by <span>C. vulgaris</span> dietary inclusion, potentially linking enhanced antioxidant systems in the liver with stable integration of PUFA in muscle, which may improve piglet health and pork quality.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c74c80aae72b49dae6cb95eaa10566cf956d89af0d4b4ad091392a32cc98234b","category":"Environment"}