{"title":"Pixel 6 Fingerprint Scanner Is Not Good","link":"https://www.engadget.com/google-pixel-6-slow-fingerprint-sensor-195023475.html","date":1636486501000,"content":"\n<p>J. Fingas, writing for Engadget:</p>\n\n<blockquote>\n  <p>Ask Pixel 6 owners about their top gripe and they’ll likely point\nto the slow, finicky fingerprint sensor. There may be an\nexplanation for that momentary anguish, though. <a href=\"https://twitter.com/madebygoogle/status/1457043416139898881\">Google is telling\nusers</a> that the Pixel 6’s fingerprint reader is using “enhanced\nsecurity algorithms” that may either take longer to check your\ndigits or require better sensor contact.</p>\n\n<p>Google hasn’t elaborated on its statement. We’ve asked Google for\ncomment.</p>\n</blockquote>\n\n<p>That’s in reference to [this tweet from the Made By Google account]:</p>\n\n<blockquote>\n  <p>We’re sorry for the hassle. The Pixel 6 fingerprint sensor\nutilizes enhanced security algorithms. In some instances, these\nadded protections can take longer to verify or require more direct\ncontact with the sensor. Try troubleshooting steps:\n<a href=\"https://support.google.com/pixelphone/answer/6285273\">https://goo.gle/36GYhYB</a>. Thanks.</p>\n</blockquote>\n\n<p>That is some seriously weak sauce. I read <a href=\"https://www.techmeme.com/211025/p31#a211025p31\">a bunch of Pixel 6 reviews</a>, and while the phones were received very well overall — particularly the cameras’ still photo capabilities, as usual — every single review mentioned that the fingerprint recognition was too slow.</p>\n\n<p>Is this a dealbreaker? I don’t know. But fast, accurate biometric authentication — fingerprint or facial recognition — is table stakes for a phone today. The face unlock feature on my two-year-old Pixel 4 works perfectly. Seems weird that Google would ditch a good facial recognition scanner for a slow fingerprint scanner.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/09/pixel-6-fingerprint-scanner\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c755123aa819e152fa0868f9520b04c946dc79597a5428230c5db8d6fefa4690","category":"Tech"}