{"title":"Yet again, bike racing and human rights collide","link":"https://cyclingtips.com/2021/04/yet-again-bike-racing-and-human-rights-collide/","date":1617851152000,"content":"<p>The concentration camp was hastily constructed in the forest outside Slutsk, Belarus, and then the trucks full of protesters began to arrive. </p>\n\n\n\n<p>The prisoners – what Alexander Lukashenko’s regime considered “dissidents” – were held in the cold, beaten and entered into a database. In the capital, Minsk, prisoners at the notorious Akrestsina detention centre were stripped naked and tortured. “At night, from our window outside we could hear people howling, screaming,&#8221; <a href=\"https://www.rferl.org/a/firsthand-account-of-torture-at-minsk-detention-center/30790313.html\">a witness said</a>.</p>\n\n\n\n<p>Their crime: peaceful protest against an election that has widely been condemned as corrupt.&nbsp;</p>\n\n\n\n<p>In August 2020, there were vast protests at the outcome of the presidential elections which saw longtime ruler, Alexander Lukashenko, returned to power amid suspicions of vote-rigging. Lukashenko is the only president in Belarus’ post-Soviet history, and has been described as “Europe’s last dictator”. </p>\n\n\n\n<p>Despite a groundswell of popular support in the August elections for rival candidate Sviatlana Tsikhanouskaya – who claimed to have won up to 70% of the vote – Lukashenko launched violent crackdowns on protesters. Tsikhanouskaya was forced into exile in Lithuania, and Lukashenko has refused to stand aside. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"1005\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-1340x1005.jpg\" alt=\"\" class=\"wp-image-511973\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-1340x1005.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-650x488.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-190x143.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-510x382.jpg 510w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-1080x810.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959-16x12.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/Minsk_Protest_2020-08-16_160959.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The protests against the result of the Belarusian election were widely attended.  Image: <a href=\"https://commons.wikimedia.org/wiki/User:%D0%9C%D0%B0%D0%BA%D1%81%D0%B8%D0%BC_%D0%A8%D0%B8%D0%BA%D1%83%D0%BD%D0%B5%D1%86\">Максим Шикунец</a> / Wiki Commons.</figcaption></figure>\n\n\n\n<p>In the aftermath, a climate of fear has descended while protests have continued. Tens of thousands of protestors have been detained, hundreds of protesters have reportedly been tortured, and concentration camps have been established. Lukashenko has been broadly condemned by the international community, with the European Union and the United States no longer recognising his presidency. In late March, the UN Human Rights Council voted to investigate “allegations of widespread human rights abuses” in Belarus. </p>\n\n\n\n<p>This is the environment in which the European Track Cycling Championships will take place, scheduled to be held in Minsk from June 23-26. Despite growing calls for a change of venue, the UEC (European Cycling Confederation) this week confirmed to CyclingTips that the event would proceed as planned.&nbsp;</p>\n\n\n\n<h2>Sportsrinse and repeat</h2>\n\n\n\n<p>As is the case in many authoritarian regimes, Belarus has sought international legitimacy through sports over the course of Lukashenko’s rule. Prior to the election and the crackdown that followed, there was a busy events calendar planned for 2021. Minsk was to play host to the Ice Hockey World Championships, the Pentathlon World Championships, and the European Super Cycling Championships&nbsp;–&nbsp;a four-yearly combined event that brought all disciplines of the sport together in the one location. Due to the COVID-19 pandemic, this was downgraded to just the continental track cycling championships.&nbsp;</p>\n\n\n\n<p>Sport does not exist entirely in a political vacuum, however. In November last year, after international condemnation of the deterioration of Belarus’ governance, the International Olympic Committee’s gaze turned to the former Soviet republic. Belarus’ National Olympic Committee (NOCRB) was at the time helmed by President Lukashenko himself, with his son Viktor as vice president.  </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-1340x893.jpg\" alt=\"\" class=\"wp-image-511976\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/Lukashenko_October_2019.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Alexander Lukashenko. Image: Press Service of the President of the Ukraine / Wiki Commons.</figcaption></figure>\n\n\n\n<p>In early December, <a href=\"https://www.olympic.org/news/ioc-eb-takes-provisional-measures-against-noc-of-belarus\">the IOC announced a provisional suspension of Belarus</a> due to failure to &#8220;appropriately protect the Belarusian athletes from political discrimination”. The IOC judgment prohibited members of the NOCRB from attending IOC events, including the Olympics, until certain conditions were met. One of those conditions was both of the Lukashenkos relinquishing power in the NOCRB.&nbsp;&nbsp;</p>\n\n\n\n<p>Due to sponsor and public pressure as a result of the IOC’s stance, the international ice hockey and pentathlon bodies moved to relocate their events.</p>\n\n\n\n<p>The European Track Cycling Championships, organised by the UEC (European Cycling Confederation), have not.&nbsp;</p>\n\n\n\n<h2>A timeline</h2>\n\n\n\n<p>Over almost two months, CyclingTips has been in a dialogue with Enrico della Casa – formerly the Secretary General of the UEC, and since March the newly-elected President of the confederation – to determine whether the UEC would follow the IOC’s lead and the precedent set by other event organisers. </p>\n\n\n\n<p>In late February, Della Casa told CyclingTips that “in accordance with our Constitution we have to follow the UCI rules, meaning that indirectly we’ll also have to follow the decisions of the IOC” and that “we are daily in contact with the Belarusian Cycling Federation in order to better understand the situation”.&nbsp;</p>\n\n\n\n<p>At the time, the UEC declined to confirm what Belarus paid for hosting rights of the continental championships, and whether there had been any attempt to find an alternative host.&nbsp;</p>\n\n\n\n<p>In March, the IOC <a href=\"https://www.olympic.org/news/ioc-eb-decides-further-provisional-measures-against-noc-of-belarus\">introduced further sanctions</a> after the NOCRB violated one of the explicit conditions imposed in the provisional ruling by installing Viktor Lukashenko as president after his father stepped aside. </p>\n\n\n\n<p>Calls have escalated for the UEC to strip Belarus of the European Track Championships on human rights grounds, with the Belarusian Sport Solidarity Foundation (BSSF) prominently campaigning to all UEC federations for a change of venue.&nbsp;</p>\n\n\n\n<p>Despite the IOC’s directive that federations should “respect [its] measures in the interest of protecting Belarusian athletes’ rights and the reputation of the Olympic Movement”, the UEC has held its course that the European Track Cycling Championships will continue as planned. &nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-1340x893.jpg\" alt=\"\" class=\"wp-image-511965\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020782-041.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Minsk was host of the 2013 World Track Cycling Championship. </figcaption></figure>\n\n\n\n<h2>The unwinnable position</h2>\n\n\n\n<p>From the UEC’s perspective, it’s a complex situation to navigate. Against the backdrop of a global pandemic, track cyclists have struggled to find competitive opportunities. The situation is only compounded by it being an Olympic year (probably) – rider selections need to be made.&nbsp;</p>\n\n\n\n<p>In a letter last week to the BSSF –&nbsp;shared with CyclingTips&nbsp;– Enrico della Casa made the argument that “if the above-mentioned Championships were to be removed from Belarus, it would be the athletes themselves who would lose the most from this decision.</p>\n\n\n\n<p>&#8220;As you are aware, we have all been affected by the serious pandemic and athletes specialised in track cycling have especially suffered due to the lack of competitions,” Della Casa wrote.&nbsp;</p>\n\n\n\n<p>There are also the logistical challenges associated with the late relocation of an event that has been in the works for an extended period. </p>\n\n\n\n<p>The UEC was “legally contracted to host this event at this time and location and [was] unable to find another suitable host on this date,” Della Casa wrote to the BSSF. In separate correspondence with CyclingTips, he explained that the organisation last year “had to use all our financial reserves to &#8216;save&#8217; 80% of our main events”. </p>\n\n\n\n<p>In the past the UEC&#8217;s parent body, the UCI, has come under fire for awarding hosting rights to dubious regimes including Qatar and Turkmenistan, but according to Della Casa the European Track Championships were not an opportunity to profiteer. “We are simply talking about covering the organization costs; as a non-profit organization we are not looking for any profit,” he told CyclingTips. The UEC <a href=\"http://www.uec.ch/resources/2021%20Events/congress/2021_UEC_Congress_minutes_06.03.2021.pdf\">made a loss of almost 600,000 CHF</a> in 2020. </p>\n\n\n\n<p>The financial and logistical side of the equation is easy to rationalise and understand, but the ethics of refusing to engage with the political context is another question altogether.&nbsp;</p>\n\n\n\n<p>The UEC, for its part, has been strident in its belief that sport and politics should not meet. “We must stress &#8230; that the UEC respects the equality of all its member National Federations and does NOT AND CANNOT get involved in the internal matters of these Federations,&#8221; Della Casa wrote to the BSSF. </p>\n\n\n\n<p>“We are not looking to the politic[al] but exclusively on the real activities done by our national cycling federations,” Della Casa elaborated to CyclingTips later.&nbsp;</p>\n\n\n\n<p>In the current climate, however, where taking an apolitical stance can in itself be perceived as political, the UEC faces uncomfortable questions in failing to take a stance against Belarus. </p>\n\n\n\n<h2>A complicated history</h2>\n\n\n\n<p>Lurking in the back of the closet are longer-standing question marks around the relationships between Belarus, the UEC, and the UCI. </p>\n\n\n\n<p>In 2013, Minsk hosted the Track Cycling World Championships on a world-class velodrome that has hosted several rounds of the World Cup since. Questions were raised by some outlets (such as <a href=\"https://inrng.com/2012/03/belarus-track-worlds-2013/\">the Inner Ring</a>) around the prominent business deal that was in the works between the company owned by UCI Management Committee powerbroker, Igor Makarov, and the Lukashenko regime. At the time Itera, Makarov&#8217;s business, stood to make millions of dollars on one of the biggest construction projects in Europe. </p>\n\n\n\n<p>Makarov, a Russian billionaire who made his fortune in the oil and gas industry after a career as a track cyclist, spent part of his youth living in Belarus with his grandfather, although he is originally from Turkmenistan. He enjoys diplomatic status in Belarus, and was awarded the rank of Honorary Counsel of Belarus in 2005. He has also been recipient of the Order of Friendship of the People of Belarus. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"810\" src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch-1340x810.jpg\" alt=\"\" class=\"wp-image-355116\" srcset=\"https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch-1340x810.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch-650x393.jpg 650w, https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch-190x115.jpg 190w, https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch-16x10.jpg 16w, https://cyclingtips.com/wp-content/uploads/2020/12/Oligarch.jpg 1600w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Igor Makarov. </figcaption></figure>\n\n\n\n<p>The gift-giving flows both ways. In 2019, a representative of Makarov confirmed that <a href=\"https://charter97.org/en/news/2019/6/10/337235/\">he had given Lukashenko &#8220;expensive bikes&#8221;</a> as a present. These are a preferred gift of the Russian oligarch, who has also given bikes to Gurbanguly Berdimuhamedov, the dictator of Turkmenistan (and a <a href=\"https://cyclingtips.com/tag/turkmenistan/\" target=\"_blank\" rel=\"noreferrer noopener\">CyclingTips regular</a>). And like Berdimuhamedov, despite his many flaws, Lukashenko is an avowed <a href=\"https://eng.belta.by/president/view/lukashenko-wants-belarus-to-become-bicycle-friendly-137996-2021/\">advocate of cycling</a>, and &#8220;prefers bicycles with carbon frames.&#8221;</p>\n\n\n\n<p>As we have reported, the <a href=\"https://cyclingtips.com/2020/11/the-dictator-the-oligarch-and-the-uci-president/\">influence Makarov wields in international cycling</a> is substantial. He is honorary president of the Russian Cycling Federation, has sat on the Management Committee of the UCI since 2011, and was returned as a Management Committee candidate for the 2021 elections. Although he is less public-facing than he once was – he previously played a visible role in the defeat of Pat McQuaid as UCI President, the installation of David Lappartient to UEC presidency, and Lappartient&#8217;s rise to the head of the UCI – Makarov remains an important ally for the federations and individuals seeking prestige and power in cycling. </p>\n\n\n\n<h2>Juggling political hot potatoes</h2>\n\n\n\n<p>The UEC is not the first cycling body to become embroiled in a politically sensitive situation as a result of its hosting decisions. The 2021 Track Cycling World Championships are set to be conducted in Ashgabat, Turkmenistan – a country that criminalises homosexuality, has non-existent press freedom, and denies the existence of COVID-19 within its borders. The 2022 Cyclocross World Championships have also <a href=\"https://cyclingtips.com/2021/04/walmart-heir-and-cycling-proponent-tom-walton-denounces-arkansas-anti-trans-legislation/\" target=\"_blank\" rel=\"noreferrer noopener\">come under scrutiny</a> due to anti-transgender healthcare legislation being mulled in Arkansas, the hosting state of the championships.&nbsp;</p>\n\n\n\n<p>The issue transcends cycling, too. The biggest sporting body of them all, the IOC, will face a torrid couple of years ahead, where it will be forced to reckon with the uncomfortable realities of the hosting nation of the 2022 Beijing Winter Olympics conducting an <a href=\"https://www.bbc.com/news/world-asia-china-22278037\" target=\"_blank\" rel=\"noreferrer noopener\">ethnic-cleansing program</a> against the Uyghur people and other minorities in Xinjiang.&nbsp;</p>\n\n\n\n<p>With three major cycling championships in less than a year receiving the wrong sort of public attention, there are growing calls for the sport’s governing bodies to do more to engage with questions of human rights. Cynics would argue that there has been little willingness to step up, beyond tokenistic statements on social media. Cycling’s sport administrators, by pursuing the apolitical path, risk being seen as apologists.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-1340x893.jpg\" alt=\"\" class=\"wp-image-511959\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00020776-227.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Military outside the Minsk velodrome. </figcaption></figure>\n\n\n\n<h2>Light and shade</h2>\n\n\n\n<p>Is sport ever just sport? Journalist Howard Cosell coined the phrase “sport is human life in microcosm” – a quote that is usually applied to encompass triumph over adversity, kinship among competitors, and personal achievement.&nbsp;</p>\n\n\n\n<p>But human life is light and shade.&nbsp;</p>\n\n\n\n<p>For the incarcerated activists of Belarus living under a proto-dictatorship, those dying of “pneumonia” in Turkmen hospitals, and the trans community of Arkansas facing discrimination, the question of whether a sporting body should “get involved in internal matters” is not an abstract concept. For them&nbsp;–&nbsp;and the integrity of cycling –&nbsp;it is a matter of life and death.&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/yet-again-bike-racing-and-human-rights-collide/\">Yet again, bike racing and human rights collide</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c759b969e70a02dba78aede42b10fade6486f6c7bb55686c090a94cbcd10e54e","category":"Cycling"}