{"title":"Sustainable aquaculture of West African freshwater prawns Macrobrachium vollenhovenii (Herklots, 1857) and M. macrobrachion (Herklots, 1851) (Decapoda: Caridea: Palaemonidae)","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae052/7758248?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The river prawn <span>Macrobrachium vollenhovenii</span> (Herklots, 1857) and the brackish river prawn <span>M. macrobrachion</span> (Herklots, 1851) are economically and ecologically significant West African species. Recent molecular studies suggest they might be different ecotypes of the same species, complicating taxonomy and sustainable aquaculture practices. Both species face significant threats from human exploitation, leading to high exploitation rates and smaller average sizes within populations. Seasonal variations affect their abundance, with <span>M. macrobrachion</span> more prevalent during the rainy season and <span>M. vollenhovenii</span> thriving in the dry season. Their omnivorous detritivorous feeding habits involve consuming detritus, diatoms, phytoplankton, and insect larvae during juvenile stages. Aquaculture of <span>M. vollenhovenii</span> and <span>M. macrobrachion</span> encounters difficulties such as limited hatchery technology and low larval survival rates. Efforts to cultivate juveniles or adults in captivity face obstacles like high mortality rates due to moulting stress, handling, feeding, and cannibalism. Reintroducing captive-bred prawns into the wild offers dual benefits: controlling snail populations that host parasite causing schistosomiasis and restoring ecological balance while enhancing local fisheries and providing socio-economic benefits. To achieve sustainable aquaculture, it is crucial to address taxonomic complexities, implement management measures to mitigate overexploitation, improve hatchery technology, optimise feeding strategies, reduce stress during moulting and handling, and engage local communities through capacity building and awareness programs. This review aims to contribute to a better understanding of these prawns, promoting informed decision-making for sustainable management, conservation, and socio-economic benefits in West Africa.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"c75d2b02fb98d0f25108f2d947595507a0e3433f1b17ae2c3aeb3b04fcb8b928","category":"Environment"}