{"title":"Beats เปิดตัวหูฟัง Studio Buds + พร้อมดีไซน์โปร่งใส และ ANC ที่ดีขึ้น เป็นมิตรกับ Android","link":"https://www.blognone.com/node/133890","date":1684392578000,"content":"<div><div><div><p>Beats by dre เป็นชื่อยี่ห้อหูฟังที่เรารู้จักกันดี ที่เมื่อปีก่อนได้ออกหูฟังแบบ Earbud มาแข่งในตลาดในนาม Studio Buds ในวันนี้ทาง Beats ก็ได้เปิดตัวรุ่นต่อมาอย่าง <strong>Studio Buds +</strong> ออกมาแล้วซึ่งเป็นการปรับปรุงคุณภาพหลาย ๆ อย่างไม่ว่าจะเป็น ประสิทธิภาพในการโทรที่ดีขึ้น, ระบบตัดเสียง Active Noise Cancelation (ANC) และ ความอึดแบตเตอรี่ โดยตัวเจ้า Studio Buds+ มีให้เลือก 3 แบบ ได้แก่สีดำ, สีทอง และ แบบโปร่งใส</p>\n<p>Beats Studio Buds+ นั้นรองรับ Spatial Audio ของ Apple ซึ่งจะทำให้ประสบการณ์การฟังเพลงใน Apple Music ดีขึ้น มีระบบ ANC ที่พัฒนาขึ้นดีกว่ารุ่นที่แล้วถึง 1.6 เท่า มีการปรับปรุงคุณภาพไมค์โดยใช้ intelligent voice-targeting algorithm ช่วยให้คุณภาพในการโทรดีขึ้น นอกจากนี้ยังรองรับระบบ Android เต็มรูปแบบไม่ว่าจะเป็น Google Fast Pair ที่ทำให้การเชื่อมต่อต่าง ๆ กับโทรศัพท์ทำได้เรียบเนียนไร้รอยต่อ และ Find My Device ที่ช่วยหาที่อยู่เวลาทำหูฟังตัวนี้หาย</p>\n<p>ทางด้านแบตเตอรี่ สามารถฟังเพลงได้ต่อเนื่อง 9 ชั่วโมง สำหรับการชาร์จจากในเคส 1 ครั้ง และ 36 ชั่วโมงสำหรับแบตเตอรี่ของตัวเคส โดยตัวเคสยังรองรับการ Fast Charge ที่นำหูฟังใส่เคสเพียง 5 นาที ก็จะสามารถฟังได้เป็นชั่วโมงอีกด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b3320dbbc37cff94430f516f05023824.jpg\" /></p>\n<p>ซึ่งการเปิดตัวของเจ้าหูฟังตัวนี้ก็มาพร้อมรีวิวจากหลายสำนักเช่นกัน</p>\n<p><a href=\"https://www.cnet.com/tech/mobile/beats-studio-buds-plus-review/\">The Verge</a> ได้ให้ความเห็นว่าเป็นหูฟังที่พัฒนาขึ้นจากรุ่นก่อนหน้าไม่ว่าจะเป็น คุณภาพเสียง, ANC, การโทร และแบตเตอรี่ที่ดีขึ้น แต่ระบบ ANC ยังสู้ AirPods Pro Gen 2 ไม่ได้ อีกทั้งไม่รองรับการชาร์จไร้สาย</p>\n<p><a href=\"https://www.theverge.com/23725921/beats-studio-buds-plus-earbuds-review-translucent-clear\">Cnet</a> ได้บอกว่า Studio Buds+ เป็นหูฟังที่มีน้ำหนักเบาพกพาสะดวก และเป็นหูฟังที่เป็นมิตรกับ Android แต่ก็ยังขาดในส่วน Head Tracking เวลาฟังแบบ Spatial Audio จากฝั่ง Apple</p>\n<p>โดย Beats Studio Buds+ วางจำหน่ายในราคา 5,700 บาท ซึ่งในไทยตอนนี้ระบุเพียงราคาแต่ยังไม่เปิดให้ซื้อแต่อย่างใดในเว็บไซต์ของ Apple</p>\n<p>ที่มา - <a href=\"https://www.xda-developers.com/beats-studio-buds-release/\">XDA Developers</a>, <a href=\"https://www.apple.com/th-en/shop/product/MQLK3PA/A/beats-studio-buds-true-wireless-noise-cancelling-earbuds-transparent?fnode=f592cd2a1509ac5d860978b3c64f49a0be3f08943af8f054d6667f60fb2473702b7b8df6588ecaa985186ab0e6bc9773da33e792db763e2cf6b0fad3f7f47ae492caa602633d1a7a1ee990a579e1b511b52dc13c40c671331ea583ff3a490009\">Apple</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/beats\">Beats</a></div><div><a href=\"/topics/spatial-audio\">Spatial Audio</a></div><div><a href=\"/topics/android\">Android</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c76ac8f3a63135e6a588ee7d8af6f5f1a22d15d3b0b799494f66330e3135a2e2","category":"Thai"}