{"title":"Beats Studio Buds review: Compact and comfortable, but missing a few features","link":"https://www.macworld.com/article/349333/apple-beats-studio-buds-review.html","date":1624449600000,"content":"\n<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Pretty affordable</li><li>Extremely compact and comfortable</li><li>Great music quality for the price</li></ul></div><div><h3>Cons</h3><ul><li>Noise-cancellation is just okay</li><li>Missing a few Apple-centric features</li><li>Mediocre microphone performance</li></ul></div></div></div><h3>Our Verdict</h3><p>The compact size, comfort, and excellent sound quality make these very appealing for the price. But iPhone users will find a few useful Apple ecosystem features missing, and the microphone quality could be better.</p>\n</div><h3>Price When Reviewed</h3><p>$149.99</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Beats</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>US$149.99</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.beatsbydre.com/earphones/studio-buds/add-to-cart&amp;xcust=1-1-349333-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/themes/idg-base-theme/dist/static/img/amazon-logo.svg\" /></div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>$149.95</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>Free</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B096SV8SJG?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t<div>\n\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>It didn’t take long for <a href=\"https://www.macworld.com/article/223466/apple-officially-acquires-beats-for-3-billion.html\">Apple’s acquisition of Beats in 2014</a> to pay off for iPhone users. Apple associating the Beats line with iPhones in ways that make sense, such as using the W1 and later the H1 chip in many Beats headphones and earbuds, comes with a lot of advantages, essentially turning the Beats line into a sort of side-AirPods brand with different styling and sound characteristics.</p>\n\n\n\n<p>The new Beats Studio Buds have a lot going for them, but do <em>not</em> include the H1 chip like you’ll find in the <a href=\"https://www.macworld.com/article/232756/powerbeats-pro-review-better-than-airpods-but-not-for-everybody.html\">Powerbeats Pro</a> or <a href=\"https://www.macworld.com/article/233472/beats-solo-pro-review.html\">Solo Pro</a>. You still get some Apple ecosystem features, but miss out on others. The comfort and sound quality are tremendous for the price, but Apple enthusiasts may want to consider if the tradeoffs are worth it.</p>\n\n\n\n<h2>Halfway to AirPods</h2>\n\n\n\n<p>Beats products with the H1 chip get most of the same Apple ecosystem features AirPods do. They are recognized by your iPhone with a pop-up card for instant pairing, and can show your headphone and case battery life. They can instantly switch to other Apple devices that are signed in with the same Apple ID. You can <a href=\"https://www.macworld.co.uk/how-to/share-audio-airpods-3782955/\">share audio</a> with two pairs of AirPods (or W1/H1-equipped Beats) from the same iPhone or iPad. You get spatial audio when watching supported surround-sound video or listening to Apple Music tracks with Dolby Atmos.</p>\n\n\n\n<p>The lack of an Apple-made chip in the Beats Studio Buds leaves them in an awkward place where you get <em>some</em> of these features, but not all. There’s no iCloud sync to instantly switch to other Apple devices. There’s no Spatial Audio when watching video since they don’t have the accelerometer/gyro required for head tracking. There’s no audio sharing. And there’s no in-ear detection, so your music doesn’t pause when you take out an earbud and start up again when you put it back.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/beats-studio-buds-control-center.jpeg?quality=50&amp;strip=all\" /><figcaption>Beats Studio Buds have noise cancellation controls in Control Center like AirPods do.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>In some ways, Beats Studio Buds <em>do</em> work like AirPods, though. You still get instant pairing with the info card and can see battery status once paired. Spatial Audio works automatically in Apple Music (though you can force it on with all headphones, so that’s not a big deal). They integrate into Control Center like AirPods, with noise-cancellation and transparency controls beneath the volume slider. You get hands-free “Hey, Siri” support. They even support Find My as AirPods do.</p>\n\n\n\n<p>It’s a strange mix of supported and unsupported Apple ecosystem features, but suffice it to say if you use a lot of Apple products and services, AirPods Pro are going to give you more of that “Apple magic.”</p>\n\n\n\n<h2>Better for Android users</h2>\n\n\n\n<p>If you use an Android phone at least some of the time or share your earbuds with someone who does, the Beats Studio Pro are maybe better-suited than the W1/H1-equipped Beats products are.</p>\n\n\n\n<p>The case charges with USB-C rather than Lightning (there’s no wireless charging), and they support the new Google Fast Pair standard to connect more easily. They also support Google’s Find My Device in addition to Apple’s Find My network.</p>\n\n\n\n<p>You may not get hands-free “Hey, Google” support, but this is still a more full-featured overall experience than you’ll get with most modern Beats products on an Android phone.</p>\n\n\n\n<h2>Design that disappears in your ears</h2>\n\n\n\n<p>I’m quite enamored with the design of the Studio Buds. The charging case is about the same size as that of the AirPods Pro, much smaller than Powerbeats Pro. The buds themselves are tiny, lightweight, and extremely comfortable.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/beats-studio-buds-in-ear.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The little earbuds are small, light, and don’t stick out very far, so they won’t dislodge too easily.</figcaption></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>They just slip right in your ear, with no stem sticking down, and without a big bulbous hump sticking out to catch on your winter hat. I was surprised to find they didn’t get uncomfortable at all over a couple of hours of listening, and they stayed in my ears just fine while skateboarding around my neighborhood and going for a light jog, though the fit loosened just a little as I got sweaty. They are splash and sweat resistant, but not waterproof.</p>\n\n\n\n<p>I have a problem maintaining a comfortable fit with AirPods Pro over long periods, while the Studio Buds just disappear in my ears and never seem to need adjustment.</p>\n\n\n\n<p>Beats promises an 8-hour battery life, with enough power in the case to recharge the buds twice. That seemed a little optimistic in my testing, but not too much—battery life is quite good. You’ll lose about a quarter of your battery life with noise cancellation enabled, but that’s to be expected.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/beats-studio-buds-settings.jpeg?quality=50&amp;strip=all\" /><figcaption>You can select what the long-press action does (Noise Control or Siri) for left and right ears, but cannot otherwise change how the buttons work.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>I also appreciate the physical button on each earbud. They’re actual clicky buttons rather than capacitive touch controls, which is better for winter hats and sweaty workouts. Apple is overthinking things with AirPods’ touch controls, and sometimes the old ways are best. The controls are the same on each ear, and follow the standard headphone control format–one click to play/pause, two to skip forward, three to skip back, and a long-press to toggle noise cancelling modes.</p>\n\n\n\n<h2>Impressive sound quality, for the price</h2>\n\n\n\n<p>Speaking of noise cancelling, it’s good but not as good as the AirPods Pro. Apple’s earbuds do a better job of eliminating outside traffic noise than these Beats ‘buds do, and the transparency mode sounds more natural as well. The noise cancelling is worthwhile, but a step behind the state of the art from Apple or Sony.</p>\n\n\n\n<p>Sound quality is quite good for such compact Bluetooth buds. They’re not as bass-heavy as some Beats products are, perhaps by design and perhaps as a consequence of the small earbud drivers. There’s still plenty of kick where it’s warranted, and the sound profile is better suited to modern pop, hip-hop, and R&amp;B than, say, classical or jazz.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/beats-studio-buds-earbud.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>These little buds put out some impressive sound quality. The call quality leaves a bit to be desired, though.</figcaption></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>On balance I would say I prefer the music reproduction quality in the Beats Studio Buds to that of the AirPods Pro. The Studio Buds just have a crisp sound that puts the sharp attack back into all those snaps and pops. Combine that with a more comfortable and steady fit, and I found spending time listening to music with these to be better than the AirPods Pro, despite the fact that these are priced over $100 less.</p>\n\n\n\n<p>That puts one in an odd position when it comes to recommending a product. I like the fit, music reproduction, and controls on the $149 Beats Studio Buds better than the $249 AirPods Pro. But they don’t have iCloud device syncing or instant switching, don’t do Spatial Audio when watching video, don’t have a wireless charging case, and don’t automatically pause when you take one earbud out.</p>\n\n\n\n<p>None of those are dealbreakers on their own, but together it’s enough to ensure that the AirPods Pro provide a nicer overall experience for those who use multiple Apple products and services. Is that worth $100 more? That depends on your priorities. All I know is that I enjoy the design of these Beats more than the AirPods or AirPods Pro, and hope Apple takes some lessons from their subsidiary when designing its next earbuds.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c774f45c5163f8c7d6d9915bd89b2c52b159ec9d5f1b459b4c8933481b99caf1","category":"Apple"}