{"title":"Shimano recall | Global ‘inspection and replacement’ process confirmed for affected 11-speed Dura-Ace and Ultegra cranks","link":"https://www.bikeradar.com/news/shimano-crankset-recall/","date":1695304571000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Shimano-cransket-main-8c77328-scaled.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Broken Shimano crankset\" title=\"Broken Shimano crankset\" />                                            <p>Shimano has issued a global recall of its Hollowtech 11-speed road cranksets, with more than 760,000 cranksets affected in the US and Canada alone.</p>\n<p>The recall applies to cranks sold over an 11-year period after a reported 4,519 incidents of cranksets separating.</p>\n<p>The United States Consumer Product Safety Commission (USCPSC) says the incidents have resulted in six injuries, “including bone fractures, joint displacement and lacerations”.</p>\n<p>The numbers above relate to the US and Canada recall, but official recalls will now follow in other regions. Crucially, however, Shimano has begun a “global safety and inspection and replacement programme”, expected to start from 1 October, for all customers with affected models.</p>\n<p>The recall affects the following models:</p>\n<ul>\n<li>Ultegra FC-6800</li>\n<li>Dura-Ace FC-9000</li>\n<li>Ultegra FC-R8000</li>\n<li>Dura-Ace FC-R9100</li>\n<li>Dura-Ace FC-R9100P</li>\n</ul>\n<p>The USCPSC recall affects “about 680,000” cranksets sold in the USA, manufactured prior to July 2019 and sold from January 2012 through August 2023. It covers a further 80,000 sold in Canada.</p>\n<p>The recall affects both cranksets specced on complete bikes and aftermarket.</p>\n<p>BikeRadar has previously reported on <a href=\"https://www.bikeradar.com/features/shimano-crank-failure/\">Shimano road cranksets delaminating</a>. However, this is the first time Shimano has acknowledged a widespread issue with its Hollowtech cranksets.</p>\n<p>Only owners of cranksets showing signs of “bonding separation or delamination during the inspection will be provided a free replacement crankset and installation”, according to Shimano.</p>\n<p>Shimano has set up an official helpline to assist consumers affected by the recall.</p>\n<p>International customers can call +31 792 077 017 between the hours of 9am and 9pm CET Monday to Friday, and from 9am to 5pm CET on Saturdays. The helpline is not open on Sundays.</p>\n\n<h2>Update 22/09/23 | Shimano issues ‘inspection and replacement’ process</h2>\n<p>Following the original recall announcement, Shimano has issued <a href=\"https://bike.shimano.com/en-EU/information/customer-services/corrective-actions/important-safety-notice-11-speed-hollowtech-road-cranksets-inspection-program.html\" target=\"_blank\">details of the ‘inspection and replacement process’</a>.</p>\n<p>“Shimano will have any applicable crankset inspected,” reads Shimano’s statement.</p>\n<p>“Shimano will replace any crank arm that fails the inspection process. This inspection is designed to determine whether the crank arms show a possible bonding separation issue and to swiftly remove any possible safety hazard to our consumers.”</p>\n<p>The process covers three steps, as below. Shimano has also published a video running through the process.</p>\n\n<ul>\n<li>Step 1: Determine whether your crankset needs to be inspected.\n<ul>\n<li>Step 1a: Identify the model number of your crankset.\n<ul>\n<li>Dura-Ace and Ultegra cranksets with the following model numbers are affected: Ultegra FC-6800, Ultegra FC-R8000 and Dura-Ace FC-9000, Dura-Ace FC-R9100 and Dura-Ace FC-R9100-P. Shimano says the model number is stamped on the inside of the crank arm near the bottom of the arm.</li>\n<li>If the model number <strong>does not</strong> match those above, no further action is needed.</li>\n<li>If the model number <strong>does</strong> match one of those above, proceed to step 1b.</li>\n</ul>\n</li>\n<li>Step 1b: Identify the manufacturing code stamped on your crank arm.\n<ul>\n<li>A manufacturing code is stamped on the inside of the crank arm near the bottom of the arm.</li>\n<li>Shimano says the affected models are pre-July 2019 production and have the following two-letter production codes: KF, KG, KH, KI, KJ, KK, KL, LA, LB, LC, LD, LE, LF, LG, LH, LI, LJ, LK, LL, MA, MB, MC, MD, ME, MF, MG, MH, MI, MJ, MK, ML, NA, NB, NC, ND, NE, NF, NG, NH, NI, NJ, NK, NL, OA, OB, OC, OD, OE, OF, OG, OH, OI, OJ, OK, OL, PA, PB, PC, PD, PE, PF, PG, PH, PI, PJ, PK, PL, QA, QB, QC, QD, QE, QF, QG, QH, QI, QJ, QK, QL, RA, RB, RC, RD, RE, and RF.</li>\n<li>If the manufacturing code <strong>does not</strong> match those above, no further action is needed.</li>\n<li>If the manufacturing code <strong>does</strong> match one of those above, proceed to step 2.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Step 2: Take the bicycle to the dealer for inspection.\n<ul>\n<li>Shimano says it expects inspections to be possible from 1 October 2023, with further details to be issued on the Shimano website. “Shimano has developed the crankset inspection process and will provide clear instructions and tutorials for dealers,” according to the brand.</li>\n<li>Shimano says the dealer will inspect the crankset for signs of bonding separation or delamination. Shimano adds: “Consumers whose cranksets show signs of bonding separation or delamination during the inspection will be provided a free replacement crankset from Shimano that the dealer will professionally install. If your crankset needs replacement following the inspection, please do not use it. If a replacement crankset is temporarily unavailable, Shimano will notify you through your dealer when the replacement is ready.”</li>\n<li>Shimano says “the replaced crankset will be a special version, which may feature a different cosmetic appearance while maintaining the same level of performance.”</li>\n<li>Customers outside of Europe should call the official Shimano Inspection Program helpline (+31792077017) for further information on how to proceed with the inspection.</li>\n</ul>\n</li>\n<li>Step 3: Ride safely and continue to maintain your bicycle/equipment\n<ul>\n<li>If your crankset passes the inspection, with no signs of delamination, Shimano says you can “continue to enjoy your ride”. Shimano adds: “We appreciate your patience and diligence in having the inspection completed.”</li>\n<li>Shimano has also issued further guidance, stating: “Have your bike tuned up and inspected regularly, ask your dealer for recommendations based on your riding habits. Pay attention to changes in the sound and feel of how your bike is riding. Shimano urges all users to thoroughly read the user manual provided with the product (and available online at: <a href=\"https://si.shimano.com/en/manual\">si.shimano.com</a> to ensure safe usage and proper maintenance. Shimano encourages all riders to maintain their bicycle and riding equipment diligently.”</li>\n</ul>\n</li>\n</ul>\n<h2>How will replacement cranks differ?</h2>\n<p>Because these models have now been discontinued, Shimano says an affected crankset will be replaced with a new one that “uses the latest construction and bonding techniques”.</p>\n<p>Shimano also notes these updated cranksets will have “slight cosmetic differences from the original crankset”, and in some cases “the exact specification may not be available”.</p>\n<p>The latter may refer to certain <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">crank length</a> options or chainring combinations that Shimano no longer manufactures.</p>\n<h2>What about cranksets with third-party power meters attached?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Stages Ultegra R8000 LR power meter crankset\" title=\"Stages Ultegra R8000 LR power meter crankset\" />\n\n</div><div><figcaption><span><i></i> Affected Shimano cranksets with third-party power meters attached are also included in this recall.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Any cranks “modified by third-parties are not covered by warranty, but as an exception they will be subject to this inspection”, according to Shimano.</p>\n<p>Cranksets that fail the inspection process will be replaced but without the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a> attached.</p>\n<p>Shimano says it will provide “a rebate in the form of a check”, which riders can put towards a replacement power meter crankset.</p>\n<p>At the time of writing, however, the rebate amount is not specified.</p>\n<section>\n    <div>\n        \n<h2>United States Consumer Product Safety Commission recall statement </h2>\n<p>The recall description listed on the United States Consumer Product Safety Commission site reads:</p>\n<p>This recall involves Shimano Ultegra FC-6800, Dura-Ace FC-9000, Ultegra FC-R8000, Dura-Ace FC-R9100 and FC-R9100P 11-Speed Bonded Hollowtech Road Cranksets manufactured prior to July 2019 sold individually and on bicycles sold by other manufacturers such as Trek and Specialized. </p>\n<p>A crankset is the component of the bicycle that the chain and pedals attach to for pedaling. The recalled models have printed ‘Ultegra’ or Dura Ace’ logos on the arm. </p>\n<p>The affected models are pre-July 2019 production and have the following two letter production code on backside of the crank arm where the pedals are attached: KF, KG, KH, KI, KJ, KK, KL, LA, LB, LC, LD, LE, LF, LG, LH, LI, LJ, LK, LL, MA, MB, MC, MD, ME, MF, MG, MH, MI, MJ, MK, ML, NA, NB, NC, ND, NE, NF, NG, NH, NI, NJ, NK, NL, OA, OB, OC, OD, OE, OF, OG, OH, OI, OJ, OK, OL, PA, PB, PC, PD, PE, PF, PG, PH, PI, PJ, PK, PL, QA, QB, QC, QD, QE, QF, QG, QH, QI, QJ, QK, QL, RA, RB, RC, RD, RE, and RF.”</p>\n<p>The USCPSC site list says consumers with an affected crankset “should immediately stop using the cranksets manufactured before July 1, 2019, and contact an authorized Shimano dealer to schedule a free crankset inspection. </p>\n<p>“Only consumers whose cranksets show signs of bonding separation or delamination during the inspection will be provided a free replacement crankset and installation.”</p>\n<p> </p>\n<p>\n\n    </p></div>\n    </section>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c781d1b608d1c849b203a4052a782f69b381b596c813f46abb550b19c1a0993a","category":"Cycling"}