{"title":"Experimental study on thermal performance of reverse flow solar collector for dual heating applications","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14492?af=R","date":1728910799000,"content":"<h2>Abstract</h2>\n<p>The present study investigated the performance of dual function reverse flow solar collector (RFSC). The impact of the mass flow rate of air and water on outlet temperature, thermal performance, and overall performance of dual-function solar air heater (SAH) has also been investigated. An experimental investigation of three different working models namely, Model-A: SAH, Model-B: solar water heater (SWH), and Model-C: integrated solar air-water heater (SAWH) for dual heating applications was performed to analyze the actual performance of these models. The investigation of the impact of time intervals on the water inlet and outlet temperatures at various mass flow rates of water is conducted to analyze the time-varying efficiency of SWH systems. Furthermore, the effect of solar intensity on the performance of the dual-function heating system has also been explained. The result reveals that the maximum thermal efficiency of Models: A and B can be achieved at about 78.8% and 67.9%, at a mass flow rate of 0.0644 and 0.10 kg/s, respectively, according to the experimental findings. The maximum temperature rise of air and water reaches about 52.4 and 55.58°C for Models A and B, respectively. The total efficiency of Model C reaches 81.69%, exceeding that obtained in Models A and B individually. The efficiency, outlet temperature of the fluid, and heat transfer effectiveness of the system strongly depend on the mass flow rate. The increase in heat removal factor is negligible for a higher flow rate (more than 0.10 kg/s).</p>","author":"Sohan Lal Sharma, \nAjoy Debbarma","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"c78538591f16128a92cf94662f8714e3cc24b9f30def9eda1bd9da982b082072","category":"Environment"}