{"title":"Integrated multi-omics approach revealed <i>TTNtv</i> c.13254T>G causing dilated cardiomyopathy in mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311670","date":1728050400000,"content":"<p>by Dan Yu, Liang Tao, Laichun Song, Kaisheng Lai, Hui Jiang, Zhe Liu, Hongyan Xiao</p>\r\n\r\nTitin-truncating variant (<i>TTNtv</i>) is the most common genetic cause of dilated cardiomyopathy (DCM). In the previous study, we found a novel heterozygous <i>TTN</i>tv c.13254T&gt;G (p.Tyr4418Ter) associated with DCM, but lacking functional evidence. The purpose of this study is to demonstrate the pathogenicity of <i>TTNtv</i> c.13254T&gt;G. We constructed a mouse model with <i>TTN</i>tv Y4370* on exon 45 by CRISPR/Cas9-mediated genome engineering to imitate the <i>TTN</i>tv. c.13254T&gt;G. Transmission electron microscope (TEM), immunohistochemistry, western blot (WB), Transcriptome sequencing (RNA-seq), and tandem Mass Tag (TMT) proteome analysis were performed on the mutant (KO) and WT mice cardiac tissue. Multi-omics association analysis was performed to observe the damages of cardiac tissue, and changes of inflammatory factors and Titin protein. TEM results showed that <i>TTNtv</i> Y4370* may lead to broken myofibrils, sparse myofilament structure, and broken Z-line and H-zone in many places of cardiac tissue of KO mice. Immunohistochemistry showed a significant increase in cTnT and TNF-α expression level in KO mice cardiac tissue. RNA-seq and TMT proteome enrichment analysis further strengthened that <i>TTNtv</i> Y4370* led to cardiac injury and inflammatory response in KO mice. In summary, <i>TTNtv</i> c.13254T&gt;G contributed to the cardiac injury, inflammatory response and construct alterations in mice, that is <i>TTNtv</i> c.13254T&gt;G may cause DCM in mice. These functional evidence of <i>TTNtv</i> c.13254T&gt;G have important significance for follow-up genetic research of DCM in human.","author":"Dan Yu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c790e62a0ccc30ed0f19c0e48d251612e3e8980022d49c40bc94738fa449ad3d","category":"Interdisciplinary"}