{"title":"Apparent ileal amino acid digestibility, gut morphometrics, and gene expression of peptide and amino acid transporters in broiler chickens fed low‐crude‐protein diets supplemented with crystalline amino acids with soybean meal, canola meal, or corn DDGS as protein feedstuffs","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13300?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>We investigated the impact of using canola meal (CM) or corn distillers dried grain soluble (cDDGS) in place of soybean meal (SBM) in low-crude-protein diets supplemented with amino acids (AA) on AA digestibility, gut morphometrics, and AA transporter genes in broiler chicken. On day 0, 540 Cobb 500 male broilers were allocated to six diets in 36-floor pens. The positive control (PC) was a corn-SBM diet with adequate crude protein (CP). The CP level of negative control (NC) was decreased by 45 and 40 g kg<sup>−1</sup> relative to PC for grower and finisher phases, respectively. The subsequent two diets had the same CP levels as NC but with cDDGS added at 50 or 125 g kg<sup>−1</sup>. The last two diets had the same CP as NC but with CM added at 50 or 100 g kg<sup>−1</sup>.</p>\n<h2>RESULTS</h2>\n<p>Dietary CP reduction in corn-SBM diets increased (<i>P</i> &lt; 0.05) the digestibility of Lys (88.5%), Met (90.7%), Thr (77.4%), Cys (80.7%), and Gly (84.7%). Increasing levels of cDDGS linearly decreased (<i>P</i> &lt; 0.05) the digestibility of Asp, Cys, Glu, and Ser, whereas increasing CM level linearly decreased (<i>P</i> &lt; 0.05) the digestibility of Cys, Pro, and Ser. The CP reduction in corn-SBM diets produced downward expression of peptide transporter1 and decreased (<i>P</i> &lt; 0.05) absolute pancreas and ileum weight and length of jejunum and ileum.</p>\n<h2>CONCLUSIONS</h2>\n<p>Partial replacement of SBM with alternative protein feedstuffs (cDDGS or CM) in low-CP diets had minimal effects on AA digestibility and mRNA levels of peptides and AA transporters. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Adeleye M Ajao, \nOluyinka A Olukosi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c79239628819f9ff7ca2249a3eafc9bc2362f55b4212b00cca935798a61e0927","category":"Environment"}