{"title":"Forecasting Temperature Trends Using SARIMAX: A Case Study in Ahmedabad City, India","link":"https://www.preprints.org/manuscript/202407.1521/v1","date":1721305670000,"content":"Globalization and industrialization have significantly disturbed the environmental ecosystem, leading to critical challenges such as global warming, extreme weather events, and water scarcity. Forecasting temperature trends is crucial for enhancing the resilience and quality of life in smart sustainable cities, enabling informed decision-making and proactive urban planning. This research specifically targets Ahmedabad city in India and employs the Seasonal Auto Regressive Integrated Moving Average with eXogenous factors (SARIMAX) model to forecast temperatures over a ten-year horizon using two decades of real-time temperature data. The stationarity of the dataset was confirmed using the Augmented Dickey-Fuller test, and the Akaike Information Criterion (AIC) method helped identify the optimal seasonal parameters of the model, ensuring a balance between fidelity and predictive accuracy. The model achieved an RMSE of 1.0265, indicating high accuracy within the typical range for urban temperature forecasting. This robust measure of error underscores the modelβ€™s precision in predicting temperature deviations, which is particularly relevant for urban planning and environmental management. The findings provide city planners and policymakers with valuable insights and tools for preempting adverse environmental impacts, marking a significant step towards operational efficiency and enhanced governance in future smart urban ecosystems. Future work may extend the model's applicability to broader geographical areas and incorporate additional environmental variables to refine predictive accuracy further.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c7932b887e719f9959ed8931b002a5ed34e92372257f310f99940b8915466e59","category":"Interdisciplinary"}