{"title":"Cannabinoids and Cardiac Rhythms: Unveiling the Relationship between Cannabis Use, ECG Changes, and Arrhythmias","link":"https://www.preprints.org/manuscript/202404.0575/v1","date":1712581362000,"content":"Understanding how cannabis affects our heart is like navigating through a maze of conflicting findings. While it's known for its diverse uses, from medicinal to industrial, cannabis also raises red flags regarding its impact on heart health. This review dives into the intricate relationship between cannabis use and cardiovascular well-being, particularly focusing on changes seen in electrocardiogram (ECG) readings, which serve as vital indicators of heart function and rhythm. When someone tokes up, their heart might race temporarily, but chronic cannabis use paints a darker picture, with potential risks of heart attacks and strokes looming on the horizon. The ECG alterations observed in cannabis users, such as irregular heartbeats and unusual wave patterns, hint at disruptions in the heart's normal workings. Furthermore, cannabis has been linked to prolonging the QT interval in the heart's electrical cycle, potentially setting the stage for dangerous arrhythmias. Amidst this mixed bag of effects, some studies even suggest that tiny amounts of THC, the main psychoactive component of cannabis, might lend a helping hand to the heart. However, caution flags are raised, especially for vulnerable groups. While researchers strive to unravel the mysteries of cannabis and the heart, limitations in current studies remind us that we're still far from having all the answers. Moving forward, future investigations should delve deeper into understanding how cannabis tinkers with our heart's inner workings, especially across different demographics. Armed with this knowledge, we can better tailor interventions to safeguard the heart health of cannabis users.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c79c1a706a1753378084a22b54ff929656e0a1593b89537af6857f3884ab2df2","category":"Interdisciplinary"}