{"title":"Safety and Efficacy of Incorporating Actellic 300CS into Soil Wall Plaster for Control of Malaria Vectors in Rural Northeastern Uganda","link":"https://www.preprints.org/manuscript/202408.2275/v1","date":1725026082000,"content":"Indoor residual spraying (IRS) and use of insecticide treated bed nets for malaria vector control have contributed substantially to reduction in malaria disease burden. However, these control tools have important shortcomings including being donor-dependent, expensive, and often fail because of insufficient uptake. We assessed the safety and efficacy of a user-friendly, locally tailored malaria vector control approach dubbed ‟House Decoration for Malaria Control” (HD4MC) based on incorporation of a WHO-approved insecticide, pirimiphos-methyl CS (Actellic 300CS), into a customary hut decoration practice in rural Uganda where millions of the most vulnerable and malaria-prone populations live in mud-walled huts. Three hundred and sixty households were randomly assigned to either HD4MC (120 households), IRS (120 households) or control group without any wall treatment (120 households). Entomological indices were assessed using pyrethrum spray catch, CDC Light traps and human landing catches. Organophosphate (OP) toxicity on acetyl cholinesterase activity among applicators of HD4MC was evaluated using Test-mate (Model 400) erythrocyte acetylcholinesterase (AChE) test V.2 whereas toxicity in household occupants was monitored clinically. OP level in house dust was analyzed using reversed-phase high-performance liquid chromatography (RP-HPLC). Entomological indices were compared between the 3 study arms at 1.5, 3- and 6-months post intervention. HD4MC- and IRS-treated huts had significantly reduced malaria vector density and feeding rate compared to control huts. There was no significant reduction in acetylcholinesterase activity at 1.5- and 24-hours post exposure. Organophosphate exposure did not result in any serious adverse event among the household occupants. In conclusion, HD4MC was safe and had comparable efficacy to canonical IRS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c79f46c2bc44f687f3bf53b07ec43e1e2a317b1448e71cc070fa17ba610aa64b","category":"Interdisciplinary"}