{"title":"452 Data-driven strategic sustainability initiatives of beef and dairy genetics consortiums: A comprehensive landscape analysis for USA, Brazil, and Europe","link":"https://academic.oup.com/jas/article/102/Supplement_3/321/7757133?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The past two decades have witnessed beef and dairy genetic consortiums implementing data-driven germplasm propagation programs in global cattle systems. These programs optimize for multi-dimensional economic, environmental, and animal welfare related sustainability goals and are driven by consumer demands and shifts in supply chains. To summarize these programs and gain insights into the sustainability journey of industry, we did a comprehensive landscape analysis of the strategic initiatives of key global genetics companies, their germplasm offerings, and data platforms offered in three major cattle producing geographies, namely the USA, Brazil, and Europe. Within these locales, they followed selection index-based genomic and reproductive management strategies for both beef, dairy, and beef-on-dairy production, tailored to relevant market and climatic conditions (Figure 1). While individual traits in selection indices ranged between 40 to 90 traits, all traits could be broadly grouped into three: namely production, longevity, health and reproduction. In the USA, companies like ABS Global, Select Sires, Genex Cooperative, STGenetics, Zoetis, Vytelle offer genomic selection programs encompassing germplasm products, and genetic and production data tracking platforms across the beef, dairy, and beef-on-dairy value chains. These companies have implemented reproductive management programs such as in-vitro fertilized embryo transfer, sexed semen, along with genomic selection with a focus on future replacements based on multi-trait sustainability indices. These initiatives are customized for each of the cow-calf, backgrounding, and feedlot sector of beef production. In dairy, these companies have diversified data-driven production programs customizable to conventional and organic production systems. In Europe, companies like CRV, Viking Genetics, and Alta Genetics prioritize traits related to resource efficiency, animal welfare and environmental impact. Semen companies also offer data management tools tailored to European market requirements, alongside services for on-farm semen production and storage to reduce transportation-related emissions. In Brazil, companies such as ABS Pecplan, CRV Brazil, and Semex Brazil, developed herd management solutions focusing on traits like heat tolerance, tropical environmental adaptability, and disease resistance. The landscape analysis revealed a dynamic industry, evolving to meet sustainability goals and market demands. These enterprises collaborate with stakeholders across the value chain, including producers, policymakers, and industry associations, to scale data-driven production systems that balance profitability and environmental footprint of cattle production. As such, they have positioned themselves to capitalize on the growing interest in sustainable livestock production practices worldwide by aligning scientific and technical strategies with evolving regulatory requirements and consumer demands. The global cattle industry is positioned to venture forward by leveraging niche carbon markets and new marketing channels propelled by emerging principles of environmental, social, and corporate governance. Strategic germplasm and data-tracking platform initiatives by these groups thus become an integral part of the livestock sustainability solution palette and will contribute its share to a climate-neutral Earth by 2050.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c7b1c414e443f30d5ef7b69e825bb41772a0510f4cb0c5ef78a55a2cb4fab447","category":"Environment"}