{"title":"Green synthesis and characterization of silver anchored ZnO nanoparticle as the antimicrobial reinforcement for polylactide films","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400029?af=R","date":1716785390000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f46d6278-cef3-4ecd-9c42-94496e866ba1/appl202400029-gra-0001-m.png\" alt=\"Green synthesis and characterization of silver anchored ZnO nanoparticle as the antimicrobial reinforcement for polylactide films\" /><p>Extract of <i>Periconia</i> sp. fungus was used to anchor AgNP on the ZnO as a greener approach. AgNP@ZnO nanoparticle exhibited superior antimicrobial activity than pristine ZnO. AgNP@ZnO was used as the antimicrobial reinforcement in PLA-based composite films. Composite films showed superior antimicrobial activity with increasing AgNP@ZnO loading.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The aqueous extract of endophytic fungi (<i>Periconia</i> sp.) was effectively used as a reducing agent to anchor Ag nanoparticles on the ZnO surface. The XRD, UV-Vis, SEM-EDX and TEM analyses were performed to ensure the formation of AgNP@ZnO architecture. TEM analysis confirmed that the 4–20 nm sized Ag nanoparticles were anchored evenly on the surface of ZnO with 16–78 nm in size. The antimicrobial study showed the superior performance of AgNP@ZnO functional nanoparticles than the pristine ZnO against pathogenic bacteria <i>Staphylococcus aureus</i> (gram-positive) and <i>Escherichia coli</i> (gram-negative). Hence, AgNP@ZnO functional particles were effectively explored as antimicrobial reinforcement for fabricating composite films using polylactic acid (PLA) as a matrix. The obtained nanocomposite films showed excellent antibacterial activity, which increases with increasing AgNP@ZnO loading.</p>","author":"Vellaiyan Ganesan, \nMuruganandham Hariram, \nSingaravelu Vivekanandhan, \nSankaralingam Muthuramkumar","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"c7b6704b934a0ece14a38430e77e15af84ee714dd4637425c5e96eb44bae133e","category":"Environment"}