{"title":"How to use your Mac’s Wi-Fi menu to sort out weak areas of Wi-Fi coverage","link":"https://www.macworld.com/article/349645/how-to-use-your-macs-wi-fi-menu-to-sort-out-weak-areas-of-wi-fi-coverage.html","date":1625216400000,"content":"\n<div>\n<section><div></div></section><p>If your household is like ours, you probably added Wi-Fi base stations in 2020. We went from four to six to improve coverage across our house and fill in dead zones we didn’t know existed until kids or adults were trying to participate in Zoom or Teams classes or meetings from them. And we have a tiny house.</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-hidden-wifi-details-macos.png?w=574\" /><figcaption>The hidden Wi-Fi menu offers a lot of technical detail, some of which is useful for troubleshooting poor Wi-Fi service in your home.</figcaption></figure></div></div>\n\n\n\n<p>You may sometimes feel walking around with an iPhone or Mac laptop that you’re “dowsing” for Wi-Fi. Fortunately, we have more quantifiable measures for Wi-Fi, but they’re hidden from plain view. A Mac laptop will provide you the best information. (You can install Wi-Fi signal-strength apps on an iPhone, but they aren’t as useful as the built-in hidden macOS.)</p>\n\n\n\n<p>Hold down the Option key and click the Wi-Fi menu on your system menu bar. If you don’t see a Wi-Fi menu icon, with macOS 10.15 Catalina click the Control Center and then Option-click the Wi-Fi item. (You can change whether this menu appears in the Network preference pane with your Wi-Fi adapter selected in the list at left. Check or uncheck “Show Wi-Fi status in menu bar.”)</p>\n\n\n\n<p>The resulting details may seem like too much, but only a few items matter in terms of figuring out performance issues. I offer suggestions at the bottom on improving your network.</p>\n\n\n\n<p>You can move around in potential low-speed or dead areas with the Option-clicked menu exposed and watch the values shown change dynamically to make sure initial readings weren’t an anomaly.</p>\n\n\n\n<h2>Tx Rate and PHY Mode</h2>\n\n\n\n<p>Near the bottom of the details, the Tx Rate indicates the raw data rate of the connection you have to the base station your Mac has connected to, as well as the protocol it’s “negotiated,” listed as the PHY Mode. (PHY is the physical layer or the actual form in which data is transferred back and forth, whether over wires or wirelessly.)</p>\n\n\n\n<p>Apple isn’t yet using the newer naming scheme for Wi-Fi, adopted a few years ago, which replaces the IEEE industry standards group’s 802.11 lettering system with a more consumer-friendly version. The Wi-Fi Alliance certifies Wi-Fi devices, and its simplified version is Wi-Fi 4 for 802.11n, Wi-Fi 5 for 802.11ac, and Wi-Fi 6 for 802.11ax.</p>\n\n\n\n<p>You’ll find 802.11ac (Wi-Fi 5) in nearly all Apple devices of the last several years and the somewhat faster and more bandwidth-efficient 802.11ax (Wi-Fi 6) in all new series of Apple devices: iPhone 11 and 12 models, the iPad Pro 4th generation and later, and all Apple silicon M1 Macs.</p>\n\n\n\n<p>Wi-Fi falls back to the fastest rate that both your Mac and the base station can agree on with the most efficient version of Wi-Fi they both support. For instance, in its specs for an M1 MacBook Air, Apple notes that it supports “802.11ax Wi-Fi 6 wireless networking” but that it’s “IEEE 802.11a/b/g/n/ac compatible.”</p>\n\n\n\n<p>Your base stations may only handle Wi-Fi 5—as all of mine do—which is fast enough for most home purposes, including handling a lot of streaming video from videoconferencing apps and online streaming services like Netflix and Hulu. In the figure in this article, you can see my iMac connected at 1.3 Gbps to a nearby base station. With enough density of base stations across your home, it should work as if you had between 100 Mbps and 1 Gbps Ethernet, meaning you’re more likely constrained by your Internet connection than local network speeds.</p>\n\n\n\n<p>However, if you see numbers like 54 Mbps to 433 Mbps or standards next to PHY Mode of 802.11a, 802.11g, or 802.11n, the spot you’re in likely needs some boost. If the connection rate drops off to nothing or nearly nothing, you need to fill in the gap.</p>\n\n\n\n<h2>Channel</h2>\n\n\n\n<p>You can watch the Channel display for more information, too. The term “channel” in wireless communications refers to a range of radio frequencies with a beginning and ending points that your base station uses to communicate with devices. The “width” of a channel determines in part how much data can be sent over it. Interference from other Wi-Fi devices and unrelated equipment reduces throughput as the base station and its connected clients try to be “heard” over the noise.</p>\n\n\n\n<p>In the U.S., Wi-Fi can be transmitted and received over both the 2.4GHz band, which has 11 overlapping channels, and the 5GHz band, which has dozens. Nearly all hardware sold by Apple, other computer and mobile makers, and base station manufacturers over the last several years include both bands. A device, like a Mac or iPhone, picks the strongest signal in one band or the other automatically. A base station has two or more radio systems and transmits over both bands simultaneously. Some routers designed for super-high throughput will have one 2.4GHz radio and <em>two</em> 5GHz radios.</p>\n\n\n\n<p>The 2.4GHz band is crowded with other purposes and lots of older Wi-Fi devices and has other constraints, such as maximum signal transmission power. The overlapping channels also mean that base stations can be “talking” nearly over each other, which reduces throughput.</p>\n\n\n\n<p>The 5GHz band is mostly used for Wi-Fi. The U.S. and many other countries cleared out huge swaths of it to allow lots of channels, none of which overlap. As a result, Wi-Fi networks can use wider swaths of frequencies, allowing faster speeds. The Wi-Fi 4, 5, and 6 standards all allow dynamic channel widths: if there’s enough “silence” around a given a channel—no detected signals adjacent to it—the base station will open up and use a wider channel, leading to higher throughput.</p>\n\n\n\n<p>In the Channel item in the Wi-Fi details menu, macOS display a channel number—like 36 or 155—that you can disregard. This number was useful in the past as you might tune your base station by selecting specific channels. For years now, however, base stations automatically pick the best channels in each band for clear transmission, and can even switch to another without intervention.</p>\n\n\n\n<p>In parentheses, you also see something like “(5GHz, 80MHz)”. The “5GHz” is good because your Mac is connected to that faster band. The “80MHz” means it’s using four times the minimum available channel bandwidth of 20MHz. That’s how the connection shown in figure achieves a raw speed of 1,300 Mbps.</p>\n\n\n\n<p>The downside to 5GHz is that as a higher-frequency band, signals travel shorter distances at the same signal power as when they are in 2.4GHz. So your Mac might not be able to connect to a base station’s 5GHz radio but could to the base station’s 2.4GHz one.</p>\n\n\n\n<p>A 2.4GHz connection means lower throughput. If you consistently see either 2.4 Hz or 5GHz paired with 20MHz or 40MHz, you can almost certainly do better.</p>\n\n\n\n<h2>BSSID</h2>\n\n\n\n<p>Wi-Fi networks automatically sort themselves out by network name. Every base station with the same network name, encryption method, and password appear as a single entity in macOS, iOS, iPadOS, Android, and Windows, as well as on gaming devices and most other equipment. Treating multiple base stations as a single entity allows devices to roam among them. Your Mac or iPhone switches its connection silently from one base station to another as signal strength ebbs and it finds a stronger signal.</p>\n\n\n\n<p>The only way to tell same-named base stations apart is by the BSSID or Basic Service Set Identifier. This number looks just like an ethernet or Wi-Fi MAC (Media Access Layer) address, a unique number assigned to an adapter or interface during manufacture that lets it identify itself across an Ethernet or Wi-Fi network. (Without a unique address, devices couldn’t have data routed to or from them over a network.)</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-tether-app-wifi-bssid.png?w=674\" /><figcaption>The Tether app reveals the unique network addresses (BSSIDs) of base station for further troubleshooting.</figcaption></figure></div></div>\n\n\n\n<p>It’s worth knowing the BSSID address in this case because it lets you figure out to which base station among many that your Mac has connected. As I mentioned above, I now have six base stations in the house. One is a necessary piece of equipment from our broadband provider, and we don’t use its Wi-Fi; the other five form a network. We had three gateways connected by ethernet in our house before the start of the pandemic and added two wireless extenders during 2020.</p>\n\n\n\n<p>When I’ve tried to troubleshoot throughput or other problems, that BSSID turns out to be very useful. We switched over 2020 entirely to TP-Link equipment, which has a unified app called Tether to manage its Wi-Fi gear and smart-home equipment. In Tether’s device list I can see the BSSIDs for the five base stations in use.</p>\n\n\n\n<p>Why does this matter? At times, I’ve been in the kitchen and measured extremely poor Wi-Fi performance. (Sometimes I like to read the newspaper on my phone at our kitchen counter!) When I check the BSSID, I see that my iPhone has connected to a base station a few rooms away, instead of the one nearer. The reason is sometimes that the wireless extender has lost its connection to a wired base station, and sometimes it’s just the vagaries of Apple’s operating systems, which don’t always give up a weak connection to find a better one. Turning Wi-Fi off and back on often fixes the problem.</p>\n\n\n\n<h2>Solving weak spots</h2>\n\n\n\n<p>Options abound for improving your Wi-Fi network:</p>\n\n\n\n<ul><li><strong>Add a wireless extender.</strong> These devices are inexpensive, connect to any wired base station in your network, and often deliver good to excellent performance. They can cost as little as $25 to $75 depending on the fastest version of Wi-Fi they support.</li><li><strong>Add a wired base station.</strong> If you have structured wiring, ethernet jacks, or can string new ethernet wiring safely, you will spend the least by adding a wired base station to add coverage and improve throughput. You can install powerline networking instead of extending or building out ethernet. Powerline networking encodes data over your home electrical wiring, and you need at least two of them. They typically sport one or more ethernet jacks. A pair costs about $50 to $100. (That’s how we turned a wireless extender into a wired one: using paired <a href=\"https://www.amazon.com/dp/B08M13B8B6?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">1 Gbps TP-Link AV1000-compatible models</a> [street price of $55] between two locations that would have been expensive or impossible to install an Ethernet run.)</li><li><strong>Switch to mesh networking.</strong> We’ve <a href=\"https://www.techhive.com/category/network-router/\">written extensively at TechHive</a> about mesh networking systems, designed to connect wirelessly to each other and give you feedback as you place the base stations (called nodes) for optimum coverage. You can achieve good to excellent throughput and coverage, but mesh nodes cost somewhat or quite a bit more than more traditional Wi-Fi gear.</li></ul><h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c7c5067695c95e003ebc83899de32602c00a6aeb9a70c5442a2657d33cc0a731","category":"Apple"}