{"title":"Tex46 knockout male mice are sterile secondary to sperm head malformations and failure to penetrate through the zona pellucida","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae108/7626722?rss=1","date":1710201600000,"content":"<span><div>Abstract</div>Each year, infertility affects 15% of couples worldwide, with 50% of cases attributed to men. It is assumed that sperm head shape is important for sperm-zona pellucida (ZP) penetration but research has yet to elucidate why. We generated testis expressed 46 (<span>Tex46</span>) knockout mice to investigate the essential roles of TEX46 in mammalian reproduction. We used RT-PCR to demonstrate that <span>Tex46</span> was expressed exclusively in the male reproductive tract in mice and humans. We created <span>Tex46</span><sup>−/−</sup> mice using the Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)-CRISPR-associated protein 9 (Cas9) system and analyzed their fertility. <span>Tex46</span> null spermatozoa underwent further evaluation using computer-assisted sperm analysis, light microscopy, and ultrastructural microscopy. We used immunoblot analysis to elucidate relationships between TEX46 and other acrosome biogenesis-related proteins. Mouse and human TEX46 are testis-enriched and encode a transmembrane protein which is conserved from amphibians to mammals. Loss of the mouse TEX46 protein causes male sterility primarily due to abnormal sperm head formation and secondary effects on sperm motility. <span>Tex46</span> null spermatozoa morphologically lack the typical hooked sperm head appearance and fail to penetrate through the ZP. Electron microscopy of the testicular germ cells reveals malformation of the acrosomal cap, with misshapen sperm head tips and the appearance of a gap between the acrosome head and the nucleus. TEX46 is essential for sperm head formation, sperm penetration through the ZP, and male fertility in mice, and is a putative contraceptive target in men.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"c7caf0f3fa87aee298cdf1c21fd28f7bea36bc68f81072f3e1c35545fce4379a","category":"Interdisciplinary"}