{"title":"Visual perception of highly memorable images is mediated by a distributed network of ventral visual regions that enable a late memorability response","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002564","date":1711980000000,"content":"<p>by Benjamin Lahner, Yalda Mohsenzadeh, Caitlin Mullin, Aude Oliva</p>\r\n\r\nBehavioral and neuroscience studies in humans and primates have shown that memorability is an intrinsic property of an image that predicts its strength of encoding into and retrieval from memory. While previous work has independently probed when or where this memorability effect may occur in the human brain, a description of its spatiotemporal dynamics is missing. Here, we used representational similarity analysis (RSA) to combine functional magnetic resonance imaging (fMRI) with source-estimated magnetoencephalography (MEG) to simultaneously measure when and where the human cortex is sensitive to differences in image memorability. Results reveal that visual perception of High Memorable images, compared to Low Memorable images, recruits a set of regions of interest (ROIs) distributed throughout the ventral visual cortex: a late memorability response (from around 300 ms) in early visual cortex (EVC), inferior temporal cortex, lateral occipital cortex, fusiform gyrus, and banks of the superior temporal sulcus. Image memorability magnitude results are represented after high-level feature processing in visual regions and reflected in classical memory regions in the medial temporal lobe (MTL). Our results present, to our knowledge, the first unified spatiotemporal account of visual memorability effect across the human cortex, further supporting the levels-of-processing theory of perception and memory.","author":"Benjamin Lahner","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"c7d0fad5d2cb6005f0a5765624b4404636570c091c8f126c8c8b4a22d505779f","category":"Environment"}