{"title":"Auto-aim cheatmaker halts development at Activision’s request","link":"https://arstechnica.com/?p=1780140","date":1626279355000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/cv7-980x481.png\" /></div>\n        <p>\n          A sample video shows how computer vision (running on an external computer) detects an enemy and calculates how far the mouse needs to move to target that enemy.                  </p>\n        </div>\n      </li>\n      </ul><p>The makers of a machine-learning-powered auto-aim cheat tool have halted development and taken down their website \"at the request of Activision Publishing.\" That's according to a message <a href=\"https://www.userviz.com/\">posted on the User Vision website,</a> in which developer USER101 promises the group \"will no longer be developing or providing access to software that could be used to exploit [Activision]'s games. My intent was never to do anything illegal.\"</p>\n<p>Previous versions of the User Vision software offered more basic cheating functions like \"recoil adjustment\" that automatically steadies a player's aim and a \"trigger bot\" that shoots automatically when an enemy is detected in the player's crosshairs. Last week, though, the makers of User Vision <a href=\"https://arstechnica.com/gaming/2021/07/cheat-maker-brags-of-computer-vision-auto-aim-that-works-on-any-game/\">started promoting</a> a future version that would provide \"full auto-aim [and] full auto-shots\" on \"any game\" for PC, Xbox, or PlayStation.</p>\n<p>User Vision's proposed auto-aim cheat was designed to work without any modifications to the hardware or software running the game itself, thanks to a combination of external capture cards, <a href=\"https://pjreddie.com/darknet/yolo/\">machine-learning algorithms</a> to detect enemies, and <a href=\"https://www.consoletuner.com/products/titan-two/\">external hardware to emulate user input</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1780140#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780140&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c7e3370b80f672c1483e5ac0d522563284a539c05d186d5b695ae16e0baa303a","category":"Tech"}