{"title":"Associations Between Anthropogenic Factors, Meteorological Factors, and Cause‐Specific Emergency Department Admissions","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024GH001061?af=R","date":1725516272000,"content":"<h2>Abstract</h2>\n<p>Unpredictable emergency department (ED) admissions challenge healthcare systems, causing resource allocation inefficiencies. This study analyses associations between air pollutants, meteorological factors, and 2,655,861 cause-specific ED admissions from 2014 to 2018 across 12 categories. Generalized additive models were used to assess non-linear associations for each exposure, yielding Incidence Rate Ratios (IRR), while the population attributable fraction (PAF) calculated each exposure's contribution to cause-specific ED admissions. IRRs revealed increased risks of ED admissions for respiratory infections (IRR: 1.06, 95% CI: 1.01–1.11) and infectious and parasitic diseases (IRR: 1.09, 95% CI: 1.03–1.15) during increased rainfall (13.21–16.97 mm). Wind speeds &gt;12.73 km/hr corresponded to increased risks of ED admissions for respiratory infections (IRR: 1.12, 95% CI: 1.03–1.21) and oral diseases (IRR: 1.58, 95% CI: 1.31–1.91). Higher concentrations of air pollutants were associated with elevated risks of cardiovascular disease (IRR: 1.16, 95% CI: 1.05–1.27 for PM<sub>10</sub>) and respiratory infection-related ED admissions (IRR: 2.78, 95% CI: 1.69–4.56 for CO). Wind speeds &gt;12.5 km/hr were predicted to contribute toward 10% of respiratory infection ED admissions, while mean temperatures &gt;28°C corresponded to increases in the PAF up to 5% for genitourinary disorders and digestive diseases. PM<sub>10</sub> concentrations &gt;60 μg/m<sup>3</sup> were highly attributable toward cardiovascular disease (PAF: 10%), digestive disease (PAF: 15%) and musculoskeletal disease (PAF: 10%) ED admissions. CO concentrations &gt;0.6 ppm were highly attributable to respiratory infections (PAF: 20%) and diabetes mellitus (PAF: 20%) ED admissions. This study underscores protective effects of meteorological variables and deleterious impacts of air pollutant exposures across the ED admission categories considered.</p>","author":"Pranav Tewari, \nBaihui Xu, \nMa Pei, \nKelvin Bryan Tan, \nJohn Abisheganaden, \nSteve Hung‐Lam Yim, \nBorame Lee Dickens, \nJue Tao Lim","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"c7e346ad4a6401bbd43ba81e56c1ee11fa531e7d192cca6652d9c7e9e969c885","category":"Environment"}