{"title":"Comparing skin swabs, buccal swabs, and toe clips for amphibian genetic sampling, a case study with a small anuran (Acris blanchardi)","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae030/7675470?rss=1","date":1715817600000,"content":"<span><div>Abstract</div>Multiple methods for collecting genetic samples from amphibians exist, each with their own implications for study design, animal welfare, and costs. Toe clipping is one common method, but there is ongoing debate regarding its potential detriment. Less invasive methods should be implemented, if efficacious, as amphibians are a particularly vulnerable vertebrate group. Skin and buccal swabbing are less invasive methods for genetic sampling, but the potential for contamination and a lower yield of DNA may exist. To compare these methods, we gathered skin swabs, buccal swabs, and toe clips from the same individuals of a relatively small anuran species, Blanchard’s Cricket Frog (<span>Acris blanchardi</span>). We then compared DNA yield, DNA purity, amplification success rate, and genotypic data quality among sample types. We found toe clips and buccal swabs generated similar DNA yield and purity, with skin swabs yielding significantly less DNA of significantly lower purity than the other sample types. Amplification success rate was significantly higher using toe clips compared to the other sample types, though buccal swab samples amplified more readily than skin swabs. Genotypic data from toe clips and buccal swabs did not differ significantly in quality, but skin swab data quality was significantly lowest among sample types. Thus, skin swabbing could produce erroneous data in some situations, but buccal swabbing is likely an effective substitute to toe clipping, even for small species. Our results can help future researchers select which genetic sampling method might best suit their research needs.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"c7e68220c759bf20ecabca3968d001ffd51d9378fadc9127b9c5a59bf02c4ba6","category":"Environment"}