{"title":"700c wheels explained: the history of road cycling’s go-to wheel size","link":"https://www.bikeradar.com/advice/buyers-guides/700c-wheels/","date":1639483230000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/10/Terra-CLX-1-e1c748f.jpg?quality=45&amp;resize=620,413\" />                                            <p>There’s a bewildering array of different ‘standards’ for bike components, with new ones appearing almost every year. But one that’s been around for many years is the 700c wheel, found on pretty much every road bike and many hybrids.</p>\n<p>What does 700c signify, why is it important and why is its domination being challenged, in some quarters, by other wheel size options?</p>\n<h2>What is a 700c wheel?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> 700c wheels are fitted as standard on road bikes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The majority of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bikes</a> use 700c wheels, although actually, the name doesn’t denote anything with any great accuracy.</p>\n<p>The 700 part refers to the approximate diameter across the wheel of the outside of the tyre in millimetres.</p>\n<p>A tyre’s real outside diameter will differ depending on factors such as how wide it is. A 28mm tyre will typically have a larger outside diameter than a 23mm tyre when mounted on a rim with the same internal width, while the tyre’s profile will also affect the overall diameter slightly.</p>\n<p>It used to be that all 700c wheels had roughly the same, narrow internal width to their rims, but now there’s quite a range of rim widths for <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">road bike wheels</a>, from under 15mm up to 25mm plus, which will affect how large the outside diameter of the tyre ends up.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The internal rim width on the Hunt Aerodynamicist 54 wheel is 21mm, but wider or narrower rims will shape tyres differently.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>The more useful number is the diameter of the wheel between the bead seats for the tyre. That’s controlled by ISO standard 5775 and is 622mm for 700c wheels.</p>\n<p>That’s important since it means that any tyre designed for 700c wheels should fit on any 700c rim, although as anyone who’s used a range of wheels and tyres will tell you, how tight that fit is can vary significantly.</p>\n<h2>Why c?</h2>\n<p>Having established that the “700” bit doesn’t mean all that much on today’s bikes, let’s turn to the “c”. Perhaps unsurprisingly, this part is dated and doesn’t denote much either.</p>\n<p>In times gone by, there were 700a, 700b and 700d wheels around, too. Cyclists would swap between a, b, c and d wheels depending on what they were using them for, with 700c and 700d kept for racing and the wider 700a and 700b wheels used for training on the rougher, often unpaved surfaces of the early 20th century.</p>\n<p>Because they all ended up with around the same tyre outside diameter of 700mm, 700a, 700b and 700d wheels had different bead seat diameters from 700c, so you needed different tyres to fit each.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Old wheel standards with different bead seat diameters meant different tyre sizes would fit in the same frame.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>The good news was that you could be pretty sure they’d all fit in your frame.</p>\n<p>However, it’s a bit of a hassle for the rider and the tyre manufacturer, so European wheel and tyre makers settled on 700c as the best standard for wheels to be used on road bikes on the improving road surfaces of the time, and ceased production of 700a, b and d rims and tyres.</p>\n<p>As an aside, UK road bikes often used to come with 27in rims and tyres, but they’ve gone the same way as 700a, etc.</p>\n<h2>Are 700c wheels the same as 29-inch wheels?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> 29-inch and 700c: different names for the same thing.</span></figcaption><span> <i>Warren Rossiter / Immediate Media</i></span></div>\n<p>Mountain bikes had their origin in the United States, and so their measurements are typically in inches, from frame size through to wheel size (the same goes for <a href=\"https://www.bikeradar.com/advice/buyers-guides/guide-to-kids-bike-wheel-sizes/\">kids’ bike wheel sizes</a>).</p>\n<p>Originally, as explained in our piece on <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">mountain bike wheel sizes</a>, they came with 26in wheels.</p>\n<p>That’s changed over the past decade, so the majority of modern mountain bikes now come either with 29in or 27.5in wheels. These two sizes are equivalent to 700c and 650b wheel sizes expressed in the European ETRTO wheel size designations and have the same bead seat diameters.</p>\n<p>With that in mind, 29in <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">mountain bike tyres</a> should fit (in terms of diameter) on 700c rims and 700c tyres on 29er rims.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Road and MTB freehubs may look similar, but the road standard is longer.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>In reality, the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-wheels/\">best mountain bike wheels</a> tend to have wider rim beds than road-going wheels, to support the much wider tyres (measured in inches rather than millimetres) found on mountain bikes, so the two are not quite interchangeable.</p>\n<p>Note, too, that the standard Shimano/SRAM freehub and the SRAM XD freehub of a mountain bike wheel are slightly narrower than on a road wheel, so a road bike cassette won’t fit on an MTB wheel and an MTB cassette needs a spacer to fit on a road bike freehub.</p>\n<div></div>\n<h2>700c vs 650b wheel sizes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Open’s Unbeaten Path was the first gravel bike to popularise designing around 700c and 650b wheels.</span></figcaption><span> <i>David Rome / Immediate Media</i></span></div>\n<p>Once it had seen off 700a, b and d, 700c pretty much ruled the roost for drop-bar road bikes. The wheel size is found on many of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">best hybrid bikes</a> too, although some come with smaller wheel sizes.</p>\n<p>The same was true of the first crop of gravel bikes, typically seen with 700c wheels, but now gravel bikes often come with 650b wheels.</p>\n<p>Remember, 650b is the same as a 27.5in mountain bike wheel and allows riders to fit wider <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">gravel tyres</a>, and still have a similar outside diameter to the tyre as a 700c wheel fitted with a narrower tyre.</p>\n<p>That means that you can retain a similar frame geometry and thus handling, although the frame has to be built for wider tyre clearances. You end up with equivalent gearing from your groupset as well, because the wheel diameter affects how far you’ll travel for each turn of the pedals.</p>\n<p>The wider 650b tyres mean there’s more air under you, which in turn means that you can lower tyre pressure for a more comfortable ride that’s also grippier, as you have more rubber in contact with the trail.</p>\n<p>Many of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">best gravel bike</a> frames allow you to swap between 700c and 650b wheels. We’ve got an article on <a href=\"https://www.bikeradar.com/features/what-is-650b/\">650b wheels</a> for gravel and mountain bikes, plus an explainer on <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-29er/\">29-inch mountain bike wheels</a>, if you want to learn more.</p>\n<p>650b has also made an appearance on bikes with smaller-sized frames. With 700c wheels, <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road bike geometry</a> on frames smaller than around 50cm gets tricky, as they typically need a lower head tube angle to put the front wheel far enough from the <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> (a measurement called the front centre) to reduce toe overlap with the front wheel.</p>\n<p>This, in turn, means the smaller-sized bikes handle differently from larger frame sizes of the same model.</p>\n<p>To mitigate this, some brands, including Canyon, are now fitting 650b wheels to some of their smaller road and gravel bikes, which means that frame geometry can be kept similar to their larger bikes.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c7ec414cf73405830192543b7be015242f61903aad591d1b3c20115eb124d5b0","category":"Cycling"}