{"title":"Apple Reveals How 'Scary Fast' Event Was Shot on iPhone 15 Pro Max","link":"https://www.macrumors.com/2023/10/31/apple-video-scary-fast-event-shot-iphone-15-pro/","date":1698768184000,"content":"Apple has <a href=\"https://www.apple.com/newsroom/2023/10/behind-the-scenes-at-scary-fast-apples-keynote-event-shot-on-iphone/\">shared a behind-the-scenes look</a> at the video production of its recent <a href=\"https://www.macrumors.com/2023/10/30/everything-apple-announced-october-2023-event/\">\"Scary Fast\" M3 MacBook Pro event</a>, which was shot entirely on iPhone 15 Pro Max and edited on Mac.\r<br />\n\r<br />\n<div> </div>\r<br />\nTitled \"Behind the Scenes: An Apple Event\" and running two minutes and 16 seconds, the video shared on YouTube reveals how footage was captured using multiple iPhone 15 Pro Max devices, with the production team utilizing integration between iPhone 15 Pro, the Blackmagic Camera app, and Tentacle Sync.\r<br />\n\r<br />\nConnected via Bluetooth, Tentacle Sync drives timecode and enables all devices on set — including Macs and preview screens — to be synced throughout the production. Beastgrip accessories, including cages and rigs, were also used during the production, as well as cranes, dollies, gimbals, and drones. \r<br />\n\r<br />\nInterview clips with the directors, producers, and editors explain how the capabilities of the iPhone 15 Pro allowed them to work effectively with low light conditions, which is traditionally a bit more challenging for a standard video camera. \r<br />\n\r<br />\nThe production was advised by Apple's Jon Carr, a Pro Workflow video specialist whose credits include <em>Top Gun: Maverick</em> and <em>Terminator: Dark Fate</em>, and Jeff Wozniak, who has worked on productions including <em>Transformers: Dark of the Moon</em>, <em>Avatar</em>, and <em>Iron Man 2</em>.\r<br />\n<blockquote>\"When I first got the footage from iPhone 15 Pro Max, I was immediately pleasantly surprised,\" said Stefan Sonnenfeld, Company 3's CEO, who colored the presentation and has worked on projects including Stranger Things, The Equalizer 3, and Fast X. \"The quality of the image on iPhone 15 Pro Max is incredible, and it's there. And I know because I've done it and I've seen it, and we're doing this project with it.\"</blockquote>\r<br />\nThe video specialists also espoused the benefits of being able to shoot directly to external storage and use Apple Log to access more dynamic range in post production.\r<br />\n\r<br />\nThe ‌‌iPhone 15‌ Pro‌ and iPhone 15 Pro Max models feature an improved camera system, including a main camera with a larger sensor, a new coating to reduce lens flare, optical image stabilization, and better low light performance for Portraits and Night mode.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/shot-on-iphone/\">Shot on iPhone</a>, <a href=\"https://www.macrumors.com/guide/october-2023-apple-event/\">October 2023 Apple Event</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Buy Now)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/31/apple-video-scary-fast-event-shot-iphone-15-pro/\">Apple Reveals How 'Scary Fast' Event Was Shot on iPhone 15 Pro Max</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reveals-how-scary-fast-event-was-shot-on-iphone-15-pro-max.2409406/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c7f50483b988d88acb77df97367e2a96301de11963d408c926d0421a15de7c2e","category":"Apple"}