{"title":"Practical Protocol and Parameter Optimizations For SBF-SEM Imaging – Tips &amp; Tricks for Technically-Demanding Tasks","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.493/7719702?rss=1","date":1721779200000,"content":"<span>The adoption of serial block-face scanning electron microscopy (SBF-SEM) opens a powerful and versatile volume EM technique to the research community it serves. In a core facility setting this naturally introduces myriad sample variations to be imaged, and with it an equal number of unique challenges to consider [<a href=\"#ozae044.493-B1\">1</a>]. Sample processing, mounting and imaging parameters must be accounted for to achieve the voxel size necessary to meet a project’s imaging goals with a given specimen. While SBF-SEM is an exciting methodology for illuminating large-scale ultrastructural morphology, it is an unforgiving technique that requires attention to detail and fine-tuning to successfully execute. The lack of experienced personnel becomes a limiting factor preventing the breakthrough discoveries possible with volume EM. Once sample preparation has been optimized, generating a desired volume for a given project requires knowing and accounting for the idiosyncrasies of a given sample’s geometry after mounting for imaging. Methods for collecting from mouse neocortex, for example, would be incompatible with collecting from cell monolayers [<a href=\"#ozae044.493-B2\">2</a>]. Specimen mounting must consider electron charge accumulation on the block face and how it affects the minimum achievable sectioning thickness [<a href=\"#ozae044.493-B3\">3</a>]. The SEM’s operating parameters dictate the resolution, signal and field-of-view for the desired dataset. Collecting smaller z-steps requires an understanding of how sample mounting influences the minimum achievable voxel size. From our own explorations, we have successfully imaged many biological samples at the resolutions and fields of view necessary to elucidate their relevant ultrastructural morphological information. These samples include <span>in vitro</span> cultured cells, drosophila ovaries, whip worm eggs, and animal tissues. Here we highlight sample mounting details for each sample category, and address how imaging parameters affect SBF-SEM imaging.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"c7f982606b2004abb65fe38eac7eccbf32df26a818f4651780e2c64e7a4fa630","category":"Environment"}