{"title":"SRAM introduces backward compatibility for 11-speed eTap users","link":"https://cyclingtips.com/2021/11/sram-introduces-backward-compatibility-for-11-speed-etap-users/","date":1636592880000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/SRAM-11-speed-firmware-update-1-650x366.jpg\" /></div><h2>SRAM introduces backward compatibility for 11-speed eTap users</h2><p>\n</p><p></p>\n\n\n\n<p>It was only a few weeks ago that I was <a href=\"https://cyclingtips.com/2021/10/five-things-i-really-wish-the-bike-industry-would-do/\" target=\"_blank\">asking the bike industry</a> to more supporting of older products through increased backwards compatibility. Coincidentally, it seems SRAM was busy doing just that. </p>\n\n\n\n<p>As spotted by VeloClub member Eugene Chan, SRAM has quietly rolled out a <a href=\"https://www.sram.com/globalassets/document-hierarchy/compatibility-map/road/sram-red-etap-11-speed-component-compatibility-map.pdf\" target=\"_blank\">firmware update</a> that provides a level of backwards compatibility for users of the first-generation Red eTap 11-speed groupsets. The new firmware update aims to keep those groupsets rolling into the future while SRAM discontinues the original shifters.</p>\n\n\n\n<p>With firmware version 2.29.4 or greater installed, SRAM is now allowing newer Red AXS, Force AXS, and eTap AXS BlipBox shifters to be paired with older 11-speed eTap front and rear derailleurs. “The goal is to offer product support for customers with a need for shift lever/control service solutions, as the 11-speed SRAM RED eTap shift-brake levers and BlipBox have been discontinued,” explained Brook Fowler of SRAM. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/SRAM-11-speed-firmware-update-2-1340x754.jpg\" /><figcaption>Crashes happen and things break. This is SRAM’s way of keeping those 11-speed eTap drivetrains going by making new parts backwards compatible. </figcaption></figure>\n\n\n\n<p>This free update comes approximately a year after SRAM quietly rolled out an <a href=\"https://cyclingtips.com/2020/09/updated-11-speed-sram-red-etap-rear-derailleur-adds-orbit-pulley-cage-clutch/\" target=\"_blank\">updated Red rear derailleur for those early eTap adopters</a>. This 11-speed “A2” model features SRAM’s Orbit hydraulic cage clutch and a larger maximum tooth capacity. This derailleur remains in production. </p>\n\n\n\n<p>It’s worth noting that adding a new AXS shifter to first-generation eTap derailleurs won’t change the number of gears you can shift with the rear derailleur, which stays at 11. Similarly, this backward compatibility is not available with new Rival eTap AXS controls. And while the eTap AXS shifters are AXS Mobile App compatible, the 11-speed eTap derailleurs won’t show up in the app and cannot be configured through the app, either. </p>\n\n\n\n<p>While this update is directly related to SRAM discontinuing the production of its 11-speed eTap shifters, I do think the American company deserves kudos for not leaving its customers without a longer-term repair solution. Fingers crossed Shimano will follow suit when it inevitably ceases production on its 11-speed Di2 shifters one day. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/sram-introduces-backward-compatibility-for-11-speed-etap-users/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c7fea617b614ecd2812656987257982864d6f38d9f3214a74856bf146e07dbf8","category":"Cycling"}