{"title":"Evaluating the Efficacy of Delafloxacin and Combination Therapy Against Staphylococcus aureus Biofilms: Insights into Activity in Acidic Environments","link":"https://www.preprints.org/manuscript/202408.1870/v1","date":1724678886000,"content":"Background: Staphylococcus aureus is a major contributor to biofilm-associated infections, which complicate the treatment of chronic conditions like osteomyelitis and prosthetic infections. Bio-films, characterized by bacterial communities encased in a protective matrix, hinder the effec-tiveness of antimicrobial agents and contribute to persistent infections. Objective: This study aimed to evaluate the activity of delafloxacin, a novel fluoroquinolone, against biofilm-forming S. aureus strains, including methicillin-resistant (MRSA) and methicillin-sensitive (MSSA) isolates. Methods: Delafloxacin’s efficacy was compared with traditional antibiotics (vancomycin, line-zolid, doxycycline, sulfamethoxazole/trimethoprim, and rifampicin) using minimal inhibitory concentration (MIC) assays, including testing at different pH levels to simulate acidic biofilm conditions. Synergistic interactions between delafloxacin and other antimicrobials were assessed using the checkerboard method. Biofilm eradication was tested through minimal biofilm eradi-cation concentration (MBEC) assays, biomass quantification, and cell viability (MTT assay). Re-sults: The results showed that all isolates were susceptible to vancomycin and linezolid, with varying resistance to other antibiotics. Delafloxacin demonstrated potent activity, with MIC re-ductions observed in acidic conditions. Synergistic effects were minimal, with only a few isolates showing synergy with vancomycin and doxycycline. Biofilm eradication tests revealed limited success in eradicating biofilms at breakpoint concentrations. However, rifampicin in combination with delafloxacin significantly reduced biofilm biomass in some isolates. No significant changes in cell viability were noted across treatments. Conclusion: This study highlights delafloxacin's potential against biofilm-associated infections, particularly in acidic environments. Despite the challenges in biofilm eradication, delafloxacin combined with rifampicin shows promise for im-proved treatment strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c80430616689849a70f75c72209994145abd89681cdd357ea4e87cc325ffcdbf","category":"Interdisciplinary"}