{"title":"Genome-Wide Association Analysis Identifies Candidate Loci for the Callus Induction in Rice (Oryza sativa L.)","link":"https://www.preprints.org/manuscript/202407.0197/v1","date":1719911452000,"content":"Callus induction (CI) is the critical trait for the transformation of desirable genes in plants. A genome-wide association study (GWAS) analysis was conducted on the rice germplasm of 110 diverse indica rice accessions. Three tissue culture media, including B5, MS, and N6, were used for CI in those rice panels. Seven quantitative trait loci (QTLs) on chromosomes 2, 6, 7, and 11 were found to confer a CI percentage in these three media. For the B5 medium, one QTL (qCI-B5-Chr6) was identified on the rice chromosome 6. For the MS medium, two QTLs were identified on the rice chromosomes 2 and 6 (qCI-MS-Chr2 and qCI-MS-Chr6, respectively). For the N6 medium, four QTLs were identified on the rice chromosomes 6, 7, and 11 (qCI-N6-Chr6.1, qCI-N6-Chr6.2, qCI-N6-Chr7, and qCI-N6-Chr11, respectively). Fifty-five genes were identified within the haplotype blocks corresponding to these QTLs. Thirty-one genes showed haplotypes associated with different CI in those media. The qCI-B5-Chr6 was located in the same region as the qCI-N6-Chr6.2. The caleosin-related family protein was identified in this region. Analysis of the gene-based haplotype reveals the association of this gene with different CI in both B5 and N6 media, suggesting that the gene may play a critical role in the CI mechanism. Moreover, several genes, including the beta-tubulin, the zinc finger proteins, the RNP-1 domain-containing protein, and the Lysophosphatidic acid acyltransferase, were associated with different CI in the N6 media. Results from this study provide insight into the potential QTLs and candidate genes for callus induction in rice that will fulfill the understanding of the physiological and biochemical processes involved in callus formation, which is an essential tool in the molecular breeding of rice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c806ceb20eb56eee8306e6e4b0620ba7d7f3cf86905dbcfd7c4c7661abc87f81","category":"Interdisciplinary"}