{"title":"Apps and Games That Use iOS 15.1's New SharePlay Feature","link":"https://www.macrumors.com/2021/10/25/ios-15-1-shareplay-third-party-apps/","date":1635191933000,"content":"Apple today introduced iOS 15.1, iPadOS 15.1, and tvOS 15.1, all of which add support for SharePlay. SharePlay is designed to let people do more with friends and family over <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, such as watching movies or listening to music.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/FaaceTime-SharePlay-iPhone-Green-Feature.jpg\" />\r\n<br />\r\nSharePlay support is available for <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app, and Fitness+ in addition to being accessible for screen sharing, but it can do even more than that because third-party developers can add SharePlay support to their apps. We've rounded up a handful of apps that have introduced SharePlay support, and we'll add to this list going forward.\r\n<br />\r\n\r\n<br />\r\n<h2><a href=\"https://apps.apple.com/app/apple-store/id1573083328\">Guessing Game</a></h2>\r\n<br />\r\nGuessing Game is a casual party game that uses SharePlay to offer up a multiplayer experience with friends over ‌FaceTime‌. Built specifically for SharePlay, the game allows users to play \"Guess the Phrase\" or \"Guess the Drawing.\" With Guess the Phrase, users aim to complete the phrase first as it fills in one letter at a time, and with Guess the Drawing, the aim is to figure out a friend's drawing before the time runs out.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/guessing-game-shareplay.jpg\" />\r\n<br />\r\nGuessing Game is <a href=\"https://apps.apple.com/app/apple-store/id1573083328\">free to download</a>, but unlocking additional content like TV, Music, and Movie add-on packs requires in-app purchases.\r\n<br />\r\n\r\n<br />\r\n<h2>Mapless</h2>\r\n<br />\r\nMapless is an app that is focused specifically on walking directions and ideal for those who often walk to where they want to go. The SharePlay component introduces a \"Walk and Meet\" feature, which is designed to allow two people to find each other with each receiving walking directions to the other.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/mapless-shareplay-app.jpg\" />\r\n<br />\r\nTwo users can start a ‌FaceTime‌ conversation and then open up Mapless to initiate the SharePlay integration. From there, users can tap on the Walk and Meet option and each person will receive an arrow that points toward the other person in the conversation to make finding one another easier. A green ring also shows the progress as two people approach each other.\r\n<br />\r\n\r\n<br />\r\nMapless is <a href=\"https://apps.apple.com/us/app/mapless-walking-directions/id1444241327\">free to download</a>, but there are Plus and Premium subscription purchases that are required, with a free trial available.\r\n<br />\r\n\r\n<br />\r\n<h2>Shhh! (Coming Soon)</h2>\r\n<br />\r\n<a href=\"https://shhh.games/\">Shhh</a>! is a social deduction game that can be played over ‌FaceTime‌ with SharePlay. In the game, everyone but one player knows a single location, and this location must be kept secret from the spy while the players also deduce who the spy is through a series of questions.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/shhh-shareplay-app.jpg\" />\r\n<br />\r\nA game has to be started from the app after creating a ‌FaceTime‌ call, but non-iPhone users can also join in on the web. Shhh! is not available just yet but it should be coming very soon.\r\n<br />\r\n\r\n<br />\r\n<h2>Share+ (Coming Soon)</h2>\r\n<br />\r\nShare+ is an app that adds several photo and video-related experiences to the ‌FaceTime‌ experience. Users can take a selfie together using a selfie feature that crops out everyone's backgrounds and merges them together, or they can watch YouTube or view photos in a \"Theater\" experience.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/share-plus-app.jpg\" />\r\n<br />\r\nThere are built-in games like \"Word Lines,\" \"Word Find,\" \"Charades,\" \"4 in a Row,\" along with options for editing and annotating PDFs with a group of users. Share+ will be released soon and we'll update this article when it's available.\r\n<br />\r\n\r\n<br />\r\n<h2>Learn More About SharePlay</h2>\r\n<br />\r\nSharePlay has a lot of other capabilities and can be used for <a href=\"https://www.macrumors.com/how-to/watch-movies-together-facetime/\">watching TV and movies</a> with friends, listening to music together, and there's even a screen sharing feature. We have more details on SharePlay <a href=\"https://www.macrumors.com/guide/facetime-ios-15/\">in our SharePlay guide</a>, and for those who want to try out the screen sharing, we have a <a href=\"https://www.macrumors.com/how-to/share-screen-facetime-call-ios/\">dedicated how to</a> with instructions.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/25/ios-15-1-shareplay-third-party-apps/\">Apps and Games That Use iOS 15.1's New SharePlay Feature</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apps-and-games-that-use-ios-15-1s-new-shareplay-feature.2319262/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OmjEiFLEzjE:1xlcogxKa-M:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OmjEiFLEzjE:1xlcogxKa-M:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/OmjEiFLEzjE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c807918dd127599685403c041e6cae7c2b4ee5def4d58d95a014ccd93e585283","category":"Apple"}