{"title":"From Jumbo-Visma to Bora-Hansgrohe: Is this the right move for Primož Roglič as he aims for Tour de France glory?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/from-jumbo-visma-to-bora-hansgrohe-will-this-be-the-right-move-for-primoz-roglic","date":1696696626000,"content":"\n      <p>Weeks of speculation and gossip about the transfer of a star potentially making a big-money move from one team to another is something more associated with football than it is with cycling. Yet, this latest news cycle has seen the cycling world gripped by the saga of Primož Roglič’s departure from Jumbo-Visma. It’s rare in this sport to see such a big name at the very top of his game part ways with their team and promised a seismic shift in the balance of power in the men’s WorldTour as other major teams scrambled to try and woo him. </p>\n<div></div>\n<div></div>\n<br />At last, it was confirmed on Friday that Bora-Hansgrohe had won the race to secure his signature, prompting the next round of discourse: how good a match for him are they? And how much will the team benefit from his acquisition?<br /><br />As Bora’s team manager Ralph Denk explained during the press conference announcing the signing, there were two main reasons that Roglič sought to leave Jumbo-Visma, the team he has been with since 2016. One of these was the discontent with what happened at the recent<a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\"> Vuelta a España</a>, where he was obliged to sacrifice his own personal ambition in order to help secure the overall victory for Sepp Kuss. <br /><br />But rather than a sudden falling out, the way this race unfolded was part of an ongoing issue for Roglič that is the other reason for him seeking pastures new — that he had fallen down the pecking order at Jumbo-Visma, and is no longer the team’s star who can command leadership status at his Grand Tour of choice. That privilege instead belongs to Jonas Vingegaard, and rightfully so, seeing as the Dane has won each of the last two <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tours de France</a>. But though Roglič was happy this year to instead target the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> and leave the Tour to Vingegaard, having successfully won the pink jersey, he now has his sights on yellow, the only major title now missing from his palmarès. <br /><br />In Bora-Hansgrohe, he has a team that will provide him with the status of undisputed leader at the Tour de France and back him fully to target the yellow jersey. But does the team have the resources to give him all the support he needs? There is no doubt that the squad is full of climbing talent. In Aleksandr Vlasov and Cian Uijtdebroeks, they have riders who made the top ten at the Grand Tours this year, and in Jai Hindley, a rider who significantly bettered that by winning the 2022 Giro d’Italia. Emanuel Buchmann and Lennard Kämna proved themselves to be excellent domestiques while helping Hindley win that title, and new signing Daniel Martínez was even more impressive when he was Egan Bernal’s main super-domestique for Ineos Grenadiers during their victorious Giro ride the year before. Add to them another new signing, Bob Jungels, and the climber Sergio Higuita, and it’s clear the team can, in theory, assemble a stellar line-up backing their new leader.\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_SWpix_Giro_3052.jpg?v=1696695908\" alt /><br />The issue is how many of these riders will Roglič have at his disposal at the Tour de France? Many of these riders signed contracts with Bora with the understanding that they would command leadership or co-leadership status at Grand Tours and will not expect to have to sacrifice this to rally behind Roglič. Some will therefore want to target GC at either the Giro or the Vuelta and see helping Roglič at the Tour as their second priority. But for Roglič and Bora-Hansgrohe to hold their own against the might of Vingegaard’s Jumbo-Visma and Pogačar’s UAE Team Emirates at the Tour de France, he’ll not just require the team’s best riders helping him, but for them to be fresh and in top shape, too. Denk argued that the team needs so many riders in order to cover the many races on the calendar but nevertheless faces a tricky balancing act. <br /><br />On the plus side, Roglič does provide Bora what they long longed for – a genuine, bonafide Grand Tour GC contender. For all the climbing talent mentioned above, it’s striking that the only rider to finish on the podium of a Grand Tour – let alone win one – is Jai Hindley. The others have shown promise but have been unable to make the jump to elite Grand Tour competitors and even their great hope Hindley himself was found wanting during his Tour debut, finishing down in seventh. Roglič, by contrast, hasn’t finished outside of the top three in any of the last seven he has completed, winning four of them. With Bora harbouring big ambitions of gunning for the yellow jersey and Roglič matching that hunger, this appears a match that benefits most parties. <br /><br />One question that must have arisen while Roglič was contemplating leaving Jumbo-Visma was whether he really would have a better chance of winning the Tour outside of the team than within it. Intuitively, riding as a team’s undisputed leader would certainly seem to be an advantage over being a deputy, but it’s not so clear-cut as that. Had he stayed at Jumbo-Visma, it would only have taken a loss of form, an injury, or an unfortunate bad day for Jonas Vingegaard to cede leadership, and suddenly Roglič could have found himself leading the team in July, with all the might of their resources at his disposal. Grand Tours rarely play out straightforwardly, after all. Indeed, his own domestique, Sepp Kuss, has only just won the Vuelta a España despite starting behind both Vingegaard and Roglič in the pecking order. Had Kuss been riding directly against Jumbo-Visma rather than with them, it seems unlikely he would have held onto the red jersey.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_Giro_2845-2.jpg?v=1696695932\" alt /><br />From Bora-Hansgrohe’s perspective, they must also have ruminated on the risk of making such a big investment in a rider set to turn 34 later this month. You need only look back a few years to Israel-PremierTech's multi-million-pound investment in Chris Froome to see how signing an ageing Grand Tour rider can be a costly mistake. Unlike Froome, though, Roglič remains at the very top of his game and has enjoyed what has arguably been the very best season of his entire career. He was a late starter to the sport and hasn’t suffered the kind of injury problems that so compromised Froome in his mid-thirties. And if reports that the contract is only a two-year deal are true, then they haven’t committed too much to him staying competitive for years to come. <br /><br />Rather than inch towards retirement, Roglič remains as ambitious as ever, and this move signals just how serious he is about winning one race that has got away from him — the Tour de France. Leaving the team he has ridden for virtually his whole professional career and enjoyed so much success with is certainly a risk, but one that’s worth taking, and in Bora-Hansgrohe he’s found a team that matches his ambition and has the resources to potentially fulfil them. If he can retain the form he’s enjoyed this year, and if Bora’s management can inspire their squad to unite behind the purpose of winning the yellow jersey with him, this could be a match made in heaven.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c80e8cf2d72cb2f1619d2755a6a9a333baecca73608b04fb1520973f67072306","category":"Cycling"}