{"title":"Dealing With Assumptions and Sampling Bias in the Estimation of Effective Population Size: A Case Study in an Amphibian Population","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70015?af=R","date":1726210800000,"content":"<h2>ABSTRACT</h2>\n<p>Accurately estimating effective population size (<i>N</i>\n<sub>e</sub>) is essential for understanding evolutionary processes and guiding conservation efforts. This study investigates <i>N</i>\n<sub>e</sub> estimation methods in spatially structured populations using a population of moor frog (<i>Rana arvalis</i>) as a case study. We assessed the behaviour of <i>N</i>\n<sub>e</sub> estimates derived from the linkage disequilibrium (LD) method as we changed the spatial configuration of samples. Moor frog eggs were sampled from 25 breeding patches (i.e., separate vernal ponds, ditches or parts of larger fens) within a single population, revealing an isolation-by-distance pattern and a local spatial genetic structure. Varying buffer sizes around each patch were used to examine the impact of sampling window size on the estimation of effective number of breeders (<i>N</i>\n<sub>b</sub>). Our results indicate a downward bias in LD <i>N</i>\n<sub>b</sub> estimates with increasing buffer size, suggesting an underestimation of <i>N</i>\n<sub>b</sub>. The observed bias is attributed to LD resulting from including genetically divergent individuals (mixture-LD) confounding LD due to drift. This emphasises the significance of considering even subtle spatial genetic patterns. The implications of these findings are discussed, emphasising the need to account for spatial genetic structure to accurately assess population viability and inform conservation efforts. This study contributes to our understanding of the challenges associated with <i>N</i>\n<sub>e</sub> estimation in spatially structured populations and underscores the importance of refining methodologies to address population-specific spatial dynamics for effective conservation planning and management.</p>","author":"Karen Cox, \nSabrina Neyrinck, \nJoachim Mergeay","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"c81874a5761f2270a361bf2339ba597befc5a7360b6d33ded1a2cbdda2b6dd2b","category":"Environment"}