{"title":"Trofeo Alfredo Binda 2023 preview - route, predictions, and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/trofeo-alfredo-binda-2023-preview-route-predictions-and-contenders","date":1679071476000,"content":"\n      <p>Named after legendary Italian rider Alfredo Binda, the Trofeo Alfredo Binda takes place in the Cittiglio region of Lombardy, in northern Italy. A race traditionally suited to versatile GC-style riders and climbers, last season’s race defied expectation by finishing in a reduced bunch sprint, won by then world champion Elisa Balsamo of Trek-Segafredo.</p>\n<div></div>\n<p>The race constitutes the seventh round of the 2023 Women’s WorldTour, which has already seen some thrilling battles, along with a quite astonishing display of dominance across the board from Team SD Worx, who have taken wins at 50% of the WWT races so far including the last three, with Lotte Kopecky going solo at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop Het Nieuwsblad</a>, Demi Vollering pipping her team-mate to the victory at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> and Lorena Wiebes storming clear at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/miron-ronde-van-drenthe-preview-route-predictions-and-contenders\">Ronde van Drenthe</a> last weekend.</p>\n<p>This year’s Trofeo Alfredo Binda takes place on Sunday March 19. It will be the 47th edition of the race, which saw its inaugural edition in 1974. The race has been won by an Italian rider 26 times, including the past two editions. The race is 139km in length this year and sees repeated undulations and barely any flat all day, but despite the demands of the parcours, it’s still anybody’s guess as to how the race will play out.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1386719927.jpg?v=1679042147\" alt /></p>\n<h3>Route</h3>\n<p>While its final circuit always focuses on the hills of Cittiglio, the route for the opening section of the race undergoes small changes year on year. Beginning in the town of Maccagno con Pino e Veddasca, on the banks of Lake Maggiore, the 2023 race route hugs the coast of the lake as it heads south for the first 12.5km before heading inland towards the first, uncategorised, climb of the day.</p>\n<p>From there the route doubles back on itself before tackling the first proper climb of the day, the Masciago Primo. 5.1km of ascent at an average pitch of 4.6%, this challenge will likely offer the ideal launchpad for the day’s early break. Heading west after that, the riders will contest the first of three intermediate sprints in Besozzo, before another climb and descent takes the bunch across the finish line in the town of Cittiglio for the first time after 68km.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/route.webp?v=1679042290\" alt />At this point the peloton will enter a circuit that features repeated ascents of a set of tricky climbs. The short but punchy Casale (0.8km at 7%), and the longer Orino (2.6km at 5%) are both tackled four times, with various other lumps and bumps along the way around Cittiglio. The teams with strong climbers are likely to use the hills to attack and try to drop the sprinters, but depending on the pace and the composition of the teams, it’s possible that the climbs won’t prove long enough to fully distance the fast women, and groups may come back together again in between ascents.</p>\n<p>After racing up the Orino for the final time, the race heads down into Cittiglio for the final time, with 8km mostly downhill heading towards a flat final kilometre. The bunch will be reduced by this point but whether the strongest sprinters have managed to hold on, or if it will be a day for the climbers to fight it out from a reduced bunch, will not be seen until the race plays out.</p>\n<h3>Contenders</h3>\n<p>While SD Worx have been favourites for every race they’ve started so far this season, their team selection for Trofeo Alfredo Binda doesn’t include any of the major hitters, with Vollering, Kopecky and Wiebes all taking a break. They bring in Anna Shackley, <strong>Niamh Fisher Black</strong> and <strong>Elena Cecchini</strong> to offer a range of options, and they will favour a breakaway rather than a sprint so expect them to attack early.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1386701228.jpg?v=1679042611\" alt />Trek-Segafredo come to the race with a team that has all bases covered, and any outcome catered for, despite losing leader Elisa Longo-Borghini, who is still out with Covid-19. <strong>Amanda Spratt</strong> and <strong>Brodie Chapman</strong> bring their all-round power, <strong>Gaia Realini </strong>offers a pure climbing option and defending champion <strong>Elisa Balsamo</strong> returns to the fray in case a similar race scenario plays out to last year – she will hope to hold on with the bunch and if she does, she will be a favourite to sprint for victory in Cittiglio.</p>\n<p>FDJ-Suez bring an in-form <strong>Cecilie Uttrup Ludwig</strong> who has proven she can hold her own with the best on both punchy climbs and longer ones. She will be expected to make the selection of the day and if the climbers are able to drop the sprinters, she has a strong chance of victory.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1386700013.jpg?v=1679042651\" alt />Canyon//SRAM have had an inconsequential start to the season, with their best result a third place for Maike van der Duin at the Ronde van Drenthe last weekend. However, on paper they look extremely strong, with a team that should be a good fit for the race. <strong>Paulina Rooijakkers</strong>, <strong>Soraya Paladin</strong>, <strong>Elise Chabbey</strong> and <strong>Kasia Niewiadoma</strong> all have a decent shout of making any final group.</p>\n<p>Movistar opt to leave out headline acts Annemiek van Vleuten and Liane Lippert,<br />meaning fast woman <strong>Arlenis Sierra</strong> is likely to get the nod as leader. Sierra is more than capable of surviving the climbs to compete in a sprint if it comes to it.</p>\n<p>Jumbo-Visma boast multiple world champion <strong>Marianne Vos</strong> among their ranks, making her 2023 road debut at the race. Vos’ form is uncertain however, following iliac artery surgery earlier in the year. Team ADQ will likely be led by <strong>Silvia Persico</strong>. The Italian looked good during her brief cyclocross season and with a third place on GC at the UAE Women’s Tour, is clearly in decent form. Team DSM’s best chance is probably <strong>Juliette Labous</strong> – look out for the French rider on the attack in the later stages of the race.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1413414858.jpg?v=1679042827\" alt />AG Insurance-Soudal Quickstep have had a great start to the season, and stage winner from Valenciana <strong>Justine Ghekiere</strong> lines up for them, alongside <strong>Gaia Masetti</strong> who the stronger teams will want to keep an eye on. Liv Racing TeqFind bring tough climber <strong>Mavi García</strong> who will hope to show the kind of form that saw her take a podium place at last year’s Giro Donne.</p>\n<h3>Prediction</h3>\n<p>With the repeated ascents of both punchy climbs and longer climbs, Trofeo Alfredo Binda is one of the trickiest races to predict, with multiple outcomes possible. With a strong all-round line-up and tonnes of firepower, we are predicting a repeat win for Trek-Segafredo and <strong>Elisa Balsamo</strong>.</p>\n<p>This year sees a slightly longer race with slightly less climbing overall, which suggests it should be possible for the hardier fast women to stay with the reduced bunch, and with the strength of the team Trek bring with them, we foresee another year of Italian victory in Cittiglio.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c81c83c24e6eb578c3b3846a98a984175c9b0cb66b39e64e9c2a7e6199633d32","category":"Cycling"}