{"title":"Intraspecific variation in group structure arises due to environmentally‐mediated directional dispersal in a cooperative breeder","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14162?af=R","date":1722923680000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f6a2a756-4995-4529-93b2-2f4363583646/jane14162-toc-0001-m.png\" alt=\"Intraspecific variation in group structure arises due to environmentally-mediated directional dispersal in a cooperative breeder\" />\n<p>This study shows dispersal and gene flow from groups in lower to higher quality habitat, generating intraspecific variation in group structure within the same population of an avian cooperative breeder, the superb starling. Ecological and demographic processes can thus impact the relative importance of direct versus indirect benefits in cooperative societies.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMany cooperatively breeding species live in groups with complex structure—large group sizes, low and variable kin structure, and multiple breeding pairs. Since these mixed-kin groups typically form because of immigration of unrelated individuals of both sexes in addition to limited offspring dispersal, differences in patterns of dispersal can generate variation in group structure, even within the same species or population.\n\nHere, we examine how environmentally mediated dispersal patterns influence variation in group structure in the plural breeding superb starling (<i>Lamprotornis superbus</i>), an avian cooperative breeder that inhabits a spatiotemporally variable savanna environment and forms mixed-kin groups with variable group sizes and more than one breeding pair per group.\n\nUsing 4068 genome-wide polymorphic loci and fine-scale, remotely sensed ecological data from 22 groups sampled across a nearly 200 km<sup>2</sup> environmental gradient in central Kenya, we find evidence of not only frequent and long-distance dispersal in both sexes (low isolation-by-distance and weak genetic structure), but also directional dispersal from small groups in lower quality habitat with low normalised difference vegetation index (NDVI) to large groups in higher quality habitat with high NDVI.\n\nAdditionally, we find stronger genetic structure among groups in lower quality habitat, and higher genetic diversity and lower relatedness of groups in higher quality habitat. Previous work using long-term data from groups in the same population has shown that groups with lower relatedness are larger and have more breeding pairs.\n\nLong-distance, directional dispersal to maximise individual fitness can thus lead to smaller and simpler kin-based social groups in lower quality habitat, but larger and more complex mixed-kin groups in higher quality habitat.\n\nSuch intraspecific, within-population variation in group structure, including variation in kin structure of social groups, could have profound implications for the relative importance of the evolutionary mechanisms (i.e. direct vs. indirect fitness benefits) underlying the formation of cooperative societies.\n</p>","author":"Shailee S. Shah, \nDustin R. Rubenstein","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"c81ebc2bdb602cbceea839c936b033202508ca45bb9bcd98ddb516efdf0c48b8","category":"Environment"}