{"title":"Experimental evidence that increased surface temperature affects bioturbation by ants","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14040?af=R","date":1709702152000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/243823f4-31a9-4160-a4be-3510862b0c91/jane14040-toc-0001-m.png\" alt=\"Experimental evidence that increased surface temperature affects bioturbation by ants\" />\n<p>Ants are one of the most important groups of bioturbators, but how would rising temperatures affect their nest architecture and its effects on soils? This work aimed to explore this question by using CT-scan tomography of nests of ants exposed to different surface temperatures.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAnts are important bioturbators that actively produce biopores and move soil particles. They could be particularly affected by global warming as they are ectotherms. Nevertheless, they can indirectly regulate their temperature, through changes in their circadian cycles and the architecture of their nests (e.g. digging deep nests or using insulating materials). Nest architecture has been considered an expanded functional trait of ant colonies and thus sensitive to environmental changes such as increasing temperatures. This work aimed to study the nest architecture of ants as a functional trait and its effects on soil bioturbation. We hypothesized that, when exposed to increased surface temperatures, ants would increase their excavation activities, build deeper nests and alter the layout of chambers to maintain their preferred temperature and humidity, thus enhancing soil porosity.\n\nWe allowed 17 young <i>Lasius niger</i> ant colonies to excavate nests in soil columns exposed to three surface temperatures (mild, <i>n</i> = 5; medium, <i>n</i> = 6; and high, <i>n</i> = 6) for 100 days. We measured the amount of soil excavated weekly and took X-ray scans of the soil column on Days 7, 14, 28, and 88 to characterize the three-dimensional structure of the nests (depth, shape, volume of chambers and tunnels). We then collected the colonies and measured their growth during the experiment, and the size and weight of workers.\n\nAnts reacted to surface temperature. Colonies exposed to medium and high temperatures excavated larger and deeper nests than those exposed to mild temperature. Nests excavated under high and medium temperatures had the same maximal depth, but chambers were located deeper in the former, which were further characterized by the refiling of some of the upper chambers. Colonies grew well in all treatments, although less under mild temperature. They produced normal-sized workers despite differences in surface temperature. Overall, these results suggest that ants exposed to higher temperatures live in deeper chambers.\n\nThis study shows that surface temperature affects ant nest architecture, confirming its status as extended phenotype and highlighting its flexibility over time, which has in turn consequences on soil porosity.\n</p>","author":"Fátima García Ibarra, \nPascal Jouquet, \nNicolas Bottinelli, \nAngélique Bultelle, \nThibaud Monnin","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"c8261120f0384dba3340b9cd35ac85b7fba8c5f87c30deed0b1a0ab0b44bfe5c","category":"Environment"}