{"title":"Thermal stability of γ‐PGA modified fish gelatin emulsion","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13947?af=R","date":1728308040000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Emulsions are thermally unstable systems. This research aimed to investigate the thermal stability of fish gelatin (FG) oil-in-water emulsions in the presence of poly-γ-glutamic acid (γ-PGA) as an additive after heat treatment. The study assessed how γ-PGA influences the thermal stability of FG emulsions over time, focusing on their properties, structure, and food application potential.</p>\n<h2>RESULTS</h2>\n<p>The incorporation of γ-PGA significantly enhanced the thermal stability of FG emulsions, preserving their morphology after heating. Emulsions containing 0.1% γ-PGA showed no significant changes after 24 h at 90 °C, while emulsions without γ-PGA experienced noticeable delamination. Rheological evaluations revealed that the energy storage modulus and loss modulus of FG–γ-PGA emulsions remained consistently higher than those of FG emulsions, regardless of heating duration. Particle size analysis indicated minimal changes for FG–γ-PGA emulsions (413 nm after 24 h) compared to a substantial increase for FG emulsions (1598 nm). After heating, FG–γ-PGA emulsions demonstrated significantly higher emulsifying activity index (EAI) (74 m<sup>2</sup> g<sup>−1</sup>\n<i>versus</i> 22.7 m<sup>2</sup> g<sup>−1</sup>) and emulsifying stability index (ESI) (97% <i>versus</i> 76%). Additionally, the texture properties of meat mince formulated with FG-γ-PGA emulsions were comparable to those containing fat, showcasing their potential as a fat replacement.</p>\n<h2>CONCLUSION</h2>\n<p>The study concludes that γ-PGA enhances the thermal stability of FG emulsions, maintaining their integrity and improving functional properties under heat treatment. These findings offer valuable insights for the formulation of thermally stable emulsions, presenting promising opportunities for innovative applications in the food industry. © 2024 Society of Chemical Industry.</p>","author":"Huan Xie, \nXiao‐Mei Sha, \nShan Shan, \nZi‐Zi Hu, \nZong‐Cai Tu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c84506fa79847da8ded6a0462848c1c9148338f36070a850139d43db6ca619e8","category":"Environment"}