{"title":"PICKLE and HISTONE DEACETYLASE6 coordinately regulate genes and transposable elements in Arabidopsis","link":"https://academic.oup.com/plphys/article/196/2/1080/7709392?rss=1","date":1720396800000,"content":"<span><div>Abstract</div>Chromatin dynamics play essential roles in transcriptional regulation. The chromodomain helicase DNA-binding domain 3 chromatin remodeler PICKLE (PKL) and HISTONE DEACETYLASE6 (HDA6) are required for transcriptional gene silencing, but their coordinated function in gene repression requires further study. Through a genetic suppressor screen, we found that a point mutation at <span>PKL</span> could partially restore the developmental defects of a weak Polycomb repressive complex 1 (PRC1) mutant (<span>ring1a-2 ring1b-3</span>), in which <span>RING1A</span> expression is suppressed by a T-DNA insertion at the promoter. Compared to <span>ring1a-2 ring1b-3</span>, the expression of <span>RING1A</span> is increased, nucleosome occupancy is reduced, and the histone 3 lysine 9 acetylation (H3K9ac) level is increased at the <span>RING1A</span> locus in the <span>pkl ring1a-2 ring1b-3</span> triple mutant. HDA6 interacts with PKL and represses <span>RING1A</span> expression similarly to PKL genetically and molecularly in the <span>ring1a-2 ring1b-3</span> background. Furthermore, we show that PKL and HDA6 suppress the expression of a set of genes and transposable elements (TEs) by increasing nucleosome density and reducing H3K9ac. Genome-wide analysis indicated they possibly coordinately maintain DNA methylation as well. Our findings suggest that PKL and HDA6 function together to reduce H3K9ac and increase nucleosome occupancy, thereby facilitating gene/TE regulation in Arabidopsis (<span>Arabidopsis thaliana</span>).</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"c84dbd0598f57ec15cbf6e888d0882e29d2fe1fcf9ae8a70859621d8faa8b2c1","category":"Environment"}