{"title":"Dream cycling destinations: Where will we ride when life returns to normal?","link":"https://www.cyclist.co.uk/in-depth/9365/dream-cycling-destinations-where-will-we-ride-when-life-returns-to-normal","date":1615456659000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/cyclist-magazine\">Cyclist magazine</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-16T14:53:00+00:00\">16 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nLockdown will end eventually, so where do we at Cyclist most want to ride when we can travel again?</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2016/09/formentor_070.jpg?itok=JFUZUvq2\" />  </div>\n<div class=\"field field-name-body\">\n      <p> All being well with the phased easing of lockdown, it won't be long before we are once again allowed to travel abroad from England, with similar timetables in place for the other UK nations.</p>\n<p>The most important date for cyclists looking to head abroad is 17th May, the earliest date that foreign holidays will be allowed. In addition to that, countries such as Greece, Cyprus and France have already started to lay out when British tourists may be allowed to visit and under what testing and quarantine conditions.</p>\n<p>Dreaming of the possibility of a cycling holiday, here at <em>Cyclist</em> we have let our minds turn to where we might want to go once the opportunity finally arises.<em> </em></p>\n<h2>Dream cycling destinations: Where will we ride when life returns to normal?</h2>\n<div id=\"file-37061\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2020/05/100_climbs_spain_mallorca_sa_calobra_george_marshall_1.jpg?itok=3Afj4odX\" alt=\"\" />  </div>\n</div>\n<p><em>Sa Calobra, Mallorca. Photo: George Marshall</em></p>\n<h4>Jack Elton-Walters, Website Editor: Mallorca</h4>\n<p>Having grown up on an island, I have an affinity for smaller lumps of land surrounded by the sea. While <a href=\"/in-depth/9090/uk-bicycle-island-isle-of-wight-cycling-quiet-roads-punchy-climbs-sea-views\">my home island is the best place to ride a bike in the UK</a> – and arguably the world – it's not there that I'm most looking forward to visiting when travel once again becomes an option.</p>\n<p>The place I am most longing to ride a bike is Mallorca. Its popularity has made it something of a cliche for cycling holidays, but even if others are scoffing and getting excited about other destinations instead, for me its popularity remains more than warranted.</p>\n<p>Smooth roads and considerate drivers mean it's already at an advantage over the Surrey Hills where I ride at weekends. Then there are the climbs, testing but without the risk of alititude sickness, enticing hairpins leading you on up through the Serra de Tramuntana mountain range.</p>\n<p>Shorter rides like the out and back to the Formentor lighthouse are also in abundance, ideal for the first or last day of a multi-day trip when time might be tight. Go for a long weekend and wish you'd booked for a fortnight.</p>\n<div id=\"file-5608\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/6/08//giro_ditalia_dolomites_00.jpg?itok=q1_E0xZ4\" alt=\"\" />  </div>\n</div>\n<p><em>The Dolomites, Italy. Photo: Juan Trujillo Andrades</em></p>\n<h4>Pete Muir, Editor: The Dolomites</h4>\n<p>During the long, grey days of lockdown, my cycling has been mainly restricted to the urban sprawl of Greater London. A particularly adventurous day might mean a trip to High Barnet or to a bridge overlooking the M25.</p>\n<p>It’s all a long way from the most beautiful, dramatic and uplifting cycling destination on Earth: the Dolomites.</p>\n<p>As soon as flights and jabs allow, I’ll be packing my best bibs, rubbing on my fake tan (don’t want to blind the locals with the pearly-whiteness of my legs) and heading for the north of Italy, to the land of limestone spires and sinuous switchbacks.</p>\n<p>If you could build a world from the collective dreams of cyclists, this is what it would look like. The Dolomites are a compact cluster of towering white cliffs, carpeted with green forests and bisected by tarmac as smooth as a billiard table.</p>\n<p>There is barely a metre of flat ground to be found anywhere; it is simply a playground of climb followed by descent followed by climb followed by descent.</p>\n<p>The scale is grand enough to inspire awe, but the distances are short enough that it never becomes boring or overwhelming. Every corner reveals a new view, each more spectacular than the last.</p>\n<p>The history of the <a href=\"/tags/giro-ditalia\">Giro d’Italia</a> is woven into the fabric of the Dolomites, and as you ride you could imagine looking up to see Fausto Coppi tapping away at the pedals as he cruises gently past on his way to another summit victory.</p>\n<p>The climbs even sound like courses in a particularly delicious Italian meal: ‘I think we’ll start with the Pordoi and Gardena salad, move on to the Falzarego with deep-fried Giau, and we’ll wash it down with a bottle of Tre Cime di Lavaredo.’</p>\n<p>It’s got the weather, the beauty, the heritage, the climbs, the coffee… It’s got everything. And hopefully, soon, it will have me.</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/news/9127/tadej-pogacar-and-primoz-roglic-set-for-tour-de-france-rematch\">Tadej Pogacar and Primoz Roglic set for Tour de France rematch</a></div>      <div class=\"field-item odd\"><a href=\"/in-depth/8824/classic-climb-vrsic-pass-mangart\">Classic climb: Vršič Pass &amp; Mangart, Slovenia</a></div>      <div class=\"field-item even\"><a href=\"/news/2471/milan-san-remo-2021-who-is-going-to-win\">Milan-San Remo 2021: Who is going to win?</a></div>      <div class=\"field-item odd\"><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 111: on sale now!</a></div>    </div></div><div id=\"file-44021\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/03/greece16_073.jpg?itok=5-Nql7qC\" alt=\"\" />  </div>\n</div>\n<p><em>Mani Peninsula, Greece. Photo: George Marshall</em></p>\n<h4>James Spender, Deputy Editor: Kardamili, Mani Peninsula, Greece</h4>\n<p>The morning begins in a stone cottage. On the doorstep a basket – yoghurt, eggs, bread, honey. The curtains are trying to escape on the breeze, the duvet was made obsolete the previous night. Chickens responsible for the eggs cluck industriously to the slap of the sea, which sits visible blue behind the silver-green olive groves.</p>\n<p>I leave kitted up but in socks, shoes in one hand to avoid the sleep-stirring clacks of the tiles. Outside the sky and my bike are where I left them, the sky gradually nudged into life by the dawning sun, the bike buffeted by the head of a scraggy cat, pleasurably rubbing the dust its just been rolling in onto my tyres.</p>\n<p>Timed right I’ll hit 1,000m from sea-level before breakfast and before anyone wakes, although this late in the season, as the awnings are wound in by men with hairy forearms and the bleached plastic chairs are stacked for winter, there are very few people left to disturb.</p>\n<p>I roll along the edge of the beach, up the slipway and through the village square, early enough to smell the bakery but too early to taste it.</p>\n<p>Signs I can’t read point to ancient structures, fences pin back olive trees but can’t hold wild thyme; a dog with a limp noses through yesterday’s rubbish. The higher I climb the darker the sea becomes, its blue solidifying under the hardening sun, that early morning softness having evaporated for another day.</p>\n<p>I could ride on but 20km is enough climbing for now. At a low stone wall that separates road from a sheer drop into the gorge below, I get off and sit quietly. A pair of buzzards surf invisible currents rising from the gorge’s centre, several hundred metres above their carefully observed floor but head-height for me. Close enough to catch the minute trim of wing tips.</p>\n<p>Descending back, I cross paths with the limping dog, now breathing lazily in one of the few patches of shade she can find. The bakery is open in the square so the old men are playing chess already, their coffees partnered with liqueurs, a cat-dog-dog trio winding around under the vinyl tablecloth, snaffling the odd kindly scrap.</p>\n<p>None of these animals belongs to anyone in Kardamili, but they all wear the collars their human counterparts have given them, because if you have a collar the Greek pest control won’t pick you up.</p>\n<div id=\"file-10914\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2017/03/marmotte_pyrenees_sportive_3.jpg?itok=q2sH_24T\" alt=\"\" />  </div>\n</div>\n<p><em>The Pyrenees, France</em></p>\n<h4>Sam Challis, Tech Editor: Pyrenees</h4>\n<p>I’m looking forward to visiting the Pyrenees the most when the world opens for business once again. I’ve always found the more of that mountain range I’ve explored, the more I’ve realised how much else there is still to discover.</p>\n<p>The Pyrenees are beguiling and wild in a way that the accessible Alps and well-groomed Dolomites aren’t. It still has more than its fair share of iconic ascents though, which ensures that the anecdotes you bring back from a trip to the Pyrenees are just as impressive as the experience of riding the climbs themselves.</p>\n<p>What’s more, the ascents tend to pocketed together with wonderful geographical efficiency. A bit of smart route planning can see a rider tick off four or more world-renowned climbs in one day.</p>\n<p>Don’t fancy the Col du Tourmalet today? Why not turn left instead and take on the Hautacam? Or go right just up the road and tackle Luz Ardiden or the Col du Soulour? The Hautes-Pyrénées department of France has an embarrassment of riding riches.</p>\n<p>And that is even before the gravel riding is considered. <a href=\"/in-depth/8694/beyond-the-tour-de-france-pyrenees-gravel-ride\">Gravel is the Pyrenees’ best kept secret</a>. Pretty much every mountain – the Col d'Aubisque, Aspin, Peyresourde, you name it – has gravel roads criss-crossing their slopes.</p>\n<p>Once you start to find out about the alternative routes, that way of thinking gets under your skin. You can never look at a Pyrenean road climb again without thinking what other routes might be in the trees left and right.</p>\n<p>Even some mountains without sealed roads have kilometres of gravel on them and you can spend days exploring mountains you’ve never heard of.</p>\n<p>The Pic du Cabaliros anyone? An epic gravel challenge right next to the Col du Tourmalet, but for the most part totally unheard of. I can’t wait to get down there again to see what other gems still remain hidden.</p>\n<div id=\"file-43977\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/03/leroicaabus4.jpg?itok=sg9Xj436\" alt=\"\" />  </div>\n</div>\n<p><em>Tuscany, Italy</em></p>\n<h4>Joe Robinson, Digital Editor: Tuscany, Italy</h4>\n<p>I have a confession to make, reader. At night, when I’m lying in bed, and I begin to drift off to sleep and allow my mind to wander into fantasy, I often imagine how much better life would be if I were Italian.</p>\n<p>Honestly, I think Italy is the greatest place on earth and I think my life would be infinitely better if I lived there. The culture, the football, the food, the lifestyle, the cycling.</p>\n<p>In fact, I revert to this fantasy so much, I’ve built a vast fictitious world in my head in which I can picture every little detail of this parallel universe down to the football club my fake Italian family has always supported – it’s Sampdoria.</p>\n<p>In that fantasy, I’m almost always riding a road bike, of course. It’s a carousel of Colnagos, Bianchis, De Rosas, Cinellis, all fitted with full Campagnolo groupsets and wheels, naturally.</p>\n<p>And where I’m riding often changes too. Sometimes I’m cruising along the sun-stroked Ligurian coastline, on other occasions I’m dancing up the limestone peaks of the Dolomites. But the majority of the time I’m in Italy’s true gem, Tuscany.</p>\n<p>That’s because, for me, Tuscany is the best place, not just in Italy, but in the world to ride a bicycle.</p>\n<p>Sure, it doesn’t have the breathtaking beauty of the Italian Alps or the imposing stature of the Dolomites. Nor does it possess the drama of the French Alps or the undeniable history of Flanders. But there is something about this region, tucked away in the middle of Italy, that just sucks me in.</p>\n<p>To call Tuscany’s landscape picturesque would be an understatement. The rolling patchwork of vineyards that are dissected by a mixture of ‘<em>strade bianche</em>’ (white roads) and pristine black tarmac, all lined with Cypress trees, is handsome enough to sit on the wall of any art gallery. All you have to do is watch the Strade Bianche pro races and you’ll understand what I mean.</p>\n<p>Acting as regular markers between these fields are small towns which hosted as the heartland of Italy’s renaissance period of the 15th century. These small hubs of life are built around narrow streets, centred on tiny little cafes and coffee shops serving perfect espresso and panini, the ideal replenishment for any cyclist. Take Gaiole in Chianti as one example – the annual host town for the L’Eroica vintage bike sportive – it is so nice, Forbes ranks it first in its list of ‘idyllic places to live in Europe’.</p>\n<p>Then you’ve got the Chianti wine and the Florentine steak. I’m salivating.</p>\n<p>Honestly, I could chew your ear off all day about cycling in Tuscany but I’d rather be chewing on one of those Florentine steaks having just finished 160km in the glorious sunshine.</p>\n<h4>Read more about cycling in Tuscany</h4>\n<p><a href=\"/in-depth/1537/strade-bianche-sportive-a-lesson-in-humility-on-the-white-roads-of-tuscany\">Strade Bianche sportive</a>  <br />\n<a href=\"/reviews/4018/time-machines-modern-vintage-bikes-ride-test\">Modern vintage bikes ride test</a>  <br />\n<a href=\"/in-depth/7524/times-gone-by-leroica-review\">L'Eroica review</a></p>\n<div id=\"file-21984\" class=\"file file-image file-image-jpeg file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2018/07/hc_climb_alpe_dhuez_01.jpg?itok=WZZhpFoQ\" alt=\"\" />  </div>\n</div>\n<p><em>Alpe d'Huez, France</em></p>\n<h4>Will Strickson, Editorial Assistant: French Alps</h4>\n<p>As the newest and youngest member of the team, I’ve never ridden a col of any kind, my legs have only faced mild British and insignificant French hills. What better way to break my duck than by taking on the most famous climbs in cycling. It could end up looking like Bambi on ice but what’s riding your bike without a challenge?</p>\n<p>Give me the 21 hairpin bends of Alpe d’Huez. Give me the barren peak of Mont Ventoux. The closed roads of the Col de la Loze. The altitude of the Col de la Bonette. The Télégraphe, the Galibier, the Madeleine, the Izoard, the Colombière, the Croix de Fer, the Iseran, the list of legends goes on.</p>\n<p>It doesn’t take an explanation of their terrain or history to understand why this is my choice and that says it all. The sport as we know it comes from these mountains so riding them is a rite of passage for the modern cyclist and cresting them takes priority over any other place in the world.</p>\n<p>Ease of access also helps. Once all restrictions are lifted all it takes is a couple of trains (or a car) to get from St Pancras to southeast France and then the adventure begins. You could do Mont Ventoux and back in a day if you’re in a rush or need to return your Santander bike.</p>\n<p>Ideally I could tick them off over the course of a few weeks in the summer, enjoying the sunshine and the delights of each <em>département</em> along the way featuring countless cafés and maybe some commemorative canard.</p>\n<p>Part of cycling’s charm that’s often highlighted is the ability for amateurs to ride the same routes as the pros and picture themselves in the midst of it all. Maybe I’ll run up Ventoux. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/destinations\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Destinations</a></div>    </div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"c854d5c01d572ba9e6b60b07b40c3b736f2f050719df98664a6e118408242692","category":"Cycling"}