{"title":"The synergistic impact of Universal Health Coverage and Global Health Security on health service delivery during the Coronavirus Disease-19 pandemic: A difference-in-difference study of childhood immunization coverage from 192 countries","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003205","date":1715349600000,"content":"<p>by Sooyoung Kim, Tyler Y. Headley, Yesim Tozan</p>\r\n\r\nUniversal Health Coverage (UHC) and Global Health Security (GHS) are two high-priority global health agendas that seek to foster health system resilience against health emergencies. Many countries have had to prioritize one agenda over the other due to scarce resources and political pressures. To aid policymakers’ decision-making, this study investigated the individual and synergistic effects of countries’ UHC and GHS capacities in safeguarding essential health service delivery during the COVID-19 pandemic. We used a quasi-experimental difference-in-difference methodology to quantify the relationship between 192 countries’ progress towards UHC and GHS and those countries’ abilities to provide 12 essential childhood immunization services between 2015 and 2021. We used the 2019 UHC Service Coverage Index (SCI) to divide countries into a “high UHC group” (UHC SCI≥75) and the rest (UHC SCI 75), and similarly used the 2019 GHS Index (GHSI) to divide countries into a “high GHS group” (GHSI≥65) and the rest (GHSI&lt;65). All analyses were adjusted for potential confounders. Countries with high UHC scores prevented a 1.14% (95% CI: 0.39%, 1.90%) reduction in immunization coverage across 2020 and 2021 whereas countries with high GHSI scores prevented a 1.10% (95% CI: 0.57%, 1.63%) reduction in immunization coverage over the same time period. The stratified DiD models showed that across both years, high UHC capacity needed to be augmented with high GHS capacity to prevent a decline in immunization coverage while high GHS alone was able to safeguard immunization coverage. This study found that greater progress towards both UHC and GHS capacities safeguarded essential health service delivery during the pandemic but only progress towards GHS capacity was both a necessary and likely sufficient element for yielding this protective effect. Our results call for strategic investments into both health agendas and future research into possible synergistic effects of the two health agendas.","author":"Sooyoung Kim","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"c8568ee3d7dd00efe6966036c41fa15ed678896afaa1df7db169636c8c8e40b5","category":"Environment"}