{"title":"Lupine-induced crooked calf syndrome: mitigation through intermittent grazing management of cattle","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae079/7666265?rss=1","date":1715040000000,"content":"<span><div>Abstract</div>Lupines are responsible for a condition in cattle referred to as “crooked calf syndrome” (CCS) that occurs when pregnant cattle graze teratogenic lupines. A proposed management strategy to limit these types of birth defects includes utilizing an intermittent grazing schedule to allow short durations of grazing lupine-infested areas interrupted by movement to a lupine-free pasture. The objective of this study was to determine if an intermittent schedule of ten continuous days of lupine treatment followed by 5 d off treatment would be sufficient to decrease, or prevent, the incidence of lupine-induced malformations. Continuous dosing of the teratogenic lupine (<span>Lupinus leucophyllus</span>) to pregnant cows for 30 d during the most susceptible stage of pregnancy (gestation days 40 to 70) resulted in severe skeletal birth defects in their calves. However, intermittent dosing of the teratogenic lupine demonstrated that interrupted intake of lupine reduced the severity, or eliminated, permanent skeletal malformations in calves born to cows dosed lupine. Toxicokinetic and ultrasound data demonstrated a clear inverse correlation between serum anagyrine (the primary teratogenic alkaloid in some lupines) concentrations in the dam and fetal movement. In the intermittent group, fetal movement quickly returned to normal after lupine feeding stopped and remained normal until lupine treatment resumed. Therefore, interrupting lupine intake for at least 5 d through an intermittent grazing program could reduce the severity of the CCS. Furthermore, this method would allow ranchers to move cattle back into lupine pastures after a brief interruption, which would allow for more efficient utilization of forage resources.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"c856986bf1935d532d41224ef3ce5f807027cbd0cf58e1623a3d5eab7d6bbca2","category":"Environment"}