{"title":"Our Long National iOS 15 Safari Beta Nightmare Is Over","link":"https://www.macrumors.com/2021/08/17/everything-new-in-ios-15-beta-6/","date":1629328129000,"content":"\n<p>Juli Clover, again:</p>\n\n<blockquote>\n  <p>Apple in iOS 15 beta 6 has added a toggle to move the Safari\naddress bar to the top of the interface, which returns Safari to\nan iOS 14-like design and mitigates all of the Safari changes\nintroduced in earlier betas.</p>\n\n<p>Those who prefer the bottom bar can still opt to have that toggled\non with the Tab Bar view, but Apple has also changed the look and\nthe url bar at the bottom has been merged with a dedicated control\npanel that does away with trying to merge all page management\noptions into a single address bar view.</p>\n</blockquote>\n\n<p>I was a little worried when beta 5 shipped last week and Safari’s interface was unchanged, but beta 6’s changes are very good.</p>\n\n<p>The initial iOS Safari 15 design failed in two big ways. First and foremost, Apple tried to squeeze <a href=\"https://daringfireball.net/linked/2021/07/27/safari-15b4-toolbar-viticci\">two horizontal bars’ worth of controls into a single bar</a>. Safari needs two toolbars. Second, the whole “floating toolbar” thing looked cool but wasn’t usable.</p>\n\n<p>But they didn’t have to give up moving the address bar to the bottom of the screen. By default, that’s where it’s going to be on iOS 15. They also kept the side-to-side swiping for switching between tabs, if you keep the tab bar at the bottom of the screen.</p>\n\n<p>In a very real sense, the system worked. It’s <em>good</em> that Apple tried something ambitious and original with the layout for Safari on iPhone. The reason for the trend toward moving more navigation controls to the bottom of the screen is obvious: our phones are bigger than ever (iPhone 12 Mini aside), and our hands aren’t growing. It’s also good that Apple was receptive to the feedback from those using the developer and public betas. They listened, they fixed the design to address the problems, and here we are, with a layout for Mobile Safari that I think is better than ever. (I hedge with “I think” only because it just shipped — my opinions aren’t fully formed.)</p>\n\n<p>The unusual part is that we got to see Apple’s design process play out in public. The Safari team has been kept busy this summer. (There <em>has</em> to be one hell of backstory here, right?) There was a certain pessimism amongst some who perceived the problems with the original iOS 15 Safari design, simply because Apple seldom makes drastic UI changes between their unveiling at WWDC in June, and when they officially ship in the fall. But seldom isn’t never.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/08/18/ios-15-safari-beta-6\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c85901a947cda420cf2654c00965730df364c8d26c1bd83e5ce85230efb1ef7b","category":"Tech"}