{"title":"Itaconic acid inhibits nontuberculous mycobacterial growth in pH dependent manner while 4-octyl-itaconic acid enhances THP-1 clearance of nontuberculous mycobacteria <i>in vitro</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303516","date":1715349600000,"content":"<p>by Paul Breen, Madsen Zimbric, Lindsay J. Caverly</p>\r\n\r\nIncreasingly prevalent, nontuberculous mycobacteria (NTM) infections affect approximately 20% of people with cystic fibrosis (CF). Previous studies of CF sputum identified lower levels of the host metabolite itaconate in those infected with NTM. Itaconate can inhibit the growth of <i>M</i>. <i>tuberculosis</i> (MTB) <i>in vitro</i> via the inhibition of the glyoxylate cycle enzyme (ICL), but its impact on NTM is unclear. To test itaconic acid’s (IA) effect on NTM growth, laboratory and CF clinical strains of <i>Mycobacterium abscessus</i> and <i>Mycobacterium avium</i> were cultured in 7H9 minimal media supplemented with 1–10 mM of IA and short-chain fatty acids (SCFA). <i>M</i>. <i>avium</i> and <i>M</i>. <i>abscessus</i> grew when supplemented with SCFAs, whereas the addition of IA (≥ 10 mM) completely inhibited NTM growth. NTM supplemented with acetate or propionate and 5 mM IA displayed slower growth than NTM cultured with SCFA and ≤ 1 mM of IA. However, IA’s inhibition of NTM was pH dependent; as similar and higher quantities (100 mM) of pH adjusted IA (pH 7) did not inhibit growth <i>in vitro</i>, while in an acidic minimal media (pH 6.1), 1 to 5 mM of non-pH adjusted IA inhibited growth. None of the examined isolates displayed the ability to utilize IA as a carbon source, and IA added to <i>M</i>. <i>abscessus</i> isocitrate lyase (ICL) decreased enzymatic activity. Lastly, the addition of cell-permeable 4-octyl itaconate (4-OI) to THP-1 cells enhanced NTM clearance, demonstrating a potential role for IA/itaconate in host defense against NTM infections.","author":"Paul Breen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c85cf34fca8c823f85ae2dd469cc8b447f77bcd05fd0b8bf1c5c0e8796f45664","category":"Interdisciplinary"}