{"title":"Ecological and geological security risk assessment of underground space development in cold and arid canyon cities—Taking Ping'an District, Haidong City, Qinghai Province, as an example","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11113?af=R","date":1724569200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9aa6cac1-6ba4-4b6c-aecc-1ac7c58d1e28/wer11113-toc-0001-m.png\" alt=\"Ecological and geological security risk assessment of underground space development in cold and arid canyon cities—Taking Ping'an District, Haidong City, Qinghai Province, as an example\" />\n<p>The ecological and geological problems caused by the opening of underground spaces in canyon-type cities are serious. This article takes Haidong City as an example and establishes a method and system for ecological and geological safety risk assessment in canyon-type cities.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The ecological and geological problems caused by the rise of groundwater level due to the development of underground space in cold and arid canyon cities are particularly typical. Reasonably assessing the ecological and geological security risks of utilizing underground space is conducive to reducing the occurrence of ecological and geological problems during the construction and operation of underground engineering projects. Taking Ping'an District of Haidong City as an example, the topography and geomorphology of the research area were investigated in the field, and the distribution of topography and geomorphology in the research area was understood; through geological drilling and geotechnical engineering testing, the distribution of different strata in the research area was obtained; through pumping and seepage experiments, the recharge, runoff, and discharge relationship between surface water and groundwater in the research area and the water abundance of different strata are obtained, and the causes and mechanisms of geological safety risks in forest and grassland ecosystems, farmland ecosystems, and human settlements ecosystems were analyzed based on literature. Corresponding ecological geological safety risk assessment index systems and methods were established, and the ecological geological safety risks before and after the development of underground rail transit projects along both banks of the Huangshui River in the study area were evaluated.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe development of underground space in canyon type cities can easily lead to ecological and geological problems.\nTaking Haidong City, Qinghai Province, as an example, this study investigates the causes of ecological and geological problems caused by the development of underground spaces in canyon type cities.\nAn ecological geological security risk assessment index system and method for canyon-type cities were established.\nAn evaluation was conducted on the ecological and geological safety risks before and after the development of the underground rail transit projects on both sides of the research area.\n</p>","author":"Shuaiwei Wang, \nWeichao Sun, \nHongming Peng, \nYoujing Yuan, \nXiuyan Wang, \nChangli Liu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"c864f8d96dd982da6447808dc355a9b5f125d9f9e485d010598a12194db0e553","category":"Environment"}