{"title":"Strengthening the microbial community and flavor structure of jiupei by simulating strong‐aroma baijiu fermentation with Bacillus velezensis DQA21","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13373?af=R","date":1708521309000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Bacillus velezensis</i> DQA21 is a functional strain used in the fermentation process of strong-aroma baijiu; however, its specific role in the process is still unclear.</p>\n<h2>RESULTS</h2>\n<p>In this study, specific roles of <i>B. velezensis</i> DQA21 in the fermentation process were explored. Bioaugmentation of <i>B. velezensis</i> DQA21 increased the diversity and abundance of the bacterial community during the first 32 days of fermentation and significantly inhibited the diversity and richness of the fungal community during days 12 to 32. According to cluster analysis, changes in the microbial community structure were observed during fermentation, and the fermentation process could be divided into two stages: stage I, days 0–12; and stage II, days 12–45. Additionally, the microbial community structures during the two fermentation stages were significantly different. Co-occurrence analysis showed that bioaugmentation with <i>Bacillus</i> increased the correlation between microorganisms in jiupei and had a significant impact on the overall network structure of the microbial community. In addition, <i>Bacillus</i> significantly increased the production of flavor substances in jiupei, causing the total esters, total alcohols, and total acids contents to increase by 19.1%, 81.1%, and 25.9% respectively.</p>\n<h2>CONCLUSION</h2>\n<p>The results suggested that bioaugmentation with <i>B. velezensis</i> DQA21 had a strong impact on the microbial community structure in strong-aroma baijiu, enhancing the volatile flavor components. Additionally, the work also provides a better understanding on the effect of augmentation on the microbial community in jiupei, which could help better regulation of solid-state fermentation in strong-aroma baijiu. © 2024 Society of Chemical Industry.</p>","author":"Wenhua Tong, \nHui Wang, \nJiawei Li, \nLingling Zhang, \nZhijiu Huang, \nYing Yang, \nZongwei Qiao, \nHuibo Luo, \nDan Huang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c874e3c6443c5d19e29c7543dc552f38a5e69a8abe3fea65dbad82e05b7f085e","category":"Environment"}