{"title":"Tom Marvin | Rigid gravel bikes are archaic – and three more gravel gripes","link":"https://www.bikeradar.com/features/opinion/gravel-bike-tech-opinions/","date":1690380049000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/03/RockShox-Rudy-Ultimate-XPLR-fork-Rudy-a9760a1.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"RockShox Rudy Ultimate XPLR fork for gravel bikes\" title=\"RockShox Rudy Ultimate XPLR fork - Rudy\" />                                            <p>23 years of mountain biking – 10 of which have been as a tester for <em>MBUK</em> and BikeRadar – have taught me a few things about what makes a good off-road bike.</p>\n<p>However, I’ve also done plenty of road cycling – in fact, the first few years in my role here were firmly under Warren Rossiter’s wing, rattling out plenty of words about – and miles on – curly bars.</p>\n<p>That I eventually caught the gravel bug should come as no surprise, but my foot is still firmly in the mountain bike camp as a writer, reviewer and rider.</p>\n<p>That off-road first mindset often leaves me scratching my head when I survey the world of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> today.</p>\n<p>Unlike <a href=\"https://www.bikeradar.com/features/tech/mountain-bike-game-changers/\">mountain bike tech</a>, which has changed immensely in even the last 10 years, the trajectory of gravel tech has been dominated by technophobe roadie purists.</p>\n<p>The roadie-inspired tech that’s wholly inappropriate for most <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">gravel riding</a> has also proliferated, adding no meaningful improvement to the riding experience.</p>\n<p>Some myths also persist around exactly what gravel bikes are and what purpose they serve, and it never ceases to wind me up.</p>\n<p>Summing all of that up, these are my top controversial gravel bike tech opinions.</p>\n\n<h2>1. Gravel bikes without suspension are archaic</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Niner MCR 9 RDO full-suspension gravel bike\" title=\"Niner MCR 9 RDO\" /></div><div><figcaption><span><i></i> Suspension-equipped gravel bikes are the future.</span></figcaption><span> <i>Ben Duke</i></span></div>\n<p>As far as I can tell, (most) gravel bikes are the only vehicle designed for off-road terrain without some sort of suspension.</p>\n<p>Heck, even super-smooth surface-going vehicles such as F1 cars have a bit of bounce.</p>\n<p>The science is pretty clear – suspension systems isolate the bike and rider from the bumps and lumps under the tyres. This smoothes the way, boosting comfort and control.</p>\n<p>They also enable your tyres to remain in contact with the ground, meaning that lovely sticky rubber you’ve invested plenty of cash in can do its job properly.</p>\n<p>The result is you go further and faster, for the same effort – surely everyone wants that…</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rå Valravn steel gravel bike with SRAM XPLR groupset, RockShox Rudy Ultimate XPLR fork and RockShox Reverb AXS XPLR dropper post\" title=\"Rå Valravn steel gravel bike with SRAM XPLR groupset, RockShox Rudy Ultimate XPLR fork and RockShox Reverb AXS XPLR dropper post\" /></div><div><figcaption><span><i></i> Would you be happy doing this on a rigid gravel bike?</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Despite this, gravel bikes (and their riders) have been slow to adopt suspension.</p>\n<p>Fox, RockShox, Lauf, SR Suntour and others all offer <a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-suspension/\">gravel suspension forks</a> but, in my experience, they are rarely seen in the wild. This is a great shame.</p>\n<p>If gravel riders want to go faster in greater comfort and with more control, the future is suspended.</p>\n<h2>2. Go electronic</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM Rival eTap AXS / GX Eagle AXS mullet drivetrain on Giant Revolt X\" title=\"SRAM Rival eTap AXS / GX Eagle AXS mullet drivetrain on Giant Revolt X\" /></div><div><figcaption><span><i></i> A life without gear cables is a life better lived.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>I spent a lot of time last winter grinding through the slop on my gravel bike.</p>\n<p>My bike would be caked in muck for hours on end and, when I got home, I would hastily spray the mud off with a hose before chucking it in the garage with minimal further maintenance.</p>\n<p>In years gone by, such abuse would have resulted in gritty, lazy shifting, with my fingers working overtime to push a lever, grimly pulling a cable through its housing.</p>\n<p>Fortunately, <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic drivetrains</a> have consigned such miserable shifting experiences to the history books.</p>\n<p>So long as you remember to charge the battery, your shifting should be as consistent as the day you fitted it, regardless of how careless your maintenance is.</p>\n<p>This is, of course, true of electronic road and <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">mountain bike groupsets</a> too, but the advantages have been most apparent when testing gravel bikes equipped with SRAM’s electronic gravel bike groupsets.</p>\n<p>Shifting is as light as you could ever wish and, without the physical push-back of an unhappy shift lever, you can change gears in wonderful ignorance of just how knackered your drivetrain is.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"BMC Kaius ONE 01 gravel bike\" title=\"BMC Kauis 01 One - 10\" /></div><div><figcaption><span><i></i> Tom wouldn’t fancy routing gear cables through here.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Going cable-free also makes for easier maintenance, particularly on today’s increasingly complex fully integrated bikes. In my view, there are no disadvantages.</p>\n<p>I speak from a position of privilege, but I can safely say never again will I have cables on my gravel bikes.</p>\n\n<h2>3. Ditch the power meter</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Factor Ostro Gravel bike\" title=\"Factor Ostro Gravel - 01\" /></div><div><figcaption><span><i></i> Some top-end gravel bikes, such as the Factor Ostro, come with power meters.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>As should be clear, I’m not one to shy away from new tech, but <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meters</a> leave me cold.</p>\n<p>They certainly have their uses in cycling, but for 99 per cent of gravel riders, they offer no tangible improvement to the riding experience.</p>\n<p>Unless you have a coach who understands <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">how to use power for training</a> purposes, nobody really cares that your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP</a> is 370 watts, and that on your last ride you squeezed 983 watts’ max power out of your middle-aged thighs.</p>\n<p>When we throw gravel into the mix, this stuff becomes even less relevant.</p>\n<p>A lot of gravel riding involves slipping and scrabbling around off-road on narrow curly bars with tyres often wholly inappropriate for the terrain you’re on – how do you expect to get useful consistent data from that?</p>\n<p>Unless you really know what you’re doing with the data and take part in <a href=\"https://www.bikeradar.com/features/routes-and-rides/gravel-racing/\">gravel racing</a> at the highest level, leave the data for the no-surprises-here-please road world – you’re far better off spending the cash on a suspension fork and having some fun.</p>\n<h2>4. Front derailleurs are obsolete</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Giant Revolt Advanced Pro 0 gravel bike\" title=\"Giant Revolt Advanced Pro 0 - 04\" /></div><div><figcaption><span><i></i> Front derailleurs are long gone in the world of mountain biking – and for good reason.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>The front derailleur went the way of the dodo on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a> nearly a decade ago.</p>\n<p>Alongside reducing drivetrain complexity, ditching the <a href=\"https://www.bikeradar.com/advice/buyers-guides/front-derailleur/\">front derailleur</a> enabled engineers to design mountain bikes with shorter rear ends, better suspension linkages, altered seat tube profiles and improved mud clearance.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains</a> have also made their way to gravel bikes and I think their wholesale adoption could bring similar benefits.</p>\n<p>Look at the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/lauf-seigla-review/\">Lauf Seigla</a> as an example. It’s a true gravel race bike, built for events such as <a href=\"https://www.bikeradar.com/features/tech/unbound-2023-gravel-tech-gallery/\">Unbound</a>, yet it has snappy chainstays, loads of tyre clearance and clean lines. Ditching the front derailleur mounts played an important role in enabling this design.</p>\n<p>Purists will say they need two rings up front to get the close ratios found commonly on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bikes</a>. However, modern gravel bike drivetrains make that a moot point.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"lauf seigla stood up sprinting\" title=\"lauf seigla stood up sprinting\" /></div><div><figcaption><span><i></i> Tom riding the Lauf Seigla.</span></figcaption><span> <i>Snorri Tryggvason / Lauf</i></span></div>\n<p>In terms of range, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-grx-review/\">Shimano’s GRX groupset</a> will enable you to run up to a 46t sprocket (though that range looks set to expand with the likely imminent arrival of new GRX), while SRAM’s wireless and wired options now go up to a whopping 52t.</p>\n<p>I can’t believe anyone truly needs more range than that.</p>\n<p>The optimisation of <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a> steps and move to 12-speed has also made the front derailleur less important. Is that very slightly sub-optimal cadence on the constantly shifting terrain that characterises gravel riding really an issue?</p>\n<p>If you really need closer ratios, I reckon the future is not with front derailleurs but the likes of the <a href=\"https://www.bikeradar.com/news/classified-parcours-partnership/\">Classified Powershift two-speed rear hub</a>.</p>\n<p>This offers front-derailleur like functionality in a much neater package that doesn’t impact frame design.</p>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"c87c31ff4236647de3e2975c1c56df5f93f28466e99fe70a804d266954862512","category":"Cycling"}