{"title":"Climate Change Impacts on Viticulture in Italy: Insights from Historical and Future Scenarios Across Administrative Areas, Latitudes, and Elevations","link":"https://www.preprints.org/manuscript/202406.1573/v1","date":1719224832000,"content":"(1) Background: The aim of the work was to characterize the climatic evolution and change based on the Multi Criteria Classification through the dynamics of bioclimatic indices in viticulture across Italy and its regional administrative boundaries, focusing on latitudes and elevations. (2) Methods: The impact of climate change on viticulture in Italy was analysed and spatialized with reference to historical data from 1991 to 2021 and to the Future Scenarios up to 2080 assumed by SSP2-4.5 and SSP5-8.5, taking into account 13 GCMs. (3) Results: The bioclimatic indices have all shown a significant trend in the historical period, with an increase in temperature and a decrease in precipitation, reflecting their effects on the entire Italian territory with respect to HI, up to 44°N for CI and up to 46°N for DI, regardless of altitude. The Future Scenarios highlighted a shift towards the warmer classes of the two temperature-based indices (HI and CI) for both SSPs, especially for altitudes up to 900 m a.s.l.. The DI-based classification based on DI remained relatively stable in Italy over time, although DI values will become increasingly negative in the near future. (4) Conclusions: The climate in Italy is warming, especially in the south and in the coastal regions. By 2080, more areas will be “Very Hot” with “Warm Nights.” Drought will also increase and have a negative impact on viticulture. The importance of higher latitudes and altitudes in mitigating the effects of climate change justifies the continuing trend towards the relocation of vineyards as a medium-term solution and as an alternative to targeted cultivation methods that must be adopted in the short-term to safeguard the suitability of an area to quality viticulture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c889f453cb254289482c063c3f6382fc73d292312f50239dd55153091a2c2ac5","category":"Interdisciplinary"}