{"title":"Rapid and Simple Morphological Assay for Determination of Susceptibility/Resistance to Combined Ciprofloxacin and Ampicillin, Independently, in Escherichia coli","link":"https://www.preprints.org/manuscript/202405.1839/v1","date":1716886032000,"content":"Current antibiograms cannot discern the particular effect of a specific antibiotic when the bacteria are incubated with a mixture of antibiotics. To prove that this task is achievable, Escherichia coli strains were treated with ciprofloxacin for 45 min, immobilized on a slide and stained with SYBR Gold. In susceptible strains, the nucleoid relative surface started to decrease near the MIC, being progressively condensed as dose increased. The shrinkage level correlated with the DNA fragmentation degree. Ciprofloxacin-resistant bacilli showed no change. Additionally, E. coli strains were incubated with ampicillin for 45 min and processed similarly. The ampicillin-susceptible strain revealed intercellular DNA fragments that increased with dose, unlike the resistant strain. Co-incubation with both antibiotics revealed that ampicillin did not modify the nucleoid condensation effect of ciprofloxacin, whereas the quinolone partially decreased the background of DNA fragments induced by ampicillin. Sixty clinical isolates, with different combinations of susceptibility-resistance to each antibiotic, were co-incubated with the EUCAST breakpoints of susceptibility of ciprofloxacin and ampicillin. The morphological assay correctly categorized all the strains for each antibiotic in 60 min, demonstrating the feasible independent evaluation of a mixture of quinolone and beta-lactam. The rapid phenotypic assay may shorten the incubation times and necessary microbial mass currently required for evaluation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c88c2b8f3f7a74c483a6a05fec3babafe21d8c2910ddfe72e0c24d89a569508b","category":"Interdisciplinary"}