{"title":"Sam Bennett unsure about the Tour de France. Will Cavendish replace him?","link":"https://cyclingtips.com/2021/06/sam-bennett-unsure-about-the-tour-de-france-will-cavendish-replace-him/","date":1623494294000,"content":"<p>In his weekly column in Het Nieuwsblad, Patrick Lefevere gave another insight into the workings of Deceuninck – Quickstep. The Belgian team manager expressed his doubts regarding Sam Bennett being ready for the Tour de France that starts two weeks from Saturday. The winner of the green jersey in 2020 sustained a knee injury while training during the first weekend of June.</p>\n\n\n\n<p>“Sam has an inflammation of the patella tendon,” Lefevere explains. “That is a persistent injury. We were planning on building the Tour de France team around him but I don’t know if he will the Tour de France. He will have to rest until Monday at least. We don’t really have a plan B when it comes to a sprinter.” </p>\n\n\n\n<p>Fabio Jakobsen is likely not ready for a debut in the Tour de France after his accident at the Tour of Poland last year. He hopes to return to the Grand Tour chaos at the Vuelta a España. Another option for the Tour de France is Mark Cavendish, although the Manxman has expressed he doesn’t want to race the Tour de France with the current minimum contract he has. </p>\n\n\n\n<p>“I asked him during our dinner Sunday night if he wanted to do a Grand Tour and he told me: ‘not at this salary rate.’ That might sound cynical but I understand him,” Lefevere explains. “Mark is 35 and joined the team last minute. There was no question at all that he would do a Tour de France. He signed a minimum contract because we had minimal expectations but things have changed. He showed he still has got the speed.” </p>\n\n\n\n<p>Cavendish started 12 Tour de Frances and won 30 stages, the most recent being in 2016. He is approaching the all-time record held by Eddy Merckx for most Tour de France stage wins. Merckx won 34 Tour de France stages during his career. </p>\n\n\n\n<p>“I understand he doesn’t want to do a Tour de France. To him this means riding with pressure, to be under a magnifying glass all the time. Everyone will start about that record. It is not fair to let a rider with a minimum contract take on the role as first sprinter on the team. I agree with Mark on this, especially also because he hasn’t done a full and uninterrupted race program this year.” </p>\n\n\n\n<p>Lefevere has thought about renewing Cavendish’s contract before the Tour with better terms. </p>\n\n\n\n<p>“At the level [he has now] Mark wants to continue for at least one year more. We will sit down and talk it over again together.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/sam-bennett-unsure-about-the-tour-de-france-will-cavendish-replace-him/\">Sam Bennett unsure about the Tour de France. Will Cavendish replace him?</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c892711a78dc197aee10eb90216ce937b8646f4ef93c1eaee68f78de32499d1f","category":"Cycling"}