{"title":"Apple's iMessage May Dodge EU Regulatory Demand for Interoperability","link":"https://www.macrumors.com/2023/12/06/apple-imessage-dodge-eu-regulations/","date":1701869789000,"content":"Apple's iMessage chat service may dodge EU regulatory demands for platform interoperability after all. <em><a href=\"https://www.bloomberg.com/news/articles/2023-12-06/apple-imessage-set-to-avoid-eu-s-digital-dominance-crackdown\">Bloomberg</a></em> reports that an investigation by the bloc's antitrust watchdog has tentatively concluded that the chat service is not popular enough with business users to warrant being subject to the new rules.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/01/European-Commisssion.jpg\" width=\"1080\" height=\"719\" />\r<br />\nThe EU has been <a href=\"https://www.macrumors.com/2022/11/01/dma-eu-law-could-force-major-changes-apple/\">working on legislation</a> under the Digital Markets Act (DMA) that would have required Apple to make changes to iMessage to make it available on other platforms. The rules will apply to tech giants that meet its \"gatekeeper\" criteria, force them to open up their various services and platforms to other companies and developers.\r<br />\n\r<br />\nThe interoperability rules theoretically mean that Meta apps like WhatsApp or Messenger could request to interoperate with Apple's iMessage framework, and Apple would be forced to comply within the EU. But today's report suggests iMessage may fall outside the legislation because it is not widely used by businesses.\r<br />\n\r<br />\nThe report notes that the possible reprieve for Apple is part of a five-month market investigation by the European Commission, and Apple's exemption has not and will not be officially confirmed until the probe is completed in February.\r<br />\n\r<br />\nRegardless of the investigation's conclusions, the DMA will likely still force Apple to make major changes to the way the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, and <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> work in Europe. For example, it is expected to allow users to install third-party app stores and side-load apps, and give developers the ability to promote their offers outside the ‌‌‌App Store‌‌‌ and use third-party payment systems.<div>Tags: <a href=\"https://www.macrumors.com/guide/imessage/\">iMessage</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/06/apple-imessage-dodge-eu-regulations/\">Apple's iMessage May Dodge EU Regulatory Demand for Interoperability</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-imessage-may-dodge-eu-regulatory-demand-for-interoperability.2412963/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c8923b8e7c770966b14c505d7d93d38df2bd3d58ba29c83c646c03190fc55119","category":"Apple"}