{"title":"Pathology and drug susceptibility study of an outbreak of bacterial pathogen infecting the Chinese soft‐shelled turtle (Pelodiscus sinensis)","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16057?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>The Chinese soft-shelled turtle (<i>Pelodiscus sinensis</i>) is a freshwater softshell turtle native to East Asia. It is a choice of food and tonic in China, Taiwan and other Asian countries and is commonly cultured in ponds, lakes and canals. This study aimed to study the aetiology of a deadly disease outbreak among these turtles in Jiangxi Province of China in 2020 and 2021. By performing an aseptic dissection of symptomatic and moribund <i>P. sinensis</i>, a dominant strain (No.: ZF2) was isolated from livers, and studies were carried out to ascertain the biological status, pathogenicity and pathological characteristics of the isolate. For isolate identification, a morphological observation, physiological and biochemical analysis, 16S rRNA and <i>gyr</i>B gene sequencing, and phylogenetic analysis were performed. Other experiments were also carried out simultaneously, such as infection experiments, histopathological observation, virulence gene detection and drug sensitivity. Through traditional and molecular biological methods study with the pathogenic strain, ZF2 was identified as <i>Aeromonas veronii</i>. The results of the virulence gene test showed that ZF2 carried three virulence genes, <i>aer</i>, <i>ast</i> and <i>act</i>. Histopathological observation revealed that various internal organs were severely damaged after infection and manifested as liver ischemia and whitening, intestinal chorion shedding, glomerular congestion and splenic lymphocyte proliferation. After the drug sensitivity test results, the ZF2 strain was identified to be sensitive to nine drugs, including cefradine, neomycin, minocycline and enrofloxacin. It was intermediate or resistant to other drugs.</p>","author":"Xaohui Dai, \nJun Hu, \nFeng Jin, \nDi Wu, \nShaoqing Jian, \nAnwar Zahid, \nBeijuan Hu, \nYijiang Hong","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"c8a3ab459143707f2db65365f9166c90c6a4e90d6da254619c9b665b43f6a868","category":"Environment"}