{"title":"Spatio-temporal analysis of seismic potential in the Himalayas and its nearby region: an insight from seismicity and earthquake susceptibility index","link":"http://link.springer.com/10.1007/s11600-023-01210-5","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>The Himalayan region and its surrounding area are one of the most seismically active zones in the world which have significant economic and societal impact. It governs the seismicity of highly populous countries like India, China, Pakistan, Nepal, Bhutan and Afghanistan which account for more than 40% population of the world. Therefore, the complex interaction between seismic parameters and transient seismic events needs to be thoroughly addressed at the regional scale. This study highlights the spatial distribution of earthquake hazard parameters and the temporal variation in seismicity of the Himalayas and its nearby regions by employing the maximum likelihood approach using historical records as well as instrumentally recorded earthquake data of the years 1900–2021. An empirical relation is developed to convert the body wave magnitude (<em>M</em><sub>b</sub>) and surface wave magnitude (<em>M</em><sub>s</sub>) to moment magnitude (<em>M</em><sub>w</sub>). The seismic parameters, namely maximum regional magnitude (<em>M</em><sub>max</sub>), <em>b</em>-value, and mean seismicity rate (<em>λ</em><sub>0</sub>), are estimated for 13 defined zones. Further, the seismic behaviours of the study area are evaluated through the return periods (RP) of earthquakes and the fractal dimension (<em>D</em><sub>c</sub>) of the individual zone. Considering the temporal variation of seismicity and RP of <em>M</em><sub>w</sub> ≥ 6, a new index , i.e. earthquake susceptibility index (ESI<sub>6</sub>), is developed to identify the zones which are susceptible to <em>M</em><sub>w</sub> ≥ 6 earthquakes. The zones: Central Himalayas 2 (CH2), Western Himalayas (WH), North of MCT 1 (NMCT1) and South of MCT 2 (SMCT2) are identified to be highly susceptible to earthquakes of <em>M</em><sub>w</sub> ≥ 6. The present analysis will motivate researchers and engineers from government and non-government organizations to collaborate for improved policy making in the seismically active Himalayan region concerning land-use planning, insurance, and catastrophe preparation.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"c8a34fe7cf8c42e004c8a356acae9f0a7123e3ea4b71d06bea8389527ed042b8","category":"Environment"}