{"title":"Molecular epidemiological characteristics, variant spectrum and genotype-phenotype correlation of glucose-6-phosphate dehydrogenase deficiency in China: A population-based multicenter study using newborn screening","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310517","date":1729605600000,"content":"<p>by Minyi Tan, Xiulian Liu, Yinhong Zhang, Yifan Yin, Ting Chen, Yulin Li, Lulu Feng, Bo Zhu, Chunjing Xu, Chengfang Tang, Meng Sun, Liyun Jia, Weiwei Jin, Chunna Fan, Hui Huang, Xiaohua Wang, Jizhen Feng, Hui Zou, Lianshu Han, Jingkun Miao, Baosheng Zhu, Cidan Huang, Yonglan Huang</p>\r\nBackground and aims <p>Newborn screening (NBS) for glucose-6-phosphate dehydrogenase (G6PD) deficiency by biochemical tests is being used worldwide, however, the outcomes arising from combined genetic and biochemical tests have not been evaluated. This research aimed to evaluate the outcomes of application of combined genetic and biochemical NBS for G6PD deficiency and to investigate the molecular epidemiological characteristics, variant spectrum, and genotype-phenotype correlation of G6PD deficiency in China.</p> Methods <p>A population-based cohort of 29,601 newborns were prospectively recruited from eight NBS centers in China between February 21 and December 30, 2021. Biochemical and genetic NBS was conducted simultaneously.</p> Results <p>The overall prevalence of G6PD deficiency was 1.12% (1.86% for male, and 0.33% for female; 1.94% for South China and 0.08% for North China). Genetic NBS identified 10 male patients undetected by biochemical NBS. The overall positive predictive values (PPVs) of biochemical and genetic NBS were 79.95% and 47.57%, respectively. A total of 15 variants were identified, with the six most common variants being c.1388G &gt; A, c.1376G &gt; T, c.95A &gt; G, c.871G &gt; A, c.1024C &gt; T and c.392G &gt; T (94.2%). The activity of G6PD was correlated with the type and WHO classification of variants.</p> Conclusion <p>This study highlighted that combined screening could enhance the efficiency of current NBS for diagnosing G6PD deficiency. The prevalence, variant spectrum and allele frequency of G6PD deficiency vary across different regions. Our data provide valuable references for clinical practice and optimization of future screening strategies for G6PD deficiency.</p>","author":"Minyi Tan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c8a8af1c1479a9c462d2de4da7159feaba4cf1c714b5408ad6c876bbf94e0a09","category":"Interdisciplinary"}