{"title":"Anti-Müllerian hormone and fertility in women after childhood cancer treatment: Association with current infertility risk classifications","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308827","date":1723471200000,"content":"<p>by Anna Nyström, Helena Mörse, Ingrid Øra, Emir Henic, Jacob Engellau, Elinore Wieslander, Andrzej Tomaszewicz, Maria Elfving</p>\r\nBackground <p>To identify childhood cancer survivors (CCSs) at risk of premature ovarian insufficiency (POI) and impaired fertility is important given its impact on quality of life. The aim of this study was to assess ovarian markers and fertility outcomes in adult female CCSs. We used the Swedish and the PanCareLIFE classifications for infertility risk grouping.</p> Methods <p>167 CCSs, at median age 34.6 years (19.3–57.8) with a median follow-up time of 25.4 years (11.6–41.3), and 164 healthy matched controls were included in this cross-sectional study. We assessed anti-Müllerian hormone (AMH) levels, antral follicle count (AFC), ovarian volume (OV), and fertility outcomes. Based on gonadotoxic treatments given, CCSs were categorized into infertility risk groups.</p> Results <p>The median levels of AMH, AFC and OV were lower in CCSs (1.9 vs. 2.1 ng/ml, 12.0 vs. 13.0, 6.8 vs. 8.0 cm<sup>3</sup>) compared with controls, although statistically significant only for OV (<i>p</i> = 0.021). AMH levels in CCSs &lt;40 years were lower for those classified as high-risk (<i>p</i> = 0.034) and very high-risk (<i>p</i>&lt;0.001) for infertility, based on the Swedish risk classification. Similarly, AFC was reduced in the high-risk (<i>p</i>&lt;0.001) and the very high-risk groups (<i>p</i> = 0.003). CCSs of all ages showed a trend towards impaired fertility, especially in the very high-risk group. POI was diagnosed in 22/167 CCSs, of whom 14 were in the high- and very high-risk groups. The results according to the PanCareLIFE classification were similar.</p> Conclusion <p>Both the Swedish and the PanCareLIFE infertility risk classifications are reliable tools for identifying those at risk of reduced ovarian markers and fertility, as well as POI. We recommend fertility preservation counselling for patients receiving highly gonadotoxic treatments (i.e., Cyclophosphamide Equivalent Dose ≥6 g/m<sup>2</sup>, radiotherapy exposure to ovaries or stem cell transplantation) with follow-up at a young reproductive age due to the risk of a shortened reproductive window.</p>","author":"Anna Nyström","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c8aa0b240d2763beb8ebf1837e9d6735bbce517c9bb35186bb40c1aab274c615","category":"Interdisciplinary"}