{"title":"MAFLD Pandemic: Updates in Pharmacotherapeutic Approach Development","link":"https://www.preprints.org/manuscript/202405.1983/v1","date":1717054007000,"content":"With around one billion of the world's population affected, the era of Metabolic-associated fatty liver disease (MAFLD) pandemic has entered the global stage. MAFLD is a chronic progressive liver disease with accompanying metabolic disorders such as type 2 diabetes mellitus and obesity which can progress asymptomatically to liver cirrhosis and subsequently to hepatocellular carcinoma (HCC), and for which, to date there is almost no approved pharmacologic options. Because MAFLD has a very complex etiology and it affects also extrahepatic organs, a multidisciplinary approach is required when it comes to finding an effective and safe active substance for MAFLD treatment. The optimal drug for MAFLD should diminish steatosis, fibrosis and inflammation in the liver, and the winner for MAFLD drug authorisation seems to be the one that significantly improves liver histology. Saroglitazar (Lipaglyn®) was approved for Metabolic dysfunction associated steatohepatitis (MASH) in India in 2020; however, the drug is still being investigated in other countries. Despite that a pharmaceutical industry is still lagging behind to develop an ap-proved pharmacologic therapy for MAFLD, research has been recently intensified and many molecules which are underway in the final stages of clinical trials are expected to be approved in the coming few years. Already this year, the first drug (Rezdiffra™) in the United States was ap-proved via accelerated procedure for treatment of MAFLD, i.e. of MASH in adults. This review underscores the most recent information related to the development of drugs for MAFLD treatment, focusing on the molecules that have come furthest towards approval.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c8aa718e0917783e5c74ecc35a50bd6d61a8f7f673d8b837bd66d67f2f76e93b","category":"Interdisciplinary"}