{"title":"Predicting Mortality from Fungemia in Pediatric Intensive Care: A New Model Using Candida Score and Key Risk Factors","link":"https://www.preprints.org/manuscript/202406.0898/v1","date":1718256856000,"content":"Introduction: The escalating morbidity, mortality, and healthcare costs associated with invasive candidiasis pose significant challenges in pediatric intensive care units (PICUs). Conventional diagnostic methods fall short in effectiveness, while various risk factors exacerbate the prevalence of these infections. This study introduces a novel model that amalgamates the Candida Score with key predictors to enhance the specificity and applicability of mortality risk assessments for pediatric patients with fungemia.\nMethods: This retrospective cohort study aimed to develop an integrated model for estimating mortality risk in children with fungemia in PICUs. We constructed and evaluated multiple predictive models using the Candida Score and other relevant clinical and laboratory variables. The discriminative abilities of the models were assessed using the area under the receiver operating characteristic curve (AUC).\nResults: The study cohort comprised 85 pediatric patients admitted between 2016 and 2020, with a median age of 6 months and a male predominance of 62.4%. The mortality rate was 45.9%. Candida albicans was the most prevalent causative agent, accounting for 37.55% of fungemia cases. Multivariable Logistic regression revealed the duration of mechanical ventilation, and the Candida Score were significant predictors of mortality. Each additional day of ventilation increased mortality odds by 11.5% (OR = 1.115, 95% CI: 1.025-1.212, p = 0.011), while a higher Candida Score more than doubled the odds (OR = 2.205, 95% CI: 1.359-3.578, p = 0.001).The Random Forest predictive model demonstrated superior discriminative performance, with an AUC of 0.838 (95% CI: 0.738-0.917), outperforming Gradient Boosting and Logistic Regression models, which had AUCs of 0.7759 (95% CI: 0.667-0.877) and 0.7085 (95% CI: 0.589-0.813), respectively. Although the internal validation yielded satisfactory results, external validation is warranted.\nConclusion: This study presents an innovative approach for accurately assessing the risk of mortality due to fungemia in PICU patients by integrating the Candida Score with critical predictors. The Random Forest model emerged as the most effective predictive tool due to its exceptional discriminative ability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c8ae7992877444d03f4bb2169cdf0c5dcc676d32702ad6efb1e1b3e92d853442","category":"Interdisciplinary"}