{"title":"Valproic acid use is associated with diminished risk of contracting COVID-19, and diminished disease severity: Epidemiologic and <i>in vitro</i> analysis reveal mechanistic insights","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307154","date":1722607200000,"content":"<p>by Amanda Watson, Pankil Shah, Doug Lee, Sitai Liang, Geeta Joshi, Ediri Metitiri, Wasim H. Chowdhury, Dean Bacich, Peter Dube, Yan Xiang, Daniel Hanley, Luis Martinez-Sobrido, Ronald Rodriguez</p>\r\n\r\nThe SARS-CoV-2 pandemic has caused unprecedented worldwide infections from persistent mutant variants with various degrees of infectivity and virulence. The elusiveness of a highly penetrant, worldwide vaccination strategy suggests that the complete eradication of SARS-CoV-2 is unlikely. Even with the advent of new antiviral agents, the disease burden worldwide continues to exceed current preventative and therapeutic strategies. Greater interest has been placed towards the development of affordable,broadly effective antiviral therapeutics. Here, we report that the small branched-chain fatty acid Valproic acid (VPA), approved for maintenance of seizure and bipolar disorder, has a novel anti- coronavirus activity that can be augmented with the addition of a long-chain, polyunsaturated omega-3 fatty acid, Docosahexaenoic acid (DHA). An EMR-based epidemiological study of patients tested for COVID-19 demonstrated a correlation exists between a reduced infection rate in patients treated withVPA of up to 25%, as well as a decreased risk of emergency room visits, hospitalization, ICU admission,and use of mechanical ventilation. <i>In vitro</i> studies have demonstrated that VPA modifies gene expression in MRC5 cells. Interestingly, VPA correlates with the inhibition of several SARS-CoV2 interacting genes and the greater inhibition of alpha-coronavirus HCoV-229E (a “common cold” virus) and SARS-CoV2. The VPA-DHA combination activates pre-existing intracellular antiviral mechanisms normally repressed by coronaviruses. Gene expression profiles demonstrate subtle differences in overall gene expression between VPA-treated and VPA-DHA-treated cells. HCoV-229E infection caused an intensely different response with a marked induction of multiple intracellular inflammatory genes. Changes in gene expression took at least 24 hours to manifest and most likely why prior drug screens failed to identify any antiviral VPA activity despite <i>in silico</i> predictions. This report demonstrates an interaction between HDAC inhibition and the potent activation of cellular antiviral responses. A foundation now exists for a low-cost, highly effective antiviral strategy when supplemented with DHA.","author":"Amanda Watson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c8b0cd0785ea51550a1ea17ca6d0416f016df1f355324ca3d2e0b70590a5aa22","category":"Interdisciplinary"}