{"title":"Accurate assessment of macronutrients and micro‐elements of ten newly developed green gram (Vigna radiata (L.) Wilczek) cultivars grown in Uttar Pradesh, India","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13244?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Green gram is a rich source of protein, carbohydrates, dietary fibre, and minerals. However, accurate data on the nutritional composition of green gram remains scarce since most researchers reported the carbohydrate content using the ‘by difference method’. The objective of the current study is to accurately estimate the nutritional and mineral composition of green gram (<i>Vigna radiata</i> (L.) Wilczek).</p>\n<h2>Results</h2>\n<p>Ten newly developed varieties and three local varieties of green gram were subjected to proximate and mineral composition analysis. The green gram varieties differed significantly (<i>P</i> &lt; 0.05) for proximate and mineral content. From the results, they contain 62.5 to 84.6 g/kg of moisture, 28.3–37.4 g/kg of ash, 21.9–3.08 g/kg of fat, 484.6–535.7 g/kg of carbohydrate, 228.7–277.6 g/kg of protein, and 118.3–157.9 g/kg of dietary fibre. The most abundant mineral found was phosphorus, ranging 2716.66–4473.49 mg/kg followed by 3183.31–3597.61 mg/kg of potassium, 1506.51–1713.93 mg/kg of magnesium, 166.38–340.62 mg/kg of calcium, 40.16–348.79 mg/kg of iron, 27.60–34.35 mg/kg of zinc, 5.95–12.86 mg/kg of copper and 8.65–19.47 mg/kg of manganese.</p>\n<h2>Conclusion</h2>\n<p>The newly developed varieties of green gram showed high protein and dietary fibre content, while the local varieties were high in calcium and iron. Hence, both types of varieties are nutritionally significant. © 2023 Society of Chemical Industry.</p>","author":"Sumi Mekkara Nikarthil Sudhakaran, \nShreyas Elma Mathew, \nDevindra Shakappa","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c8b7ec9961761386636a34cdb854311438941bff0e78e81c0986a1f4850fd917","category":"Environment"}