{"title":"Apple Fined $150M+ By Italian Watchdog for Anti-Competitive Cooperation With Amazon","link":"https://www.macrumors.com/2021/11/23/apple-amazon-fined-italian-watchdod/","date":1637667299000,"content":"Apple and Amazon were today fined a total of more than 200 million euros ($225 million) by Italy's antitrust authority for alleged anti-competitive cooperation in the sale of Apple and Beats products, reports <em><a href=\"https://www.reuters.com/technology/italys-antitrust-fines-amazon-apple-more-than-200-mln-euros-alleged-collusion-2021-11-23/\">Reuters</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/italyapplestore.jpg\" />\r\n<br />\r\nThe fines are the culmination of an investigation that began last year over allegations that the two companies had been blocking the sale of Apple and Beats devices to resellers in order to stifle competition.\r\n<br />\r\n\r\n<br />\r\nThe Italian watchdog today said contractual provisions of a 2018 agreement between the two meant only selected resellers were allowed to sell the products on Amazon's Italian online store, which was in violation of EU rules and affected competition on prices.\r\n<br />\r\n\r\n<br />\r\nAmazon was fined 68.7 million euros, while Apple received a fine of 134.5 million euros. The watchdog also ordered the companies to end the restrictions to give retailers of genuine Apple and Beats products access to the Italian Amazon web store in a \"non-discriminatory manner.\" Both Apple and Amazon said they plan to appeal against the fines.\r\n<br />\r\n<blockquote>\"To ensure our customers purchase genuine products, we work closely with our reseller partners and have dedicated teams of experts around the world who work with law enforcement, customs and merchants to ensure only genuine Apple products are being sold,\" Apple said, denying any wrongdoing.\r\n<br />\r\n\r\n<br />\r\nIn a separate statement Amazon said it strongly disagreed with the decision of the Italian authority and that the proposed fine was \"disproportionate and unjustified.\"\r\n<br />\r\n\r\n<br />\r\n\"We reject the suggestion that Amazon benefits by excluding sellers from our store, since our business model relies on their success. As a result of the agreement, Italian customers can find the latest Apple and Beats products on our store, benefiting from a catalogue that more than doubled, with better deals and faster shipping,\" Amazon said.</blockquote>This isn't the first investigation into Apple by Italy's antitrust regulator. A previous probe looked into the company for <a href=\"https://www.macrumors.com/2018/01/19/iphone-battery-slowdowns-probes-italy-south-korea/\">iPhone battery slowdowns</a>, which the antitrust watchdog said was a form of planned obsolescence and subsequently slapped Apple with a <a href=\"https://www.macrumors.com/2018/10/24/italy-fining-apple-iphone-throttling/\">10 million euro fine</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/italy/\">Italy</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/23/apple-amazon-fined-italian-watchdod/\">Apple Fined $150M+ By Italian Watchdog for Anti-Competitive Cooperation With Amazon</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-fined-150m-by-italian-watchdog-for-anti-competitive-cooperation-with-amazon.2324572/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mc3bcuJlG0A:qe8CfhW6QlI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mc3bcuJlG0A:qe8CfhW6QlI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c8b7636da8a117329cd5a6637eaa368f4d598d4b1508d17076a95eff0451784e","category":"Apple"}