{"title":"Responses of belowground bud bank density of geophytes to environmental perturbations: a meta-analysis","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae029/7656655?rss=1","date":1713830400000,"content":"<span><div>Abstract</div>A belowground bud bank is a collection of asexual propagules produced by the underground storage organs of geophytes. Renewal through belowground bud banks is the main reproductive strategy of geophytes. The belowground bud bank density reflects the potential renewal capacity of geophyte communities. However, the effects of different perturbation regimes and habitats on the belowground bud bank density of geophytes are not comprehensively understood. Moreover, whether different types of belowground bud banks respond differently to perturbations is still unclear. For this meta-analysis, relevant papers on the effects of environmental perturbations on the belowground bud bank density of geophytes were systematically collected. The cumulative effect size of different perturbation regimes and habitats on belowground bud banks among different bud types was analyzed. Overall, the effect of environmental perturbations on belowground bud bank density was small, which may result from opposite or fluctuating responses of bud banks to different perturbations. Drought negatively affected bud bank density. Environmental perturbations decreased rhizome bud density but increased tiller bud density. In wetlands, perturbations decreased belowground bud bank density. However, no significant effect was found for other habitat types. In general, belowground bud banks of geophytes are highly resistant and resilient. Changes in belowground bud bank density depend on the type of perturbations, the habitats in which plants are distributed and the type of bud banks.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"c8be48d55c5d2aa393ebc4c00025374167c0ce1a4c2c4e2cddf5062fe2332d2f","category":"Environment"}