{"title":"On the Numerical Investigation of Natural Convection Heat Sinks Across a Wide Range of Flow and Operating Conditions","link":"https://www.preprints.org/manuscript/202410.0390/v1","date":1728293554000,"content":"Many designs for natural convection heat sinks, and semi-empirical correlations have been proposed in the recent years, but they are only valid in a limited range of Elenbaas number $El$ and were mostly tested for laminar flows. To alleviate those limits, parametric studies with 2D and quasi-3D models were carried out with ranges of Grashof numbers up to $1.55 \\cdot 10^{11}$ and Elenbaas numbers up to $3.42 \\cdot 10^7$. Ansys Fluent’s laminar, transition-SST, SST k-$\\omega$, and k-$\\epsilon$ models were applied. In addition, when used in this valid range, \\textit{i.e.} mean Elenbaas numbers, with the simplified quasi-3D model, the transition-SST model can predict better results, over-estimating the heat flux by $10$ to $15\\%$ compared to semi-empirical correlations. The 2D model was not deemed satisfying regarding turbulence models. Consequently, a quasi-3D model was developed: it appeared to be an efficient trade-off between computational time and prediction accuracy, in particular for turbulence models. New grouping factors were also found, to ensure proper dimensioning of natural convection heat sinks. They correspond to non-dimensional parameters that dictate the physical behaviour of the heat sink with respect to the semi-empirical correlations. Typically, the ratio of the spacing to the optimal spacing predicted by Bar-Cohen's correlation turned out to be an appropriate grouping factor with a threshold of $1$, above which the fins could safely be considered as isolated, thus greatly simplifying all further calculations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c8c0555f51c4a2b5d72ea4c901986c48be2f5ad4cc5afb42502687f6ca412170","category":"Interdisciplinary"}