{"title":"Surface Resistance Controls Differences in Evapotranspiration Between Croplands and Prairies in U.S. Corn Belt Sites","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035819?af=R","date":1711972440000,"content":"<h2>Abstract</h2>\n<p>Water returned to the atmosphere as evapotranspiration (<i>ET</i>) is approximately 1.6x global river discharge and has wide-reaching impacts on groundwater and streamflow. In the U.S. Midwest, widespread land conversion from prairie to pasture to cropland has altered spatiotemporal patterns of <i>ET</i>, yet there is not consensus on the direction of change or the mechanisms controlling changes. We measured <i>ET</i> at three locations within the Long-Term Agroecosystem Research network along a latitudinal gradient with paired rainfed cropland and prairie sites at each location. At the northern locations, the Upper Mississippi River Basin (UMRB) and Kellogg Biological Station (KBS), the cropland has annual <i>ET</i> that is 84 and 29 mm/year (22% and 5%) higher, respectively, caused primarily by higher <i>ET</i> during springtime when fields are fallow. At the southern location, the Central Mississippi River Basin (CMRB), the prairie has 69 mm/year (11%) higher <i>ET</i>, primarily due to a longer growing season. Differences in climate and that the CMRB prairie is remnant native prairie, while the UMRB and KBS prairies are restored, make it challenging to attribute differences to specific mechanisms. To accomplish this, we examine the energy balance using the Two-Resistance Method (TRM). Results from the TRM demonstrate that higher surface conductance in croplands is the primary factor leading to higher springtime <i>ET</i> from croplands, relative to prairies. Results from this study provide insight into impacts of warm season grasses on the hydrology of the U.S. Corn Belt by providing a mechanistic understanding of how land use change affects the water budget.</p>","author":"Adam P. Schreiner‐McGraw, \nJohn M. Baker, \nJeffrey D. Wood, \nMichael Abraha, \nJiquan Chen, \nTimothy J. Griffis, \nG. Phillip Robertson","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"c8d3138803a4bfc4383d6893a19bc52a340aad924035d1369a19f841c77f8dc8","category":"Environment"}