{"title":"Valve issues scathing reply over the facts behind a Steam antitrust case","link":"https://arstechnica.com/?p=1784203","date":1627661987000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/04/steam-data-delve-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/04/steam-data-delve.jpg\">Enlarge</a> (credit: Getty / Aurich Lawson)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Valve has issued a scathing response to <a href=\"https://arstechnica.com/gaming/2021/04/humble-bundle-creator-brings-antitrust-lawsuit-against-valve-over-steam/\">Wolfire's April lawsuit alleging anticompetitive monopoly practices on the Steam storefront</a>. In that response, Valve argues that the suit should be dismissed because it \"fails to allege the most basic elements of an antitrust case.\"</p>\n<h2>There’s no right to free Steam keys</h2>\n<p>Wolfire's case centers in part on the fact that Valve requires <a href=\"https://arstechnica.com/gaming/2019/04/why-valve-actually-gets-less-than-30-percent-of-steam-game-sales/\">free Steam Keys</a> generated by developers using Valve's platform to be sold on other platforms at prices no lower than those offered on Steam. But Valve argues multiple times <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/valveresponse.pdf\">in its filing</a> that it has \"no obligation to distribute Steam Keys, let alone to allow developers to use Steam Keys to undercut their Steam prices in other stores.\"</p>\n<p>The free key system, Valve says, is intended as a way to \"[give] developers a free way to sell (or give away) a reasonable number of copies of their Steam-enabled games.\" With that in mind, restrictions on off-Steam pricing for those keys \"prevents developers from free-riding on Valve’s investment in Steam.\" The pricing and quantity guidelines \"prevent developers from eroding large quantities of sales on Steam, which Valve bears 100% of the expense of creating and maintaining, yet provides to users for free.\"</p></div><p><a href=\"https://arstechnica.com/?p=1784203#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784203&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c8d6f80e8c778d9a6e1b54f8342df347f34b5466a038906b93c1dc88fa016af6","category":"Tech"}