{"title":"New Jeopardy! host Mike Richards resigns on first day of production","link":"https://arstechnica.com/?p=1788827","date":1629479904000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/jeopardy-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/jeopardy.jpg\">Enlarge</a> <span>/</span> <em>Jeopardy!</em> EP Mike Richards was chosen to replace longtime host Alex Trebek just last week. He resigned in the wake of controversy surrounding comments made during a podcast he co-hosted in 2013-2014. (credit: Sony Pictures Television)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Drama and controversy continue to swirl over the selection of a replacement host for <em>Jeopardy!</em> in the wake of Alex Trebek's passing from pancreatic cancer complications late last year. <em>Jeopardy!</em> executive producer Mike Richards was named the new host just last week, a decision that sparked an immediate backlash among fans and former contestants of the show. And now, Richards will be stepping down on his very first day of official hosting duties, <a href=\"https://deadline.com/2021/08/mike-richards-steps-down-host-jeopardy-backlash-1234818672/\">Deadline Hollywood reports</a>. Richards will continue in his role as executive producer on the game show.</p>\n<p>As <a href=\"https://arstechnica.com/gaming/2021/08/jeopardy-selects-executive-producer-of-jeopardy-as-new-host-of-jeopardy/\">we previously reported,</a> Trebek's last episodes aired in January 2021. Throughout the rest of its 37th season, the show used <a href=\"https://www.jeopardy.com/jbuzz/news-events/jeopardy-guest-host-schedule\">a long list of guest hosts</a> to fill in for Trebek at the podium, including Richards and Mayim Bialik, best known for her roles on <em>The Big Bang Theory </em>and <em>Blossom.</em> (She also has a PhD in neuroscience from UCLA.) The rotation included former <em>Jeopardy!</em> champion Ken Jennings, newscasters Katie Couric and Anderson Cooper, and <a href=\"https://www.readingrainbow.org/\">book enthusiast</a> LeVar Burton. Both Burton and Jennings proved to be fan favorites, and Jennings' run posted the highest ratings of the season. (Burton's ratings were lower, perhaps due in part to his episodes competing with the Summer Olympics on NBC.)</p>\n<p>Even before his selection, allegations began circulating that Richards had <a href=\"https://ew.com/tv/mike-richards-jeopardy-past-discrimination-allegations-resurface/\">discriminated against several pregnant employees</a> while serving as executive producer of <em>The Price Is Right</em>. (Both suits were eventually settled.) \"These were allegations made in employment disputes against the show,\" Richards wrote in a memo to <em>Jeopardy!</em> staff. \"I want you all to know that the way in which my comments and actions have been characterized in these complaints does not reflect the reality of who I am or how we worked together on <em>The Price is Right</em>.\"</p></div><p><a href=\"https://arstechnica.com/?p=1788827#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788827&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c8d8cd1b57f1714944203fb86acaa74beee8aea90f20a6ce8bf73563a2eb038a","category":"Tech"}