{"title":"Giro d'Italia 2023 stage 11 preview - the longest stage","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-11-preview-the-longest-stage","date":1684251647000,"content":"\n      <p><b>Distance: </b><span>219km<br /></span><b>Start location: </b><span>Camaiore<br /></span><b>Finish location: </b><span>Tortona<br /></span><b>Start time: </b><span>11:25 CEST<br /></span><b>Finish time (approx): </b><span>17:14 CEST</span></p>\n<p><span>From the Tuscan town of Camaiore, where stage 11 sets off from, you can see the Apuan Alps to the west, and the coast of Versillia to the west. Caught between these two starkly different landscapes, the organisers have favoured the latter, and the route will stick close to the coast as the riders head in a north-westerly direction through Liguria. Rather than the venture into the nearby hills, this will therefore be a mostly flat stage to favour the sprinters.</span></p>\n<div></div>\nAbout halfway into the stage, the riders will divert further inland, ultimately following the Scrivia river to get to the finish in Tortona. On their way there, they will pass through the vineyards known as the ‘Colli Tortonesi,’ where grapes have been cultivated ever since the Romans conquered the region in the second century BC, and which is one of the most respected areas for wine in the area of Piedmont.  <br /><br />Formerly best known for Barbera red wine, in 1990 a local farmer called Walter Massa experimented by reviving Timorasso, a difficult to grow white grape unique to the area the production of which had virtually ceased. The result — a full bodied white wine with high acidity — proved to be a success, and is now beginning to achieve international notoriety. <br /><br />In the cycling world, Tortona is also famous for its association with the legendary Fausto Coppi. He was born in the tiny nearby village of Castellania (since renamed Castellania Coppi is his honour) in 1919, and died here at the age of just 40 after contracting malaria while visiting Burkina Faso. No rider has yet bettered his joint-record of five overall titles. <br /><br />\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_11.jpg?v=1683641045\" alt /><em>Stage 11 profile sourced on the Giro d'Italia website </em></p>\n<p><span>Although predominantly flat, there are a few hills along what is the longest stage of this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a>, that ensure this won’t be an easy day for the sprinters. The first, the category three Passo del Bracco, will be quite a sustained effort at 10km in length, although its average gradient of 4.4% should make it manageable for most. The next, the Colla di Boasi, provides a similar test with almost the same vital statistics, but the third and final climb, Passo della Castagnola, is easier and only 5km long.</span></p>\n<p>Some teams may ride hard over these climbs if they fancy their chances of dropping any rival sprinters, but there will be a chance for anyone distanced to return during the flat northwards run-in to the finish. A large bunch finish does therefore appear the most likely outcome, as was the case when the Giro last visited in 2017, in a stage won by Fernando Gaviria. </p>\n<h3>Contenders</h3>\n<p><span>While this is a Giro d’Italia that keeps throwing up surprises, today is the first real stage that looks like it could be nailed on for a bunch sprint. With no huge climbs to drop the fast men, the sprinter’s teams will be on guard to keep it together, especially after they narrowly missed out on stage 10 when the breakaway made it to the finish. </span></p>\n<p>No riders so far in this race have won more than one stage, but this could be a chance for <strong>Mads Pedersen</strong> of Trek-Segafredo to double up after he proved himself the fastest when the race finished in Napoli, outsprinting the likes of <strong>Jonathan Milan</strong> (Bahrain-Victorious). Milan is another rider who will have his eye on today’s stage as a key opportunity. The Italian rider took the win on stage two, proving he can beat some of the more established sprinters in the race on his day. <strong>Kaden Groves</strong> of Alpecin-<span>Deceuninck</span> had a bad day yesterday, unable to stay with the main peloton on the undulating roads of Tuscany. However, with less challenging terrain to contend with today, the Aussie sprinter will be looking to cross the line first, just like he did in Salerno a few days ago.</p>\n<p><span><strong>Mark Cavendish</strong> of Astana-Qazaqstan has been having a rough run of luck during the Giro d’Italia so far, but he and his teammates looked to still be in good form in stage ten, contributing to the chase of the breakaway, albeit not closing the gap in the end. Cavendish’s experience could make this finish perfect for him, it is technical and will require perfect timing and positioning.<strong> Fernando Gaviria</strong> of Movistar is another contender and has won here before, but the Colombian rider crashed on stage 10 so whether he can be in the mix will depend on how he has recovered. </span></p>\n<p><span>Now Remco Evenepoel has left the race, Soudal-Quick-Step’s <strong>Davide Ballerini</strong> has freedom to go for results when it suits him, and he could have a strong lead out from his teammates on the road to Tortona. <strong>Micheal Matthews</strong> of Jayco-Alula has also already won a stage in this year’s Giro d’Italia and could double up here, though the 32-year-old rider often needs slightly tougher terrain to make the difference. <strong>David Dekker</strong> of Team Arkéa Samsic is another rider to watch today, as is <strong>Pascal Ackermann</strong> of UAE Team Emirates. Outside contenders for victory include <strong>Arne Marit</strong> of Intermarché-Circus-Wanty and <strong>Marius Mayrhofer</strong> of Team DSM.</span><span></span> </p>\n<h3>Prediction</h3>\n\n<p><span>We predict that Kaden Groves of Alpecin-Deceuninck will take another stage win today. He has the team behind him to guide him through the technical run-in and the speed to finish the job.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c8ecf87659d0af43c041a3675fd7e2d688dbdee1f76a3d863019c3b1ffc429d9","category":"Cycling"}