{"title":"The modulatory effect of oat on brain‐derived neurotrophic factor, orexigenic neuropeptides, and dopaminergic signaling in obesity‐induced rat model: a comparative study to orlistat","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13915?af=R","date":1727161755000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Obesity is a non-communicable complex disease that is the fifth leading cause of death worldwide. According to a novel viewpoint, the brain plays a significant role in the central regulation of satiety and energy homeostasis. Because of its rich nutritional profile and versatile uses, oat (<i>Avena sativa</i>) is one of the most popular functional foods recommended by many nutritionists. The anti-obesity effect of oat was hypothesized, focusing on the brain as the target organ. In the current study, the interplay between brain biomarkers, obesity, and its related complications was evaluated in diet-induced obese rats for 25 weeks, in which 60 adult male white albino Wistar rats were divided into three control and seven treatment groups given oat extracts in a dose-dependent manner.</p>\n<h2>RESULTS</h2>\n<p>Oat significantly improved obesity-related metabolic complications. In terms of brain function, oat significantly increased dopaminergic signaling, brain-derived neurotrophic factor levels, vaspin, irisin, and uncoupling protein-1 brain levels, while decreasing the expression of agouti-related peptide and neuropeptide Y (<i>P</i>-value &lt; 0.05).</p>\n<h2>CONCLUSION</h2>\n<p>The current study proposes oat supplementation as a new conceptual framework with numerous implications for hedonic and homeostatic mechanisms that control satiety. © 2024 Society of Chemical Industry.</p>","author":"Madonna Ehab, \nNayra Omran, \nHeba Handoussa","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"c8ed9c6e9efd40fc9e1748326301125ee2b78d558b13f50c06ed651200e37cf3","category":"Environment"}