{"title":"Jony Ive Could Develop AI Hardware Device With OpenAI's Sam Altman","link":"https://www.macrumors.com/2023/09/27/jony-ive-openai-design-ai-hardware/","date":1695810246000,"content":"Former Apple design chief Jony Ive and OpenAI CEO Sam Altman have been discussing building a new AI hardware device, according to a new report by <em><a href=\"https://www.theinformation.com/articles/designer-jony-ive-and-open-ais-sam-altman-discuss-ai-hardware-project\">The Information</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/11/jony-ive-ipad-pro.jpeg\" alt width=\"1278\" height=\"850\" />\r<br />\nBoth men have spoken to SoftBank CEO and investor Masayoshi Son about the idea, according to people familiar with the conversations, but it's not clear if Ive will remain involved. Since leaving Apple, Ive has been concentrating on working for clients through his British design company, LoveFrom.\r<br />\n\r<br />\nThe report is scant on details, and does not reveal about what such a device could be, but Ive and Altman are said to be friends and have been discussing \"what new hardware for the age of AI could look like,\" according to one person familiar with the matter.\r<br />\n\r<br />\nAltman is one of the biggest investors in consumer hardware startup Humane, with was founded by Imran Chaudhri and Bethany Bongiorno, both former Apple employees. The startup plans to develop a screenless wearable device that can be directed using voice prompts and gestures, and projects information onto surfaces in front of it. Chaudhri in May <a href=\"https://www.youtube.com/watch?v=gMsQO5u7-NQ\">demoed</a> a prototype to a TEDTalk audience. Ultimately, Humane plans to integrate OpenAI's technology into the device.\r<br />\n\r<br />\nOpenAI's ChatGPT chatbot has made waves in the tech world since it was launched to the public less than a year ago. The company's annual revenue pace has exceeded $1 billion, thanks to ChatGPT subscriptions and paid access to the chatbot's latest and most advanced incarnation, GPT-4. In May 2023, OpenAI released an <a href=\"https://www.macrumors.com/2023/05/18/openai-chatgpt-ios-app/\">official ChatGPT app</a> for the iPhone and iPad. \r<br />\n\r<br />\nFor Apple's part, the company has significantly ramped up its spending on artificial intelligence, according to a <a href=\"https://www.macrumors.com/2023/09/06/apple-conversational-ai-spending/\">previous report</a> by <em>The Information</em>. Apple's \"Foundational Models\" team that works on conversational AI includes just 16 people, but Apple is said to be spending millions of dollars per day training its language models, which could one day be <a href=\"https://www.macrumors.com/2023/03/15/apple-engineers-working-on-chatgpt-like-ai/\">integrated into Siri</a>. <div>Tags: <a href=\"https://www.macrumors.com/guide/jony-ive/\">Jony Ive</a>, <a href=\"https://www.macrumors.com/guide/chatgpt/\">ChatGPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/27/jony-ive-openai-design-ai-hardware/\">Jony Ive Could Develop AI Hardware Device With OpenAI's Sam Altman</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/jony-ive-could-develop-ai-hardware-device-with-openais-sam-altman.2405003/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c8f5e931b76142511607401ff102de5e20af05426658240a62e6ab210d399814","category":"Apple"}