{"title":"Diospyros kaki fruit aqueous extract individual/combined with famotidine mitigates peptic ulcer induced by alcohol in rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae155/7778342?rss=1","date":1727395200000,"content":"<span><div>Abstract</div>The present study was performed to evaluate the therapeutic impact of <span>Diospyros kaki</span> fruit aqueous extract (DKFAE) on ethanol induced peptic ulcer. The phytochemical studies of DKFAE were investigated using colorometric analysis. Gastric ulcer was induced by one dose of ethanol (5 ml/Kg, b.w) on 24 h empty stomach. Then, the plant extract (200, 400 mg/kg) was orally administrated for 2 weeks. Famotidine (FAM: 40 mg/kg, b.w.): a reference drug was also tested. The effect of mixture dose between the fruit extract and FAM (DKFAE, 50 mg/kg PC, p.o. + FAM, 50 mg/kg PC, p.o.) was also evaluated. One hour after induction of ulcer blood samples were collected, stomach acidity and volume, as well as lesion counts were measured, then stomach and intestine of scarified rats were subjected to biochemical, macroscopic and microscopic studies. Results showed that DKFAE exhibited an important antioxidant potential. In vivo, the results showed that alcohol induced gastric damage, improving oxidative stress markers level such as MDA and H2O2, gastric and intestinal calcium and free iron. The intoxication by ethanol also produce an inflammation occurred by high level of the C-reactive protein (CRP) and alkaline phosphatase (ALP) activity in plasma. In contrast, DKFAE and the mixture dose significantly protect against macroscopic and histological injuries, the secretory profile disturbances, lipid peroxidation, antioxidant enzymes activities and non enzymatic antioxidant level decrease induced by ethanol administration. More impressively, the mixture dose exerted the more excellent effect than DKFAE and famotidine each alone showing is possible synergism.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"c8fcfcbe2f9993fe4a3d015ec5ea2366d97bf90e1b33bacc9eb9e13fb23a7e01","category":"Environment"}