{"title":"Kindness as a Signifier of Intelligence","link":"https://twitter.com/darrenrovell/status/1673659149417078788","date":1690475035000,"content":"\n<p>This clip from Illinois governor J.B. Pritzker’s commencement speech at Northwestern rings so true to me. The older I get, the more my thinking runs along the exact same line. Worth watching the whole clip, but here’s the nut:</p>\n\n<blockquote>\n  <p>The best way to spot an idiot? Look for the person who is cruel.\nWhen we see someone who doesn’t look like us, or sound like us, or\nact like us, or love like us, or live like us — the first thought\nthat crosses almost everyone’s brain is rooted in either fear or\njudgment or both. That’s evolution. We survived as a species by\nbeing suspicious of things we aren’t familiar with.</p>\n\n<p>In order to be kind, we have to shut down that animal instinct and\nforce our brain to travel a different pathway. Empathy and\ncompassion are evolved states of being. They require the mental\ncapacity to step past our most primal urges. I’m here to tell you\nthat when someone’s path through this world is marked with acts of\ncruelty, they have failed the first test of an advanced society.\nThey never forced their animal brain to evolve past its first\ninstinct. They never forged new mental pathways to overcome their\nown instinctual fears. And so, their thinking and problem-solving\nwill lack the imagination and creativity that the kindest people\nhave in spades.</p>\n\n<p>Over my many years in politics and business, I have found one\nthing to be universally true: the kindest person in the room is\noften the smartest.</p>\n</blockquote>\n\n<p>I like the idea of responding to acts of cruelty with “Idiot”.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/27/pritzker-kindness-intelligence\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c8fe126bc788173a81bd4478b72885cb7ea6495c39a424d941ef93d4908c130b","category":"Tech"}