{"title":"Bootstrap Reduced Major Axis (BRMA) to optimize the satellite‐derived discharge rating curves","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4325?af=R","date":1717997115000,"content":"<h2>Abstract</h2>\n<p>We estimate river discharge by utilizing limited in-situ and multi-satellite data through Bootstrap Reduced Major Axis (BRMA) optimization method (Qstat$$ {Q}_{\\mathrm{stat}} $$). We establish the BRMA by analyzing the functional relationships (<i>H</i>, <i>W</i>, <i>H.W</i> vs. <i>Q</i>) at four distinct locations along the Ganga (Shahzadpur and Azmabad) and the Narmada (Hoshangabad and Mandleshwer) rivers. To measure the channel width (<i>W</i>) we have used the Landsat 5, 7, and 8 images (2006–2019). We use the water level (<i>H</i>) data from satellite altimeter (Jason 2, Jason 3, Envisat, and Sentinel 3A). We have used BRMA to establish functional relationships between channel width (W), water level (<i>H</i>), and <i>H.W</i> to their corresponding discharge at each gauge stations in the study reach. Efficacy of the proposed approach is evaluated through a comparative analysis with the traditional ordinary least squares (OLS) regression method. We observed that the BRMA exhibits better performance as compared to the best fit curve obtained by using the OLS regression. We noticed that the functional relationship between the WH-Q outperforms as compared to the other empirical curves at the both gauge stations of the Ganga River. The accuracy estimates of the Ganga River is in a range of NSEoverall$$ {\\mathrm{NSE}}_{\\left(\\mathrm{overall}\\right)} $$ (0.76–0.95), PBIASoverall$$ {\\mathrm{PBIAS}}_{\\left(\\mathrm{overall}\\right)} $$ (1–23) and RSRoverall$$ {\\mathrm{RSR}}_{\\left(\\mathrm{overall}\\right)} $$ (0.25–0.44). In the Narmada River, the functional relationship between H-Q outperforms. The accuracy of discharge at both the gauge stations of the Narmada River are found to be in a range NSEoverall$$ {\\mathrm{NSE}}_{\\left(\\mathrm{overall}\\right)} $$ (0.76–0.95), PBIASoverall$$ {\\mathrm{PBIAS}}_{\\left(\\mathrm{overall}\\right)} $$ (1–23), to RSRoverall$$ {\\mathrm{RSR}}_{\\left(\\mathrm{overall}\\right)} $$ (0.25–0.44). This study is a step towards estimating discharge from satellites data.</p>","author":"Atul Kumar Rai, \nVikas Kumar, \nSharad Patel, \nZafar Beg, \nKumar Gaurav","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"c8ff5c0cfbaaaff6e474c947b8b60d3c255cc0f1f00c1458d0e0033c8a8125b8","category":"Environment"}