{"title":"Apple Watch Series 7 takes shape with an upgraded screen, no new health features","link":"https://www.macworld.com/article/348663/apple-watch-series-7-takes-shape-with-an-upgraded-screen-no-new-health-features.html","date":1623682488000,"content":"\n<div>\n<section><div></div></section><p>With just months to go before the next Apple Watch arrives, a clearer picture of the device is beginning to emerge. After rumors suggested the Series 7 watch would get its first major redesign, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-06-14/apple-plans-faster-watch-future-temperature-and-glucose-sensors&amp;xcust=1-1-348663-0-0-0&amp;sref=https://www.macworld.com/feed\">a new report from Bloomberg</a> tempers some of our expectations for Apple’s new wearable.</p>\n\n\n\n<p>Among the changes to the model shipping later this year will be “a faster processor, improved wireless connectivity and an updated screen,” according to Mark Gurman. Apple last updated the Apple Watch display with a larger display (40mm and 44mm) in the <a href=\"https://www.macworld.com/article/231935/apple-watch-series-4-review-the-biggest-upgrade-yet.html\">Series 4 model</a> and has since added an always-on option as well. Apple uses OLED screens in the Apple Watch like the iPhone 12.</p>\n\n\n\n<p>According to the report, Apple is working on a watch with “thinner display borders and a new lamination technique that brings the display closer to the front cover.” Gurman also says the watch may be slightly thicker but “not in a way that’s noticeable to the user.”</p>\n\n\n\n<p>It was previously rumored that the Apple Watch Series 7 would be getting <a href=\"https://www.macworld.com/article/346955/apple-watch-series-7-might-get-its-first-major-redesign.html\">a major redesign</a>, with flat edges to match the look of the iPhone 12 and iPad Pro.  The Bloomberg report doesn’t specifically mention a new design for the watch.</p>\n\n\n\n<p>Gurman says the new watch will include “updated ultra-wideband functionality” for Find My and proximity key unlocking in cars and hotel rooms.</p>\n\n\n\n<p>However, one feature that likely won’t be arriving is glucose monitoring. While Gurman notes that Apple is indeed working on an Apple Watch with a non-invasive blood-sugar sensor, he says it is “unlikely to be ready for commercial launch for several more years.” However, a skin temperature sensor, which was also rumored for this year’s model and is available on Fitbit watches, “is now more likely to be included in the 2022 update.”</p>\n\n\n\n<p>Gurman also says <a href=\"https://www.macworld.com/article/341023/the-apple-watch-series-7-may-have-a-new-rugged-option-for-extreme-users.html\">the “rugged” model for extreme athletes</a> that was previously rumored is also likely to launch in 2022 as well as the Apple Watch SE 2.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c90eb1087dd2c56f507bad1d8e2fdf14e667c83f82a498252f6fe9755fc8bb27","category":"Apple"}