{"title":"Functional diversity explores the maintenance mechanism and driving factors of the invasion equilibrium state of the icefish (Neosalanx taihuensis Chen) in Lake Fuxian, China","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15950?af=R","date":1729576256000,"content":"<h2>Abstract</h2>\n<p>Biodiversity loss caused by biological invasions is an ecological problem on a global scale, and understanding the mechanism of biological invasion is the basis for managing non-native species. The biotic resistance hypothesis proposes that species-rich native communities are less susceptible to invasion because of the limited resources available to non-native species, therefore comparing the resource utilization patterns of different communities can reveal the invasion mechanisms of specific non-native species at the community level. We selected Lake Taihu, where icefish (<i>Neosalanx taihuensis</i> Chen) originated, and Lake Fuxian, where icefish invaded, as the research objects. We calculated the fish functional diversity indexes, including functional richness (FRic), functional evenness (FEve), and functional divergence (FDiv), to reflect differences in ecological niche and resource utilization based on four quarterly fish survey data from two lakes. The random forests model explored the relationship between functional diversity indexes and biotic and environmental variables. Our results showed that more diverse resource utilization (high FRic), more niche space (low FEve), and less competitive pressure (high FDiv) in Lake Fuxian were identified as the critical important factors for maintaining the current equilibrium state after successful invasion of icefish. The bottom-up effects mainly affected the functional diversity indexes in Lake Fuxian. They differed from those in Lake Taihu and were primarily influenced by top-down effects. Enhancing the top-down effects in Lake Fuxian and limiting the zooplankton available to icefish are critical to controlling the invasion of icefish. This study offers a new perspective for studying the non-native fish invasion mechanism, and provides scientific guidance for managing non-native fish in Lake Fuxian.</p>","author":"You Ge, \nXiaohong Gu, \nQingfei Zeng, \nZhigang Mao, \nHuihui Chen, \nHuiting Yang, \nWenlei Luo","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"c911a49f87445988d290580819200f3297d23db6f7f633facadc7890d6f85598","category":"Environment"}