{"title":"Pixel 6a renders show Google carrying the Pixel 6 design forward","link":"https://arstechnica.com/?p=1814821","date":1637600378000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/6-3-800x582.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/6-3.jpg\">Enlarge</a> <span>/</span> Is that the Pixel 6? Nope! It's the mid-range Pixel 6a.  (credit: OnLeaks x 91Mobiles)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Pixel 6 <a href=\"https://arstechnica.com/gadgets/2021/11/pixel-6-review-google-hardware-finally-lives-up-to-its-potential/\">only recently</a> hit the market, but given that we're regularly getting a six-month lead time on smartphone leaks nowadays, it's time to talk about its mid-range cousin, the Pixel 6a. This weekend, <a href=\"https://www.91mobiles.com/hub/google-pixel-6a-renders-exclusive/\">OnLeaks and 91Mobiles</a> graced the Internet with a render of what the phone is expected to look like, based on CAD files that need to be distributed to accessory makers.</p>\n<p>Our closing thoughts in the Pixel 6 review expressed a hope that Google would carry forward its Pixel 6 work and build something that finally felt like a cohesive product line, rather than the yearly reboot crapshoot that the Pixel line has been since its inception. For the Pixel 6a, at least, it looks like Google is following that path. The 6a looks just like the Pixel 6, with a big rear camera bar, a two-tone design, a flat front screen with a centered hole-punch camera, and an in-screen fingerprint reader. This Pixel 6a render is barely distinguishable from the Pixel 6.</p>\n<p>One major difference will be the size. While the Pixel 6 Pro is 6.7 inches, and the Pixel 6 is 6.4 inches, the 6a will slot in at 6.2 inches. CAD files should have pretty exacting dimensions for accessory makers, and OnLeaks says the phone is 152.2×71.8×8.7 mm. Again, that's a big step down in size from the 75.9-mm-wide Pixel 6 Pro and the 74.8-mm-wide Pixel 6. People clamoring for a smaller Google phone will have something closer to what they want in the Pixel 6a, and a smaller size is a good way to cut costs on this mid-range device.</p></div><p><a href=\"https://arstechnica.com/?p=1814821#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814821&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c9136b45e842299c223c1881d14bffaa414d77c3463bd9d970d691fad5f79a5c","category":"Tech"}