{"title":"Comparative Analysis on the Mechanical Properties, Transportation Cost, and Carbon Footprint Emission of Cement Mortar with PE and SSRS as Partial Replacement for Aggregates","link":"https://www.preprints.org/manuscript/202404.0702/v1","date":1712747773000,"content":"This study presents an innovative approach for the utilization of industrial by-products and municipal waste in the production of sustainable and environmentally friendly cement mortar. We explored stabilized stainless-steel reduced slag (SSRS) and polyethylene (PE) plastic waste as partial replacements for aggregates. Various engineering properties of the resulting cement mortar specimens, including slump, slump flow, compressive strength, flexural strength, tensile strength, water absorption, and ultrasonic pulse velocity (UPV), were investigated through comprehensive experimental tests. The influence of different water-cement (w/c) ratios and substitution amounts on the engineering properties of the cement mortar samples was thoroughly examined. The findings revealed that an increase in PE substitution adversely affected the overall workability of the cement mortar mixtures, whereas an increase in SSRS amount contributed to enhanced workability. As for the hardened properties, a consistent trend was observed for both cases, with higher w/c ratios and substitution amounts leading to reduced mechanical properties. Water absorption and UPV test results validated the increased formation of porosity with higher w/c ratios and substitution amounts. This study proposes a promising method to effectively repurpose industrial by-products and municipal wastes, transforming them into sustainable construction and building materials. Additionally, a comparative analysis of transportation costs and carbon footprint emissions between SSRS-cement mortar and PE-cement mortar was conducted to assess their environmental impact and sustainability. Generally, higher w/c ratios and replacement levels corresponded to reduced carbon footprint. The geographical location of the source of SSRS and PE remains a challenge and studies to overcome this challenge must be further explored.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c913380540965c0f7c835269c4da03409ddba66af9df732c1d8946da7824acc7","category":"Interdisciplinary"}