{"title":"Effect of HUFA‐ and vitamin C‐enriched live food, infusoria on growth and survival of Clarias Magur (Hamilton, 1822) larvae","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16054?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Asian catfish, <i>Clarias magur</i> (Hamilton, 1822), known as magur, is a popular food fish in Asian countries because of its high nutritional and medicinal value. Aquaculture of magur is constrained by non-availability of seed due to very high mortality during the early larval stages. The strategies to enhance the larval survival during the early stages could be a major step in enhancing the seed production of this species. So, the aim of the present study was to assess the effect of highly unsaturated fatty acids (HUFA)- and vitamin C-enriched infusoria on the growth and survival of <i>C. magur</i> larvae. Eight-day-old larvae with an average weight of 3 mg and length of 5 mm were stocked in plastic crates (30 x 20 x 18 cm) each containing 40 litres of water. A total of 16 crates were used in experiment and in each crate 100 larvae were stocked. The larvae were fed three times daily with HUFA, vitamin C, both HUFA and vitamin C and un-enriched infusoria @ 9–10 numbers per ml of rearing water for 30 days in four different treatment groups. The proximate analysis of different enriched and un-enriched infusoria showed the highest (84.25%) moisture content in HUFA-enriched Infusoria, and the highest percentage of crude protein (9.80%), crude lipid (3.50%) and ash content (0.78%) in vitamin C-enriched Infusoria. The survivability analysis showed the highest survival in the treatment group fed with HUFA-enriched infusoria (49.25%) and the lowest in the control group (18.25%). This indicates that the enrichment of infusoria with HUFA could increase the survival rate significantly. The highest body weight gain (55.75 mg) was observed in HUFA-enriched group but not significantly different from the control group. The study indicates that the enrichment of infusoria with HUFA have a significant influence on larval survival<i>.</i></p>","author":"Jham Lal, \nPravesh Kumar, \nSahil Rai, \nPrem Prakash Srivastava, \nShivendra Kumar, \nRoshan Kumar Ram, \nSuresh Chand Rai","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"c915bdb0c6a4c429e7eea0728b6d8a0b556dd9945ad204d62ee6164e36254355","category":"Environment"}