{"title":"Lake Floor Recovery and Preliminary Habitat Restoration Interventions in the Shallow Waters of the Albano Lake. The AI Role in Large Datasets Management for Environmental Assessment and Smart Governance Purposes","link":"https://www.preprints.org/manuscript/202405.1178/v1","date":1715944101000,"content":"As coastal and marine ecosystems, even the inland waters can be deeply affected by human-driven impacts. Consequently, the internal waters belonging to closed or semi-closed basins due to their hydrographic and morphological conditions can be subject to even more dramatic consequences in terms of conservation and overall ecosystem functioning maintaining. Despite the Albano Lake is listed among the Natura 2000 network sites (IT6030038), several elements of its landscape complexity have already experimented clearly visible alterations: from certain landscape features alterations to the loss of some iconic vegetal and animal species characterizing the lake environment in the past. Therefore, a virtuous commitment awaits us and we have the moral duty of acting in order to restore such degraded habitats. Each environmental restoration intervention and/or clean up session can be considered relevant in order to give back the right dignity to one of the most naturalistically relevant environments of Central Italy. For each field session a plethora of data can be acquired both onshore and underwater by diving operators. Therefore, the data management of a huge temporal and spatial variability can be remarkable. It can be made easier relying on artificial intelligence (AI) supporting geospatial databases for GIS analysis to be run for their role as decision-supporting tools. On this perspective AIs can be used to model environmental systems, greatly helping to reduce use conflicts and human-driven impacts, whilst understanding the ecological characteristics and related ecosystem functioning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c91706287cb3bb2ebb6b002db1be5353c688bb2f379908794d38c058bd584d67","category":"Interdisciplinary"}