{"title":"Conservation planning for retention, not just protection","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17211?af=R","date":1709625600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9e6eea25-e790-4bea-be87-4854e9c77228/gcb17211-toc-0001-m.png\" alt=\"Conservation planning for retention, not just protection\" />\n<p>Protected area (PA) planning aims to improve biota representation within the PA system, but this does not necessarily achieve the best outcomes for biota retention across the landscape. we assess the implications that different PA expansion strategies can have on the retention of species habitat across an entire region. A pattern of PA expansion targeting areas at highest deforestation risk led to the retention, on average, of 7.2% more forest habitat per species by 2050 than did a pattern that targeted areas at lowest risk, even though that approach cost more per km<sup>2</sup> of land conserved.</p>\n<br />\n<h2>Abstract</h2>\n<p>Most protected area (PA) planning aims to improve biota representation within the PA system, but this does not necessarily achieve the best outcomes for biota retention across regions when we also consider habitat loss in areas outside the PA system. Here, we assess the implications that different PA expansion strategies can have on the retention of species habitat across an entire region. Using retention of forest habitat for Colombia's 550 forest-dependent bird species as our outcome variable, we found that when a minimum of 30% of each species' habitat was included in the PA system, a pattern of PA expansion targeting areas at highest deforestation risk (risk-prevention) led to the retention, on average, of 7.2% more forest habitat per species by 2050 than did a pattern that targeted areas at lowest risk (risk-avoidance). The risk-prevention approach cost more per km<sup>2</sup> of land conserved, but it was more cost-effective in retaining habitat in the landscape (50%–69% lower cost per km<sup>2</sup> of avoided deforestation). To have the same effectiveness preventing habitat loss in Colombia, the risk-avoidance approach would require more than twice as much protected area, costing three times more in the process. Protected area expansion should focus on the contributions of PAs to outcomes not only within PA systems themselves, but across entire regions.</p>\n<p>La mayor parte de la planificación de áreas protegidas (AP) tiene como objetivo mejorar la representación de la biota dentro del sistema de AP, pero esto no necesariamente logra los mejores resultados para la retención de biota a nivel de paisaje cuando también consideramos la pérdida de hábitat en áreas fuera del sistema de AP. Aquí evaluamos las implicaciones que diferentes estrategias de expansión de AP pueden tener en la retención del hábitat de las especies en toda una región. Utilizando la retención de hábitat forestal para las 550 especies de aves dependientes de bosque de Colombia como nuestra variable de resultado, encontramos que cuando un mínimo del 30% del hábitat de cada especie es incluido en el sistema de AP, se observó que un patrón de expansión de AP dirigido a áreas con mayor riesgo de deforestación (prevención de riesgos) condujo a la retención, en promedio, de un 7.2% más de hábitat por especie para 2050 que un patrón enfocado en áreas con menor riesgo (evasión de riesgos). El enfoque de prevención de riesgos costó más por km<sup>2</sup> de tierra conservada, pero fue más rentable para retener el hábitat en el paisaje (entre un 50% y un 69% menos costo por km<sup>2</sup> de deforestación evitada). Para tener la misma eficacia en la prevención de la pérdida de hábitat en Colombia, el enfoque de evasión de riesgos requeriría más del doble de área protegida, lo que costaría tres veces más en el proceso. La expansión de las AP debería centrarse en las contribuciones de las AP a los resultados no sólo dentro de los propios sistemas de AP, sino en regiones enteras.</p>","author":"Pablo Jose Negret, \nRuben Venegas, \nLaura J. Sonter, \nHugh P. Possingham, \nMartine Maron","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"c91f627bae0b02566675bef0ea4d11d1f631b9fb0f53b48f9d7b25859fbb6a04","category":"Environment"}