{"title":"Evaluation navigation controlled gate of aging spillway on cavitation damage","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311247","date":1728482400000,"content":"<p>by Le Thi Thu Hien, Nguyen Van Chien, Nguyen Viet Duc</p>\r\nBackground <p>High-speed flow of clean water or water with sediment released from aging spillways may cause abrasion and cavitation on the concrete surface gradually. The occurrence of irregularities on the concrete surface can exacerbate the erosion problem. Which might jeopardize the safety of dams constantly, hence the rehabilitation efforts become urgent tasks in dam safety projects.</p> Methods <p>This study employs a 3D Computational Fluid Dynamics (CFD) model to quantitatively analyze the cavitation risk on the aging concrete surface of the Chay 5 spillway in Ha Giang, Vietnam, under various operation scenarios. There are two standards used to measure cavitation: the cavitation index (<i>σ</i>) which indicates the danger due to the drop of pressure in rapid flow, and the new gasification index (<i>β</i>) which takes into consideration the formation and collapse of bubbles behind asperities.</p> Results <p>Three extreme flood cases may not result in potential cavitation because both <i>σ</i> and <i>β</i> exceed critical thresholds. Regarding the six controlled gate scenarios with normal water level, the <i>σ</i> profiles are approximated 1,0 showing a low likelihood of cavitation damage while the <i>β</i> values are smaller than 0.8, indicating a considerable risk of cavitation. Besides, the opening height of 100 cm poses the greatest risk of creating severe cavitation erosion in the concave area and slope portion. The flip bucket experienced the most vulnerable cavitation when the opening height is 400 cm. In addition, an approach to spillway surface rehabilitation involving specialized mortars has been presented.</p> Conclusion <p>For aging conveyance structure, gasification index (<i>β</i>) takes into account irregularities surface, providing a more comprehensive assessment of the likelihood of cavitation damage than cavitation index (<i>σ</i>). After rehabilitation with anti-shrinkage high abrasion resistance mortar, the entire spillway surface is smooth. This allows for reducing the cavitation risk and improvement of life service thereof.</p>","author":"Le Thi Thu Hien","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"c922613e59962323c10f69c13d98dbd19baa7071d22aab90fd4f94ee265b87ab","category":"Interdisciplinary"}