{"title":"A global latitudinal gradient in the proportion of terrestrial vertebrate forest species","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13854?af=R","date":1716016086000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Global patterns in species distributions such as the latitudinal biodiversity gradient are of great interest to ecologists and have been thoroughly studied. Whether such a gradient holds true for the proportion of species associated with key ecotypes such as forests is however unknown. Identifying a gradient and ascertaining the factors causing it could further our understanding of community sensitivity to deforestation and uncover drivers of habitat specialization. The null hypothesis is that proportions of forest species remain globally consistent, though we hypothesize that proportions will change with differences in ecotype amount, spatial structure, and environmental stability. Here we study whether the proportion of forest species follows a latitudinal gradient, and test hypotheses for why this may occur.</p>\n<h2>Location</h2>\n<p>Worldwide.</p>\n<h2>Time period</h2>\n<p>Present.</p>\n<h2>Major taxa studied</h2>\n<p>Terrestrial vertebrates.</p>\n<h2>Methods</h2>\n<p>We combined range maps and habitat use data for all terrestrial vertebrates to calculate the proportion of forest species in an area. We then used data on the global distribution of current, recent historical, and long-term historical forest cover, as well as maps of global disturbances and plant diversity to test our hypotheses using generalized linear models.</p>\n<h2>Results</h2>\n<p>We identified a latitudinal gradient in the proportion of forest species whereby the highest proportions occurred at the equator and decreased polewards. We additionally found that the proportion of forest species increased with current forest cover, historical deforestation, plant structural complexity, and habitat stability. Despite the inclusion of these variables, the strong latitudinal gradient remained, suggesting additional causes of the gradient.</p>\n<h2>Main conclusions</h2>\n<p>Our findings suggest that the global distribution of the proportion of forest species is a result of recent ecological, as well as long-term evolutionary factors. Interestingly, high proportions of forest species were found in areas that experienced historical deforestation, suggesting a lagged response to such perturbations and potential extinction debt.</p>","author":"Benjamin Howes, \nManuela González‐Suárez, \nCristina Banks‐Leite, \nFlavia C. Bellotto‐Trigo, \nMatthew G. Betts","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"c924b86f589db097d5563f7781708bb23f310326db95a724c4ef2ad6b9d6b27a","category":"Environment"}