{"title":"New Battery Health Features Remain Limited to iPhone 15 Models on First iOS 17.1 Beta","link":"https://www.macrumors.com/2023/09/27/ios-17-1-battery-health-features-iphone-15-only/","date":1695845029000,"content":"All four iPhone 15 models have two new battery health features in the Settings app, including the ability to <a href=\"https://www.macrumors.com/how-to/check-battery-cycle-count-iphone-15/\">view the battery's cycle count</a> and an option to <a href=\"https://www.macrumors.com/2023/09/19/iphone-15-80-percent-battery-limit-option/\">more strictly limit charging beyond 80%</a>. On <a href=\"https://twitter.com/BetaProfiles/status/1704476683414409443\">social media</a>, some users hoped these features would expand to older iPhone models in a future software update, but we are able to confirm that they remain limited to the iPhone 15 lineup as of the <a href=\"https://www.macrumors.com/2023/09/27/apple-seeds-ios-17-1-beta-1/\">first iOS 17.1 beta</a> released today.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-17-Battery-Cycle-Count-Feature-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIt's early in the iOS 17.1 beta testing cycle, so there is still a chance the features are added to older iPhone models in a later beta. However, it's also possible there are hardware-related reasons behind the battery health features being limited to the iPhone 15 lineup. We've reached out to Apple for comment on the matter.\r<br />\n\r<br />\nOn iPhone 15 models, the 80% charging limit option can be found in the Settings app under Battery → Battery Health &amp; Charging → Charging Optimization. It is separate from the pre-existing Optimized Battery Charging feature on iPhones, which intelligently delays charging past 80% until a more appropriate time by learning the device's daily charging routine. When the 80% limit is enabled, the iPhone will never charge beyond that percentage, except on rare occasions to \"maintain accurate battery state-of-charge estimates.\"\r<br />\n\r<br />\nIn a <a href=\"https://support.apple.com/en-us/HT210512\">support document</a>, Apple says reducing the time that an iPhone battery is fully charged can reduce the wear on the battery and improve its lifespan.\r<br />\n\r<br />\nOn iPhone 15 models, the battery's cycle count, manufacturing date, and first use date can be viewed in the Settings app under General → About. This information can provide additional insight into the health of the battery. The battery's maximum capacity remains listed under Battery → Battery Health &amp; Charging.\r<br />\n\r<br />\niOS 17.1 is expected to be released in late October.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/27/ios-17-1-battery-health-features-iphone-15-only/\">New Battery Health Features Remain Limited to iPhone 15 Models on First iOS 17.1 Beta</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/new-battery-health-features-remain-limited-to-iphone-15-models-on-first-ios-17-1-beta.2405140/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c92725f2429ae8a0c0660b0b9fdb0d855deecd4a2675375f9e5a56fc13e3998b","category":"Apple"}