{"title":"Meta CEO Mark Zuckerberg Says Quest 3 is Better Than Apple Vision Pro","link":"https://www.macrumors.com/2024/02/13/meta-quest-3-apple-vision-pro-zuckerberg/","date":1707874866000,"content":"Meta CEO Mark Zuckerberg today compared the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> to the $500 Meta Quest 3 <a href=\"https://www.instagram.com/p/C3TkhmivNzt/\">in an Instagram video</a>, and provided several reasons why he thinks Meta's headset is better than Apple's.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/meta-quest-3.jpg\" width=\"1385\" height=\"779\" />\r<br />\nAccording to Zuckerberg, the Quest 3 is better \"for the vast majority of things that people use mixed reality for,\" and here are some of the things he said about the Meta Quest 3:\r<br />\n<ul>\r<br />\n \t<li>It's 7x less expensive than Vision Pro.</li>\r<br />\n \t<li>It does high-quality passthrough with big screens \"just like Vision Pro.\"</li>\r<br />\n \t<li>Quest is a lot more comfortable - it's 120 grams less.</li>\r<br />\n \t<li>There are no wires that get in the way when you move around.</li>\r<br />\n \t<li>The field of view is wider and the screen is brighter.</li>\r<br />\n \t<li>Vision Pro has motion blur when you move around. Quest is a lot crisper.</li>\r<br />\n \t<li>Precision controllers are available, as is hand tracking, and Quest's hand tracking is more accurate.</li>\r<br />\n \t<li>Quest's immersive content library is a lot deeper.</li>\r<br />\n \t<li>You can watch YouTube or play Xbox.</li>\r<br />\n</ul>\r<br />\nZuckerberg said that he was surprised at the \"tradeoffs\" that Apple had to make to provide a higher resolution screen than is offered by the Quest 3, sacrificing \"comfort,\" \"ergonomics,\" and more. He went on to explain that Apple is not always the leader in a new product category, and that he hopes Meta's devices will ultimately \"win.\"<blockquote>Now look, I know that some fanboys get upset whenever somebody dares to question if Apple is going to be the leader in a new category, but the reality is that every generation of computing has an open and a closed model. And yeah, in mobile, Apple's closed model won. It's not always that way. If you go back to the PC era, Microsoft's open model was the winner. In this next generation, Meta is going to be the open model, and I really want to make sure that the open model wins out again. The future is not yet written.</blockquote>The Meta Quest 3 launched back in October. It has two 2K LCD panels compared to the ‌Apple Vision Pro‌'s 4K microLED displays. It weighs 515 grams while the Vision Pro weighs 600 to 650 grams, and it does not have a separate battery pack. It uses Qualcomm's Snapdragon XR2 Gen 2 chipset, has 8GB RAM, and is equipped with Touch Plus controllers.\r<br />\n\r<br />\nMeta has produced several headsets so far, including the Oculus Quest, the Oculus Quest 2, the Quest 3, and the Quest Pro. Apple plans to continue producing headsets, and rumors suggest that the next-generation version will be much more affordable. When explaining the price of the Vision Pro, <a href=\"https://www.macrumors.com/2024/02/02/tim-cook-on-vision-pro-moment/\">Apple CEO Tim Cook said</a> that it was \"tomorrow's technology today.\"<br />This article, \"<a href=\"https://www.macrumors.com/2024/02/13/meta-quest-3-apple-vision-pro-zuckerberg/\">Meta CEO Mark Zuckerberg Says Quest 3 is Better Than Apple Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/meta-ceo-mark-zuckerberg-says-quest-3-is-better-than-apple-vision-pro.2419400/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c939dcd0748280c26dcdf7ffdc1c302d99e5f6e1ddc5787d4bf0f6af009ed2c0","category":"Apple"}