{"title":"No Man’s Sky gets an impressive VR-DLSS performance boost—let’s test it","link":"https://arstechnica.com/?p=1769190","date":1622716253000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/nms-prism-listing-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/nms-prism-listing.png\">Enlarge</a> <span>/</span> <em>No Man's Sky</em> added a bunch of trippy stuff this week, including rideable mounts. We love mounts. But we also love frames, so hence, we're analyzing the game's newfound use of DLSS, specifically in its punishing VR mode. (credit: <a href=\"https://www.nomanssky.com/\">Hello Games</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Over the past few years, Nvidia's Deep Learning Super-Sampling (DLSS) standard has largely delivered on its magical promise: smoother gaming performance <em>and</em> crisper imagery, all based on zillions of machine-farm computations to predict 3D game visuals. (You can see comprehensive DLSS breakdowns in my reviews of the <a href=\"https://arstechnica.com/gadgets/2021/02/nvidia-rtx-3060-review-at-329-gpu-beggars-cant-be-choosers-nor-can-miners/\">RTX 3060</a> and <a href=\"https://arstechnica.com/gadgets/2021/06/nvidia-rtx-3080-ti-review-3090s-power-for-300-less-theoretically/\">RTX 3080 Ti</a>.) The catch remains that your computer needs a compatible Nvidia \"RTX\" GPU to tap into the proprietary standard; this has become much more difficult in <a href=\"https://arstechnica.com/gadgets/2021/04/intel-nvidia-tsmc-execs-agree-chip-shortage-could-last-into-2023/\">a chip-shortage world</a>.</p>\n<p>If you run a DLSS-compatible game on an Nvidia RTX GPU, the performance gains can range from a solid 25 percent to an astonishing 90 percent—usually with greater returns coming at higher resolutions. But until this week, one demanding PC gaming use case has somehow not been a part of the DLSS ecosystem: virtual reality.</p>\n<p>The default pixel resolution on popular headsets like <a href=\"https://fave.co/3fMsfjT\" target=\"_blank\">Oculus Quest 2</a>, <a href=\"https://store.steampowered.com/valveindex\" target=\"_blank\">Valve Index</a>, and <a href=\"https://tidd.ly/34G3rDF\" target=\"_blank\">HP Reverb G2</a> often surpasses an average 4K display, and those headsets <em>also</em> demand higher frame rates for the sake of comfort. Thus, the DLSS promise seems particularly intriguing there. When DLSS works as advertised, a given game renders fewer pixels. This is when Nvidia's RTX GPUs leverage their \"tensor\" processing cores to fill in the missing details in ways that, theoretically, look better than standard temporal anti-aliasing (TAA) methods.</p></div><p><a href=\"https://arstechnica.com/?p=1769190#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769190&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c948bf5f3112bd2ee70245d0f20ce54157b4fff7967f3297b77cac3769225989","category":"Tech"}