{"title":"Analysis of the spatio-temporal dynamics of Buxus hyrcana Pojark defoliation using spaceborne satellite data","link":"https://academic.oup.com/forestry/article/97/5/713/7609834?rss=1","date":1708128000000,"content":"<span><div>Abstract</div>This study aims to assess the spatio-temporal defoliation dynamics of box tree, one of the few evergreen species of the Hyrcanian Forests. For this, we integrated multi-temporal leaf-off optical Sentinel-2 and radar Sentinel-1 data from 2017 to 2021 with elevation data. A state-of-the-art sample migration approach was used to generate annual reference samples of two categories (defoliated and healthy box tree) for a set of target years 2017–2020. This approach is based on field samples of the reference year 2021 and two similarity measures, the Euclidean distance and the spectral angle distance. The analysis of spectral and radar profiles showed that the migrated samples were well representative of both defoliated and healthy box trees categories. The migrated samples were then used for spatially mapping the two classes using support vector machine classification. The results of support vector machine classification indicated a large extent of box tree mortality. The most significant changes from healthy box trees to defoliated ones, or vice versa, occurred during the years 2017 and 2018. In the consecutive years of 2019, 2020, and 2021, no significant changes in the distribution of healthy or defoliated box trees were observed. The statistical assessment also revealed that mortality of evergreen understory tree species can be mapped with practically sufficient overall accuracies reaching from 84% (in 2017) to 91%–92% (in 2020 and 2021) using spaceborne remote sensing data. This information using freely accessible satellite data can benefit forest managers responsible for monitoring landscapes affected by the box moth and facilitates the identification of optimal control programs.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"c94957535a652e53563816d85dd865c89248db6a8920b0c2d9be71969cb712bf","category":"Environment"}