{"title":"A 7‐yr spatial time series resolves the island mass effect and associated shifts in picocyanobacteria abundances near O'ahu, Hawai'i","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12711?af=R","date":1728575010000,"content":"<h2>Abstract</h2>\n<p>Islands in oligotrophic oceans act as local sources of nutrients. These nutrients originate from land and from deep oceanic nutrients introduced to the photic zone by tides, currents, and internal waves interacting with island bathymetry. These processes create the island mass effect (IME), in which increased chlorophyll <i>a</i> (Chl <i>a</i>) is found near islands compared to oceanic waters. The IME has been described via satellite observations, but the effects on phytoplankton community structure are not well documented. From 2013 to 2020, chlorophyll, nutrient, and picoplankton samples were collected from multiple depths on quarterly cruises at two sites south of O'ahu, Hawai'i. <i>Prochlorococcus</i>, <i>Synechococcus</i>, picoeukaryotes, and heterotrophic bacteria were enumerated using flow cytometry. We compared nearshore results to Sta. ALOHA, 100 km from O'ahu. Consistent with the expected IME, Chl <i>a</i> concentrations were significantly enhanced at both nearshore sites compared to Sta. ALOHA. <i>Prochlorococcus</i> concentrations increased with greater distance from shore, particularly below 50 m; mixed layer concentrations of <i>Synechococcus</i> and picoeukaryotes significantly decreased with greater distance from shore, as did concentrations of nitrate and phosphate below the mixed layer. Heterotrophic bacteria concentrations did not show a spatial trend. Carbon-based biomass estimates of the picoplankton population indicated that the IME-associated Chl <i>a</i> increases near the island are likely driven by larger phytoplankton classes. This study describes the IME-associated shift in the picophytoplankton community distribution, which has implications for nutrient cycling, food web dynamics and fisheries in oligotrophic island ecosystems, and adds to the understanding of spatial heterogeneity in carbon fixation in the ocean.</p>","author":"Christina M. Comfort, \nChris Ostrander, \nCraig E. Nelson, \nDavid M. Karl, \nMargaret A. McManus","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"c94d66d0b2590048a9e5f1464858e7f923c11fc1cc8d4fd91508c77a5cbc5e2f","category":"Environment"}