{"title":"Five Steps To Design Your Product With Powerful Storytelling","link":"https://smashingmagazine.com/2023/02/sell-product-powerful-storytelling/","date":1676455200000,"content":"<p>I can’t imagine the digital world without the <strong>magic of storytelling</strong>. While I consider storytelling as an art, it is also a discipline that has its roots in Ancient Greece and Aristotle’s writing: <em>Poetics</em>:</p>\n<blockquote>“A whole [story] is what has a beginning and middle and end.”</blockquote>\n\n<p>In this essay, the Greek philosopher identified for the first time the three main components of a story: beginning, middle, and end, and how they each related to one another.</p>\n<blockquote>“A beginning is that which is not itself necessarily after anything else, and which has naturally something else after it. An end is that which is naturally after something itself, either as its necessary or usual consequent and with nothing else after it. And a middle, that which is by nature after one thing and also has another after it.”</blockquote>\n\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/01-SIDP-SellingIdea-Storytelling-Artistotle3ActStructure.png\" /></p>\n<p>Aristotle’s three-act structure has remained unchanged since 300 BC. Although many writers, screenwriters, and film directors have conducted a variety of complex experiments, the most <strong>successful stories never stray from this basic root</strong>.</p>\n<p>Today, designers use the same structure to map user experiences and design user-centered products. A remarkable and memorable example of the power of storytelling is the change in Apple’s direction of communication on Steve Jobs’ return. He had spent some time running Pixar, and his experience with the company’s storytellers was essential to what happened next at Apple: the belief that by <strong>focusing on customers’ needs</strong> and tapping into their stories, they would sell more computers. (They did, of course!)</p>\n<p>However, designers cannot become good storytellers by using Aristotle’s three-act structure alone. We must also identify specific storytelling elements to help develop our narrative.</p>\n<p>In the following five steps, we will tap into each of the different elements of storytelling, with a running example of the approach I used to <strong>design the experience and interface</strong> behind the <a href=\"https://smart-interface-design-patterns.com/\"> video course landing page</a>.</p>\n<a href=\"https://smart-interface-design-patterns.com/\"><img src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7cc4e1de-6921-474e-a3fb-db4789fc13dd/b4024b60-e627-177d-8bff-28441f810462.jpeg\" /></a>Meet <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a>, our new video course on interface design &amp; UX.\n\nStep 1: Understand Your Protagonist And The Purpose Of The Product\n<p>As designers of experiences, we need to build beautiful interfaces that create meaningful interactions with our audience. So before imagining the layout of the landing page, I needed to find an answer to a critical question: <strong>who is our protagonist?</strong></p>\n<p>The <em>protagonist</em> is the hero of our story. The story, therefore, is never about the product we sell. It is always about the protagonist, who reflects the audience’s own interaction with that product.</p>\n<p>So to answer the first question, we need to know our <strong>protagonist’s needs, goals, fears, and frustrations</strong>. This is the rule number one for every UX designer, just as it is for any storyteller.</p>\n<p>When you need insights about your protagonist, you can use a <em>set of questions</em> to conjure a most likely persona. If the product already exists in the market, you can use other research tools, like usability testing or heat maps. In my case, <em>Vitaly Friedman</em>, the creator of the video course, had already identified his target ahead of time, during the workshops and conferences he had completed in the past year.</p>\n<p>Watching the video chapters of the course, I understood that our story’s protagonists would be <strong>UX and UI designers</strong> with a beginner to advanced level of knowledge about design and interface design patterns.</p>\n<p>The frustration of these protagonists is usually the lack of time to research and learn. Specifically, those who are trying to fully embrace the world of UX design wish to learn design patterns quickly, so they can figure out the reasons why one might offer a better experience than another. On the other hand, a more experienced target group doesn’t have time to stay updated with the latest UX best practices between projects.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/02-SIDP-SellingIdea-Storytelling-Personas.png\" /></p>\n<p>Our protagonists’ needs and story, therefore, define our <strong>story’s purpose:</strong> Why does this story matter to them?</p>\n<p>Defining the <em>why</em> of the story is always a challenging step of storytelling. It only becomes easy once you know your protagonist well. The audience will only stick around if the story resonates with them. Additionally, a story without a clear purpose is hazy and irrelevant, so the story’s intention must be defined upfront.</p>\n<p>Re-articulating <a href=\"https://www.youtube.com/watch?v=fMOlfsR7SMQ\">Simon Sinek’s Golden Circle</a>, a <em>stickable</em> story needs to know the purpose of its existence, i.e. the audience problem it is trying to solve (<em>why</em>), what sets it apart from others (<em>how</em>), and at the end, the product and service it is selling to solve the problem (<em>what</em>).</p>\n<p>This is what the Golden Circle looks like when applied to the experience design for the landing page:</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/03-SIDP-SellingIdea-Storytelling-GoldenCircle.png\" /></p>\n<ul>\n<li>The <strong>why</strong> of our story tapped into our protagonists’ frustrations about the <strong>lack of time</strong>. So our story is first about communicating that learning is an investment. Secondly, through Vitaly’s own experience and research, they will save time and effort.</li>\n<li>The <strong>how</strong> reflects on their learning goals and staying up to date: if they are hungry for knowledge, they will be satisfied.</li>\n<li>The <strong>what</strong> is a reflection on the WHY and HOW. We want people to <strong>subscribe to the video course</strong> only after evaluating its benefits and tasting the material (adding some valuable features during navigation with <a href=\"https://www.youtube.com/watch?v=aSP5oR9g-ss\">free samples</a>, previews, extra gifts, and persuasive elements, like testimonials).</li>\n</ul>\n<p>The protagonist and the purpose are the elements that propel us to the next step of our narrative: <strong>the plot.</strong></p>\nStep 2: Define The Structure Of Your Narrative\n<p>Aristotle teaches us that stories must be a chain of cause-and-effect moments. Each scene must lead to what happens next and not work as a standalone <em>episode</em>, no matter how attractive and well-executed it is. Remember, the plot must also have <strong>a beginning, middle, and end.</strong> </p>\n<p>In his book, <a href=\"https://buildingastorybrand.com/\">Building a Story Brand</a>, Donald Miller examines the cause-and-effect structure as follows: a <em>protagonist</em> aims for something, but in her quest, she encounters a <em>problem</em>. During her journey, a <em>guide</em> steps into her life and shows her a <em>plan</em> that invites her to action. By <em>acting</em>, the protagonist will <em>avoid failure</em> and end her story in a <em>success</em>. He calls this structure the <strong>StoryBrand Structure.</strong></p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/04-SIDP-SellingIdea-Storytelling-StoryBrand.png\" /></p>\n<p>For every project, whether a digital product or brand design, I combine Miller’s StoryBrand format with Aristotle’s three-act structure to convey <strong>a clear sense of continuity</strong> throughout the narrative. </p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/05-SIDP-SellingIdea-Storytelling-Artistotle3ActStructure-StoryBrand.png\" /></p>\n<p>Then I work on each act individually, analyzing every element of the narrative.</p>\n<h3>The Beginning</h3>\n<p>The beginning, also known as the first act, is the <em>setup</em>.</p>\n<p>In UX design, this is the moment where we meet our <em>protagonist</em> (the hero) with her problems and goals, as analyzed in the previous step.</p>\n<p>At the end of <strong>Act I</strong>, our protagonist meets a <strong>guide</strong>. The guide is not another hero. They simply act as a helping hand, showing the protagonist how to move forward in her transformational journey. You could use the plot of your favorite movie as an example of how this occurs.</p>\n<p>Here’s an example from my own favorite childhood movie, <a href=\"https://www.imdb.com/title/tt0088323/\">The Neverending Story</a>. The child-protagonist, Bastian, is neglected by his father and bullied at school (<em>problem</em>). Trying to escape the bullies, Bastian enters a bookstore, annoying the bookseller <strong>(the guide)</strong> who is reading an interesting book that is not for children. Secretly, Bastian takes the book, titled <em>The Neverending Story</em>, and reads it in the school’s attic.</p>\n<p>The book describes the fantasy world of Fantasia, which is slowly being devoured by a malevolent force called “The Nothing”. The Childlike Empress, who rules Fantasia, has fallen ill, and the young warrior Atreyu is tasked to discover a cure, believing that once the Empress is well, The Nothing will no longer be a threat.  </p>\n<p>Bastian soon understands that the book he is reading will save Fantasia from disappearing (<em>the plan</em>), and he needs to give a new name to the princess (<em>Action</em>) to help Atreyu win his battle against The Nothing (<em>avoid failure</em>). Then, he will save the Childlike Empress and her Empire (<em>success</em>).</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/06-SIDP-SellingIdea-Storytelling-TheNeverEndingStory.png\" /></p>\n<p>So, when identifying the <em>guide</em> of your story, whether a person, a service, a product, or a brand, ensure it is someone <strong>the audience will trust</strong> and follow because they feel understood and in safe hands. The guide’s inner qualities are <strong>empathy and authority,</strong> which should be reflected in every communication material they share with their audience.</p>\n<p>In the landing page example, our story’s guide is Vitaly Friedman. Investigating his profile, I established a past of remarkable work sharing resources and best practices in Smashing Magazine and many conferences, workshops, and online. On social media, Vitaly has built a strong reputation in his community as a UX expert and extremely knowledgeable in this field. He, therefore, possesses all <strong>the traits of a guide.</strong></p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/07-SIDP-SellingIdea-Storytelling-VitalyActivity.png\" /></p>\n<h3>The Middle</h3>\n<p>The middle, also known as <em>the second act</em>, is the <strong>confrontation</strong>. In this specific part of the story, we assist the transformation of the protagonist and her emotional state (this transformation is also known as the <em>character arc</em>).</p>\n<p>At the beginning of the second act, the guide gives the protagonist a <em>plan</em>. The question the protagonist expects the <em>guide</em> to answer is, “What do you want me to do now?”</p>\n<p>In the middle of <em>The Neverending Story</em>, we discover that Bastian needs to follow a precise plan: he needs to give a new name to the Childlike Empress to prevent the dissolving of Fantasia.</p>\n<p>So the plan needs to be clear, highlighting every step and <strong>removing any sense of risk</strong> or doubt that our protagonist may have in considering it.\nBy giving your users a plan, you set a clear path to help them move forward in their journey.</p>\n<p>In the case of the landing page, I asked Vitaly to list the content of his offer and explain the simple steps that must be taken to subscribe to the available plans. I then underlined the unique values and the plan for each subscription and designed a simple overview.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/08-SIDP-SellingIdea-Storytelling-Plans.png\" /></p>\n<p>At the end of the second act, the guide must clearly communicate what <em>action</em> the protagonist needs to perform with the plan.</p>\n<p>In <em>The Neverending Story</em>, the protagonist Bastian is in complete disbelief that he is part of the solution, and moved by the Empress begging, he calls out the new name, running to the attic window to call out “Moon Child”. </p>\n<p>In the same way, when we sell a service or a product, we need to <strong>invite the users to take a journey with us</strong>, just as we have via the landing page. If we plainly tell them, they will know what to do with our well-laid plan.</p>\n<p>Vitaly invites the audience to act in two ways. One is a <strong>direct call to action</strong> through a \"Buy\"-button that is positioned on different parts of the landing page. The other is a transitional call to action through free video episodes, email newsletter and content samples.</p>\n<p>Transitional actions also come in other forms:</p>\n<ul>\n<li><strong>testimonials</strong> from other experts in the field, and </li>\n<li><strong>unlimited access to the UX checklists</strong>, an elegant deck of 165 cards to learn and recall basic design patterns for successful digital experiences.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/09-SIDP-SellingIdea-Storytelling-Actions.png\" /></p>\n<h3>The End</h3>\n<p>The ending is the story’s third and <strong>final act.</strong></p>\n<p>It is here that we will decide how our protagonist will succeed in her goal or avoid failing. In doing so, we need to achieve <strong>the peak of our story or climax</strong> by specifying what’s at stake if the user (or the protagonist) doesn’t engage with us.</p>\n<p>It is essential to <strong>find the right balance</strong> in how we introduce negative consequences, so we can avoid generating fear that will parallyze and freeze the protagonist from moving forwards in her journey.</p>\n<p>In <em>The Neverending Story</em>, when the Childlike Empress begs Bastian, she tells him that Fantasia will disappear without his help, and so will his favorite hero, Atreyu, and his dragon Falkor. She taps into Bastian’s wishes of belonging to something bigger than himself, thereby proving that he is worthy. This a desire we sense the protagonist seems to aspire to since the beginning of the movie when he seeks his father’s attention or tries to escape his bullies. </p>\n<p>For the video course, we remind the user that she can only become an expert after a while and that <strong>it would probably take many years</strong> of research and reading and studying to become good at UX. So why not build the knowledge on top of well-explained, curated foundation and jump into a course with Vitaly, who has “cooked” the best recipes and <strong>bulletproof design patterns</strong> over 15 years?</p>\n<p>We should remember that our story’s goal is to <strong>motivate our users</strong> to become better versions of themselves, and that they need only start this journey with us to achieve such an incredible transformation!</p>\n<p>For this particular reason, the third act is also called <em>the resolution</em>. When designing a user journey, we also define a list of resolutions to the protagonist’s problem. In designing the user experience for the landing page, the list was created from a mix of status and inspirational resolutions:</p>\n<ul>\n<li><strong>Self-improvement:</strong> Become an influential and more knowledgeable UX designer, and receive a UX certificate.</li>\n<li><strong>Networking opportunities:</strong> Join an advanced UX workshop where you will meet Vitaly, get feedback from him personally and work with other designers around the world.</li>\n<li><strong>Improve the web:</strong> Work confidently towards designing better digital experiences on the web.</li>\n</ul>\n<p>These resolutions were presented in different parts of the landing page to remind the user why she is on this journey with us, and where we wish to take her.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/10-SIDP-SellingIdea-Storytelling-StructureForSIDP.png\" /></p>\nStep 3: Connect The Plot With A Wireframe\n<p>Now that all of the story elements are in place, it is essential to understand how they will fit together and connect on the landing page. I usually think about each page of the website as <strong>a single shot with its beginning, middle, and end</strong> scenes. Many of these shots make a scene, and a series of scenes make an entire website or application.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/11-SIDP-SellingIdea-Storytelling-PlotStructure.png\" /></p>\n<p>Following the plot I created in the previous step, I started out by organizing the content and adding <strong>critical plot points</strong>.</p>\n<p>Plot points in dramaturgy are incidents that directly impact <em>what happens next</em> in a story. When used well, they help the protagonist move forward in her journey. In UX, the plot points work <strong>precisely in the same way</strong>. They are <em>actions</em> (for example, “buy now” buttons), <em>barriers</em> (logins or forms to fill), <em>delights</em> (unexpected interactions or free samples), <em>system events</em> (confirmation messages and emails), and <em>triggers</em> (notifications) that the user needs to perform to move forward in their journey.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/12-SIDP-SellingIdea-Storytelling-PlotPoints.png\" /></p>\n<p>Using a simple piece of <strong>dotted paper</strong>, I usually start sketching how my story’s content will ideally be displayed between the different parts of the page. You may wonder about the mobile-first approach at this point. When designing an experience as we are doing right now, what matters is ensuring it is <strong>consistent with our story</strong> and that it can be replicated on every media, no matter the pixel size or the support used.</p>\n<p>So if you wish to start with mobile or a large screen, our aim is to define the user journey in a way that could be transformed into an interface for the landing page (as in our case), in a leaflet, or in a marketing campaign.</p>\n<h3>Opening Scene</h3>\n<p>The opening scene <strong>sets up the story’s premise</strong> and is the first element of the page that the user will see, regardless of which website or application she lands on. The upper area of the page presents the product or service to the audience.</p>\n<p>We wanted to <strong>induce curiosity</strong> in our protagonist in this specific part of the page. For this reason, the content needs to be engaging and compelling, prompting the user to scroll down for more. I would add a trigger that actively invites the user to “scroll down” to the next part of the shot, the middle scene.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/13-SIDP-SellingIdea-Storytelling-OpeningScene.png\" /></p>\n<h3>Middle Scene</h3>\n<p>The middle scene of our shot is the place where most of our narrative will happen. We will introduce our protagonist to <strong>the guide, the plan, and the action</strong> we wish them to perform. There will be a section that explains the video course and the content in full detail, with content samples and other elements that will help users better understand and explore the video course.</p>\n<p>To build <strong>authority and trust</strong> around our experience, we do not simply introduce Vitaly but also a series of <strong>testimonials from other experts</strong>. Our protagonist is no longer curious but armed with relevant information! She needs a clear reason to engage with our product. For this reason, any action or plot point added should satisfy this specific emotional aim.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/14-SIDP-SellingIdea-Storytelling-MiddleScene.png\" /></p>\n<h3>Closing Scene</h3>\n<p>The closing scene is <strong>the resolution of our plot.</strong> </p>\n<p>As previously explained, we offer <strong>two plans</strong> that evoke two specific outcomes; we are not simply asking which plans our protagonist wants, but what kind of transformation she is aiming for. Here the user is <strong>mindful</strong>, so we need to ensure nothing distracts her from the decision-making.</p>\n<p>So in this specific scene, the “Buy”-button is the one and only action we wish our user to focus on.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/15-SIDP-SellingIdea-Storytelling-FinalScene.png\" /></p>\n<p>The footer and the top navigation are complementary elements of our narrative. The navigation facilitates the journey, while the footer provides more engagement in case our hero needs additional time to decide or wishes to join the larger community that Vitaly is serving.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/15bis-SIDP-SellingIdea-Storytelling-Navigation.png\" /></p>\nStep 4: Add Emotional Connection To Create A Memorable Story\n<p>The first three steps focused on the user journey and page content. In this step, we think about <strong>making the story memorable for our users.</strong> Otherwise, our landing page will look like any other random page!</p>\n<p><strong>Emotional connection</strong> is an essential part of the storytelling process and can be conveyed through visual elements like colors, sounds, illustrations, animations, and images. These play a huge role in motivating and giving intention to the actions taken by the user.</p>\n<p>To find the central theme of our landing page, I focused on critical elements and designed a map with keywords to help me create a <em>forced connection</em>, another wonderful aspect of storytelling that is based on combining disparate functions, materials, or processes.</p>\n<p>This process is used to generate disruptive ideas and original concepts:</p>\n<ul>\n<li><strong>Our users’ needs (hungry users)</strong>: learning fast, getting the best lessons in UX, and hungry for knowledge.</li>\n<li><strong>The set (kitchen)</strong>: a friendly and informal kitchen.</li>\n<li><strong>Vitaly’s role (chef)</strong>: experienced teacher, UX expert and guide.</li>\n<li><strong>The tools (recipes)</strong>: real-time examples, blackboard, notes, video courses, and slides.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/16-SIDP-SellingIdea-Storytelling-ForcedConnection.png\" /></p>\n<p>These elements all remind me of <strong>a well-designed food experience</strong> conveniently delivered right to your door: our “knowledge-hungry” users can follow Vitaly’s recipes (<em>the videos</em>) at their own pace. Each <em>recipe</em> has been prepared and cooked by Vitaly, packed with the <em>best nutritional elements</em> (tips, tools, examples. slides, and so on) that create strong and compelling designs.</p>\n<p>The <strong>color palette</strong> is a mix of inspiration from the blackboard that opens each episode of the course, the primary red of the Smashing Magazine theme, and the wonderful video course illustrations by <a href=\"https://guillaumekurkdjian.com\">Guillaume Kurkdijan</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/17-SIDP-SellingIdea-Storytelling-ColorPalette.png\" /></p>\n<p>I then used the previous wireframe and <strong>enriched it with sketches</strong> that could complete and clarify the scene. These sketches served as a blueprint for the final illustrations.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/20-SIDP-SellingIdea-Storytelling-Sketches.png\" /></p>\n<h3>Opening Scene</h3>\n<p>A rich starter to introduce some of the design patterns taught in the course is <a href=\"https://www.youtube.com/watch?v=aSP5oR9g-ss\">accordion UX</a> (<em>the spring with fish</em>), reviews and ratings (<em>stars</em>), cookies (<em>the biscuit</em>), hamburger menu (<em>the spaghetti</em>), adding personality to the web (<em>salt and pepper</em>).</p>\n<p>The illustration matches the user’s emotional state, <strong>curiosity</strong>, by surprising her with an unexpected food theme.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/18-SIDP-SellingIdea-Storytelling-OpeningIllustration.png\" /></p>\n<h3>Middle Scene</h3>\n<p>We decided to introduce Vitaly with images showing him involved in teaching, while the course chapters are like <strong>cookbooks</strong> on the shelf, shown through a carousel.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/19-SIDP-SellingIdea-Storytelling-ChapterCarousel.png\" /></p>\n<p>My favorite illustration is the <strong>Buddha Bowl</strong>, which is used to introduce all the content provided during the course. This illustration satisfies our <strong>protagonist’s need for more information</strong>. It is interactive so that from the ravioli to the small bottle of oil, the audience can explore the nutritional elements that make this course so unique and flavourful!</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/21-SIDP-SellingIdea-Storytelling-BuddhaBowl.png\" /></p>\n<h3>End Scene</h3>\n<p>Three small illustrations introduce the <strong>available plans</strong> that tap into the resolutions we mention in step 2. The illustrations for each plan are relevant to the plans but presented small to avoid interfering with the focused state of our protagonist.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/22-SIDP-SellingIdea-Storytelling-Plans.png\" /></p>\n<p>An empty bowl suggests that our users have now <em>eaten</em> a part of the content, but if they are still hungry, there are more ways to engage with Vitaly.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/23-SIDP-SellingIdea-Storytelling-EmptyBowl.png\" /></p>\n<p>Additional small illustrations, all food related, introduce the different sections of the landing page and their content. Talented animator, <a href=\"https://www.cassie.codes\">Cassie Evans</a>, brought these illustrations to life with <strong>subtle animations</strong> so that the entire landing page is playful and appealing.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/24-SIDP-SellingIdea-Storytelling-SmallIllustrations.png\" /></p>\nStep 5: Test Our Narrative Before Engaging With Our Customers\n<p>Before presenting an idea to customers, I usually follow <strong>a detailed check</strong> to ensure that the final design still represents the user’s story, as outlined during the previous steps.</p>\n<p>Some of the questions I ask myself are the following:</p>\n<h4>What Primary Action Do I Want The User To Take On This Page?</h4>\n<p>The answer references the story element <strong>action.</strong> I usually check if there are enough <em>plot points</em>, like buttons and triggers, on the page to engage the user at different stages of her journey.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/25-SIDP-SellingIdea-Storytelling-Question01.png\" /></p>\n<h4>What Secondary Action Do I Want The User To Take?</h4>\n<p>This answer relates to the <em>transitional actions</em>, which means anything that invites the user to engage with us in other ways before they click the “Buy”-button.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/26-SIDP-SellingIdea-Storytelling-Question02.png\" /></p>\n<h4>How Am I Supporting The Need To Scroll For More Details?</h4>\n<p>In this case, my attention switches to <strong>the plot and the cause-effect element</strong> that define the narrative. Looking at the structure laid out in step 2, I check if the scenes included in the landing page still follow the logic of the user’s journey and if there are enough plot points to carry the narrative.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/27-SIDP-SellingIdea-Storytelling-Question03.png\" /></p>\n<h4>Does Any Content Distract The User, Or Prevent Her From Completing Her Task?</h4>\n<p>This question focuses on the clarity of the message and our resolutions. In general, each page should focus on a specific outcome. Anything that blurs our intentions should therefore be removed.</p>\n<p>Different parts of the landing page refer to our <strong>three resolutions</strong>, with the entire page built around them.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/28-SIDP-SellingIdea-Storytelling-Question04.png\" /></p>\n<h4>Can We Anticipate The Final Action?</h4>\n<p>The answer to this question usually relies on the user’s ability to <strong>jump into the climax of the story</strong> quickly, to the action (in our case: available plans with “Buy”-buttons). Think about fast-forwarding your favorite movie to get to the most thrilling scene or leafing to the last page of a book to discover who the killer is!</p>\n<p>In the case of a landing page, the “Buy”-button is at the beginning of the navigation and follows the user as she scrolls… so she can jump to the story’s third act at any time she likes.</p>\n<p><img src=\"https://files.smashing.media/articles/sell-product-powerful-storytelling/29-SIDP-SellingIdea-Storytelling-Question05.png\" /></p>\nConclusion\n<p>As we have discovered, storytelling is more than just another business buzzword. Storytelling is <strong>an exciting and strategic approach</strong> with rules and clear principles that, when used well, can help brands stand out from the crowd with a clear message and a user-centric approach. It’s an essential skill that designers should embrace, no matter their specialization or profile.</p>\n\n<p>As such, the different steps I have illustrated will help you to:</p>\n<ul>\n<li><strong>Identify your protagonist</strong> and build a powerful, purposeful story that speaks to their frustrations and goals.</li>\n<li><strong>Create a user journey</strong> that directly relates to the protagonist’s story.</li>\n<li><strong>Structure that journey as a wireframe</strong> to identify your chosen story content based on the narrative structure.</li>\n<li><strong>Create an emotional bond with the user</strong> by adding meaningful illustrations.</li>\n<li><strong>Check the story’s narrative with questions</strong> that evaluate your use of the wider storytelling process.</li>\n</ul>\n<p>Precisely as it occurs in the world’s most acclaimed movies, building a solid narrative structure guides you in creating scenes and chapters that are consistent with the user’s own story.  </p>\n<p>In this way, you can use the plot of a solid, recognizable, and popular narrative as a base from which to create <strong>additional scenes and chapters</strong>, and even successive sequels — as a great many movie franchises have achieved with thrilling effects.</p>\n<p>In fact, the same plot illustrated in this post for the <a href=\"https://smart-interface-design-patterns.com/\">landing page</a> helped me to create a warm and instantly recognizable design for Vitaly’s upcoming secretive new project. Still, as the narrative voice of <em>The Neverending Story</em> reminds us, “that is another story, and shall be told another time!” </p>\n<a href=\"https://smart-interface-design-patterns.com/\"><img src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/sell-product-powerful-storytelling/smart-interface-design-patterns-final-result.png\" /></a>Where everything is coming together: <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a>.\n\n<p>You can find the final result now live on <a href=\"https://smart-interface-design-patterns.com/\"><strong>Smart Interface Design Patterns</strong></a>, created with incredible contributions by so many talented and hard-working people:</p>\n<ul>\n<li>wonderful animations by <a href=\"https://www.cassie.codes/\">Cassie Evans</a>,</li>\n<li>chapter illustrations by <a href=\"https://guillaumekurkdjian.com/\">Guillaume Kurkdijan</a>,</li>\n<li>front-end built with Eleventy by <a href=\"https://www.trysmudford.com\">Trys Mudford</a>,</li>\n<li>promo illustrations by <a href=\"https://www.ricardogimenes.com\">Ricardo Gimenes</a>,</li>\n<li>wonderful photos by <a href=\"https://marcthiele.com\">Marc Thiele</a></li>\n<li>and fantastic testimonials from people around the world!</li>\n</ul>\n<p>Thank you for your incredible work, everyone! 👏🏼👏🏽👏🏾</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"f300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"c95e3a389afe5faad71b37e9dca745a75e0e15e3a018e2f10917d5","category":"Tech"}