{"title":"Google Earth is now a 3D time machine","link":"https://arstechnica.com/?p=1757139","date":1618503434000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Columbia-Glacier-Timelapse-in-Google-Earth.gif\" /></div>\n        <p>\n          You can now watch glaciers melt away forever in 3D.                       [credit:\n                        Google                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google has <a href=\"https://blog.google/products/earth/timelapse-in-google-earth/\">pushed out</a> what it says is Google Earth's \"biggest update since 2017\" with a new 3D time-lapse feature. Entering the new \"Timelapse\" mode of Google Earth will let you fly around the virtual globe with a time slider, showing you satellite imagery from the past 37 years. Google Earth Timelapse has been <a href=\"https://arstechnica.com/gadgets/2016/11/browse-three-decades-of-satellite-imagery-with-google-earth-timelapse/\">around for years</a> as part of Google Earth Engine (which is a totally separate interface from Google Earth; it's a weird Google branding thing), but it was previously only available in 2D. Now, Google has mapped all this data across the 3D Google Earth globe, where you can watch cities being built, forests being cut down, and glaciers receding.</p>\n<p>Google Earth Timelapse isn't just a huge amount of data; properly mapping it across the globe means correcting the images for artifacts and problems. The company had to get clouds out of the way, correct images for perspective, and ensure seamless transitioning through zoom levels. Luckily, Google happens to have some really big computers to handle the load.</p>\n<p>The company explains what it took to make Timelapse happen:</p></div><p><a href=\"https://arstechnica.com/?p=1757139#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757139&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c95e62827d59ab11cae70aa09dd85410d2b2c737a32083289fd14d0ec5172ffa","category":"Tech"}