{"title":"Ginkgo biloba: A Leaf of Hope in the Fight Against Alzheimer’s Dementia: Clinical Trial Systematic Review","link":"https://www.preprints.org/manuscript/202404.0852/v1","date":1712918278000,"content":"Alzheimer's disease (AD) is a stealthy and progressive neurological disorder that is a leading cause of dementia in the global elderly population, imposing a significant burden on both the elderly and society. Currently, the condition is treated with medications that alleviate symptoms. Nonetheless, these drugs may not consistently produce the desired results and can cause serious side effects. Hence, there is a vigorous pursuit of alternative options to enhance the quality of life for patients. Ginkgo biloba (GB), an herb with historical use in traditional medicine, contains bioactive compounds such as terpenoids (Ginkgolides A, B, and C), polyphenols, organic acids, and flavonoids (quercetin, kaempferol, and isorhamnetin). These compounds are associated with anti-inflammatory, antioxidant, and neuroprotective properties, making them valuable for cognitive health. A systematic search across three databases using specific keywords GB in AD and dementia yielded 1702 documents, leading to the selection of 15 clinical trials for synthesis. In eleven studies, GB extract/EGb 761® was shown to improve cognitive function, neuropsychiatric symptoms, and functional abilities in both dementia types. In four studies, however, there were no significant differences between the GB-treated and placebo groups. Significant improvements were observed in scores obtained from the Mini-Mental State Examination (MMSE), Short Cognitive Performance Test (SKT), and Neuropsychiatric Inventory (NPI). While the majority of synthesized clinical trials show Ginkgo biloba has promising potential in these conditions, more research is needed to determine optimal dosages, effective delivery methods, and appropriate pharmaceutical formulations. Furthermore, a thorough assessment of adverse effects, exploration of long-term use implications, and investigation into potential drug interactions are critical aspects that must be carefully evaluated in future studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c9616d730b14b31a69563e5c0fd0bcbd704b888cd4782f4f97e303c62917b58e","category":"Interdisciplinary"}