{"title":"A lifetime with Phil Liggett","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-lifetime-with-phil-liggett","date":1692507601000,"content":"\n      <p><a href=\"https://www.rouleur.cc/products/issue-120-the-tours\"><em>This article was originally published in Issue 120: Tours of Rouleur</em></a></p>\n<p>One of Phil Liggett’s side hustles is a kind of never ending tour, an occasional one- man show called <em>An Evening With Phil Liggett</em>. Over a pint of beer, in front of cycling  clubs, cycling fans and casual followers of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, Liggett tells stories, shares memories and recounts anecdotes which are as comfortable as a pair of old slippers.</p>\n<p>If there’s any surprise about these events, it is not in the stories, which are delivered with the word-for-word muscle memory of the practised raconteur, it’s that in-person Phil Liggett isn’t quite the same as television Phil Liggett. He’s surprisingly sweary, and his accent reverts more to the original Wirral delivery of his youth.</p>\n<div></div>\n<p>In-person Phil Liggett is having a bit of a shit day when <em>Rouleur</em> comes to visit. The central heating is, in the homeowner’s words, “fooked”, and he’s juggling workmen, so we’re sitting in a chilly kitchen in Liggett’s house in Hertfordshire while a wood burner struggles to warm the air. Everything is happening at once – phone calls, workmen at the door, <em>Rouleur</em> arriving – and it’s knocking Liggett off his game. The Voice of Cycling curses under his breath as he inadvertently puts a spoonful of ground coffee straight into a mug, rather than the coffee machine.</p>\n<p>Like everybody who has followed a bike race in the last 40 years, I think I know Phil  Liggett. His avuncular, precise commentary, delivered in an odd but familiar blend of Wirral edge and received pronunciation, has been the aural accompaniment to every Tour de France most American cycling fans have ever seen, though most Brits last heard him at the 2015 race.</p>\n<p>The first Tour I ever saw was 1985. That year I discovered Emulator synths, Leo Gemelli jumpers and flecky trousers, modified DeLoreans and Phil Liggett. Fashions, music and generations of cyclists have come and gone in the 37 summers since then, but one thing has remained constant all that time. I’ve known Phil Liggett for longer than I’ve known any of my friends. Of course, I also do not really know him very well at all, but I’m not alone in that.</p>\n<p>Towards the end of a three-hour chat, minus gas company calls – “Hello, am I speaking to a Mr Liggett?” “No, you’re speaking to <em>the</em> Mr Liggett.” – he tells me how many people he is really close to, of the thousands of colleagues, contacts and cycling friends he has. “You can count your real friends on the fingers of one hand,” he says. I silently assent. I think it’s healthy to know the difference between true friends and wider circles of acquaintances. But it also reinforces something else I think about Phil Liggett: that there’s something unknowable about him.</p>\n<p>This is partly because of his stories, which tap out a groove so well worn that during parts of our interview, I know precisely what he is going to say. I’d had him in my ears for the three-hour car journey to Hertfordshire, listening to a few podcasts in which he’d been interviewed. He’d recounted identical anecdotes in all of them, and then told me the same stories. This is not a criticism – most people do the same, but after a while, you wonder if it is the person telling the story, or whether the story has started to tell itself. That creates a disconnect, a subconscious protective mechanism which allows Phil Liggett to do what he has spent his life doing and what he is best at – telling stories – without revealing too much.</p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Phil-3.jpg?v=1692275492\" />You might not notice it, because he’s good with people, but the primary focus of Phil Liggett’s life has been cycling, then below that, everybody and everything else. It leaves less time and energy for all but a few human relationships.</p>\n<p>Phil Liggett has covered 50 Tours de France, and he can’t stop yet. His career spans the entire modern history of cycling: the end of the Merckx era, the Hinault era, the LeMond era, the Indurain era, the EPO era, the Armstrong era, the Contador era, the Sky era and now the Pogačar era. He was a journalist for <em>Cycling</em> magazine and the <em>Daily Telegraph</em>, and also a qualified UCI commissaire. He was the organiser of the  Milk Race for 22 years. He had a lot of fingers in a lot of pies, and I’m still not sure  how the logistics of him commentating on the Tour de France for Channel 4 in the UK, CBS in the USA and the World feed actually worked, though sometimes this involved  flying in a helicopter from a Tour stage finish to Paris to record a segment for CBS in  a hired studio, then back to the race in a mad dash for the next day’s kickoff. He was part of what he claims is the longest-lasting commentary double act in sports history, with the late Paul Sherwen.</p>\n<p>These days, Liggett’s energy is shared between commentary and raising money for wildlife charities in Africa, where he spends quite a lot of time. He turned 80 in August this year, and it’s easy to forget, in the context of 2023, that he’s a product of a different time and culture. The Great Britain of Liggett’s youth and early adulthood in the 1950s and 1960s was black and white, very homogenous, politically volatile as the country rebuilt following World War Two and culturally conservative. The pathway to cycling journalism in those days wasn’t as clear as it is these days – he couldn’t set up a Twitter account and a substack and start uploading takes. And Liggett didn’t start with any social or educational advantages.  </p>\n<p>He was born in August 1943 and lived in Bebington, next to Birkenhead on the Wirral. His father worked on the Cunard cruise ships that sailed out of Liverpool, as a first-class saloon steward, going on long trips away to Australia. His mother was sick with a duodenal ulcer and didn’t work.</p>\n<p>“My dad was a seafarer all his life, and so I never really got to know him,” Liggett says. “He came home for a few days and he was off again for three months. He was paid an allotment, as it was called in those days. Every Wednesday that was paid in and mum totally relied on that income. She got the allotment, it was three dollars to the pound and she had to change it, then she would put it all out. That much for food. That much for cigarettes. This much for rent. Mum was organised, like I am. And then it was all gone within an hour of getting the money.”</p>\n<p>Though Liggett says he never thought about the relative poverty in which he grew up, he does remember his mother going to the Co-Op and getting groceries on credit “She was sick, but her mentality was that she gave me my strength, whereas my dad was my dad. He was a damn good worker, a perfect husband, but that was it. I never really knew him. He was very insular. We had a friendly relationship but it wasn’t close. I was definitely a mummy’s boy, because I looked after her, and I developed her tenacity. She always fought tooth and nail – she was a terrific lady,”</p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Phil-1.jpg?v=1692275508\" />Liggett had a sister who was 18 years older, but she moved out when he was still very young, so he was de facto an only child, raised by a de facto single mother. He didn’t  pass his 11-plus, and went to the local technical college, where he achieved a single  O-level, in English. On the other hand, he had decided that he wanted to be a professional cyclist. He’d started out cycle touring, then gravitated towards racing, partly because he thought the racers he used to see hanging around in the cycling cafe at Two Mills looked like the cool guys.</p>\n<p>Photos of Phil Liggett from his racing days in his 20s show a lean, confident athlete with an easy smile. He was really good looking in that early 1970s way, with sideburns, longish wavy hair with a vague side parting, prominent cheekbones and louche-looking five o’clock shadow. He was good at racing, but not great – he tried to make it in Belgium, but could never quite break through.</p>\n<p>Liggett came home and got himself a job at the Port Sunlight factory, in the catering department, where he lugged huge milk churns around and carried on trying to find success in bike races, but shortly after he started he got a call from Alan Gayfer, the editor of <em>Cycling</em>. When Liggett had complained to Gayfer from Belgium about the lack of coverage he and the other riders racing there were getting, they worked out a solution where Liggett would send dispatches every week for £10. Liggett called in his copy from the Gent-Sint-Pieters railway station every Sunday evening, on reverse charges.</p>\n<p>Gayfer was calling Liggett to tell him a reporting job had come up at <em>Cycling</em> and would Liggett be interested? He was up and running in cycling journalism. For a while, the dream of being a pro was still alive. Liggett raced, reported on the races he was in, and hovered around at a level just slightly below international selection. But the multitasking was killing him – a full-on full-time job with quite a lot of late-night working and racing without being able to quite train properly were  wearing him down. “I realised I couldn’t be a pro, so I made the decision to be a journalist,” he says. “I wanted to be somebody in life.”</p>\n<p>Liggett used to draw quite a lot of ire from cycling fans in the fallout from the Lance Armstrong saga. He’d been about the last person for whom the penny dropped, and the perception, if not quite the reality, was that he was one of Armstrong’s inner circle. More on this later, but it’s also true that by the 2010s, some cycling fans were beginning to tire of the Liggett-Paul Sherwen commentary double act.</p>\n<p>Liggett and  Sherwen had a formula which had barely changed since they started in the 1980s. Their schtick was always to explain and simplify an esoteric and complex sport in which meaning is often hidden, which was necessary even into the 21st century, and they were very good at this. The target audience was people who’d never watched cycling before, because for a long time, that’s what most people were. However, with a more savvy and educated cycling public emerging into the 2010s, with a lot more access to resources and information about the sport and more direct conduits of information from pros through social media, fans started demanding more technical explanations and a more modern approach.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Phil-eyes-2263.jpg?v=1692275532\" alt />The homely, gentle banter between Liggett and his sidekick started to look dated.  However, what this overlooks is that Phil Liggett, without education or training, was a brilliant, resourceful and effective commentator. He was good at the simple things, he was calm, balanced and phlegmatic and he knew the sport inside out. When a rainstorm hit the finishing line at a stage during the 1987 Tour, knocking out the television monitors the commentators relied on for pictures of the racing, Liggett and his producer Brian Venner thought on their feet.</p>\n<p>Venner phoned through to Liggett from the UK, where he could see the feeds, and told him what was going on, while Liggett relayed what Venner was saying into his ear for the British viewers. Other countries’ broadcasters had radio silence. Liggett really hit his stride in the late 1980s, coincidentally, or perhaps because, there was a supercluster of some of the most entertaining Tours in the race’s history, all packed into the years between 1985 and 1989, with the bonus that there was also a run of wins by English-speaking riders, just at the point when Channel 4 started doing daily coverage in the UK. The 30-minute highlights programme was soundtracked by former Buzzcocks lead singer Pete Shelley’s classic synths-and-backbeat theme music.</p>\n<p>At the same time, Liggett had been savvy enough to tap Sherwen up almost straight out of his professional European career. He felt Sherwen was a natural communicator. Having raced in Europe until the end of 1985, the ex-pro’s contacts book and ability  to get interviews was worth the extra training he needed in order to gain confidence  in front of the camera.</p>\n<p>“The late 1980s were the highlight of my career,” Liggett says. “We had a good run. Robert Millar was winning stages. I commentated on the first English-speaker to win the Tour, which was Greg LeMond in 1986. That was great because I worked for CBS as well as Channel 4. I remember sitting on the roof of a  bus on the Champs-Élysées for a midnight transmission at the end of the Tour, and we got Greg on, along with Andy Hampsten, who was fourth and won the white jersey. I thought I’d never get to commentate on another English speaker winning and we got Roche the very next year.”  </p>\n<p>The 1987 Tour saw without doubt Liggett’s greatest moment in cycling commentary, a perfect confluence of logistics and race circumstances that mixed the adrenaline shock of the kind of sudden turnaround you don’t normally get in the slow-burn unfolding of a bike race, and a Tour-altering result. On the summit finish at La Plagne, the television cameras were with the stage battle between Laurent Fignon and Anselmo Fuerte, and with the yellow jersey Pedro Delgado, but not with the dropped Stephen Roche, who according to reports was between one and two minutes behind Delgado, and in the process of losing the Tour.</p>\n<p>This is Liggett’s finish-line monologue, delivered from the moment Delgado gets to the finish line. You have to imagine the intensity of the crescendo that culminates in the penny-drop moment, and then the expert summation, through to the link with Sherwen, but you should also watch it on YouTube. Punctuation is missing where Liggett audibly did not use it: “Pedro Delgado has slipped Stephen Roche on the climb. But remember, at one point he had a minute and a half. And just who is that rider coming up behind? Because that looks like Roche. That looks like Stephen Roche. It’s Stephen Roche who’s come over the line. He almost caught Pedro Delgado I don’t believe it. What a finish by Stephen Roche, we never knew he was that close. Stephen Roche has risen to the occasion so, so well he almost caught Pedro Delgado on the line. Surely, Paul Sherwen, Stephen Roche is now going to win this Tour de France.”</p>\n<p>You would never get this now – there’s too much information available and too many time checks. Also, you could speculate that modern cycling fans might have watched Pedro Delgado getting caught, passed and then dropped by Fabio Parra in the final couple of kilometres, and realised that Delgado wasn’t going so well.  </p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Phil-5.jpg?v=1692275590\" />“There was a new director on French TV that year,” says Liggett. “He was only interested in following the French. We had no clue what was going on, all we knew was that we’d heard at the bottom that Delgado was a couple of minutes ahead of  Roche. We didn’t know Roche was hauling himself back at a rate of knots. Delgado crossed the line, and we just saw these legs appear at the top of the screen among the cars. He crossed the line seconds behind Delgado and he collapsed right in front of us, which was very nice of him because we got the camera down on him. That put me in the Irish market – I did the World Championships for Irish television after that, and Roche bloody won.”</p>\n<p>Liggett has done well out of cycling, and it is his life. The American commentary jobs were particularly lucrative, and there’s no  way he’s still working as a cycling com- mentator at 79 for the money. He must still love doing it, even though he insists that the moment he stops, he won’t look at another cycling result. He cuts a slightly less omnipresent, slightly diminished figure these days than in his 1980s heyday, but I’ve had the sense for the last decade that the Lance Armstrong business knocked his confidence. He admits that it scarred him. “I haven’t spoken with him since 2011, apart from an interview on television,” he says.</p>\n<p>Liggett’s misfortune is that he was the most prominent Anglophone voice in cycling when Armstrong incited a huge explosion in interest in the sport with seven Tour wins, later stripped when he confessed to doping. Liggett rode the wave, helped out with Armstrong’s charity events, and critics felt that he was either complicit, or at best, not doing his job. But he maintains he didn’t know Armstrong that well.</p>\n<p>“I flew on his private jet, but he sits at the front and plays on his computer,” he says. “Whenever he sent an email and wanted something, it was just two lines. We never had conversations. I enjoyed the gigs because I met a lot of great people. Lance was getting paid for the gigs, but he was also raising a lot of money. He flew in, drove in a car with blacked out windows, did the gig and left.</p>\n<p>“I know he’s hurting because he can’t get into races. He genuinely loves racing, and don’t forget he was a f*cking good bike rider. But he’s not a nice person.”</p>\n<p>There was a degree of naivety in Liggett’s approach to Armstrong, but if the sport is going to move on from the dark period it was in for the first dozen years of the 21st century, staying angry at a 80-year-old man might not be the way to achieve it. I do not sense that Phil Liggett is affected by too much self-doubt or introspection, and he seems to be a doer rather than a thinker: he jumps straight in. As a television commentator, there’s no time for dwelling on what has been said, because it’s already time for the next sentence.</p>\n<p>But in a more general sense, he has walked a line through his career between enthusiasm and a hint of Alan Partridge. There is a level of self-absorption needed to live the kind of life Phil Liggett has: he took a bike on his honeymoon, and he and his wife Trish consciously decided not to have children in order to maintain their hectic lifestyle of travel and work.</p>\n<p>Trish now competes in ballroom dancing competitions; Liggett will drive her to them and sit in the car outside reading a book, rather than watch. His hobbies and interests almost come from another era: birdwatching, model trains and steering a narrowboat down canals. He still cycles a lot. I don’t think it’s unimportant that these are mostly both solitary and slow, quiet pursuits.</p>\n<p>Liggett’s success in life has partly been a story of grabbing golden opportunities when they arise, and he takes them first and works out if he can actually do them later, which suggests an optimistic streak. The job at <em>Cycling</em> magazine wasn’t such a stretch – he had already been filing copy and race reports from Belgium. But he took  on the job of Milk Race organiser with little previous experience of an event of that  scale, and was dropped into television commentary, at an event at Crystal Palace shown live on ITV World of Sport, without even knowing how the monitors worked.</p>\n<p>He also talks like a perfectionist and he says that he hates things going wrong. He is detail-oriented, and his stories are full of dropped names and tangents. He is the kind of storyteller who will not only mention his first car, but also how much it cost, the make and model, and what he used it for. (It was a Ford 100E, which cost £120, and he took his parents for a day  trip to Wales.)</p>\n<p>There’s a scene in the recent film made about him, <em>Phil Liggett: the Voice of Cycling</em>, where he finishes a short interview, notices that the switches on two empty electrical sockets are in the ‘on’ position, and absent-mindedly leans across to switch them both off. You can tell it makes him feel better.</p>\n<p>Liggett has translated these personality traits into a lifelong career in cycling, and there are few cycling fans who can remember a time when he was not a big presence in the sport. And Liggett himself is not ready to move on from the sport which has consumed his life. He’s no good at doing nothing, he says, and can’t see the point in retiring. “I’ve always said, what do I retire from?” he says. “This is my life.\"</p>\n<p> </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c96196b0e1c432a671786d591d67948c4b310a3e35cb3f59ddef32e0edc30c6b","category":"Cycling"}