{"title":"A Mobile Phone Sales Forecasting Method Based on Attention-LSTM and Brand Exposure","link":"https://www.preprints.org/manuscript/202409.0036/v1","date":1725259442000,"content":"Background: Accurate sales forecasting in the mobile phone industry is critical to                                                                                                                                                                                                                                 informed decision making by both the government and corporations. This study seeks to enhance mobile phone sales predictions by incorporating brand exposure as a predictive factor, hence addressing the gap left by the existing forecasting models that do not consider the impact of brand awareness.\n\nMethod: This study thereby indicates a quantification method for brand exposure that merges word-of-mouth reviews with online search data. Word2Vec is used to extract initial keywords from a word-of-mouth corpus, whereas time-lag correlation analysis refines the core keywords. Later, PCA synthesizes brand exposure. The attention-LSTM framework hereby develops a forecasting model of mobile phone sales, effectively combining long short-term memory networks with the ability to capture time series dependencies and an attention mechanism to reduce data redundancy.\n\nResults: By considering brand exposure, the experiments demonstrate that the attention-LSTM model decreases the RMSE and MAPE indicators by 2.02% and 0.96%, respectively. In addition, compared with the ARIMA, SVR, BP neural network, and LSTM models, the attention-LSTM model decreases the average percentage errors by 6.52%, 3.42%, 2.56%, and 0.81%, respectively.\n\nConclusion: Attention-LSTM captures dynamic sales trends very well and holds great significance over traditional models. Overall, including brand exposure, this model is very strong for the interpretation of mobile phone sales predictions, which has important implications in terms of policy as well as corporate strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"c972e83f290df08460fac06d3aff438c006b982fa3e0daf30748932608340c8a","category":"Interdisciplinary"}