{"title":"Apple Releases iOS 15.2 With App Privacy Report, Legacy Contacts, Hide My Email Improvements and More","link":"https://www.macrumors.com/2021/12/13/apple-releases-ios-15-2/","date":1639417722000,"content":"Apple today released iOS 15.2 and iPadOS 15.2, the second major updates to the iOS and <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a> operating systems that were released in September 2021. iOS 15.2 comes more than a month after <a href=\"https://www.macrumors.com/2021/10/25/apple-releases-ios-15-1/\">the launch of iOS 15.1</a>.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nThe iOS and iPadOS 15.2 updates can be downloaded for free and the software is available on all eligible devices over-the-air in the Settings app. To access the new software, go to Settings &gt; General &gt; Software Update. It may take some time for the update to roll out to all users. \r\n<br />\r\n\r\n<br />\r\niOS 15.2 adds App Privacy Report, a feature designed to let you know how often apps are accessing permissions-restricted info like the camera and the microphone, plus it lets you know the domains that apps and websites are contacting so you can keep an eye on what's going on behind the scenes.\r\n<br />\r\n\r\n<br />\r\nThe update includes Communication Safety for devices owned by children and the <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> Voice Plan, plus it introduces Legacy Contacts for managing your data after you die, and it adds improvements to <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a>, Hide My Email, and more. Apple's full release notes for the iOS 15.2 update are below:<blockquote>iOS 15.2 adds Apple Music Voice Plan, a new subscription tier that provides access to music using Siri. This update also includes the App Privacy Report, new safety features for children and parents in Messages, and other features and bug fixes for your iPhone.\r\n<br />\r\n\r\n<br />\r\n<strong>Apple Music Voice Plan</strong>\r\n<br />\r\n<ul><li>Apple Music Voice Plan is a new subscription tier that gives you access to all songs, playlists, and stations in Apple Music using Siri</li>\r\n<br />\r\n<li>Just Ask Siri suggests music based on your listening history and likes or dislikes</li>\r\n<br />\r\n<li>Play it Again lets you access a list of your recently played music</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>Privacy</strong>\r\n<br />\r\n<ul><li>App Privacy Report in Settings lets you see how often apps have accessed your location, photos, camera, microphone, contacts and more during the last seven days, as well as their network activity</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>Messages</strong>\r\n<br />\r\n<ul><li>Communication safety setting gives parents the ability to enable warnings for children when they receive or send photos that contain nudity</li>\r\n<br />\r\n<li>Safety warnings contain helpful resources for children when they receive photos that contain nudity</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>Siri and Search</strong>\r\n<br />\r\n<ul><li>Expanded guidance in Siri, Spotlight and Safari Search to help children and parents stay safe online and get help with unsafe situations</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>Apple ID</strong>\r\n<br />\r\n<ul><li>Digital Legacy allows you to designate people as Legacy Contacts so they can access your iCloud account and personal information in the event of your death</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>Camera</strong>\r\n<br />\r\n<ul><li>Macro photo control for switching to the Ultra Wide lens to capture macro photos and videos can be enabled in Settings on iPhone 13 Pro and iPhone 13 Pro Max</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>TV app</strong>\r\n<br />\r\n<ul><li>Store tab lets you browse, buy, and rent movies and TV Shows all in one place</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>CarPlay</strong>\r\n<br />\r\n<ul><li>Enhanced city map in Apple Maps with road details like turn lanes, medians, bike lanes, and pedestrian crosswalks for supported cities</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>This release also includes the following enhancements for your iPhone:</strong>\r\n<br />\r\n<ul><li>Hide My Email is available in the Mail app for iCloud+ subscribers to create unique, random email addresses</li>\r\n<br />\r\n<li>Find My can locate iPhone for up to five hours when in Power Reserve</li>\r\n<br />\r\n<li>Stocks allows you to view the currency for a ticker and see year-to-date performance when viewing charts</li>\r\n<br />\r\n<li>Reminders and Notes now allow you to delete or rename tags</li></ul>\r\n<br />\r\n\r\n<br />\r\n<strong>This release also includes bug fixes for your iPhone:</strong>\r\n<br />\r\n<ul><li>Siri may not respond while VoiceOver is running and iPhone is locked</li>\r\n<br />\r\n<li>ProRAW photos may appear overexposed when viewing in third-party photo editing apps</li>\r\n<br />\r\n<li>HomeKit scenes that include a garage door may not run from CarPlay when your iPhone is locked</li>\r\n<br />\r\n<li>CarPlay may not update Now Playing information for certain apps</li>\r\n<br />\r\n<li>Video streaming apps may not load content on iPhone 13 models</li>\r\n<br />\r\n<li>Calendar events may appear on the wrong day for Microsoft Exchange users</li></ul></blockquote>For a complete overview of all of the features that are available in <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, we have a <a href=\"https://www.macrumors.com/roundup/ios-15/\">dedicated iOS 15 roundup</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/13/apple-releases-ios-15-2/\">Apple Releases iOS 15.2 With App Privacy Report, Legacy Contacts, Hide My Email Improvements and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-ios-15-2-with-app-privacy-report-legacy-contacts-hide-my-email-improvements-and-more.2327331/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cwtIi1WJpeo:cnjE-qHXX0g:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cwtIi1WJpeo:cnjE-qHXX0g:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c975251137044cbf0ce8f2fea7d55a4150352c60c2f81f80548518f36c1a3517","category":"Apple"}