{"title":"Meet the HashiCorp Partner Hackstravaganza Winners","link":"https://www.hashicorp.com/blog/meet-the-hashicorp-partner-hackstravaganza-winners","date":1639699200000,"content":"<p>Back in November, we announced the HashiCorp Partner Hackstravaganza, a virtual hackathon designed to let the HashiCorp partner community in the Asia-Pacific and Japan (APJ) region show off their creativity and learn something new about HashiCorp tools. Our APJ partners came together to compete for $6,000 USD in prizes, plus limited edition HashiCorp swag.</p>\n<p>Today, we are excited to share the winning presentations and demonstrations. The hackathon was a great way for us to engage our partners and learn new tips and tricks relevant to the local community — and we think all the entries were fantastic!</p>\n<h2><a href=\"#3rd-place-niveus-solutions-team-niveus\">»</a><a></a>3rd Place: Niveus Solutions — Team Niveus</h2>\n<p><strong>Team Niveus:</strong> Ankit Awal, Rohan Shetty, Prathiksha Kamath, Mahammad Fayiz, Bhavish Kumar</p>\n<p>The third-place winner, earning $1,000 USD, was Team Niveus from Niveus Solutions, a newly onboarded HashiCorp partner based in India.</p><img src=\"https://www.datocms-assets.com/2885/1639601477-niveus-ss-1.png\" /><p>Team Niveus kicked off its presentation by going through how to enforce best practices with GCP Landing Zone and HashiCorp Terraform (see screenshot above). Although this came at the start of the build, the judges were excited to see where it would lead and how HashiCorp Terraform Cloud features like Sentinel would add security into the build process. It was a great example of using the concept of a landing zone to create a customer-focused repeatable pattern. Team Niveus presented a clear customer-value-based outcome proving that this was a well thought out customer-first approach. Excellent job!</p><img src=\"https://www.datocms-assets.com/2885/1639601503-niveus-ss-2.png\" /><p>More information about Niveus Solutions can be found at <a href=\"https://niveussolutions.com/\">niveussolutions.com</a> or the company’s <a href=\"https://www.linkedin.com/company/niveus-solutions-pvt-ltd-/\">LinkedIn profile</a>.</p>\n<h2><a href=\"#second-place-servian-reena-s-heroes\">»</a><a></a>Second Place: Servian — Reena’s Heroes</h2>\n<p><strong>Reena’s Heroes:</strong> Dylan Graham, Harsha Johncy, Tristan Morgan, Gabe Wong, Isaac Reichman, Daniel Brown</p>\n<p>Team Reena’s Heroes from Servian grabbed second place, worth $1,500 USD.</p>\n<p>This was a great demonstration of the entire HashiCorp stack working together. Using HashiCorp Vault with HashiCorp Nomad to deliver a secure workflow for a customer showed the depth of knowledge that we have come to expect from the Servian team. The ability to deliver this complex type of demonstration so quickly deeply impressed the judges.</p><img src=\"https://www.datocms-assets.com/2885/1639601714-servian-ss.png\" /><p>More information on Servian can be found on <a href=\"https://www.hashicorp.com/partners/systems-integrators/servian\">the company’s HashiCorp Partner page</a> or its <a href=\"https://www.linkedin.com/company/servian/\">LinkedIn</a> profile.</p>\n<h2><a href=\"#first-place-aspirenxt-team-rebels\">»</a><a></a>First Place: AspireNXT — Team Rebels</h2>\n<p><strong>Team Rebels:</strong> Anirudh Marc, Akanksha Bhatt, Bhagyashree Shelke, Chandrashekhar M</p>\n<p>The grand prize winner was Team Rebels, from AspireNXT, which walked away with $3,500 USD. Congratulations!</p>\n<p>AspireNXT won over the judges with a complete, fully realized presentation. It started strong, referencing HashiCorp’s own <a href=\"https://www.hashicorp.com/cloud-operating-model\">Cloud Operating Model (COM)</a> and then led into a clear value proposition for Terraform and a clearly defined positive outcome solving a key problem for the customer. The presentation wrapped up with a multi-product demo that linked back to the opening narrative showing the practical implementation of the COM, Terraform, and Vault delivered the benefits of automation for the customer.</p><img src=\"https://www.datocms-assets.com/2885/1639601836-aspirenxt-ss.png\" /><p>More information on AspireNXT can be found at <a href=\"https://aspirenxt.com/\">aspireNXT.com</a> or the company’s <a href=\"https://www.linkedin.com/company/aspire-nxt-pvt-ltd/\">LinkedIn</a> profile.</p>\n<h2><a href=\"#summary\">»</a><a></a>Summary</h2>\n<p>We’d like to extend a sincere thank you to all our partners who participated in HashiCorp’s inaugural APJ Partner Hackstravaganza! Your entries were terrific and we hope you had as much fun as we did. For everyone who tuned in live, thanks for joining in the excitement and making it a memorable experience.</p>\n<p>We are already planning more hackathon events, so please stay tuned!</p>","author":"Melanie Tan","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"c9868a5b2400c66fceee247521504c290cd2981e50bb4eceb28be09ec1458730","category":"Tech"}