{"title":"Fitbit Announces New Charge 6: What’s New and Different?","link":"https://www.dcrainmaker.com/2023/09/fitbit-announces-different.html","date":1695913200000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Lifestyle-Cycling-Hazel-Sport.png\"><img title=\"Fitbit Charge 6 Lifestyle Photography\" src=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Lifestyle-Cycling-Hazel-Sport_thumb.png\" alt=\"Fitbit Charge 6 Lifestyle Photography\" width=\"720\" height=\"480\" /></a></p>\n<p>Fitbit has just announced an update to their most popular fitness tracker series, with the new Fitbit Charge 6 (obviously, replacing the existing <a href=\"https://www.dcrainmaker.com/2021/09/fitbit-charge-5-in-depth-review.html\">Fitbit Charge 5, from September 2021</a>). The Fitbit Charge 6 has much the same form factor as the Charge 5 did, but now gains back a haptic button, as well as a new optical heart rate sensor. In addition, there’s a slate of new software features inside of it, including new sport modes and even new heart rate broadcasting via Bluetooth.</p>\n<p>I’ll have an in-depth review of the new Charge 6 here soon, but in the meantime I figured I’d just run-through what’s new on the unit after spending a bit of time talking to the engineering team behind it.</p>\n<p>Here’s what’s new and changed:</p>\n<p><strong>– New heart rate sensor:</strong> Fitbit says this is the “most accurate sensor yet in a Fitbit tracker” (though, not including either Pixel or Fitbit smart watches). It’s not the same sensor as last year’s Pixel Watch, but rather a different one. The sensor in the Pixel Watch (which tested very well for me) wouldn’t really fit the bill for this smaller wearable (in terms of physical size or power consumption). However, Fitbit says they are borrowing quite a bit of tech on the “machine learning and AI” side from the heart rate algorithms of the Pixel Watch. They’ve taken those algorithms and “fine-tuned them” to work on the lower-end processor of a Fitbit Charge series device (because this device has to last 7 days, versus 1 day for a Pixel Watch.</p>\n<p><strong>– New heart rate broadcasting:</strong> The Fitbit Charge 6 will allow you to broadcast your heart rate via Bluetooth to any compatible device/app. This would include anything from pairing it up to a Peloton Bike (or app), gym equipment, Zwift, or really basically any app/device that accepts Bluetooth heart rate connections. Newer gym equipment might, but older most likely wouldn’t. Still, every app on the planet can pair to Bluetooth HR sensors, so compatibility is pretty wide. Hopefully this will prod another California company, Apple, into doing the same broadcasting on their devices.</p>\n<p><strong>– Adding 20 new exercise/sport modes:</strong> This brings it to a total of 40 exercise/sport modes, matching what’s on the Fitbit Sense 4 today</p>\n<p><strong>– Adding YouTube Music controls:</strong> When paired with a YouTube Premium account, you’ll get music controls on the Charge 6, when your phone is within range</p>\n<p><strong>– Adding Google Maps Turn-By-Turn directions:</strong> When your phone is within range, it’ll give you turn-by-turn instructions directly on the wrist, pulled from Google Maps</p>\n<p><strong>– Adding Google Wallet support:</strong> Pretty straightforward, allows you to pay from your wrist with Google Wallet</p>\n<p><strong>– Adding ‘Zoom Magnifier’ accessibility feature:</strong> This allows you to get larger text on the device, making it easier to navigate the UI</p>\n<p><strong>– A bunch of new bands:</strong> These include new woven bands and sport bands, but the Charge 5 bands are fully compatible here as well.</p>\n<p><strong>– Requires usage of a Google Account:</strong> As Fitbit/Google previously announced, eventually all Fitbit accounts will become Google accounts. The Charge 6 is the first device that’s going to be Google-account only, even if you’re an existing Fitbit user (you’ll have to migrate your account to use it)</p>\n<p><strong>– Continues to work with both iOS &amp; Android:</strong> No change here, but figured I’d mention it</p>\n<p>The Charge 6 is priced at $159USD, with pre-orders starting today (Sept 28th), and shipping/available on October 12th in 30 countries.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Charge-6-Float-V0-R2.png\"><img title=\"Fitbit Charge 6 Charge 6 - Float - V0 - R2\" src=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Charge-6-Float-V0-R2_thumb.png\" alt=\"Fitbit Charge 6 Charge 6 - Float - V0 - R2\" width=\"720\" height=\"553\" /></a></p>\n<p>Unless noted otherwise, most other things remain the same. That includes the battery life claim, remaining at 7-days – which tends to hold water, Fitbit has historically done a good job of matching their battery claims. Likewise, the 1.04” color display remains the same from the past, as does the existing built-in GPS sensor and notably the GPS antenna design (not changed). And retains the ECG functionality, and skin temperature sensing, as well as SpO2 monitoring.</p>\n<p>However, it’s the GPS antenna design that had I substantial troubles with on the Charge 5, specifically I found that you had a trade-off between either good GPS data, or good HR data – but not booth. That’s because when you tightened the Charge 5 band, it would impact the GPS antenna, which was essentially along the underside edge of the band (thus, blocking the view of the sky). If you loosened the band you got poor HR tracking, but good GPS. I did some fascinating tests with this.</p>\n<p>In talking to Fitbit about it, they said that portion remains unchanged. However, what has been changed is the heart rate algorithms behind it all – as well as the sensor itself. Thus, it remains to be tested whether changes in those two components could mitigate the combo-dish problems I had in the past. But, that’ll come here shortly. The good news is I’ve got a very easy-to-follow/replicate protocol for how to validate that piece, so obviously, stay tuned.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Lifestyle-Cycling-Hazel-Sport-Coral.jpg\"><img title=\"Fitbit Charge 6 Lifestyle Photography\" src=\"https://media.dcrainmaker.com/images/2023/09/Fitbit-Charge-6-Lifestyle-Cycling-Hazel-Sport-Coral_thumb.jpg\" alt=\"Fitbit Charge 6 Lifestyle Photography\" width=\"720\" height=\"480\" /></a></p>\n<p><em>(Also, I appreciate that the cyclist removed the empty Hammerhead Karoo mount from the bike in the first shot, before this shot here. Albeit, that would have been a great place to show off the new heart rate broadcasting feature, which would work with the Hammerhead Karoo cycling GPS that he had on his bike).</em></p>\n<p>Of course, it’s worthwhile pointing out that Fitbit’s parent company, Google, has also announced their fall 2023 hardware event next week in New York City. The company says they’ll be announcing new hardware there, likely including new phones and hopefully wearables. No matter what’s announced, I’ll be on-hand in person (well, with two hands), to test it all out, in New York City. Looking forward to it!</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"c9901d9f934833f7666ab0880784fa3e7f790cef09088d0c5ce102ccc91d8fba","category":"Cycling"}