{"title":"Kuo: Apple's 2022 AR/VR Headset to Support Faster Wi-Fi 6E","link":"https://www.macrumors.com/2021/11/01/apple-ar-vr-headset-wifi-6e-support/","date":1635762203000,"content":"Apple plans to release its first mixed reality headset with Wi-Fi 6E support in 2022, Apple analyst Ming-Chi Kuo said today in a note sent out to investors.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-view-concept-right-corner.jpg\" /><div><em>Concept render by <a href=\"https://aderosa.myportfolio.com/apple-view\">Antonio De Rosa</a> based on recent reports</em></div>\r\n<br />\r\nApple is rumored to be working on at least two AR projects that include an augmented reality headset set to be released in late 2022, followed by a sleeker pair of augmented reality glasses coming at a later date. \r\n<br />\r\n\r\n<br />\r\nAccording to Kuo, Apple's first head-mounted device and similar competing headsets will adopt faster Wi-Fi 6E support to meet the needs of the high-end, immersive experience they deliver.\r\n<br />\r\n<blockquote>The adoption of the latest Wi-Fi specification is a basic requirement for head-mounted displays (HMDs) to improve the wireless experience. New HMDs from Meta, Apple, and Sony will all adopt Wi-Fi 6/6E in 2022.\r\n<br />\r\n\r\n<br />\r\n[...]\r\n<br />\r\n\r\n<br />\r\nWe forecast Meta, Apple, and Sony to be the most influential brands in the metaverse device market in 2022, with Meta, Apple, and Sony launching new HMDs in 2H22, 4Q22, and 2Q22, respectively. </blockquote>Kuo breaks down the logic of his expectation by drawing attention to this year's launch of the Oculus Air Link, a wireless way to play VR games on the Oculus Quest 2, which was launched by Meta, the company formerly known as Facebook. \r\n<br />\r\n\r\n<br />\r\n\"Wi-Fi 6 is significantly better than Wi-Fi 5 in transmission speed and power consumption, so Meta's latest Oculus Quest 2 supports Wi-Fi 6,\" explains Kuo. \"Wi-Fi 6 helps Oculus Air Link operate more stably and allows for a display refresh rate of up to 120Hz (compared to 72Hz or 90Hz for Wi-Fi 5).\"\r\n<br />\r\n\r\n<br />\r\nA previous report by <em>The Information</em> <a href=\"https://www.macrumors.com/2021/09/02/ar-vr-headset-iphone-connection-required/\">claimed</a> Apple's first AR/VR headset will need to be wirelessly tethered to an iPhone or another Apple device to unlock full functionality. <a href=\"https://www.macrumors.com/2020/12/18/iphone-13-may-support-wifi-6e-barclays/\">Some</a> reports <a href=\"https://www.macrumors.com/2021/01/26/iphone-13-wi-fi-6e-rumor/\">suggested</a> this year's iPhone 13 series would feature Wi-Fi 6E, but the rumor never panned out. If both the report from <em>The Information</em> and Kuo's latest headset prediction are accurate, Apple's 2022 iPhone will presumably feature Wi-Fi 6E support.  \r\n<br />\r\n\r\n<br />\r\nWi-Fi 6E offers the features and capabilities of Wi-Fi 6, including higher performance, lower latency, and faster data rates, extended into the 6 GHz band. The additional spectrum provides more airspace beyond existing 2.4GHz and 5GHz Wi-Fi, resulting in increased bandwidth and less interference for devices that support Wi-Fi 6E.\r\n<br />\r\n\r\n<br />\r\nKuo recently <a href=\"https://www.macrumors.com/2021/10/19/apple-ar-vr-headset-mass-production-delay/\">claimed</a> mass production of Apple's headset could be delayed until the end of the fourth quarter of 2022, but today's report suggests it could still launch in the same quarter. This AR/VR headset that's in development is separate from a set of augmented reality smart glasses that are in the works. The sleeker, smaller smart glasses will follow the headset and are expected to launch in 2023. More details are <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">available in our AR/VR roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">Apple Glasses</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/01/apple-ar-vr-headset-wifi-6e-support/\">Kuo: Apple's 2022 AR/VR Headset to Support Faster Wi-Fi 6E</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apples-2022-ar-vr-headset-to-support-faster-wi-fi-6e.2321096/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nBBmO0kCFuM:_QDDRudKGo8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nBBmO0kCFuM:_QDDRudKGo8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/nBBmO0kCFuM\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c9a11b73ef483a0a2efd8ef5b8a78127945102e2e9db0e4f04bd5e43f6289925","category":"Apple"}