{"title":"Apple releases iOS and iPadOS 14.4.2 with a critical Webkit security fix","link":"https://www.macworld.com/article/341507/apple-releases-ios-and-ipados-14-4-2-with-bug-fixes-and-security-updates.html","date":1616779634000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>Apple has released a minor update to iOS and iPadOS, bringing the version number to 14.4.2. The release notes are as basic as can be:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>This update provides important security updates and is recommended for all users.</p></blockquote>\n\n\n\n<p>As for what those security updates are, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212256&amp;xcust=1-1-341507-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Apple&rsquo;s security support site</a> says it&rsquo;s a Webkit security fix, which means that any app that loads content from the web could be impacted:</p>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul><li><strong>Available for:</strong> iPhone 6s and later, iPad Pro (all models), iPad Air 2 and later, iPad 5th generation and later, iPad mini 4 and later, and iPod touch (7th generation)</li><li><strong>Impact:</strong> Processing maliciously crafted web content may lead to universal cross site scripting. Apple is aware of a report that this issue may have been actively exploited.</li><li><strong>Description: </strong>This issue was addressed by improved management of object lifetimes.</li><li><strong>CVE-2021-1879:</strong> Clement Lecigne of Google Threat Analysis Group&nbsp;and Billy Leonard of Google Threat Analysis Group</li></ul><p>In other words, it&rsquo;s an important security fix and you should probably download and apply it right away. Apple is still actively working on <a href=\"https://www.macworld.com/article/331864/ios-14-5-features-release-date-beta-how-to-install.html\">iOS 14.5</a>, but don&rsquo;t wait for that release to protect yourself from a serious web vulnerability. </p>\n\n\n\n<p>For older devices that do not support iOS 13 or iOS 14, Apple has released iOS (and iPadOS) 12.5.2 with the same fix. That will apply to the iPhone 5s, iPhone 6, iPod Touch (6th gen), iPad mini 2 and 3, and the original iPad Air.</p>\n\n\n\n<h2 class=\"toc\" id=\"how-to-update-to-ios-14-4-2\">How to update to iOS 14.4.2</h2>\n\n\n\n<p>To update your iPhone or iPad, open the Settings app, then tap <em>General</em>, then <em>Software Update</em> and follow the instructions. If you don&rsquo;t see the update right away, be patient, as it can take a little while to roll out everywhere.</p>\n</div></body></html>","author":"Jason Cross","siteTitle":"Apple’s upcoming AirTags estimated to undercut Samsung’s Galaxy SmartTags+","siteHash":"440d8081b5051fee9a14c7742d5326403a8162d82f6eb2f60a46b32c1ae0e79f","entryHash":"c9b0494d881055afb6b42f37071cdd58d81bc4a859e8a40f7555016521774a60","category":"Apple"}