{"title":"Apple to Invest Over 1 Billion Euros in Munich Silicon Design Center","link":"https://www.macrumors.com/2021/03/10/apple-new-munich-silicon-design-center/","date":1615365022000,"content":"Apple will make Munich its European Silicon Design Center, the company <a href=\"https://www.apple.com/uk/newsroom/2021/03/apple-to-invest-over-1-billion-euros-in-germany-with-new-munich-campus/\">announced</a> today. Work already being undertaken by Apple in Bavaria's capital is contributing to its custom Apple silicon designs, while the expansion, together with additional investment in R&D, will exceed 1 billion euros in the next three years.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple_germany-silicon-design-center_new-facility-rendering_03102021.jpg\" alt=\"\" width=\"2400\" height=\"1800\" class=\"aligncenter size-full wp-image-788001\" />\r\n<br/>\r\nApple says the new state-of-the-art facility will bring hundreds of new jobs to the area, which is already Apple's largest engineering hub in Europe, with around 1,500 engineers from 40 countries working in a variety of areas including power management design and application processors. The new facility will house employees who will focus on connectivity and wireless technologies.\r\n<br/>\r\n<blockquote>\"I couldn't be more excited for everything our Munich engineering teams will discover — from exploring the new frontiers of 5G technology, to a new generation of technologies that bring power, speed, and connectivity to the world,\" said <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>, Apple’s CEO. \"Munich has been a home to Apple for four decades, and we're grateful to this community and to Germany for being a part of our journey.\"</blockquote>The new, 30,000-square-meter facility is located in central Munich's Karlstrasse, and will be home to Apple's growing cellular unit, Europe's largest R&D site for mobile wireless semiconductors and software. Teams there will create 5G and future technologies, and focus on developing, integrating, and optimizing wireless modems for Apple products.\r\n<br/>\r\n\r\n<br/>\r\nApple plans to start moving into the new building in late 2022, and like all Apple offices globally, it will run entirely on 100 percent renewable energy. \r\n<br/>\r\n\r\n<br/>\r\nApple says it has spent over 15 billion euros with more than 700 companies of all sizes across Germany. This includes the chip manufacturer Infineon, battery company Varta, and the family-owned chemical company DELO, which is delivering resin for Face ID technology in products like the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a>.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/europe/\">Europe</a>, <a href=\"https://www.macrumors.com/guide/germany/\">Germany</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/10/apple-new-munich-silicon-design-center/\">Apple to Invest Over 1 Billion Euros in Munich Silicon Design Center</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-to-invest-over-1-billion-euros-in-munich-silicon-design-center.2287791/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hpeniTN2b8A:1P8IoxiAIZQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hpeniTN2b8A:1P8IoxiAIZQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/hpeniTN2b8A\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c9b53a28f76c3769e6c7d2de2de040111988e7090325905967242f280021745c","category":"Apple"}