{"title":"PSXIII-8 Determining the effects of selenium content of high-selenium forages on weight gain in growing lambs","link":"https://academic.oup.com/jas/article/102/Supplement_3/615/7757810?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>High selenium (Se) forages grow on seleniferous soils in many parts of the world and upon Se-contaminated rangelands such as in the Western Phosphate Resource Area in the western United States. When consumed in large enough amounts or for extended durations, animals can be poisoned, developing acute or chronic selenosis. Naïve livestock will indiscriminately consume forage with increased concentrations of Se if available. However, most animals upon ingesting a sublethal Se dose will become averted to Se-rich plants and select forages with decreased Se concentrations. The purpose of this study was to determine Se concentrations in feed that cause reduced feed intake and decreased body weight (BW) gain in growing lambs (6 to 8 mo of age). Lambs (n = 5) were randomly divided into four groups and were fed a control pellet (&lt; 1 ppm Se) at 1.5% of their BW and had free choice to a custom Se alfalfa pellet containing &lt; 1 (control), 10, 20, or 40 ppm Se for 8 wk. During the 8 wk period the lambs gained 32.9 ± 4.1, 27.8 ± 1.8, 18.9 ± 9.2, and 7.4 ± 2.8% (mean ±SD) of their initial BW in the &lt; 1 (control), 10, 20, or 40 ppm Se groups, respectively. After the 8 wk were completed, the lambs were fed only the custom Se alfalfa pellets, with &lt; 1 (control), 10, 20, or 40 ppm Se, free choice for four additional weeks. As Se concentration in the pellets fed increased, the feed intake and BW gains significantly decreased. Lambs in the control and 10 ppm Se groups ate approximately 2-fold more than the lambs in the 40 ppm Se group, which lost over 3% of their initial BW. Understanding the concentration of Se in forages and how it affects appetite and BW gain allows range managers to better manage seleniferous or Se-contaminated ranges to safely use sheep on these types of rangelands. Additional work is needed to better understand the management of other livestock species grazing on high Se-containing ranges and pastures.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"c9c0f46da553a685343f780f4cac5b239d6eda2207db561e7da5da18489c7fe2","category":"Environment"}