{"title":"Milan-San Remo 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-preview","date":1616011691000,"content":"\n      <p>The monuments have arrived.</p>\n<p>We are days away from the first of cycling’s five monuments, Milan-San Remo, which takes place on <strong>Saturday 20th March</strong>. ‘La Classicissima’, is a historic race with 111 editions, where Eddy Merckx holds the record for the most all-time wins, with an astonishing seven to his name. The race is famous for its length – 300km makes it one of the longest days in the saddle for the riders.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>The 2020 edition was won by Wout Van Aert, who claimed the first monument of his career when he defeated Julian Alaphilippe in the final sprint. The duo went clear of the bunch on the Poggio and were able to hold their lead until the finish.</p>\n<p class=\"p1\"><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – </a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span class=\"s1\">The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p>\n<p>The course has been altered this year due to a landslide on the Passo del Turchino, meaning the peloton will take on the Colle di Giovo instead earlier in the day. Nonetheless, the heart-racing finale remains. The Cipressa (5.5km @ 4.1%) is the first obstacle of note, which comes at kilometre 277. The tempo will no doubt be ramped up here, as the offensive teams look to put the sprinters into the red zone.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2019637_giro_008_1024x1024.jpg?v=1614004642\" alt=\"\"></p>\n<p><em>The infamous Poggio</em></p>\n<p>Following a descent and short flat section, the famous Poggio (3.5km @ 3.8%) comes at kilometre 293. On its own it isn’t the most strenuous of climbs, but with a leg-sapping 290km in the legs and the punchers desperate to escape the clutches of the sprinters, this climb is as challenging as they come.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/msr_1024x1024.png?v=1613668749\" alt=\"Milan San Remo 2021\"></p>\n<p><em>Milan-San Remo profile 2021 (via La Flamme Rouge)</em></p>\n<p>The finish in Milan-San Remo has been designed with consideration — it provides both the sprinters and the attackers a chance to win in almost equal measure. As of late, it has been the punchers that have come out on top — Arnaud Démare was the last pure sprinter to win, crossing the line first in 2016.</p>\n<p>If a sprinter is to win the 112<sup>th</sup> Milan-San Remo, Demare is as good a bet as any. He showed he can still climb well when he claimed stage 7 of the Giro d’Italia to Matera last year.</p>\n<p>Peter Sagan is set to start in Italy again this year. The Slovak seems to suit the terrain in Italy without flaw, but he has never managed to come out on top despite six(!) top-five finishes. As always, he will be among the key favourites, despite his season being setback slightly after contracting COVID-19 at a training camp.</p>\n<p>Giacomo Nizzolo and Davide Ballerini have both started 2021 in great form, winning at the Clásica de Almería and Tour de la Provence respectively. Both riders have proven they can resist when riding up climbs and are clearly in great shape this year. Riding on home soil, do not rule either rider out.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Peloton_coast_040320_OFS_1024x1024.jpg?v=1616012085\" alt=\"\"></p>\n<p>Caleb Ewan, Sam Bennett and Pascal Ackermann are pure sprinters who should do well if they are in the front group for the finale. Whether they can withstand the attacks on the Poggio is their question mark.</p>\n<p>As ever, Julian Alaphilippe will be doing his utmost to cause havoc for the fast men and everyone else in the race. It’s inevitable that the world champion will attack on the Poggio and do his best to go to the line either solo or in a reduced group.</p>\n<p>One of the breakout stars of 2020 is set to start at MSR for the second time in his career — Marc Hirschi. He seems to have similar qualities to Alaphilippe, which he displayed at the Tour de France and in the World Championships last season. He has a great burst in the finish and is a confident descender — an ability which will be beneficial on the Poggio.</p>\n<p>For Team BikeExchange, Michael Matthews is set to start in Italy. The Aussie is well suited to the parcours in Italy as he possesses a great sprint and is also strong going uphill. This has meant he has finished on the podium twice at San Remo before, most recently last season where he was first of the bunch chasing Van Aert and Alaphilippe. He shouldn’t be overlooked, and neither should his young teammate Rob Stannard. It may be too early for him to win a monument, but he could well play his part in supporting Matthews in the final.</p>\n<p>Mathieu van der Poel made his debut at San Remo last season and managed 13<sup>th</sup> place. The Dutchman will enter the race as a hot favourite this season – the Poggio climb should suit him. If he can make his way into an elite group, his sprint may help him earn the second monument of his career after winning the Tour of Flanders last season.</p>\n<p><strong>Favourites:</strong><span> </span>Peter Sagan, Wout Van Aert, Michael Matthews, Mathieu van der Poel, Julian Alaphilippe</p>\n<p><strong>Outsiders:</strong><span> </span>Davide Ballerini, Giacomo Nizzolo, Matej Mohorič, <span>Arnaud Démare</span></p>\n<p><strong>How to watch it</strong></p>\n<p>Milan San-Remo will be shown on Eurosport and on GCN+ in the UK and United States (amongst other<span> </span><a href=\"https://help.globalcyclingnetwork.com/hc/en-gb/sections/360005300779-Which-races-can-I-watch-\" target=\"_blank\" rel=\"noopener noreferrer\">territories</a>), and Rai Sport in Italy.</p>\n<p><em><span>Cover photo: Alex Broadway/ASO/SWpix</span></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c9c5d20f91e78ab32cf0f074614b6e38b712d736ec52231f318a10e09a8b9e3b","category":"Cycling"}