{"title":"Newly discovered Vigilante malware outs software pirates and blocks them","link":"https://arstechnica.com/?p=1774437","date":1623963669000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/vigilantes-800x534.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/vigilantes.jpeg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A researcher has uncovered one of the more unusual finds in the annals of malware: booby-trapped files that rat out downloaders and try to prevent unauthorized downloading in the future. The files are available on sites frequented by software pirates.</p>\n<p>Vigilante, as SophosLabs Principal Researcher Andrew Brandt is <a href=\"https://news.sophos.com/en-us/2021/06/17/vigilante-antipiracy-malware/\">calling the malware</a>, gets installed when victims download and execute what they think is pirated software or games. Behind the scenes, the malware reports the file name that was executed to an attacker-controlled server, along with the IP address of the victims’ computers. As a finishing touch, Vigilante tries to modify the victims’ computers so they can no longer access thepiratebay.com and as many as 1,000 other pirate sites.</p>\n<h2>Not your typical malware</h2>\n<p>“It’s really unusual to see something like this because there’s normally just one motive behind most malware: stealing stuff,” Brandt <a href=\"https://twitter.com/threatresearch/status/1405556488421232640\">wrote on Twitter</a>. “Whether that’s passwords, or keystrokes, or cookies, or intellectual property, or access, or even CPU cycles to mine cryptocurrency, theft is the motive. But not in this case. These samples really only did a few things, none of which fit the typical motive for malware criminals.”</p></div><p><a href=\"https://arstechnica.com/?p=1774437#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1774437&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c9c8c453501c3c4eb7bea6bdbab931c1c1b93ce204a0b7cdc311ac6960dd6536","category":"Tech"}