{"title":"Leak: iOS 17 will focus on performance and stability, iPhone 8 will be supported","link":"https://www.macworld.com/article/1785378/ios-17-leak-app-settings-interface-details.html","date":1681411916000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Anonymous-A.S, a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/threads/the-new-features-coming-in-ios-17-exclusive-from-ios-ipados-watchos-development-team-insider.2386656/&amp;xcust=1-1-1785378-1-0-0&amp;sref=https://www.macworld.com/feed\">MacRumors forum user</a> who has recently popped up with a number of <a href=\"https://www.macworld.com/article/1675641/iphone-15-pro-co-processor-capacitive-buttons-volume-power.html\">intriguing leaks</a> about upcoming Apple products, has posted a Twitter thread detailing numerous aspects and features of iOS 17, the iPhone operating system due to be unveiled at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> on June 5.</p>\n\n\n\n<p>The 10-post thread by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941&amp;xcust=1-1-1785378-1-0-0&amp;sref=https://www.macworld.com/feed\">@analyst941</a> contains 15 separate predictions about iOS 17, which they claim are from a “development team insider.” For the most part, the vague features describe app settings and other interface tweaks. Some of these, such as the range of iPhones that will be able to run the new OS (the same set of devices that could run iOS 16, apparently), have been disclosed by the leaker before now, while others are new. The thread is intended to serve as a state-of-the-nation summary of information up to this point.</p>\n\n\n\n<figure><div>\n<blockquote><p>Exclusive: Almost everything I know about what’s new in <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/hashtag/iOS17?src=hash&amp;ref_src=twsrc%5Etfw&amp;xcust=1-1-1785378-1-0-0&amp;sref=https://www.macworld.com/feed\">#iOS17</a>.<br /><br />(A thread)</p>— 941 (@analyst941) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941/status/1646244634144776193?ref_src=twsrc%5Etfw&amp;xcust=1-1-1785378-1-0-0&amp;sref=https://www.macworld.com/feed\">April 12, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>As ever with “info dump” posts of this kind, the challenge is filtering the significant from the mundane, and more importantly the facts from the guesses: it’s easy when releasing a mass of information at once to slip in details that are only probable (or even possible) by mixing them with the stuff you are sure about. For example, in replies to the Twitter thread, anonymous-A.S says they are “100%” sure that the iPhone 8 will be able to run iOS 17 and they <a href=\"https://www.macworld.com/article/1682885/ipados-ios-17-compatibility-devices-iphone-x-ipad-pro.html\">confirm iPad compatibility rumors</a> as well, but we remain in the dark about the leaker’s confidence concerning many of the other elements.</p>\n\n\n\n<p>Among the new features the tipster predicts in iOS 17 are:</p>\n\n\n\n<ul><li>Major changes to the Control Center UI and customization</li><li>New features for the Dynamic Island</li><li>Additional always-on display settings</li><li>More Focus Mode filters</li><li>Health app UI changes</li><li>Camera app changes</li><li>Notification changes and additional options</li><li>Heavily improved Search/Spotlight</li></ul>\n\n\n\n<p>In most cases, the info is vague or predictable enough that it would scarcely require a special source: most years we see some changes to notifications, for example (the leaker claims these will gain “additional options in Settings”), and it wouldn’t be a surprise for Apple to add additional filters for Focus Mode, which has been steadily expanded in recent years. It also seems obvious or at least logical that the Dynamic Island “will do a lot more,” too, as Apple expands it to the entire <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 lineup</a>.</p>\n\n\n\n<p>But others are more speculative. Most notably Anonymous-A.S appears to side with the older consensus that iOS 17 would focus mainly on reliability (“Performance, efficiency, stability and long-term support for older devices are the main features of this update.”), whereas recent reports have instead pointed to the inclusion of a number of “most requested features” following a <a href=\"https://www.macworld.com/article/1671679/ios-17-most-requested-features-rumor-wwdc.html\">strategic rethink</a>. Perhaps this is a question of interpretation, since even Mark Gurman, who predicted the change of strategy last month, acknowledged that iOS 17 “lacks a tentpole improvement like last year’s revamped lock screen.”</p>\n\n\n\n<p>One of the more intriguing predictions concerns widgets, which anonymous-A.S thinks could become “active.” The leaker clarifies that this means a dynamic quality offering “one-tap buttons, sliders, and more.” iOS 16 users will be aware that widgets are basically snapshots offering rudimentary functionality–the Apple TV widget lets you instantly start playing the next episode of a series with a single tap, for example–so we’re excited to see in what ways Apple can enhance their dynamism and usefulness. Note, however, that this prediction is marked with the caveat that they are “in testing, but not confirmed by any means.”</p>\n\n\n\n<p>Ultimately, given the leaker’s brief track record and the lack of detail given about the source of this information, it’s perhaps best to take the thread as an enjoyable but as-yet unproven glimpse of what might be rather than what definitely is. If corroboration arrives from elsewhere the ideas in the post may firm up, but for now, we’ll be enjoying this thread with a healthy serving of salt. </p>\n\n\n\n<p>For all the latest news and rumors, remember to check out our regularly updated <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 superguide</a>.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c9cb80436349d5c192379d2f79556fa46104ec6b7abb76e58055f5441f63f833","category":"Apple"}