{"title":"China’s state rocket company unveils rendering of a Starship look-alike","link":"https://arstechnica.com/?p=1760041","date":1619445042000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/chinese-starship-800x455.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/chinese-starship.jpg\">Enlarge</a> <span>/</span> Screenshot of a presentation from China's main state-owned rocket manufacturer, CALT. (credit: Weibo/CALT)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>This weekend, China celebrated its sixth \"National Space Day\" in Nanjing, a capital city in one of the country's eastern provinces. As part of the festivities, Chinese space officials highlighted the Chang'e-5 mission's recent return of lunar samples, some of which were on display, and announced the name of China's first Mars rover, <em>Zhurong</em>, which is scheduled to land on the red planet in May.</p>\n<p>A booth operated by China's main state-owned rocket manufacturer, the China Academy of Launch Vehicle Technology, also spotlighted the potential for suborbital point-to-point transportation. This is a concept in which a vehicle launches from Earth, flies into suborbital space, and touches down halfway around the world in less than an hour.</p>\n<p>The promotional video, captured and <a href=\"https://m.weibo.cn/status/4629935237105404\">shared on the Chinese social network Weibo</a>, shows two different concepts for achieving suborbital passenger flights about two decades from now. What is interesting about the video (which I've <a href=\"https://www.youtube.com/watch?v=mzNhrUQ_Qls\">mirrored on YouTube</a>) is that the first concept looks strikingly like SpaceX's Starship vehicle. It shows a large vehicle capable of vertical takeoff and vertical landing.</p></div><p><a href=\"https://arstechnica.com/?p=1760041#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760041&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c9dc8a57143fca52d0eafec681ba5c5ada8999360f91d881d5fb77d6c137f257","category":"Tech"}