{"title":"Twitter ลบบัญชีและคอนเทนต์จากปฏิบัติการไอโอโดยภาครัฐของ 6 ประเทศ ทั้งหมด 3,465 บัญชี","link":"https://www.blognone.com/node/126140","date":1638551847000,"content":"<div><div><div><p>Twitter ได้ทำการปิดหรือลบบัญชีที่สร้างขึ้นเพื่อการทำปฏิบัติการข้อมูลข่าวสารของประเทศต่าง ๆ รวมแล้วกว่า 3,465 บัญชี ทั้งเม็กซิโก, สาธารณรัฐประชาชนจีน, รัสเซีย, แทนซาเนีย, อูกันดา และเวเนซุเอลา</p>\n<p>Twitter ระบุว่าบัญชีเหล่านี้ถูกระงับเนื่องจากผิดข้อกำหนดของแพลตฟอร์ม และคอนเทนต์ทั้งหมดที่เชื่อมโยงกับปฏิบัติการทั้งหมดนี้ได้ถูกลบออกจาก Twitter ถาวร โดย Twitter แจงรายละเอียดตามประเทศดังนี้</p>\n<ul>\n<li>เม็กซิโก: ลบบัญชีสร้างคอนเทนต์สนับสนุนรัฐบาลในเรื่องสาธารณสุข รวมถึงเรื่องพรรคการเมือง</li>\n<li>จีน: ลบเครือข่ายบัญชีที่เผยแพร่ข้อมูลของพรรคคอมมิวนิสต์จีนที่เกี่ยวข้องกับการปฏิบัติต่อชาวอุยกูร์ในซินเจียง และบัญชีที่เชื่อมโยงกับ Changyu Culture บริษัทเอกชนที่ให้การสนับสนุนโดยรัฐบาลท้องถิ่นซินเจียง</li>\n<li>รัสเซีย: ลบบัญชีที่เชื่อมโยงกับ IRA ที่มีปฏิบัติการข้อมูลข่าวสารในสาธารณรัฐแอฟริกากลาง, ปฏิบัติการนำเสนอแนวคิดโปรรัสเซียในแอฟริกากลาง, โจมตีรัฐบาลลิเบียรวมถึงผู้สนับสนุน และคอยสนับสนุนภูมิรัฐศาสตร์ของรัสเซียในลิเบียและซีเรีย</li>\n<li>แทนซาเนีย: ลบบัญชีที่ใช้รายงานโพสต์บน Twitter โดยมีกลุ่มเป้าหมายเป็นผู้สนับสนุน FichuaTanzania, บัญชีที่ทวีตคอนเทนต์สนับสนุนรัฐบาล</li>\n<li>อูกันดา: ลบบัญชีปลอมที่สนับสนุนประธานาธิบดี Museveni และพรรค</li>\n<li>เวเนซุเอลา: ลบบัญชีที่คอนปั่นคอนเทนต์สนับสนุนรัฐบาล, ลบแอป Twitter Patria และแอปที่มีจุดประสงค์ลักษณะเดียวกัน ที่กลุ่มบัญชีใช้เพื่อบริหารจัดการบัญชีกลุ่มนี้</li>\n</ul>\n<p>ที่มา - <a href=\"https://blog.twitter.com/en_us/topics/company/2021/disclosing-state-linked-information-operations-we-ve-removed\">Twitter</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bcc6ddc72a0343181af32edced8ab74f.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/russia\">Russia</a></div><div><a href=\"/topics/uganda\">Uganda</a></div><div><a href=\"/topics/venezuela\">Venezuela</a></div><div><a href=\"/topics/mexico\">Mexico</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"c9eae567cab4d74e6600ff9ee933c709ad236882f20e8663eafd0d4e287a83ff","category":"Thai"}