{"title":"FTC Report Highlights Consumer Harms of Manufacturer Repair Restrictions","link":"https://www.macrumors.com/2021/05/07/ftc-report-consumer-harms-repair-restrictions/","date":1620386804000,"content":"The U.S. Federal Trade Commission has published an in-depth report looking at how the product repair restrictions that manufacturers put in place negatively impact consumers and small businesses in various ways. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-independent-repair-program.jpg\" />\r\n<br />\r\nTitled \"<a href=\"https://www.ftc.gov/system/files/documents/reports/nixing-fix-ftc-report-congress-repair-restrictions/nixing_the_fix_report_final_5521_630pm-508_002.pdf\">Nixing the Fix,</a>\" the report covers a litany of methods that companies use to limit the ability for customers and independent business to repair their products. \r\n<br />\r\n\r\n<br />\r\nFocusing on mobile phone and car manufacturers in particular, the report found that even when a warranty does not explicitly require that repairs be performed by the original manufacturer, many manufacturers restrict independent repair and repair by consumers in the following ways:\r\n<br />\r\n<ul><li>Product designs that complicate or prevent repair</li>\r\n<br />\r\n<li>Unavailability of parts and repair information</li>\r\n<br />\r\n<li>Designs that make independent repairs less safe</li>\r\n<br />\r\n<li>Policies or statements that steer consumers to manufacturer repair networks</li>\r\n<br />\r\n<li>Application of patent rights and enforcement of trademarks</li>\r\n<br />\r\n<li>Disparagement of non-OEM parts and independent repair</li>\r\n<br />\r\n<li>Software locks and firmware updates</li>\r\n<br />\r\n<li>End User License Agreements</li></ul>Manufacturers <a href=\"https://www.macrumors.com/2019/04/30/apple-right-to-repair-consumer-harm/\">including Apple</a> have argued that these repair restrictions exist to protect intellectual property rights and prevent injuries and <a href=\"https://www.macrumors.com/2019/08/14/apple-responds-to-battery-locking-issue/\">other negative consequences</a>, and that opening up repair access would undermine the safety and security of their products. \r\n<br />\r\n\r\n<br />\r\nHowever, after evaluating manufacturers' explanations for the repair restrictions via a workshop and requests for research, the FTC found \"scant evidence\" to support them. The report continues:\r\n<br />\r\n<blockquote>Many consumer products have become harder to fix and maintain. Repairs today often require specialized tools, difficult-to-obtain parts, and access to proprietary diagnostic software. Consumers whose products break then have limited choices.\r\n<br />\r\n\r\n<br />\r\nFurthermore, the burden of repair restrictions may fall more heavily on communities of color and lower-income communities. Many Black-owned small businesses are in the repair and maintenance industries, and difficulties facing small businesses can disproportionately affect small businesses owned by people of color.</blockquote>The report cites one study which found that the appearance of electronic goods was only \"moderately\" important to consumers, as opposed to longevity and reliability, which were \"extremely\" important, and suggests that the lack of information regarding repairability causes \"an asymmetry in the market balance and leaves consumers unable to make the best buying decisions regarding to their own needs.\"\r\n<br />\r\n\r\n<br />\r\nIn addition, the report notes that given a choice between a low-cost repair and buying a new mobile phone, many consumers will opt for the former. In defence of this claim, it cites Apple's <a href=\"https://www.macrumors.com/2017/12/30/apple-29-usd-iphone-battery-replacements-now-avail/\">2017 battery replacement program</a>, which was introduced after Apple was found to be throttling the performance of some <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models to compensate for degrading batteries. In a letter to investors, CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> said that ‌iPhone‌ sales were lower than anticipated due to \"some customers taking advantage of significantly reduced pricing for ‌iPhone‌ battery replacements.\"\r\n<br />\r\n\r\n<br />\r\nIn the conclusion of the report, which was carried out at the direction of Congress and submitted with unanimous consent, the FTC pledges to address what it perceives as unfair restrictions by pursuing \"appropriate law enforcement and regulatory options, as well as consumer education, consistent with our statutory authority.\"\r\n<br />\r\n\r\n<br />\r\nThe FTC also <a href=\"https://www.consumer.ftc.gov/blog/2021/05/ftc-weighs-repair-restrictions\">suggests</a> that consumers can help to redress the balance by reporting when manufacturers aren't obeying the existing rules regarding repairs.\r\n<br />\r\n\r\n<br />\r\n\"This is a great step in the right direction,\" said iFixit CEO Kyle Wiens, <a href=\"https://www.consumer.ftc.gov/blog/2021/05/ftc-weighs-repair-restrictions\">commenting on the report</a>. \"The bi-partisan report shows that FTC knows that the market has not regulated itself, and is committing to real action.\"\r\n<br />\r\n\r\n<br />\r\n<blockquote>\"We're glad to see the FTC acknowledge the scope of the problem, and the real harm to consumers. We're also happy to see the FTC's pledge to undertake enforcement and regulatory solutions to repair restrictions, and fully support them in doing so—these actions are long overdue.\"</blockquote>Apple continues to lobby against state-level legislation that would require electronic hardware manufacturers to provide device schematics, device parts, and instructions to third-party repair shops for device repairs. A \"right to repair\" bill currently being contemplated in <a href=\"https://www.macrumors.com/2021/03/30/apple-lobbies-against-right-to-repair-bill/\">Nevada</a> is one of many bills that states across the US are considering to put into law, although none have yet been successful.  \r\n<br />\r\n\r\n<br />\r\nOutside of the U.S., the European Parliament in <a href=\"https://www.macrumors.com/2020/11/27/european-parliament-supports-right-to-repair/\">November</a> voted to support the recommendations of the EU Committee on the Internal Market and Consumer Protection on the \"Right to Repair,\" including a system of mandatory labelling on consumer electronics to provide explicit information on the repairability and lifespan of products.<div>Tags: <a href=\"https://www.macrumors.com/guide/ftc/\">FTC</a>, <a href=\"https://www.macrumors.com/guide/right-to-repair/\">Right to Repair</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/07/ftc-report-consumer-harms-repair-restrictions/\">FTC Report Highlights Consumer Harms of Manufacturer Repair Restrictions</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ftc-report-highlights-consumer-harms-of-manufacturer-repair-restrictions.2295189/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n98YxNBhzIc:67xg-hyf7D8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n98YxNBhzIc:67xg-hyf7D8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/n98YxNBhzIc\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c9f548704e45616c3c1b0410e89993a2ddc267d994141accfcd8b0433e2c19f6","category":"Apple"}