{"title":"Review: Alogic's New Clarity Pro Displays Include a Retractable Webcam and Optional Touchscreen Functionality","link":"https://www.macrumors.com/review/alogic-clarity-pro-touch-displays/","date":1689191287000,"content":"Last year, accessory company <a href=\"https://alogic.co/?ref=y2uwzwu\">Alogic</a> launched its <a href=\"https://us.alogic.co/products/clarity-27-uhd-4k-monitor/?ref=y2uwzwu\">27-inch \"Clarity\" display</a>, offering a 4K experience with 90 watts of power delivery to charge a connected computer, an array of connectivity options, and hub functionality for connecting peripheral devices.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-displays.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nWith an IPS display for viewing across a wide range of angles, 97% coverage of DCI-P3 color, HDR 400 support, and the ability to quickly transition between landscape and portrait orientations, the Clarity display offers a solid set of features, but Alogic is now <a href=\"https://alogic.co/collections/clarity-monitors/?ref=y2uwzwu\">tacking on some extra features</a> with its just-launched <a href=\"https://us.alogic.co/products/clarity-pro-27-inch-uhd-4k-monitor-with-65w-pd-and-webcam/?ref=y2uwzwu\">Clarity Pro</a> and <a href=\"https://us.alogic.co/products/clarity-pro-touch/?ref=y2uwzwu\">Clarity Pro Touch</a> models.\r<br />\n\r<br />\nI've been testing out the two new models for a few weeks, and I've found the clever new features included on them to be interesting additions that give buyers some nice options to consider depending on their needs.\r<br />\n\r<br />\nAll three models use the same basic display and design, and I've found them to be bright with vivid colors for a high-quality viewing experience, thanks in part to the quatum dot (QD) backlighting that offers good contrast and supports over a billion colors.\r<br />\n\r<br />\nI've been using a pair of LG UltraFine 5K displays for a number of years now, and I was pleased to find that I didn't really notice any difference in the day-to-day experience when running these 4K displays at a scaled 2560 x 1440 resolution to match the desktop size of my previous 27-inch 5K displays, even though the Alogic displays aren't running at exact retina scaling in this scenario.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-camera.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nWhat the Clarity Pro adds beyond the standard Clarity display is an integrated webcam, which has a clever privacy-related feature in that it automatically tucks itself away behind the display while not in use, ensuring that the camera can't be surreptitiously accessed by malware or other attacks without your knowledge. If the camera is up, it's active, and if it's down, it can't see anything except the inside of the display housing even if video capture were to be activated without your knowledge.\r<br />\n\r<br />\n<div></div>\r<br />\nThe camera does make some noise as it moves up and down, which reminds of the potential for motorized parts like this to break over time, but I appreciate the automated privacy aspect of it. I also like the small adjustment wheel that allows for the camera's field of view to be moved up or down to better frame the subject. It doesn't offer as much flexibility as a standalone webcam accessory might, but it's better than a fixed camera integrated into a display bezel, for example.\r<br />\n\r<br />\nThe 8-megapixel webcam offers solid video quality compared to many other options built into Apple's notebooks or external displays, although the Continuity Camera feature recently added to macOS and iOS means you could do even better by using your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> as your Mac's webcam.\r<br />\n\r<br />\nI did run into one camera bug with Zoom while trying to use a pair of these displays, as the app would only recognize one of the webcams regardless of which of the identically named Alogic display cameras I selected in video settings. Alogic says this is a known issue without a resolution yet, but I didn't have the same issue with other apps I tested including Skype, <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, and Teams, so it appears to be something specific to Zoom.\r<br />\n\r<br />\nStepping up to the Clarity Pro Touch adds one additional major feature compared to the Clarity Pro, and that's touchscreen support. While macOS doesn't offer as much support for touch functionality as Windows, some <a href=\"https://alogic.co/blogs/news/installing-clarity-pro-touch-drivers/?ref=y2uwzwu\">drivers and a configuration app from Alogic</a> help provide a decent amount of functionality on macOS. With touchscreen support, you can use either your fingers or a capacitive stylus (<a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a> not supported) to interact with onscreen content.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-settings.jpg\" alt width=\"1618\" height=\"1448\" />\r<br />\nWith the UPDD Commander app, you can customize a fairly significant list of touch gestures involving one, two, three, or five fingers with taps, swipes, and drags in various locations on the screen. For instance, a one-finger tap can register as a traditional mouse click, while a two-finger tap can register as a right click and you can even customize which of the two fingers should be considered as the location of the tap.\r<br />\n\r<br />\nA swipe up from the bottom of the screen can be configured to show/hide the dock, while other combinations of fingers and gestures can do things like invoke Mission Control, hide or quit apps, minimize windows, and much more. Two-finger rotating and pinching motions can also be recognized, allowing for basic direct manipulation of images for rotation and zoom.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-touch-settings.jpg\" alt width=\"1618\" height=\"1448\" />\r<br />\nBeyond a series of default gestures, you can also configure gestures on a per-app basis with a number of Mac apps like Finder, Maps, and Preview automatically preconfigured upon installation of Alogic's drivers and apps. But you're free to further customize any of these and add additional apps to the list however you see fit. It took me a little bit of poking around to get everything set up, but once that was done I found the touch functionality to work well and feel pretty natural.\r<br />\n\r<br />\nWhile I still prefer to use a mouse for most things, I have found some utility to the touchscreen functionality on the Clarity Pro Touch. I've settled into a setup with it in portrait orientation off to my left with email, Twitter, and Slack set up on sort of a status screen, and it's handy to be able to reach over and tap into emails or scroll my feeds by touch rather than moving my mouse over from another screen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-stand.jpg\" alt width=\"1600\" height=\"956\" />\r<br />\nAll three displays feature a high-quality design with a solid two-piece aluminum stand with height, swivel, and tilt adjustments plus a cable management passthrough in the vertical support. The stand has really nice heft and keeps the display very stable with no wobbling as I type on the same support surface.\r<br />\n\r<br />\nThe displays also support 100x100 VESA attachments if you prefer other mounting solutions, and Alogic sells an <a href=\"https://alogic.co/products/clarity-fold-stand-for-clarity-pro-touch/?ref=y2uwzwu\">optional Clarity Fold stand</a> that puts the display in a more ergonomic configuration. That's specifically for the Clarity Pro Touch when used for drawing, for example, though the limited Mac support for this functionality makes that setup less appealing for users in the Apple ecosystem.\r<br />\n\r<br />\nAn assortment of cables in the box including 1-meter USB-C to USB-C (3.2 Gen 1), 1.5-meter USB-A to USB-B, 1.5-meter DisplayPort to DisplayPort, and 1.5-meter HDMI to HDMI options should work with almost any setup. \r<br />\n\r<br />\nThe displays are on the glossy side, but I didn't find a huge amount of glare in my setup. Black bezels measure approximately 1 cm around the top and sides, and around 2 cm along the bottom. These aren't the thinnest bezels on the market and the thicker bottom bezel looks a little out of place, but I've definitely seen worse and at least the displays and bezels are flat under a continuous sheet of glass except for very thin edges.\r<br />\n\r<br />\nBoth the Clarity Pro and the Clarity Pro Touch include a four-microphone array for the webcam, and the audio quality was solid in my testing. Less impressive are the onboard dual 5-watt speakers which sound quite hollow compared to the speakers in my MacBook Pro or even the ones in my usual LG UltraFine displays.\r<br />\n\r<br />\nSpeaker volume and display brightness on Alogic's displays also don't natively respond to the Mac's media keys, even when connected via USB-C. I tried a couple of third-party apps that try to add this functionality, but they yielded only partial success.\r<br />\n\r<br />\nI know I've been spoiled by my LG displays that had the benefit of Apple's input to allow those functions to work pretty seamlessly, but the step down for me in audio management on Alogic's displays was still a bit of a disappointment. Volume and brightness can still be managed via button controls on the bottom edge of the display, but nothing beats having everything integrated with macOS for adjustments right from my menu bar or keyboard.\r<br />\n\r<br />\nOne downgrade for the Clarity Pro and Clarity Pro Touch compared to the original Clarity display is that USB-C passthrough charging is limited to 65 watts instead of 90 watts. This is due to the addition of the built-in webcam, with 25 watts of power reserved for running that. \r<br />\n\r<br />\nI do wish Alogic had opted for a higher-wattage power brick on these Pro models to preserve 90-watt computer charging rather than using a 150-watt brick, but given the efficiency of Apple's latest notebooks, 65W will probably be enough to keep even a 16-inch MacBook Pro topped off unless you're performing particularly demanding tasks. It's certainly been sufficient for me, but if you find it's not, you can easily connect another charging source like the <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> power adapter.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/alogic-clarity-pro-rear.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAlogic displays include some USB hub functionality, though it's important to note that this is pretty limited as it includes just two USB-A ports on the rear of the display and a 3.5mm jack for audio. If your display is connected via USB-C, those USB-A ports will run at USB 2.0 speeds, which is fine for a wired keyboard or mouse, but likely too slow for most users' needs if they're trying to connect external storage.\r<br />\n\r<br />\nIf you connect the USB-B port on the display to your computer, those USB-A ports can run at USB 3.0 speeds, which is significantly better but still far slower than many other connectivity options. Regardless of the connections, these are still USB-A ports in an age where peripherals are increasingly using USB-C.\r<br />\n\r<br />\nFor example, connecting a modest USB-C SSD external drive to the display via USB-A over the USB 2.0 speed yielded transfer rates of just 38 MB/s, around 20x slower than a direct connection to my computer via USB-C. But for lower-bandwidth connectivity needs, it'll do just fine.\r<br />\n\r<br />\nThe <a href=\"https://us.alogic.co/products/clarity-27-uhd-4k-monitor/?ref=y2uwzwu\">original Clarity display</a> carries a regular price of $799.99, while the new <a href=\"https://us.alogic.co/products/clarity-pro-27-inch-uhd-4k-monitor-with-65w-pd-and-webcam/?ref=y2uwzwu\">Clarity Pro</a> with the webcam functionality comes in a $999.99 and the <a href=\"https://us.alogic.co/products/clarity-pro-touch/?ref=y2uwzwu\">Clarity Pro Touch</a> is a further $200 upgrade to $1,199.99. That's on the fairly pricey side for 27-inch 4K 60Hz displays, though they do come with a pretty robust set of features.\r<br />\n\r<br />\nAlogic is also currently running a 20% off promotion with code <strong>ALG20</strong> that brings the prices down to a more palatable $640.00, $799.20, and $959.20 respectively, so this is a nice opportunity to pick up the new displays if they appeal to you.\r<br />\n\r<br />\n<small><em>Note: Alogic provided MacRumors with the Clarity Pro and Clarity Pro Touch displays for the purpose of this review. No other compensation was received. MacRumors is an affiliate partner with Alogic. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</em></small><div>Tag: <a href=\"https://www.macrumors.com/guide/alogic/\">Alogic</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/alogic-clarity-pro-touch-displays/\">Review: Alogic's New Clarity Pro Displays Include a Retractable Webcam and Optional Touchscreen Functionality</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-alogics-new-clarity-pro-displays-include-a-retractable-webcam-and-optional-touchscreen-functionality.2395731/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c9fe495a9350aa64842a4f24ef2a2e31da261b7c9ac3eea867139fbdebd32a83","category":"Apple"}