{"title":"Study: Why a spritz of water before grinding coffee yields less waste, tastier espresso","link":"https://arstechnica.com/?p=1988445","date":1701895250000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<figure>\n    <div>\n        Researchers demonstrate how adding a splash of water reduces static electricity when grinding coffee. Credit: University of Oregon    </div>\n        <figcaption>\n        <div>Researchers demonstrate how adding a splash of water reduces static electricity when grinding coffee. Credit: University of Oregon </div>\n    </figcaption>\n    </figure>\n<p>Scientific inspiration can strike at any time. For Christopher Hendon, a computational materials chemist at the University of Oregon, inspiration struck at a local coffee bar where his lab holds regular coffee hours for the Eugene campus community—a fitting venue, since Hendon's research specialties include investigating the scientific principles behind really good coffee. The regulars included two volcanologists, Josef Dufek and Joshua Méndez Harper, who noted striking similarities between the science of coffee and plumes of volcanic ash, magma, and water. Thus an unusual collaboration was born.</p>\n<p>“It’s sort of like the start of a joke—a volcanologist and a coffee expert walk into a bar and then come out with a paper,” <a href=\"https://www.eurekalert.org/news-releases/1009566?\">said Méndez Harper</a>, a volcanologist at Portland State University. “But I think there are a lot more opportunities for this sort of collaboration, and there’s a lot more to know about how coffee breaks, how it flows as particles, and how it interacts with water. These investigations may help resolve parallel issues in geophysics—whether it’s landslides, volcanic eruptions, or how water percolates through soil.”</p>\n<p>The result is a <a href=\"https://www.cell.com/matter/fulltext/S2590-2385(23)00568-4\">new paper</a> published in the journal Matter demonstrating how adding a single squirt of water to coffee beans before grinding can significantly reduce the static electric charge on the resulting grounds. This in turn reduces clumping during brewing, yielding less waste and the strong, consistent flow needed to produce a tasty cup of espresso. Good baristas already employ the water trick; it's known as the <a href=\"https://www.florincoffee.com/blogs/news/ross-droplet-technique-a-complicated-name-for-a-simple-hack#:~:text=The%20Ross%20Droplet%20Technique%20is,when%20the%20grinder%20is%20running.\">Ross droplet technique</a>, per Hendon. But this is the first time scientists have rigorously tested that well-known hack and measured the actual charge on different types of coffee.</p></div><p><a href=\"https://arstechnica.com/?p=1988445#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1988445&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ca11ecaf29ee6557d42221883e1dc923912b6bbaf6ad2e8081de5a8859b5a248","category":"Tech"}