{"title":"Help Make BugBusting History at AWS re:Invent 2021","link":"https://aws.amazon.com/blogs/aws/help-make-bugbusting-history-at-aws-reinvent-2021/","date":1635195052000,"content":"<p>Earlier this year, we launched the <a href=\"https://aws.amazon.com/blogs/aws/new-aws-bugbust-its-game-over-for-bugs/\">AWS BugBust Challenge</a>, the world’s first global competition to fix one million code bugs and reduce technical debt by over $100 million. As part of this endeavor, we are launching the first <span>AWS BugBust</span> re:Invent Challenge at this year’s AWS re:Invent conference, from 10 a.m. (PST) November 29 to 2 p.m (PST) December 2, and in doing so, hope to create a new World Record for “Largest Bug Fixing Competition” as recognized by Guinness World Records.</p> \n<p>To date, AWS BugBust events have been run internally by organizations that want to reduce the number of code bugs and the impact they have on their external customers. At these events, an event administrator from within the organization invites internal developers to collaborate in a shared AWS account via a unique link allowing them to participate in the challenge. While this benefits the organizations, it limits the reach of the event, as it focuses only on their internal bugs. To increase the impact that the <span>AWS BugBust</span> events have, at this year’s re:Invent we will open up the challenge to anybody with Java or Python knowledge to help fix open-source code bases.</p> \n<p>Historically, finding bugs has been a labor-intensive challenge. 620 million developer hours are wasted each year searching for potential bugs in a code base and patching them before they can cause any trouble in production – or worse yet, fix them on-the-fly when they’re already causing issues. The AWS BugBust re:Invent Challenge uses <a href=\"https://aws.amazon.com/codeguru/\">Amazon CodeGuru</a>, an ML-powered developer tool that provides intelligent recommendations to improve code quality and identify an application’s most expensive lines of code. Rather than reacting to security and operational events caused by bugs, <span>Amazon CodeGuru</span> proactively highlights any potential issues in defined code bases as they’re being written and before they can make it into production. Using <span>CodeGuru</span>, developers can immediately begin picking off bugs and earning points for the challenge.</p> \n<p>As part of this challenge, <span>AWS</span> will be including a myriad of open source projects that developers will be able to patch and contribute to throughout the event. Bugs can range from security issues, to duplicate code, to resource leaks and more. Once each bug has been submitted and <span>CodeGuru</span> determines that the issue is resolved, all of the patched software will be released back to the open source projects so that everyone can benefit from the combined efforts to squash software bugs.</p> \n<p>The <span>AWS BugBust</span> re:Invent Challenge is open to all developers who have Python or Java knowledge regardless of whether or not they’re attending re:Invent. There will be an array of prizes, from hoodies and fly swatters to Amazon Echo Dots, available to all who participate and meet certain milestones in the challenge. There’s also the coveted title of “Ultimate AWS BugBuster” accompanied by a cash prize of $1500 for whomever earns the most points by squashing bugs during the event.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/21/BB-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/21/BB-1.png\" /></a></p> \n<p>For those attending in-person, we have created the <span>AWS BugBust</span> Hub, a 500 square-foot space in the main exhibition hall. This space will give developers a place to join in with the challenge and track their progress on the AWS BugBust leadership board while maintaining appropriate social-distancing. In addition to the AWS BugBust Hub, there will be an AWS BugBust kiosk located within the event space where developers will be able to sign up to contribute toward the Largest Bug Fixing Challenge World Record attempt. Attendees will also be able to speak with Amazonians from the AWS BugBust SWAT team who will be able to answer questions about the event and provide product demos.</p> \n<p>To take part in the <span>AWS BugBust</span> re:Invent Challenge, developers must have an AWS BugBust player account and a GitHub account. Pre-registration for the competition <a href=\"https://bugbust.aws\">can be done online</a>, or if you’re at <a href=\"https://reinvent.awsevents.com/\">re:Invent</a> 2021 in-person you can register to participate at our AWS BugBust Hub or kiosk. If you’re not planning on joining us in person at re:Invent, you can still join us online, fix bugs and earn points to win prizes.</p> \n<ul> \n <li><a href=\"https://bugbust.aws/\">Pre-register now for the First Annual AWS BugBust re:Invent Challenge</a></li> \n <li><a href=\"https://aws.amazon.com/codeguru/\">Learn more about Amazon CodeGuru</a></li> \n</ul>","author":"Sean M. Tracey","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"ca11d3488e883faadb2077991b0816cdb7561028b16916d0edfb74e20a7ce7ec","category":"Tech"}