{"title":"Tesla to add General Motors to its charger standard next year","link":"https://arstechnica.com/?p=1946589","date":1686259355000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-Cadillac-LYRIQ-005-800x533.jpg\" alt=\"A Cadillac Lyriq charging port\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-Cadillac-LYRIQ-005.jpg\">Enlarge</a> <span>/</span> GM is the second American automaker to decide to ditch the CCS port (pictured) for Tesla's design.  (credit: Cadillac)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Tesla's Supercharger network is about to get more crowded. On Thursday afternoon, General Motors CEO Mary Barra joined Tesla CEO (and Twitter's owner) Elon Musk to announce that GM is signing on to what Tesla calls the North American Charging Standard (NACS) and will integrate those ports into its electric vehicles from 2025. The move follows a similar agreement between Tesla and Ford, <a href=\"https://arstechnica.com/cars/2023/05/ford-evs-will-get-access-to-teslas-supercharger-network-in-2024/\">announced two weeks ago</a>.</p>\n<p>\"This collaboration is a key part of our strategy and an important next step in quickly expanding access to fast chargers for our customers. Not only will it help make the transition to electric vehicles more seamless for our customers, but it could help move the industry toward a single North American charging standard,\" Barra said in a statement.</p>\n<p>GM EVs will gain access to the Supercharger network of over 12,000 chargers starting in 2024. As with the Ford news, GM EVs will initially require an adapter to connect the NACS cable to their CCS1 charging ports.</p></div><p><a href=\"https://arstechnica.com/?p=1946589#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946589&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ca1e918c18fbb407d3ac0fe71ee190a25088b8381a164f5d90aacebe896dfaa1","category":"Tech"}