{"title":"Molecular mechanisms underlying gene regulatory variation of maize metabolic traits","link":"https://academic.oup.com/plcell/article/36/9/3709/7699670?rss=1","date":1719360000000,"content":"<span><div>Abstract</div>Variation in gene expression levels is pervasive among individuals and races or varieties, and has substantial agronomic consequences, for example, by contributing to hybrid vigor. Gene expression level variation results from mutations in regulatory sequences (<span>cis</span>) and/or transcription factor (TF) activity (<span>trans</span>), but the mechanisms underlying <span>cis-</span> and/or <span>trans</span>-regulatory variation of complex phenotypes remain largely unknown. Here, we investigated gene expression variation mechanisms underlying the differential accumulation of the insecticidal compounds maysin and chlorogenic acid in silks of widely used maize (<span>Zea mays</span>) inbreds, B73 and A632. By combining transcriptomics and cistromics, we identified 1,338 silk direct targets of the maize R2R3-MYB TF <span>Pericarp color1</span> (<span>P1</span>), consistent with it being a regulator of maysin and chlorogenic acid biosynthesis. Among these P1 targets, 464 showed allele-specific expression (ASE) between B73 and A632 silks. Allelic DNA-affinity purification sequencing identified 34 examples in which P1 allelic specific binding (ASB) correlated with <span>cis</span>-expression variation. From previous yeast one-hybrid studies, we identified 9 TFs potentially implicated in the control of P1 targets, with ASB to 83 out of 464 ASE genes (<span>cis</span>) and differential expression of 4 out of 9 TFs between B73 and A632 silks (<span>trans</span>). These results provide a molecular framework for understanding universal mechanisms underlying natural variation of gene expression levels, and how the regulation of metabolic diversity is established.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"ca1f9372db1f982ad0fc72002f030902a6ecd6969e55a1bfd48be61027359047","category":"Environment"}