{"title":"Horizon Forbidden West gameplay reveal: Swimming with tropical robo-saurs","link":"https://arstechnica.com/?p=1768268","date":1622153489000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Screenshot-4608-980x551.png\" /></div>\n        <p>\n          Another successful robo-safari for Aloy in <em>Horizon Forbidden West</em>.                      [credit:\n                        <a href=\"https://en.wikipedia.org/wiki/Guerrilla_Games\">Sony Interactive Entertainment / Guerrilla Games</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Aloy, the braided-hair hero of <a href=\"https://arstechnica.com/gaming/2017/02/horizon-zero-dawn-is-the-best-robot-safari-adventure-game-ever-made/\">Sony's 2017 smash <em>Horizon Zero Dawn</em></a>, is set to return to consoles later this year in the series' first sequel, and on Thursday, we finally learned how that sequel video game will look.</p>\n<p>On the cusp of 2021's kinda-sorta virtualized E3, creator Guerrilla Games premiered an uninterrupted, 14-minute gameplay sequence from this year's upcoming (and undated) <em>Horizon Forbidden West</em>. The sequence centers on an early-game mission to save a captured ally, and it has all the hallmarks of a flashy press conference reveal: familiar characters, slow-motion pans over insane-looking robot monsters, and a conveniently linear path full of perfectly placed mid-battle dialogue.</p>\n<h2>Performance savings via new hairdo?</h2>\n<p>Still, what we saw actually looks like a real-deal, <em>Horizon</em>-branded video game—and arguably one that will neatly scale to Sony's past-gen PlayStation 4 console, since it leans less on flashy new tech like ray tracing or uninterrupted landscapes. This <a href=\"https://www.youtube.com/watch?v=wQATS4HOxdo\">gameplay reveal</a> was advertised as running on real PlayStation 5 hardware, however, so exactly how the game will downscale to base PS4 consoles remains to be seen. (Lower frame rates? Fewer water effects? Aloy's signature braids chopped off and replaced with a buzz cut?)</p></div><p><a href=\"https://arstechnica.com/?p=1768268#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768268&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ca36567dd6207f9d2e064eed18f0fefab7b0f5a76d5a331aaf61cf8ced31ac63","category":"Tech"}