{"title":"Alternate qubit design does error correction in hardware","link":"https://arstechnica.com/?p=2002369","date":1707501452000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-2-800x800.jpeg\" alt=\"Image of a complicated set of wires and cables hooked up to copper colored metal hardware.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-2-scaled.jpeg\">Enlarge</a> (credit: Nord Quantique)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>There's a general consensus that performing any sort of complex algorithm on quantum hardware will have to wait for the arrival of error-corrected qubits. Individual qubits are too error-prone to be trusted for complex calculations, so quantum information will need to be distributed across multiple qubits, allowing monitoring for errors and intervention when they occur.</p>\n<p>But most ways of making these \"logical qubits\" needed for error correction require anywhere from dozens to over a hundred individual hardware qubits. This means we'll need anywhere from tens of thousands to millions of hardware qubits to do calculations. Existing hardware has only cleared the 1,000-qubit mark within the last month, so that future appears to be several years off at best.</p>\n<p>But on Thursday, a company called Nord Quantique announced that it had demonstrated error correction using a single qubit with a distinct hardware design. While this has the potential to greatly reduce the number of hardware qubits needed for useful error correction, the demonstration involved a single qubit—the company doesn't even expect to demonstrate operations on pairs of qubits until later this year.</p></div><p><a href=\"https://arstechnica.com/?p=2002369#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2002369&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ca3c0cba3b99d374d121807318f8e9780c44323e25d7f09b27204bbec1ae2da7","category":"Tech"}