{"title":"Apple Fitness+ Now Offers Over 4,000 Workout and Meditation Videos","link":"https://www.macrumors.com/2023/05/20/apple-fitness-plus-over-4000-videos/","date":1684607840000,"content":"<em>Men's Journal</em>'s Jacob Krol was recently invited to <a href=\"https://www.mensjournal.com/health-fitness/apple-fitness-plus-studio-tour-interview-jay-blahnik-trainers\">tour the Apple Fitness+ studio</a> in Santa Monica, California, providing another behind-the-scenes look at the subscription-based workout service. Krol had the opportunity to speak with Jay Blahnik, Apple's VP of Fitness Technologies, and met many of the trainers involved in the workouts.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/apple-fitness-plus-feature-magenta.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nThe <a href=\"https://www.macrumors.com/2022/05/03/apple-fitness-plus-studio-tours/\">first Fitness+ studio tours</a> were shared last year, and this one provides some more details. Krol said the studio is one large room with equipment spread across several workout and meditation areas, and videos are recorded with 13 robotic cameras and a few human-operated cameras under a dense lighting grid. The live productions are monitored by a crew in a control room to ensure everything is being filmed correctly.\r<br />\n\r<br />\nApple said Fitness+ now offers over 4,000 workouts and meditations, with new ones added every week. The videos range from 5 to 45 minutes in length, and there are a dozen workout types available, with the latest additions including pilates and kickboxing.\r<br />\n\r<br />\n\"Everything we look at going forward is about how do we make sure that people have great success in their fitness journey, whether Apple Fitness+ is a complement to something they already love to do outside of our service, or whether Apple Fitness+ is the only thing they do to get moving and meditate,\" said Blahnik. \"What can we do to make the experience even easier, smoother, something they can fit into their life more regularly?\"\r<br />\n\r<br />\nLaunched in 2020, Fitness+ is available in the Fitness app on the iPhone, iPad, and Apple TV. The service <a href=\"https://www.macrumors.com/2022/09/20/apple-fitness-plus-without-apple-watch-ios-16-1/\">can now be used with just an iPhone</a>, but an Apple Watch is still needed to view real-time, personal metrics on screen during workouts, such as heart rate and calories burned. In the U.S., Fitness+ is priced at $9.99 per month or $79.99 per year, or it can be bundled with other Apple services via Apple One for $32.95 per month.\r<br />\n\r<br />\nA single Fitness+ subscription can be shared with up to five other family members, and the service comes with a free one-month trial for all users. Users who purchase a new ‌iPhone‌, iPad, Apple Watch, or Apple TV qualify for a three-month trial.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-fitness-plus/\">Apple Fitness Plus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/20/apple-fitness-plus-over-4000-videos/\">Apple Fitness+ Now Offers Over 4,000 Workout and Meditation Videos</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-fitness-now-offers-over-4-000-workout-and-meditation-videos.2390086/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ca423f3d78968cae37a6b11c16bf68d929a2473de61ff45f6e2c0de132d2fe42","category":"Apple"}