{"title":"13-Year-Old Prodigy Willis ‘Blue Scuti’ Gibson Is First to Beat NES Tetris","link":"https://www.404media.co/13-year-old-becomes-first-person-to-ever-beat-tetris/","date":1704922434000,"content":"\n<p>Jason Koebler, writing for 404 Media:</p>\n\n<blockquote>\n  <p>A 13-year-old competitive Tetris player has <a href=\"https://www.youtube.com/watch?v=J9oVQ43j22g&amp;ref=404media.co\">become the first \nknown human</a> to beat the game on the original NES by \nforcing it into a kill screen. In doing so, the player, Blue \nScuti, broke world records for overall score, level achieved, and \ntotal numbers of lines in the 34-year-old game. Previously, <a href=\"https://www.youtube.com/watch?v=l_KY_EwZEVA&amp;ref=404media.co\">only \nan AI had broken Tetris</a>. </p>\n\n<p>The feat took Blue Scuti about 38 minutes, as shown in a video he \nposted to his YouTube. As he nears the feat, Blue Scuti says “Oh I \nmissed it,” after misplacing a block. He recovers, then says “Oh \nmy God,” as it seems like he’ll be able to do it. “Please crash,” \nhe says as the blocks careen down the screen impossibly fast. He \ngets another line and the game freezes: “Oh my God! Yes! I’m going \nto pass out,” he says. “I can’t feel my hands.” </p>\n</blockquote>\n\n<p>From <a href=\"https://www.nytimes.com/2024/01/03/arts/tetris-beat-blue-scuti.html\">Sopan Deb’s story about Gibson for The New York Times</a>:</p>\n\n<blockquote>\n  <p>Ms. Cox bought her son a version of a Nintendo console called a \nRetroN, which used the same hardware as the original Nintendo \nconsole, from a pawnshop, as well as an old cathode-ray tube \ntelevision to help him get started. In a given week, Willis said, \nhe plays about 20 hours of Tetris. </p>\n\n<p>“I’m actually OK with it,” Ms. Cox, a high school math teacher, \nsaid. “He does other things outside of playing Tetris, so it \nreally wasn’t that terribly difficult to say OK. It was harder to \nfind an old CRT TV than it was to say, ‘Yeah, we can do this for a \nlittle bit.’” </p>\n</blockquote>\n\n<p>Koebler’s story ends with a sad note: “Blue Scuti dedicated the game to his dad, Adam Gibson, who died in December.” My mom’s mother died when my mom was just 16, so I’m familiar, second-hand, with how devastating such a loss is. Young Gibson seems utterly delightful — a gracious champion — so we’d all be rooting for him anyway, but this adds a note of poignancy.</p>\n\n<p><strong>Recommended viewing:</strong> <a href=\"https://www.youtube.com/watch?v=3u4p65m1NlA\">This 17-minute video from aGameScout</a> is a wonderful, fun explanation of Gibson’s feat — it explains why NES Tetris was, for decades, thought to end at level 29; the new advanced controller techniques that allow elite players to blow past level 29; and suggests future accomplishments that remain unachieved.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/10/blue-scuti-tetris\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ca583feb06727b1ed2478232af4baf7da219d771459f4a9722ca20ccd5f8d363","category":"Tech"}