{"title":"Apple Invests $50 Million in Independent Music Artist Platform UnitedMasters","link":"https://www.macrumors.com/2021/03/31/apple-invests-50m-unitedmasters/","date":1617195703000,"content":"Independent music distributor UnitedMasters has announced a &#36;50 million investment round led by Apple that aims to help independent artists gain a foothold and establish a career in the music business (via <em><a href=\"https://techcrunch.com/2021/03/31/apple-invests-50m-into-music-distributor-unitedmasters-alongside-a16z-and-alphabet/\">TechCrunch</a></em>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/apple-music-logo.jpg\" alt=\"\" width=\"1200\" height=\"630\" class=\"aligncenter size-full wp-image-774433\" />\r\n<br/>\r\nAs part of a strategic partnership, Apple is joined by Google parent company Alphabet and A16z, which will provide follow-on \"Series B\" investments in UnitedMasters. \r\n<br/>\r\n\r\n<br/>\r\nThe mission of the distribution platform is to enable artists to \"maintain full ownership over their work while expanding their economic opportunity and introducing them to millions of new fans.\" To that end, UnitedMasters aims to furnish musicians with data on how fans interact with their content and community, allowing them to connect more directly to offer tickets, merchandise and other commercial efforts. \r\n<br/>\r\n<blockquote>\"We want all artists to have the same opportunity,\" UnitedMasters CEO Steve Stoute told TechCrunch. \"Currently, independent artists have less opportunity for success and we're trying to remove that stigma.\"\r\n<br/>\r\n\r\n<br/>\r\n\"Every artist needs access to a CTO. Some of the value of what a manager is today for an artist needs to be transferred to that role.\"</blockquote>UnitedMasters has deals with the NBA, ESPN, TikTok, Twitch and others that gives artists access to big brand deals that would traditionally be negotiated by a label and manager. It also has a direct distribution app through which musicians can publish to all of the major streaming services, as well as check stream, fan and earnings data at a glance.\r\n<br/>\r\n<blockquote>\"Steve Stoute and UnitedMasters provide creators with more opportunities to advance their careers and bring their music to the world,\" said Apple's Eddy Cue in a release statement. \"The contributions of independent artists play a significant role in driving the continued growth and success of the music industry, and UnitedMasters, like Apple, is committed to empowering creators.\"</blockquote>The strategic partnership is relatively unique for Apple, which typically likes to acquire companies rather than invest in them, and when it chooses to do the latter it usually does so through its Advanced Manufacturing Fund.\r\n<br/>\r\n\r\n<br/>\r\nThat said, the mission of the platform appears to have much in common with Apple Music Connect, the social network for artists that was originally part of Apple Music when it launched in 2015, but soon faded into obscurity before becoming officially defunct in <a href=\"https://www.macrumors.com/2018/12/13/apple-music-connect-shutting-down/\">December 2018</a>.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/31/apple-invests-50m-unitedmasters/\">Apple Invests &#36;50 Million in Independent Music Artist Platform UnitedMasters</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-invests-50-million-in-independent-music-artist-platform-unitedmasters.2290198/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cZNpi3ueMac:CljcgHwOtng:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cZNpi3ueMac:CljcgHwOtng:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/cZNpi3ueMac\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ca5863bda8910ad143677ad1344dd97419f30c48853d84a4bd2430f66148fc9b","category":"Apple"}