{"title":"Terraform Cloud adds aggregated VCS reviews","link":"https://www.hashicorp.com/blog/terraform-cloud-adds-aggregated-vcs-reviews","date":1704301200000,"content":"<p>We are excited to announce the general availability of aggregated VCS reviews, now available for use in <a href=\"https://www.hashicorp.com/products/terraform\">HashiCorp Terraform Cloud</a> and coming soon to Terraform Enterprise. This enhancement streamlines the verification process across multiple workspaces by offering an aggregated view of status checks and highlighting the most impactful changes that require the customer's attention before code deployment.</p>\n\n<h2>Status verification challenges</h2>\n\n<p>For workspaces <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/vcs\">linked to a supported version control system (VCS)</a>, Terraform Cloud posts status checks back to the repository for runs that occur in response to actions like pull requests (PRs) and merges. These status checks indicate the results of plan/apply <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/run/remote-operations\">runs</a>, <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/api-docs/policy-checks\">policy checks</a>, and <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/run-tasks\">run tasks</a>, along with a link back to the corresponding run in Terraform Cloud. This helps ensure the expected result from Terraform changes before code is merged to production and offers valuable in-context feedback for Terraform developers. </p>\n\n<p>However, the previous behavior of sending one check per run did not scale well for customers with monolithic repositories, or monorepos, that contained a large number of workspaces or co-located modules. That approach created an excessive number of status checks, making it difficult to identify essential updates and Terraform plan changes. This highlighted a need for a more efficient way to handle status checks at scale.</p>\n<img src=\"https://www.datocms-assets.com/2885/1704214261-aggregated-checks-1.png\" alt=\"Previously,\" /><h2>Introducing aggregated VCS reviews</h2>\n\n<p>Aggregated reviews address this issue with a consolidated presentation of status checks for monorepos across multiple workspaces, highlighting the most vital changes that require the user’s attention or validation. By highlighting the key changes that could impact infrastructure, the new feature reduces the likelihood of missing unexpected modifications. This concise view of summarized changes also offers a detailed option for more information when needed.</p>\n\n<p>While the key use case of this feature is to streamline the status check process for large-scale monorepos, the enhancement also helps with any Terraform repository connected to many workspaces for the purposes of repeated provisioning across accounts, regions, or environments.</p>\n\n<p>The new feature supports Terraform Cloud’s official VCS integrations including GitHub, GitLab, Bitbucket, and Azure DevOps. The two highlights of this update are:</p>\n\n<h3>An improved commit summary</h3>\n\n<p>The upgraded commit summary aggregates status checks by organization, providing a quick overview of proposed changes within all workspaces linked to the repository. Users can access additional information by clicking on a Details link, which leads to the new commit page in Terraform Cloud.</p>\n<img src=\"https://www.datocms-assets.com/2885/1704214883-aggregated-checks-2.png\" alt=\"Status\" /><h3>A new commit page in Terraform Cloud</h3>\n\n<p>This page includes comprehensive details of changes linked to each workspace associated with the monorepo, featuring a summary bar that indicates proposed, modified, or destroyed resources. Workspaces are grouped by their status: those that need attention, have resource changes, are still pending, or workspaces with no changes. Users can also filter workspaces by name and project.</p>\n<img src=\"https://www.datocms-assets.com/2885/1704214894-aggregated-checks-3.png\" alt=\"The\" /><h2>Getting started</h2>\n\n<p>This feature can be enabled in the Version Control section of your Terraform Cloud organization settings. To get started, check out the <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/users-teams-organizations/organizations#version-control\">organization settings documentation</a>.</p>\n\n<p>Get started with <a href=\"https://cloud.hashicorp.com/products/terraform\">Terraform Cloud</a> for free to begin provisioning and managing your infrastructure in any environment. <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/users-teams-organizations/users#log-in-with-your-hashicorp-cloud-platform-account\">Link your Terraform Cloud and HashiCorp Cloud Platform (HCP) accounts</a> together for a seamless sign-in experience.</p>\n","author":"Mitchell Ross","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"ca6095c43231a8d2bdf6b8019eff969c78af5a44ee2e764d40bb23ef3be32c18","category":"Tech"}