{"title":"A Look Inside Apple's 23,000 Square-Foot Fitness+ Studio","link":"https://www.macrumors.com/2021/03/05/apple-fitness-plus-studio-tour/","date":1614970787000,"content":"Apple Fitness+, the latest service to join the Apple family, integrates tightly with the Apple Watch to offer a comprehensive and growing selection of workout and exercise videos made by a team of professional trainers.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/hlh030121feafutureoffitness012-1614286673.png\" alt=\"\" width=\"980\" height=\"653\" class=\"aligncenter size-full wp-image-787184\" /><div class=\"center-wrap\"><em>Apple Fitness+ Studio (via <a href=\"https://www.menshealth.com/fitness/a35567297/apple-fitness-plus-studio-tour-exclusive/\">Men's Health</a>)</em></div>\r\n<br/>\r\n\r\n<br/>\r\nApple curates and records all of the videos at a location in Santa Monica, California, and each video features a similar background and style. For the first time, thanks to a virtual tour by Apple given to <em><a href=\"https://www.menshealth.com/fitness/a35567297/apple-fitness-plus-studio-tour-exclusive/\">Men's Health</a></em>, we have a look inside the Fitness+ studio. The virtual tour of Apple's 23,000 square-foot studio was conducted by Apple's senior director of Fitness for Health Technologies, Jay Blahnik. \r\n<br/>\r\n\r\n<br/>\r\nThe Fitness+ studio is modern, featuring wood accents and \"all-white everything,\" according to a read-out of the virtual tour from <em>Men's Health</em>. The studio entrance consists of three sliding glass doors that when opened \"reveal a verdant garden.\" Each month, a new team member chooses a quote that's placed on a wall right outside the studio. March's quote reads, \"Please be responsible for the energy you bring into this space.\" \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/hlh030121feafutureoffitness011-1614286602.png\" alt=\"\" width=\"768\" height=\"512\" class=\"aligncenter size-full wp-image-787193\" /><div class=\"center-wrap\"><em>Apple Fitness+ Studio Control Room (via <a href=\"https://www.menshealth.com/fitness/a35567297/apple-fitness-plus-studio-tour-exclusive/\">Men's Health</a>)</em></div>\r\n<br/>\r\nThe studio itself features multiple screens scattered around the room that display a live view of what's being captured in the studio. The heart of the studio, of course, is the cameras. For recording Fitness+ videos, Apple uses seven high-end Super 35 cinematic cameras attached to robotic arms. Compared to a traditional human-controlled camera, the robotic arms help enable smoother transitions and movement. Blahnik says that the robotic arms also help the team better coordinate what's most appropriate to show the viewer during a workout.<blockquote>We built the studio in a way that would allow shooting all the angles to make the right choices to show just the right angle at just the right time.</blockquote>One selling point of Fitness+ is its tight integration with the Apple Watch. During a workout, Fitness+ will send metrics from your watch live onto your display. The information helps users stay motivated, engaged, and up to date on progress toward closing their activity ring or their current heart rate, but Apple wanted to go further than just display live metrics.\r\n<br/>\r\n\r\n<br/>\r\nIn the virtual tour, Blahnik explains that the team wanted to create a dynamic and fully immersive experience. To do this, Apple had to develop unique software that would display metrics on screen at the correct time during an exercise. For example, if a trainer says \"Sprint all-out for 30 seconds\" during a workout, Fitness+ will display a timer for 30 seconds on the screen. <blockquote>When the trainer says in a HIIT workout, 'Sprint all-out for 30 seconds,' being able to see that time is an incredible motivator,\" says Blahnik. \"It makes for a better, more immersive workout. [Integrated, dynamic smart metrics] take it to another level compared to a typical video workout. We had to think hard about how to curate the experience, so you're not overwhelmed by metrics and animations and that those things are happening exactly when you might expect them to and in ways that are helpful.</blockquote>Adjacent to the studio is a rehearsal room that serves as a place for trainers to plan, coordinate, and rehearse their workouts before heading into the studio and pressing record. Like the studio itself, the rehearsal room is equipped with wooden floors, massive mirrors, and sliding glass doors. Blahnik describes the rehearsal room as a place for collaboration, emphasizing that trainers must be open to feedback and modifications for their workout. <blockquote>[This] is where they ideate, collaborate, and get feedback from each other to create the best workouts... We needed trainers who are open to feedback from experts who know their stuff in that workout type, as well as fitness experts not in their space.</blockquote>\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/hlh030121feafutureoffitness013-1614286411.png\" alt=\"\" width=\"768\" height=\"512\" class=\"aligncenter size-full wp-image-787204\" /><div class=\"center-wrap\"><em>Apple Fitness+ Rehersal Room</em> (via <em><a href=\"https://www.menshealth.com/fitness/a35567297/apple-fitness-plus-studio-tour-exclusive/\">Men's Health</a></em>)</div>\r\n<br/>\r\nApple Fitness+ launched on December 14, making the service still relatively young. Apple adds new content across all 10 of its current workout types every week, continually expanding the catalog of exercises and workouts users have access to. Blahnik calls Apple Fitness+ a \"marathon, not a sprint\" and says that Apple is excited about its future and that it's \"really committing to and investing\" in the service. \r\n<br/>\r\n\r\n<br/>\r\nApple Fitness+ is available for &#36;9.99 per month, &#36;79.99 per year, or as part of the Premier tier of the <a href=\"https://www.macrumors.com/guide/apple-one/\">Apple One</a> bundle. Learn more about Fitness+ in our <a href=\"https://www.macrumors.com/guide/apple-fitness-plus/\">guide</a>.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-fitness-plus/\">Apple Fitness Plus</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/05/apple-fitness-plus-studio-tour/\">A Look Inside Apple&#039;s 23,000 Square-Foot Fitness+ Studio</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/a-look-inside-apples-23-000-square-foot-fitness-studio.2287230/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=RMD-WeJlS2g:jVMwIy2YhI4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=RMD-WeJlS2g:jVMwIy2YhI4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/RMD-WeJlS2g\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ca666dadb3ad52b04f6cadb43850ba7a8aa00794353e290a3dc15ba606448d96","category":"Apple"}