{"title":"The long wait is over: Sony drops teaser trailer for Spider-Man: No Way Home","link":"https://arstechnica.com/?p=1789318","date":1629780489000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/nowayhome2-980x637.jpg\" /></div>\n        <p>\n          MJ (Zendaya) and Peter Parker (Tom Holland) try to enjoy a peaceful moment on a rooftop                      [credit:\n                        YouTube/Sony Pictures                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Sony Pictures was scrambling over the weekend to <a href=\"https://www.hollywoodreporter.com/movies/movie-news/sony-block-alleged-spider-man-no-way-home-trailer-leak-1235001375/\">quash a leaked teaser trailer</a> for <a href=\"https://en.wikipedia.org/wiki/Spider-Man:_No_Way_Home\"><em>Spider-Man: No Way Home</em></a>. But now the studio has released the official version, <a href=\"https://deadline.com/2021/08/spider-man-no-way-home-trailer-shows-up-at-cinemacon-1234820594/\">announced during CinemaCon</a> in Las Vegas by chairman Tim Rothman. And it's a doozy: a full three minutes laying out the plot, with shots confirming some of the rumors that have been swirling since the project was announced—including the involvement of Doctor Strange and the return of several classic villains from prior Spider-Man films. Alas, it looks like we'll have to wait a bit longer to see if the rumored appearances by past Spider-Man stars (from the films directed by Sam Raimi and Marc Webb) are true.</p>\n<p><strong>(Some spoilers for <em>Spider-Man: Far From Home</em> and other MCU and DCEU films below.)</strong></p>\n<p>In 2019's <a href=\"https://arstechnica.com/gaming/2019/07/spider-man-far-from-home-film-review-far-from-necessary/\"><em>Spider-Man: Far From Home</em></a>, Peter Parker is grieving the loss of his mentor, Tony Stark (Robert Downey, Jr.), who perished in the final battle against Thanos in <a href=\"https://arstechnica.com/gaming/2019/04/avengers-endgame-is-three-of-marvels-best-films-rolled-into-one/\"><em>Avengers: Endgame</em></a>. What better than a <a href=\"https://en.wikipedia.org/wiki/Spider-Man:_Far_From_Home\">summer field trip to Europe</a> to help him process his grief? Then Nick Fury shows up and enlists Spider-Man's help in battling a series of Elementals. Peter thinks he's found a new mentor in Quentin Beck, aka Mysterio (Jake Gyllenhaal). But Beck has his own agenda and betrays Peter. The two battle it out, and Beck is killed. But he gets his revenge, sending doctored footage of the climactic battle framing Spider-Man for his death to Jonah Jameson at The Daily Bugle. The footage also reveals Peter's secret identity as Spider-Man to the world.</p></div><p><a href=\"https://arstechnica.com/?p=1789318#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789318&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ca6ecb48da79cada40f127c4166af658c925fe9062206cf27aca868a0f9a35fe","category":"Tech"}