{"title":"Genetic diversity of a <i>Silybum marianum</i> (L.) Gaertn. germplasm collection revealed by DNA Diversity Array Technology (DArTseq)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308368","date":1723039200000,"content":"<p>by Damiano Puglisi, Marianna Pasquariello, Tommaso Martinelli, Roberta Paris, Pasquale De Vita, Nicola Pecchioni, Salvatore Esposito, Laura Bassolino</p>\r\n\r\n<i>Silybum marianum</i> (L.) Gaertn. is a multipurpose crop native to the Mediterranean and middle east regions and mainly known for the hepatoprotective properties of fruit-derived silymarin. Despite growing interest in milk thistle as a versatile crop with medicinal value, its potential in agroindustry is hindered by incomplete domestication and limited genomic knowledge, impeding the development of competitive breeding programs. The present study aimed to evaluate genetic diversity in a panel of <i>S</i>. <i>marianum</i> accessions (n = 31), previously characterized for morphological and phytochemical traits, using 5,178 polymorphic DArTseq SNP markers. The genetic structure investigated using both parametric and non-parametric approaches (e.g. PCA, AWclust, Admixture), revealed three distinctive groups reflecting geographical origins. Indeed, Pop1 grouped accessions from Central Europe and UK, Pop3 consisted mainly of accessions of Italian origin, and Pop2 included accessions from different geographical areas. Interestingly, Italian genotypes showed a divergent phenotypic distribution, particularly in fruit oleic and linoleic acid content, compared to the other two groups. Genetic differentiation among the three groups, investigated by computing pairwise fixation index (F<sub>ST</sub>), confirmed a greater differentiation of Pop3 compared to other subpopulations, also based on other diversity indices (e.g. private alleles, heterozygosity). Finally, 22 markers were declared as putatively under natural selection, of which seven significantly affected some important phenotypic traits such as oleic, arachidonic, behenic and linoleic acid content. These findings suggest that these markers, and overall, the seven SNP markers identified within Pop3, could be exploited in specific breeding programs, potentially aimed at diversifying the use of milk thistle. Indeed, incorporating genetic material from Pop3 haplotypes carrying the selected loci into milk thistle breeding populations might be the basis for developing milk thistle lines with higher levels of oleic, arachidonic, and behenic acids, and lower levels of linoleic acid, paving new avenues for enhancing the nutritional and agronomic characteristics of milk thistle.","author":"Damiano Puglisi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ca74a7bd6555d10e3385794b622e8936dac0768f3f022f0b2fb3f5929930471b","category":"Interdisciplinary"}