{"title":"Direct and Indirect Effects of Mountain Heights on Heavy Rainfall in the Hokitika Region of New Zealand","link":"https://www.preprints.org/manuscript/202403.0757/v1","date":1710311285000,"content":"Very heavy stratiform precipitation (&gt; 200 mm/per day) occurred in the Hokitika region on the west coast of the South Island of New Zealand on 18 June 2015, under north-westerlies with small CAPE (&lt; 25 J/kg). Analyses of model simulations and observations showed that this heavy rainfall was due to cold front lifting enhanced by orographic lifting over the Southern Alps. At 1.5 km grid-length, the model terrain underestimated the average height of the 103 tallest mountains over the South Island by ~ 800 m. This leads to weaker orographic lifting and mountain blocking, and a faster-moving and stronger cold front in the Hokitika region. As a result, large errors in the heavy rainfall prediction occur. By increasing either the resolved or the sub-grid mountain heights, the simulated rainfall errors were largely reduced through stronger orographic lifting and mountain blocking, and a better simulation of the cold front movement and strength. \nAll the experiments have the same “flow-over” regime with mountain waves and/or wave breaking (Fm ranges 0.61 – 1.21). However, the rainfall amount and distribution on the windward side of mountains altered significantly. Our new findings were that the Southern Alps can have significant indirect effects on heavy rainfall by altering the speed and strength of the cold front, in addition to the well-known direct dynamical effects (i.e., orographic lifting and mountain blocking). A combination of these direct and indirect effects makes the heavy rainfall simulation sensitive to mountain heights even under the same “flow-over” regime.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ca7bacacc80620fa267043c0462b3ffc89fc8bae5470c1d9e892d4b256d16381","category":"Interdisciplinary"}