{"title":"A Meta‐Analysis of Bycatch Mitigation Methods for Sea Turtles Vulnerable to Swordfish and Tuna Longline Fisheries","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12865?af=R","date":1728584653000,"content":"<h2>ABSTRACT</h2>\n<p>Fisheries bycatch poses one of the most significant threats to sea turtles. Although various methodologies have been developed to mitigate sea turtle bycatch in swordfish and tuna longline fisheries, the effectiveness and interactions remain uncertain. In this study, we conducted a comprehensive meta-analysis, encompassing 41 studies focused on sea turtles and 36 studies on tunas, swordfish and sharks, all derived from well-controlled experimental research in swordfish and tuna longline fisheries. The objective was to systematically evaluate the relative effectiveness of species-specific mitigation strategies for sea turtles, particularly examining the impact of circle hooks and fish bait as alternatives to conventional longline fishing practices. While a nuanced hierarchy, characterised by species-specific patterns, was observed among the mitigation measures, circle hooks demonstrated great promise in reducing bycatch of loggerhead, olive ridley and leatherback turtles, with minimal impact on the catch rates of tuna, swordfish and sharks. We highlighted the broader applicability of fish bait in minimising sea turtle bycatch, noting that the effectiveness of bait may overlap with that of hooks, potentially making the additional benefits of the hooks less evident. The study also revealed regional variations in the effectiveness of these methods, emphasising the need for more detailed data collection. Given current data limitations that restrict extensive meta-analyses, a series of small-sample studies with promising innovations, exemplified by circle hooks with a wire appendage and blue-white lights, necessitates in-depth investigation and field tests.</p>","author":"Hao Yan, \nCheng Zhou, \nEric Gilman, \nJie Cao, \nRong Wan, \nFan Zhang, \nJiangfeng Zhu, \nLiuxiong Xu, \nLiming Song, \nXiaojie Dai, \nSiquan Tian","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"ca834f8a56ffcd45654a9d03bb380340d20db719144bb43f78e17f1bc61a5679","category":"Environment"}