{"title":"Investigation on a mobile fire extinguishing approach using liquid carbon dioxide as inert medium for underground mine","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299940","date":1713189600000,"content":"<p>by Liang Ge, Zujing Zhang, Yinjun Wang, Shitao Zhang, Yujin Chen</p>\r\n\r\nInjecting carbon dioxide is the most effective means of preventing and extinguishing fires in sealing hazardous areas, but the traditional method slowly and remotely injects carbon dioxide gas into the well after gasification on the ground, which is dependent on the complete mine pipe network without cooling effect. To inject liquid directly from the tank with vacuum interlayer and heat insulating powder for rapid inerting and cooling, a new approach using track mobile platform to go deep into the underground mine disaster area is proposed, so the liquid can be delivered to the nozzle at the end of DN40 large diameter pipe, and the continuous gasification jet can be realized. The experimental results show that: (1) The liquid volume in a tank of vacuum degree within 2.0 Pa and 200 mm interlayer reduced no more than 15.5% after 48 days; (2) Taking the pressure in the tank as the power source, because of environmental differences inside and outside the pipe after 100 m pressure holding delivery, the physical form of liquid and gas could be converted instantly; (3) The continuous discharge time without ice blocking for a tank full of 2 m<sup>3</sup> liquid was about 10.5 min under 25 L dual mode nitrogen pressurization, which is 1/12 of injection time after ground gasification; (4) Based on the temperature decrease trend measured at different positions, the cooling characteristics on liquid gasification jet path are quantified, and the calculation formula of temperature changing with time on the center line of liquid gasification jet is obtained. Through this new approach, the integration of vacuum insulated storage, safe mobile transportation, and continuous and rapid release with large flow can be achieved for the liquid carbon dioxide.","author":"Liang Ge","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ca8aa0bb69e4ac4ae29426a60618525bd2c2b57557781fdd2c318961992d1e1e","category":"Interdisciplinary"}