{"title":"iOS 16.5 beta teases a new ‘multi-view’ sports feature for Apple TV app","link":"https://www.macworld.com/article/1676051/apple-tv-app-multi-view-ios-16-5-beta.html","date":1680109893000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Sports fans old enough to remember TV sets from the 20th century that had picture-in-picture for watching two or more games at once will love this new feature that may be coming to the Apple TV app in iOS 16.5: multi-view.</p>\n\n\n\n<p>According to code unearthed deep in the iOS 16.5 beta by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/SteveMoser/status/1640883202637086720&amp;xcust=1-1-1676051-1-0-0&amp;sref=https://www.macworld.com/feed\">developer Steve Moser</a>, Apple is testing a new feature that appears to allow up to four simultaneous streams. He spotted several references to on-screen messages telling the user to “Remove a game first to add a new one,” and “Check back later for more games” among other prompts.</p>\n\n\n\n<figure><div>\n<blockquote><p>iOS 16.5 Beta 1 (20F5028e) changes 🧵: Sports “multi view” grid in Apple TV app with support for up to 4 streams. \"Remove a game first to add a new one\" <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/udBrWRGWFk&amp;xcust=1-1-1676051-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/udBrWRGWFk</a></p>— Steve Moser (@SteveMoser) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/SteveMoser/status/1640883202637086720?ref_src=twsrc%5Etfw&amp;xcust=1-1-1676051-1-0-0&amp;sref=https://www.macworld.com/feed\">March 29, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Apple offers picture-in-picture on the Apple TV (as well as the iPhone, iPad, and Mac), but it’s meant to let you continue watching a video while browsing the web or doing other non-video tasks. This new feature would be for watching multiple games at the same time, similar to ESPN MultiCast.</p>\n\n\n\n<p>The new feature would presumably be for Apple TV+ broadcasts of MLS and MLB games, though it’s not clear if Apple will open it up to other services as well.</p>\n\n\n\n<p>While the feature is in testing within Apple, it’s not yet a user-facing feature in iOS 16.5. So it’s possible that Apple holds the feature for iOS 17 to get more testing or announces it alongside a new sports venture at a later date. One of the new features in the <a href=\"https://www.macworld.com/article/1674501/ios-16-5-beta-features-release-install.html\">iOS 16.5 beta</a> is a dedicated Sports tab in the News app.</p>\n\nApple TV</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ca911e5b1a08c5f1b5ae1f6c4be817125d88300a9988689e5dfd79afc7d63d77","category":"Apple"}