{"title":"OpenAI Drama Continues","link":"https://www.theverge.com/2023/11/20/23969586/sam-altman-plotting-return-open-ai-microsoft","date":1700528511000,"content":"\n<p>Since <a href=\"https://daringfireball.net/2023/11/more_altman_openai\">last I wrote about</a> the ongoing leadership battle at OpenAI:</p>\n\n<ul>\n<li><p>OpenAI named a <em>new</em> interim CEO, Twitch co-founder Emmett Shear. (<a href=\"https://twitter.com/rowancheung/status/1726473420299534491\">Shear is an AI worrier</a>, who has advocated drastically “slowing down”, <a href=\"https://twitter.com/eshear/status/1703178063306203397\">writing</a> “If we’re at a speed of 10 right now, a pause is reducing to 0. I think we should aim for a 1-2 instead.”) OpenAI CTO Mira Murati was CEO for about two days.</p></li>\n<li><p><a href=\"https://twitter.com/satyanadella/status/1726509045803336122\">Satya Nadella announced very late Sunday night</a>, “And we’re extremely excited to share the news that Sam Altman and Greg Brockman, together with colleagues, will be joining Microsoft to lead a new advanced AI research team. We look forward to moving quickly to provide them with the resources needed for their success.”</p></li>\n<li><p>About 700 OpenAI employees, out of a total of 770, <a href=\"https://www.cnbc.com/2023/11/20/hundreds-of-openai-employees-threaten-to-follow-altman-to-microsoft-unless-board-resigns-reports-say.html\">signed an open letter demanding the OpenAI board resign</a>, and threatening to quit to join Altman at Microsoft if they don’t. Among the signees: Mira Murati (which might explain why she’s no longer interim CEO) and chief scientist and board member Ilya Sutskever.</p></li>\n<li><p><a href=\"https://twitter.com/ilyasut/status/1726590052392956028\">Sutskever posted on Twitter/X</a>: “I deeply regret my participation in the board’s actions. I never intended to harm OpenAI. I love everything we’ve built together and I will do everything I can to reunite the company.”</p></li>\n<li><p><a href=\"https://www.theverge.com/2023/11/20/23969586/sam-altman-plotting-return-open-ai-microsoft\">Alex Heath and Nilay Patel report for The Verge</a> that Altman and Brockman might still return to OpenAI.</p></li>\n<li><p><a href=\"https://www.cnbc.com/2023/11/20/microsoft-ceo-nadella-says-openai-governance-needs-to-change-no-matter-where-altman-ends-up.html\">Nadella appeared on CNBC</a> and admitted that Altman and Brockman were not officially signed as Microsoft employees yet, and when asked who would be OpenAI’s CEO tomorrow, laughed, because he didn’t know.</p></li>\n</ul>\n\n<p><strong>See also:</strong> <a href=\"https://stratechery.com/2023/openais-misalignment-and-microsofts-gain/\">Ben Thompson’s crackerjack take on the saga at Stratechery</a>. Long story short: OpenAI’s company structure was a ticking time bomb.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/20/openai-drama\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ca9533416eb97eda462cefeabe1655e2e23ad833aa8d0a0c2d6d8fa560fd46b2","category":"Tech"}