{"title":"PSLBII-6 Measuring greenhouse gas emissions from biogas facility as manure treatment and comparing with 2006 IPCC guideline calculation","link":"https://academic.oup.com/jas/article/102/Supplement_3/656/7757740?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>To achieve global net-zero emission goals by 2050, Korea government announced 2050 carbon neutral scenarios. Substitution of fossil fuel power plants to renewable energy plants is the main strategic long-term vision. It included increasing the number of a biogas facility to retrieve methane (CH₄) for energy sources from manure. As increasing the biogas facility with using manure, it is important to quantify and monitor the greenhouse gas (GHG) such as CH₄ and nitrous oxide (N₂O). The objective of this research was to measure the GHG emissions from the biogas facility as the baseline to construct the country-specific emission factors, and to compare the emissions between site measured data and 2006 IPCC guideline (2006 IPCC GL). This facility was constituted with feedstock, anaerobic digestion, biogas storage, and liquid fertilizer storage. The facility treats 70 tons of swine manure from 20,000 pigs and 30 ton of food waste per day and generates 3,000 m<sup>3</sup> /d of biogas. All gases were vented by negative pressure from the odor treatment tower, except the generator and its blowers. Quantification of the total GHG emissions from the biogas facility was conducted for 24 h every 2 wk, from July 2022 to October 2023, using CH₄/N<sub>2</sub>O Analyzer (Los Gatos Research, San Jose, CA). The total emissions of CH₄ and N<sub>2</sub>O were 12,545 ± 2,297 kgCH<sub>4</sub>/yr and 442 ± 1,123 kg N<sub>2</sub>O/yr. To compare total GHG emissions from the facility, it was changed by carbon dioxide (CO<sub>2</sub>) equivalent. The results showed that when the system of biogas facility operated normally, it can reduce the total GHG emissions by up to 60% compared with 2006 IPCC GL calculation. However, if the system does not circulate properly, it can result in 18 times greater emissions due to N<sub>2</sub>O, leading to significant increase in GHG emissions. To reduce GHG from biogas facilities, it is crucial to ensure continuous operation of organic matter in and out, and increase the amount of sufficient aeration in liquid fertilizer storage.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ca97593f7500bb8356e584b75a02cbf9c1692eb3875c0aeb9662f47490e55c47","category":"Environment"}