{"title":"กูเกิลระบุ Pixel 6 สแกนนิ้วช้าเกิดจากฟีเจอร์ด้านความปลอดภัย","link":"https://www.blognone.com/node/125727","date":1636370836000,"content":"<div><div><div><p>ขณะนี้ Google Pixel 6 วางตลาดแล้วมาเกือบ 2 สัปดาห์ก็มีคำบ่นจากผู้ใช้ว่าฟีเจอร์สแกนนิ้วบนหน้าจอทำงานช้า บางทีสแกนไม่ติดหรือต้องแตะนิ้วหลายรอบ ซึ่งตรงกับที่<a href=\"https://www.blognone.com/node/125464\">หลายสำนักรีวิวไว้</a></p>\n<p>ล่าสุดก็มีผู้ใช้ทวีตไปยังบัญชี @madebygoogle ถึงเรื่องดังกล่าว โดยกูเกิลได้ตอบกลับว่าระบบการสแกนนิ้วของ Pixel 6 ใช้งานอัลกอริทึมด้านความปลอดภัยที่ล้ำสมัยหลายตัว การป้องกันหลายชั้นนี้ทำให้บางครั้งอาจสแกนนิ้วช้าหรือผู้ใช้ต้องแตะนิ้วบนหน้าจออย่างตั้งใจ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d67637739d24c8ef79b71f48b69fcab9.png\" /></p>\n<p>นอกจากนี้กูเกิลยังมีหน้าซัพพอร์ตสำหรับประเด็นนี้ด้วย โดยระบุว่าหากสแกนนิ้วไม่ติดเมื่ออยู่กลางแดดจ้า ให้บังบริเวณเซ็นเซอร์สแกนนิ้วไว้ก่อนสแกน หรือในบางกรณีฟิล์มกันรอยอาจก่อให้เกิดปัญหานี้ก็ได้ ซึ่งกูเกิลแนะนำให้ใช้ฟิล์มกันรอยที่ได้รับการรับรอง Made for Google และสุดท้ายก็แนะนำว่าหากหน้าจอมีสิ่งสกปรกหรือคราบมันก็ให้ทำความสะอาดจอก่อน</p>\n<p>อย่างไรก็ดี การสแกนนิ้วช้าหรือสแกนไม่ติดก็เป็นเรื่องน่ารำคาญได้อย่างมาก ต้องติดตามดูต่อไปว่ากูเกิลจะออกอัพเดตมาแก้ไขเรื่องนี้หรือไม่</p>\n<p>ผู้อ่าน Blognone มีใครได้เครื่องกันแล้วบ้าง สแกนนิ้วช้าหรือไม่ เล่าประสบการณ์ในคอมเมนต์ได้ครับ</p>\n<p>ที่มา - <a href=\"https://www.androidauthority.com/google-pixel-6-fingerprint-scanner-security-3054470/\">Android Authority</a></p>\n<blockquote><p>We're sorry for the hassle. The Pixel 6 fingerprint sensor utilizes enhanced security algorithms. In some instances, these added protections can take longer to verify or require more direct contact with the sensor. Try troubleshooting steps: <a href=\"https://t.co/uTbifE5Uyo\">https://t.co/uTbifE5Uyo</a>. Thanks. ^Levi</p>\n<p>— Made By Google (@madebygoogle) <a href=\"https://twitter.com/madebygoogle/status/1457043416139898881?ref_src=twsrc%5Etfw\">November 6, 2021</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel-6\">Google Pixel 6</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ca993464878f48d7ecfd3c29c625f0b7ea67bf0f25dd04246ade8a7cfc265f94","category":"Thai"}