{"title":"Intel Co-Founder and Semiconductor Titan Gordon Moore Dies at 94","link":"https://www.intel.com/content/www/us/en/newsroom/news/gordon-moore-obituary.html","date":1679708437000,"content":"\n<p>Intel:</p>\n\n<blockquote>\n  <p>Intel and the Gordon and Betty Moore Foundation announced\ntoday that company co-founder Gordon Moore has passed away at\nthe age of 94.</p>\n\n<p>The foundation reported he died peacefully on Friday, March 24,\n2023, surrounded by family at his home in Hawaii. [...]</p>\n\n<p>Pat Gelsinger, Intel CEO, said, “Gordon Moore defined the\ntechnology industry through his insight and vision. He was\ninstrumental in revealing the power of transistors, and inspired\ntechnologists and entrepreneurs across the decades. We at Intel\nremain inspired by Moore’s Law and intend to pursue it until the\nperiodic table is exhausted. Gordon’s vision lives on as our true\nnorth as we use the power of technology to improve the lives of\nevery person on Earth. My career and much of my life took shape\nwithin the possibilities fueled by Gordon’s leadership at the helm\nof Intel, and I am humbled by the honor and responsibility to\ncarry his legacy forward.”</p>\n</blockquote>\n\n<p><a href=\"https://www.intel.com/content/www/us/en/newsroom/news/gordon-moore-he-stood-alone-among-tech-titans.html\">Walden Kirsch, in a remembrance published by Intel</a>:</p>\n\n<blockquote>\n  <p>Of the countless tech industry titans Silicon Valley has minted\nover the past six decades, Gordon Moore stood alone. He was\n“easily the most beloved,” wrote biographer Michael Malone.</p>\n\n<p>Moore was utterly unlike Robert Noyce and Andy Grove. Those two\nwere the bigger-than-life personalities with whom Moore joined in\n1968 to create Intel — what Malone, in his now-classic book <em>The\nIntel Trinity</em>, called “the world’s most important company.”</p>\n\n<p>By all accounts, Moore was neither brash nor in-your-face like\nGrove. Nor was he charismatic and high-energy like Noyce. The\n“law” that bears his name was not self-proclaimed, but popularized\nby a Cal Tech professor in the mid-1970s. As one measure of his\nmodesty, Moore once confessed to biographer Leslie Berlin that he\nwas “embarrassed to have it called Moore’s Law for a long time.”</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/24/gordon-moore-rip\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ca9d41edbfbe234e7de955813af689b2ff9fc327ef25a13861d83072e2c73a20","category":"Tech"}