{"title":"Custom-designed, mass silk production in genetically engineered silkworms","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae128/7633874?rss=1","date":1711065600000,"content":"<span><div>Abstract</div>Genetically engineered silkworms have been widely used to obtain silk with modified characteristics especially by introducing spider silk genes. However, these attempts are still challenging due to limitations in transformation strategies and difficulties in integration of the large DNA fragments. Here, we describe three different transformation strategies in genetically engineered silkworms, including transcription-activator-like effector nuclease (TALEN)-mediated fibroin light chain (FibL) fusion (BmFibL-F), TALEN-mediated FibH replacement (BmFibH-R), and transposon-mediated genetic transformation with the silk gland-specific fibroin heavy chain (FibH) promoter (BmFibH-T). As the result, the yields of exogenous silk proteins, a 160 kDa major ampullate spidroin 2 (MaSp2) from the orb-weaving spider <span>Nephila clavipes</span> and a 226 kDa fibroin heavy chain protein (EvFibH) from the bagworm <span>Eumeta variegate</span>, reach 51.02 and 64.13% in BmFibH-R transformed cocoon shells, respectively. Moreover, the presence of MaSp2 or EvFibH significantly enhances the toughness of genetically engineered silk fibers by ∼86% in BmFibH-T and ∼80% in BmFibH-R silkworms, respectively. Structural analysis reveals a substantial ∼40% increase in fiber crystallinity, primarily attributed to the presence of unique polyalanines in the repetitive sequences of MaSp2 or EvFibH. In addition, RNA-seq analysis reveals that BmFibH-R system only causes minor impact on the expression of endogenous genes. Our study thus provides insights into developing custom-designed silk production using the genetically engineered silkworm as the bioreactor.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"caa5d45369d9e68ce12ada10d79e7b4d3c169edddd134b60712cf8a077649eaf","category":"Interdisciplinary"}