{"title":"Development and evaluation of public‐supply community water service area boundaries for the conterminous United States","link":"https://onlinelibrary.wiley.com/doi/10.1111/1752-1688.13210?af=R","date":1722501654000,"content":"<h2>Abstract</h2>\n<p>The water service area dataset, derived from the National Boundary Dataset for public-supply water systems in the United States, offers a detailed resolution surpassing county-level assessments, emphasizing water-centric land use. Crucial for linking populations and infrastructure to system withdrawals, it supports the creation of a national public-supply water-use model, enhancing accuracy in estimating water use and distinguishing between publicly supplied and self-supplied domestic water use. Integrating tabular water system data strengthens the national water-use model by enabling tracking of withdrawal locations, source water, and water quality. Evaluated against U.S. Census-derived population datasets, 16 state-provided water service area datasets, and two national land use datasets, the study covers 22,849 community water systems, excluding most small systems serving fewer than 1000 people. Robust correlations between water service areas (WSAs) and satellite-sourced urban and exurban land use types facilitate tracking changes over time. A comparison of state and national datasets for population and WSAs reveals discrepancies ranging from 5% to 73% in state-level populations and 0% to 167% in state-level WSAs. Significant differences can be attributed to the exclusion of sizable incorporated and unincorporated areas in the state-based datasets. Additional comparisons of major metropolitan areas exhibit differences ranging from 2% to 56%.</p>","author":"Cheryl A. Buchwald, \nNatalie A. Houston, \nJana S. Stewart, \nAyman H. Alzraiee, \nRichard G. Niswonger, \nJoshua D. Larsen","siteTitle":"Wiley: JAWRA Journal of the American Water Resources Association: Table of Contents","siteHash":"b7070794a350c180e68e2251d6fc4f4ad5be669c5d24d82d3d55b25b0dce7a23","entryHash":"caa815d0087d422fb86d5c3e42f522a320f709d0b499c4fa20d76d37a5ef7e78","category":"Environment"}