{"title":"Imbento-ry: Assessing the Service Crew Commitment to Inventory Counting and its Impact on Inventory Management Efficiency in Quick Service Restaurant","link":"https://www.preprints.org/manuscript/202409.2210/v1","date":1727574458000,"content":"Effective inventory management is vital for both organizational success and customer satisfaction. This study explores how service crew commitment impacts inventory management efficiency in Quick Service Restaurants (QSR) in Quezon City, Philippines. Utilizing a quantitative descriptive-correlation approach, data were gathered from 171 participants through purposive sampling, using a structured questionnaire to assess service crew commitment, factors influencing it, and inventory management efficiency. Descriptive and inferential statistics, including regression and correlation analyses, were employed to analyze the data. The results revealed a strong positive correlation (r = 0.911, p &lt; 0.001) between service crew commitment and inventory management efficiency. Key factors influencing this commitment included training, recognition, standardized procedures, resource availability, and organizational culture. Regression analysis showed that service crew commitment (Beta = 0.659, p &lt; 0.001) and these related factors (Beta = 0.318, p &lt; 0.001) significantly affect inventory management efficiency. These findings underscore the need to enhance service crew commitment through comprehensive training programs, effective recognition systems, clear and standardized procedures, optimized resource allocation, and a supportive organizational culture. Such improvements are crucial for optimizing inventory management processes, reducing operational costs, and enhancing overall supply chain performance. Recommendations focus on implementing regular training sessions, establishing robust recognition programs, maintaining clear procedures, ensuring adequate resources, and fostering a positive work environment to sustain high inventory management standards.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cab6cac461f072ea28bae02eb432f398a864c8833faeb54a25084aa941ad4d39","category":"Interdisciplinary"}