{"title":"Great British Bake Off’s festive Christmas desserts aren’t so naughty after all","link":"https://arstechnica.com/?p=1991956","date":1703115045000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/bakeoff1-800x533.jpg\" alt=\"four smiling people at a festive picnic table munching on a tasty snack\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/bakeoff1.jpg\">Enlarge</a> <span>/</span> <em>Great British Bake Off</em> judges Paul Hollywood and Prue Leith (top) and presenters Alison Hammond and Noel Fielding. (credit: Mark Bourdillon/Love Productions/Channel 4)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><a href=\"https://en.wikipedia.org/wiki/The_Great_British_Bake_Off\"><em>The Great British Bake Off</em></a> (<em>TGBBO</em>)—aka <em>The Great British Baking Show</em> in the US and Canada—features amateur bakers competing each week in a series of baking challenges, culminating in a single winner. The recipes include all manner of deliciously decadent concoctions, including the occasional Christmas dessert. But many of the show's Christmas recipes might not be as bad for your health as one might think, according to a <a href=\"https://www.bmj.com/content/383/bmj-2023-077166\">new paper</a> published in the annual Christmas issue of the British Medical Journal, traditionally devoted to more light-hearted scientific papers.</p>\n<p><em>TGBBO</em> made its broadcast debut in 2010 on the BBC, and its popularity grew quickly and spread across the Atlantic. The show was inspired by the traditional baking competitions at English village fetes (see any British cozy murder mystery for reference). Now entering its 15th season, the current judges are Paul Hollywood and Prue Leith, with Noel Fielding and Alison Hammond serving as hosts/presenters, providing (occasionally off-color) commentary. Each week features a theme and three challenges: a signature bake, a technical challenge, and a show-stopper bake.</p>\n<p>The four co-authors of the new BMJ study—Joshua Wallach of Emory University and Yale University's Anant Gautam, Reshma Ramachandran, and Joseph Ross—are avid fans of <em>TGBBO</em>, which they declare to be \"the greatest television baking competition of all time.\" They are also fans of desserts in general, noting that in medieval England, the Catholic Church once issued a decree requiring Christmas pudding four weeks before Christmas. Those puddings were more stew-like, containing things like prunes, raisins, carrots, nuts, spices, grains, eggs, beef, and mutton. Hence, those puddings were arguably more \"healthy\" than the modern take on desserts, which contain a lot more butter and sugar in particular.</p></div><p><a href=\"https://arstechnica.com/?p=1991956#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991956&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"caddaf1d00353ab60064b4e3017209a80470824c976ae6f0eb80b19366aaa982","category":"Tech"}