{"title":"How to choose the right bike saddle for you","link":"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-the-best-saddle/","date":1622962800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/how-to-choose-the-right-saddle-for-you-11-2aa5fba.jpg?quality=45&amp;resize=620,413\" />                                            <p>Getting the right bike saddle for you – which is key for comfortable and fun cycling – can be a minefield. With so many shapes, styles and price points available, the sheer volume of options available can be overwhelming.</p>\n<p>In this in-depth guide, we’ll talk through how to choose the best saddle for you – whether you’re a road, gravel or mountain biker, and whatever your gender, we’ll help you find the right saddle for your riding needs.</p>\n<p>A comfortable saddle is crucial for riders of all cycling disciplines because, unless you’re a downhill mountain biker, BMX or trials rider, it’s something you’re going to spend a lot of time on.</p>\n<p>In this guide, we’ll start by going into the fundamentals of how a saddle works (or, how it should work), why different disciplines demand different shapes of saddle, why women’s saddles are different, and the overall anatomy/construction of a saddle.</p>\n<p>We also cover some myths about saddles, including what <em>not </em>to do in your pursuit of comfort.</p>\n<p>Finally, we’ll talk through how to choose the best bike seat, including tips on how to determine what shape and size of saddle is best for you and your riding.</p>\n\n<h2>Why saddle fit matters</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Finding the right saddle for you is a journey, and we’re here to help you along the way.</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>There are few other aspects of cycling that are so personal, and the perfect saddle for one rider could be akin to a torture device for another.</p>\n<p>Not only do our individual shapes and sizes determine what will suit us best, but also riding style, discipline and overall level of flexibility.</p>\n<p>With so much to think about, finding the right bike saddle can be daunting, especially with so many different saddle models, sizes and shapes on offer.</p>\n<p>A bike saddle doesn’t only give you something to perch on but is also one of the three crucial contact points with your bike that can affect its overall perceived ride quality.</p>\n<p>A well-fitted saddle should enable you to get the most out of your ride, whether that’s sustained power efforts, riding for days on end or getting you to the trailhead, you should be able to do all of this free from discomfort. If you find the right saddle for you, <a href=\"https://www.bikeradar.com/features/i-love-the-pro-stealth-superlight/\" target=\"_blank\">it can feel genuinely empowering</a>.</p>\n<section><div>\n        <h4>A word of warning</h4>\n<p>It’s a common myth that bike saddles are inherently uncomfortable, which can, unfortunately, put people off riding altogether. </p>\n<p>A suitable saddle shouldn’t cause any discomfort at all: no numbness, pain, chafing or pinching. </p>\n<p>Like a great pair of bib shorts, a good saddle for you is the one you don’t notice is there.</p>\n<p>If you’re relatively new to cycling, it’s important to stress that it can take some time for your body to get used to being in the saddle for sustained periods of time. </p>\n<p>Just like that aching feeling you might get from your first visit back to the gym after a while, you have to build a degree of strength and resilience to be comfortable. </p>\n<p>The good news is, providing your saddle is right for you, your body will soon adapt to your new position in the saddle.</p>\n<p>However, if you’re still suffering with saddle pain after the first few weeks then it could be wise to look for an alternative seat.</p>\n<p>\n\n    </p></div>\n    </section><h2>How a saddle works (or, how a saddle <em>should</em> work)</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A good saddle should support your sit bones effectively.</span></figcaption><span> <i>Thomas McDaniel / Immediate Media</i></span></div>\n<p>Just like when sitting on a chair, it is the sit bones at the lowest point in the pelvis that support the body’s weight, and these are crucial for saddle fit.</p>\n<p>When in the riding position, the perineal area for men and the pubic bone arch for women may also rest on the saddle.</p>\n<p>Although these areas can hold a small amount of weight, pressure reduction here is critical to avoid numbness and pain that results from this nerve and blood vessel-rich area.</p>\n<p>Sit bone widths vary between individuals, and therefore saddle manufacturers often produce models in a range of widths. Also, statistically speaking, women have wider hips than men, so they on average also have wider sit bones and require wider saddles.</p>\n<p>If your saddle is too narrow, you might experience undue pressure on the sit bones or unevenness in the saddle. If you go too wide, you risk chafing.</p>\n<h2>Road vs mountain bike vs women’s vs gravel saddles – what are the actual differences?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Saddle shape differs between disciplines.</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>Differences between saddles for different disciplines relate mostly to riding position, which not only depends on what type of bike you’re riding but also how you ride it.</p>\n<p>A road cyclist competing in a road race is likely to have a much more aggressive position compared to a road cyclist on a long-distance tour, for example.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Saddles are available in a range of shapes, with the best shape for you influenced by your riding position.</span></figcaption><span> <i>Prologo</i></span></div>\n<p>This position then relates to the rider’s hip angle, which will affect how the pelvis interacts with the saddle, and hence what shape is best.</p>\n<p>For faster-paced efforts and more aerodynamic positions such as those found in road riding and triathlons, flatter, longer saddles tend to work best.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Your position on the bike determines your hip angle.</span></figcaption><span> <i>Thomas McDaniel / Immediate Media</i></span></div>\n<p>On the other hand, curved-profile saddles are often favoured by riders in a more upright endurance position, more commonly used by gravel riders, commuters or trail riders.</p>\n<p>Aside from saddle shape, you may find that some saddles designed for off-road riding have features designed to reduce trail vibrations, such as flexible wing panels or more compliant shells.</p>\n<section><div>\n        <h3>How are women’s saddles different?</h3>\n<p>Although some female riders are comfortable on unisex saddles (or vice versa!), a lot of women prefer a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-bike-saddle-a-buyers-guide/\" target=\"_blank\">women’s-specific saddle</a>. </p>\n<p>Women’s saddles have slightly different shapes, including central grooves or cut-outs, as well as different densities and areas of padding, corresponding to women’s anatomy. </p>\n<p>The aim here is to be supportive where it counts, i.e. the sit bones, and relieving any pressure where it’s best avoided around the soft tissue areas.</p>\n<p>\n\n    </p></div>\n    </section><h2>Why do some saddles have a cut-out?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Some saddles feature prominent cut-outs to relieve pressure on soft tissue.</span></figcaption><span> <i>Georgina Hinton</i></span></div>\n<p>Central grooves or cut-outs in cycling saddles not only help to alleviate soft tissue pressure in the genital area for riders but can also help to reduce the pressure on the perineal area (men) or the pubic bone arch (women).</p>\n<p>Much like other aspects of saddle fit, it can take some trial and error to find a recessed shape that works for you.</p>\n<h2>Anatomy of a saddle and what do I get if I spend more?</h2>\n<h3>1. Shell</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The material used to construct the shell of the saddle determines its ride quality (and cost). The Superlight version of the Pro Stealth, for example, is built on a one-piece carbon hull.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>The shell or chassis of the saddle is the hard base that forms its basic shape and determines how much it will flex.</p>\n<p>The rails below connect the shell to the seatpost via the seat clamp. The layers on top of the shell are the padding and cover.</p>\n<p>More budget-friendly saddles will be made of plastic, or a fibre-reinforced polymer, whereas more expensive saddles will have a carbon-fibre shell.</p>\n<p>It’s worth noting that a specific model of a saddle will typically have the same shape, regardless of whether it has a plastic or carbon shell.</p>\n<p>The advantage of a carbon shell is that, in most cases, it will be lighter, and potentially stronger than the plastic or polymer equivalent.</p>\n<h3>2. Rails</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The material used for the saddle rails will significantly determine the overall cost of the saddle. Steel rails, as seen here, tend to be the cheapest.</span></figcaption><span> <i>Felix Smith</i></span></div>\n<p>The rails of the saddle connect the shell to the seatpost clamp.</p>\n<p>Steel alloy rails will be standard on cheaper saddles, while mid-range and top-tier saddles tend to opt for manganese alloys, titanium or carbon-fibre rails.</p>\n<p>These rails are one of the main determinants of a saddle’s price, and can also offer significant weight savings as you move up through the range.</p>\n<p>It’s worth noting that carbon rail saddles may not be compatible with all seat clamps, due to the rails being oval-shaped instead of round.</p>\n<h3>3. Cover</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The cover is the outermost layer of the saddle.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The cover is the outermost layer of the saddle and is the part you actually sit on. Saddle covers are made from a variety of materials including real leather, though synthetic covers are much more common.</p>\n<p>Look out for any prominent seams and rough patches when choosing a saddle because these can cause discomfort depending on their location, or even wear holes in your shorts.</p>\n<h3>4. Padding</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> A high-quality saddle will have different densities of foam used throughout to relieve pressure.</span></figcaption><span> <i>Prologo</i></span></div>\n<p>While thick, soft padding may seem like the solution for ultimate saddle comfort, over the course of a ride this compresses, deforming around your anatomy, and can end up putting pressure on the soft tissue areas.</p>\n<p>Many saddle manufacturers use pressure mapping to determine where to place padding, which can range from simple foam to gel, or even memory foam.</p>\n<p>Many modern saddles are now constructed using areas of variable density foam to give support and relief where needed.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 3D printing is making in roads into the world of saddles.</span></figcaption><span> <i>Dave Caudery / Immediate Media</i></span></div>\n<p>Some saddles – such as the <a href=\"https://www.bikeradar.com/reviews/components/saddles/fizik-antares-versus-evo-00-adaptive-saddle-review/\" target=\"_blank\">Fizik Adaptive</a> and <a href=\"https://www.bikeradar.com/reviews/components/saddles/specialized-s-works-power-with-mirror-saddle-review/\" target=\"_blank\">Specialized Mirror</a> line – even use 3D printing to create a polymer matrix to help reduce pressure in very specific areas.</p>\n<p>The majority of saddles will have some padding, but there are riders who are even happy with bare carbon saddles. These are definitely not for everyone, but highlight the importance of finding a saddle that’s the correct size and shape.</p>\n<h3>5. Channels, grooves and cut-out features</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cut-outs and other features add complexity and, as a result, often add to cost.</span></figcaption><span></span></div>\n<p>Many saddles on the market feature central pressure-relieving channels or cut-outs. As mentioned, the idea behind this is to relieve any soft tissue pressure and to improve blood flow. If you’re experiencing numbness while riding, a saddle with a cut-out or central channel is something to look into.</p>\n<p>If you’re not experiencing numbness, can you still use a saddle with a cut-out? The answer is yes – many people do. It really comes down to what’s most comfortable for you. Be warned, though, for some people a cut-out can create pressure points close to the edge of the channel.</p>\n<p>If you often ride in mucky conditions, it’s worth considering a saddle shape that doesn’t feature a full-depth hole because you’re more likely to end up with a lot of dirt exactly where you don’t want it! Some off-road-specific saddles with cut-outs are designed with a draining shelf to prevent this from happening.</p>\n<h3>6. Extras</h3>\n<p>Some saddles have extra features, such as reinforced corners on the cover to prevent scuffing, while others have elastomers between the rails and shell, and some have things like mounting brackets for tail-lights and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-saddle-bags/\">saddle bags</a>.</p>\n<p>While these features are a bonus, they shouldn’t have too much influence on your buying decision.</p>\n<h2>How to choose the right saddle for you</h2>\n<p>There is an eye-watering number of saddles on the market, and finding the right seat can mean the difference between having an awesome ride, and not being able to sit comfortably at the dinner table.</p>\n<p>Here’s how to go about choosing the right saddle for your needs.</p>\n<h3>1. What kind of riding are you doing?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> As mentioned, the type of riding you do will largely determine the saddle you use.</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>Even for the same individual, the requirements from a saddle will differ for different disciplines: rarely will the saddle on a road bike for racing crits be the same as the saddle on a trail mountain bike or long-distance tourer. Not only will the discipline affect what saddle is best for you, but so will your riding style.</p>\n<p>Considering this will help you determine roughly what shape of saddle to go for. More on that in a moment.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A more upright position, such as that found on a hybrid or commuter bike, will be best served by a saddle with a more round profile.</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>If you’re planning on racing, or if you’re a rider who slides forward during efforts and rides ‘on the rivet’, a saddle with a flat profile and wide, flat nose might be best.</p>\n<p>If you sit a bit more upright on your bike and don’t move around too much, something slightly wider with a curved profile might offer more comfort.</p>\n<p>An extreme example would be saddles designed for time trialling or triathlon. These allow the rider to get into an aerodynamically optimal position without compromising power output, typically with a very flat profile and stunted nose.</p>\n<h3>2. Consider your anatomy</h3>\n<p>Given that men and women are built quite differently, many brands make women’s-specific saddles to accommodate the differences in anatomy. That said, there are plenty of women out there who are perfectly comfortable on a men’s or unisex saddle, and vice versa.</p>\n<p>If you are considering a women’s-specific saddle, check out our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-bike-saddle-a-buyers-guide/\" target=\"_blank\">best women’s bike saddles</a>.</p>\n<h3>3. What size and shape of saddle do you need?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Saddles come in different widths to suit individual riders.</span></figcaption><span> <i>Prologo</i></span></div>\n<p>As we mentioned before, your saddle is designed to support your sit bones, and as we’re all different, many saddles come in different shapes and sizes.</p>\n<p>Luckily, just about every saddle brand has its own proprietary fit system to help you find the right saddle in its range. This is usually used in conjunction with methods to determine the width of your sit bones and your flexibility.</p>\n<p>Most shops will have a device to measure the distance between your sit bones without being intrusive: usually a gel or memory foam pad that you sit on, so your sit bones leave an impression that can then be measured.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/10/DIY-SIT-BONE-WIDTH-MEASUREMENT-STEP-1-9eb6876.gif?quality=90&amp;resize=258%2C336\" /></div>    <figcaption><div>\n    <figcaption><span>First, lay a sheet of tin foil on a carpeted staircase.</span>\n    </figcaption><span>\n                    <i>Robyn Furtado / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/10/DIY-SIT-BONE-WIDTH-MEASUREMENT-STEP-2-9d1fbd9.gif?quality=90&amp;resize=255%2C331\" /></div>    <figcaption><div>\n    <figcaption><span>Next, sit on the tin foil to leave a depression.</span>\n    </figcaption><span>\n                    <i>Robyn Furtado / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/10/DIY-SIT-BONE-WIDTH-MEASUREMENT-STEP-3-33005be.gif?quality=90&amp;resize=258%2C335\" /></div>    <figcaption><div>\n    <figcaption><span>Finally, measure the width between the two impressions.</span>\n    </figcaption><span>\n                    <i>Robyn Furtado / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nIf you can’t find a shop with these tools, you can take this measurement at home using a piece of aluminium foil or corrugated cardboard:\n<ol><li>Place the foil or cardboard on a carpeted stair and sit down, then pick up your feet to mimic your riding position.</li>\n<li>When you stand up there should be two depressions left by your sit bones.</li>\n<li>Measure the distance between the centres of the depressions and add 25 to 30mm to find your ideal saddle width.</li>\n</ol><h3>4. Can you take it for a test ride?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Swapping your stock saddle and testing your new perch is the best way to assess if it is right for you.</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>Many shops will have a fleet of test saddles they will let you put on your bike to take for a test ride. With some, the moment you sit down, you’ll know that it’s not for you, but with others, it takes a bit of time to work out whether you’ll be a good match.</p>\n<p>Things to look out for when test riding a saddle include numbness and any pressure on soft tissue areas. You also shouldn’t feel the saddle digging into your undercarriage, nor at the top of your legs when you pedal. Ideally, the saddle should fit so that you don’t notice it at all!</p>\n<p>It’s best to spend at least an hour using the saddle because it will take your body some time to adjust to new seating arrangements, as well as for niggles to surface. If you can spend longer, then that’s even better because that’ll give any incompatibility a greater chance of showing before you invest.</p>\n<p>Some brands offer schemes where you can try the saddle for an extended period of time and return it if you’re not satisfied, or others offer a free saddle swap between models until you find the right fit for you.</p>\n<h3>5. How much money do you have to spend?</h3>\n<p>The amount you’ll need to spend on a saddle depends primarily on the materials used.</p>\n<p>If you require a strong and lightweight carbon-fibre shell and rails, then this comes at a price premium.</p>\n<p>On the other hand, entry-level saddles with polymer shells and alloy rails can be very reasonably priced, and the weight difference won’t add up to much in the context of a whole bike.</p>\n<p>Other features such as a cut-out or grooves tend to add a layer of complexity to manufacture, so the price will likely reflect this.</p>\n<h2>How can I make my saddle more comfortable?</h2>\n<p>Although a padded gel saddle cover might seem like a good idea to make your saddle more comfortable, this will most likely have the opposite effect.</p>\n<p>The way that the thick gel padding compresses under you over the duration of a ride can actually be more uncomfortable for your sit bones and soft tissue.</p>\n<p>Moving your saddle forwards or backwards on the rails (within the safety limits shown) will affect your reach to the bars and how you are positioned over the bottom bracket and pedals.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The vast majority of riders should run their saddle flat but, for some, a very slight downward tilt – particularly on mountain bikes – can help.</span></figcaption><span> <i>BikeRadar</i></span></div>\n<p>Most people find that a level saddle is comfortable, although some benefit from a tilt where the nose is angled downwards slightly. Too much tilt, though, and you might find that pressure is then put through your wrists and hands onto the bars. Making sure that you have <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">set your saddle at the correct height</a> will also help.</p>\n<p>A professional bike fit is a great idea for fine-tuning your position on the bike, including finding the best saddle shape, size and position for you. Also, don’t underestimate the power of a quality pair of bib shorts and even some chamois cream for longer rides.</p>\n<p>Ultimately, remember that your saddle should be totally comfortable for hours on end. By experimenting with different models and positions and measuring your sit bone width, you’re sure to find the perfect match for you.</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"cae5adfe9babbb069bc85b664433f4531ca8857ab423dcc3709d62d1db935e6b","category":"Cycling"}