{"title":"First Vehicles With Next-Generation Apple CarPlay Announced Ahead of 2024 Launch","link":"https://www.macrumors.com/2023/12/20/first-next-generation-carplay-vehicles-announced/","date":1703095026000,"content":"Aston Martin and Porsche today previewed the first vehicle dashboards with support for Apple's next-generation CarPlay experience, which launches in 2024, according to a <a href=\"https://www.caranddriver.com/news/a46188510/apple-carplay-next-gen-interface/\"><em>Car and Driver</em> report</a> spotted by <a href=\"https://twitter.com/markgurman/status/1737527824066502977\"><em>Bloomberg</em>'s Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/next-generation-carplay-multi-display.jpg\" width=\"1960\" height=\"1102\" />\r<br />\nAston Martin confirmed that it will release its first vehicles with next-generation CarPlay in 2024, but it's unclear exactly when in the year this will happen, or which models will support it. Porsche did not provide a timeframe or reveal any specific details.\r<br />\n\r<br />\nApple first previewed the <a href=\"https://www.macrumors.com/2023/10/23/all-new-carplay-late-2023/\">next-generation CarPlay experience</a> in June 2022, promising deeper integration with the instrument cluster and climate controls, support for multiple displays across the dashboard, a dedicated FM radio app, widgets, and more.\r<br />\n\r<br />\nThe next-generation CarPlay interface can be tailored to each specific vehicle model and automaker's brand identity, as pictured below.\r<br />\n\r<br />\nAston Martin previewed CarPlay integration with the instrument cluster and climate controls:\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Next-Generation-CarPlay-Aston-Martin.jpeg\" width=\"980\" height=\"551\" /><img src=\"https://images.macrumors.com/article-new/2023/12/Next-Generation-CarPlay-Aston-Martin-2.jpeg\" width=\"1508\" height=\"793\" />\r<br />\n\r<br />\nPorsche showed off a custom elongated CarPlay interface on the central screen, along with widgets for apps like Calendar, Music, and Weather on a second display:\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Next-Generation-CarPlay-Porsche-1.png\" width=\"1200\" height=\"675\" /><img src=\"https://images.macrumors.com/article-new/2023/12/Next-Generation-CarPlay-Porsche-2.jpeg\" width=\"1540\" height=\"854\" />\r<br />\nWith next-generation CarPlay, a connected iPhone will provide app-related data, while the vehicle will provide driving-specific data and info like tire pressure. Apple said the connected iPhone will not store or track this vehicle information.\r<br />\n\r<br />\nWhen first unveiling next-generation CarPlay last year, Apple said committed automakers included Acura, Audi, Ford, Honda, Infiniti, Jaguar, Land Rover, Lincoln, Mercedes-Benz, Nissan, Polestar, Porsche, Renault, and Volvo. Beyond the addition of Aston Martin, it's unclear if this list has changed since that initial announcement.\r<br />\n\r<br />\nBelow, we have recapped five key features to expect from next-generation CarPlay, as previewed by Apple last year.\r<br />\n\r<br />\n<h2>Instrument Cluster Integration</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/Multi-Display-CarPlay-2.jpeg\" width=\"1600\" height=\"896\" />\r<br />\nThe new CarPlay experience will provide integration with a vehicle's instrument cluster, including the speedometer, tachometer, odometer, fuel gauge, engine temperature gauge, oil pressure gauge, and more. Apple says drivers will be able to choose from several gauge cluster designs and layouts, including brand‑specific options.\r<br />\n\r<br />\n<h2>Climate Controls</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/CarPlay-Next-Generation-Screen.jpg\" width=\"3562\" height=\"1990\" />\r<br />\nYou'll be able to access your vehicle's climate controls directly within the new version of CarPlay, allowing you to adjust the temperature of the A/C or heat, fan speed, heated seats, heated steering wheel, and other options.\r<br />\n\r<br />\n<h2>Multi-Display Support</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/CarPlay-Next-Generation-Multi-Screens.jpg\" width=\"1600\" height=\"897\" />\r<br />\nThe new version of CarPlay will be able to appear across all of the displays in a vehicle, providing a consistent experience across the infotainment system, instrument cluster, and any additional screens on the dashboard. Apple says CarPlay will be tailored to each new vehicle model to accommodate unique screen shapes and layouts. \r<br />\n\r<br />\n<h2>Widgets</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/CarPlay-Next-Generation-Widgets.jpg\" width=\"1600\" height=\"900\" />\r<br />\nWidgets will be a key part of the new CarPlay experience, offering at-a-glance information such as trip duration, fuel economy, distance traveled, calendar events, weather, phone calls, the status of a HomeKit-enabled garage door, and more. It will also be possible to view and scroll through the widgets within the instrument cluster.\r<br />\n\r<br />\n<h2>FM Radio App</h2>\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/CarPlay-Next-Generation-Radio.jpg\" width=\"1600\" height=\"899\" />\r<br />\nThe new version of CarPlay will include an all-new Radio app that allows you to easily control the FM radio in your vehicle, such as to change the station.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/20/first-next-generation-carplay-vehicles-announced/\">First Vehicles With Next-Generation Apple CarPlay Announced Ahead of 2024 Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-vehicles-with-next-generation-apple-carplay-announced-ahead-of-2024-launch.2414274/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cae72c0a79141937f22e09b980f7d0a476ef73123cf32bd3fdd4b41717315ef0","category":"Apple"}