{"title":"Giro d'Italia stage 17 preview - the final sprint before Rome","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-17-preview-1","date":1684857787000,"content":"\n      <p><b>Distance: </b><span>195km<br /></span><b>Start location: </b><span>Pergine Valsugana</span><b> <br /></b><b>Finish location: </b><span>Caorle<br /></span><b>Start time: </b><span>12:45 CEST<br /></span><b>Finish time (approx): </b><span>17:13</span><b> </b>CEST</p>\n<p>The <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> won’t quite set foot in Venice during stage 17, but by travelling through the region of Veneto it will cover much of the territory of the Venetian Republic that was such a powerful and prosperous city state for a millennium between the seventh and eighteenth century. The Venetian language is still spoken and understood by most here alongside Italian, and places like Verona, Treviso and Padua were all important cities during the republic.</p>\n<div></div>\n<p>The Adriatic coast that the riders will spend most of the day travelling eastwards towards was the gateway of Venice’s vast wealth. From it, the Venetians were able to become a maritime superpower, establish trade routes across the Mediterranean, stretching as far as North Africa to the Middle East. The salt trade was the first economy that they monopolised and built a fortune on, but later it became known for all kinds of goods, including everything from coffee, wine and spices to silk, glass and perfumes. Its influence declined when the Atlantic Ocean replaced the Mediterranean as a trading route, but by then it had already helped establish the practices of modern-day capitalism that, for better or worse, we’re all still living in today.</p>\n<p><span>The final destination of stage 17, Caorle, was another important city of the Venetian Republic. Situated north of Venice on the coast, it bears many of the republic’s hallmarks, featuring the bridges, canals, lagoons, alleyways and squares that Venice is so famous for. And of course there are the beaches: halfway between both towns is the Lido di Jesolo, a popular seaside resort from where the riders will begin the 30km run-in to the finish along the coast. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_17_15b59204-41f6-44cc-9405-571bb24a54b6.jpg?v=1684319077\" alt /><em>Stage 17 profile sourced on the Giro d'Italia website </em></p>\n<p>In terms of geography, there’s no real reason for the race to head this far south out of the Alps and back into the Po Valley today, as the riders will be sent right back into the mountains again tomorrow. This stage feels like a gift for the sprinters, an apt reward for all of them who battled hard to make the time limit during yesterday’s brute of a stage. </p>\n<p>This is the arguably the most straightforward stage of the whole Giro. There isn’t a single climb to contend with, with the road heading gently downhill out of Trentino for the first half before flattening out all the way to the finish. This is a stage that will therefore be decided by its final kilometres, which, with the final finishing straight lasting 600 metres on a road eight metres wide, won’t be particularly technical. </p>\n<h3>Contenders</h3>\n<p><span>After enduring some gruelling days in the mountains, the sprinters are rewarded with a stage tailored just for them. With little to no elevation over the 195km route, today’s stage could be an uneventful affair until the end, with the remaining sprinters hoping to secure the stage. </span></p>\n<p><span>After announcing his retirement on the second rest day of the Giro, many cycling fans will be backing </span><b>Mark Cavendish</b><span> (Astana Qazaqstan) to finally clinch a stage win. He has achieved three top 10 finishes in the sprint stages so far, including a third-place finish on stage 11 and an impressive fourth place on stage five, crossing the line in the most spectacular fashion. He is also the only option for the team to win and stage, and this is potentially his best opportunity yet. </span></p>\n<p><span>With Kaden Groves and Mads Pedersen out of the Giro, Cavendish’s main competition is </span><b>Jonathan Milan</b><span> (Bahrain-Victorious), already a stage winner at this year’s race. The 22-year-old sprinter has excelled during his Giro d’Italia debut with a stage win and three second-place finishes against the fastest riders. Showing no signs of stopping, he’ll be eager to secure another victory before the race comes to a close and add to his points classification lead. </span></p>\n\n<p><span><strong>Pascal Ackermann</strong> (UAE Team Emirates) is another strong sprinter who has been battling for stage wins. He has shown his ability to time his effort perfectly with his victory on stage 11, where he narrowly beat Milan in a photo finish. However, considering that João Almeida currently holds second place in the GC, Ackermann may not have much support from the rest of his team, who will focus on supporting Almeida instead of pursuing individual stage wins.</span></p>\n<p><span>Another stage winner looking to repeat his success will be </span><b>Michael Matthews</b><span> (Jayco-Alula). The Australian rider has displayed consistent strength throughout both the sprint and mountain stages, although the lack of difficulty on this stage before the line will make Matthews an outsider .</span></p>\n<p><b>Fernando Gaviria </b><span>(Movistar) is another contender, though has looked increasingly out of form as the race has dragged on. His teammate </span><b>Max Canter </b>could make for an adequate stand in, having<span> proven to be in good form throughout the race so far. </span><b>Niccolò Bonifazio</b><span> (Intermarché-Circus-Wanty) will be another rider to watch in the final sprint, particularly with a now depleted field.</span></p>\n<h3>Prediction</h3>\n<p><span>We think Mark Cavendish will be eager to conclude his last Giro d’Italia with a stage victory, and will clinch the win here having narrowly missing out on three occasions. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"caef3f78fe49b779c64080eabe7413598e95a701ae63e190eb81280bf65a72ab","category":"Cycling"}