{"title":"Effects of vegetal protein hydrolysate application method, nitrogen level, and nitrate‐to‐ammonium ratio on growth and composition of hydroponic lettuce","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13857?af=R","date":1725699795000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Vegetal-derived protein hydrolysates (PHs) have been recognized as sustainable biostimulant products due to their beneficial effects on crops. However, most studies on PHs have been conducted at a fixed ratio of nitrate-to-ammonium (NO<sub>3</sub>\n<sup>−</sup>:NH<sub>4</sub>\n<sup>+</sup>) without considering other N application scenarios, leading to inconsistent results among the studies. This study compared the influences of N levels (2 or 10 mM N), NO<sub>3</sub>:NH<sub>4</sub> ratios (100:0, 75:25, 50:50, or 25:75), and PH application methods – control, foliar spray (PH-F) or root application (PH-R) – on the yield, morphology, nutrients, and nutraceutical quality of hydroponic lettuce.</p>\n<h2>RESULTS</h2>\n<p>Nitrogen level, NO<sub>3</sub>:NH<sub>4</sub> ratio, and PH application affected plant growth, morphology, and quality significantly, highlighting the importance of the interactions among these factors. Shoot growth was influenced by NO<sub>3</sub>:NH<sub>4</sub> ratios, PH, and their interactions. Similar trends were observed in chlorophyll content. The interactions among all three factors significantly influenced root growth and morphology. Root application (PH-R) protected lettuce from yield loss caused by low NO<sub>3</sub>:NH<sub>4</sub> ratios and from reduced antioxidant compounds caused by high N levels. Vegetal-derived protein hydrolysates improved nutrient uptake through two-way and three-way interactions although neither PH nor any interactions affected nitrate concentrations.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrated that PH interacts with N level and NO<sub>3</sub>:NH<sub>4</sub> ratio, affecting hydroponic lettuce yield and quality. In particular, the root application of PH was the most effective method for enhancing yield (shoot fresh weight), quality (chlorophylls, carotenoids, flavonoids, and phenols), and nutrient uptake in hydroponically grown lettuce in relation to N form and level. © 2024 Society of Chemical Industry.</p>","author":"Seunghyun Choi, \nGiuseppe Colla, \nMariateresa Cardarelli, \nHye‐Ji Kim","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"caef0ba65ed7dd9bc89720c6cc822069f9d511de7ffd0648d6ac192fbb8da3f0","category":"Environment"}