{"title":"Five things we’ve learnt from the Giro Donne so far","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/five-things-we-ve-learnt-from-the-giro-donne-so-far","date":1625848360000,"content":"\n      <p>It’s been a strange edition of the only (for now) women’s grand tour equivalent, with the opening few stages defining the GC outcome early on. Anna van der Breggen has held on to the Maglia Rosa since stage two and doesn’t look likely to relinquish it any time soon.</p>\n<p>Elsewhere in the race, riders have been hunting for stage wins. The fast-finishers have had a rare chance to shine and Marianne Vos sealed the deal on her legend status. There are two more stages left to go of the 2021 Giro d'Italia Donne, but what have we learnt from the race so far? </p>\n<div></div>\n\n<h4>\n<span></span>Very few riders can challenge Anna van der Breggen</h4>\n<p><span>We knew that Anna van der Breggen was hard to beat, and we knew that there were just a handful of riders who were capable of beating her, but the Giro Donne has cemented that fact.</span></p>\n<p><span>A number of circumstances have combined to eliminate most of the World Champion’s potential competition, and her closest rivals are her own teammates. This leaves the GC even more unlikely to change hands, and certainly not teams.  In the absence of her closest rivals such as Annemiek van Vleuten and Kasia Niewiadoma, and with Elisa Longo Borghini and Cecilie Uttrup Ludwig out of the GC race, the World Champion is walking away with the overall. </span></p>\n<p><span>Ashleigh Moolman Pasio and Demi Vollering are the closest competition van der Breggen has in this race, and given that they are her teammates, they are very unlikely to conspire to unseat her from the top spot. Van der Breggen’s walkover is impressive, but it is also an example of the fact that </span><span><span>—</span> although the women’s peloton has increased in depth over recent years </span><span>—</span>there is a long way to go still before the peloton is able to compete to the same level. </p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance\">Related: Women's WorldTeam salaries: a delicate balance</a></em></strong></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GIRO_WOMEN_7TH_JULY-15_1024x1024.jpg?v=1625820142\" /></p>\n<h4>Marianne Vos truly is the GOAT</h4>\n<p><span>While the fact that Marianne Vos is an unstoppable force of nature and the greatest of all time is not news, her status has been confirmed now that she has taken 30 stage victories at the Giro Donne. Those 30 stages now make up a fraction of her 235 road victories and countless other first place finishes across other disciplines. On top of her victories, Vos has been on the podium at four of the eight stages so far and is wearing the points jersey. </span></p>\n<p><span>She can win on almost any terrain, and has even taken the GC at this race on a few occasions. The race isn’t over yet, however, and Vos has another chance to add to her tally on stage 10 to seal herself even further into the record books and cycling legend. </span></p>\n<p><span>Marianne Vos is the greatest of all time, we know it, the peloton knows it, and Mark Cavendish </span><a href=\"https://www.instagram.com/mariannevosofficial/\"><span>knows it,</span></a><span> too.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327638821_1024x1024.jpg?v=1625846609\" /></span></p>\n<h4>Who is coming into form ahead of The Olympic Games </h4>\n<p><span>With the Olympic road race just weeks away, it is possible to gauge which riders are looking good for Tokyo by looking at their Giro Donne performances. In theory, at least, this is the case, however past Games have shown that being in form at the Giro doesn’t necessarily equate to a good Olympic ride. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\">Related: Women's Olympic Road Race 2021 Preview</a></em></strong></p>\n<p><span>Nevertheless, some of the athletes who will be turning up to Tokyo at the end of the month are showing impressive form at the Giro Donne, and will be going into the race as favourites, or proving their worth for national teammates.</span></p>\n<p><span>Coryn Rivera has been seen at this race leading out Lorena Wiebes and chasing her own victories. In short: she’s been up there, proving that she’s ready to go for the Tokyo Games. The American rider could suit the punchy course that finishes on a flat Speedway. </span></p>\n<p><span>Grace Brown will race both the road race and the time trial for Australia and if her performance against the clock on stage three of the Giro Donne is anything to go by, she will be one to watch in Tokyo. The 28-year-old posted the best time early on and hung on for third even after Demi Vollering and Anna van der Breggen had their turn. The course in Tokyo is not an 11km climb like the one up to Cascate del Toce, but Brown’s performance shows real promise ahead of the Games.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GIRO-WOMEN-7TH-JULY-50_1024x1024.jpg?v=1625846743\" /></span></p>\n<p><span>Lizzie Deignan is the best of the non-SD Worx rest at the Giro Donne and will be taking confidence from her performance at this race despite not achieving a win or GC podium standing. The British rider struggled at the last Women’s World Tour race, La Course, but seems to have bounced back just in time. </span></p>\n<p><span>Juliette Labous will take France’s one and only spot at the Tokyo Games for the women’s road events. The 22-year-old might be going on her own but judging from her quietly consistent performance at the Giro Donne, she is coming into some great pre-Olympic form. </span></p>\n<p><span>The Dominant Dutch are, of course, the ones to beat at the Olympics, with Annemiek van Vleuten choosing to train at altitude instead of race the Giro Donne her form is unknown just yet, but her fellow teammates, Anna van der Breggen, Demi Vollering, and Marianne Vos have been taking the race by storm. With so many cards to play, it’s hard to look past them for the victory in Tokyo. </span></p>\n<h4>Covid is still affecting races </h4>\n<p><span>With both Bizkaia Durango and Tibco-SVB out of the race with positive Covid cases within the teams it’s clear that we will be seeing the effects of the pandemic at races </span><span>—</span> and everywhere <span>—</span> for a long time to come. </p>\n<p><span>Even with the stringent protocols of testing and team bubbles enforced, the risk of a moving travelling circus of riders and staff staying in hotels and mixing with the public at race starts and finishes poses a risk. The hope will be that the cases that have occurred are isolated to the teams affected and haven’t spread through the peloton. In cycling, nobody wants a race decided by through someone testing positive in any sense of the word.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro-Women-4th-July_-29_1024x1024.jpg?v=1625846844\" /></span></p>\n<h4>The Giro Donne is the Giro Donne </h4>\n<p><span>It is a race that is in its 32nd edition and has been the subject of myriad frustrations over the years, but despite the hopeful narrative that new organisers, PMG Sports, rolled out earlier this year, not much has changed at the Giro Donne.</span></p>\n<p><span>While there is live coverage of every stage this year, it is unpredictable, sporadic, and therefore hard to follow, with just 7km of some stages and 30km of others. A chaotic neutral rollout in Milan on stage five shows that the general organisation is still somewhat lacking, and the minimal promotion means that few are truly aware of the race or its stature. </span></p>\n<p><span>Despite the supposed reinvention of the Giro Donne, there isn’t much that seems to have changed or improved, whether the UCI go ahead with the current plan to reinstate the 10-day race into the Women’s World Tour remains to be seen. However, with the Tour de France Femmes avec Zwift on the horizon, the race could well be overshadowed from 2022 anyway. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"caf94fe838a14e925b63f910b5471161b2c8f4ad637ddee0d1a217699fb4d358","category":"Cycling"}