{"title":"Neurocognitive dynamics of preparatory and adaptive cognitive control: Insights from mass-univariate and multivariate pattern analysis of EEG data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311319","date":1729519200000,"content":"<p>by José C. García Alanis, Malte R. Güth, Mira-Lynn Chavanon, Martin Peper</p>\r\n\r\nCognitive control refers to humans’ ability to willingly align thoughts and actions with internally represented goals. Research indicates that cognitive control is not one-dimensional but rather integrates multiple sub-processes to cope with task demands successfully. In particular, the dynamic interplay between preparatory (i.e., prior to goal-relevant events) and adaptive (i.e., in response to unexpected demands) recruitment of neural resources is believed to facilitate successful behavioural performance. However, whether preparatory and adaptive processes draw from independent or shared neural resources, and how these align in the information processing stream, remains unclear. To address these issues, we recorded electroencephalographic data from 52 subjects while they performed a computerised task. Using a combination of mass-univariate and multivariate pattern analysis procedures, we found that different types of control triggered distinct sequences of brain activation patterns, and that the order and temporal extent of these patterns were dictated by the type of control used by the participants. Stimuli that fostered preparatory recruitment of control evoked a sequence of transient occipital-parietal, sustained central-parietal, and sustained fronto-central responses. In contrast, stimuli that indicated the need for quick behavioural adjustments triggered a sequence of transient occipital-parietal, fronto-central, and central parietal responses. There was also a considerable degree of overlap in the temporal evolution of these brain activation patterns, with behavioural performance being mainly related to the magnitude of the central-parietal and fronto-central responses. Our results demonstrate how different neurocognitive mechanisms, such as early attentional allocation and subsequent behavioural selection processes, are likely to contribute to cognitive control. Moreover, our findings extend prior work by showing that these mechanisms are engaged (at least partly) in parallel, rather than independently of each other.","author":"José C. García Alanis","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cb00708e054387163a87a38a77fd544e20eaf7e797a3f9def76c29d656691d1e","category":"Interdisciplinary"}