{"title":"The vertebrate bone hypothesis: Understanding the impact of bone on vertebrate stoichiometry","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14509?af=R","date":1712119233000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5c92cbe1-f8d2-418c-a708-61c7d380d02d/fec14509-toc-0001-m.png\" alt=\"The vertebrate bone hypothesis: Understanding the impact of bone on vertebrate stoichiometry\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/17/vertebrate-bone-content-and-its-impact-on-ecosystems/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding how animals store and recycle nutrients is a major question in ecological stoichiometry, a field that applies mass-balance to ecological and physiological processes. However, ecological stoichiometry has thus far failed to accurately predict elemental demand and release in vertebrates.\n\nBecause they invest in bone, a tissue mineralized with calcium phosphate, vertebrates are phosphorus (P) rich, allowing them to uniquely impact P cycling. Nonetheless, bone's impact goes further than merely changing vertebrate body elemental content.\n\nWe propose a potential guiding hypothesis for vertebrate P stoichiometry called the ‘Vertebrate Bone Hypothesis (VBH)’. The VBH has three components: (1)Bone strongly impacts vertebrate whole-body %P and N:P. (2) Bone is a P storage tissue that acts in elemental homeostasis. (3)Bone does not have constant elemental content.\n\nTo characterize this hypothesis, we integrate bone physiology with stoichiometric principles, and we systematically review quantitative bone measurements to showcase cryptic diversity in vertebrate P content.\n\nFinally, we apply the characteristics of the VBH to ontogeny and reproduction, both of which impact bone physiology and elemental demand, to demonstrate the context dependency of bone's stoichiometric impact.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/17/vertebrate-bone-content-and-its-impact-on-ecosystems/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Emily M. May, \nRana W. El‐Sabaawi","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"cb07d2189d2eb7800e752924488656fd63ca6361521685554ee899d8eac0cb82","category":"Environment"}