{"title":"Polycyclic Aromatic Hydrocarbons (PAHs) in Grilled Marshmallows","link":"https://www.preprints.org/manuscript/202404.1118/v1","date":1713334101000,"content":"Introduction. Grilling more and more sophisticated dishes is often a popular activity. Marshmallows are confectionery products popular among children and teenagers worldwide. They are available in many supermarkets ready to be grilled. As such, grilled marshmallows can be a source of exposure to harmful compounds, including carcinogenic polycyclic aromatic hydrocarbons (PAHs). Method. PAHs analysis in marshmallows grilled under different conditions included the dilution stage with deionized water and liquid-liquid extraction with cyclohexane and solid- phase extraction (SPE on silica gel columns). PAH fractions were initially analyzed via planar chromatography (HPTLC-high performance thin layer chromatography) and PAH concentrations were determined via GC-MS/MS (gas chromatography with a tandem mass detector) using the selective reaction monitoring (SRM) mode. This study on the consumption of grilled marshmallows was conducted among approximately 300 children and adolescents. Results. The preliminary results of HPTLC and GC-MS/MS analysis indicated that “raw” marshmallows did not contain PAHs. However, the obtained data suggested a high exposure of young people to carcinogenic PAHs from grilled marshmallows. Carcinogenic BaP was determined in all samples and constituted, on average, 36% of total PAH4. Conclusions. The profile of PAH concentrations in the extracts isolated from various grilled types of marshmallows was very similar (r 2 &amp;gt; 0.8), regardless of the grilling method. Compared to the white sugar confection, the higher concentrations of PAHs were determined in multicolored marshmallows. The lack of social awareness about the exposure to carcinogenic substances is alarming.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cb10441a111789213940d3113aecf9d5694ba986762643097f89b3e936c7a3f2","category":"Interdisciplinary"}