{"title":"Advancing Aquaculture Sustainability: A Comprehensive Review of Biofloc Technology Trends, Innovative Research Approaches, and Future Prospects","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12970?af=R","date":1726571986000,"content":"<h2>ABSTRACT</h2>\n<p>Biofloc technology (BFT), initially adapted for shrimp farming in the 1970s, represents a sophisticated ecosystem of microorganisms designed to enhance aquaculture productivity and sustainability. Despite its established history, research into BFT is surprisingly still at an early stage globally. This review conducted a bibliometric analysis of 612 articles from major aquaculture journals spanning 2008–2023 to systematically explore the development, trends, and focal points of BFT research. The analysis revealed that the bulk of significant contributions originates from Brazil and China, and highlighting areas of interest can be categorized into four hotspots, such as (1) efficient nitrogen transformation, (2) biofloc microbiology, (3) biofloc's immunostimulant properties, and (4) the evaluation of research methodologies. At the end, the microecology concept was introduced, and the cross-discipline methods were promoted in the aquaculture field. Notably, much of the BFT research is still at an exploratory phase, with numerous functional bacteria unidentified and optimization strategies for BFT underdeveloped. These gaps present opportunities for enhancing aquaculture through improvements in wastewater management, product quality, safety, and yield. Furthermore, the review notes a growing trend in applying microbiome research and microecological analysis in aquaculture, with high-throughput sequencing data increasingly used to understand microbial interactions and nitrogen transformation within bioflocs. This direction promises to unlock further insights into the complex microbial ecosystems of bioflocs and their applications in sustainable aquaculture.</p>","author":"Gang Liu, \nMarc Verdegem, \nZhangying Ye, \nJian Zhao, \nJinxing Xiao, \nXingguo Liu, \nQinlang Liang, \nKun Xiang, \nSongming Zhu","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"cb2d261f14e7d0d8d0588523f2f4928bfcebcc6bf13b734c8db4b1c340d011c9","category":"Environment"}