{"title":"A metabolic profile of xenon and metabolite associations with 6-month mortality after out-of-hospital cardiac arrest: A post-hoc study of the randomised Xe-Hypotheca trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304966","date":1717509600000,"content":"<p>by Aleksi J. Nummela, Harry Scheinin, Markus Perola, Anni Joensuu, Ruut Laitio, Olli Arola, Juha Grönlund, Risto O. Roine, Minna Bäcklund, Tero J. Vahlberg, Timo Laitio, for the Xe-Hypotheca Collaboration Group </p>\r\nPurpose <p>Out-of-hospital cardiac arrest (OHCA) carries a relatively poor prognosis and requires multimodal prognostication to guide clinical decisions. Identification of previously unrecognized metabolic routes associated with patient outcome may contribute to future biomarker discovery. In OHCA, inhaled xenon elicits neuro- and cardioprotection. However, the metabolic effects remain unknown.</p> Materials and methods <p>In this post-hoc study of the randomised, 2-group, single-blind, phase 2 Xe-Hypotheca trial, 110 OHCA survivors were randomised 1:1 to receive targeted temperature management (TTM) at 33°C with or without inhaled xenon during 24 h. Blood samples for nuclear magnetic resonance spectroscopy metabolic profiling were drawn upon admission, at 24 and 72 h.</p> Results <p>At 24 h, increased lactate, adjusted hazard-ratio 2.25, 95% CI [1.53; 3.30], p&lt;0.001, and decreased branched-chain amino acids (BCAA) leucine 0.64 [0.5; 0.82], p = 0.007, and valine 0.37 [0.22; 0.63], p = 0.003, associated with 6-month mortality. At 72 h, increased lactate 2.77 [1.76; 4.36], p&lt;0.001, and alanine 2.43 [1.56; 3.78], p = 0.001, and decreased small HDL cholesterol ester content (S-HDL-CE) 0.36 [0.19; 0.68], p = 0.021, associated with mortality. No difference was observed between xenon and control groups.</p> Conclusions <p>In OHCA patients receiving TTM with or without xenon, high lactate and alanine and decreased BCAAs and S-HDL-CE associated with increased mortality. It remains to be established whether current observations on BCAAs, and possibly alanine and lactate, could reflect neural damage via their roles in the metabolism of the neurotransmitter glutamate. Xenon did not significantly alter the measured metabolic profile, a potentially beneficial attribute in the context of compromised ICU patients.</p> Trial registration <p>Trial Registry number: ClinicalTrials.gov Identifier: NCT00879892.</p>","author":"Aleksi J. Nummela","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cb38d43498837ca2be8c45d1e3f497b01ee158775e53839692dfcdef36109dda","category":"Interdisciplinary"}