{"title":"Performance of Domesticated Tiger Shrimp Postlarvae (Penaeus monodon) and Mud Crab (Scylla paramamosain) in Extensive Rice‐Shrimp Ponds","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5773446?af=R","date":1724943888000,"content":"<p>This study assessed the performance of domesticated tiger shrimp <i>Penaeus monodon postlarvae</i> and mud crab <i>Scylla paramamosain</i> co-cultured in 90 extensive rice-shrimp ponds in the Mekong River Delta of Vietnam from 2022 to Sep 2023. Limited supplementary feeding was applied for only 20% of the studied ponds. Results show that ponds stocked with domesticated postlarvae produced significantly larger shrimps at harvest and had better postlarvae usage efficiency (<i>P</i> &lt; 0.05) compared with those stocked with older postlarvae produced by wild-caught broodstock. Furthermore, a combination of stocking domesticated postlarvae and using organic fertilizer for pond preparation and during the crop was found to significantly improve productivity by 28% and final harvest size by 67% (<i>P</i> &lt; 0.05). Larger shrimps fetched 54% higher farm-gate prices, thus significantly increasing gross revenue for farmers. Co-culture of mud crab in rice-shrimp ponds at low densities (0.2–0.7 pcs/m<sup>2</sup>) was popular and profitable. Productivity was 116–187 kg/ha/crop with a profit margin up to 92.8%. Income from mud crab was very similar to that from shrimp. The results of this study suggest that domesticated postlarvae of <i>P. monodon</i> should be used for stocking extensive systems, preferably in combination of using organic fertilizer to enhance natural foods. Further improvement of income and profit can be achieved if more attention is paid on crablet quality and quality improvement.</p>","author":"Tung Hoang, \nBinh Thai Nguyen, \nQuang Viet Huynh, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"cb39e744ac35bfc96df738c2919ba1ab9ba881e5a0f56b557ab970a20a38abc2","category":"Environment"}