{"title":"The Influence of the Dimensions of Lateral Ventricles After Intracranial Hemorrhage on the Psychological Test Scores of Prematurely Born Children at the Age of 3 Years","link":"https://www.preprints.org/manuscript/202408.1224/v1","date":1724034542000,"content":"Objectives: The global quotient of psychological development, along with the motor skills, coordination, speech, and social behavior scores, was analyzed in children born prematurely with varying degrees of intracranial hemorrhage (grades I–IV), considering the unilaterality or bilaterality and dimensions of the left and right lateral ventricles. Materials and Methods: The study included 120 children divided into four groups based on gestational age: Group 1 (25–29 6/7 weeks), Group 2 (30–32 6/7 weeks), Group 3 (33–34 6/7 weeks), and Group 4 (35–37 weeks). The maximum dimensions of the right and left lateral ventricles were recorded via ultrasound. At 3 years of age, psychomotor development was assessed using the Brunet–Lezine scale. Statistical analysis was performed using appropriate modules in the SPSS 23.0 for Windows software package, along with Pearson’s ꭓ2 test and analysis of variance (ANOVA). Results: Differences in the global development quotient (QR) between the groups were statistically significant (p &amp;lt; 0.01). In Group 1, a larger dimension of the left lateral ventricle was associated with a decrease in motor skills, while in Group 2, a larger dimension of the right ventricle resulted in a significant decrease in coordination. In Group 3, all observed variables—that is, motor skills, coordination, speech, and social behavior—showed minimal values with a wider right ventricle, but without statistical significance. In Group 4, a significantly lower speech score was recorded with the dilation of the left lateral ventricle. Conclusions: The sizes of the left and right lateral ventricles after the resorption of intracranial hemorrhage affect the values (scores) obtained using the Brunet–Lezine scale in children at the age of 3 years.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cb3e8d788a1c3972772c6585f80ac02b44a319be7a3ba70b8ac3be6a9cca10c5","category":"Interdisciplinary"}