{"title":"Amazon รายงานผลประกอบการไตรมาส 1/2021 ธุรกิจโฆษณารายได้โต 77%","link":"https://www.blognone.com/node/122443","date":1619743185000,"content":"<div><div><div><p>Amazon รายงานผลประกอบการประจำไตรมาสที่ 1 ปี 2021 มีกระแสเงินสดจากการดำเนินงาน 12 เดือนย้อนหลัง เพิ่มขึ้น 69% เทียบกับช่วงเดียวกันในปีก่อน เป็น 67,213 ล้านดอลลาร์ และมีกระแสเงินสดอิสระ 12 เดือนย้อนหลัง เพิ่มขึ้นเป็น 26,410 ล้านดอลลาร์ ส่วนยอดขายเพิ่มขึ้น 44% เป็น 108,518 ล้านดอลลาร์ และมีกำไรสุทธิ 8,107 ล้านดอลลาร์</p>\n<p>ในเอกสารแถลงผลประกอบการ ซีอีโอ Jeff Bezos พูดถึง 2 ธุรกิจโดยเปรียบเหมือนลูก ที่กำลังเข้าสู่วัยแห่งการเติบโตอย่างรวดเร็ว ลูกคนแรกคือ Prime Video อายุ 10 ปี มีสมาชิกที่ชมวิดีโอมากกว่า 175 ล้านคน จำนวนชั่วโมงที่ถูกสตรีมเพิ่มขึ้น 70% ลูกอีกคนคือ AWS อายุ 15 ปี ในไตรมาสที่ผ่านมาเติบโตถึง 32% รายได้ตลอดปีอยู่ที่ 54.0 พันล้านดอลลาร์ ซึ่งตัวเลขนี้ถือเป็นบริษัทเทคโนโลยีขนาดใหญ่ได้อีกแห่งเลย</p>\n<p>Jeff Bezos จะ<a href=\"https://www.blognone.com/node/120979\">ส่งต่อ</a>ตำแหน่งซีอีโอให้ <a href=\"https://www.blognone.com/node/121034\">Andy Jassy</a> หัวหน้า AWS ในช่วงไตรมาสที่ 3 ปีนี้</p>\n<p>รายได้แยกตามกลุ่มธุรกิจ ในอเมริกาเพิ่มขึ้น 40% เป็น 64,366 ล้านดอลลาร์, นอกอเมริกาเพิ่มขึ้น 60% เป็น 30,649 ล้านดอลลาร์ ส่วน AWS เพิ่มขึ้น 32% เป็น 13,503 ล้านดอลลาร์ ตัวเลขที่น่าสนใจยังเป็นธุรกิจอื่น ๆ (Other) ซึ่งมีธุรกิจโฆษณาของ Amazon เป็นรายได้หลัก เพิ่มขึ้นถึง 77% เป็น 6,905 ล้านดอลลาร์</p>\n<p>ที่มา: <a href=\"https://ir.aboutamazon.com/news-release/news-release-details/2021/Amazon.com-Announces-First-Quarter-Results/default.aspx\">Amazon</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cab992b498aebf20736c80011fc423c5.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cb46d60b132ee98a22cca4136b6c984570e2d86b452c44d8e66021c0031686a5","category":"Thai"}