{"title":"Tetrad stage transient cold stress skews auxin-mediated energy metabolism balance in Chinese cabbage pollen","link":"https://academic.oup.com/plphys/article/195/2/1312/7619001?rss=1","date":1709510400000,"content":"<span><div>Abstract</div>Changing ambient temperature often impairs plant development and sexual reproduction, particularly pollen ontogenesis. However, mechanisms underlying cold stress-induced male sterility are not well understood. Here, we exposed Chinese cabbage (<span>Brassica campestris</span>) to different cold conditions during flowering and demonstrated that the tetrad stage was the most sensitive. After completion of pollen development at optimal conditions, transient cold stress at the tetrad stage still impacted auxin levels, starch and lipid accumulation, and pollen germination, ultimately resulting in partial male sterility. Transcriptome and metabolome analyses and histochemical staining indicated that the reduced pollen germination rate was due to the imbalance of energy metabolism during pollen maturation. The investigation of β-<span>glucuronidase</span> (<span>GUS</span>)-overexpressing transgenic plants driven by the promoter of DR5 (DR5::GUS report system) combined with cell tissue staining and metabolome analysis further validated that cold stress during the tetrad stage reduced auxin levels in mature pollen grains. Low-concentration auxin treatment on floral buds at the tetrad stage before cold exposure improved the cold tolerance of mature pollen grains. Artificially changing the content of endogenous auxin during pollen maturation by spraying chemical reagents and loss-of-function investigation of the auxin biosynthesis gene <span>YUCCA6</span> by artificial microRNA technology showed that starch overaccumulation severely reduced the pollen germination rate. In summary, we revealed that transient cold stress at the tetrad stage of pollen development in Chinese cabbage causes auxin-mediated starch-related energy metabolism imbalance that contributes to the decline in pollen germination rate and ultimately seed set.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"cb52449bad88648fb2af4cf6a1d2107107bd5880debd2cc21c767c45c47d9d78","category":"Environment"}