{"title":"YouTube ป้องกันสแปม บล็อกลิงก์ใน Shorts, ยกเลิกไอคอนลิงก์บนแบนเนอร์","link":"https://www.blognone.com/node/135238","date":1691751851000,"content":"<div><div><div><p>หลังปัญหาลิงก์สแปมของ Shorts ยังคงเพิ่มขึ้นอย่างต่อเนื่อง เมื่อวานนี้ Youtube ได้ประกาศมาตรการบล็อกลิงก์ในคำอธิบายและความคิดเห็นใน Shorts เพื่อป้องกันไม่ให้ผู้ใช้งานเข้าถึงลิงก์มัลแวร์ ฟิชชิ่งสแกม หรือเนื้อหาหลอกลวงอื่น ๆ โดยจะเริ่มใช้มาตรการดังกล่าวตั้งแต่วันที่ 31 ส.ค. เป็นต้นไป</p>\n<p>นอกจาก Shorts แล้ว YouTube ยังเตรียมยกเลิกฟีเจอร์ลิงก์บนแบนเนอร์ช่องของครีเอเตอร์ที่มีมานาน ในวันที่ 10 ส.ค. โดยระบุว่าลิงก์ดังกล่าวอาจสร้างความเข้าใจผิดได้ ซึ่งไอคอนลิงก์ดังกล่าว ถือเป็นช่องทางสำคัญในการเผยแพร่บัญชีในแพลตฟอร์มต่าง ๆของครีเอเตอร์ และเป็นช่องทางสร้างรายได้จากการโฆษณาสำหรับครีเอเตอร์</p>\n<p>อย่างไรก็ตาม YouTube ได้พยายามหาทางออกให้กับเหล่าครีเอเตอร์ โดย YouTube จะเปิดตัวฟีเจอร์ลิงก์ใหม่ที่สามารถเชื่อมโยงไปยังโซเชียลมีเดีย เว็บไซต์สินค้า หรือลิงก์อื่น ๆ ที่สอดคล้องกับ<a href=\"https://support.google.com/youtube/answer/9054257?sjid=17634594109886838039-NA\">หลักเกณฑ์ชุมชนของแพลตฟอร์ม</a> บนโปรไฟล์ช่องของครีเอเตอร์ บริเวณใกล้ ๆ กับปุ่ม subscribe โดยจะเริ่มเปิดตัวฟีเจอร์ดังกล่าวตั้งแต่วันที่ 23 ส.ค</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ca5cf4b91d80a0805295a87ca57edb2e.png\" /></p>\n<p>นอกจากนี้ YouTube ยังเตรียมเปิดตัวฟีเจอร์ลิงก์ที่จะเชื่อมโยง Shorts ไปยังวิดีโอเต็มบน YouTube ได้อย่างปลอดภัย ภายในเดือนกันยายน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4a1e485e79de8b7f0232b36ba4b0b40a.png\" /></p>\n<p>ที่มา : <a href=\"https://support.google.com/youtube/thread/229722002\">YouTube</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/youtube\">YouTube</a></div><div><a href=\"/topics/spam\">Spam</a></div></div></div>","author":"ydk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cb559355775c9b75ddd2ad88043cf8f1ab8bb474ccd956b564b1c02d36ffcd62","category":"Thai"}