{"title":"Elevated NET, Calprotectin and Neopterin Levels Discriminate between Disease Activity of COVID-19 as Evidenced by Need of Hospitalization for Patients in Northern Italy","link":"https://www.preprints.org/manuscript/202403.0705/v1","date":1710247090000,"content":"Coronavirus disease 2019 (COVID-19) displays clinical heterogeneity, but little information is available for patients with mild or very early disease. We aimed to characterize biomarkers that are useful in discriminating the hospitalization risk in a COVID-19 cohort from Northern Italy during the first pandemic wave.\nWe enrolled and followed for four weeks 76 symptomatic SARS-CoV-2 positive patients and age/sex-matched healthy controls. Patients with mild disease were discharged (n.42), and the remaining were hospitalized (n.34). Blood was collected before any anti-inflammatory/immunosuppressive therapy and assessed for soluble C5b-9/C5a, H3-neutrophil extracellular traps (NET), calprotectin, DNase plasma levels by ELISA, and a panel of pro-inflammatory cytokines by ELLA.\nCalprotectin and NET levels discriminate between hospitalized and non-hospitalized patients, while DNase negatively correlates with NET levels; there are positive correlations between calprotectin and both NET and neopterin levels. Neopterin levels increase in patients at the beginning of the disease and more in hospitalized than non-hospitalized ones. C5a and sC5b-9, and other acute phase proteins correlate with neopterin, calprotectin, and DNase. Both NET and neopterin levels negatively correlate with platelet count.\nWe show that calprotectin, NET, and neopterin are important proinflammatory parameters potentially useful in discriminating between COVID-19 patients at risk for hospitalization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cb59409ef332db9a3fef725b2f54a9da9a02d48e79dd4054487104d63e4e1683","category":"Interdisciplinary"}