{"title":"Therapeutic Effect of Oral Diet Training in Indwelling Nasogastric Tube Patients with Prolonged Dysphagia","link":"https://www.preprints.org/manuscript/202406.1411/v1","date":1718881827000,"content":"Background\nPatients with severe dysphagia are usually fed using a nasogastric tube (NGT). Many patients who receive long-term NGT feeding are unable to obtain sufficient nutrients orally immediately after NGT removal. Thus, a transitional period involving oral diet training is required to transition from NGT feeding to exclusive oral feeding. We aimed to investigate the therapeutic effect of oral diet training in indwelling NGT patients with prolonged dysphagia.\n\nMethods\nA total of 175 patients who were fed using an NGT for more than 4 weeks were enrolled. Their swallowing function was evaluated by a videofluoroscopic swallowing study (VFSS).\nDuring the VFSS, patients received thick and thin barium while the NGT was insulted. Then, the patients underwent a VFSS without an NGT thirty minutes after NGT removal. If a patient had no aspiration with NGT inserted during the VFSS, oral diet training combined with NGT feeding was recommended. \n\nResults\nOf the 49 indwelling NGT patients who were recommended to receive oral diet training, 39 (79.6%) transitioned to exclusive oral feeding. A transition period of 2-8 weeks was required for them to achieve full oral feeding. Patients who were eligible for oral feeding trials showed no significant aspiration during the VFSS with an NGT inserted and had sufficient cough function. Patients who required prolonged NGT feeding and who could not complete oral trials showed significant aspiration during the VFSS when an NGT was inserted.  \n\nConclusion\nThis study demonstrated that oral diet training combined with NGT feeding was safe in patients with prolonged dysphagia who had sufficient cough function and no aspiration during VFSS. We suggest that if the patient is a proper candidate for NGT removal, direct oral feeding training with an NGT inserted could be a useful therapeutic strategy during the transitional period from long-term NGT feeding to successful oral feeding.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cb5dc63d81ddb9838709365b2ead20f8d9f281e5236a73b485af172fe722fae5","category":"Interdisciplinary"}