{"title":"Long-sought universal flu vaccine: mRNA-based candidate enters clinical trial","link":"https://arstechnica.com/?p=1939739","date":1684279579000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/11/3D_Influenza_purple_no_key_full_lrg-800x793.jpg\" alt=\"Graphical depiction of a virus.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/11/3D_Influenza_purple_no_key_full_lrg.jpg\">Enlarge</a> <span>/</span> The flu virus, showing the H and N proteins on its surface. (credit: <a href=\"https://www.cdc.gov/flu/images.htm\">CDC</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An mRNA-based flu vaccine designed to offer long-lasting protection against a broad range of influenza viruses is now in a phase I clinical trial, <a href=\"https://www.nih.gov/news-events/news-releases/clinical-trial-mrna-universal-influenza-vaccine-candidate-begins\">the National Institutes of Health announced this week</a>.</p>\n<p>The trial brings the remarkable success of the mRNA vaccine platform to the long-standing efforts to develop a universal flu vaccine. Currently, health systems around the globe <a href=\"https://arstechnica.com/science/2017/12/this-years-flu-season-is-upon-us-and-it-looks-bad-heres-what-you-should-know/\">battle the seasonal scourge</a> with shots that have to be reformulated each year to match circulating strains. This reformulation happens months before typical transmission, providing manufacturers time to produce doses at scale but also giving the strain in circulation chances to shift unexpectedly. If the year's shot is a poor match for the strains that circulate in a given season, efficacy against infection can be abysmal. Still, even when the shot is well-matched, people will need another shot next year.</p>\n<p>\"A universal influenza vaccine would be a major public health achievement and could eliminate the need for both annual development of seasonal influenza vaccines, as well as the need for patients to get a flu shot each year,\" Hugh Auchincloss, acting director of the NIH's National Institute of Allergy and Infectious Diseases, said in a news release. \"Moreover, some strains of influenza virus have significant pandemic potential. A universal flu vaccine could serve as an important line of defense against the spread of a future flu pandemic.\"</p></div><p><a href=\"https://arstechnica.com/?p=1939739#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939739&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb6c54d56c8f564b626b25b900c8ceedc8766a80c6e43395e1cb482a2132d75c","category":"Tech"}