{"title":"Systematic characterization of all <i>Toxoplasma gondii</i> TBC domain-containing proteins identifies an essential regulator of Rab2 in the secretory pathway","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002634","date":1715090400000,"content":"<p>by Justin J. Quan, Lachezar A. Nikolov, Jihui Sha, James A. Wohlschlegel, Isabelle Coppens, Peter J. Bradley</p>\r\n\r\n<i>Toxoplasma gondii</i> resides in its intracellular niche by employing a series of specialized secretory organelles that play roles in invasion, host cell manipulation, and parasite replication. Rab GTPases are major regulators of the parasite’s secretory traffic that function as nucleotide-dependent molecular switches to control vesicle trafficking. While many of the Rab proteins have been characterized in <i>T</i>. <i>gondii</i>, precisely how these Rabs are regulated remains poorly understood. To better understand the parasite’s secretory traffic, we investigated the entire family of Tre2-Bub2-Cdc16 (TBC) domain-containing proteins, which are known to be involved in vesicle fusion and secretory protein trafficking. We first determined the localization of all 18 TBC domain-containing proteins to discrete regions of the secretory pathway or other vesicles in the parasite. Second, we use an auxin-inducible degron approach to demonstrate that the protozoan-specific TgTBC9 protein, which localizes to the endoplasmic reticulum (ER), is essential for parasite survival. Knockdown of TgTBC9 results in parasite growth arrest and affects the organization of the ER and mitochondrial morphology. TgTBC9 knockdown also results in the formation of large lipid droplets (LDs) and multi-membranous structures surrounded by ER membranes, further indicating a disruption of ER functions. We show that the conserved dual-finger active site in the TBC domain of the protein is critical for its GTPase-activating protein (GAP) function and that the <i>Plasmodium falciparum</i> orthologue of TgTBC9 can rescue the lethal knockdown. We additionally show by immunoprecipitation and yeast 2 hybrid analyses that TgTBC9 preferentially binds Rab2, indicating that the TBC9-Rab2 pair controls ER morphology and vesicular trafficking in the parasite. Together, these studies identify the first essential TBC protein described in any protozoan and provide new insight into intracellular vesicle trafficking in <i>T</i>. <i>gondii</i>.","author":"Justin J. Quan","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"cb6e52b11834dd69d3696a179f832dd830cae666b447a93e6cd01e48111d6ebc","category":"Environment"}