{"title":"Multi-Decision-Making Criteria Approach for Choosing Trenchless Construction and Renewal Method: A Comprehensive Review","link":"https://www.preprints.org/manuscript/202408.1828/v1","date":1724664615000,"content":"Trenchless technologies are utilized for installing new pipes or repairing and replacing old ones, categorized into construction and rehabilitation/replacement methods. With rapid urbanization, new pipe networks must be established in proportion to population growth. Additionally, due to issues like corrosion and aging, a significant portion of storm sewers, waste sewers, gas, and water pipes need annual replacement or rehabilitation. Traditional open-cut methods are no longer viable due to traffic disruption, safety concerns, environmental impacts, and high costs. Trenchless construction methods address these issues effectively. Construction trenchless methods include horizontal earth boring (no worker entry), pipe jacking, and utility tunneling (worker entry). Horizontal earth boring is further divided into horizontal auger boring, horizontal directional drilling, pipe ramming, microtunneling, pilot tube microtunneling, and compaction methods. The first part of the current study reviews and discusses the design criteria for horizontal auger boring, horizontal directional drilling, pipe jacking, pipe ramming, and microtunneling. Based on these unique project requirements, the optimal trenchless technology can be proposed. In the second part of the research, a hierarchical algorithm is proposed, based on literature concepts, to serve as a decision-making tool for selecting the optimal trenchless construction method. Sometimes, multiple methods may be proposed, with the best one chosen based on equipment availability, skilled teams, budget, and sustainability principles. Although trenchless renewal methods are not the focus of this study, their design criteria are provided in the appendices to offer a comprehensive collection of design requirements for all trenchless technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cb71e9b2a3a0661470dc518da6e0cfa70983e0ad331ce2c5fce319fec27edd20","category":"Interdisciplinary"}