{"title":"In situ Electron Energy Loss Spectroscopy (EELS) Studies of Laser-induced Graphene Oxide Reduction in a Dynamic Transmission Electron Microscope (DTEM)","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.817/7720051?rss=1","date":1721779200000,"content":"<span>Graphene is a single layer of sp<sup>2</sup> hybridized carbon atoms and is widely applied in electronics, photonics, and energy-based industries because of its exceptional physical and chemical properties [<a href=\"#ozae044.817-B1\">1</a>]. Graphene-based materials for large-scale production can be obtained from graphene oxide (GO) through effective treatments to reduce the number of oxygen functional groups. GO conversion to reduced GO (rGO) can be done by many methods, including wet chemical reduction, thermal reduction, and photoreduction. Chemical reduction of GO requires hydrazine, sodium borohydride, and other potent reducing agents, limiting this method’s applicability in large-scale production [<a href=\"#ozae044.817-B2\">2</a>]. Further, graphene is a potential candidate for biomedical applications, including drug delivery, cancer therapy, and antimicrobials, but chemically reduced GO has shown potential toxicity to normal cells [<a href=\"#ozae044.817-B3\">3</a>]. Similarly, thermal heating requires temperatures exceeding 1000 °C and complex procedures for the high-quality production of graphene [<a href=\"#ozae044.817-B4\">4</a>]. Photoreduction of GO with a laser is fast and avoids the use of toxic chemicals. Furthermore, the ability to pattern the illumination and raster the target in the beam allows the capability to write rGO circuits in films of GO. To prepare high-quality graphene requires understanding the detailed photoreduction mechanism.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"cb71f679855b6ae81a136aae9f49311a5b1d9bcf6610a0d3834bc4ecf2cd340a","category":"Environment"}