{"title":"Announcing the latest AWS Heroes – August 2021","link":"https://aws.amazon.com/blogs/aws/announcing-the-latest-aws-heroes-august-2021/","date":1630002492000,"content":"<p><a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\">AWS Heroes</a> go above and beyond to share knowledge with the community and help others build better and faster on AWS. Last month we launched the <a href=\"https://aws.amazon.com/developer/community/heroes/content-library/\" target=\"_blank\">AWS Heroes Content Library</a>, a centralized place where Builders can find inspiration and learn from AWS Hero authored educational content including blogs, videos, slide presentations, podcasts, open source projects, and more. As technical communities evolve new Heroes continue to emerge, and each quarter we recognize an outstanding group of individuals from around the world whose impact on community knowledge-sharing is significant and greatly appreciated.</p> \n<p>Today we are pleased to introduce the newest AWS Heroes, including the first Heroes based in Cameroon and Malaysia:</p> \n<h2>Denis Astahov – Vancouver, Canada</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/denis-astahov/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/denis-astahov.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/denis-astahov/\" target=\"_blank\">Denis Astahov</a> is a Solutions Architect at OpsGuru, where he automates and develops various cloud solutions with Infrastructure as Code using Terraform. Denis owns the YouTube channel ADV-IT, where he teaches people about a variety of IT and especially DevOps topics, including AWS, Terraform, Kubernetes, Ansible, Jenkins, Git, Linux, Python, and many others. His channel has more than 70,000 subscribers and over 7,000,000 views, making it one of the most popular free sources for AWS and DevOps knowledge in the Russian speaking community. Denis has more than 10 cloud certifications, including 7 AWS Certifications.</p> \n<h2>Ivonne Roberts – Tampa, USA</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/ivonne-roberts/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/ivonne-roberts.jpg\" /></a>Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/ivonne-roberts/\" target=\"_blank\">Ivonne Roberts</a> is a Principal Software Engineer with over fifteen years of software development experience, including ten years working with AWS and more than five years building serverless applications. In recent years, Ivonne has begun sharing that industry knowledge with the greater software engineering community. On her blog ivonneroberts.com and her YouTube channel Serverless DevWidgets, Ivonne focuses on demystifying and removing the hurdles of adopting serverless architecture and on simplifying the software development lifecycle.</p> \n<h2>Kaushik Mohanraj – Kuala Lumpur, Malaysia</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/kaushik-mohanraj/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/kaushik-mohanraj.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/kaushik-mohanraj/\" target=\"_blank\">Kaushik Mohanraj</a> is a Director at Blazeclan Technologies, Malaysia. An avid cloud practitioner, Kaushik has experience in the evaluation of well-architected solutions and is an ambassador for cloud technologies and digital transformation. Kaushik holds 10 active AWS Certifications, which help him to provide relevant and optimal solutions. Kaushik is keen to build a community he thrives in and hence joined AWS User Group Malaysia as a co-organizer in 2019. He is also the co-director of Women in Big Data – Malaysia Chapter, with an aim to build and provide a platform for women in technology.</p> \n<h2>Luc van Donkersgoed – Utrecht, The Netherlands</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/luc-van-donkersgoed/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/luc-van-donkersgoed.jpg\" /></a>DevTools Hero <a href=\"https://aws.amazon.com/developer/community/heroes/luc-van-donkersgoed/\" target=\"_blank\">Luc van Donkersgoed</a> is a geek at heart, solutions architect, software developer, and entrepreneur. He is fascinated by bleeding edge technology. When he is not designing and building powerful applications on AWS, you can probably find Luc sharing knowledge in blogs, articles, videos, conferences, training sessions, and Twitter. He has authored a 16-session AWS Solutions Architect Professional course, presented on various topics including how the AWS CDK will enable a new generation of serverless developers, appeared on the AWS Developers Podcast, and he maintains the AWS Blogs Twitter Bot.</p> \n<h2>Rick Hwang – Taipei City, Taiwan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/rick-hwang/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/rick-hwang.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/rick-hwang/\" target=\"_blank\">Rick Hwang</a> is a cloud and infrastructure architect at 91APP in Taiwan. His passion to educate developers has been demonstrated both internally as an annual AWS training project leader, and externally as a community owner of SRE Taiwan. Rick started SRE Taiwan on his own and has recruited over 3,600 members over the past 4 years via peer-to-peer interactions, constantly sharing content, and hosting annual study group meetups. Rick enjoys helping people increase their understanding of AWS and the cloud in general.</p> \n<h2>Rosius Ndimofor – Douala, Cameroon</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/rosius-ndimofor/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/23/rosius-ndimofor.jpg\" /></a>Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/rosius-ndimofor/\" target=\"_blank\">Rosius Ndimofor</a> is a software developer at Serverless Guru. He has been building desktop, web, and mobile apps for various customers for 8 years. In 2020, Rosius was introduced to AWS by his friend, was immediately hooked, and started learning as much as he could about building AWS serverless applications. You can find Rosius speaking at local monthly AWS meetup events, or his forte: building serverless web or mobile applications and documenting the entire process on his blog.</p> \n<h2>Setia Budi – Bandung, Indonesia</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/setia-budi/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/19/setia-budi.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/setia-budi/\" target=\"_blank\">Setia Budi</a> is an academic from Indonesia. He runs a YouTube channel named Indonesia Belajar, which provides learning materials related to computer science and cloud computing (delivered in Indonesian language). His passion for the AWS community is also expressed by delivering talks in AWS DevAx Connect, and he is actively building a range of learning materials related to AWS services, and streaming weekly live sessions featuring experts from AWS to talk about cloud computing.</p> \n<h2>Vinicius Caridá – São Paulo, Brazil</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/vinicius-carida/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/20/vinicius-carida.jpg\" /></a>Machine Learning Hero <a href=\"https://aws.amazon.com/developer/community/heroes/vinicius-carida/\" target=\"_blank\">Vinicius Caridá (Vini)</a> is a Computer Engineer who believes tech, data, &amp; AI can impact people for a fairer and more evolved world. He loves to share his knowledge on AI, NLP, and MLOps on social media, on his YouTube channel, and at various meetups such as AWS User Group São Paulo where he is a community leader. Vini is also a community leader at TensorFlow São Paulo, an open source machine learning framework. He regularly participates in conferences and writes articles for different audiences (academic, scientific, technical), and different maturity levels (beginner, intermediate, and advanced).</p> \n<p> </p> \n<p> </p> \n<p> </p> \n<p> </p> \n<p>If you’d like to learn more about the new Heroes, or connect with a Hero near you, please visit the <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\"> AWS Heroes website</a> or browse the <a href=\"https://aws.amazon.com/developer/community/heroes/content-library/\" target=\"_blank\">AWS Heroes Content Library</a>.</p> \n<p>— <a href=\"https://twitter.com/rossbarich\" target=\"_blank\">Ross</a>;</p>","author":"Ross Barich","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"cb7798579fa6d3a5d8b85e715b4ebbfdcd4f28869ccefdf1b69a526a30fcf1be","category":"Tech"}