{"title":"Apple Pencil Executives Discuss New Hover Features in iPadOS 16.4","link":"https://www.macrumors.com/2023/03/27/ipados-16-4-apple-pencil-hover/","date":1679949648000,"content":"With <a href=\"https://www.macrumors.com/2023/03/27/apple-releases-ios-16-4/\">iPadOS 16.4</a>, Apple added new functionality to the <a href=\"https://www.macrumors.com/2022/10/18/m2-ipad-pro-hover-mode-apple-pencil/\">Apple Pencil hover</a> function, introducing tilt and azimuth support. The updated hover feature is designed to allow artists to view a mark at any angle before it's actually made, making the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> more useful than ever for drawing.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2018/11/apple-pencil-hover-mode.jpg\" alt width=\"1500\" height=\"844\" />\r<br />\nApple Director of Input Experience Leslie Ikemoto and Apple Director of Platform Product Marketing Stephen Tonna spoke with <em><a href=\"https://techcrunch.com/2023/03/27/apple-discusses-ipados-16-4s-new-pencil-hover-features/\">TechCrunch</a></em> about the hover update. Using Procreate as an example, Ikemoto said that users can now see exactly where a mark will appear when the <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a> is set on the display.<blockquote>\"If you look at Procreate, they have the pencil brush, which is small and thin when you're perpendicular to the display. With Tilt and Azimuth, Procreate can render an exact outline of the mark that you're going to make when you set down your pencil brush, and that's a huge accelerator for their users.</blockquote>Tonna said that Apple is \"always listening to customer feedback\" and also \"building things our customers didn't even think of.\" The ‌Apple Pencil‌ team also uses what it builds, participating in \"Inktober\" every October. All of the team will draw and paint during the month, even those without notable artistic skill.\r<br />\n\r<br />\nThe new hover functionality works in native Apple features like Markup, as well as in third-party apps like Procreate. \"We wanted hover to be as easy to adapt as possible,\" said Ikemoto, which is why hover was designed to use APIs that had already been used for the Magic Keyboard Trackpad. This allows hover to work automatically for any app that already supported UI pointer interaction, with further refinement possible through the UI hover gesture recognizer.\r<br />\n\r<br />\nFor those unfamiliar with hover, it is an <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> exclusive feature. It allows an ‌Apple Pencil‌ 2 to be held up to 12 millimeters above the ‌M2‌ ‌iPad Pro‌ for a more seamless transition when stopping and starting on a digital canvas.\r<br />\n\r<br />\nMore information about Apple's perspective on hover can be found in <em><a href=\"https://techcrunch.com/2023/03/27/apple-discusses-ipados-16-4s-new-pencil-hover-features/\">TechCrunch</a></em>'s full interview.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a>, <a href=\"https://www.macrumors.com/roundup/ipados-16/\">iPadOS 16</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-16.238\">iOS 16</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/27/ipados-16-4-apple-pencil-hover/\">Apple Pencil Executives Discuss New Hover Features in iPadOS 16.4</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-pencil-executives-discuss-new-hover-features-in-ipados-16-4.2384996/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cb799603bcf1124abc9f3459e5356d522abc6a6c47f9f2e6cb80c46d6b4da253","category":"Apple"}