{"title":"Rover’s pictures show long history of rivers flowing into Martian crater","link":"https://arstechnica.com/?p=1802494","date":1633719067000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/pia24485-4-1041-800x599.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/pia24485-4-1041.jpg\">Enlarge</a> <span>/</span> The rocks of Kodiak Butte record a lot of the history of Jezero Crater. (credit: <a href=\"https://www.nasa.gov/image-feature/perseverance-view-of-the-delta-in-jezero-crater\">NASA/JPL-Caltech/ASU/MSSS</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Normally, it takes some time for NASA's Mars rovers to return scientific data. The instruments need to be calibrated and commissioned, and the rover needs to move off the landing site toward a piece of landscape with clear scientific interest. In the case of the Perseverance rover, there was an added delay as it <a href=\"https://arstechnica.com/science/2021/04/nasa-says-its-mars-helicopter-is-ready-for-a-historic-first-flight/\">tested out the Ingenuity drone</a> over the course of several weeks.</p>\n<p>But this week brought a pleasant surprise: The first research paper from Perseverance was published in Science. It turns out that some of the early photographs from the rover revealed features in some near-vertical rock walls some distance from the landing site—details that tell us about the history of the flow of water into Jezero Crater.</p>\n<h2>Mars meets Kodiak</h2>\n<p>The Jezero Crater was chosen as Perseverance's landing site because images taken from orbit indicate it once hosted a lake. The photos revealed an exit channel that allowed water to flow through a gap in the crater walls and a site where rivers flowed in to feed the lake. There was also what appeared to be a river delta spreading into the crater from these sites. The rover's mission profile includes sampling material from that delta, which might once have been an inviting environment for life and would have collected any living material that existed upstream.</p></div><p><a href=\"https://arstechnica.com/?p=1802494#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802494&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb80e2fccbe4e1481ca31660731e1b1ed144ee5d81a1565d215758e44191d355","category":"Tech"}