{"title":"High overcommitment and low reward as potential predictors for increased depressive symptoms, suicidal ideation, and suicide risk in German veterinarians","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310819","date":1727186400000,"content":"<p>by Kathrin Angelika Schwerdtfeger, Heide Glaesmer, Mahtab Bahramsoltani</p>\r\n\r\nHigher rates of depression, suicidal ideation and suicide risk have been reported for veterinarians in Germany. In this study, several demographic and job-related factors were examined to determine whether they could be considered possible predictors of depression, suicidal ideation, and suicide risk. For this purpose, a survey was conducted among veterinarians in Germany. The demographic factors surveyed were gender, age, working status (employed/self-employed), income, field of work (practicing/non-practicing veterinarian), weekly working hours and community size. For assessing job-related factors, the Effort-Reward-Imbalance questionnaire (effort, reward, overcommitment), several subscales of the Copenhagen Psychosocial Questionnaire (quantitative demands, emotional demands, demands for hiding emotions, meaning of work, work-privacy-conflict, thoughts of leaving the job) and the Copenhagen Burnout Inventory were used. A hierarchical logistic regression analysis was performed with the demographic and job-related factors as independent variables and depressive symptoms, suicidal ideation, and suicide risk as dependent variables, respectively. A total of 3.118 veterinarians (78.8% female) between 22 and 69 years (mean age 41.3 years) were included in the study. The factors used resulted in the highest variance explanation for depressive symptoms (57%), followed by suicidal ideation (34%) and suicide risk (23%). Low reward and high overcommitment were found to be the most important predictors of depressive symptoms, suicidal ideation, and suicide risk. Significant relationships with depressive symptoms, suicidal ideation, and suicide risk were also found for burnout, demands for hiding emotions, and thoughts of leaving the job. The results of this study point to opportunities for changes in the veterinary working environment, for the development of prevention and intervention programs for veterinarians, and for the further development of the veterinary curriculum to strengthen the mental health of veterinarians in Germany.","author":"Kathrin Angelika Schwerdtfeger","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cb8c2e1658e8f8b58754335d8b7507739e81475086c6101bfd6f891a160c6005","category":"Interdisciplinary"}