{"title":"Back to reality: COP28 calls for getting fossil fuels out of energy","link":"https://arstechnica.com/?p=1990834","date":1702494087000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1851686936-800x534.jpg\" alt=\"Image of a man wearing traditional clothing gesturing while speaking at a podium.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1851686936.jpg\">Enlarge</a> <span>/</span> Sultan Ahmed Al Jaber defied expectations to deliver a document that explicitly calls for limits on fossil fuel use. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/sultan-ahmed-al-jaber-president-of-the-unfccc-cop28-climate-news-photo/1851686936\">Fadel Dawod</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday, the UN's COP28 meeting wrapped up with a major success: Despite a <a href=\"https://arstechnica.com/tech-policy/2023/12/opec-members-keep-climate-accords-from-acknowledging-reality/\">bruising fight with OPEC nations</a>, the closing agreement included a call for a transition away from fossil fuels. There's still plenty here for various parties to dislike, but this is the first agreement that makes the implications of the Paris Treaty explicit: We can't limit climate change and continue to burn fossil fuels at anything close to the rate we currently do.</p>\n<p>Beyond that, however, the report has something to disappoint everyone. It catalogs strong signs of incremental progress toward the Paris goals while acknowledging we're running out of time for further increments. And the steps it calls for will likely keep changes on a similar trajectory.</p>\n<h2>Taking stock</h2>\n<p>The <a href=\"https://unfccc.int/sites/default/files/resource/cma2023_L17_adv.pdf\">new document</a> is called a \"Global Stocktake\" in reference to checking the world's progress toward the goals of the Paris Agreement: limit climate change to 2° C above preindustrial temperatures and try to keep it to 1.5° C. That agreement called for nations to make pledges to limit greenhouse gas emissions; initial pledges were insufficient, but regular meetings of the Conference of the Parties (COP) would allow the pledges to be updated, raising their aggressiveness until the world is on a trajectory toward meeting its goals.</p></div><p><a href=\"https://arstechnica.com/?p=1990834#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990834&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb902b8cfd91973bf915280357a8efa3401483645a6dc484d4897de0b6c08891","category":"Tech"}