{"title":"Phospholipids, Sphingolipids, and Cholesterol-Derived Lipid Mediators and Their Role in Neurological Disorders","link":"https://www.preprints.org/manuscript/202408.0294/v1","date":1722848552000,"content":"Neural membranes are composed of phospholipids, sphingolipids, cholesterol and proteins. In re-sponse to cell stimulation or injury, metabolism of lipids generates various lipid mediators, which perform many cellular functions.  Thus, phospholipids release arachidonic acid or docosahex-aenoic acid from the sn-2 position of glycerol moiety by the action of phospholipases A2.  Ara-chidonic acid is a precursor for prostaglandins, leukotrienes, thromboxane, and lipoxins. Among these mediators, prostaglandins, leukotrienes, and thromboxane produce neuroinflammation. In contrast, lipoxins produce anti-inflammatory and pro-resolving effects. Prostaglandins, leukotri-enes, and thromboxane are also involved in cell proliferation, differentiation, and blood clotting, and blood vessel permeability. In contrast, DHA-derived lipid mediators are called as specialized pro-resolving lipid metabolites (SPMs). They include resolvins, protectins, and maresins. These mediators regulate immune function by producing anti-inflammatory, pro-resolving, and cell pro-tective effects. Sphingolipid derived-metabolites are ceramide, ceramide1-phosphate, sphingosine, and sphingosine 1 phosphate. They regulate many cellular processes including enzyme activities, cell migration and adhesion, inflammation, and immunity. Cholesterol is metabolized into hy-droxycholesterols and 7-ketocholesterol, which not only disrupts membrane fluidity, but also promotes inflammation, oxidative stress, and apoptosis. These processes lead to cellular damage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cba07f593867ae0ce66f8084f70642e619ad67317f172114e42f3bc5a4ca948b","category":"Interdisciplinary"}