{"title":"On closer inspection: Reviewing the debate on whether fish cooperate to inspect predators","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13427?af=R","date":1709810886000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d2f1b4c9-569c-458d-85f0-566c93d229ed/eth13427-toc-0001-m.png\" alt=\"On closer inspection: Reviewing the debate on whether fish cooperate to inspect predators\" />\n<p>Schematic representation of a typical coordinated predator inspection event. The numbers show order (left-to-right and top to bottom). The larger fish in the top left corner of each panel represents a potential predator, the smaller fish represent prey fish. Fish silhouettes designs from PhyloPic.</p>\n<br />\n<h2>Abstract</h2>\n<p>Cooperative behaviours, which benefit a recipient, are widespread in the animal kingdom; yet their evolution is not straightforward. Reciprocity, i.e., cooperating with previously experienced cooperative partners, has been suggested to underly cooperation, but has been contested throughout the years. Once a textbook example of reciprocity was cooperative predator inspection, where one or several individuals leave their group to approach a potential threat. Each can at any point stop or retreat, increasing the risk for its partner. It was suggested that inspecting individuals follow a specific reciprocal strategy called tit-for-tat, i.e., cooperating on the first move and then copying the partner's last move. Numerous studies provide evidence to support the claim that fish cooperate to inspect predators, including three-spined sticklebacks (<i>Gasterosteus aculeatus</i>), guppies (<i>Poecilia reticulata</i>) and minnows (<i>Phoxinus phoxinus</i>). However, over the past few decades some scholars have expressed scepticism whether predator inspection is indeed a cooperative behaviour or rather a case of by-product mutualism, which describes behaviours that benefit a partner as a corollary of an otherwise selfish behaviour. For instance, it has been shown that pairs of fish moving in unfamiliar environments appear to coordinate movements even in the absence of predators. Many studies have also used coarse measures of overall approach rates towards predators rather than the fine-grained analyses necessary to infer tit-for-tat in cooperative inspections. Now is the time to return to the question of cooperative predator inspection with new tools and approaches to resolve a decades-old debate.</p>","author":"A. Li Veiros, \nManon K. Schweinfurth, \nMichael M. Webster","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"cba2c6c404f8b8c2ae7a903efefea668dac2feb09a5eee5ed53ccc88b718543c","category":"Environment"}