{"title":"Factors influencing physical activity and sedentary behaviour in contact centres during the COVID-19 pandemic and their relevance for the future of hybrid working","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312473","date":1729692000000,"content":"<p>by Jillian Manner, Divya Sivaramakrishnan, Graham Baker, Scott Lloyd, Ruth Jepson</p>\r\nBackground <p>The COVID-19 pandemic changed the way many industries work, including contact centres, with some employees working from home and new on-site restrictions/measures in place representing even greater challenges for employers around staff engagement and wellbeing. This study aimed to understand the interplay of individual, social, environmental and organisational factors influencing physical activity and sedentary behaviour in UK contact centre employees, how the pandemic impacted these factors, and their relevance for the future of hybrid working.</p> Methods <p>Individual interviews (n = 33) were conducted with participants (staff working full and part time, on site and from home) from four UK contact centres. A topic guide based on the ecological model was developed to understand current barriers and facilitators to physical activity and (reducing) sedentary behaviour during and outside of working hours. Thematic analysis was carried out using a codebook and a deductive coding approach to identify themes.</p> Results <p>Three key insights are provided. First, participants felt they were generally sitting more and moving less since the first UK-wide lockdown. Second, factors which negatively impacted on these behaviours were evident across all levels of the ecological model. These included individual and social barriers (e.g., lack of motivation and preferable physical activity options) as well as environmental and organisational barriers (e.g., poor home office setup, back-to-back virtual meetings). There were a mix of new and existing barriers (exacerbated by the pandemic) and several of these were linked to homeworking. Third, organisational support requirements (e.g., homeworking ergonomic support) and existing facilitators (such as the provision of informational support and flexible working arrangements) were identified.</p> Conclusion <p>Solutions to reduce sedentary behaviours and increase physical activity in contact centres need to address barriers from the individual to the organisational level. Whilst the study was undertaken in the UK, the results are like to be applicable globally.</p> Trial registration <p>Clinical trial registration: The trial for the wider project has been registered on the ISRCTN database: http://www.isrctn.com/ISRCTN11580369.</p>","author":"Jillian Manner","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cba268dedbce9650a5b2b258619b5080861bef76ff66fd68beda1c863fcd75f6","category":"Interdisciplinary"}