{"title":"Assessment of Neurotoxic Mechanisms of Individual and Binary Mixtures of Cobalt, Nickel and Lead in Hippocampal Neuronal Cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24418?af=R","date":1728046176000,"content":"<h2>ABSTRACT</h2>\n<p>Many studies have focused on the neurotoxic effects of single metals, while investigation on the exposure to metal mixtures, which mainly occur in real-life situations, is scarce. This study sought to assess the neurotoxic effect of Ni, Co, and Pb binary mixtures and their individual effects in hippocampal neuronal cells (HT-22). Cells were exposed to Ni, Co, and Pb separately for 48 h at 37°C and 5% CO<sub>2</sub>, and cell viability was assessed. Morphological assessment of the cells exposed to binary mixtures of Co, Ni, and Pb and single metals was assessed using a microscope. Furthermore, acetylcholinesterase (AChE) activity, oxidative stress biomarkers (glutathione [GSH] and malondialdehyde [MDA] levels, catalase [CAT], and glutathione-S transferase [GST] activities) and nitric oxide [NO] levels were evaluated after treatment with the binary mixtures and single metals. Binary mixtures of the metals reduced cell viability, exerting an additivity action. The combinations also exerted synergistic action, as revealed by the combination index. Furthermore, a significant reduction in AChE activity, GSH levels, CAT and GST activities, and high MDA and NO levels were observed in neuronal cells. The additive interactions and synergistic actions of the binary mixtures might contribute to the significant reduction of AChE activity, GSH levels, GST, and CAT activities, and an increase in MDA and NO levels. The findings from this study revealed significant evidence that binary mixtures of Co, Pb, and Ni may induce impaired neuronal function and, ultimately, neurodegeneration.</p>","author":"Tosin A. Olasehinde, \nAdemola O. Olaniran","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"cbaeda426d9c7e0e4fd9d720c959eac05f971c379fe17101a04d460aca2d0bc5","category":"Environment"}