{"title":"Circular economy strategy for the valorization of fly ash as a substitute for cement in monoliths (resistance and reactivity evaluation)","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14319?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>Fly ash is currently a problem in different companies, mainly in thermoelectric plants, which must follow a production and consumption model that involves reusing, renewing, and recycling, thus contributing to the circular economy. This work aims to evaluate the reactivity and compressive strength of different types of ashes in concrete monoliths. For this purpose, sugarcane bagasse (SCBA), bituminous coal (BC), and untreated hazardous waste (RUD) were evaluated as replacements for cement. Monoliths and mortars have been manufactured in different mixtures, taken to a curing room, and their compressive strength and reactivity have been determined at different times (up to 28 days for the monoliths and up to 90 for the mortars), mainly in order to check the formation of calcium silicate hydrate (CSH) gels. In the monolith tests, the best performances have been with SCBA and BC, which have been used for the manufacture of the mortars. On day 56, the behavior of the replacement of 30% fly ash (15% BC:15% SCBA) presents a type H mortar behavior, with better results than the control. By day 90, all replacements had the same resistance as M mortars and even higher resistances than the control. This demonstrates the feasibility of its use in the production of Portland cement for the manufacture of low-performance inputs. This implies the possible reduction of impacts, both in waste disposal sites and in emissions caused by the construction industry, thus contributing to the circular economy.</p>","author":"Luisa F. Morales, \nKatherine Herrera, \nJulián E. López, \nRoberto Aguado, \nJuan F. Saldarriaga","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"cbb3ffa8c6a943cbaaadb0e3dd614fd5935464563489c08764baf0801199c2cc","category":"Environment"}