{"title":"Transvaginal Natural Orifice Transluminal Endoscopic Surgery (vNOTES) for Early-Stage Ovarian Cancer and Borderline Ovarian Tumors: A Case Series","link":"https://www.preprints.org/manuscript/202410.0987/v1","date":1728901091000,"content":"Surgical approaches for ovarian cancer have advanced significantly in recent years. Transvaginal natural orifice transluminal endoscopic surgery (vNOTES) is an emerging technique in gyneco-logical oncology, with limited reports of its use in ovarian cancer management. This study aimed to evaluate the feasibility and safety of vNOTES for the surgical staging of early-stage adnexal malignancies. Methods: We retrospectively reviewed all cases of borderline ovarian tumors (BOTs) and early-stage ovarian cancer surgically staged using vNOTES at our institution between October 2021 and August 2024. Results: Eleven patients were included, 7 with ear-ly-stage ovarian or tubal cancer and 4 with BOTs. The median age was 47 (27 – 81) years, and the median body mass index was 28.1 (22.4 – 39.2) Kg/m². Complete vNOTES staging was achieved in all cases, including peritoneal washing, unilateral/bilateral salpingo-oophorectomy, ab-dominal cavity inspection, peritoneal biopsies, infracolic omentectomy, and total hysterectomy when required. The median operating time was 70 (35 – 138) minutes, with a median blood loss of 50 (10 – 100) mL. No intraoperative complications occurred except for one case of minor ovar-ian spillage. No conversions to laparoscopy or laparotomy were needed. Postoperative compli-cations included one surgical site infection (9.1%) and two cases of postoperative cystitis (18.2%). No severe complications graded ≥3 on the Clavien-Dindo classification were observed. Conclu-sion: vNOTES appears to be a feasible and safe approach for the surgical staging of selected pa-tients with early stage adnexal malignancies. Further studies are needed to validate its long-term safety and oncological outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cbb31e2d2acf59fe974bc5cb8759a2eaca6638e6abed24ebdfe6fa932bcee853","category":"Interdisciplinary"}