{"title":"Amazon Managed Grafana Is Now Generally Available with Many New Features","link":"https://aws.amazon.com/blogs/aws/amazon-managed-grafana-is-now-generally-available-with-many-new-features/","date":1630459026000,"content":"<p>In December, we <a href=\"https://aws.amazon.com/blogs/aws/announcing-amazon-managed-grafana-service-in-preview/\">introduced the preview</a> of <a href=\"https://aws.amazon.com/grafana/\">Amazon Managed Grafana</a>, a fully managed service <a href=\"https://grafana.com/blog/2020/12/15/announcing-amazon-managed-service-for-grafana/\">developed in collaboration with Grafana Labs</a> that makes it easy to use the open-source and the enterprise versions of <a href=\"https://grafana.com/\">Grafana</a> to visualize and analyze your data from multiple sources. With Amazon Managed Grafana, you can analyze your metrics, logs, and traces without having to provision servers, or configure and update software.</p> \n<p>During the preview, Amazon Managed Grafana was <a href=\"https://aws.amazon.com/blogs/mt/amazon-managed-service-for-grafana-amg-preview-updated-with-new-capabilities/\">updated with new capabilities</a>. Today, I am happy to announce that Amazon Managed Grafana is now <strong>generally available</strong> with additional new features:</p> \n<ul> \n <li>Grafana has been <a href=\"https://grafana.com/docs/grafana/latest/whatsnew/whats-new-in-v8-0/\">upgraded to version 8</a> and offers new data sources, visualizations, and features, including library panels that you can build once and re-use on multiple dashboards, a Prometheus metrics browser to quickly find and query metrics, and new state timeline and status history visualizations.</li> \n <li>To centralize the querying of additional data sources within an Amazon Managed Grafana workspace, you can now query data using the <a href=\"https://grafana.com/grafana/plugins/simpod-json-datasource/\">JSON data source plugin</a>. You can now also query <a href=\"https://redis.io/\">Redis</a>, <a href=\"https://www.sap.com/products/hana.html\">SAP HANA</a>, <a href=\"https://www.salesforce.com/\">Salesforce</a>, <a href=\"https://www.servicenow.com/\">ServiceNow</a>, <a href=\"https://www.atlassian.com/software/jira\">Atlassian Jira</a>, and many more data sources.</li> \n <li>You can use <a href=\"https://docs.aws.amazon.com/grafana/latest/userguide/Using-Grafana-APIs.html\">Grafana API keys</a> to publish your own dashboards or give programmatic access to your Grafana workspace. For example, this is a <a href=\"https://aws-observability.github.io/aws-o11y-recipes/recipes/amg-automation-tf/\">Terraform recipe</a> that you can use to add data sources and dashboards.</li> \n <li>You can enable single sign-on to your Amazon Managed Grafana workspaces using <a href=\"https://en.wikipedia.org/wiki/SAML_2.0\">Security Assertion Markup Language 2.0 (SAML 2.0)</a>. We have worked with these identity providers (IdP) to have them integrated at launch: <a href=\"https://www.cyberark.com/\">CyberArk</a>, <a href=\"https://www.okta.com/\">Okta</a>, <a href=\"https://www.onelogin.com/\">OneLogin</a>, <a href=\"https://www.pingidentity.com/\">Ping Identity</a>, and <a href=\"https://azure.microsoft.com/en-us/services/active-directory/\">Azure Active Directory</a>.</li> \n <li>All calls from the Amazon Managed Grafana console and code calls to Amazon Managed Grafana API operations are captured by <a href=\"https://aws.amazon.com/cloudtrail/\">AWS CloudTrail</a>. In this way, you can have a record of actions taken in Amazon Managed Grafana by a user, role, or AWS service. Additionally, you can now audit mutating changes that occur in your Amazon Managed Grafana workspace, such as when a dashboard is deleted or data source permissions are changed.</li> \n <li>The service is available in ten <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regions_az/#Regions\">AWS Regions</a> (full list at the end of the post).</li> \n</ul> \n<p>Let’s do a quick walkthrough to see how this works in practice.</p> \n<p><span><strong>Using Amazon Managed Grafana<br /> </strong></span>In the <a href=\"https://console.aws.amazon.com/grafana/home\">Amazon Managed Grafana console</a>, I choose <strong>Create workspace</strong>. A workspace is a logically isolated, highly available Grafana server. I enter a name and a description for the workspace, and then choose <strong>Next</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-create-workspace.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-create-workspace-1024x567.png\" /></a></p> \n<p>I can use <a href=\"https://aws.amazon.com/single-sign-on/\">AWS Single Sign-On (AWS SSO)</a> or an external identity provider via SAML to authenticate the users of my workspace. For simplicity, I select AWS SSO. Later in the post, I’ll show how SAML authentication works. If this is your first time using AWS SSO, you can see <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/prereqs.html\">the prerequisites (such as having AWS Organizations set up) in the documentation</a>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/05/amg-auth.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/05/amg-auth-1024x670.png\" /></a></p> \n<p>Then, I choose the <strong>Service managed</strong> permission type. In this way, Amazon Managed Grafana will automatically provision the necessary IAM permissions to access the AWS Services that I select in the next step.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-permission-type.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-permission-type-1024x346.png\" /></a></p> \n<p>In <strong>Service managed permission settings</strong>, I choose to monitor resources in my current AWS account. If you use <a href=\"https://aws.amazon.com/organizations/\">AWS Organizations</a> to centrally manage your AWS environment, you can use Grafana to monitor resources in your <a href=\"https://docs.aws.amazon.com/organizations/latest/userguide/orgs_manage_ous.html\">organizational units (OUs)</a>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-permission-access.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-permission-access-1024x339.png\" /></a></p> \n<p>I can optionally select the AWS data sources that I am planning to use. This configuration creates an <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> role that enables Amazon Managed Grafana to access those resources in my account. Later, in the Grafana console, I can set up the selected services as data sources. For now, I select <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> so that I can quickly visualize <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/working_with_metrics.html\">CloudWatch metrics</a> in my Grafana dashboards.</p> \n<p>Here I also configure permissions to use <a href=\"https://aws.amazon.com/prometheus/\">Amazon Managed Service for Prometheus (AMP)</a> as a data source and have a fully managed monitoring solution for my applications. For example, I can collect Prometheus metrics from <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (EKS)</a> and <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a> environments, using <a href=\"https://aws.amazon.com/otel/\">AWS Distro for OpenTelemetry</a> or <a href=\"https://prometheus.io/\">Prometheus</a> servers as collection agents.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/18/amg-permission-aws-data-sources.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/18/amg-permission-aws-data-sources-1024x829.png\" /></a></p> \n<p>In this step I also select <a href=\"https://aws.amazon.com/sns/\">Amazon Simple Notification Service (SNS)</a> as a notification channel. Similar to the data sources before, this option gives Amazon Managed Grafana access to SNS but does not set up the notification channel. I can do that later in the Grafana console. Specifically, this setting adds SNS publish permissions to topics that start with <code>grafana</code> to the IAM role created by the Amazon Managed Grafana console. If you prefer to have tighter control on permissions for SNS or any data source, you can edit the role in the IAM console or use customer-managed permissions for your workspace.</p> \n<p>Finally, I review all the options and create the workspace.</p> \n<p>After a few minutes, the workspace is ready, and I find the <strong>workspace URL</strong> that I can use to access the Grafana console.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-workspace-summary.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-workspace-summary-1024x301.png\" /></a></p> \n<p>I need to assign at least one user or group to the Grafana workspace to be able to access the workspace URL. I choose <strong>Assign new user or group</strong> and then select one of my AWS SSO users.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-sso-auth.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-sso-auth-1024x289.png\" /></a></p> \n<p>By default, the user is assigned a <strong>Viewer</strong> user type and has view-only access to the workspace. To give this user permissions to create and manage dashboards and alerts, I select the user and then choose <strong>Make admin</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-sso-admin.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-sso-admin-1024x400.png\" /></a></p> \n<p>Back to the workspace summary, I follow the workspace URL and sign in using my AWS SSO user credentials. I am now using the open-source version of Grafana. If you are a Grafana user, everything is familiar. For my first configurations, I will focus on AWS data sources so I choose the AWS logo on the left vertical bar.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-data-sources.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-aws-data-sources-1024x512.png\" /></a></p> \n<p>Here, I choose CloudWatch. Permissions are already set because I selected CloudWatch in the service-managed permission settings earlier. I select the default AWS Region and add the data source. I choose the CloudWatch data source and on the <strong>Dashboards</strong> tab, I find a few dashboards for AWS services such as <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a>, <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (EBS)</a>, <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>, <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (RDS)</a>, and <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html\">CloudWatch Logs</a>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-cloudwatch-dashboards.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-cloudwatch-dashboards-1024x379.png\" /></a></p> \n<p>I import the AWS Lambda dashboard. I can now use Grafana to monitor invocations, errors, and throttles for Lambda functions in my account. I’ll save you the screenshot because I don’t have any interesting data in this Region.</p> \n<p><span><strong>Using SAML Authentication<br /> </strong></span>If I don’t have AWS SSO enabled, I can authenticate users to the Amazon Managed Grafana workspace using an external identity provider (IdP) by selecting the SAML authentication option when I create the workspace. For existing workspaces, I can choose <strong>Setup SAML configuration</strong> in the workspace summary.</p> \n<p>First, I have to provide the workspace ID and URL information to my IdP in order to generate IdP metadata for configuring this workspace.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-idp.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-idp-1024x254.png\" /></a></p> \n<p>After my IdP is configured, I import the IdP metadata by specifying a URL or copying and pasting to the editor.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-import-metadata.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-import-metadata-1024x252.png\" /></a></p> \n<p>Finally, I can map user permissions in my IdP to Grafana user permissions, such as specifying which users will have Administrator, Editor, and Viewer permissions in my Amazon Managed Grafana workspace.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-assertion-mapping.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/03/amg-saml-assertion-mapping-1024x383.png\" /></a></p> \n<p><strong><span>Availability and Pricing</span><br /> </strong><a href=\"https://aws.amazon.com/grafana/\">Amazon Managed Grafana</a> is available today in ten AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Ireland), Europe (Frankfurt), Europe (London), Asia Pacific (Singapore), Asia Pacific (Tokyo), Asia Pacific (Sydney), and Asia Pacific (Seoul). For more information, see the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Regional Services List</a>.</p> \n<p>With Amazon Managed Grafana, you pay for the active users per workspace each month. Grafana API keys used to publish dashboards are billed as an API user license per workspace each month. You can upgrade to Grafana Enterprise to have access to enterprise plugins, support, and on-demand training directly from Grafana Labs. For more information, <a href=\"https://aws.amazon.com/grafana/pricing/\">see the Amazon Managed Grafana pricing page</a>.</p> \n<p><strong><a href=\"https://amazon.webex.com/webappng/sites/amazon/meeting/info/d66eaebcfa2c4f448e72c583ca8dcef2?isPopupRegisterView=true\">To learn more, you are invited to this webinar on Thursday, September 9 at 9:00 am PDT / 12:00 pm EDT / 6:00 pm CEST.</a></strong></p> \n<p><strong><a href=\"https://aws.amazon.com/grafana/\">Start using Amazon Managed Grafana today to visualize and analyze your operational data at any scale.</a></strong></p> \n<p>— <a href=\"https://twitter.com/danilop\">Danilo</a></p>","author":"Danilo Poccia","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"cbc7cf39f7f0e6fff7f192c32b3906f914c99572477464a6d1950d259e3dcf57","category":"Tech"}