{"title":"iOS 17 Health App: What's New","link":"https://www.macrumors.com/guide/ios-17-health/","date":1692226609000,"content":"Apple with <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> added new features to the Health app, introducing a mood logging function, tools for maintaining eye health, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iOS-17-Health-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nThis guide highlights all of the features that are new in the Health app in ‌iOS 17‌.\r<br />\n\r<br />\n<h2>Mood Tracking</h2>\r<br />\nWith ‌iOS 17‌, Apple added a \"State of Mind\" feature to the Health app. This option is designed to allow you to track your emotions on a daily basis, to get an overall picture of mental wellbeing.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/ios-17-beta-6-mood-tracking.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThrough Health app notifications or the Apple Watch, you can log your mood at different times throughout the day and input an overall mood for the day.\r<br />\n\r<br />\nLogging a mood presents a slider bar with options ranging from Very Unpleasant to Neutral to Pleasant. The options are color coded (very unpleasant is purple, neutral is blue, and very pleasant is orange), and the idea is to drag the slider to the closest representation of your current mood.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/ios-17-mood-tracking.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nFrom there, Apple asks you what best describes the feeling, and presents a list of adjectives related to the mood that you can select from. The \"Very Pleasant\" mood, for example, has options like Amazed, Peaceful, Joyful, and Calm. The \"Very Unpleasant\" mood includes Angry, Sad, Drained, and Stressed, while Neutral moods include Peaceful, Indifferent, and Content.\r<br />\n\r<br />\nYou cannot input your own adjective, and must use one of the suggestions from Apple. There are a few dozen total options, so the idea is just to choose the closest match.\r<br />\n\r<br />\nAfter you've selected a mood and an accompanying adjective for it, Apple asks what's causing the mood. Options include health, fitness, family, friends, partner, dating, weather, money, and current events, but again, you have to choose from Apple's list. You can, however, add context in this section, so you can write down details on why you've chosen a specific category.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/log-mood-animations.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nYour mood over time can be viewed on a chart with breakdowns for the week, month, six months, or a year. States, Associations, and Life Factors can all be tapped into so you can see contributing factors to what has influenced how you feel.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/health-app-mental-wellbeing.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nYou can see what's causing issues or making you happy with a list of every entry broken down by association, the category that includes factors like work and relationships.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/watchos-10-mood-logging.jpg\" alt width=\"1962\" height=\"1104\" />\r<br />\nApple also logs life factors to show you patterns on actions that can influence your mood. Life factors include exercise minutes, mindfulness minutes, sleep, and time spent in daylight. Apple directly compares mood over time to exercise over time and other listed factors, so you can figure out if spending time working out or meditating has an impact on overall mood.\r<br />\n\r<br />\n<h3>Mental Health Questionnaires</h3>\r<br />\nThe Mental Wellbeing section of the Health app includes health questionnaires that screen for anxiety and depression so you can talk to your doctor if needed. These are screening tools typically used by doctors, and they ask questions related to how you have been feeling over the course of the last few weeks.\r<br />\n\r<br />\nTaking these questionnaires populates anxiety and depression risk charts so you can see at a glance if you might need more self care or the help of a doctor at different periods throughout the year. Filling out the questionnaires will give you Anxiety Risk and Depression Risk readings.\r<br />\n\r<br />\n<h2>Eye Health</h2>\r<br />\nApple in ‌iOS 17‌ is adding new tools for improving eye health, most of which are aimed at children, but can be used by anyone. In Screen Time, there's a new \"Screen Distance\" setting that is meant to reduce eye strain by making sure an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> is not held too close to the face.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/ios-17-screen-distance.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nIf the ‌iPhone‌ or ‌iPad‌ is too close, an alert will let you (or your child) know that the display needs to be further away. Apple recommends a viewing distance of 12 inches for the eyes, and offers a position guide to help users know where to hold the device for optimal viewing without eye strain.\r<br />\n\r<br />\n<h2>Time in Daylight</h2>\r<br />\nThe Apple Watch can measure the amount of time that is spent in daylight, and this is another feature aimed at children. There are studies that suggest spending 80 to 120 minutes outdoors can lower the risk of nearsightedness or myopia, and so paired with an Apple Watch running <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, the Health app is able to tell you how much time was spent in the daylight.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/time-in-daylight-ios-17.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nApple says that daylight is also useful for adults as spending 20 minutes outdoors has physical and mental health benefits. Time spent in daylight is one of the metrics that Apple uses for tracking Mental Wellbeing.\r<br />\n\r<br />\n<h2>Medications</h2>\r<br />\nApple added Follow Up Reminders for Medications that you track using the Health app. If you don't log a medication within 30 minutes after you receive an official notification, you can opt into getting a second notification so you don't miss taking your medication.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Health-App-Medication-Follow-Up-Reminders.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nFurther, Critical Alerts can be enabled, and these will appear on the screen and play a sound even if a Focus mode is enabled or a device is muted.\r<br />\n\r<br />\n<h2>Health App for iPad</h2>\r<br />\nThe Health app has been limited to the ‌iPhone‌ since it was introduced, but with <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a>, it's also available on the ‌iPad‌. The ‌iPad‌ isn't collecting Health data, but it can display all of the information collected by the ‌iPhone‌ and other accessories on a bigger display.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/ipados-17-health-app.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nIt essentially shows you all of the same information that's available on the ‌iPhone‌ app, but it's sized for the ‌iPad‌ and has a navigation bar on the left side of the display.\r<br />\n\r<br />\n<h2>Design</h2>\r<br />\nApple has tweaked the design of the Health app. Sections like Heart, Medications, Sleep, Mobility, and more have their own background colors to add more visual interest to the data that the app presents.\r<br />\n\r<br />\nMuch of the Health app look is the same, but there have been small updates to colors and other tiny changes that refine the look.\r<br />\n\r<br />\n<h2>Read More</h2>\r<br />\nMore information on all of the new features in the ‌iOS 17‌ update can be <a href=\"https://www.macrumors.com/roundup/ios-17/\">found in our iOS 17 roundup</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-17-health/\">iOS 17 Health App: What's New</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-health-app-whats-new.2398842/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cbd9403460c5e5a3293f646bdf0557ec24c074021163082463261114dd458470","category":"Apple"}