{"title":"HashiTalks 2021 Highlights: Terraform","link":"https://www.hashicorp.com/blog/hashitalks-2021-highlights-terraform","date":1619625600000,"content":"<p>For our final HashiTalks 2021 highlights blog, we're showcasing HashiCorp Terraform talks — our largest group of talks. If you've been following our highlights series, we've already published our videos covering HashiCorp <a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-boundary-packer-vagrant-and-waypoint\">Vagrant, Packer, Boundary, Waypoint</a>, <a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-nomad-and-consul\">Nomad, Consul</a>, and <a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-vault\">Vault</a>.</p>\n<p>To recap: this was our largest number of HashiTalks ever. We received so many high-quality submissions this year that we decided to increase the length of the virtual livestream from 24 hours to 48 hours. More than 10,000 people watched at some point during our 2 days of livestreaming.</p>\n<p>We're humbled by the amount of high-quality technical content produced by our community, and we hope you benefit from their extensive knowledge.\nYou can find all of our session videos and sort by product in our newly redesigned <a href=\"https://www.hashicorp.com/resources\">HashiCorp Resource Library</a>. That’s also where you'll find related GitHub repositories and slides for some of the videos. You can also check out the  <a href=\"https://www.youtube.com/watch?v=Ot0OFdARYw0&amp;list=PL81sUbsFNc5ZfswcAV3KS0WFQmAYULkbq\">HashiTalks 2021 YouTube playlist</a> for an unsorted complete list of HashiTalks.</p>\n<h2><a href=\"#hashicorp-terraform\">»</a><a></a>HashiCorp Terraform</h2>\n<p><strong><a href=\"http://www.hashicorp.com/resources/cdk-for-terraform-deploying-infrastructure-resources-imperative-programming-languages\">CDK for Terraform: Deploying Infrastructure Resources Using Imperative Programming Languages\n</a></strong></p>\n<p>Torsten Stiller explores the possibilities of <a href=\"https://github.com/hashicorp/terraform-cdk\">CDK for Terraform</a> — which can convert TypeScript, Python, C#, and Java into Terraform configuration — through an example Azure application.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/the-state-of-infrastructure-drift-what-we-learned-from-100-devops-teams\">The State of Infrastructure Drift: What We Learned From 100+ DevOps Teams\n</a></strong></p>\n<p>Stephane Jourdan of CloudSkiff shares the results of 50+ interviews and 150+ survey responses from DevOps teams on the state of their infrastructure drift.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/dont-afraid-csi-how-critical-techworks-orchestrates-stateful-apps-hashicorp-nomad\">Don't be Afraid of CSI: How Critical TechWorks Orchestrates Stateful Apps with Nomad\n</a></strong></p>\n<p>José Maia and Carlos Cunha showcase how they used a Container Storage Interface (CSI)-based process and HashiCorp Nomad to orchestrate stateful applications. They work at Critical TechWorks, a BMW company.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/how-secure-are-your-sensitive-values-in-terraform-common-pitfalls-of-scale-factory-clients\">How Secure are Your Sensitive Values in Terraform? Common Pitfalls of Scale Factory's Clients\n</a></strong></p>\n<p>Marko Bevc of Scale Factory shares the do's and don'ts of securing sensitive values in your DevSecOps pipeline via HashiCorp Terraform and Vault, using real-world feedback from Scale Factory clients.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/deploying-terraform-enterprise-in-a-highly-secure-environment-at-morgan-stanley\">Deploying Terraform Enterprise in a Highly Secure Environment at Morgan Stanley\n</a></strong></p>\n<p>Itay Cohai and Travis Smith explain how Morgan Stanley overcame multiple challenges when installing HashiCorp Terraform and complying with strict security restrictions.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/ephemeral-cloud-infrastructure-acceptance-tests-terraform-enterprise-vault-pluralsight\">Ephemeral Cloud Infrastructure for Acceptance Tests at Pluralsight with Terraform Enterprise &amp; Vault\n</a></strong></p>\n<p>Wes Novack describes how Pluralsight uses HashiCorp Vault and Terraform Enterprise in various compute environments.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/testing-your-hcl-modules-in-terraform\">Testing your HCL Modules in Terraform\n</a></strong></p>\n<p>Gareth Brown demos a small Python test fixture to verify HCL module logic that deploys to Google App Engine, Google Cloud Run, and Kubernetes.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/layered-governance-for-your-infrastructure-with-kubernetes-opa-and-terraform\">Layered Governance for Your Infrastructure with Kubernetes, OPA, and Terraform\n</a></strong></p>\n<p>Taylor Dolezal demonstrates using the Open Policy Agent (OPA), Terraform, and Flux in a declarative fashion in order to build a policy as code pipeline.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/database-administration-cloud-native-terraform-tumelo\">Database Administration in a Cloud Native World with Terraform at Tumelo\n</a></strong></p>\n<p>Ben King shares examples of database management tools in the cloud native space, including Terraform.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/terraforming-jupyter-dask-quansight-how-get-cloud-data-science-platform-cheap\">Terraforming Jupyter and Dask at Quansight: How to Get Your Own Cloud Data Science Platform on the Cheap\n</a></strong></p>\n<p>Chris Ostrouchov builds a scalable data science platform by combining HashiCorp Terraform, Helm, and GitHub Actions.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/how-remote-work-driving-need-multi-cloud-devsecops-how-build-pipeline\">How Remote Work is Driving the Need for Multi-Cloud DevSecOps: How to Build a Pipeline\n</a></strong></p>\n<p>Mike Fraser introduces the concept of infrastructure as code scanning tools and demos a DevSecOps pipeline using Terraform.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/automating-cis-foundations-benchmark-aws\">Automating the CIS Foundations Benchmark for AWS\n</a></strong></p>\n<p>Evan Gertis describes how you can build compliance policies in Terraform that certify your infrastructure against standards like the Center for Internet Security (CIS) benchmarks.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/pluralith-developing-a-way-to-visualize-state\">Pluralith: Developing a Proper Way to Visualize State\n</a></strong></p>\n<p>Daniel Putzer shows off his project, Pluralith, which visualizes changes to Terraform's infrastructure state in a graph based on state files.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/how-terraform-behavior-driven-development-help-shift-security-left\">How Terraform and Behavior-Driven Development Help Shift Security Left\n</a></strong></p>\n<p>Josh Armitage shows you how to bring behavior-driven development (BDD) to your Terraform process, helping you shift-left with security in the process.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/repotting-overgrown-terraform-repositories\">Re-potting Overgrown Terraform Repositories\n</a></strong></p>\n<p>Kristin Smith helps you learn how to split or merge sprawling Terraform repositories using demo examples.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/orchestration-to-delivery-integrating-gitlab-with-hashicorp-terraform-packer-vaul\">Orchestration to Delivery: Integrating GitLab with HashiCorp Terraform, Packer, Vault, Consul, and Waypoint\n</a></strong></p>\n<p>Abubakar Siddiq Ango explains how you can integrate most of the HashiCorp products into GitLab pipelines.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/security-and-the-language-of-intent-policy-as-code-with-terraform\">Security and the Language of Intent: Policy as Code with Terraform\n</a></strong></p>\n<p>Tracy Holmes discusses why the language of security for infrastructure is often lost in translation and how policy as code can help.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/integration-unit-testing-terraform-nomad\">Integration and Unit Testing on Terraform and Nomad\n</a></strong></p>\n<p>Thiago Nache Carvalho teaches the pain points of creating unit tests for HashiCorp Terraform resources in Nomad jobs and namespaces, and explains how to solve them.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/automating-failure-disaster-recovery-testing-terraform-gremlin\">Automating for Failure: Disaster Recovery Testing with Terraform &amp; Gremlin\n</a></strong></p>\n<p>Samson Olufuwa and Olubusayo Amowe address how to set up a backup/disaster recovery (DR) process using HashiCorp Terraform and then automate the DR testing process using Terraform and Gremlin.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/credential-free-cloud-provisioning-with-terraform-cloud-agent\">Credential-Free Cloud Provisioning with Terraform Cloud Agent\n</a></strong></p>\n<p>Andy Assareh shows why you no longer need to place cloud credentials in your Terraform workspaces with the new Terraform Agents feature.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/a10-hashicorp-network-infrastructure-automation-consul-terraform-sync\">A10 &amp; HashiCorp Network Infrastructure Automation with Consul-Terraform-Sync\n</a></strong></p>\n<p>Rishi Sampat explains how A10 built internal and external solutions with Consul-Terraform-Sync.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/production-ready-infrastructure-devops-workflows-in-5-minutes-with-terraform-gitl\">Production-Ready Infrastructure + DevOps Workflows in 5 Minutes with Terraform + GitLab\n</a></strong></p>\n<p>Darby Frey, Sri Rangan, and Abubakar Siddiq Ango present their \"Five Minute Production\" demo, which quickly builds production-ready infrastructure and workflows using HashiCorp Terraform and GitLab pipelines</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/blank-apply-destroying-without-terraform-configuration\">Blank Apply: Destroying Without Terraform Configuration\n</a></strong></p>\n<p>Sunil Chopra reveals a solution to some of the tricky situations where you need to destroy infrastructure quickly in Terraform.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/building-reliability-kubernetes-using-chaos-experiments-terraform\">Building Reliability into Kubernetes Using Chaos Experiments with Terraform\n</a></strong></p>\n<p>Yury Yineth Niño Roa, and Jhonnatan Gil Chaves share their experiences improving the reliability in Kubernetes infrastructures using chaos experiments.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/proper-terraform-authentication-for-azure-deployments\">Proper Terraform Authentication for Azure Deployments\n</a></strong></p>\n<p>Peter De Tender gives several demos on how to run Terraform deployments for different authenticated session options in Microsoft Azure.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/how-to-write-modern-terraform-provider-tools-patterns\">How to Write a Modern Terraform Provider: Tools and Patterns\n</a></strong></p>\n<p>Cyrus Javan gives a tour through the major features of the Terraform Provider SDK and teaches common provider-building patterns and practices.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/optimizing-terraform-integration-inside-gitlab-ci-cd-pipelines\">Optimizing Terraform Integration Inside GitLab CI/CD Pipelines\n</a></strong></p>\n<p>Niels Peto and Nicolas Pepinster showcase the AWS stack used at their financial institution to manage state in open source Terraform in a GitLab CI/CD pipeline.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/deploying-cicd-infrastructure-terraform-packer\">Deploying CI/CD Infrastructure with Terraform and Packer\n</a></strong></p>\n<p>Vincent Brison shows how he deploys a dynamic pool of self-hosted runners on Google Cloud using Terraform, Packer, and GitHub Actions.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/terraform-modules-providers-check-your-source\">Terraform Modules &amp; Providers: Check Your Source\n</a></strong></p>\n<p>Jay Wallace shares some security best practices when using non-verified Terraform providers from the community.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/developing-terraform-modules-at-scale\">Developing Terraform Modules at Scale</a></strong></p>\n<p>Tom Straub teaches the processes and patterns for writing high-quality Terraform modules for use in a large organization.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/how-build-usable-terraform-provider-20-hours\">How to Build a Usable Terraform Provider in 20 Hours\n</a></strong></p>\n<p>Robert Ross will share the wisdom he gained on his hack sessions to show how you can get a working Terraform provider up and running in 20 hours.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/hashicorp-terraform-structure-enablement\">HashiCorp Terraform Structure &amp; Enablement\n</a></strong></p>\n<p>Lachlan White walks through the transition from Terraform open source to Terraform Enterprise or Terraform Cloud through the lens of \"structures\".</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/data-transformations-resources-pattern-terraform\">The 'Data, Transformations, and Resources' Pattern in Terraform\n</a></strong></p>\n<p>Robert Blumen explores a Terraform pattern that is data-driven, avoids repetition, is easy to change, and separates data from resources.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/building-datalakes-international-bank-hashicorp-terraform\">Building Data Lakes for an International Bank with HashiCorp Terraform\n</a></strong></p>\n<p>Peter Gergely Marczis shares a use case about an international bank's global data lake rollout, which involved changes to the company's IT environment with Terraform at the core.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/curating-twitter-feed-christmas-pets-edition\">Curating the Best Twitter Feed: Christmas Pets Edition\n</a></strong></p>\n<p>Grace Nguyen shares the story of how she automated infrastructure with Terraform to create a website for Christmas-themed pets on Twitter.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/from-training-serving-machine-learning-models-terraform\">From Training to Serving: Machine Learning Models with Terraform\n</a></strong></p>\n<p>Jeff Zemerick and David Smithbauer showcase a Terraform-managed AWS architecture that trains and evaluates natural language processing (NLP) models.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/terraforming-data-analytics-environments-databricks\">Terraforming Data Analytics Environments with Databricks\n</a></strong></p>\n<p>Marcelo Zambrana explains how to build a data analytics environment using HashiCorp Terraform and the new Databricks resource provider.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/terraform-drift-detection-reporting\">Terraform Drift Detection and Reporting\n</a></strong></p>\n<p>Michael Simo discusses how to plan multiple Terraform projects and get a concise report via the CLI tool, clairvoyance.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/hashistack-loopback-how-does-hashicorp-use-the-hashistack\">HashiStack Loopback: How Does HashiCorp Use the HashiStack?\n</a></strong></p>\n<p>Jeffrey Hogan of the HashiCorp Engineering Services group shares how his team uses each of the HashiCorp products in their tool stack.</p>\n<p><strong><a href=\"http://www.hashicorp.com/resources/secure-your-terraform-deploys-in-gitlab-ci-with-hashicorp-vault\">Secure Your Terraform Deploys in GitLab-CI with HashiCorp Vault\n</a></strong></p>\n<p>Mehdi Laruelle provides a demo showing how you can secure credentials in a Terraform and GitLab-CI workflow using Vault.</p>\n<h2><a href=\"#more-hashitalks-highlights\">»</a><a></a>More HashiTalks Highlights</h2>\n<p>The Terraform roundup is our last HashiTalks highlights blog for 2021. To check out our previous highlights posts, visit:</p>\n<ul>\n<li><a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-boundary-packer-vagrant-and-waypoint\">HashiTalks 2021 Highlights: Vagrant, Packer, Boundary, and Waypoint</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-nomad-and-consul\">HashiTalks 2021 Highlights: Nomad and Consul</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/hashitalks-2021-highlights-vault\">HashiTalks 2021 Highlights: Vault</a></li>\n</ul>\n<p>You can also watch all of our videos on YouTube by visiting our <a href=\"https://www.youtube.com/watch?v=Ot0OFdARYw0&amp;list=PL81sUbsFNc5ZfswcAV3KS0WFQmAYULkbq\">HashiTalks 2021 playlist</a>.</p>","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"cbd97d88d44361e9a28d7ebf7a5559c76b90c7712f242b9ca6890771dfeab885","category":"Tech"}