{"title":"PSLBII-28 Effects of dietary protein manipulation on greenhouse gases and ammonia emissions from feedlot beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/663/7757855?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Black Angus steers [n = 112; body weight (BW) = 401 ± 3.6 kg] were used in a randomized incomplete block design to evaluate the effects of 3 rumen available protein to microbial crude protein ratios (RAP:MCP) on growth performance, and gaseous emissions from feedlot steers. Steers were blocked by initial BW and randomly assigned to 1 of 3 treatment rations. Diets were fed rations either Deficient (-150 gּ animal<sup>-1</sup>ּ d<sup>-1</sup>; DEF), Balanced (0 gּ animal<sup>-1</sup>ּ d<sup>-1</sup>; BAL), or Excess (+150 gּ animal<sup>-1</sup>ּ d<sup>-1</sup>; EXS) in RAP: MCP. Steers were allocated and housed in cattle pen enclosures (CPE), and treatment diets were delivered daily as a total mixed ration. The present study consisted of two 42-d periods. Refusals were collected weekly and BW every 14 d. Gas measurements were obtained daily in sequential order from all CPE. Data were analyzed with R statistical software (4.2.3). The linear mixed effect model procedure within the “lme4” package was used with CPE as the experimental unit, treatment and week as fixed effects, and block and period as random effects. A contrast coefficient matrix was constructed to test for linear and quadratic effects. Initial, intermediary and final BW were not different for steers receiving the varying RAP:MCP (<span>P</span> ≥ 0.239). A treatment effect (<span>P</span> = 0.004) was observed for mean dry matter intake (DMI) where EXS steers consumed 0.46 kg more DM compared with BAL steers, but DEF steers had similar DMI to those fed EXS and BAL (<span>P</span> = 0.189). Average daily gain (ADG) was only affected by treatment (<span>P</span> = 0.007) on d 0 to 14 where steers receiving DEF gained 0.6 kg more than those fed BAL (<span>P</span> = 0.010), but those fed EXS had similar ADG. Similar to ADG, gain to feed (G:F) was affected by treatment (<span>P</span> = 0.012) only during d 0 to 14. Mean CH<sub>4</sub> production from steers fed DEF and EXS were 20% and 13% greater (<span>P</span> = 0.010) compared with those fed BAL, respectively; however, CH<sub>4</sub> from EXS vs. DEF steers was not different (<span>P</span> = 0.149). Mean cumulative NH<sub>3</sub> emissions increased linearly by treatment with EXS steers emitting up to 52% more NH<sub>3</sub> compared with those receiving DEF (<span>P</span> &lt; 0.001). Similarly, EXS steers had increased SO<sub>2</sub> emissions by up to 44% compared with those fed DEF (<span>P</span> &lt; 0.001). Emissions of CO<sub>2</sub>, N<sub>2</sub>O, and H<sub>2</sub>S were similar (<span>P</span> &gt; 0.100). The manipulation of RAP:MCP in the diets of feedlot steers can drastically reduce NH<sub>3</sub> emissions without affecting growth performance and may be a valuable tool to reduce air pollution from beef production systems.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"cbe3bddd56e9e709152a2446ba06c07011d76f56525b95d6221895d1ab5446d3","category":"Environment"}