{"title":"SRAM Rival AXS Power Meter: Hands-on and First Rides","link":"https://www.dcrainmaker.com/2021/04/sram-rival-axs-power-meter-hands-on-and-first-rides.html","date":1618496724000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4104.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4104_thumb.jpg\" /></a></p>\n<p>In the world of cycling drivetrain gear, both SRAM and Shimano have three core pricing tiers for their wares. In Shimano’s case that’s Dura Ace, Ultegra, and 105. While in SRAM’s case it’s RED, Force, and Rival. These companies release their best and fanciest stuff at the top end, and then roughly every 1-2 years it trickles down to the next level, and so on. Rinse and repeat for decades.</p>\n<p>Today, SRAM trickled down the eTAP AXS to their ‘budget’ range – Rival. This marks the first time that SRAM Rival has seen wireless shifting, but also the final layer of that three-layer chip dip to become fully wireless. It also marks the end of mechanical shifting for Rival, as well as marking the beginning of disc-brake only offerings, as Rival won’t come in a rim-brake version.</p>\n<p>But perhaps more interestingly for some readers here, it introduces an entirely new type of power meter for Quarq, SRAM’s power meter brand: The Rival AXS power meter. Unlike past Quarq spider based systems, this spindle-based system is more akin in functionality to a left-only single-sided power meter. Essentially, you swap out your left crank arm plus the spindle, which includes the power meter inside of it.</p>\n<p>Now I’ll circle back with a full review of the SRAM Rival eTAP AXS gear after a bit more riding, but I figured I’d explain the power meter for now.</p>\n<h3><span>Rival AXS Power Meter:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4063.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4063_thumb.jpg\" /></a></p>\n<p>To begin, let’s look at some quick specs, and then we’ll take a closer inspection of the unit:</p>\n<p>Claimed Accuracy: +/- 3% (but it’s actually +/- 1.5% doubled)<br />\nMeasurement point: Spindle<br />\nDual-sided: No, left-leg power only<br />\nAdded weight: ~40g<br />\nProtocols: ANT+ &amp; Bluetooth Smart<br />\nZero offset supported: Yes<br />\nBattery type: AAA Lithium<br />\nBattery Duration: 400 hours<br />\nWaterproofing: IPX7 (thus 30-minutes at 1-meter deep)<br />\nPricing: $249 for upgrade kit, or $349 for complete crankset including chainrings</p>\n<p>Now the key thing there is that it’s a left-only power meter – all spindle based power meters are, like the ROTOR inPower, because they’re effectively only measuring the torque from the left on the non-drive side. That below with the hole, is the spindle, that piece that connects your two crank arms together:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4120.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4120_thumb.jpg\" /></a></p>\n<p>This is different than the rest of Quarq’s power meters, which are spider based and measure total power (but can vaguely estimate left/right balance). Then of course there’s dual-sided power meters, like the <a href=\"https://www.dcrainmaker.com/2019/04/sram-acquires-powertap-what-it-means-for-both-brands-and-consumers.html\">PowerTap power meter pedals that Quarq acquired</a>, and <a href=\"https://www.dcrainmaker.com/2021/02/tech-tidbits-garmin-gps-offsets-again-and-powertap-units-discontinued.html\">recently discontinued</a>.</p>\n<p>Ultimately, the Rival AXS power meter from a power composition standpoint is similar to a left-only Stages of 4iiii unit (or any other single-sided company). They take that power and simply double it. So, if your power balance is roughly equal, it’ll roughly work out. Whereas if its skewed lower or higher, that skew would be exaggerated when doubled. But more on that later.</p>\n<p>The entire point of the Rival AXS power meter is that it can be installed on any Rival AXS equipped bike, theoretically easily. From a bike shop standpoint, that’s certainly true. Though, from an end-consumer standpoint, swapping out a spindle and a crank arm (and first detaching the drive-side crankset) is hardly 1-minute type work. Here’s what the upgrade kit looks like (sorry, I haven’t disassembled the test bike yet, for reasons that’ll become obvious in the next section):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-16.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-15.png\" /></a></p>\n<p>The left-arm (non-drive side) has a small battery compartment in it, which holds the AAA battery. You can untwist the cap to access it. That battery pod then plugs in to the far side (drive-side) of the spindle internally. If I shine a flashlight down there I can see the connector.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4124.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4124_thumb.jpg\" /></a></p>\n<p>At that point you can pair it up to any head unit that supports power meters, from Garmin/Wahoo/Hammerhead/Stages/etc… and use either ANT+ or Bluetooth Smart. For ANT+ it supports unlimited connections, and for Bluetooth Smart it supports a single concurrent connection.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4130.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4130_thumb.jpg\" /></a></p>\n<p>You can also use it with apps like Zwift, TrainerRoad, Rouvy, The Sufferfest, and more. As long as they support ANT+ or Bluetooth Smart power meters, you’re good to go. And of course they do – they all do.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-1.png\" /></a></p>\n<p>In addition, the Rival AXS power meter can be paired up to the SRAM AXS app, where you can check settings and save it to your virtual bike.</p>\n<p>At this point, it was time to get out on the road and testing. From a basic usability standpoint, it’s no different than any other power meter. It’ll transmit total power (wattage) and cadence (RPM). It won’t transmit power balance, since it can’t measure that.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-2.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-2.jpg\" /></a></p>\n<p>And here’s a quick look at the type of information you’ll see afterwards from our bike computer:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/04/Power-720x180.png\" /></p>\n<p>With that, let’s dive into the data itself.</p>\n<h3><span>First Rides Data:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4067.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4067_thumb.jpg\" /></a></p>\n<p>So I’ve got a few rides on this, and it’s been a mixed bag. On my first ride, I threw on a pair of Rally RS200’s. I did some settling, a boatload of zero offsets of all the units, set the install angles for Rally, went outside, waited for temps to settle, etc… And then I rode.</p>\n<p>And then the data wasn’t good. The Quarq Rival was some 40-50w lower than the Garmin Rally pedals. Now, if I know anything about power meters, it’s that first rides after installs can be iffy while things settle. But never this iffy. If I know more about power meters I know that in general, more things can go wrong with pedal based power meters than other places. Thus, my initial assumption was to assume that Garmin Rally was acting up. But I’ve moved these pedals around A LOT over the last few months, all without issue. So over the course of 30 minutes while riding, I did a slew of troubleshooting steps on both units to try and get them to agree. Nearly 2 hours later, I couldn’t. They just <a href=\"https://analyze.dcrainmaker.com/#/public/af70a384-e043-40bf-77fd-639964f7ed52\">had to agree to disagree</a>.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-17.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-16.png\" /></a></p>\n<p>And of course, that’s the problem with only two power meters – you never know who exactly is right. Of course, with a 50w split, one could probably due a Virtual Elevation pass on this and get a good ballpark estimate which one is right. Instead, I just sent off all the data to Quarq and said: You sort this out.</p>\n<p>They sent me back a small set of data points to try, and the next day I went back inside and got it all setup on a KICKR and did some additional zero offsets of all the units, including a suite of zero offsets on the Quarq at four positions. After all that was done, I started pedaling. And all three units (now including the KICKRV5) agreed mostly happily.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0016-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0016_thumb-1.jpg\" /></a></p>\n<p>There was a second or so lag on the Quarq Rival, but nothing I was worried about at the moment.</p>\n<p>So then, without stopping the bike computers, I took the bike off the trainer and went straight outside for a short test loop of a few mins. Sure, temp comp might not be perfect, but frankly it’d be quick enough that neither units materials would shift that fast anyway. As you can see, the data here looks pretty good too. Same slight lag on Quarq, but nothing to focus on at the moment:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0018-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0018_thumb-1.jpg\" /></a></p>\n<p>Ok then…fixed, I guess?</p>\n<p>I got on a conference call with SRAM/Quarq to discuss, and ultimately none of us can know which unit was incorrect on the first ride. However, they did look at the numbers I gave them from the zero offsets, and there does sound like there’s a bit of concern there – specifically on alignment between the four position offset numbers.</p>\n<p>Thus, out I went again an hour ago for another loop – this one about 40 minutes, inclusive of some gravel terrain as well. And at first, things weren’t ideal (an 18w difference on ~200w, with Quarq reading lower). However, at about the 26ish minute marker I woke up and realized I was in the small-ring up front, and shifted to the big ring. At that point, the difference shifted to 30-40w offset.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-18.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-17.png\" /></a></p>\n<p>That type of increased inaccuracy virtually only happens on crank-region power meters, due to the way the forces shift when you change chainrings. I don’t believe I’ve ever heard of that occurring for a pedal based power meter (not saying it can’t, but I don’t have any off the top of my head recollection to any brand pedal based power meter having issues on big ring vs little ring, whereas it’s actually a common thing to test on crank-region power meters).</p>\n<p>At this point, I’ve tossed the data back to Quarq to let them soft through it. One interesting thing they mentioned on one of my calls with them is that they do occasionally see issues with accuracy and spindle-based designs, depending on the manufacturing tolerances of the bike frames themselves. Which isn’t saying that’s the case here – but one more factor complicating things. Or perhaps there’s a temp compensation/sensor thing failing, which is why it worked on the indoor test and the very brief outdoor follow-up, but not the long outdoor tests.</p>\n<p>I will swap out the pedals for another brand/set on the next test. I was trying to aim for stability after the trainer test seemed to go well, and then obviously, things went not-well.</p>\n<h3><span>Wrap Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image00110.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image00110_thumb.jpg\" /></a></p>\n<p>Ultimately, it’ll be interesting to see where this goes. Quarq is historically a company that extensively tests their power meter products before release, and having followed the company for more than a decade, I don’t think anyone would argue that the tend to have the longest R&amp;D test cycles of any power meter brand out there. So whether my specific issue is a manufacturing issue, a engineering issue, or a frame issue (or something else), remains to be seen. It’s certainly plausible it’s a Garmin Rally issue, but that seems exceptionally unlikely at this point. I’ll be swapping to other power meter pedals to test it out, but the divergence when I shifted from little ring to big ring is pretty telling.</p>\n<p>Setting aside that for a second, and assuming they can sort that out – I do love the concept of low-cost power meter accessibility. And perhaps more importantly, the ability for a consumer to quickly and easily just insert a power meter into their bike in a minute or so – all for $250. Sure, there’s the left-only limitation. But one of the things I’m ever-so-slowly warming to over time and doing years of power meter accuracy testing, is that I’m less convinced that on the whole power meters are as consistently accurate as people think and hope they are. And that for most people, even with slight shifting leg imbalances, I don’t think it’s as critical an issue. Certainly, there are use cases where it is – for example, aero testing just can’t handle those sorts of shifting tolerances.</p>\n<p>In other words, the larger the data sets of power meters and trainers I have over the last 10-12 years of testing 2-4 power meters on every single ride year after year, the more I’m coming to the conclusion that there are so many ways for power data to be inaccurate on any given day from any given vendor, that the left-only doubling thing probably is a wash in the end. Obviously, that doesn’t apply when a unit is 30-40w off, but when we’re talking sub-10w, that’s less precise as people might believe.</p>\n<p>Ultimately though, I like affordable access to power, and I like accurate power. Finding the right blend can be tricky. With that – thanks for reading, and more to come in the full review.</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"cbe4cd135054013049dffaa68c7a0266057f432416aecf0bbcdcc04131e3e875","category":"Cycling"}