{"title":"Getting the shot: Cavendish’s near miss","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/getting-the-shot-cavendish-s-near-miss","date":1688764705000,"content":"\n      <p>This year marks my 34th <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. While I have more memories than I can count, I can honestly say that I still start each day a bit nervous. In many ways covering the Tour is a photographer’s dream, as the race offers innumerable opportunities. But it also provides constant challenges as the route changes year in and year out, and as a result, the landscape. Sure, certain stages I know well, like stage six that went over the Tourmalet. It’s a climb I have photographed dozens of times and I knew the exact spot I wanted to stand on. </p>\n<p><span>Other stages though are far less predictable, like the Grand Départ in the Basque Country. I didn’t know the roads and I didn’t know the climbs. At one point—after negotiating with fans to let me park behind them, I climbed over a barbed wire fence through some woods, only to find that I was on the wrong climb. Running back to my car, the same fans were holding the door of my car open, as I had mistakenly left the car running. It was funny, but also just a tad stressful. </span></p>\n<div></div>\n<p><span>On another climb, the only way I could find a place to park was by negotiating with a family to let me use their driveway in exchange for a family portrait after the stage. But this is the Tour. Everything requires more time, more effort, and a hearty dose of imagination.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/family.jpg?v=1688764487\" alt /></span></p>\n<p><span>To be honest, I was looking forward to today’s sprint stage into Bordeaux. Firstly because, as a historian of the sport, I am aware of Bordeaux’s long tradition as a great sprint stage. Sprint stages by nature are more predictable, as there are very few places where photographers can actually shoot.</span></p>\n<p><span>There is of course the traditional finish line shot. But I often try to avoid it as there are so many photographers on the line and the opportunities are often too predictable, with a fast-charging pack, perhaps a bike throw at the line, and a rider raising his arms in victory.</span></p>\n<p><span>Instead, myself and a few other photographers often opt for this side-on spot just a few meters from the line. It’s a small space between the barriers under the announcer’s booth that was never intended for photographers, but we discovered during the Covid years since so many of us were not allowed to shoot the finish. And in my books, it is one of the only good things to come out of Covid!</span></p>\n<p><span>But each day is a bit different depending on the light and the background, so I got to Bordeaux early, today as I wanted to make sure I had the best spot possible. The bright sunlight was well positioned behind me – always a plus for this shot in my books – and I knew that the layers of fans would make for a great backdrop, so I positioned myself about five meters before the line, where there was also a break in the trees that lined the boulevard in downtown Bordeaux. </span></p>\n<p><span>As the pack charged towards the finish line I steadied my camera and anticipated their approach. Some photographers choose to pan this shot, but I always hold my camera in a fixed position with a very high shutter speed to freeze the action. It is risky because you never quite know what you are going to get, and on at least one occasion, I missed the shot. But I also like the element of surprise, as riders come in and out of the edges of the camera more than when panning. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg07_philipsen01_tdf_2023.jpg?v=1688764547\" alt /></span></p>\n<p><span>Today’s position was fairly safe as I could see the riders approaching. Mark Cavendish was the first to come into sight, and for a moment, I thought that it would be here in Bordeaux where Cavendish would finally surpass Eddy Merckx with a 35th stage win. But then I sensed another rider overtaking him. </span></p>\n<p><span>I started shooting, not knowing what I was getting. It was only after the main pack had crossed the line that I started reviewing the different shots. </span></p>\n<p><span>The shot of Jasper Philipsen on his way to victory, jumped out at me first. But it was only when I got back in the press room and really could sit down with the images, that I saw the image of Cavendish. The fever of the crowd is intense and Cavendish is clearly dejected. His head is down as he understands he has not only been beaten, but has once again missed an opportunity to make history. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg07_cavendish01_tdf_2023.jpg?v=1688764593\" alt /></span></p>\n<p><span>I actually chatted with Cavendish before the start of stage six. He clearly had his eye on Bordeaux. After all he was the last rider to win here 13 years ago. He is also a student of the sport, and winning here would have been truly special. As a result, when I look at this image, there is something in his expression and his position that communicates the disappointment he must have only just been realizing. It wasn’t the image that first jumped out at me after the stage, but it is surely the one that resonates the most. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cbef39ca2de32434901ed532f5d47a2c46a929109c8d24fee0a06d22cdcce0ae","category":"Cycling"}