{"title":"Phenolic, Flavonoid Contents, Antioxidant, and Antibacterial Activity of Selected Eucalyptus Species","link":"https://www.preprints.org/manuscript/202403.1427/v1","date":1711344008000,"content":"Many medicinal plants and their essential oils are used to treat or prevent diseases without the risk of mutagenicity, carcinogenicity, or teratogenicity. Eucalyptus essential oils are commonly used as preservatives, flavoring agents, and in various consumer goods. Eucalyptus leaves are being widely studied due to their volatile essential oils, including 1,8-cineole, p-cymene, α and β-pinene, limonene, citronellal, citral, eudesmol, terpinen-4-ol, terpineol, α–phellanderene, and 9β-sitosterol. Among these compounds, 1,8-cineole is the most abundant. Eucalyptus leaves are rich in flavonoids and phenolic compounds and are thus a great source of antioxidants. 2,2-diphenyl-1-picrylhydrazyl (DPPH), Ferric Reducing Antioxidant Power (FRAP), and 2,2'-azino-bis(3-ethylbenzothiazoline-6-sulfonic acid) (ABTS) assays are used to measure antioxidant capacity. The antioxidant activity of Eucalyptus essential oil is stronger than that of standard antibiotics like Erythromycin, Cefixime, and Gentamicin due to the presence of significant terpenoids in addition to phenolic chemicals and flavonoids. The lower the IC50 value, the higher the antioxidant potential. Phenolic compounds and flavonoids are often associated with beneficial health outcomes, including anti-inflammatory and antioxidant effects, anti-cancer properties, reduced risk of cardiovascular diseases, prevention of age-related neurodegenerative diseases, and prevention of Alzheimer’s disease. Flavonoids also play an essential role in plants, including protecting against reduction, fertility, reproduction, and infection. Due to their anti-inflammatory, anti-oxidative, and immune-modulatory properties, flavonoids are crucial for pharmacological, medical, and nutraceutical applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cbf8080aa2461acb0b430e1b835853f0be464c4d12de90bcc1cded5956890df0","category":"Interdisciplinary"}