{"title":"New Insights on the Formation of the Mitral Valve Chordae Tendineae in Fetal Life","link":"https://www.preprints.org/manuscript/202410.0637/v1","date":1728477348000,"content":"There is an increasing understanding that some mitral valve pathologies have developmental origins. The time course of valvulogenesis varies by animal model, where in cattle, the branched chordae tendineae architecture becomes fully developed at full term. The mechanism by which chordae tendineae bifurcate during fetal development remains unknown. The current study presents a detailed description of bovine chordae tendineae formation and bifurcation during fetal development. Analysis of Movat Pentachrome-stained histological sections of the developing mitral valve apparatus were accompanied by micro-CT imaging. TEM imaging of chordae branches and common trunks allowed measurement of collagen fibril diameter distributions. We observed a proteoglycan-rich “transition zone” at the junction between the fetal mitral valve anterior leaflet and chordae tendineae with “perforations” lined by MMP1/2 and Ki-67 expressing endothelial cells. This region also contained clusters of proliferating endothelial within the bulk of the tissue. We hypothesize this zone marks a region where chordae tendineae bifurcate during fetal development. In particular, perforations, created by localized MMP activity serve as a site for the initiation of a “split” of a single chordae attachment into two. This is supported by TEM results that suggest a similar population of collagen fibrils runs from the branches into a common trunk. A clear understanding of normal mitral valvulogenesis and it’s signaling mechanisms will be crucial in developing therapeutics and/or tissue-engineered valve replacements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cc0329a420781cab31de9157766a7aa7c61ad0a3737597dcd6126788782ae346","category":"Interdisciplinary"}