{"title":"A global analysis of field body temperatures of active squamates in relation to climate and behaviour","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13808?af=R","date":1710729699000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Squamate fitness is affected by body temperature, which in turn is influenced by environmental temperatures and, in many species, by exposure to solar radiation. The biophysical drivers of body temperature have been widely studied, but we lack an integrative synthesis of actual body temperatures experienced in the field, and their relationships to environmental temperatures, across phylogeny, behaviour and climate.</p>\n<h2>Location</h2>\n<p>Global (25 countries on six continents).</p>\n<h2>Taxa</h2>\n<p>Squamates (210 species, representing 25 families).</p>\n<h2>Methods</h2>\n<p>We measured the body temperatures of 20,231 individuals of squamates in the field while they were active. We examined how body temperatures vary with substrate and air temperatures across taxa, climates and behaviours (basking and diel activity).</p>\n<h2>Results</h2>\n<p>Heliothermic lizards had the highest body temperatures. Their body temperatures were the most weakly correlated with substrate and air temperatures. Body temperatures of non-heliothermic diurnal lizards were similar to heliotherms in relation to air temperature, but similar to nocturnal species in relation to substrate temperatures. The correlation of body temperature with air and substrate temperatures was stronger in diurnal snakes and non-heliothermic lizards than in heliotherms. Body-substrate and body-air temperature correlations varied with mean annual temperatures in all diurnal squamates, especially in heliotherms. Thermal relations vary with behaviour (heliothermy, nocturnality) in cold climates but converge towards the same relation in warm climates. Non-heliotherms and nocturnal species body temperatures are better explained by substrate temperature than by air temperature. Body temperature distributions become left-skewed in warmer-bodied species, especially in colder climates.</p>\n<h2>Main Conclusions</h2>\n<p>Squamate body temperatures, their frequency distributions and their relation to environmental temperature, are globally influenced by behavioural and climatic factors. For all temperatures and climates, heliothermic species' body temperatures are consistently higher and more stable than in other species, but in regions with warmer climate these differences become less pronounced. A comparable variation was found in non-heliotherms, but in not nocturnal species whose body temperatures were similar to air and substrate irrespective of the macroclimatic context.</p>","author":"Shahar Dubiner, \nRocío Aguilar, \nRodolfo O. Anderson, \nDiego M. Arenas Moreno, \nLuciano J. Avila, \nEstefania Boada‐Viteri, \nMartin Castillo, \nDavid G. Chapple, \nChristian O. Chukwuka, \nAlison Cree, \nFélix B. Cruz, \nGuarino R. Colli, \nIndraneil Das, \nMichel‐Jean Delaugerre, \nWei‐Guo Du, \nAngel Dyugmedzhiev, \nTiffany M. Doan, \nPaula Escudero, \nJules Farquhar, \nAlison M. Gainsbury, \nBrian S. Gray, \nAnnegret Grimm‐Seyfarth, \nKelly M. Hare, \nKlaus Henle, \nNora Ibargüengoytía, \nYuval Itescu, \nSimon Jamison, \nOctavio Jimenez‐Robles, \nAntonieta Labra, \nAlejandro Laspiur, \nTao Liang, \nJackie L. Ludgate, \nLuca Luiselli, \nJosé Martín, \nGenevieve Matthews, \nMarlin Medina, \nFausto R. Méndez‐de‐la‐Cruz, \nDonald B. Miles, \nNathan E. Mills, \nAlejandro Bruno Miranda‐Calle, \nJoanne M. Monks, \nMariana Morando, \nDébora L. Moreno Azocar, \nGopal Murali, \nPanayotis Pafilis, \nAna Pérez‐Cembranos, \nValentín Pérez‐Mellado, \nRichard Peters, \nLigia Pizzatto, \nDaniel Pincheira‐Donoso, \nMichael V. Plummer, \nRachel Schwarz, \nBen Shermeister, \nRichard Shine, \nOle Theisinger, \nWiebke Theisinger, \nKrystal A. Tolley, \nOmar Torres‐Carvajal, \nSoledad Valdecantos, \nRaoul Van Damme, \nLaurie J. Vitt, \nErik Wapstra, \nGeoffrey M. While, \nEran Levin, \nShai Meiri","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"cc0e6c286cc0416b426c269e84d38a051b95bdf68044d5859604bc56c212913e","category":"Environment"}