{"title":"วิ่งทะลุแบบในเกมไม่ได้ งานศิลปะ PORTAL คล้ายสตาร์เกต แสดงภาพสดของอีกเมืองให้ผู้คนรู้สึกใกล้กันมากขึ้น","link":"https://www.blognone.com/node/122932","date":1622433156000,"content":"<div><div><div><p>เมืองวิลเนียส ประเทศลิทัวเนีย สร้างงานศิลปะชื่อว่า PORTAL เป็นหน้าจอทรงกลมพร้อมกล้องถ่ายวิดีโอสองทาง แสดงภาพเมืองลับลิน ประเทศโปแลนด์ ที่อยู่ห่างไปราว 600 กิโลเมตร และคนทั้งสองฝั่งสามารถมีปฏิสัมพันธ์กันได้เสมือนเป็นประตูมิติที่เชื่อมถึงกันตลอดเวลา ดีไซน์ของโครงการระบุอิงจาก “กงล้อแห่งเวลา” และยังระบุว่าได้แรงบันดาลใจจาก “สัญลักษณ์บางอย่างที่รู้กันในวงการไซไฟ” (ซึ่งน่าจะเป็นสตาร์เกต)</p>\n<p>โครงการนี้เป็นความร่วมมือของมูลนิธิสนับสนุนความสร้างสรรค์ Benediktas Gylys Foundation, เมืองวิลเนียสประเทศลิทัวเนีย เมืองลับลินในโปแลนด์ ร่วมกับศูนย์ศิลปวัฒนธรรม Crossroads Centre for Intercultural Creative Initiatives และออกแบบโดย Vilnius Gediminas Technical University หรือ Vilnius Tech ใช้เวลาออกแบบ 5 ปี</p>\n<p>ใน<a href=\"https://www.leta.lv/eng/home/press_release/8F8551B3-B997-4722-B6C5-96EB498FD60F/\">ประกาศของโครงการ</a> Benediktas Gylys ประธานมูลนิธิ Benediktas Gylys ผู้ที่ได้เครดิตว่าเป็นเจ้าของไอเดีย ระบุไว้ว่า สร้างขึ้นเพื่อลดความแตกแยกในหมู่มวลมนุษยชาติที่เกิดจากมุมมองของมนุษย์ที่คับแคบ สาเหตุจากการกั้นเขตแดนระหว่างประเทศ และต้องการให้โครงการนี้เป็นสะพานเชื่อมให้มนุษย์ก้าวผ่านอคติ และความบาดหมางในอดีต</p>\n<p>ที่มา - <a href=\"https://www.leta.lv/eng/home/press_release/8F8551B3-B997-4722-B6C5-96EB498FD60F/\">LETA</a> via <a href=\"https://www.theverge.com/2021/5/30/22460964/vilnius-lithuania-portal-poland-connection-pandemic\">The Verge</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6b354d1954b07d64a07bebb32e371df5.jpg\" /><em>ภาพ PORTAL ในเมืองวิลเนียส ประเทศลิทัวเนีย</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d31e73993e60300011bad7ada4b1ba57.jpg\" /><em>ภาพ PORTAL ในเมืองลับลิน ประเทศโปแลนด์</em></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/arts\">Arts</a></div><div><a href=\"/topics/lithuania\">Lithuania</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cc10dc043dfaae44302847958b7a9ed8892d4ac2c85dd595c21f81fb0a35af3d","category":"Thai"}