{"title":"The impact of accessibility to non-calcium-based phosphate binders and calcimimetics on mineral outcomes in patients receiving maintenance hemodialysis: A 10-year retrospective analysis of real-world data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304649","date":1717164000000,"content":"<p>by Sinee Disthabanchong, Panhathai Kasempin, Praopilad Srisuwarn, Payupol Chansomboon, Nuchcha Buachum</p>\r\nIntroduction <p>Hyperphosphatemia and hyperparathyroidism are common in end-stage kidney disease and are associated with poor outcomes. In addition to adequate dialysis, medications are usually required for optimum control of serum phosphate and parathyroid hormone (PTH) levels. The use of calcium-based phosphate binders (CBPBs) and active vitamin D is associated with an increase in serum calcium and worsening vascular calcification. To overcome these limitations, non-calcium-based phosphate binders (NCBPBs) and calcimimetics have been developed. However, the coverage for these new medications remains limited in several parts of the world due to the lack of patient-level outcome data and cost. The present study examined the differences in mineral outcomes between two main categories of healthcare programs that provided different coverage for medications used to control mineral and bone disorders (MBD). The Social Security/Universal Coverage (SS/UC) program covered only CBPBs and active vitamin D, whereas the Civil Servant/State Enterprise (CS/SE) program provided coverage of CBPBs, active vitamin D, NCBPBs, and calcimimetics.</p> Methods <p>This 10-year retrospective cohort study examined the differences in mineral outcomes between two healthcare programs in maintenance hemodialysis patients. The differences in serum calcium, phosphate, and PTH levels, as well as the aortic arch calcification score, were analyzed according to dialysis vintage by linear mixed-effects regression analyses. The difference in the composite outcome of severe hyperparathyroidism and parathyroidectomy was analyzed by the Cox-proportional hazard regression model.</p> Results <p>714 patients were included in the analyses (full cohort). Of these patients, 563 required at least one type of medication to control MBD (MBD medication subgroup). Serum calcium, phosphate, and the proportions of patients with hypercalcemia and hyperphosphatemia were substantially higher in the SS/UC group compared with the CS/SE group after appropriate adjustments for confounders in both the full cohort and the MBD medication subgroup. These findings were confirmed in propensity-score matched analyses. Higher parathyroid hormone levels and a higher rate of the composite endpoint of severe hyperparathyroidism and parathyroidectomy were also observed in the SS/UC group. A more rapid progression of aortic arch calcification was suggested in the SS/UC group, but between-group changes were not significant.</p> Conclusion <p>Patients under the healthcare program that did not cover the use of NCBPBs and calcimimetics showed higher serum calcium and phosphate levels and a more rapid progression of hyperparathyroidism. The difference in the progression of vascular calcification could not be confirmed in the present study.</p>","author":"Sinee Disthabanchong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cc11f40a827493561f2efc5c55e53cd80b112bc6df141e0eae1a7a7e380bac95","category":"Interdisciplinary"}