{"title":"What Else to Expect From Apple This Year Following the iPhone Event","link":"https://www.macrumors.com/2023/09/20/what-to-expect-from-apple-remainder-of-2023/","date":1695242081000,"content":"Now that Apple's annual <a href=\"https://www.macrumors.com/2023/09/12/everything-apple-announced-fall-2023-event/\">iPhone and Apple Watch event</a> is in the rear-view mirror, attention shifts towards what the company has planned for the remainder of the year. And based on the latest rumors, there might not be a whole lot coming, if anything.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Whats-Next-For-Apple-Post-Wonderlust-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nAt this point, the chances of an Apple event in October are looking quite unlikely, as supply chain analyst Ming-Chi Kuo recently said that he does not expect Apple to release <a href=\"https://www.macrumors.com/2023/09/08/kuo-first-m3-macbooks-unlikely-2023/\">any new MacBooks</a> or <a href=\"https://www.macrumors.com/2023/09/12/kuo-new-ipads-unlikely-to-launch-this-year/\">iPads</a> between now and the end of 2023.\r<br />\n\r<br />\nKuo did not rule out new desktop Macs launching this year, so there is still a possibility of the long-awaited iMac with an M3 chip being announced with a press release on Apple's website next month, but there have not been any specific rumors suggesting this will happen. It's also unclear if Apple wants to debut the M3 chip in the iMac. Given that Apple's upcoming <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Vision Pro</a> is equipped with the M2 chip, another possibility is that Apple waits until after the headset launches in early 2024 to announce the M3 chip. As for other desktop Macs, the Mac mini, Mac Studio, and Mac Pro were all already updated this year.\r<br />\n\r<br />\nWith the iPhone lineup, Apple Watch lineup, and AirPods Pro all updated last week, there are few if any remaining Apple products and accessories that are likely to be updated by the end of this year. A <a href=\"https://www.macrumors.com/2023/02/03/homepod-mini-2-shipping-next-year/\">new HomePod mini</a>, <a href=\"https://www.macrumors.com/2023/07/14/what-to-expect-from-fourth-generation-apple-tv-4k/\">Apple TV</a>, <a href=\"https://www.macrumors.com/2023/08/02/kuo-new-airtag-production-late-2024/\">AirTag</a>, and <a href=\"https://www.macrumors.com/2023/09/08/usb-c-airpods-and-airpods-max-2024/\">AirPods Max</a> are expected to launch in 2024 at the earliest, the full-sized HomePod is still fairly new, and there are no rumors suggesting that new versions of the Studio Display or Pro Display XDR are imminent. Even the Beats lineup is up to date with the new Beats Studio Buds+ and Beats Studio Pro.\r<br />\n\r<br />\nApple could have some surprise announcements planned for later this year, but as of now it is looking like it could be rather quiet for the remainder of 2023.<br />This article, \"<a href=\"https://www.macrumors.com/2023/09/20/what-to-expect-from-apple-remainder-of-2023/\">What Else to Expect From Apple This Year Following the iPhone Event</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-else-to-expect-from-apple-this-year-following-the-iphone-event.2403531/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cc1102efa1a1c78449d7c6d3712ff5eb0e1cf9f90820567ff85b13bba28ec9ea","category":"Apple"}