{"title":"Functional and phylogenetic dimensions of tree biodiversity reveal unique geographic patterns","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13877?af=R","date":1717657200000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Quantify tree functional and phylogenetic richness and divergence at the global scale, and explore the drivers underpinning these biogeographic patterns.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time Period</h2>\n<p>Present.</p>\n<h2>Major Taxa Studied</h2>\n<p>Trees.</p>\n<h2>Methods</h2>\n<p>Using global tree occurrence data, we outlined species' observed ranges using individual alpha hulls to obtain per-pixel tree species composition at a 0.83-degree resolution. Using eight traits from a recent tree-trait database and a vascular-plant phylogeny we computed and mapped four pixel-level biodiversity indices, including two metrics related to richness: phylogenetic richness and functional richness, and two related to divergence: mean pairwise phylogenetic distance and Rao's quadratic entropy. To account for the effect of species richness, we also calculated standardized effect sizes accounting for richness for each pixel. We then explored the relations between richness and divergence and the latitudinal patterns of divergence both globally and across biomes. Finally, we used a random forest modelling approach to test for drivers of the different dimensions of diversity in trees.</p>\n<h2>Results</h2>\n<p>In contrast to the latitudinal gradient in species richness, functional and phylogenetic divergence both peak in mid-latitude systems, exhibiting the highest values in temperate ecosystems and lowest values in boreal and tropical forests. This result holds for functional divergence when removing gymnosperms but the peak flattens for phylogenetic divergence. Phylogenetic richness is consistently lower than expected given the number of species, whereas functional richness has higher-than-expected values at mid-latitudes, mimicking functional divergence patterns. When considering the drivers of these diversity patterns, temperature and historical speciation rates consistently emerge as the strongest forces driving divergence, with negligible effects of human influence, soils or historical climate stability.</p>\n<h2>Main Conclusions</h2>\n<p>Collectively, these results reveal unique similarities and disparities across biomes that are not apparent in any single dimension of biodiversity, highlighting the importance of considering multiple aspects of biodiversity in the management of natural ecosystems.</p>","author":"Andrea Paz, \nThomas W. Crowther, \nDaniel S. Maynard","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"cc21e52d68db82a2e183e6ee1e8729ad7e018bfefb9355aa98f44bdcf1a32434","category":"Environment"}