{"title":"เกิดอะไรขึ้นที่อินเทล ตอนที่ 3: คู่แข่งทุกแนวรบ ตกขบวนจีพียู-มือถือ และทางรอดของอินเทล","link":"https://www.blognone.com/node/121792","date":1616217887000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>บทความตอนที่ 1 เราพูดถึงเรื่อง<a href=\"https://www.blognone.com/node/121159\">ปัญหา 14 นาโนเมตรของอินเทล</a> และอธิบายในตอนที่ 2 ว่า<a href=\"https://www.blognone.com/node/121178\">เกิดจากหลายสาเหตุ หลายปัจจัยในอุตสาหกรรมเซมิคอนดักเตอร์</a> แต่ทั้งสองตอนที่ว่ามา ยังพูดถึงแค่ธุรกิจซีพียูสำหรับพีซี ที่เป็นธุรกิจหลักของอินเทลเท่านั้น</p>\n<p>อินเทลยังมีธุรกิจอื่นๆ อีกหลายด้านที่มีปัญหาอีกเช่นกัน เช่น ซีพียูเซิร์ฟเวอร์ จีพียู มือถือ รวมถึงปัญหาด้านการบริหารภายในของอินเทลเอง ที่จะกล่าวถึงในบทความนี้ รวมไปถึงวิเคราะห์ทางออกในอนาคต</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1229aa63fbe9574417e170a906ed8ec2.jpg\" ></p>\n<h2>เซิร์ฟเวอร์ ขุมทรัพย์ทองคำที่บังตาความล้มเหลว</h2>\n<p>เมื่อพูดถึงอินเทลแล้ว สิ่งแรกที่ทุกคนนึกถึงคือ ซีพียูสำหรับพีซี ที่ใช้แบรนด์ Core, Pentium, Celeron ทำตลาดมายาวนาน แต่จริงๆ แล้ว ตลาดซีพียูเซิร์ฟเวอร์ของอินเทล (Xeon และ Itanium) ก็มีขนาดใหญ่ไม่ด้อยไปกว่ากันมากนัก (ใหญ่จนน่าตกใจเลยล่ะ)</p>\n<p>ต้องย้อนความก่อนว่า จุดกำเนิดของอินเทลมาจากคอมพิวเตอร์ราคาถูก (IBM PC compatible) แต่ในตลาดคอมพิวเตอร์สมรรถนะสูงสมัยก่อน ยังเป็นของสถาปัตยกรรมจากบริษัทยุคก่อนหน้าอย่าง POWER/PowerPC (IBM), Alpha (DEC), PA-RISC (HP), SPARC (Sun) เป็นต้น ซีพียูสถาปัตยกรรม x86 ที่เน้นประสิทธิภาพพอใช้ ในราคาเอื้อมถึงได้ ย่อมไม่สามารถต่อกรได้</p>\n<p>อินเทลในยุค 90s ตอนปลายจึงพยายามตีตลาดนี้ด้วยโครงการ Itanium ที่ร่วมพัฒนากับ HP มีความทะเยอทะยานเพราะใช้สถาปัตยกรรมใหม่ IA-64 (เปิดตัวครั้งแรกปี 1999) แต่ก็ไม่ประสบความสำเร็จนักด้วยเหตุผลหลายๆ ประการ และสุดท้ายต้องเลิกทำไป ในขณะที่คู่แข่ง AMD เดินเลือกในเส้นทางต่อยอด x86 เป็น x86-64 ที่ไม่เปลี่ยนไปจากเดิมมากนัก กลับประสบความสำเร็จอย่างมาก ทำให้อินเทลต้องยอมเดินตามทั้งในฝั่งเดสก์ท็อป (Pentium 4) และเซิร์ฟเวอร์ (Xeon แบบ 64 บิต)</p>\n<p>แม้เริ่มต้นแบบติดๆ ขัดๆ ในตอนแรก แต่ Xeon กลับเป็นผลิตภัณฑ์ที่ประสบความสำเร็จอย่างมากในระยะยาว ยุคแรกของ Xeon เน้นการใช้งานในเซิร์ฟเวอร์ขนาดเล็ก (เช่น เซิร์ฟเวอร์เดี่ยวๆ แบบ 1U/2U แบบที่เราคุ้นเคยกัน) และเติบโตตามตลาดอินเทอร์เน็ตในยุคแรกๆ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5b9a1b2f6b6b4c88f19d29db038e9059.jpg\" ></p>\n<p>แต่อินเทอร์เน็ตในทศวรรษ 2000s ก็มีจุดเปลี่ยนตรงที่กูเกิลหันมาสร้างระบบเซิร์ฟเวอร์ของตัวเอง ใช้ชิ้นส่วนฮาร์ดแวร์หาได้ทั่วไป (commodity hardware) แล้วเขียนซอฟต์แวร์กระจายโหลดควบคุมเอาเอง แทนการซื้อเซิร์ฟเวอร์สมรรถนะสูงจากแบรนด์ดังในราคาแพงๆ กลายเป็นพื้นฐานและจุดเริ่มต้นของระบบคลาวด์คอมพิวติ้งในยุคถัดมา</p>\n<p>เมื่อชิ้นส่วนคอมพิวเตอร์ทั่วไป สามารถใช้แทนเซิร์ฟเวอร์ราคาแพงได้ แล้วใครจะไปซื้อเซิร์ฟเวอร์เฉพาะทางแบบแพงๆ กันอีก? ผู้ที่ได้ประโยชน์สูงสุดจากกระแสความเปลี่ยนแปลงนี้ จึงเป็นซีพียูสมรรถนะสูงพอในระดับหนึ่งที่ราคาไม่แพงจนเกินไป… Xeon</p>\n<p>หมายเหตุ: AMD Opteron ก็เป็นหนึ่งในซีพียูที่ได้ประโยชน์จากกระแสนี้เช่นกัน แต่เมื่อ AMD แผ่วไปในทศวรรษ 2010s ช่วงกลางๆ ทำให้ตลาดแทบเป็น Xeon กินรวบไปเลย</p>\n<p>เราคงไม่สามารถหาข้อมูลส่วนแบ่งตลาดซีพียูเซิร์ฟเวอร์ทั้งหมดได้ง่ายนัก แต่ถ้าลองดูจาก TOP500 ซูเปอร์คอมพิวเตอร์ที่เร็วที่สุดในโลก 500 อันดับแรกแต่ละยุคสมัย เราเห็นเทรนด์ชัดเจนว่าหลังปี 2006-2007 เป็นต้นมา Xeon ครองไปเกือบทั้งลิสต์ เหลือพื้นที่ยืนให้คู่แข่งรายอื่นๆ เพียงเล็กน้อยเท่านั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f4e2d85802ac08738f43a11e25c2fbf6.png\" ></p>\n<p><em>ส่วนแบ่งสถาปัตยกรรมซีพียูใน TOP500 แต่ละยุค ที่มา - <a href=\"https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Processor_families_in_TOP500_supercomputers.svg/600px-Processor_families_in_TOP500_supercomputers.svg.png\">Wikipedia</a></em></p>\n<p>Xeon กลายเป็นผลิตภัณฑ์ที่ช่วยให้อินเทลชนะศึกคอมพิวเตอร์ระดับสูง ทั้งในแง่ของรางวัล (อันดับใน TOP500 ที่เหลือพื้นที่ให้ IBM Power เล็กน้อยในเครื่องระดับบนๆ แพงๆ) และในแง่ของรายได้ ที่กลายเป็นเครื่องจักรทำเงินให้อินเทลมหาศาลจนถึงทุกวันนี้</p>\n<p>ข้อมูลเก่าที่สุดที่ผมค้นเจอ อินเทลแยกรายได้จากฝั่งพีซี-เซิร์ฟเวอร์เป็นครั้งแรกในปี 2009 โดยตอนนั้น อินเทลมีรายได้จากฝั่งพีซี (PC Client Group - PCCG) ประมาณ 75% ของรายได้ทั้งหมด และฝั่งเซิร์ฟเวอร์ (Data Center Group - DCG) ประมาณ 18% เทียบสัดส่วนแบบหยาบๆ คือราว 5 ต่อ 1</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/be8f19c5c00d34b09a6eeaacabd30d00.png\" ></p>\n<p><em>ที่มา - <a href=\"https://www.intc.com/filings-reports/all-sec-filings/content/0000950123-10-015237/0000950123-10-015237.pdf\">Intel</a></em></p>\n<p>แต่ถ้าดูตัวเลขล่าสุดของปี 2020 สัดส่วนรายได้ของอินเทลเปลี่ยนไปจากเดิมมาก รายได้ฝั่งพีซี (กราฟบน) อยู่ที่ 40.1 พันล้านดอลลาร์ต่อปี ส่วนรายได้จากฝั่งเซิร์ฟเวอร์ (กราฟล่าง) คือ 26.1 พันล้านดอลลาร์ต่อปี เทียบสัดส่วนแล้วอยู่ที่ราว 1.5 ต่อ 1 แล้ว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ddab2a09ccec945ccc1e9330c83ee6af.png\" ></p>\n<p><em>ที่มา - <a href=\"https://www.intc.com/filings-reports/all-sec-filings/content/0000050863-21-000010/0000050863-21-000010.pdf\">Intel</a></em></p>\n<p>ถึงแม้ว่าธุรกิจพีซีช่วงหลังๆ (หมายถึงก่อน COVID ที่มีกระแส work from home) เติบโตช้าลงหรือถดถอยมาโดยตลอด ส่งผลให้ธุรกิจฝั่งพีซีของอินเทลไม่เติบโตมากนัก แต่กระแสของคลาวด์ที่เติบโตไม่หยุดเลย ทำให้ธุรกิจของอินเทลพึ่งพา Xeon เป็นสัดส่วนที่มากขึ้นเรื่อยๆ</p>\n<p>ทั้งหมดที่ว่ามานี้เป็นเรื่องดี อินเทลร่ำรวยมหาศาลจาก Xeon โลกทุกอย่างสดใส แต่ความสำเร็จของ Xeon อีกนั่นแหละที่บดบังภัยคุกคามชนิดใหม่ๆ ไม่ให้อินเทลมองเห็นชัดเจนนัก</p>\n<h2>ตกรถไฟขบวนที่หนึ่ง: จีพียู</h2>\n<p>ตลาดจีพียูเริ่มต้นอย่างช้าๆ ในทศวรรษ 90s โดยผู้บุกเบิกจีพียูยุคแรกๆ คือ ATI (ก่อตั้ง 1985), NVIDIA (ก่อตั้ง 1993), 3dfx (ก่อตั้ง 1994) แต่กว่าจีพียู 3D จะเริ่มบูมก็ต้องรอช่วงปลายทศวรรษคือ GeForce (1999) และ Radeon (2000)</p>\n<p>ตลาดจีพียูในยุคแรกๆ ยังแยกขาดจากซีพียู และเน้นสำหรับงานเฉพาะทางเป็นหลัก เช่น งานออกแบบกราฟิกหรือเกม แต่หลังจากนั้นไม่นานนัก เมื่อการใช้งานแอปพลิเคชันกราฟิกบนพีซีเริ่มแพร่หลายมากขึ้น จีพียูกลายเป็นส่วนสำคัญที่ต้องใช้คู่กับซีพียู เราจึงเห็นดีลสำคัญคือ AMD ซื้อกิจการ ATI ในปี 2006 กลายเป็นบริษัทเดียวที่มีครบทั้งซีพียูและจีพียู</p>\n<p>ฝั่งของอินเทลเอง ถึงแม้มีผลิตภัณฑ์จีพียูแบบออนบอร์ด (integrated) มานานพอสมควร ตั้งแต่แบรนด์ Intel Extreme Graphics, Intel GMA, Intel HD และ Iris ในปัจจุบัน แต่ก็ไม่ได้เอาจริงกับตลาดจีพียูแยกแบบ discrete มากนัก ปล่อยให้เป็นการต่อสู้กันระหว่าง ATI/AMD กับ NVIDIA มายาวนานข้ามทศวรรษ</p>\n<p>แน่นอนว่าอินเทลเห็นความสำคัญของตลาดจีพียู discrete และเคยลงมาชิมลางด้วยจีพียูโค้ดเนม Larrabee ที่เปิดตัวครั้งแรกในปี 2009 แต่ก็ไม่ประสบความสำเร็จ ด้วยเหตุผลเรื่องประสิทธิภาพที่ไม่ดีพอเมื่อเทียบกับคู่แข่ง (แนวคิดของ Larrabee ยังเป็นการใช้สถาปัตยกรรม x86 ผสมผสานกับ SIMD แบบจีพียูปกติ)</p>\n<p>อินเทลยุติโครงการ Larrabee อย่างรวดเร็วในปี 2010 (ตัวเทคโนโลยีถูกนำไปใช้ต่อใน Xeon Phi หน่วยประมวลผลร่วมสำหรับเซิร์ฟเวอร์) และอินเทลดูจะขยาดกับตลาดนี้ ไม่กลับเข้ามายุ่งกับจีพียู discrete ไปอีกพักใหญ่ๆ จนกระทั่งกลับมาประกาศทำ Xe ในปี 2018 (และออกได้จริงในปี 2020 นี้เอง)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9faf56bdd98e59f385f6c5d8620a728e.png\" ></p>\n<p>ถ้านับจาก GeForce ตัวแรกในปี 1999 จนมาถึง Xe ในปี 2020 จะเห็นว่าอินเทล \"เสียโอกาส\" ในตลาดจีพียูมานานถึง 20 ปีเต็มๆ</p>\n<p>ในช่วงแรกๆ ตลาดจีพียูแยกขาดจากซีพียูอย่างชัดเจน และธุรกิจซีพียูของอินเทลไปได้สวยอยู่แล้ว ลูกค้าซื้อจีพียูยี่ห้อไหนก็ตาม ก็ต้องมาใช้กับซีพียูของอินเทลอยู่ดี การที่อินเทลไม่มีจีพียูย่อมไม่ใช่ปัญหาใดๆ</p>\n<p>แต่ในทศวรรษ 2010s เป็นต้นมา การไม่มีจีพียูเริ่มส่งผลกระทบต่ออินเทลใน 2 แนวรบสำคัญ</p>\n<p>อย่างแรกคือตลาดเกมคอนโซล ที่เริ่มเปลี่ยนทิศทางฮาร์ดแวร์จากการแยกชิ้นส่วนซีพียู-จีพียูจากคนละผู้ผลิต (Xbox 360 ใช้ซีพียู IBM และจีพียู ATI) มาสู่การเป็น SoC ครบทุกอย่างในตัวจากบริษัทเดียว และบริษัทเดียวที่มีทุกอย่างครบคือ AMD</p>\n<p>ตรงนี้จึงไม่น่าแปลกใจว่า คอนโซลในยุคนั้นทั้ง PS4 และ Xbox One (เปิดตัว 2013) ทั้งคู่ ต่างเลือกใช้ชิปแบบคัสตอมจาก AMD ที่มีทั้งซีพียูและจีพียูมาพร้อม</p>\n<p><a href=\"https://www.blognone.com/node/119286\">ยอดขายล่าสุดของ PS4 อยู่ที่ 113.5 ล้านเครื่อง</a> ส่วนยอดขาย Xbox One แม้ไม่เปิดเผยมานานแล้ว แต่คาดกันว่าน่าจะอยู่ราว 50 ล้านเครื่อง ถึงแม้ตัวเลขรวมอาจไม่ได้เยอะมากเมื่อเทียบกับยอดขายพีซีในแต่ละปี แต่อินเทลก็เสียตลาดขนาด 150-160 ล้านเครื่องไปเปล่าๆ ด้วยเหตุผลว่าไม่มีจีพียู</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/176e555ea83a963cad31f88676df5745.png\" ><em>ภาพจาก <a href=\"https://www.amd.com/en/campaigns/power-to-products\">หน้ารวมลูกค้าของ AMD</a></em></p>\n<p>แนวรบที่สองคือตลาดที่อินเทลแข็งแกร่งมากๆ อย่างตลาดเซิร์ฟเวอร์ดังที่กล่าวไปแล้ว อินเทลสามารถโค่น IBM ขึ้นมาครองตลาดซีพียูเซิร์ฟเวอร์ได้เกือบเบ็ดเสร็จ และปัจจุบันนี้ยังไม่มีใครมาต่อกรกับอินเทลได้</p>\n<p>อย่างไรก็ตาม ตลาดเซิร์ฟเวอร์เองเริ่มมีพัฒนาการใหม่ๆ ในทศวรรษ 2010s ว่าซีพียูอย่างเดียวไม่พอ มีรูปแบบงานประมวลผลชนิดใหม่ๆ ที่เป็นการประมวลผลแบบขนาน เป็นการประมวลผลแบบเวกเตอร์มากขึ้น ทำให้เซิร์ฟเวอร์ยุคหลังต้องมี \"ตัวช่วยประมวลผล\" (co-processor) หรือบ้างก็เรียกว่า \"ตัวเร่งการประมวลผล\" (accelerator) เข้ามาเสริม</p>\n<p>บริษัทที่ทำตัวช่วยประมวลผลได้เก่งที่สุด คือบริษัทที่ขายหน่วยประมวลผลแบบขนาน/เวกเตอร์ได้มากที่สุดในโลก… NVIDIA</p>\n<p>NVIDIA มีฐานลูกค้าเดิมจากฝั่งคอนซูเมอร์ที่ซื้อ GeForce อยู่แล้ว และไม่พลาดโอกาสนี้ด้วยการออก Tesla จีพียูสำหรับงานเซิร์ฟเวอร์ (เปิดตัวครั้งแรกปี 2007) พร้อมๆ กับการลงทุนพัฒนา CUDA API เพื่อช่วยให้นักพัฒนาย้ายโหลดงานจากซีพียูไปยังจีพียูได้ แม้ว่าหลังจากนั้นผู้ผลิตรายอื่นๆ จะพยายามผลักดัน OpenCL เพื่อย้ายงานบางประเภทไปรันบนจีพียูได้เหมือนกัน แต่ CUDA ก็ยังคงได้รับความนิยมสูงกว่าเรื่อยมา</p>\n<p>อินเทลที่ชู Xeon Phi นั้นแม้จะได้รับความนิยมอยู่ช่วงหนึ่งในตลาดซูเปอร์คอมพิวเตอร์เนื่องจากสถาปัตยกรรมภายในเป็น x86 และการพัฒนาทำได้ง่าย ไม่ต้องเปลี่ยนแนวคิดมากนักเพราะ Xeon Phi ทำงานเหมือนคอมพิวเตอร์แยกอยู่คอมพิวเตอร์เครื่องหลัก สามารถล็อกอินด้วย SSH เข้าไปได้ และภายในจะมองเห็นซีพียูจำนวนมาก แต่ความได้เปรียบนี้ก็เริ่มหมดค่าลงอย่างรวดเร็วเมื่อเข้าสู่ยุค AI แบบ deep learning</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6552b0278c66be82813115e9db57b24c.png\" ></p>\n<p>NVIDIA Tesla ค่อยๆ เติบโตคู่มากับตลาดเซิร์ฟเวอร์ยุคใหม่ งานประมวลผลข้อมูลขนาดใหญ่และ AI เฟรมเวิร์ค AI อย่าง TensorFlow <a href=\"https://www.tensorflow.org/install/gpu\">รองรับเฉพาะ CUDA ของ NVIDIA เป็นหลัก</a> แม้จะรันบนซีพียูได้ แต่การทำงานก็จะประสิทธิภาพต่ำมากจนใช้งานจริงแทบไม่ได้ การบ่งชี้ว่า Tesla ได้รับความนิยมมากน้อยแค่ไหน ต้องลองไปดูที่ตลาดซูเปอร์คอมพิวเตอร์</p>\n<p>หากเราดู TOP500 ซูเปอร์คอมพิวเตอร์ที่แรงที่สุดในโลก 10 อันดับแรก <a href=\"https://top500.org/lists/top500/2020/11/\">รายชื่อล่าสุดรอบเดือนพฤศจิกายน 2020</a> มี 4 เครื่องที่ใช้ซีพียู Xeon ของอินเทล แต่มีถึง 6 เครื่องที่ใช้ co-processor ของ NVIDIA ส่วนอาวุธเดียวที่อินเทลจะใช้ต่อกรได้คือ Xeon Phi ก็ตกยุคและเลิกทำไปแล้ว ขณะที่ความพยายามใช้ FPGA มาเร่งความเร็วงานเฉพาะทางจากการซื้อ Altera ก็ยังไม่ได้รับความนิยมในวงกว้างจนถึงทุกวันนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e3113714009116e8d00d1012fd8d38c9.jpg\" ></p>\n<p>ตัวอย่างเหล่านี้แสดงให้เห็นว่า อินเทลปล่อยปละละเลยตลาดจีพียูมานาน และพลาดโอกาสสำคัญของกระแส convergence ที่เริ่มหลอมรวมซีพียู-จีพียูเข้าด้วยกัน จนมันเริ่มย้อนกลับมาโจมตีอินเทลเอง</p>\n<p>แต่ตลาดจีพียูยังเป็นเพียงแค่รถไฟขบวนแรกที่อินเทลตกรถ เพราะรถไฟอีกคัน \"ตลาดมือถือ\" ก็ขึ้นไม่ทันอีกเช่นกัน</p>\n<h2>ตกรถไฟขบวนที่สอง: สมาร์ทโฟน</h2>\n<p>ก่อนหน้านี้ผมยกตัวเลขให้ดูว่า ยอดขายคอนโซลตลอดอายุขัย (ประมาณ 7 ปี) อยู่ที่ราว 150 ล้านเครื่อง</p>\n<p>ตัวเลขนี้เทียบไม่ได้เลยกับยอดขายพีซี ที่ในหนึ่งปีมียอดขายรวมประมาณ 300 ล้านเครื่อง <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS47274421\">ตัวเลขปี 2020</a> อาจกลับมาพุ่งเพราะ work from home แต่ถ้าย้อนดูปี 2019 ก็ห่างกันไม่เยอะคือประมาณ 270 ล้านเครื่อง หากเราตีส่วนแบ่งตลาดแบบหยาบๆ ว่าอินเทลครองประมาณ 70% ก็เท่ากับยอดขายประมาณ 200 ล้านเครื่องต่อปี</p>\n<p>แต่ตัวเลขยอดขายพีซีก็ถือว่าน้อยอยู่ดี หากเราเทียบกับยอดขายสมาร์ทโฟนปีละ 1,300 ล้านเครื่อง (<a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS47410621\">ตัวเลขปี 2020</a>)</p>\n<p>น่าเสียดายว่า ตอนนี้อินเทลแทบไม่มีเอี่ยวในตลาดสมาร์ทโฟนเลย</p>\n<p>ถามว่าอินเทลมองไม่เห็นตลาดอุปกรณ์พกพามาก่อนเลยหรือ ก็ไม่ใช่อีก เพราะอินเทลนั่นแหละที่เล็งเห็นตลาดนี้ก่อนใคร เปิดตัวแพลตฟอร์ม Mobile Internet Device (MID) ครั้งแรกในปี 2007 ปีเดียวกับที่ iPhone เผยโฉมสู่โลก วิสัยทัศน์ของอินเทลคือใช้ซีพียู Atom ที่กินไฟน้อย ผนวกกับระบบปฏิบัติการ Moblin ที่ดัดแปลงจากลินุกซ์ (ภายหลังรวมกับ Maemo ของโนเกีย กลายเป็น MeeGo)</p>\n<p>แต่คนไม่ใช่ทำอะไรก็ผิด MID/Moblin/Maemo/MeeGo ล้มเหลว (เฉกเช่นเดียวกับแพลตฟอร์มสมาร์ทโฟนอื่นในยุคนั้น เช่น webOS, Bada หรือแม้แต่ Windows Phone) ผู้ที่อยู่รอดมาได้มีเพียง iPhone และ Android เท่านั้น</p>\n<p><img src=\"https://www.phoronix.net/image.php?id=848&amp;image=intel_idf7d2_22_med\" alt=\"\" /><em>หน้าตาของ Intel MID ในช่วงประมาณปี 2009 - ภาพจาก <a href=\"https://www.phoronix.com/scan.php?page=news_item&amp;px=Intel-Phasing-Out-MID-Linux\">Phoronix</a></em></p>\n<p>ซอฟต์แวร์ไม่รอด ขายฮาร์ดแวร์ได้ก็ยังดี อินเทลจึงผลักดันการใช้ Atom บนสมาร์ทโฟนร่วมกับกูเกิล พัฒนา Android ให้รองรับสถาปัตยกรรม x86 ของ Atom ในปี 2011 และร่วมกับแบรนด์มือถือ โดยหลักคือ ASUS ออก Zenfone ที่ใช้ Atom ออกสู่ตลาดในปี 2014</p>\n<p>น่าเสียดายว่า ความพยายามของอินเทลไม่ประสบความสำเร็จอีกเช่นกัน เหตุผลหลักน่าจะมาจากข้อจำกัดของสถาปัตยกรรม x86 ในเรื่องการใช้พลังงงานขณะไม่ใช้งาน (idle) ที่สู้กับ ARM ไม่ได้เลย ในขณะที่ฝั่ง ARM เองก็สามารถพัฒนาประสิทธิภาพให้ดีขึ้นเรื่อยๆ ในช่วงเวลานั้น (เหตุผลอีกข้อคงเป็นเรื่องความเข้ากันได้ของซอฟต์แวร์บน Android บน x86 ที่ยังมีปัญหาอยู่บ้าง โดยเฉพาะแอพที่มีส่วนต้องเขียนแบบเนทีฟ เช่น เกม)</p>\n<p>ASUS ถอนตัวจากมือถือ x86 และกลับมาใช้ ARM กับ Zenfone รุ่นที่สามในปี 2016 ส่วนกูเกิลเองก็แทบไม่พูดถึง x86 บน Android อีกแล้ว (แม้ NDK ของ Android ยังรองรับไบนารี x86 อยู่ก็ตาม)</p>\n<p>หมายเหตุ: จริงๆ แล้วอินเทลเคยมีธุรกิจซีพียู ARM กับเขาด้วยคือแบรนด์ XScale แต่<a href=\"https://www.blognone.com/node/2562\">ขายทิ้งไปก่อนในปี 2006 ให้กับ Marvell</a> ในช่วงก่อนสมาร์ทโฟนบูม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/117e878261626b596968997bea647f48.jpg\" ><br />\nภาพจากงานแถลงข่าว Zenfone ในปี 2014 - <a href=\"https://press.asus.com/PressReleases/p/ASUS-Celebrates-the-Launch-of-ZenFone-in-Southeast-Asia#.YFWFZZ0zZMt\">ASUS</a></p>\n<p>อินเทลยังไม่ยอมแพ้อะไรง่ายๆ ขายหน่วยประมวลผลไม่ได้ ขายชิปโมเด็มอย่างเดียวก็ยังดี จึงเป็นที่มาของการตั้งแผนกชิปโมเด็ม แต่ก็พบข้อจำกัดมากมาย ไม่ว่าจะเป็นปัญหาเทคนิคด้านการส่งสัญญาณไร้สาย ปัญหาสิทธิบัตร และการหาลูกค้า (ที่สุดท้ายมีแค่แอปเปิลเพียงรายเดียว ด้วยเหตุผลว่าแอปเปิลทะเลาะกับ Qualcomm อีกต่างหาก) สุดท้ายในปี 2019 <a href=\"https://www.blognone.com/node/111040\">อินเทลจึงถอนตัวออกจากธุรกิจสมาร์ทโฟนอย่างเต็มตัว ด้วยการขายแผนกชิปโมเด็มให้แอปเปิลรับช่วงต่อ</a></p>\n<p>ความล้มเหลวของอินเทลในตลาดชิปมือถือ ถือว่าแตกต่างจากตลาดจีพียูตรงที่อินเทลมองเห็นเทรนด์ทุกอย่าง แถมยังบุกเข้ามาอย่างค่อนข้างจริงจังด้วย (ต่างจาก Larrabee ที่แหย่ขามาแป๊บเดียวแล้วออกไป)</p>\n<p>แต่แม้พยายามแล้วยังไม่สำเร็จอยู่ดี ผมคิดว่าปัญหาเกิดจาก \"วิธีคิด\" ของอินเทลเองที่พยายามใช้ x86 กับทุกสิ่ง ไม่ว่าจะเป็นสมาร์ทโฟนหรือจีพียู ซึ่งออกจะฝืนๆ แต่ก็เข้าใจได้ว่าบริษัทที่ยิ่งใหญ่มากับ x86 อาจมองไม่เห็นข้อจำกัดของตัวเอง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d28a6c65a87823f05d73d8ef59344520.jpg\" ><em>ชิปโมเด็ม 5G ของอินเทลในปี 2017 - <a href=\"https://newsroom.intel.com/news/intel-introduces-portfolio-new-commercial-5g-new-radio-modem-family/\">Intel</a></em></p>\n<h2>ภัยคุกคามโผล่ทุกแนวรบ</h2>\n<p>การพลาดตลาดเกิดใหม่ที่สำคัญทั้งจีพียูและสมาร์ทโฟน กลับไม่เป็นปัญหาเท่าไรนัก เพราะผลประกอบการของอินเทลยังออกมายอดเยี่ยมเสมอ (ไม่ใช่แค่ดี แต่เรียกว่า \"ยอดเยี่ยม\" เลยด้วยซ้ำ) จากธุรกิจหลักคือ ซีพียูสำหรับพีซีและเซิร์ฟเวอร์ ทำให้อินเทลไม่เคยรู้สึกว่ามันเป็นปัญหา</p>\n<p>แต่ช่วงปลายทศวรรษที่ 2010s ตลาดที่ดูไม่ค่อยเกี่ยวข้องกันอย่างจีพียูและสมาร์ทโฟน กลับเติบโต ขยายตัวจนเข้ามารุกพื้นที่เดิมของอินเทล ทั้งฝั่งพีซี (Apple M1) และเซิร์ฟเวอร์ (จีพียู NVIDIA และเซิร์ฟเวอร์ ARM) เท่านั้นยังไม่พอ ในช่วงที่อินเทลเริ่มสะดุดขาตัวเองจากปัญหา 10nm คู่แข่งหน้าเก่าอย่าง AMD ก็คืนชีพขึ้นมาอีกครั้ง แถมกลับมาอย่างน่ากลัวทีเดียว</p>\n<p>ถ้าลองแยกแนวรบของอินเทลในปัจจุบันออกเป็น 4 ด้านใหญ่ๆ ตามภาพ จะเห็นว่าอินเทลโดนโจมตีในทุกแนวรบ</p>\n<ul>\n<li><strong>ซีพียูสำหรับพีซี</strong> เจอปัญหา 10nm ของตัวเอง, AMD แรงขึ้นมาจาก Ryzen, ลูกค้าเก่า แอปเปิลหันไปทำซีพียูเอง</li>\n<li><strong>ซีพียูสำหรับเซิร์ฟเวอร์</strong> AMD เริ่มกลับมาใหม่ด้วย EPYC, เจอซีพียู ARM มาต่อกร, หน่วยประมวลผลร่วมกลายเป็นตลาดของ NVIDIA</li>\n<li><strong>จีพียู</strong> ตลาดนี้กลายเป็นของ NVIDIA และ AMD</li>\n<li><strong>สมาร์ทโฟน</strong> ตลาดนี้กลายเป็นของ ARM โดยอินเทลถอนตัวออกมาหมดแล้ว</li>\n</ul>\n<p>สิ่งที่น่าสนใจคือ อินเทลไม่สามารถบุกไปในตลาดเกิดใหม่ (จีพียู-สมาร์ทโฟน) ได้ และกลับถูกกินแดนเข้ามาจากทั้งฝั่งจีพียู (NVIDIA) และสมาร์ทโฟน (กองทัพ ARM) ที่เริ่มหลอมรวมกัน โดยเฉพาะอย่างยิ่งคือดีล NVIDIA ซื้อ ARM ที่แสดงให้เห็นชัดเจนว่า NVIDIA ต้องการเข้ามากินแดนของอินเทลทุกด้าน</p>\n<p>นอกจากคู่แข่งหน้าเก่า AMD และ NVIDIA  อินเทลยังเจอคู่แข่งหน้าใหม่เข้ามาอีก 2 รายคือ แอปเปิลที่เคยเป็นลูกค้ากันมายาวนาน กลายมาเป็นคู่แข่งหลังแอปเปิลทำซีพียู M1 ของตัวเอง และ Amazon ที่เป็นลูกค้าอินเทลในฝั่งเซิร์ฟเวอร์ ก็เริ่มออกแบบชิป ARM ใช้เองในชื่อ Graviton ด้วยเหตุผลว่าอัตราประสิทธิภาพต่อพลังงานดีกว่า</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5e48a23ed9ddbfb6595f9b30ca0227b7.png\" ></p>\n<h2>จากรุ่นสู่รุ่น ปัญหาสั่งสมของอินเทลในแต่ละยุคสมัย</h2>\n<p>ทั้งสามหัวข้อข้างต้น คือการบอกว่า อินเทลประสบความสำเร็จอย่างมากในตลาดเซิร์ฟเวอร์ แต่กลับทำไม่ได้อย่างเดียวกันในตลาดจีพียูและมือถือ (น่าจินตนาการว่าถ้าหากทำได้จริงๆ ตอนนี้จะยิ่งใหญ่แค่ไหนกัน) มิหนำซ้ำ อินเทลยังมองเห็นเทรนด์เรื่องจีพียู-มือถือมาล่วงหน้าแล้ว เพียงแต่คว้าโอกาสไม่ได้เอง</p>\n<p>สาเหตุที่อินเทลพลาดตลาดสำคัญทั้ง 2 นี้ คงต้องดูบริบทของอินเทลในยุคนั้นๆ พร้อมทั้งแนวทางของซีอีโอแต่ละคนประกอบกันไปจึงจะเห็นภาพ</p>\n<p>อินเทลเป็นบริษัทที่ก่อตั้งในปี 1968 ปัจจุบันมีอายุ 53 ปีแล้ว ถือว่าเป็นบริษัทเทคโนโลยีที่ \"แก่\" พอสมควร แต่นับถึงปัจจุบัน อินเทลมีซีอีโอมาเพียงแค่ 8 คนเท่านั้นเอง</p>\n<ol>\n<li><strong>Robert Noyce</strong> (1968-1975)</li>\n<li><strong>Gordon Moore</strong> (1975-1987)</li>\n<li><strong>Andrew Grove</strong> (1987-1998)</li>\n<li><strong>Craig Barrett</strong> (1998-2005)</li>\n<li><strong>Paul Otellini</strong> (2005-2013)</li>\n<li><strong>Brian Krzanich</strong> (2013-2018)</li>\n<li><strong>Bob Swan</strong> (2019-2021)</li>\n<li><strong>Pat Gelsinger</strong> (2021-)</li>\n</ol>\n<p>ที่ผ่านมาอินเทลไม่เคยใช้ซีอีโอคนนอกเลยแม้แต่ครั้งเดียว มีเพียงรอบล่าสุดนี้คือ Pat Gelsinger ที่ดึงตัวมาจาก VMware แต่ <a href=\"https://www.blognone.com/node/121216\">Gensinger เองก็เป็นลูกหม้อที่ทำงานกับอินเทลมานาน 30 ปี</a> ก่อนออกไปโตที่อื่น นอกจากนี้ อินเทลยังมีธรรมเนียมการตั้งซีอีโอที่มีพื้นเพจาก \"วิศวกร\" โดยมีซีอีโอเพียง 2 คน (Otellini และ Swan) ที่ไม่เคยทำงานสายเทคนิคมาก่อน</p>\n<p>เราคงไม่ต้องย้อนไปไกลถึงซีอีโอ 3 คนแรก (Noyce, Moore, Grove) ที่เป็นตำนานของบริษัท ผมคิดว่าปัญหาของอินเทลในปัจจุบัน มาจากช่วงรอยต่อของยุค Otellini และ Krzanich ซึ่งต้องพิจารณาสถานการณ์ของอินเทลในยุคนั้นประกอบด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ad1312db8608ba218e533536b3932bbe.jpg\" alt=\"\" /></p>\n<p><em><strong>Paul Otellini</strong> ซีอีโอคนที่ 5 ของอินเทล (2005-2013)</em></p>\n<p>Paul Otellini ซีอีโอคนที่ 5 ของอินเทล (<a href=\"https://www.blognone.com/node/95973\">เพิ่งเสียชีวิตในปี 2017</a>) มีพื้นเพมาจากด้านเศรษฐศาสตร์และบริหารธุรกิจ เขาทำงานกับอินเทลในปี 1974 ทันทีหลังเรียนจบ และทำงานในสายการขาย-การตลาดมาตลอด</p>\n<p>ในจังหวะที่เขาขึ้นเป็นซีอีโอในปี 2005 ตอนนั้นอินเทลกำลังสับสนในตัวเอง เพราะยุคของ Craig Barret ซีอีโอคนก่อนหน้า อินเทลขยายสถาปัตยกรรมจาก x86 เดิม ออกไปในสองแนวทางคือ IA-64 (Itanium) และ ARM (XScale) แต่ไม่ประสบความสำเร็จทั้งคู่ แถมการแบ่งทรัพยากรไปทำอย่างอื่น ยังเปิดโอกาสให้ AMD ที่โฟกัสที่ x86 เป็นหลัก (และออก AMD64 หรือ x86-64 ในปัจจุบัน) มาตีตลาดเดิมของอินเทลอย่างหนัก</p>\n<p>สิ่งที่ Otellini ทำคือขาย XScale ออกไป ปรับโครงสร้างบริษัทใหม่ ลดสายซีพียู x86 ลงมาเหลือสายเดียว ปลดพนักงานเพื่อตัดค่าใช้จ่าย การกลับมาโฟกัสที่ x86 ทำให้อินเทลกลับมาอยู่ในร่องในรอย เมื่อบวกกับท่าไม้ตาย Tick-Tock (ที่ถูกคิดมาในยุคของ Otellini) ซีพียูของอินเทลจึงกลับมานำหน้าอีกครั้ง - <em>รายละเอียดอ่านในบทความ <a href=\"https://www.blognone.com/node/38220\">ช่วงเปลี่ยนผ่านครั้งใหม่แห่งอินเทล: ยุคแห่ง Paul Otellini และความท้าทายครั้งใหม่ </a> ที่คุณ Lew เขียนไว้ในปี 2012</em></p>\n<p>แต่การกลับมาโฟกัสที่ x86 ของ Otellini ก็ทำให้อินเทลพลาดตลาดเกิดใหม่สำคัญ 2 อย่างดังที่กล่าวไปแล้ว นั่นคือ จีพียู (Larrabee) และสมาร์ทโฟน (Atom) ซึ่งเริ่มโครงการในช่วงปลายยุคของเขาทั้งคู่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ccb49aec94b4b868266ae57650fde4b0.jpg\" alt=\"\" /></p>\n<p><em><strong>Brian Krzanich</strong> ซีอีโอคนที่ 6 ของอินเทล (2013-2018)</em></p>\n<p><a href=\"https://www.blognone.com/node/43904\">Brian Krzanich ซีโอโอของอินเทล (ในตอนนั้น) ก้าวขึ้นมารับตำแหน่งซีอีโอต่อจาก Otellini</a> เขาเป็นอีกคนที่เป็นลูกหม้อของบริษัท ทำงานกับอินเทลมายาวนานตั้งแต่ปี 1982 โดยเริ่มจากสายวิศวกรคุมโรงงานผลิตชิป</p>\n<p>Krzanich รับสืบทอดอินเทลที่แข็งแกร่งมาจากยุค Otellini โดยในยุคของเขา อินเทลขยายตัวสู่ธุรกิจใหม่ๆ หลายอย่าง เช่น <a href=\"https://www.blognone.com/node/68989\">การซื้อบริษัท FPGA Altera ในปี 2015 ด้วยราคาสูงถึง 16.7 พันล้านดอลลาร์</a> (เป็นดีลที่ใหญ่ที่สุดของอินเทลในปัจจุบัน) และ<a href=\"https://www.blognone.com/node/90892\">การซื้อบริษัทรถยนต์ไร้คนขับ Mobileye ของอิสราเอล ที่เคยทำระบบให้ Tesla ในยุคแรกๆ ด้วยราคาใกล้ๆ กัน (15.3 พันล้านดอลลาร์) เมื่อปี 2017</a></p>\n<p>อย่างไรก็ตาม Krzanich ไม่ได้แก้ปัญหาอะไรมากนักกับตลาดจีพียูที่ตกขบวนไป (เพิ่งกลับมาประกาศทำ Xe ในปี 2018 ท้ายยุคของเขาแล้ว) และตลาดมือถือที่ต้องถอนตัวออกมาอย่างเจ็บปวด</p>\n<p>ยุคของ Krzanich ยังเป็นจุดเริ่มต้นของปัญหาที่เป็นใจกลางของบริษัทคือ Tick-Tock ถึงทางตัน (ตามที่กล่าวไปในบทความตอนแรก ปัญหาของ Tick-Tock เริ่มต้นในปี 2016 แล้วลากยาวมาจนถึงปัจจุบัน) ทำให้อินเทลสูญเสียความสามารถในการแข่งขันไปพอสมควร เปิดช่องให้พันธมิตร AMD-TSMC แซงหน้าได้</p>\n<p>แต่ Krzanich ยังไม่ทันแก้ปัญหาเหล่านี้ได้เสร็จ เขาก็มีอันต้องไปซะก่อน <a href=\"https://www.blognone.com/node/103337\">จากปัญหาชู้สาวในที่ทำงาน ซึ่งเกิดขึ้นก่อนช่วงเขาขึ้นมาเป็นซีอีโอ</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a95d040ef7c8fb1788121f527a9189d4.jpg\" alt=\"\" /></p>\n<p><em><strong>Bob Swan</strong> ซีอีโอคนที่ 7 ของอินเทล (2019-2021)</em></p>\n<p>Bob Swan ซีอีโอคนที่เจ็ดของอินเทล ถือเป็นคนแรกที่ไม่ได้เป็นลูกหม้อของบริษัทมายาวนาน เขาทำงานในสายการเงินมาตลอด เป็นซีเอฟโอ (CFO) ของหลายบริษัท ก่อนเข้ามาเป็นซีเอฟโอของอินเทลในปี 2016 ก่อนหน้า Krzanich ลาออกเพียง 2 ปี</p>\n<p>เมื่อ Krzanich เกิดเหตุพลิกผัน <a href=\"https://www.blognone.com/node/107872\">ทำให้ Swan ต้องรักษาการชั่วคราว และได้ขึ้นมาเป็นซีอีโอคนที่เจ็ดของบริษัทในช่วงต้นปี 2019</a> และอยู่ในตำแหน่งนี้สั้นๆ เพียง 2 ปี ก่อนประกาศลงจากตำแหน่งช่วงต้นปี 2021 เพื่อส่งไม้ต่อให้ Pat Gelsinger</p>\n<p>ในยุคของ Swan อินเทลทำได้เพียงประคองตัวจาก AMD, ยังไม่สามารถแก้ปัญหา 10nm ได้, <a href=\"https://www.blognone.com/node/113408\">มีปัญหาชิปขาดแคลนเข้ามาเพิ่มอีก</a> แต่ในอีกทาง เขาก็พาอินเทลถอนตัวจากตลาดที่ไม่ทำเงิน <a href=\"https://www.blognone.com/node/107894\">เลิกขาย Itanium</a>, <a href=\"https://www.blognone.com/node/111040\">ขายธุรกิจชิปโมเด็มให้แอปเปิล</a> หันไปโฟกัสที่<a href=\"https://www.blognone.com/node/108988\">ธุรกิจใหม่ๆ นอกจากซีพียูพีซีแบบดั้งเดิม</a> และไม่ว่าจะมีปัญหารุมเร้ามากแค่ไหน <a href=\"https://www.blognone.com/node/114295\">อินเทลในยุคของ Swan มีรายได้เพิ่มต่อเนื่องเป็นประวัติการณ์</a></p>\n<p>ถ้ามองในแง่ผลประกอบการเพียงอย่างเดียว การประคองตัวของ Bob Swan ทำออกมาได้ยอดเยี่ยม แต่ทุกคนก็คงรู้ว่าภาวะนี้คงอยู่ได้อีกไม่นาน เมื่อรักษาเสถียรภาพของบริษัทได้ในระดับหนึ่งแล้ว Swan จึงหลีกทางให้กับ Pat Gelsinger ความหวังที่จะมากอบกู้อินเทลให้กลับมายิ่งใหญ่อีกครั้ง</p>\n<p>ในอุตสาหกรรมไอทีตอนนี้คงไม่มีใครเหมาะกว่า Gelsinger อีกแล้ว เพราะเขาเคยทำงานกับอินเทลมานาน 30 ปี อยู่ในทีมออกแบบซีพียู 386/486 และเคยเป็น CTO คนแรกของบริษัทด้วย หลังจากนั้น Gelsinger ออกไปทำงานสายบริหาร โดยเป็น COO ของ EMC และเป็น CEO ของ VMware ระหว่างปี 2012-2021 ผลงานของเขาที่ VMware คงพิสูจน์ชัดเจนว่าเขามีความสามารถมากพอในฐานะซีอีโอ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8b9075a57fbe50546a66585558ff7d96.jpg\" alt=\"\" /></p>\n<p><em><strong>Pat Gelsinger</strong> ซีอีโอคนที่ 8 ของอินเทล (2021-ปัจจุบัน)</em></p>\n<h3>ทางรอดของอินเทลในยุค Pat Gelsinger</h3>\n<p>ต้องบอกว่า Pat Gelsinger รับช่วงอินเทลที่มีความพิเศษมากๆ มาจาก Bob Swan</p>\n<p>ความพิเศษสามารถแบ่งได้ 3 ข้อดังนี้</p>\n<p>อย่างแรกคือ <strong>รวยมาก</strong></p>\n<p>อินเทลปี 2020 ทีโดนรุมกินโต๊ะจากทุกฝ่าย มีรายได้ตลอดทั้งปี 77.9 พันล้านดอลลาร์ (2.4 ล้านล้านบาท!) เติบโตขึ้น 8% จากปี 2019 และมีอัตรากำไรสูง (operating margin) ถึง 30.4% ถ้านับเฉพาะกำไรของปี 2020 คือ 20.9 พันล้านดอลลาร์ (6.4 แสนล้านบาท) มีกระแสเงินสดในมือ ณ สิ้นปี 2020 ที่ 5.8 พันล้านดอลลาร์</p>\n<p>เรียกได้ว่าอินเทลยุค \"ขาลง\" ช่วงนี้ ต่างชั้นไปจากบริษัทช่วงขาลงรายอื่นๆ อย่างมาก (เช่น AMD ช่วงขาลง) ทำให้ Gelsinger สบายไปหลายสิบอย่าง ไม่ต้องโดนผู้ถือหุ้นกดดันให้เร่งทำกำไร และมีเงินไปซื้อกิจการมาเติมเต็มได้เหลือเฟือ</p>\n<p>อย่างที่สองคือ อินเทลมีบทเรียนจากการตกรถไฟขบวนจีพียู-มือถือ ทำให้เตรียมลงทุนเพื่อยุคสมัยหน้าไว้แล้วตั้งแต่ยุคของ Kzranich</p>\n<ul>\n<li><strong>ธุรกิจจีพียู</strong> กำลังจะคัมแบ็คกลับมาอีกครั้งด้วย Xe ซึ่งหัวหน้าโครงการนี้คือ Raja Koduri ที่ดึงตัวมาจาก AMD และอยู่กับ ATI มาตั้งแต่ยุคแรกเริ่ม ถ้าจะมีใครต้านทานพลังอำนาจของ NVIDIA ได้ ก็คงมีแต่ Raja คนนี้แหละ</li>\n<li><strong>ธุรกิจ FPGA</strong> เคยตกรถกับจีพียูมาแล้วคงไม่พลาดอีก อินเทลจึงไปซื้อบริษัทด้าน FPGA-ASIC มาหลายราย เช่น <a href=\"https://www.blognone.com/node/68989\">Altera</a> และ eASIC ตอนนี้เริ่มมีผลิตภัณฑ์ออกมาบ้างแล้วคือ <a href=\"https://www.blognone.com/node/108988\">Agilex</a></li>\n<li><strong>ธุรกิจ IoT</strong> มี Atom เป็นหัวหอกมาตั้งแต่แรก และเสริมด้วยชิปเฉพาะทาง computer vision อย่าง Movidius</li>\n<li><strong>ธุรกิจรถยนต์ไร้คนขับ</strong> ซื้อกิจการ Mobileye ตอนนี้โลกน่าจะมีผู้เล่นรายใหญ่ในตลาดนี้แค่ 2 รายหลักๆ คือ Intel และ NVIDIA</li>\n</ul>\n<p>นอกจากนี้อินเทลยังมีธุรกิจข้างเคียงอื่นๆ อีก เช่น หน่วยความจำ-สตอเรจ (Optane) ชิปไร้สาย-เครือข่ายอีกจำนวนหนึ่งด้วย</p>\n<p>อย่างที่สามคือ สภาพแวดล้อมในตลาดโลกที่เอื้อต่อการทำธุรกิจ มีทั้งกระแส work from home ทำให้อุปกรณ์อิเล็กทรอนิกส์กลับมาขายดี (ไม่มีปัญหาขายไม่ออก แต่เป็นปัญหากลับกันคือของขาดตลาดแทน) และ<a href=\"https://www.blognone.com/node/121162\">นโยบายของสหรัฐอเมริกายุค Joe Biden ที่สนับสนุนการผลิตชิปในประเทศ</a> อินเทลที่เป็นบริษัทอเมริกัน มีโรงงานของตัวเองในสหรัฐอเมริกาอยู่แล้ว ย่อมได้เปรียบมากกว่าคู่แข่งทั้ง AMD/NVIDIA ที่ต้องพึ่งพาบริษัทต่างชาติ (TSMC, Samsung) ช่วยผลิตชิป <a href=\"https://www.blognone.com/node/120780\">แม้บริษัทเหล่านี้กำลังเร่งขยายโรงงานในอเมริกาก็ตาม</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/134915d9565f5e8912ea0573314d7a07.jpg\" ></p>\n<p>ปัจจัยทั้ง 3 ข้อช่วยให้งานของ Pat Gelsinger ไม่ยากจนเกินไป คำถามถัดมาคือ Gelsinger จะเลือกทำอะไรบ้าง ผมคิดว่าคนที่คุ้นเคยกับอินเทลมายาวนานแบบเขา คงมีแนวทางในใจอยู่แล้ว แต่ถ้าให้คาดเดา หลายอย่างก็ชัดเจนว่าต้องทำอะไรบ้าง</p>\n<p>สิ่งแรกที่ต้องทำแน่ๆ คือ <strong>แก้ปัญหาเรื่อง 10nm</strong> ที่เป็นแกนกลางของทุกสิ่งให้จงได้ เราไม่รู้ว่าสถานะความคืบหน้าภายในบริษัทเป็นอย่างไร แต่ Gelsinger เข้ามากลางทางก็คงไม่สามารถปรับเปลี่ยนอะไรได้มากนัก ทำได้เพียงอดทนรอ</p>\n<p>ถัดมาคือออกผลิตภัณฑ์หลักคือ <strong>ซีพียูให้กลับมาเป็นเบอร์หนึ่งได้อีกครั้ง</strong> เรื่องนี้อินเทลโม้เอาไว้ว่าจะกลับมาพร้อม <a href=\"https://www.blognone.com/node/120539\">Alder Lake ในช่วงปลายปี 2021</a> ที่เปลี่ยนทั้งสถาปัตยกรรมใหม่ และใช้กระบวนการผลิต 10nm ครั้งแรกสำหรับเดสก์ท็อป (เรียกว่า Tick+Tock พร้อมกันในรอบเดียว อั้นมานาน) จะทำได้จริงแค่ไหนต้องรอดูกันตอนปลายปี</p>\n<p>อย่างที่สามคือ <strong>เร่งผลักดัน Xe ให้ติดตลาดโดยเร็ว</strong> เพราะเป็นสิ่งที่จำเป็นต้องทำ และมีของพร้อมอยู่แล้ว ในแผนการ roadmap ของอินเทลเองที่เรียกว่า <a href=\"https://www.intc.com/strategic-priorities\">Six Pillars of Technology Innovation</a> ให้ความสำคัญกับกระบวนการผลิต (Process &amp; Packaging) เป็นอันดับแรก ส่วนแผนลำดับสองคือ <a href=\"https://newsroom.intel.com/news/intel-xpu-vision-oneapi-server-gpu/#gs.v64ugv\">XPU หรือการทำงานข้าม 4 สถาปัตยกรรมประมวลผล (CPU, GPU, FPGA และอื่นๆ)</a> ด้วย <a href=\"https://www.blognone.com/node/118698\">oneAPI ตัวเดียวกันหมด ตั้งแต่โน้ตบุ๊กไปจนถึงซูเปอร์คอมพิวเตอร์</a></p>\n<p>แผนการฟังดูสวยหรู แต่ในความเป็นจริงก็ไม่ง่ายเพราะตลาดนี้เป็นของ NVIDIA อยู่ก่อนแล้ว สิ่งที่อินเทลต้องทำคือเร่งออก Xe ในทุกระดับคลาส และออก Xe สำหรับเดสก์ท็อปเกมมิ่งที่เป็นเรือธงในใจ ให้ทุกคนจดจำ Xe ได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/948a2f97fc2b0d2a419e42aa3c87d3a2.jpg\" ></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1197f6a3d3aef37b1ec5d185de1600c2.jpg\" ></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1ba2ca511bf907cebd7a917b597239bb.jpg\" alt=\"\" /></p>\n<p>ในระยะถัดไป เราจะค่อยๆ เห็นอินเทลเปลี่ยนแปลงโมเดลการผลิต-ออกแบบซีพียูของตัวเอง ที่เคยผูกพันกันอย่างแนบแน่น (coupled) ให้ผ่อนคลายมากขึ้น เมื่อช่วงปลายปี 2020 Raja Koduri ในฐานะประธานฝ่ายสถาปัตยกรรม ก็ออกมาเล่า \"แนวทางใหม่\" ของอินเทล ที่จะทำ 3 เรื่องคือ XPU (Xe+Agilex), Software (OneAPI) และกรอบด้านบนสุดในภาพคือเปลี่ยนจาก coupled design มาเป็น resilient design</p>\n<p>Koduri ไม่ได้พูดถึงเรื่องนี้เยอะมากนัก เพราะเน้นไปที่ XPU และ Xe มากกว่า แต่ความหมายของมันคือ กระบวนการออกแบบซีพียูของอินเทลจะต้องยึดโยงกับกระบวนการผลิตน้อยลง และในอีกทาง <a href=\"https://www.blognone.com/node/120745\">อินเทลก็ต้องเริ่มออกไปใช้โรงงานภายนอกช่วยผลิตด้วย</a> ซึ่งเริ่มทำไปแล้วกับ<a href=\"https://www.blognone.com/node/120922\">การผลิต Xe ในบางรุ่นย่อย</a> (จ้าง TSMC ผลิตบางส่วน)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5d65b3d0a59cfd8335ed74c7cff45cfa.jpg\" ></p>\n<p>แผนการผลิต Xe บางรุ่นที่ระบุว่าใช้ \"external\" โรงงานอื่นผลิต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/960e7f1aceaf7c280a65f4aef54a4835.jpg\" alt=\"\" /></p>\n<p>นอกจากนี้ เรายังน่าจะได้เห็น Gelsinger ซื้อกิจการครั้งใหญ่ๆ ที่เป็น strategic acquisition ด้วย (ลักษณะเดียวกับที่ NVIDIA ซื้อ Arm Inc.) เพียงแต่ยังไม่น่าจะเกิดในระยะอันใกล้นี้ คงต้องรอให้ Gelsinger เก็บกวาดปัญหาภายในให้เสร็จก่อน</p>\n<p>หมายเหตุ: <a href=\"https://newsroom.intel.com/news-releases/media-alert-engineering-future/\">Gelsinger มีนัดแถลงข่าวครั้งแรกในฐานะซีอีโอวันที่ 23 มีนาคม 2021 นี้</a> รอดูกันว่าเขาจะประกาศอะไรบ้าง</p>\n<h3>บทส่งท้าย: Only the Paranoid Survive</h3>\n<p>เมื่อพูดถึงการปรับตัวของอินเทล คงต้องย้อนกลับไปที่หนังสือ Only the Paranoid Survive ของ Andrew Grove ที่เล่าถึงการหนีตายครั้งสำคัญของอินเทลในยุค 80s ที่เลิกทำธุรกิจหน่วยความจำ ผันตัวมาทำซีพียูอย่างเดียว และกลายเป็นจุดเปลี่ยนครั้งสำคัญในประวัติศาสตร์ของอินเทล</p>\n<p>เวลาผ่านมากว่า 30 ปี บริบทของอินเทลและตลาดเซมิคอนดักเตอร์เปลี่ยนไปจากยุคนั้นมากแล้ว แต่แนวคิดของ Grove น่าจะยังใช้ได้ดีอยู่เสมอ</p>\n<p>คำพูดเต็มๆ ของ Grove คือ ความสำเร็จของธุรกิจมีเมล็ดพันธุ์แห่งความพังทลายอยู่ในนั้น ความสำเร็จนำมาซึ่งความพึงพอใจ ความพึงพอใจนำไปสู่ความล้มเหลว มีเพียงผู้ที่ระแวงเท่านั้นที่อยู่รอด</p>\n<blockquote><p>Success breeds complacency. Complacency breeds failure. Only the paranoid survive.</p>\n</blockquote>\n<p>Pat Gelsinger ทำงานกับอินเทลในปี 1979 และได้มีโอกาสมองเห็นเหตุการณ์ที่ Grove พลิกวิกฤตเป็นโอกาสอย่างใกล้ชิด ซึมซับการทำงานของ Grove ตลอดสมัยที่เขาเป็นซีอีโอ</p>\n<p>42 ปีต่อมา Pat Gelsinger คนเดิมกลับเข้ามาที่อินเทล ในตำแหน่งเดียวกับ Grove ยุคนั้น แต่เป็นช่วงเวลาที่อินเทลจำเป็นต้องปรับเปลี่ยนตัวเองครั้งใหญ่อีกรอบ</p>\n<p>เขาน่าจะเป็นคนที่ตระหนักถึงเรื่องนี้ดีกว่าใครๆ</p>\n<p><strong>Only the Paranoid Survive</strong></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/63c830cc4e1e1fcac90ac086fd9422d3.jpg\" ></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/intel\">Intel</a></div><div class=\"field-item odd\"><a href=\"/topics/special-report\">Special Report</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cc27b842ae949b8d47d1c10306a51fd2ee7256c91da1eb539f18eda1689d4a0e","category":"Thai"}