{"title":"Global Review on Environmental Impacts of Onshore Wind Energy and Their Implications for Forest Ecosystems","link":"https://www.preprints.org/manuscript/202405.1727/v1","date":1716797348000,"content":"Deploying onshore wind energy as a cornerstone of future global energy systems challenges societies and decision-makers worldwide. Expanding wind energy should contribute to a more sustainable electricity generation without harnessing humans and their environment. Opponents often highlight the negative environmental impacts of wind energy to impede its expansion. This study reviews 152 studies to synthesize, summarize, and discuss critically the current knowledge, research gaps, and mitigation strategies on the environmental impacts of onshore wind energy. The investigated effects comprise impacts on the abiotic and biotic environment, with birds and bats in particular, noise and visual impacts. Effects are discussed in the context of social acceptance, other energy technologies, and wind energy expansion in forests. The review illustrates that many effects are highly case-specific and must be more generalizable. Studies are biased regarding the research focus and areas, needing more standardized research methods and long-term measurements. Most studies focus on the direct mortality of birds and bats at wind farms and are concentrated in Europe and North America. Knowledge gaps persist for many impact categories, and the efficacy of mitigation strategies has yet to be proven. More targeted, unbiased research is required that allows for an objective evaluation of the environmental impacts of wind energy and strategies to mitigate them. Impacts, such as those on biodiversity, need to be addressed in the context of other anthropogenic influences and the benefits of wind energy. This forms the basis for a socially acceptable, efficient, and sustainable expansion of wind energy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cc3774352d1afe3ffcb23de307d1ed69271143b5fb769772be883f91387a7c6d","category":"Interdisciplinary"}