{"title":"Google Spends $26 Billion Annually to Be the Default Search Engine Almost Everywhere (and Most of It Goes to You Know Who)","link":"https://www.theverge.com/2023/10/27/23934961/google-antitrust-trial-defaults-search-deal-26-3-billion","date":1698438714000,"content":"\n<p>David Pierce, writing for The Verge:</p>\n\n<blockquote>\n  <p>The <a href=\"https://www.theverge.com/23869483/us-v-google-search-antitrust-case-updates\"><em>U.S. v. Google</em> antitrust trial</a> is about many things, \nbut more than anything, it’s about the power of defaults. Even if \nit’s easy to switch browsers or platforms or search engines, the \none that appears when you turn it on matters a lot. Google \nobviously agrees and has paid a staggering amount to make sure it \nis the default: testimony in the trial revealed that Google spent \na total of $26.3 billion in 2021 to be the default search engine \nin multiple browsers, phones, and platforms. [...] </p>\n\n<p>Just to put that $26.3 billion in context: Alphabet, Google’s \nparent company, announced in <a href=\"https://www.theverge.com/2023/10/24/23929496/google-alphabet-q3-2023-earnings-ads-ai-sge\">its recent earnings report</a> \nthat Google Search ad business brought in about $44 billion over \nthe last three months and about $165 billion in the last year. Its \nentire ad business — which also includes YouTube ads — made a \nbit under $90 billion in profit. This is all back-of-the-napkin \nmath, but essentially, Google is giving up about 16 percent of its \nsearch revenue and about 29 percent of its profit to those \ndistribution deals. </p>\n\n<p>Most of that money, of course, goes to Apple. The New York Times \nrecently reported that Google’s deal to be the default search \nengine in Safari across Google products cost the company <a href=\"https://www.theverge.com/2023/10/26/23933206/google-apple-search-deal-safari-18-billion\">about \n$18 billion</a> in 2021. </p>\n</blockquote>\n\n<p>Goldman Sachs analysts have been estimating this number for years, and $18 billion in 2021 is pretty much in line with their estimates. (Goldman <em>conservatively</em> estimates about $17 billion in <a href=\"https://www.investopedia.com/terms/t/traffic-acquisition-cost-tac.asp\">TAC</a> payments from Google to Apple for this year, 2023. That would be the low end — Apple gets <em>at least</em> that much from Google for their partnership on this.)</p>\n\n<p>Apple reports this revenue under Services, which has <a href=\"https://sixcolors.com/post/2023/08/charts-apple-q3-2023-results/\">just grown past $20 billion per quarter</a> for Apple. So somewhere between 20-25 percent of Apple’s Services revenue comes from these payments from Google alone. You can see why <a href=\"https://www.theverge.com/2023/9/26/23891037/apple-eddy-cue-testimony-us-google\">Apple is rooting for Google</a> in this lawsuit.</p>\n\n<p>This whole partnership with Google is the weakest link in Apple’s overall privacy stance. Google generates so much money from search through user tracking that Apple would consider contrary to its own internal values. If Apple were to run its own search engine, it would be <em>far</em> more private than Google Search. But instead they partner with Google, set Google as the default for Safari on all platforms, and share in Google’s profit to the tune of around $20 billion/year.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/10/27/google-aggregate-search-default\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"cc3819d640b89f3a395dc513550c6c580aef0ec2e254020a14f7ee8b5eb7bcfe","category":"Tech"}