{"title":"Global meta‐analysis of demersal fishing impacts on organic carbon and associated biogeochemistry","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12855?af=R","date":1723227296000,"content":"<h2>Abstract</h2>\n<p>The potential threat of fisheries on seabed carbon is a topic of growing concern, yet existing literature presents inconsistencies leaving experts divided on the topic. We conducted a global meta-analysis to synthesize the current knowledge and quantify how demersal fishing impacts various biogeochemical properties. Direct impact studies revealed overall reductions in chlorophyll-a (Chl-a, 17%), phaeopigments (24%), and proteins (32%). Effects on these reactive compounds were more pronounced on surface sediment (0–2 cm), where the impact on total organic carbon (TOC) also became significant, demonstrating the effect of gear penetration, and highlighting that sampling strategies combining sediment layers can mask observed effects. Current velocity and primary productivity significantly influenced the direction and magnitude of fishing impacts. Trawling-induced subsurface reductions of TOC in low-energy habitats may affect carbon sequestration due to the preferential removal of semi-reactive carbon. Intriguingly, fishing intensity gradient studies showed an average increase in TOC in chronically fished areas, possibly reflecting fishing preferences for meso-eutrophic grounds. We estimate a ~300-day recovery period post-fishing for Chl-a, though values for other parameters are less certain. Limited data on seasonality, gear types, and an under-representation of studies in tropical and deep-sea areas pose challenges to quantifying global scale geochemical impacts of demersal fisheries. Knowledge gaps persist in understanding the fate of disturbed organic matter including its mineralization, transport, and sequestration. Nonetheless, our insights and estimates provide foundational knowledge that can contribute to science-based approaches for spatial fisheries management while preserving natural carbon dynamics on the seabed.</p>","author":"Justin Tiano, \nEmil De Borger, \nSarah Paradis, \nClare Bradshaw, \nClaudia Morys, \nAntonio Pusceddu, \nClaudia Ennas, \nKarline Soetaert, \nPere Puig, \nPere Masqué, \nMarija Sciberras","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"cc4975da3d52ab4520c7cc5d11ea28dc60403471ecf840dfe6677f1a9dac5a31","category":"Environment"}