{"title":"Cephalometric Evaluation of Children with Short Stature of Genetic Etiology. A Review","link":"https://www.preprints.org/manuscript/202405.1588/v1","date":1716542273000,"content":"Introduction: A plethora of biological molecules regulate chondrogenesis in the epiphyseal growth plate. Disruptions of quantity and function of these molecules can manifest clinically as stature abnormalities of various etiologies. Traditionally, the growth hormone/insulin-like growth factor 1 (IGF1) axis represents the etiological center of final stature attainment. Of note, little is known about the molecular events that dominate the growth of the craniofacial complex and its correlation with somatic stature.\nAim: Given the paucity of the relevant data, this review discusses available information regarding potential applications of lateral cephalometric radiography as a potential clinical indicator of genetic short stature in children.\nMaterials and Methods: A literature search was conducted in the PubMed electronic database using the key words: cephalometric analysis and short stature; cephalometric analysis and achondroplasia; cephalometric analysis and hypochondroplasia; cephalometric analysis and skeletal abnormalities; cephalometr* and SHOX; cephalometr* and CNP; cephalometr* and ACAN; cephalometr* and CNVs; cephalometr* and IHH; cephalometr* and FGFR3; cephalometr* and Noonan syndrome; cephalometr* and “Turner syndrome”; cephalometr* and achondroplasia.\nResults: In individuals with genetic syndromes causing short stature, linear growth of the craniofacial complex is confined, following the pattern of somatic short stature regardless of its etiology. The angular cephalometric measurements differ from the average height normal individuals and are suggestive of a posterior placement of the jaws and a vertical growth pattern of the face.\nConclusion: The greater part of the existing literature regarding cephalometric measurements in short statured children with genetic syndromes provides qualitative data. Furthermore, cephalometric data for individuals affected with specific rare genetic conditions causing short stature, should be the focus of future studies. These quantitative data are required to potentially establish cut-off values to refer for genetic testing based on craniofacial phenotypes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cc4acb1275750abed912365db6a0b052a7a422015983b370c72c94975e38abd3","category":"Interdisciplinary"}