{"title":"Assessing the suitability of under-represented tree species for multifunctional forest management—an example using economic return and biodiversity indicators","link":"https://academic.oup.com/forestry/article/97/2/255/7231022?rss=1","date":1690243200000,"content":"<span><div>Abstract</div>A shifting focus in forest management from timber production to resilience and multifunctionality in the face of changing disturbance regimes might entail altering the species composition of forests. Although the conifers Douglas fir (<span>Pseudotsuga menziesii</span>) and silver fir (<span>Abies alba</span>) currently comprise only a small proportion of Central European forests, the prospect of widespread planting of these species as a climate adaptation measure is currently widely debated by forest managers. To inform this debate, objective assessments of the multifunctional value of these species are required. Here, we introduce Pareto frontiers to objectively assess the value of tree species under competing objectives and considering an uncertain future. Using these frontiers, we explore trade-offs between financial performance and biodiversity aspects of German tree species portfolios with and without these currently rare conifers. We compare several potential biodiversity indicators (related to herbivores, saproxylic beetles, and deadwood decomposition rates) that can be derived from standard forest inventory data. Our results indicate that optimizing the biodiversity indicators generates gradual decreases in financial performance at first, but after an inflection point soil rent declines sharply. Portfolios excluding Douglas fir and silver fir achieved comparable biodiversity levels, but much weaker financial performance, than portfolios that included these conifers. Our novel approach of generating Pareto frontiers that integrate uncertainty can offer useful insights into ecosystem services trade-offs in contexts where risk is unequally distributed across management alternatives.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"cc4e68d8eadcfbab6b6b12355107bcbbb5430e68dbdb5430e8db591b76cfc1b4","category":"Environment"}