{"title":"MacBook Air M3: Todo lo que necesitas saber","link":"https://www.macworld.com/article/2017011/macbook-air-m3.html","date":1690992250000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>En julio, Mark Gurman, de Bloomberg, informó que Apple podría lanzar una actualización del MacBook Air de 13 pulgadas este mismo otoño. Este nuevo portátil probablemente sustituirá al actual MacBook Air de 13 pulgadas M2, que cuesta 1.298,85 €. Gurman no mencionó el MacBook Air de 15 pulgadas, que se presentó en julio de 2023, pero sería inusual que ambos Macs estuvieran en el mismo calendario de actualizaciones. </p>\n\n\n\n<p>En este artículo encontrarás todo lo que necesitas saber sobre la próxima generación del MacBook Air, incluidos los últimos rumores, especulaciones basadas en la información actual y el historial de Apple, y datos confirmados.</p>\n\n\n\n<h2>¿Qué pasa con el MacBook Air de 15 pulgadas?</h2>\n\n\n\n<p>Verás que<strong> Gurman solo ha mencionado el MacBook Air de 13 pulgadas. </strong>Sería una decisión extraña por parte de Apple actualizar el MacBook Air de 13 pulgadas más barato a un M3 y dejar intacto el MacBook Air de 15 pulgadas, por lo que prevemos que ambos se actualizarán al mismo tiempo. </p>\n\n\n\n<p>Pero es posible que Gurman, que parece tener acceso a muchos secretos de Apple, tenga razón y Apple actualice inicialmente solo el MacBook Air de 13 pulgadas, dejando el MacBook Air para una actualización posterior. Seguramente la única razón para hacerlo sería dar al MacBook Air de 15 pulgadas una actualización del M3 Pro, pero creemos que es poco probable ya que esperamos que ambos reciban las mismas actualizaciones (M3, Wi-FI 6E, etc.).</p>\n\n\n\n<h2>MacBook Air M3: Fecha de lanzamiento</h2>\n\n\n\n<p>En julio de 2023, Mark Gurman de Bloomberg informó de que <a href=\"https://www.macworld.com/article/1452674/proximo-evento-apple-2.html\">Apple está planeando un evento </a>en octubre que “podría presentar los primeros Macs con chips M3” y mencionó el MacBook Air de 13 pulgadas, junto con el MacBook Pro de 13 pulgadas y el iMac como las primeras máquinas en conseguirlo. El actual MacBook Air de 13 pulgadas M2 salió a la venta en julio de 2022, lo que significaría que una actualización M3 en octubre llegaría unos 15 meses después de que la versión M2 saliera al mercado.</p>\n\n\n\n<p>Sin embargo, Apple presentó el MacBook Air de 15 pulgadas con M2 en junio de 2023. Una actualización del MacBook Air de 15 pulgadas solo cuatro meses después sería inusual e invitaría a preguntarse por qué Apple presentó el modelo de 15 pulgadas en la WWDC y no se limitó a esperar hasta que el modelo M3 pudiera lanzarse. </p>\n\n\n\n<p>Apple podría ignorar el MacBook Air de 15 pulgadas y actualizarlo a M3 en algún momento después de que se actualice el modelo de 13 pulgadas, pero esto sería una propuesta confusa para los consumidores que no querrían gastar más en el modelo menos potente para beneficiarse de la pantalla más grande. </p>\n\n\n\n<p>Sobre esta base, no esperamos la actualización del MacBook Air a la que apunta Gurman, creemos que Apple esperará hasta la primavera de 2024 y actualizará ambos modelos de MacBook Air al mismo tiempo. </p>\n\n\n\n<h2>MacBook Air M3: Precio</h2>\n\n\n\n<p>Por el momento, no se ha informado sobre el precio del MacBook Air M3. Cuando Apple lanzó el <a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-2017011-1-0-0&amp;u=https://www.apple.com/es/shop/buy-mac/macbook-air/13-pulgadas-m2\" target=\"_blank\">MacBook Air M2 de 15 pulgadas</a> en junio, la compañía redujo el precio del modelo de 13 pulgadas. Apple podría aprovechar la actualización del M3 para volver a subir el precio, pero esperamos que se mantenga al mismo precio.</p>\n\n\n\n<p>El precio y las especificaciones del MacBook Air M3 de 13 pulgadas probablemente seguirán los del actual MacBook Air M2 de 13 pulgadas o se acercarán a ellos. Como referencia, estos son los precios y especificaciones de las configuraciones estándar del MacBook Air M2 de 13 pulgadas:</p>\n\n\n\n<ul>\n<li>Chip M2 con CPU de 8 núcleos/8 GPU de 8 núcleos, 8 GB de memoria, SSD de 256 GB: 1.298,85 €</li>\n\n\n\n<li>Chip M2 con CPU de 8 núcleos y GPU de 10 núcleos, 8 GB de memoria y SSD de 512 GB: 1.648,85 €</li>\n</ul>\n\n\n\n<p>Apple también vende el <a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-2017011-1-0-0&amp;u=https://www.apple.com/es/shop/buy-mac/macbook-air/13-pulgadas-m1\" target=\"_blank\">MacBook Air M1 de 13 </a>pulgadas por los mismos 1.218,85 € que costaba cuando se lanzó en octubre de 2020. Es posible que Apple descontinúe el MacBook Air M1 mientras baja el precio del modelo M2 a 999 € cuando llegue el M3.</p>\n\n\n\n<p>El MacBook Air M3 de 13 pulgadas estará disponible a través de los puntos de venta habituales una vez que salga a la venta: la Apple Store, Amazon y otros minoristas populares. Puedes encontrar los mejores precios para un nuevo MacBook Air en nuestro <a href=\"https://www.macworld.com/article/1453518/ofertas-macbook.html\">artículo sobre ofertas de MacBook Air.</a></p>\n\n\n\n<h2>MacBook Air M3: Diseño</h2>\n\n\n\n<p>Cuando Apple lanzó el MacBook Air M2 de 13 pulgadas, también le dio un rediseño completo por primera vez. Eliminó el diseño cónico e implementó un aspecto tradicional similar al del MacBook Pro de 14 pulgadas.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4352514_original.jpg?quality=50&amp;strip=all\" alt=\"Macbook Air M2 in Schwarz aufgeklappt auf einem Tisch\" loading=\"lazy\" /><figcaption><p>El MacBook Air M3 de 13 pulgadas tendrá el mismo diseño que el actual modelo M2.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Debido a que este nuevo diseño solo ha pasado por una generación del Air, no esperamos que Apple cambie mucho con la actualización M3. Eso está bien porque ya es uno de los más finos y ligeros que se pueden comprar:</p>\n\n\n\n<ul>\n<li>MacBook Air M2 de 15 pulgadas: 34,04 x 23,76 x 1,15 cm y 1,51 kg </li>\n\n\n\n<li>MacBook Air M2 de 13 pulgadas: 30,41 x 21,5 x 1,13 cm y 1,24 kg </li>\n\n\n\n<li>MacBook Air M1 de 13 pulgadas: 30,41 x 21,24 x 0,41-1,61 cm y 1,29 kg</li>\n</ul>\n\n\n\n<h2>MacBook Air M3: Pantalla</h2>\n\n\n\n<p>Es probable que el MacBook Air M3 utilice la misma pantalla que el modelo M2. Para el MacBook Air de 13 pulgadas Apple utiliza una pantalla Liquid Retina de 13,6 pulgadas con una resolución de 2.560 por 1.664 píxeles, un brillo máximo de 500 nits, soporte de color P3 y True Tone, un paso adelante respecto a las utilizadas en el MacBook Air de 13 pulgadas M1 y el MacBook Pro de 13 pulgadas, que utilizan una pantalla Retina de 13,3 pulgadas con una resolución de 2.560 por 1.600 píxeles. El brillo de la pantalla del Air M1 es de 400 nits, mientras que la del Pro de 13 pulgadas es de 500 nits.</p>\n\n\n\n<p>El MacBook Air M3 también mantendrá probablemente la muesca en la parte superior de la pantalla para la cámara FaceTime 1080p, que no interfiere con la relación de aspecto 16:10 de la zona de la pantalla situada debajo.</p>\n\n\n\n<p>La conexión de una pantalla externa se realiza a través de uno de los puertos Thunderbolt del MacBook Air M3. El portátil puede controlar una pantalla externa con una resolución de hasta 6K a 60 Hz. </p>\n\n\n\n<h2>M3 MacBook Air: Colores</h2>\n\n\n\n<p>Es probable que Apple ofrezca el MacBook Air M3 en los mismos cuatro colores que el modelo M2: Midnight, Silver, Space Gray y Starlight. Durante años se ha rumoreado que Apple planeaba lanzar colores para el MacBook Air que coincidieran con la colorida carcasa del iMac, pero no ha sido así.</p>\n\n\n\n<h2>MacBook Air M3: Especificaciones</h2>\n\n\n\n<p>Las especificaciones del chip M3 aún no se han revelado ni filtrado, por lo que no sabemos cuántos núcleos de CPU o GPU tendrá. Tanto el M1 como el M2 tienen ocho núcleos de CPU, así que el M3 tendrá al menos ocho. El M2 empieza con 8 núcleos de GPU y es configurable hasta 10, así que es probable que el M3 siga el ejemplo o tenga más núcleos de GPU.</p>\n\n\n\n<p>Se rumorea que el chip M3 se fabricará con un nuevo proceso de 3nm. Esto permite más transistores que el proceso mejorado de 5nm utilizado en el M2. Esto podría permitir que el M3 sea más rápido que el aumento del 20 por ciento que solemos ver con una nueva generación de chips. <a href=\"https://www.macworld.com/article/1999517/chip-m3-apple.html\">Más información sobre el M3.</a></p>\n\n\n\n<p>Tanto el M1 como el M2 empezaron con 8 GB de memoria unificada, que es lo que probablemente veremos con el M3. El M2 es configurable hasta 24 GB de memoria, que podrían aumentar hasta 32 GB con el M3.</p>\n\n\n\n<p>El MacBook Air no tiene ventiladores internos y no esperamos que eso cambie. Aunque el diseño sin ventilador puede hacer que el M2 Air se ralentice durante las cargas de CPU o GPU, sin embargo, la mayor eficiencia del M3 podría ayudar al rendimiento de gama alta.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4349554_original.jpg?quality=50&amp;strip=all\" alt=\"Neues Macbook Air M2 in Mitternacht mit Magsafe-Kabel auch in Mitternacht\" loading=\"lazy\" /><figcaption><p>El MacBook Air tiene un puerto MagSafe que permite la carga rápida.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>El MacBook Air tiene dos puertos Thunderbolt 4/USB-C, un conector MagSafe 3 para un adaptador de corriente (el portátil también se puede cargar a través de Thunderbolt) y un conector para auriculares. Si Apple añade más puertos, es probable que solo sea un puerto USB-C adicional.</p>\n\n\n\n<p>El Air actual tiene conectividad inalámbrica Wi-Fi 6. Después de que Apple trajera Wi-Fi 6E al Mac mini y al MacBook Pro, es probable que también lo traiga al próximo MacBook Air.</p>\n\n\n\n<h2>M3 MacBook Air: Batería y carga</h2>\n\n\n\n<p>El MacBook Air M2 de 13 pulgadas tiene una batería de polímero de litio de 52,6 vatios-hora, mientras que el modelo de 15 pulgadas ofrece una batería de 66,5 vatios-hora, y los próximos modelos M3 probablemente tendrán el mismo tamaño de batería.</p>\n\n\n\n<p>Sin embargo, el M3 puede ser más eficiente que el M2, lo que podría prolongar la duración de la batería. Actualmente, Apple valora la batería de su Air con  “hasta 18 horas de reproducción de películas de la aplicación Apple TV, y  “hasta 15 horas de web inalámbrica,” y esas cifras podrían ser mayores con el M3 Air.</p>\n\n\n\n<p>En cuanto a la carga, se esperan las mismas opciones que en el Air actual. El MacBook Air de 13 pulgadas M2 de 1.099 dólares incluye un adaptador de corriente USB-C estándar de 30 W. El modelo de 1.399 € tiene un adaptador de corriente compacto de doble puerto USB-C de 35 W para cargar dos dispositivos al mismo tiempo. Con cualquiera de los dos modelos se incluye un cable de alimentación de USB-C a MagSafe 3. Los MacBook Air de 13 y 15 pulgadas también admiten carga rápida con un adaptador de corriente USB-C de 70 W u otro de nuestra lista de los <a href=\"https://www.macworld.com/article/1451780/mejores-cargadores-usb-c-macbook.html\">mejores cargadores para MacBook Air.</a></p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/2000691/13-15-inch-macbook-air-m3-release-date-specs-rumors-html.html\" target=\"_blank\">Macworld.com</a></em>.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cc51c15982eb00129fedf76c3a11d79b0bbcc8f5d5fc327ec76cd4a05c2723bc","category":"Apple"}