{"title":"The Effect of Temperature on the London Dispersive and Lewis Acid-base Surface Energies of Poly Methyl Methacrylate Adsorbed on Silica by Inverse Gas Chromatography","link":"https://www.preprints.org/manuscript/202404.1469/v1","date":1713864285000,"content":"Inverse gas chromatography at infinite dilution was used to determine the surface thermodynamic properties of silica particles and PMMA adsorbed on silica, and more particularly, to quantify the London dispersive energy γsd, the Lewis acid γs+ and base γs- polar surface energies of PMMA/silica composites as a function of the temperature and the recovery fraction θ of PMMA. The polar acid–base surface energy γsAB and the total surface energy of the different composites were then deduced as a function of the temperature. In this paper, the Hamieh thermal model was used to quantify the surface thermodynamic energy of poly methyl methacrylate (PMMA) adsorbed on silica particles at different recovery fractions. A comparison of the new results was carried out with those obtained by applying other molecular models of the surface areas of organic molecules adsorbed on the different solid substrates. An important deviation of these molecular models from the thermal model was proved. The determination of γsd, γs+, γs-, and γsAB of PMMA in both bulk and adsorbed phases showed an important non-linearity variation of these surface parameters as a function of the temperature. The presence of maxima in the curves of γsd(T) highlighted the second order transition temperatures in PMMA showing beta-relaxation, glass transition and liquid-liquid temperatures. These three transition temperatures depended on the adsorption rate of PMMA on silica. The proposed method gave a new relation between the recovery fraction of PMMA and its London dispersive energy showing an important effect of the temperature on the surface energy parameters of adsorption of PMMA on silica. A universal equation relating γsd(T,θ) of the systems PMMA/silica to the recovery fraction and the temperature was proposed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cc5f53ebdd0ff977be04cfe737de5d56248e7c5551781ddd3eda5d53b7acb7b6","category":"Interdisciplinary"}