{"title":"Apple has a ton of new releases coming in October 2021","link":"https://www.macworld.com/article/539596/apple-october-2021-releases-macbooks-airpods-ios-15-macos-monterey.html","date":1633095401000,"content":"<div>\n<section><div></div></section><p>September was a huge month for Apple, as it often is. It’s the month when the new iPhones are released, along with the latest version of iOS and the new Apple Watch. </p>\n\n\n\n<p>This September was no different, with the <a href=\"https://www.macworld.com/article/234814/iphone-13-features-specs-price-release.html\">iPhone 13 line</a>, <a href=\"https://www.macworld.com/article/357613/apple-watch-series-7-design-display-features.html\">Apple Watch Series 7</a>, and <a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">iOS 15</a>. But Apple also released a new iPad and iPad mini. And now that the company is deep into services, there were several big releases there, including some long-awaited Apple TV+ shows.</p>\n\n\n\n<p>But Apple’s not done yet. It still hasn’t released macOS 12 Monterey, there are plenty of Apple TV+ shows and Apple Arcade games on the way, and we still expect more hardware. In particular, the rumors say to expect new MacBook Pros and new AirPods. There might even be a new Mac mini.</p>\n\n\n\n<p>Here are all the things we know are coming in October, along with the rumored products that might launch this month.</p>\n\n\n\n<h2>Apple Watch Series 7</h2>\n\n\n\n<p>While Apple already announced the <a href=\"https://www.macworld.com/article/357613/apple-watch-series-7-design-display-features.html\">Apple Watch Series 7</a>, it gave no ship date and you can’t even preorder it. We don’t know exactly when it might ship, but rumors are suggesting that <a href=\"https://www.macworld.com/article/540312/apple-watch-series-7-preorders-october.html\">Apple will announce the preorder date as early as October 8</a>, with a ship date in mid-October. But even if those rumors are off-base, we still think you’ll be able to order it in October.</p>\n\n\n\n<h2>Rumored new products</h2>\n\n\n\n<p>We thought the September event would give us new iPhones, Apple Watch, and AirPods. But as if to prove that the rumor mill doesn’t know as much as it thinks it does, Apple threw us for a loop and introduced new iPads while new AirPods were nowhere to be found. Now we expect another event, probably in October or possibly November, announcing new MacBook Pro models and maybe those new AirPods as well. </p>\n\n\n\n<p><strong>AirPods 3:</strong> We’ve heard that the next-generation AirPods will be at the “next Apple event” so many times now. The latest rumor says they’re actually in production, and due to ship this year, but Apple still hasn’t announced them. Will October be the month? Honestly, at this point, it’s anyone’s guess. We’ve been burned so many times before. Our <a href=\"https://www.macworld.com/article/349085/2021-airpods-pro-max-design-features-price-release.html\">next-generation AirPods rumor roundup</a> has all the details.</p>\n\n\n\n<p><strong>MacBook Pro 14-inch and 16-inch: </strong>There are apparently <a href=\"https://www.macworld.com/article/354107/macbook-pro-16-inch-14-inch-m1x-processor-camera-ports.html\">new MacBook Pro models on the way</a>, with more powerful Apple Silicon chips and drastic design and feature changes. We think they’re likely to ship in November, but the event in which Apple announces them could happen in October, with preorders late this month and product on shelves in the first half of November.</p>\n\n\n\n<p><strong>Mac mini:</strong> The new MacBook Pros are supposed to come with a new higher-performance chip that we think will probably be called the M1X. There are rumors of <a href=\"https://www.macworld.com/article/347466/2021-mac-mini-design-m1x-price-release.html\">a new redesigned Mac mini</a> using the same chip. We give it about a 50/50 chance to be announced along with the new MacBook Pros.</p>\n\n\n\n<h2>Apps and software updates</h2>\n\n\n\n<p>Apple always releases most of its new yearly operating system updates in September, and we don’t think this year will be any different.</p>\n\n\n\n<h3>iOS 15.1 and iPadOS 15.1</h3>\n\n\n\n<p>While iOS 15 has been released, it doesn’t have every feature promised back in June. There’s a <a href=\"https://www.macworld.com/article/358512/ios-15-1-features-shareplay-release-date-how-to-install.html\">beta of iOS 15.1</a> already, which adds SharePlay and vaccine records in Wallet–we expect it to release to the public early in October, and the iOS 15.2 beta test will begin right afterward. We <em>might</em> even get iOS 15.2 in October. There are <a href=\"https://www.macworld.com/article/351256/melting-and-trolling-these-new-emoji-could-land-on-your-iphone-this-year.html\">a lot of new emojis</a> coming to iOS 15, and we expect it to be at least iOS 15.2 before that happens.</p>\n\n\n\n<h3>macOS 12 Monterey</h3>\n\n\n\n<p>Last year, Apple released macOS 11 Big Sur on November 12, just after its Mac-focused event. But 2020 was sort of a COVID delay year… <a href=\"https://www.macworld.com/article/348192/macos-12-monterey-features-universal-control-shortcuts-safari-airplay-focus-compatibility-release-beta-how-to-install.html\">macOS 12 Monterey</a> will probably follow a similar pattern, but that timing could come a little earlier. In other words, instead of a Mac-focused event and macOS release in the middle of November, we could get both in mid-to-late October.</p>\n\n\n\n<h2>Services</h2>\n\n\n\n<h3>Apple Fitness+</h3>\n\n\n\n<p>Apple just added Pilates and Guided Meditation to Fitness+ at the end of September, but it still working on its promise to roll the service out to 15 new countries by the end of the year. The new countries are Austria, Brazil, Colombia, France, Germany, Indonesia, Italy, Malaysia, Mexico, Portugal, Russia, Saudi Arabia, Spain, Switzerland, and the United Arab Emirates, and some of them might get access in October, but we think most will come later.</p>\n\n\n\n<p>The new Group Workouts feature, which lets up to 32 people do the same workout at the same time online, requires SharePlay. Since SharePlay appears to be coming with iOS 15.1 in October (and probably tvOS 15.1 as well), it could signal the launch of this feature for Fitness+.</p>\n\n\n\n<h3>Apple TV+</h3>\n\n\n\n<p>September was big, Oct has plenty of big stuff too. Check our <a href=\"https://www.macworld.com/article/340717/apple-tv-plus-upcoming-shows-future-moves-series-release-dates-film-television.html\">list of upcoming AppleTV+ shows, series, and movies</a> for everything on the horizon. </p>\n\n\n\n<p><strong>Ted Lasso Season 2:</strong> The final episodes of season 2 are airing in October, with the finale landing on October 8.</p>\n\n\n\n<p><strong>Get Rolling With Otis:</strong> An animated children’s series about Otis, a little tractor with a big heart, and his friends on the farm. Premieres October 8.</p>\n\n\n\n<p><strong>Acapulco:</strong> Máximo Gallardo’s dream comes true when he gets the job of a lifetime as a cabana boy at the hottest resort in Acapulco. He soon realizes the job is far more complicated than he ever imagined and in order to succeed, he must learn to navigate a demanding clientele, a mercurial mentor, and a complicated home life, without losing his way to shortcuts or temptations. Premieres October 8.</p>\n\n\n\n<p><strong>Puppy Place:</strong> Based on the best-selling books, <em>Puppy Place</em> chronicles the adventures of dog-loving siblings, Charles and Lizzie Peterson, and the puppy pals they foster in search of forever homes. There will be eight live-action episodes. Premieres October 15.</p>\n\n\n\n<p><strong><strong>Invasion:</strong></strong> Apple calls this a “character-driven science fiction drama series that follows an alien invasion through different perspectives around the world.” Premieres October 22.</p>\n\n\n\n<p><strong><strong>Swagger:</strong></strong> A drama series inspired by the early life and career of NBA superstar Kevin Durant and his youth basketball experiences. It is not a biopic of Kevin Durant’s life, however. Premieres October 29.</p>\n\n\n\n<h3>Apple Arcade</h3>\n\n\n\n<p>Apple releases new games to Apple Arcade on Fridays, but not <em>every</em> Friday is marked by a new game or significant update. Check our <a href=\"https://www.macworld.com/article/3385024/apple-arcade-faq-games-price-compatibility.html\">Apple Arcade FAQ</a> for a full list of Apple Arcade games and more details on the service. Many games are released with no forewarning, but you’ll often see a couple of projects listed in the Coming Soon section. Some have release dates, but most seem to launch by surprise. Games with a “+” at the end are titles that have already been released in the App Store but are just getting a new version (without ads or microtransactions) in Apple Arcade.</p>\n\n\n\n<p>Here are the titles in the Coming Soon section, many of which should launch in October:</p>\n\n\n\n<p><strong>Thumper: Pocket Edition+:</strong> A rhythm action racing game first released to the App Store in 2017. Expected on October 1.</p>\n\n\n\n<p><strong>Crossy Road+:</strong> It’s like Frogger meets an endless runner, one of the App Store’s most popular games.</p>\n\n\n\n<p><strong><strong>Tiny Wings+:</strong></strong> The original is almost a decade old, and was one of the best (and most popular) early iPad games.</p>\n\n\n\n<p><strong>NBA 2K22 Arcade Edition:</strong> A version of the hugely popular basketball game series made exclusively for Apple Arcade. </p>\n\n\n\n<p><strong>Crayola Create and Play+:</strong> Color, doodle, paint, and more with Crayola-branded kids art tools.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cc62e226902f3b0f56ab7f6a45e4a583561417b00382176e9b3f6f52a5c69daf","category":"Apple"}