{"title":"Apple Watch Series 8: Everything We Know So Far","link":"https://www.macrumors.com/guide/apple-watch-series-8/","date":1635541377000,"content":"We're still many months away from the launch of the Apple Watch Series 8, but we're already hearing details about Apple's next-generation wrist-worn device.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/Apple-Watch-Series-8-What-We-Know-Feature-2.jpg\" />\r\n<br />\r\nThis guide aggregates everything we know about the Apple Watch Series 8 so far based on rumors. Note that it's still early, so these features have yet to be confirmed.\r\n<br />\r\n\r\n<br />\r\n<h2>Design and Size Options</h2>\r\n<br />\r\nLittle is known about the design of the Apple Watch Series 8 at this point, but it could look similar to the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a> as Apple just increased the display size with the Series 7 models and Apple usually sticks with a display size for a couple of years.\r\n<br />\r\n\r\n<br />\r\nDisplay analyst Ross Young <a href=\"https://www.macrumors.com/2021/10/12/apple-watch-series-8-three-sizes/\">has suggested</a> the Apple Watch Series 8 could come in three sizes instead of two, with Apple adding a larger size that would join the 41 and 45mm size options. \r\n<br />\r\n\r\n<br />\r\nPrior to the release of the ‌Apple Watch Series 7‌, multiple rumors suggested Apple was working on a refreshed design with flat edges similar to the flat edges of the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> and <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, but that didn't end up happening. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/prosser-apple-watch-series-7.jpg\" />\r\n<br />\r\nGiven the number of rumors that confirmed Apple was planning such a design, it could still be happening, but for the Series 8 rather than the Series 7.\r\n<br />\r\n\r\n<br />\r\n<h2>Rugged Apple Watch</h2>\r\n<br />\r\nAccording to <em>Bloomberg</em>, Apple is <a href=\"https://www.macrumors.com/2021/03/26/apple-launch-apple-watch-extreme-sports-2021/\">working on</a> a version of the Apple Watch \"with a rugged casing\" that's aimed at athletes, hikers, and others who use the watch in more extreme conditions than day to day wear. It will feature the same functionality as a standard Apple Watch, but with improved impact resistance and protection. Apple is expected to launch the rugged Apple Watch in 2022.\r\n<br />\r\n\r\n<br />\r\n<h2>Health Features</h2>\r\n<br />\r\nAccording to <em>The Wall Street Journal</em> and other sources, Apple <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">is developing</a> several new health features for future Apple Watch models. These include blood-pressure monitoring, a thermometer for fertility and sleep tracking, sleep apnea detection, and diabetes detection.\r\n<br />\r\n\r\n<br />\r\nSome of these features could be introduced in the Apple Watch Series 8, but it is not clear if all of these sensors are ready so Apple could also hold the functionality until a later date.\r\n<br />\r\n\r\n<br />\r\n<h3>Blood Glucose Monitoring</h3>\r\n<br />\r\nApple is rumored to have a team of biomedical engineers working on a method for <a href=\"https://web.archive.org/web/20170829063414/https://www.macrumors.com/2017/04/12/apple-secret-team-diabetes-research/\">non-invasively monitoring blood glucose</a> levels using optical sensors, technology that could potentially make its way into the Apple Watch at some point in the future. Such a feature would make diabetes management much easier because it would not require puncturing the skin.\r\n<br />\r\n\r\n<br />\r\nBlood glucose monitoring has been a feature that Apple <a href=\"https://www.macrumors.com/2017/04/12/apple-secret-team-diabetes-research/\">has been working on</a> for years, based on rumors, but it is a serious health feature that would likely require regulation.\r\n<br />\r\n\r\n<br />\r\n<em>DigiTimes</em> claims that Apple is <a href=\"https://www.macrumors.com/2021/10/25/apple-watch-series-8-blood-glucose-sensors/\">working on</a> short wavelength infrared sensors, which could allow the Apple Watch Series 8 to monitor blood glucose by measuring the amount of sugar in the blood. <em>DigiTimes</em> isn't always the most reliable source, so this isn't a guaranteed feature for the Series 8 by any means, but blood glucose monitoring is a feature that Apple has been working on for some time.\r\n<br />\r\n\r\n<br />\r\n<h3>Blood Pressure Measurements</h3>\r\n<br />\r\nApple supplier Rockley Photonics is working on <a href=\"https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/\">an advanced digital sensor system</a> that allows wearable devices to monitor biomarkers like core body temperature, blood pressure, body hydration, alcohol, lactate, glucose trends, and more, using optical sensors.\r\n<br />\r\n\r\n<br />\r\nThis technology could eventually make its way to the Apple Watch given <a href=\"https://www.macrumors.com/2021/05/03/apple-watch-blood-pressure-glucose-alcohol/\">the partnership</a> between Apple and Rockley, and rumors suggest we will see blood pressure monitoring capabilities introduced at some point.\r\n<br />\r\n\r\n<br />\r\nA wrist-worn blood pressure monitor could be used to detect when blood pressure is rising and the function would be able to detect hypertension. Apple is aiming to release this feature in 2022, but it could be pushed back as the technology still needs to be perfected.\r\n<br />\r\n\r\n<br />\r\nBlood pressure monitoring would work by measuring the speed of the wave of a heartbeat through a user's arteries using sensors. It would tell a user how their blood pressure is trending, but it won't be able to provide baseline systolic and diastolic blood pressure measurements.\r\n<br />\r\n\r\n<br />\r\n<h3>Temperature Sensor</h3>\r\n<br />\r\nApple was considering adding a body temperature sensor in the 2021 Apple Watch, but <em>Bloomberg</em> says it is instead likely to be introduced in the 2022 update.\r\n<br />\r\n\r\n<br />\r\nA temperature measuring function would be useful for fertility tracking and keeping track of sleep, and in the future, it could also detect when a user has a fever.\r\n<br />\r\n\r\n<br />\r\n<h3>Sleep Apnea Detection</h3>\r\n<br />\r\nApple is aiming to use the existing blood oxygen sensor to detect sleep apnea, but there <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">are issues</a> with taking frequent readings without significantly impacting battery life.\r\n<br />\r\n\r\n<br />\r\n<h3>Car Crash Detection</h3>\r\n<br />\r\nApple is working on a <a href=\"https://www.macrumors.com/2021/11/01/apple-car-crash-detection-feature-report/\">crash detection feature</a> for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and the Apple Watch, which could come out in 2022. It will use sensors like the accelerometer to detect car accidents when they occur by measuring a spike in gravitational force.\r\n<br />\r\n\r\n<br />\r\nWhen a car crash is detected, the ‌iPhone‌ or the Apple Watch would automatically dial emergency services to get help. Since it's planned for 2022, this could be a feature designed for the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models and the Apple Watch Series 8, though it's not likely to be limited to those devices. It will be an expansion of the Fall Detection feature that's in existing Apple Watch and ‌iPhone‌ models.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Watch Patents</h2>\r\n<br />\r\nApple has patented <a href=\"https://www.macrumors.com/2019/09/03/apple-watch-smart-bands-patents/\">several interesting technologies</a> that could potentially be used in future Apple Watch devices, such as a biometric authentication feature that authenticates identity based on the wearer's skin pattern. Such a feature would eliminate the need for a passcode when wearing the Apple Watch.\r\n<br />\r\n\r\n<br />\r\n<img src=\"http://images.macrumors.com/article-new/2019/09/apple-watch-biometric-sensor.jpg\" />\r\n<br />\r\n\r\n<br />\r\nAnother patent describes a self-tightening Apple Watch band that would adjust during intensive activities like running or working out for accurate heart rate readings, and loosen up afterward. The tightening could also be used for directions, workout reps, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"http://images.macrumors.com/article-new/2019/09/apple-watch-band-indicators.jpg\" />\r\n<br />\r\n\r\n<br />\r\nA third patent describes an Apple Watch band with an LED indicator that would visualize the progress of an activity or task, providing a visual indicator when completing a workout or an Activity ring, for example.\r\n<br />\r\n\r\n<br />\r\nApple in December 2019 published a patent describing how the Apple Watch could help doctors monitor the symptoms of <a href=\"https://www.macrumors.com/2019/12/05/patent-apple-watch-improving-parkinsons-symptoms/\">Parkinson's patients</a> using sensors to keep track of tremors. Apple believes this method of data tracking will allow users to better track their symptoms so they can plan activities around symptom patterns.\r\n<br />\r\n\r\n<br />\r\nA 2020 <a href=\"https://www.macrumors.com/2020/12/15/future-apple-watch-could-gain-touch-id-and-camera/\">pair of patents</a> suggest Apple is researching <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> and an under-display camera for the Apple Watch. Apple describes a side button with an integrated ‌Touch ID‌ fingerprint sensor that could be used for user identification and device unlocking. Currently, the Apple Watch unlocks with a passcode and also when the paired ‌iPhone‌ is unlocked.\r\n<br />\r\n\r\n<br />\r\nAs for an under-display camera, the patent describes a two-stage display technology that includes a camera that is externally visible only when engaged.\r\n<br />\r\n\r\n<br />\r\nIn 2021, Apple outlined a radical <a href=\"https://www.macrumors.com/2021/03/23/apple-redesigned-wrap-around-apple-watch/\">redesign of the Apple Watch</a> in a patent filing, featuring a rounded watch face, wrap-around flexible display, and digitally-customizable watch bands.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-design.jpg\" />\r\n<br />\r\n\r\n<br />\r\nApple has <a href=\"https://www.macrumors.com/2017/01/24/modular-band-links-apple-watch/\">filed several other patents</a> covering the possibility of moving hardware into the Apple Watch's band, including batteries, speakers, kinetic power generators, haptic feedback devices, and <a href=\"https://www.macrumors.com/2019/06/25/apple-watch-positionable-camera-band-patent/\">even cameras</a>.\r\n<br />\r\n\r\n<br />\r\nThere's no word on whether these patented features will make it into an actual Apple Watch in the future, but it's interesting to see what Apple is working on and considering behind the scenes.\r\n<br />\r\n\r\n<br />\r\n<h2>Guide Feedback</h2>\r\n<br />\r\nHave questions about the upcoming Apple Watch Series 8, know of a feature we left out, or want to offer feedback on this guide? <a href=\"mailto:guides@macrumors.com\">Send us an email here</a>.<br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-watch-series-8/\">Apple Watch Series 8: Everything We Know So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-8-everything-we-know-so-far.2320636/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=NgFQe1_o4BE:p44cvY2EZcw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=NgFQe1_o4BE:p44cvY2EZcw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/NgFQe1_o4BE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cc62505c98b442ddd5873957c29240f1d956ebbdd6dbb2a20902cd8b4fd3c683","category":"Apple"}