{"title":"Google’s Android and Chrome extensions are a very sad place. Here’s why","link":"https://arstechnica.com/?p=1944202","date":1685740053000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/chrome-android-menace-800x566.jpg\" alt=\"Google’s Android and Chrome extensions are a very sad place. Here’s why\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/chrome-android-menace.jpg\">Enlarge</a> (credit: Photo Illustration by Miguel Candela/SOPA Images/LightRocket via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>No wonder Google is having trouble keeping up with policing its app store. Since Monday, researchers have reported that hundreds of Android apps and Chrome extensions with millions of installs from the company’s official marketplaces have included functions for snooping on user files, manipulating the contents of clipboards, and injecting deliberately unknown code into webpages.</p>\n<p>Google has removed many but not all of the malicious entries, the researchers said, but only after they were reported, and by then, they were on millions of devices—and possibly hundreds of millions. The researchers aren’t pleased.</p>\n<h2>A very sad place</h2>\n<p>“I’m not a fan of Google’s approach,” extension developer and researcher Wladimir Palant wrote in an email. In the days before Chrome, when Firefox had a bigger piece of the browser share, real people reviewed extensions before making them available in the Mozilla marketplace. Google took a different approach by using an automated review process, which Firefox then copied.</p></div><p><a href=\"https://arstechnica.com/?p=1944202#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944202&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cc65d4e75b2acbc13dcf2b2b202eea6c59cdf02a3b1e6ea3e5fe95bd8b2fe587","category":"Tech"}