{"title":"Redclaw Crayfish Cherax quadricarinatus LRPPRC: The characterization of a sex‐linked gene and its relationship with vitellogenin","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16074?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>In the Redclaw Crayfish, <i>Cherax quadricarinatus</i>, males grow larger and faster than females, and interest has focused on monosex breeding techniques for the production of males only. The adult male and female sexual characteristics of <i>Cherax quadricarinatus</i> are easily distinguished but cannot be determined in the embryo and juvenile stages. Because there is no DNA marker for the identification of sex in <i>Cherax quadricarinatus</i>, we sequenced its juvenile transcriptome in order to produce a reliable transcript to determine sex and to investigate its sex differentiation mechanisms at the molecular level. In this study, a female sex-linked expression gene <i>CqLRPPRC</i> (Leucine-rich PPR-motif-containing) of <i>Cherax quadricarinatus</i> was found in the transcriptome. Using semi-quantitative RT-PCR analysis, we found that the expression of the <i>LRPPRC</i> (leucine-rich pentatricopeptide repeat cassette) gene was greater in the ovaries of females than in the testes of males, from the early juvenile stages onwards. Furthermore, in situ hybridization showed that the expression of its sexual dimorphism may be focused in the gonads. The results of an RNA interference treatment showed that a knockdown of <i>CqLRPPRC</i> up-regulated the expression of vitellogenin (Vtg). The <i>LRPPRC</i> gene, and characteristic of shrimp, are reported here for the first time, and an assay of this gene can provide a molecular test to determine the sex of <i>Cherax quadricarinatus</i> in its different developmental stages, especially those during which no obvious sexual differences are visible.</p>","author":"Dawei Lin, \nYongjun Guo, \nYongzhen Zhao, \nRan Li, \nWenming Ma, \nJingfeng Sun, \nFuli Luo, \nKui Meng, \nJingwen Yang, \nChao Wu, \nRuilin Hong, \nXiang Wang, \nMoran Wang, \nLimei Chen","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"cc86b7a0538a9cf50a6f6e628d08c28c83880f2e311172fc2401bb93ebdf7077","category":"Environment"}