{"title":"Low-dose biliatresone treatment of pregnant mice causes subclinical biliary disease in their offspring: Evidence for a spectrum of neonatal injury","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301824","date":1712325600000,"content":"<p>by Kapish Gupta, Jimmy P. Xu, Tamir Diamond, Iris E. M. de Jong, Andrew Glass, Jessica Llewellyn, Neil D. Theise, Orith Waisbourd-Zinman, Jeffrey D. Winkler, Edward M. Behrens, Clementina Mesaros, Rebecca G. Wells</p>\r\n\r\nBiliary atresia is a neonatal disease characterized by damage, inflammation, and fibrosis of the liver and bile ducts and by abnormal bile metabolism. It likely results from a prenatal environmental exposure that spares the mother and affects the fetus. Our aim was to develop a model of fetal injury by exposing pregnant mice to low-dose biliatresone, a plant toxin implicated in biliary atresia in livestock, and then to determine whether there was a hepatobiliary phenotype in their pups. Pregnant mice were treated orally with 15 mg/kg/d biliatresone for 2 days. Histology of the liver and bile ducts, serum bile acids, and liver immune cells of pups from treated mothers were analyzed at P5 and P21. Pups had no evidence of histological liver or bile duct injury or fibrosis at either timepoint. In addition, growth was normal. However, serum levels of glycocholic acid were elevated at P5, suggesting altered bile metabolism, and the serum bile acid profile became increasingly abnormal through P21, with enhanced glycine conjugation of bile acids. There was also immune cell activation observed in the liver at P21. These results suggest that prenatal exposure to low doses of an environmental toxin can cause subclinical disease including liver inflammation and aberrant bile metabolism even in the absence of histological changes. This finding suggests a wide potential spectrum of disease after fetal biliary injury.","author":"Kapish Gupta","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cc879997359c7b7802650777386095a69c7a00eda33725e3e5094ad467292c39","category":"Interdisciplinary"}