{"title":"Simulation and Testing of Grapevine Branch Crushing and Collection Components","link":"https://www.preprints.org/manuscript/202407.1070/v1","date":1720927517000,"content":"Using numerical simulation method, combined with the pre-branch material characteristics of the measurement results, based on the LS-DYNA software to simulate the branch crushing process, the analysis found that not only the existence of the cutter cutting in the branch destruction process, there is also the cutting of the opposing surface of the bending fracture, with the increase in the speed of the knife rollers, the cutter cutting resistance increases, the cutting resistance reaches 2690 N when the cutter at 2500 r/min, the cutter cutting resistance is the smallest in the cutting simulation at the blade angle of 55°, the blade angle is more suitable for the cutting of the branch. In the cutting simulation under different cutting edge angles, the cutting resistance of the tool is the smallest when the edge angle is 55°, which is 1860 N. This edge angle is more suitable for branch crushing and cutting. Using Fluent software to analyse the airflow characteristics of the crushing device, it was found that with the increase of the knife roller speed, the inlet flow and negative pressure of the crushing chamber are increasing, the speed of 2500 r/min, the inlet flow and negative pressure were 1.92 kg/s and 37.16 Pa, which will be conducive to the feeding of branches, but the speed is too high and it will also lead to the enhancement of the vortex of part of the area in the crushing device, which will affect the feeding of branches and the throwing of the crushed material. affect the feeding of branches and the throwing out of crushed materials, and finally determined the speed range of the crushing knife roller is 1800 ~ 2220 r/min. Based on ANSYS/Model module modal analysis of the crushing knife roller, the knife roller of the first six orders of the intrinsic frequency and vibration pattern, crushing knife roller of the lowest order of the modal intrinsic frequency of 137.42 Hz, much larger than the crushing knife roller operating frequency of 37 Hz, the machine will not resonate during operation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cc9683f2bac38ce9a4056015edb205f21908b7ebdc699410b4a52d29a4d3d463","category":"Interdisciplinary"}