{"title":"Effective Deep Learning Seasonal Prediction Model for Summer Drought Over China","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004409?af=R","date":1711013940000,"content":"<h2>Abstract</h2>\n<p>Drought is an important meteorological event in China and can cause severe damage to both livelihoods and socio-ecological systems, but current seasonal prediction skill for drought is far from successful. This study used convolutional neural network (CNN) to build an effective seasonal forecast model for the summer consecutive dry days (CDD) over China. The principal components (PC) of the six leading empirical orthogonal function modes of CDD anomaly were predicted by CNN, using the previous winter precipitation, 2-m temperature and 500 hPa geopotential height as predictors. These predicted PCs were then projected onto the observed spatial patterns to obtain the final predicted summer CDD anomaly over China. In the independent hindcast period of 2007–2018, the interannual variabilities of first six PCs were significantly predicted by CNN. The spatial patterns of CDD were then skillfully predicted with anomaly correlation coefficient skills generally higher than 0.2. The interannual variability of summer CDD over the middle and lower Yangtze River valley, northwestern China and northern China were significant predicted by our CNN model three months in advance. CNN identified that the previous winter precipitation was the important predictor for PC1–PC3, whereas the previous winter 2-m temperature and 500 hPa geopotential height were important for the prediction of PC4–PC6. This research provides a new and effective method for the seasonal prediction of summer drought.</p>","author":"Wenbo Liu, \nYanyan Huang, \nHuijun Wang","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"ccb27e125ee2cf0290524829ba56e79873a6004f8426cb8200c7cb8f3870a407","category":"Environment"}