{"title":"Green and efficient extraction of phenolic components from plants with supramolecular solvents: Experimental and theoretical studies","link":"https://www.preprints.org/manuscript/202403.0774/v1","date":1710320537000,"content":"Supramolecular solvent (SUPRAS) has received increasing interest as an innovative, efficient, and green solvent for the effective extraction and separation of bioactive compounds from natural resources. However, studies on the use of SUPRAS for the extraction of phenolic components from plants, which are highly valued in food products due to their excellent antioxidant capacity, are still lacking. The present study developed a green ultrasound-assisted and efficient SU-PRAS method to simultaneously determine three phenolic acids in Prunella vulgaris by high-performance liquid chromatography (HPLC) and the experimental parameters were optimized in detail. The efficiency and antioxidant properties of the phenolic compounds obtained by different extraction methods were also compared. Under the optimal conditions, the extraction efficiency of SUPRAS, prepared with octanoic acid reverse micelles dispersed in ethanol-water, was substantially higher than conventional organic reagents. Moreover, this SUPRAS method also showed more significant antioxidant capacities. The confocal laser scanning microscopy (CLSM) images presented the spherical droplet structure of SUPRAS (A well-defined circle), which coincided with the position of the fluorescence position of phenolic acids. The phenolic acids were encapsulated in the vesicles by the SUPRAS droplets, which indicated the efficient extraction capacities of SUPRAS for the target compounds. Finally, combined with the CLSM method, the mechanism of the proposed method was further clarified, and the superior extraction performance of SUPRAS was theoretically demonstrated through molecular dynamics simulations. In comparison with conventional methods, the higher extraction efficiency of SUPRAS can be illustrated by the larger solvent contact surface area, more types of hydrogen bonds between extractants and supramolecular solvents, and stronger and more stable interaction forces. The results of the theoretical studies are in rational agreement with the experimental outcome.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ccccbec38891c9b6cee2328e96131b7027d1f17513c64ca03f10ff6473cc3aa0","category":"Interdisciplinary"}