{"title":"Star Wars Jedi: Survivor review: An immense sequel that aims high and hits","link":"https://arstechnica.com/?p=1934747","date":1682542829000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/ReleaseDate_Screenshot_02_R01_v02-800x450.png\" alt=\"En garde.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/ReleaseDate_Screenshot_02_R01_v02.png\">Enlarge</a> <span>/</span> En garde. (credit: Respawn)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n\n<p><a href=\"https://arstechnica.com/gaming/2019/11/jedi-fallen-order-game-review-more-like-the-force-goes-back-to-sleep/\">2019's <i>Star Wars Jedi: Fallen Order</i></a> was one of the rare Star Wars games to capture the thrills and the spirit of adventure that come with being a Jedi exploring the galaxy. With AAA production flair, the game blended a very '90s Star Wars expanded universe setup with the scale of a modern action-adventure game to great effect. The sequel <i>Star Wars Jedi: Survivor</i> significantly ups its predecessor’s scale, continuing Cal Kestis' story while expanding the suite of Jedi powers and worlds to explore.</p>\n<p>In many ways, <i>Star Wars Jedi: Survivor</i> is the best of both worlds for classic and modern Star Wars. By blending the focus on a traditional galaxy-hopping adventure with the sprawling scope of a AAA adventure game, the follow-up to <i>Fallen Order</i> succeeds in offering a compelling and dense universe to explore. Although this sequel has some rough edges that can dull its main story, <i>Star Wars Jedi: Survivor</i> is a confident sequel that shows off the best of what a Star Wars game can aspire to be.</p>\n<h2>A Jedi knight story</h2>\n<p>As the second story of a Star Wars trilogy, <i>Survivor</i> keeps with the franchise's tradition of taking the characters and plot into darker territory. Picking up five years after the end of <i>Fallen Order</i>, Cal Kestis is now a full-fledged rebel and Jedi knight who has become one of the galaxy's most wanted. After a botched mission on Coruscant, Cal escapes to the frontier planet Koboh, leading to a new adventure where he unearths lost artifacts from the early days of the Jedi Order, builds new alliances, and reunites with old friends as he continues his fight against the Empire.</p></div><p><a href=\"https://arstechnica.com/?p=1934747#p3\">Read 23 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934747&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ccce57bbfb9841f705895a806fccf39bac877b3256d1aff857c8b101c1e1dcfa","category":"Tech"}