{"title":"Microplastics may be cooling—and heating—Earth’s climate","link":"https://arstechnica.com/?p=1806939","date":1634987748000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/beach-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/beach.jpg\">Enlarge</a> <span>/</span> Thought climate change was already complicated? Now scientists have to consider the influence of tiny bits of atmospheric plastic. (credit: Sanka Vidanagama | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Like the ash spewed from a supervolcano, microplastics have infested the atmosphere and encircled the globe. These are bits of plastic less than 5 millimeters long, and they come in two main varieties. Fragments spawn from disintegrating bags and bottles (babies drink millions of tiny particles a day <a href=\"https://www.wired.com/story/babies-may-be-drinking-millions-of-microplastic-particles-a-day/\">in their formula</a>), and microfibers tear loose from synthetic clothing in the wash and <a href=\"https://www.wired.com/story/whos-to-blame-for-plastic-microfiber-pollution/\">flush out to sea</a>. Winds then scour land and ocean, carrying microplastics high into the atmosphere. The air is so lousy with the stuff that each year, the equivalent of <a href=\"https://www.wired.com/story/plastic-rain-is-the-new-acid-rain/\">over 120 million plastic bottles</a> fall on 11 protected areas in the US, which account for just 6 percent of the country’s total area.</p>\n<p>In a <a href=\"https://www.nature.com/articles/s41586-021-03864-x\">study</a> published today in the journal <em>Nature</em>, scientists have taken a first swing at modeling how the atmospheric particles could be influencing the climate, and it’s a strange mix of good news and bad. The good news is that microplastics may be reflecting a tiny bit of the sun’s energy back into space, which would actually cool the climate ever so slightly. The bad news is that humanity is loading the environment with so much microplastic (ocean <a href=\"https://www.wired.com/story/microplastic-core-samples/\">sediment samples</a> show that concentrations have been doubling every 15 years since the 1940s), and the particles themselves are so varied, that it’s hard to know how the pollutant will ultimately influence the climate. At some point they may end up <em>heating</em> the planet.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1806939#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1806939&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cccfad227a918715fe7f9c19735177f1caa41a6b047b280799b703b3272b714f","category":"Tech"}