{"title":"Water Niche Characteristics of Subalpine Shrub in Eastern Qilian Mountains, China","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2726?af=R","date":1727174888000,"content":"<h2>ABSTRACT</h2>\n<p>The investigation and research of plant niche provide new ideas for understanding the extent of resource utilization by plants and the coexistence relationship among species. Taking the subalpine shrub plants in the eastern Qilian Mountains as the research object, the contribution rate of each potential water source to the shrub plants was estimated using the Bayesian mixed modelling (MixSIAR), and the spatial and temporal characteristics of their water niche were analysed quantitatively using Levins' niche breadth index and Pianka's niche overlap index. The results showed that shrub plants on the semi-shady slope exhibited larger water niche breadth and overlap compared to those on the semi-sunny slope, which indicated that shrub plants on the semi-shady slope had strong adaptability to the water environment, but the competition for water among them was more intense. Furthermore, the water niche breadth and overlap of shrub plants decreased with the promotion of the growth stage, which was related to changes in precipitation and plant physiological characteristics during their growth cycle. Among the studied species, <i>Potentilla fruticosa</i> Linn., <i>Salix oritrepha</i> Schneid., <i>Salix cupularis</i> Rehd. and <i>Rhododendron thymifolium</i> Maxim. had broader water niche breadth in different habitats, indicating superior adaptability to the subalpine environment. Despite that the water niche overlap among shrub plants was high and their competition for water resources was intense, there was no absolute positive correlation between niche breadth and overlap. The research can provide a theoretical reference for the rational allocation of species during vegetation restoration in Qilian Mountain National Park.</p>","author":"Lifang Chou, \nWenxiong Jia, \nYue Zhang, \nXin Lan, \nHuifang Luo, \nZhijie Yu, \nZhi Wang","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"ccd9698546f18ef01bd6fc4a6bc6561f728563aef5154efcf9c0998dc379c043","category":"Environment"}