{"title":"Understory plants evade shading in a temperate deciduous forest amid climate variability by shifting phenology in synchrony with canopy trees","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306023","date":1719410400000,"content":"<p>by Carol K. Augspurger, Carl F. Salk</p>\r\n\r\nGlobal warming is leading understory and canopy plant communities of temperate deciduous forests to grow leaves earlier in spring and drop them later in autumn. If understory species extend their leafy seasons less than canopy trees, they will intercept less light. We look for mismatched phenological shifts between canopy and understory in 28 years (1995–2022) of weekly data from Trelease Woods, Urbana, IL, USA. The observations cover 31 herb species of contrasting seasonality (for 1995–2017), three sapling species, and the 15 most dominant canopy tree species for all years, combined with solar radiation, temperature and canopy light transmittance data. We estimate how understory phenology, cold temperatures, canopy phenology, and solar radiation have individually limited understory plants’ potential light interception over &gt;2 decades. Understory and canopy phenology were the two factors most limiting to understory light availability, but which was more limiting varied greatly among species and among/within seasonality groups; solar radiation ranked third and cold fourth. Understory and canopy phenology shifts usually occurred in the same direction; either both strata were early or both were late, offsetting each other’s effects. The four light-limiting factors combined showed significant temporal trends for six understory species, five toward less light interception. Warmer springs were significantly associated with shifts toward more light interception in three sapling species and 19 herb species. Canopy phenology became more limiting in warmer years for all three saplings species and 31 herb species. However, in aggregate, these variables mostly offset one another; only one sapling and seven herb species showed overall significant (and negative) relationships between light interception and spring temperature. The few understory species mismatched with canopy phenology due to changing climate are likely to intercept less light in future warmer years. The few species with data for carbon assimilation show broadly similar patterns to light interception.","author":"Carol K. Augspurger","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cce4a0cab653ed1951b42adbe857d0479d9dbbc2f998974e9bbeb14506a0bbe9","category":"Interdisciplinary"}