{"title":"Katie Archibald on cut-throat selection processes, coping with success and Paris 2024","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/katie-archibald-on-cut-throat-selection-processes-coping-with-success-and-paris-2024","date":1635519602000,"content":"\n      <p><span>Seventeen European Championship titles, four World Championship titles and two Olympic gold medals. It’s fair to say that the last 8 years have been pretty busy for </span><span>Katie Archibald</span><span>. But while her trophy case must already be stacked to the brim, the Scottish-born track cyclist is far from finished in her love affair with the velodrome. </span></p>\n<div></div>\n<p><span>Despite a career so decorated, what’s clear from Archibald’s answers to my questions is that she is rarely fully satisfied with her performances. She tells me that she downloaded a video replay of the points race at the World Championships in Roubaix last weekend, where she finished in second place, and analysed her mistakes meticulously. </span></p>\n<p><span>“I was like: I'll just flip through a few parts and watch a few little key moments just before I go to bed,” she says. “It was such a mistake because essentially I'm seeing where I lost the race. I just was going over this two-minute clip in my head, thinking of what I could have done differently. It seems so obvious when you watch a video. But I do these things so I can be more proactive in the future.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/seen-in-the-wild-team-gbs-hope-s-hb-t-track-bike\">Related: Jason Kenny's Olympic Gold HB.T Track Bike</a></em></strong></p>\n<p><span>It’s this stubborn attention to detail that has surely aided Archibald in her glory so far. The 27-year-old relishes the most tactically complex races in track cycling’s repertoire, explaining how she analyses all the intricacies of events like the omnium and the madison. “What I love about the madison is that I think it encompasses everything that's brilliant about track cycling,” she says. “To win a madison you have to be tactically smart enough, technically proficient enough, and you have to be strong enough. It's everything about track. All the speed, all the drama and all the tactics.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW8_8142X_2468d06c-40b3-4e35-8e06-3ce754ea9629_1024x1024.jpg?v=1635368791\" /></span></p>\n<p><span>Archibald’s obsession with the tactics of each event became crucial in the lead up to the postponed Tokyo 2020 Olympics. She tells me that she put huge amounts of work into understanding the madison as a standalone event, scouring over training videos and trying to intercept the moves and idiosyncrasies of rival pairings. Building up a relationship with her eventual partner for the event, Laura Kenny, was also imperative in their preparation for the Games. Such a task was made harder, though, by the notoriously cut-throat selection process during the build up to a major competition. </span></p>\n<p><span>“The Dutch team rode with one pairing throughout the entire Olympic cycle, Amy Pieters and Kirsten Wild, for the full four years or five years with full commitment to one another,” she says. “We have more options in terms of talent — we value that — we think we've got more cards we can play. But it did mean that we were slightly less tuned in the intimacies of the partnership. I think that's probably something that the delay helped with, in that we could solidify it.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/elinor-barker-tekkerz\">Related: Elinor Barker – Lockdown, Tokyo and joining Tekkerz</a></em></strong></p>\n<p><span>While Katie could be sure of her own position in the team in the months leading up to the Olympics, she explains that there was difficulty in seeing the teammates leave the programme so suddenly. “I've seen people going from being European Champions one year to off the squad in a matter of months, and it is a really competitive environment. But it’s what we all signed up for.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_6694_1024x1024.jpg?v=1635368817\" /></span></p>\n<p><span>Physical training is one demand when it comes to preparing for an Olympic Games, but Katie’s answers paint a picture of a world where mental fortitude is equally as crucial. She explains that sharing her expertise regarding the madison became difficult when she went through a phase of not being selected for the race at one point during the Olympic cycle. “I almost couldn't switch off this trait of wanting to talk about the event and wanting to make us all better,” she says. “You just start to imagine that you're going to have done all this work for an event that you won't even be part of and that's the scary bit.”</span></p>\n<p><span>“That was the reality I suppose for Elinor [Barker] and for Neah [Evans]. They contributed a huge amount to our development and weren't there in the start line for the madison,” she says. “They were there for the team pursuit so they feel part of that Olympic team and that Olympic goal but it's probably a side of it that you think of less, the fact that the riders who don't have the legs still contribute so much to our understanding of the event.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-conversations-podcast-chris-jones-and-elinor-barker\">Related: Rouleur Conversations Podcast with Elinor Barker and Katie Archibald</a></em></strong></p>\n<p><span>Despite what appears to have been a rollercoaster ride for Archibald in the lead up to the Olympics, she and Laura Kenny came away with a gold medal in the madison in Tokyo, riding with utter poise and calm. It was a race in which they completely dominated, schooling the field and winning nearly every point in their resplendent fluorescent yellow helmets which they wore to spot each other when coming in for a hand sling.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW8_8317_1024x1024.jpg?v=1635368878\" /></span></p>\n<p><span>“It was the first women's madison in the Olympic Games,” explains Katie. “I think it was a very special inaugural event. It’s special to be in the history books, at the very top of the page.”</span></p>\n<p><span>The Scottish rider also added to her ever-growing collection of medals with a silver in the team pursuit at the Games. Despite understanding the gravity of this achievement, Katie asserts that she wasn’t satisfied with the team’s performance in the final, hoping to be closer to the German team who took the win. “We fell to pieces in the final,” she says. “I don't know whether we were defeated beforehand, I certainly felt defeated when we left the starting gate.”</span></p>\n<p><span>There’s work to be done yet for the British team if they hope to snatch back their Olympic team pursuit title in Paris 2024 and Archibald thinks that this could mean bringing through some new talent to the team. “Myself, Laura and Elinor have been at the past few Olympics so I guess you can say that maybe we should be pulling in new legs,” she says. “Josie Knight is an exciting talent, she wouldn't have been there without the delay and the progression that she went through in the 12 months before Tokyo was huge.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\">Sign up to Rouleur's women's newsletter</a></em></strong></p>\n<p><span>Katie herself is aiming to ride the omnium in Paris 2024, and has her sights set on that spot already, three years out from the next Games. Her recent performance at the World Championships, where she won all four events in the omnium to take the overall win, is a strong start in her campaign for that singular place.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_0364_1024x1024.jpg?v=1635368949\" /></span></p>\n<p><span>Despite some athletes opting to take a break after the Olympics, Archibald headed full-throttle back into racing, explaining she needed to win a European title to qualify for the Worlds a few weeks later. Taking well to that task, she won three titles at the Euros before an emphatic omnium victory at the World Championships. “I didn't go into Worlds with expectations for it to go as well as it did,” she says. “The fact that I was so nervous maybe says that I had a level of expectation. I certainly wasn't there just to enjoy a night at track league, I was there to see if I was good enough and I was so satisfied when it came off.”</span></p>\n<p><span>Her ability to dominate track races as she did at the Worlds is a testament to Archibald’s hard work over the years. She reminisces on the World Championships in 2017, when her endurance was so lacking she almost lost a lap in the final points race. In 2021, she thrives in the final sprint of a long, hard race.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_6781_1024x1024.jpg?v=1635368971\" />“Now I kind of have to find what natural development I can make before. Paris,” she says, constantly striving to improve. “I don't know, maybe I'll become really flexible before 2024, there's something out there.”</span></p>\n<p><span>One of the things Katie expects to have to improve on to secure that elusive spot in the omnium is her ability to cope with the aforementioned savage selection process. “I was a contender for the omnium place in Tokyo but there were things that I wasn't mentally robust enough for, I couldn't cope with the qualification process. As much as I was a good rider on race day, I wasn't a good rider 365 days a year,” she says.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/watch-hope-build-one-of-its-radical-bikes-at-rouleur-live\">Related: Watch Hope build one of its radical HB.T bikes at Rouleur Live</a></em></strong></p>\n<p><span>“I feel like I've got a pretty good understanding now of how I need to look after myself. I just hope I'm strong enough to follow through with it.”</span></p>\n<p><span>In the nearer future, Katie will ride at the Track Champions League, a new race which she is excited to compete in. “It’s hopefully an avenue to actually becoming a professional track cyclist,” she says. “It's a sort of commercial model that means there's outlets to be sponsored as a track cyclist and to have track cycling on the TV. It will be the same riders through the entire series, so you'll get to know the characters and narrative. Ultimately, there will just be fierce racing, so I'm really looking forward to it.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_9282_1024x1024.jpg?v=1635368999\" /></span></p>\n<p><span>With such a long list of impressive palmares and wins in every major championship, does Archibald’s drive for victory ever dwindle? Does her excitement for reaching the top step of the podium ever die down?</span></p>\n<p><span>“It's not less special but it changes for sure,” she says. “I remember when I won the omnium world title in 2017, I remember lying in bed at night and the sentence in my head was: this is going to change your life forever. Now I understand that it doesn't change everything. It doesn't make you a different person. It doesn't put you in a different world. And in a good way. I can enjoy success for the fact that it's what I've set out to do, I can enjoy it for the validation of the work that I’ve put in.”</span></p>\n<p><span>“I think I can be my own version of Omnium World Champion, you know, I can be my own version of Madison World Champion and Olympic Champion. It doesn't mean that I have to now marry up with the people that I've looked up to or aspire to be like, I can just enjoy success in my own way.”</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cce77c7b47597e499aba84a9306693734623065fc220c71685245f4d49a2f62c","category":"Cycling"}