{"title":"Arcade1Up pinball cabinet review: Fine for families, interesting for modders","link":"https://arstechnica.com/?p=1774443","date":1624017601000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/IMG_1596-800x449.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/IMG_1596.jpg\">Enlarge</a> <span>/</span> Say hello to the Arcade1Up Attack From Mars physical pinball cabinet. The chassis is physical; its games are all virtual. Read below to understand what the heck that means. (credit: Sam Machkovech)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>If you're of a certain generation, chances are you have imagined (or, at this point in your adulthood, built) your own home arcade that resembles something out of the golden '80s era. One useful path to making this a reality, especially in tighter quarters, is the \"multicade,\" an invention that squishes multiple games into a single cabinet.</p>\n<p>But what if your old-school gaming dreams revolve around something bigger and bulkier, particularly pinball? Until recently, your options were either buying a bunch of original pinball cabinets or building your own ground-up emulation solution. And the latter is complicated by the realities of how pinball plays and feels.</p>\n<p>I've wondered how long it would take for that to change in the gaming-nostalgia market, especially as companies like Arcade1Up produce and sell more multicade cabinets for home use. The time for change is now, evidently, thanks to a handful of manufacturers producing pinball multicades. <a href=\"https://arcade1up.com/collections/pinball\" target=\"_blank\">Arcade1Up in particular launched three distinct pinball emulation cabinets</a> this year, each revolving around a different license.</p></div><p><a href=\"https://arstechnica.com/?p=1774443#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1774443&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cced43a6a644963358cc53d34d645cb8c5d2869a3c438e169bcc55ee22b0d11f","category":"Tech"}