{"title":"Evaluating the performance of a risk assessment score tool to predict HIV acquisition among pregnant and postpartum women in Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306992","date":1720620000000,"content":"<p>by Nok Chhun, Claire W. Rothschild, Monalisa Penumetsa, Daniel Matemo, Peninah Kithao, Barbra A. Richardson, Grace John-Stewart, John Kinuthia, Alison L. Drake</p>\r\nBackground <p>Clinical risk score tools require validation in diverse settings and populations before they are widely implemented. We aimed to externally validate an HIV risk assessment tool for predicting HIV acquisition among pregnant and postpartum women. In the context of prevention of mother-to-child transmission programs, risk score tools could be used to prioritize retesting efforts and delivery of pre-exposure prophylaxis (PrEP) to pregnant and postpartum women most at risk for HIV acquisition while minimizing unnecessary perinatal exposure.</p> Methods <p>Data from women enrolled in a cross-sectional study of programmatic HIV retesting and/or receiving maternal and child health care services at five facilities in Western Kenya were used to validate the predictive ability of a simplified risk score previously developed for pregnant/postpartum women. Incident HIV infections were defined as new HIV diagnoses following confirmed negative or unknown status during pregnancy. Predictive performance was assessed using the area under the receiver operating characteristic curve (AUC) and Brier score.</p> Results <p>Among 1266 women with 35 incident HIV infections, we found an AUC for predicting HIV acquisition of 0.60 (95% CI, 0.51, 0.69), with a Brier score of 0.27. A risk score &gt;6 was associated with a 2.9-fold increase in the odds of HIV acquisition (95% CI, 1.48, 5.70; p = 0.002) vs scores ≤6. Women with risk scores &gt;6 were 27% (346/1266) of the population but accounted for 52% of HIV acquisitions. Syphilis, age at sexual debut, and unknown partner HIV status were significantly associated with increased risk of HIV in this cohort.</p> Conclusion <p>The simplified risk score performed moderately at predicting risk of HIV acquisition in this population of pregnant and postpartum women and may be useful to guide PrEP use or counseling.</p>","author":"Nok Chhun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ccee67dc536acd4d91ecc8302cd05b20d127849991aa7ade337592302c54b281","category":"Interdisciplinary"}