{"title":"Apple Researching Totally Redesigned Apple Watch With Wrap-Around Display","link":"https://www.macrumors.com/2021/03/23/apple-redesigned-wrap-around-apple-watch/","date":1616503535000,"content":"Apple is researching a potential radical redesign for the Apple Watch, including a rounded watch face, wrap-around flexible display, and digitally-customizable watch bands, according to a newly-granted patent filing.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-design.jpg\" alt=\"\" width=\"1600\" height=\"900\" class=\"aligncenter size-full wp-image-790364\" />\r\n<br/>\r\n\r\n<br/>\r\nThe patent, spotted by <em>MacRumors</em> earlier today, is titled \"<a href=\"http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=30&f=G&l=50&d=PTXT&p=1&S1=(%22Apple+Inc%22.AANM.)&OS=AANM/%22Apple+Inc%22&RS=AANM/%22Apple+Inc%22\">Display Module and System Applications</a>\" and was filed with the United States Patent and Trademark Office. The document outlines how a flexible display could span the entire watch face and the band of a smartwatch for a transformational new Apple Watch design. The elongated display itself is said to be flexible enough to contour to the shape of a user's arm to fit like a normal watch band.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>In one application, embodiments of the invention describe a wearable electronic device, such as a smartwatch, including a flexible display panel and flexible display module. In this manner, the display area of the smartwatch is not limited to a rigid watch face area. In an embodiment, a smartwatch includes a flexible display panel that is integrated into a flexible watch band. Accordingly, curvature of the flexible display panel in both the watch face area and band may be adjusted to conform to the wrist size of the user... the display area of the flexible display panel can cover more available space on the watch face area and band of the smartwatch.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nApple explains that the design includes a display with a \"plurality of interconnects\" that extend \"through the display substrate from the front surface to the back surface, and an array of LEDs are in the display area and electrically connected with the plurality of interconnects.\" A battery, processor, ambient light sensor, and other vital smartwatch components can be fixed within an enclosure to the rear of the large display unit.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-display.jpg\" alt=\"\" width=\"1990\" height=\"972\" class=\"aligncenter size-full wp-image-790365\" />\r\n<br/>\r\n\r\n<br/>\r\nWhile the filing explains that an OLED display may be sensitive to air and moisture degradation without a protective rigid glass cover, as well be \"problematic\" with the use of \"interconnects,\" some OLED display technologies may still be appropriate for the radical new design.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-behind-display.jpg\" alt=\"\" width=\"1759\" height=\"1300\" class=\"aligncenter size-full wp-image-790362\" />\r\n<br/>\r\n\r\n<br/>\r\nApple also notes that the design could facilitate a \"minimized\" bezel around the display for a more aesthetically pleasing appearance, and could even \"eliminate\" the bezel entirely:\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>In accordance with embodiments of the invention, a bezel width surrounding the display panel can be minimized, for example below 4-5 mm or even less than 1 mm, less than 0.5 mm, or eliminated. Thus, the bezel design of the smartwatch can be designed for aesthetic concerns rather than as a requirement for allocating space for a contact ledge.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nAs well as being able to select a watch face design, as on current Apple Watch models, the patent explains that users could similarly select a digital band design to be shown on the band segment of the wrap-around display using an \"accessory manager\" to create a unique look. The filing describes a very similar system for selecting band designs as is currently in place for selecting and customizing watch faces, with the option to do so both on the Apple Watch itself or on a connected <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>The input is parsed to derive the data for display, and the derived data is displayed on the display area, where the display area is on a flexible display substrate spanning a face and band of the wearable electronic device. For example, the wearable electronic device may be a smartwatch. In an embodiment, the non-transitory computer-readable medium stores additional instructions to perform additional operations including receiving a configuration of the display area of the watch face and band, receiving a design from the derived data, the design including a watch face and watch band, and updating the display area with the received design.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-design-ab.jpg\" alt=\"\" width=\"1850\" height=\"1889\" class=\"aligncenter size-full wp-image-790363\" />\r\n<br/>\r\n\r\n<br/>\r\nAlthough the Apple Watch's Digital Crown does not appear to be depicted in the design, a separate patent has today been published with the title \"<a href=\"http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=50&f=G&l=50&d=PTXT&p=1&S1=(%22Apple+Inc%22.AANM.)&OS=AANM/%22Apple+Inc%22&RS=AANM/%22Apple+Inc%22\">Capacitive gap sensor ring for an input device</a>,\" explaining how the Digital Crown could use two \"nested\" capacitive rings that move against each other to gain a wider range of input information.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/digital-crown-patent-rings-capacitive.jpg\" alt=\"\" width=\"1850\" height=\"1156\" class=\"aligncenter size-full wp-image-790373\" />\r\n<br/>\r\nWhile Apple has yet to release a device with a flexible display, the company is believed to be working on an <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">iPhone with a foldable display</a>. Patents cannot be taken as evidence of Apple's specific intentions, but they do provide valuable insight into what the company is researching and developing behind the scenes.\r\n<br/>\r\n\r\n<br/>\r\nMoreover, the depiction of an alternative Apple Watch design in a patent is very unusual since Apple is usually conscientious to mirror the current design of the Apple Watch in patent illustrations. Patents focusing on the Apple Watch's physical design itself are even rarer, and may well hint at the future of the device.\r\n<br/>\r\n\r\n<br/>\r\nThe Apple Watch has effectively had the same design since its launch in 2016, other than a minor refresh with the Apple Watch Series 4, and we are yet to see a substantial re-imagining of the wearable's form factor. Reliable Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> has <a href=\"https://www.macrumors.com/2020/11/24/kuo-redesigned-apple-silicon-macbooks/\">previously hinted</a> that the Apple Watch Series 7 may feature \"improved form factor design,\" but there is as yet no indication of what the final device may look like. The Apple Watch Series 7 is expected to launch later this year, but there have been few rumors so far about what the new model may feature other than <a href=\"https://www.macrumors.com/2021/01/25/apple-watch-series-7-blood-glucose-monitoring/\">blood glucose monitoring</a>.<div class=\"linkback\">Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/patent/\">patent</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/23/apple-redesigned-wrap-around-apple-watch/\">Apple Researching Totally Redesigned Apple Watch With Wrap-Around Display</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-researching-totally-redesigned-apple-watch-with-wrap-around-display.2289318/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KedSTEigWqU:NpTC1iVEHak:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KedSTEigWqU:NpTC1iVEHak:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/KedSTEigWqU\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ccefd1e96830df701e4f2d6cd2d553fe62315d00157f3e7453f5d79938e42127","category":"Apple"}