{"title":"Myoglobin improves doxycycline sensitivity in pancreatic cancer through promoting heme oxygenase‐1‐mediated ferroptosis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24078?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Ferroptosis is expected to be a therapeutic target for cancers including pancreatic cancer. We aimed to screen genes that regulate ferroptosis and doxycycline resistance in pancreatic cancer and to explore the underlying mechanisms. Bioinformatics analysis was performed to identify genes that respond to ferroptosis in two human pancreatic cancer cells with GOT1 knocked down or not. 325 and 842 genes were upregulated in MiaPaCa and Tu8902 cells in response to GOT1 knockdown, with 43 genes shared. Among the 43 genes, 14 genes were identified to interact with ferroptosis key genes. MB and HMOX1 were the genes most sensitive to Erastin and doxycycline. Moreover, MB and HMOX1 expression was higher in human normal pancreatic duct epithelial cells than in pancreatic cancer cells. MB and HMOX1 proteins physically bound and promoted each other's expression. By interacting with HMOX1, MB suppressed pancreatic cancer cell proliferation, colony formation and invasion, and promoted cell ferroptosis and sensitivity to erastin and doxycycline. Silencing HMOX1 reversed the promoting effect of MB on cell ferroptosis and sensitivity to doxycycline. A pancreatic cancer xenograft model was established by subcutaneous injection of Panc-1 cells transfected with or without Ad-MB, and doxycycline was administered intraperitoneally. Overexpression of MB enhanced the inhibitory effect of doxycycline on xenograft growth. In conclusion, MB facilitated doxycycline sensitivity in pancreatic cancer cells through promoting HMOX1-mediated ferroptosis.</p>","author":"Lun Zhang, \nLiuxu Yang, \nKeyuan Du, \nYixuan Yang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"ccf4d5433f517e62a47bc78bdc7c67951afe782e90db12ea88ae1d2874223080","category":"Environment"}