{"title":"Numerical Prediction Uncertainty and Data Worth Analysis of Solute Transport in an Agricultural Clay Till Setting With Preferential Flow","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036557?af=R","date":1714508312000,"content":"<h2>Abstract</h2>\n<p>With modern agricultural practices, it is essential to quantify flow and solute transport fluxes by numerical models and associated predictions. A major challenge in modeling preferential flow settings is the ability to constrain the often numerous parameters needed to physically represent these systems. Following this, there is a lack of understanding of what parameters and observations carry the most worth for a model to reduce its prediction uncertainty. Here, first-order second moment (FOSM) analyses were used for a heavily monitored clay till field with preferential flow to investigate which parameters and observation types contribute the most to reducing the uncertainty of bromide predictions at various depths. Using a multi-objective regularized optimization approach, a 1-D preferential flow model was calibrated and subjected to FOSM analyses. Key parameters contributing to the prediction uncertainty of bromide concentrations in 0.25–3 m were limited to the lower boundary condition, the mass transfer coefficient, the hydraulic conductivity of the micro- and macropore, the macropore porosity, and the water content at wilting point. The data with the largest worth and ability to reduce the pre-calibration prediction uncertainty were concentration observations closest to the sought prediction depth, drain concentrations, and averaged water table measurements from the entire field. The post-calibration prediction uncertainty was increased primarily by removing concentration observations closest to the prediction depths. While this study provided new insights into parameter importance and data worth further research is required to understand if these findings apply broadly to clay till settings (or any soil setting) with preferential flow.</p>","author":"Sachin Karan, \nKarsten H. Jensen, \nTorben O. Sonnenborg","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"ccf4a6c1db7f12bc3c27a45b753071231b0490f537dfc3baf25259c464b216b8","category":"Environment"}