{"title":"Mapping maternal and infant health in Morocco: A global scoping review of themes, gaps, and the \"unseen\" in the published health research literature, 2000–2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003488","date":1721311200000,"content":"<p>by Ellen Amster, Ghazal Jessani, Gauri Gupta, Oksana Hlyva, Charlene Rae</p>\r\n\r\nGlobal efforts to reduce Maternal Mortality Rates (MMR) have been significant, but researchers are exploring new approaches to address stalled progress and enduring health inequities. This scoping review offers an analytic synthesis of maternal and infant health (MIH) research in the low-middle income North African Islamic country of Morocco over 22 years, a mapping of the themes, research gaps, geographies, and methodologies, 2000–2022. Morocco is an official MIH success story with excellent health indicators, yet indicators do not address local contexts, gender issues, or health disparities. To understand how medical research has reflected social reality over the past 22 years, we explored not just what is known, but how it is known, where it is known, what remained unseen, and why. Four databases were searched: OVID: MEDLINE, Embase, APA PsycINFO, and EBSCO: CINAHL. 4590 abstracts were identified, 3131 abstracts screened, and 402 full MIH articles and 128 sub-group articles identified and subject to data extraction. The 402 full MIH articles were subject to qualitative thematic analysis, classified by 34 primary research themes and explored especially for gender, health equity, and methodology. Findings included significant geographic research disparities; four regions were the location of 75% of research and many regions remained virtually “unseen” by research. The best-equipped urban public hospitals in higher-income regions produced the most research, creating an urban, hospital-based research perspective. Maternal health articles predominated, often &gt;50% more than articles published about infant health. Infants studied were mostly neonates. Socially marginalized women were often invisible to research, as were private healthcare, NGO care (non-governmental civic organizations), and healthcare in community. In articles, researchers recommended new policies, new laws, health system reform, and government actions to advocate for patients. Three solutions emerged to broaden the research perspective: increase geographic breadth, address missing topics and populations, and embrace interdisciplinary methods.","author":"Ellen Amster","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"cd004a8855d905ece259a4c805520219de0fd10e1de7396ac266f1b182b00ada","category":"Environment"}