{"title":"Comparing the effects of biguanides and dipeptidyl peptidase-4 inhibitors on cardio-cerebrovascular outcomes, nephropathy, retinopathy, neuropathy, and treatment costs in diabetic patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308734","date":1723212000000,"content":"<p>by Eiji Nakatani, Hiromitsu Ohno, Tatsunori Satoh, Daito Funaki, Chikara Ueki, Taku Matsunaga, Takayoshi Nagahama, Toru Tonoike, Hiromichi Yui, Akinori Miyakoshi, Yoshihiro Tanaka, Ataru Igarashi, Hiraku Kumamaru, Nagato Kuriyama, Akira Sugawara</p>\r\nBackground <p>Western guidelines often recommend biguanides as the first-line treatment for diabetes. However, dipeptidyl peptidase-4 (DPP-4) inhibitors, alongside biguanides, are increasingly used as the first-line therapy for type 2 diabetes (T2DM) in Japan. However, there have been few studies comparing the effectiveness of biguanides and DPP-4 inhibitors with respect to diabetes-related complications and cardio-cerebrovascular events over the long term, as well as the costs associated.</p> Objective <p>We aimed to compare the outcomes of patients with T2DM who initiate treatment with a biguanide <i>versus</i> a DPP-4 inhibitor and the long-term costs associated.</p> Methods <p>We performed a cohort study between 2012 and 2021 using a new-user design and the Shizuoka Kokuho database. Patients were included if they were diagnosed with T2DM. The primary outcome was the incidence of cardio-cerebrovascular events or mortality from the initial month of treatment; and the secondary outcomes were the incidences of related complications (nephropathy, renal failure, retinopathy, and peripheral neuropathy) and the daily cost of the drugs used. Individuals who had experienced prior events during the preceding year were excluded, and events within 6 months of the start of the study period were censored. Propensity score matching was performed to compare between two groups.</p> Results <p>The matched 1:5 cohort comprised 529 and 2,116 patients who were initially treated with a biguanide or a DPP-4 inhibitor, respectively. Although there were no significant differences in the incidence of cardio-cerebrovascular events or mortality and T2DM-related complications between the two groups (<i>p</i> = 0.139 and <i>p</i> = 0.595), daily biguanide administration was significantly cheaper (mean daily cost for biguanides, 61.1 JPY; for DPP-4 inhibitors, 122.7 JPY; <i>p</i>&lt;0.001).</p> Conclusion <p>In patients with T2DM who initiate pharmacotherapy, there were no differences in the long-term incidences of cardio-cerebrovascular events or complications associated with biguanide or DPP-4 use, but the former was less costly.</p>","author":"Eiji Nakatani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cd033c0944ce7ee775adec5129e834a39af1aa026db40565b846be683e63b9ac","category":"Interdisciplinary"}