{"title":"Flood Propagation Characteristics in a Plain Lake: The Role of Multiple River Interactions","link":"https://www.preprints.org/manuscript/202404.0972/v1","date":1713181812000,"content":"Plain lakes play a crucial role in the hydrological cycle of a watershed, but their interactions with adjacent rivers and downstream water bodies can create complex river-lake relationships, often leading to frequent flooding disasters. Taking Poyang Lake as an example, this paper delves into its interaction with the Yangtze River, revealing the spatiotemporal patterns of flood propagation within the lake and its impact on surrounding flood control measures. The aim is to provide insights for flood management in similar environments worldwide. This study employs a comprehensive approach combining hydrological statistical analysis and two-dimensional hydrodynamic modeling, based on extensive hydrological, topographic, and socio-economic data. The results indicate that the annual maximum outflow from Poyang Lake is primarily controlled by floods within the watershed, while the highest annual lake water level is predominantly influenced by floods from the Yangtze River. The peak discharge typically reaches the lake outlet within 48 hours, with the peak water level taking slightly longer at 54 hours. However, water storage in the lake can shorten the time for the peak discharge to arrive. When converging with floods from the Yangtze River, the peak water level may be delayed by up to 10 days due to the top-supporting interaction. Furthermore, floods from the \"Five Rivers\" propagate differently within the lake, affecting various lake regions to differing degrees. Notably, floods from the Fu River cause the most significant rise in lake water level under the same flow rate. The top-supporting effect from the Yangtze River also significantly impacts the water surface slope of Poyang Lake. When the Yangtze River flood discharge far exceeds that of the \"Five Rivers\" (i.e., when the top-supporting intensity f value exceeds 4), the lake surface becomes as flat as a reservoir. During major floods in the watershed, the water level difference in the lake can increase dramatically, potentially creating a \"dynamic storage capacity\" of up to 840 million cubic meters.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cd04f4a45f835f6773643dff090e0fbf98558288690a979728baa9420429f709","category":"Interdisciplinary"}