{"title":"macOS Sonoma frente a macOS Ventura: ¿cuál debo usar?","link":"https://www.macworld.com/article/1998049/macos-sonoma-frente-a-macos-ventura-deberias-actualizar.html","date":1689680492000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple ha presentado la última versión de su sistema operativo para Mac, conocido como macOS Sonoma, el cual debutará a finales de este año. Presenta algunas novedades interesantes y ajustes generales respecto a macOS Ventura, al que llega para reemplazar. </p>\n\n\n\n<p>Entonces, ¿cómo se comparan los dos? Aquí te ofrecemos un breve recorrido por las versiones actuales y lo que éstas ofrecen a los Mac. Tras leer el artículo, pretendemos dar respuesta a la pregunta: ¿debo actualizar mi Mac?</p>\n\n\n\n<h2>¿Qué novedades ofrece macOS Sonoma frente a macOS Ventura?</h2>\n\n\n\n<p>Obviamente, ambos son macOS, por lo que la funcionalidad básica sigue siendo la misma, pero como en cada nueva iteración de sistema, hay características que no han aparecido antes, además de las continuas mejoras en las integraciones con otros dispositivos de Apple. </p>\n\n\n\n<p>Las principales novedades son las que probablemente quieras conocer, así que te las contamos a continuación. </p>\n\n\n\n<h3>Widgets</h3>\n\n\n\n<p>Una de las cosas más inmediatamente reconocibles que aparecerán en los escritorios de los usuarios que ejecuten <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a> serán sin duda los <em>widgets. </em></p>\n\n\n\n<p>Estas miniaplicaciones interactivas solían estar en el ‘Centro de Notificaciones’, pero cuando llegue la actualización, podrás arrastrarlas a tu escritorio para acceder a ellas de forma instantánea y sencilla. </p>\n\n\n\n<p>También podrás usar aplicaciones de iPhone, gracias a Continuity, con la inteligente función de que todo lo que hagas en la versión para Mac se sincroniza al instante con la versión para iPhone. Ver:<a href=\"https://www.macworld.com/article/1959760/widgets-revolucion-pantallas.html\"> La revolución de los<em> widgets </em>de Apple cambiará nuestras pantallas</a> para siempre.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Nuevos Widgets de macOS Sonoma\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Foundry</p></div>\n\n\n\n<h3>Salvapantallas</h3>\n\n\n\n<p>Apple hace hincapié en la personalización en <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a> y, al igual que con los<em> widgets</em>, también pone sobre la mesa nuevos salvapantallas. </p>\n\n\n\n<p>Se trata de imágenes de alta definición que actúan como vídeos, con la cámara barriendo paisajes majestuosos, y que luego se detienen al interactuar con el Mac, convirtiéndose en imágenes fijas. Es algo pequeño, pero tiene un aspecto encantador. </p>\n\n\n\n<h3>Herramientas de videoconferencia mejoradas</h3>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1458290/macos-13.html\">macOS Ventura</a> aportó algunas mejoras interesantes a las videoconferencias, como Center Stage (que utiliza técnicas avanzadas de recorte para garantizar que siempre estés en el centro de la pantalla) y Continuity Camera (utiliza tu iPhone en lugar de la webcam integrada de tu Mac). </p>\n\n\n\n<p>Con la llegada de <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a> ahora hay nuevas formas de animar las videollamadas entre usuarios. </p>\n\n\n\n<p>Las reuniones con Zoom eran un mal necesario durante la Covid, pero muchos de nosotros sentimos cierta fatiga a la hora de sentarnos en videoconferencias hoy en día. </p>\n\n\n\n<p>Apple está tratando de combatir esto con algunas nuevas herramientas en macOS Sonoma que pueden aportar un poco de chispa a las presentaciones y reuniones en general. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Nueva función de presentación en las videollamadas con macOS Sonoma\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?quality=50&amp;strip=all 1920w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOs-sonoma-Video-Conferencing.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>Hay una opción de superposición de presentador que coloca al presentador en primer plano, pero inserta cualquier pantalla compartida entre él y el fondo. Tiene un aspecto profesional y debería animar los informes financieros trimestrales. </p>\n\n\n\n<p>Si los demás interlocutores quedan impresionados, pueden responder con animaciones, como globos de fiesta o confeti. Incluso pueden activarse gestos de la mano, lo que al menos mantendrá despiertos a algunos. Por último, <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a> permite a los participantes compartir fácilmente el contenido de las aplicaciones. </p>\n\n\n\n<h3>Modo Juego</h3>\n\n\n\n<p>Un área en la que los Mac han ido tradicionalmente a la zaga de sus homólogos con Windows es la de los juegos. Apple parece querer cerrar esta brecha introduciendo un nuevo ‘Modo Juego’ en macOS Sonoma que optimiza el rendimiento de los Mac con Apple Silicon para que los juegos obtengan el mejor rendimiento y experiencia posibles. </p>\n\n\n\n<p>Esto se extiende también a los periféricos, ya que los AirPods y los mandos de Xbox y PlayStation obtienen tiempos de respuesta de baja latencia gracias a una frecuencia de muestreo duplicada en sus conexiones Bluetooth para evitar que se rompa la inmersión. </p>\n\n\n\n<h3>Navegador Safari</h3>\n\n\n\n<p>El navegador de Apple ya recibió mucha atención en <a href=\"https://www.macworld.com/article/1458290/macos-13.html\">macOS Ventura,</a> con la actualización que introdujo los grupos de pestañas compartidas y varias herramientas centradas en la privacidad, como Passkeys. </p>\n\n\n\n<p>En macOS Sonoma esto continúa con capas adicionales de seguridad en el modo de ‘Navegación Privada’, incluyendo el bloqueo del rastreo y la creación de perfiles que las páginas web pueden intentar, así como el bloqueo automático de las pestañas privadas cuando estás lejos de tu Mac.</p>\n\n\n\n<p>También hay nuevas funciones muy útiles, con nuevos perfiles que te permiten separar tu historial preferido, cookies, favoritos, grupos de pestañas y otra información relevante en perfiles dedicados. Así, puedes tener uno para el trabajo, el ocio, la planificación de las vacaciones o cualquier otra cosa que te resulte útil. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Una aplicación web mostrada en macOS Sonoma\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?quality=50&amp;strip=all 1920w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/06/MacOS-Sonoma-Web-Apps.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple también introduce la posibilidad de convertir páginas web en aplicaciones web. Éstas se ejecutan como ventanas simplificadas a las que puedes acceder desde el <em>dock </em>del sistema e ir directamente a tus sitios web favoritos sin necesidad de abrir una ventana del navegador.</p>\n\n\n\n<h3>Accesibilidad</h3>\n\n\n\n<p>Apple siempre ha sido un referente en cuanto a accesibilidad en sus productos, y esto se lleva a nuevos niveles en <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a>. Live Text permite a las personas que sus Macs digan las palabras que escriben para que puedan participar en las llamadas. </p>\n\n\n\n<p>Los dispositivos de audición ‘Made for iPhone’ ahora también se pueden utilizar en los Macs, además los controles de voz se han mejorado para ayudar a aquellos que tienen dificultades con la movilidad. Hay muchos otros ajustes que se suman a estos y se basan en lo que ya estaba en macOS Ventura. </p>\n\n\n\n<h2>¿Debería actualizar mi Mac a macOS Sonoma?</h2>\n\n\n\n<p>Mientras tu <a href=\"https://www.macworld.com/article/1675529/compatibilidad-macos-14.html\">Mac sea compatible con macOS Sonoma</a>, no hay ninguna razón para seguir con <a href=\"https://www.macworld.com/article/1458290/macos-13.html\">macOS Ventura</a> cuando llegue la actualización a finales de este año. </p>\n\n\n\n<p>Las opciones de personalización pueden hacer que tu Mac te parezca más tuyo, mientras que las nuevas integraciones con iPhone, por no mencionar la mejora de Safari y las videollamadas, hacen que sea una decisión sencilla. </p>\n\n\n\n<p>A continuación te explicamos<a href=\"https://www.macworld.com/article/1452614/instalar-macos-beta-3679632.html\"> cómo instalar la versión beta de macOS 14 Sonoma en tu Mac.</a></p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/1984389/macos-sonoma-vs-macos-ventura-should-you-update.html\" target=\"_blank\">Macworld.com.</a></em></p>\n\nMacOS, Personal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cd057acbb6cc1f2effae7aaf80d5dbc3b49263c7a76feff01d935285a04aee99","category":"Apple"}