{"title":"Unearthed: CosmicEnergy, malware for causing Kremlin-style power disruptions","link":"https://arstechnica.com/?p=1942377","date":1685050725000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/electric-transmission-grid-800x534.jpg\" alt=\"Unearthed: CosmicEnergy, malware for causing Kremlin-style power disruptions\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/electric-transmission-grid.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Researchers have uncovered malware designed to disrupt electric power transmission and may have been used by the Russian government in training exercises for creating or responding to cyberattacks on electric grids.</p>\n<p>Known as CosmicEnergy, the malware has capabilities that are comparable to those found in malware known as <a href=\"https://arstechnica.com/information-technology/2017/06/crash-override-malware-may-sabotage-electric-grids-but-its-no-stuxnet/\">Industroyer</a> and <a href=\"https://arstechnica.com/information-technology/2022/04/russias-sandworm-hackers-attempted-a-third-blackout-in-ukraine/\">Industroyer2</a>, both of which have been widely attributed by researchers to Sandworm, the name of one of the Kremlin’s most skilled and cutthroat hacking groups. Sandworm deployed Industroyer in December 2016 to <a href=\"https://arstechnica.com/information-technology/2017/01/the-new-normal-yet-another-hacker-caused-power-outage-hits-ukraine/\">trigger a power outage in Kyiv, Ukraine,</a> that left an estimated large swath of the city without power for an hour. The attack occurred almost a year after an earlier one disrupted power for 225,000 Ukrainians for six hours. Industroyer2 <a href=\"https://arstechnica.com/information-technology/2022/04/russias-sandworm-hackers-attempted-a-third-blackout-in-ukraine/\">came to light</a> last year and is believed to have been used in a third attack on Ukraine’s power grids, but it was detected and stopped before it could succeed.</p>\n<p>The attacks illustrated the vulnerability of electric power infrastructure and Russia’s growing skill at exploiting it. The attack in 2015 used repurposed malware known as BlackEnergy. While the resulting BlackEnergy3 allowed Sandworm to successfully break into the corporate networks of Ukrainian power companies and further encroach on their supervisory control and data acquisition systems, the malware had no means to interface with operational technology, or OT, gear directly.</p></div><p><a href=\"https://arstechnica.com/?p=1942377#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942377&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cd0d9a37e6cab3f073b83ded5b0baebb921a678fbef88d943347944bbf9daa3f","category":"Tech"}