{"title":"Turin: A Heist, Hot Chocolate and the Giro","link":"https://www.cyclingtips.com/2023/03/turin-a-heist-hot-chocolate-and-the-giro/","date":1678129791000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/111.jpeg?width=1200\" alt=\"Turin: A Heist, Hot Chocolate and the Giro\" /></figure><p><em>The team members are nervous as they wait for the signal to attack. Timing is crucial. Get it wrong and it’s all over. A lifetime of regret awaits them. The back of the van is sweltering. After all, it’s the height of an Italian summer in a city choked with traffic. Their leader, Charlie Croker, is waiting for the perfect moment. On a job like this you can only plan so much; the rest has to be instinct. Wait, wait…. Now!</em></p>\n<figure><img loading=\"lazy\" src=\"https://images-cdn.dashdigital.com/pelotonmagazine/issue_102_may_2021/data/articles/img/111.jpg?width=730\" alt=\"the italian job\" width=\"1000\" height=\"837\" /><figcaption>“The Italian Job” starring Michael Caine. Image: Michael Ochs Archives/Stringer/Getty Images.</figcaption></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://images-cdn.dashdigital.com/pelotonmagazine/issue_102_may_2021/data/articles/img/113.jpg?width=730\" alt=\"palazzo madama\" width=\"990\" height=\"660\" /><figcaption>Palazzo Madama. Giorgio Perottino/Getty Images.</figcaption></figure></figure>\n<p><strong>When I was 12 years old,</strong> my favorite film was possibly 1969’s “The Italian Job,” starring Michael Caine. It was frequently on television (those were the days when a decent film being on television still felt like “an event”) and it was always on at Christmas. From the memorable opening scene, in which a lone sportscar swings along a high alpine pass only to meet a fiery end at the hands of the mafia, the film lightly treads a path between drama and comedy. A team of British thieves travels from London to Turin to steal a huge shipment of gold bullion. Using the cover of an international football match between Italy and England, the gang creates a huge traffic jam in the city center, surrounds the convoy of armored cars containing the gold and pulls off the heist. Having quickly loaded the gold into three waiting Mini Coopers, the team makes its escape. But having created gridlock, the gang cannot get out of the city by road.</p>\n<p>This is where their plan, and the film’s script, becomes truly ingenious. The three Minis (red, white and blue, of course) follow an unorthodox route away from the scene of the crime. They rattle down the baroque stone staircase of the <strong>Palazzo Madama</strong>, skid through the Galleria San Federico and Galleria dell’Industria Subalpina shopping arcades, and then dive diagonally across the steps of the Chiesa della Gran Madre di Dio, one of Turin’s most beautiful churches, where the uncouth gangsters interrupt a wedding. Now pursued by the local police, the plucky—but ultimately hapless—Brits make a totally pointless trip onto the roof of the Palavela arena, and then another pointless excursion onto Fiat’s iconic rooftop test track. Eventually, by driving through a sewer system, the Minis emerge on empty roads outside the city.</p>\n<p>The ending? It upsets me too much to write about it. It is perfect, and yet so incredibly, so incredibly annoying. It winds me up just thinking about it.</p>\n<p>“The Italian Job” is now something of a period piece. Enjoyable for its sharp dialogue, the performances of leading actors Caine and Noël Coward and its picturesque backdrop, the film is morally problematic. Its tone is essentially xenophobic; indeed, the whole premise of the film is, too. The Italians are portrayed as a series of stereotypes: the mean mafioso, the overweight mamas, the beautiful sleek-haired society women and the inept policemen. The Brits have few problems executing the heist; it’s their own over-confidence that scuppers them at the end. The film captures the beauty of Turin, yet the film has not been celebrated by the city’s inhabitants. Visit this historic jewel of northern Italy and you’ll find scant reference to the cockney crime of the century.</p>\n<p>Turin, where this year’s Giro d’Italia starts with an 8.6-kilometer time trial, deserves more. Nestled below the snowcapped Alps, the capital of the Piedmont region is renowned for its elegance and civility. In the 16th century it was the capital of the Duchy of Savoy, a small but influential state tucked between France and Italy that drew on the cultures of both countries. In 1720 the Duchy became the Kingdom of Savoy, then later the Kingdom of Sardinia. Italy’s new monarchy in the 19th century came from Turin and for a short time it was capital of the newly unified country.</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://images-cdn.dashdigital.com/pelotonmagazine/issue_102_may_2021/data/articles/img/115.jpg?width=730\" alt=\"caffe al bicerin\" width=\"900\" height=\"557\" /><figcaption>Caffè Al Bicerin. Image: REDA&amp;CO/Getty Images.</figcaption></figure></figure>\n<p>The first Giro d’Italia, in 1909, recognized Turin’s importance by giving it the finish of the penultimate stage, a race of 354 kilometers from Genoa. However, because the race had captured the imagination of the Italian public to a far greater degree than the organizers had envisioned, by this seventh stage enormous crowds appeared in Genoa to cheer the riders off. So enormous, that the organizers were worried about accidents on the city’s streets. Their solution was so sensible we still use it today: the neutralized zone. Once out of Genoa the racers pressed on northward toward Turin.</p>\n<p>As the stage progressed, scouts for the organizers brought news of a crowd of more than 50,000 people waiting for the Giro in Turin. With no barriers in place, how would the racers get through? To make matters worse, there were picket lines blocking some roads—the city’s bakers were on strike. Ever adaptable, the organizers promptly shifted the finish line to the small town of Beinasco, 10 kilometers south of the city. Quick thinking is good but requires quick communication, too. The organizers told Turin’s authority of their decision to move the finish, but not the race officials gathered in Turin’s center, so when Luigi Ganna arrived at the improvised finish line, four minutes ahead of the runner-up, there were only journalists and a few bemused locals to welcome him. Ganna won the race overall when it finished in Milan the next day.</p>\n<p>Unlike some of the clichéd portrayals in “The Italian Job,” the Piedmontese have a reputation for being restrained, dignified, precise and perhaps a little chilly. Their city is a reflection of this supposed character. Its streets are laid out in a grid pattern based on an ancient Roman template and the architecture of the historic center combines the baroque elegance of architect Guarino Guerini and the classicism of his successor Filippo Juvarra. Both men were integral to the expression of the Duchy of Savoy’s power.</p>\n<p>Despite losing its political influence, Turin remained an economic force as the 20th century began, forming part of a strong commercial triangle with Milan and Genoa. Much of Italy’s automotive industry is based in the city, including the headquarters of Fiat, Alfa Romeo and Lancia. And in this century the city has switched its focus from declining industries into innovative start-ups, technology and the aerospace industry.</p>\n<p>Not many foreigners will be in Turin for this year’s Giro, as the pandemic has reduced Italy to something resembling lockdown, or whatever we can conjure in our imaginations. If I were there on May 8, I would start the morning, perhaps in luminous spring sunshine and a little nip to the air, at the <strong>Caffè Al Bicerin</strong> on the Piazza della Consolata, a few blocks from the start of stage 1. Turin’s most famous café has been trading since 1763, selling coffee, confectionary (Turin is Italy’s chocolatier) and naturally the drink after which it is named. A bicerin’s combination of homemade chocolate, smooth coffee and milk foam, served in large crystal glasses, is the symbol of Turin. An old city guide describes it as “the favorite drink of the morning: ministers, magistrates, professors, shopkeepers, bellboys, basket sellers, street vendors and campagnuoli (‘country people’)…all willingly spend their money to satisfy their stomachs economically.”</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://images-cdn.dashdigital.com/pelotonmagazine/issue_102_may_2021/data/articles/img/117.jpg?width=485\" alt=\"primo levi\" width=\"485\" height=\"699\" /><figcaption>Primo Levi in 1986. Image: Gianni Giansanti/Getty Images.</figcaption></figure></figure>\n<p>Suitably energized, I would then take a walk along the left bank of the River Po to watch the time trial at the Borgo Medievale del Valentino, a 19th century recreation of a medieval village, complete with gardens and a castle. And after some lazy barrier-leaning, perhaps using that morning’s <em>La Gazzetta dello Sport</em> to keep the hot sun off my head, I would walk west into the Crocetta district, searching for the Corso Re Umberto. Here, in a flat overlooking a wide tree-lined avenue, the writer <strong>Primo Levi</strong> lived and died.</p>\n<p>Levi was born in 1919 and in the early years of World War II managed to dodge Mussolini’s anti-Semitic laws for long enough to graduate from the University of Turin with a degree in chemistry. In 1943, when the Germans invaded northern Italy, he escaped to the mountains with a band of partisan fighters, an experience later captured in his novel “If Not Now, When?” After the Germans eventually captured him, Levi was put on a train to Auschwitz. He survived the horrors of the concentration camp, partly because his expertise as a chemist was valued by the Germans, and partly due to luck and the kindness of other prisoners. After the war he returned to Turin, where he worked as a chemist in a paint factory. But his experience compelled him to write. He had, he said, “an absolute, pathological narrative charge.”</p>\n<p>His memoir of Auschwitz, “If This Is A Man,” was published in 1947 by a small press but didn’t make much of an impact until it was reissued in 1958 by Turin’s powerhouse publisher Einaudi (that also brought other influential Piedmont writers such Cesare Pavese to the attention of the world). In the following years Levi’s reputation grew steadily as he published more works of fiction, memoir and journalism. He died in April 1987 after falling down the stairwell outside his third floor flat. By the time of his death, he was recognized as one of the century’s most important writers.</p>\n<p>I first read Primo Levi’s work in my early 20s and I remember his vivid descriptions of returning after the war to Turin—a scarred and changed city, but still much-loved. The city’s economic strength meant it was heavily bombed during the war. Brutal battles were fought on the nearby hills and the bitter recriminations within Italian society lasted for many years. Levi used his scientific training to write with vigilance, reason and care. He was restrained. No hyperbole or melodrama. And all the more powerful for that.</p>\n<p>From the ridiculous (“The Italian Job”) to the sublime. The pandemic has been particularly hard on this beautiful part of Italy. And though scars will remain, it will rebuild its stylish, bicerin-drinking confidence. And soon enough we will all be there to join in.</p>\n<p><em>This story originally appeared in issue 102 of Peloton magazine. Paul Maunder’s debut novel “The Atomics” is <a href=\"https://www.eye-books.com/books/the-atomics\" target=\"_blank\">available now.</a></em></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cd24b90a394a2645fe0e3c71bdc1b625f72cd03ef7145c7879c600","category":"Cycling"}