{"title":"Wolves recolonize novel ecosystems leading to novel interactions","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14602?af=R","date":1708930415000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e85001bb-bf38-4887-906b-892856581da3/jpe14602-toc-0001-m.png\" alt=\"Wolves recolonize novel ecosystems leading to novel interactions\" />\n<p>Understanding these novel interactions and the context dependence of ecosystem impacts could guide us to act to improve conditions to enable wolves to exert their ecosystem impacts again. These novel interactions may be the true ecological and societal value of having wolves returning to human-modified landscapes.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe wolf (<i>Canis lupus</i>) is arguably the most successful species at recolonizing its now human-dominated former ranges in Europe and North America. Over the centuries while the wolf was absent, humans have transformed ecosystems to a large extent. In this paper, we highlight key aspects of these human-modified ecosystems that include changes to (meso)carnivore communities, wolves themselves (genetics, behaviour), woody plant communities and the playing field for predator–prey interactions (landscape structure).\n\nWe argue that the recognition of the novelty of human-modified ecosystems logically leads to novel pathways of how wolves can influence ecosystem functioning. Thus far, the ecological impacts of wolves in human-dominated systems have largely been predicted based on the documented effects they have on prey species or lower trophic levels in well-preserved systems with low human impact. However, wolves in human-modified ecosystems will engage in an array of novel interactions and potential novel trophic cascades that do not occur in more natural ecosystems with lower human impact.\n\nThis should encourage us to re-assess the questions we ask about wolf impacts in novel systems. A promising direction for future studies is exploring what novel interactions establish and under what conditions wolves can exert their ecosystem impacts (context dependence) in the human-modified ecosystems wolves are recolonizing.\n\n<i>Policy implications</i>. Understanding these novel interactions and the context dependence of ecosystem impacts could guide us to act to improve conditions to enable wolves to exert their ecosystem impacts again. These novel interactions may be the true ecological and societal value of having wolves returning to human-modified landscapes.\n</p>","author":"D. P. J. Kuijper, \nT. A. Diserens, \nE. Say‐Sallaz, \nK. Kasper, \nP. A. Szafrańska, \nM. Szewczyk, \nK. M. Stępniak, \nM. Churski","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"cd26b3ea5fed8e5c1ed4b030b080fde2a476f0cc5fcc42cf0f771fdb00d4c2b9","category":"Environment"}