{"title":"Characterizing quality traits of boiled yam: texture and taste for enhanced breeding efficiency and impact","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12589?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Boiled yam key quality attributes typical for West African consumers are that it is crumbly, easy to break and has a sweet taste. New yam varieties are being developed but high- or medium-throughput tools to assess the required quality traits and their range of acceptance are limited. This study assessed the acceptance thresholds of these quality attributes and established predictive models for screening yam varieties that meet the required consumer preferences.</p>\n<h2>RESULTS</h2>\n<p>Overall liking was associated with sweet taste, crumbliness and easiness to break (<i>r</i>-values 0.502, 0.291 and −0.087, respectively). These parameters and selected biophysical parameters highly discriminated the boiled yam varieties. Crumbly texture and easiness to break were well predicted by penetration force and dry matter, whereas sweet taste were well predicted by dry matter and sugar intensity. A high crumbliness and sweet taste are preferred (sensory scores above 6.19 and 6.22 for crumbly and sweet taste, respectively, on a 10 cm unstructured line scale), while a too high easiness to break is disliked (sensory scores ranging from 4.72 to 7.62). Desirable biophysical targets were between 5.1 and 7.1 N for penetration force, dry matter around 39% and sugar intensity below 3.62 g 100 g<sup>−1</sup>. Some improved varieties fulfilled the acceptable thresholds, and screening was improved through deviation from the optimum.</p>\n<h2>CONCLUSION</h2>\n<p>Acceptance thresholds and deviation from optimum for boiled yam assessed through the instrumental measurements are promising tools for yam breeders. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Laurent Adinsi, \nImayath Djibri‐Moussa, \nLaurenda Honfozo, \nAlexandre Bouniol, \nKarima Meghar, \nEmmanuel O. Alamu, \nMichael Adesokan, \nSantiago Arufe, \nMiriam Ofoeze, \nBenjamin Okoye, \nTessy Madu, \nFrancis Hotègni, \nUgo Chijioke, \nBolanle Otegbayo, \nDominique Dufour, \nJoseph D. Hounhouigan, \nHernán Ceballos, \nChristian Mestres, \nNoël H. Akissoé","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"cd314d94687c61334c9550c75efcc6a1ccf88e33ad331aa7392a5e59fcbcc520","category":"Environment"}