{"title":"In a first, New York passes law banning new fossil fuel vehicle sales after 2034","link":"https://arstechnica.com/?p=1795160","date":1631655159000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1232464481-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1232464481.jpg\">Enlarge</a> <span>/</span> Widespread EV charging stations will be critical for New York to feasibly phase-out new fossil fuel vehicles by its 2035 deadline. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/electric-vehicles-are-displayed-before-a-news-conference-news-photo/1232464481\">Drew Angerer/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>New York will ban the sale of fossil fuel vehicles starting in 2035 and require all new cars to produce zero emissions. The new law, signed by Democratic Gov. Kathy Hochul last week, will help slash the state’s carbon pollution by 35 percent. It would put New York well on its way to achieving its statewide carbon reduction goals of 85 percent below 1990 levels.</p>\n<p>While the sunset date is in line with other plans from the state government, hitting the goal will still require significant planning and coordination. Though electric vehicles aren’t uncommon in New York, the state is effectively starting from zero—around <a href=\"https://www.nysenate.gov/newsroom/press-releases/jen-metzger/senator-metzgers-bill-accelerate-shift-electric-vehicles-new\">1 percent</a> of new vehicles sold in the Empire State are fully electric.</p>\n<p>The new law doesn’t stop at passenger vehicles. It also requires zero emissions for off-road vehicles and equipment by 2035 and for medium- and heavy-duty vehicles by 2045. There’s some wiggle room with these mandates should batteries or fuel cells for large trucks or construction equipment lag significantly. The law says zero emissions will only be required “where feasible.”</p></div><p><a href=\"https://arstechnica.com/?p=1795160#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795160&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cd32d4629da3feac04c6d4123a0eaa12a4a54e6197ffa07a3379bbc4a555bc3c","category":"Tech"}