{"title":"Sabrent XTRM-Q 16TB external SSD review: A sexy-sounding misfire on the Mac","link":"https://www.macworld.com/article/550484/sabrent-xtrm-q-16tb-ssd-review.html","date":1637748000000,"content":"<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Huge capacity</li><li>Capable of 2.75GBps transfers</li></ul></div><div><h3>Cons</h3><ul><li>Uses an external power supply.</li><li>Requires software RAID</li><li>Performance slowdowns on the Mac</li></ul></div></div></div><h3>Our Verdict</h3><p>Sabrent’s XTRM-Q 16TB is vast, and very fast under some circumstances when used in RAID 0, but it’s extremely pricey and relies on your OS for RAID. Mac performance dropped quickly during long test sessions.</p>\n</div><h3>Price When Reviewed</h3><p>3300</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/themes/idg-base-theme/dist/static/img/amazon-logo.svg\" /></div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$2,902.01</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>Free</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B097LVLWWN?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>At first blush, I was ready to love Sabrent’s XTRM-Q 16TB (SB-DXMQ-8X2)–$3,300 price tag or no. How can you argue with having <em>16TB</em> of storage at the end of your Thunderbolt cable? Especially with Apple’s consistent habit of gouging you for internal storage upgrades.</p>\n\n\n\n<p>Alas, consternation proved more the result of my hands-on than affection. The drive relies on your operating system for RAID functionality, doesn’t power up automatically, and performance on an M1 iMac was hit then miss. </p>\n\n\n\n<h2>Design and features</h2>\n\n\n\n<p>The XTRM-Q 16 TB is a charcoal gray, aluminum, dual-NVMe/M.2 enclosure featuring two Sabrent 8TB, 96-layer QLC drives with Phison E8 controllers. It measures approximately 4.5-inches long, 2.5-inches wide, by 0.75-inches thick. The enclosure is handsome, wrapped in a removable silicone sleeve for protection, and features a Type-C Thunderbolt 3 port, a power jack, and an on/off button. </p>\n\n\n\n<p>Thunderbolt 3 delivers a fair amount of power across the bus, easily enough for a single NVMe SSD, and I would’ve thought for two. Apparently not, hence the power jack and external 1.5 amp supply. Besides providing more than enough power, an external power supply allows you to use the drive on an Thunderbolt 2 system using only a T2 to T3 converter. On the other hand, it makes the XTRM-Q 16TB considerably less convenient to drag about than bus-powered drives.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/Sabrent-XTRM-Q-16TB-dark.jpg?quality=50&amp;strip=all\" /></figure><p>Sabrent</p></div>\n\n\n\n<p>Also inconvenient is the on/off button, which is momentary. I could understand a switch that retains its state, as the drive uses so much power, but having to turn it on every time you want to use it is un-fun. It also forces you to keep the drive where you can access the switch. Automatically powering up when sensing bus power, as most do, would make far more sense.</p>\n\n\n\n<p>The kicker is, that with an external power supply, there’s plenty of juice for a RAID chip. Instead, Sabrent opted to use your operating system’s RAID capabilities. This means that once formatted in RAID 0 or 1 mode, you can’t move from Windows to the Mac, or vice versa. It also means you’re subject to the performance vagaries of software RAID, which relies on your CPU. If your CPU is busy with other stuff, say encoding a file, disk performance may suffer.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/SB-DXMQ-8X2-Main-12.jpeg?quality=50&amp;strip=all&amp;w=923\" /></figure></div>\n\n\n\n<h2>Performance</h2>\n\n\n\n<p>The first issue with the XTRM-Q 16TB was that on our M1 iMac it wasn’t as fast as claimed, and slowed down rather rapidly as Disk Speed Test proceeded. By a substantial margin as you can see in the image below. Note that Mac testing followed PCWorld testing so the drive wasn’t pristine.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/Sabrent-16TB-RAID-0.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>This shows the XTRM-Q 16TB’s performance on the first pass with Disk Speed Test, and around the 20th. This test really takes only about 30 seconds per run.</figcaption></figure></div>\n\n\n\n<p></p>\n\n\n\n<p>The RAID 1 mirrored results were also fascinating, however, as this is macOS’s integrated software RAID, it’s nearly impossible to tell what the issue might be. The slowdowns could be due to the QLC NAND slowing when written natively, i.e., you write the full three bits (16 voltage levels) rather than just one. However, it could just as easily have been the Apple RAID implementation.</p>\n\n\n\n<p>With no real insight on the odd performance on the Mac, I’ll move on the to the far more stable results from the PCWorld’s Windows test platform. Under CrystalDiskMark in RAID 0 striped mode (data is spread or striped across both disks), and under ideal conditions, the XTRM-Q 16TB was very fast both reading and writing: 2827MBps and 2664MBps respectively. Write speed was halved in RAID 1 mirrored mode, but the read speed remained nearly as fast. </p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/sabrebt-xtrm-16tb-CDM6.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure></div>\n\n\n\n<p>The XTRM-Q 16TB was very fast in our 48GB transfers tests, shown below, though not as fast as the <a href=\"https://www.macworld.com/article/231760/samsung-portable-ssd-x5-review-wickedly-fast-portable-thunderbolt-3-storage.html\">Samsung X5</a> or <a href=\"https://www.macworld.com/article/331884/owc-envoy-pro-fx-ssd-review.html\">OWC Envoy Express FX</a>. The latter can be attached via Thunderbolt 3 or USB 3.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/sabrebt-xtrm-16tb-48GB.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption> The XTRM-Q 16TB was very fast in our 48GB transfers tests, though not as fast as the Samsung X5 or OWC Envoy Express FX. The latter can be attached via Thunderbolt 3 or USB 3. </figcaption></figure></div>\n\n\n\n<p>The one test that the XTRM-Q 16TB ruled over was the 450GB write. It was smooth and steady, and a good two minutes faster than the next fastest X5. That’s no small consideration if you’re writing large raw high-resolution files to the drive on a constant basis.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/sabrebt-xtrm-16tb-450GB.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The XTRM-Q 16TB was one of the fastest external drives we’ve tested when writing a single 450GB file to its cells.</figcaption></figure></div>\n\n\n\n<p>Note that the XTRM-Q 16TB ran particularly warm, even when idling. A fan might be in order for the next iteration. Also, I tested the XTRM-Q with the drives enumerated individually, which is actually the default. Performance in this configuration was nearly identical to mirrored RAID 1.</p>\n\n\n\n<p>The XTRM-Q 16TB did just fine on a Windows PC, but this is Macworld, so the slowdowns in Disk Speed Test limit my ability to praise the drive. I’d have liked to test one of the SSDs inside on its own on our PCWorld testbed, however, the enclosure is sealed.</p>\n\n\n\n<p><em>The PCWorld tests utilize Windows 10 64-bit running on a Core i7-5820K/Asus X99 Deluxe system with four 16GB Kingston 2666MHz DDR4 modules (64GB total), a Zotac (Nvidia) GT 710 1GB x2 PCIe graphics card, and an Asmedia ASM3242 USB 3.2×2 card. It also contains a Gigabyte GC-Alpine Thunderbolt 3 card, and Softperfect Ramdisk 3.4.6 for the 48GB read and write tests.</em></p>\n\n\n\n<p><em>Write performance will decrease as the drive fills up due to less NAND available for secondary cache. In some rare cases, components may change for the worse. If your drive, given similar hardware, does not perform as well as our test unit, please let us know.</em></p>\n\n\n\n<p><em>Current Macworld tests use a M1-based, 24-inch iMac with 8GB of memory and a 512GB SSD.</em></p>\n\n\n\n<h2>Not what it could have been</h2>\n\n\n\n<p>The XTRM-Q 16TB works fine when employed under specific scenarios and should be fine for Windows users. However, the performance dips and inconsistencies on the Mac, as well as the lack of automatic power-on were debilitating and annoying in turn. As enticing as 16TB sounds, it’s not delivered here in a fashion commensurate with the price, or likely expectations.</p>\n\n\n\n<p>I recommend that you go with another solution such as a bus-powered 4TB/8TB external SSD (including <a href=\"https://www.macworld.com/article/234388/sabrent-xtrm-q-ssd-review.html\">Sabrent’s</a>) for performance, and a pair of capacious external hard drives for capacity and redundancy. Note that Sabrent also sells this enclosure as a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.sabrent.com/product/EC-T3DN/thunderbolt-3-to-dual-nvme-m-2-ssd-tool-free-enclosure-ec-t3dn/&amp;xcust=1-1-550484-1-0-0&amp;sref=https://www.macworld.com/feed\">DIY unit</a>.</p>\n</div>","author":"Jon L. Jacobi","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cd3bc35d8731811d489f5343078e6a3f6ddb5d5858b6690eb71a17ee005c73fd","category":"Apple"}