{"title":"Tim Berners-Lee เตรียมนำโค้ดชุดแรกของเวิล์ดไวด์เว็บออกประมูล NFT รายได้บริจาคการกุศล","link":"https://www.blognone.com/node/123221","date":1623772822000,"content":"<div><div><div><p>สำนักข่าว BBC รายงานว่า Tim Berners-Lee ผู้ให้กำเนิดเวิล์ดไวด์เว็บเตรียมเปิดประมูลซอร์สโค้ดแรกของเวิล์ดไวด์เว็บเป็น NFT โดยเขาและภรรยาจะนำรายได้จากการประมูลไปบริจาคให้องค์กรการกุศล</p>\n<p>การประมูลจะจัดขึ้นโดย Sotheby's เริ่มต้นที่ 1,000 ดอลลาร์ในวันที่ 23 มิถุนายนเวลาบ่ายสองโมงตามเขตเวลา EST ซึ่งตรงกับเวลาตีหนึ่งของวันที่ 24 มิถุนายนตามเวลาประเทศไทย ซึ่งสิ่งที่จะนำออกประมูลมีซอร์สโค้ดราว 1 หมื่นบรรทัด (รวม HTML, HTTP และ URI), คำอธิบายเว็บเพจชุดแรก, visualization ของโค้ด และจดหมายจาก Berners-Lee ที่อธิบายความสำคัญ และดิจิทัลโปสเตอร์เขียนด้วย Python โดยเขาเอง ซึ่งทั้งหมดนี้ถูกเซ็นด้วยลายเซ็นดิจิทัลโดย Berners-Lee</p>\n<p>สำหรับรายได้ที่ได้จากการประมูลซอร์สโค้ดครั้งนี้ Berners-Lee และภรรยาจะนำไปบริจาคให้องค์กรการกุศลที่ทั้งคู่เลือกเอง ตัว Berners-Lee ไม่เคยทำเงินโดยตรงจากการพัฒนาเวิล์ดไวด์เว็บเลย และ CERN ที่เขาทำงานให้ในตอนนั้นก็โอเพ่นซอร์สเทคโนโลยีเป็น public domain ในปี 1993 ซึ่งจากความนิยมในระบบเวิล์ดไวด์เว็บนี้ก็บ่งบอกได้ว่าซอร์สโค้ดนี้มีคุณค่าทางประวัติศาสตร์ค่อนข้างมาก</p>\n<p>Berners-Lee ระบุว่า เขาเลือกการประมูลผ่าน NFT เพราะรู้สึกว่า NFT มีความหมายมากที่สุดในการป็นเจ้าของสินทรัพย์ดิจิทัล</p>\n<p>ที่มา - <a href=\"https://www.engadget.com/tim-berners-lee-nft-code-auction-131656681.html\">Engadget</a>, <a href=\"https://www.bbc.com/news/technology-57474504\">BBC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1cf3fb25e061e7bed473ae706756f569.jpg\" /><br />\nTim Berners-Lee ภาพจาก <a href=\"https://commons.wikimedia.org/wiki/File:Sir_Tim_Berners-Lee.jpg\">Wikimedia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tim-berners-lee\">Tim Berners-Lee</a></div><div><a href=\"/topics/nft\">NFT</a></div><div><a href=\"/topics/web\">Web</a></div><div><a href=\"/topics/internet\">Internet</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cd3c1a7a78bc7be371f93ddfc9ef3e61fa6e3496825e7ced2a29ccf0c25281c7","category":"Thai"}