{"title":"เปิดตัวแว่น OPPO Air Glass 3 ที่งาน MWC 2024 เข้าถึง AndesGPT ผ่านโทรศัพท์มือถือได้","link":"https://www.blognone.com/node/138446","date":1709118487000,"content":"<div><div><div><p>OPPO เปิดตัวโปรโตไทป์แว่นตาเสมือนจริง OPPO Air Glass 3 ที่งาน MWC 2024 แว่นตาดังกล่าวสามารถเข้าถึง AndesGPT ของ OPPO ได้ผ่านโทรศัพท์มือถือ อีกทั้งยังประกาศจัดตั้ง OPPO AI Center และ OPPO AI Smartphone White Paper ก้าวสู่ยุคใหม่ของสมาร์ทโฟน AI</p>\n<p>ในงาน MWC 2024 ทาง OPPO ร่วมมือกับ Qualcomm Technologies, Inc. และสตาร์ทอัพ AlpsenTek แนะนำอัลกอริธึม AI Motion ใหม่ ซึ่งใช้เทคโนโลยี Hybrid Vision Sensing (HVS) เพิ่มความชัดเจนให้กับการถ่ายภาพและวิดีโอของวัตถุที่เคลื่อนที่ด้วยความเร็วสูง ช่วยให้สามารถถ่ายวิดีโอสโลว์โมชั่น 960fps ในความละเอียด 4K ได้ โดยใช้ประโยชน์จากข้อมูล EVS เพื่อการจัดตำแหน่งวัตถุที่เคลื่อนที่ระหว่างเฟรมอย่างแม่นยำ ช่วยเพิ่มทั้งช่วงไดนามิกและความละเอียด นอกจากนี้ OPPO ยังประกาศว่าผู้ใช้งานสมาร์ทโฟนของ OPPO จะสามารถเชื่อมต่อ Microsoft Copilot ได้เร็ว ๆ นี้</p>\n<p>สำหรับ OPPO Air Glass 3 มีน้ำหนัก 50 กรัม ใช้ท่อนำคลื่นเรซินที่ OPPO พัฒนาขึ้นเอง มีดัชนีการหักเหของแสง 1.70 ความสม่ำเสมอของความสว่างของจอแสดงผลมากกว่า 50% และรองรับความสว่างมากกว่า 1,000 nits มอบประสบการณ์การสวมใส่ที่ใกล้เคียงกับแว่นตาทั่วไป ขณะเดียวกันก็ให้การแสดงผลสีเต็มรูปแบบ แถมยังเข้าถึงบริการ OPPO AndesGPT โดยเชื่อมต่อผ่านแอป Air Glass บนสมาร์ทโฟนได้</p>\n<p>ผู้ใช้งานสามารถกดเบา ๆ ที่ขมับของ OPPO Air Glass 3 เพื่อเปิดใช้งานผู้ช่วยเสียง AI และเริ่มดำเนินการต่าง ๆ ได้ อีกทั้งยังรองรับการโต้ตอบแบบสัมผัสใช้เพื่อควบคุมฟังก์ชันต่าง ๆ เช่น การเล่นเพลง, การโทรด้วยเสียง, การแสดงข้อมูล, การเรียกดูภาพสี และอื่น ๆ มีเทคโนโลยีสนามเสียงย้อนกลับ การออกแบบเสียงแบบเปิดพร้อมไมโครโฟน 4 ตัว และนวัตกรรมการแยกเสียงรบกวนเพิ่มความเป็นส่วนตัวให้ผู้ใช้งาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1ac6fb1d8984ca8d190bc339bf732437.jpeg\" /></p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/oppo\">Oppo</a></div><div><a href=\"/topics/mixed-reality\">Mixed Reality</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/augmented-reality\">Augmented Reality</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cd4d44bb616b4b12fe3c1d3d079af82309bb85f96ec4cda99a5425c1e8614775","category":"Thai"}