{"title":"More EVs are eligible for clean vehicle tax credits up to $7,500","link":"https://arstechnica.com/?p=1933271","date":1682005153000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1450860025-800x533.jpg\" alt=\"concept of ev tax credit\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1450860025-scaled.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><a href=\"https://arstechnica.com/cars/2023/04/these-10-evs-and-plug-in-hybrids-still-get-the-full-7500-tax-credit/\">Earlier this week</a>, the IRS began enforcing the new <a href=\"https://arstechnica.com/cars/2023/01/heres-what-you-need-to-know-about-the-new-ev-tax-credit-for-2023/\">clean vehicle tax credit rules</a>. This program is an incentive of up to $7,500 for the purchase of a new battery-electric vehicle, plug-in hybrid EV (or hydrogen fuel cell EV), albeit with some conditions, including a requirement for a certain level of domestic content in those cars' battery packs. As a result, many previously qualifying vehicles lost their eligibility, but not all.</p>\n<p>When the rules went into effect on April 18, 10 models qualified for the full $7,500 tax credit, and another seven were eligible for a $3,750 credit. The Volkswagen ID.4 was a notable omission from the list, which was puzzling at the time given that VW <a href=\"https://arstechnica.com/cars/2021/09/volkswagens-electric-id-4-was-already-good-does-awd-change-that/\">now builds its electric crossover in Chattanooga, Tennessee</a>. Perhaps it was a day late with its paperwork to the IRS, because the ID.4 now appears on the <a href=\"https://www.fueleconomy.gov/feg/tax2023.shtml\">US Environmental Protection Agency's official list of eligible vehicles</a>.</p>\n<p>\"This is great news for consumers in the US because it expands the choice of truly affordable EVs,\" said Pablo Di Si, president and CEO of Volkswagen Group of America. \"The ID.4 is already one of the lowest-priced electric SUVs on the market, and the $7,500 Federal Tax Credit makes it even more attainable. This shows that we made the right decision to localize production of the ID.4 in Tennessee and invest even further in battery production, components and innovation. Every ID.4 sold supports thousands of American jobs and helps advance our goal of a carbon-neutral future.\"</p></div><p><a href=\"https://arstechnica.com/?p=1933271#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933271&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cd4dcfc1cd25f93062734d8a72354e65668d2f0b7ed5167e792e2fbb007cf834","category":"Tech"}