{"title":"Early life‐history stages of the olive barb, Systomus sarana (Hamilton), and a key ontogenetic systematic character of Smiliogastrinae","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15868?af=R","date":1721210668000,"content":"<h2>Abstract</h2>\n<p>The current study aims to uncover the early life-history stages of <i>Systomus sarana</i>, a medium-sized smiliogastrin cyprinid important for aquaculture in South Asia. The fish were effectively bred in captivity by administering 0.25 mL of breeding hormone per kilogram of fish. The spawning occurred 8.54 ± 0.55 h after the injection, and the eggs were phyto-lithophilic with a pale yellow color and a diameter of 1.49 ± 0.04 mm. Hatching occurred 17 h after fertilization, and the yolk-sac larvae of 3.43 ± 0.08 mm total length (TL) were adhering to the plant parts and other substrata with the cement glands on the forehead. On the third day, with complete absorption of the yolk sac and the disappearance of the attachment organ, the pre-flexion larvae measured 5.3 ± 0.11 mm TL. On the eighth day, the flexion larvae measured 6 ± 0.4 mm TL with a well-inflated posterior swim bladder, and the post-flexion larvae, at 11 days post-hatching (dph), developed a two-chambered gas bladder. The juvenile stage, on day 21 post-hatching, was marked by the loss of the median finfolds and the appearance of black blotches on the caudal, subdorsal, and supra-anal regions. The commencement of squamation and the appearance of the rudiments of maxillary barbels distinguished the juvenile stage. The subadults measuring 4.6 ± 0.36 cm TL had finished squamation and completely lost the subdorsal and supra-anal blotches. We propose that the presence of subdorsal blotches is a distinctive ontogenetic and systematic feature of larval and juvenile forms of smiliogastrin barbs.</p>","author":"Melbin Lal, \nP. H. Anvar Ali","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"cd56526e91deeaea15c49944df84085d8b588b416ffe5e8e2cda15c5957c2956","category":"Environment"}