{"title":"New type of supply-chain attack hit Apple, Microsoft and 33 other companies","link":"https://arstechnica.com/?p=1742499","date":1613479799000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/software-code-800x534.jpg\" alt=\"New type of supply-chain attack hit Apple, Microsoft and 33 other companies\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/software-code.jpg\" class=\"enlarge-link\" data-height=\"667\" data-width=\"1000\">Enlarge</a> (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Last week, a researcher demonstrated a new supply-chain attack that executed counterfeit code on networks belonging to some of the biggest companies on the planet, Apple, Microsoft, and Tesla included. Now, fellow researchers are peppering the Internet with copycat packages, with more than 150 of them detected so far.</p>\n<p>The technique was <a href=\"https://medium.com/@alex.birsan/dependency-confusion-4a5d60fec610\">unveiled last Tuesday</a> by security researcher Alex Birsan. His so-called dependency confusion or namespace confusion attack starts by placing malicious code in an official public repository such as NPM, PyPI, or RubyGems. By giving the submissions the same package name as dependencies used by companies such as Apple, Microsoft, Tesla, and 33 other companies, Birsan was able to get these companies to automatically download and install the counterfeit code.</p>\n<h2>Automatic pwnage</h2>\n<p>Dependencies are public code libraries or packages that developers use to add common types of functionality to the software they write. By leveraging the work of thousands of their open source peers, developers are spared the hassle and expense of creating the code themselves. The developer’s code automatically downloads and incorporates the dependency, or any update to it, either from the developer’s local computer or from a public repository.</p></div><p><a href=\"https://arstechnica.com/?p=1742499#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1742499&comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cd61b236099f1e8d233a0356449885b579929ff511aa26871ff04472eee5e3bb","category":"Tech"}