{"title":"Neiman Marcus data breach impacts 4.6 million customers","link":"https://arstechnica.com/?p=1799906","date":1633091550000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Screenshot-2021-10-01-at-09.44.49-800x533.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Screenshot-2021-10-01-at-09.44.49.png\">Enlarge</a> (credit: <a href=\"https://unsplash.com/photos/4Hmj9gkyM6c\">Jordan Nix</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>American luxury retailer Neiman Marcus Group (NMG) has just disclosed a major data breach impacting approximately 4.6 million customers. The breach occurred sometime in May 2020 after \"an unauthorized party\" obtained the personal information of some Neiman Marcus customers from their online accounts. Neiman Marcus is working with law enforcement agencies and has selected cybersecurity company Mandiant to assist with the investigation.</p>\n<h2>Credit card and gift card numbers exposed</h2>\n<p>Yesterday, Neiman Marcus disclosed that its 2020 data breach impacted about 4.6 million customers with Neiman Marcus online accounts. The personal information of these customers was potentially compromised during the incident. The bits of information include:</p>\n<ul>\n<li>Names, addresses, contact information</li>\n<li>usernames and passwords of Neiman Marcus online accounts</li>\n<li>Payment card numbers and expiration dates (although no CVV numbers)</li>\n<li>Neiman Marcus virtual gift card numbers (without PINs)</li>\n<li>Security questions of Neiman Marcus online accounts</li>\n</ul>\n<p>For the millions of customers being notified about the incident, \"approximately 3.1 million payment and virtual gift cards were affected, more than 85% of which are expired or invalid,\" said the company in a <a href=\"https://www.neimanmarcusgroup.com/2021-09-30-Neiman-Marcus-Confirms-Unauthorized-Access-to-Customer-Online-Accounts\" target=\"_blank\">statement</a> released Thursday. No active Neiman Marcus-branded credit cards were impacted. As of now, there's also no indication that online customer accounts at Bergdorf Goodman or Horchow were impacted.</p></div><p><a href=\"https://arstechnica.com/?p=1799906#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799906&amp;comments=1\">Comments</a></p>","author":"Ax Sharma","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cd69bf79f65d2c1c6c785c454102ec8e37fa7cc0cb9e75aa9838d1fe4c08d6a8","category":"Tech"}