{"title":"Retrobatch 2.0","link":"https://flyingmeat.com/blog/archives/2023/11/retrobatch_2.html","date":1700943206000,"content":"\n<p>Gus Mueller, writing at the Flying Meat blog:</p>\n\n<blockquote>\n  <p>In case you’re not aware, <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch</a> is a node-based batch \nimage processor, which means you can mix, match, and combine \ndifferent operations together to make the perfect workflow. It’s \nkind of neat. And version 2 is even neater. [...]</p>\n\n<p>Retrobatch is obviously not Flying Meat’s most important app \n(<a href=\"https://flyingmeat.com/acorn/\">Acorn</a> would fill that role), but I really do like working on it \nand there’s a bunch more ideas that I want to implement. I feel \nlike Retrobatch is an app that the Mac needs, and it makes me \nincredibly happy to read all the nice letters I get from folks \nwhen they figure out how to use it in their daily work. </p>\n\n<p>Five years after Retrobatch 1 shipped, I’m happy to see version 2 \nout in the world. And I can’t wait to see what folks are going to \ndo with it. </p>\n</blockquote>\n\n<p>“Node-based batch image processor” means that you design and tweak your own image processing workflows not with code, but through a visual drag-and-drop interface. (But you <em>can</em> use code, via nodes for JavaScript, AppleScript, and shell scripts.) You can program your own highly customized image processing workflows without knowing anything about writing code. It’s useful for creating workflows that work on just one image at a time, but Retrobatch really shines for batch processing.</p>\n\n<p>There are a <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">zillion new features in version 2</a>, but the star of the show has to be the new “ML Super Resolution” 4× upscaler: a powerful machine learning model made easily accessible.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/25/retrobatch-2\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"cd760cf9da86f5624b00bdd5ed641c8ab164ea5fbcc9329c93388c572274e26b","category":"Tech"}