{"title":"Municipal Compost Public Health, Waste Management, and Urban Agriculture: A Decadal Study of Fugitive Pb in City of Boston, Massachusetts, USA","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GH000810?af=R","date":1709731096000,"content":"<h2>Abstract</h2>\n<p>Compostable materials constitute roughly half of waste generated globally, but only 5% of waste is actually processed through composting, suggesting that expanding compost programs may be an effective way to process waste. Compostable waste, if properly collected and processed, has value-added end use options including: residential and park landscaping, remediation of brownfield sites, and as growing media in urban agriculture (UA). Since 2001, our lab has partnered with The Food Project, a non-profit focused on youth leadership development through urban farming. From 2006 to 2022 we collected compost materials that were delivered to the farm from a variety of local sources and analyzed a suite of biogeochemical properties including lead (Pb) concentrations, organic carbon, and grain size distribution. Pb concentrations of Boston's municipal compost always exceeded the current City of San Francisco soil and compost purchase standard (80 μg/g). In 2012 Boston's composting program was halted when it exceeded the 400 μg/g Environmental Protection Agency's Pb in soil benchmark. Urban Pb is geomobile and must be managed to minimize resuspension and transport of fines whose Pb concentration is often elevated compared to bulk compost. Consequently, urban farmers have to source lower Pb compost from suburban suppliers at significantly greater cost. Over a 15 year period and through several city vendor contracts, Pb concentrations in municipal compost remain at levels that warrant continued surveillance and risk assessment.</p>","author":"Chansie Yang, \nClaire Hayhow, \nEmma Jackman, \nDanielle Andrews, \nDaniel Brabander","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"cd78a921534a74d56f95e0c689fac4072889ffa595b0c6cff626a7fc06e45d9a","category":"Environment"}