{"title":"Everything New in the iOS 15 Messages App: Shared With You, Photo Collages, Memoji Updates and More","link":"https://www.macrumors.com/guide/ios-15-messages/","date":1625863962000,"content":"Apple's <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> app was the main focus for many of the <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a> updates that were introduced, but the Messages app wasn't entirely forgotten. Apple introduced a new Shared with You feature and streamlined several interface elements to make the Messages experience more pleasant.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/iOS-15-Messages-Guide-Feature.jpg\" />\r\n<br />\r\nThis guide outlines all of the new features that Apple added to the Messages app in ‌iOS 15‌ and <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Shared with You</h2>\r\n<br />\r\nThe main new feature in the ‌iOS 15‌ Messages app is Shared with You, which aggregates content that people share with you in Messages into the proper apps. So if someone sends a photo, it shows up in a Shared with You section in the <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-app-shared-with-you.jpg\" />\r\n<br />\r\nThis isn't strictly a Messages addition because it's actually other apps that have this new section, but it does make Messages content much more accessible and less likely to be forgotten. There are multiple Shared with You integrations, as outlined below.\r\n<br />\r\n<ul>\r\n<br />\r\n <li><strong>Photos</strong> - When someone sends you a photo in Messages, it automatically appears in the Shared with You section of the ‌Photos‌ app, which is located in \"For You.\" Tapping on an image lets you save it to the photo library, and it has a record of who sent it. If you tap on the name of the person that sent it, it automatically opens up the Messages app so you can have a conversation.</li>\r\n<br />\r\n <li><strong>Safari</strong> - Any link sent to you in Safari is stored in the Shared with You section of the main start page that's opened when you open up a new tab. Safari shows a preview of the link so you can see what it's about, and tapping the link opens up the website.</li>\r\n<br />\r\n <li><strong>Apple News</strong> - A link to an <a href=\"https://www.macrumors.com/guide/apple-news-plus/\">Apple News</a> story that's sent to you will be stored in the Shared with You section that's located in the Today and Following tabs in ‌Apple News‌. Stories that are found in News and Safari show up in Shared with You in both apps.</li>\r\n<br />\r\n <li><strong>Apple Music</strong> - Music links sent in Messages are shown in the Shared with You section of <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, which is located under Listen Now.</li>\r\n<br />\r\n <li><strong>Apple Podcasts</strong> - If you're sent an episode of a Podcast or a link to a show, it's listed in the Shared with You section of Listen Now in the <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a> app.</li>\r\n<br />\r\n <li><strong>Apple TV App</strong> - When a friend sends a movie or a TV show link over Messages, the TV show or movie will appear in the Shared with You section of Watch Now so you can find it quickly.</li>\r\n<br />\r\n</ul>\r\n<br />\r\n\r\n<br />\r\n<h3>Shared With You - Continue Conversations</h3>\r\n<br />\r\nIn all apps that have a Shared with You section, content in these sections makes it clear who sent it to you. There are name labels that you can tap to go right to the Messages app so you can have a conversation about what was shared. Tapping the name label on an item shared with you also opens right up to the associated message so you can see the original conversation.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-shared-with-you-conversation.jpg\" />\r\n<br />\r\n<h3>Shared With You - Pinning Content</h3>\r\n<br />\r\nIf someone shares something with you that you definitely don't want to forget about, such as a photo or a link, you can long press on it and choose the \"Pin\" option. Pinned items are shown first in Shared with You, in Messages search, and the Details view of a Messages conversation.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-app-shared-with-you-pin.jpg\" /><ul><li><a href=\"https://www.macrumors.com/how-to/see-photos-shared-with-you-messages-ios/\">iOS 15: How to See All the Photos People Have Shared With You in Messages</a></li></ul>\r\n<br />\r\n<h2>Photo Collages</h2>\r\n<br />\r\nMultiple images sent in the Messages app now show up as a little photo collage of images stacked on top of one another. You can tap the collage and swipe through it to see each image in the stack. At the top left of the full screen interface, you can tap to see all of the images in a grid view, and there are also quick access tools for replying, adding a tapback response, downloading an image, or sharing it.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-photo-stack-grid.jpg\" />\r\n<br />\r\n<h2>Improved Photo Saving</h2>\r\n<br />\r\nAll images you're sent in the Messages app have a little download icon next to them that can be tapped to save them, which makes it much easier to save a photo that you're sent to the photo library on your device.\r\n<br />\r\n\r\n<br />\r\n<h2>Updated Photos Image Picker</h2>\r\n<br />\r\nThe ‌Photos‌ image picker, including in the Messages app, now allows you to select photos in a specific order for sharing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-photo-view-select-order.jpg\" />\r\n<br />\r\n<h2>International Updates</h2>\r\n<br />\r\nApple added a few country specific features to address issues with spam. In Brazil, on-device intelligence filters out unwanted SMS messages and organizes them into Promotional, Transactional, and Junk folders to keep clutter out of the main Messages inbox.\r\n<br />\r\n\r\n<br />\r\nIn India and China, there are options to turn notifications on or off for unknown senders, transactions, and promotions so users have more control over which types of messages are able to send notifications.\r\n<br />\r\n\r\n<br />\r\n<h2>New Memoji and Memoji Stickers</h2>\r\n<br />\r\nMemoji, which are used in the Messages and ‌FaceTime‌ app, have been updated in ‌iOS 15‌ with 40 new outfit choices, an option to choose two different eye colors, new glasses options, new headwear options, and new accessibility options that include cochlear implants, oxygen tubes, and soft helmet.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/messages-app-memoji.jpg\" />\r\n<br />\r\nApple has also added nine new Memoji stickers like hand wave and lightbulb moment, heart hands, and more.\r\n<br />\r\n\r\n<br />\r\n<h2>Other Messages Tweaks</h2>\r\n<br />\r\n<ul>\r\n<br />\r\n <li><strong>Group Message Access in FaceTime</strong> - In ‌FaceTime‌, there's an option to access a group Messages thread with the people you're chatting with.</li>\r\n<br />\r\n <li><strong>Focus Message Status</strong> - If you have Focus mode on and someone tries to send you an iMessage, they'll see a status update letting them know that you're in Focus mode. Friends and family can break through the Focus mode message with an urgent message.</li>\r\n<br />\r\n <li><strong>Messages Photo Search</strong> - If you do a search with a contact name included, you can use Spotlight to find photos that person has sent you.</li>\r\n<br />\r\n <li><strong>Announce Messages in CarPlay</strong> - <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> can now announce your incoming messages in <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a>.</li>\r\n<br />\r\n</ul>\r\n<br />\r\n<h2>Guide Feedback</h2>\r\n<br />\r\nHave questions about Messages in ‌iOS 15‌, know of a feature we left out, or want to offer feedback on this guide? <a href=\"mailto:guides@macrumors.com\">Send us an email here</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-15-messages/\">Everything New in the iOS 15 Messages App: Shared With You, Photo Collages, Memoji Updates and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/everything-new-in-the-ios-15-messages-app-shared-with-you-photo-collages-memoji-updates-and-more.2303784/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=g-0qxXIo0wk:Ed58Vr69wR4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=g-0qxXIo0wk:Ed58Vr69wR4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/g-0qxXIo0wk\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cd896c3a7c3d95b73847afefdf4c8ccfa6753966ebb393d28bddb52999a66bb3","category":"Apple"}