{"title":"Assessment of Climate Change in Angola and Potential Impacts on Agriculture","link":"https://www.preprints.org/manuscript/202410.1081/v1","date":1728908696000,"content":"Agroclimatic indicators help convey information about climate variability and change in terms that are meaningful to the agricultural sector. This study evaluated climate projections for Angola, particularly for provinces with higher agrarian potential. To this end, a set of 15 predefined agroclimatic indicators in 2041–2070 and 2071–2099, under the anthropogenic forcing scenarios RCP4 and RCP8, were compared with the historical period 1981–2010 as a baseline. Data were extracted within the geographic window of longitudes 10–24°E and latitudes 4–18°S and from five climate model chain experiments, namely MIROC-ESM-CHEM, HadGEM2-ES, IPSL-CM5A-LR, GFDL-ESM2M and NorESM1-M. The averages of the set of agroclimatic indicators, as well as their differences between historical and future periods, are discussed concerning the likely implications for agriculture in Angola. The results show significant increases in average daily maximum (2–3°C) and minimum (2–3°C) temperatures in Angola. For the future, a generally significant reduction in precipitation (and its associated indicators) is expected in all areas of Angola, with the southwest region (Namibe and Huíla) recording the most pronounced decrease, up to 300 mm, while the maximum number of consecutive dry days will increase across the country and especially in the northeast of the country. A widespread increase in temperatures is expected, which could lead to hot and dry conditions in Angola that could lead to more frequent, intense and prolonged extreme events, such as tropical nights, maximum number of consecutive summer days, warm and wet days and Warm spell duration index periods. These changes can seriously affect agriculture, water resources and ecosystems in Angola, thus requiring adaptation strategies to reduce risks and adverse effects, while ensuring the sustainability of the country's natural resources and guaranteeing its food security.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cd948301d8a82ad5b76e30eccb08ddedcf44f9c38a3786329b86a3d8efa8c8db","category":"Interdisciplinary"}