{"title":"492 Effects of particle size and protease supplementation on amino acids digestibility in peas fed to growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/162/7757306?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study aimed to determine the effects of particle size and protease supplementation on amino acid (AA) digestibility in peas fed to growing pigs. A total of 8 barrows (65.9 ± 5.0 kg initial body weight), each fitted with a T-cannula in the distal ileum, were allocated in an 8 × 7 incomplete Latin square design. Eight experimental diets were arranged in a 2 × 2 × 2 factorial design, consisting of two varieties of field peas (Amarillo, Meadow peas), two particle sizes (400, 700 μm), and without or with protease supplementation (0, 250 g/ton). The Amarillo and Meadow peas were similar in crude protein (20.6 vs 21.3%). Field peas were included in the diets as the only source of AA, with a 96.1% inclusion rate. All diets contained 0.3% titanium dioxide as an indigestible marker. A casein diet was used to estimate basal endogenous N and AA losses. The experiment was conducted for seven consecutive periods. Each experimental period lasted 7 d, including 5 d of adaptation and the last 2 d for ileal digesta collection from 0800 to 1700 h. Data were analyzed using the PROC MIXED of SAS. The statistical model included variety, enzyme, particle size, and their interaction as fixed effects, and replication, animal within replication, and period within replication as random effects. There was no 3-way interaction between variety, enzyme supplementation, and particle size on apparent ileal digestibility (AID) and standardized ileal digestibility (SID) of AA in diets. Moreover, there were no differences in AID and SID between different varieties of field peas except for Cys where AID (66.2 vs 63.4%) and SID (71.9 vs 69.0%) were greater (<span>P</span> &lt; 0.05) in Amarillo peas than in Meadow peas. Similarly, no difference was found between the diets with and without enzyme supplementation except for AID of Pro (71.9 vs 75.4%), which was less (<span>P</span> &lt; 0.05) when protease was included. Also, no effects of particle size were observed except for SID of Ala (80.0 vs 77.0%), which was greater as particle size was reduced to 400 μm. The average SID values for essential AA were Arg (88.3%), His (80.9%), Ile (77.7%), Leu (78.7%), Lys (83.9%), Met (75.8%), Phe (79.3%), Thr (72.9%) and Val (74.9%). In conclusion, the variety of field peas, enzyme supplementation, or particle size did not affect the AID and SID of the field peas, and no interaction was observed among the factors. Future studies will investigate dose-response relationships to determine whether the observed enzyme effect was due to inadequate ratios between enzyme and substrate.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"cd9c1b3e57b55bd55a152776b989c460b2e58a19f77ba90f09c1f25e0400630d","category":"Environment"}