{"title":"Characterization of the organellar genomes of Mazzaella laminarioides and Mazaella membranacea (Gigartinaceae, Rhodophyta)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13478?af=R","date":1719763127000,"content":"<h2>Abstract</h2>\n<p><i>Mazzaella</i>, a genus with no genomic resources available, has extensive distribution in the cold waters of the Pacific, where they represent ecologically and economically important species. In this study, we aimed to sequence, assemble, and annotate the complete mitochondrial and chloroplast genomes from two <i>Mazzaella</i> spp. and characterize the intraspecific variation among them. We report for the first time seven whole organellar genomes (mitochondria: OR915856, OR947465, OR947466, OR947467, OR947468, OR947469, OR947470; chloroplast: OR881974, OR909680, OR909681, OR909682, OR909683, OR909684, OR909685) obtained through high-throughput sequencing for six <i>M. laminarioides</i> sampled from three Chilean regions and one <i>M. membranacea</i>. Sequenced <i>Mazzaella</i> mitogenomes have identical gene number, gene order, and genome structure. The same results were observed for assembled plastomes. A total of 52 genes were identified in mitogenomes, and a total of 235 genes were identified in plastomes. Although the <i>M. membranacea</i> plastome included a full-length <i>pbs</i>A gene, in all <i>M. laminarioides</i> samples, the <i>pbs</i>A gene was split in three open reading frames (ORFs). Within <i>M. laminarioides</i>, we observed important plastome lineage-specific variations, such as the pseudogenization of the two hypothetical protein-coding genes, <i>ycf</i>23 and <i>ycf</i>45. Nonsense mutations in the <i>ycf</i>23 and <i>ycf</i>45 genes were only detected in the northern lineage. These results are consistent with phylogenetic reconstructions and divergence time estimation using concatenated coding sequences that not only support the monophyly of <i>M. laminarioides</i> but also underscore that the three <i>M. laminarioides</i> lineages are in an advanced stage of divergence. These new results open the question of the existence of still undisclosed species in <i>M. laminarioides.</i></p>","author":"Francisco Sepúlveda‐Espinoza, \nAngela Cofré‐Serrano, \nTomás Veloso‐Valeria, \nSuany Quesada‐Calderon, \nMarie‐Laure Guillemin","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"cdb8ca5af10ac21cf8e2b0dcffde29a8952bc3a9dff82e8c81c73c6e8e298a79","category":"Environment"}