{"title":"Partial Replacement of Fishmeal with Duckweed (Spirodela polyrhiza) in Feed for Two Carnivorous Fish Species, Eurasian Perch (Perca fluviatilis) and Rainbow Trout (Oncorhynchus mykiss)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/6680943?af=R","date":1678950000000,"content":"<p>Two four-week feeding trials were conducted with fingerlings of Eurasian perch (<i>Perca fluviatilis</i>, 3.52 ± 0.08 g) and rainbow trout (<i>Oncorhynchus mykiss</i>, 1.49 ± 0.05 g) fed with graded levels of dried (DWD) and fermented (DWF) duckweed meal (<i>Spirodela polyrhiza</i>). The purpose of these two trials was to evaluate DWD and DWF as replacements for fishmeal. Fishmeal protein was substituted by 12%, 24%, and 35% of duckweed protein and compared to control diets containing 40% (for perch) and 35% (for rainbow trout) fishmeal and no duckweed. The performance of the fish (growth, feed conversion, and protein and lipid utilization) and their whole-body composition were evaluated and compared with the control. While even the lowest inclusion level, regardless of its form (dried or fermented), resulted in significantly reduced performance in Eurasian perch, rainbow trout were able to utilize feed containing duckweed meal considerably well. Compared to the control, at a 12% inclusion level, rainbow trout showed an equal or comparable percent weight gain (PWG; DWD: 377%, DWF: 373%), specific growth rate (SGR; DWD: 4.37%/day, DWF: 4.33%/day), feed conversion ratio (FCR; DWD: 1.11, DWF: 1.12), and protein productive value (PPV; DWD: 21.5%, DWF: 21.2%). Increasing the inclusion levels above 12% of both DWD and DWF resulted in reduced performance in rainbow trout, with the most pronounced effects observed in the DWD35 group. All experimental diets, including control, affected the whole body composition of perch, most notably reducing the lipid content compared to initial fish. Compared to initial, control and DWD rainbow trout increased whole-body protein, lipid, and ash contents. In conclusion, for rainbow trout, fermented and dried <i>S. polyrhiza</i> duckweed meal appears to be a promising feed ingredient when used at a maximum inclusion level of 12%, while for Eurasian perch, it should not be considered as a feed ingredient.</p>","author":"T. Stadtlander, \nF. Tschudi, \nA. Seitz, \nM. Sigrist, \nD. Refardt, \nF. Leiber, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"cdb81ab0c2ae5dc474ee0a5bc38aaf1590ad8ec490dcbf8887de9ab3c7b08ac2","category":"Environment"}