{"title":"Intensification and Changing Spatial Extent of Heavy Rainfall in Urban Areas","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004505?af=R","date":1725980112000,"content":"<h2>Abstract</h2>\n<p>Urban areas have been shown to impact rainfall by altering both its intensity and spatial structure at sub-hourly and sub-kilometer scales. However, there is currently no clear understanding of the precise pattern of change and the mechanisms that drive these changes. Since the hydrological response in urban areas is highly sensitive to such rainfall properties, understanding these changes is critical to improving our ability to assess urban flood risk. We use 7 years of high-resolution weather radar data (4- or 5-min and 1 km) to analyze changes in patterns of rainfall intensity, spatial structure, and storm evolution across eight urban areas within Europe and the United States. The use of the same methodology across the different cities enables a consistent comparison among them. We track convective rainfall events using a storm tracking algorithm and assess changes in rainfall properties in the upwind, center, and downwind regions of each city. We also investigate changes in the frequency of storm initiations, terminations, splitting, and merging. Our results show that urban areas act to intensify rainfall—mostly over them, but sometimes on their peripheries. Overall, larger cities tend to show the largest rainfall enhancements. Our findings highlight that rainfall spatial structure is altered over the urban core; usually resulting in more spatially concentrated rainfall. We also observe increased storm initiations over most cities and increased storm splitting over one. Given that demographic projections show that future urban population will increase, our results point toward an increased future flood risk in growing cities.</p>","author":"Herminia Torelló‐Sentelles, \nFrancesco Marra, \nMarika Koukoula, \nGabriele Villarini, \nNadav Peleg","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"cdc2bf81da0b754020cb785ad8696162ceed3e91d29fa4f9fbd92ee309be89d0","category":"Environment"}