{"title":"Evaluating Adaptation Pathways in a Complex Multi‐Risk System","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004288?af=R","date":1716879600000,"content":"<h2>Abstract</h2>\n<p>Disaster Risk Management (DRM) is complex due to interacting climate risks from interacting hazards and sectors. We develop a synthetic multi-risk test case to explore the effects of these interactions on decision-making under deep uncertainty. The test case accounts for changes in hazard impacts and occurrence frequency due to interactions between floods and droughts. Interactions between the shipping, housing and agricultural sectors are considered as well. We use this test case to explore the utility of the Dynamic Adaptive Policy Pathways for Multi-Risk (DAPP-MR) framework. DAPP-MR has been introduced to assess DRM policies' effectiveness under deep uncertainties and to develop integrated adaptive strategies considering interactions across hazards, sectors and time. With the test case, we show that the stage-wise approach of DAPP-MR, which gradually increases the complexity of the analysis, can facilitate the evaluation process. Earlier stages of the analysis can be used to establish the direct cause-effect relations, later stages allow us to identify whether additional interacting factors have a significant effect on the direct cause-effect relations. As a result, decision-makers can gain insights into dependencies and their relevance for developing short-to long-term strategies under deep uncertainty. We show that multi-risk interactions can lead to non-linear effects that influence the outcome of the policy analysis, for example, the indirect influence of a decision in one sector on another. Future work could investigate further improving the operationalization of this staged approach as well as extending the set of uncertainties, dynamics and decision-rules accounted for in the multi-risk test case.</p>","author":"Julius Schlumberger, \nMarjolijn Haasnoot, \nJeroen C. J. H. Aerts, \nVeerle Bril, \nLars van der Weide, \nMarleen de Ruiter","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"cdc64c5fd52a2e5ec814ac0bbf60165b05fcad1d1a07b38972a5a2dc9955df81","category":"Environment"}