{"title":"Using social media and citizen science to assess cultural ecosystem services along riverine landscapes","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4233?af=R","date":1722570566000,"content":"<h2>Abstract</h2>\n<p>Rivers offer cultural ecosystem services (CES) that improve people's quality of life. Advancements in computing and data storage have primarily focused on terrestrial CES, neglecting riverine areas. This study aims to develop a methodology to assess CES in riverine landscapes from social media and citizen science images related to environmental information. We collected georeferenced pictures from Flickr and iNaturalist for three main test rivers in northwest Portugal (Minho, Lima and Cávado) and classified them based on content such as ‘biodiversity’, ‘recreation/river beaches’, ‘historical heritage’ and ‘landscape’, as well as environmental spatial variables. A multimodel inference approach was applied to predict the spatial distribution of the pictures and environmental variables to support CES mapping. The methodology was applied during two time periods, before and during the most restrictive period of the COVID-19 pandemic. Results showed that estuaries were identified as ‘hotspots’ for CES related to rivers provision. There was distinct prevalence of pictures depending on the targeted river: pictures exhibiting ‘recreation/river beaches’ prevailed in Cávado (62%), ‘biodiversity’ in Lima (70%) and ‘historical heritage’ in Minho (39%). Only the values and patterns from the category ‘biodiversity’ were maintained on the two analysed periods, with the other categories not having posts in social media during COVID-19 most restrictive period. The methodology for CES assessment in rivers can be replicated using different time periods and regions due to its simple stepwise framework. The study provides valuable insights for sociocultural approaches, aiding in decision-making on freshwater environment management, despite potential limitations in image distribution.</p>","author":"Catarina da Silva, \nCláudia Pascoal, \nGiorgio Pace, \nAna Sofia Vaz, \nCláudia Carvalho‐Santos","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"cdc772bfeb66a5ce8dd7eb1221e885f95a6cb80fa854a5b9526d4f81ee0173c3","category":"Environment"}