{"title":"Long‐term effects of tagging fishes with electronic tracking devices","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12861?af=R","date":1726762738000,"content":"<h2>Abstract</h2>\n<p>Tagging fishes with internal or external electronic tracking devices (acoustic, radio, satellite, or archival tags) is invaluable to behavioural, ecological, and welfare research, but may have adverse effects on the animals studied. While short-term responses to tagging (e.g., days to weeks) have often been investigated, less information is available on longer-term impacts (e.g., months to years) and the potential chronic effects of tagging on basic biological needs such as foraging and reproduction. Here, we synthesize existing knowledge from peer-reviewed acoustic, radio, satellite, and archival tagging articles (<i>n</i> = 149) and anecdotal accounts (<i>n</i> = 72) from 36 researchers to assess the effects of tagging over prolonged periods. We identified a dearth of research that has specifically measured or quantified the impacts of tagging over a period longer than a few weeks or months (e.g., median experimental study duration = 33 days; <i>n</i> = 120 articles). Nevertheless, there was limited evidence to support a net negative long-term impact from the implantation or attachment of electronic devices. Considerations and future research directions are discussed with the goal of generating guidance to the research community and minimizing potentially detrimental impacts to study animals. Given the global application and relevance of electronic tagging research to inform conservation and management of fishes, it is imperative for scientists to continue evaluating how tagging procedures affect animal welfare, fate, and the interpretation of tracking data.</p>","author":"Jordan K. Matley, \nNatalie V. Klinard, \nFabrice R. A. Jaine, \nRobert J. Lennox, \nNatalie Koopman, \nJan T. Reubens, \nRobert G. Harcourt, \nSteven J. Cooke, \nCharlie Huveneers","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"cdca984e0b048ca3fe1e99d0a5bb05e0d11fb05ab226f9bb512eeb767a94e6c0","category":"Environment"}