{"title":"Prevalence, resistance profiles and factors associated with skin and soft-tissue infections at Jinja regional referral hospital: A retrospective study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003582","date":1722607200000,"content":"<p>by Fahad Lwigale, Daniel Kibombo, Simon Dembe Kasango, Dickson Tabajjwa, Collins Atuheire, Joseph Kungu, John Bosco Kalule, Morgan Otita, Francis Kakooza, Immaculate Nabukenya, Jonathan Mayito, Innocent B. Rwego</p>\r\n\r\nSkin and soft-tissue infections (SSTI) are common cases of hospital-acquired infections with aetiological agents exhibiting antimicrobial resistance (AMR). This is a global public health predicament responsible for a high burden of infectious diseases and threatens the achievement of Sustainable Development Goals (SDGs), especially in Low- and Middle-Income countries (LMICs). This study determined the prevalence of SSTI, proportion of laboratory-investigated cases, AMR-profiles, and factors associated with SSTI and multi-drug resistance (MDR). This was based on records of patients suspected of SSTI for the period of 2019–2021 at Jinja Regional Referral Hospital. The analysis involved 268 randomly selected patient reports using WHONET 2022 and Stata 17 at the 95% confidence level. The prevalence of SSTI was 66.4%. Cases that involved laboratory testing were 14.1%. <i>Staphylococcus aureus</i> (n = 51) was the most isolated organism. MDR pathogens explained 47% of infections. Methicillin-resistant <i>Staphylococcus aureus</i> (MRSA) was up to 44%. In addition, 61% of Gram-negatives had the potential to produce extended-spectrum beta-lactamases (ESBL), while 27% were non-susceptible to carbapenems. Ward of admission was significantly associated with infection (aPR = 1.78, 95% CI: 1.00–3.18, p-value = 0.04). Age category (19–35) was an independent predictor for MDR infections (aPR = 2.30, 95%CI:1.02–5.23, p-value = 0.04). The prevalence of SSTI is high with MDR pathogens responsible for almost half of the infections. Gentamicin and ciprofloxacin can be considered for empirical management of strictly emergency SSTI cases suspected of <i>Staphylococcus aureus</i>. Given the high resistance observed, laboratory-based diagnosis should be increased to use the most appropriate treatment. Infection Prevention and Control (IPC) strategies should be heightened to reduce the prevalence of SSTI. Recognizing SSTI under the Global Antimicrobial resistance Surveillance System (GLASS) would lead to improved preparedness and response to AMR.","author":"Fahad Lwigale","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"cdcee3539e81d6685f772cc2071fcc5b3208cbfb42df59b600668640c3d73c0c","category":"Environment"}