{"title":"Unifying Coral Reef States Through Space and Time Reveals a Changing Ecosystem","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13926?af=R","date":1729230585000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Ecological state shifts that alter the structure and function of entire ecosystems are a concerning consequence of human impact. Yet, when, where and why discrete ecological states emerge remains difficult to predict and monitor, especially in high-diversity systems. We sought to quantify state shifts and their drivers through space and time in the most ecologically complex marine ecosystem: tropical coral reefs.</p>\n<h2>Location</h2>\n<p>Worldwide.</p>\n<h2>Time Period</h2>\n<p>1987–2019.</p>\n<h2>Major Taxa Studied</h2>\n<p>Coral reef communities.</p>\n<h2>Methods</h2>\n<p>Using a global dataset of 3375 coral reef surveys, along with 13 time series datasets ranging between 1987 and 2019, we applied a novel double-dichotomy approach to classify coral reefs into four simplified and discrete states based on the relative contributions of corals versus algae to benthic cover and small-bodied versus large-bodied fishes to fish standing stock. We then examined state shifts considering a range of spatial predictors and tested whether states have shifted directionally over time, and the nature of the most common transitions.</p>\n<h2>Results</h2>\n<p>We show that geographic, environmental and anthropogenic context fundamentally shapes coral reef states at the local scale, which explains disparities among case studies, and stakes out critical baseline expectations for regional management efforts. We also reveal clear multi-decadal state shifts on coral reefs: over time, systems dominated by reef-building corals and small-bodied, planktivorous fishes tend to have been replaced with reefs characterised by algae and larger-bodied fishes.</p>\n<h2>Main Conclusions</h2>\n<p>Our results suggest a previously unrecognised transition from systems that harness external subsidies through small-bodied consumers associated with structurally complex live corals, to herbivore-dominated systems with stronger bottom-up dynamics. Overall, the partitioning of complex reef ecosystems into a small suite of discrete ecological states suggests that spatial context-dependency, shifting baselines and changes in reef functioning are crucial considerations for coral reef management in the 21st century.</p>","author":"Simon J. Brandl, \nJérémy Carlot, \nRick D. Stuart‐Smith, \nSally A. Keith, \nNicholas A. J. Graham, \nGraham J. Edgar, \nJérémy Wicquart, \nShaun K. Wilson, \nRucha Karkarey, \nMary K. Donovan, \nJesus E. Arias‐Gonzalez, \nRohan Arthur, \nLionel Bigot, \nDan A. Exton, \nJordan Goetze, \nAndrew S. Hoey, \nThomas Holmes, \nJean‐Philippe Maréchal, \nDavid Mouillot, \nClaire L. Ross, \nJulien Wickel, \nMehdi Adjeroud, \nValeriano Parravicini","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"cdd4a59a3a2f4011aa31d712df6241b77ee5bc1a5595c8f31ca5462a58d4da4d","category":"Environment"}