{"title":"ผู้ซื้อรถ Tesla คันใหม่พบพอร์ต USB หายไป, ชาร์จไร้สายใช้ไม่ได้โดยไม่แจ้งก่อน บริษัทระบุเพราะชิปขาดแคลน","link":"https://www.blognone.com/node/125828","date":1636860802000,"content":"<div><div><div><p>แม้ว่า Tesla จะเป็น<a href=\"https://www.blognone.com/node/125390\">หนึ่งในบริษัทรถยนต์ที่เติบโตได้แม้ชิปขาดแคลน</a> แต่กลับกันผลร้ายกลับมาตกที่ผู้ซื้อรถ Tesla โดยตอนนี้มีรายงานว่ารถ Tesla บางคันโดนถอดพอร์ตเสียบ USB-C ในรถ รวมถึงระบบชาร์จไร้สายก็ไม่สามารถใช้งานได้ ผู้ได้รับผลกระทบบางรายระบุว่าพบเอง ไม่มีการแจ้งเตือนจาก Tesla มาก่อน</p>\n<p>เว็บไซต์ Electrek รายงานว่า ผู้ซื้อรถ Tesla Model 3 และ Model Y จำนวนหนึ่งรายงานว่า รถยนต์ที่เพิ่งรับมา ตัวพอร์ต USB-C ตรงคอนโซลกลางหายไป และไม่สามารถใช้งานระบบชาร์จแบตเตอรี่ไร้สายได้ ซึ่ง Electrek สำรวจเบื้องต้นจากข้อมูลผู้ใช้ Tesla บนอินเทอร์เน็ต พบว่าพอร์ต USB-C พบครั้งสุดท้ายในผู้รับรถ Model Y เมื่อวันที่ 6 พฤศจิกายนที่ผ่านมา</p>\n<p>ปัญหาชิปขาดแคลนไม่ได้พบเฉพาะ Tesla แต่ส่งผลกระทบกับค่ายรถอื่น ๆ ไปทั่วทั้งอุตสาหกรรม โดยกรณีของ <a href=\"https://www.theverge.com/2021/11/5/22765709/bmw-chip-shortage-touchscreen-car-suv-manufacturing\">BMW</a> ก็ตัดสินใจถอดฟีเจอร์จอสัมผัสออกจากรถยนต์บางรุ่นและแทนที่ด้วยคอนโทรลเลอร์ (ที่ลักษณะเหมือนทัชแพด) บนคอนโซลกลางแทน โดยผู้ซื้อรถจะได้รับเครดิต 500 เหรียญเพื่อชดเชยฟีเจอร์ที่หายไป และต้องเซ็นแบบฟอร์มรับทราบกับดีลเลอร์ด้วยว่าฟีเจอร์ถูกถอดออกจากรถที่รับมา</p>\n<p>ส่วนกรณีของ Tesla พบว่าแม้จะมีผู้ซื้อบางคนที่ได้รับการแจ้งเตือนก่อนรับรถ แต่บางคนก็รายงานว่าไม่ได้รับทราบข้อมูลนี้และไปพบเองที่บ้านว่าพอร์ตหายไปกับระบบชาร์จไร้สายใช้งานไม่ได้ ส่วนฝั่ง Tesla ยืนยันว่าเป็นปัญหาจากชิปขาดแคลนจริง แต่ฟีเจอร์นี้มีผู้ใช้งานน้อยมากและไม่ได้มีมูลค่ามากมายนัก ซึ่งถ้าชิ้นส่วนนี้มาผู้ซื้อรถก็สามารถเข้ามารับบริการใส่เพิ่มได้ โดยคาดว่าน่าจะเป็นช่วงเดือนธันวาคมนี้</p>\n<p>Electrek ให้ความเห็นว่าชิปขาดแคลนเป็นเรื่องที่เข้าใจได้ว่าผู้ผลิตรถยนต์ได้รับผลกระทบกันทั้งอุตสาหกรรม แต่การที่ Tesla กระทำลักษณะนี้คือไม่แจ้งให้ลูกค้าทราบก่อนจนลูกค้าไปพบเองตอนรับรถไปแล้วเป็นเรื่องที่รับไม่ได้ อย่างน้อย Tesla ต้องแจ้งให้ลูกค้าทราบก่อน และต้องมีชดเชยบางอย่างให้ลูกค้าที่เลือกจะรับรถ (เช่น ให้เครดิต Supercharger) หรือให้สัญญาณที่ชัดเจนว่าถ้าชิ้นส่วนมาแล้วจะให้เข้ามาติดตั้งเมื่อไร</p>\n<p>ที่มา - <a href=\"https://electrek.co/2021/11/12/new-teslas-delivered-with-surprise-missing-usb-ports-due-to-parts-shortages/\">Electrek</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/43aef33ece5c7fc385647cbf4aa88d70.jpg\" /><br />\nTesla Model 3 ภาพจาก <a href=\"https://www.tesla.com/tesla-gallery\">Tesla</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla-motors\">Tesla Motors</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cddc6498f3e95d85e9c8bd5ae13b52d122c008212ceb2b448c3b9cf04a09165f","category":"Thai"}