{"title":"Also in Crayfish: How Phytase Inclusion Avoids Phytic Acid Effects on Hepatopancreas Enzymes of Redclaw Cherax quadricarinatus","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/4341218?af=R","date":1676880000000,"content":"<p>This work aimed to evaluate the effects of dietary phytic acid on the enzymatic activities of the hepatopancreas of the redclaw crayfish, <i>Cherax quadricarinatus</i>. For this purpose, a completely randomized <i>in vitro</i> trial was conducted with three phytic acid levels (0.56, 1.68, and 2.80%) and three phytase doses (0, 250, and 500 PU/kg DM). Solubilized protein, reducing sugars, and soluble phosphorus showed significant responses to the interaction between phytic acid and phytase (<i>p</i> &lt; 0.001). Only the main effects were detected on the released amino acids, in keeping with the main effects of alkaline protease activity, which are negatively affected by phytic acid (<i>p</i> &lt; 0.001) and improved by phytase inclusion (<i>p</i> &lt; 0.001). Differences in released reducing sugars were attributed to a reduction in amylase activity by increased levels of phytic acid and not to cellulase activity, where only a negative trend of phytic acid was found (<i>p</i> = 0.068). Phytic acid depresses calcium availability, which would explain the decrease in amylase activity. A 500 PU/kg DM dose improved amino acid, reduced sugars, and phosphorus release. These <i>in vitro</i> results might have <i>in vivo</i> implications for the digestibility of proteins, minerals, and energy. Further investigations are required to determine the chelated calcium effect on redclaw amylase activity, molting, and survival.</p>","author":"Matías E. Casaretto, \nLiane Stumpf, \nRosendo L. Azcuy, \nLaura S. López Greco, \nDarío Colombatto, \nHisham Abdelrahman","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"cde9aaff591fb9c97cdbffddd5dde54e72a83b7d16447438a4073724e8f4588e","category":"Environment"}