{"title":"The surprisingly robust careers of Star Trek stars who became video game voice actors","link":"https://arstechnica.com/?p=1986874","date":1701691212000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/tng_original_costumes-800x533.jpg\" alt=\"Actors in starfleet uniforms pose in a line with Patrick Stewart in the middle\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/tng_original_costumes.jpg\">Enlarge</a> <span>/</span> Cast members from <em>Star Trek: The Next Generation</em>. (credit: CBS)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It would be hard to overstate the impact that Star Trek has had on geek culture. So it shouldn’t come as a surprise that when folks who spent years watching the shows pursue careers in game development, they seek out the actors from one of their favorite TV shows to bring their creations to life. From TOS to VOY, many Star Trek actors followed up their star-making screen performances with voiceover work in video games.</p>\n<p>Of course, many of the cast members reprised their roles for licensed Star Trek games or reappearances of their Starfleet personas over the years; studios understandably don’t want to recast iconic parts if they can avoid it.</p>\n<p>But games have also provided many of these talented actors with a chance to create new characters and explore new genres beyond the ones that made them household names. If they’re not so versatile, working in games at least meant a chance for a paycheck after the series finale aired.</p></div><p><a href=\"https://arstechnica.com/?p=1986874#p3\">Read 51 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986874&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cdffbc3b4f7b7c27420b9df9f0fde436b12704109182947373ae3dc5f4e15ee8","category":"Tech"}