{"title":"Naringin Induces ROS‐Stimulated G1 Cell‐Cycle Arrest and Apoptosis in Nasopharyngeal Carcinoma Cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24378?af=R","date":1721996964000,"content":"<h2>ABSTRACT</h2>\n<p>Naringin, a bioflavonoid compound from grapefruit or citrus, exerts anticancer activities on cervical, thyroid, colon, brain, liver, lung, thyroid, and breast cancers. The present investigation addressed exploring the anticancer effects of naringin on nasopharyngeal carcinoma (NPC) cells. Naringin exhibits a cytotoxic effect on NPC-TW 039 and NPC-TW 076 cells with IC<sub>50</sub> 372/328 and 394/307 μM for 24 or 48 h, respectively, while causing little toxicity toward normal gingival epithelial (SG) cells (&gt;500/500 μM). We established that naringin triggered G<sub>1</sub> arrest is achieved by suppressing cyclin D1, cyclin A, and CDK2, and upregulating p21 protein in NPC cells. Exposure of NPC cells to naringin caused a series of events leading to apoptosis including morphology change (cell shrinkage and membrane blebbing) and chromatin condensation. Annexin V and PI staining indicated that naringin treatment promotes necrosis and late apoptosis in NPC cells. DiOC<sub>6</sub> staining showed a decline in the mitochondrial membrane potential by naringin treatment, which was followed with cytochrome <i>c</i> release, Apaf-1/caspase-9/-3 activation, PARP cleavage, and EndoG expression in NPC cells. Naringin upregulated proapoptotic Bax and decreased antiapoptotic Bcl-xL expression, and dysregulated Bax/Bcl-xL ratio in NPC cells. Notably, naringin enhanced death receptor-related t-Bid expression. Furthermore, an increased Ca<sup>2+</sup> release by naringin treatment which instigated endoplasmic reticulum stress-associated apoptosis through increased IRE1, ATF-6, GRP78, GADD153, and caspase-12 expression in NPC cells. In addition, naringin triggers ROS production, and inhibition of naringin-induced ROS generation by antioxidant <i>N</i>-acetylcysteine resulted in the prevention of G<sub>1</sub> arrest and apoptosis in NPC cells. Naringin-induced ROS-mediated G<sub>1</sub> arrest and mitochondrial-, death receptor-, and endoplasmic reticulum stress–mediated apoptosis may be a promising strategy for treating NPC.</p>","author":"Chan‐Hung Chen, \nNi Tien, \nChun‐Hsu Yao, \nSiang‐Jyun Chen, \nDa‐Tian Bau, \nSudhir Pandey, \nHsin‐Ling Yang, \nYou‐Cheng Hseu, \nShih‐Shun Chen, \nMeng‐Liang Lin","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"ce09812a879028b1d27ac4c1c004fe2e16dd84418c726c2e9ae8b1db9bcfc35a","category":"Environment"}