{"title":"Crew Dragon has flown four more people—all private citizens—into space","link":"https://arstechnica.com/?p=1795344","date":1631740199000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Inspiration4-_-Launch-4-29-55-screenshot-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Inspiration4-_-Launch-4-29-55-screenshot.png\">Enlarge</a> <span>/</span> The Crew Dragon spacecraft separates from the second stage of a Falcon 9 rocket. (credit: SpaceX)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><strong>8:30pm ET Wednesday update</strong>: As the Sun set over the Florida launch site on Wednesday evening, a Falcon 9 rocket soared into the darkening sky carrying four private citizens into space. About 12 minutes later the spacecraft separated from its second stage, and the Crew Dragon spacecraft began the first of nearly four dozen orbits around planet Earth. The Inspiration4 mission had a flawless start.</p>\n<p>So opened the new age of space commercialization, with SpaceX now capable of flying orbital commercial human spaceflights, and Virgin Galactic and Blue Origin selling commercial suborbital flights. Before this summer, more than 95 percent of all people who went to space were professional astronauts. After this summer, 95 percent of all people who go to space will likely be private citizens.</p>\n<p><strong>Original post</strong>: There has been a minor kerfuffle in the space community over the last few weeks about what to call the Inspiration4 mission that is set to launch this evening from Florida on SpaceX's Falcon 9 rocket.</p></div><p><a href=\"https://arstechnica.com/?p=1795344#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795344&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ce0f4756c1adec3fae654ee75e066881ecab05e6880649ab9c9f67f69f8d240d","category":"Tech"}