{"title":"Where Bintage Hides In The Spectrum Of Fantasy And Reality: A Tael Of Two Brother Cycles Mr Wooden Builds – Petor Georgallou","link":"https://theradavist.com/brother-cycles-mr-wooden-bintage-review/","date":1696503620000,"content":"<p><em><a href=\"https://www.instagram.com/dear_susan_/\" target=\"_blank\">Petor Georgallou</a> recently built up a <a href=\"https://www.brothercycles.com/\" target=\"_blank\">Brother Cycles</a> <a href=\"https://www.brothercycles.com/shop/frames/mr-wooden/\" target=\"_blank\">Mr. Wooden</a> alongside his buddy Neil. Below, Petor delves into piles of parts and decides on some unusual choices as the cornerstone of his build. Follow along for his musings on old bike parts, laughing with friends, and maybe even getting two whole bikes running for the price of one. </em><span></span></p>\n<p><img loading=\"lazy\" width=\"1777\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?w=1777&amp;quality=75 1777w, https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-2.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>Bintage <i>adjective</i>:<span>  </span>like vintage, but either from, or fit for a bin. No individual part should be either fully intact and functional OR have reasonable financial value. Parts should not be worth your while to list on eBay or Craigslist or any other selling platform because of their intrinsically low value or slightly broken-ness. A mech can work just fine(ish) with a cracked cage, but no reasonable person in their right mind would buy an old 8-speed XT mech with a cracked cage. This is bintage. It’s too good to throw away but somehow not good enough to sell or even really use. Although there are nuanced differences between respectable bintage and piles of old shit, this distinction lies often with the shop mechanics’ mood swings.</p>\n<p>Walter, sits, strapped into a child seat attached to an old touring bike, leaned up against a battered and well sticker-bombed counter, that doubles as a Schwalbe inner tube display case. Agitated and restless, his face distorting to discontentment. He stares into the middle distance blankly as chubby, sticky fingers that seem to have their own, very separate consciousness pick tiny fingernail-sized chunks out of age-softened grip tape. Jaded, bored past submission and into rebellion, he fidgets and sighs until he can no longer suppress the crushing ennui.</p>\n<p>“Daddy! Why is bikefix so rubbish!”<br />\n“Because it’s a bike shop, and that’s a place where fantasy meets reality” replies Patric<br />\n“I hate bikefix! Can we go?</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-10.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Bikefix, on Lambs Conduit Street, is London’s second longest surviving bike shop preceded only by Condor, a two-minute cycle away on Grays Inn Road. 40 years later both Walter and Patrick are still customers who I’ve shared wasted afternoons with, propped up against the same beaten-up counter drinking coffee from dirty cups tinged with the smell of copper slip, lithium grease, and the fishy powder that inner tubes are filled with<em>.</em> Bike shops, REAL bike shops, the kind run by actual enthusiasts of their own volition ARE where fantasy meets reality. While ultimately that might sound like a recipe for disappointment, it actually makes them more of a melting pot of fantasy and reality. Where even the best-laid plans can fail, where dreams come true and the potential of one person’s rubbish is molded into a workaround, in the absence of another person’s treasure. Proper bike shops are breeding grounds for lifelong bonds, undulating friendships, and repressed support networks. A proper bike shop exudes a very particular vibe because it’s an extension of the proprietor’s personal collection of bikes and souvenirs that they have accumulated along the way.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-7.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Bikefix is one of my favorites because it’s the shop Mike Burrows and Richard Ballentine used to hang out in and that Andrew Ritchey and Geoff Apps used to visit. It’s as if their essences have somehow rubbed off on it. It’s not immediately apparent; but in greasy plastic boxes buried under piles of current junk, lurk the bintage treasures of past mechanics, forgotten but not lost, waiting for their time to be shined. Independent shops of a certain age accumulate bintage parts over time. Mechanics have their hiding holes for things that should go in the bin, but which retain the mystical allure, perhaps through novel design or local scarcity of a thing that might still be useful one day? As the mechanics change or move on over time, the bintage remains; an artifact from another time to be uncovered by future generations (of mechanics).</p>\n<p>Just as the kinds of bike shops I waste my days in have a specific vibe, they also have their own unique flavor of bintage. Going to the wrong shop for the wrong weirdness is like walking into a funeral parlor and asking if they sell used refrigerators. When Brother Cycles asked me to review their new “Mr Wooden” 650b rim brake frame, I called Neil, the proprietor of “Neil’s Wheels” in east Molesey where I grew up, because I knew he’d have the ideal pedigree of vintage.</p>\n<p><img loading=\"lazy\" width=\"1859\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?w=1859&amp;quality=75 1859w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=1024,734&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=768,551&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=1800,1291&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=1335,957&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=700,502&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-22.jpg?resize=1536,1101&amp;quality=75 1536w\" /></p>\n<h3>Mr Wooden</h3>\n<p><a href=\"https://www.brothercycles.com/shop/frames/mr-wooden/\">Mr Wooden</a> is Brother’s new 650b rim brake modern(ish) rando-touring gravel-commuter, so it’s both niche as hell and “just a bike” at the same time. It’s named after the two brothers’ old school teacher, designed around traditional standards so you can use any old parts with it, but with the plot twist of having to use 650b rim brake wheels. Why would anyone in 2023 want a bike with rim brakes? Rim brakes mean heavier rims, trickier tubeless setup, and less scope to fit different wheel/tyre size combos. However… All production bikes are ISO tested, which means destructive testing of a sample frame that is stressed within specified parameters for a specified number of repetitions to simulate a life cycle of a specific use case such as “road cycling” or “touring” or “downhill with jumps” or “grav grav”. All of this means that a rim brake production frame can be built lighter and more flexible than an equivalent disk brake frame while being able to take the same amount of punishment over the years. With rim brakes, you can perhaps get closer to the feel of a one-off, handmade frame designed around being comfortable. While lighter is nice, more flexible is more comfortable, which if you’re not worried about fast climbs and sprinting pretty much translates to better a lot of the time.</p>\n<p><img loading=\"lazy\" width=\"1841\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?w=1841&amp;quality=75 1841w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=1024,741&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=768,556&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=1800,1303&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=1335,967&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=700,507&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-41.jpg?resize=1536,1112&amp;quality=75 1536w\" /></p>\n<p>I hit up Sam from Freshtripe, for a wheelset that he built for the bike, with a pair of Miche road bike hubs, 36h on Velo Orange’s super nice and reasonably light voyager rims, and he also hooked me up with some mudguards and some kind of nice Nitto drop bars. Mr Wooden was shaping up to be a nice randoish build… but something about that just didn’t sit right with me. I have a huge amount of respect for francophile rando dreamers, gliding silently and smugly over poorly paved roads in inclement weather, but Mr Wooden isn’t about that life, Mr Wooden exudes the essence of an everyman’s bike, and I was pretty keen on the idea of reviewing a bike that’s built at a genuinely low price point. So if I wasn’t going to succumb to randoisms, I had to think laterally about 650b utopias and where they occur. I definitely wanted to use tubeless tyres because they’re the best thing since sliced bread. The 650b rim brake thing had become a bit of a sticking point to an everyman bintage build because old 650b rim brake wheels that I’d want to ride don’t really exist and new ones are niche enough to need to be special ordered and then hand built in all bike shops. Although they offer a lighter more supple frame than is available off the peg with a disk build, the problem with rim brakes is you have to have rim brakes.</p>\n<p>Geoff Apps began trying to build bikes for real off-road cycling in boggy British woodlands where canti brakes clog up. Geoff repurposed Leleu French moped hubs from the 50s which had braking power for faster heavier vehicles, as well as being shielded from the elements and having a hole for water to drain out. They were perfect. This became the starting point to my Mr Wooden. I managed to pick up a pair of NOS rear Leleu hubs, spare brake pads, and fittings for £25. I used two rears rather than a proper pair because the flanges are wider on the rear and build a stronger stiffer wheel. With a bit of fettling and a bit of imagination, they were easily modified to fit the frame</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-6.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>The Most Fun You Can Have With a Bike… Without Having To Ride It.</h3>\n<p>I’d had the original wheels sent to Neil’s Wheels where I’d planned to spend a day building the bike and wallowing in the warm bath of nostalgia with Neil, and shop mechanic Nick, using only Bintage parts that Neil had hoarded over the last decade in his shop, and probably a decade before it opened. It has benches and stands for two mechanics as well as a bit of stock but mostly it’s a treasure trove of premium late 90s and early Y2K bintage. In recent years the warehouse had been a lot tidier and emptier. It was a behavior I didn’t want to endorse so I didn’t ask any questions. Instead, I put it down to Neil perhaps having capitalized on the fact that during the covid pandemic, people would buy literally any bike part in any condition for any amount of money on eBay. Or perhaps because we were grown-ups now, beaten down by our own borderline respectability to only moderate levels of hoarding.</p>\n<p>I walked into the warehouse with a small cardboard box of parts I’d chosen from my own stash of weird junk, greeted by Nick, who was sitting on the wall outside wearing a Nirvana t-shirt with a picture of Owen Wilson on it, smoking what looked like a ballpoint pen.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-15.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Neil stood surrounded by a pile of plastic and cardboard boxes and weird paint tin-like storage kegs, spread in a chaotic jumble all over the floor. I recognized this junk. This was unmistakably the same junk that Neil had in the shop before I even worked there. Aged like a fine wine some of it must even have become valuable… I don’t see NOS Odyssey titanium BMX seat bolt binders pop up on eBay EVER. Or real design titanium bottom bracket axles, still in their age-weathered boxes from new.</p>\n<p>Ahead of the build, Neil had put in a pre-order for an identical frame to build himself a matching, also bintage Mr Wooden at the same time. It worked out pretty well because it meant that Nick could build me up a set of wheels with Halo Vapor rims around the Leleu hubs, while Neil used the Freshtripe Velo Orange wheels on his build and nothing went to waste, because who knows how long a set of 36h rim brake 650b wheels can sit around a small independent bike shop for.</p>\n<p><img loading=\"lazy\" width=\"2133\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?w=2133&amp;quality=75 2133w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=1024,640&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=2000,1250&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=768,480&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=1800,1125&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=1335,834&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=700,437&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=1536,960&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/10/Bintage-26.jpg?resize=2048,1280&amp;quality=75 2048w\" /></p>\n<h3>My Mr Wooden</h3>\n<p>The starting point was the hubs. Leleu hubs are incredibly well-designed things that in spite of being very cheaply cast in some kind of low-grade aluminum alloy offer super powerful and wonderfully modulated braking, albeit with the uniquely spongey character of drum brakes. Using drum brakes gave me carte blanche over a decent selection of 650b disc rims, although I wanted to keep the build as inexpensive as possible, while still being something I want to ride, so I chose Halo Vapor rims which are about the cheapest, pretty good looking, robust and moderately light rims out there. They’re a few grams heavier than a light carbon rim which makes a difference, but not as much difference as a reasonably light tyre, so chose the fanciest version of the Schwalbe G-One to shave off a bit of rotating mass. I cut up a wicker basket support and drilled holes at each end to make the torque arms for the brakes. The rear ran to a modified BB mounting plate for a front mech, also working as a BB spacer on the non-drive side, for maximum possible leverage and rigidity. The front torque arm was bent back on itself and attached to the brake boss which is where I figured it would be safest, as the boss would be under tension, rather than applying a sheer force to a bolt in one of the front fork eyelets intended for a rack. The rims, tyres, saddle, mudguards, bag support, grips, chain, and cables were the only new parts we used for the build.</p>\n<p><img loading=\"lazy\" width=\"2183\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?w=2183&amp;quality=75 2183w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=1024,625&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=2000,1221&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=768,469&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=1800,1099&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=1335,815&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=700,427&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=1536,938&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/10/Bintage-5.jpg?resize=2048,1251&amp;quality=75 2048w\" /></p>\n<p>For the bottom bracket, I used a Real Design adjustable bottom bracket with 4 sealed bearings. He offered me a titanium axle which I respectfully declined as it crossed a line from bintage to quite posh. To the BB I mounted a used set of triple cranks, from a specialized allez, because at 170 they were the shortest in the box of old cranks, with a melange of chainrings from a different chainset. I sort of cheated a bit with the rear mech because although it was cobbled together from two 8-speed mechs, with jockey wheels from a third, it had become a fully functional rear mech. We found a matching front with the screw that holds the cage together missing, which first I ran with a cable tie holding it together, but later upgraded to a different used screw. I wanted to use a 1⅛ quill stem that Paul Sadoff gave me in 2019, which is a cheaply made casting of a jaguar leaping in the air holding the handlebars in its mouth, which has to be the campest stem I’ve ever seen, but it was too short and too tall, so after trying out an old race face stem that matched the seat post I ended up with an FRM web-stem where I feel “web” relates to the internet rather than a spider. I have no idea where it came from but it’s nicely machined, super long, and has been moved from drawer to drawer and house to house with me for the last 15 years.</p>\n<p><img loading=\"lazy\" width=\"1872\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?w=1872&amp;quality=75 1872w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=1024,729&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=768,547&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=1800,1282&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=1335,951&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=700,498&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-38.jpg?resize=1536,1094&amp;quality=75 1536w\" /></p>\n<p>The Leleu hubs are threaded for a French freewheel and in the absence of a French threaded 8-speed freewheel I took the advice of some old mountain bike guys and just used a standard one, filling the void between the threads with plenty of PTFE plumbing tape. The actual freewheel I used was a close-range NOS Sachs road bike freewheel, which makes no discernible ratchet sound as you freewheel. At speed, you can hear the bearings which sound pretty dry spinning in the freewheel. It is serviceable, with a tool neither I nor anyone else owns, so if I ever find one, I’ll open it up and give it a wipe down and some fresh grease. The chain was a basic SRAM 8-speed chain, but the cables were stainless because I got a bit squeamish about running NOS galvanized cables. I’d plucked out a pair of grip shift shifters with the idea of using them, but it was more convenient to pluck an entire cockpit from a dead Muddy Fox courier. The cockpit included a Muddy Fox aluminum handlebar of a modest width, a pair of deore shifters that can be switched between basic indexed mode and friction, as well as a pair of super long dia-compe levers that wouldn’t look out of place on a moped. The super long levers with their additional leverage and cable pull definitely make the most of drum brakes.</p>\n<p><img loading=\"lazy\" width=\"1777\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?w=1777&amp;quality=75 1777w, https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-30.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>For the seat post, I used one of my favorite post designs of all time from Race Face. There’s nothing wildly remarkable about it, it’s just a 27.2 seatpost which is very easy to set up and adjust. Critically I already had it and they go for about £10 on eBay. To that, I mounted a new SQ labs 611 Ergowave active 2.1 saddle which I was given to review. I’ve ridden it on a number of bikes over the last 12 months and although it took a minute to get used to it’s since become my go-to for almost every bike. The active rear rail support allows the saddle to slightly rock from side to side as your pelvis moves, which is nothing on short rides but makes a huge difference to me at least over longer rides. Since trying one out, I’ve slowly begun to replace all my saddles with Sq Labs active saddles in one form or another, and Mr Wooden was no exception, so I splashed out for comfort. Perhaps the most outwardly fancy part we used was a Chris King headset, It consists of parts from three different headsets, all previously installed in their second life on jump bikes using the 2×4” softwood installation tool and ridden without servicing well after they became wobbly. The crown race had become so enlarged it needed to be installed with part of an ancient Lucazade can (which was already in the headset) to not fall off. Having reamed and faced the frame and fork as per the Chris King installation instructions with the park tool reaming/facing tools for precision fit, Nick managed to push the headset cups into the frame with his hands, finally tightening them for theatrical effect only using the Chris King cups on the park tool headset press. Grips were silicone foam directly from China via eBay, and I used a slightly wobbly pair of DMR V8 pedals with mangled pins stuck in the platform.</p>\n<p>A couple of finishing touches on my bike included a DKG MAGlite holder for a vintage Maglite made from 3 different lights, and fitted with a warm white LED, and a Ballern silver soldered stainless front bag support, cradling a wizard works mini shazam.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-48.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Neils Mr Wooden</h3>\n<p>Neil built his bike up the following day, from the same parts pool and with the same ethos, however, we ended up in slightly different places with our builds. Neil used cantilever brakes as intended, on the Miche/Velo Orange wheelset built by Sam at Freshtripe, Suntour 8-speed front and rear mechs with downtube shifters, and most critically drop bars.</p>\n<p>His bike also had a smattering of absurd bintage GOLD with Cook Brothers cranks which work loose having previously been fitted on a BB with the wrong taper, a fully working Chris King headset (also fitted downside up as per the house style), and a titanium rolls saddle fitted to a Thomson masterpiece seatpost which are both definitely cheating.</p>\n<p>Mounted to the titanium Rolls which had been previously modified with bag loops was an ancient Carradice bag on the rear, cradled by a bent wire bag support that sort of wedged itself around the seat stays and cantilevered from them.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-49.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>First Impressions</h3>\n<p>First impressions are a weird thing, because like memories they’re not real, instead they’re some kind of muddle of perception vs. expectation with a dash of current situation thrown in for good measure so while sometimes they can be poignant often they are a relative point of view. I built up my Mr Wooden having just returned a Quirk Suprachub I’d been riding for a few months, built around a £3300 more expensive frame, with all the good stuff, so it’s no surprise that that bike was a lot better in almost every way.</p>\n<p>We rode a few streets away to Esher Common and then into Oxshot Woods which are super sandy, and only slightly undulating. It was a nice mix of tarmac, footpaths, and gentle trails that I guess people might call singletrack. It was a pretty classic use case for “GravGrav” in the UK. Mr Wooden is a weird name for this bike because although Mr Wooden is a character of Will and James’s childhoods to whom the bike’s ethos relates, wooden is also a generally negative descriptor of a ride characteristic of overly stiff uninspiring bikes. Mr Wooden couldn’t be further from that. Ironically the other bike I started reviewing at the same time is actually made from wood!</p>\n<p>Setting out from the shop on the tarmac I was immediately boiling over with a weird nostalgia-fueled relief. I could just relax on this bike in a way I haven’t felt, probably since I last rode an 8-speed drivetrain. Everything about the whole bike was just so smooth. A lightweight butted steel tubeset, middle-of-the-road geometry, generously plump tubeless tyres, and a steel fork with curved tapered blades. Clean 8-speed drive trains just run so, so smoothly, especially with a triple up front keeping the chain line relatively straight, pedaling just feels nicer than anything 1×12, even in the middle of the cassette.</p>\n<p>The drum brakes were also soft and silent with miles of modulation and more than enough power, especially since they perform exactly the same in both wet and dry conditions. Freewheeling silently, watching the front hub bounce around so separately to the fork crown, eating every little bit of texture in the road, and shitting out luxury made any notions of suffering or riding hard seem ridiculous. It had glimmers of the highly refined ride quality that 1950s British lightweights have; delicate but also planted. I say glimmers because although there are some similar design choices, in terms of tube diameters, Mr Wooden is a modern welded frame, which can withstand off-road riding and loaded touring so it’s just different.</p>\n<p><img loading=\"lazy\" width=\"1777\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?w=1777&amp;quality=75 1777w, https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-40.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>I wouldn’t recommend Mr Wooden for any kind of seriously loaded touring, because it’s just too flexy and not at all wooden, which is why with just one small bar or saddle bag it feels so soft and smooth and luxurious. The frame doesn’t really work that well with my bike fit because it has a very short reach, and high stack so I’d say that while flats are fine, and having ridden both mine and Neils, the geometry works better with drop bars. Both Neil and I would normally ride a 56 or a Large in most stock bikes, but we both feel like we could have sized up to an XL for a bit more reach.</p>\n<p>On that first ride I quite strongly felt that I would have liked a bit more reach, which is partly a bike fit thing, but also a bit more front center to feel a bit more stable off-road, and a bit less trail to balance out that stability. On the trails, it definitely felt sketchier going down than the super high spec drop bar 29er that I’d been riding up until then, but climbing was controlled and comfortable.</p>\n<p>I guess my first impressions kind of stack with the numbers on the geometry chart, it’s a 73/73 parallel frame with a 435mm back end, 65mm bb drop, a relatively short reach, optimized for use with drop bars, and a pretty generous stack. On paper, it’s not an average bike in the sense that you’d be hard-pressed to find another 650b rim brake-specific production frame (although there are plenty built by small independent manufacturers/frame builders).</p>\n<p>My initial impressions are that while Mr Wooden kind of relates to rando bikes, it also kind of relates to old mountain bikes and gravel bikes from 5 years ago. The relatively supple and lightweight tube set feels more like a specialist high-end bike than its £699 price tag would suggest, and it’s this specifically rim brake-focused build that gives it some character. In terms of geometry, It has the distinct air of not knowing what it wants to be and that’s not a slur.</p>\n<p>Mr Wooden is designed to be a bit neither here nor there because it gives you the freedom to build it in radically different ways (albeit around a 650b rim, or in my case drum brake wheel) to be a radically different bike, which is why Neil and I had more fun putting them together than we have probably any other bike in the last decade. My build cost less than £1200 at RRP and is a really fun and engaging bike to ride.</p>\n<p><img loading=\"lazy\" width=\"1777\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?w=1777&amp;quality=75 1777w, https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-24.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>Having ridden the bike for a couple of months alongside two other bikes, it’s become the bike I reach for as transport. It’s the bike I reach for for chilled social rides, and it’s the bike that has a loaded bag on the front most of the time. I can’t imagine it at this point without the Wizard Works mini Shazam or the Ballern bag support. I keep a strap borrowed from an old messenger bag attached to the shazam, so I can take it off when I lock the bike up outside overnight, which feels novel.</p>\n<p>Going forward I might switch to drop bars if Neil can dig up some bintage 8-speed brake lever/shifters for me. Mr Wooden has really grown on me over time as a soft, comfortable, more normal than normal, everyday bike that I’ve spent a lot of time riding because it’s so comfortably okay at everything. I fantasized about constructing a poignant commentary on the lost spirit of adventure through something equal parts 50s rough stuff bike and 80s mountain bike. In reality, I built a nice bike with a decent frame and some old rubbish and had a lot of fun doing it. I named my Mr. Wooden Mr. Real.</p>\n<p><img loading=\"lazy\" width=\"1978\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?w=1978&amp;quality=75 1978w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=1024,690&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=768,518&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=1800,1213&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=1335,900&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=700,472&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Bintage-52.jpg?resize=1536,1035&amp;quality=75 1536w\" /></p>\n<h3>Pros:</h3>\n<ul>\n<li>Politely soft, comfortable, very steel ride quality at an affordable price point</li>\n<li>Feels better with a little bag on the front</li>\n<li>A great platform to put your own weird stamp on</li>\n<li>Fun to build</li>\n<li>Versatile</li>\n<li>Green (also just a good-looking, classic bike)</li>\n<li>Rides like a relationship with a person who has no interests of their own, but will assimilate your interests to be likable.</li>\n<li>A way to reconnect with friends who own bike shops</li>\n</ul>\n<h3>Cons:</h3>\n<ul>\n<li>Not exceptional at anything</li>\n<li>Backs you into a 650b rim brake wheelset internet search corner</li>\n<li>Not a performance-orientated bike</li>\n<li>I wish they went all in with a 1” steerer and quill stem because why not? Go soft or go home!</li>\n<li>Rides like a relationship with a person who has no interests of their own, but will assimilate your interests to be likable.</li>\n</ul>\n<p> </p>\n<p><em>Check out more info on the <a href=\"https://www.brothercycles.com/shop/frames/mr-wooden/\" target=\"_blank\">Mr. Wooden at Brother Cycles</a> and if you have one of your own, post them up in the comments!</em></p>\n<p>The post <a href=\"https://theradavist.com/brother-cycles-mr-wooden-bintage-review/\">Where Bintage Hides In The Spectrum Of Fantasy And Reality: A Tael Of Two Brother Cycles Mr Wooden Builds</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"ce1987cb011102710d5b012692d190d39764a9ea56ee7d6e5a1632cd91198cee","category":"Cycling"}