{"title":"Adsorption behaviors of perfluorooctanoic acid on aged microplastics","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11080?af=R","date":1720272002000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/038dccb2-1a12-49f3-85ec-6850a65afde8/wer11080-toc-0001-m.png\" alt=\"Adsorption behaviors of perfluorooctanoic acid on aged microplastics\" />\n<p>Exploring the enrichment behaviors of PFOA on aged MPs helps to gain insight into its environmental effect and MPs as vectors for emerging contaminants.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The presence of perfluoroalkyl substances (PFAS) in the environment poses a significant threat to ecological safety and environmental health. Widespread microplastics (MPs) have been recognized as vectors for emerging contaminants due to human activities. However, the adsorption behaviors of PFAS on MPs, especially on aged MPs, have not been extensively investigated. This study aimed to investigate the adsorption behaviors of perfluorooctanoic acid (PFOA) on aged MPs (polystyrene, polyethylene, and polyethylene terephthalate) treated with UV irradiation and persulfate oxidation under salinity and dissolve organic matter (DOM) condition. Carbonyl index values of MPs increased after the aged treatment, indicating the production of oxygen-containing groups. The PFOA adsorption on aged MPs was impacted by the co-existence of Na<sup>+</sup> ions and DOM. As PFOA adsorption onto aged MPs was mainly controlled by hydrophobic interaction, the electrostatic interaction also made a contribution, but there was no significant change in PFOA adsorption behavior between the pristine and aged MPs. While these findings provide insight into PFAS adsorption on aged MPs, further research is necessary to account for the complexity of the real environment.</p>\n<h2>Practitioner Points</h2>\n<p>\nAdsorption behaviors of perfluorooctanoic acid (PFOA) on aged microplastics were investigated.\nHydrophobic interaction mainly controlled PFOA adsorption on aged microplastics (MPs).\nCo-existence dissolve organic matter and salinity influenced PFOA adsorption behaviors on aged MPs.\n</p>","author":"Zigong Ning, \nShuang Zhou, \nYing Yang, \nPengxiang Li, \nZilong Zhao, \nWei Zhang, \nLu Lu, \nNanqi Ren","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"ce1f3495996e36d46c2c2fdc38deef0737624add012b8799547e4a7b1244c23d","category":"Environment"}