{"title":"Apple Music is hosting a mystery Taylor Swift event in NYC next weekend","link":"https://www.macworld.com/article/2160329/apple-music-is-hosting-a-mystery-taylor-swift-event-in-nyc-next-weekend.html","date":1701450691000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last month, Apple Music named Taylor Swift as the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2023/11/taylor-swift-is-apple-musics-artist-of-the-year-for-2023/&amp;xcust=1-1-2160329-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Artist of the Year</a> for her “remarkable, record-breaking 2023,” but aside from a dedicated page to her music, there was very little fanfare. Now we know why: Apple Music has announced that Taylor Swift’s Eras: The Experience will take place in New York City on December 8-9.</p>\n\n\n\n<p>It’s unclear exactly what the event will be, but we do know two things: Taylor Swift will not be there, and people can register to request tickets now. Apple notes that the registration window will be open through Saturday, December 3 at 11 am ET, and “only registrations from the Greater New York City era are eligible for selection.” Apple notes that early registration won’t affect your chances to get a ticket but the site was still slammed with more than 50,000 Swifties.</p>\n\n\n\n<p>The announcement was done <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://x.com/taylornation13/status/1730624188845596690&amp;xcust=1-1-2160329-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">in collaboration with Taylor Nation</a>, Swift’s official fan club on X. An accompanying video featured celebrities such as Selena Gomez, Sabrina Carpenter, Camila Cabello, and Gracie Abrams talking about Swift over her 1989 track, “Welcome to New York.” The account says there are “limited spaces available,” but it’s unclear where the event will be held or what it will entail.</p>\n\n\n\n<p>Previous Apple Music artists of the year have conducted exclusive interviews and contributed personal playlists. In 2019, Billie Eilish performed an exclusive concert streamed on Apple Music.</p>\n\n\n\n<p>New Yorkers can request tickers at the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://ticketstoday.queue-it.net/?c=ticketstoday&amp;e=tserastheexperience&amp;xcust=1-1-2160329-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Taylor Swift’s Eras: The Experience site</a> through tomorrow.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ce22b8dfa56f6a7c1a242f34e21f0936a16c68b7a177b40b8196f18c692b3b0f","category":"Apple"}