{"title":"BikeRadar Podcast | Celebrating MBUK’s 50 ultimate mountain biking heroes","link":"https://www.bikeradar.com/news/mbuk-400-heroes/","date":1633438816000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/MBUK-400-90209ff.jpg?quality=90&amp;resize=620,413\" />                                            <p>\n</p><p>With <a href=\"https://www.mbuk.com/\">MBUK magazine</a> celebrating its 400th issue, the latest episode of the BikeRadar Podcast delves deep into the landmark edition’s headline feature – the team’s pick of the 50 heroes who’ve shaped the sport of mountain biking.</p>\n<p>We sit down with the mag’s editor, James Costley-White, staff writer Will Soffe, legendary photographer Steve Behr, freelance journalist Aoife Glass and tech editor-in-chief Rob Weaver, to discuss their ultimate MTB heroes.</p>\n<p>We talk through who made it into the top 50, why they deserve to be there and their contributions to the sport we love.</p>\n<p>MBUK’s 400th issue is on sale now and also includes a group test of the latest trail and enduro wheels, insight from the Malverns Classic, a cross-country ride in the Elan Valley, a 20-page Mint Sauce comic book and, if you buy the print edition, a classic MBUK sticker sheet.</p>\n<p><span>You can pick up a copy of MBUK issue 400 in shops now – or you can <a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription\" target=\"_blank\">subscribe to MBUK magazine here</a>.</span></p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pick up a copy of MBUK 400 now for the full feature – and our test of 2022’s hottest mountain bikes.</span></figcaption><span> <i>MBUK / Immediate Media</i></span></div>\n<hr /><h2>Subscribe to the BikeRadar Podcast</h2>\n<p>The BikeRadar Podcast takes you to the heart of the issues that matter for bike riders, whether you’re a roadie, mountain biker, gravel rider or commuter.</p>\n<p>From the latest tech news, reviews and debates, to interviews with the biggest and most interesting personalities in cycling, the podcast is your direct line into the BikeRadar team.</p>\n<p>Head to the <a href=\"https://www.bikeradar.com/bikeradar-podcast/\">BikeRadar Podcast</a> archive page to browse through the entire back catalogue.</p>\n<p>Otherwise, to make sure you don’t miss a future episode, you can subscribe via <a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\">Apple</a> or <a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\">Spotify</a> – or simply choose your preferred podcast provider below.</p>\n<p></p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ce24550239519a260aa080e636bcdbff5c024f23c9c0359cd046283e7bfb2b94","category":"Cycling"}