{"title":"Dark Forces Remastered makes a classic Star Wars shooter feel fast and fluid","link":"https://arstechnica.com/?p=2006457","date":1709125238000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/Screenshot-2024-02-26-160712-800x450.png\" alt=\"Player holding a gun inside an Alliance base in Dark Forces.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/Screenshot-2024-02-26-160712.png\">Enlarge</a> <span>/</span> Do you ever wonder why no contractor has been able to deliver to the Empire a standardized blaster rifle that shoots right where the crosshairs are aiming? Is this covered in the \"Legends\" extended universe? (credit: Nightdive Studios/LucasFilm)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I remember <em>Dark Forces</em>, or <a href=\"https://arstechnica.com/gaming/2013/04/looking-back-at-our-favorite-lucasarts-gaming-classics/\">Star Wars: <em>Doom</em></a><em>,</em> as a slog. Running a demo of the 1995 game on a Gateway system with an Intel 486DX at 33 MHz, I trudged through seemingly endless gray hallways. I shot at a steady trickle of Stormtroopers with one of their own (intentionally) semi-accurate blaster rifles. After a while, I would ask myself a pertinent, era-specific question: Why was I playing this low-energy nostalgia trip instead of actual <em>Doom</em>?</p>\n\n<p><em>Dark Forces</em> moved first-person shooters forward in a number of ways. It could lean on Star Wars for familiar sounds and enemies and tech, and a plot with a bit more complexity than \"They're demons, they gotta go.\" It let the player look up and down, jump, and crouch, which were big steps for the time. And its level design went beyond \"find the blue key for the blue door,\" with some clever environmental puzzles and challenges.</p>\n<p>Not that key cards don't show up. This game is from 1995, so there are key cards, there are hidden wall-doors, and there are auto-spawning enemies. It's not like the <em>Dark Forces </em>designers could entirely ignore <em>Doom.</em> Nobody could.</p></div><p><a href=\"https://arstechnica.com/?p=2006457#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2006457&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ce272b16b592ab7a6e52567d95ec24e96eb038dbdef85829a85b5376af5fdafe","category":"Tech"}