{"title":"Raymond Wong’s iPhone 13 Pro Review for Input","link":"https://www.inputmag.com/reviews/iphone-13-pro-max-review-a-mighty-upgrade-thats-just-shy-of-perfect","date":1632258259000,"content":"\n<p>Raymond Wong shot a bunch of great camera comparison for his Input review. He was annoyed by the same jarring automatic switch between the 1× to 0.5× lens when entering or leaving macro mode that I mentioned <a href=\"https://daringfireball.net/2021/09/the_iphones_13\">my review</a>:</p>\n\n<blockquote>\n  <p>I welcome greater detail for close-ups and it’s clever that Apple\nis using the ultra-wide to augment the 1× wide and 3× telephoto at\nshort distances, but the transitioning of cameras is disorienting.\nApple makes no mention of this camera switching/augmenting on its\niPhone 13 Pro website. I get that it’s supposed to be one of those\n“it just works” features. At least that was Apple’s intention I’m\ntold, but it just doesn’t.</p>\n\n<p>Here’s a screen recording of the automatic camera switching in\naction. In this shot, I was trying to frame these delicious soup\ndumplings using the grid. Holding the iPhone 13 Pro still, you can\nsee the 1× wide switching to another slightly different FOV that’s\nusing the ultra-wide autofocusing. The viewfinder keeps jittering\nas it tries to choose between a regular wide or wide-macro shot. A\nregular person wouldn’t look at this and think to themselves, this\nis <em>normal</em>. They’d look at the jittering and think something is\nbroken with their iPhone camera. The framing should <em>never</em> change\nfrom what you compose and never automatically.</p>\n</blockquote>\n\n<p>Wong’s screen recording illustrates the issue perfectly.</p>\n\n<blockquote>\n  <p>When I first pressed Apple and made them aware of the jarring\ncamera switching, I was told it’s how the camera system works. On\nthe eve of this review, Apple changed course and said it’s going\nto release a software update to let users disable the camera\nswitching. According to Apple:</p>\n\n<blockquote>\n  <p>A new setting will be added in a software update this fall to turn\noff automatic camera switching when shooting at close distances\nfor macro photography and video.</p>\n</blockquote>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/09/21/wong-iphone-13-pro\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ce38c53f4a28df45450f653df7d8811e65b81f6909e2e62b7a44b28d87ac57f0","category":"Tech"}