{"title":"New Beats Studio Pro headphones found in latest iOS and macOS betas","link":"https://www.macworld.com/article/1814975/new-beats-studio-pro-headphones-found-in-latest-ios-and-macos-betas.html","date":1683670817000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It has been more than five years since Apple’s Beats brand released a new pair of over-the-ear headphones. While various earbuds models get regular releases, the Beats Studio3, released in 2017, are still the company’s most current full-size headphones.</p>\n\n\n\n<p>Images and references to the new Beats headphones have been found in the release candidates of <a href=\"https://www.macworld.com/article/1674501/ios-16-5-beta-features-release-install.html\">iOS 16.5</a> and macOS 13.4, along with the branding Beats Studio Pro. They seem very similar in design to the Beats Studio3, only without the “Studio” branding along the side of the band. The images include black, white, blue, and brown colors. The alleged codenames suggest a partnership with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://samuel-ross.com/&amp;xcust=1-1-1814975-1-0-0&amp;sref=https://www.macworld.com/feed\">Samuel Ross</a>. </p>\n\n\n\n<p>It is unclear what features we can expect, but an H1 or H2 chip seems likely–the Studio3 uses Apple’s old W1 chip. That upgrade, along with other improvements, should give the headphones high-quality noise reduction, active transparency, and likely even <a href=\"https://www.macworld.com/article/1064563/how-set-up-personalized-spatial-audio-airpods.html\">Personalized Spatial Audio</a>. Most Beats products use USB-C to charge, and Apple’s need to comply with European regulations means we’re likely to see it here as well.</p>\n\n\n\n<p>We have no idea when to expect an announcement. Both iOS 16.5 and macOS 13.4 should release during the week of May 15, and new headphone products are usually not far behind once references are found in shipping iOS code. A release before WWDC in June seems likely.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ce3a2aad8689a33e2a3014091a45bcaff7d47766301b03afee925d8b2981b576","category":"Apple"}