{"title":"How to try the new Safari tab bar and Live Text in macOS Big Sur","link":"https://www.macworld.com/article/349408/macos-monterey-safari-big-bur-tab-bar-groups-live-text-quick-notes-extensions.html","date":1624475703000,"content":"\n<div>\n<section><div></div></section><p>Safari is going through some big changes when <a href=\"https://www.macworld.com/article/348192/macos-12-monterey-features-universal-control-shortcuts-safari-airplay-focus-compatibility-release-beta-how-to-install.html\">macOS 12 Monterey launches this fall</a>. Apple has refreshed its browser across all of its devices, but some of the biggest changes are coming to the Mac, with a new look, new functionality, and stronger privacy and security.</p>\n\n\n\n<p>To get an early look at most of the macOS Monterey features you need to download and install a developer’s or public beta, but Safari is different. Apple provides a Safari Technology Preview that offers “a sneak peek at upcoming web technologies in macOS,” and it has now posted <strong><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/safari/technology-preview/release-notes/&amp;xcust=1-1-349408-0-0-0&amp;sref=https://www.macworld.com/feed\">Release 126 for Safari 14.2</a></strong>. For those who don’t know, that’s the version that will ship with macOS Monterey and includes some of the new features arriving in the fall.</p>\n\n\n\n<p>You can download it for either macOS 12 Monterey (<a href=\"https://www.macworld.co.uk/how-to/get-macos-beta-3513166/\">if you have the beta</a>) or macOS 11 Big Sur, so you don’t need to gamble testing an unfinished operating system on your Mac. You won’t even replace the current version of Safari. Download the Safari Technology Preview and you’ll create a separate version of Safari with a purple icon that includes the streamlined tab bar, Live Text, improved web extensions, and quick notes, along with several backend changes. Apple will push out updates to the Safari Technology Preview as they are available.</p>\n\n\n\n<p>So if you want a taste of Monterey without risking your Mac’s health, you can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/safari/download/&amp;xcust=1-1-349408-0-0-0&amp;sref=https://www.macworld.com/feed\">download the preview here</a>. Just select Safari Technology Preview for macOS Big Sur, open the DMG, and run the installer.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ce3b2b1a7ed710aee134006c8be17bf0991631e243d11807a5afd30da747d0ca","category":"Apple"}