{"title":"Identification of breast cancer-associated PIK3CA H1047R mutation in blood circulation using an asymmetric PCR assay","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309209","date":1724853600000,"content":"<p>by Dinh Thi Thao, Nguyen Phu Thanh, Dong Van Quyen, Ly Tuan Khai, Le Huu Song, Ngo Tat Trung</p>\r\nPurpose <p>To establish a highly sensitive and specific approach for the detection of circulating <i>PIK3CA</i> H1047R mutation in breast cancer (BC) patients and to investigate the association between the prevalence of <i>PIK3CA</i> H1047R mutation and clinical presentations.</p> Methods <p>A proper blocker was designed in an allele-specific manner and optimized for PCR<i>-</i>based identification of the <i>PIK3CA</i> H1047R mutation. The established technique was validated in cell-free DNA samples from 196 recruited BC patients.</p> Results <p>The allele-specific PCR assay with a properly designed blocker was able to detect the H1047R mutant variant with 0.01%. By applying the newly established assay, 62 cases (31.6% of the total recruited cases) were found to carry a blood-circulating H1047R mutant. Wherein, the detected mutant rates increased with disease stages from 2/18 (11.1%) of stage I to 17/71 (23.9%) of stage II, 20/53 (37.7%) of stage III, and 23/31 (42.6%) of stage IV (p = 0.025), respectively. Higher frequencies of H1047R mutation were associated with late-stage (p = 0.033) or recurrence (p = 0.045) or metastatic patients (p = 0.049) as well as radiation-treated human epidermal growth factor receptor 2 (HER2) positive BC (p = 0.004). <i>PIK3CA</i> mutant carriers were frequently observed in patients under the age of 50 who had liver-metastasized or brain metastases or lymph node-invaded (p &lt; 0.05).</p> Conclusion <p>A novel allele-specific PCR assay with high sensitivity was established successfully for the detection of the <i>PIK3CA</i> H1047R mutation in clinical practice.</p>","author":"Dinh Thi Thao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ce432a91900ef8990fe59c4936e630c7c4e29c9da72b43ef7e8daa6908fdd4e8","category":"Interdisciplinary"}