{"title":"Pollination‐related plant traits under environmental changes: Seasonal and daily mismatches produce temporal constraints","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14674?af=R","date":1728719049000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/af1e9e34-a12a-424d-b494-39c4443c9bcc/fec14674-toc-0001-m.png\" alt=\"Pollination-related plant traits under environmental changes: Seasonal and daily mismatches produce temporal constraints\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/02/the-floral-traits-and-phenology-of-arums-are-modified-by-climate-change/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPollination is a key tenet of ecosystem sustainability and food security, but it is threatened by climate change. While many studies investigated the response of plant-pollination traits to temperature, few attempted multifactorial and integrative approaches with multiple floral traits.\n\nWe determined which plant-pollination traits were disrupted by environmental changes and the consequence for plant fitness. We focused on the thermogenic plant, <i>Arum italicum</i>, which relies on floral scent and heat production to attract its pollinators with a deceptive strategy. In a field mesocosm, we measured the response of floral phenology, thermogenesis traits, scent and plant fitness to experimental changes in shade level, water supply and soil temperature. In the laboratory, we exposed plants to extreme heat to determine the thermoregulation ability at high temperatures.\n\nPlant fitness decreased dramatically in response to soil warming and the level of shade. While both factors caused a lower number of inflorescences, soil warming was mostly responsible for the crash in number of fruits.\n\nThe plant traits related to thermogenesis and scent were relatively resilient to the environmental changes in the mesocosm and were unlikely to produce the observed decrease in plant fitness. First, environmental changes only weakly modified the scent composition. Second, the appendix regulated its maximal temperature almost perfectly, while stamen regulated imperfectly. In the laboratory experiment, the appendix maintained a thermal gradient supposedly to improve scent emission while stamen became cooler than ambient air, possibly preventing the pollinators from overheating within the floral chamber.\n\nBy contrast, the phenology of flowering was drastically modified. Flowers appeared earlier in the season in response to soil warming (by 39 days) or absence of shade (by 19 days). At the daily scale, flowering hour did not change across the season resulting in plants flowering before sunset late in the season and before the pollinator activity window (mostly nocturnal). The strong shift observed in the flowering period may induce a temporal mismatch with this pollinator both early and late in the season when the insects may not be active so early in the spring and during daytime, respectively, thereby altering plant fitness.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/02/the-floral-traits-and-phenology-of-arums-are-modified-by-climate-change/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Mathieu A. J. Leclerc, \nMarc Gibernau, \nSylvain Pincebourde","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"ce4ec3b61225c883f0bbc073ef2cd06130c534958236483c51eee8df0caa387f","category":"Environment"}