{"title":"Deciphering the variability in air-sea gas transfer due to sea state and wind history","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae389/7749356?rss=1","date":1725408000000,"content":"<span><div>Abstract</div>Understanding processes driving air-sea gas transfer and being able to model both its mean and variability are critical for studies of climate and carbon cycle. The air-sea gas transfer velocity (<span>K</span><sub>660</sub>) is almost universally parameterized as a function of wind speed in large scale models—an oversimplification that buries the mechanisms controlling <span>K</span><sub>660</sub> and neglects much natural variability. Sea state has long been speculated to affect gas transfer, but consistent relationships from in situ observations have been elusive. Here, applying a machine learning technique to an updated compilation of shipboard direct observations of the CO<sub>2</sub> transfer velocity (<span>K</span><sub>CO2,660</sub>), we show that the inclusion of significant wave height improves the model simulation of <span>K</span><sub>CO2,660</sub>, while parameters such as wave age, wave steepness, and swell-wind directional difference have little influence on <span>K</span><sub>CO2,660</sub>. Wind history is found to be important, as in high seas <span>K</span><sub>CO2,660</sub> during periods of falling winds exceed periods of rising winds by ∼20% in the mean. This hysteresis in <span>K</span><sub>CO2,660</sub> is consistent with the development of waves and increase in whitecap coverage as the seas mature. A similar hysteresis is absent from the transfer of a more soluble gas, confirming that the sea state dependence in <span>K</span><sub>CO2,660</sub> is primarily due to bubble-mediated gas transfer upon wave breaking. We propose a new parameterization of <span>K</span><sub>CO2,660</sub> as a function of wind stress and significant wave height, which resemble observed <span>K</span><sub>CO2,660</sub> both in the mean and on short timescales.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"ce4ec1df8885ca2bd3f6f3215f0654b569bbe46977e34cd6f4cfa1370d03685f","category":"Interdisciplinary"}