{"title":"Girona and pro cycling: what’s all the fuss about?","link":"https://cyclingtips.com/2021/02/girona-and-pro-cycling-whats-all-the-fuss-about/","date":1614465590000,"content":"<p><em>Aspiring pro Joe Laverick is fighting his way toward a big-time contract and will be sending over columns throughout the season. Riding for Axeon-Hagens Berman this year, Joe has a unique viewpoint on the pathways and roadblocks into the pro ranks. In this installment, he considers why the Spanish town of Girona has become such a hub for pro cyclis</em>ts.</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>After months of planning, a bucket load of stress, and an 18-hour travel day, I’m finally in Girona. As I write this, I’ve been here for around three weeks. I’d never been here before I moved, and I often found myself asking the question: Why is so much of the pro peloton in Girona? In this piece, I’m going to try and give that insight.</p>\n\n\n\n<p>My travel day was a mess. While I had all of the documents to allow me to go from the UK to Spain, it was just a bugger. To sum it up quickly: car, train, three-hour wait, train, train, four-hour wait, plane, car. Yeah, it was long. And it was bloody expensive. But I’m here now, so I’ll stop moaning.&nbsp;</p>\n\n\n\n<p>Girona, or &#8216;G-town&#8217; if you want to be a bit edgy or take the mick, is a mecca for pros. When Lance Armstrong and George Hincapie moved here from Nice back in 2000, this Spanish city couldn’t have predicted the tidal wave of cyclists that would arrive in the following decades. While many in the sport may not forgive these guys, it’s fair to say Girona’s economy owes them a lot.&nbsp;</p>\n\n\n\n<p>Most teams require you to have a base in mainland Europe, and the popular options are Girona or the south of France. While the Cote d’Azur may have nicer weather than this northern-Spanish city, it’s not as popular. The roads are much busier, and it’s more spread out than Girona. It does, however, offer Monaco and the 0% tax that comes with it. A Girona base can offer <a href=\"https://cyclingtips.com/2016/07/why-andorra-is-becoming-one-of-europes-most-popular-pro-cycling-bases/\" target=\"_blank\" rel=\"noreferrer noopener\">Andorra’s low tax-rates (and altitude)</a> just up the road, but that’s a piece for another day.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cyclingtips-staging.net/wp-content/uploads/2018/09/Roadtripping-Costa-Brava-Oix-Beget-12.jpg\" alt=\"\"/></figure>\n\n\n\n<p>There’s a myriad of reasons behind Girona’s popularity. I’m going to reel them off and then go into some more detail after. The roads are quiet and varied, weather is (usually) good, there’s already a large English-speaking community, the city is small, you don’t need a car, there’s a major airport close by, and the town is set up for cycling. If you need something done, from a bike fit to a medical, you can guarantee it’s less than a 15-minute walk away.&nbsp;</p>\n\n\n\n<p>It’s a beautiful city to live in, the old-town dates back to 79 BCE and it’s not difficult to get lost in the maze of cobbled streets. Fun fact: Girona was used to film Game of Thrones. The coffee culture is incredible too, which is obviously of vital importance to cyclists. Whether it’s at ex-pro Christian Meier’s Espresso Mafia, Rory Sutherland’s Federal, Robert Gesink’s Hors Catégorie or Jan Frodeno’s La Comuna.</p>\n\n\n\n<p>The number of world-class cyclists you see here is frankly ridiculous. If you go for a stroll around old town at 10am, and you <em>don’t</em><strong> </strong>see at least five WorldTour riders, then there must have been some sort of mass pro-cyclist apocalypse in the night. You can often be grabbing a coffee in town and have a Grand Tour stage-winner sitting on the next table – or bump into CyclingTips’ Abby Mickey!</p>\n\n\n\n<p>Strava makes for some interesting viewing around here too. There is <a href=\"https://www.strava.com/segments/1318058?filter=overall\" target=\"_blank\" rel=\"noreferrer noopener\">a climb to nowhere</a> out of a small nearby village called Amer. Its gradient makes it perfect for doing efforts. Just take a look at the names and power numbers in the top 10.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1277\" height=\"717\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am.png\" alt=\"\" class=\"wp-image-484737\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am.png 1277w, https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am-650x365.png 650w, https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am-190x107.png 190w, https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am-1080x606.png 1080w, https://cyclingtips.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-25-at-11.51.24-am-16x9.png 16w\" sizes=\"(max-width: 1277px) 100vw, 1277px\" /></figure>\n\n\n\n<p>Pro cyclists are sheep. As previously mentioned, if you need something done, there’s always someone in town. Word of mouth and recommendation are strong in these parts. Need an apartment? There’s usually someone with a spare room. Need help navigating Spanish administration? Everyone I’ve spoken to uses the same lawyer. Even if you need a haircut, there’s a guy everyone uses; he’s called Carlos.</p>\n\n\n\n<p>Cyclists are a loyal bunch – earn the trust of a couple, and you’ll have business for years to come.</p>\n\n\n\n<p>In my short amount of time here, I’ve already met Kiwis, Aussies, English, Scottish, Irish, French, Canadians, Dutch, Spanish, Germans, Americans and a Latvian (shout-out to Toms) to name but a few, and I guess I’ve missed some off. I love the fact that it’s such a diverse place and that there can be a small group of you grabbing a coffee, with each one born and raised on a different continent.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cyclingtips-staging.net/wp-content/uploads/2018/09/Roadtripping-Costa-Brava-Costa-Brava-11.jpg\" alt=\"\"/><figcaption>The roads around Girona are a cyclist&#8217;s paradise.</figcaption></figure>\n\n\n\n<p>Living in Spain, or Catalonia as many locals would prefer me to say, goes both ways. There’s a phrase within the local community, ‘getting Spained’ – when the local quirks or idiosyncrasies get in the way of doing things that you&#8217;d expect to be easy.</p>\n\n\n\n<p>In my short time here, I’ve already been ‘Spained’ a fair few times. Examples include, but definitely aren’t limited to: getting <em>any</em> administration done, trying to nip to the shop on a Sunday, or trying to get anything done between 2pm and 5pm. The beauty of it is that just as you learn to navigate one thing, a whole other problem will pop up.&nbsp;</p>\n\n\n\n\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/girona-and-pro-cycling-whats-all-the-fuss-about/\">Girona and pro cycling: what&#8217;s all the fuss about?</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Joe Laverick","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ce519f588f23faf6dd6f080aed119fa4c1361d3b5ed22f942f73c6a4dfbf0ae0","category":"Cycling"}