{"title":"Micromorphological and Chemical Characterization of Drimys winteri Leaf Surfaces: The Secondary Alcohols Forming Epicuticular Wax Crystals Are Accompanied by Alkanediol, Alkanetriol and Ketol Derivatives","link":"https://academic.oup.com/pcp/article/65/8/1245/7675869?rss=1","date":1715904000000,"content":"<span><div>Abstract</div>The cuticle is a hydrophobic coating of most aerial plant surfaces crucial for limiting non-stomatal water loss. Plant cuticles consist of the lipid polyester cutin and associated waxes with compositions varying widely between plant species and organs. Here, we aimed to provide a comparative analysis of the dark-glossy adaxial and pale-glaucous abaxial sides of <span>Drimys winteri</span> (Winteraceae) leaves. Scanning electron microscopy showed nanotubular wax crystals lining the entire abaxial side of the leaf (including stomatal pores), while the adaxial side had patches of mixed platelet/tubule crystals and smooth areas between them. Consecutive treatments for wax removal and cutin depolymerization revealed that the waxes were deposited on a cutin network with micron-scale cavities across the entire abaxial surface including the stomata pores, and on a microscopically smooth cutin surface on the adaxial side of the leaf. Gas chromatography coupled to mass spectrometry and flame ionization detection showed that the wax mixtures on both sides of the leaf were complex mixtures of very-long-chain compounds dominated by the secondary alcohol nonacosan-10-ol and alkanediols with one hydroxyl on C-10. It is therefore very likely that the characteristic tubular wax crystals of both leaf sides are formed by these alcohols and diols. Further secondary alcohols and alkanediols, as well as ketols and alkanetriols with one functional group on C-10, were identified based on mass spectral fragmentation patterns. The similarities between all these mid-chain-functionalized compounds suggest that they are derived from nonacosan-10-ol via regio-specific hydroxylation reactions, likely catalyzed by three P450-dependent monooxygenases with different regio-specificities.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"ce52c5a06e5a2217f005efd87e500552928af1665559db1f055e5b5452c1b1e1","category":"Environment"}