{"title":"Soul","link":"https://markpeak.net/soul/","date":1619360155000,"content":"<p>บล็อกนี้สปอยล์เนื้อหาของเรื่อง</p>\n<p>ไม่ได้ดูหนังของ Pixar มากนักในช่วงหลัง (เรื่องสุดท้ายที่ดูคือ The Incredibles 2 แต่ไม่ได้ดู Coco และ Toy Story 4)</p>\n<p>สัปดาห์ที่ผ่านมา เผอิญมีช่วงว่าง และเห็นว่าใน Google Play เอาเรื่อง Soul มาให้เช่าดูในราคาถูกเพียง 130 บาท (ไม่เข้าใจเหมือนกันว่ามาตรฐานการตั้งราคาอยู่ตรงไหนเหมือนกัน หนังใหม่ถูก หนังเก่าแพง) เลยจัดมาดูสักหน่อย</p>\n<p>พล็อตหลักของ Soul คือครูสอนดนตรี Joe Gardner ที่มีความฝันว่าจะเป็นนักดนตรีอาชีพ บังเอิญโชคดีได้งานตามที่ฝันไว้เพราะคนขาด แต่กลับมา “ตกท่อตาย” กลางถนนในนิวยอร์ก และเข้าไปสู่โลกวิญญาณหลังความตายโดยที่ความฝันยังไม่บรรลุ เขาจึงพยายามดิ้นรนกลับมาสู่โลกมนุษย์อีกครั้ง</p>\n<p>ที่โลกวิญญาณ Joe ได้พบกับวิญญาณที่ยังไม่ยอมไปเกิดสักทีชื่อ 22 (เรียกตามลำดับวิญญาณเพราะยังไม่มีชื่อ) และก็บังเอิญได้กลับมายังโลกพร้อมกัน แต่เกิดการสลับร่าง โดย 22 เข้ามาอยู่ในร่างของ Joe ในขณะที่วิญญาณของ Joe ไปอยู่ในร่างแมว</p>\n<p>ตรงนี้หนังเริ่มเข้ากระบวน trope หนังสลับร่างตามมาตรฐานทั่วไป (ตอนนั้นอารมณ์ว่า Pixar จะเอาอย่างนี้จริงๆ เหรอ) แต่พอเป็นระดับ Pixar มันเลยไม่ออกทะเลมากนัก บทที่เหลือก็ตามคาดคือ Joe ได้เห็นมุมมองที่คนอื่นๆ มีต่อตัวเอง ในสายตาที่ต่างออกไป (สายตาแมว) ส่วน 22 ก็มีโอกาสได้ลองใช้ชีวิตจริงๆ ดูสักที ตอนท้ายมีปมให้ทุกอย่างเคลียร์ประเด็นได้สวยงาม</p>\n<p>ภาพรวมคิดว่า Soul เป็นหนังที่สเกลเรื่องค่อนข้างเล็ก มีตัวละครหลักเพียงไม่กี่ตัว และมีฉากหลักๆ อยู่เพียง 2 ฉากคือ ถิ่นของ Joe ในนิวยอร์ก และโลกวิญญาณเท่านั้น ซึ่งต้องชม Pixar ว่าเก็บรายละเอียดของนิวยอร์กได้ดี และออกแบบโลกวิญญาณมาได้น่าสนใจดี</p>\n<p>การเลือกคนดำมาเป็นตัวเอกก็ถือว่าน่าสนใจและกล้าหาญเมื่อพิจารณาจากบริบทของยุคสมัย และยิ่งน่าสนใจเมื่อ Pixar เลือกคนดำมาเป็นผู้กำกับร่วม และมาเป็นที่ปรึกษาในโครงการอีกมาก อ่านได้จาก<a href=\"https://slate.com/culture/2020/12/pixar-soul-kemp-powers-interview-black-lead-barber-shop.html\">บทสัมภาษณ์ของ Kemp Powers</a> ผู้กำกับร่วม ที่เล่าถึงการออกแบบซีนร้านตัดผม ที่ถือเป็นหนึ่งในซีนสำคัญของเรื่อง</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://slate.com/culture/2020/12/pixar-soul-kemp-powers-interview-black-lead-barber-shop.html\">\n\t\t\t\t\t<img src=\"https://compote.slate.com/images/e71991d9-d77f-4e81-8940-8fb40b34b494.jpeg?width=780&amp;height=520&amp;rect=1560x1040&amp;offset=0x0\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://slate.com/culture/2020/12/pixar-soul-kemp-powers-interview-black-lead-barber-shop.html\">\n\t\t\tSoul Co-Director Kemp Powers on the Pressures of Creating Pixar’s First Black Lead\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://slate.com/culture/2020/12/pixar-soul-kemp-powers-interview-black-lead-barber-shop.html\">\n\t\t\t<p>“It kept me up nights.”</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://slate.com/favicon.svg\" />\t\tSlate Magazine\t</div>\n</div>\n<p>อย่างไรก็ตาม ปัญหาของ Soul ในฐานะหนังการ์ตูนของ Pixar คือ เรื่องมันค่อนข้างซับซ้อนเกินความเป็นการ์ตูนเด็กไปมาก เพราะพูดเรื่อง the purpose of life ที่มีความเป็นนามธรรมสูง และบทสนทนาก็มีการอ้างอิงความรู้ขั้นสูง (เช่น นักปราชญ์ในอดีต หรือ แซะประเด็นสังคมบางอย่าง) ทำให้การทำความเข้าใจเรื่องอย่างถ่องแท้มันยากเกินไปหน่อย เมื่อเทียบกับหนัง Pixar เรื่องอื่นๆ</p>\n<p>ตอนดูจบรู้สึกว่าคำนิยามของ Soul คือ Inside Out เวอร์ชันผู้ใหญ่ พอไปเช็คดูแล้วก็พบว่าเป็นผู้กำกับคนเดียวกันจริงๆ คือ Pete Docter ซึ่งกำกับเรื่อง Up ด้วย</p>\n<p>ในฐานะที่เส้นเรื่องหลักเป็นการเดินทางร่วมกันของสองตัวเอกคือ Joe และ 22 เพื่อคลายปมในใจของกันและกัน แต่ Soul กลับเล่าปูมหลังของตัวละครทั้งสองน้อยไปสักนิด เราไม่ค่อยเข้าใจนักว่าทำไม Joe ถึงไม่ประสบความสำเร็จในชีวิต และไม่เข้าใจนักว่าทำไม 22 ถึงไม่อยากมาเกิด ทำให้ไม่ค่อยอินกับปมของตัวละครหลัก (และการเดินทางตามเส้นเรื่อง) เท่าที่ควร เหมือนเราเป็นผู้สังเกตชีวิตของ Joe ไปเรื่อยๆ มากกว่าเอาใจช่วย Joe ซึ่งจริงๆ ถ้าเพิ่มความยาวอีกสัก 5-10 นาทีมาปูเรื่องตรงนี้เพิ่ม หนังน่าจะกลมกล่อมกว่านี้</p>\n<p>อีกประเด็นที่น่าเสียดายคือ Soul วางตัวไว้เป็นหนังเพลง ตัวเอกเป็นนักดนตรีแจ๊ส ในเรื่องมีฉากเล่นดนตรีหลายฉาก แต่เหมือนเรื่องไม่ค่อยเน้นเพลงสักเท่าไรนัก ดูจนจบแล้วก็จดจำเพลงในเรื่องไม่ได้เลย ซึ่งน่าเสียดายเมื่อมองว่าเป็นหนังของ Disney เจ้าพ่อหนังเพลงที่มีประสบการณ์อย่างโชกโชน</p>\n<p>ภาพรวมของ Soul คือดีในคุณภาพระดับ Pixar (แม้ว่ามีความเป็นผู้ใหญ่สูง) แต่น่าเสียดายว่าถ้าปรับปรุงเพิ่มอีกสักหน่อย หนังจะดีกว่านี้อีกมาก</p>\n<p></p>The post <a href=\"https://markpeak.net/soul/\">Soul</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ce539e55897a6537aa65093529d730ccf76e79214f5fcee2a3d2f4a00e6eff5a","category":"Thai"}