{"title":"Road World Championships 2023: Elite men's road race contenders and predictions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/road-world-championships-2023-elite-mens-road-race-contenders-and-predictions","date":1690813715000,"content":"\n      <p><span>Formally the concluding event of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">Road World Championships</a>, the elite men’s road race will for this year move to the first Sunday (August 6) of the UCI World Championships. This year the Worlds will take place in Glasgow, which hosts the first multi-discipline World Championships where track racing, mountain biking, BMX, road, and many more will all take place.</span></p>\n<div></div>\n<p><span>Still, the elite men’s and women’s road races remain flagship events of the Worlds, where many of road cycling’s biggest stars will switch to their national team kits to compete for the prestigious rainbow jersey.</span></p>\n<p><span>The 2023 elite men’s race, which takes place over a 271.1km course defined by a technical and hilly circuit, should be a closely fought affair. The course suits a wide range of rider types and the earlier placing of the race in the calendar will see many of the favourites carrying their form from the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>.</span></p>\n<p><span>As is regularly the case, Belgium boasts the strongest line-up of any competing nation. Their biggest problem is perhaps a team of too many potential winners, though last year Remco Evenepoel’s solo heroics were enough to overcome any doubt about who should be leading the team. Evenepoel returns this year to try and win a second world title, but there's a host of potential winners who won’t make it easy for him.</span></p>\n<p><span>Here’s the leading contenders for this year’s UCI World Championships elite men’s road race.</span></p>\n<h3><span>Remco Evenepoel (Belgium)</span></h3>\n<p><span>Aside from a <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> campaign (in which he still won two stages) curtailed by illness, Remco Evenepoel has been in almost unbeatable form this year. That’s particularly true in one-day races, winning each one he has entered, including Liège-Bastogne-Liège, the Belgian National Championships road race, and most recently the Clásica de San Sebastián.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_8532.jpg?v=1690461258\" alt=\"Remco Evenepoel\" /></span></p>\n<p><span>The 23-year-old won last year’s road race in Australia with a blistering solo attack from over 25km out, and there’s little to suggest he couldn’t do the same thing in Glasgow. The twisting and turning nature of the city circuit laps will perhaps favour a strong solo breaker over a chasing group, and the steep Montrose Street climb is the kind of launchpad Evenepoel could thrive on.</span></p>\n<h3><span>Tadej Pogačar (Slovenia)</span></h3>\n<p><span>After a gutsy and exhausting Tour de France effort, where he won two stages and finished second overall, Tadej Pogačar will return to racing at the Worlds this week.</span></p>\n<p><span>Despite his already glittering palmarès, Pogačar has yet to come close to winning the World Championships, his best result an 18th place in 2019, perhaps adding an extra incentive to turn up on Sunday and capitalise on any lingering form from the Tour.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01370.jpg?v=1690811811\" alt=\"Tadej Pogacar\" /></span></p>\n<p><span>While the 24-year-old would perhaps prefer a course with some harder climbs, he still has the devastating attacking punch and finishing sprint to win in Glasgow from any number of scenarios, as witnessed in his triumphs in recent years across the cobbled, Ardennes, and Italian Classics.</span></p>\n<p><span>Where his form currently is post-Tour remains to be seen, but a Pogačar at the top of his game is undoubtedly one of the favourites to claim victory here.</span></p>\n<h3><span>Mathieu van der Poel (Netherlands)</span></h3>\n<p>The Glasgow course seems tailor-made for an in-form Mathieu van der Poel. Its short but attritional climbs should play to the strengths of a man who’s won the Tour of Flanders (twice), Strade Bianche, and the Amstel Gold Race, and there are very few who can follow one of his trademark attacks that come late into a race of this distance.</p>\n<p>The Dutchman hasn’t quite looked in the same sort of shape as he was during the Classics earlier this year, making his mark at the Tour de France as lead-out man rather than through his own success.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-08465.jpg?v=1690811920\" alt=\"Mathieu van der Poel\" /></span></p>\n<p><span>Given the controversial events that took place before the Worlds race last year that ultimately prevented him from getting properly involved, Van der Poel will no doubt be driven to capitalise on another road race course that suits him. Whether he’ll have the strength to follow a Pogačar or an Evenepoel attack is unclear, but a reduced bunch or breakaway sprint will be a favourable scenario for a Van der Poel victory.</span></p>\n<h3><span>Wout van Aert (Belgium)</span></h3>\n<p><span>When Wout van Aert won Milan-Sanremo in 2020 it seemed unfathomable that he would not go on to win more Monuments in the next three seasons. The Belgian's relationship with cycling’s historic Classics has been one of close but no cigar, having recorded six podium finishes since his Sanremo win. The feeling has perhaps translated to the World Championships too, where a second, 11th, and fourth place have all represented missed opportunities. The 11th place in 2021 particularly stung given it took place in his native Flanders, and he failed to capitalise on the full support of the Belgian squad, subsequently having a public spat with teammate Evenepoel. The pair returned as co-leaders in Wollongong last year when Evenepoel won, and they will again both race with joint support in Glasgow.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-01034.jpg?v=1690812042\" alt=\"Wout van Aert\" /></span></p>\n<p><span>The course, as it does for Van der Poel, suits a Classics rider of Van Aert’s ilk. As one of the rare, supremely blessed riders who can do almost anything exceptionally, there’s no reason Van Aert can’t beat everyone on this list to victory. If he has the legs, whether he can pull it all together to avoid any tactical mishaps and misfortune will be the crucial deciding factor in his chances of moving from the podium spots and into the rainbow jersey.</span></p>\n<h3><span>Christophe Laporte (France)</span></h3>\n<p><span>A French team at the World Championships containing Julian Alaphilippe would normally see him a dead cert to feature in a contenders list such as this. Given he’s a two-time world champion, Alaphilippe knows exactly what it takes to win these types of races, and deservedly still headlines France’s line-up. But it’s Christophe Laporte who looks like the stronger contender for victory this year.</span></p>\n<p><span>That is firstly in terms of form. Alaphilippe has not looked close to his best this year, particularly in the Classics. Meanwhile Laporte was one of Jumbo-Visma’s shining stars during the cobbled Classics, and later played an integral part in Jonas Vingegaard’s overall victory at the Tour de France.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-02831.jpg?v=1690812114\" alt=\"Christophe Laporte\" /></span></p>\n<p><span>Secondly, the course looks better suited to Laporte, more similar in shape to last year in Wollongong than the Flanders or Imola courses where Alaphilippe triumphed. Given that a reduced bunch sprint is a real possibility, Laporte looks like the better prospect right now in that instance.</span></p>\n<p><span>Although Laporte did finish second place in Australia last year, it was actually his first finish in four attempts at the Worlds. His rise in form should see him among the main contenders if he’s at his best, but having Alaphilippe in the team gives France different cards to play in one of the season’s most unpredictable races.</span></p>\n<h3><span>Mads Pedersen (Denmark)</span></h3>\n<p><span>When Mads Pedersen won the World Championships in Yorkshire in 2019 it came largely unexpectedly. Though he’d finished second in the Tour of Flanders the year before, the Dane had not recorded a win at WorldTour level before his Worlds triumph. Even as he arrived alongside the much more experienced Matteo Trentin to the final sprint of that rain-soaked race, he remained an outsider for victory. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00197.jpg?v=1690812224\" alt=\"Mads Pedersen\" /></span></p>\n<p><span>Since then, Pedersen has grown into one of the peloton’s most formidable and successful puncheurs/sprinters, winning stages in each of the Grand Tours. Though a winner of Gent-Wevelgem in 2020, the 27-year-old does remain without another major Classics win. He rallied this year to secure a third place in Flanders and fourth in Paris-Roubaix, but has not been able to regularly overcome the likes of Van der Poel and Van Aert in these types of races.</span></p>\n<p><span>Pedersen still remains a strong contender for the Worlds given the strength he showed during the Tour de France, plus his versatility means he should be able to stay in touch with a reduced group. A sprint finish would likely be the most favourable outcome for him, but a podium place seems like a more likely final result given the calibre of field assembled here.</span></p>\n<h3><span>Michael Matthews (Australia)</span></h3>\n<p><span>Three podium finishes and two further top-10s demonstrate the World Championships is a race Michael Matthews loves. Though he’s never won, Matthews has a remarkable consistency very few riders can beat when it comes to the attritional nature of Worlds road races.</span></p>\n<p><span>His biggest opportunity was perhaps in 2015 when Peter Sagan escaped the peloton and narrowly held them off to win his first of three consecutive rainbow jerseys in Richmond, USA. It was Matthew’s ability to maintain his sprint after such a long day of hard racing that claimed him second that day, and that has been an invaluable tool in his Worlds success ever since.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-07329.jpg?v=1690812330\" alt=\"Michael Matthews\" /></span></p>\n<p><span>The Australian will need to hope the remaining riders are all kept together if he has a chance at winning and utilising his sprint, but that is something notoriously difficult to accomplish in Worlds road races. He shouldn’t have any trouble getting over the climbs, but another podium finish feels like a more realistic prospect than a victory for Matthews.</span></p>\n<h3><span>Other contenders</span></h3>\n<p><span><strong>Jasper Philipsen</strong> is a valuable option for Belgium should the race somehow remain all together, and he certainly seems like the only pure sprinter here capable of remaining in the mix.</span></p>\n<p><span><strong>Fred Wright</strong> looks like Great Britain’s best bet at a result, and a podium finish would be a remarkable achievement for the 24-year-old who continues to look stronger each year.</span></p>\n<p><span>While Van der Poel will no doubt lead the team, <strong>Dylan van Baarle</strong> is a possible winner for the Netherlands if he can get a gap.</span></p>\n<p><span><strong>Ben Healy</strong> is Ireland’s leading option, but the climbing on this course doesn’t look difficult enough for him to escape solo.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_-Giro_d_Italia_2023_-_Stage_15-07891.jpg?v=1690812421\" alt=\"Ben Healy\" /></span></p>\n<p><span><strong>Stefan Küng</strong> and <strong>Marc Hirschi</strong> (Switzerland), <strong>Neilson Powless</strong> (USA),<strong> Iván García Cortina</strong> (Spain), and <strong>Alexander Kristoff</strong> (Norway) are all other possibilities.</span></p>\n<h3><span>Prediction</span></h3>\n<p><span>We can’t look past Remco Evenepoel riding away to win a second consecutive rainbow jersey.</span></p>\n<p><em><span>Cover photo by Alex Broadway/SWPix</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ce54438faf0d68e208c9597496e27d2c5a32b091f7ad3a30ab5fe4d25ff11929","category":"Cycling"}