{"title":"Introducing Amazon Redshift Serverless – Run Analytics At Any Scale Without Having to Manage Data Warehouse Infrastructure","link":"https://aws.amazon.com/blogs/aws/introducing-amazon-redshift-serverless-run-analytics-at-any-scale-without-having-to-manage-infrastructure/","date":1638294286000,"content":"<p>We’re seeing the use of data analytics expanding among new audiences within organizations, for example with users like developers and line of business analysts who don’t have the expertise or the time to manage a traditional data warehouse. Also, some customers have variable workloads with unpredictable spikes, and it can be very difficult for them to constantly manage capacity.</p> \n<p>With <a href=\"https://aws.amazon.com/redshift/\">Amazon Redshift</a>, you use SQL to analyze structured and semi-structured data across data warehouses, operational databases, and data lakes. Today, I am happy to introduce the <strong>public preview</strong> of <a href=\"http://aws.amazon.com/redshift/redshift-serverless\">Amazon Redshift Serverless</a>, a new capability that makes it super easy to run analytics in the cloud with high performance at any scale. Just load your data and start querying. There is no need to set up and manage clusters. You pay for the duration in seconds when your data warehouse is in use, for example, while you are querying or loading data. There is no charge when your data warehouse is idle.</p> \n<p>Amazon Redshift Serverless automatically provisions the right compute resources for you to get started. As your demand evolves with more concurrent users and new workloads, your data warehouse scales seamlessly and automatically to adapt to the changes. You can optionally specify the base data warehouse size to have additional control on cost and application-specific SLAs.</p> \n<p>With the new serverless option, you can continue to query data in other AWS data stores, such as <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> data lakes and <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a> and <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (RDS)</a> databases.</p> \n<p>Amazon Redshift Serverless is ideal when it is difficult to predict compute needs such as variable workloads, periodic workloads with idle time, and steady-state workloads with spikes. This approach is also a good fit for ad-hoc analytics needs that need to get started quickly and for test and development environments.</p> \n<p>Let’s see how this works in practice.</p> \n<p><span><strong>Using Amazon Redshift Serverless<br /> </strong></span>I go to the <a href=\"https://console.aws.amazon.com/redshift/home\">Amazon Redshift console</a> and choose the new serverless option. The first time, I set up the <strong>serverless endpoint</strong> and configure networking and security.</p> \n<p>I confirm the default settings that use all subnets in my <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/default-vpc.html\">default</a> <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (VPC)</a> and its <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html#DefaultSecurityGroup\">default security group</a>. Data is always encrypted, and I use the default AWS-owned key. Optionally, I can customize all settings. I can associate now or later the <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> roles to give permissions to access other AWS resources, for example, to be able to load data from an S3 bucket. The configuration of the serverless endpoint will be shared by all my serverless data warehouses in the same AWS account and Region.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/29/redshift-serverless-endpoint-setup-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/29/redshift-serverless-endpoint-setup-1-928x1024.png\" /></a></p> \n<p>To query data, I use <a href=\"https://aws.amazon.com/blogs/aws/amazon-redshift-query-editor-v2-web-query-authoring/\">Amazon Redshift Query Editor V2, a new free web-based tool that we made available a few months back</a>. The query editor provides quick access to a few <strong>sample datasets</strong> to make it easy to learn Amazon Redshift’s SQL capabilities: <a href=\"http://www.tpc.org/tpch/\">TPC-H</a>, <a href=\"http://www.tpc.org/tpch/\">TPC-DS</a>, and <code>tickit</code>, a dataset containing information on ticket sales for events.</p> \n<p>For a quick test, I use the <code>tickit</code> sample dataset so I don’t need to load any data. I prepare a query to get the list of tickets sold per date, sorted to see the dates with more sales first:</p> \n<pre><code>SELECT caldate, sum(qtysold) as sumsold\nFROM   tickit.sales, tickit.date\nWHERE  sales.dateid = date.dateid \nGROUP BY caldate\nORDER BY sumsold DESC;</code></pre> \n<p>By using the web-based query editor, I don’t need to configure a SQL client or set up the network permissions to reach the serverless endpoint. Instead, I just write my SQL query and run it.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-query.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-query-1024x508.png\" /></a></p> \n<p>I am a visual person. I enable the <strong>Chart</strong> option on the right of the result table and select a bar chart.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-editor-chart.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-editor-chart-1024x506.png\" /></a></p> \n<p>Satisfied with the clarity of the chart, I export it as an image file. In this way, I can quickly share it or include it in a report.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-chart.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/10/redshift-serverless-chart.png\" /></a></p> \n<p>Amazon Redshift Serverless supports all rich SQL functionality of Amazon Redshift such as semi-structured data support. I can use any JDBC/ODBC-compliant tool or the <a href=\"https://docs.aws.amazon.com/redshift/latest/mgmt/data-api.html\">Amazon Redshift Data API</a> to query my data. To migrate data, I can take a snapshot of an Amazon Redshift provisioned cluster and restore it as serverless. Then, I just need to update my SQL applications to use the new serverless endpoint.</p> \n<p><span><strong>Availability and Pricing<br /> </strong></span><a href=\"http://aws.amazon.com/redshift/redshift-serverless\">Amazon Redshift Serverless</a> is available in <strong>public preview</strong> in the following <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regions_az/#Regions\">AWS Regions</a>: US East (N. Virginia), US West (N. California, Oregon), Europe (Frankfurt, Ireland), Asia Pacific (Tokyo).</p> \n<p>With Amazon Redshift Serverless, you pay separately for the compute and storage you use. Compute capacity is measured in <strong>Redshift Processing Units (RPUs)</strong>, and you pay for the workloads in RPU-hours with per-second billing. For storage, you pay for data stored in Amazon Redshift-managed storage and storage used for snapshots, similar to what you’d pay with a provisioned cluster using RA3 instances.</p> \n<p>To control your costs, you can specify usage limits and define actions that Amazon Redshift automatically takes if those limits are reached. You can specify usage limits in RPU-hours and associated with a daily, weekly, or monthly duration. Setting higher usage limits can improve the overall throughput of the system, especially for workloads that need to handle high concurrency while maintaining consistently high performance.</p> \n<p>Compute resources automatically shutdown behind the scenes when there is no activity and resume when you are loading data, or there are queries coming in. When accessing your S3 data lake via the new serverless endpoint, you do not pay for <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/c-getting-started-using-spectrum.html\">Amazon Redshift Spectrum</a> separately. You have a unified serverless experience and pay for data lake queries also in RPU-seconds. For more information, see the <a href=\"https://aws.amazon.com/redshift/pricing/\">Amazon Redshift pricing page</a>.</p> \n<p>The serverless end point is configured at the AWS account level. If you have multiple teams or projects and want to manage costs separately, you can use separate AWS accounts. You can share data between your provisioned clusters and serverless endpoint and between serverless endpoints across accounts.</p> \n<p><strong>To help you get practice, we provide you upfront with $500 in AWS credits to try the Amazon Redshift Serverless public preview.</strong> You get the credits when you first create a database with Amazon Redshift Serverless. These credits are used to cover your costs for compute, storage, and snapshot usage of Amazon Redshift Serverless only.</p> \n<p><a href=\"http://aws.amazon.com/redshift/redshift-serverless\"><strong>Start using Amazon Redshift Serverless today to run and scale analytics without having to provision and manage data warehouse clusters.</strong></a></p> \n<p>— <a href=\"https://twitter.com/danilop\">Danilo</a></p>","author":"Danilo Poccia","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"ce5facef4f4c1d30b91d78a98b6008c823aaed7e412edde1ca02342303b79387","category":"Tech"}