{"title":"Attempts to Circumvent Apple's App Tracking Transparency Rules in China Reportedly Fail to Gain Traction","link":"https://www.macrumors.com/2021/07/05/china-iphone-ad-tracking-efforts-fail/","date":1625469145000,"content":"Apple's crackdown on Chinese apps that tried to bypass its new privacy rules has successfully thwarted a coordinated effort to create a new way of tracking iPhones for advertising in the country, according to a new report today.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/07/app-tracking-pop-up-ios-14.jpg\" />\r\n<br />\r\nIntroduced in iOS 14.5, Apple's App Tracking Transparency rules require apps that access an iPhone's ad identifier or IDFA must ask a user's permission before tracking is allowed. As reported by the <em>Financial Times</em> in March, however, the change spurred ad and tech groups in China to <a href=\"https://www.macrumors.com/2021/03/16/china-tech-giants-test-tracking-tool-avoid-idfa/\">develop a new way of tracking users</a> without their consent, called CAID.\r\n<br />\r\n\r\n<br />\r\nAlong with the state-backed China Advertising Association (CAA), tech groups led by Baidu, Tencent, and TikTok parent ByteDance began testing CAID to see if it would let them identify users even if they refused to let apps use IDFA. Aware of the tests, Apple responded by <a href=\"https://www.macrumors.com/2021/03/18/app-tracking-transparency-chinese-tech-companies/\">blocking updates</a> to several Chinese apps that it had caught using CAID in App Store submissions.\r\n<br />\r\n\r\n<br />\r\nAccording to <em>FT</em>'s <a href=\"http://dlvr.it/S33WGB\">latest paywalled report</a>, that made the groups involved in testing CAID think again, and the project has since struggled to find support in mainland China and beyond.\r\n<br />\r\n<blockquote>Several people in China and Hong Kong said that, following Apple's retaliation, CAID lost support and the whole project failed to gain traction. \r\n<br />\r\n\r\n<br />\r\n\"This is a clear victory for Apple, and also consumer privacy, as the tech giants of China have been forced to back down and comply with Apple's rules,\" said Rich Bishop, chief executive of AppInChina, a leading publisher of international software in China.\r\n<br />\r\n\r\n<br />\r\n\"The Chinese app ecosystem was collectively baiting the bull with CAID, under the theory that Apple couldn't afford to ban every major app in the market,\" added Alex Bauer, head of product marketing at adtech group Branch.\r\n<br />\r\n\r\n<br />\r\n\"Apple called their bluff, and seems to have reasserted control over the situation by aggressively rapping knuckles on early adopters, before the consortium gained any real momentum.\"</blockquote>ByteDance did not respond to <em>FT</em>'s requests for comment, while Tencent and Baidu declined to comment. Apple meanwhile simply reiterated that its \"App Store terms and guidelines apply equally to all developers around the world\" and that \"apps that are found to disregard the user's choice will be rejected\".\r\n<br />\r\n\r\n<br />\r\nDespite being backed by the state-backed CAA and the China Academy of Information and Communications Technology, a research institute directly under the Ministry of Industry and Information Technology, it's not clear if these groups had the full backing of Beijing. \r\n<br />\r\n\r\n<br />\r\nSimilarly, it's unknown if all the groups involved knew that use of CAID was a violation of Apple's policies, although some of those involved reportedly said they believed CAID had Apple's \"stamp of approval.\"\r\n<br />\r\n\r\n<br />\r\nEither way, it appears that Apple's early crackdown on apps that tried to circumvent App Tracking Transparency has had the intended effect of discouraging similar attempts, while successfully avoiding a showdown with the Chinese authorities over its wider use.<div>Tags: <a href=\"https://www.macrumors.com/guide/china/\">China</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/05/china-iphone-ad-tracking-efforts-fail/\">Attempts to Circumvent Apple's App Tracking Transparency Rules in China Reportedly Fail to Gain Traction</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/attempts-to-circumvent-apples-app-tracking-transparency-rules-in-china-reportedly-fail-to-gain-traction.2303263/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Y0LTrrtKIR8:TkAdkPvulQw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Y0LTrrtKIR8:TkAdkPvulQw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Y0LTrrtKIR8\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ce6272b0a3325f33c45b00c2478efcc96c15dd23948c5089a63cd935ca58bb9f","category":"Apple"}