{"title":"HashiCorp at re:Invent 2023: A year of collaboration with AWS","link":"https://www.hashicorp.com/blog/hashicorp-at-re-invent-2023-a-year-of-collaboration-with-aws","date":1701190800000,"content":"<p>Amazon Web Services’ flagship cloud conference — <a href=\"https://www.hashicorp.com/blog/hashicorp-at-aws-re-invent-your-blueprint-for-cloud-success\">AWS re:Invent</a> — is back, and this year, as an Emerald sponsor, HashiCorp’s presence is bigger than ever. For both in-person and remote attendees, we’re pleased to share the latest news on our long-standing relationship with AWS and how we help organizations provision, secure, run, and connect applications running in AWS. </p>\n\n<p>HashiCorp accelerates organizations’ transition to the cloud by providing lifecycle management and automation for application infrastructure and security. Our <a href=\"https://www.hashicorp.com/products/terraform\">infrastructure portfolio</a> includes products to build, deploy, and manage the lifecycle of application infrastructure. The products in the HashiCorp <a href=\"https://www.hashicorp.com/products/vault\">security portfolio</a> leverage identity-based controls to protect, inspect, and connect users and machines to secrets and critical data. As AWS re:Invent takes center stage, it’s a great moment to reflect on our major infrastructure and security collaborations with AWS and significant milestones from the past year. </p>\n\n<h2>HashiCorp wins AWS Global Collaboration Partner of the Year award</h2>\n\n<p>HashiCorp has been awarded Amazon Web Services’ Global Collaboration Partner of the Year. The Collaboration Partner of the Year award recognizes partners that have collaborated with AWS and other AWS partners to address customer problems leveraging services and technology offered across multiple AWS partners.</p>\n<img src=\"https://www.datocms-assets.com/2885/1701119373-collaboration-aws_hashicorp_award_2023_1920x1080-3.png\" alt=\"AWS\" /><p>HashiCorp’s tools, loved by developers worldwide as shown by the more than <a href=\"https://aws.amazon.com/blogs/aws-insights/two-billion-downloads-of-the-terraform-aws-provider-shows-value-of-iac-for-infrastructure-management/#:%7E:text=While%20two%20billion%20downloads%20represents,IaC%20solutions%20as%20organizations%20scale.\">two billion downloads of the Terraform AWS provider</a>, offer a unified solution to build on AWS, replacing fragmented workflows with a standardized approach and a system of record for the cloud. This not only enhances security and developer productivity but also cuts costs by reducing time spent on provisioning and management. With the upcoming Terraform stacks feature, now in private preview, HashiCorp is set to transform how organizations use Terraform to further simplify infrastructure provisioning and management at scale.</p>\n\n<p>HashiCorp’s highly scalable solutions are integrated into AWS, enabling thousands of developers and enterprises to move faster, modernize their operations, and get the most out of AWS. Together AWS and HashiCorp accelerate the delivery of new business value for our collective customers.</p>\n\n<p>Major HashiCorp/AWS infrastructure and security developments in the last year include:</p>\n\n<h2>Infrastructure: Terraform Cloud self-service provisioning with AWS Service Catalog</h2>\n\n<p>Customers can now use <a href=\"https://aws.amazon.com/servicecatalog/\">AWS Service Catalog</a> as the single tool to organize, govern, and distribute their HashiCorp Terraform Cloud configurations within AWS at scale. This includes integrated access to key AWS Service Catalog features, including cataloging of standardized and pre-approved Terraform configurations, infrastructure as code templates, access control, resource provisioning with least-privilege access, versioning, sharing to thousands of AWS accounts, and tagging.</p>\n\n<p>The new feature lets administrators curate a portfolio of pre-approved Terraform configurations on AWS Service Catalog. End users like engineers, database administrators, and data scientists can deploy these Terraform configurations with a single action from the AWS interface. By combining Terraform Cloud with AWS Service Catalog, we’re connecting a self-service interface that many customers are familiar with, AWS Service Catalog, with the existing workflows and policy guardrails of Terraform Cloud.</p>\n\n<p>End users can easily queue a Terraform configuration from the AWS Service Catalog interface, which generates a workspace for that workload and triggers a <em>run</em> on Terraform Cloud. As credentials are required to initiate a run, the project is configured with <a href=\"https://developer.hashicorp.com/terraform/tutorials/cloud/dynamic-credentials\">dynamic provider credentials</a>, which automatically authenticate the workspace to <em>plan</em> or <em>apply</em> the queued Terraform configuration. Once authenticated, the Terraform configuration provisions the desired resources on AWS. Throughout the workflow, end users never have to interface with Terraform Cloud or handle static credentials.</p>\n<p>Since its launch, HashiCorp and AWS co-presented <a href=\"https://www.youtube.com/watch?v=nXsutsnrzZg\">Terraform Cloud self-service provisioning with AWS Service Catalog</a> at HashiConf 2023 and AWS posted <a href=\"https://aws.amazon.com/blogs/apn/how-to-use-aws-service-catalog-with-hashicorp-terraform-cloud/\">How to Use AWS Service Catalog with HashiCorp Terraform Cloud</a>, demonstrating the workflow for provisioning a new product along with getting-started guides. </p>\n\n<h2>Security: Secrets sync with AWS</h2>\n\n<p>Using an identity-based secrets management solution helps organizations move away from non-scalable, incomplete solutions created by individual developers to broker secrets across cloud environments. With <a href=\"https://www.hashicorp.com/blog/announcing-hcp-vault-secrets-public-beta\">HCP Vault Secrets</a>, developers and IT leadership can remediate <a href=\"https://www.hashicorp.com/resources/what-is-secret-sprawl-why-is-it-harmful\">secret sprawl</a> quickly. HCP Vault Secrets is a centralized, multi-tenant, cloud-native secrets management solution that serves as an intuitive, single source of truth for configuring, consuming, managing, and brokering secrets across key cloud environments and developer workflow tools. Part of the HashiCorp Cloud Platform (HCP), this multi-tenant software-as-a-service (SaaS) offering allows users to get Vault secrets management capabilities up and running in minutes.</p>\n\n<p>HCP Vault Secrets and Vault Enterprise include a key feature to address secret sprawl, called <a href=\"https://developer.hashicorp.com/vault/docs/sync\">secrets sync</a>. Secrets sync lets users synchronize secrets when and where they require them and to continually sync secrets from HCP Vault or Vault Enterprise to external secrets managers (including <a href=\"https://aws.amazon.com/secrets-manager/\">AWS Secrets Manager</a>) so they are always up to date. By adopting secrets sync to remediate secrets sprawl, organizations can establish centralized secrets lifecycle management with Vault as a single control plane. This eliminates the need for context switching among multiple secrets management platforms and reduces the risks associated with secrets management fragmentation.</p>\n<img src=\"https://www.datocms-assets.com/2885/1686584281-vault-secrets_sync.png\" alt=\"Secrets\" /><p>At <a href=\"https://reinforce.awsevents.com/\">AWS re:Inforce</a>, HashiCorp presented how to <a href=\"https://www.youtube.com/watch?v=KR_ncj1eWxk\">Centralize and manage secrets with HashiCorp Cloud</a>. For more information, check out our documentation <a href=\"https://hcp-docs-git-assembly-hcp-vault-secrets-hashicorp.vercel.app/hcp/docs/vault-secrets/integrations/aws-secrets-manager\">on how to integrate with AWS Secrets Manager on the HashiCorp Cloud Platform</a>. And watch the demo below showing how to sync secrets with HCP Vault Secrets and <a href=\"https://aws.amazon.com/secrets-manager/\">AWS Secrets Manager</a>:</p>\n<p>Learn more in our <a href=\"https://developer.hashicorp.com/vault/docs/sync\">secrets sync documentation</a> and discover what Vault can do for your organization on the <a href=\"https://www.hashicorp.com/products/vault/features\">Vault features page</a>.</p>\n\n<h2>Learn more about AWS and HashiCorp</h2>\n\n<p><a href=\"https://www.hashicorp.com/partners/cloud/aws\">AWS and HashiCorp</a> continue to extend our partnership, building new integrations to help customers work faster, take advantage of more services and features, and provide developer-friendly ways to deploy cloud infrastructure.</p>\n\n<p>Developers can use the Terraform AWS provider to interact with the many resources supported by AWS. To learn the basics of Terraform using this provider, follow the hands-on tutorials for <a href=\"https://developer.hashicorp.com/terraform/tutorials/aws-get-started\">getting started with Terraform on AWS</a> on our developer education platform. Interact with AWS services, including Lambda, RDS, and IAM, by following the <a href=\"https://developer.hashicorp.com/terraform/tutorials/aws\">AWS services tutorials</a>. </p>\n","author":"Mike Doheny","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"ce69af18ad1c7b5e719045ceddc066b79a7b867cdae041640b03efe618e8ecf2","category":"Tech"}