{"title":"Latent Bacterial Cells Residing Inside Macrophages Can Be Spotted With pH-sensitive Fluorescent FRET Probe in Polymeric Micellar Formulation","link":"https://www.preprints.org/manuscript/202408.0285/v1","date":1722905904000,"content":"As shown previously, Rhodamine 6G (R6G) and 4-nitro-2,1,3-benzoxadiazole (NBD) linked through a spacer molecule spermidine (spd), R6G-spd-NBD, produce a fluorescent probe with pH-sensitive FRET effect, that can be useful in a variety of diagnostic applications. Specifically, cancer cells can be spotted due to a local decrease in pH (Warburg effect). Here we extend this approach to infectious diseases – namely, leishmaniasis, brucellosis, and tuberculosis, are difficult to treat largely because of their localization inside macrophages. R6G-spd-NBD offers an opportunity to detect such bacteria and potentially deliver therapeutic target to treat them. The micellar form of the R6G-spd-NBD probe (chitosan or heparin grafted with lipoic acid residues, Chit-LA and Hep-LA, respectively) was obtained to improve the pH sensitivity in the desired range (5.5–7.5) and enable the selective targeting of bacterial cells, thus improving CLSM imaging. According to AFM (atomic force microscopy) data, the micelles containing NBD-spd-R6G have a compact and highly spherical shape, with a diameter ranging from 70 to 110 nm. The micellar form of the R6G-spd-NBD further improves absorption and penetration into bacteria, including those located inside macrophages. Due to negative charge of the surface, bacteria absorb positively charged R6G-spd-NBD, and even more so in the micellar form, when chitosan derivatives are used to form the polymeric micelle. Additionally, macrophages’ lysosomes can be easily distinguished due to their acidic pH. Confocal laser scanning microscopy was used to visualize samples of macrophages cells containing absorbed bacteria. The micellar formulation showed a significant selectivity to model E. coli vs Lactobacillus bacterial cells, and R6G-spd-NBD, being a mild bactericide, clears over 50% E.coli in conditions where Lactobacillus remains almost unaffected. Taken together, our data indicates that R6G-spd-NBD, as well as similar compounds, can have value not only for diagnostic, but also for theranostic applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ce6f30cda4a08e241fea0b52f746882ff774e40c642bcef0b5008503508f8de3","category":"Interdisciplinary"}