{"title":"The Super Mario Bros. Movie (2023)","link":"https://neizod.dev/2023/04/14/super-mario-bros-movie.html","date":1681433760000,"content":"<p>โฆษณาแฟรนไชส์เกมความยาวหนึ่งชั่วโมงครึ่งแถมยังต้องเสียตังค์ตีตั๋วเข้าไปดู … ซึ่งก็นับว่าทำออกมาได้สนุกเหมือนกำลังนั่งจับจอยเกมเล่นเองจริงๆ</p>\n\n<blockquote>\n  <p><img src=\"/images/cover/super-mario-bros.jpg\" alt /></p>\n</blockquote>\n\n<p>หนังสร้างจากวิดีโอเกมชื่อดังที่ไม่น่ามีใครไม่รู้จัก  Super Mario Bros. กับลุงหนวดช่างประปาที่น่าจะนับได้ว่าเป็นทูตวัฒนธรรมของวงการเกมไปแล้ว (เฉกเช่นที่อดีตนายกญี่ปุ่นเคยสวมบทบาทตัวละครดังกล่าวในปี 2016 เพื่อเปิดตัวกีฬาโอลิมปิกครั้งถัดไป<sup><a href=\"#fn:1\">1</a></sup>) ซึ่งก็ไม่น่าแปลกใจที่เกมดังกล่าวจะครองใจผู้คนจำนวนมากได้ในทุกวันนี้ เพราะที่จริงแล้วเกมดังกล่าวไม่ใช่แค่เกมเกมเดียว แต่เป็นซีรีส์ของเกมที่พัฒนาขึ้นมาเรื่องๆ ตามเทคโนโลยีที่ไม่หยุดนิ่ง ตั้งแต่เกมภาคแรกที่ออกมาตั้งแต่ปี 1985 และภาคต่อๆ มานับรวมจนถึงปัจจุบันได้เกือบยี่สิบภาค</p>\n\n<p>ซึ่งอันที่จริง Mario ก็ไม่ได้ปรากฏตัวครั้งแรกในเกมของตัวเองเสียด้วย แต่ไปเป็นแขกรับเชิญให้กับ Donkey Kong ตั้งแต่ปี 1981 กับภารกิจปีนตึกขึ้นไปช่วยแฟน(เก่า)อย่าง Pauline จากการถูกลักพาตัว ดังนั้นหากต้องการพูดถึง Mario อย่างละเอียดครบถ้วน ก็คงเลี่ยงไม่ได้ที่จะต้องนึกถึงคู่ปรับ/เพื่อนซี้ในเกมคู่ขนานอย่าง Donkey Kong ไปโดยปริยาย</p>\n\n<p>และก็ดูเหมือนว่า Nintendo จะเข้าใจ “จุดแข็ง” ตรงนี้ดี ว่าเราจะออกแบบเกมที่นำเสนอวิธีการเล่นใหม่ๆ พร้อมกับการสร้างตัวละครอีกชุดให้กับเกมเหล่านั้นทำไม ในเมื่อเราสามารถนำเอาตัวละครที่ทุกคนรู้จักกันดีอยู่แล้วกลับมาใช้ซ้ำได้ เพราะปรัชญาสำคัญในการออกแบบเกม Nintendo ก็คือรูปแบบวิธีการเล่นใหม่ๆ ที่มอบประสบการณ์อันน่าสนใจ<sup><a href=\"#fn:2\">2</a></sup> หาใช่การมีตัวละครอันมากมายที่นอกจากผู้เล่นอาจไม่สามารถจดจำได้หมดแล้ว ยังไม่ใช่ประเด็นหลักของเกมอยู่ดี เพราะตัวละครเหล่านั้นก็เปรียบดั่งแค่เสื้อผ้าให้ผู้เล่นได้สวมใส่ตัวเองเข้าไปแค่นั้น<sup><a href=\"#fn:3\">3</a></sup></p>\n\n<p>เราเลยมีซีรีส์เกมข้างเคียงจากค่าย Nintendo ที่ใช้ Mario และเหล่าผองเพื่อนเป็นตัวละครหลักมากมายเต็มไปหมด ไม่ว่าจะเป็นเกมแนวต่อสู้ Super Smash Bros. บอร์ดเกม Mario Party เกมพัซเซิล Dr. Mario หรือบรรดาเกมกีฬาอย่าง Tennis, Golf, Pinball ฯลฯ</p>\n\n<p>แต่ spin-off ที่โด่งดังที่สุดคงหนีไม่พ้น Mario Kart เกมแข่งรถโกคาร์ทที่เปิดตัวภาคแรกในปี 1992 และพัฒนาควบคู่กันมาจนปัจจุบันซีรีส์คู่ขนานนี้ก็ได้เดินทางมาถึงภาคแปดแล้ว</p>\n\n<p>ดังนั้น Mario, Donkey Kong และ Kart จึงเป็นสารตั้งต้นสำคัญที่กำหนดทิศทางและความสนุกของหนังเรื่องดังกล่าว</p>\n\n<p>ซึ่งเอาจริงๆ นี่ไม่ใช่ครั้งแรกที่หนังเกี่ยวกับ Mario ได้ถูกสร้าง อย่างในปี 1993 ก็เคยมีหนังภาคคนแสดงมาแล้ว … และแม้จะไม่เคยดู/ไม่คิดจะหามาดู แต่ก็คงจะเดากันได้ไม่ยากว่าหนังภาคดังกล่าวนั้นถือเป็นตราบาปบนประวัติศาสตร์ของ Mario ก็ว่าได้<sup><a href=\"#fn:4\">4</a></sup></p>\n\n<p>โอกาสแก้ตัวครั้งนี้ จึงหนีไม่พ้นโจทย์ใหญ่ที่ว่า จะทำอย่างไรให้หนังออกมาสนุกครองใจผู้ชม?</p>\n\n<p>โชคดีที่คำถามดังกล่าวนั้นแตกย่อยออกมาเป็นคำถามที่ง่ายลงได้ว่า ใครคือผู้ที่จะตีตั๋วเข้ามาชมหนังบ้าง? แน่นอนว่าแม้หนังจะวางตัวให้เหมาะกับผู้ชมทั่วไปทุกเพศทุกวัยดูได้ แต่การไม่ลืมรากเหง้าว่าผู้ชมส่วนใหญ่ก็คือเหล่าเกมเมอร์ (ที่ตอนนี้อายุอานามก็ไม่น้อยแล้ว) นั้นเป็นสิ่งสำคัญยิ่ง</p>\n\n<p>ซึ่งก็จะนำไปสู่คำถามถัดไปว่า ผู้ชมเหล่านั้นต้องการอะไรจากหนังหละ?</p>\n\n<p>แน่นอนว่าไม่มีใครสนใจความ “สมจริง” ในหนังที่สร้างจากเกมอยู่แล้ว เช่นถ้าให้คนจริงๆ วิ่งชนกำแพงก็คงหัวแตกนอนสลบโดนหามโรงพยาบาล แต่กับตัวละครในเกมแล้ว การวิ่งชนกำแพงแล้วกำแพงแตกสลายแถมยังวิ่งต่อไปได้เรื่อยๆ นั้นไม่ใช่เรื่องแปลกแต่อย่างใด</p>\n\n<p>หรือจริงๆ อาจเรียกได้ว่า เงื่อนไขดังกล่าวนั้นสมจริงภายใต้ระบบตรรกะของตนเอง อย่างเช่นการที่ Mario ต้องกินเห็ดเพิ่มพลังก่อนถึงจะสามารถชกกำแพงให้พังทลายได้</p>\n\n<p>แต่นั่นก็เป็นเพียงแค่ความสมจริงภายใต้มิติที่ว่าโลกของเกมมีกฏเกณฑ์แตกต่างออกไปจากโลกที่เราอาศัยอยู่ก็เท่านั้น</p>\n\n<p>อีกมิติสำคัญที่หลงลืมไม่ได้ ก็คือวิดีโอเกมนั้นไม่ใช้การสื่อสารแค่ทางเดียว (เช่นการดูหนังหรืออ่านนิยาย) แต่เป็นการสื่อสารที่ต้องโต้ตอบสองทางอย่างฉับพลันระหว่างเกมกับผู้เล่น ทุกการกระทำของผู้เล่นนั้นส่งผลต่อเกมเสมอ เช่น ถ้าผู้เล่นพลาดพลั้งทำเห็ดหลุดหายไปก็จะไร้ซึ่งพลังในการต่อยกำแพง หรือถ้าผู้เล่นจดจำไม่ได้ว่าเห็ดสีไหนให้พลังแบบใด ก็อาจเผลอกินเห็ดที่นอกจากจะไม่ให้พลังความแข็งแรงแล้ว ยังย่อขนาดของผู้เล่นจนเล็กจิ๋วแทนเสียอย่างนั้น</p>\n\n<p>พูดอีกอย่างก็คือ เรามีโลกตรงกลางที่คั่นระหว่างโลกของผู้เล่นกับโลกของเกมอยู่ โลกแห่งปฏิสัมพันธ์อันเปรียบเสมือนท่อน้ำที่เชื่อมโลกความจริงกับโลกเกมเข้าด้วยกันนั่นเอง</p>\n\n<p>ซึ่งหนังก็สามารถถ่ายทอดความสมจริงของโลกแห่งปฏิสัมพันธ์นี้ออกมาได้อย่างทรงพลัง กับฉากฝึกตนของ Mario เมื่อเจ้าหญิง Peach ต้องการทดสอบว่าเขาคู่ควรกับการผจญภัยหรือไม่ … แน่นอนว่าฉากดังกล่าวไม่ใช่สิ่งแปลกใหม่อะไร หนังเรื่องอื่นก็มีฉากแนวนี้เพื่อแสดงถึงพัฒนาการของตัวละครเช่นกัน เช่น Karate Kid (1984), Mulan (1998), Whiplash (2014)</p>\n\n<p>อันที่จริงแล้ว ฉากฝึกตนในหนังที่ต่างกันก็ให้ความรู้สึกที่ต่างกันอย่างสิ้นเชิง เช่น Karate Kid ก็ให้ความรู้สึกยอมรับนับถือกับสิ่งเล็กๆน้อยๆ ในชีวิตประจำวัน ว่าเรื่องเหล่านั้นเกี่ยวพันส่งเสริมแด่การฝึกตนในเป้าหมายใหญ่ทั้งสิ้น (sand the floor, wax on, wax off, paint the fence) หรือ Mulan ที่แสดงให้เห็นว่าพละกำลังเพียงอย่างเดียวนั้นไม่พอ แต่ยังต้องอาศัยมันสมองเพื่อคอยเปลี่ยนอุปสรรค์ที่ขัดขวางให้กลับกลายเป็นมิตรแท้และมอบความได้เปรียบอีกด้วย ส่วน Whiplash นั้นให้ความรู้สึกสิ้นหวังกับการเข้าไม่ถึงความสมบูรณ์แบบเสียที แม้ว่าปัจจุบันจะเก่งกาจจนไม่มีใครเทียบเคียงได้แล้วก็ตาม แต่แทนที่จะอิ่มตัวกับจุดสูงสุดตรงนั้น กลับเลือกที่จะขัดเกลาตนเองต่ออย่างไม่หยุดหย่อนเพื่อให้ไปถึงจุดที่ยังไม่เคยมีใครเคยไปได้ถึง</p>\n\n<p>แน่นอนว่าฉากฝึกฝนใน Super Mario Bros. Movie<sup><a href=\"#fn:5\">5</a></sup> ก็ก่อให้เกิดความรู้สึกที่แตกต่างอย่างเฉพาะตัว ซึ่งหนังก็ชาญฉลาดมากที่ฉกฉวยความเป็นวิดีโอเกมที่แทบทุกคนต้องเคยเล่นมาใช้ จึงดึงความรู้สึกร่วมกับผู้ชม/ผู้เล่นได้เป็นอย่างดี ตั้งแต่การพลาดท่าให้กับดอกปิรันย่า การกะจังหวะผิดจนโดนแท่งไฟปัดตกฉาก หรือแม้กระทั่งพื้นลื่นจนหลุดขอบตกเหวไปเอง แต่ยังดีที่บางทีก็บังเอิญค้นพบทางลัดที่ปลอดภัยไร้ซึ่งสิ่งกีดขวาง ทั้งหมดนี้ทำให้ผู้เล่นตระหนักได้ว่าเราทุกคนนั้นก็ไม่ได้เก่งกาจมาตั้งแต่ต้น แต่เกิดจากการฝึกฝน “เล่นเกม” ไปเรื่อยๆ และพัฒนาปฏิกิริยาตอบสนองต่อเกมได้อย่างเด็ดขาดเฉียบคมจนไปถึงเส้นชัยได้ในที่สุด</p>\n\n<p>เรียกได้ว่าผู้เล่นไม่ได้แค่นั่งเฉยๆ แล้วรอให้สถานการณ์คลี่คลายไปเอง แต่ต้องออกแรงเพื่อพิสูจน์ว่าตนเองคู่ควรกับฉากจบนั้นๆ<sup><a href=\"#fn:6\">6</a></sup></p>\n\n<p>เพียงแค่ฉากฝึกฝนฉากเดียวก็แสดงสัมพันธ์ระหว่างผู้เล่นกับวิดีโอเกมได้อย่างครบถ้วนแล้ว แต่หนังก็ยังสร้างความประหลาดใจ/ประทับใจในฉากต่อมาอีกครั้ง โดยมันอาจเป็นฉากสั้นๆ ที่คนที่ไม่ได้เล่นเกมไม่รู้สึกสลักสำคัญอะไร แต่กับเหล่า <a href=\"//en.wikipedia.org/wiki/Speedrunning\">speedrunner</a> กลุ่มผู้เล่นเกมที่ตั้งเป้าทุบสถิติความเร็วแล้ว ฉากที่ว่าก็น่าจะทำให้พวกเขาปลาบปลื้มภูมิใจอยู่ไม่น้อย<sup><a href=\"#fn:7\">7</a></sup><sup><a href=\"#fn:8\">8</a></sup></p>\n\n<p>ซึ่งฉากนั้นคือฉากขับรถต่อสู้กันบนถนนสายรุ้ง เมื่อ Mario เหลือบไปมองเห็นถนนอีกเส้นหนึ่งอยู่ข้างล่าง จึงตัดสินใจขับรถ “กระโดด” ลงไปยังถนนเส้นนั้นเพื่อล่อให้ลูกสมุนของ Bowser แยกทางกันนั่นเอง</p>\n\n<p>แน่นอนว่าเมื่อมองผ่านสายตาคนดูหนังแล้ว นั่นเป็นการกระทำที่ปรกติธรรมดาสมเหตุสมผล เพราะยังไงเสีย ในโลกของหนัง อะไรก็เกิดขึ้นได้อยู่แล้ว (ยิ่งเมื่อพิจารณาควบคู่กับฉากก่อนหน้าที่ปูพื้นความเป็นไปได้นี้โดยการขับรถกระโดดข้ามเหวอีกด้วย)</p>\n\n<p>แต่กับผู้ที่เคยเล่นเกม Mario Kart มาก่อน การกระทำดังกล่าวนั้นบ้าระห่ำสิ้นดี!</p>\n\n<p>ท้าวความก่อนว่าด่านถนนสายรุ้ง (Rainbow Road) นั้น น่าจะนับได้ว่าเป็นด่านที่ยากที่สุดตั้งแต่การเปิดตัว Mario Kart ภาคแรกในปี 1992 เลยทีเดียว ด้วยเหตุผลง่ายๆ ว่าถนนในด่านดังกล่าวนั้นไม่มีขอบกั้นกันรถตกขอบ!</p>\n\n<p>อย่างไรก็ตาม เกมภาคแรกนั้นก็ยังเป็นเพียงแค่เกม 2D กล่าวคือแม้เกมจะพยายามแสดงผลให้ผู้เล่นรู้สึกว่ากำลังอยู่ในโลกที่มีความกว้างยาวลึก แต่การประมวลผลเบื้องหลังนั้นก็ยังเป็นเพียงพิกัดแบบสองมิติอยู่ดี ด่านต่างๆ ในเกมนี้จึงไม่ได้มีอะไรหวือหวา ดังจะเห็นได้จากถนนทุกด่านนั้นราบเรียบมีความสูงเดียวกันหมด</p>\n\n<p>แต่เพียงแค่ Mario Kart 64 ซึ่งเป็นภาคที่สองที่ออกในปี 1996 ก็ได้แปลงเกมให้เป็น 3D ได้สำเร็จ และทำให้เรามีถนนที่มีลูกเล่นหลากหลายเหนือจินตนาการ อย่างเช่นถนนที่วนกลับมาซ้อนกันเป็นสะพานนั่นเอง</p>\n\n<p>และอันที่จริง การขับรถ “กระโดด” ข้ามเหวในเกมนี้ก็ไม่ใช่เรื่องแปลกประหลาดแต่อย่างใด กลับกันเลยว่าหลายด่านนั้นตั้งใจออกแบบถนนที่ขาดช่วงมาให้กระโดดเสียด้วยซ้ำ … เพียงแต่ว่าบรรดาการบังคับกระโดดดังกล่าว จะมีแผ่นเร่งความเร็วติดอยู่ตรงขอบถนนที่ขาดพอดี ซึ่งก็คือรับประกันได้ว่า(เมื่อเล่นเกมตามปรกติ)ผู้เล่นจะสามารถกระโดดถึงอีกฝั่งอย่างแน่นอน</p>\n\n<p>สิ่งที่ทำให้การกระโดดในหนัง/เกมนั้นแตกต่าง ก็คือมันเป็นการกระโดดออกนอกเส้นทางที่วางไว้ต่างหาก ซึ่งก็คือไม่มีตัวช่วยหรือการรับประกันใดๆ ว่าจะกระโดดได้ถึงจุดหมาย และเป็นสิ่งที่ผู้เล่นทั่วไปต่างสะพรึงกลัวและหลีกเลี่ยง</p>\n\n<p>เช่นนั้นแล้วจะมีใครที่ค้นพบเส้นทางลัดเหล่านี้ได้ ถ้าไม่ใช่เหล่า speedrunner ผู้ทุ่มเทกายใจฝึกฝนเล่นเกมซ้ำๆ เป็นพันเป็นหมื่นชั่วโมง เพียงเพื่อจะได้วิ่งเร็วขึ้นจากเดิมบางครั้งก็แค่เศษเสี้ยววินาที</p>\n\n<p>และการค้นพบดังกล่าวก็มอบรางวัลอันยิ่งใหญ่ให้ เพราะมันสามารถหั่นเวลาด่านถนนสายรุ้งในเกมภาคนี้ไปได้เกือบครึ่งเลยทีเดียว!<sup><a href=\"#fn:9\">9</a></sup></p>\n\n<p>อย่างไรก็ตาม ดูเหมือนว่า Nintendo น่าจะไม่เห็นด้วยกับแนวทางการเล่นดังกล่าวซักเท่าไหร่ เพราะเกมภาคใหม่อย่าง Mario Kart DS (2005) นั้นมากับระบบเช็คพอยท์ที่รัดกุมขึ้น จึงทำให้แม้ผู้เล่นอาจกระโดดข้ามฉากส่วนใหญ่ได้ก็จริง แต่ตัวเกมจะไม่นับระยะทางให้เมื่อผู้เล่น “โกงเกม” เช่นนั้น<sup><a href=\"#fn:9\">9</a></sup></p>\n\n<p>แต่ความสัมพันธ์ระหว่างนักออกแบบและนักเล่นเกมนั้นก็เปรียบได้ดั่งสถานการณ์แมวจับหนู กับเกมภาคถัดไป Mario Kart Wii (2008) ที่ถูกชุมชน speedrunner ค้นพบกลิทช์ Ultra Shortcut ที่ทำให้ผู้เล่นสามารถกระโดดข้ามฉากและหั่นเวลาได้มากยิ่งกว่าครึ่งอีกครั้ง เพียงแต่ว่าครั้งนี้การกระโดดดังกล่าวนั้นยากแทบจะเกินจินตนาการของมนุษย์ เพราะนอกจากวิธีนี้จะถูกค้นพบแปดปีให้หลังเกมวางขายแล้ว มันยังเป็นการค้นพบผ่านบอทช่วยเล่นเกมอีกด้วย<sup><a href=\"#fn:9\">9</a></sup> และเราก็ต้องรออีกถึงห้าปีกว่าจะมีมนุษย์คนแรกที่ฝึกฝนและใช้งานวิธีดังกล่าวได้สำเร็จ<sup><a href=\"#fn:10\">10</a></sup></p>\n\n<p>แน่นอนว่าในเกมล่าสุด Mario Kart 8 (2014) ผู้ออกแบบเกมเลือกที่จะออกแบบด่านที่มีถนนคู่ขนานห่างไกลกันมากๆ จนไม่สามารถกระโดดถึงกันได้ไปเลย</p>\n\n<p>การได้เห็นฉากขับรถกระโดดข้ามไปยังถนนอีกเส้นใน Super Mario Bros. Movie จึงอาจถือเป็นหมุดหมายสำคัญว่า Nintendo นั้นเปิดใจยอมรับในชุมชน speedrunner และมองว่าการเล่นเกมโดยใช้กลิทช์ก็เป็น “ความสนุก” อย่างหนึ่งแล้ว ไม่ได้เป็นเรื่องการโกงเกมแต่อย่างใด (อย่างไรเสีย ในชุมชน speedrunner เองก็มีการแบ่งประเภทการแข่งขันอยู่แล้ว ว่าต้องการไปให้เร็วภายใต้กฎเกณฑ์ที่ผู้ออกแบบตั้งใจ หรือจะไปให้เร็วยิ่งขึ้นโดยปลดล็อกเซฟตี้ต่างๆ เหล่านั้น)</p>\n\n<p>จริงอยู่ที่ว่าผู้สร้างหนังอาจไม่ได้คิดอะไรมากมายหลายตลบเช่นนี้ ฉากดังกล่าวก็อาจถูกใส่เข้ามาเพียงเพราะว่ามันเท่ดีก็ได้ อย่างไรเสียมันก็เป็นแค่ฉากแอคชันทั่วไปที่ใครๆ ก็ใช้ ส่วนเราก็เป็นเพียงแค่เกมเมอร์สมคบคิดคนหนึ่งที่นั่งเทียนเขียนวิเคราะห์จนออกอวกาศไปเอง (ไม่เหมือนกับกรณี The Lego Movie ที่ผู้สร้างหนังแสดงความเคารพชุมชนนักสร้างหนังจากตัวต่อโดยตรง ผ่านการนำเอาหนังสั้นของพวกเขาเหล่านั้นมาประกอบในหนังหลัก<sup><a href=\"#fn:11\">11</a></sup>)</p>\n\n<p>แต่เอาตรงๆ เลยนะ รู้สึกดีเป็นบ้าเลยหว่ะที่ผู้สร้างหนังใส่ใจแม้แต่ในรายละเอียดเล็กน้อยจนหนังออกมา “สมจริง” เช่นนี้</p>\n\n<h3>อ้างอิง:</h3>\n\n<div>\n  <ol>\n    <li>\n      <p>Olympics, 2016, Japan PM Abe Shinzo steals the show in Rio <a href=\"#fnref:1\">↩</a></p>\n    </li>\n    <li>\n      <p>GMTK, 2016, Nintendo - Putting Play First <a href=\"#fnref:2\">↩</a></p>\n    </li>\n    <li>\n      <p>GMTK, 2020, Who Gets to be Awesome in Games? <a href=\"#fnref:3\">↩</a></p>\n    </li>\n    <li>\n      <p>Gaming Historian, 2016, The Super Mario Bros. Movie <a href=\"#fnref:4\">↩</a></p>\n    </li>\n    <li>\n      <p>Illumination, 2023, The Super Mario Bros. Movie | Princess Peach Training Course Clip <a href=\"#fnref:5\">↩</a></p>\n    </li>\n    <li>\n      <p>NIKMOE, 2018, Understanding Mario Odyssey’s Multiple Endings <a href=\"#fnref:6\">↩</a></p>\n    </li>\n    <li>\n      <p>Slash Film, 2023, The Super Mario Bros. Movie Honors One Of Mario Kart’s Best Shortcuts <a href=\"#fnref:7\">↩</a></p>\n    </li>\n    <li>\n      <p>Polygon, 2023, Rainbow Road’s Leap of Faith (and Double Dash!) <a href=\"#fnref:8\">↩</a></p>\n    </li>\n    <li>\n      <p>Summoning Salt, 2019, The History of Rainbow Road World Records <a href=\"#fnref:9\">↩</a> <a href=\"#fnref:9:1\">↩<sup>2</sup></a> <a href=\"#fnref:9:2\">↩<sup>3</sup></a></p>\n    </li>\n    <li>\n      <p>Arthur, 2021, 【MKW Former WR】Rainbow Road (Glitch) - 2:14.677 - Arthur <a href=\"#fnref:10\">↩</a></p>\n    </li>\n    <li>\n      <p>Vox, 2017, How fan films shaped The Lego Movie <a href=\"#fnref:11\">↩</a></p>\n    </li>\n  </ol>\n</div>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"ce82a3c4725bbffd0a7664bcf53e978126fa02f5a14983295257336adf7c23dc","category":"Thai"}