{"title":"iPhone 11 Pro vs. 15 Pro: What to Expect if You've Waited to Upgrade","link":"https://www.macrumors.com/2023/06/29/iphone-11-pro-vs-iphone-15-pro/","date":1688044439000,"content":"While the iPhone 15 Pro has yet to launch, several new features have already been rumored. Following our <a href=\"https://www.macrumors.com/2023/03/17/iphone-12-pro-vs-iphone-15-pro/\">iPhone 12 Pro vs. iPhone 15 Pro</a> and <a href=\"https://www.macrumors.com/2023/06/27/iphone-13-pro-vs-iphone-15-pro/\">iPhone 13 Pro vs. iPhone 15 Pro</a> comparisons, we have now put together a version for the iPhone 11 Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iPhone-11-Pro-Feature-Green.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWhile year-over-year iPhone upgrades are not always significant, new features begin to stack up over multiple generations. For this reason, the iPhone 15 Pro will be a notable upgrade for those who still have a four-year-old iPhone 11 Pro.\r<br />\n\r<br />\nThe list below includes major iPhone changes introduced since 2019, as well as new features rumored for iPhone 15 Pro models.\r<br />\n\r<br />\n<h3>iPhone 11 Pro vs. iPhone 15 Pro</h3><ul><li><strong>A17 chip vs. A13 chip:</strong> The 5nm-based A16 chip in the iPhone 14 Pro is already up to 72% faster than the A13 chip in the iPhone 11 Pro, according to the Geekbench 6 benchmark. The iPhone 15 Pro is expected to be equipped with an A17 chip manufactured based on TSMC's latest 3nm process for even faster performance and improved power efficiency compared to previous chips.</li>\r<br />\n\r<br />\n<li><strong>USB-C port:</strong> With the iPhone 15 Pro, Apple is finally expected to switch from Lightning to a USB-C port. This change will provide a more universal charging standard and allow for faster wired data transfer speeds.</li>\r<br />\n\r<br />\n<li><strong>Titanium frame:</strong> Like the Apple Watch Ultra, the iPhone 15 Pro is rumored to have a titanium frame instead of stainless steel. The back glass and display bezels are also expected to have slightly curved edges.</li>\r<br />\n\r<br />\n<li><strong>Action button:</strong> iPhone 15 Pro models are rumored to be equipped with a customizable Action button like the Apple Watch Ultra. The button would replace the Ring/Silent switch that has been included on every iPhone model since 2007. Users would likely be able to assign the button to various system functions, such as Ring/Silent, Do Not Disturb, Flashlight, Low Power Mode, and more.</li>\r<br />\n\r<br />\n<li><strong>Larger display:</strong> iPhone 11 Pro is equipped with a 5.8-inch display, while the 15 Pro is expected to have a 6.1-inch display.</li>\r<br />\n\r<br />\n<li><strong>Brighter display:</strong> Compared to the iPhone 11 Pro, the 15 Pro's display should have at least 200 nits higher peak brightness.</li>\r<br />\n\r<br />\n<li><strong>ProMotion:</strong> Introduced on the iPhone 13 Pro, ProMotion allows for a variable refresh rate up to 120Hz for smoother appearing content and scrolling.</li>\r<br />\n\r<br />\n<li><strong>Dynamic Island:</strong> With the iPhone 14 Pro, Apple replaced the notch with the Dynamic Island, a pill-shaped area surrounding the Face ID sensors and front camera. The Dynamic Island displays system alerts and supports the Live Activities feature for live sports scores, the status of an Uber ride, and more.</li>\r<br />\n\r<br />\n<li><strong>Always-on display option:</strong> With the iPhone 14 Pro, Apple introduced an always-on display option that dims the entire Lock Screen, but still shows the time and date, widgets, wallpaper, and notifications. Once you raise the iPhone, tap the screen, or press the side button, the display returns to normal brightness.</li>\r<br />\n\r<br />\n<li><strong>Ceramic Shield:</strong> Introduced on the iPhone 12 Pro, Apple said the Ceramic Shield front cover increased drop performance by 4x compared to the 11 Pro.</li>\r<br />\n\r<br />\n<li><strong>Thinner bezels:</strong> Similar to the Apple Watch Series 7 and Series 8, the iPhone 15 Pro is rumored to have ultra-thin bezels around the display.</li>\r<br />\n\r<br />\n<li><strong>Flat edges:</strong> While the iPhone 11 Pro's stainless steel frame has round edges, Apple switched to flat edges with the 12 Pro and newer.</li>\r<br />\n\r<br />\n<li><strong>Longer battery life:</strong> Already, the iPhone 14 Pro lasts up to 23 hours for offline video playback, compared to 18 hours for the iPhone 11 Pro. With components like the A17 chip and the LiDAR Scanner expected to be more power efficient this year, the iPhone 15 Pro could have even longer battery life.</li>\r<br />\n\r<br />\n<li><strong>Camera improvements:</strong> iPhone 11 Pro users upgrading to the 15 Pro will gain access to a wide range of camera upgrades added over the years, including a 48-megapixel main lens, an upgraded front camera with autofocus, sensor-shift image stabilization, a 3x optical zoom option, Action mode, Macro mode, Cinematic mode, ProRAW photos, ProRes video, Night mode portraits and time lapses, and much more. Up to 5-6x optical zoom is expected for the iPhone 15 Pro Max.</li>\r<br />\n\r<br />\n<li><strong>eSIM only in U.S.:</strong> Apple removed the physical SIM card tray from all iPhone 14 models sold in the U.S., meaning the devices work with eSIMs only. The devices are still compatible with SIM cards in other countries, but rumors suggest that iPhone 15 models might be eSIM-only in France, and perhaps some other countries.</li>\r<br />\n\r<br />\n<li><strong>Increased RAM:</strong> iPhone 15 Pro models are rumored to be equipped with an increased 8GB of RAM, compared to 4GB for the iPhone 11 Pro. Increased RAM can benefit multitasking on the iPhone by allowing more apps to be open in the background simultaneously without reloading.</li>\r<br />\n\r<br />\n<li><strong>Wi-Fi 6E:</strong> iPhone 15 Pro models are rumored to support Wi-Fi 6E, which supports the 6GHz band for faster wireless speeds, lower latency, and less signal interference compared to standard Wi-Fi 6.</li>\r<br />\n\r<br />\n<li><strong>Emergency SOS via Satellite:</strong> iPhone 14 models can connect to Globalstar satellites, enabling users to send text messages to emergency services when outside the range of cellular and Wi-Fi coverage. The service is free for two years after activation, and is currently available in the U.S., Canada, France, Germany, Ireland, the U.K., Belgium, Italy, the Netherlands, and select other countries.</li>\r<br />\n\r<br />\n<li><strong>Crash Detection:</strong> New for the iPhone 14 series, Crash Detection is designed to detect severe car crashes and contact emergency services via Emergency SOS if the user does not respond. The feature is enabled by default.</li>\r<br />\n\r<br />\n<li><strong>5G:</strong> While the iPhone 11 Pro is limited to LTE, the iPhone 12 and newer support 5G for faster cellular data speeds, where available.</li>\r<br />\n\r<br />\n<li><strong>MagSafe:</strong> iPhone 12 and newer models feature MagSafe, a system that lets you magnetically attach accessories to the back of the iPhone, such as Apple's own MagSafe Charger, MagSafe Wallet, and MagSafe Battery Pack.</li>\r<br />\n\r<br />\n<li><strong>Increased storage:</strong> iPhone 11 Pro started with 64GB of storage, but the 15 Pro should have at least 128GB of base storage.</li>\r<br />\n\r<br />\n<li><strong>LiDAR Scanner:</strong> Introduced on the iPhone 12 Pro, the LiDAR Scanner is situated next to the rear camera and offers faster augmented reality experiences and improves autofocus by 6x in low-light photos and videos, according to Apple.</li>\r<br />\n\r<br />\n<li><strong>Improved water resistance:</strong> Apple says the iPhone 11 Pro is water resistant up to a depth of four meters for up to 30 minutes, while the 12 Pro and newer are water resistant up to a depth of six meters for up to 30 minutes.</li></ul>Apple is expected to unveil the iPhone 15 Pro and Pro Max in September, and the devices could have additional features that have yet to be rumored.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/29/iphone-11-pro-vs-iphone-15-pro/\">iPhone 11 Pro vs. 15 Pro: What to Expect if You've Waited to Upgrade</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-11-pro-vs-15-pro-what-to-expect-if-youve-waited-to-upgrade.2394563/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ce8ac64bbefd62ec077e6dfba1306ae8b55910ba00c2398845bb8d3bca6cb68f","category":"Apple"}