{"title":"Targeting Lung Cancer Progression: The Promise of CIMAvax-EGF as a Preventative and Therapeutic Vaccine","link":"https://www.preprints.org/manuscript/202410.1576/v1","date":1729504849000,"content":"Lung cancer is one of the deadliest cancers, leading to about 125,070 deaths in the U.S. each year. Survival rates depend on the type and spread of cancer, with localized non-small cell lung cancer (NSCLC) having a 5-year survival rate of 64%. High mortality is primarily due to late detection and the older age of patients, making surgery too risky. As a result, preventative measures like vaccines are crucial. This paper reviews the literature on CIMAvax-EGF, an EGF-based vaccine for lung cancer, evaluating its preventive potential, impact on survival in advanced NSCLC, and effect on lung cancer mortality in combination with other therapies. CIMAvax-EGF is a promising vaccine targeting the Epidermal Growth Factor (EGF), which promotes cancer cell growth. The vaccine prevents EGF from binding to its receptor by inducing anti-EGF antibodies, potentially halting cancer progression. It shows significant potential for treating advanced NSCLC, with vaccinated patients having a median overall survival of 12.43 months compared to 9.43 months in unvaccinated individuals. A Phase III trial showed that 78.8% of patients had a good antibody response (GAR), leading to longer survival. CIMAvax-EGF is well-tolerated, with mild to moderate side effects, and its efficacy is enhanced when combined with other therapies, such as immune checkpoint inhibitors. Given its ability to target cancer's underlying mechanisms and boost other treatments, CIMAvax-EGF represents a significant advancement in the fight against lung cancer. Administering this vaccine preventively and during treatment could be a major step in reducing lung cancer mortality.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ce8b6c8906a01d8be008e2eeb03136bc70b7f60fa0e0c47bc12399cf60fd0d62","category":"Interdisciplinary"}