{"title":"Upregulation of Metrnl improves diabetic kidney disease by inhibiting the TGF-β1/Smads signaling pathway: A potential therapeutic target","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309338","date":1724767200000,"content":"<p>by Lu Lin, Shulin Huang, Xin Lin, Xiaoling Liu, Xiangjin Xu, Chunmei Li, Pin Chen</p>\r\nPurpose <p>This study comprises an investigation of the role of meteorin-like (Metrnl) in an experimental model of diabetic kidney disease (DKD).</p> Methods <p>Twenty-four db/db mice were randomly assigned to one of the following groups: DKD, DKD + Metrnl<sup>-/-</sup>, and DKD + Metrnl<sup>+/+</sup>. Plasma Metrnl concentrations were measured using ELISA. Kidney tissues were examined via western blotting, qRT-PCR, and immunohistochemistry to determine the expression levels of inflammatory factors. Electron microscopy was employed to observe stained kidney sections.</p> Results <p>Compared with the NC group, FBG, BW, and UACR were elevated in the DKD and Metrnl<sup>-/-</sup> groups, with severe renal pathological injury, decreased serum Metrnl concentration, decreased renal Metrnl expression, and increased expression levels of TNF-α, TGF-β1, TGF-R1, pSmad2, pSmad3, and α-SMA. In contrast, the Metrnl<sup>+/+</sup> group showed decreased FBG and UACR, BUN, TC and TG, increased HDL-C and serum Metrnl concentration, increased renal Metrnl expression, and decreased expression of TNF-α, TGF-β1, TGF-R1, pSmad2, pSmad3, and α-SMA, compared to the DKD and Metrnl<sup>-/-</sup> groups. A Pearson bivariate correlation analysis revealed a negative correlation between UACR and Metrnl, and a positive correlation between UACR and TGF-β1.</p> Conclusion <p>Upregulation of renal Metrnl expression can improve renal injury by downregulating the expression of molecules in the TGF-β1/Smads signaling pathway in the renal tissues of type 2 diabetic mice; and by reducing the production of fibrotic molecules such as α-SMA.</p>","author":"Lu Lin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ce8b334d4bc9b2d874d302183968388333cbdc62353d110ad299c555dcaeb8a8","category":"Interdisciplinary"}