{"title":"Thermal alterations of hydro power: Modelling the effect on growth of juvenile salmonids","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4364?af=R","date":1724054323000,"content":"<h2>Abstract</h2>\n<p>Hydropower (HP) has become the most important renewable energy source worldwide during the last century. However, the impacts on aquatic ecosystems may be considerable. In the Northern Hemisphere, salmonid fishes are often affected by hydropower-related temperature alterations. As their metabolic processes are entirely dependent on water temperature, they are strongly affected when the HP development reduces the water temperature during summer by extracting water from below the thermocline of upstream reservoirs. We investigated juvenile growth of Atlantic salmon <i>Salmo salar</i> and brown trout <i>S. trutta</i> in six Norwegian rivers where hydropower has considerably reduced the water temperature during summer. We used observed mass of 1+ juveniles sampled upstream and downstream the tailrace of the hydropower plant and compared these with simulated mass of 1+ juveniles based on daily recorded water temperatures and a bioenergetics model. Establishment of reservoirs have led to reduced growth of juveniles of both species on river reaches downstream HP tailraces. The hydropower development significantly altered the temperature regimes with the downstream reaches having lower temperatures than upstream reaches. Both observed and predicted masses of 1+ juveniles of both species were also lower downstream than upstream. Predicted mass were more similar to the observed mass for Atlantic salmon than for brown trout, indicating that the bioenergetics model for brown trout is not optimal.</p>","author":"Jan Henning L'Abée‐Lund, \nHarald Sægrov, \nHelge Skoglund, \nOla Ugedal, \nLeif Asbjørn Vøllestad","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"ce95b51b311bbf5fa939f783128781fd2c1cd38fa910aded24f7db832cecaa12","category":"Environment"}