{"title":"Rigetti announces 80 qubit processor, experiments with “qutrits”","link":"https://arstechnica.com/?p=1821077","date":1639661116000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Rigetti-Aspen-M-800x533.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Rigetti-Aspen-M.png\">Enlarge</a> <span>/</span> The Aspen-M 40-qubit chip and its housing. (credit: Rigetti)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday, quantum computing startup Rigetti announced a number of interesting hardware developments. To begin with, its users now have access to its next-generation chip, called Aspen-11, which provides 40 qubits and improved performance. While that's well below the qubit count <a href=\"https://arstechnica.com/science/2021/11/ibm-clears-the-100-qubit-mark-with-its-new-processor/\">achieved by IBM</a>, the company has hinted at a way it can stay competitive: private testers will now have access to an 80 qubit version achieved by linking two of these chips together.</p>\n<p>Separately, the company says that it is now experimenting with allowing testers to access a third energy state in its superconducting hardware, converting its qubits into \"qutrits.\" If these qutrits show consistent behavior, they will allow for the manipulation of significantly more data in existing hardware.</p>\n<h2>New and improved</h2>\n<p>For traditional processors, advances are typically measured in clock speed, core count, and energy use. For quantum computers, one of the most critical measures is error rate, since the qubits lose track of their state in a way that digital hardware doesn't. With Aspen-11, Rigetti is claiming that a specific type of error—the readout of the state of the qubit—has been cut in half.</p></div><p><a href=\"https://arstechnica.com/?p=1821077#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821077&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ce9e00a8ecd6aff8a6ea7412d36f48c1f2b93cf7b31d35f5c16d540374e71eb6","category":"Tech"}