{"title":"Amazon’s Astro robot is straight out of The Jetsons","link":"https://arstechnica.com/?p=1799102","date":1632855527000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Astro-moving-around-home-980x735.jpg\" /></div>\n        <p>\n          Astro can help monitor the home.                       [credit:\n                        Amazon                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Amazon is rolling out (literally) a robot that can help monitor your home. Powered by Amazon Alexa and a bunch of artificial intelligence (AI) technology while patrolling about on a set of wheels, the <a href=\"https://amzn.to/39JBCge\" target=\"_blank\">Astro robot</a> can handle numerous tasks, from providing a view of inside the home when you’re out to delivering a message to Mom.</p>\n<p>The robot carries the same name as the dog from <i>The Jetsons,</i> but its simple face, rolling mechanism and, of course, advanced tech, make it much more similar to <a href=\"https://thejetsons.fandom.com/wiki/Rosey\">Rosey</a>. Amazon's Astro relies on AI, sensors, computer vision, and voice and edge computing to perform various workloads.</p>\n<p>For example, Astro can roll around your home and give you a live view of what it sees. That means you can check on your pet, look out for intruders, or make sure you turned the oven off. Astro is mobile thanks to a technology Amazon has dubbed <a href=\"https://www.amazon.science/blog/astros-intelligent-motion-brings-state-of-the-art-navigation-to-the-home\" target=\"_blank\">Intelligent Motion</a>. It uses simultaneous location and mapping (SLAM) to ensure Astro makes its way around without crashing into stuff—even if someone forgot something on the floor that wasn’t there before.</p></div><p><a href=\"https://arstechnica.com/?p=1799102#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799102&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ce9ff1e0c45b0302121c895d31adefd48d51b2bd91da1714cb148dfec7e754b5","category":"Tech"}