{"title":"Correlations of Multidrug Resistance in Acinetobacter baumannii and Klebsiella pneumoniae with Long-Term Aminoglycoside Consumption and Resistance Data","link":"https://www.preprints.org/manuscript/202407.1013/v1","date":1720781373000,"content":"Multidrug resistant bacteria pose a significant threat to global health, particularly in healthcare settings. This study aimed to explore the potential of aminoglycoside consumption and resistance data to correlate with multidrug resistance in Acinetobacter baumannii and Klebsiella pneumoniae. Data on aminoglycoside consumption and antibiotic resistance indices (ARI) were collected from 2010 to 2023. Descriptive statistics and Pearson correlation analyzes were performed to examine both immediate and delayed (one-year delay) correlations between aminoglycoside use (amikacin, tobramycin, gentamicin) and resistance patterns. The results indicated that the consumption of amikacin was consistently high and correlated with resistance in both bacterial species. Tobramycin and gentamicin showed variable resistance patterns, with negative correlations in some cases. Delayed effect analysis revealed that amikacin and tobramycin consumption had a slight delayed positive impact on multidrug resistance in A. baumannii, while gentamicin use was associated with a delayed reduction in resistance. In K. pneumoniae, gentamicin showed a strong delayed positive correlation with multidrug resistance, while amikacin and tobramycin had weaker associations. These findings highlight the complex and species-specific relationships between aminoglycoside consumption and resistance development, emphasizing the need for customized antibiotic management strategies that account for the immediate and delayed effects of antibiotic use.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cea04a04128ef5ac76720396874f3d711d30de7d52152a5cd0dcee255730c571","category":"Interdisciplinary"}