{"title":"Filippo Ganna: Inner Speed","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/filippo-ganna-inner-speed","date":1628094646000,"content":"\n      <p><span>Filippo Ganna is a newly crowned Olympic Champion, part of the Italian Team Pursuit squad who stormed to an emphatic victory in Tokyo's Izu Velodrome. He was crucial in their win, with his monstrous turn edging his team ahead of the Danish riders who eventually took the silver medal.</span></p>\n<p><span>Gold in the Olympics is just another result to add to the list of this Italian superstar's ever-growing palmares. He's a won six stages of the Giro and is a four-time world champion in the individual pursuit. Perhaps most impressive was his victory in the ITT at the 2020 Road World Championships, finishing ahead of the likes of Wout van Aert, Stefan Kung and Geraint Thomas.</span></p>\n<p><span>But where has he come from? What's been behind his meteoric rise to the top? And, perhaps most importantly, what does the future hold? </span><span>Editor of <a href=\"https://www.rouleur.it/pages/abbonati\">Rouleur Italia</a>, Emilio Previtali sat down with the Italian gentle giant earlier this year and found out.</span></p>\n<div></div>\n<h4><strong>6.20pm, March 19 2021</strong></h4>\n<p><span>Today is a Friday that feels like a Saturday. It’s the eve of the 112th Milan-Sanremo and I’m sat in front of my computer screen, waiting to start a video interview with Filippo Ganna. Our time together will be slightly limited but journalists from all over the world want to interview the Italian rider of the moment. He is the reigning world champion in two different disciplines, the time-trial and the individual pursuit, and races for Ineos Grenadiers, the top cycling team out there. So fair enough, it makes sense that there’s a bit of a queue.</span></p>\n<p><span>Our interview is eleven minutes away. I check my internet connection, microphone and camera for the umpteenth time. I have to admit, I’m feeling a bit nervous.</span></p>\n<p><span>The last time I interviewed Ganna was in the summer of 2018 before the Italian national time-trial championships in Cavour, a town close to Turin. He didn’t win that race, finishing runner-up by a mere two seconds to Gianni Moscon, who would become his team-mate at Sky the following season. Back then, Filippo raced for UAE-Team Emirates and organising a meet-up was as easy as a couple of phone calls and turning up at his hotel at the agreed time.</span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1232766392_1024x1024.jpg?v=1628081186\" /><em>Image: Getty</em></p>\n<p>The first point of contact had been Filippo himself; I got his mobile number from a mutual friend and he asked me to call. I don’t know if you’ve ever just rung up a world champion; I felt a bit awestruck but soon realised that deep down he was a nice, easygoing 22-year-old catapulted into the spotlight by his track pursuit triumphs. </p>\n<p><span>We sorted out the details – teams don’t like riders speaking directly to journalists – and then went through the press officer. It feels like an age has passed since that day; in reality, it’s only been two and a half years. Or, to put it another way, in Filippo’s terms, three rainbow jerseys (two on the track and one on the road against the clock in Imola) and two days in the </span><i><span>maglia rosa </span></i><span>at the 2020 Giro d’Italia.</span></p>\n<p><span>That afternoon in Cavour, we spent hours after lunch chatting in the hotel lobby. He told me about the Gran Premio della Liberazione 2011, a race he won as a 14-year-old which stayed with him. “Matteo Peppino and I were away; he didn’t give me a turn and was on the limit. I tried to use my speed and steal a few centimetres on him out of every corner. I took half a metre, a metre, ten. Then he was dropped and gone.”</span></p>\n<p><span>Ganna went on to hold off the bunch by himself, finishing 1-35 ahead of Mattia Viel, who is now a pro with Androni </span><span>Giocattoli</span><span>. He won a host of races like that as a teenager, but that one was special. “Those are memories I’ll hold for my whole life. In my room at home, I never had posters of riders or idols of mine on the walls, just two photos: a blown-up one of my girlfriend and a little framed one taken by a friend of mine from that race.  </span></p>\n<p><span>“However,” he adds, “with the pros, it’s a different kettle of fish entirely. It doesn’t work like that anymore.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/G.Facciotti-col_1024x1024.jpg?v=1628081252\" /></span><em><span>Image: Gabriele Facciotti</span></em></p>\n<p><span><span>After our chat, I jumped into the team car to follow and photograph him during a recon of the next day’s route. It wasn’t easy to pass Ganna in full flight on the narrow, kiwi</span><span>fruit</span><span>-growing Piedmont roads. When I think back to that afternoon, the nausea from the constant corners, accelerations and braking returns to the pit of my stomach. We almost ended up in a ditch more than once. I don’t think Filippo noticed; he pedalled, motionless and focused, in a tucked aerodynamic position. </span></span></p>\n<h4><strong>The interview</strong></h4>\n<p><span><span>Right on the dot of </span>18:30, the <span>camera turns on.</span></span></p>\n<p>“Ciao Filippo!”</p>\n<p><span>“Ciao.”</span><span><br /></span><span></span></p>\n<p><span>Filippo Ganna has a very deep voice. He sits in a hotel room armchair</span><span> and tells me straight away that his directeur sportif Dario Cioni is there with him, even if he is not in the frame. I picture him nearby, observing our chat. Behind Filippo, it looks like there is a big bookcase full of tomes, but no, it’s an art installation hanging on the wall. Their accommodation in Milan must be fancy. </span><span>His camera is positioned on what I assume is a low living room table, so the image I get of Filippo, taken from below, is that of a giant. </span><span>And at 193 centimetres tall and tipping the scales at 82kg, Ganna really is a giant. I feel miniscule in comparison; more than miniscule, in fact, like a microbe. I know that it’s his umpteenth interview of the day, making me the last thing standing between him and dinner with his team-mates before the season’s first Monument. </span></p>\n<p><span>I break the ice with a question intended to carry on where we left off in 2018. What has changed since joining a new team? “The jersey and squad name. And the contract,” he says, with a laugh. I return it, a little nervously. Filippo, as we say in Italy, is </span><i><span>più realista del re </span></i><span>[more Catholic than the Pope] – that’s to say, his answers are never hostile, but rather extremely linear. He gives no room for speculation or imagination. For example, during our previous interview, I asked him if his father was a cyclist. “He’s not,” he replied. “He does a few rides every so often with an old bike I gave him but more than anything, he loves walking our dogs. As a young man, he was a </span><span>canoeist</span><span>.” He completely neglected to mention that Marco Ganna was international level and represented Italy at the 1984 Olympics in Los Angeles.</span></p>\n<p><span>“At Ineos, I changed my training methods, my position, my bike. There’s more attention to detail here and I’ve lost weight and become more muscular. I’ve managed to win the World Championships with that work but I’m still Filippo, the same person I was before,” he says. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032575-027_1024x1024.jpg?v=1628081346\" /><em><span>Image: </span>Cor Vos/SWpix.com</em></span></p>\n<p><span>His responses always have the same pattern. First, a more instinctive answer, aimed at downplaying things, then a second take where he goes deeper. It’s as if two different people are responding: a carefree and cheerful kid going on first instincts then a more adjusted one, committed to making himself understood.</span></p>\n<p><span>I ask about his track racing. “I like it a lot and the Olympic team pursuit is the main goal of the year,” the 24-year-old says. “I’m not bothered that there’s no individual pursuit there, it’s one less thing to worry about and prepare for.”</span></p>\n<p><span>That’s a nod to his admirers, of whom there are many, who want him to be racing and winning everywhere: track, pursuit, team pursuit, TT, cobbled Classics. Last summer, after his splendid victory on a Giro d’Italia road stage to Camigliatello Silano, there was even talk in the newspapers about his chances of becoming a Grand Tour challenger. “If I listened to what everyone said, I’d be taking part in every race,” he says.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/collections/rouleur-magazine/products/issue-103-speed?variant=39543338434727\">Related: Issue 104, Speed – buy a single issue</a></em></strong></p>\n<p><span>That victory at the Calabrian ski resort came in his distinctive manner, dropping his breakaway rivals one by one: “I came from winning Worlds and from the very first stages in the maglia rosa, I was in great condition. I had </span><i><span>carte blanche</span></i><span> from the team and I went for it. That was important; something in my mind clicked and I realised that I could also win road races, not just time-trials. I became more aware of what I could do.”</span></p>\n<p><span>Part of this self-knowledge is down to the precious work of his team and its directeur sportifs, particularly Dario Cioni. “When people talk about my time-trials or individual pursuits, it always sounds like I’m racing alone. In reality, it’s very different; it’s a team effort and everyone plays their part. I am at ease in this team, I feel like they believe in me and we work on projects methodically.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032612-100_1024x1024.jpg?v=1628081408\" /><em>Image: Cor Vos/SWpix.com</em></span></p>\n<p><span>Is wearing the rainbow jersey of world champion added pressure? “Why should it be?” he replies sharply. I sense a need to protect himself and escape the pressure imposed by certain questions and journalists: the Italian tifosi and press have great expectations for him, probably excessive ones. I try to reassure him that I was just curious as someone who has never been world champion at anything. And, as expected, the second part of his reply is more settled</span><b>, </b><span>meeting me in the middle.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/breaking-60-mission-possible\">Related: Is a 60km hour record possible?</a></em></strong></p>\n<p><span>“In 2017, when I finished second at the pursuit World Championships in Hong Kong [the last time he didn’t win them], I realised that I had to let go of external tension and expectations. I had gotten into a mental state that wasn’t good for me, that I didn’t like. You can’t win every race. Everyone has their own idea of what I should do on the bike, but ultimately, it’s always Filippo turning the pedals.” The sudden change to third-person is probably symptomatic of this need to distance himself from the hopes of other people</span><span>.</span></p>\n<p><span>Filippo’s progress over the years can be measured not just in races won, but in cold, hard time. The track doesn’t lie: between 2016 and 2020, his 4km individual pursuit times went from 4-16.141 to his 2020 world record in Berlin of 4-01.934, a six per cent improvement. “When I race, it feels like I’m cutting like a knife through the air,” he says. “My Pinarello feels attached to the track and goes like it’s on rails.”</span></p>\n<p><span>Ganna’s immense power and aerodynamic position will be two indispensable elements for a bid on one of cycling’s great records, the Hour. There’s been talk of an attempt for some time; I’m almost afraid of broaching the topic, given that Filippo has often dodged the topic in previous interviews. However, this time, he’s the one who unexpectedly brings it up, anticipating my question.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5899_1024x1024.jpg?v=1628081515\" /><em><span>Image:</span> Alex Broadway/SWpix.com</em></span></p>\n<p><span>“I’m interested in doing an Hour Record at sea level, without asterisks,” Ganna says. “Fausto Pinarello said that he will make a bike especially for me, as he’s done for many other great champions in cycling history.” Indurain, Wiggins, but also Ullrich and Viviani, have all raced on innovative and revolutionary models from the Treviso maker. Filippo was a guest at their HQ recently, seeing some of those models firsthand. “Beating the record of Victor Campenaerts means going over 55km/h at sea level, which isn’t as easy as many say it will be. The Hour record is a project that requires precise preparation and time, but Ineos loves these kind of challenges.” Cases in point are the 1:59 Challenge, where Eliud Kipchoge broke a hallowed marathon barrier for the first time, or Ineos Team UK challenging for America’s Cup sailing success.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related: WorldTour men's calendar 2021</a></em></strong></p>\n<p><span>Ineos seem particularly attracted to the type of event that goes beyond pure competition into the realms of innovation and the exploration of human limits. Ganna knows he’ll be discovering his own hidden depths.</span> <span>“If I think of the power I needed to hold to win the Worlds time-trial, a race of only 35 minutes, I can’t imagine the amount of suffering endured in an hour,” he says.</span></p>\n<p><span>Ineos Grenadiers seems to be the ideal team for his development. “To do his best, Pippo needs to be calm and in a serene environment,” his father Marco told the </span><i><span>Corriere della Sera</span></i><span>. “He works well with Ineos and Dario Cioni whose methods resemble those of Marco Villa, the Italian track head coach. They never raise their voice with him, letting him grow in peace and work towards goals without overdoing it.”</span></p>\n<p><span>Meanwhile, his surprise first time-trial loss in eight races at Tirreno-Adriatico, finishing behind Wout Van Aert and Stefan Küng, seems to not have affected him much. “What can we do about it?” he asks, using the plural. “Should I feel guilty because I lost? I’m human, sometimes you win and sometimes you lose.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_2657_cc7dac05-2e98-4430-b63f-d3742198ed35_1024x1024.jpg?v=1628081685\" /><em><span>Image: Getty</span></em></span></p>\n<p><span>It’s almost dinner time; our interview is heading inexorably towards its conclusion. Something inside him has switched. I notice a certain restlessness; his body is turned more towards the sofa. His hands rest on his knees, as if ready to get up. “Dario is going to dinner with the others,” he says. I see his eyes follow the directeur sportif and imagine Cioni walking towards the door. Time to wrap it up.</span></p>\n<p><span>I choose </span><span>not to enquire about</span><span> his expectations for the next day’s race, Milan-Sanremo, which is particularly hard to win for a rider like him. You can’t take “La Classicissima” purely by brute strength, it also requires an absolute knowledge of one’s self and abilities. Fabian Cancellara, to whom Ganna is often compared, managed to do it in 2008, with an irresistible attack two kilometres from the finish. To succeed, Ganna would probably have to get up and over the Poggio in a small group. We say goodbye, I thank him for giving me his time on such an important eve and head for my own dinner.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1308129404_1024x1024.jpg?v=1628081762\" /></span><em><span>Image: Getty</span></em></p>\n<p><span>The next day, the entire Milan-Sanremo is broadcast live on Italian television for the first time; more than seven hours of uninterrupted coverage. But as we all know, the real spectacle is those fraught final kilometres. After stalemate on the Cipressa, the bunch is all together and it is Filippo Ganna who hits the front on the approach of the Poggio, his power forcing the peloton into single file. The pace is scorching. I sit up on the sofa and get ready for the grand finale. </span></p>\n<p><span>At this point, it’s clear that Filippo is working for the team, not aiming for personal glory. There will be no striving to get over the Poggio with the best. It’s a bit disappointing to see but exactly what I anticipated – if Milan-Sanremo is your big objective, you don’t spend the previous afternoon patiently giving interviews that you could easily have done days earlier. Filippo pulled at a crazy speed before swinging off halfway up the Poggio and victory went to Jasper Stuyven.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/aggression-the-changing-ways-of-team-ineos\">Related: Aggression: the changing ways of Team Ineos</a></em></strong></p>\n<p><span>If you think about the characteristics of the winners and the race’s dynamic, to be in the mix, a challenger needs explosive legs to make the cut on the last climb, daredevil descending abilities and a </span><i><span>finisseur’s</span></i><span> punch to anticipate a sprint to the line. Milan-Sanremo is a race of knowledge, courage and experience which rewards total belief in one’s own capabilities. These are qualities built patiently over time. In that light, if Ineos Grenadiers care about the gradual development of Filippo Ganna, and they seem to, there is a reason for not aiming for victory this year – and for skipping Paris-Roubaix too, a race he already won once as an under-23 rider that seems tailor-made for him.</span></p>\n<p><span>The day after Milan-Sanremo, following some controversial statements in the Italian press about that tactical choice, which some found incomprehensible – the idea of </span><i><span>using </span></i><span>Filippo in service of his own team-mates, God forbid – a puzzled Ganna responds to the critics. “For the last three days after Tirreno-Adriatico, I had a bit of flu. The tactical choices at Milan-Sanremo were a consequence of that,” he wrote on social media. “So, please let’s not all play at being directeur sportifs in a game of ifs and buts.” Italy is a country where conspiracy theories and hindsight rule, populated by 60 million team managers or high-level coaches.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-video-debrief-with-simon-gerrans\">Related: Simon Gerrans on Milan San Remo 2021 – video debrief</a></em></strong></p>\n<p><span>When we’re used to seeing him more distant and silent, Filippo Ganna personally intervening to say what he thinks about a race is a bit of a novelty. While there’s no doubt about his strong character, time and the group of advisors around him are helping him to become more mature and aware too. His mind seems to be getting as powerful as his legs, heart and lungs. If this is the case and Ineos Grenadiers are in tune with Filippo, working to create a racer fully aware of his abilities, the next few years will be </span><span>great</span><span> fun. Get ready to enjoy the Ganna show, not just in the time-trials.</span></p>\n<p><em><span>This article first appeared in both Rouleur Italia and Rouleur Issue 103, Speed, available for purchase <a href=\"https://www.rouleur.cc/collections/rouleur-magazine\">here</a></span></em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cea3d077ca443ec427492b44ae6411408e6a9b236bb721ff382dcf9b0eae578d","category":"Cycling"}