{"title":"Fruit Harvest Helper: A Cross-Platform Mobile Application For Fruit Yield Estimation","link":"https://www.preprints.org/manuscript/202404.0412/v1","date":1712314086000,"content":"The Fruit Harvest Helper, a mobile application developed by Northwest Nazarene University’s (NNU) Robotics Vision Lab, aims to assist farmers in estimating fruit yield for apple orchards. Currently, farmers manually estimate the fruit yield for an orchard, which is a laborious task. Fruit Harvest Helper seeks to simplify their process. While prior research efforts at NNU concentrated on developing an iOS app for blossom detection, this current research aims to adapt that smart farming application for apple detection across multiple platforms, iOS and Android. The old and new applications were designed with an intuitive user interface that is easy for farmers to use, allowing for quick image selection and processing. Unlike before, the adapted app utilizes a color ratio-based image segmentation algorithm implemented in OpenCV C++ to detect apples in apple tree images selected for processing. The results of testing the algorithm with a dataset of images indicate an 8.52% Mean Absolute Percentage Error (MAPE) and a Pearson correlation coefficient of 0.6 between detected and actual apples on the trees. These findings were obtained by evaluating the images from both the east and west sides of the trees, which was the best method to reduce the error of this algorithm. Although the Fruit Harvest Helper shows promise, there are many opportunities for improvement. These opportunities include exploring alternative machine-learning approaches for apple detection, conducting real-world testing without any human assistance, and expanding the app to detect various types of fruit. The Fruit Harvest Helper mobile application is among the many mobile applications contributing to precision agriculture, nearing readiness for farmers to use in yield monitoring and farm management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cea71f5b5be01ec8a44501d11624ce889018c7ca83a8cca1dc46ea2220f1cb8c","category":"Interdisciplinary"}