{"title":"iPhone 13 Pro Max Dummy Model Depicts Smaller Notch","link":"https://www.macrumors.com/2021/05/04/iphone-13-pro-max-dummy-model/","date":1620158934000,"content":"Apple's <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> models are expected to feature a slimmed down notch, marking the first major change to the TrueDepth camera system since it was introduced in the 2017 <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> X.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nWe're still months away from the launch of the ‌iPhone 13‌, but Lewis Hilsenteger of Unbox Therapy managed to get an ‌iPhone 13‌ Pro Max dummy model that represents what we can expect from the new 2021 device.\r\n<br />\r\n\r\n<br />\r\nDummy models often come out ahead of when new ‌iPhone‌ models launch to give case makers an idea of what to expect, and while this one is available earlier than usual, it seems to match up with rumors that we've heard so far.\r\n<br />\r\n\r\n<br />\r\nThe dummy model is a Pro Max, so it features a fake 6.7-inch display, and it has a realistic design that's higher quality than most mockups. The 13 Pro Max dummy model looks similar to the 12 Pro Max when it comes to design, but there is a notable change to the notch.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/iphone-13-pro-max-dummy-notch.jpg\" />\r\n<br />\r\nIn line with rumors, the notch is slimmed down and less wide, with the four components of the TrueDepth Camera System located more closely to one another. The speaker has been relocated above the TrueDepth camera system rather than in the middle, which is the main reason why the notch is smaller.\r\n<br />\r\n\r\n<br />\r\nThere are three camera lenses that are larger than the camera lenses in the current <a href=\"https://www.macrumors.com/roundup/iphone-12-pro/\">iPhone 12 Pro Max</a>, perhaps due to the rumored inclusion of sensor-shift optical image stabilization for the Ultra Wide lens, which will join the same sensor-shift stabilization that was added to the Wide lens in 2020.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/dummy-model-camera.jpg\" /><em><div>Dummy model on right, ‌iPhone 12 Pro Max‌ on left</div></em>\r\n<br />\r\nThe camera bump is bigger to accommodate the larger lenses, and the lenses themselves are flush with each camera protrusion, a slight tweak from what we saw in the ‌iPhone 12 Pro Max‌ where lenses stick out a bit from each camera module.\r\n<br />\r\n\r\n<br />\r\nThere are no changes to the location of the volume and mute buttons or the power button, and there's a clear Lightning port. There were some early rumors that at least one ‌iPhone 13‌ model could have a portless design, but later information suggested that would not happen.\r\n<br />\r\n\r\n<br />\r\nThe dummy model appears to be a bit thicker than the ‌iPhone 12 Pro Max‌, but the difference is minimal. Depending on the accuracy of the dummy model, the ‌iPhone 13‌ Pro Max may be just slightly narrower.\r\n<br />\r\n\r\n<br />\r\nFor more on what to expect in the ‌iPhone 13‌, we have a <a href=\"https://www.macrumors.com/roundup/iphone-13/\">dedicated iPhone 13 roundup</a> that aggregates everything we know about the new iPhones to date.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/04/iphone-13-pro-max-dummy-model/\">iPhone 13 Pro Max Dummy Model Depicts Smaller Notch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-13-pro-max-dummy-model-depicts-smaller-notch.2294824/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JGs6KwtX0TQ:oO1VXCGAnQM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JGs6KwtX0TQ:oO1VXCGAnQM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/JGs6KwtX0TQ\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ceafcd5bc35df3692b38936b8c928bc7cc9b8c78ece8698c64e30eb86c63cf60","category":"Apple"}