{"title":"<i>In vivo</i> vitamin D target genes interconnect key signaling pathways of innate immunity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306426","date":1721743200000,"content":"<p>by Julia Jaroslawska, Ranjini Ghosh Dastidar, Carsten Carlberg</p>\r\n\r\nThe vitamin D<sub>3</sub> metabolite 1,25-dihydroxyvitamin D<sub>3</sub> (1,25(OH)<sub>2</sub>D<sub>3</sub>), its nuclear receptor VDR (vitamin D receptor) and hundreds of their target genes are not only key regulators of calcium homeostasis, but also important modulators of the immune system. Innate immune cells like monocytes use VDR for efficient differentiation and are very responsive to vitamin D. So far, most information on the gene regulatory function of vitamin D and its physiological impact had been obtained from <i>in vitro</i> studies using supraphysiological doses of 1,25(OH)<sub>2</sub>D<sub>3</sub>. Therefore, medical experiments like the study VitDHiD (NCT03537027), where 25 healthy individuals were supplemented once with a vitamin D<sub>3</sub> bolus (80,000 IU), provide important insight into the response to vitamin D under <i>in vivo</i> conditions. In this study, we inspected 452 <i>in vivo</i> vitamin D target genes from peripheral blood mononuclear cells (PBMCs) detected in VitDHiD and found 61 of them involved in eight major KEGG (Kyoto Encyclopedia of Genes and Genomes) pathways of innate immunity. Under <i>in vivo</i> conditions in healthy individuals vitamin D either silences five pathways of innate immunity, stabilizes two and increases one, so that acute inflammation is suppressed and the release of cytokines is kept under control. A ranking of the 61 target genes by inducibility, basal expression and multiple involvements in the pathways highlighted the genes <i>NFKBIA</i> (NFκB inhibitor alpha), <i>NFKBIZ</i>, <i>FOSL2</i> (FOS like 2, AP1 transcription factor subunit), <i>JDP2</i> (Jun dimerization protein 2), <i>PIK3R1</i> (phosphoinositide-3-kinase regulatory subunit 1), <i>CLEC7A</i> (C-type lectin domain containing 7A), <i>DUSP6</i> (dual specificity phosphatase 6), <i>NCF2</i> (neutrophil cytosolic factor 2), <i>PLCB1</i> (phospholipase C beta 1), <i>PLCG2</i> and <i>TNFAIP3</i> (TNF alpha induced protein 3). In conclusion, vitamin D’s <i>in vivo</i> effect on innate immunity in healthy adults is mediated by the interconnection of the pathways of neutrophil extracellular trap formation, Toll-like receptor, chemokine and phagosome signaling, NOD-like receptor, C-type lectin receptor, apoptosis and interleukin 17 through a limited set of proteins encoded by key target genes.","author":"Julia Jaroslawska","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ceca158dddefc025e517aade2e13d85a65ea9ddd09eb61db4e28d282b2260d2d","category":"Interdisciplinary"}