{"title":"Apple Vision Pro Testers Share Impressions: 'By Far the Best Headset'","link":"https://www.macrumors.com/2023/06/06/apple-vision-pro-first-impressions/","date":1686064777000,"content":"Apple on Monday <a href=\"https://www.macrumors.com/2023/06/05/apple-reveals-vision-pro-headset/\">unveiled the Vision Pro</a>, its long-awaited AR/VR headset. While the headset is not launching until early next year, some media outlets and YouTubers received a 30-minute guided demo of the device and shared their first impressions. The testers were not allowed to take photos or videos of the demo experience.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-at-Steve-Jobs-Theater.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn a <a href=\"https://twitter.com/JoannaStern/status/1665880555127439360\">tweet</a>, tech columnist Joanna Stern described the Vision Pro as \"by far the best headset out there.\" In a <a href=\"https://www.wsj.com/articles/apple-vision-pro-i-tried-the-new-mixed-reality-headset-f49a8811\">report for <em>The Wall Street Journal</em></a>, she elaborated that \"the interface and hand gestures are intuitive, 3-D movies are finally making sense and a huge dinosaur felt like it really broke through a wall right in front of me.\"\r<br />\n\r<br />\nStern did point out some negative aspects, including the headset feeling heavy and making her feel a bit nauseous when switching between virtual reality and augmented reality modes. And while the Vision Pro has some innovative features to reduce feelings of isolation, such as showing the wearer's eyes through the front glass, Stern said it will still be a challenge for Apple to convince customers to wear the device.\r<br />\n\r<br />\nIn a video, well-known tech YouTuber Marques Brownlee said the Vision Pro has some features that are \"the best I have ever seen in any VR headset, by a mile,\" including eye tracking and hand tracking. These advanced technologies do not come cheap, of course, as the Vision Pro will be priced at a staggering $3,499. Brownlee also pointed out that the headset lacks haptic feedback since it does not have controllers.\r<br />\n\r<br />\n<div></div>\r<br />\n<a href=\"https://techcrunch.com/2023/06/05/first-impressions-yes-apple-vision-pro-works-and-yes-its-good/\"><em>TechCrunch</em>'s Matthew Panzarino said</a> Apple has \"delivered nothing less than a genuine leapfrog in capability and execution\" with the Vision Pro.\r<br />\n\r<br />\n\"Every bit of this thing shows Apple-level ambition,\" said Panzarino. \"I don't know whether it will be the 'next computing mode,' but you can see the conviction behind each of the choices made here. No corners cut. Full-tilt engineering on display.\"\r<br />\n\r<br />\n<em>MacRumors</em> is in attendance at WWDC and will be publishing our own first impressions of the Vision Pro soon. In the meantime, check out our <a href=\"https://www.macrumors.com/2023/06/05/apple-vision-pro-in-person/\">first in-person look at the headset</a>. For more details about the Vision Pro and its visionOS operating system, check out <a href=\"https://www.macrumors.com/2023/06/05/apple-reveals-vision-pro-headset/\">our coverage of Apple's announcement</a> from Monday.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/06/apple-vision-pro-first-impressions/\">Apple Vision Pro Testers Share Impressions: 'By Far the Best Headset'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-testers-share-impressions-by-far-the-best-headset.2391906/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cece48b338b3bb886ae55bac08e56ce0de601989e24b5d84fa3c902494d6eec1","category":"Apple"}