{"title":"Unlocking hot trub's potential: a simple method for extracting bitter acids and xanthohumol","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13371?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Hot trub is a macronutrient- and micronutrient-rich by-product generated in the brewing industry, which is still underrated as a raw material for reprocessing purposes. In this context, this study aimed to investigate the extraction of bitter acids' and xanthohumol from hot trub as well as identify the significance of parameters for the process. The research assessed various extraction parameters, such as pH, ethanol concentration, temperature, and solid-to-liquid ratio, using a Plackett–Burman design.</p>\n<h2>RESULTS</h2>\n<p>Ethanol concentration and pH were the most significant parameters affecting extraction yield. β-acids were found to be the principal components of the bitter acids, with a maximum concentration near 16 mg g<sup>−1</sup>, followed by iso-α-acids and α-acids achieving 6 and 3.6 mg g<sup>−1</sup>, respectively. The highest yields of bitter acids were observed in the highest ethanol concentration, while pH was relevant to extraction process in treatments with low ethanol ratios. Concerning the xanthohumol extraction, the approach achieved maximum concentration (239 μg g<sup>−1</sup>) in treatments with ethanol concentration above 30%. Despite their variances, the phytochemicals exhibited comparable extraction patterns, indicating similar interactions with macromolecules. Moreover, the characterization of the solid residues demonstrated that the extraction process did not bring about any alterations to the chemical and total protein profiles.</p>\n<h2>CONCLUSION</h2>\n<p>Ethanol concentration was found to have the most significant impact on the extraction of bitter acids and xanthohumol, while temperature had no significant effect. The solid remains resulting from the extraction showed potential for use as a protein source. © 2024 Society of Chemical Industry.</p>","author":"Klycia Fidélis Cerqueira e Silva, \nGabriela Feltre, \nFlávia S. Zandonadi, \nRenata Santos Rabelo, \nAlessandra Sussulini, \nMiriam Dupas Hubinger","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"cecf0854e46089a05ee03a8d4b1dc0ffb1cd6fdc25b0906b7d80eb89520d5254","category":"Environment"}