{"title":"'I still just love riding my bike' - Question time with Mathieu van der Poel","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mathieu-van-der-poel-question-time","date":1691151693000,"content":"\n      <p><a href=\"https://www.rouleur.cc/pages/subscribe\"><em>This article was originally published in Issue 117 of Rouleur magazine</em></a></p>\n<p>Mathieu van der Poel has an impressive palmarès, including victories in the Tour of Flanders (twice), Strade Bianche, Paris-Roubaix, and the Amstel Gold Race. His trademark attacks are nearly impossible to match, making him one of the most formidable riders. Earlier this year, he displayed his prowess by defeating Wout van Aert in the Cyclocross World Championships in Hoogerheide. Now, he is in Glasgow, seeking another rainbow jersey to add to his collection in the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">2023 men's elite road race</a>.</p>\n<p><span>At the beginning of this season, Mathieu van der Poel shared his thoughts with <em>Rouleur</em> about what keeps him motivated, his life beyond racing, and his kit collection. </span></p>\n<div></div>\n<p><strong>Who was your biggest inspiration growing up?</strong></p>\n<p>I think like with a lot of kids, my dad inspired me at the beginning because he was also a cyclist, of course. He came to the races with me and he trained with me, so that was my example back then. </p>\n<p><strong>You have always competed in multiple cycling disciplines, but which is your favourite?</strong></p>\n<p>If we’re just talking about enjoying myself, it would be mountain biking. The training is really fun because you can reach some beautiful places, have some really nice descents and enjoy yourself on the bike. I also like racing, but it’s really hard from start to finish in the race so it’s difficult to enjoy it.</p>\n<p><strong>What is your earliest memory of riding a bike? </strong></p>\n<p>I don’t know; I was on a bike so young I don’t have one memory that comes to mind. I was six years old when I did my first race, so I’ve been going for a long time.</p>\n<p><strong>What is your go-to breakfast before a training ride?</strong></p>\n<p>I eat porridge nine times out of ten in the morning. Sometimes my girlfriend makes baked oats with chocolate or something which makes it a bit nicer. But actually I really like eating porridge and it fills me up for the day.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/cy22-pr-js-01-0061.jpg?v=1691146458\" alt /><strong>Do you have any hidden talents?</strong></p>\n<p>I don’t think so; I focus on my main talent of riding my bike. Maybe I’ll discover something.</p>\n<p><strong>Not golf?</strong></p>\n<p>Not so far. I’ve struggled with golf, actually. </p>\n<p><strong>If you could change one thing about the sport, what would it be?</strong></p>\n<p>Safety, for sure. Cycling is not the safest sport out there, it’s difficult because there’s more road furniture now and we need to race on the roads, so it’s a hard combination sometimes.</p>\n<p><strong>What motivates you to keep training and racing?</strong></p>\n<p>I still just love riding my bike. For me, that’s the most important thing. I still love to go out with friends and teammates and train and have fun on the bike. As long as I keep doing that, the results will follow.</p>\n<p><strong>What’s your favourite piece of kit?</strong></p>\n<p>I’m not a big fan of collecting lots of kit – I only keep my World Championship jerseys. But I’m always happy when I get new shoes. I like clean, white shoes. They get muddy and dirty, which isn’t too bad, but if you rub your shoe against someone in a race and it gets a burn mark on it, it’s quite sh*t when they’re new.</p>\n<p><strong>Is there anything you still want to improve, either on or off the bike?</strong></p>\n<p>I think sometimes I have to be a bit more professional with certain things. But I don’t really see that as a negative because it keeps me balanced. I still enjoy everything I do and I don’t want to feel like I’m sacrificing everything outside of cycling to stay in shape.</p>\n<p><strong>What’s one piece of advice you would give to a young person who wants to become a professional cyclist? </strong></p>\n<p>I suppose it’s a cliché, but to enjoy what you’re doing. Cycling is a sport where you need to spend a lot of time on the bike. If you don’t enjoy it, it’s impossible to become, or stay, professional. I think that is sometimes underestimated, but it’s really important.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ced60f8e1b3b6a704f1f584b35ee854e76df7c527b13c938a7c24bebd62224a4","category":"Cycling"}