{"title":"Future iPhones could use satellite communications for emergencies","link":"https://www.macworld.com/article/354402/iphone-13-low-earth-satellite-connectivity.html","date":1630367188000,"content":"<div>\n<section><div></div></section><p><strong>Update 4:30 p.m. PT: </strong><em><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-08-30/apple-plans-to-add-satellite-features-to-iphones-for-emergencies&amp;xcust=1-1-354402-1-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman at Bloomberg</a> has more detail on this supposed future capability, which is more limited in scope than previously reported.</em></p>\n\n\n\n<p>With the iPhone 13 release getting closer and closer, speculation is heating up about the features of the new phone. The latest comes from analyst Ming-Chi Kuo, who states in an investor’s note that the iPhone 13 could have <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/08/29/iphone-13-to-feature-leo-to-make-calls-and-text/&amp;xcust=1-1-354402-1-0-0&amp;sref=https://www.macworld.com/feed\">low earth orbit satellite connectivity</a>, which would allow users to make phone calls when cellular coverage is unavailable.</p>\n\n\n\n<p>According to Kuo (who has a record of reliable reports), the iPhone 13 will be equipped with a custom Qualcomm X60 modem that works with low earth satellites. Kuo also says that Qualcomm has been working with Globalstar to use the company’s satellite communications service. </p>\n\n\n\n<p>However, it’s unclear as to how the user can get access to a satellite service. Kuo explains one “scenario” in which the user’s network operator has a partnership with Globalstar, and connecting to the satellites would be done through the carrier. Also, in this scenario, the user doesn’t have to sign up for another phone plan.</p>\n\n\n\n<p>If the satellite feature comes to fruition, the iPhone 13 will be the first consumer-level phone with it. According to Kuo, other companies will be using Qualcomm’s X65 modem to implement low earth orbit satellite connectivity. </p>\n\n\n\n<p>While it’s an interesting feature, however, it’s unlikely to be one most consumers are going to use. And that if it’s accurate. A Twitter thread by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/saschasegan/status/1432156620331667456&amp;xcust=1-1-354402-1-0-0&amp;sref=https://www.macworld.com/feed\">Sascha Segan of PCMag</a> explains how Kuo might have his information wrong due to the intricacies of Globalstar and its networks. He surmises that the new band in the modem could be ground-based LTE rather than satellites. </p>\n\n\n\n<figure><div>\n<blockquote><p>OKAY. I think I may have gotten to the bottom of this \"iPhone 13 will include satellite connectivity\" rumor, and it could be \"iPhone Math\" levels of game-of-telephone. The key: Globalstar.</p>— Sascha Segan (@saschasegan) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/saschasegan/status/1432156620331667456?ref_src=twsrc%5Etfw&amp;xcust=1-1-354402-1-0-0&amp;sref=https://www.macworld.com/feed\">August 30, 2021</a></blockquote></div></figure><p>Later, Mark Gurman of Bloomberg cites “a person with knowledge of the situation” in <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-08-30/apple-plans-to-add-satellite-features-to-iphones-for-emergencies&amp;xcust=1-1-354402-1-0-0&amp;sref=https://www.macworld.com/feed\">a report that clarifies the situation</a>. Apple is apparently working to enable limited satellite communications for emergency situations. Users would not be able to make phone calls, or even send regular full text messages, but would instead get a new third class of “grey bubble” text in Messages that are shorter in length. Another tool could allow users to report major catastrophes like plane crashes or sinking ships.</p>\n\n\n\n<p>While these could be done without a cell network, it will be no substitution for cell service in any way. The messaging features are severely limited in a way that makes them practical only in emergencies, and it could take up to a minute to connect to a satellite. Both features are reliant on satellite coverage and local regulations. Gurman’s report says Apple is still working on the potential new feature and it won’t be ready until at least next year.</p>\n\n\n\n<p>We’ll know the truth about the iPhone 13 very soon. Check out our <a href=\"https://www.macworld.com/article/234814/2021-iphone-13-rumors-specs-price-release.html\">iPhone 13 rumors page</a> for more on what we could see in the new phone, which we expect to launch within the next two to three weeks.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cee08faad2be3da97926053b27db027f0479f24a3e0f86242180f033a456db2a","category":"Apple"}