{"title":"PSLBII-18 Transcriptomic comparison of embryonic tissues between high and low fertility sired pregnancies","link":"https://academic.oup.com/jas/article/102/Supplement_3/675/7757509?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Pregnancy loss is considered one of the main causes of reproductive inefficiency in the beef cattle industry. The objective was to determine the differentially expressed genes (DEGs) between the conceptus and uterus of pregnancies produced by sires of known fertility. We hypothesized that the paternal genome would have a significant effect on transcript abundance between these tissues. The sires used have been previously reported to have significantly different levels of field fertility; however, they had passed all normal quality control standards for frozen thawed semen. <span>Bos indicus</span> heifers (n = 45) were subjected to estrus synchronization and embryo transfer with IVP embryos from either a High Fertility (HF) or a Low Fertility sire (LF), pregnancies were confirmed at slaughter. Samples were collected from the trophectoderm (TE) and caruncle (CAR) on d 25 and 36 of gestation for transcriptome analysis. Total RNA was isolated from tissue samples using the RNeasy kit (QIAGEN; Hilden, Germany) per manufacturer’s instructions. Sequencing was conducted using an Illumina platform. Sequences were aligned to the reference genome ARS-UCD1.2. DEGs between sires and tissue were determined using edge-R package from R. False discovery rate was 0.1. On d 25, out of 15,755 genes expressed in the trophectoderm, 19 genes were downregulated, and 9 genes were upregulated in the LF. In the CAR, 9 genes were downregulated and 7 were upregulated. On d 36, in the TE the LF resulted in 53 downregulated genes and 20 upregulated genes. In CAR there were 18 downregulated genes for the LF whereas 22 genes were upregulated. Gene ontology analysis reported DEGs in the LF compared with the HF were associated with immunology and reproduction. Of particular interest BoLA NC-1</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ceee969f08eb069df79a78f8dd8ceb7f67db9386d002cf48c6d2e44b8a591208","category":"Environment"}