{"title":"Suunto Race In-Depth Review: The Best Suunto Yet?","link":"https://www.dcrainmaker.com/2023/11/suunto-race-amoled-in-depth-review.html","date":1699539198000,"content":"<p><span>﻿</span></p>\n<p>Look, I’ll spoil it upfront (headline included): The Suunto Race is easily the best watch Suunto has ever made. It’s not even close. Of course, that doesn’t mean it’s perfect. For those details, you’ve got nearly 10,000 more words to go through. But what Suunto has done is seemingly turn the page from the pivot point of the <a href=\"https://www.dcrainmaker.com/2023/05/suunto-vertical-gps-review.html\">Suunto Vertical this past spring</a>, to a watch that’s more aligned with display preferences going forward, all while adding boatloads of new features at a price of merely $449.</p>\n<p>And it’d be easy to dismiss this as just an “AMOLED Suunto Vertical”, because in some ways, that’s true. But behind that brilliant new display is a ton of new features, a new user interface, better app integration, and a watch that’s priced so aggressively I had initially presumed they wrote the price down wrong.</p>\n<p>The watch has been on my wrist now for more than a month, including a 60KM/12hr hike two weeks ago, as well as a bit of time this past summer in the Alps on a long adventure. In doing so I’ve got a pretty good idea of where it works well, and where it stumbles (and sometimes falls off the metaphorical cliff).</p>\n<p>Finally, note that Suunto provided a media loaner Suunto Race watch to test. As usual, I’ll get that back to them here shortly. I’ll go out and pick up my own to continue testing the new features once they arrive. If you found this review useful, you can use the links at the bottom, or consider <a href=\"https://www.dcrainmaker.com/support\">becoming a DCR Supporter</a>, which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s talk newness.</p>\n<h3><span><strong>What’s New:</strong></span></h3>\n<p><img title=\"P1100152.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100152.jpg\" alt=\"P1100152\" width=\"720\" height=\"480\" /></p>\n<p>Ok, let’s take a look at what’s new/different about the Suunto Race. In this case, I’m largely comparing it to the Suunto Vertical, albeit that’s sorta more like a sibling. That unit is also getting all of the software-focused features here too. Either way, this helps differentiate a bit when it comes to the hardware pieces.</p>\n<p>So, here’s what’s on the Suunto Race:</p>\n<p>– New 1.43” AMOLED touch screen, 466x466px at 1,000 nits<br />\n– GPS battery lifetime starting at 40hrs in multiband/dual-frequency (and up to 120 hours in ‘Tour’ mode).<br />\n– Standby/smartwatch battery life of 12 days in gesture-based display mode, or 7 days in always-on display mode<br />\n– Adds digital crown<br />\n– Adds new nightly HRV tracking, as well as HRV trending features<br />\n– Adds Suunto Coach integration with aforementioned HRV tracking (will give guidance inclusive of HRV changes)<br />\n– Adds workout planner to the watch itself (plus mobile app and TrainingPeaks)<br />\n– Adds Training widget/watch face with TSB/CTL/HRV<br />\n– Adds new daily companion, new daily widgets, new mini widgets<br />\n– Adds sleep stages shown on-watch<br />\n– Adds ability to do multiple alarms (e.g., wake-up alarms)<br />\n– Adds ‘Find my Phone’ functionality<br />\n– Adds ‘Stand-up’ reminder<br />\n– Adds ‘Progress’ running race estimates &amp; HR run threshold<br />\n– Adds new sport mode…umm…Rope Skipping<br />\n– Adds customization of the widgets<br />\n– Adds do-not-disturb mode<br />\n– Improved music control touch controls (for controlling phone music)<br />\n– First Suunto watch using fully in-house algorithms, transitioned away from FirstBeat algorithms<br />\n– Retains existing snorkeling depth gauge features, with existing 100m rating<br />\n– 22mm industry standard strap (silicon strap included in the box)<br />\n– Retains/has military durability specifications<br />\n– Two model options: Titanium ($549/EUR) or Stainless steel ($449/EUR)<br />\n– Titanium has 32GB of storage, and stainless steel has 16GB.<br />\n– Sapphire crystal display on both models<br />\n– Weight comes in at a claimed 69g for titanium, and 84g for stainless steel</p>\n<p>Now, in addition to all the above built-in features, there’s also the newly released Suunto-developed slate of a dozen+ app functions, back in September. While most other companies have built these features into the watch natively, Suunto still has these technically as apps that run optionally on the watch. Thus normally, for other companies, I’d probably include them in this list, and it’d be a heck of a lot longer list. But alas, since they aren’t part of the native watch firmware (yet), I’ll refer you to that dedicated <a href=\"https://www.dcrainmaker.com/2023/09/suunto-releases-suuntoplus-apps.html\">post from back then</a>. But this does include components like nutrition reminders, race companion apps, waypoint apps, altitude profile apps, race elevation apps, and more.</p>\n<p>Also, in case you’re wondering, existing Suunto customers will get most of these updates, <a href=\"https://www.dcrainmaker.com/2023/10/suunto-race-hands-on-everything.html#feature-upgrade-chart\">per this chart here</a>.</p>\n<h3><span><strong>In the Box:</strong></span></h3>\n<p><img title=\"SuuntoRaceBox.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBox.jpg\" alt=\"SuuntoRaceBox\" width=\"720\" height=\"480\" /></p>\n<p>The Suunto Race comes in a rather tall box, as seen above, and here, below. Admittedly, it is a very pretty box.</p>\n<p><img title=\"SuuntoRaceBoxOpened.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxOpened.jpg\" alt=\"SuuntoRaceBoxOpened\" width=\"720\" height=\"480\" /></p>\n<p>But, as I said in my initial preview, it’s a huge waste of space. The vast majority of this tall skyscraper of a box is empty, with the watch contents (manual/charging cable) only taking up about half the space at best. Thus, my criticism here is for a company that’s focused so much on sustainability in their messaging, this isn’t that. On the bright side, slice off the bottom of the mountain, nobody notices, and it still looks really cool.</p>\n<p><img title=\"SuuntoRaceBoxOpenedUpContents.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxOpenedUpContents.jpg\" alt=\"SuuntoRaceBoxOpenedUpContents\" width=\"720\" height=\"480\" /></p>\n<p>In any case, below are your box components. They include the magnet charging cable (albeit, still USB-C), the watch, the straps/bands, and some paper stuff.</p>\n<p><img title=\"SuuntoRaceBoxContentsComponents.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents.jpg\" alt=\"SuuntoRaceBoxContentsComponents\" width=\"720\" height=\"480\" /></p>\n<p>Here’s a closer look at each of those:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceBoxContentsComponents-1-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceChargingCable-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceStockBand-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/SuuntoRaceWatchpod-125x83.jpg 125w\" /></a>\n\n<p>From a sizing standpoint, here’s how things compare to the Polar Vantage V3 and Garmin Forerunner 965, which are its main competitors:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9145.jpg\" /></p>\n<p>And here’s the thickness of them. In the case of the Suunto Race, it doesn’t lie-flat as well because the lugs point downward, which would normally curve around your wrist. The actual watch pod portion is basically the same thickness as the others.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9146.jpg\" /></p>\n<p>Alternatively, here’s a set including the Suunto Vertical and the Garmin Epix Pro:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/P1100045_thumb.jpg\" /></p>\n<p>And the side shot:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/P1100047_thumb.jpg\" /></p>\n<p>Note, for the majority of this review I swapped to the red bands, versus the stock/included black band. More on those in the next section.</p>\n<h3><strong>The Basics:</strong></h3>\n<p><img title=\"P1100237.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100237.jpg\" alt=\"P1100237\" width=\"720\" height=\"480\" /></p>\n<p>In this section I’ll focus on the day-to-day usage of the watch from a usability, widgets, activity/sleep tracking standpoint, as well as other non-sports focused areas. In the next sections I’ll cover sports/training features, then navigation/mapping features.</p>\n<p>To begin, the Suunto Race becomes Suunto’s first watch to introduce a Digital Crown within the button layout. This allows you to navigate up/down lists, as well as zoom in/out on maps. This is in addition to the two other buttons above/below it, and the touchscreen itself.</p>\n<p><img title=\"DSC_9193.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9193.jpg\" alt=\"DSC 9193\" width=\"720\" height=\"480\" /></p>\n<p>From a usability standpoint, the Digital Crown works fine, though, those that know my reviews over the years know that I don’t really find the Digital Crown great (on any watch, Apple included) for anything except zooming in/out on maps. In general, I find digital crowns finicky to use, especially during sport activities, compared to just pressing buttons. But, that’s mostly a personal preference.</p>\n<p>Meanwhile, the 1,000 nit AMOLED screen is brilliant to see, both in bright sunny conditions and darker conditions. I think we’re finally rounding the point where people stop thinking AMOLED screens are hard to see in bright sunny conditions (they aren’t, and haven’t been for a couple years). Here’s an example in Hawaii in the lava fields, without any issues seeing it:</p>\n<p><img title=\"IMG_6971 2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_6971-2.png\" alt=\"IMG 6971 2\" width=\"720\" height=\"540\" /></p>\n<p>In the case of the Suunto Race, as with most AMOLED displays, there are essentially two modes: Always-on, or Gesture-based. Always-on means the screen is always-on, but will dim when you put your wrist down. Whereas Gesture-based means that the screen turns off entirely when you put your wrist down. This is obviously done to save battery, with Suunto saying that in gesture-based mode they’ll get about 12 days of battery life, versus always-on about 7 days of battery life. Both of these claims seem about right to me in my testing, but of course that varies a ton on how much GPS-time you have for workouts/etc.</p>\n<p>In addition, Suunto also has another secondary option to be aware of within the display settings under ‘Raise to Wake’. There are two options: ‘Display Only’, or ‘Full Wake Mode’. In the lesser ‘Display Only’ mode, you’ll just get the time displayed on the screen when you raise your wrist, whereas ‘Full Wake Mode’ gives you the full watch face. If in the Display Only mode, you’d have to tap the screen/buttons to get to the watch face. I didn’t personally like that experience, so I went with the ‘Full Wake Mode’ instead.</p>\n<p><img title=\"DSC_9194.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9194.jpg\" alt=\"DSC 9194\" width=\"720\" height=\"480\" /></p>\n<p>Now with that background, in the grand scheme of things on the entire watch, I really only have two complaints about the Suunto Race. The first complaint area, is just how slow the menus are. I know they got faster – they really did (which, shows you just how horrific it was before). But it’s still slow. And in particular, two operations are noticeably slow/painful:</p>\n<p><strong>1) Raise to wake:</strong> To get the watch face to display it takes about 2.0-2.5 seconds, consistently, every single time. That’s forever in watch-wake times. Garmin and Polar are both just under a second (about 0.8-0.9s), and Apple tends to be even faster. It often takes years for companies to get their raise-to-wake algorithms nailed, so I’m not sure we’re gonna see a fast turnaround on this one, but it’s super noticeable. <em>[Update: Suunto says they’ve got a firmware update on Monday, which is aimed at reducing this lag a bit. It may not solve it entirely, but is seen as a first step.]</em></p>\n<p><strong>2) Anything in the menus:</strong> Anytime you want to iterate down the widgets to open up something, it takes forever, and things are slow to enumerate/render. Take for example wanting to open up your training stress balance (TSB) or heart rate variability (HRV) pages. You need to scroll down a bunch, where each of the items you’re scrolling past will half-enumerate, taking forever, same goes for opening up a sport mode.</p>\n<p>And look, in the grand scheme of life, this isn’t a big deal. And once in a workout, it’s perfectly fine. But dismissing the slowness or pretending it doesn’t exist doesn’t help anyone. It exists, and it sucks (and I show it in the video if you want to see it, within the ‘Basics’ section). Please Suunto, focus on it, and fix it.</p>\n<p>Ok, moving along, here’s the watch face, which is lightly customizable. In the default configuration, it shows various training stats along the bottom including HRV (Heart Rate Variability), TSB (Training Stress Balance), CTL (Chronic Training Load), and of course – steps. Fun fact: If you look at the watch face close enough, you’ll notice they slightly shift the watch-face details/metrics around all day to prevent burn-in, each minute the time changes. Just stick it on a table and watch where the digits go when it changes the time.</p>\n<p><img title=\"P1100189.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100189.jpg\" alt=\"P1100189\" width=\"720\" height=\"480\" /></p>\n<p>Now, there is a small known bug here with the stats displayed at the bottom not updating correctly sometimes from the app. Suunto says there’s already a fix in the next firmware update. Thus, I’ll see inconsistencies between the app and the device. Additionally, Suunto could add a bit more polish here on the HRV graph. That graph doesn’t correctly align the HRV value to the right point in each range. It always just sticks it in the middle. This is somewhat funny because in the Morning Report, it does correctly put it on the rightish portion of the scale (though, I’d argue that’s also not really aligned correctly either). Speaking of which, here’s the morning report, which shows up each morning when you wake up (or shortly thereafter):</p>\n<p><strong><img title=\"DSC_8931.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8931.jpg\" alt=\"DSC 8931\" width=\"355\" height=\"237\" /> <img title=\"DSC_8933.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8933-1.jpg\" alt=\"DSC 8933\" width=\"355\" height=\"237\" /></strong></p>\n<p>In any case, speaking of that report, each morning when you wake-up you’ll get a morning report of your sleep details from last night. This is something Suunto has had for a year or two, but is now improved with the Suunto Race in that the screen will stay there for at least an hour or so, until you dismiss it. Previously, it’d disappear the moment you rubbed your eyes open, meaning you virtually never saw it.</p>\n<p>One of the new stats you’ll see on that morning report is Heart Rate Variability, or HRV. This is Suunto’s first watch to start tracking that, and it monitors your HRV values throughout your sleep, and shows you the average. In comparing Suunto’s values to that of Garmin, Polar, Whoop, and Oura, all of them have been within +/- 2ms for the entire time, each time. Thus, the differences tended to come more from how each unit classified awake-time within that. You’ll see HRV status in a variety of places, but most notably in the ‘Recovery HRV’ widget down below in the widgets roll. Here this shows your current HRV ranges (which take 14 nights of initial sleep data to first populate), followed by where you currently stand. Note below the 49ms in the gauge being correctly positioned at the bottom of this edge green zone, versus on the watch face view, it’s centered in the green zone.</p>\n<p><img title=\"P1100215.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100215.jpg\" alt=\"P1100215\" width=\"355\" height=\"237\" /><img title=\"P1100216.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100216.jpg\" alt=\"P1100216\" width=\"355\" height=\"237\" /></p>\n<p>In this case, because it’s primarily looking at a 7-day rolling average (as it should), my recovery values are lower, due to both poor sleep duration the prior night, as well as too much fun with wine the nights before. Win some, lose some. Here’s an example of the HRV Recovery center text from a day or two prior:</p>\n<p><img title=\"P1100164.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100164.jpg\" alt=\"P1100164\" width=\"720\" height=\"480\" /></p>\n<p>Now, this is just one of the various widgets that you’ll see when you scroll down from the watch face. Other widgets include the stopwatch, notifications, heart rate, resources (basically your energy for the day), sleep, sunrise/sunset, and more. Here’s an example of the sleep one, first at the high level, then showing the sleep details for last night and the previous 7 nights. You’ll notice it now includes sleep phase/stage charts, which previously it didn’t show on-watch.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/P1100209-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100209-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/P1100209-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/P1100209-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/P1100209-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/P1100209-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/P1100209-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/P1100209-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/P1100209-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/P1100209-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/P1100212-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100212-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/P1100212-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/P1100212-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/P1100212-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/P1100212-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/P1100212-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/P1100212-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/P1100212-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/P1100212-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/P1100213-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100213-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/P1100213-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/P1100213-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/P1100213-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/P1100213-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/P1100213-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/P1100213-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/P1100213-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/P1100213-125x83.jpg 125w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/P1100214-scaled.jpg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100214-200x132.jpg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/P1100214-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/11/P1100214-720x480.jpg 720w, https://media.dcrainmaker.com/images/2023/11/P1100214-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/11/P1100214-1536x1024.jpg 1536w, https://media.dcrainmaker.com/images/2023/11/P1100214-2048x1365.jpg 2048w, https://media.dcrainmaker.com/images/2023/11/P1100214-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/11/P1100214-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/11/P1100214-125x83.jpg 125w\" /></a>\n\n<p>In terms of the accuracy of sleep data, I’ve found the times I went to sleep/woke-up spot-on, and it’s handled brief early-morning wake-ups (e.g., a kid coming in at 5AM, then me going back to sleep), properly. This is an area that Suunto has struggled on in the past, but appears resolved here (for me at least). As for sleep stages/phase accuracy, it’s not an area I judge, because the comparative tools to try and do that simply aren’t that accurate – only in the 80% range (and we’d never judge heart rate accuracy on something only 80% accurate). Thus, I just take the general position that most of the sleep stage/phase data is iffy at best from all companies.</p>\n<p>Also note that it does properly track naps now, and has done so for me over the last month or so.</p>\n<p>Now, all of these stats are visible in the Suunto App on your phone. You can see it first at the high-level for everything in the last 7 days, and then if you open up that day you see a bit of a ‘feed’ for your day, showing your sleep, activity, workout, etc stats:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8319.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8319-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8319-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8319-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8319-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8319-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8319-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8320-2.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8320-2-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8321-2.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8321-2-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8322-2.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8322-2-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8323.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8323-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8323-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8323-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8323-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8323-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8323-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8324-2.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8324-2-278x185.png 278w\" /></a>\n\n<p>And these stats are also available for training volume/etc too – but more on that later.</p>\n<p>When it comes to things like smartphone notifications, they’ll show up on the watch too, albeit they are pretty basic text ones. There isn’t any way to reply (which on iOS isn’t permitted by Apple anyway), nor show photos (also not permitted by Apple for 3rd parties on iOS). And the lack of displaying any emojis in messages seems a bit dated for 2023. But you can dismiss the messages and see the basics of the text. In the below case, that square should have been a smiley face.</p>\n<p><img title=\"Suunto-RaceNotifications.png\" src=\"https://media.dcrainmaker.com/images/2023/11/Suunto-RaceNotifications.png\" alt=\"Suunto RaceNotifications\" width=\"640\" height=\"480\" /></p>\n<p>On the bright side, they do include a flashlight, via the screen. And with the Suunto Race, you can also create a hotkey to this, as well as it’ll stay on (when the Suunto Vertical first launched, it quickly turned off automatically, but they updated that in a firmware a few months later). The next thing I’d like to see them do is allow you to change the brightness level (which is currently bright AF), perhaps using the Digital Crown (and then saving the last brightness level state).</p>\n<p><img title=\"SuuntoRaceFlashlight.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceFlashlight.png\" alt=\"SuuntoRaceFlashlight\" width=\"640\" height=\"480\" /></p>\n<p>Lastly, it should be noted the bands are swappable. It comes with a 22mm standard band attachment, so you can easily swap it out for other Suunto Bands, or a Hello Kitty Band on Amazon. Your choice. In my case, I’ve been using the red accessory band, because obviously red is best. But by default it comes with a more boring black one.</p>\n<p><img title=\"DSC_9198.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9198.jpg\" alt=\"DSC 9198\" width=\"720\" height=\"480\" /></p>\n<p>The bands are pretty comfortable, so all is well there. And of course, given they’re designed for sport-usage, let’s shift into the next category.</p>\n<h3><span><strong>Sports Usage:</strong></span></h3>\n<p><img title=\"SuuntoRaceSportsModes.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoRaceSportsModes.jpg\" alt=\"SuuntoRaceSportsModes\" width=\"720\" height=\"480\" /></p>\n<p>Invariably, if you’re buying a Suunto watch, it’s likely for workout purposes. The Suunto Race has a metric boatload of sports modes built-in, all of which offer varying levels of sport-specific data and customization of things like data fields. In general, Suunto sport modes tend to be more about calorie burn and categorization of your activities, rather than having unique data metrics for each and every sport type. Obviously, the big-name sport types like running/swimming/cycling have unique per-sport metrics, but when you get to some of the less-popular ones, it’s more about general data fields.</p>\n<p>However, Suunto does have a few exceptions to that, notably around the snorkeling modes, which can be used down to 10m in depth. Suunto has included a depth gauge in the product, and it’ll track those shallow dives/depth details. But more on that later in the review.</p>\n<p>To begin, you’ll tap the upper right button to open up the most recently used sport mode, or you can rotate the Digital Crown to see the list of sport modes (sorted by most recently used):</p>\n<p><img title=\"DSC_9205.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9205.jpg\" alt=\"DSC 9205\" width=\"720\" height=\"480\" /></p>\n<p>Once you tap a sport mode, you’ll be brought to this page here, which shows GPS status, sensor connectivity status, battery life estimates, and more.</p>\n<p><img title=\"DSC_9206.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9206.jpg\" alt=\"DSC 9206\" width=\"720\" height=\"480\" /></p>\n<p>From here you can change your battery mode (which can offer longer battery life, but usually at the reduction of some other feature or data update rate), as well as add things like a route. You’ll also see the ability to choose the map style (light or dark), and most notably, SuuntoPlus Apps. SuuntoPlus apps are both Suunto-developed and 3rd party apps that you can load onto the watch. This comes in two basic flavors: Apps and Guides. Apps are all-encompassing, while Guides tend to be for things like structured workouts.</p>\n<p><img title=\"DSC_9207.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9207-1.jpg\" alt=\"DSC 9207\" width=\"720\" height=\"480\" /></p>\n<p>With the Suunto Race, Suunto is starting to pre-load certain Suunto Apps tied to certain sport profiles. For example, a tennis-focused app developed by Suunto when you launch the Tennis sport profile.</p>\n<p><img title=\"DSC_9208.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9208-1.jpg\" alt=\"DSC 9208\" width=\"350\" height=\"233\" /> <img title=\"DSC_9209.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9209.jpg\" alt=\"DSC 9209\" width=\"350\" height=\"233\" /></p>\n<p>Check out my <a href=\"https://www.dcrainmaker.com/2023/09/suunto-releases-suuntoplus-apps.html\">most recent post on the dozen+ new SuuntoPlus Apps</a> that Suunto just released for a feel of those. But there’s boatloads of them, and they do a good job extending the functionality of the watch.</p>\n<p>That said, as I’ve complained for years, Suunto is also using them as a bit of a crutch. Many of these SuuntoPlus Apps that are developed by Suunto should really be built-in features of the watch. And the reason that matters, is that you can only add in 2 apps per sport profile at a time, or 1 app and 1 guide (they do at least remember them each time now). Thus while Suunto as a company has many of the sport features Garmin does, you can’t actually use many of them concurrently together, because of the limits Suunto has in place – thus making it much less useful.</p>\n<p>Suunto really needs to pick at least a few of these per quarter, and ‘upgrade’ them to built-in features. Undoubtedly they have the data on which ones are most popular (especially over longer periods of time), so this shouldn’t be a big ask.</p>\n<p>That said, Suunto did build-in a structured workout builder into their app, making it easy to get structured workouts on there. These still take up the slot of a ‘Suunto Guide’, but you can run them concurrently with an app, so it’s less of an annoyance there. You can create multiple steps and then send it to the watch (even to a specific date). Further, they also support TrainingPeaks structured workouts, as well as workouts from numerous other connected platforms.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8816.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8816-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8816-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8816-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8816-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8816-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8816-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8818.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8818-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8818-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8818-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8818-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8818-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8818-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8819.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8819-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8819-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8819-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8819-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8819-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8819-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8820.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8820-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8820-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8820-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8820-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8820-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8820-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8821.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8821-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8821-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8821-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8821-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8821-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8821-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8822.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8822-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8822-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8822-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8822-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8822-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8822-278x185.png 278w\" /></a>\n\n<p>In any event, as for changing your data pages/fields, you’ll do that via the Suunto App on your smartphone. You can customize these per sport profile, with variants for whether or not you’ve got a cycling power meter connected, or other sensors (and running power is built-in, so that happens automatically with no external sensors). That said, what’s rather annoying here is that you can’t edit existing (default) sport profiles. You have to start over and re-create, even if you want to change a single data field…which, is (and long has been) bizarre – resulting in duplicate sport modes.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8863.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8863-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8863-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8863-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8863-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8863-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8863-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8864.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8864-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8864-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8864-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8864-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8864-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8864-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8865.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8865-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8865-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8865-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8865-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8865-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8865-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8866.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8866-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8866-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8866-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8866-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8866-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8866-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8867.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8867-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8867-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8867-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8867-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8867-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8867-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8868.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8868-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8868-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8868-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8868-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8868-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8868-278x185.png 278w\" /></a>\n\n<p>Finally, before we start actually running, we’ve gotta talk about sensors/accessories. The Suunto Race can connect to Bluetooth Smart sensors including heart rate sensors, cycling power meters, cycling cadence/speed sensors, and running footpads. However, it will only connect to a single sensor of each type, it cannot save more than one sensor type. Further, it doesn’t even show you the name of the sensor it connected to (it will at least show you the power meter crank length option though, if applicable).</p>\n<p><img title=\"DSC_9210.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9210.jpg\" alt=\"DSC 9210\" width=\"355\" height=\"237\" /> <img title=\"DSC_9212.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9212.jpg\" alt=\"DSC 9212\" width=\"355\" height=\"237\" /></p>\n<p>Look, I’ve said it before, and I’ll say it again – this just isn’t good enough in 2023. It wasn’t good enough in 2018 either. Or even 2012. Every other watch supports saving multiple sensors of the same type, which is particularly important for cyclists. Especially those cyclists with home trainers or indoor bikes that want to connect to those, else, you’re constantly having to re-pair sensors (without ever knowing if you’ve paired to your bike, or perhaps your buddy’s bike). Suunto really needs to have this be a focus area for the winter, ahead of next season. I’m not sure why this can keeps getting kicked down the road.</p>\n<p>Likewise, Suunto also doesn’t have any broadcast heart rate feature, to transmit the optical HR sensor to apps like Zwift, Peloton, etc… Again, in 2023, with many people using that function for indoor training, it seems like an obvious gap. Then again, I suppose given the accuracy of the Suunto Race optical HR sensor, maybe it’s not such a big loss. So yeah, let’s just focus on fixing the sensor pairing thing for now.</p>\n<p>Ok, with everything all set, let’s get this workout underway. If it were a run outdoors, you’d see the GPS status is connected. Whereas if it were an indoor bike with a power meter, you’d see the cycling power icon illuminated:</p>\n<p><img title=\"DSC_9213.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9213.jpg\" alt=\"DSC 9213\" width=\"720\" height=\"480\" /></p>\n<p>Once you’ve pressed go, it’ll start recording data as expected, showing your screens per your configuration. Here’s a quick gallery of some of the data pages from a recent run, showing how they look with actual data on them.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8630-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8630-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8630-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8630-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8630-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8630-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8630-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8632-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8632-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8632-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8632-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8632-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8632-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8632-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8633-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8633-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8633-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8633-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8633-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8633-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8633-278x185.jpeg 278w\" /></a>\n\n<p>During all my workouts, everything has been as I expected. No crashes, and pace was stable while running when I was stable, and reacted fast during intervals. I was happy with everything there. You can use the lap button to mark laps manually, or automatically. Likewise, you can pause the workout if needed.</p>\n<p>Once done, you’ll save the workout and see a complete summary of your workout data. Here’s that from a run as well:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8682-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8682-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8682-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8682-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8682-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8682-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8682-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8683-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8683-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8683-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8683-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8683-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8683-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8683-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8684-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8684-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8684-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8684-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8684-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8684-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8684-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8685-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8685-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8685-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8685-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8685-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8685-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8685-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8686-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8686-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8686-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8686-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8686-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8686-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8686-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8687-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8687-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8687-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8687-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8687-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8687-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8687-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8688-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8688-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8688-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8688-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8688-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8688-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8688-278x185.jpeg 278w\" /></a>\n\n<p>And of course all of this data is visible on the Suunto App as well. If you have connected platforms like Strava or TrainingPeaks, those will show up a few seconds later once synced to the Suunto App.</p>\n<p>In that same vein, you’ll see training load and recovery stats within the watch, as well as app platform. On the watch itself, you’ll see the TrainingPeaks metrics of TSB (Training Stress Balance), TSS (Training Stress Score), and CTL (Chronic Training Load), down in the widgets.</p>\n<p><img title=\"P1100217.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100217-2.jpg\" alt=\"P1100217\" width=\"350\" height=\"233\" /><img title=\"P1100218.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100218.jpg\" alt=\"P1100218\" width=\"350\" height=\"233\" /></p>\n<p>All of these stats are easily accessed from the watch:</p>\n<p><img title=\"P1100221.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100221.jpg\" alt=\"P1100221\" width=\"350\" height=\"233\" /> <img title=\"P1100223.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100223.jpg\" alt=\"P1100223\" width=\"350\" height=\"233\" /></p>\n<p>It’ll also include brief notes as well on where load sits:</p>\n<p><img title=\"P1100222.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100222.jpg\" alt=\"P1100222\" width=\"350\" height=\"233\" /><img title=\"P1100219.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100219.jpg\" alt=\"P1100219\" width=\"350\" height=\"233\" /></p>\n<p>But these are also shown on the Suunto App, on the main homepage, and you can dig into them in more depth if you want to here too.</p>\n<p><img title=\"IMG_8317.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8317.png\" alt=\"IMG 8317\" width=\"235\" height=\"509\" /><img title=\"IMG_8318.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8318.png\" alt=\"IMG 8318\" width=\"235\" height=\"509\" /><img title=\"IMG_8333 2.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8333-2.png\" alt=\"IMG 8333 2\" width=\"235\" height=\"509\" /></p>\n<p>It’s kinda cool that Suunto has licensed these from TrainingPeaks, so that in theory they should match your TrainingPeaks account, assuming the data you have matches what’s in your TP account.</p>\n<p>Oh, before we go underwater, just a brief mention of at-water level swimming, specifically pool swimming. I did mostly open water swimming with the watch, but did do a few pool sessions. Looking at one of them, the unit correctly counted every lap but one, where it incorrectly added a single length. Interesting, the Polar Vantage V3 also stumbled at the exact same time, albeit undershooting a length. There was nothing notable about that particular moment, except being the end of a set. The <a href=\"https://www.dcrainmaker.com/2023/11/headcoach-analysis-feature.html\">FORM Swim goggles</a> on that swim correctly hit every length.</p>\n<p><img title=\"DCRainamkerSuuntoSwim.png\" src=\"https://media.dcrainmaker.com/images/2023/11/DCRainamkerSuuntoSwim.png\" alt=\"DCRainamkerSuuntoSwim\" width=\"720\" height=\"405\" /></p>\n<p>In terms of other strokes, I can barely do freestyle just halfway correctly, so I really only judge that. I mean, I suppose I’m good at the doggie paddle, but that doesn’t appear to be a stroke type tracked by Suunto. Missed opportunities, I guess. Post-swim you’ll see that swim data on the Suunto app as well – though, you can see some random butterfly in here. There was no butterfly from me. Ever.</p>\n<p><img title=\"IMG_8833.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8833.png\" alt=\"IMG 8833\" width=\"235\" height=\"509\" /> <img title=\"IMG_8834.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8834.png\" alt=\"IMG 8834\" width=\"235\" height=\"509\" /> <img title=\"IMG_8835.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8835.png\" alt=\"IMG 8835\" width=\"235\" height=\"509\" /></p>\n<p>Finally, just a brief mention on the snorkeling and ‘mermaiding’ features. Yes, that’s a real term. Mermaiding is basically snorkeling without GPS indoors. Suunto added the depth gauge in their land-based units a few models ago, based on all their work in the dive realm with their dive computers. They noted at the time that there are generally different barometric altimeters used for above-water vs below-water (depth-gauge) activities, based on which area they specialize in. In this case, Suunto put in one that focuses on above-water activities, but can accurately capture depth to 10m or so (thus, the 10m limit).</p>\n<p>While snorkeling, it’ll capture each one of your ‘dives’, including the time/duration as well as depth. You can see this on the watch in a list format, as well as other data pages showing specifically your current depth. Apparently though, I never took a great picture of it. But here’s a not-so-great picture of it:</p>\n<p><img title=\"vlcsnap-2023-11-08-14h18m17s132.png\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-08-14h18m17s132.png\" alt=\"Vlcsnap 2023 11 08 14h18m17s132\" width=\"720\" height=\"461\" /></p>\n<p>In case you’re wondering, if you go free diving or scuba-diving with it, once you go below 10m in depth, the watch will both warn you, and then show &gt; 10m as the current depth – indicating you’re too deep:</p>\n<p><img title=\"GOPR0258.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/GOPR0258.jpg\" alt=\"GOPR0258\" width=\"720\" height=\"630\" /></p>\n<p>The watch is of course totally fine depth-wise for either of those activities, assuming you stay within the stated 100m depth range (which, you’d almost certainly do). And yes, that includes pressing buttons. There’s no issues there.</p>\n<p>After your snorkeling session, you’ll see a nifty little graph of each of your dives. You’ll also see GPS positions, but it tends to be fairly inaccurate, because it’s only going to work when you’re at the surface with your wrist above the water so it can get GPS signal (as that won’t work through water).</p>\n<p><img title=\"IMG_8840.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8840.png\" alt=\"IMG 8840\" width=\"235\" height=\"509\" /> <img title=\"IMG_8841.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8841.png\" alt=\"IMG 8841\" width=\"235\" height=\"509\" /> <img title=\"IMG_8842.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8842.png\" alt=\"IMG 8842\" width=\"235\" height=\"509\" /></p>\n<p>It’s a cool little feature. And hopefully it’s something Suunto looks to expand to full diving/freediving, akin to what Garmin has done with their Descent series (which is essentially a re-badged Fenix series watch), or to a much lesser extent, Apple. Obviously, Suunto has just as much dive experience as Garmin (and a much longer history of it). So that’d certainly be something in their wheelhouse.</p>\n<h3><span><strong>Mapping &amp; Navigation:</strong></span></h3>\n<p><img title=\"IMG_1125.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1125.png\" alt=\"IMG 1125\" width=\"720\" height=\"540\" /></p>\n<p>The Suunto Race follows in the footsteps of the Suunto Vertical, with its built-in mapping functionality. The only difference is the maps are more brilliant now, thanks to that AMOLED display. In my case, I used these maps on a variety of adventures, but most notably an ~60km/12hr hike a few weeks ago in the mountains, with some 9,000ft of elevation gain included.</p>\n<p>To begin though, the Suunto Race has either 16GB or 32GB of storage, depending on which model you choose (Titanium is 32GB, the base 16GB). Both models have WiFi though, for downloading said maps. To do that, you’ll go into the settings on the Suunto App and connect/save your WiFi networks. This is what the Suunto Race will use when connected to a charger to download maps.</p>\n<p><img title=\"IMG_8852.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8852.png\" alt=\"IMG 8852\" width=\"235\" height=\"509\" /><img title=\"IMG_8853.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8853.png\" alt=\"IMG 8853\" width=\"235\" height=\"509\" /><img title=\"IMG_8854.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8854.png\" alt=\"IMG 8854\" width=\"235\" height=\"509\" /></p>\n<p>Next, you’ll choose which maps/regions you want. Suunto’s region picker allows you to get fairly granular on the exact area you want. This is great that you can download smaller map regions if you’ve got limited connectivity right before an adventure (whereas Polar &amp; Garmin are massive multi-GB map sizes). It also means you’d have to try really darn hard to fill up the 16GB on the base model, let alone 32GB. On the downside, if you’re traveling in a foreign country, you might not know the correct/exact region name for the area(s) you’re in, since those don’t usually align to provinces or cities.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8855.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8855-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8855-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8855-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8855-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8855-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8855-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8856.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8856-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8856-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8856-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8856-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8856-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8856-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8857.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8857-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8857-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8857-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8857-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8857-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8857-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8858.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8858-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8858-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8858-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8858-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8858-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8858-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8859.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8859-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8859-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8859-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8859-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8859-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8859-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8860.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8860-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8860-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8860-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8860-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8860-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8860-278x185.png 278w\" /></a>\n\n<p>Downloading maps uses the aforementioned WiFi, once placed on the charger. You’ll see it connect to WiFi and download any maps in the queue. This is kinda nice in that if you know you’re going on a trip, you can choose a bunch of regions, then put your watch on the charger to top-up. This process doesn’t tend to be fast though, so give yourself some time.</p>\n<p>Once maps are loaded, they’ll be on your device till you delete them. Now, quickly let me just give an overview of the basic ‘levels’ of mapping/routing in devices today:</p>\n<blockquote><p><strong>Breadcrumb trail only:</strong> This is when you don’t have a background map, but just follow a little trail on a blank screen – this is what the Suunto devices had previously (exempting Suunto 7). It’s also on all Polar devices except the Suunto Race.</p>\n<p><strong>Non-routable Maps:</strong> This is when you have a map displayed behind your route, which shows terrain/trails/lakes/water/mountains/etc… Depending on the company, it may or may not show name labels too. However, this isn’t routable, so it doesn’t actually *know* if you’re on the ‘Deer Lake Trail’ – it just knows you’re on the breadcrumb track. If you stray too far from the trail, it’ll give you an off-course warning, but it cannot smartly re-route you back. It just tells you via compass how to find the trail again. This is what the Suunto Race/Vertical are, the COROS watches, and the new Polar Vantage V3.</p>\n<p><strong>Routable Maps:</strong> This is the ‘highest’ level, and is when the watch can actually route on the trails by itself, if needed. It knows you’re on Deer Lake Trail, and the next trail coming up is Big Bear Trail. And it knows if you miss that turn, whether or not you need to turn-around, or can catch-up later on. This is what most of the higher-end Garmin devices are (any devices with mapping, like the Fenix/Epix series, or higher-end Forerunners).</p></blockquote>\n<p>Now, practically speaking – I’ve routed with all three types for years, and generally speaking, you’ll get to your destination just fine. However, having maps (either routable or non-routable) is a massive boost in confidence, mostly when you need to make a decision at a fork in the trail. With breadcrumb routing and slight trail junctions, it’s often just a bit of a guess or trial/error. But with maps, you can usually see terrain features (like a stream or hill) that make it easy to confirm.</p>\n<p>With the Suunto Race, it has the non-routable maps, albeit lacks place/location labels. Still, this is more than enough in most cases. The only scenario that you really want routable is when you go off-course permanently. In that case, you want a new route, and the Suunto Race can’t do that for you. You’ll be on your own there, whereas a Garmin with routable maps can give you a new/updated route. But that happens super rarely to me.</p>\n<p>Now, let’s look at routing on my long hike adventure. First, you’ve gotta get the route created, then into the watch. In my case, I created the route in Strava Routes, and then that automatically pushed it to my Suunto App account. However, I had too many routes in my watch (as always), and had to remove some routes first. Unfortunately, Suunto syncs routes to watches the same for all watches – so basically it synced a bunch of old routes to my watch (from years ago). I’d really like to see Suunto get rid of this limitation, there’s just no need for it with 16-32GB of storage (routes take up at most, 10-100KB, thus, 1/10th of just 1 megabyte, let alone gigabyte.</p>\n<p>In any case, once synced to the watch, you’ll see it in your routes listing, where you can load it up and see some quick details about it.</p>\n<p><img title=\"IMG_1044.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1044.png\" alt=\"IMG 1044\" width=\"170\" height=\"128\" /><img title=\"IMG_1045.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1045.png\" alt=\"IMG 1045\" width=\"170\" height=\"128\" /><img title=\"IMG_1046.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1046.png\" alt=\"IMG 1046\" width=\"170\" height=\"128\" /></p>\n<p>With that set, we’ll start navigating. Here I am an hour or so down the trail, and you can see my current location (arrow), my historical track (red), and the trail up ahead (blue). All of this works quite well. The black line you see is my camera refresh rate not matching the watch (you don’t see it in real life). Suunto (and Polar to a lesser extent) need to slightly tweak their display rates so this doesn’t show up for common frame rates (something that Google, Apple, and Garmin all do).</p>\n<p><img title=\"IMG_1096.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1096.png\" alt=\"IMG 1096\" width=\"640\" height=\"480\" /></p>\n<p>The map will automatically rotate based on the orientation of the compass, and while other portions of the watch are a bit slow/laggy, this piece is spot-on quick. I show a demo of this in the video at the top as well.</p>\n<p>You can also see on the elevation page where you stand on the entire journey in terms of elevation – both how much I’ve completed, and how much is remaining.</p>\n<p><img title=\"IMG_1095.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1095.png\" alt=\"IMG 1095\" width=\"720\" height=\"540\" /></p>\n<p>That said, one feature Suunto (a company focused heavily on the mountains/outdoors) is lacking is some variant of a ClimbPro type feature found on Garmin’s watches. Suunto does have their small ‘Climb’ app, but that’s not really the same. ClimbPro is all about telling you the details of every single upcoming climb on the route, and where you stand. Whereas the SuuntoPlus Climb app is basically just a counter for the current climb (gradient/normalized graded pace/current grade/ascent rate/etc…).</p>\n<p>Instead, here’s the ‘Weather’ page, which is interestingly where your ETA shows up as well:</p>\n<p><img title=\"IMG_1098.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1098.png\" alt=\"IMG 1098\" width=\"720\" height=\"540\" /></p>\n<p>In any event, all your other data pages work just as you’ve configured them. If/when you go off-course, you’ll get a warning about that, but otherwise, it just gives you a heading bug as to which direction to go to get back on route.</p>\n<p><img title=\"IMG_1094.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1094.png\" alt=\"IMG 1094\" width=\"720\" height=\"540\" /></p>\n<p>Note that for turn-by-turn directions, you’ll need to ensure the option is toggled in the Suunto App, before transferring it to your watch. Else, you won’t get such directions:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8911-720x540.jpeg\" width=\"720\" height=\"540\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8911-720x540.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8911-200x150.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8911-1536x1152.jpeg 1536w, https://media.dcrainmaker.com/images/2023/11/IMG_8911-2048x1536.jpeg 2048w, https://media.dcrainmaker.com/images/2023/11/IMG_8911-125x94.jpeg 125w\" /></p>\n<p>Meanwhile, on the map side, you can zoom in/out using the Digital Crown, which works reasonably well in terms of usability (and as I noted earlier, is really the only area I find digital crowns useful for). However, the main downside here is that Suunto limits your zooming out in a dismally small 500m radius. It’s insanely frustrating, especially when you’re trying to figure out whether you can short-circuit a portion of a trail or such. <em>[Update: Just got notice this morning, that limitation is being increased to 2KM next Monday via firmware update.]</em></p>\n<p><img title=\"IMG_7649.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_7649.png\" alt=\"IMG 7649\" width=\"720\" height=\"540\" /></p>\n<p>Note that you can also pan the map around using your fingers, or the little map controls with the buttons. Also note that there are two different map modes, light and dark, which you can toggle if you want. Or, it’ll do it automatically when you get to sunset. There is no High Contrast map option on the Suunto Race like there is on the Suunto Vertical, which kinda makes sense given the whole thing is high contrast (versus the MIP display isn’t as contrasty).</p>\n<p>Likewise, you can access your POIs (points of interest) from the map settings page, as well as tweak other navigation settings. You can create/save your POIs ahead of time in the Suunto App, and then push them to the watch for easier access. This can be useful for specifying a campsite for the night, for example. Or, where ice cream is located.</p>\n<p>So, what about battery life? Well, it’s impressive. The main purpose of me spending 12.5 hours wandering the mountains of Mallorca (including in the dark) was to see how the battery handled on both this and the Polar Vantage V3.</p>\n<p>What’s cool is that last month, Suunto quietly added support for writing the battery state levels to their exposed .FIT (workout) files, which in turn enumerate in the DCR Analyzer. This allows us to see the exact battery levels throughout these longer activities for devices/companies that support the data (Garmin, Wahoo, Stages, Suunto, Hammerhead):</p>\n<p><img title=\"SuuntoBatteryChart.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SuuntoBatteryChart.png\" alt=\"SuuntoBatteryChart\" width=\"720\" height=\"297\" /></p>\n<p>For those that don’t support it, I simply manually track the start/end points. With that in mind, here’s how the four watches I had with me handled over those 12.5 hours. All watches had the course loaded, except the Polar Vantage V3 watch crashed repeatedly after 2hrs, and thus I had to remove the route to keep it from crashing. In general, I keep the data pages the same on the watches the best I could.</p>\n<p>Meaning, the map page burns the most battery, so if I was using the map page on one, I’d try to do it the same on the others (COROS has no maps on the Pace 3). Mostly though, I kept it on non-map pages unless I was in a spicy area (not easy to follow trails), which, was quite a bit initially:</p>\n<p><img title=\"IMG_1154 2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1154-2-1.png\" alt=\"IMG 1154 2\" width=\"720\" height=\"540\" /></p>\n<p>Both the Polar Vantage V3 and the Suunto Race have optical HR enabled (which burns more battery), whereas the Garmin Forerunner 965 and COROS Pace 3 were connected to a chest strap for HR (which burns far less battery).</p>\n<p>In any case, here’s the total burned (the COROS Pace 3 isn’t really a competitor in this particular race, it was just along for the ride). As a reminder, Suunto claims up to 40 hours in this multiband configuration, so even despite alway-on display and navigation enabled, it easily beat that.</p>\n<p><strong>COROS Pace 3 (MIP display):</strong> Burned 67% (from 100% to 33%)<br />\n<strong>Garmin Forerunner 965 (AMOLED):</strong> Burned 64% (from 82% to 18%)<br />\n<strong>Polar Vantage V3 (AMOLED):</strong> Burned 90% (from 95% to 5%, when it force-ended activity)<br />\n<strong>Suunto Race (AMOLED):</strong> Burned 24% (from 86% to 62%)</p>\n<p>Obviously, each of these units have different batteries. For example, the Forerunner 965 isn’t really positioned as a long-battery life unit from Garmin. Instead, that’s the more expensive Garmin Epix (AMOLED) or Fenix (MIP) series. Still, price-wise the Garmin/Suunto/Polar are in the same ballpark as competitors.</p>\n<p>So yeah, in short, super impressive battery burn on the Suunto Race – very happy with that.</p>\n<h3><span><strong>GPS Accuracy:</strong></span></h3>\n<p><img title=\"IMG_7801.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_7801.png\" alt=\"IMG 7801\" width=\"720\" height=\"540\" /></p>\n<p>First we’ll take a look at the GPS, or more specifically, the GNSS system. In this case, all of my testing is done in the dual-frequency/multiband configuration, called ‘Performance’. This means it burns more battery life, but in exchange, you get higher-quality GPS tracks. For all other watches listed in this section, I’m using the highest accuracy option of each one – which is almost always multi-band (the exception being the Google Pixel Watch 2, which lacks such hardware). In the case of Garmin watches, I leave the default ‘Auto-Select’ mode, which basically automatically engages multiband/dual-frequency when it senses the environment needs it (buildings/mountains), and then steps down to lesser GPS options in areas like open farmland.</p>\n<p>Note that for all of these tests, you can click on the link next to each one to see the full test, and zoom around inside the GPS map with all of the tracks to analyze as you see fit. I’m going to focus on the most interesting (good or bad) portions of each route.</p>\n<p>With that said, let’s look at this first test that heads into the forest for a loop. This is compared to the new Polar Vantage V3, and Garmin Epix Pro. Here’s that data at a high level, which <a href=\"https://analyze.dcrainmaker.com/#/public/b491f1cd-b897-46b6-7760-3da4821f321c\">looks pretty similar at first</a>:</p>\n<p><img title=\"V3-AccuracyGPS-1.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-1-1.png\" alt=\"V3 AccuracyGPS 1\" width=\"719\" height=\"456\" /></p>\n<p>And indeed, as I meander around the forest, the three units are largely very very close, with the Suunto Race making a few minor quirky errors initially:</p>\n<p><img title=\"V3-AccuracyGPS-2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-2-1.png\" alt=\"V3 AccuracyGPS 2\" width=\"719\" height=\"454\" /></p>\n<p>And then trading places with the Polar Vantage V3 making a few minor errors:</p>\n<p><img title=\"V3-AccuracyGPS-3.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-3-1.png\" alt=\"V3 AccuracyGPS 3\" width=\"719\" height=\"455\" /></p>\n<p>Again, these are pretty minor, so let’s move along to something more interesting.</p>\n<p>This next one I’ve got a couple-hour hike/trail run in areas that are occasionally forested, and occasionally open, along with some occasional cliffs. As long as I don’t fall off said cliffs into said trees, it’s all good. Oh, and I started from town where there are some taller hotel buildings, but nothing of major consequence. <a href=\"https://analyze.dcrainmaker.com/#/public/8b9edcf5-5196-4fc8-4651-bbd1e0d8d75b\">Here’s the data and overview</a>:</p>\n<p><img title=\"V3-AccuracyGPS-4.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-4-1.png\" alt=\"V3 AccuracyGPS 4\" width=\"719\" height=\"455\" /></p>\n<p>If I scroll around a bunch, I don’t see any meaningful difference between the three units (Garmin Epix Pro, Suunto Race, and Polar Vantage V3) – they’re all basically the same:</p>\n<p><img title=\"V3-AccuracyGPS-5.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-5-1.png\" alt=\"V3 AccuracyGPS 5\" width=\"718\" height=\"451\" /></p>\n<p>Here as well:</p>\n<p><img title=\"V3-AccuracyGPS-6.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-6-1.png\" alt=\"V3 AccuracyGPS 6\" width=\"719\" height=\"453\" /></p>\n<p>So, let’s increase the difficulty a boatload, and do a <a href=\"https://analyze.dcrainmaker.com/#/public/82bd0399-ffb6-4f41-4c71-0c584a89d2eb\">bit of a city test</a>. This test is done in virtually every one of my GPS watch reviews in the last few years, and is incredibly difficult to do well. I go up and down the business district streets, with buildings that are 20-30 stories tall, on either side of small streets:</p>\n<p><img title=\"GPS-CityTesting.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GPS-CityTesting.jpg\" alt=\"GPS CityTesting\" width=\"719\" height=\"443\" /></p>\n<p>For some streets, I run directly down the middle of the street (when able), and for others, if I have to be on the sidewalk, I vary which side of the street I’m on halfway down the street, so that no one side is favored. In general, a ‘great’ watch on this test will still struggle a bit. Whereas a ‘bad’ watch will look like a toddler’s drawing.</p>\n<p>Starting at a high level, here’s how things looked for the entire (larger) route, which includes numerous underpasses/tunnels, and more.</p>\n<p><img title=\"V3-AccuracyGPS-7.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-7-2.png\" alt=\"V3 AccuracyGPS 7\" width=\"719\" height=\"476\" /></p>\n<p>Starting with the non-complicated parts of this course, along the river and such. Here it’s all good. No real issues from the Suunto Race or Polar Vantage V3:</p>\n<p><img title=\"V3-AccuracyGPS-8.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-8-1.png\" alt=\"V3 AccuracyGPS 8\" width=\"719\" height=\"476\" /></p>\n<p>We do see a few somewhat minor errors/offsets with the Vantage V3 as it rounds some of these corners and goes under the massive highway/train/etc overpasses. Along with this section a bit later under another tunnel and near some buildings. But the Suunto Race sticks all of these perfectly:</p>\n<p><img title=\"V3-AccuracyGPS-9.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-9-1.png\" alt=\"V3 AccuracyGPS 9\" width=\"340\" height=\"225\" /> <img title=\"V3-AccuracyGPS-10.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-10-1.png\" alt=\"V3 AccuracyGPS 10\" width=\"340\" height=\"225\" /></p>\n<p>But, we’re here for big-ass buildings, not big-ass highways. And thus, we arrive at the section that GPS devices wince at:</p>\n<p><img title=\"V3-AccuracyGPS-11.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-11.png\" alt=\"V3 AccuracyGPS 11\" width=\"719\" height=\"476\" /></p>\n<p>Here you can see the Polar Vantage V3 struggles the most of the three, offset by the largest amount. The COROS Pace 3 and Suunto Race both actually did quite well here. The Garmin Forerunner 965 did ‘fine’ here, albeit it was in auto-select mode, so perhaps it didn’t scale up to multi-band fast enough. Maybe someday when I’m bored I’ll run this section a bunch repeatedly with two Forerunner 965s concurrently and see how they might differ precisely in the two modes. Overall, for this one section, I’d say the COROS Pace 3 actually stuck the landing the best (like the Forerunner 965, it’s actually done this test a few times over the last few months, and this is by far its best performance, it’s had some other so-so results as well…such is life). The Suunto Race really only made one minor error for about 100m of roadway section, otherwise it would have won.</p>\n<p>In any event, the rest of that particular test was mostly uneventful. A few tunnels that it skipped a beat on, but nothing major.</p>\n<p>Next, let’s look at the 58KM hike that I did. Albeit, due to the crashes in the Polar Vantage V3 it only recorded the last 8hrs worth (as it lost data from the first 4hrs). Nonetheless, there’s plenty of spicy mountain terrain in that to look at. Here it’s compared against the Polar Vantage V3, Garmin Forerunner 965, and COROS Pace 3. <a href=\"https://analyze.dcrainmaker.com/#/public/9bed4f85-0ffd-4d11-4b8a-a9f0449fec3d\">The quick overview here</a>:</p>\n<p><img title=\"V3-AccuracyGPS-12.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-12.png\" alt=\"V3 AccuracyGPS 12\" width=\"719\" height=\"471\" /></p>\n<p>Looking at the section here as I climbed up over a ridge and through some wooded areas, virtually all of the units were identical:</p>\n<p><img title=\"V3-AccuracyGPS-13.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-13.png\" alt=\"V3 AccuracyGPS 13\" width=\"719\" height=\"477\" /></p>\n<p>Due to the trail being overgrown beyond passibility, I had to divert for a bit onto the Sa Calobra road to get up over the mountain pass. During this section, all four watches seemed to handle just fine:</p>\n<p><img title=\"V3-AccuracyGPS-14.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-14.png\" alt=\"V3 AccuracyGPS 14\" width=\"719\" height=\"470\" /></p>\n<p>Once back on the mountain trail, I didn’t see any issues – it was solid throughout all of this long traverse into the stiff headwinds:</p>\n<p><img title=\"V3-AccuracyGPS-15.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-15.png\" alt=\"V3 AccuracyGPS 15\" width=\"719\" height=\"478\" /></p>\n<p>There were actually very few moments where the four disagreed, such as this steep descent in deep woods alongside cliffs, where the COROS Pace 3 seems a bit offset from the others, but not that meaningful in the context here.</p>\n<p><img title=\"V3-AccuracyGPS-16.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-16.png\" alt=\"V3 AccuracyGPS 16\" width=\"340\" height=\"224\" /> <img title=\"V3-AccuracyGPS-17.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-17.png\" alt=\"V3 AccuracyGPS 17\" width=\"340\" height=\"221\" /></p>\n<p>Oh, and if I look at elevation here, here’s that chart (again, remember the Polar data on this chart starts about 4hrs in). We can see it’s very very close, though, in the last hour the COROS &amp; Polar drift a touch bit high, but the Garmin and Suunto nail it, sticking the landing back on the beach where I started at perhaps 1m above sea-level. All this despite spending 12.5hrs in the mountains with shifting temps and pressure from day to night.</p>\n<p><img title=\"V3-AccuracyGPS-Elevation.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-Elevation.png\" alt=\"V3 AccuracyGPS Elevation\" width=\"719\" height=\"290\" /></p>\n<p>Next, here’s an outdoor cycling workout, this one up some switchbacks in Mallorca. It’s compared to the COROS Pace 3 on the other wrist, as well as the Garmin Edge 840 cycling GPS/bike computer. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/9d2424fa-4c07-4ceb-655e-a56de7c73cc8\">that data at a high level</a></p>\n<p><img title=\"SR-Accuracy6-GPSBike.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SR-Accuracy6-GPSBike.png\" alt=\"SR Accuracy6 GPSBike\" width=\"719\" height=\"343\" /></p>\n<p>Now, I was mostly just interested in one section in the mountains on these switchbacks. Everything else was boringly perfect by all units. And indeed, this section was solid too:</p>\n<p><img title=\"SR-Accuracy-7-Bike.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SR-Accuracy-7-Bike.png\" alt=\"SR Accuracy 7 Bike\" width=\"719\" height=\"345\" /></p>\n<p>Also, for fun, here’s the elevation graph:</p>\n<p><img title=\"SR-Accuracy4-Elevation.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SR-Accuracy4-Elevation.png\" alt=\"SR Accuracy4 Elevation\" width=\"719\" height=\"221\" /></p>\n<p>So, what about open-water swimming? On the right wrist the Suunto Race, and on the left wrist the Polar Vantage V3. Then a swim buoy with me (dragging along) with another GPS for reference. Here’s that data:</p>\n<p><img title=\"V3-AccuracyGPS-18Swim.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-18Swim.png\" alt=\"V3 AccuracyGPS 18Swim\" width=\"720\" height=\"455\" /></p>\n<p>As you can pretty easily see, the Suunto Race struggled here, overshooting in various sections. This would be a common pattern.</p>\n<p>Here’s another open water swim, the next day with the COROS Pace 3 on the other wrist instead of the Polar. In this case, it was kinda the same story. Albeit, both units made mistakes, instead of just the Suunto Race. This vaguely seems tied to moments where I paused to tread water, which historically Suunto has long had trouble with. <a href=\"https://analyze.dcrainmaker.com/#/public/07ee9f17-a898-4e16-4082-5f6a4f53560b\">Data set</a>:</p>\n<p><img title=\"SR-Accuracy2-OWS.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SR-Accuracy2-OWS.png\" alt=\"SR Accuracy2 OWS\" width=\"718\" height=\"344\" /></p>\n<p>Note that this also matches some swims I did in Kona, Hawaii last month too – where it just lacked accuracy and would jump around a bunch. Suunto says they continue to be confused why I’m having troubles with the accuracy on their watches in swimming, and likewise I’m confused why (this COROS Pace 3 swim aside), it’s only their watches that I have trouble with in openwater swimming. Maybe we should all just go to a tropical island (Maldives perhaps?) and swim twice a day every day for a week until it’s sorted. Seems reasonable.</p>\n<p>In any case, setting aside openwater swim accuracy, Suunto’s land-based accuracy appears very good, and in the upper echelon of GPS devices today on the market, largely matching Garmin and Apple (multi-band watches).</p>\n<p><em>(Note: All of the charts in these accuracy sections were created using the DCR Analyzer tool. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, <a href=\"https://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Heart Rate Accuracy:</strong></span></h3>\n<p><img title=\"DSC_9214.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9214.jpg\" alt=\"DSC 9214\" width=\"720\" height=\"480\" /></p>\n<p>Now, remember I mentioned earlier in the review I only had two complaint areas? And that the first was slowness? Well, here’s the second – optical heart rate sensor accuracy. It’s bad. There’s no two ways to slice it.</p>\n<p>You can click on any of the links to see the full original data set files, zoom in, do your own analysis etc. I include these so you can see I’m not cherry-picking any data portions – the full workouts are there, from start to finish. In this case I’m comparing it to other optical heart rate sensors as well as a validated/trusted chest strap to determine accuracy.</p>\n<p>First up, we’ve got an indoor trainer (cycling) workout that starts off with some short intense intervals, before going into some longer/harder intervals. Here it’s compared against a chest strap (Garmin HRM-PRO Plus), the Polar Vantage V3 (optical HR watch), and the Whoop 4.0 strap (bicep band). That <a href=\"https://analyze.dcrainmaker.com/#/public/f149c993-1716-4816-48c0-18541e931696\">data set is here</a>:</p>\n<p><img title=\"V3-AccuracyHR-1.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-1.png\" alt=\"V3 AccuracyHR 1\" width=\"720\" height=\"372\" /></p>\n<p>This is actually one of the best performances of the Suunto Race, only having a few very tiny variations towards the end of the last longer interval. Given how hard I was hurting then, I don’t mind that the sensor was sick of it as well.</p>\n<p>So, let’s look at another indoor trainer workout, from three nights ago. This one was more steady-state than interval, and thus should have been easier for the sensor to follow. I only threw in a few half-hearted sprints for fun. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/3abe1afb-32cc-4fad-587a-322dc4ab669c\">that data set</a>:</p>\n<p><img title=\"V3-AccuracyHR-2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-2.png\" alt=\"V3 AccuracyHR 2\" width=\"719\" height=\"374\" /></p>\n<p>This one is weird. As I noted, this should have been a piece of cake, but both the Polar Vantage V3 and Suunto Race struggled here in the first 12 minutes or so with many little drops/inconsistencies. These were variations of about 10-12bpm, which is pretty high to be off. Both units were horrendous here. You can see these errors here:</p>\n<p><img title=\"V3-AccuracyHR-3.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-3.png\" alt=\"V3 AccuracyHR 3\" width=\"720\" height=\"379\" /></p>\n<p>It’s a pattern I’d see on other workouts over the last little while as well. Take for example this next trainer workout (don’t worry, we’ll get to other sports, but this is theoretically the easiest sport type, and it’s struggling here). Here you can see that for the main (painful) intervals, it’s largely good minus a single blip. Overall, fine. But, for the initial warm-up, it struggles a bit, albeit in this case, only for about 6-8 minutes. Here’s that <a href=\"https://analyze.dcrainmaker.com/#/public/48e3e034-4e6e-43d5-4a97-6950beb3d0cc\">data set.</a></p>\n<p><img title=\"V3-AccuracyHR4.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR4.png\" alt=\"V3 AccuracyHR4\" width=\"718\" height=\"386\" /></p>\n<p>Ok, so let’s look at a run. Here’s one from this past Saturday, where I was relatively easy-pace as the base of the run, and then every 2KM I’d do a 2-minute long tempo section. Not a hard sprint/interval, just I’d increase the pace to about 10KM-race pace. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/82bd0399-ffb6-4f41-4c71-0c584a89d2eb\">that data set</a>:</p>\n<p><img title=\"V3-AccuracyHR5.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR5.png\" alt=\"V3 AccuracyHR5\" width=\"719\" height=\"372\" /></p>\n<p>As you can see, results from either the Vantage V3 or Suunto Race were not good. There’s no two ways about it, and frankly, this result puzzles me the most. This was a very straightforward stable run in the rain. The rough pattern here appears to be the start of each tempo section when it would lose the plot, which almost indicates cadence-lock issues (when an optical HR sensor locks to the pounding of your feet). But in this case, it doesn’t match cadence, but just loses it entirely (usually cadence-lock would go high like the start failure you see above, not low).</p>\n<p>Next, let’s look <a href=\"https://analyze.dcrainmaker.com/#/public/9d2424fa-4c07-4ceb-655e-a56de7c73cc8\">at an outdoor ride</a>. This is also one of the better optical HR performances by the Suunto Race, likely because it’s low-speed (once I start the climb), and relatively sustained/stable, making it easy:</p>\n<p><img title=\"SR-Accuracy3BikeHR.png\" src=\"https://media.dcrainmaker.com/images/2023/11/SR-Accuracy3BikeHR.png\" alt=\"SR Accuracy3BikeHR\" width=\"719\" height=\"284\" /></p>\n<p>The second half gets a bit wonky, because I’m now descending at high-speed on roads with vibrations (but with low effort, hence the lower HR values). This is where you can see chest straps struggle a bit too in cooler temps like this was, still a bit earlier in the day.</p>\n<p>Ultimately though, looking at all the data from the past month (I have more data sets, which basically just mirror this over and over again), the Suunto Race optical heart rate sensor simply isn’t all that great – just like the Suunto Vertical before it. Suunto licenses this sensor from LifeQ, and it’s unclear to me if the issue is the specific sensor that Suunto has selected, the power levels that Suunto gives it, or simply the algorithms that LifeQ has in conjunction with that sensor hardware. Either way, it wasn’t good on the Suunto Vertical, and it isn’t good here on the Suunto Race (nor was it good on other recent Suunto watches either). Suunto really needs to look at alternatives for whatever watches come next.</p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p><img title=\"P1100064.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/P1100064.jpg\" alt=\"P1100064\" width=\"720\" height=\"480\" /></p>\n<p>Ultimately, this appears to be Suunto’s best watch ever. I’d struggle to think of a watch that’s better executed from them in terms of all-around features, execution of the hardware, and the thick layer of new software features. The AMOLED display is brilliant, the battery life is incredibly strong in my testing, and the GPS accuracy on land is very good.</p>\n<p>Now, as always, there are areas for improvement. The most glaring being that optical heart rate sensor, that simply isn’t competitive (and often not accurate). Beyond that there’s everything to do with sensor pairing, especially in the cycling realm. That entire portion of the watch is long overdue for an overhaul. And then beyond that, there’s some minor polish things that would benefit from being tidied up. I’m looking forward to the planned firmware update Monday that’s supposed to make headway on the UI slowness/lag issues, as well as expanding out the 500m map radius to 2KM. I’d still like to see it greater than that, but that’s a start.</p>\n<p>Overall, more than anything else – Suunto got the pricing right here. A literal case of ‘The Price is Right’. Suunto has realized they can’t compete with Garmin on features, nobody can. Instead, they need to compete (aggressively) on pricing, and ensuring they match on accuracy and usability. The $449USD price point overwhelmingly does that, and will likely force more than one of their competitors to adjust both current and planned products. Of course, that only happens if consumers take note of what Suunto is doing, and start to reward them for it.</p>\n<p>With that – thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Suunto Race Stainless Steel (16GB) or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you shop with <a href=\"https://pros-closet.sjv.io/OrnmMN\">TPC (The Pro's Closet)</a>, you'll <b>save $40 on purchases over $200 with coupon code DCRAIN40</b>! The Pro's Closet has been a long-time partner of the site here - including sponsoring videos like my <a href=\"https://www.dcrainmaker.com/2022/06/cargo-bike-amsterdam-race-report-power.html\">cargo bike race</a>, as well as just being an awesome Colorado-based company full of good humans. Check them out with the links below and the <b>DCRAIN40</b> coupon!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/SUUNTO-Dual-Band-Touchscreen-Training-Insights/dp/B0CFT1CC3J?crid=19WUZ30XHU20C&amp;keywords=Suunto%2Brace&amp;qid=1698485027&amp;sprefix=suunto%2Brac%2Caps%2C164&amp;sr=8-1-spons&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=580c2e8dbdb0f1300be0bf19ef14a0b7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"720\" height=\"768\" src=\"https://media.dcrainmaker.com/images/2023/10/SuuntoRace-Transparentpng-720x768.png\" srcset=\"https://media.dcrainmaker.com/images/2023/10/SuuntoRace-Transparentpng-720x768.png 720w, https://media.dcrainmaker.com/images/2023/10/SuuntoRace-Transparentpng-200x213.png 200w, https://media.dcrainmaker.com/images/2023/10/SuuntoRace-Transparentpng-117x125.png 117w, https://media.dcrainmaker.com/images/2023/10/SuuntoRace-Transparentpng.png 952w\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2023/10/suunto-race-hands-on-everything.html\" target=\"_blank\">Suunto Race Stainless Steel (16GB)</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/SUUNTO-Dual-Band-Touchscreen-Training-Insights/dp/B0CFT1CC3J?crid=19WUZ30XHU20C&amp;keywords=Suunto%2Brace&amp;qid=1698485027&amp;sprefix=suunto%2Brac%2Caps%2C164&amp;sr=8-1-spons&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=580c2e8dbdb0f1300be0bf19ef14a0b7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$449</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n<p>Here's a few other variants or sibling products that are worth considering:</p>\r\n<div>\n<div><div><h4>Suunto Race Titanium (32GB)</h4><div><a href=\"https://www.amazon.com/SUUNTO-Dual-Band-Touchscreen-Training-Insights/dp/B0CFTCJFQS?crid=19WUZ30XHU20C&amp;keywords=Suunto%2Brace&amp;qid=1698485027&amp;sprefix=suunto%2Brac%2Caps%2C164&amp;sr=8-1-spons&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33ce6261a6c01d29e1d62bb426388a46&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"117\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/10/SuuntoRaceTitaniumTransparent-117x125.png\" srcset=\"https://media.dcrainmaker.com/images/2023/10/SuuntoRaceTitaniumTransparent-117x125.png 117w, https://media.dcrainmaker.com/images/2023/10/SuuntoRaceTitaniumTransparent-200x213.png 200w, https://media.dcrainmaker.com/images/2023/10/SuuntoRaceTitaniumTransparent-720x768.png 720w, https://media.dcrainmaker.com/images/2023/10/SuuntoRaceTitaniumTransparent.png 952w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/SUUNTO-Dual-Band-Touchscreen-Training-Insights/dp/B0CFTCJFQS?crid=19WUZ30XHU20C&amp;keywords=Suunto%2Brace&amp;qid=1698485027&amp;sprefix=suunto%2Brac%2Caps%2C164&amp;sr=8-1-spons&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33ce6261a6c01d29e1d62bb426388a46&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$549</span></a> </div></div><div><div><h4>Suunto Vertical Solar (Titanium)</h4><div><a href=\"https://www.amazon.com/SUUNTO-Vertical-Adventure-Offline-Charging/dp/B0BZZX5CJS?crid=VH8TCAZQERAX&amp;keywords=Suunto%2Bvertical&amp;qid=1683619613&amp;sprefix=suunto%2Bverti%2Caps%2C1054&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVzZHVUtRU0lDTVBVJmVuY3J5cHRlZElkPUEwMzQ2NzU1MlNDS0FNNzIwOVlZWSZlbmNyeXB0ZWRBZElkPUEwMjE0ODAzMjMyWUxCN1VLMFYwSCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d647a5345a72b06a239d7798b3e97269&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"91\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Solar-Transparent-91x125.png\" srcset=\"https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Solar-Transparent-91x125.png 91w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Solar-Transparent-200x274.png 200w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Solar-Transparent-720x987.png 720w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Solar-Transparent.png 1094w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/SUUNTO-Vertical-Adventure-Offline-Charging/dp/B0BZZX5CJS?crid=VH8TCAZQERAX&amp;keywords=Suunto%2Bvertical&amp;qid=1683619613&amp;sprefix=suunto%2Bverti%2Caps%2C1054&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVzZHVUtRU0lDTVBVJmVuY3J5cHRlZElkPUEwMzQ2NzU1MlNDS0FNNzIwOVlZWSZlbmNyeXB0ZWRBZElkPUEwMjE0ODAzMjMyWUxCN1VLMFYwSCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d647a5345a72b06a239d7798b3e97269&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$839</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https://www.backcountry.com/suunto-vertical-titanium-solar-watch\"><span>Backcountry</span> <span>$839</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https://www.rei.com/product/227733/suunto-vertical-titanium-solar\"><span>REI</span> <span>$839</span></a> </div></div><div><div><h4>Suunto Vertical</h4><div><a href=\"https://www.amazon.com/SUUNTO-Vertical-Adventure-Offline-Charging/dp/B0BZZYBB8S?crid=VH8TCAZQERAX&amp;keywords=Suunto%2Bvertical&amp;qid=1683619613&amp;sprefix=suunto%2Bverti%2Caps%2C1054&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVzZHVUtRU0lDTVBVJmVuY3J5cHRlZElkPUEwMzQ2NzU1MlNDS0FNNzIwOVlZWSZlbmNyeXB0ZWRBZElkPUEwMjE0ODAzMjMyWUxCN1VLMFYwSCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=ab7ae4e56dbade9d5dc417cdd1c5176c&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"91\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Base-Transparent-91x125.png\" srcset=\"https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Base-Transparent-91x125.png 91w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Base-Transparent-200x274.png 200w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Base-Transparent-720x987.png 720w, https://media.dcrainmaker.com/images/2023/05/SuuntoVertical-Base-Transparent.png 1094w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/SUUNTO-Vertical-Adventure-Offline-Charging/dp/B0BZZYBB8S?crid=VH8TCAZQERAX&amp;keywords=Suunto%2Bvertical&amp;qid=1683619613&amp;sprefix=suunto%2Bverti%2Caps%2C1054&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyVzZHVUtRU0lDTVBVJmVuY3J5cHRlZElkPUEwMzQ2NzU1MlNDS0FNNzIwOVlZWSZlbmNyeXB0ZWRBZElkPUEwMjE0ODAzMjMyWUxCN1VLMFYwSCZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=ab7ae4e56dbade9d5dc417cdd1c5176c&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$529</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https://www.rei.com/product/227732/suunto-vertical?color=ALL%20BLACK\"><span>REI</span> <span>$629</span></a> </div></div></div>\n\r\n\r\n\r\n\r\n\r\n<p>And finally, here’s a handy list of accessories that work well with the Suunto watches. Given the unit pairs with standard Bluetooth Smart sensors, you can use just about anything though. I'd recommend the Garmin bike sensors over the Wahoo ones, merely because the Garmin have two concurrent Bluetooth channels versus one for the Wahoo RPM/SPEED sensors.</p>\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2020/01/polars-new-h9-heart-rate-strap-everything-you-ever-wanted-to-know.html\" target=\"_blank\">Polar H9 Chest Strap</a></h4><div><a href=\"https://www.amazon.com/POLAR-Heart-Rate-Sensor-Waterproof/dp/B08411CZYL/ref=as_li_ss_tl?dchild=1&amp;keywords=Polar+H9&amp;qid=1593094906&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=83a714a8ad165aad70d00df0b9324cdc&amp;language=en_US\" target=\"_blank\"><img width=\"125\" height=\"92\" src=\"https://media.dcrainmaker.com/images/2020/01/Polar-H9-Transparent-125x92.png\" srcset=\"https://media.dcrainmaker.com/images/2020/01/Polar-H9-Transparent-125x92.png 125w, https://media.dcrainmaker.com/images/2020/01/Polar-H9-Transparent-200x147.png 200w, https://media.dcrainmaker.com/images/2020/01/Polar-H9-Transparent-720x528.png 720w, https://media.dcrainmaker.com/images/2020/01/Polar-H9-Transparent.png 750w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/POLAR-Heart-Rate-Sensor-Waterproof/dp/B08411CZYL/ref=as_li_ss_tl?dchild=1&amp;keywords=Polar+H9&amp;qid=1593094906&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=83a714a8ad165aad70d00df0b9324cdc&amp;language=en_US\"><span>Amazon</span> <span>$60</span></a> </div><p>This is a great strap, especially if you're going to the gym. It's dual ANT+/Bluetooth Smart, but it also supports the 5kHz analog heart rate transmission for older gym equipment. Note that it only accepts a single Bluetooth connection, versus dual-connections for the Polar H10.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Cadence Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"106\" src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png\" srcset=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png 125w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-200x170.png 200w, https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent.png 582w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$38</span></a> </div><p>This is a dual ANT+/Bluetooth Smart cycling cadence sensor that you strap to your crank arm, but also does dual Bluetooth Smart, so you can pair it both to Zwift and another Bluetooth Smart app at once if you want.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-DUAL Chest Strap</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"52\" src=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png\" srcset=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png 125w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-200x84.png 200w, https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205.png 510w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$48</span></a> </div><p>This is one of the top straps I use daily for accuracy comparisons (the others being the Polar H9/H10). It's dual ANT+/Bluetooth Smart, and in fact dual-Bluetooth Smart too, in case you need multiple connectons.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Speed Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"125\" height=\"95\" src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent-125x95.png\" srcset=\"https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent-125x95.png 125w, https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent-200x151.png 200w, https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent.png 671w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$35</span></a> </div><p>This speed sensor is unique in that it can record offline (sans-watch), making it perfect for a commuter bike quietly recording your rides. But it's also a standard ANT+/BLE sensor that pairs to your device. It's become my go-to speed sensor.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2020/05/wahoos-new-2020-tickr-tickr-x-in-depth-review.html\" target=\"_blank\">Wahoo TICKR (2020 Edition)</a></h4><div><a href=\"https://www.amazon.com/Wahoo-Fitness-TICKR-Monitor-Stealth/dp/B0881B1H5S/ref=as_li_ss_tl?dchild=1&amp;keywords=Wahoo+TICKR&amp;qid=1591358647&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5de7cfa1fd51b5724d3a3a809b269b78&amp;language=en_US\" target=\"_blank\"><img width=\"114\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent-114x125.png\" srcset=\"https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent-114x125.png 114w, https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent-200x220.png 200w, https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent-768x844.png 768w, https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent-720x791.png 720w, https://media.dcrainmaker.com/images/2020/05/Wahoo-TICKR-2020-White-Transparent.png 964w\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Wahoo-Fitness-TICKR-Monitor-Stealth/dp/B0881B1H5S/ref=as_li_ss_tl?dchild=1&amp;keywords=Wahoo+TICKR&amp;qid=1591358647&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=5de7cfa1fd51b5724d3a3a809b269b78&amp;language=en_US\"><span>Amazon</span> <span>$48</span></a> </div><p>The Wahoo TICKR is their baseline dual ANT+/Bluetooth Smart chest strap that includes basic broadcasting of heart rate data to apps. If you don't care about all the fancy features of the TICKR X, this is one of the best straps out there. The 'just works' factor is high.</p>\n</div></div>\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"ceefd8c6f9389fb384628b908afdbed2b205c1158b2317432545b93515586b60","category":"Cycling"}