{"title":"Germination characteristics associated with nicosulfuron resistance in <i>Amaranthus retroflexus</i> L.","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308024","date":1723471200000,"content":"<p>by Yingying Zhang, Xian Xu, Bochui Zhao, Binghua Li, Zhizun Qi, Yu Wang, Guiqi Wang, Yaofa Li, Zhaofeng Huang, Xiaomin Liu</p>\r\n\r\nNicosulfuron-resistant biotype (R) and -sensitive biotype (S) <i>Amaranthus retroflexus</i> L. seeds were subjected to different temperature, light, salt, osmotic potential, pH value and burial depth treatments. The difference in germination response of two populations to the above abiotic environmental factors was used to study the fitness cost of nicosulfuron-resistance evolution in <i>A</i>. <i>retroflexus</i>. The aim is to find a powerful tool for weed control in the presence of evolutionary resistance selection. The results of this experiment showed that the germination rate and germination index in S population were generally higher than that in R population. When the salt stress was 80 mM, the water potential was -0.1 Mpa ~ -0.4 Mpa, and under strong acid and alkali conditions, the germination index in S population was prominently higher than that in R population (<i>p</i>&lt;0.05). The delayed seed germination in R population indicated that its nicosulfuron resistance may be linked to seed biochemical compositions that altered seed germination dynamics. The resistant and sensitive biotype of <i>A</i>. <i>retroflexus</i> had differently favourable adaptability in diverse environments. Salt, osmotic potential and pH value are not the major constraints for <i>A</i>. <i>retroflexus</i> germination, however, <i>A</i>. <i>retroflexus</i> are strongly responsive to temperature, light and burial depth. Considering that seeds of <i>A</i>. <i>retroflexus</i> are unable to reach the soil surface beyond the depth of 6 cm, deep inversion tillage before sowing may be an effective and economical weed management tool for the control of nicosulfuron resistant <i>A</i>. <i>retroflexus</i>.","author":"Yingying Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cef11c0808767d46eeea556f2b5b4087d9e78e3bc127d3f5718f2f184277447a","category":"Interdisciplinary"}