{"title":"Florida man gets unexplained leprosy case; doctors suspect local soil","link":"https://arstechnica.com/?p=1959775","date":1691530164000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1258654638-800x533.jpeg\" alt=\"An armadillo prepares to cross a gravel road as the space shuttle Endeavour rests on the launch pad at Kennedy Space Center before the scheduled launch of STS-130 in Cape Canaveral, Florida, February 4, 2010. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1258654638-scaled.jpeg\">Enlarge</a> <span>/</span> An armadillo prepares to cross a gravel road as the space shuttle Endeavour rests on the launch pad at Kennedy Space Center before the scheduled launch of STS-130 in Cape Canaveral, Florida, February 4, 2010.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/an-armadillo-prepares-to-cross-a-gravel-road-as-the-space-news-photo/1258654638?adppopup=true\">Getty | JIM WATSON</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A Florida man's unexplained case of leprosy last year adds to mounting evidence that the rare and often misunderstood bacterial infection has become endemic to the central part of the Sunshine State—and that it may, in fact, lurk in the environment there, possibly in the soil.</p>\n<p>In <a href=\"https://wwwnc.cdc.gov/eid/article/29/8/22-0367_article\">a research letter appearing in the August issue of</a> <em>Emerging Infectious Diseases, </em>three dermatologists detailed the man's case and their concerns for local transmission. They note that the 54-year-old man, like several others in the state who contracted the disease, reported no established risk factors that might explain their infection. He hadn't traveled abroad, where he could have picked up the infection, or had any exposure to armadillos, which live in Florida and naturally carry the bacteria that cause leprosy. He also didn't have any prolonged contact with people from leprosy-endemic countries or connections to anyone known to have leprosy.</p>\n<p>But he did spend a lot of time outdoors; he worked as a landscaper. In fact, many of the recent Florida cases lacked traditional risk factors but reported spending a lot of time outdoors. The similarity \"supports the investigation into environmental reservoirs as a potential source of transmission,\" the doctors wrote.</p></div><p><a href=\"https://arstechnica.com/?p=1959775#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1959775&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cf03969c5ac2a2e48287d7c3b5c6334e5dea77a12cf9df3a2111d53e97affd19","category":"Tech"}