{"title":"Unveiling taxonomic diversity in the deep‐sea fish genus Notacanthus (Notacanthiformes: Notacanthidae) with description of Notacanthus arrontei n. sp.","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15734?af=R","date":1711059712000,"content":"<h2>Abstract</h2>\n<p>Notacanthid fishes constitute a common part of benthopelagic deep-sea fish communities on seamounts and continental slopes around the world. However, their highly conserved morphology and the usual lack of information on deep-water organisms make it difficult to appropriately address their biodiversity. A multidisciplinary approach combining morphological data with a DNA-based species delimitation analyses was used to explore the taxonomy of <i>Notacanthus</i> species. For this purpose, morphological and molecular data were obtained from 43 individuals, and the resulting information was combined with the available data. The results showed the occurrence of <i>Notacanthus arrontei</i> n. sp. from the Iberian Peninsula and highlighted several taxonomic conundrums regarding the <i>Notacanthus</i> genus. For instance, no significant differences were found between <i>Notacanthus indicus</i> and the recently described <i>Notacanthus laccadiviensis</i>, questioning its taxonomic status. Similarly, the result of the species delimitation molecular analysis coincided with previous DNA barcoding studies supporting the snubnosed spiny eel <i>Notacanthus chemnitzii</i> as a species complex that requires further research. Moreover, two unidentified records from the Indian Ocean were confirmed to belong to an unknown species pending formal description, and barcoding data show for the first time the occurrence of the shortfin spiny eel <i>Notacanthus bonaparte</i> in the Australia-New Zealand area. This research confirms the existence of important gaps in the knowledge of notacanthid fishes and represents a step forward toward a better understanding of their biological diversity.</p>","author":"Rafael Bañón, \nDavid Barros‐García, \nFrancisco Baldó, \nMiguel Cojan, \nAlejandro de Carlos","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"cf0dcb9e3ab78acd26168720f7c4ee8134cc7b2feac1a39b19a13089d4345528","category":"Environment"}