{"title":"On the defensive: Why women’s racing follows a different pattern to men’s racing","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/on-the-defensive-why-women-s-racing-follows-a-different-pattern-to-men-s","date":1690145570000,"content":"\n      <p><span>“I was a bit bored, to be honest,” Lizzie Deignan joked when asked about why she went for the intermediate sprint points mid-way through the opening stage of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a>. The British rider did continue her explanation for her unexpected sprint afterwards, offering up the reason that she was in the right position and thought she might be able to carry the speed and try to form a breakaway afterwards. Joking or not, however, Deignan’s point still stands. The first half of the opening stage of the Tour de France Femmes was, as Ashleigh Moolman Pasio also put it, “dull.”</span></p>\n<div></div>\n<p><span>It is easy to criticise the lack of race action from the comfort of the sofa when watching the peloton suffer around Clermont-Ferrand in close to 30 degrees heat and dismiss the defensive racing as lazy or boring. It’s true that it was a very different dynamic to the recent stages of the men’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, where the fight for riders to make it into the breakaway lasted for well over 50 kilometres in some cases. Taking a step back and analysing from a wider viewpoint of the sport as a whole, however, there are understandable reasons for the very different feel that women’s racing has to the men’s equivalent.</span></p>\n<p><span>The first thing that it can be put down to is, plain and simple, ‘The SD Worx Effect.’ For the last eight years, the Dutch team has been the dominant squad in the women’s peloton. It began in late 2015 when the team was known as Boels-Dolmans. Back then, Lizzie Deignan (then Armitstead) won the Women’s World Cup and became their first world road race champion. Then in 2016, the team was ranked number one in the world, securing 38 wins – 24 more than the team in second place.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230723TDFFAZ0048-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1690145450\" alt /></span></p>\n<p><span>Even with riders like Deignan departing in the following seasons, Boels-Dolmans always kept their number one spot. A trio of Dutch riders came to the fore: Anna van der Breggen, Amy Pieters and Chantal Blaak. They were a force to be reckoned with in any race, doling out WorldTour wins between them. Despite fewer victories for the team in 2019 – a small disappointment by their sky-high standards – their strength-in-depth and consistency still left them at the top of the team ranking that year for a third year in a row.</span></p>\n<p><span>Out of contention in 2020 due to not being a WorldTeam, the Dutch outfit then stormed back to the top of the ranking in 2021 as the reformed SD Worx. With a younger roster, they secured 18 wins, six of which came from Demi Vollering, who is a shining example of the team’s ability to spot potential and develop it. With Vollering at the helm, SD Worx topped last year’s WWT ranking too and are on their way to doing it again in 2023, bolstered by having prolific winners like Lorena Wiebes and Lotte Kopecky – the latter who eventually won the opening 2023 Tour de France Femmes stage – in their ranks.</span></p>\n<p><span>The squad’s history and strength is intimidating and can often put other riders off attempting to challenge the status quo in the women’s peloton. Sometimes, it feels like an SD Worx win is already a foregone conclusion ahead of the race. Speaking after the first stage of the Tour, Deignan explained: “I think in men’s cycling you see these dominant riders like Pogačar and Vingegaard and in our races it’s pretty clear who the favourites are too. It was inevitable what happened today [SD Worx winning] so it was going to be a suicide mission for the break anyway, I guess everyone is playing it safe.”</span></p>\n<p><span>Ashleigh Moolman Pasio, an experienced climber who rides for AG Insurance-Soudal-Quick Step shared a similar sentiment to her colleague, commenting that there seems to be a sort of risk averse mentality in the women’s peloton.</span></p>\n<p><span>“Everyone is thinking about how hard it is going to be everyday. It’s a hard Tour, there’s a lot of climbing, tomorrow is 2600 metres of climbing so I think everyone has got that on their minds but I was pretty surprised how slow it was in the beginning but the final was hard,” Moolman Pasio explained. “It's frustrating because this is the biggest stage for women’s cycling so just being in a breakaway, even if it is just for a couple of kilometres, is good for the team.</span></p>\n<p><span>“I was actually surprised. Everyone just obviously knew SD Worx would control it but it was a bit disappointing no one tried because it’s good exposure.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230723TDFFAZ0092-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1690145474\" alt />Deignan also pointed to the development of women’s cycling as an important factor in the different race dynamic in the women’s peloton versus the men’s. The minimum wage for female cyclists in Women’s WorldTour teams was only introduced in 2020 and was the first key step to allowing riders to train full-time as professional athletes. While WorldTour teams are allowed a maximum of 20 riders on their roster, the majority still only have the budget to employ 13-15 riders and there are only 15 Women’s WorldTour squads currently. In addition, there are only six riders permitted per team in WWT races compared to seven in the men’s peloton. </span></p>\n<p><span>Most importantly, there is no stipulation for Continental teams to pay their riders at all, and a <a href=\"https://cyclistsalliance.org/2023/07/tca-annual-survey-key-issues-for-the-womens-professional-peloton/\">recent survey by the Cyclists’ Alliance</a> showed that the Tour de France Femmes includes many riders (around 20% of the peloton) who are not earning a liveable salary and may be working another job and studying at the same time. </span></p>\n<p><span>“Because we are still in the infancy of women’s cycling, we don’t have the strength in depth that the men do, we also have one rider less in each team in races which makes a difference,” Deignan said. The British rider pointed out that the issue is not always that smaller teams are not wanting to go in breakaways, but also that WorldTour teams rarely allow a big time gap between the peloton and the break as they don’t have the strength to control it.</span></p>\n<p><span>“If you have the confidence to let a break get three minutes because you have three Ellen van Dijk-type riders in your team, for instance, then it’s possible and you have the engine power to bring it back,” she explained. “At the moment, however, the Ellen van Dijk’s of the peloton are few and far between in women’s cycling. It will get there because of the investment and because of the minimum wage and in five year’s time it will be a different dynamic.”</span></p>\n<p><span>Immense progress has been made over the years in women’s cycling, but as Deignan said, it is going to take time for the sport to fully develop. While it might be easy to directly compare it with the men’s equivalent, it’s important to remember the history of each sport and reflect on how that impacts racing styles. </span></p>\n<p><span>While the men have had a <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> and Tour de France for centuries, these race have only just come to be opportunities for the women’s peloton in the last two years. Women’s cycling is still building its own race style and its own narrative, and should be given the time and space to do this. It’s true that the opening half of the first stage of the Tour de France Femmes looked nothing like the men’s race, but that’s because this sport is really nothing like men’s cycling. By the end of the stage, the battle for the win and yellow jersey had us all on the edge of our seats, anyway, even if the race took a little longer to get going.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cf11648466430e0d5b8e8b2da02ab3b17b25b6ce3504b77d57d887c879e70631","category":"Cycling"}