{"title":"ซีอีโอ EA ยังเชื่อว่าคลาวด์เกมมิ่งคืออนาคต ระบุปัญหา Stadia คือหาเพื่อนเล่น Multiplayer ไม่ได้","link":"https://www.blognone.com/node/123045","date":1623054561000,"content":"<div><div><div><p>Andrew Wilson ซีอีโอของ EA ให้สัมภาษณ์กับนิตยสาร <a href=\"https://fortune.com/2021/06/04/ea-ceo-andrew-wilson-fortune-500-video-games-biggest-gaming-companies-covid-streaming/\">Fortune</a> ถึงอนาคตของวงการคลาวด์เกมมิ่ง ระบุว่าเขายังเชื่อว่าคลาวด์เกมมิ่งก็คืออนาคตของวงการเกมอย่างไม่ต้องสงสัย (“it’s a foregone conclusion”) แต่ระบุว่าคงต้องใช้เวลาพัฒนาสักระยะก่อนจะไปถึงจุดนั้น</p>\n<p>เมื่อถูกถามถึงเรื่องที่ Google Stadia กำลังประสบปัญหาหลายอย่างในปัจจุบัน Wilson ตอบว่าตัวเขาเองเคยลองเล่นเกมบน Stadia มาแล้ว และมันก็ไม่ได้แย่นัก แต่ปัญหาคือการที่ระบบ Multiplayer ของ Stadia หาคนเล่นด้วยแทบไม่ได้ เพราะเขามองว่าเกมสมัยนี้เป็นเหมือนโซเชียลมีเดียมากกว่า ไม่ใช่แค่ “เกมเล่นคนเดียวที่นั่งเล่นในห้องนอนหรือในชั้นใต้ดินของบ้าน” อีกต่อไป</p>\n<p>ระบบออนไลน์ของเกมบน Stadia หลายๆ เกม ยังจำกัดให้ผู้เล่นเล่นด้วยกันได้แค่บนแพลตฟอร์ม Stadia ด้วยกันเท่านั้น เช่นเกม FIFA และ Madden ของ EA เอง แต่ก็มีเกมที่เปิดให้เล่นกับพีซีได้ เช่น The Elder Scrolls Online, The Division 2 และ PUBG ที่เล่นกับคอนโซลได้เมื่อใช้ Stadia Controller ปัญหาจึงน่าจะมาจากฝั่งผู้พัฒนาเกมที่อาจต้องปรับปรุงตัวเกมให้เล่นด้วยกันได้ มากกว่าจะเป็นข้อจำกัดของแพลตฟอร์ม</p>\n<p>ปัจจุบัน Google Stadia กำลังประสบปัญหาหลายด้าน ทั้ง<a href=\"https://www.blognone.com/node/120956\">สตูดิโอภายในถูกปิด</a> <a href=\"https://www.blognone.com/node/122498\">ผู้บริหารลาออก</a> และ<a href=\"https://www.blognone.com/node/121429\">ยอดผู้เล่นอาจไม่ถึงเป้าที่ Google วางไว้</a> คงต้องติดตามกันต่อไปว่าคลาวด์เกมมิ่งจะเป็นอนาคตจริงหรือไม่ และถ้าใช่ Stadia เป็นส่วนหนึ่งของอนาคตนั้นหรือเปล่า</p>\n<p>ที่มา - <a href=\"https://fortune.com/2021/06/04/ea-ceo-andrew-wilson-fortune-500-video-games-biggest-gaming-companies-covid-streaming/\">Fortune</a> via <a href=\"https://9to5google.com/2021/06/05/ea-stadia-multiplayer-interview/\">9to5Google</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4b4438e0336e7b1ee760d568d102021e.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ea\">EA</a></div><div><a href=\"/topics/stadia\">Stadia</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cf150313dfdf5150e0f58722b57aeb1ee3028c5d3b52cee1d9519adca5d302fe","category":"Thai"}