{"title":"Treatment of Twin Anemia Polycythemia Sequence with Donor Transfusion and Partial Recipient Exchange Transfusion: Procedural Considerations and Outcomes","link":"https://www.preprints.org/manuscript/202406.1982/v1","date":1719500141000,"content":"Background: Intrauterine transfusion (IUT) of the donor and partial exchange (pET) of the recipient is a temporizing treatment for pregnancies with Twin Anemia Polycythemia Sequence (TAPS). We sought to give a detailed description of the procedural approach and outcomes for sequential donor IUT and recipient pET in TAPS. Methods: Retrospective study of spontaneous TAPS referred to the Johns Hopkins Center for Fetal Therapy treated with donor IUT followed by recipient pET utilizing a double-syringe set up. Procedure characteristics and outcomes as well as accuracy of existing transfusion formulas were analyzed and compared with the literature. Results: 5 of 78 patients with spontaneous TAPS underwent a total of 19 combined IUT/pET procedures (median first procedure to delivery interval 5.6 weeks [interquartile range IQR 1.9-6.0]). One pET was stopped for fetal decelerations. Patients delivered at 33.0 weeks [IQR 31.9-33.3] with two survivors and no neonatal transfusion requirements. IUT volumes were 48 ml [IQR 39-63 ml] and pET volumes 32 ml [IQR 20-50] utilizing aliquots of 5 – 20 mls for the latter (p=0.021). For IUTs, assumption of a fetal blood volume below 150 ml/kg underestimated required transfusion volume. For pETs, all formulas required adjustment of dilution volume based on bedside testing (p&amp;lt;0.05 for all). Conclusions: Donor transfusion followed by partial exchange in the recipient can prolong pregnancy in spontaneous TAPS and obviate the need for neonatal transfusion. A double-syringe setup facilitates efficient saline exchange. Because the accuracy of volume formulas is limited, bedside testing is recommended to achieve the target hemoglobin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cf15e76a897645857eedec2c2a74b47f927db141f39db85f1dca9328c219868c","category":"Interdisciplinary"}