{"title":"Effect of mode of healthcare delivery on stress and intention to quit among physicians in Canada during the COVID-19 pandemic","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003377","date":1721311200000,"content":"<p>by Hossam Ali-Hassan, Shauna Clayton, Safoura Zangiabadi</p>\r\n\r\nThe COVID-19 pandemic prompted adaptations to the delivery of healthcare services across Canada. In response to associated health risks and physical distancing protocols, some physicians adopted telemedicine procedures into their practice where possible. The present study aimed to investigate the impact that mode of healthcare delivery had on physicians’ intention to quit their jobs due to stress, burnout, or mental health. The study utilized data collected by Statistics Canada from the Health Care Workers’ Experience (SHCWEP) survey during the COVID-19 pandemic. The sample included 2,198 participants, weighted to represent 93,952 Canadian physicians aged 18 and above. Modes of healthcare delivery were categorized as either in-person, online, or blended. A multivariable logistic regression analysis was performed to examine the relationship between mode of healthcare delivery and intention to quit due to stress, burnout, or mental health, after adjusting for sociodemographic, job-, and health-related factors. Intention to quit within the next two years due to stress, burnout, or mental health was reported by 7.5% of physicians. Compared to the in-person modality, online or blended healthcare delivery was associated with decreased the odds of intention to quit (OR = 0.67, 95% CI: 0.63–0.72 and OR = 0.66, 95% CI: 0.58–0.75, respectively). The present study sheds light on factors associated with medical frontline worker well-being and retention, factors which can subsequently impact the quality of patient care. Future considerations regarding healthcare policy should incorporate strategies that protect and enhance physicians’ mental health into its framework to mitigate future risks.","author":"Hossam Ali-Hassan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"cf1b1bd0e259909b53b2bed468e6b5acd6c62e4e9d4be4fe73be9c411efe53c2","category":"Environment"}