{"title":"Weaving social networks from cultural similarities on the neolithisation process in the Western Mediterranean: Evolutionary trajectories using projectile tools","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306027","date":1722348000000,"content":"<p>by María Barrera-Cruz, Oreto García-Puchol, Joaquín Jiménez-Puerto, Alfredo Cortell-Nicolau, Joan Bernabeu-Aubán</p>\r\n\r\nIn this paper, we concentrate on the neolithisation process in Mediterranean Iberia through a diachronic view (from 8600–6800 cal. BP), focusing on social interaction as a factor in articulating new cultural ties. To do this, we apply techniques centred on similarities in material culture by applying Social Network Analysis (SNA). For the first time, we point to the geometric projectiles, taking into account their recurrence in both Mesolithic and Neolithic groups as part of their characteristic hunting equipment. We hypothesise that patterns of cultural variability would express the changing flow of information between communities according to their mobility strategies (last hunter-gatherer groups), including economic and social behaviour, and that these relationships will be restructured with the arrival of the newcomer farmers and herders and their new spatial and social arrangement. The results obtained allow us to describe a connected and homogeneous Late Mesolithic network dramatically structured by the Neolithic arrival. Since then, a heterogenous pattern emerged, involving connected periods, network ruptures, and small-world phenomena. The emergence of this characteristic could support the flow of information when the network presents a clustered structure, the last probably due to regionalisation events. These diachronic dynamics fit well with demographic and socioecological trends observed from regional literature.","author":"María Barrera-Cruz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cf2718d1894a0474ea7b4bcaff240375321e8172a200016c9bd676592cf904c4","category":"Interdisciplinary"}