{"title":"Research on Market Orientation and Agricultural Enterprises&rsquo; Willingness to Adopt Green Technologies Chain Mediating Effect of Organizational Learning Ability and Policy Effectiveness","link":"https://www.preprints.org/manuscript/202404.1273/v1","date":1713513562000,"content":"Green and low-carbon development has become an important embodiment of China's path to becoming a strong agricultural country. How to enable agricultural enterprises to better adopt green technologies and conduct production and operation with the concept of sustainable development has become a key link. This article utilizes a structural equation model (SEM) to analyze the role paths and mediating effects of organizational learning ability and policy orientation in agricultural enterprises' market orientation and willingness to adopt green technologies[ The definition of green technology in this paper refers to Guo Kesha, Tian Xiaoxiao. Green technology and green transformation of industrial development mode [J]. Tianjin Social Sciences, 2024 (02) :99-107, including green manufacturing (production) technology and green service technology.]. The results show that market orientation, organizational learning ability, and policy effectiveness have significant direct positive impacts on the willingness to adopt; market orientation has a significant positive impact on agricultural enterprises' organizational learning ability, organizational learning ability has a significant positive impact on policy orientation, and market orientation has a significant positive impact on policy effectiveness; the results of mediation analysis also indicate that learning ability has a significant mediating effect between market orientation and willingness to adopt, and policy effectiveness has a significant mediating effect between market orientation and willingness to adopt. Through difference analysis, it is believed that the mediating effects of the three paths are equally important, and organizational learning ability and policy effectiveness play a partial mediating role in agricultural enterprises' willingness to adopt green technologies. Based on this, policy suggestions are proposed to improve enterprises' own organizational learning ability, increase the promotion of policies related to green technologies, improve relevant policies for the application of green technologies, and increase research and development efforts for green technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cf2872532f798e41874a02046ebbb2675bb8b58593aa294aee16ef9f4800b69e","category":"Interdisciplinary"}