{"title":"The Role of Oxidative Stress and DNA Hydroxymethylation in the Pathogenesis of Benzo[a]pyrene‐Impaired Reproductive Function in Male Mice","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24384?af=R","date":1721651710000,"content":"<h2>ABSTRACT</h2>\n<p>Benzo[a]pyrene (BaP), a polycyclic aromatic hydrocarbon, is known to cause teratogenesis. Environmental exposure of BaP has led to wide public concerns due to their potential risk of reproductive toxicity. However, the exact mechanism is still not clear. We aimed to explore the alterations of oxidative stress and DNA hydroxymethylation during BaP-impaired reproductive function. BALB/c mice were intragastrically administered with different doses of BaP (0.01, 0.1, and 1 mg/kg/day, once a day), while control mice were administered with corn coil. Then, the reproductive function, alterations of oxidative stress, DNA methylation, and DNA hydroxymethylation of testis tissues were evaluated. We found that BaP caused obvious histopathological damages of testis tissues. As for sperm parameters after BaP administration, testis weight and the rate of teratosperm were increased, as well as sperm count and motility were decreased. In mechanism, BaP upregulated HO-1 and MDA levels and downregulated SOD and CAT activity and GSH content in testis tissues, indicating that oxidative stress was induced by BaP. Furthermore, a significant induction of hydroxymethylation and inhibition of methylation were observed in testis tissues after BaP exposure. Collectively, BaP-induced oxidative stress and hydroxymethylation were involved in impairing reproductive function, which may be the mechanism of the male infertility.</p>","author":"Yu Gan, \nXiang Zhang, \nPanyuan Cai, \nLong Zhao, \nKaiyong Liu, \nHua Wang, \nDexiang Xu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"cf2c40fd66516fda8ec32cd24e8a684f95d62e0db9435d9ccf2b15e0d723b08d","category":"Environment"}