{"title":"Health-Related Quality of Life among Elderly Patients in Urban Bangladesh: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202407.2081/v1","date":1721974905000,"content":"Quality of life (QoL) focuses on a person’s ability to live a fulfilling life. In the elderly population, it helps in determining successful aging. Because of a scarcity of information regarding predictors of QoL in the elderly population in developing countries, this study was undertaken to assess the overall QoL and its predictors in the elderly population in an urban setting of Bangladesh. In this cross-sectional study, 275 participants were enrolled by systematic sampling at the outpatient department of a tertiary care hospital in Dhaka, Bangladesh. Data were collected by using a pretested semi-structured standard questionnaire for QoL (OPQOL-35). Pearson’s correlation was used to assess the association between QoL and sociodemographic factors. The Chi-square test was done for assessing the statistical significance between categorical variables. Multivariate linear regression was conducted to identify predictors of QoL, after controlling for potential confounders. The median age of the participants (n = 275) was 65 years (range, 60 to 85; 25th and 75th percentile, 60 and 68, respectively). The majority (78%) of them were married and 20% were widowed or divorced. The median score of QoL was 113 (25th and 75th percentile, 101 and 124, respectively). Most of the participants had a very poor (bad as can be) or poor (bad) QoL. Only 7.3% were observed to have “good” QoL (scores 140 or more). Females had significantly poorer QoL scores compared to males (p = 0.01). Educational status, marital status, body mass index and sleep duration significantly predicted QoL in a multiple regression analysis. In conclusion, the QoL of the elderly individuals in Bangladesh was very poor or poor. Future research should focus on service-oriented interventions, especially targeting women. Counseling of elderly people for enhancing their quality of life may include improving sleep patterns, healthy diets, regular exercise, and caring for their mental health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cf2d4c4ee8916b4ae724e43d5adfcd406b5356de0ae8ed094954965f80114016","category":"Interdisciplinary"}