{"title":"Inorganic Carbon Pools and Their Drivers in Grassland and Desert Soils","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17536?af=R","date":1729337620000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bc60a2af-f2c5-4b32-9e39-1cae4c709494/gcb17536-toc-0001-m.png\" alt=\"Inorganic Carbon Pools and Their Drivers in Grassland and Desert Soils\" />\n<p>Dryland in China contain 25 ±$$ \\pm $$ 3.8 petagrams of SIC in the top 100 cm. Desert soil inorganic carbon is mainly lithogenic carbonate, while grassland soil inorganic carbon is primarily pedogenic carbonate. Rhizosphere-driven acidification reduces SIC in grasslands.</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>Inorganic carbon is an important component of soil carbon stocks, exerting a profound influence on climate change and ecosystem functioning. Drylands account for approximately 80% of the global soil inorganic carbon (SIC) pool within the top 200 cm. Despite its paramount importance, the components of SIC and their contributions to CO<sub>2</sub> fluxes have been largely overlooked, resulting in notable gaps in understanding its distribution, composition, and responses to environmental factors across ecosystems, especially in deserts and temperate grasslands. Utilizing a dataset of 6011 samples from 173 sites across 224 million hectares, the data revealed that deserts and grasslands in northwestern China contain 20 ± 2.5 and 5 ± 1.3 petagrams of SIC in the top 100 cm, representing 5.5 and 0.76 times the corresponding soil organic carbon stock, respectively. Pedogenic carbonates (PIC), formed by the dissolution and re-precipitation of carbonates, dominated in grasslands, accounting for 60% of SIC with an area-weighted density of 3.4 ± 0.4 kg C m<sup>−2</sup> at 0–100 cm depth, while lithogenic carbonates (LIC), inherited from soil parent materials, prevailed in deserts, constituting 55% of SIC with an area-weighted density of 7.1 ± 1.0 kg C m<sup>−2</sup>. Soil parent materials and elevation determined the SIC stocks by regulating the formation and loss of LIC in deserts, whereas natural acidification, mainly induced by rhizosphere processes including cation uptake and H<sup>+</sup> release as well as precipitation, reduced SIC (mainly by PIC) in grasslands. Overall, the massive SIC pool underscores its irreplaceable role in maintaining the total carbon pool in drylands. This study sheds light on LIC and PIC and highlights the critical impact of natural acidification on SIC loss in grasslands.</p>","author":"Longwei Dong, \nJinzhi Ran, \nJiali Luo, \nLin Bai, \nYing Sun, \nMuhammad Aqeel, \nYahui Zhang, \nXiaoting Wang, \nQiajun Du, \nJunlan Xiong, \nHaiyang Gong, \nQingqing Hou, \nYan Deng, \nRui Xia, \nLiang Wang, \nFan Li, \nChuancong Dong, \nWeigang Hu, \nJie Peng, \nEkaterina Filimonenko, \nSulaiman Almwarai Alharbi, \nJianxiao Zhu, \nXiaogang Li, \nChunjie Li, \nJin‐Sheng He, \nKarl J. Niklas, \nYakov Kuzyakov, \nJianming Deng","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"cf306a88b079451b9653770d72e7c8c4ab15e71271977408a43defbeee390d7e","category":"Environment"}