{"title":"Samsung เปิดตัวต้นแบบ Galaxy Ring แล้ว ยังไม่มีรายละเอียดสเป็ก แต่บอกว่าขายในปีนี้","link":"https://www.blognone.com/node/138410","date":1708961110000,"content":"<div><div><div><p>ซัมซุงเปิดตัวสมาร์ทริง Galaxy Ring อย่างเป็นทางการในงาน MWC 2024 แล้ว หลังจาก<a href=\"https://www.blognone.com/node/137739\">ปล่อยทีเซอร์</a>เฉพาะภาพในงาน Galaxy Unpacked เมื่อเดือนที่แล้ว โดยเบื้องต้นซัมซุงเปิดตัวแหวน Galaxy Ring ในรูปของสินค้าต้นแบบ ซึ่งอาจเปลี่ยนแปลงรายละเอียดได้ในภายหลัง</p>\n<p>Samsung Galaxy Ring มีทั้งหมด 3 สี ได้แก่ เงินแพลตินัม, ดำเซรามิก และทอง ออกแบบขนาดเหมือนแหวนมีไซส์ตั้งแต่ 5-13 จุดเด่นสำคัญคือเป็นอุปกรณ์สวมใส่เก็บข้อมูลสุขภาพที่น้ำหนักเบา สามารถเก็บข้อมูลได้ทั้ง การนอนหลับ, อัตราเต้นหัวใจ, การเคลื่อนไหว, การหายใจที่ผิดปกติ ข้อมูลเหล่านี้จะรวบรวมผ่าน Health แอปของซัมซุง แล้วคำนวณเป็นระบบคะแนนสุขภาพในด้านต่าง ๆ</p>\n<p>Dr. Hon Pak รองประธานฝ่าย Digital Health ของซัมซุง บอกว่าความท้าทายของอุตสาหกรรมสุขภาพตอนนี้คือเครื่องมือที่หลากหลาย การเก็บข้อมูลที่กระจัดกระจาย ซัมซุงจึงมีเป้าหมายเป็นหนึ่งในแพลตฟอร์มรายใหญ่ ที่สามารถรองรับการเชื่อมต่ออุปกรณ์ต่าง ๆ เข้าด้วยกันผ่าน Samsung Health รวมทั้งอุปกรณ์สวมใส่ของ Galaxy ซึ่ง Galaxy Ring จะเป็นหนึ่งในอุปกรณ์ที่เข้ามาเปลี่ยนเกม เพราะสามารถเก็บข้อมูลผู้ใช้งานได้ต่อเนื่อง 7 วัน 24 ชั่วโมง และขนาดที่เล็กจึงไม่ทำให้ผู้ใช้งานอึดอัด</p>\n<p>ซัมซุงยังไม่ได้เปิดเผยรายละเอียดสเป็ก ระยะเวลาแบตเตอรี หรือข้อมูลอื่นของ Galaxy Ring ในตอนนี้ แต่บอกว่าสินค้าจะเริ่มขายภายในปีนี้</p>\n<p>ที่มา: <a href=\"https://news.samsung.com/global/editorial-solving-the-digital-health-dilemma-samsungs-vision-for-an-intelligent-health-platform\">ซัมซุง</a> และ <a href=\"https://www.sammobile.com/opinion/first-impressions-of-the-galaxy-ring-are-enough-to-get-us-excited/\">Sam Mobile</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/472abbf6488798e408b40594c6a799de.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/samsung-galaxy\">Samsung Galaxy</a></div><div><a href=\"/topics/samsung\">Samsung</a></div><div><a href=\"/topics/smart-ring\">Smart Ring</a></div><div><a href=\"/topics/samsung-galaxy-ring\">Samsung Galaxy Ring</a></div><div><a href=\"/topics/health\">Health</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cf31817cac0cf9ce440bfe9f558cf9dc91c33829a26be3c4a3f3644ef1b8b7be","category":"Thai"}