{"title":"Declining glacier cover drives changes in aquatic macroinvertebrate biodiversity in the Cordillera Blanca, Perú","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17355?af=R","date":1720767600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/438e3dfb-a19c-44f2-bd8d-b6f2ed1928a3/gcb17355-toc-0001-m.png\" alt=\"Declining glacier cover drives changes in aquatic macroinvertebrate biodiversity in the Cordillera Blanca, Perú\" />\n<p>Ongoing climate change threatens glacier-fed river ecosystems globally, impacting biodiversity through shifts in water availability, temperature, and chemistry. Tropical glacier-fed rivers, like those in the Peruvian Andes, are understudied despite unique stressors. This study examined biodiversity in 10 rivers along a glacier cover gradient. Results showed higher temperatures and stability as glacier cover decreased, correlating with increased local diversity. Analysis revealed turnover in macroinvertebrate communities with reduced glacial influence. Certain taxa may be vulnerable to glacier retreat. Despite differences from other regions, findings support predictable biodiversity responses to climate change in mountainous areas.</p>\n<br />\n<h2>Abstract</h2>\n<p>Ongoing climate change threatens the biodiversity of glacier-fed river ecosystems worldwide through shifts in water availability and timing, temperature, chemistry, and channel stability. However, tropical glacier-fed rivers have received little attention compared to those in temperate and Arctic biomes, despite their unique biodiversity potentially responding differently due to additional stress from higher altitude locations thus lower oxygen availability, diurnal freeze–thaw cycles, and annual monsoon rainfall disturbances. This study quantified aquatic biodiversity responses to decreasing glacier cover in the Cordillera Blanca range of the Peruvian Andes. Ten rivers were studied along a gradient of decreasing glacier cover in the Parón, Huaytapallana, and Llanganuco basins, with a specific focus on macroinvertebrates and physicochemical parameters in both the dry and wet seasons. We found higher temperatures, more stable and lower turbidity rivers as glacier cover decreased, which were related significantly to higher local diversity and lower β-diversity. Analysis of similarity revealed significant differences in the macroinvertebrate community among rivers with high, medium, or low glacier cover, illustrating turnover from specialists to generalists as glacial influence decreased. Redundancy analysis demonstrated that there were more species found to prefer stable beds and water temperatures in medium and low glacier cover in a catchment rivers. However, certain taxa in groups such as <i>Paraheptagyia</i>, Orthocladiinae, <i>Anomalocosmoecus</i>, and <i>Limonia</i> may be adapted to high glacial influence habitats and at risk of glacier retreat. Although species composition was different to other biomes, the Cordillera Blanca rivers showed similar benthic macroinvertebrate biodiversity responses to glacier retreat, supporting the hypothesis that climate change will have predictable effects on aquatic biodiversity in mountain ranges worldwide.</p>","author":"Edson Palacios‐Robles, \nKaty Medina, \nEdwin Loarte, \nAlberto Castañeda‐Barreto, \nMiriam Gamboa‐Mendoza, \nRosario Polo‐Salazar, \nPedro Tapia, \nFrancesca Pellicciotti, \nLee E. Brown","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"cf3de81db99e815c1a65a28bd1a8d1bba5830073399879d0e4833172b8439bee","category":"Environment"}