{"title":"Apple’s iMessage is not a “core platform” in EU, so it can stay walled off","link":"https://arstechnica.com/?p=2003018","date":1707851164000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1831276105-800x533.jpg\" alt=\"Apple Messages in a Mac dock\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1831276105-scaled.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple's iMessage service is not a \"gatekeeper\" prone to unfair business practices and will thus not be required under the Fair Markets Act to open up to messages, files, and video calls from other services, the <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/mex_24_785#:~:text=Commission%20closes%20market%20investigations%20on%20Microsoft's%20and%20Apple's%20services%20under%20the%20Digital%20Markets%20Act\">European Commission announced earlier today</a>.</p>\n<p>Apple was one of many companies, including Google, Amazon, Alphabet (Google's parent company), Meta, and Microsoft to have its \"gatekeeper\" status investigated by the European Union. The iMessage service did meet the definition of a \"core platform,\" serving at least 45 million EU users monthly and being controlled by a firm with at least 75 billion euros in market capitalization. But after \"a thorough assessment of all arguments\" during a five-month investigation, the Commission found that iMessage and Microsoft's Bing search, Edge browser, and ad platform \"do not qualify as gatekeeper services.\" The unlikelihood of EU demands on iMessage was <a href=\"https://arstechnica.com/apple/2023/12/imessage-will-reportedly-dodge-eu-regulations-wont-have-to-open-up/\">apparent in early December</a> when <a href=\"https://www.bloomberg.com/news/articles/2023-12-06/apple-imessage-set-to-avoid-eu-s-digital-dominance-crackdown?srnd=technology-vp\">Bloomberg reported</a> that the service didn't have enough sway with business users to demand more regulation.</p>\n<p>Had the Commission ruled otherwise, Apple would have had until August to open its service. It would have been interesting to see how the company would have complied, given that it provides end-to-end encryption and registers senders based on information from their registered Apple devices.</p></div><p><a href=\"https://arstechnica.com/?p=2003018#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2003018&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cf3fa5bfb5a4c7873e907da6384f2d873bf85ba3d91744c0898c71ba27bc7f9b","category":"Tech"}