{"title":"Sam Bewley and the art of doing nothing","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sam-bewley-and-the-art-of-doing-nothing","date":1638357093000,"content":"\n      <p><strong><strong>﻿</strong></strong>If you were going to be confined inside a hotel room for seven days, what would you want with you? Your partner? Your bike?</p>\n<p>When BikeExchange domestique Sam Bewley decided to fly home to New Zealand for the first time in two years, these were important considerations. The country has some of the world’s strictest quarantine procedures, designed to curb the incursion of Covid-19 into the community.</p>\n<div></div>\n<p>Returning citizens and their relations are required to quarantine on arrival and return negative Covid tests before being allowed out into the fresh blue air of the southern hemisphere. What this means is that upon touchdown, jet-lagged kiwis are whisked to one of many specially-adapted hotels where they remain in their rooms for the period of their isolation. Meals are brought to rooms and time outdoors is strictly limited and timetabled. It’s a system that worked remarkably well until August 2021 when the virus escaped, plunging the country into severe restrictions which remain in place in and around Auckland.</p>\n<p>Thus it was that Sam Bewley and his British partner Hannah Barnes, who races for Canyon-SRAM, found themselves confined to the Sheraton Hotel, Auckland, for seven days of managed isolation quarantine (MIQ) in mid-November. By sheer chance, they landed one day after the mandatory isolation period was slashed down from two weeks, cutting their incarceration in half. The experience is still restrictive and expensive but it was worth it for Bewley, for whom the global pandemic has meant a long two years away from friends and family.</p>\n<p>So, he had his partner. He had his bike. A turbo trainer was sent to him by a cousin and delivered to the hotel room. And back down under after such a long time, home comforts were just a click away.</p>\n<table>\n<tbody>\n<tr>\n<td>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG-20211118-WA0007_1024x1024.jpg?v=1637587379\" /></div>\n</td>\n<td>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG-20211118-WA0008_1024x1024.jpg?v=1637587195\" /></div>\n</td>\n<td>\n<div></div>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG-20211118-WA0006_1024x1024.jpg?v=1637587285\" /></div>\n</td>\n</tr>\n</tbody>\n</table>\n\n<p><em>Images: 1.“We as professional bike riders are a lot more desensitised to sitting in a hotel room for a week”. Credit: Hannah Barnes 2. Kiwi home comforts. Credit: Sam Bewley 3. \"<span>It’s quite difficult to do, to lie on a hotel bed all day, sit in a hotel room all day. It’s pretty foreign for a lot of people. We’ve mastered the art of doing that without going crazy.” Credit: Sam Bewley</span></em></p>\n<p>“I don’t know why but I went in real hot on the first day and ordered all this stuff from Countdown [supermarket],” Bewley says from his double room overlooking the city’s famous Sky Tower, his feet up and the cricket on the TV. “I must have forgotten that I was here in New Zealand for a couple of months, and that I’ve got time. I decided to get it all at once. Then I looked at the calendar and thought, f***, we’re out of here [the hotel] in four days and I’ve got a fridge full of food.”</p>\n<p>Top of the list were Bluebird salt and vinegar chips, or crisps to British readers, a bottle of NZ wine, a block of Tasty cheese [‘it’s sharper than most’] and some chunky chowchow pickle to go with it, a packet of ginger biscuits [‘the ultimate dunker’] some TimTams chocolate biscuits [‘there is no substitute’] and of course the ideal food for seven days of quarantine: mussels.</p>\n<p>“Hannah was looking at me like, ‘what is wrong with you!?’ New World supermarket have these little pots of mussels, pre-marinated, and I love them, so I got a pot of them in.</p>\n<p>“Once I get out of here and get a bit more freedom I’m looking forward to having a pie. Mince and cheese pie would be good.”</p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/it-s-always-sunny-in-watopia-confessions-of-a-late-zwift-adopter\">Related: It's always sunny in Watopia – confessions of a late Zwift adopter</a></em></strong></p>\n<p>Peculiarities of Kiwi cuisine aside, the timing of Bewley and Barnes’ not-quite-solitary confinement couldn’t have been better. The two were just emerging from their five-week off-season and motivation to get back to training was high. Exercise thus provided the structure to a brief period where the world was restricted to a cramped, sealed cube where they weren’t allowed to open the windows and time risked stretching out into a featureless, jet-laggy oblivion.</p>\n<p>“First thing in the morning we find a video on YouTube, either a stretching routine or a hard workout to get a sweat on. It’s just 30 minutes but you feel a million times better as soon as you do it,” Bewley says. “Then we jump on the bike and do one two sessions on the bike each day, nothing crazy, 45 mins to an hour with a few little efforts just to get sweaty.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1337828411_1024x1024.jpg?v=1637601716\" /><em>Sam Bewley in the breakaway during the 17th Benelux Tour 2021 (Image: Luc Claessen<span>/</span><span>Stringer)</span></em></p>\n<p>Professional cyclists spend hundreds of days on the road, year after year, and so become experts in hotel living. Bewley, 34, has spent the best part of nine months of his life staying in hotel rooms over his nine Grand Tours alone. This one is a little different, although he’d be “happy if I got this in a Grand Tour.” Hotel staff provide daily quizzes and competitions. He’s been catching up on the Black Caps’ cricket matches. ‘Guests’ aren’t allowed outside their rooms until they return a negative Covid test after three days, but then they are then allowed a 30-minute time slot in a small, fenced outdoor exercise yard patrolled by members of the NZ armed forces (there have been past abscondments) where heavy breathing is strictly prohibited.</p>\n\n<p><em><strong><span><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-cycling-training-apps-the-desire-selection\">Related – The Best Cycling Training Apps: The Desire Selection</a></span></strong></em></p>\n<p>Washing is done by hand in the bath, which harks back to any professional rider’s days in the amateur ranks or the era before washing machines became a fixture of a professional team’s materiel. Experiences between various MIQ hotels vary but Bewley insists that for survival and sanity under such draconian restrictions, “exercise is the number one thing.” There have been no more cooking videos, for which he became a bit of a social media sensation during the first wave of international lockdowns. For one thing, he doesn’t have a kitchen.</p>\n<p>“Sweating. Sweating in general makes people feel good. Then you can buy yourself a couple of little treats. You can sit down and watch a movie with a glass of wine and feel a bit better about yourself. Reward yourself for doing a bit of exercise.</p>\n<p>“As much as there are better things I can do with seven days, we as professional bike riders are a lot more desensitised to sitting in a hotel room for a week. We can handle it. We do it so much. We’ve done it for many years, so many days a year.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-smart-turbo-trainers\">Related: Best Smart Turbo Trainers</a></em></strong></p>\n<p>“We know how to entertain ourselves and we’ve learned the art of doing nothing. It’s quite difficult to do, to lie on a hotel bed all day, sit in a hotel room all day. It’s pretty foreign for a lot of people. We’ve mastered the art of doing that without going crazy. We have to do it as part of our job. In that sense it’s less daunting for us compared to some other people.”</p>\n<p>After seven days in Auckland, Bewley and Barnes were permitted to complete the remaining two days of their isolation at Bewley’s home town of Rotorua, as long as they returned a negative test on day nine. It’s only a two hour drive south from Auckland but Rotorua was a town heavily dependent on international tourists, and after closed borders to all but Kiwi citizens Bewley was a little uncertain about the changes those two years have wrought on the place where he grew up.</p>\n<p>“It was a weird feeling in the days leading up to coming over here,” he says. “Two years away I had settled so much more in Andorra and Spain and less settled in NZ. In that two-year period the pandemic has gone around the world and done different things in different countries, so I wasn’t exactly sure what I was walking into here.</p>\n<p>“You can only read reports and until you actually experience it yourself you don’t know what it’s about. But I’m excited to be back. One of the big driving factors was my brother’s wedding in December. I’m looking forward to that, and to introducing Hannah to the family.”</p>\n<table>\n<tbody>\n<tr>\n<td> </td>\n<td><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG-20211118-WA0004_1_1024x1024.jpg?v=1637602249\" /></td>\n<td><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG-20211118-WA0011_1_1024x1024.jpg?v=1637601074\" /></td>\n</tr>\n</tbody>\n</table>\n\n<p><em>Images: 1. Exercise is the number one thing for survival in a hotel room for a week. Credit: Sam Bewley 2. The ‘exercise yard’ where quarantined arrivals are allowed 30 minutes at a time. Credit: Sam Bewley </em></p>\n<p>With local restrictions still causing uncertainty about travel within New Zealand, Bewley simply hopes to be able to spend a simple Kiwi Christmas and New Year down at a friend’s bach [beachside summer house].</p>\n<p>“Ultimately we have to prepare for a racing season too. Once we get out of here we’ll be back, nose to the grindstone, with some big training weeks, and then hopefully a few games of golf in around that.”</p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/how-to-train-in-heat\"><span>Related – How to train indoors in the heat</span></a></em></strong></p>\n<p>Yet an outstanding question is one that is relevant to all expat bike racers who spend significant amounts of time living overseas, especially those anglophones living in continental Europe. Does living overseas for two years make you any less Kiwi?</p>\n<p>“All my friends in Europe tell me I haven’t lost my kiwiness because I walk around in bare feet all the time - if I’m not barefoot I wear jandals [flipflops]– and I wear a lot of singlets [sleeveless vests]. I’m all round just a scruffy guy, you know! Which is how I grew up.</p>\n<p>“My accent has probably faded and I do notice that whenever I come home and hang around with my friends I start to talk a little differently and use different words, the accent starts to come back again.</p>\n<p>“Given the last couple of years and the way that Covid hit Europe and was so big in Spain where I was, it’s kind of changed my opinion on some things. But my Dad always says you can never take the Kiwi out of Sam and I think he’s right to a certain degree.</p>\n<p>“I might be a little more refined now but I think I’m still a Kiwi boy at heart.”</p>\n\n<p><b><i>Rouleur's content is supported by Zwift. Find out more about riding with Zwift this winter </i></b><b><i><a target=\"_blank\" href=\"https://www.zwift.com/uk/neokyo?utm_source=cm&amp;utm_medium=cpm&amp;utm_campaign=zwift_glo_all_cycling_specialistdirect_neokyo_brand_-brandawareness-rouleur\">here</a></i></b></p>\n<p><em>Cover image: Tim de Waele/Getty </em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cf459429c5e045db3ccbfc9fec174ccadb77115c0e8e7192baf11e18dfc6f28c","category":"Cycling"}