{"title":"Apple Releases Magic Keyboard Firmware Update With Bluetooth Security Fix","link":"https://www.macrumors.com/2024/01/11/apple-releases-magic-keyboard-firmware-update/","date":1704985262000,"content":"Apple on Tuesday released Magic Keyboard firmware version 2.0.6 with a fix for a <a href=\"https://github.com/skysafe/reblog/blob/main/cve-2024-0230/README.md\">Bluetooth-related security vulnerability</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/08/magic-keyboard-hands-on.jpg\" width=\"2000\" height=\"1125\" />\r<br />\n\"An attacker with physical access to the accessory may be able to extract its Bluetooth pairing key and monitor Bluetooth traffic,\" an <a href=\"https://support.apple.com/en-us/HT214050\">Apple support document</a> says.\r<br />\n\r<br />\nThe firmware update is available for various Magic Keyboard models for the Mac, including the standard Magic Keyboard, Magic Keyboard with Numeric Keypad, Magic Keyboard with Touch ID, and Magic Keyboard with Touch ID and Numeric Keypad.\r<br />\n\r<br />\nMagic Keyboard firmware updates are automatically installed while the keyboard is paired to a device running macOS, iOS, iPadOS, or tvOS, with no way to manually apply an update. To check a Magic Keyboard's firmware version on a Mac, open the System Settings app, click Bluetooth, and click on the info button next to your keyboard.\r<br />\n\r<br />\nApple's full security disclosure:<blockquote><strong>Bluetooth</strong>\r<br />\n\r<br />\nAvailable for: Magic Keyboard; Magic Keyboard (2021); Magic Keyboard with Numeric Keypad; Magic Keyboard with Touch ID; and Magic Keyboard with Touch ID and Numeric Keypad\r<br />\n\r<br />\nImpact: An attacker with physical access to the accessory may be able to extract its Bluetooth pairing key and monitor Bluetooth traffic\r<br />\n\r<br />\nDescription: A session management issue was addressed with improved checks.\r<br />\n\r<br />\nCVE-2024-0230: Marc Newlin of SkySafe</blockquote>This is the first firmware update for some Magic Keyboard models in several years, according to <em>MacRumors</em> contributor <a href=\"https://twitter.com/aaronp613\">Aaron Perris</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/11/apple-releases-magic-keyboard-firmware-update/\">Apple Releases Magic Keyboard Firmware Update With Bluetooth Security Fix</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-magic-keyboard-firmware-update-with-bluetooth-security-fix.2416063/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cf4aeadae0f31eaa7235f1edcbf0473b18a42d5382e88d81f0046e7df6ed0e64","category":"Apple"}