{"title":"Wahoo KICKR RUN Treadmill: First Run Thoughts!","link":"https://www.dcrainmaker.com/2024/01/wahoo-kickr-run-treadmill-first-thoughts.html","date":1706015676000,"content":"<p> </p>\n<p>As a general rule of thumb, I avoid running on treadmills as much as humanly possible. I save the dreadmill for only the most miserable of sideways almost-freezing rain windy of winter nights. Usually, I make a point of going out on the road when at all possible.</p>\n<p>But it’s quite possible the new <a href=\"http://wahoofitness.com/devices/running/treadmills\">Wahoo KICKR RUN</a> might change that. I got the chance to do some test runs on it, getting an initial look at things from a hardware and software standpoint, as well as testing out all the new smarts inside of it.</p>\n<p>And it’s clear, this is unlike any treadmill we’ve seen before. Sure, it’s got a belt, and goes round-de-round, but it’s got time of flight sensors to detect your exact position on the treadmill, allowing you to control the pace merely by moving your body within the belt. It can tilt left and right, to simulate curves in the virtual terrain (or, simply to deal with uneven floors). And it’s got integration across virtually every type of connectivity possible: WiFi, Ethernet, Bluetooth, ANT+, including both control and passive recording. It’s effectively the holy grail of tech treadmills.</p>\n<p>At least, if Wahoo can pull it off. Which, as always, may take a bit longer than they expect.</p>\n<p>Still, for this post (and honestly, you should just watch the video above), I dive into the hardware and how everything works. With that, let’s get started.</p>\n<h3><span><strong>The Tech Specs:</strong></span></h3>\n<p><img title=\"Wahoo-KICKR-RUN-Treadmill-MainPhoto.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Treadmill-MainPhoto.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Let’s just get a quick list of tech specs out of the way first, before we dive into explaining all the pieces.</p>\n<p><strong>– Top Pace:</strong> 4:00/mi (2:28/km)<br />\n<strong>– Top Speed: 1</strong>5MPH (24KPH)<br />\n<strong>– Maximum Incline:</strong> +15%<br />\n<strong>– Maximum Decline:</strong> -3%<br />\n<strong>– Belt Length:</strong> 69” (175cm)<br />\n<strong>– Belt Width:</strong> 22” (56cm)<br />\n<strong>– Weight of treadmill:</strong> 275lbs<br />\n<strong>– Max Runner Weight:</strong> 250lbs<br />\n– Laptop/tablet/phone holder (up to 17” in size)<br />\n– USB-C 24w Charging (for tablets/laptops/phones)<br />\n– 110v or 220v options (for different global regions)<br />\n– 3.0 Horsepower motor<br />\n– Time of flight sensors for position<br />\n– Individual actuators for incline<br />\n– WiFI Connectivity (using Wahoo Direct Connect)<br />\n– Ethernet Connectivity (using Wahoo Direct Connect)<br />\n– Bluetooth FTMS Control<br />\n– ANT+ Footpod (for connecting to watches/etc)<br />\n– Bluetooth Smart Footpod (for connecting to watches/etc)<br />\n– Wahoo Treadmill API control</p>\n<p>Again, we’ll get into all these specs down below.</p>\n<h3><span><strong>Hardware Basics:</strong></span></h3>\n<p><img title=\"Wahoo-KICKR-RUN-Treadmill-Belt.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Treadmill-Belt.jpg\" width=\"720\" height=\"480\" /></p>\n<p>As we saw with the TechnoGym MyRun treadmill, the assumption here is that you’re using some app/platform for most runs. You don’t need to though, you can run without any app at all using just the levers. But the treadmill is designed for a minimalist console look, while still supporting places to put tablets, laptops, phones, and more (and charge them).</p>\n<p>To begin, looking at the console, you’ve got an incline/decline lever on the left side, and then a pace control lever on the right side. If running with an app like Zwift, it’ll automatically control the incline/decline. Likewise, if you’ve got an app that is doing a structured workout – it too can control the treadmill pace. Still, if you want to manually control pace you can do so:</p>\n<p><img title=\"Wahoo-KICKR-RUN-Console-Controls.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Console-Controls.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The pace lever is sensitive to how much it’s being pushed. It differentiates between shorter and longer presses, and in turn, those presses have differing amounts of pace jumps depending on your current pace. For example, if you tap it quickly while walking, it’ll jump a bigger gap than while running full-speed. Likewise, you can long-hold it to adjust per-second pace. I demonstrate this in the video.</p>\n<p>Meanwhile, in the middle of the console you have the current incline and pace listed (in either miles or kilometers pace units), as well as a stop button, RunFree button (more on that in a second), and some connectivity status icons.</p>\n<p><img title=\"Wahoo-KICKR-Run-MainConsole.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-MainConsole.jpg\" width=\"720\" height=\"480\" /></p>\n<p>There’s also a safety clip there too.</p>\n<p>Behind that is a removable shelf for placing laptops, tablets, and phones. It’s got a sticky-grip surface on it, and has two core modes. The first is a little pop-up tray for tablets/phones, to keep them in place:</p>\n<p><img title=\"Wahoo-KICKR-Run-iPadHolder.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-iPadHolder.jpg\" width=\"720\" height=\"480\" /></p>\n<p>But it’s really designed as a big laptop holder:</p>\n<p><img title=\"Wahoo-KICKR-RUN-Laptop-Running.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Laptop-Running.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Looking at the underside, you can see just how much bigger this area is, with a larger surface area for laptops (up to 17”, which…is massive). It even has a strap that wraps around it, just to provide that little bit of extra security:</p>\n<p><img title=\"Wahoo-KICKR-RUN-Laptop-Holder-Underside.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Laptop-Holder-Underside.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Here’s a look at that strap:</p>\n<p><img title=\"Wahoo-KICKR-Run-LaptopStrap.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-LaptopStrap.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Additionally, as you can see in the video, I tested it out with a 17” laptop running at 4:30/mile and everything is very solid. It’s not going anywhere (well, unless you detach the front shelf manually). Seriously, it’s a beast of an out-front mount.</p>\n<p>Additionally, it has USB-C power charging, up to 24 watts currently. I’d like to see that be upgraded to about 60w. While a 90w charger would charge most mainstream laptops, a 60w charger will easily keep battery level while running Zwift for most laptops. Wahoo says that they are able to hold charge on a 24w laptop, though again, a 60w really does future-proof this a bit more. All of which is more than fine for tablets though.</p>\n<p>Next there are the supports, which were plenty sturdy for me (including doing a bunch of b-roll filming where I was jumping on/off them at high speeds for different shots of my feet running on the treadmill).</p>\n<p><img title=\"Wahoo-KICKR-RunBackRun.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RunBackRun.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The belt length is 69” long, though 56” to where the curvature begins. The belt width is 22”. Again, I had no issues here running on this treadmill (I’m 6’2” tall). The official spec for the treadmill supports a 250lb runner, though Wahoo says it’s designed for more than that. Part of that weight spec is also maintaining their pace accuracy specs, which in current testing has them at +/- 3%. It sounds like they may have better claims down the road by the time it starts shipping.</p>\n<p>Wahoo says they’re aiming for a hard compact dirt feel to the running belt, which, I guess it honestly felt like other treadmills I’ve run on (including my Peloton Tread). However, I didn’t have those side-by-side, so it’s a bit hard to compare a day or two apart. Once I get a unit into the DCR Cave, I can do direct side-by-side feel testing (and thus, my opinion may change). Still, it felt good, no issues there.</p>\n<p>Note that the back of the KICKR RUN belt does have a protector, to prevent objects/children/pets from being sucked under the treadmill. You can see the black casing right at the edge of the treadmill belt:</p>\n<p><img title=\"IMG_1577.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1577.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In terms of the weight, the unit weighs 275lbs. You can pick up the rear of the unit, and roll it around on the front wheels. Alternatively, Wahoo is working on a castor-type solution that would attach to the rear and let you simply roll it around. That accessory likely won’t be ready for launch, but the rear of the treadmill is already designed for it at launch.</p>\n<p>Lastly, you’ll notice three little buttons up top. These serve two purposes. First, they’re used to unlock the treadmill (protecting against kids), akin to a key-code of sorts. And secondly, they’re leveraged by apps for moving around the app. Wahoo and Zwift say that by launch, these buttons will allow for navigation/core functions within the Zwift app. But other apps can leverage it too. You can see them in the middle here:</p>\n<p><img title=\"Wahoo-KICKR-Run-ManualMode.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-ManualMode.jpg\" width=\"720\" height=\"480\" /></p>\n<p>With those hardware bits covered, let’s dive into the unique features.</p>\n<h3><span><strong>RunFree Mode:</strong></span></h3>\n<p>Unquestionably, the coolest feature on the KICKR RUN is the new RunFree mode. This mode essentially lets you control the pace without touching anything.</p>\n<p>First though, from a background standpoint, generally speaking, powered treadmills run one of two core ways:</p>\n<p><strong>1) Manually pace control:</strong> You push buttons to speed up/slow down)<br />\n<strong>2) Automated pace control:</strong> A treadmill app following a structured workout with pre-defined paces)</p>\n<p>In addition, for non-powered treadmills, there’s the so-called ‘Manual’ or ‘Self-powered’ mode, where your body weight moves the treadmill belt based on how fast you move your legs/feet. Some people enjoy that, though personally, I find it wonky and unrealistic. To each their own.</p>\n<p>However, RunFree mode takes the conceptual idea of free-style/manual mode, but uses fancy sensors and a very fast motor controller to provide pace control by just moving your body forward/backwards on the belt.</p>\n<p>The way this works is that just under the ‘Stop’ button is a time-of-flight sensor. This constantly updating sensor detects exactly where you are relative to the front console. You can see it here:</p>\n<p><img title=\"Wahoo-KICKR-Run-OpticalSEnsor.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-OpticalSEnsor.jpg\" width=\"720\" height=\"480\" /></p>\n<p>As you move forward towards the console, the treadmill speeds up. And as you slide backward on the belt, the treadmill slows down. Except, it does this insanely fast – so fast you don’t even think about it, it’s just like running outdoors. Note that in order to activate this, you need to tap the ‘RunFree’ button:</p>\n<p><img title=\"Wahoo-KICKR-Run-FreeRunMode.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-FreeRunMode.jpg\" width=\"720\" height=\"480\" /></p>\n<p>I show this (a ton) in the video up above, working in real-time, and it’s absolutely mind-boggling. For example, as I crest a hill and start going back downhill (with Zwift controlling the incline on the treadmill so now I’m actually running downhill in terms of the pitch of the treadmill), my body naturally starts to run faster. Never once touching anything, I’m quickly running down this hill at a 5:30/mile pace, because that’s what feels natural. As I start up the next set of hill rollers, my pace slows down, because that’s what happens at 8% incline going up. Again, without touching anything. It is astoundingly addictive.</p>\n<p><img title=\"vlcsnap-2024-01-23-14h09m36s527.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/vlcsnap-2024-01-23-14h09m36s527.jpg\" width=\"720\" height=\"405\" /></p>\n<p>But more importantly, it’s really fast. In the video, I show how at the end of an interval I was doing on the track, I went from 5:30/mile to a walking pace, in about 2.5-3 seconds. For reference, I tried that exact same pacing on the <a href=\"https://www.dcrainmaker.com/2023/10/technogym-myrun-treadmill-review.html#accuracy-and-responsiveness\">TechnoGym MyRun treadmill in my review last year</a>, and that took about 18-23 seconds to transition.</p>\n<p>If you’ve ever done intervals on a treadmill before, you know how frustrating it can be to wait for a treadmill to slow down (or speed up) at the end of an interval. That simply doesn’t exist here.</p>\n<h3><span><strong>Tilting Side-to-Side:</strong></span></h3>\n<p>Next, is a feature that started off as a way to level the treadmill on uneven surfaces, but is one that Wahoo hopes to turn into a different sensation. The treadmill has two independent front actuating legs/feet. In normal operation, these front feet incline and decline the treadmill. However, unlike most treadmills, these two aren’t connected/attached physically together. Instead, they operate independently. This allows Wahoo to effectively tilt the treadmill left and right.</p>\n<p>The initial reason was to allow you to adjust the treadmill if your floors were uneven, up to 1.5° offset for each side.</p>\n<p><img title=\"Wahoo-KICKR-RUN-Actuators.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-RUN-Actuators.jpg\" width=\"719\" height=\"479\" /></p>\n<p>But now the goal is to allow apps like Zwift to send a secondary set of grade tilt commands to the treadmill, so it can simulate the curvature of a turn, or the unevenness of trail running. Obviously, nobody is throwing rocks down the treadmill at you, and it’s certainly not going to simulate all the complexities of a trail, but it is something that could add that touch of realism that tricks your brain into thinking something bigger is going on.</p>\n<p>As of my initial runs on it, the integration of the tilting feature during a run hadn’t been completed yet (it’s already complete for leveling purposes though), but the hope is that by release, some aspect of that will be complete.</p>\n<h3><strong>More Questions &amp; Answers:</strong></h3>\n<p><span>﻿</span></p>\n<p>This section was added after I initially posted this piece.</p>\n<p>I created a follow-up video and post with answers to 25 previously unanswered questions, including a ton of new details like warranty/deck height/etc… When I have a spare second, I’ll try and incorporate those details back into this main post, but for now you can find all those answers in the video right above, or, in the <a href=\"https://www.dcrainmaker.com/2024/01/wahoo-kickr-run-treadmill-faq.html\">written post here</a>.</p>\n<h3><span><strong>Going Forward:</strong></span></h3>\n<p><img title=\"Wahoo-KICKR-Run-SideRun.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Wahoo-KICKR-Run-SideRun.jpg\" width=\"720\" height=\"480\" /></p>\n<p>So now – the most important piece: The price. This KICKR RUN will cost $5,000USD when it starts shipping, which is slated for the June timeframe (with pre-orders likely a bit before that). It’ll initially launch in the US, and then next summer (2025), it’ll be available beyond the US. This is kinda similar to what they did with the KICKR Bike when that launched.</p>\n<p>The plan is that delivery will be via some form of white-glove service, into your home for setup/etc, but it’s unclear whether or not that’ll be included in that price point. I suppose when you’re paying $5,000 for a treadmill, a few hundred extra dollars for delivery isn’t a deal-breaker.</p>\n<p>While some might see the KICKR RUN as an expensive treadmill (and certainly, it is when compared to budget treadmills), the reality is the specs here actually put it in a much higher class. Most other treadmills that can put out these kinds of speeds run closer to $10K, not the $3-$4K of most other comparative treadmills. And that’s just the speed specs, let alone all the unique connectivity features, RunFree, and tiling modes. Said differently: While the $5,000 price might seem high to many consumers, for those looking carefully at this market and competitors, it’s actually lower than I’d have expected.</p>\n<p>Now obviously, I’ve only had limited time on the treadmill. About 75 minutes of running on it, across a number of scenarios. Certainly not enough to call this a review, or anything like that. That’ll come later this spring. The current plan is I’ll have a non-final prototype for some portion of the remaining winter/spring, and then transition to a final production unit prior to shipping. I’ll use the non-final unit to form longer-term opinions on the features and how they work, and then validate those opinions on the production unit for my final review (whenever they start shipping).</p>\n<p>As such, there are certainly areas I can’t cover today – and even down the road areas I’ll be unable to cover (like long-term reliability aspects, which usually take vast quantities of people at least a year or so, before we get trends).</p>\n<p>Still, looking at things, this is by far the coolest running experience I’ve had to date. It’s insane how well the RunFree mode works, especially with a TV positioned close to you, to simulate some of the sensations of going up/down hills. It’s also just amazing how well this works for an interval workout I did, in terms of quickly going in/out of intervals, and not wasting a bunch of time ramping up/down.</p>\n<p>Nonetheless, I look forward to putting it through its paces down the road, including things like pace accuracy and more.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"cf4f2f1eb99c216e88cfcbad6c4047fcae7a77c09585b172066b25e8dc25abf9","category":"Cycling"}