{"title":"Could these marks on a cave wall be oldest-known Neanderthal “finger paintings”?","link":"https://arstechnica.com/?p=1948722","date":1687379195000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/neanderthal1-800x533.jpg\" alt=\"Examples of engravings\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/neanderthal1.jpg\">Enlarge</a> <span>/</span> Examples of engravings discovered in the Roche-Cotard Cave in France. (left) A \"circular panel\" with arch-shaped tracings. (right) A \"wavy panel\" with two contiguous tracings forming sinuous lines. (credit: <a href=\"https://creativecommons.org/licenses/by/4.0/\">Jean-Claude Marquet, CC-BY 4.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Archaeologists have concluded that a series of engravings discovered on a cave wall in France were made by Neanderthals using their fingers, some 57,000 years ago. They could be the oldest such marks yet found and further evidence that Neanderthals' behavior and activities were far more complex and diverse than previously believed, according to a <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0286568\">new paper</a> published in the journal PLoS ONE.</p>\n<p>As Kiona Smith <a href=\"https://arstechnica.com/science/2021/07/a-neanderthal-carved-a-geometric-design-in-bone-51000-years-ago/\">previously reported</a> for Ars, evidence that Neanderthals could think symbolically, create art, and plan a project has been piling up for the last several years. For instance, about 50,000 years ago, Neanderthals in France <a href=\"https://arstechnica.com/science/2020/04/neanderthals-made-the-worlds-oldest-thread/\">spun plant fibers into thread</a>. In Central Italy, between 55,000 and 40,000 years ago, Neanderthals used birch tar to <a href=\"https://arstechnica.com/science/2019/07/neanderthals-glued-their-tools-together/\">hold their hafted stone tools in place</a>, which required a lot of planning and complex preparation. In 2016, <a href=\"https://arstechnica.com/science/2016/05/unprecedented-discovery-of-mysterious-structures-created-by-neanderthals/\">we reported</a> on archaeologists' announcement that a Neanderthal group wrested hundreds of stalagmites from the floor of a cave inside Bruniquel Cave in Southern France to build elaborate circular structures, their work illuminated only by firelight. </p>\n<p>Archaeologists have also found several pieces of bone and rock from the Middle Paleolithic—the time when Neanderthals had most of Europe to themselves—carved with geometric patterns like cross-hatches, zigzags, <a href=\"https://arstechnica.com/science/2018/05/markings-on-this-flint-flake-had-symbolic-meaning-for-neanderthals/\">parallel lines</a>, and circles. That might mean that the ability to use symbols didn’t originate with modern humans.</p></div><p><a href=\"https://arstechnica.com/?p=1948722#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948722&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cf5080a1d80034b1c652e8e25bb97734e33ec70c29def93c0103c8978d1eae52","category":"Tech"}