{"title":"Analysis of association of sensory and laboratory assessments for quality and consumer acceptability of steamed East Africa highland bananas","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13043?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The relevance of several characteristics for the acceptability of steamed East Africa bananas (matooke) was assessed using consumer-preferred characteristics, the overall liking scores, check-all-that-apply (CATA) and the Just About Right scale. The study was conducted in rural and urban locations in three banana growing regions of Uganda. Two landraces and two hybrids were processed into matooke. Twelve trained panellists evaluated color, taste and texture sensory characteristics.</p>\n<h2>RESULTS</h2>\n<p>Consumers scored matooke from landraces as the most liked. The CATA test showed that the most important characteristics were: smooth mouthfeel, soft to the touch, not sticky, moldable, deep yellow color, attractive, good matooke taste and smell. Principal component analysis confirmed that most of the preferred sensory characteristics were associated with the local genotypes, whereas the less preferred characteristics were associated with hybrids. Correlation analysis revealed strong positive correlations between the consumer assessed characteristics, hardness by touch, softness to touch and yellowness, as well as quantitative laboratory characteristics (moldable, hardness by touch, softness and yellowness) of the steamed matooke. Color assessed by consumers was strongly correlated with the laboratory-assessed color indicators.</p>\n<h2>CONCLUSION</h2>\n<p>The strong associations observed between laboratory-assessed and consumer-based characteristics (moldable by touch and yellowness) suggest the possibility of predicting consumer characteristics using quantitative laboratory sensory assessments. Matooke taste as assessed by consumer panel is strongly associated with smooth texture and deep yellow color, which were the characteristics associated with landraces in the laboratory sensory assessment. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Kenneth Akankwasa, \nPricilla Marimo, \nAlexandre Bouniol, \nRobooni Tumuhimbise, \nMoreen Asasira, \nSarah Kisakye, \nElizabeth Khakasa, \nEdgar Tinyiro, \nYusuf Mukasa, \nLiving Tukashaba, \nMary G. Namuddu, \nPeter B. Ssenyonga, \nDominique Dufour, \nWilberforce Tushemereirwe, \nKephas Nowakunda","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"cf5864ae9275e06657050d84f30b2f32f82d2e51cd2c7163b4393e702703b447","category":"Environment"}