{"title":"The valuation of gross ecosystem product in the three provinces in northeast of China","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12325?af=R","date":1707569126000,"content":"<h2>Abstract</h2>\n<p>Achieving sustainable development is an issue of global concern. Accounting for the gross ecosystem product (GEP) value can specifically quantify the value of ecosystems for people, which is conducive to the formulation of sustainable management decisions. We have improved the GEP framework accounting method for the first time and evaluated the ecosystem service value of 36 cities in three provinces in the northeast (TPN) of China from 2000 to 2019, which provides decision-making references for the sustainable development of TPN. The main accounting results and policy recommendations are as follows: (1) The ecological value of Northeast China is in an upward stage—GEP has increased from 3.1 trillion yuan in 2000 to 4.5 trillion yuan in 2019, with climate regulation and water conservation functions being the main driving factors for GEP. (2) Based on the dual analysis of GEP and gross domestic product (GDP), there is still high room for improvement in most cities in the TPN region. While ensuring the protection of ecosystem services, cities can convert ecological value into economic value through carbon trading, water rights trading, ecological compensation, and other methods based on ecological characteristics, which is conducive to the sustainable development of GDP and GEP in the TPN region in the future. (3) The cold and hot spot analysis of GEP also provides decision-making basis for the planning of future ecosystem service protection areas in the TPN region.</p>","author":"Yu Fan, \nJiayang Ji, \nChanggeng Jia, \nMing Lei, \nWenjun Wu, \nYun Zheng, \nZichao Wang, \nGuohui Zhang, \nYoutao Song","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"cf70d74acd3ed178f4dad70ad399b1c860631486cca1242e150a386b8310f600","category":"Environment"}