{"title":"The Effect of &ldquo;Proanthocyanidin&rdquo; on Ischemia-Reperfusion Injury in Skeletal Muscles of Rats","link":"https://www.preprints.org/manuscript/202403.1456/v1","date":1711353228000,"content":"BACKGROUND: Lower limb skeletal muscle ischemia-reperfusion (IR) injury associated with increased morbidity and mortality is common in several clinical situations such as aortic aneurysms repairment, peripheral arterial surgery, vascular injury repairment, and shock. Although it is generally accepted that oxidative stress mediators have a significant role in IR injury, its precise mechanism is still unknown. Anecdotally, it is sustained not only by structural and functional changes in the organ it affects but also by damage to distant organs. The purpose of this report is to illustrate the effect of proanthocyanidin on IR injury.\nMETHODS: In our study, 18 male Wistar albino rats were used. The subjects were divided into three groups of six each. (Group Control-C, Group Ischemia-Reperfusion -IR, Group Ischemia-Reperfusion and Proanthocyanidin-IR-PRO). Intraperitoneal proanthocyanidin was given to the IR and proanthocyanidin groups 30 minutes before laparotomy and 1-hour ischemia led to these two groups. After one hour, reperfusion started. Muscle atrophy-hypertrophy, muscle degeneration-congestion, fragmentation-hyalinization, muscle oval-central nucleus ratio, leukocyte cell infiltration, catalase enzyme activity, and TBARS were all examined in lower-limb muscle samples after one hour of reperfusion.\nRESULTS: When skeletal muscle samples were evaluated histopathologically, it was discovered that muscle atrophy-hypertrophy, muscle degeneration-congestion, fragmentation-hyalinization, and leukocyte cell infiltration with oval-central nucleus standardization were significantly higher in the IR group than group control and group IR-proanthocyanidin. Besides, oval-central nucleus standardization was significantly higher in the IR and proanthocyanidin group than in the control group. TBARS levels were significantly higher in the IR group than in the control and IR-proanthocyanidin groups while, catalase enzyme activity was found to be significantly lower in the IR group than in the control and IR and proanthocyanidin groups.\nCONCLUSION: As a consequence of our research, we discovered that proanthocyanidins administered before IR have a protective impact on skeletal muscle in rats. Further research in this area is required.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cf71b5f5caa83529dcd4a0db8581007426e1a5411eb5cfb80431d024cedc2957","category":"Interdisciplinary"}