{"title":"Knowledge and intentions to use fertility preservation among urban Chinese cancer patients: A study from Hong Kong","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307715","date":1726063200000,"content":"<p>by Louis S. Chan, Kim L. Cochon, Tin C. Li, Jacqueline P. W. Chung, Jean H. Kim</p>\r\nObjective <p>To assess the knowledge levels and fertility preservation (FP) intentions of urban Chinese cancer patients.</p> Methods <p>A cross-sectional study was conducted on Hong Kong Chinese male and female cancer patients aged 18–54 years (N = 325) who were recruited by a local non-governmental organization for cancer patients between July 2020 to January 2021. Patients completed a self-administered questionnaire on knowledge, perceptions, and intentions to use FP services/seek FP-related information. Multivariable logistic regression was used to explore the correlates of intention to seek additional FP information and intention to undergo FP treatments.</p> Results <p>Although cancer patients demonstrated a good knowledge of the available FP treatment options, they were less knowledgeable about the legal restrictions of these procedures. Only one in seven cancer patients first became aware of FP through a health provider and the majority of cancer patients felt they did not have adequate knowledge about FP to make informed FP decisions at the current time. Yet, over one-third of cancer patients would consider FP options even if their cancer or cancer treatment had &lt; 5% chance of causing infertility, and 13.4% of females and 14.6% of males would delay their cancer treatment by ≥ 3 months to undergo FP procedures. However, for both sexes, the main perceived barrier to obtaining FP was its financial cost. Patients with older-aged spouses were less likely to seek FP treatments or seek more information about FP.</p> Conclusion <p>There is an unmet need for more FP information and FP services for reproductive-aged cancer patients in East Asian populations. Greater integration of FP services into cancer treatment requires a reduction of cost barriers, greater provision of timely FP information, and improved referral systems.</p>","author":"Louis S. Chan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cf78bcb34c290705f35d349462b6a7f531a126bd252c22e522a9ab2d656baeb4","category":"Interdisciplinary"}