{"title":"iOS 15 is out now with Live Text, Focus, offline Siri, and much more","link":"https://www.macworld.com/article/348126/ios-15-public-beta-install-profile-features-updates-release.html","date":1632157568000,"content":"<div>\n<section><div></div></section><p>After beta testing iOS 15 all summer, Apple has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/09/ios-15-is-available-today/&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">released its latest operating system</a> to iPhones everywhere. It’s got a host of new features, including offline Siri processing, Live Text, and Focus modes, as well improvements to FaceTime, Photos, Spotlight, Weather, and much more. </p>\n\n\n\n<p><em><strong>Update 09/20/21:</strong> iOS 15 has been <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/09/ios-15-is-available-today/&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">officially released</a>.</em></p>\n\n\n\n<p>Not everything Apple promised for iOS 15 is in this initial release. The much-debated CSAM detection has been delayed while Apple makes some changes, and features like SharePlay and Legacy Contacts are coming later this year, too. We have a <a href=\"https://www.macworld.com/article/353957/ios-15-features-missing-at-launch.html\">guide to some of the delayed features</a>.</p>\n\n\n\n<p><em>[<a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">For more tips, tricks, news, features, and updates, check out our iOS 15 superguide.</a>]</em></p>\n\n\n\n<h2>How to get iOS 15</h2>\n\n\n\n<p>To update your iPhone to iOS 15 (or iPad to iPadOS 15), simply open the <em>Settings</em> app, tap <em>General</em>, then <em>Software Update</em>. Depending on if you have the latest version of iOS 14 installed, you may need to click on the tab near the bottom of the screen.</p>\n\n\n\n<p>It can sometimes take a few hours for the update to be available worldwide, so if you don’t see it right away, try again in a little while.</p>\n\n\n\n<h2>iOS 15 Release Notes</h2>\n\n\n\n<p>Apple’s complete release notes for this iOS 15 release are as follows.</p>\n\n\n\n<blockquote><p>iOS 15 brings audio and video enhancements to FaceTime, including spatial audio and Portrait mode. Shared with You resurfaces the articles, photos, and other shared content from your Messages conversations in the corresponding app. Focus helps you reduce distractions by filtering out notifications based on what you are currently doing. Notifications have been redesigned and a new notification summary delivers a collection of notifications so you can catch up on your own time. Maps delivers a beautiful redesign with a new three-dimensional city experience and augmented reality walking directions. Live Text uses on-device intelligence to recognize text in photos across the entire system and on the web. New privacy controls in Siri, Mail, and more provide transparency and give you more control over your data.</p><p>For information on the security content of Apple software updates, please visit this website:<br /><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/kb/HT201222&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">https://support.apple.com/kb/HT201222</a></p><p><strong>FaceTime</strong><br />    •    Spatial audio makes people’s voices sound like they’re coming from the direction in which they’re positioned on the screen on Group FaceTime calls (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Voice Isolation blocks background noises so your voice is crystal clear (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Wide Spectrum brings all background noises into your call (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Portrait mode blurs your background and puts the focus on you (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Grid view displays up to six people at a time in Group FaceTime calls in the same-size tiles and highlights the current speaker<br />    •    FaceTime links allow you to invite your friends into a FaceTime call, even friends on Android or Windows devices can join from their browser</p><p><strong>Messages and Memoji</strong><br />    •    Shared with You shows content sent to you by friends in Messages conversations in a new section in Photos, Safari, Apple News, Apple Music, Apple Podcasts, or the Apple TV app<br />    •    Pinned content elevates the shared content you choose and makes it more prominent in Shared with You, Messages search, and the Details view of the conversation<br />    •    Multiple photos sent in Messages are displayed as a glanceable collage or a swipeable stack<br />    •    Over 40 Memoji outfit choices and up to three different colors to customize your Memoji stickers’s clothing and headwear</p><p><strong>Focus</strong><br />    •    Focus lets you automatically filter notifications based on what you’re currently doing, such as fitness, sleep, gaming, reading, driving, work, or personal time<br />    •    Focus uses on-device intelligence during set up to suggest apps and people you want to allow notifications from in a Focus<br />    •    Home Screen pages can be customized to match your apps and widgets to a specific Focus<br />    •    Contextual suggestions intelligently suggest a Focus based on your context, using signals like location or time of day<br />    •    Status appears to your contacts in Messages conversations, indicating your notifications are silenced with Focus</p><p><strong>Notifications</strong><br />    •    A new look displays contact photos for people and larger icons for apps<br />    •    Notification summary delivers a helpful collection of your notifications daily, based on a schedule you set<br />    •    Notifications can be muted from any app or messaging thread for the next hour or for the day</p><p><strong>Maps</strong><br />    •    Detailed city maps display elevation, trees, buildings, landmarks, crosswalks and turn lanes, and 3D views to navigate complex interchanges, and more in San Francisco Bay Area, Los Angeles, New York, and London, with more cities coming in the future (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    New driving features include a new map that highlights details like traffic and incidents, and a route planner that lets you view your upcoming journey by choosing a future departure or arrival time<br />    •    Immersive walking directions show step-by-step directions in augmented reality (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Updated transit experience provides one-tap access to departures near you, makes it easy to see and interact with your route using one hand, and notifies you when approaching your stop<br />    •    Interactive 3D globe shows enhanced details for mountain ranges, deserts, forests, oceans, and more (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Redesigned place cards make it easy to learn about and interact with places, and a new home for Guides editorially curates the best recommendations for places you’ll love</p><p><strong>Safari</strong><br />    •    Bottom tab bar is easier to reach and helps you move between tabs by swiping left or right<br />    •    Tab Groups help you save and organize your tabs and easily access them across devices<br />    •    Tab overview grid view displays your open tabs<br />    •    Start page can be customized with a background image and new sections like Privacy Report, Siri Suggestions, and Shared With You<br />    •    Web extensions on iOS help you personalize your browsing and can be downloaded through the App Store<br />    •    Voice search lets you search the web using your voice</p><p><strong>Wallet</strong><br />    •    Home keys let you tap to unlock a supported home or apartment door lock (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Hotel keys allow you to tap to unlock your room at participating hotels<br />    •    Office keys allow you to tap to unlock your office doors for participating corporate offices<br />    •    Car keys with Ultra Wideband help you unlock, lock, and start your supported car without having to take your iPhone out of your bag or pocket (iPhone 11 and iPhone 12 models)<br />    •    Remote keyless entry functions on your car keys allow you to lock, unlock, honk your horn, preheat your car, or open your trunk on your supported vehicle</p><p><strong>Live Text</strong><br />    •    Live Text makes text interactive in your photos so you can copy and paste, look up, and translate in Photos, Screenshot, Quick Look, Safari, and live previews with Camera (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Data detectors for Live Text recognize phone numbers, emails, dates, street addresses, and more in photos so you can take action on them<br />    •    Live Text is available from the keyboard letting you insert text directly from the camera viewfinder into any text field</p><p><strong>Spotlight</strong><br />    •    Rich results brings together all the information you’re looking for on contacts, actors, musicians, movies, and TV shows<br />    •    Photos can be searched from your photo library by locations, people, scenes, text in the photos or other things in the photos, like a dog or a car<br />    •    Web image search allows you to search for images of people, animals, monuments, and more</p><p><strong>Photos</strong><br />    •    New look for Memories with a new interactive interface, animated cards with smart, adaptive titles, new animation and transition styles, and multiple image collages<br />    •    Apple Music can be added to your Memories for Apple Music subscribers, and personalized song suggestions combine expert recommendations with your music tastes and what’s in your photos and videos<br />    •    Memory mixes let you set the mood by selecting from different songs and a Memory look to match<br />    •    New memory types include additional international holidays, child-focused memories, trends over time, and improved pet memories<br />    •    Info pane now displays rich information about the photo like which camera and lens, shutter speed, file size, and more<br />    •    Visual Look Up recognizes art, landmarks around the world, plants and flowers, books, and dog and cat breeds in your photos so you can learn more about them</p><p><strong>Health</strong><br />    •    Sharing lets you choose health data, alerts, and trends to share with people important to you or those who are caring for you, including your healthcare provider<br />    •    Trends lets you see how a given health metric is progressing over time and can notify you when a new trend has been detected<br />    •    Walking Steadiness is a new metric that can assess your risk of falling and notify you if your walking steadiness is low (iPhone 8 and later)<br />    •    Verifiable health records enable you to download and store verifiable versions of COVID-19 vaccines and lab results<br />    •    Lab results can now be pinned for quick access and include highlights that show how your labs have changed over time</p><p><strong>Weather</strong><br />    •    A new design shows the most important weather information for that location and includes new maps modules<br />    •    Weather maps can be viewed in full-screen and show precipitation, temperature and air quality in supported countries<br />    •    Next-hour precipitation notifications alert you when rain or snow is about to start or stop in Ireland, U.K., and US<br />    •    New animated backgrounds more accurately represent the sun position, clouds, and precipitation (iPhone XS, iPhone XS Max, iPhone XR and later)</p><p><strong>Siri</strong><br />    •    On-device processing means audio of your requests does not leave your device by default, and means Siri is able to process many requests while offline (iPhone XS, iPhone XS Max, iPhone XR and later)<br />    •    Share items with Siri lets you send on screen items like photos, web pages and Maps locations to any of your contacts<br />    •    Onscreen context can be used by Siri to refer to contacts on screen to send them a message or place a call<br />    •    On-device personalization allows Siri speech recognition and understanding to improve privately (iPhone XS, iPhone XS Max, iPhone XR and later)</p><p><strong>Privacy</strong><br />    •    Mail Privacy Protection protects your privacy by preventing email senders from learning about your Mail activity, your IP address or whether you’ve opened their email<br />    •    Safari Intelligent Tracking Prevention now also prevents known trackers from profiling you using your IP address</p><p><strong>iCloud+</strong><br />    •    iCloud+ is a cloud subscription service that gives you premium features and additional iCloud storage<br />    •    iCloud Private Relay (beta) sends your requests through two separate internet relays and encrypts the internet traffic leaving your device so you can browse Safari in a more secure and private way<br />    •    Hide My Email lets you create unique, random email addresses that forward to your personal inbox so you can send and receive email without having to share your real email address<br />    •    HomeKit Secure Video supports connecting more security cameras without using your iCloud storage quota<br />    •    Custom email domain personalizes your iCloud Mail address and allows you to invite family members to use the same domain</p><p><strong>Accessibility</strong><br />    •    Image exploration with VoiceOver allows you to get even more details about people and objects, and learn about text and table data in photos<br />    •    VoiceOver image descriptions in Markup let you add your own image descriptions that can be read by VoiceOver<br />    •    Per-app settings allow you to customize display and text size settings only for the apps you want<br />    •    Background sounds play balanced, bright, or dark noise, ocean, rain, and stream sounds continuously in the background to mask unwanted environmental or external noise<br />    •    Sound actions for Switch Control enable you to control your iPhone with simple mouth sounds<br />    •    Audiograms can be imported in Settings so you can customize Headphone Accommodations based on your hearing test results<br />    •    New Voice Control languages include Mandarin Chinese (China mainland), Cantonese (Hong Kong), French (France), and German (Germany)<br />    •    Memoji options including a cochlear implant, oxygen tubes, or a soft helmet</p><p><strong>This release also includes other features and improvements:</strong><br />    •    Tags in Notes and Reminders help you quickly categorize your items to make them easy to find, and you can use custom Smart Folders and Smart Lists to automatically collect your notes and reminders based on rules you can define<br />    •    Mentions in Notes enable you to notify others of important updates in shared notes, and an all-new Activity view displays all the recent changes in a note in a single list<br />    •    Spatial audio with dynamic head tracking in Apple Music brings an even more immersive experience to Dolby Atmos music with AirPods Pro and AirPods Max<br />    •    System-wide translation lets you select text throughout the system and translate it with a tap, even in photos<br />    •    New widgets include Find My, Contacts, App Store, Sleep, Game Center, and Mail<br />    •    Cross-app drag and drop function lets you pick up images, documents, and files from one app to another<br />    •    Keyboard magnification loupe magnifies the text when moving the cursor<br />    •    Apple ID Account Recovery Contacts lets you to choose one or more people you trust to help you reset your password and regain access to your account<br />    •    Temporary iCloud storage grants you as much iCloud storage as you need to create a temporary backup of your data, free of charge, for up to three weeks when you buy a new device<br />    •    Find My separation alerts notify you if you leave a supported device or item behind and Find My will give you directions to your item<br />    •    Game highlights of up to the last 15 seconds of gameplay can be saved using game controllers like the Xbox Series X|S Wireless Controller or Sony PS5 DualSense™ Wireless Controller<br />    •    App Store in-app events help you discover timely events within apps and games such as a game competition, a new movie premiere, or a livestreamed experience</p><p>This release includes even more features and improvements. For more information, please visit this website: <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/ios/ios-15/features/&amp;subid1=1-1-348126-1-0-0\" target=\"_blank\">https://www.apple.com/ios/ios-15/features/</a></p></blockquote>\n\n\n\n<h2>iOS 15 Supported Devices</h2>\n\n\n\n<p>You can run iOS 15 on any iPhone that runs iOS 14, and iPadOS 15 runs on any iPad that is compatible with iPadOS 14.</p>\n\n\n\n<p>Here’s the list of supported iPhones for iOS 15:</p>\n\n\n\n<ul><li>iPhone 12</li><li>iPhone 12 mini</li><li>iPhone 12 Pro</li><li>iPhone 12 Pro Max</li><li>iPhone 11</li><li>iPhone 11 Pro</li><li>iPhone 11 Pro Max</li><li>iPhone XS</li><li>iPhone XS Max</li><li>iPhone XR</li><li>iPhone X</li><li>iPhone 8</li><li>iPhone 8 Plus</li><li>iPhone 7</li><li>iPhone 7 Plus</li><li>iPhone 6s</li><li>iPhone 6s Plus</li><li>iPhone SE (1st generation)</li><li>iPhone SE (2nd generation)</li><li>iPod touch (7th generation)</li></ul><p>And here’s the list of supported iPads for iPadOS 15:</p>\n\n\n\n<ul><li>iPad Pro 12.9-inch (5th generation)</li><li>iPad Pro 11-inch (3rd generation)</li><li>iPad Pro 12.9-inch (4th generation)</li><li>iPad Pro 11-inch (2nd generation)</li><li>iPad Pro 12.9-inch (3rd generation)</li><li>iPad Pro 11-inch (1st generation)</li><li>iPad Pro 12.9-inch (2nd generation)</li><li>iPad Pro 12.9-inch (1st generation)</li><li>iPad Pro 10.5-inch</li><li>iPad Pro 9.7-inch</li><li>iPad (8th generation)</li><li>iPad (7th generation)</li><li>iPad (6th generation)</li><li>iPad (5th generation)</li><li>iPad mini (5th generation)</li><li>iPad mini 4</li><li>iPad Air (4th generation)</li><li>iPad Air (3rd generation)</li><li>iPad Air 2</li></ul><h2>iOS 15: Keep up to date with betas</h2>\n\n\n\n<p>Now that iOS 15 has arrived, Apple will almost instantly get to work on the next 12 months of revisions. If you want to test iOS 15.1 and other updates before they arrive, head to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://b2c-contenthub.com/article/348413/tvos-15-sign-in-suggestions-shareplay-home-spatial-audio-compatilibity-release-beta-how-to-install.html&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">beta.apple.com</a> and tap <em>Sign up</em>. You need to do this on the device upon which you wish to run the beta. You’ll be asked to sign in with your Apple ID, agree to the terms of service, and then download a beta profile.</p>\n\n\n\n<p>Once you download the beta profile, you need to install it on your iPhone. Open <em>Settings</em>, then tap <em>General</em>. Scroll down to <em>Profile</em> and select it. You can then tap on the iOS 15 or iPadOS 15 beta software profile and choose to install it.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"cf7b7bead86257d76617b1bb85115361c23fa18d19e585d553dfd5d9ac8a2fa8","category":"Apple"}