{"title":"Next Year's OLED iPad Pro Models Could Have These Eye-Watering Starting Prices","link":"https://www.macrumors.com/2023/03/09/2024-oled-ipad-pro-starting-prices/","date":1678357799000,"content":"Apple's 2024 OLED iPad Pro models could be vastly more expensive than its existing iPad Pros and even more costly than some MacBook Pros currently on sale, claims a new Korean report.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/iPad-Pro-OLED-Feature-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nAccording to industry sources cited by <em><a href=\"https://www.thelec.kr/news/articleView.html?idxno=20113\">The Elec</a></em>, Apple is already considering its pricing strategy for next year's two OLED iPad Pro models, with current estimates starting at $1,500 and $1,800 for the 11-inch and 13-inch models, respectively.\r<br />\n\r<br />\nThat would make the 11-inch device over 80 percent more expensive than the existing 11-inch ‌iPad Pro‌ with LED Liquid Retina display, which starts at $799, and the 13-inch model over 60% more expensive than the current 12.9-inch ‌iPad Pro‌ with mini-LED Liquid Retina XDR display, which starts at $1,099. \r<br />\n\r<br />\nThe OLED price estimates even eclipse the price of some MacBook Pro models currently on sale. For example, the 13.6-inch MacBook Air with M2 chip starts at $1,199, while the 13-inch MacBook Pro with M2 chip starts at $1,299.\r<br />\n\r<br />\nAccording to the Korean-language report, the industry response to the price hikes is divided: Some consider them a reasonable increase given the switch to superior OLED technology that will attract Apple's loyal customer base, while others believe the prices will make it difficult to maintain sales because iPads lack the replacement demand of iPhones.\r<br />\n\r<br />\nThe main reason for the increases is said to be the <a href=\"https://www.macrumors.com/2023/02/27/2024-ipad-pro-models-costly-panels/\">large proportion of material costs</a> taken up by OLED panel procurement. Apple is currently believed to be in discussion with Samsung and LG Display about the price of supplying the panels, the specifications for which will require the use of production processes that have not been combined before for OLED panels of the required size.\r<br />\n\r<br />\n<div><blockquote><p>Apple is switching to OLEDs for iPad Pros because it will be a better experience. But Apple’s display requirements will lead to a more expensive OLED panel than the other OLEDs panels on the market which are lower cost than MiniLED. They are going for a very thin, tandem stack… <a href=\"https://t.co/iKfoMW4cUA\">https://t.co/iKfoMW4cUA</a></p>— Ross Young (@DSCCRoss) <a href=\"https://twitter.com/DSCCRoss/status/1633848302935621633?ref_src=twsrc%5Etfw\">March 9, 2023</a></blockquote> </div>\r<br />\nAccording to <em>The Elec</em>, the supply price of OLED panels for existing 10-inch devices is around $100 to $150, whereas the outlay for the processes involved in making Apple's required 11-inch and 13-inch panels may be closer to $270 and $350, respectively.\r<br />\n\r<br />\nThe report notes that current OLED iPad Pro price estimates from the industry could change in the future. The OLED panels scheduled to be delivered by LG and Samsung are still in the development stage, so the panel prices have not been finalized.\r<br />\n\r<br />\nStill, there are reportedly concerns among panel suppliers Samsung, LG, and BOE about how Apple's OLED iPad Pro prices and shipment forecasts could negatively affect profits and production line investment. Samsung is set to invest in eighth-generation OLED production lines, which should \"theoretically\" result in lower-costing panels, but they have already been earmarked for <a href=\"https://www.macrumors.com/2022/12/12/oled-macbook-air-ipad-pro-2024/\">Apple's future OLED MacBooks</a>, which are also expected to debut in 2024.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/theelec-kr/\">The Elec</a>, <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\">OLED iPad Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#11-iPad-Pro\">11\" iPad Pro (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/09/2024-oled-ipad-pro-starting-prices/\">Next Year's OLED iPad Pro Models Could Have These Eye-Watering Starting Prices</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/next-years-oled-ipad-pro-models-could-have-these-eye-watering-starting-prices.2383190/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cf7c938e4c905abe8e03565f081f2717a842e123e7c61c6f27313e","category":"Apple"}