{"title":"Incidence of Thyroid Cancer in Bethesda III Thyroid Nodules: A Retrospective Analysis at a Single Endocrine Surgery Center","link":"https://www.preprints.org/manuscript/202404.0937/v2","date":1713440399000,"content":"Background: Fine-needle aspiration cytology (FNAC) is widely used to diagnose and monitor thyroid nodules. The Bethesda System for Reporting Thyroid Cytopathology (TBSRTC) is the standard for interpreting FNAC specimens. The risk of malignancy in Bethesda III nodules also known as Atypia of Undetermined Significance (AUS) varies significantly throughout several studies published worldwide. This retrospective study examines the risk of cancer in thyroid FNAC categorized as Bethesda III, as identified in the final histopathology of thyroidectomy specimens at a single endocrine surgery center. Methods: This retrospective cohort analysis included 1038 consecutive patients who underwent elective thyroid surgery with complete follow up data between January 2020 and March 2024. Preoperative data on clinical and pathological characteristics have been collected. The final histopathology report from the thyroidectomy specimen was compared to the results of the preoperative FNAC on nodules that were judged to be Bethesda category III. Statistical methods were performed using SPSS version 29. Results: A total of 670 ultrasound-guided FNACs (64.5%) performed during the study period were included in the final analysis. The study population was predominantly female, represented by 79.6% of patients with a mean age of 42.5 (SD 12.1), while 20.4% were male and significantly older with mean age 45.13 years (p = 0.02). The FNAC inadequacy rate was 5.1%, which was associated with a high risk of malignancy (6 out of 34, 17.6%). Out of the total sample size of 170 patients classified as group III, 57 were found to have malignancies in final surgical histopathology, representing 33.5% of the cases within this category. The secondary gender-related outcome analysis showed that female patients classified under the Bethesda II category had a significantly higher risk of malignancy, with a rate of 21.2%, compared to males who had a malignancy rate of 3.4% in the same Bethesda category (p = 0.001, chi square test). However, female had more better prognostic non-invasive tumors than male (p = 0.02, chi square test). Conclusion: The study's results indicate that Bethesda categories II and III are associated with a higher risk of malignancy in comparison to the reports of the first and third editions of the TBSRTC, particularly for female patients classified under category II.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cf9d102f6fbec8486fe9847ea3563129d1e0bbf2bc6d4f514ceefba3c718b233","category":"Interdisciplinary"}