{"title":"iPhone 16 and 16 Plus Again Rumored to Jump From A16 to A18 Chip","link":"https://www.macrumors.com/2023/10/19/iphone-16-jump-from-a16-to-a18-chip-rumor/","date":1697726529000,"content":"All four iPhone 16 models will be equipped with A18-branded chips, according to Jeff Pu, an analyst who covers Apple and its supply chain. He <a href=\"https://www.macrumors.com/2023/09/27/iphone-16-lineup-a18-a18-pro-chips-analyst-says/\">first shared this prediction last month</a>, and he touched on the topic again in a research note this week with Hong Kong-based investment firm Haitong International Securities.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iPhone-16-To-Skip-A17-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIn his latest note, Pu said \"we expect all iPhone 16 models to feature A18,\" and he expects the chips to be manufactured with chipmaker TSMC's second-generation 3nm process \"N3E.\" Pu referred to the A17 Pro chip in the iPhone 15 Pro models, based on TSMC's first-generation 3nm process \"N3B,\" as a \"transition design.\"\r<br />\n\r<br />\nIn response to an email from <em>MacRumors</em> last month, Pu outlined his specific expectations:<ul><li><strong>iPhone 16:</strong> A18 chip (N3E)</li>\r<br />\n<li><strong>iPhone 16 Plus:</strong> A18 chip (N3E)</li>\r<br />\n<li><strong>iPhone 16 Pro:</strong> A18 Pro chip (N3E)</li>\r<br />\n<li><strong>iPhone 16 Pro Max:</strong> A18 Pro chip (N3E)</li></ul>N3E is less expensive and has improved yield compared to N3B, according to TSMC.\r<br />\n\r<br />\nThe standard iPhone 15 and iPhone 15 Plus use the A16 Bionic chip, so a jump to the A18 chip for the iPhone 16 and iPhone 16 Plus would be a notable and unique change, as it means these two models would skip over an A17-branded chip.\r<br />\n\r<br />\nGiven that the iPhone 16 lineup is still around 11 months away from launching, Pu is likely making an educated guess here with the marketing names, so it remains to be seen if Apple actually moves forward with A18 and A18 Pro branding. It is possible that Apple could brand its iPhone 16 chips as the A17 and A18 Pro, mirroring recent years.\r<br />\n\r<br />\nPu was the first source to report that Apple had <a href=\"https://www.macrumors.com/2023/07/06/iphone-16-pro-solid-state-buttons-low-chance/\">abandoned its plans for solid-state buttons</a> on the iPhone 15 Pro models. He also accurately revealed that the iPhone 15 Pro models would be equipped with an <a href=\"https://www.macrumors.com/2023/01/02/iphone-15-pro-features-specs-rumors/\">increased 8GB of RAM</a>, and that the <a href=\"https://www.macrumors.com/2023/07/06/iphone-15-pro-max-more-expensive/\">iPhone 15 Pro Max would have a higher starting price</a> than the iPhone 14 Pro Max.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/jeff-pu/\">Jeff Pu</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/19/iphone-16-jump-from-a16-to-a18-chip-rumor/\">iPhone 16 and 16 Plus Again Rumored to Jump From A16 to A18 Chip</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-16-and-16-plus-again-rumored-to-jump-from-a16-to-a18-chip.2408082/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cfa1521240cb3c6239a987d17126add87d32ff3f15205e1838777dd3485d2bb6","category":"Apple"}