{"title":"Perceived progress toward scale of 14 maternal, newborn, child health, and nutrition (MNCHN) assets at subnational level in Burkina Faso, Ethiopia, India, Kenya, and Nigeria","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002309","date":1710511200000,"content":"<p>by Patricia S. Coffey, Sadaf Khan, Elan Ebeling, Cyril Engmann</p>\r\n\r\nInequitable coverage of evidence-based MNCHN interventions is particularly pronounced in low and middle income countries where access and delivery of these interventions can vary dramatically at the subnational level. We conducted health system assessments in nine subnational geographies in five countries (Burkina Faso, Ethiopia, India, Kenya and Nigeria) to explore progress toward scale of 14 evidence-based MNCHN interventions (iron-folic acid, oxytocin, magnesium sulfate, misoprostol; 7.1% chlorhexidine for umbilical cord care, neonatal resuscitation, kangaroo mother care, community regimen for the treatment of possible severe bacterial infection; amoxicillin dispersible tablets, multiple micronutrient supplements, balanced energy protein supplementation, early and exclusive breastfeeding, feeding of small and sick newborns, and management of severe and moderate acute malnutrition in children less than five years old). Between March and October 2021, we conducted key informant interviews with a purposive sample of 275 healthcare providers and 94 district health management (DHMT) staff to better understand bottlenecks, facilitators and uptake of the interventions across varied subnational settings. Across all interventions and geographies, providers and DHMT staff perceived lack of robust HMIS data as the most significant barrier to scale followed by weak facility infrastructure. DHMT staff viewed limited budget allocation and training as a much larger barrier than healthcare providers, most likely given their purview as subnational managers. Healthcare providers were focused on supply chain and staffing, which affect workflows and service provision. Understanding provider and health facility management views of why interventions do or do not advance towards effective coverage can assist in creating enabling environments for the scale of best practices. These types of data are most helpful when collected at the subnational level, which allows for comparisons both within and between countries to show health disparities. Importantly, this strategic data collection can provide a starting point for improvement efforts to address existing health system gaps.","author":"Patricia S. Coffey","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"cfa40806ab4d19c8c45264b2c955d7ec582305a6f13f4e72ba0e3745cc7aa868","category":"Environment"}