{"title":"Spiritual Connectivity Intervention for Individuals with Depressive Symptoms: A Randomized Control Trial","link":"https://www.preprints.org/manuscript/202407.0474/v1","date":1720131450000,"content":"Depression is one of the most prevalent mental disorders worldwide. This study examined the effect of a spiritual connectivity intervention on individuals with depression in a randomized waitlist control trial. Fifty-seven participants with mild or moderate depressive symptoms were randomly assigned to either the intervention group (n=28) or the waitlist control group (n=29). The intervention comprised eight weekly sessions focusing on divine connection, forgiveness and freedom, suffering and transcendence, hope, gratitude, and relapse prevention. The outcome measures included depressive symptoms, anxiety, hope, meaning in life, self-esteem, and social support. Participants completed self-administered questionnaires at baseline (week 0), post-intervention (week 8), and at a 3-month follow-up (week 20). Repeated-measures ANOVA and one-way ANCOVA were used to compare the within-group and between-group differences in the changes in outcome variables. Participants in the intervention group showed significant improvements in depression, anxiety, spiritual experience, hope, self-esteem, and perceived social support after the intervention. Effect size statistics showed small to large differences (Cohen’s d, 0.308 to -1.452). Moreover, 85.71% of participants in the intervention group also experienced clinically significant reductions in PHQ-9 scores from baseline to immediate post-intervention. This study highlights the effectiveness of a low-cost, accessible intervention suitable for community implementation by clergy and faith-based organizations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cfa5c4d5369b8e316880941d4c2a792ea5b8ca068002363e251d1d2eb39a2ecf","category":"Interdisciplinary"}