{"title":"The Prevalence of Antibiotic Tolerance in Neisseria gonorrhoeae Varies by Anatomical Site","link":"https://www.preprints.org/manuscript/202403.0731/v1","date":1710254018000,"content":"Background: Bacteria can survive antibiotic exposure by mechanisms like tolerance without a shift in antimicrobial susceptibility. In this study, we investigated the presence of tolerance to three antimicrobials, ceftriaxone (CRO), azithromycin (AZM), and ciprofloxacin (CIP), in clinical isolates and WHO reference panel of N. gonorrhoeae and explored the prevalence between urogenital and anorectal infection sites.  Methods: We examined 66 N. gonorrhoeae clinical isolates, evenly divided between anorectal and urogenital infection sites, using a modified tolerance disk (TD test) for three antibiotics. The isolates underwent a three-step incubation process wherein the isolates were exposed to an antibiotic disc for 20 hours of incubation (Step I), followed by the replacement of the antibiotic disc with a nutrient disc for overnight incubation (Step II) and additional overnight incubation with extra nutrients (Step III).   Results: Four isolates were lost due to contamination. Of 62 clinical isolates, 7 exhibited tolerance to AZM, with 6 from anorectal and 1 from urogenital sites (p = 0.0496). Tolerance to CRO was observed in 11 isolates, which was significantly associated with the infection site, with 9 from the anorectum, and 2 from the urogenital site being tolerant (p = 0.02). Tolerance to CIP was found in 11 isolates, but was not significantly associated with the infection site. Tolerance was also detected in 8 (K, M, N, O, P, U, V, W) out of the 14 WHO (World Health Organization) reference strains, with varying patterns of tolerance to CRO (n=8), CIP (n=2) and AZM (n=1).   Conclusion: This study identified CRO, AZM, and CIP tolerance in clinical Neisseria gonorrhoeae isolates. Significant variations in tolerance proportions between anorectal and urogenital infection sites, particularly for CRO, were observed. Additionally, tolerance was detected in WHO reference strains.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"cfb1ac120264b7dea09ffafc2503a2fbcd3fc220cd2913e527736ea1e768ae49","category":"Interdisciplinary"}