{"title":"Challenges in teacher-student communication during family medicine residency: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310455","date":1726581600000,"content":"<p>by Isaías Hernández-Torres, Octavio N. Pons-Álvarez, Luisa F. Romero-Henríquez, Geovani López-Ortiz</p>\r\nBackground <p>Deficiencies in communication among healthcare professionals, recognized by medical educators and healthcare institutions, can negatively impact medical education and clinical practice. Analyzing teacher-resident communication difficulties shed light on this issue and propose practical strategies for its mitigation.</p> Objective <p>To identify common communication challenges between teacher and residents during Family Medicine residency and to analyze their impact on interactions with peers, the work team, and patients.</p> Design <p>Qualitative study, the critical incident technique was used to collect information of interest.</p> Participants <p>Seventy teachers, and fifty third-year residents from the Mexican Republic described critical incidents related to their communication experiences during Family Medicine residency.</p> Results <p>192 critical incidents were collected (several participants reported more than one incident), comprising 127 reports from teachers, and 65 from residents. Four themes were identified: 1) asymmetric communication, 2) assertive communication, 3) organizational communication, and 4) effective communication. The main challenges identified were abuse of power in communication, lack of communication skills, and the absence of institutional communication channels. These issues significantly impacted learning, work environment, interpersonal relationships, and medical care.</p> Conclusion <p>This study highlights communication issues within Family Medicine residency in Mexico. The issues detected hindered learning and effective collaboration and negatively impacted the work environment, interpersonal relationships, and the quality of medical care. These findings underscore the urgent need to reorient the medical specialty curriculum towards an approach that includes communication skills.</p>","author":"Isaías Hernández-Torres","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cfb3659e89a2c5311108590364af8470c256a7e767f0005fc0d81c296a475417","category":"Interdisciplinary"}