{"title":"★ Phil Spencer Puts Apple’s Money Where His Mouth Is","link":"https://daringfireball.net/2024/02/phil_spencer_puts_apples_money_where_his_mouth_is","date":1708048246000,"content":"\n<p><a href=\"https://www.theverge.com/24073666/microsoft-gaming-phil-spencer-interview-ps5-switch-games\">The Verge’s Tom Warren landed an interview with Phil Spencer</a>, Microsoft’s Xbox CEO, regarding their (sort of) announcement that four previously-exclusive Xbox games are going cross-platform to PlayStation and Switch:</p>\n\n<blockquote>\n  <p>Launching a few Xbox exclusives on rival consoles feels like the \nnatural next step in Microsoft’s grand plan, but it’s also a risky \none: it could undermine the Xbox hardware sales that support \nMicrosoft’s Xbox Game Pass subscription effort and its Xbox \necosystem, forcing Microsoft to go fully multiplatform and become \na software-only games company like Sega. </p>\n\n<p>Spencer is all too aware of the risks, but he sees an opportunity \nto make more money on rival consoles to support Microsoft’s game \ncreation, and ultimately bring games to more players. </p>\n</blockquote>\n\n<p>One weird aspect of this announcement — hence my “sort of” parenthetical above — is that Microsoft <a href=\"https://www.theverge.com/2024/2/15/24073691/microsoft-xbox-games-ps5-nintendo-switch-exclusivity\">hasn’t actually named</a> any of the four formerly exclusive titles they’re porting to PS5 and Switch.</p>\n\n<p>The whole interview is interesting, and it sure sounds like Microsoft is working on a <a href=\"https://store.steampowered.com/steamdeck\">Steamdeck-like handheld</a>. The strategy sounds a little bit like Warner Bros Discovery <a href=\"https://deadline.com/2024/01/sex-and-the-city-stream-on-netflix-hbo-deal-1235803250/\">putting some of their library content on Netflix</a>. Netflix is to PlayStation what Max is Xbox? Second-fiddle bends to the market leader. You don’t see rumors of Sony putting PlayStation exclusives on Xbox, and you don’t see Netflix putting any of their original content — no matter how old — on Max.</p>\n\n<p>Toward the end of the interview Warren asks Spencer about Apple and the DMA:</p>\n\n<blockquote>\n  <p>Warren: <em>Some of that regulatory work isn’t done like you \nmentioned, so what do you think about Apple’s changes for the DMA? \nAnd is there room for Xbox Cloud Gaming now on iOS?</em> </p>\n\n<p>Spencer: There’s not room for us to monetize Xbox Cloud Gaming on \niOS. I think the proposal that Apple put forward — and I thought \nSarah Bond’s comments on this were right on — doesn’t go far \nenough to open up. In fact, you might even say they go the \nopposite direction in some way, but they definitely don’t go far \nenough to open up competition on the world’s largest gaming \nplatform. </p>\n\n<p>We will continue to work with regulators, and Apple and Google, \nto create a space for alternative storefronts. I’m a big fan of \nhow Windows works, and you’ve got a Microsoft Store on Windows, \nyou’ve got Steam, you’ve got the Epic Games Store, you’ve got \nGOG. You have alternatives, and I think alternative ways for \npeople to buy things creates goodness for consumers and creators. \nI think the largest platform for gamers, which is mobile, should \nhave the same. </p>\n</blockquote>\n\n<p>Sarah Bond is Xbox’s president, and I believe her only comment on Apple’s DMA compliance plans <a href=\"https://twitter.com/BondSarah_Bond/status/1752083596318593238\">was this tweet</a>:</p>\n\n<blockquote>\n  <p>We believe constructive conversations drive change and progress \ntowards open platforms and greater competition. Apple’s new policy \nis a step in the wrong direction. We hope they listen to feedback \non their proposed plan and work towards a more inclusive future \nfor all. </p>\n</blockquote>\n\n<p>More than any of the words in her own tweet, what conveyed Microsoft’s actual stance towards Apple’s proposals is the fact that her tweet was a retweet of <a href=\"https://twitter.com/BondSarah_Bond/status/1752083596318593238\">Spotify CEO Daniel Elk’s diatribe</a> lambasting the whole proposal.</p>\n\n<p>But I don’t understand how Warren let this answer slide. If Spencer thinks Apple’s proposed DMA compliance is a “step in the wrong direction”, and he’s “a big fan of how Windows works”, then why doesn’t Xbox work like Windows works? There’s no Steam or Epic Games Store or GOG on iOS. But there’s no Steam or Epic Games Store or GOG on Xbox. So how in the world does Spencer think Apple should be forced by government regulators to open their platform to these alternative stores when he could snap his fingers and open his company’s own platform, Xbox, to these same stores?</p>\n\n<p>He says “I think the largest platform for gamers, which is mobile, should have the same” rules as Windows, so I think he’s trying to make an argument that different rules should apply to iOS than Xbox because iOS is more popular. But iOS became this popular with all of these rules. It’s not like iOS used to be open, became popular under more open rules for software distribution and digital content purchases, and <em>then</em> Apple closed it down. iOS is more closed than open, but it’s only become more open over time.</p>\n\n<p>If the CEO of Xbox were able to say, “iOS should have the same rules and policies for alternative stores and payments as Xbox”, that would be a credible argument. But it’s ridiculous for the CEO of Xbox to argue that iOS should have similar rules and policies to Windows, when Xbox — another platform from the same company — has rules that are, if anything, <em>more</em> restrictive and exclusive than iOS. It would be ludicrous for Tim Cook or Eddy Cue or Phil Schiller to argue that Xbox should have the same rules as Windows — but they’re not making that argument. Spencer is. And he’s in charge of Xbox!</p>\n\n<p>If he thinks iOS should open up to zero-royalty, zero-fee native app distribution, open up Xbox first. Put your money where your mouth is.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"cfba48818a77f315cdcbb7b8bf67bae00626588033b192da46ec9a135017758f","category":"Tech"}