{"title":"Assessment of stress levels and reproductive condition in giant pandas: insights from hair, faecal and saliva samples","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae044/7704614?rss=1","date":1719964800000,"content":"<span><div>Abstract</div>Concerted conservation efforts have brought the giant panda (<span>Ailuropoda melanoleuca</span>) back from the brink of extinction, but pandas continue to face anthropogenic threats in the wild and breeding success in captivity remains low. Because stress can have detrimental impacts on reproduction, monitoring stress- and sex-steroid levels would help assess the effectiveness of conservation mitigation measures in panda populations as well as monitor the welfare and reproductive health of captive animals. In this proof-of-concept study, we used faecal sex steroid and cortisol concentrations (<span>n</span> = 867 samples collected from five males and five females at Beijing Zoo every 4 days over the course of 12 months) as a reference to investigate if testosterone, estradiol, progesterone and cortisol can be meaningfully measured in panda hair (<span>n</span> = 10) using radio-immuno-assays. Additionally, we calculated the ratio of testosterone to cortisol (T:C ratio) for each male, which can provide a biomarker of stress and physical performance. Our findings revealed distinct monthly variations in faecal sex-steroid and cortisol concentrations, reflecting reproductive seasonality and visitor-related stress among individual pandas. Notably, the oldest male had a significantly lower T:C ratio than other males. Our results confirm that the level of sex steroids and cortisol can be assayed by panda hair, and the hair cortisol concentrations correlate significantly with that in faeces with one month lag behind (<span>r</span> = 0.68, <span>P</span> = 0.03). However, the concentrations of hormones detected in saliva are lower than those in faeces by two orders of magnitude, making it difficult to ensure accuracy. By assessing the applicability of hair, faecal and salivary sampling, we can infer their utility in monitoring the reproductive status and acute and chronic stress levels of giant pandas, thereby providing a means to gauge the success of ongoing habitat restoration efforts and to discuss the feasibility of sample collection from wild populations.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"cfd457771521e21763ede0739c0954bfc4831096a48c13714cd95d51513213f8","category":"Environment"}