{"title":"Apple ยอมรับปัญหา iPhone 15 Pro เครื่องร้อน - จะออกอัพเดต iOS แก้ไขบั๊ก - ยืนยันไม่ใช่ปัญหาการออกแบบ","link":"https://www.blognone.com/node/136012","date":1696092399000,"content":"<div><div><div><p>David Phelan ผู้สื่อข่าว Forbes ระบุว่าเขาได้รับคำชี้แจงจากแอปเปิล เกี่ยวกับปัญหา iPhone 15 Pro เครื่องร้อนกว่าปกติเมื่อใช้งานไประยะหนึ่ง โดยแอปเปิลบอกว่าตอนนี้บริษัทมีข้อมูลเงื่อนไขที่สามารถทำให้ iPhone มีอุณหภูมิสูงกว่าที่ควรเป็นแล้ว สาเหตุแรกมาจากในช่วงแรกที่เริ่มใช้งาน หลังจากเซตอัพหรือรีสโตร์ข้อมูล จะมีการทำงานเบื้องหลัง (Background Process) มากกว่าปกติ</p>\n<p>อย่างไรก็ตามไม่ได้มีแค่ประเด็นนี้ เพราะแอปเปิลบอกว่าก็พบบั๊กใน iOS 17 ที่อาจทำให้เกิดปัญหานี้กับผู้ใช้งานบางส่วนด้วย ซึ่งจะแก้ไขด้วยการออกอัพเดตซอฟต์แวร์ นอกจากนี้แอปเปิลบอกว่าพบแอป 3rd Party บางแอปมีการอัพเดตและส่งผลให้เครื่องทำงานหนักกว่าปกติ ซึ่งประเด็นนี้แอปเปิลได้ติดต่อผู้พัฒนาแอปเพื่อแก้ไขแล้ว ซึ่งแอปหนึ่งที่ถูกระบุคือ Instagram ซึ่ง Instagram ได้ออกอัพเดตแก้ไขไปแล้วในเวอร์ชันล่าสุด</p>\n<p>แอปเปิลยืนยันว่าประเด็นเรื่องการออกแบบตัวเครื่อง หรือการใช้วัสดุไทเทเนียมในรุ่น Pro <a href=\"https://www.blognone.com/node/135944\">ไม่ใช่สาเหตุ</a>ของปัญหาเครื่องร้อนที่มีรายงานออกมา สุดท้ายแอปเปิลยืนยันว่า iPhone มีระบบความปลอดภัย ที่ตรวจสอบป้องกันหากอุณหภูมิภายในเครื่องเพิ่มขึ้นสูงมากกว่าปกติอยู่แล้ว</p>\n<p>ทั้งนี้อาจมีการชี้แจงอย่างเป็นทางการจากแอปเปิลซึ่งต้องรอรายละเอียดเพิ่มเติมต่อไป</p>\n<p>ที่มา: <a href=\"https://www.forbes.com/sites/davidphelan/2023/09/30/apple-iphone-15-iphone-15-overheating-exclusive-apple-comments-iphone-15-overheating-solution-coming/\">Forbes</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/dc9f771d61ca23ecfe4333dfb0d8ab53.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cfe5343fe44c6ba4b2c594ff48c95b245d3e9ba692a0b0a2b48c724d6a8f97bd","category":"Thai"}