{"title":"Outlook for Windows app replaces Mail and Calendar in new Windows 11 preview","link":"https://arstechnica.com/?p=1955338","date":1689874491000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/new-outlook-hero-800x523.jpeg\" alt=\"The Outlook for Windows web app is included by default in the latest Dev channel Windows Insider build. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/new-outlook-hero.jpeg\">Enlarge</a> <span>/</span> The Outlook for Windows web app is included by default in the latest Dev channel Windows Insider build.  (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Windows 11's next major release continues to take shape in the company's Dev channel Insider Preview builds, and last month, Microsoft added the first preview of the AI-powered Windows Copilot feature. This week's build <a href=\"https://blogs.windows.com/windows-insider/2023/07/19/announcing-windows-11-insider-preview-build-23506/\">makes a few other noteworthy changes</a>, replacing Windows' built-in Mail and Calendar apps with the work-in-progress Outlook for Windows app, changing how the operating system displays emoji, improving Windows' local file-sharing capabilities, and more.</p>\n<p>Microsoft <a href=\"https://arstechnica.com/gadgets/2022/05/microsoft-previews-a-new-totally-redesigned-outlook-for-windows-app/\">has been working</a> on <a href=\"https://arstechnica.com/gadgets/2022/09/new-outlook-for-windows-preview-will-be-able-to-replace-windows-mail-soon/\">the Outlook for Windows progressive web app</a> for a couple of years now. The version in the Windows 11 build is labeled as a preview, and it's still missing fairly significant features, including IMAP support for third-party mail services, iCloud Mail support, and an offline mode (though it does support multiple accounts now). It also left the Mail and Calendar apps installed on my test PC, though this may change by the time it's released to the public—Microsoft has said that it will continue offering Mail and Calendar in the Windows Store <a href=\"https://support.microsoft.com/en-us/office/outlook-for-windows-the-future-of-mail-calendar-and-people-on-windows-11-715fc27c-e0f4-4652-9174-47faa751b199\">through the end of 2024</a> before discontinuing both of them.</p>\n\n<p>For third-party services that Outlook for Windows does support, like Gmail, the Outlook app will sync a copy of your email, calendar, and contacts with Microsoft's servers rather than communicating directly with Google's servers and storing files locally as a traditional mail client would. This makes it so third-party mail accounts get all the same features and benefits as Microsoft accounts when used in Outlook for Windows, but it also means there's a second copy of all of your data out there, subject to both companies' privacy policies and security breaches.</p></div><p><a href=\"https://arstechnica.com/?p=1955338#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1955338&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cfe75f930ac312e0bf49beb0f354e3a4b6033512e693bebd1755f33361c06b88","category":"Tech"}