{"title":"A beginner’s guide to choosing a road bike","link":"https://cyclingtips.com/2021/02/a-beginners-guide-to-choosing-a-road-bike/","date":1613080144000,"content":"<p>Looking to get your first road bike or perhaps upgrade to something fresh? Welcome! In this article (and video) we’ll discuss the broad steps to consider in your research, and hopefully, narrow your focus in what can be an extremely overwhelming purchase decision.&nbsp;</p>\n\n\n\n<p>This article doesn’t go into specifics of exactly what bike you should buy. Rather we raise the common questions a good bike shop employee may ask if you walked in and said: “I want to buy a road bike”.&nbsp;</p>\n\n\n\n<p>We’ve broken this guide into three steps (with a fourth as a nice to have), and you’ll find that these steps are often intertwined. Let’s get started.&nbsp;</p>\n\n\n\n<h2>Step 1: What type of road riding are you planning to do?&nbsp;</h2>\n\n\n\n<p>The first thing to answer is why you’re interested in a road bike – and it’s important to be honest with yourself. Is it for competitive racing and fast bunch riding, or for more gentle recreational riding to get the heart rate up? Are you looking to commute to work, or purely go out on weekends when the weather is nice? Or maybe you’re intrigued by longer rides and gravel roads, in which case, perhaps something like a gravel bike may be a better choice?&nbsp;</p>\n\n\n\n<p>Road cycling can mean different things to many people. There’s also a great deal of variance in what your local roads may be like. Certainly riding pristine tarmac mountains in Switzerland is different to tackling backcountry roads in Australia.&nbsp;</p>\n\n\n\n<p>To add to that not everyone shares the same fitness, flexibility, or athletic ability. The bike industry caters to almost everyone, but that doesn’t mean that every bike is right for you.&nbsp;</p>\n\n\n\n<p>Differing roads, riding styles, and body types have all led to a great deal of diversification in the modern road bike. In the simplest sense most brands have their road bike ranges divided into three key categories:&nbsp;</p>\n\n\n\n<h3>All-around race</h3>\n\n\n\n<p>A modern all-around race bike is the type of bike you’d often see in the alps during the Tour de France, and as a result, some people call them climber’s bikes or general classification bikes. It’s a bike that aims to balance lightweight, stiffness, comfort (sometimes), and often aerodynamics – all in the name of covering varying roads as efficiently as possible.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-1340x754.jpg\" alt=\"\" class=\"wp-image-467626\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-1.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The Giant TCR is a good example of a modern all-around race bike. It has a low weight and high stiffness as its priorities, but then merges in some riding comfort and aerodynamic design, too. </figcaption></figure>\n\n\n\n<p>These bike types often feature fast handling and aggressive fits that benefit more experienced and/or athletic riders. They&#8217;ll also often feature 25 or 28 mm wide tyres and taller gearing. Almost every brand selling road bikes has a bike like this, but popular examples include the Giant TCR, Specialized Tarmac, Trek Emonda, Cannondale SuperSix, Scott Addict RC, Merida Scultura, BMC Teammachine, and Canyon Ultimate.&nbsp;</p>\n\n\n\n<h3>Aero road race</h3>\n\n\n\n<p>Sharing similar handling and fit with the all-round racer, the aero road bike often trades in absolute low weight for aerodynamic gain. These bikes are typically the most efficient choice on flat or rolling terrain, and typically a good option for more powerful riders.&nbsp;As most all-around race bikes have become increasingly more aero, the dedicated aero race bike has lost some appeal. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-1340x754.jpg\" alt=\"\" class=\"wp-image-477551\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/Cervel-S5-2020-1.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Cervelo&#8217;s S5 is a machine purpose built for going fast. Aerodynamics come at the expense of increase weight, reduced ride comfort, and well, increased cost. </figcaption></figure>\n\n\n\n<p>Specific examples of aero road bikes include the Trek Madone, Giant Propel, Merida Reacto, Scott Foil, Ridley Noah, and Cannondale SystemSix. This style of bike is also often considered a premium product and so won’t be suitable for more modest budgets.&nbsp;</p>\n\n\n\n<h3>&nbsp;Endurance road</h3>\n\n\n\n<p>The modern endurance road bike aims to take the sporty nature of the All-round racer and make it more accessible, comfortable and versatile. The fit is more relaxed, the ride is often more compliant, the gearing is lower (for easier climbing), and the steering characteristics are often less nervous, too. These are road bikes for the masses.&nbsp;</p>\n\n\n\n<p>It’s worth noting that not all endurance road bikes are the same (likewise for road race bikes). Some are more relaxed and recreational in design, while others trend closer to race bikes.&nbsp;&nbsp;</p>\n\n\n\n<p>Endurance road bikes exist at all price points, however, you’ll find that most entry-level road bike options typically trend toward being a bike of this variant. Some popular examples of endurance road bikes include the Trek Domane, Specialized Roubaix, Cannondale Synapse, Giant Defy (and Contend) and Focus Paralane.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-1340x754.jpg\" alt=\"\" class=\"wp-image-471246\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-2.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The <a href=\"https://cyclingtips.com/2021/01/trek-domane-al-disc-4-review/\" target=\"_blank\" rel=\"noreferrer noopener\">Trek Domane Al Disc</a> is an example of how endurance-style road bikes are changing. The Domane is ready for mixed surface riding. </figcaption></figure>\n\n\n\n<p>Recent years have seen gravel bikes boom and road sales flatten. As a result, many of the latest endurance road bikes are attempting to tread the fine line between a road bike and a gravel bike. Sadly the “endurance” category has lost some of its luster with consumers, and so in some cases (not all), the all-road branding is the bike industry’s way of adding back a little sparkle.&nbsp;</p>\n\n\n\n<h3>All rounders, all-road, and how to tell them apart</h3>\n\n\n\n<p>While most road bikes fit into one of the three categories above, there’s certainly some clear convergence happening. Many race bikes now offer generous tyre clearance, wider gearing ranges and even some decent ride comfort to be more appealing to a larger market. A number of brands have made their all-around race bikes more like their aero racers, and even relaxed the fit and handling of these bikes, too. And as just covered, some have pushed their endurance road bikes toward gravel territory.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-1340x754.jpg\" alt=\"\" class=\"wp-image-468813\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Cervelo-Caledonia-Ultegra-Di2-road-bike-review-cyclingtips-Field-test-5.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The Cervelo Caledonia is an example of a modern all-rounder. It&#8217;s an endurance bike with race bike characteristics. An increasing number of brands are offering do-it-all road bikes like this. </figcaption></figure>\n\n\n\n<p>There are a few ways to help you cut through the marketing chaff and decipher where each bike sits. A great tool is the “trail figure” of a bike which gives an indication of how quickly it steers. The lower the number, the faster the handling. Very broadly speaking (there are many other factors involved that can impact this), a trail figure under 59 mm suggests the bike is intended to feel quick and race-like, while 60 mm and over should have the bike feeling a touch more docile.&nbsp;</p>\n\n\n\n<p>Maximum allowed tyre clearance and stock width can be quite telling for the bike’s intended purpose too. Most modern race bikes will be equipped with 25 or 28 mm tyres, while endurance and all-road-style bikes will typically be fitted with 30-32 mm. Fender compatibility will also assist in whether the bike is made for racing or recreation. And the same goes for whether the bike has an easy-spinning sub-compact or compact crank (48/32 or 50/34 respectively), or more race-like gearing (52 or 53T big ring).&nbsp;</p>\n\n\n\n<p>It&#8217;s also worth becoming acquainted with the bike&#8217;s stack and reach figures (covered in step three).&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"894\" src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26-1340x894.jpg\" alt=\"\" class=\"wp-image-35220\" srcset=\"https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26-1340x894.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2020/12/Engin-Cycles-all-road-gravel-bike-26.jpg 1600w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The ability to run full-length fenders is often a must-have for those that live in wet climates. Most endurance road bikes are designed to work with full-length fenders, while such a feature is rare on dedicated race bikes.&nbsp;</figcaption></figure>\n\n\n\n<h2>Step 2: What’s your budget?&nbsp;</h2>\n\n\n\n<p>This second step will most likely be a key deciding factor in the bike you end up with. So how much are you willing (or able) to spend?&nbsp;</p>\n\n\n\n<p>In the simplest sense spending more will get you a higher-performing bike that is lighter, likely more aerodynamic, more durable, and perhaps even more comfortable. However, there are obvious exceptions to this, and no doubt the laws of diminishing returns play strongly in the road bike world.&nbsp;</p>\n\n\n\n<p>Below are some key elements to consider. Many of these are far larger topics that each offer a rabbit hole of research.&nbsp;</p>\n\n\n\n<h3>Frame material</h3>\n\n\n\n<p>A more modest budget is likely to keep your buying decision to an aluminium frame, or perhaps something made of steel. A bigger budget will open you up to carbon fibre or titanium. (Price ranges vary considerably from one local market to another.)&nbsp;</p>\n\n\n\n<p>What’s important to note is that the exact type of material used matters a whole lot less than how the material is used. A wonderfully engineered aluminium frame can be far more enjoyable to ride than a poorly designed carbon frame, and the same applies for all material options.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-1340x754.jpg\" alt=\"\" class=\"wp-image-465820\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Emonda-SL-6-Pro-road-bike-review-cyclingtips-Field-test-24.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Carbon fibre offers some impressive engineering potential. Most obviously it can be formed into shapes that would be extremely difficult with metal, while the directional nature of the material can be used for tailoring stiffness and comfort. Still, just because a frame features carbon fibre doesn&#8217;t mean it&#8217;s better. </figcaption></figure>\n\n\n\n<p>Put another way, almost all of the staff at CT would rather ride a great aluminium frame than a mediocre carbon version. And generally speaking, you should invest in a good frame (with the right fit) before worrying about the parts bolted to it.&nbsp;</p>\n\n\n\n<h3><br>Brake type</h3>\n\n\n\n<p>The question of rim brake versus disc brake is one of the most hotly contested debates in modern road bikes. In a nutshell, the biggest brands in the bike industry have deemed rim brakes as old technology and almost all investment in product development is being put into progressing disc brakes.&nbsp;</p>\n\n\n\n<p>Rim brakes remain the lighter option and will provide you with a lighter bike for the same money. Meanwhile, disc brakes aim to offer increased stopping control (especially in wet conditions), open up clearance for wider tyres, and are fast becoming the only option on a number of popular bikes from big brands.&nbsp;&nbsp;</p>\n\n\n\n<p>For more, check out our <a href=\"https://cyclingtips.com/2018/05/complete-faq-to-road-disc-brakes/\" target=\"_blank\" rel=\"noreferrer noopener\">complete FAQ to road disc brakes</a>.</p>\n\n\n\n<h3>Wheels matter </h3>\n\n\n\n<p>After the frame, it&#8217;s likely the wheels (and tyres) that will make the biggest difference to the ride. It can take an experienced eye to tell the difference between wheels, but some key things to look for are rim width (the <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2016/11/the-new-normal-the-thinking-behind-wide-road-wheels/\" target=\"_blank\">trend is toward rims of at least 19 mm width</a>), a high-quality build with even spoke tensions, and reputation for hub durability (e.g. DT Swiss and Shimano).</p>\n\n\n\n<p>Wheelset weight can also be a factor in how lively the bike feels. Roughly speaking, road wheel sets over 1,600 g are considered on the heavy side, and it’s common to see wheelsets over 2,000 g on entry-level bikes.</p>\n\n\n\n<h3>Shifting type and component levels</h3>\n\n\n\n<p>Typically the more you spend the more gears the bike will have and the smoother they will function. And as with most things in cycling, there&#8217;s an inverse relationship between component weight and price.&nbsp;</p>\n\n\n\n<p>The vast majority of road bikes on the market today feature Shimano components, with competitors SRAM and Campagnolo appearing on higher-end bikes. Shimano’s component hierarchy, from cheapest to most expensive goes as follows: Claris, Sora, Tiagra, 105, Ultegra, and Dura-Ace. SRAM’s road hierarchy is Apex, Rival, Force, and Red.&nbsp;(It&#8217;s rare to find Campagnolo on complete bikes).</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-1340x754.jpg\" alt=\"\" class=\"wp-image-471257\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Trek-Domane-AL-Disc-4-all-road-bike-review-cyclingtips-Field-test-8.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Shimano Tiagra is a fairly entry-level groupset, but its shifting function is impressively good. The most obvious disadvantage is seen on the scales. </figcaption></figure>\n\n\n\n<p>Those looking at Shimano Ultegra-level bikes or above will likely need to decide between <a href=\"https://cyclingtips.com/2021/01/electronic-versus-mechanical-shifting-the-pros-and-cons/\" target=\"_blank\" rel=\"noreferrer noopener\">mechanical versus electronic shifting</a> (follow the link for a full discussion on this topic).&nbsp;</p>\n\n\n\n<p>It’s worth noting that the frame and wheels will play a larger role in how much you enjoy the bike versus what components are bolted to it. If given the choice, invest in a better frame and wheels before going with better derailleurs and shifters.&nbsp;</p>\n\n\n\n<h3>Place of purchase</h3>\n\n\n\n<p>The internet age has led to a relatively new decision for bike buyers: buy from a local bike shop or do it yourself online? The former offers you hands-on service and perhaps access to a local riding community, while the latter more than likely has a price advantage.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-1340x754.jpg\" alt=\"\" class=\"wp-image-466561\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Canyon-Ultimate-CF-SL-Disc-8-road-bike-review-cyclingtips-Field-test-35.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Buying consumer-direct likely means you&#8217;ll be getting a bike in a box. The assembly and setup is one reason to go through traditional channels, but ensuring you get a correct fitting bike is the most critical reason. </figcaption></figure>\n\n\n\n<p>Personally I believe that buying a bike online is best left to those who know exactly how they like their bikes to fit and are able to do basic maintenance themselves. For everyone else the hands-on experience and service a good local bike shop can provide has the potential to make a substantial difference to your enjoyment in cycling.&nbsp;</p>\n\n\n\n<h3>New or used</h3>\n\n\n\n<p><br>Closely following the last point is a decision over new and used. No doubt your money can go further with a used bike, but there are always risks associated with this. Much like the last point, I’d suggest that buying used is only a good idea if you’re confident in your bike fit and understand basic maintenance in order to gauge what condition the bike is in.&nbsp;</p>\n\n\n\n<h3>Budget for extras&nbsp;</h3>\n\n\n\n<p>If you’re new to cycling then be sure to budget for all the extras that are required to get pedalling. Almost all new bikes don’t include pedals, and you’ll likely also want some shoes to go with them.&nbsp;</p>\n\n\n\n<p>Then expense of all the other must-have items will quickly creep up too: a helmet, cycling shorts/bibs, <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2019/06/the-best-bottle-cages-ct-recommends/\" target=\"_blank\">bottle cages</a>, spares to fix a flat tyre, a pump – the list goes on.&nbsp;</p>\n\n\n\n<h2>Step 3: Fit is critical&nbsp;</h2>\n\n\n\n<p>Road cycling can be quite a fixed-position sport and you’ll tend to ride with a set posture for long periods of time. Gone are the days of a road bike being an ache to ride – you should be able to pedal without any discomfort. Get the wrong size or wrong setup though and you won’t only be uncomfortable, you may be putting yourself at risk of injury. Because of this it’s critical to ensure the bike fits you correctly.&nbsp;</p>\n\n\n\n<p>Here it’s important to be realistic about your flexibility and athletic ability, and pick the appropriate bike. If you can’t remember the last time you touched your own toes then an aggressive race bike is likely not ideal. Endurance-style bikes are designed for the masses and most riders are likely to be most comfortable on this style of bike which offers a more relaxed riding position.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-1340x754.jpg\" alt=\"\" class=\"wp-image-467676\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/2021-Giant-TCR-Advanced-Pro-1-Disc-road-bike-review-cyclingtips-Field-test-22.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Racing bikes are intended to keep you in an aggressive riding position with a reduced frontal profile to the wind. By contrast, endurance-style bikes are more upright and with less of a stretch to the bars. </figcaption></figure>\n\n\n\n<p>If you’re unsure of where to start then I’d strongly recommend finding yourself a good local bike shop. Experienced bike shop staff will be able to advise you on the correct size bike and style for your needs.&nbsp;</p>\n\n\n\n<p>When comparing across multiple brands it’s important to know that there are no industry standards for how bike sizes are labelled. A 54 cm frame in one brand may be equivalent to a 56 cm in another, and the same applies for those labelled with small, medium and large.&nbsp;</p>\n\n\n\n<p>Thankfully there is a pretty good guide for how a bike will fit and compare to other bikes: stack and reach figures. These two figures remain the most robust way of comparing the actual sizing between various bikes. We have a dedicated article about the <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2018/01/beyond-the-top-tube-things-to-know-when-sizing-up-a-road-frame/\" target=\"_blank\">importance of stack and reach in bike sizing</a>.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"755\" src=\"https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-1340x755.jpg\" alt=\"\" class=\"wp-image-467685\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-1340x755.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-1080x608.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/01/Giant-2021-TCR-Advanced-Geometry-chart.jpg 1600w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Geometry charts offer insight on the sizing and handling of a bike. Some important elements are the stack, reach and trail figures. </figcaption></figure>\n\n\n\n<h2>Step 4: Test ride if you can</h2>\n\n\n\n<p>This final step is something I would have strongly suggested in the past, but current pandemic times have all but made this impossible.&nbsp;</p>\n\n\n\n<p>Bike availability is so limited at the moment that bike shops are no longer carrying demo fleets like they would have in the past. If you can manage a ride around the block or even something longer, that’s great, and I’d encourage you to do just that. However, there’s a good chance you’ll need to buy your next bike without having tested it. If this is the case then listen to opinions from people you trust.&nbsp;</p>\n\n\n\n<h2>Case Studies&nbsp;</h2>\n\n\n\n<p>Below are some fictional examples based on non-fictional events.&nbsp;</p>\n\n\n\n<h3>The first time beginner: Paul</h3>\n\n\n\n<p>Paul recently dusted off his old department store mountain bike after constantly hearing from his work colleagues about how great cycling is. Paul did two rides and then joined his work colleagues on a road ride, he got exhausted, then got dropped, and then pretended his bike had broken so the pain would end. Paul is now obsessed with cycling and wants a more appropriate bike for road bunch riding. He’s not interested in commuting and won&#8217;t be riding when it&#8217;s raining. Paul has a US$1,500 budget to get everything.&nbsp;&nbsp;</p>\n\n\n\n<p>We believe Paul should look for an entry-level aluminium road bike with an endurance-type fit. Having wider tyres may be slightly slower but they’ll offer more control and comfort. As Paul is a fair-weather rider and on a tight budget, then rim brakes are likely to be a fine starting point. Bikes like the Specialized Allez, Giant Contend SL, Scott Speedster and similar should be on Paul’s radar.&nbsp;</p>\n\n\n\n<h3>Rediscovering road cycling: Sandra</h3>\n\n\n\n<p>Sandra used to be a competitive road cyclist but shifted into running for a number of years. Sandra’s running is causing knee pain and it was suggested she dust off the racing bike and get pedalling. Sandra has a competitive spirit and good fitness. That old bike still runs but feels tired. It doesn’t feel comfortable anymore or inspire confidence. Sandra is willing to spend US$4,000 for a new bike.&nbsp;</p>\n\n\n\n<p>Sandra is likely the right candidate for a lightweight all-rounder race bike. These new bikes may not be lighter than her old one, but they&#8217;ll surely be more comfortable, more confident, and just easier to ride. Bikes like those covered in our recent <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/tag/2021-cyclingtips-road-bike-field-test/\" target=\"_blank\">all-rounder race bike Field Test</a> are well worth a look.&nbsp;</p>\n\n\n\n<h3>Keen to explore: Leo&nbsp;</h3>\n\n\n\n<p>Leo is an enthusiastic mountain biker looking to gain some fitness during the week when it&#8217;s not time-efficient to hit the trails. He’s expressed interest in exploring some of his local gravel loops and is open to the idea of overnight adventures. However, Leo also wants to join his friends who ride road bikes in a group. Budget isn’t such an issue, but Leo wants one bike to do it all.&nbsp;</p>\n\n\n\n<p>Leo is much like a number of riders looking to either simplify their bike collection or expand what cycling means to them. In Leo’s case, his demand for group road riding means he’ll be best served by a bike that’s still sporty and efficient to pedal. There are two paths here.</p>\n\n\n\n<p>One option would be to get a modern endurance road bike that offers generous tyre clearance for the occasional gravel adventure. Many of these bikes can now fit 32-35 mm tyres without issue, and that’s enough for most publicly accessible dirt roads. Bikes like the Trek Domane, Specialized Roubaix, or Cervelo Caledonia are well worth considering here.</p>\n\n\n\n<p>The alternative is a fast gravel bike that was built with racing in mind. The Cervelo Aspero comes to mind as a popular pick in this space, and is wonderfully quick on the road with the appropriate slick tyres. The Trek Checkpoint, Canyon Grail Al or similar are also well worth looking at.&nbsp;</p>\n\n\n\n<p>If the versatility of a gravel bike appeals to you then be sure to check out our guide to <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2020/03/how-to-choose-a-gravel-bike/\" target=\"_blank\">choosing a gravel bike</a>. </p>\n\n\n\n<p class=\"has-text-align-center\">***</p>\n\n\n\n<p>Hopefully this article has set you on a path to finding the right road bike. To recap, find a&nbsp;bike that’s suitable for how you want to ride and make sure it fits you correctly. If you&#8217;ve got further questions, be sure to visit your local bike shop, chat to a cyclist you trust, or ask us in the comments section below. Good luck and happy riding!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/a-beginners-guide-to-choosing-a-road-bike/\">A beginner’s guide to choosing a road bike</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cfe8a1bf13c1cb67914a2bf555ada179b3efc3f1f2b3017cbd458607adb2d55c","category":"Cycling"}