{"title":"Flying singers: spatio-temporal distribution and acoustic dynamics of two species of Carinetini (Hemiptera: Cicadidae) cicadas in sympatry","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlad173/7463999?rss=1","date":1701993600000,"content":"<span><div>Abstract</div>The natural history of Neotropical cicadas is poorly understood. Here, we describe comparatively the spatio-temporal distribution and acoustic dynamics of two Carinetini cicadas in sympatry: colourful-cicada, <span>Carineta diardi</span>, and eryngo-cicada, <span>Guaranisaria llanoi</span>. Males of both species emit conspicuous acoustic signals during flight, a rare behaviour in cicadas. Although sympatric and synchronic, these species are not syntopic, occurring in different habitats: colourful-cicada occurs in Atlantic Forest and eryngo-cicada in native Pampean grasslands. Vertical stratification also occurs: colourful-cicada flies, sings, and copulates along the forest edge and canopy (above 2 m), while eryngo-cicada flies, sings, and copulates only in open areas (below 1 m), performing directional flights between the ‘Gravatá’ eryngo patches—a keystone plant species used as shelter, and calling and reproduction site. Acoustic repertoires vary between species: colourful-cicada presents two types of signals (flying and calling songs) and eryngo-cicada has four types (flying, calling, courtship, and wing-flicks emitted by the females). Furthermore, acoustic differences between species were found in the flying songs, but no specific differences were found in the peak frequency of their calling songs. These results show that spatial use of ‘flying singer’ cicadas can vary in habitat, providing coexistence in sympatry.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"cff6d7b0815f290215e48a742beba9179f34e7cce12ca12bbaa0826191445d96","category":"Environment"}