{"title":"Luke Durbridge will replace Jack Haig in Australia’s Olympic line-up","link":"https://cyclingtips.com/2021/07/luke-durbridge-will-replace-jack-haig-in-australias-olympic-line-up/","date":1626388200000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00031279-265-650x430.jpeg\" /></div><h2>Luke Durbridge will replace Jack Haig in Australia's Olympic line-up</h2><p>\n</p><p>Luke Durbridge (BikeExchange) will make his Olympic debut after being named as Jack Haig’s replacement in Australia’s road race line-up.</p>\n\n\n\n<p>Haig <a href=\"https://cyclingtips.com/2021/06/jack-haig-out-of-the-tour-with-broken-collarbone-and-concussion/\" target=\"_blank\">crashed out</a> of the <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a> on stage 3 with a broken collarbone and concussion, ending his first tilt at Grand Tour GC leadership. While the Victorian was hopeful of recovering in time for the Olympics, his collarbone fracture turned out to be worse than first thought, and he was forced to <a href=\"https://cyclingtips.com/2021/07/jack-haig-will-miss-the-olympics-after-his-tour-crash/\" target=\"_blank\">give up his Olympic spot</a>.</p>\n\n\n\n<p>West Australian Luke Durbridge will head to Tokyo in Haig’s place.</p>\n\n\n\n<p>“Congratulations to Luke on making his Olympic debut,” said Australia’s Olympic Chef de Mission, Ian Chesterman. “Today’s selection is a great achievement for a rider who has competed at an elite level for more than a decade.</p>\n\n\n\n<p>“With five national championships from 2012 to 2020 and fantastic results across the globe, Luke has shown he will be a strong addition to the road cycling team.”</p>\n\n\n\n<p>Durbridge wrote on Instagram that racing the Olympics will be a dream come true.</p>\n\n\n\n<p>“I wrote in my dairy when I was 15 I wanted to go and represent my country at the Olympic Games,” he wrote. “It’s a long road to your dreams with lots of ups and downs and sometimes you just need some stars to align to get there. But you just got to show up each day and do your best and try because if you never try you will never know.</p>\n\n\n\n<p>“I’m deeply honoured to get the call up to represent my country at the Olympic Games in Tokyo. My family my friends my team I have to thank for the incredible support to get me here.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CRVsz1aFPyS/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CRVsz1aFPyS/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Luke Durbridge (@lukedurbridge)</a></p></div></blockquote> \n\n\n\n<p>Meanwhile, Durbridge’s BikeExchange teammate Lucas Hamilton remains in Australia’s Olympic line-up despite dislocating his AC joint in a crash on stage 13 of the Tour. Hamilton had been selected as a replacement for Cameron Meyer who withdrew himself from the Olympic squad to be with his ill father.</p>\n\n\n\n<p>The men’s road race at the Tokyo Olympics will be held next Saturday, July 24. The Australian line-up includes Durbridge, Hamilton, Rohan Dennis and Richie Porte. Dennis will race the time trial alongside one as-yet-unnamed member of the Aussie squad.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/luke-durbridge-will-replace-jack-haig-in-australias-olympic-line-up/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cff882c9b9e1e1cd69e74f72c73a2c9445dcdf2abfe071fb333252f913b7e55f","category":"Cycling"}