{"title":"Diabetes self-management education programs: Results from a nationwide population-based study on characteristics of participants, rating of programs and reasons for non-participation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310338","date":1726149600000,"content":"<p>by Solveig Weise, Yong Du, Christin Heidemann, Jens Baumert, Thomas Frese, Marcus Heise</p>\r\nObjective <p>Population-based studies of reasons for not participating in diabetes self-management education (DSME) are scarce. Therefore, we investigated what sociodemographic and disease-related factors are associated with participation in DSME, the reasons for not participating in DSME and how participants evaluate DSME.</p> Research design and methods <p>We used data from the nationwide survey “Disease knowledge and information needs–Diabetes mellitus 2017”, which included a total of 1396 participants diagnosed with diabetes mellitus (diabetes; n = 394 DSME-participants, n = 1002 DSME-never-participants). Analyses used weighted logistic or multinominal regression analyses with bivariate and multivariable approaches.</p> Results <p>Participants were more likely to attend DSME if they had a medium (OR 1.82 [95%CI 1.21–2.73]),or high (OR 2.04 [95%CI 1.30–3.21]) level of education, had type 1 diabetes (OR 2.46 [1.24–4.90]) and insulin treatment (OR 1.96 [95%CI 1.33–2.90]). Participants were less likely to attend DSME if they lived in East Germany (OR 0.57 [95%CI 0.39–0.83]), had diabetes for &gt;2 to 5 years (OR 0.52 [95%CI 0.31–0.88] compared to &gt;5 years), did not agree that diabetes is a lifelong disease (OR 0.30 [95%CI 0.15–0.62], had never been encouraged by their physician to attend DSME (OR 0.19 [95%CI 0.13–0.27]) and were not familiar with disease management programs (OR 0.67 [95%CI 0.47–0.96]). The main reasons for non-participation were participant’s personal perception that DSME was not necessary (26.6%), followed by lack of recommendation from treating physician (25.7%) and lack of information on DSME (20.7%). DSME-participants found DSME more helpful if they had a medium educational level (OR 2.06 [95%CI 1.10–3.89] ref: low level of education) and less helpful if they were never encouraged by their treatment team (OR 0.46 [95%CI 0.26–0.82]).</p> Discussion <p>Professionals treating persons with diabetes should encourage their patients to attend DSME and underline that diabetes is a lifelong disease. Overall, the majority of DSME participants rated DSME as helpful.</p>","author":"Solveig Weise","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"cffd58059ba535951f32cfcbcf93d7ece76ef7f6ac74f9066f4701b52bb9d13f","category":"Interdisciplinary"}