{"title":"KBTG ยกระดับสู่ Human-First Organization ประยุกต์งานวิจัย Deep Tech สร้างประโยชน์จริง ขับเคลื่อนภาพรวมเทคโนโลยีทั้งประเทศ","link":"https://www.blognone.com/node/137310","date":1703044800000,"content":"<div><div><div><p>เรื่องของ Machine Learning และ AI คือเทคโนโลยีหลักที่ถูกพูดถึงอย่างมากในรอบปีที่ผ่านมา เพราะนี่คือสิ่งที่จะเปลี่ยนแปลงโลกให้ต่างไปจากเดิมอย่างสิ้นเชิง ทุกอย่างจะเพิ่มประสิทธิภาพ เพิ่มความเร็ว แต่หลายสิ่งที่หลายคนยังกังวลคือ เทคโนโลยีเหล่านี้จะมาทดแทนคนหรือไม่ หรือเราสามารถใช้งานเทคโนโลยีได้เต็มประสิทธิภาพแล้วหรือยัง ซึ่งแนวทางในอนาคตสามารถเห็นได้จากบริษัท Tech Company ที่วางแนวทางการพัฒนาและยกระดับขึ้นอย่างต่อเนื่อง</p>\n<p>หนึ่งในนั้นคือ กสิกร บิซิเนส-เทคโนโลยี กรุ๊ป หรือ KBTG ที่ประกาศแนวทางชัดเจนในการขับเคลื่อนองค์กรด้วยการเป็น AI-First Organization เน้นเทคโนโลยีที่เรียกว่า M.A.D. คือ Machine Learning, AI และ Data ซึ่งทั้ง 3 ส่วนต้องทำงานร่วมกันเพื่อให้ รู้จัก เข้าถึง และเข้าใจ คนใช้บริการมากย่ิงขึ้นกว่าเดิม แต่มาถึงวันนี้ KBTG ได้ยกระดับสู่การเป็น Human-First Organization เพื่อเผยแพร่องค์ความรู้ สร้างประโยชน์ให้คนหมู่มาก</p>\n<p>ทำให้เกิดคำถามขึ้นว่าการเป็น Human-First Organization ของ KBTG จะสร้างความเปลี่ยนแปลงอย่างไร</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/9ho2MHL.jpg\" /></p>\n<p><strong>จาก AI-First สู่ Human-First เพื่อการใช้งานจริง</strong></p>\n<p>เรืองโรจน์ พูนผล ประธานกลุ่มบริษัท KBTG บอกว่า การจะสร้างประโยชน์ให้เกิดขึ้นกับประเทศชาติ ธุรกิจของ KBank และ KBTG รวมถึงพันธมิตรผู้เกี่ยวข้อง ที่ผ่านมา KBTG ได้ยกระดับองค์กรสู่การเป็น AI-First Organization มุ่งเน้นการพัฒนา AI ใน 2 ส่วนสำคัญ คือ การทำวิจัย (Research) ซึ่งเป็นหัวใจหลักในการคิดคนสร้างสรรค์นวัตกรรม ซึ่งมีหัวหอกสำคัญคือ KBTG Labs มีทีมนักพัฒนาและนักวิจัยด้าน AI เป็นอันดับต้นๆ ของประเทศ และอีกส่วนสำคัญ คือ การประยุกต์ใช้จริง (Application) เราจะเห็นว่าในอดีต งานวิจัยจำนวนมากขึ้นหิ้ง ยิ่งงาน Deep Tech ขั้นสูงแต่ไม่มีการนำมาใช้ ซึ่งเท่ากับไร้ความหมาย</p>\n<p>ดังนั้น KBTG จึงเน้นทั้งส่วนของการทำวิจัยและการประยุกต์ใช้จริง สร้างประโยชน์ให้เกิดกับคนหมู่มาก จึงเกิดเป็น Human-First ผลลัพธ์ที่เกิดขึ้นคือ สามารถนำนวัตกรรมเทคโนโลยีมายกระดับผลิตภัณฑ์บริการให้ตอบสนองความต้องการของตลาดได้จริง และสามารถเผยแพร่องค์ความรู้ที่มีเพื่อยกระดับบุคลากรในไทยได้อีกด้วย</p>\n<p>กล่าวได้ว่า การพัฒนาจาก AI-First มาเป็น Human-First เพื่อเป็น Human-First Organization เริ่มมองเห็นผลลัพธ์ที่เป็นรูปธรรมมากขึ้นเรื่อยๆ ผ่านการทำวิจัยเชิงลึกที่นำมาใช้งานจริง เช่น Facial Recognition, Computer Vision และ Natural Language Processing (NLP) ทำให้ผลิตภัณฑ์และบริการดีขึ้น ผู้ใช้มีประสบการณ์ที่ดีขึ้น ซึ่งการจะใช้งานจริงให้เกิดประโยชน์ในวงกว้าง จำเป็นต้องเรียนรู้และเข้าใจมนุษย์ ทั้งความคิด พฤติกรรมให้มากขึ้นอีก ถือเป็นสิ่งที่ยังต้องศึกษาต่อไปอีกมาก</p>\n<p>ตัวอย่างเช่น การศึกษาพฤติกรรมของผู้บริโภคในการตัดสินใจสมัครบริการสินเชื่อ หรือค้นหาผลิตภัณฑ์ทางการเงินที่ตรงใจ ซึ่งสามารถใช้ Machine Learning และ AI เข้ามาช่วยนำเสนอให้มีความสะดวก รวดเร็ว และในขั้นตอนการสมัครก็สามารถทำได้ง่ายด้วย AI Face Recognition ที่มีใช้งานใน K PLUS ซึ่งปัจจุบันมีผู้ใช้งานกว่า 1 ใน 3 ของประชากรไทย ถือว่าช่วยยกระดับบริการไปอีกขั้น</p>\n<p><strong>สร้างคน สร้างเทคโนโลยี เพื่อบริการที่เหนือกว่า</strong></p>\n<p>เรืองโรจน์ บอกว่า KBTG จะเน้นงานวิจัยด้านเทคโนโลยีการเงินเป็นหลัก เพื่อให้ประสบการณ์ในการเข้าถึงผลิตภัณฑ์ของลูกค้าดีขึ้น มีความจริงใจและปลอดภัยในการใช้งาน ผ่าน Verification Technology, Fraud Detection, Personalized Offer และ Wealth Analytics นอกจากนี้ยังมีงานวิจัยด้านการศึกษา เพื่อพัฒนาคน เช่น การนำ AI มาสอนเรื่องการเงิน หรือการใช้ AI สนทนากับคนในลักษณะ บทสนทนาเสมือนจริง (Human-Like Conversation) และการสื่อสารผสมผสาน (Multimodal) มีการใช้ Thai NLP เพื่อให้เข้าใจบทสนทนามากขึ้น ซึ่งเป็นการประยุกต์ใช้งานวิจัยที่ KBTG ศึกษาใน KBTG Labs</p>\n<p>สิ่งที่ยืนยันความสำเร็จในก้าวแรกได้ดีคือ ในปี 2566 มีผลงานวิจัยจาก KBTG ด้าน M.A.D. ตีพิมพ์ทั่วโลก 6 ฉบับ รวมไปถึงการสนับสนุนงานวิจัยร่วมของนายพัทน์ ภัทรนุธาพร นักศึกษาปริญญาเอกไทยคนแรกจาก MIT Media Lab และ KBTG Fellow ในหัวข้อ “Influencing human–AI interaction by priming beliefs about AI can increase perceived trustworthiness, empathy and effectiveness” ซึ่งได้ตีพิมพ์ใน Nature Machine Intelligence วารสารวิชาการระดับโลก</p>\n<p>นอกจากนี้ ยังมีการจับมือกันระหว่าง KBTG Labs และ MIT Media Lab หน่วยงานวิจัยระดับโลก ร่วมกันทำงานวิจัยเทคโนโลยีใหม่ๆ เช่น Future You จำลองตัวตนของผู้ใช้งานในอนาคตที่สามารถโต้ตอบได้แบบเรียลไทม์ และ “คู่คิด” คู่หูที่พร้อมให้คำปรึกษาและแนะนำแนวทางต่างๆ โดยผลลัพธ์ที่ได้มาจากแหล่งข้อมูลที่น่าเชื่อถือและสามารถตรวจสอบกลับได้ มี AI น้องคะน้าและคชาที่จะตอบคำถามในมุมมองที่แตกต่างกันเพื่อใช้ในการประกอบการตัดสินใจให้มีประสิทธิภาพสูงสุด พัฒนาต่อยอดจากงานวิจัย K-GPT (Knowledge-GPT) ซึ่งเป็นการใช้ความสามารถของ ChatGPT ในการให้ความรู้เชิงลึกเฉพาะด้าน มาพร้อมกับความสามารถในการรองรับภาษาไทย และมีแผนจะนำ “คู่คิด” เปิดตัวสู่ตลาดใช้งานจริงในปี 2567</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/ZCwn2C3.jpg\" /></p>\n<p><strong>ต่อยอดงานวิจัยสู่ผลงานเชิงประจักษ์ ขับเคลื่อนอุตสาหกรรม</strong></p>\n<p>สำหรับส่วนของการต่อยอดผลงานวิจัย KBTG นำผลงานวิจัยด้าน M.A.D. มาใช้ประกอบกับผลิตภัณฑ์และบริการของ KBank ในด้านต่างๆ เช่น การตลาด (Marketing Intelligence) สินเชื่อ (Credit Intelligence) การป้องกันการทุจริต (Fraud Intelligence) และการให้บริการ Call Center การนำเทคโนโลยีเหล่านี้มาประมวลผลและวิเคราะห์ข้อมูลดังกล่าวคิดเป็นมูลค่าได้มากกว่า 500 ล้านบาท รวมทั้งมีการนำเทคโนโลยีมาใช้ยกระดับประสิทธิภาพการทำงานของนักพัฒนา KBTG เช่น การนำ Copilot มาช่วยเพิ่มศักยภาพการเขียนโค้ดของพนักงานขึ้น 2 เท่า การจัดตั้ง M.A.D. Guild ภายในองค์กร เพื่อเป็นแพลตฟอร์มในการแลกเปลี่ยนความรู้และทำให้ AI เป็นเรื่องใกล้ตัวที่คน KBTG สามารถเข้าถึงได้ง่าย</p>\n<p>นอกจากนี้ยังนำเทคโนโลยีมาให้บริการเชิงพาณิชย์ผ่าน KX ซึ่งเปิดกว้างสำหรับพันธมิตรทางการเงินและธูรกิจในอุตสาหกรรมอื่นๆ ที่สนใจ เช่น เทคโนโลยีการยืนยันตัวตนและตรวจสอบความถูกต้อง เพื่อความปลอดภัยของการทำธุรกรรม (AINU) และเทคโนโลยี AI ตรวจจับสภาพรถที่มีความเสียหายและประเมินราคาค่าใช้จ่ายเบื้องต้นจากภาพถ่าย สำหรับใช้งานในธุรกิจประกัน (Car AI) โดย Car AI ได้รับรางวัล Asian Technology Excellence Awards ในสาขา AI - Financial Technology ซึ่งจัดทำโดย Asian Business Review นิตยสารธุรกิจชั้นนำในระดับภูมิภาค</p>\n<p>จะเห็นได้ว่า KBTG มีการออกแบบผลิตภัณฑ์และบริการโดยเน้น AI และ Human เพื่อเป้าหมายของลูกค้า โดย Human เน้นศึกษาความคิด พฤติกรรม การโต้ตอบ เพื่อทำความเข้าใจความต้องการและปัญหา เพื่อนำไปสู่การแก้ไข และสร้างความพึงพอใจ พัฒนาผลิตภัณฑ์และบริการที่ดีมากยิ่งขึ้น ขณะที่ AI จะเน้นพัฒนา AI ให้มาช่วยในการสร้างสรรค์ผลิตภัณฑ์และบริการ การใช้งานข้อมูล การปรับเปลี่ยนกระบวนการ การวิเคราะห์ ทั้งหมดจะทำให้นำเสนอสิ่งที่ดีที่สุดให้กับลูกค้า</p>\n<p>โดย KBTG ยังเผยแพร่องค์ความรู้ทั้งภายในและภายนอกองค์กร ผ่านหลักสูตร M.A.D. Bootcamp ภายใต้โครงการ KBTG Kampus ClassNest ซึ่งเปิดให้คนสายไอทีที่สนใจพัฒนาทักษะด้าน M.A.D. ได้ลงเรียนและเติบโตแบบก้าวกระโดดไปด้วยกัน พร้อมทั้งสนับสนุนชุมชน AI (AI Community) ในการจัดกิจกรรมต่างๆ ที่เกี่ยวข้องกับ M.A.D. รวมถึงเผยแพร่ Best Practice และ Lesson Learned จากประสบการณ์ตรงของการทำงานภายใน KBTG ผ่าน KBTG Techtopia และเวทีแลกเปลี่ยนความรู้ต่างๆ ที่จะเกิดขึ้นในอนาคต</p>\n<p><strong>บทสรุป 2567 ปีแห่ง M.A.D. เพื่ออนาคต</strong></p>\n<p>ในปี 2567 ทาง KBTG จะขับเคลื่อนเทคโนโลยีด้วย M.A.D. อย่างต่อเนื่อง ด้วยการเป็น Human-First เพื่อให้เกิดการวิจัยและประยุกต์ใช้จริง เพื่อยกระดับอุตสาหกรรมทางการเงินของภูมิภาค ทั้งด้านความเชื่อมั่น ระบบที่มีความปลอดภัย การออกแบบที่เข้าใจทุกกลุ่มลูกค้า รวมถึงการทำงานร่วมกับ Regulation และ Government สร้างการรู้เท่าทันเทคโนโลยีสมัยใหม่ การออกกฎระเบียบและสนับสนุนนวัตกรรมใหม่ให้เกิดขึ้น</p>\n<p>เรืองโรจน์​ กล่าวสรุปว่า เรื่อง Deep Tech จะได้รับการสนับสนุน โดยมีการเปิดตัว KXVC กองทุนมูลค่า 3,500 ล้านบาท เพื่อลงทุนด้าน AI, Web3 และ Deep Tech ซึ่งในปี 2567 ทาง KXVC พร้อมมุ่งหน้าเต็มกำลังสำหรับการลงทุนในสตาร์ทอัพและกองทุน AI ทั่วโลก เพื่อเป็นประตูที่จะนำเทคโนโลยี AI ใหม่ๆ และเงินทุนจากต่างประเทศมาสู่ประเทศไทย รวมถึง KBTG เองก็พร้อมจับมือกับพันธมิตรทั้งในประเทศและนอกประเทศพัฒนาขีดความสามารถด้าน M.A.D. และนำผลงานวิจัยที่กำลังทำอยู่ ไปพัฒนาเป็นผลิตภัณฑ์ที่เปิดให้คนทั่วไปสามารถใช้งานได้</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"cfff15f63316f97e314719bc6551c8384bfed0f56571e4f54c295e55d8ad0d0a","category":"Thai"}