{"title":"Same but Different: Intersexual and Age‐Related Habitat Use of the Threatened West African Trionyx triunguis Clade—A Four‐Country Comparative Study","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13323?af=R","date":1726677558000,"content":"<h2>ABSTRACT</h2>\n<p>Biological communities are structured by a variety of biotic and abiotic relationships, whose understanding forms the basis for effective conservation. Among the myriad factors influencing community dynamics, resource partitioning stands out, potentially enriching ecosystem complexity but also carrying risks for conservation if disregarded. In this study, we investigated intersexual and ontogenetic niche differences among populations of the West African softshell turtle <i>Trionyx triunguis</i> in Liberia, Cote d'Ivoire, Ghana and Nigeria. We observed that these distinct populations exhibited similar habitat preferences, favouring large rivers with abundant riverbank and aquatic vegetation, and muddy substrates. Disparities in habitat preferences were evident among populations and across various life stages, indicating the adaptability of the species. We found that the species was active throughout the year, but most of our sightings and captures occurred during the wet season. In light of the species' vulnerability to overhunting, our research findings provide important data on the ecology of this species that can assist in its effective conservation across all life stages.</p>","author":"Edem A. Eniang, \nStephanie N. Ajong, \nGabriel Hoinsoudé Segniagbeto, \nEniang Inemesit Edem, \nSulemana Bawa Gbewaa, \nFabio Petrozzi, \nJulia E. Fa, \nDaniele Dendi, \nMathias Behangana, \nAndrew D. Walde, \nNioking Amadi, \nGodfrey C. Akani, \nSery Gonedele‐Bi, \nNic Pacini, \nPearson McGovern, \nLuca Luiselli","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"cfffe5c90de14eade86e00b0c7a7770214a79992efec6365ddce3692d46248ca","category":"Environment"}