{"title":"Analyzing the impact of Resistant Starch Formation in Basmati Rice Products: Exploring Associations with Blood Glucose and Lipid Profiles across various cooking and storage conditions","link":"https://www.preprints.org/manuscript/202403.0596/v1","date":1710391841000,"content":"Background/objectives: The health benefits of resistant starch are well known, but there have not been many studies available documenting the effect of basmati rice products containg resistant starch upon blood glucose level and lipid profile in vivo efficacy.  Methods: Common cooking methods were used to prepare basmati rice products including two boiling methods viz. boiling 1 (boiling by absorption), boiling 2 (boiling in extra amount of water), frying and pressure cooking. The cooked rice were held at various temperatures and times: it was made fresh  (T1), kept at room temperature (20–22°C) for 24 h (T2), kept at 4°C for 24 h (T3), and then reheated after being kept at 4°C for 24 h(T4). Next, the products' proximate composition, total dietary fibre (soluble and insoluble), resistant starch (RS), and In vitro starch digestion rate (rapidly and slowly digested starch) were examined. The effect of RS on blood glucose and lipid profile were measured in humans and rats. Histopathological study of liver and pancreas in rats were also observed. Results: The basmati rice prepared by boiling 1 and stored with  T3  was found more effective to control blood glucose and lipid profile. Similarly in rats, the blood glucose level, cholesterol, triglycerides and LDL were reduced about 29.7, 37.9, 31.3 and 30.5% respectively, after consumption of basmsti rice prepared by boiling 1 and stored at T3. Conclusion: Rice products stored at 4⁰C have a high amount of resistant starh, insoluble dietary fibre, slowly digestible starch and low glycemic index. Thus helps to inhibit glycogen and lipid synthesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d0092b6a50a639020b9ea623aeaf6e5a038f58e7ee5fc254a2a02f6f3bcdff0e","category":"Interdisciplinary"}