{"title":"Trend or aberration? Russia is launching foreign satellites again","link":"https://arstechnica.com/?p=1950360","date":1687898579000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/soyuzlaunchphidemo-800x533.jpeg\" alt=\"Satellite controllers in Dubai monitor the launch of a Soyuz rocket from Russia on Tuesday.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/soyuzlaunchphidemo-scaled.jpeg\">Enlarge</a> <span>/</span> Satellite controllers in Dubai monitor the launch of a Soyuz rocket from Russia on Tuesday. (credit: <a href=\"https://twitter.com/MBRSpaceCentre/status/1673697923605905408?s=20\">Mohammed Bin Rashid Space Centre</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For the first time since the invasion of Ukraine essentially cut off Russia’s space industry from foreign customers, a Russian rocket lifted off Tuesday and carried satellites into orbit with commercial technology from Western companies.</p>\n<p>The payloads from companies based in the United Kingdom and Luxembourg flew on a satellite owned by the United Arab Emirates, which has maintained warmer relations with Russia than Western countries. Although the payloads are small, their presence on Tuesday’s launch is notable after the war in Ukraine, and <a href=\"https://arstechnica.com/science/2022/04/no-no-no-russia-is-not-halting-cooperation-on-the-space-station/\">resulting Western sanctions</a>, effectively led to an embargo against putting US and European space technology on Russian rockets.</p>\n<p>UK and European Union sanctions introduced after Russia’s 2022 invasion prevent exporting a wide range of space technology to Russia. Companies from the United States, Europe, Japan, South Korea, and other nations have moved their satellites off of Russian rockets, primarily switching them to launch vehicles from SpaceX, Rocket Lab, and India.</p></div><p><a href=\"https://arstechnica.com/?p=1950360#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1950360&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d009f902b4521999fb8aa0b12d6b19112a6a733260a270c6c99e510a5bebed5b","category":"Tech"}