{"title":"Modeling the linkage between climate change, CH4 emissions, and land use with Iran's livestock production: A food security perspective","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12532?af=R","date":1719450506000,"content":"<h2>Abstract</h2>\n<p>The livestock production sector plays a crucial role in food security and income generation and has an undeniable relationship with the environment. Like other agricultural sectors, it faces the significant challenge of climate change. However, the attention given to this issue has not been satisfactory given its importance. Thus, the primary aim of the current research is to assess the impact of temperature change, precipitation, CH4 emissions, gross fixed capital, and land use on the livestock production index as an indicator of food security in Iran. The modeling uses data from 1990 to 2020, employing the NARDL approach and Granger causality. The results show that a 1% increase in temperature can lead to an 8.06% decrease in livestock production (food security), while a 1% decline in temperature results in a 3.85% surge in livestock production. Precipitation has a direct relationship with food security; a 1% rise and drop in rainfall lead to an increase and reduction in livestock production by 0.8% and 1.02%, respectively. A 1% increase in gross fixed capital boosts food security by 0.47%, while a 1% decrease leads to a 2.32% reduction. A statistically insignificant relationship is seen between the positive CH4 shock and food security in the long run. However, the negative shock of this variable positively influences food security by 7.5%. Negative changes in land use will reduce livestock production. The Granger causality test proves a two-way causal relationship between CH4 emissions and livestock production. A unidirectional causality is discovered from production to temperature and from land use to livestock production. To mitigate the impact of global warming on livestock production, strategic investments in infrastructure, livestock micro insurance, and informing producers about the consequences of climate change and solutions for addressing this phenomenon can be considered effective policies.</p>","author":"Seyed Mohammadreza Mahdavian, \nFatemeh Askari, \nHamed Kioumarsi, \nReza Naseri Harsini, \nHushang Dehghanzadeh, \nBehnaz Saboori","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"d00bf6636e05bf371e28c72a8763019faf5fb82b82f1dcb40478288c22f658fb","category":"Environment"}