{"title":"Region‐specific drivers cause low organic carbon stocks and sequestration rates in the saltmarsh soils of southern Scandinavia","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12480?af=R","date":1708528481000,"content":"<h2>Abstract</h2>\n<p>Saltmarshes are known for their ability to act as effective sinks of organic carbon (OC) and their protection and restoration could potentially slow down the pace of global warming. However, regional estimates of saltmarsh OC storage are often missing, including for the Nordic region. To address this knowledge gap, we assessed OC storage and accumulation rates in 17 saltmarshes distributed along the Danish coasts and investigated the main drivers of soil OC storage. Danish saltmarshes store a median of 10 kg OC m<sup>−2</sup> (interquartile range, IQR: 13.5–7.6) in the top meter and sequester 31.5 g OC m<sup>−2</sup> yr<sup>−1</sup> (IQR: 41.6–15.7). In a global context, these values are comparatively low. Soils with abundant clay (&gt; 20%), older and stable saltmarshes in mesohaline settings, and with low proportion of algal organic material showed higher OC densities, stocks, and accumulation rates. Grazing led to significantly higher OC stocks than neighboring ungrazed locations, likely due to trampling modifying soil abiotic conditions (higher erosion-resistance and higher clay content) that slow carbon decay. Scaling up, Danish saltmarsh soils, comprising about 1% of the country's area, have the potential to yearly capture up to 0.1% of Denmark's annual consumption-based CO<sub>2</sub> emissions. Our research expands the baseline data needed to advance blue carbon research and management in the Nordic region while highlighting the need for a more comprehensive approach to saltmarsh management that considers the full range of services of these ecosystems and does not only focus on climate benefits.</p>","author":"Carmen Leiva‐Dueñas, \nAnna Elizabeth Løvgren Graversen, \nGary T. Banta, \nJeppe Najbjerg Hansen, \nMarie Louise Kjærgaard Schrøter, \nPere Masqué, \nMarianne Holmer, \nDorte Krause‐Jensen","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"d00fb49e330cb5feb9deee43087d37ccd87e16e29f021b625c6e8cf8875b5ef2","category":"Environment"}