{"title":"Rocket Report: Super Heavy lights up, China tries to recover a fairing","link":"https://arstechnica.com/?p=1782458","date":1627038049000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Blue-Origin-First-Human-Flight-L0-New-Shepard-Launch-800x465.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Blue-Origin-First-Human-Flight-L0-New-Shepard-Launch.jpg\">Enlarge</a> (credit: <a href=\"https://www.blueorigin.com/\">Blue Origin</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 4.08 of the Rocket Report! It's been another big week for private spaceflight, which means I made my second trip in nine days to the El Paso airport. This time, I enjoyed getting to see Blue Origin's launch site in West Texas, and watching New Shepard launch in person. It's an impressively engineered vehicle that appears to offer a super smooth ride to space.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Jeff Bezos blasts off. Will Blue Origin follow?</strong> On Tuesday morning, the founder of Amazon fulfilled a lifelong dream of flying into space aboard a rocket and capsule he personally funded. \"Best day ever,\" Bezos said after landing safely beneath three parachutes. \"My expectations were high, and they were dramatically exceeded.\" It was a great day for Blue Origin and its beautifully engineered New Shepard launch system.</p></div><p><a href=\"https://arstechnica.com/?p=1782458#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782458&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d01360a051ed8bad684411ee466a1f27084505d72c90367a8e2c0cd22ea2e311","category":"Tech"}