{"title":"Aquatic processing enhances the loss of aged carbon from drained and burned peatlands","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17394?af=R","date":1720594800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d6343d7a-2c7a-44a3-ba15-9498f2a1a2f3/gcb17394-toc-0001-m.png\" alt=\"Aquatic processing enhances the loss of aged carbon from drained and burned peatlands\" />\n<p>Carbon stored over millennia in peatlands is becoming vulnerable to oxidation as these ecosystems face human and climate disturbance. By studying tropical peatlands in Indonesia, one of the most disturbed peatlands on Earth, our work shows that the millennia-aged carbon mobilized with disturbance through aquatic pathways undergoes microbial respiration and photomineralization to produce carbon dioxide. These findings demonstrate that as long-term peat carbon stores become mobilized to streams and canals in the future, more of the carbon dioxide emitted to the atmosphere will be millennia-aged, with the potential to worsen climate change.</p>\n<br />\n<h2>Abstract</h2>\n<p>Water-logged peatlands store tremendous amounts of soil carbon (C) globally, accumulating C over millennia. As peatlands become disturbed by human activity, these long-term C stores are getting destabilized and ultimately released as greenhouse gases that may exacerbate climate change. Oxidation of the dissolved organic carbon (DOC) mobilized from disturbed soils to streams and canals may be one avenue for the transfer of previously stored, millennia-aged C to the atmosphere. However, it remains unknown whether aged peat-derived DOC undergoes oxidation to carbon dioxide (CO<sub>2</sub>) following disturbance. Here, we use a new approach to measure the radiocarbon content of CO<sub>2</sub> produced from the oxidation of DOC in canals overlying peatland soils that have undergone widespread disturbance in Indonesia. This work shows for the first time that aged DOC mobilized from drained and burned peatland soils is susceptible to oxidation by both microbial respiration and photomineralization over aquatic travel times for DOC. The bulk radiocarbon age of CO<sub>2</sub> produced during canal oxidation ranged from modern to ~1300 years before present. These ages for CO<sub>2</sub> were most strongly influenced by canal water depth, which was proportional to the water table level where DOC is mobilized from disturbed soils to canals. Canal microbes preferentially respired older or younger organic C pools to CO<sub>2</sub>, and this may have been facilitated by the use of a small particulate organic C pool over the dissolved pool. Given that high densities of canals are generally associated with lower water tables and higher fire risk, our findings suggest that peatland areas with high canal density may be a hotspot for the loss of aged C on the landscape. Taken together, the results of this study show how and why aquatic processing of organic C on the landscape can enhance the transfer of long-term peat C stores to the atmosphere following disturbance.</p>","author":"Jennifer C. Bowen, \nAlison M. Hoyt, \nXiaomei Xu, \nMuhammad Nuriman, \nGusti Z. Anshari, \nPutri Juliandini Wahyudio, \nLihini I. Aluwihare","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"d013f8f662076a74c666bda66852e9180fe0ba6cf67d1bc7b805d74b0f57d8b6","category":"Environment"}