{"title":"Feasibility and Efficacy of Prenatal Ultrasonic Screening for Developmental Dysplasia of the Hip","link":"https://www.preprints.org/manuscript/202406.0151/v1","date":1717490275000,"content":"Background: developmental dysplasia of the hip (DDH) is a condition characterized by abnormal hip development in infancy. Early diagnosis allows for effective treatment, while late presentation often necessitates complex surgical interventions. Current recommendations advise screening between the 6th and 8th week postnatal using ultrasound, typically employing the Graf method. However, there's no universal consensus on whether ultrasound screening significantly increases treatment compared to clinical examination-guided ultrasound. This study aims to explore the feasibility of prenatal ultrasound for early identification of DDH risk. Methods: This prospective observational study involved 100 pregnant women undergoing fetal hip ultrasound during the second and third trimesters. Using the modified Graf method, alpha and beta angles were calculated on the fetus. Postnatally, alpha and beta angles were compared with prenatal values. Results: Prenatal ultrasound at 24th week showed inconclusive results because of the difficulty in identification of Graf landmarks, while ultrasound at 34th week has proved to be a reliable and safe method for quantitative determination of alpha and beta angles. Significant correlations were found between prenatal and postnatal alpha and beta angles. Moreover, significant differences in prenatal alpha and beta values were observed in patients developing mature/immature hips postnatally. Conclusions: Prenatal diagnostics show promise for predicting infant hip development. Further research is warranted to validate correlation strength and clinical applicability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d013bd239d69253b4d169d825076443dc7567aec495c01a6c38a175bed9a323f","category":"Interdisciplinary"}