{"title":"PSVII-28 Unraveling the mechanisms governing boar semen quality during chilled storage","link":"https://academic.oup.com/jas/article/102/Supplement_3/816/7757568?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Artificial insemination (AI) appears as a core of reproductive management in the hog industry. AI involves the use of chilled semen doses meeting routine thresholds for motility (≥ 70%) and morphology (≥ 80%) at collection. However, semen doses meeting these standards exhibit a gradual decline in sperm quality, with likely divergent profiles during preservation that impact fertility outcomes. Hence, this study aims to unravel the sperm quality dynamics of boar semen doses during 7-d chilled storage at 17ºC. Semen doses (n = 25) from proven-fertile Duroc boars were provided by a commercial hog farm (Prestage Farm, MS) and transported to the laboratory within 30 min of collection. Each semen sample was aliquoted and analyzed on the day of collection (d 0) and after 7 d of storage (d 7) at 17°C. Sperm total motility (TM), progressive motility (PM), and normal morphology (NM) were assessed using a computer-assisted sperm analyzer (CASA; CEROS II, IMV Biotechnologies). Apoptosis (Annexin V/7-AAD), viability (Propidium iodide – PI), and intracellular reactive oxygen species (ROS; DCFH-DA) were evaluated using flow cytometry. Total antioxidant activity (TAOC) and lipid peroxidation (malondialdehyde; MDA) were assessed using commercial kits (Cayman Chemical). Data analysis was conducted using parametric statistics (SPSS), with <span>P</span> &lt; 0.05 considered significant. Results were presented as mean ± SEM. Data analysis confirmed the significant decrease of CASA parameters, particularly TM from d 0 to d 7 (78.87 ± 1.37 vs. 73.19 ± 1.98%), with extreme variance on d 7 allowing to discriminate high motility (HM, n = 6) vs low motility (LM, n = 6) semen doses. HM doses evidenced significantly greater (<span>P</span> &lt; 0.05) TM (83.73 ± 1.17%), PM (36.07 ± 1.11%), and NM (89.45 ± 2.30%) compared with LM doses (TM: 59.40 ± 3.35%, PM: 16.57 ± 3.25%, NM: 79.93 ± 2.61%) on d 7. Unlike HM samples, which were comparable between d 0 and d 7, LM doses displayed significantly greater proportions of apoptotic and viable cells, and increased intracellular ROS levels on d 0. Likewise, LM samples revealed significantly greater (<span>P</span> &lt; 0.05) proportions of apoptotic cells (3.69 ± 1.66%), dead cells (38.41 ± 3.71%), and cells with intracellular ROS (36.21 ± 3.62%) than HM samples (apoptotic cells: 0.03 ± 0.02%, dead cells: 4.73 ± 4.65%, ROS: 5.34 ± 4.91%) on d 0; however, only the proportions of dead cells displayed significant increase in LM on d 7. MDA concentrations were comparable between HM and LM samples on d 0. However, on d 7, LM samples exhibited significantly greater MDA concentrations than HM samples. In contrast, TAOC was significantly greater in HM samples (2.53 ± 0.14 mM) compared with LM samples (2.17 ± 0.07 mM) on d 0. In conclusion, semen samples with similar gross characteristics at collection exhibited differential responses during storage. Their initial redox potential and apoptosis-like changes may contribute to their varying ability to withstand prolonged storage. Work supported by USDA-ARS grant# 6066-31000-015-00D.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d01827a92738c02a4da83f0574164ccdf48526bf69e5a3ed28ae3267c693f1b0","category":"Environment"}