{"title":"Aberrant activation of hippocampal astrocytes causes neuroinflammation and cognitive decline in mice","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002687","date":1720706400000,"content":"<p>by Jae-Hong Kim, Nakamura Michiko, In-Sun Choi, Yujung Kim, Ji-Young Jeong, Maan-Gee Lee, Il-Sung Jang, Kyoungho Suk</p>\r\n\r\nReactive astrocytes are associated with neuroinflammation and cognitive decline in diverse neuropathologies; however, the underlying mechanisms are unclear. We used optogenetic and chemogenetic tools to identify the crucial roles of the hippocampal CA1 astrocytes in cognitive decline. Our results showed that repeated optogenetic stimulation of the hippocampal CA1 astrocytes induced cognitive impairment in mice and decreased synaptic long-term potentiation (LTP), which was accompanied by the appearance of inflammatory astrocytes. Mechanistic studies conducted using knockout animal models and hippocampal neuronal cultures showed that lipocalin-2 (LCN2), derived from reactive astrocytes, mediated neuroinflammation and induced cognitive impairment by decreasing the LTP through the reduction of neuronal NMDA receptors. Sustained chemogenetic stimulation of hippocampal astrocytes provided similar results. Conversely, these phenomena were attenuated by a metabolic inhibitor of astrocytes. Fiber photometry using GCaMP revealed a high level of hippocampal astrocyte activation in the neuroinflammation model. Our findings suggest that reactive astrocytes in the hippocampus are sufficient and required to induce cognitive decline through LCN2 release and synaptic modulation. This abnormal glial–neuron interaction may contribute to the pathogenesis of cognitive disturbances in neuroinflammation-associated brain conditions.","author":"Jae-Hong Kim","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"d01a23b1e0ee37045f4a283123eedaee461998e5dec22ceb482429e1003a646a","category":"Environment"}