{"title":"The Apple Watch Series 9 might bring a serious bump in battery life","link":"https://www.macworld.com/article/1814061/apple-watch-series-9-processor-a15-performance-battery-life.html","date":1683638593000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The next version of the Apple Watch could enjoy a substantial boost in speed and battery performance after news broke that it’s likely to get a new processor based on the A15 Bionic in the iPhone 13 and iPhone 14.</p>\n\n\n\n<p>Leaker-analyst Mark Gurman made the prediction, spotted by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/05/08/apple-watch-series-9-updated-chip/&amp;xcust=1-1-1814061-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a>, in a conversation on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discord.com/invite/power-on&amp;xcust=1-1-1814061-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Discord channel</a> he hosts for subscribers. He began by saying the Apple Watch Series 9 would get a “new processor” and clarified that this meant a truly new component as opposed to the merely rebranded chips that Apple has included in the past two generations of its smartwatch.</p>\n\n\n\n<p>The Series 8 and Apple Watch Ultra both have an S8 chip, while the Series 7 has an S7, but functionally these chips are the same as the S6 in the Apple Watch Series 6 from 2020.</p>\n\n\n\n<p>When asked if the new S9 chip (assuming Apple follows the same naming convention) would be based on the A15, Gurman wrote, “yes, I believe it is!” The A15 is only one year newer than the S6 and was first used in the 13-series iPhones in 2021 and then reappeared in various other devices including the non-Pro iPhone 14 released in fall 2022. But it could bring a huge boost to the Apple Watch.</p>\n\n\n\n<p>Whereas the S6, S7, and S8 are all essentially the same chip, based on the A13 and specced with a 1.8GHz dual-core processor, the A15 has four 2.01GHz energy-efficient cores and two 3.24GHz high-performance cores as standard. In benchmarks, the A15 <a href=\"https://www.macworld.com/article/544579/iphone-13-review.html\">significantly outperformed</a> the A13, delivering about 30 percent better performance in benchmarks.</p>\n\n\n\n<p>But the value of a new chip goes beyond the obvious attributes of raw speed (which could become more helpful than you might think, as devs exploit the new hardware capabilities to make more demanding apps). The iPhone 13 with the A15 chip delivered an impressive boost in battery life of 2-plus hours over the iPhone 12 and a massive generational leap at the time. The Apple Watch has been rated for 18 hours of battery life since its 2015 debut, which is just short of making it through a full day with sleep tracking.</p>\n\n\n\n<p>Battery performance is one of the Apple Watch’s key metrics, particularly as the company pushes into the sleep-tracking space and encourages owners to wear their watches overnight. Once charging becomes a chore you need to find time for it during the day it becomes more appealing to be able to boast multi-day battery life, as Apple did for the Ultra. Whether the Series 9’s processing gains will be sufficient to boast anything approaching the Ultra’s claimed 36 hours (or the 72.5 hours it lasted in <a href=\"https://www.macworld.com/article/1364168/apple-watch-ultra-review.html\">our tests</a>) remains to be seen.</p>\n\n\n\n<p>In practice, there might seem to be a good reason why Apple focuses less on speed gains for its smartwatches than it does for its phones. Watch apps aren’t anywhere near as demanding as phone ones, and raw performance is simply less of a priority on the smaller screen. Fewer people play games on their smartwatches, and those that do are unlikely to be playing anything especially processor-intensive. Speed or a lack of it is rarely a concern or a priority for smartwatch owners.</p>\n\n\n\n<p>Indeed, it will be some months yet before we find out if the prediction itself is correct. Gurman has an excellent reputation but certainly isn’t infallible. For all the latest news and rumors, bookmark our regularly updated <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a> superguide.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d026b1f33e82dcda4bca073ffb983cf10e00a051480ef9d8724cc8943ac96bcb","category":"Apple"}