{"title":"Correlational Analysis of Genetic Mutations and Galectin Levels in Breast Cancer Patients","link":"https://www.preprints.org/manuscript/202405.0666/v1","date":1715333443000,"content":"Background: Galectins are innate immune system regulators, associated with disease progression in cancer. This paper aims to investigate the correlation between mutated cancer-critical genes and galectin levels in breast cancer patients to determine whether galectins and genetic profiles can be used as biomarkers for disease and potential therapy targets. Materials and Methodology: Prisma Health Cancer Institute’s Biorepository provided seventy-one breast cancer patient samples, including all four stages as well as major molecular subtypes and histologies of breast cancer. Hotspot mutation statuses of cancer-critical genes were determined using multiplex PCR in tumor samples from the same patients by Precision Genetics and the University of South Carolina Functional Genomics Core Facility. The galectin levels of patients’ sera were analyzed using enzyme-linked immunosorbent assay (ELISA) to measure the concentrations of galectins-1, -3, and -9. Analysis was performed using JMP software to compare mean and median serum galectin levels between samples with and without specific cancer-critical genes including pooled t-test, Wilcoxon test, ANOVA, Tukey’s range test, and Steel Dwass Method (α=0.05). Results: Our analysis indicates that KIT mutations correlate with elevated serum levels of galectin-1 and -9 in patients with breast cancer. In patients with Luminal A subtype, FLT3 mutation correlates with lower serum galectin-1 and -9 levels and TP53 mutations correlate with higher serum galectin-3 levels. Patients with invasive ductal carcinoma had significantly higher serum galectin-3 levels than patients with ductal carcinoma in situ. Patients with both TP53 and PIK3CA mutations exhibit elevated serum galectin-3 levels, while patients with one or neither mutation show no significant difference in serum galectin-3 levels. In addition, metastatic breast cancer samples were more likely to have KIT or PIK3CA mutation compared to primary breast cancer samples. Conclusion: The relationship between genetic mutations and galectin levels has the potential to identify appropriate candidates for combined therapy, targeting genetic mutations and galectins. Further understanding of the effect of genetic mutations and galectin levels on cancer progression and metastasis could aid in the search for biomarkers for breast cancer diagnosis, disease progression, and prognosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d02a2a27befd5367c28fc39aab0cf315d4e0ed8e98f3a116295fb26683e0579d","category":"Interdisciplinary"}