{"title":"KeeperFX keeps Dungeon Keeper alive by making it actually playable","link":"https://arstechnica.com/?p=1983841","date":1700006782000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/dk1-800x632.png\" alt=\"If it were me, I would simply not burrow my way directly to where all the creatures are gaining levels as fast as my gold allows them. But I'm not full of grog and adventuring spirit.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/dk1.png\">Enlarge</a> <span>/</span> If it were me, I would simply not burrow my way directly to where all the creatures are gaining levels as fast as my gold allows them. But I'm not full of grog and adventuring spirit. (credit: EA/KeeperFX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In <a href=\"https://gamehistory.org/ep-119-karateka/\">an interview</a> about <a href=\"https://store.steampowered.com/app/1163060/The_Making_of_Karateka\"><em>The Making of Karateka</em></a>, a wonderful interactive documentary and game-about-a-game, Chris Kohler of Digital Eclipse notes that, based on the company's data, people don't actually play the games inside \"classics\" collections. Maybe they spend 5 minutes inside a few games they remember, but that's about it. Presenting classic games, exactly as they were when they arrived, can be historically important but often falls short of real engagement.</p>\n<p>That's why it's a thrill to see (as first spotted by <a href=\"https://www.pcgamer.com/ea-might-not-care-about-dungeon-keeper-anymore-but-this-open-source-4k-remake-spent-15-years-in-the-making-to-reach-version-10/\">PC Gamer</a>) <a href=\"https://keeperfx.net/news/11/2023-11-10/keeperfx-100-has-been-released\">a triumphant 1.0 release from <em>KeeperFX</em></a>, an open source \"remake and fan expansion\" of <em><a href=\"https://en.wikipedia.org/wiki/Dungeon_Keeper\">Dungeon Keeper</a>, </em>the 1997 Bullfrog strategy game that had players take on the other side of a dungeon crawl. The project had already, over 15 years, carried the game quite far, giving it modern Windows support, hi-res support, and loads of bugfixes and quality-of-life improvements. Now, <a href=\"https://github.com/dkfans/keeperfx/compare/Release050...Release1.0.0\">says the team</a>, all the original code from the original executable has been rewritten, freeing them up to change whatever they want in the future. There can be more than 2,048 \"things\" on the map, maps can have more than 85 square tiles, and scripting and mods can go much further.</p>\n<p>But take note: \"Ownership of the original game is still and will always be required for copyright reasons.\" You can, like I did earlier today, rectify that with <a href=\"https://www.gog.com/game/dungeon_keeper\">a $6 GOG purchase</a>, at least while it's on sale today. After downloading <em>KeeperFX</em>, you unpack it, run its launcher, point it to where you've installed the original <em>Dungeon Keeper,</em> and launch it. And then you get ready to click.</p></div><p><a href=\"https://arstechnica.com/?p=1983841#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1983841&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d02de1d5a9b85e84466e4fccbaf77fc4caa9e8c3ac7516f3e0db8aa7f3df12da","category":"Tech"}