{"title":"Mesothelioma Associated Fibroblasts Modulate the Response of Mesothelioma Patient Derived Organoids to Chemotherapy through Interleukin-6.","link":"https://www.preprints.org/manuscript/202403.1058/v1","date":1710771421000,"content":"Background. Malignant pleural mesothelioma (MPM) is still a rather incurable disease. Many classes of compounds with various mechanisms of action have been tested in vivo and ex-vivo, with rather disappointing results. This is partly due to preclinical studies mostly performed in models that fail to recapitulate MPM complexity and do not retain the intra-tumor heterogeneity, a propelling force for tumor progression. Additionally, we and others have shown that, under stress-induced chemotherapy, profound rearrangements take place in MPM cultures to fuel the emergence of chemoresistant cell subpopulations. Thus, finding clinically actionable modulators of MPM resistance is still a very urgent need.  \nMethods. Setup and propagation of patient-derived organoid cultures from MPM pleural effusions; flow cytometry-based validation of organoid cultures, isola-tion and propagation of mesothelioma-associated fibroblasts; co-cultures, Lu-minex-based Cytokine array, ELISA assay to quantitate IL-6 in the conditioned media, qRT-PCR to assess mRNA expression of cancer stem cell markers and fibroblast markers.\nResults. Organoid cultures were obtained from eight MPM patients by using specific growth media and conditions to propagate pleural effusion-derived cells. We proved that primary MPM specimens and serially passaged (mesothelio-ma-Patient-Derived-Organoids) mPDOs were cytologically similar, with the obtained mPDOs expressing mesothelial markers similarly to the originating specimen. As expected from a clinically relevant model, the size and number of mPDOs were altered, in a patient-specific way, when pharmacologically relevant doses of chemotherapy drugs were added. We derived Mesothelio-ma-Associated-Fibroblasts (MAFs) and the addition of MAFs, to various ratios, altered the response of the mPDOs to pemetrexed + cisplatin, toward a reduced sensitivity to the latter anticancer agents. Additionally, organoid formation and size were altered by MAF-conditioned media, and this correlated with increased expression of cancer stem cell markers. We showed increased levels of IL-6 in the media of the treated cocultures and showed that this latter was derived from the MAFs. \nConclusions. Increased secretion of IL-6 by mesothelioma-associated fibroblasts (MAFs) contributes to the resistance of the MPM to therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d050fa064dbdf0f8c9ec9ab79ecb85bf275747a28941b1208a4b264bcc54faf2","category":"Interdisciplinary"}