{"title":"Innovation and adaptation: The rise of a fentanyl smoking culture in San Francisco","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303403","date":1716386400000,"content":"<p>by Daniel Ciccarone, Nicole Holm, Jeff Ondocsin, Allison Schlosser, Jason Fessel, Amanda Cowan, Sarah G. Mars</p>\r\nBackground <p>Illicitly manufactured fentanyls and stimulants are implicated in the escalating US mortality from drug overdose. San Francisco, California (SF) has seen declining fentanyl injection while smoking has increased. Beliefs and behaviors surrounding this development are not well understood.</p> Methods <p>The study used rapid ethnography to explore fentanyl and methamphetamine use in SF. The team conducted semi-structured interviews (n = 34) with participants recruited from syringe service programs. Video-recorded smoking sequences (n = 12), photography and daily field notes supplemented interview data.</p> Results <p>Difficulty injecting and fear of overdose motivated transitions from injecting to smoking. Fentanyl was extremely cheap—$10/gram—with variability in quality. Foil was the most commonly used smoking material but glass bubbles, bongs and dabbing devices were also popular. No reliable visible methods for determining fentanyl quality existed, however, participants could gauge potency upon inhalation, and developed techniques to regulate dosage. Several participants reported at least hourly use, some reporting one or more grams of daily fentanyl consumption. Smoking was also very social, with people sharing equipment, drugs and information. Participants raised concerns about hygiene and overdose risk to others arising from shared equipment. Reportedly potent fentanyl ‘residue’ accumulated on smoking materials and was commonly shared/traded/stolen or consumed accidentally with diverse preferences for its use.</p> Conclusion <p>Our data highlight fentanyl residue as a new overdose risk with potential mismatch between the potency of the residual drug and the recipient’s tolerance. Further, large doses of fentanyl are being consumed (estimated at approximately 50 mg of pure fentanyl/day). Smoking fentanyl has potential health benefits over injecting and may be protective against overdose, but substantial uncertainty exists. However, SF overdose mortality hit a record high in 2023. Recommendations to reduce fentanyl smoking overdose risks through pacing, greater awareness of dosages consumed and checking tolerance of residue recipients are potentially viable interventions deserving further exploration.</p>","author":"Daniel Ciccarone","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d055d98975219f45a6de0f2f43457687ef8e8fd5574a704848319f9d27eba176","category":"Interdisciplinary"}