{"title":"pH-Dependent Extraction of Antioxidant Peptides from Red Seaweed: A Sequential Approach","link":"https://www.preprints.org/manuscript/202408.1598/v1","date":1724320719000,"content":"The present study adopted a diverse approach to obtain antioxidant peptides from red seaweed, starting with an aqueous extraction of the entire seaweed followed by enzymatic hydrolysis of the solid residues from the first step. Additionally, the impact of three different pH levels (i.e. 3, 6, and 9) during the aqueous extraction phase was examined for their influence on the outcomes. The findings revealed that the solid fraction resulting from the sequential extraction process contained significantly higher levels of proteins and amino acids compared to other fractions (p &lt; 0.05). Furthermore, the solid fractions (IC50 ranging from 2.29 to 8.15) proved to be significantly more effective free radical scavengers than the liquid fractions (IC50 either ranging from 9.03 to 10.41 or not obtained at the highest concentration tested) at both stages of extraction (p &lt; 0.05). Among the solid fractions, those produced under alkaline conditions did not exhibit as potent radical scavenging abilities as those produced under acidic or nearly neutral conditions. The most effective metal ion chelating activity was found in the solid fractions derived from the subsequent enzymatic stage, particularly at pH 3 (IC50 = 0.63 ± 0.04) and pH 6 (IC50 = 0.89 ± 0.07), which were significantly more potent than those from the initial extraction stage (p &lt; 0.05). Given that no significant difference was noted in the total phenolic content of these solid fractions compared to their corresponding liquid fractions (3.79 ± 0.05 vs. 3.48 ± 0.02 at pH 3 and 2.43 ± 0.22 vs. 2.51 ± 0.00 at pH 6) (p &gt; 0.05), the demonstrated properties might be attributed to the potential roles of bioactive amino acids such as histidine, glutamic acid, aspartic acid, tyrosine, and methionine, whether present as free amino acids or integrated within the structure of proteins and peptides.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d057530c27e261541004edad40da6b130384a5c603c4598f5b1eed796f6556ba","category":"Interdisciplinary"}