{"title":"'I’m grateful to women before me who made it possible': Cat Ferguson on signing with Movistar as a 17-year-old","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-m-grateful-to-women-before-me-who-made-it-possible-cat-ferguson-on-signing-with-movistar-as-a-17-year-old","date":1701244800000,"content":"\n      <p><span>“I’m a little bit frustrated,” Cat Ferguson replies when I ask her to reflect on the road season she’s just finished – her first in the junior category. “I won a couple of big races and I'm pleased with that but then in lots of the Championship races, I always just seemed to come second. Next year I want to come out on top in those races.”</span></p>\n<div></div>\n<div></div>\n<p><span>What Ferguson casually describes as “a couple of big races” are the junior editions of Trofeo Binda and the Tour of Flanders, as well as a stage of the challenging, hilly Basque race, Bizkaikoloreak. A season that she felt “frustrated” at the end of would, to most people, be regarded one of the most impressive debuts in the junior ranks in recent history. Add in her second places in the  <span>Road </span>World Championships and the European Cyclo-cross Championships and Ferguson has announced herself as, arguably, the most exciting young female rider in the world. The strive for perfection she speaks about is an indication that she has the mental fortitude required of a champion, as well as the physical.</span></p>\n<p>It’s perhaps not surprising, then, that the talented 17-year-old has been quickly snapped up by a WorldTour outfit, signing a three-year contract with Movistar which will begin when Ferguson joins them as a stagiaire at the end of August next year. The team in blue and white may have said goodbye to their current star rider Annemiek van Vleuten as she retired at the end of this season, but their investment in riders like Ferguson could go a long way to ensuring that the team’s future shines even brighter than its present.</p>\n<p><span>“I won Binda, the very first international race on the calendar for the junior girls, in about April and from there a couple of teams were interested in me,” Ferguson explains. “Later in the season I won Flanders and that got Movistar interested. They felt friendly compared to the other teams and I enjoyed speaking to them so it went from there. They gave me a road bike and I really fell in love with the team’s values  I’m going on a training camp with them in January and I’m really excited.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/double-the-talent-the-multidisciplinary-holmgren-twins-on-winning-world-titles-and-joining-lidl-tre\"><strong><em>Read more: Double the talent: meet the multidisciplinary Holmgren twins destined for the top</em></strong></a></p>\n<p><span>For Ferguson, the prospect of riding with a team that has been home to one of the sport’s all-time greats in Van Vleuten is both exciting and daunting. She explains that she’s yet to fully come to terms with the fact that mid-way through next year she will turn professional and embark on a career with one of the best women’s teams in the world.</span></p>\n<p><span>“I don’t know whether Van Vleuten will be at the camp as she’s not confirmed what she’s going to do yet in her retirement but I really hope I do get to meet her as I grew up watching her and love the way she rode,” Ferguson admits.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_9645A_1024x1024.jpg?v=1701183753\" />While signing such a long term contract with the Spanish team is a dream scenario for the Skipton-based rider, she acknowledges that there’s criticism from some when it comes to athletes negotiating with professional teams at such a young age. Ferguson, at just 17, has chosen a career path which is locked in for the next four years, despite not having even finished school herself.</span></p>\n<p><span>“I completely see where they’re coming from,” Ferguson replies when I raise this point. “I obviously thought about that so much before I signed the contract with Movistar, but it just felt like the right decision completely. It is early and most people don't do it this early but, as it stands at the moment in the women's side of the WorldTour, there aren't really many under-23 development teams. This means that for girls, one of the only ways to step up is straight to the WorldTour, so you have to be prepared for that. Movistar was the right option for me.\"</span></p>\n<p><span>Ferguson doesn’t shy away from the fact that even having the option to sign a long term, lucrative contract like she has with Movistar has only been made possible in recent years. The increased live coverage of women’s racing, as well as reforms to the Women’s WorldTour such as a minimum salary and maternity leave clauses have helped the sport grow exponentially, not to mention the addition of races like the <a href=\"https://www.rouleur.cc/es/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France</a> and Paris-Roubaix to the women’s calendar.</span></p>\n<p><span>“I feel incredibly blessed to be entering the sport at this time,” Ferguson said. “I'm so grateful to people such as Lizzie [Deignan] who have made it possible for younger athletes to call cycling a profession – effectively making a profit, because that is what defines a professional athlete. But it’s not even just the salary it's other things such as maternity leave, people like Laura Kenny and Lizzie Deignan have just made it so much more normalised. I'm so grateful to people like them.”</span></p>\n<p><span>Riders like Deignan and Kenny are examples of British women who have been at the pinnacle of the sport during Ferguson’s formative years as a cyclist and the British rider explains that she is excited to potentially find herself racing against Deignan in years to come. </span></p>\n<p><span>In fact, some have likened Ferguson’s riding style to that of her older compatriot – they’re both punchy riders who can perform well on a multitude of terrain. This could, in part, be due to the fact that they both hail from the north of England, learning their trade on the tough, undulating roads of the Yorkshire Dales. Ferguson describes coming from a sporting family and riding mountain bikes in the tough weather conditions that frequent the area with her dad on local trails as her entry to the sport.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_9319_1024x1024.jpg?v=1701183866\" /></span></p>\n<p><span>“I grew up in a family that was really into sport. I think I went to literally every after school club I could and I always wanted to go to the Olympics. I remember my dad used to take me on a tag along to the mountain bike trails centre and I used to just get absolutely covered in mud because of all the spray from his back wheel,” Ferguson laughs.</span></p>\n<p><span>“It was when I went to a club and met some friends and enjoyed it and did some racing. I knew I’d love to go pro but I never thought it was very realistic until I went to the European Youth Olympics last year and I won both the road race and the time trial. That's when I thought it could actually happen. That opened my eyes a little bit.”</span></p>\n<p><span>Ferguson gives plenty of credit to her parents for helping get her to this point in her career, explaining that while her dad isn’t “pushy”, he’s “as into it as I am”. She shares stories of him still wanting to take her to cyclo-cross training sessions despite having her own driving licence now and also explains that he runs the junior team she rides for, Shibden Hope Tech Apex.</span></p>\n<p><span>“He wants to be there and watch everything with my mum as well. We’re just a family of three, so we are quite close and they come to every race when they can,” Ferguson explains. </span></p>\n<p><span>Part of a generation of extremely strong female British juniors (some of whom have also already signed WorldTour contracts) Ferguson also notes the importance of the British Cycling Junior Development programme that they all are part of in her progression as a rider. She believes that the ethos and culture instilled in the athletes who are part of the set-up is the perfect preparation for life on a WorldTour team.</span></p>\n<p><span>“As a younger rider, I learned so much from the second year juniors that have all now moved up to elite. I hope I can do that for the juniors who will join the programme this year. You spend so much time with them that they become your second family,” Ferguson explains.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_9735_1024x1024.jpg?v=1701183981\" /></span></p>\n<p><span>“One of the rules that they had when I used to go to the NSR (National School of Racing) training camps was that your parents weren't allowed to help you bring all your stuff into the velodrome so you have to do like four trips by yourself to bring all the stuff in. It might seem a bit silly but it does make sense.”</span></p>\n<p><span>Despite having achieved so much as a first year junior rider, Ferguson remains focused looking ahead to next year, stating she still has plenty of goals she wants to achieve before making the jump to the elites. There’s pressure on her shoulders given her contract with Movistar and her performances this year – Ferguson has set a high bar for herself.</span></p>\n<p><span>“I definitely do feel that pressure and people looking at me a little bit,” she says. “I’m planning on working with a psychologist next year – I study psychology at A-Level and know how important it is.”</span></p>\n<p><span>Ferguson explains that this season she’s found herself doing homework and revision in the car on the way to races in order to balance her studies with travel commitments. She also adds that despite securing her contract with Movistar, she still wants to finish her A-Levels next year, believing that it is important to have a back-up plan after racing.</span></p>\n<p><span>“It’s a little bit demotivating with schoolwork because I know I've got that contract but, obviously, I'm going to try to get some good exam results in case anything happens,” she says.</span></p>\n<p><span>There’s also the cyclo-cross season to think about in the immediate future – Ferguson currently leads the World Cup standings for the junior women and says she is keen to continue racing off-road, even when she turns professional next year. She adds that this was one of the reasons why she was drawn to signing for Movistar; they were happy for her to continue riding multiple disciplines.</span></p>\n<p><span>Despite her achievements in the sport so far, however, Ferguson remains grounded and acutely aware that she still has a lot to learn in the professional world. </span></p>\n<p><span>“Next August when I can officially stagiaire for the team, I know I’ll just ride some lower level races,” she says. “In 2025, that's when I will try to discover the rider I’m going to be a little bit more. It’s about learning from the best really, how to ride in the bunch, how to be a professional. I’m really excited.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d05c193c1b322a0090182295757dd6d51a44ccee279e7fdcf89146af6dac30a2","category":"Cycling"}