{"title":"Neo-Pros to Watch in 2022","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/neo-pros-to-watch-in-2021","date":1639650093000,"content":"\n      <p><span>As seasons come and go, the pro peloton sees neo-pros rise to join the professionals, filling the void left by those retiring or leaving the sport. It’s the circle of life that gives new energy to the cycling world, and never more so than in recent years.</span></p>\n<p><span>Whether we look at Ethan Hayter, Jasper Philipsen, Jonas Vingegaard, or any of the other breakthrough riders of 2021, there can be no doubt that young riders are becoming more competitive than ever before. That is no different with the season ahead, with a plethora of exciting talent transitioning to the WorldTour in 2022. </span></p>\n<div></div>\n<p> </p>\n<h4><b>Filippo Baroncini - Trek-Segafredo</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RC1_0857-min_968ff424-b9e0-4631-b07c-e16143740966_1024x1024.jpg?v=1635340622\" />Filippo Baroncini enters the WorldTour as the U23 World Champion (Image credit: </span></i><i><span>Ramsey Cardy/SWpix)</span></i></p>\n<p><span>Filippo Baroncini is the latest rider to move into the WorldTour with Trek-Segafredo from Team Colpack Ballan after his compatriot, Antonio Tiberi, made the same transfer last year. </span>Team Colpack have developed a recent reputation for producing highly talented riders — Andrea Bagioli and Alessandro Covi have graduated to the elites in recent seasons.</p>\n<p><span>Trek have recruited an exciting prospect in Baroncini, who became the U23 World Champion in Flanders. Baroncini led a strong Italian team, and used his fine punching abilities to escape on the short but steep Wijnpers climb. Hilly terrain is where Baroncini can excel in 2022.</span></p>\n<p><span>The 21-year-old also impressed at Coppa Sabatini in 2021 — a hilly, 211km Italian Classic. He finished in a respectable fourth place, only 9 seconds behind the in-form Michael Valgren, who would go on to finish on the podium in the elite road race at the World Championships ten days later. This result against top-tier opposition tells us that Baroncini can transition to the pros seamlessly. He may be able to record impressive results for Trek-Segafredo sooner rather than later.</span></p>\n<h4><b>Mick van Dijke - Jumbo-Visma</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW8_8059-min_1024x1024.jpg?v=1635340365\" />Mick van Dijke finished fifth in the U23 time trial at Flanders 2021. (Image credit: Alex Whitehead/SWpix)</span></i></p>\n<p><span>Mick van Dijke will transition from the Jumbo-Visma development team to the full WorldTour outfit in 2022. The 21-year-old won the Flanders Tomorrow Tour in September before heading to Flanders 2021, where he finished in a respectable fifth place in the time trial. It’s not the first time he’s performed well on the TT bike — he was sixteenth in the .Pro level Baloise Belgium Tour time trial, which was won by Remco Evenepoel.</span></p>\n<p><span>His performances were so impressive that Jumbo-Visma decided to move Van Dijke to the WorldTour team on a full-time basis late in the 2021 campaign, where he headed to the Cro Race. Here, Van Dijke’s versatility was on full display. </span></p>\n<p><span>First, he led-out talented sprinter Olav Kooij to second place on stage one, although Kooij’s was impeded by eventual stage winner Phil Bauhaus. </span>Next, Van Dijke resisted a difficult tempo on the Biokovo climb (5.2km @ 5.3%), before sprinting to second place on stage three in a reduced peloton. Stage five featured the most challenging climbs with the Poklon mountain some 13 kilometres long. Here, Van Dijke kept himself to the front of proceedings, where he eventually finished third in a heavily reduced group after Stephen Williams escaped late on.</p>\n<p><span>In isolation, the Cro Race demonstrates Van Dijke’s wide ranging skills on a bike. He can get over mountains</span><span>, shorter climbs and is dangerous in a reduced sprint. When you also consider his strong time trial, Jumbo-Visma have signed a very talented, well-rounded rider, who still has plenty of time to develop further at 21 years old.</span></p>\n<h4><b>Kata Blanka Vas - SD Worx</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1338070165_1024x1024.jpg?v=1635340273\" />Kata Blanka Vas at Ceratizit Challenge By La Vuelta 2021 (Image credit: Gonzalo Arroyo Moreno/Getty Images)</span></i></p>\n<p><span>SD Worx may have one of the most exciting prospects in cycling right now in Kata Blanka Vas. Cycling is a sport on the rise in Hungary — Attila Valter was the first Hungarian to wear the </span><i><span>maglia rosa </span></i><span>at the Giro d’Italia earlier this season, and Blanka Vas looks set to lead the nation's rise in the women’s peloton.</span></p>\n<p><span>After doing the road race and time trial double at the Hungarian National Championships, Blanka Vas headed to her first WorldTour road race at the Ceratizit Challenge By La Vuelta 2021 in September. This came after a fine fourth place at Tokyo 2020 in the mountain bike event. In Spain, and in a team that featured </span><span>Ashleigh Moolman-Pasio and World Champion Anna van der Breggen, Blanka Vas exceeded all expectations. She finished sixth and fourth on stages three and four respectively to finish in the top ten overall. </span>This came before her most impressive result on the road yet — fourth place at the World Championships.</p>\n<p><span>Over the winter, </span><span>Blanka Vas will compete in</span><span> the cyclocross World Cup, where she finished on the podium for the first time recently in Iowa City. There, she was only beaten by cyclocross greats Denise Betsema and Marianne Vos. </span></p>\n<p><span>With so much potential across a range of disciplines, we cannot wait to see what Blanka Vas can accomplish in her first full season with SD Worx.</span></p>\n<h4><b>Marijn van den Berg - EF Education - Nippo</b></h4>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PB2_0327-min_1024x1024.jpg?v=1635340199\" /><em>Marijn van den Berg races at the men’s U23 road race in Yorkshire, 2019. </em></span><em><span>(Image credit: </span><span>Pauline Ballet/SWpix)</span></em></p>\n<p><span>Marijn van den Berg spent his 2021 campaign with Groupama-FDJ’s development team, but now makes the switch to EF Education - Nippo to make his WorldTour debut. </span><span>The 22 year old is one of the older riders on our list and looks more than ready to mix it up with the pros.</span></p>\n<p><span>Van den Ber</span><span>g’s strength is his sprint. He won three stages of the 2021 Tour de l’Avenir to win the points classification, though not all of his stage victories came in a mass sprints. Stage three to Donnemarie-Dontilly finished on a short uphill ramp, with an average percentage of 5% in the final kilometre. Van den Berg defeated Arnaud De Lie, Stan Van Tricht and Mick van Dijke, who all make the step up to the WorldTour ranks in 2022.</span></p>\n<p><span>EF Education - Nippo may be the ideal location for Van den Berg. In 2021, they didn’t have an out-and-out sprinter in their squad. This means Van den Berg should receive plenty of opportunities to sprint for victory in his first season at the top level.</span></p>\n<h4><b>Linda Riedmann - Team Jumbo-Visma</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210925RC2335-min_1024x1024.jpg?v=1635340153\" />Linda Riedmann (left) sprints to third in the Women's Junior Road Race, Flanders 2021 (</span></i><i><span>Image credit: </span></i><i><span>Ramsey Cardy/SWpix)</span></i></p>\n<p><span>At just 18 years old, Linda Riedmann is heading to the WorldTour with Team Jumbo-Visma. </span></p>\n<p><span>Riedmann picked up multiple wins in 2021 at the Tour du Gévaudan Occitanie Femmes and the Watersley Ladies Challenge, though her most notable result came at the European Championships, where she tackled the hilly course around Trento capably before winning in a sprint. Although she didn’t win the rainbow bands weeks later in Flanders 2021, third place was another very respectable result. Britain's Zoe Bäckstedt and the USA’s Kaia Schmid had escaped early on and weren’t seen by the peloton again, but Riedmann stayed focussed to won the bunch sprint behind to pick up the bronze medal.</span></p>\n<p><span>Riedmann’s performances at the World and European Championships illustrate her abilities on a bike well. She is a fine sprinter who can also get over hills capably. <span>Riedmann </span>could be a very good sprinter from reduced groups in the future, and who better to learn from than the great Marianne Vos, who has perfected that particular art and will be her teammate at Jumbo-Visma over the next couple of seasons.</span></p>\n<h4><b>Cian Uijtdebroeks - Bora-Hansgrohe</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RC1_9778-min2_1024x1024.jpg?v=1635343764\" />Cian Uijtdebroeks fights back after an early crash at Flanders 2021. (Image credit: </span></i><i><span>Ramsey Cardy/SWpix</span></i><i><span>)</span></i></p>\n<p><span>Cian Uijtdebroeks joins Bora-Hansgrohe as an 18-year-old. The Belgian is transitioning straight from the junior ranks to the WorldTour, removing the U23 stepping stone as his countryman Remco Evenepoel did when he joined Deceuninck - Quick Step in 2019.</span></p>\n<p><span>Uijtdebroeks was one of the favourites to win the junior road race at Flanders 2021, but an early crash ruled him out of contention. Nonetheless, the youngster didn’t given in. He battled on despite losing minutes to the front of the race, pulling the <em>grupetto</em> single-handedly. Ultimately, Uijtdebroeks finished eight minutes down in 70th place. Although this demonstrated fighting spirit, his other junior results show his true potential and why Bora-Hansgrohe have handed him a three-year contract.</span></p>\n<p><span><span>Uijtdebroeks finished on the podium in all three stage races he started this year</span></span><span>, winning the Aubel-Thimister-Stavelot. He also won one-day races La Classique des Alpes Juniors and Grand Prix West Bohemia by a combined margin of more than eight minutes. </span></p>\n<p><span>His ability to attack solo and from long-range means that comparisons with Remco Evenpoel are inevitable. We’ll learn more about his skillset in the WorldTour next season.</span></p>\n<h5><span>Riders who just missed our list:</span></h5>\n<ul>\n<li><span>Valentin Paret-Peintre (AG2R Citroën)</span></li>\n<li><span>Edoardo Zambanini (Bahrain-Victorious)</span></li>\n<li><span>Stan Van Tricht (Quick Step-Alpha Vinyl)</span></li>\n<li><span>Magnus Sheffield (Ineos Grenadiers)</span></li>\n<li>Luke Plapp (Ineos Grenadiers)</li>\n<li>Leon Heinschke (Team DSM)</li>\n<li>Henri Vandenabeele (Team DSM)</li>\n<li>Arnaud de Lie (Lotto Soudal)</li>\n<li>Jarrad Drizners (Lotto Soudal)</li>\n<li>Corbin Strong (Israel Start-Up)</li>\n<li>Shari Bossuyt (Canyon Sram)</li>\n<li><span>Elise Uijen (Team DSM)</span></li>\n<li><span>Francesca Barale (Team DSM)</span></li>\n</ul>\n<span></span>\n<p><i><span>Cover image: </span></i><i><span>Alex Whitehead/SWpix</span></i></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d05e2a291c1d6e766f9f43b4f8ae1e458158a1a304e578362af7e1264d15574c","category":"Cycling"}