{"title":"Training and Resources Related to the Administration of Sedation by Nurses During Digestive Endoscopy: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202409.2339/v1","date":1727661128000,"content":"Background: The healthcare professional who performs sedation for digestive endoscopy procedures is usually the nurse. Therefore, knowledge and training on the part of the nurse is an important factor for the correct sedation of the patient and may affect, among other factors, the quality of health care and the recovery and well-being of the patient. Objective: To determine the training opportunities and resources available to the specialists involved indigestive endoscopy services in hospitals in Spain in which sedation is performed by the nursing staff.Methods: This was a descriptive cross-sectional study performed in the Digestive Endoscopy Service at Toledo University Hospital and nearby hospitals in central Spain. The sample consisted of 75 nurses who administer sedation in digestive endoscopic procedures. Results: Regarding the training of nurses, the vast majority were generalist nurses, and only a small percentage obtained specialized training through ongoing training. Most had been working in the service for more than two years, and very few had previous experience in sedation, although the vast majority currently applied sedation. Life support training was also critical. There were significant differences in the availability of resources between different hospitals. Conclusions: The training of nurses who perform sedation in digestive endoscopy services could be improved since there is a high proportion of personnel without specific training in sedation before starting to work in the service. It is crucial to implement targeted and ongoing training programs to improve competencies in this area, as they are essential to ensure the safety and effectiveness of the procedure. Given the variability in resources and personnel training that exists between different hospitals, it seems important to establish standards at the institutional level.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d060ce2f3c39462bc180c12939430409657fac503adace67a625e28adeee4df9","category":"Interdisciplinary"}