{"title":"Not all sweetness and light: Non‐structural carbohydrate storage capacity in tree stems is decoupled from leaf but not from root economics","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14492?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/505aa208-49e3-46e3-b057-a57167bfad87/fec14492-toc-0001-m.png\" alt=\"Not all sweetness and light: Non-structural carbohydrate storage capacity in tree stems is decoupled from leaf but not from root economics\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/13/how-are-sugar-and-starch-involved-in-tree-functional-strategies/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>\n\nNon-structural carbohydrates (NSC) are considered as indicators of the balance between tree carbon sources and sinks and reflect functional strategies throughout different biomes. However, little is known about the contribution of NSC to tree economics, and in particular, whether leaf, stem and coarse root traits co-ordinate together into a whole-tree economics spectrum.\n\nTwenty-four functional traits (including NSC content) were measured in leaves, stem and coarse root xylem of up to 90 angiosperm tree species in temperate, Mediterranean and tropical climates. By performing principal component analysis and standardized major axis regression, we explored the relationships between NSC and other functional traits, as well as the effects of climate and phylogeny on these relationships.\n\nOur results revealed a covariation between leaf and coarse root NSC content and leaf economic traits, whereas stem NSC content was largely decoupled from the leaf economics spectrum that was mostly driven by leaf nitrogen content and leaf mass per area. Coarse root xylem traits were closely correlated with leaf traits, while most stem xylem traits were independent from the leaf economics spectrum but covaried with coarse root traits. Trade-offs among traits in tropical species opposed those from other climates. Evolutionary history affected relationships among certain traits but did not change overall patterns.\n\nWe conclude that due to leaf habit, an extended growing season and heightened defences, tropical species form distinct conservative resource acquisition strategies. Across all climates, as the stem must provide an efficient transport route between roots and leaves, while maintaining the display of branch and leaf organs, stem xylem design and NSC storage capacity lead to a stem economics spectrum that is largely independent from the leaf spectrum, but is coupled with that of coarse roots due to anatomical continuity.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/13/how-are-sugar-and-starch-involved-in-tree-functional-strategies/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Guangqi Zhang, \nZhun Mao, \nPascale Maillard, \nLoïc Brancheriau, \nBastien Gérard, \nJulien Engel, \nClaire Fortunel, \nPatrick Heuret, \nJean‐Luc Maeght, \nJordi Martínez‐Vilalta, \nAlexia Stokes","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"d06382f4a0c58b349df1349bb0f49c2dc8130eda65d1be0ff1ed4ed24995c6ae","category":"Environment"}