{"title":"The Information: ‘Apple Very Likely to Face DOJ Antitrust Suit’","link":"https://www.theinformation.com/articles/apple-very-likely-to-face-doj-antitrust-suit","date":1635284695000,"content":"\n<p>More antitrust news, from Josh Sisco, reporting for The Information (alas, paywall-protected):</p>\n\n<blockquote>\n  <p>And Apple’s opponents have raised other issues including the\ncompany’s “Sign in with Apple” offering, a button placed on apps\nand websites that allows people to sign in using their Apple\nusername and password. The Information first reported the DOJ’s\ninterest in the sign-in button earlier this year.</p>\n</blockquote>\n\n<p>I strongly suspect that it’s not “Sign In With Apple” itself, but the corresponding App Store rule that requires any app that offers the ability to sign in with a third-party service (which, in practice, primarily targets Google and Facebook, and to a lesser degree Twitter) to also support “Sign In With Apple”.</p>\n\n<blockquote>\n  <p>The probe also is examining complaints about how Apple places\nrestrictions on location tracking that its own apps don’t have to\nfollow, said several people with knowledge of the matter.</p>\n</blockquote>\n\n<p>They say that, but I get prompted to re-confirm allowing Apple’s iOS Weather to always access my location frequently. I wish I could make it ask me less frequently. The complaints aren’t really about Apple’s <em>apps</em> having access to your location but the system itself having access.</p>\n\n<blockquote>\n  <p>Of particular concern to app developers is Apple’s App Tracking\nTransparency, which requires iPhone and iPad users to\naffirmatively opt in to let developers share personal information,\nsuch as a device’s location, with other apps and advertisers.\nApple isn’t requesting such permission to track users of its own\napps, giving it an unfair advantage in serving ads in the App\nStore and elsewhere, developers argue. Apple has said that unlike\nFacebook, it doesn’t share user data with others for advertising\npurposes, and that the changes are designed to protect customers’\nprivacy.</p>\n</blockquote>\n\n<p>Apple should just abandon selling ads in the App Store. I’m convinced the antitrust problems those ads are causing (not to mention loss of developer goodwill) are not worth the money they generate.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/10/26/the-information-apple-doj\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d06398dd10dc54b2f8d35f9bf0f39e87fe8429f602f96694008bb8d1b8b198f1","category":"Tech"}