{"title":"Omega‐3 long‐chain polyunsaturated fatty acids in Atlantic salmon: Functions, requirements, sources, de novo biosynthesis and selective breeding strategies","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12882?af=R","date":1701081930000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b069ea0b-e5c4-42ee-9a38-6b70a7ef8c36/raq12882-toc-0001-m.png\" alt=\"Omega-3 long-chain polyunsaturated fatty acids in Atlantic salmon: Functions, requirements, sources, de novo biosynthesis and selective breeding strategies\" />\n<p>Enhancing the omega-3 long-chain polyunsaturated fatty acids (LC-PUFAs), eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), in Atlantic salmon fillets is important for consumers and are traditionally supplied in the diet from marine fish oil. However, issues with the environmental and economic sustainability with fish oil use have initiated interest in alternatives. Alternatives to fish oil, such as microalgae oil or genetically modified plant-based oils, can supply EPA and DHA for farmed salmon. Another method that has potential is selective breeding to enhance de novo synthesis of EPA and DHA in salmon to yield higher EPA and DHA in fillets for consumers, without supplying EPA and DHA in the diet.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The aquaculture industry is a substantial user of wild-sourced fish oil to supply omega-3 (n-3) long-chain polyunsaturated fatty acids (LC-PUFAs) in fish diets, which are required by many economically important farmed fish species, particularly Atlantic salmon (<i>Salmo salar</i> L.). Fish oil is commonly replaced with plant-based oils as more environmentally and economically sustainable substitutes due to concerns regarding over-fishing of wild stocks and increasing demand. One potential strategy to meet the physiological requirement for n-3 LC-PUFA is to improve n-3 LC-PUFA biosynthesis in salmon through selective breeding and strain enhancement. The objective of this review is to discuss strategies to supply sufficient levels of n-3 LC-PUFA to Atlantic salmon through the diet and de novo biosynthesis through selective breeding and salmon strain enhancement. This review provides an overview on the functions of n-3 LC-PUFA in Atlantic salmon, dietary requirements, source and supply of n-3 LC-PUFA in aquaculture feeds, and biosynthesis of n-3 LC-PUFA in fish. Several relevant studies have revealed the genetic influences on n-3 LC-PUFA biosynthesis and storage in Atlantic salmon. The results of the present review show that selective breeding of high n-3 PUFA-producing Atlantic salmon could be an effective strategy to improve the amount of EPA and DHA stored in tissues and reduce reliance on dietary sources of n-3 LC-PUFA such as fish oil.</p>","author":"Zeyu Zhang, \nYounes Miar, \nDavid Huyben, \nStefanie M. Colombo","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"d063233b7afb8931e48409406dec6d21e8e80d73160cc7661070e381b72c1f24","category":"Environment"}