{"title":"NSC รอบนักเรียน #2","link":"https://blog.whs.in.th/node/3480","date":1596810249000,"content":"<p>จาก<a href=\"https://blog.whs.in.th/node/3249\">ปีที่แล้ว</a> มาพูดถึงโครงงานปีนี้บ้าง</p>\n\n\n\n<h2>Inequality</h2>\n\n\n\n<p>ปีที่แล้วเรื่องที่สังเกตคือว่า โรงเรียนต่างจังหวัดมีโอกาสเข้าถึงปัญหามากกว่าโรงเรียนในกรุงเทพ ปรากฏว่าไม่รู้ว่าปีนี้โรงเรียนในกรุงเทพอ่านบล็อกเก่ามาหรืออย่างไร แต่เค้าแก้ปัญหาได้น่าสนใจมาก</p>\n\n\n\n<p>ผู้เข้าแข่งขันที่ส่งมาหลายรอบน่าจะทราบว่า Social Impact เป็นคะแนนก้อนใหญ่มาก (ซึ่งแจ้งในเกณฑ์การตัดสินอยู่แล้ว) สิ่งที่โรงเรียนในกรุงเทพทำในปีนี้แทบทุกกลุ่มคือไปหากลุ่มเป้าหมายจริง หรือผู้เชี่ยวชาญในด้านนั้น (Domain expert) แล้วถ่ายคลิปมาด้วย กรรมการจะได้ไม่ต้องถามว่าอันนี้เคยเอาไปใช้งานจริงแล้วหรือยัง</p>\n\n\n\n<p>ในขณะที่โรงเรียนต่างจังหวัดมีอยู่แค่ 3 – 4 โครงการที่ได้คุยกับ Domain expert บางกลุ่มสอบถามไปก็พบว่าขาดแคลน Domain expert ในพื้นที่ด้วยซ้ำ</p>\n\n\n\n<h2>Video</h2>\n\n\n\n<p>ปีนี้ตัดสินกันด้วยการให้ present เป็นวิดีโอมา ซึ่งคิดว่ามีผลต่อคะแนนเยอะมากๆ เพราะกรรมการจะไม่ได้จับชิ้นงานจริงแล้ว ให้คะแนนได้แค่ตามที่โชว์ในวิดีโอ แล้ววิดีโอมีเวลาจำกัด เท่าที่เห็นพลาดกันคือ</p>\n\n\n\n<ol><li>หลายกลุ่มนั่งอ่านที่มาและความสำคัญให้ฟัง ซึ่งยาว เสียเวลา และไม่ได้ใช้วิดีโอเป็นประโยชน์ (ควรจะเขียน script ใหม่ให้เหมาะสมกับสื่อที่ใช้นำเสนอ)</li><li>Demo ให้คะแนนยาก เช่นมีคะแนน Look and feel แต่ไม่ได้ถ่าย interface มาให้ดูเลยก็ต้องขอดูตอนซักถาม</li><li>ถ้าตัดต่อดีเกินไปจะรู้สึกว่าเป็น visual effect ให้คะแนนไม่ได้เพราะไม่รู้ว่าชิ้นงานที่ใช้ได้จริงมากน้อยแค่ไหน โดยเฉพาะเมื่อกรรมการทดลองเองไม่ได้ ชิ้นงานอาจจะ simulate scenario ทั้งหมดที่แสดงในคลิปให้เหมือนใช้งานได้ไม่ติดปัญหา (นี่คือรายการแข่งซอฟต์แวร์ เราตัดสินจากชิ้นงานที่เสร็จไม่ใช่ไอเดีย) ก็เป็นหน้าที่ของกรรมการที่จะต้องใช้ซักถามสืบให้พอทราบว่าชิ้นงานจริงใช้งานได้แค่ไหน</li><li>เนื่องจากทำ video แล้วไม่จำเป็นต้องถ่ายคลิปตัวเองยืนพูดหน้า slide บางคนทำแบบนี้มาแล้วข้อความไม่ชัด หรือเสียงไม่ชัด</li></ol>\n\n\n\n<p>สรุปแล้วคิดว่ากลางๆ สุดคือเอา slide ขึ้นเต็มจอ พากย์เสียงทับแล้วตัด demo เข้ามาแทรก (ด้วย screen record จริง ไม่ใช่เอากล้องจับ) น่าจะทำง่ายและดูง่ายที่สุด อาจจะน่าเบื่อแต่ไม่น่าจะเสียคะแนน</p>\n\n\n\n<p>ปีหน้าคาดหวังว่าถ้ามีวิดีโออีก มันจะคุณภาพดีขึ้น เพราะปีนี้ฉุกละหุกมาก แต่ไม่มีเลยจะดีกว่า</p>\n\n\n\n<h2>Scope</h2>\n\n\n\n<p>ปีนี้กรรมการกังวลกันว่าผู้เข้าแข่งขันเห็นคะแนนแล้วจะสงสัยกันมั้ยว่าทำไมคนนี้ได้อันดับเท่านี้ ทั้งๆ ที่ Scope อาจจะเล็กกว่าของเค้า</p>\n\n\n\n<p>ในความเห็นผมว่าเลือก Scope เล็กดีกว่า Scope ใหญ่ มันทำให้โฟกัสชิ้นงานได้มากขึ้น งานมันเลยจะรู้สึกว่าคุณภาพดี มากกว่างานที่ Scope ใหญ่แล้วเสร็จฟีเจอร์อย่างละนิดอย่างละหน่อย แต่ก็ต้อง balance กับ social impact ด้วยว่าถ้า scope งานเล็กแล้วประโยชน์น้อย อาจจะได้รางวัลแต่อาจจะไม่ถึงที่ 2</p>\n\n\n\n<p>ตัวอย่างที่ค่อนข้างดีจากปีที่แล้วคือโครงงานที่ทำถังขยะเปิดปิดอัตโนมัติ กรรมการตรวจแล้วไม่มีข้อสงสัยเพราะ scope เล็ก ชิ้นงานใช้งานสมบูรณ์ และคิดมารอบแล้วกรรมการไม่มีข้อเสนอแนะอื่นอีก ตัวชิ้นงานเลยได้คะแนนค่อนข้างดี ในขณะเดียวกัน scope มันแคบและปัญหาไม่ได้ pain เท่าไร ก็เลยไม่ค่อยมีคะแนนให้เลื่อนอันดับไปอีก ในขณะที่โครงการทำ hardware อื่นๆ ในปีเดียวกันมี scope กว้างกว่าแต่ว่าชิ้นงานจริงไปได้ไม่ลึกเท่าไรนัก</p>\n\n\n\n<h2>IoT</h2>\n\n\n\n<p>ปีนี้รู้สึกว่า IoT ถอยหลังลงคลองอย่างชัดเจนมาก ด้วยการมาของ Blynk และ Kidbright</p>\n\n\n\n<p>สมัยผมลงแข่งจำได้ว่ามีกลุ่มหนึ่งทำระบบปิดไฟโดยใช้ตู้ Consumer Unit ของ Scheider ที่เสียบ Ethernet ได้ แล้วทำหน้าเว็บเป็น PHP เพื่อควบคุม มันเลยค่อนข้างเป็นโครงงาน software เพราะ hardware ไม่ได้ทำเอง</p>\n\n\n\n<p>แต่สมัยนี้โครงงานที่เน้น hardware มีมากขึ้นเรื่อยๆ โดยเฉพาะยุค IoT แต่คิดว่าในมุมเทคนิคแล้วมันน่าจะเกิดจากที่การเขียน IoT ง่ายขึ้นเรื่อยๆ โดยเฉพาะ interface สำเร็จรูปที่ทำให้คนทำเองลดลงมาก หลายๆ ทีมเลือกใช้ Blynk หรือ LINE Notify ซึ่งพวกนี้เราไม่นับเป็นคะแนน interface เลยเพราะใช้ของสำเร็จมาแล้ว</p>\n\n\n\n<p>ปัญหาที่ตามมาคือ ในหลายๆ use case ที่เลือกมาใช้แล้วจำเป็นต้องพึ่งบริการ online แต่จุดที่ใช้งานไม่มี internet ต้องติดตั้ง internet มือถือเพิ่มเข้าไปอีก (และด้วยว่าโครงงานไม่ได้ถูกใช้งานจริง เลยไม่เห็นใครคิดแก้ปัญหามาก่อนที่กรรมการจะถาม)</p>\n\n\n\n<p>จริงอยู่ว่าการใช้ interface สำเร็จจะลดเวลาทำสิ่งที่เคยมีคนทำไปแล้ว (don’t reinvent the wheel) แต่ยังไม่เห็นมีใครจะใช้เวลาที่ได้คืนมาเอาไปทำอย่างอื่นที่เป็นนวัตกรรมใหม่ๆ โครงการเปิดปิดไฟที่ทำมาเป็นสิบปีแล้วก็ยังมีฟีเจอร์เท่าเดิมแค่เปลี่ยน use case ไปเรื่อยๆ แถมโค้ดน้อยลงเรื่อยๆ จนไม่ต้องเขียน server เองแล้ว</p>\n\n\n\n<p>ที่น่ากลัวคือ IoT กำลังจะเข้าถึงมือ end user ด้วย <a href=\"https://speakerdeck.com/whs/next-generation-smart-home-88d67169-825a-4110-8191-f05a8f8ec70a\">Xiaomi และ Sonoff</a> ที่ทำราคาถูกมาก ปีหน้าถ้ายังมีใครทำเปิดปิดพัดลมตามอุณหภูมิอยู่อีกจะถามแล้วว่าต่างกับการใช้ <a href=\"/node/2492\">Sonoff</a> กับ Xiaomi Temperature Sensor อย่างไร (แถมมันยังมี Plant Monitor ปักดินได้ด้วยนะ)</p>\n\n\n\n<p>สิ่งที่คาดหวังในอนาคตคือโครงการใหม่ๆ ที่ไม่ใช่แค่เอา sensor ที่ให้มาต่อออก internet มีแจ้งเตือนแล้วก็เปิดปิดไฟได้อัตโนมัติ เช่น…</p>\n\n\n\n<ul><li>ระบบสำหรับทำให้ end user กำหนด automation ได้เองเหมือน IFTTT</li><li>data source แบบใหม่ที่ไม่ใช่เซนเซอร์ในกล่อง (ผมเคยลองทำระบบตรวจจับคนในห้องประชุมจะใช้ที่บริษัท มันก็พอได้บ้างนะ แต่สำหรับรอบนักเรียนอาจจะต้อง reframe ปัญหาใหม่)</li><li>เงื่อนไขการทำงานที่กลับด้านกัน คือ action เกิดบน internet แล้วส่งผลต่อโลกจริง เช่น <a href=\"http://instprinter.com/\">Printer ที่พิมพ์ Instagram อัตโนมัติ</a></li><li>ไอเดีย embedded อื่นๆ ที่ไม่ต้องออก internet เช่น <a href=\"/node/2954\">Network monitor</a> หรืองานที่ใช้ peer-to-peer ระหว่างอุปกรณ์ (ปีนี้ก็มีคนทำนะ)</li></ul>\n\n\n\n<p>แต่ถ้าเลี่ยงได้น่าจะมีหัวข้อที่ได้ที่ 1 อีกเยอะที่ง่ายกว่าด้านบนนี้</p>","author":"whs","siteTitle":"Quietly Verbose","siteHash":"5f972a6fe70a917eb1b1aa165b3cb2be8a9465af33ab38bf05f34c55c0e40587","entryHash":"d06604122931c628305cde5996fdbfa36d97f1de0dc04da08f4f260c39079028","category":"Thai"}