{"title":"Antimicrobial and therapeutic potentials of the blackberry extracts against Escherichia coli infection in male albino rats","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13572?af=R","date":1723098330000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Blackberries have garnered attention recently due to their high concentration of bioactive components like anthocyanin and their health advantages. Therefore, this study aims to determine the bioactive profile, antioxidant and antibacterial effects of blackberry extracts (BBEs). Then, evaluate the protective effect of BBEs (20%, 30% and 40%) in a rat model of 2 mL of 4–8 × 10<sup>6</sup>\n<i>Escherichia coli</i> ATTC 25922 strain colony-forming unit mL<sup>−1</sup> oral infection on the seventh day of the experiment.</p>\n<h2>RESULTS</h2>\n<p>Rats were divided into six groups: G1: control (C−: normal or negative group), G2: (C+: infected or positive group), G3: infected-treated group by 20% BBE, G4: infected-treated group by 30% BBE, G5: infected-treated group by 40% of BBE and G6: infected-treated group by Gentamicin. The results showed that BBE had a high content of total phenolic compounds, flavonoid, anthocyanin contents, and different vitamins (vitamins A, E and C), reaching 450, 186, 58.83 mg 100 g<sup>−1</sup>, 2.68, 2.14 and 107.46 mg 100g<sup>−1</sup> fresh weight, respectively, which showed great antioxidant and antibacterial effects. Therefore, liver enzymes, kidney function and lipid profiles were significantly higher in the infected group than in the control or infected-treated groups. Furthermore, BBE ameliorated inflammation of the intestine and hepatocyte damage compared to the infected control group.</p>\n<h2>CONCLUSION</h2>\n<p>These results suggest that consistent intake of BBE might alleviate hepatic inflammation and the gut microbiota in ways that could significantly impact human health. © 2024 Society of Chemical Industry.</p>","author":"Aziza Ali Salah‐Eldin, \nHuda Hassan Ibrahim, \nMarwa Rashad Ali","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d07bdc056b3b4bb75158f93ec72a2d339c9b1979f15cdec4f4c4d79e9e68876c","category":"Environment"}