{"title":"Impact of climate variability on moonfish (Mene maculata) catch rate in the waters off southwestern Taiwan","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12667?af=R","date":1706748269000,"content":"<h2>Abstract</h2>\n<p>A commercially significant small coastal forage fish, moonfish (<i>Mene maculata</i>), accounts for almost 98% of Taiwanese purse seine capture, primarily in the southwestern Taiwan region. Research indicates that climate indices affect coastal fish catch and dispersal, while the link between moonfish and climatic variability in this region is still unclear. This study found that the delayed period of Pacific Decadal Oscillation (PDO), North Pacific Oscillation (NPO) and North Pacific Gyre Oscillation (NPGO) affect moonfish distribution and catch rates off southwestern Taiwan. Understudied are the environmental factors connected to these oscillations and their delayed consequences on moonfish catch rates. We focussed on Taiwan purse seiner capture rates (catch per unit effort or CPUE) of moonfish in southwestern Taiwan from 2014 to 2020 and delayed oscillation occurrences up to 5 years to better understand these processes. CPUE demonstrated a 3 to 4-year positive connection (r &gt; 0.5) with NPGO, NPO and PDO. The region's moonfish catch rates were most affected by NPGO with a 4-year lag, followed by a 3-year lag of PDO and lastly a 4-year lag of NPO, according to the results of generalized additive models (GAMs). All the three oscillations had the greatest impact on moonfish catchability when a lag of &gt;2 years was present. Between 2014 and 2020, moonfish CPUE fluctuated, peaking in 2019. The climatic parameters that affect moonfish in southwestern Taiwan and the Taiwanese purse seine fisheries catches are shown by this study.</p>","author":"Aratrika Ray, \nSandipan Mondal, \nKennedy Edeye Osuka, \nRiah Irawati Sihombing, \nMing‐An Lee, \nYi‐Chen Wang, \nJia‐Sin He","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"d083545cdb4ec8e40e771f42f903342aea355bd6cd477ee50cb14dda799e7387","category":"Environment"}