{"title":"How I learned to love the Indianapolis 500, America’s greatest race","link":"https://arstechnica.com/?p=1768407","date":1622212454000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1233036172-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1233036172.jpg\">Enlarge</a> <span>/</span> Scott Dixon has won six IndyCar championships and one Indy 500. On Sunday, he will start the 105th Indy 500 from pole position.  (credit: Brian Spurlock/Icon Sportswire via Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>As an immigrant, it took me a while to <a href=\"https://arstechnica.com/cars/2016/05/the-greatest-spectacle-in-racing-turns-100-the-2016-indy-500/\">properly appreciate the Indianapolis 500</a>. Taking place this coming Sunday, the race is one of the oldest in the world, and it's the largest single-day sporting event of the year, to boot. To the uninitiated, 200 laps on a track with only four corners doesn't seem that complicated. But consider the fact that the 33 drivers still lap at an average speed of more than 220 mph (354 km/h), often inches from each other—and from the wall that lines the 2.5-mile (4 km) oval—and everything comes into perspective.</p>\n<p>The race usually takes place on the same day as F1's Monaco Grand Prix (and NASCAR's Coca-Cola 600), but it's now the highlight of the day for me, usually offering up about three hours of close but unpredictable racing. The demands on the driver are high—unlike in F1, an IndyCar has no power steering, for one thing.</p>\n<p>And the addition of the aeroscreen has resulted in a considerable increase in cockpit temperatures now that drivers are no longer exposed to airflow. On top of that, teams need to manage their tire and fuel strategies and perfectly execute each pit stop if they want a shot at victory. It's a daunting challenge that has bested even legendary drivers like F1 double champion Fernando Alonso.</p></div><p><a href=\"https://arstechnica.com/?p=1768407#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768407&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d08cbc582e566ab13914070f344b67b5b9d03116d1613477d77701f4def63ae7","category":"Tech"}