{"title":"471 The use of infrared imaging of piglets to assess ocular surface temperature change before, during and after routine procedures","link":"https://academic.oup.com/jas/article/102/Supplement_3/408/7757067?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Procedures including teeth clipping (TEE), tail docking (TAI), and ear tagging (TAG) are conducted routinely in commercial pig production units during the first days of life in piglets. However, as these procedures are conducted without anesthetics, there is controversy surrounding these procedures due to the pain/stress they may cause. The assessment of vasomotor activity using non-invasive infrared thermography (IRT) is increasingly being promoted as a tool to detect acute stress. The objective of this study was to assess changes in the ocular (OCU) window of piglets before, during and after each of the aforementioned procedures using IRT. This study used crossbred piglets (n = 116; Duroc Danish x Landrace x Large white) from multiparous sows. All thermographic images of piglets were taken between 0900 h and 1600 h using a high-resolution handheld infrared camera FLIR T650sc (640 x 480 pixels; FLIR Systems, Wilsonville, USA) at a uniform distance of 1 m on the left side of the face. To assess TEE, TAI and TAG procedures separately, a recovery period (12 ± 2.5 min) was allowed between procedures. Due to order differences in which procedures were conducted, the following study groups were created (procedures in brackets indicate the procedures performed prior to the focal procedure): TEE, (TEE+) TAI, (TEE+TAI+) TAG, TAI, (TAI+) TEE, (TAI+TEE+) TAG, TAG, (TAG+) TEE, (TAG+TEE+) TAI. Temperature values were recorded from images using FLIR Tools software 6.0 (FLIR Systems). Data were analyzed using a linear mixed model for repeated measures and multiple comparisons were calculated using a post-hoc Tukey test (GraphPad Prism 10.0.2). Table 1 shows the mean and standard deviation (SD) values for IRT recordings in the OCU window. Comparison of evaluation times showed a significant reduction in OCU temperature from before to after the procedure(s) in (TEE+) TAI (-1.21 °C, <span>P</span> &lt; 0.001), (TAI+TEE+) TAG (-0.65 °C, <span>P</span> &lt; 0.001), TAG (-0.58 °C, <span>P</span> &lt; 0.05) and (TAG+TEE+) TAI (-0.3 °C, <span>P</span> &lt; 0.01) groups. These changes in the OCU window of piglets may be in response to the procedures performed, resulting in a sympathetically mediated acute vasomotor response as cutaneous capillary blood flow shifts due to transient peripheral vasoconstriction. In turn, IRT detects this blood flow change as a reduction in surface temperature. Comparison between procedure groups found that mean OCU temperature during the procedure was greater (<span>P</span> = 0.01) in (TAI+) TEE and (TAG+) TEE than the rest of the groups, though the reason for this is unclear and requires further investigation. This work shows that IRT can be used as a non-invasive tool to detect surface temperature changes of piglets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d0ad3598595e898d4aff29222911a9a45c04e12d0e8dd45d0064ca5559b789a5","category":"Environment"}