{"title":"Noradrenergic Transmission in the Basolateral Amygdala Mediates the Effects of Predatory Odor Exposure on Hippocampal Plasticity &ndash; a New Concept for Studying the Emotional Modulation of Memory Consolidation","link":"https://www.preprints.org/manuscript/202403.1150/v1","date":1710848926000,"content":"The pivotal role of the basolateral amygdala (BLA) in the emotional modulation of hippocampal plasticity and memory consolidation is well established. Specifically, multiple studies have demonstrated that the activation of the noradrenergic (NA) system within BLA governs these modulatory effects. However, most of the current evidence has been obtained by direct infusion of synthetic NA or beta-adrenergic agonists. In the present study, we aimed to investigate the effect of endogenous NA release in the BLA, induced by a natural aversive stimulus (coyote urine), on memory consolidation for a neutral hippocampal-dependent task. We combined a weak version of the object location task (OLT) with mild predator odor exposure (POE) for our experiments. To investigate the role of the BLA in memory modulation, a subset of the animals (Wistar rats) were treated with the non-selective beta-blocker propranolol at the end of the behavioral procedures. Hippocampal tissue was collected either 90 minutes after drug infusion or 24 hours after the OLT test. The samples were used to determine the levels of phosphorylated CREB (pCREB) and activity-regulated cytoskeleton-associated protein (Arc) - two molecular markers of experience-dependent changes in neuronal activity. The result suggests that POE is a behavioral paradigm suitable for studying the interaction between BLA and the hippocampus in memory prioritization and selectivity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d0b017ca440e2c484cd4e7eb0c746855fd3d4a9049922fe0ca8d5f56936ca5e3","category":"Interdisciplinary"}