{"title":"Tour de France winner Joane Somarriba returns to cycling as ambassador and advisor for Laboral Kutxa women's team","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-winner-joane-somarriba-returns-to-cycling-as-ambassador-and-advisor-ifor-laboral-kutxa-womens-cycling-team","date":1686227273000,"content":"\n      <p><strong><em>This story was originally published in Spanish at <a href=\"https://www.rouleur.cc/es/blogs/rouleur-espana/joane-somarriba-nueva-embajadora-y-asesora-del-equipo-femenino-del-laboral-kutxa\">Volata</a></em></strong></p>\n<p>In the last few weeks we’ve spotted former professional cyclist Joane Somarriba at several competitions of the women's calendar, including the Vuelta Femenina, where she was guest of honour on the sixth stage between Castro-Urdiales and Laredo. She also accompanied the Laboral Kutxa women's team in the Itzulia Women and the Durango Classic. Undoubtedly, Somarriba's presence was comforting for the world of women's cycling, after a few years away from it publicly, as her figure linked the promising present of women's cycling with the impressive palmarès of a pioneer.</p>\n<div></div>\n<p>This occasional presence at races has now materialised in the form of her active return to competitive cycling. As announced by the Euskadi Foundation, Somarriba will be the new ambassador of the Laboral Kutxa women's cycling team for the 2023 and 2024 seasons. The Basque cyclist, winner of three editions of the Tour de France, two editions of the Giro d'Italia and time trial world champion, will join the team as an advisor to contribute her experience and values to help the women's team grow and compete at the top level of cycling.</p>\n<p>From now on, she will act as the team's ambassador in the sporting, promotional and commercial fields. According to sources from the team, she will form part of the staff within the organisation as a direct advisor to Ion Lazkano, the team's sports director, who will continue to be in charge of the sporting sphere. The aim is for Somarriba to share and contribute her experience, values and knowledge with the team and the riders who, due to their age, were unable to see her when he was racing.</p>\n<p>“The long-term commitment of Laboral Kutxa to women's cycling is exciting,” says Joane Somarriba. “I have been particularly struck by the team behind the riders and the passion of those who are part of the Laboral Kutxa-Fundación Euskadi project. The cyclists have a great opportunity to be professionals, they have all the means and an extraordinary staff to give one hundred percent and perform. They lack nothing to be cyclists. Everything helps them to grow and that's why the team has taken a leap forward, has evolved and improved its performance. Incidentally, the team has become a point of reference for all the female cyclists of all categories who are dedicated or want to dedicate themselves to this.”</p>\n<p>With this step, Laboral Kutxa continues to grow in sporting terms and not lose sight of becoming a WorldTour team in the medium term. Additionally, the team also wants to strengthen the social part of the project. “Somarriba will thus form part of an integrating project that is committed to a professionalised model of inclusive values in which the sportswomen of the Laboral Kutxa team are a sporting, social and equal opportunities example and a transforming lever for the rest of society”, according to the team's press release.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FvhOlKzXsAAGTra.jpg?v=1686214742\" alt /></p>\n<p><em>Somarriba was the guest of honor of the Basque team during the last two stages of La Vuelta Femenina (Photo: Laboral Kutxa)</em></p>\n<p>In fact, the trajectory of Laboral Kutxa has been a very fast one. The Basque squad took its first steps in the women's peloton in 2019 and made its first leap in 2021 as a UCI Continental team, which has given it invite access to the most prestigious races on the calendar. The goal is to reach the top category of the Women's WorldTour. Last Friday, Marta Romeu achieved the team's first UCI victory in a stage of the Vuelta a Andalucía. That was the culmination of a few weeks at the highest level.</p>\n<p>This trajectory and the competitive DNA of the team —they were the best Continental team in the Vuelta Femenina— have undoubtedly been decisive in Somarriba's decision to take this step, after being away from professional cycling in recent years at a public level. She had also withdrawn from the media and only very selectively accepted to be interviewed. On a private level, however, she has never distanced herself from cycling, as at home her three children ride bikes in the lower categories and her husband is the ex-professional Ramontxu González de Arrieta.</p>\n<p>“This new stage is something different from when I was a racer, and after some time away from cycling. For me it is very gratifying and a new experience to live cycling up close again,” she says. “I'm looking forward to learning and contributing at the same time because I empathise a lot with the riders. It is a demanding sport that requires a lot of work, sacrifice and effort.”</p>\n<p>She also points out a very important aspect in sport: mental health and the pressure of reaching and staying at the top. In her case, Somarriba had to emigrate to Italy to fulfil her dream of becoming a professional cyclist in early 2000. “I know what is behind a professional cyclist who competes at the highest level and I hope to be able to contribute my experience as a rider. Giving advice, but also listening to them and understanding them; for me that's very important. Sometimes we forget that in competition everything is demanding and therefore it is important to know their needs, doubts and concerns.”</p>\n<p>Aitor Galdós, general manager of Laboral Kutxa-Fundación Euskadi is also pleased with Somarriba's return: “Joane's incorporation into the Laboral Kutxa-Fundación Euskadi project is obviously very positive for us. She is a rider who has won the Giro, Tour and World Championships, and therefore has a unique experience because few riders with such a track record will be able to pass on the message of how she has experienced professional cycling. She has been and is a reference in women's cycling. And now having her experience and support is very important, both for the riders and the coaching staff. Undoubtedly, she will help us to grow as a team and as a project for all that she has represented and represents. Her incorporation is one more stone in the project to reach, step by step, the ambitious goals we have set ourselves to reach the world elite, as well as being a reference at a sporting, social and equal opportunities level”.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1176502729_copia.jpg?v=1686215282\" alt /></p>\n<p><em>The Basque cyclist won three Tour de France. Here she's pictured winning her second French tour in Paris, in 2001 (Photo: JEAN-PIERRE MULLER / Getty)</em></p>\n<h3>An impressive palmarès</h3>\n<p>Joane Somarriba was a professional rider between 1999 and 2006, and accumulated a record that makes her one of the best cyclists of all time at world level. Her track record attests to this: three times winner of the Grande Boucle (2000, 2001 and 2003), and third in 2002; twice winner of the Giro d'Italia (1999 and 2000), second in 2005 and third in 2003; world time trial champion in 2003, and second in 2005; third in the 2002 World Championships in line; she also won the Emakumeen Bira (2004) and three consecutive editions of the Durango-Durango Emakumeen Saria; she was fifth in the Sydney 2000 Olympic Games (CRI) and seventh in the Athens 2004 Olympic Games (road race and time trial). Her teams included Alfa-Lum (1999-2001), Pragma-Deia-Colnago (2002) and Bizkaia-Durango/Bizkaia-Panda (2003-2006). For this, she was recognised with the highest distinctions for a sportswoman.</p>\n<p><em>Cover photo by Laboral Kutxa</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d0b2ff4823c31d36f5c17a7b855c909e0b33cd955a4bbd19591a3a34d3f65ef7","category":"Cycling"}