{"title":"A native species contributes to biotic homogeneity of urban land snails in Thailand","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae012/7673174?rss=1","date":1715731200000,"content":"<span><div>ABSTRACT</div>Biotic homogenization or the increasing similarity of biota has been documented in urban land snail assemblages in Europe and North America. The resulting biotic homogeneity is caused by a loss of native species and the establishment of non-native species. Climate affects land snail distributions, and because Thailand (exclusive of the southern peninsula) has an almost uniform climate, we hypothesized that urban land snail populations would show a high degree of taxonomic homogeneity. We sampled 76 sites (e.g. yards, temple grounds, restaurants and hotels) over a 38-day period during the rainy season in 2022. These sites included three regions: central (five provinces), north (two provinces) and northeast (five provinces). Both live snails and shells were counted, and the 10,470 counted individuals represented 25 taxa. Biotic homogeneity was indicated by three taxa comprising 69.9% of individuals. By far the most abundant species was the native species <span>Sarika siamensis</span>, which was found at all 76 sites and comprised 50.4% of all individuals. The other two abundant species were non-native species—the giant African snail <span>Lissachatina fulica</span> (60 sites) and <span>Allopeas gracile</span> (50 sites)—both widespread synanthropic species. Three other non-native species were also found. Among native species, slugs, including semislugs, were widespread but occurred in low numbers, and <span>Pupina</span> sp. occurred in high abundance (mean = 97 individuals/site) at 13 highly watered locations within its native range. Urban snail assemblages were not entirely homogeneous, as assemblages in the north region differed from those in the central and northeast regions. In conclusion, urban snail assemblages in Thailand showed a high degree of biotic homogeneity, in large part due to a native species, <span>S. siamensis</span>, indicating that native synanthropic species can contribute to biotic homogeneity.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"d0b4ef29a4303be99a04c2b0253f6cdbe116d3c0e9b3fb9dc463a8765785be42","category":"Environment"}