{"title":"Innovative hybrid strategy for quality improvement of Goji tea: ultrasonic–ethyl oleate pretreatment combined with heat pump drying","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13648?af=R","date":1718420668000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Goji berries, renowned for their nutritional benefits, are traditionally dried to extend shelf life and preserve quality. However, conventional drying methods often result in uneven drying, color loss and reduced rehydration capacity. This study investigates an innovative hybrid strategy combining ultrasonic–ethyl oleate (US+AEEO) pretreatment with heat pump drying (HPD) to enhance the drying process of Goji berries.</p>\n<h2>RESULTS</h2>\n<p>Fresh Goji berries underwent US+AEEO pretreatment, which significantly disrupted the waxy layer, enhancing drying efficiency and water infiltration during rehydration. Compared to freeze drying (FD), HPD combined with US+AEEO pretreatment resulted in higher retention of total polyphenol content (TPC) and total flavonoid content (TFC) in the Goji soaking soup. Specifically, the HPD-US+AEEO samples exhibited the highest TPC and TFC levels, significantly outperforming FD samples. Additionally, the DPPH and ABTS antioxidant assays demonstrated higher scavenging activities in HPD-US+AEEO samples. The rehydration kinetics revealed that HPD samples had a superior rehydration rate and final moisture content compared to FD samples. Low-field nuclear magnetic resonance and magnetic resonance imaging analyses confirmed enhanced water distribution and higher mobility in HPD-US+AEEO samples. Scanning electron microscopy indicated a more porous structure in US+AEEO-treated samples, facilitating better water absorption and functional component retention.</p>\n<h2>CONCLUSION</h2>\n<p>The combination of US+AEEO pretreatment with HPD significantly improves the drying process of Goji berries, enhancing nutrient retention, color preservation and rehydration properties. This innovative drying method offers a promising solution for producing high-quality dried Goji berries, benefiting both the food industry and health-conscious consumers. © 2024 Society of Chemical Industry.</p>","author":"Zhaokai Wang, \nGuangyue Ren, \nWenchao Liu, \nXu Duan, \nYike Zhao, \nYunxia Yuan, \nGangtian Liu, \nHui Zhang, \nLibo Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d0b905c5fd126ccb1651441e0e244446c7836c6933a6ac1bff7eb5ffefdff00a","category":"Environment"}