{"title":"South Korea Delays Bill That Would Ban Apple From Requiring Developers to Use In-App Purchase System","link":"https://www.macrumors.com/2021/08/30/south-korea-delays-apple-google-bill/","date":1630332428000,"content":"South Korea has delayed voting on a bill that would ban Apple and Google from requiring developers to use their in-app purchasing systems, a move that would open the door to allowing third-party payment methods, representing a possible significant threat to Apple and Google's app marketplace business models.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Mac-App-Store-General-Feature.jpg\" />\r\n<br />\r\nThe bill, coming in the form of an amendment to the existing Telecommunications Business Act, was widely reported to have been voted on today. However, the National Assembly's <a href=\"https://www.assembly.go.kr/assm/assemact/council/council0101/assmSchCal/assemSchCal.do\">schedule and agenda</a> lacked mention of the amendment, instead focusing on other bills on the press, economy, and more. A date for the assembly to vote on the bill has <a href=\"https://twitter.com/soheefication/status/1432334069455462405\">not yet been set</a>.\r\n<br />\r\n\r\n<br />\r\nThe bill, if it passes, will aim to stop Apple and Google from unfairly exploiting their position to \"force a provider of mobile content, etc., to use a specific payment method,\" according to a readout of the bill. \r\n<br />\r\n\r\n<br />\r\nIt would also be the first time any government takes substantive legislative steps to regulate and control Apple and Google's app distribution platforms. Both platforms have been under increased scrutiny in recent years, with lawmakers, developers, and others calling out the need for regulation and a crackdown on behavior possibly deemed as \"anti-competitive.\"\r\n<br />\r\n\r\n<br />\r\nApple's in-app purchasing system has been at the center of scrutiny ever since game developer <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, in August of last year, avoided Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> policy by implementing a direct payment method in its hit game Fortnite. Apple's current ‌App Store‌ policy bans developers from allowing users to use payment methods other than the platform's, which gives Apple a 15% to 30% commission on all digital purchases made.\r\n<br />\r\n\r\n<br />\r\nApple has defended its system in the wake of the controversy, saying that it protects users from fraud and potential scams and offers developers an easy way to charge users for services and products without a need for significant overhead.\r\n<br />\r\n\r\n<br />\r\nThe bill has gained increasing support in the past few weeks, including from the Coalition for App Fairness. The coalition consists of ‌Epic Games‌, Spotify, developers, and vocal anti-Apple critics taking issue with how Apple operates its ‌App Store‌ and the nature of its products. <a href=\"https://www.macrumors.com/2021/08/03/south-korean-app-store-bill-gaining-support/\">Earlier this month</a>, the head of the coalition met with lead South Korean officials to lend their support for the bill.\r\n<br />\r\n\r\n<br />\r\nIt remains unclear how Apple and Google will respond or adjust their app marketplaces in South Korea once the bill does pass. Apple utilizes a single ‌App Store‌ policy for all the countries in which the ‌App Store‌ operates. Unless the company offers developers in South Korea a different set of rules, which could be a slippery slope for international developers, the company may be forced to alter its ways globally. \r\n<br />\r\n\r\n<br />\r\nIn brief remarks to reporters on Thursday, Han Sang-hyuk, the chairman of South Korea's Communications Commission, said his committee and colleagues are \"fully aware of the concerns of Apple and Google\" and that South Korea will work with both companies to implement the bill.\r\n<br />\r\n\r\n<br />\r\nApple charges all developers a $99 annual fee to be registered developers on its platforms. The company's commission charge for in-app purchases is one of just a few ways it collects revenue from the ‌App Store‌. For the third quarter of this year, Apple recorded an all-time revenue record for its services business, including the ‌App Store‌ of <a href=\"https://www.macrumors.com/2021/07/27/apple-services-revenue-q3-2021/\">$17.5 billion</a>.\r\n<br />\r\n\r\n<br />\r\nLast week, <a href=\"https://www.macrumors.com/2021/08/26/app-store-changes-developer-lawsuit-settlement/\">Apple settled with developers</a> to changes to the ‌App Store‌, including a change in ‌App Store‌ policy that will allow developers to email users about payment methods available outside of the platform. The updated policy allows users to opt into communication from developers informing them of payment methods outside the platform, bypassing the need for developers to give Apple a 30% commission.\r\n<br />\r\n\r\n<br />\r\nCritics of the ‌App Store‌ have called the new policy a minimal change in the overall scheme of the ‌App Store‌. Spotify's chief legal officer,  Horacio Gutierrez, <a href=\"https://twitter.com/SpotifyNews/status/1431324197691793410\">said</a> that Apple's new policy fails to \"address the most basic aspects of their anticompetitive and unfair ‌App Store‌ practices.\" Gutierrez goes on to say that Apple is \"attempting to distract policymakers and regulators and slow down the momentum that’s building around the world to address their behavior.\"<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/south-korea/\">South Korea</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/30/south-korea-delays-apple-google-bill/\">South Korea Delays Bill That Would Ban Apple From Requiring Developers to Use In-App Purchase System</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/south-korea-delays-bill-that-would-ban-apple-from-requiring-developers-to-use-in-app-purchase-system.2309185/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZaCh02MDJv8:4Ww1G9esQls:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZaCh02MDJv8:4Ww1G9esQls:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ZaCh02MDJv8\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d0bae8f2b2149cbe22a9d592775b1bb7a3efaba9b2610767489eb43935db2a98","category":"Apple"}