{"title":"ELONGATED HYPOCOTYL 5a modulates FLOWERING LOCUS T2 and gibberellin levels to control dormancy and bud break in poplar","link":"https://academic.oup.com/plcell/article/36/5/1963/7589257?rss=1","date":1706140800000,"content":"<span><div>Abstract</div>Photoperiod is a crucial environmental cue for phenological responses, including growth cessation and winter dormancy in perennial woody plants. Two regulatory modules within the photoperiod pathway explain bud dormancy induction in poplar (<span>Populus</span> spp.): the circadian oscillator <span>LATE ELONGATED HYPOCOTYL 2</span> (LHY2) and <span>GIGANTEA-like</span> genes (<span>GIs</span>) both regulate the key target for winter dormancy induction <span>FLOWERING LOCUS T2</span> (<span>FT2</span>). However, modification of <span>LHY2</span> and <span>GIs</span> cannot completely prevent growth cessation and bud set under short-day (SD) conditions, indicating that additional regulatory modules are likely involved. We identified PtoHY5a, an orthologs of the photomorphogenesis regulatory factor <span>ELONGATED HYPOCOTYL 5</span> (HY5) in poplar (<span>Populus tomentosa</span>), that directly activates <span>PtoFT2</span> expression and represses the circadian oscillation of <span>LHY2</span>, indirectly activating <span>PtoFT2</span> expression. Thus, <span>PtoHY5a</span> suppresses SD-induced growth cessation and bud set. Accordingly, <span>PtoHY5a</span> knockout facilitates dormancy induction. <span>PtoHY5a</span> also inhibits bud-break in poplar by controlling gibberellic acid (GA) levels in apical buds. Additionally, PtoHY5a regulates the photoperiodic control of seasonal growth downstream of phytochrome PHYB2. Thus, PtoHY5a modulates seasonal growth in poplar by regulating the PtoPHYB2–PtoHY5a–PtoFT2 module to determine the onset of winter dormancy, and by fine-tuning GA levels to control bud-break.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"d0c1afe40a8b78437e3b3e031a5bff10dc5832362b66d21c5bd74e82f355e4bb","category":"Environment"}