{"title":"What does effective population size tell us about loss of allelic variation?","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13733?af=R","date":1718953200000,"content":"<h2>Abstract</h2>\n<p>There are two primary measures of the amount of genetic variation in a population at a locus: heterozygosity and the number of alleles. Effective population size (<i>N</i>\n<sub>e</sub>) provides both an expectation of the amount of heterozygosity in a population at drift-mutation equilibrium and the rate of loss of heterozygosity because of genetic drift. In contrast, the number of alleles in a population at drift-mutation equilibrium is a function of both <i>N</i>\n<sub>e</sub> and census size (<i>N</i>\n<sub>C</sub>). In addition, populations with the same <i>N</i>\n<sub>e</sub> can lose allelic variation at very different rates. Allelic variation is generally much more sensitive to bottlenecks than heterozygosity. Expressions used to adjust for the effects of violations of the ideal population on <i>N</i>\n<sub>e</sub> do not provide good predictions of the loss of allelic variation. These effects are much greater for loci with many alleles, which are often important for adaptation. We show that there is a linear relationship between the reduction of <i>N</i>\n<sub>C</sub> and the corresponding reduction of the expected number of alleles at drift-mutation equilibrium. This makes it possible to predict the expected effect of a bottleneck on allelic variation. Heterozygosity provides good estimates of the rate of adaptive change in the short-term, but allelic variation provides important information about long-term adaptive change. The guideline of long-term <i>N</i>\n<sub>e</sub> being greater than 500 is often used as a primary genetic metric for evaluating conservation status. We recommend that this guideline be expanded to take into account allelic variation as well as heterozygosity.</p>","author":"Fred W. Allendorf, \nOla Hössjer, \nNils Ryman","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"d0c7517c3a0853f4d390daed960ee17a12692670960e3b40be4ff5ee1c46fe79","category":"Environment"}