{"title":"Available satellite data for monitoring small and seasonally flooded wetlands in semi‐arid environments of southern Africa","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2605?af=R","date":1705476137000,"content":"<h2>Abstract</h2>\n<p>Time-series monitoring of wetland eco-hydrological dynamics using remote sensing continues to be an attractive and practical tool, mainly due to its ability to overcome challenges related to in situ data availability. However, acquiring seamless and cloud-free data for accurate and routine wetlands monitoring remains a persistent challenge. In this study, we aimed to evaluate the availability of satellite scenes in the Google Earth Engine (GEE) catalogue that could facilitate the monitoring of eco-hydrological dynamics in small and seasonally flooded wetlands within the semi-arid environments of southern Africa. The study covered a 20-year period from 2000 to 2020, with a specific focus on the Nylsvley floodplain as a case study. The study conducted a comprehensive assessment of available products on the GEE platform, including Landsat Thematic Mapper (TM), Enhanced Thematic Mapper Plus (ETM+), Operational Land Imager (OLI), Sentinel-1 and Sentinel-2. The identified images underwent rigorous filtering and screening based on varying cloud-cover percentages (0%, 1%–10%, 11%–25% and 26%–50%). The results revealed a considerable number of satellite products (1376) available for the study period. Specifically, there were 492 Landsat images, 394 Sentinel-1 images and 490 Sentinel-2 images. Amongst these, Sentinel-2 and Landsat-7 had the highest number of images (69% and 76%, respectively) with cloud-cover percentages ranging from 0% to 20%. However, images with cloud cover exceeding 26% were excluded from the analysis. Further analysis indicated that using satellite images with 0% cloud cover resulted in an overall accuracy (OA) ranging between 69% and 72%, while 1%–10% cloud cover had an OA ranging between 68% and 70%, and 11%–25% cloud cover had an OA ranging between 69% and 80.55% for both the dry and wet seasons. Overall, the classification results demonstrated satisfactory OAs (68%–82%) for all scenes, with some inaccuracies observed for certain classes, notably bare surface and long grass. These inaccuracies were particularly evident when using Landsat-7 scenes, attributable to the spatial resolution of the data. The findings emphasised the availability of a substantial amount of archival satellite data, capable of monitoring small and seasonally flooded wetlands, providing valuable insights into the eco-hydrological dynamics of these ecosystems. Moreover, the study highlighted the benefits of cloud-computing platforms like GEE in addressing challenges associated with big data filtering, processing and analytics, thereby enhancing environmental monitoring and assessments, which may have been limited by the unavailability of advanced processing tools and seamless cloud-free data.</p>","author":"Siyamthanda Gxokwe, \nTimothy Dube, \nDominic Mazvimavi","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"d0cddc9da664f04051bae59689e91efd86d6098df30154836cd14186b1e85f97","category":"Environment"}