{"title":"Spotlight: Trek Voda Ice water bottles pack insulation and big capacity","link":"https://cyclingtips.com/2021/10/spotlight-trek-voda-ice-water-bottles-pack-insulation-and-big-capacity/","date":1634917675000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-1-650x366.jpg\" /></div><h2>Spotlight: Trek Voda Ice water bottles pack insulation and big capacity</h2><p>\n</p><figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-1-1340x754.jpg\" /><figcaption>Seriously, it’s big.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-2-1340x754.jpg\" /><figcaption>Whereas the smaller size of the Trek Voda Ice insulated water bottle (right) holds a more typical 591 mL (20 oz), the “big guy” (left) bumps that figure up to 828 mL (28 oz). If you regularly find yourself drinking a bottle and a half, here’s your solution!</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-3-1340x754.jpg\" /><figcaption>The one-way valve keeps stuff from spilling all over your bike without you having to manually open and close the top.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-4-1340x754.jpg\" /><figcaption>The grip ring is honestly pretty grippy.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-5-1340x754.jpg\" /><figcaption>You can still manually open and close the top every time you take a swig if you prefer, but why would you?</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-Voda-Ice-water-bottle-6-1340x754.jpg\" /><figcaption>The silicone rubber top is easy to remove for thorough cleaning, which is good because you’d be amazed at how disgusting things can get inside there otherwise.</figcaption></figure></li></ul></figure>\n\n\n\n<p>Trek’s new Voda Ice water bottle challenges the notion that you need to give up carrying capacity if you want insulation to keep things cold (or from freezing in winter conditions). Whereas most insulated bottles top out at the usual 700 mL (24 oz) — or reduce the capacity to keep the same overall exterior size — the Voda Ice is offered in the usual 591 mL (20 oz) size, but also a thirst-quenching 828 mL (28 oz) monster.</p>\n\n\n\n<p>The embedded insulating sleeve is said to “keep water cold twice as long as a traditional bottle”, and Trek has fitted the screw-top cap with a self-sealing one-way valve (similar to what’s offered by Camelbak, Specialized, and Polar Bottle) so you don’t have to bother with manually opening and closing the nozzle during a ride. That nozzle is easily removed for thorough washing, too.</p>\n\n\n\n<p>The tapered shape and stepped-down neck fits nicely in every cage I’ve tried so far, there’s also a grippy ring around the midsection to provide a surer hold, and Trek says the BPA-free plastic won’t leach endocrine system-disrupting chemicals into your water during a ride. However, as is the case with other insulated bottles I’ve tried, all that extra stuff inside makes the Voda harder to squeeze than non-insulated bottles.</p>\n\n\n\n<p>The same updated top is also offered in a conventional non-insulated version called the Voda Flow, in the usual 769 mL (26 oz) and 621 mL (21 oz) sizes.</p>\n\n\n\n<p>And finally, there’s now a tiny 444 mL (15 oz) size of the standard Voda made for kid bikes (I’m personally quite fond of the French bulldog graphic) or adult-sized full-suspension mountain bikes where space is at a premium.</p>\n\n\n\n<p><strong>Price:</strong> US$9-24 / AU$20-35 / £19-25 (Voda Ice only) / €20-24 (Voda Ice only).</p>\n\n\n\n<p><strong>Weight: </strong>124 g (Voda Ice, small size); 151 g (Voda Ice, large size)</p>\n\n\n\n<p><strong>More information</strong>: <a href=\"https://www.trekbikes.com/us/en_US/search/?text=voda\" target=\"_blank\">www.trekbikes.com</a>.</p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Follow the link to see previous products we’ve reviewed in our <a href=\"//cyclingtips.com/tag/spotlight/”\">Spotlight series</a>.</em></p>\n\n\n    </div>\n    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/10/spotlight-trek-voda-ice-water-bottles-pack-insulation-and-big-capacity/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d0cf27cf1da4b46e3ed634b79412a4563b24215b9b0520f50b77fe0801859bc9","category":"Cycling"}