{"title":"Impact of Shaking Exercise on Functional Recovery in Patients with Chronic Post-Stroke Upper Limb Paralysis: A Multicenter, Open-Label, Quasi-Randomized Controlled Trial","link":"https://www.preprints.org/manuscript/202405.1694/v1","date":1716789022000,"content":"Stroke causes disability and significantly affects patient quality of life. Post-stroke rehabilitation of upper limb function is crucial, as it affects daily activities and individual autonomy. Traditional rehabilitation methods often require frequent visits to specialized centers, which can be costly and challenging. This study investigated the effectiveness of a home-based self-training device, \"Kenko Yusuri,\" in improving upper limb function in patients with chronic stroke. This multicenter prospective intervention study used a quasi-randomized controlled trial design. Ninety-three outpatients from five hospitals in Japan were enrolled and assigned to either the intervention group who used the \"Kenko Yusuri\" device or the control group who underwent conventional rehabilitation. All patients received botulinum toxin type A (BoNT-A) injections to treat upper limb spasticity. The primary outcome measure was the Fugl-Meyer Assessment (FMA) of upper-extremity motor function. Secondary outcomes included the modified Ashworth scale (MAS) score, range of motion (ROM), and chronic pain assessments. The intervention group demonstrated significantly greater improvements in FMA total scores than the control group. Patients with moderate paralysis experienced the greatest benefits from the intervention. There were no significant between-group differences in MAS scores or ROM measurements. Pain and wrist ROM showed improvement in the intervention group. Home-based training with a shaking device significantly improved upper limb function in patients with moderate chronic post-stroke paralysis. This approach aligns with the principles of use-dependent plasticity and offers a feasible and cost-effective alternative to traditional rehabilitation methods.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d0decabe9cf8b14332568969219b918f17a0f7d3e57bf1e6830f115c87533e2c","category":"Interdisciplinary"}