{"title":"Climate Model Simulations of the Effects of Orbital Parameters on Glacier Equilibrium Line Altitude","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004779?af=R","date":1711620042000,"content":"<h2>Abstract</h2>\n<p>The effects of obliquity and precession on conditions favorable for Northern Hemisphere glaciation are explored using an energy balance and mass balance model of equilibrium line altitude (ELA), the height on a glacier where accumulation and ablation are in balance annually. Climate forcing for the ELA model is obtained from idealized single-forcing orbital simulations with two atm-ocean general circulation models, Geophysical Fluid Dynamics Laboratory (GFDL) CM2.1 and National Center for Atmospheric Research (NCAR) Community Earth System Model version 1.2. Over Scandinavia and Baffin Island, the respective locations in which the Scandinavian and Laurentide ice sheets are thought to have originated, low obliquity and perihelion at the boreal winter solstice are associated with lower ELA values, as would be expected from the orbital theory of the ice ages. Linear reconstructions of ELA variations over the past 800 kyr indicate that precession dominated ELA variations in Scandinavia and Baffin Island in the GFDL model, and in Scandinavia in the NCAR model. Obliquity and precession played equal roles in Baffin Island in the NCAR model. A decomposition of the ELA responses finds that the effects of ablation on ELA are much larger than the effects of precipitation. Overall, the findings of this study point to precession being a more important factor in glacial inception than obliquity, which contrasts with previous findings in which obliquity had a slightly larger effect on positive degree days (PDDs), a simple metric for ablation. This is likely due to differences in seasonality of melt from the ELA model and PDDs.</p>","author":"G. R. O’Neill, \nA. J. Broccoli","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"d0e6b6551948ef905fc05bce4da0a42a64f88006a70de8a9a32ab448619ca0a0","category":"Environment"}