{"title":"Structure of Spectral Composition and Synchronization in Human Sleep on the Whole Scalp: A Pilot Study","link":"https://www.preprints.org/manuscript/202408.1577/v1","date":1724243282000,"content":"We used numerical methods to define the normative structure of the different stages of sleep and wake (W) in a pilot study of 19 subjects without pathology (18–64 years old) using a double-banana bipolar montage. Artefact-free 120–240 s epoch lengths were visually identified and divided into 1 s windows with a 10% overlap. Differential channels were grouped into frontal, parieto-occipital, and temporal lobes. For every channel, the power spectrum (PS) was calculated via fast Fourier transform and used to compute the areas for the delta (0–4 Hz), theta (4–8 Hz), alpha (8–13 Hz), and beta (13–30 Hz) bands, which were log-transformed. Furthermore, Pearson’s correlation coefficient and coherence by bands were computed. Differences in logPS and synchronization from the whole scalp were observed between the sexes for specific stages. However, these differences vanished when specific lobes were considered. Considering the location and stages, the logPS and synchronization vary highly and specifically in a complex manner. Furthermore, the average spectra for every channel and stage were very well defined, with phase-specific features (e.g., the sigma band during N2 and N3, or the occipital alpha component during wakefulness), although the slow alpha component (8.0–8.5 Hz) persisted during NREM and REM sleep. The average spectra were symmetric between hemispheres. The properties of K-complexes and the sigma band (mainly due to sleep spindles – SSs) were deeply analysed during the NREM N2 stage. The properties of the sigma band are directly related to the density of SSs. The average frequency of SSs in the frontal lobe was lower than that in the occipital lobe. In approximately 30% of patients, SSs showed bimodal components in anterior regions. qEEG can be easily and reliably used to study sleep in healthy subjects and patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d0ea1ae799ea1f3746da4b7534448df5785dbc15d83d5685266a9f65d72d64d2","category":"Interdisciplinary"}