{"title":"A Method to Estimate Climate Drivers of Maize Yield Predictability Leveraging Genetic-by-Environment Interactions in the US and Canada","link":"https://www.preprints.org/manuscript/202403.0999/v1","date":1710750354000,"content":"Throughout history, the pursuit of diagnosing and predicting crop yields has evidenced genetics, environment, and management practices' intertwined roles in achieving food security. However, the sensitivity of crop phenotypes and genetic responses to weather and climate remains unclear, hampering the identification of the underlying abilities of plants to adapt to climate change. We hypothesize that the PAWN global sensitivity analysis (GSA) coupled with a genetic by environment (GxE) model -built of environmental covariance and genetic markers structures- can evidence the contributions of climate on the predictability of maize yields in the U.S. and Ontario, Canada (US-CA). The GSA-GxE modeling framework estimates the relative contribution of climate variables such as solar radiation, temperature, rainfall, and relative humidity on improving maize yield predictions in US-CA. We use an improved version of the Genomes to Fields (G2F) initiative multi-dimensional database to build the environmental covariance matrices for the proposed GSA-GxE framework. The PAWN indices show that the aggregated GxE model’s highest sensitivity levels over US-CA were attributed to solar radiation, temperature, rainfall, and relative humidity. In one-third of the locations, rainfall was the primary climate variable responsible for maize yield predictability. Also, a consistent pattern of top sensitivity indices by location indicates that Relative Humidity, Solar Radiation, and Temperature were distributed as the main or the second most relevant drivers of maize yield predictability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d0f52bccf95961632ac46fb931f2714aa8bc0fc2fc2ee585dae64134d59a33ce","category":"Interdisciplinary"}