{"title":"Niche breadth and divergence in sympatric cryptic coral species (Pocillopora spp.) across habitats within reefs and among algal symbionts","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13762?af=R","date":1722582000000,"content":"<h2>Abstract</h2>\n<p>While the presence of morphologically cryptic species is increasingly recognized, we still lack a useful understanding of what causes and maintains co-occurring cryptic species and its consequences for the ecology, evolution, and conservation of communities. We sampled 724 <i>Pocillopora</i> corals from five habitat zones (the fringing reef, back reef, and fore reef at 5, 10, and 20 m) at four sites around the island of Moorea, French Polynesia. Using validated genetic markers, we identified six sympatric species of <i>Pocillopora</i>, most of which cannot be reliably identified based on morphology: <i>P. meandrina</i> (42.9%), <i>P. tuahiniensis</i> (25.1%), <i>P. verrucosa</i> (12.2%), <i>P. acuta</i> (10.4%), <i>P. grandis</i> (7.73%), and <i>P.</i> cf. <i>effusa</i> (2.76%). For 423 colonies (58% of the genetically identified hosts), we also used <i>psbA</i>\n<sup>ncr</sup> or ITS2 markers to identify symbiont species (Symbiodiniaceae). The relative abundance of <i>Pocillopora</i> species differed across habitats within the reef. Sister taxa <i>P. verrucosa</i> and <i>P. tuahiniensis</i> had similar niche breadths and hosted the same specialist symbiont species (mostly <i>Cladocopium pacificum</i>) but the former was more common in the back reef and the latter more common deeper on the fore reef. In contrast, sister taxa <i>P. meandrina</i> and <i>P. grandis</i> had the highest niche breadths and overlaps and tended to host the same specialist symbiont species (mostly <i>C. latusorum</i>). <i>Pocillopora acuta</i> had the narrowest niche breadth and hosted the generalist, and more thermally tolerant, <i>Durusdinium gynnii</i>. Overall, there was a positive correlation between reef habitat niche breadth and symbiont niche breadth—<i>Pocillopora</i> species with a broader habitat niche also had a broader symbiont niche. Our results show how fine-scale variation within reefs plays an important role in the generation and coexistence of cryptic species. The results also have important implications for how niche differences affect community resilience, and for the success of coral restoration practices, in ways not previously appreciated.</p>","author":"Scott C. Burgess, \nAlyssa M. Turner, \nErika C. Johnston","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"d0fb71ed9cba0396812c7c8f1e8f95678323096aa71d876fd2bd3fbf03e907a5","category":"Environment"}