{"title":"Some lucky people have already seen Apple’s AR headset–and they don’t like it","link":"https://www.macworld.com/article/1672293/apple-ar-headset-division-dissension.html","date":1679975505000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last week, according to leaker Mark Gurman and others, Apple held a glitzy showcase event where its 100 most influential employees got to see the latest progress of the mixed-reality headset project. This project is expected to culminate in a public launch later this year, likely at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> in June, which means the showcase event should have had an air of both finality and celebration–but it appears this was not entirely so.</p>\n\n\n\n<p>Discussing the behind-closed-doors event in the latest edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-03-26/apple-reality-headset-details-pro-features-top-100-meeting-watch-like-start-lfpgdgdb&amp;xcust=1-1-1672293-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, Gurman explained that Apple has run secret internal demos of the headset every year since 2018, but that this one was different: it was grander and more polished, essentially, taking place in the same Steve Jobs Theatre as far higher-profile public announcements. This is likely because the device and the event are close to completion after numerous delays—and because the pitch is a large part of what will make the headset successful.</p>\n\n\n\n<p>For all the glitz and glamor, however, it is evident from Gurman’s account and particularly from a more critical <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/2023/03/26/technology/apple-augmented-reality-dissent.html&amp;xcust=1-1-1672293-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">parallel report</a> in the New York Times that all is not well in the Apple camp. “As the company prepares to introduce the headset in June,” writes the NYT, citing the testimony of multiple current and former employees, “enthusiasm at Apple has given way to skepticism.” The paper names the high $3,000 price, and the debatable usefulness and marketability of the product as key concerns, and reports that some members of staff have been so doubtful of the project’s viability that they have defected to different parts of the business, while others have been fired for “lack of progress with some aspects of the headset, including its use of Apple’s Siri voice assistant.”</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/3758278_original.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Gold\" loading=\"lazy\" /><figcaption><p>The original Apple Watch wasn’t a hit out of the gate, but its lavish solid-gold model got a lot of attention.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Gurman, more tactfully, describes Apple executives as being “clear-eyed about Apple’s challenges pushing into this new market,” and says they are “striking a realistic tone within the company. This isn’t going to be a hit product right out of the gate.”</p>\n\n\n\n<p>Reports of skepticism and disagreement related to Apple’s headset are not new. Earlier this month we covered claims that Apple designers lobbied to postpone the headset’s launch until the technology became more advanced and that Tim Cook <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">overruled these concerns</a> and insisted on a launch this year. A glance at a calendar alone, indeed, would give clues to long-running problems: Apple has been talking up its interest in AR and VR <a href=\"https://www.macworld.com/article/228893/tim-cook-augmented-reality-will-be-an-essential-part-of-your-daily-life-like-the-iphone.html\">since at least 2016</a> but has yet to launch any actual hardware for this market. It’s relevant, perhaps, that even back in 2016 Cook was careful to point out that “there are some really hard technology challenges” and to warn that it would take some time for AR to become “acceptable,” a cautious caveat for a potentially business-changing product category.</p>\n\n\n\n<p>Gurman discusses the idea that the so-called Reality Pro mixed-reality headset could follow the same path as the Apple Watch, by which he means an intriguing but low-profit launch followed by improved and cheaper follow-up versions and a gradual evolution towards an eventual market niche. It took the Apple Watch several generations to find its purpose as a health and fitness device, something which wasn’t clear when it arrived with a $10,000 gold option. </p>\n\n\n\n<p>Gurman may be right about this, and it’s always risky to underestimate Apple’s powers of marketing. But such a feat would be far more impressive this time around because the headset will be so much more novel than a smartwatch and much more ostentatious and uncomfortable to wear. It’s much harder to sell early adopters on the potential of an experimental new device if it costs $3,000, too, which means there will be fewer models in the wild to seed the curiosity of the next generation of customers.</p>\n\n\n\n<p>If we’re not convinced, we can usually count on Apple’s hype engine to tell us why we’re wrong. But if Apple’s own employees can’t see through the reality distortion field, it’s a worrying sign for a company that is normally so good at putting out a consistent and enthusiastic message.</p>\n\n\n\n<p>Keep up with the latest news and rumors with our regularly updated guide to <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Apple’s mixed-reality headset</a>.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d0fead17ea33543fad07f22e71b961f7104dbb6c13d55d2e23d98018b0abe5ce","category":"Apple"}