{"title":"Squid Bikes Took their Gravtron Gravel Bikes from Reno to Sacramento – Emily Kachorek & Zack Cunningham","link":"https://theradavist.com/2021/08/squid-bikes-took-their-gravtron-gravel-bikes-from-reno-to-sacramento/?utm_source=rss&utm_medium=rss&utm_campaign=squid-bikes-took-their-gravtron-gravel-bikes-from-reno-to-sacramento","date":1629720016000,"content":"<p><em>Today we’ve got a special bit of Reportage from the crew at Squid Bikes showcasing their new handmade in Taiwan steel gravel model, the <a href=\"https://www.squidbikes.com/products/gravtron\" target=\"_blank\">Gravtron</a>. Read on below for a look at the owners’, Chris and Emily, personal Gravtron builds as well as a friend Nick’s bike loaded down for a trip from Reno to Sacramento with a trip report by Emily. Check it out below!</em></p>\n<p><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/RNO2SMF__24.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>On a Thursday morning in late June, a group of us met at a deli in downtown Sacramento, grabbed sandwiches for the trip, and caught the 11:00 am Amtrak to Reno, NV. Five hrs later we rolled our loaded Gravtrons off the train – a bit later and with a few more thunderheads in the sky than expected.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/ChrisGravtron_01.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/EmGravtron_01.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Since we launched Squid in 2014, ‘gravel’ riding has become a thing. Our cyclocross bike, the SquidCross, is more than capable of handling off-road riding, and while the SquidCross has certainly had bags strapped to it and been used for bike packing trips, we were interested in making a frame that was designed specifically for long days on endless dirt roads and weekend packing adventures.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/NickGravtron_01.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We designed our newest frame, the Gravtron, to be capable of navigating chunky gravel descents, cutty single-track as well as being able to carry all the gear and water you’ll need for a bikepacking adventure. It has plenty of clearance for beefy tires with either 700c or 650b wheelsets, and it’s nimble enough to hop in your local cyclocross race. We also wanted to hit a price point that’s a bit more accessible when compared to our domestically manufactured frames.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/EmGravtron_18.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/EmGravtron_14.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With delays across the world from COVID-19, we had been anxiously awaiting the delivery of the Gravtrons for a bit. We waited so long that we, somewhat selfishly, decided to have a few pulled pre ED coating and have them airmailed to us in California. What better way to test out the new model than by getting them loaded up, jumping on a train, and riding back home!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/RNO2SMF__46.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The route out of Reno took us through the city, along the Truckee River into Verdi, NV. It was all dirt from there, up Henness Pass and across Stampede Meadows to our first campsite at Boca Reservoir. The evening was damp but nobody seemed to care, we were all excited about being in the mountains and the days ahead.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/RNO2SMF__43.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The second day we traversed 56 miles up, down, and literally through mountains. Highlights included riding Donner Pass by way of the abandoned Donner Railroad Tunnels, a recommended stop should the opportunity present itself. The tunnels were primarily built by the Chinese, whose labor allowed the first railroad to traverse the Sierra Nevada mountain range. The tunnels are dark, cool, damp, and filled with colorful paintings. Along the route, we stopped at Soda Springs for some last-minute snacks and libations that we happily carried over a few more passes before an evening dip at French Meadows Reservoir.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/RNO2SMF__57.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Temperatures were smoking hot by the third day. We cheered on the Western States 100 runners when our route crisscrossed theirs. We even managed to score a very large bottle of Chardonnay from fellow campers to celebrate the day.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/RNO2SMF__49.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Our last day back home to Sacramento was the longest of the route, just under 90 miles and, thankfully, net downhill. We stopped for sandwiches in Foresthill and for multiple dips in the American River before rolling the bikes through our front doors, dirty, happy, and with all our gear still firmly attached to our new bikes.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/NickGravtron_17.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>About the Gravtron:</strong></p>\n<p>$1300 – ED Coated Frameset with Decal set<br />\n$1450 – Spray To Order Frameset</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/EmGravtron_16.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Specs:</strong><br />\n4130 double butted front triangles<br />\n68mm PF30 BB Shell<br />\n142×12 Rear Thru Axle<br />\nFlat mount disc brakes<br />\nInternal routing<br />\nTapered 34/44 Headtube<br />\n700x40c / 650x55c Tire Clearance<br />\n27.2 Seatpost<br />\n30.0 Seat Collar<br />\nWhisky MCX Carbon Fork<br />\nWhite Industries Headset<br />\nParagon Machine Works Thru Axle<br />\nCargo mounts on down-tube and fork blades<br />\nHandmade in Taiwan</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/ChrisGravtron_09.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Frameset Comes With:</strong><br />\n30.0 Seat Collar<br />\nWhisky MCX Carbon Fork<br />\nWhite Industries Headset<br />\nFront and Rear Thru Axles</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/ChrisGravtron_03.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Geometry:</strong></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/GravtronGeo-Sheet1-01_920x.jpeg?\" /></p>\n<p>See more about the Gravtron at <a href=\"https://www.squidbikes.com/products/gravtron\" target=\"_blank\">Squid Bikes</a>!</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"d11026348037822d90de4e08b88fdfb371a3465cab317a9c9580724dd6db45e9","category":"Cycling"}