{"title":"Giro Donne: The art of Elisa Longo Borghini and Gaia Realini","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-donne-the-art-of-elisa-longo-borghini-and-gaia-realini","date":1688302800000,"content":"\n      <p><em><span>This article was originally published in Italian at <a href=\"https://www.rouleur.it/pages/rouleur-italia-home\">Rouleur Italia</a></span></em></p>\n<p><span>Good teamwork multiplies success, shares burdens and reduces fatigue. </span></p>\n<div></div>\n<p><span>This is the philosophy I could take away from my interview with Elisa Longo Borghini and Gaia Realini (Lidl-Trek), two of the strongest athletes in the women’s peloton.</span></p>\n<p><span>Both Italians are competing in their biggest home race, the Giro Donne, which started last Friday. The race consists of nine stages and the route is so varied that it offers exciting and engaging opportunities for both of them.</span></p>\n<p><span>Longo Borghini and Realini arrived in Chianciano Terme, the starting point of this year's Giro Donne, full of confidence with knowledge that they can go well here. In their eyes and through their words during our interview the day before the first stage, you could feel the energy typical of people chasing a dream, both full of enthusiasm and determination, capable of influencing everyone around them but at the same time conveying calm.</span></p>\n<p><span>“I'm not on holiday here,” Longo Borghini began, “I take every race very seriously, this is my job, and even though my main goal is the Tour de France Femmes in less than a month, that doesn't mean we should underestimate the Giro Donne. I will try to ride my best, as always. I’m looking forward to the two stages in Piedmont, for example, the region where I grew up and where I will have my family cheering for me, it will be special.”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_6290.jpg?v=1688376896\" alt /><br /><i><span>Photo by Alex Whitehead/SWpix.com</span></i></p>\n<p>Since its inception in 1988, the Giro Donne has been a key event in the women's racing calendar. It is one of the most important stage races in the world and has a special meaning for all the athletes in the race, particularly for the Italians in the peloton. For them, it represents their home race, a chance to perform in front of their supporters and among the landscapes of their hearts. For Longo Borghini, at her 12th Giro Donne and her third as national champion, the race once again has an exceptional meaning. </p>\n<p><span>“The Tricolore powers me up, it works as an energy booster,” she said. “Not everyone, perhaps, will know my name along the way, but wearing the jersey in the colours of the Italian flag is iconic in itself and will certainly bring some extra cheer and power. One of the best days of my life, for example, was at the Giro Donne, at the finish of the stage of Mortirolo, in 2016. I came second that day, but I did a killer sprint, one of the best moments of my career if I think back… and from which I learnt to enjoy and appreciate every single moment, in and out of the race, without overthinking too much.”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-05788_3b12b9cd-f900-411d-b370-0d42b3b0e2b6.jpg?v=1688376978\" alt /><br /><i><span>Photo by Alex Whitehead/SWpix.com </span></i></p>\n<p>If it takes two flints to light a fire, Lidl-Trek arrives on the starting line in Chianciano with a team that shines its own light, with so many lapilli ready to blaze. Lizzie Deignan, Shirin Van Anrooij and Elisa Longo Borghini could all be possible contenders for the general classification. Although Lidl-Trek has not yet decided who will be the race leader for the maglia rosa ahead of the race, Longo Borghini insisted it was a positive for the team. </p>\n<p><span>“This is not a bad thing, it is quite pleasant indeed”, she explained. “We can share the pressure among several riders and this also means we have more cards to play within the team, which takes away a lot of responsibility.”</span></p>\n<p><span>Lizzie Deignan's return from maternity leave is seen in a particularly positive light by the newly crowned Italian champion. “Lizzie brings the confidence, calm and good vibes that we need. She is an extraordinary cyclist, and super reliable. She gives me the peace of mind I need to ride at my best.”</span></p>\n<p><span>The team is bonded and united, and each rider has a companion who acts as a bit of a reference point, a source of calmness and at the same time a source of energy, the best condition to face Giro Donne stage by stage. And Longo Borghini represents just such a fulcrum of energy and good vibrations for Realini. There is no more explosive couple in modern women's cycling right now. </span></p>\n<p><span>When I ask Realini who her favourite rider was as a child, she replies: “Everyone compared me to [Marco] Pantani, because of my climbing skills and my petite physique. But my hero growing up was always Elisa Longo Borghini. To race for a team like Lidl-Trek alongside her who has been my inspiration for years, well it is a dream. Elisa in particular gives me the grit and calm I need to handle the tension during the race in the best possible way.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1507107327.jpg?v=1688377137\" alt /><i><span>Photo by Getty Images</span></i></span></p>\n<p>Realini, who joined the team Lidl-Trek just a few months ago, has collected one success after another since the start of the season including first place at the Trofeo Oro In Euro, second place overall at the UAE Tour, third place at the Flèche Wallonne, and the U23 title at the Italian National Championships road race. Her crowning glory so far came at the Vuelta a España Femenina however, beating the world champion Annemiek Van Vleuten (Movistar) to take a beautiful stage victory.</p>\n<p><span>It’s a progression that Realini herself did not expect. When I ask her if the increase in popularity has affected her private life in any way, she answers with a maturity that almost surprises me considering she is only 22. “The media are part of my job, it's something I had foreseen,” she said. “It doesn't affect my concentration. I have my feet on the ground. If I win I enjoy the moment, that's clear, but I tend to think immediately about the next goal. At the Giro Donne, I enter on tiptoes, as a way to improve myself and my skills and gain experience for the future. I am grateful to the team for the trust it has given me so far and continues to give me.”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1487954312.jpg?v=1688377445\" alt /><br /> <i><span>Photo by Getty Images</span></i></p>\n<p>Cycling is a sport that requires dedication, strength and an uncompromising passion. </p>\n<p><span>The art of Elisa Longo Borghini and Gaia Realini is their unique ability to turn challenges into successes, each pedal stroke into emotions; with their passion and dedication, they keep on inspiring us all, young and old, and driving us to become the best version of ourselves.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d1104346ba487cdd2c884f91f46005d293f45087195bf67266495fda581d2b02","category":"Cycling"}