{"title":"Resource partitioning in a cetacean community from Uruguayan waters","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13077?af=R","date":1712234898000,"content":"<h2>Abstract</h2>\n<p>The study of resource partitioning within a community is central to understanding the processes that enable interspecific competition and coexistence. This study aimed to understand the resource partitioning and habitat preferences among odontocetes in Uruguay. We analyzed stable carbon and nitrogen isotopes data from the bone tissue of common dolphins (<i>Delphinus delphis</i>), Fraser's dolphins (<i>Lagenodelphis hosei</i>), false killer whales (<i>Pseudorca crassidens</i>), Lahille's bottlenose dolphins (<i>Tursiops truncatus gephyreus</i>), Burmeister's porpoises (<i>Phocoena spinipinnis</i>), and franciscana dolphins (<i>Pontoporia blainvillei</i>). Based on the isotopic values, false killer whale individuals were divided into two different ecological groups (ecotype 1 and 2). Isotopic values also suggest that franciscana dolphins, Burmeister's porpoises, Lahille's bottlenose dolphins, and false killer whales ecotype 1 feed on the continental shelf and/or high trophic level preys. At the other end of the gradient, values suggest Fraser's dolphins and false killer whales ecotype 2 use resources from the oceanic environment and/or lower trophic preys. Isotopic niche overlap was found between the common dolphin and Lahille's bottlenose dolphin and between Lahille's bottlenose dolphin and false killer whale ecotype 1. This work provides novel basic information about the trophic habit and feeding habitat of the odontocetes inhabiting one of the most important estuaries of South America.</p>\n<p>Estudiar la repartición de recursos en comunidades es central en ecología para entender los procesos de coexistencia y competencia interespecífica. Este trabajo tuvo como objetivo comprender la repartición de recursos y las preferencias de hábitat entre odontocetos de Uruguay. Se analizaron isótopos estables de carbono y nitrógeno de tejido óseo de especímenes de delfín común (<i>Delphinus delphis</i>), delfín de Fraser (<i>Lagenodelphis hosei</i>), falsa orca (<i>Pseudorca crassidens</i>), tonina (<i>Tursiops truncatus gephyreus</i>), marsopa espinosa (<i>Phocoena spinipinns</i>) y franciscana (<i>Pontoporia blainvillei</i>). En base a los valores de isotopos, los individuos de falsas orcas se dividieron en dos grupos ecológicos diferentes (ecotipo 1 y 2). Los valores isotópicos también sugieren que la marsopa espinosa, la tonina y la falsa orca ecotipo 1 se alimentan en la plataforma continental y/o sobre presas de alto nivel trófico. En el otro extremo del gradiente isotópico, los valores de la falsa orca ecotipo 2 y del delfín de Fraser sugieren que se alimentan en el ambiente oceánico y/o de presas tróficas de niveles tróficos bajos. Se encontró superposición de nicho isotópico entre el delfín común y la tonina y entre la tonina y la falsa orca ecotipo 1. Este trabajo proporciona información básica novedosa sobre el hábito trófico y el hábitat de alimentación en odontocetos que habitan uno de los estuarios más importantes de América del Sur.</p>","author":"Meica Valdivia, \nLuciano O. Valenzuela, \nVerónica Berriel, \nDiego Rodríguez, \nPaula Laporta, \nMassimiliano Drago, \nAlessandra Cani, \nLeandro Bergamino","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"d11edc6e6470a21c5e30ddc1923ba188d31d89d89625547a9e4feb95bc1cf7a3","category":"Environment"}