{"title":"Aripiprazole, but Not Olanzapine, Alters the Response to Oxida-Tive Stress, Reducing the Activation of Mitogen-Activated Protein Kinases (MAPKs) and Promoting Cell Survival in FAO Cells","link":"https://www.preprints.org/manuscript/202407.0129/v1","date":1719919391000,"content":"Chronic administration of atypical antipsychotics (AAPs) is commonly associated with in-creased cardiovascular disease load. Although the increase in weight gain and related dis-ease risk is generally considered the main contributing factor, direct interference with mi-tochondrial bioenergetics, particularly in the liver, where these drugs are catabolized, is emerging as an additional relevant contributor to metabolic disease risk that needs to be considered. In this study, we compared the effects of two AAPs with disparate metabolic profiles, olanzapine (OLA), which is obesogenic, and aripiprazole (ARI), which is not, on the response of Fao cells to oxidative stress. We found that Fao cells treated with ARI sur-vive better a challenge with H2O2 while OLA treatment has the opposite effect. This en-hanced survival is not related to a reduction in the apoptosis rate. In fact, ARI treated cells display higher apoptotic rates than control cells exposed to H2O2. Gene expression analysis of pro and anti-apoptotic factors revealed that the changes induced by H2O2 were generally dampened in ARI treated cells, but not in OLA treated cells, suggesting a reduced respon-siveness to stimuli, a notion that was consistent with a reduced activation of MAPK and STAT3 phosphorylation in response to H2O2, while OLA enhanced their activation in re-sponse to H2O2. Loss of stress response in ARI treated cells is consistent with the elevation of mitochondrial production of O2•-, a known desensitizing factor. The physiological rele-vance of the increased production of O2•- in ARI treated cells is further supported by the observed elevation of the mitophagy flux in ARI treated cells, likely related to mitochon-drial damage. An additional relevant finding was that OLA treatment protected the pro-teasome activity in Fao cells exposed to H2O2, an effect possibly related to the better preservation of stress signaling and mitochondrial function in OLA treated cells. In sum, this study highlights the underlying alterations in cell physiology derived from the inter-ference of ARI with mitochondrial function, that de-sensitize cells to stress signaling, while OLA has the opposite effect.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d121d573b31aa573c138c31476133446c7ab425f59ee96eec0c7dcf8dfe4556b","category":"Interdisciplinary"}