{"title":"Gender relations and decision-making on climate change adaptation in rural East African households: A qualitative systematic review","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000279","date":1704895200000,"content":"<p>by Johanne Niemann, Miriam El-Mahdi, Helle Samuelsen, Britt Pinkowski Tersbøl</p>\r\n\r\nBackground: Climatic changes are threatening rural livelihoods in East Africa. Evidence suggests that climate change adaptation in this context might reproduce inequitable intra-household gender relations and that adaptation may be more effective when women are involved in meaningful ways. Hence, a nuanced understanding of the gendered nature of intra-household adaptation decision-making is essential for gender-responsive research, policy-making and practice. This qualitative systematic review aimed to investigate how gender relations influence decision-making concerning climate change adaptation in rural East African households and how decisions about climate change adaptation influence intra-household gender dynamics, in turn. Applying qualitative meta-synthesis principles, systematic searches were conducted in 8 databases and supplemented with comprehensive hand searches. 3,662 unique hits were screened using predetermined inclusion criteria, leading to a final sample of 21 papers. Relevant findings of these studies were synthesised using inductive thematic coding, memoing and thematic analysis. While men tended to be the primary decision-makers, women exercised some decision-making power in traditionally female domains and in female-headed households. Women’s and men’s roles in intra-household adaptation decision-making appeared to be influenced by a plethora of interconnected factors, including gender norms, gendered divisions of labour and access, ownership and control over resources. Intra-household adaptation seemed to impact the dynamics between male and female household members. The pathways of this influence were complex, and the ultimate outcomes for men and women remained unclear. We discuss our findings with reference to theoretical literature on gender-transformative approaches in development and adaptation and previous research concerning the gendered nature of climate change adaptation in East Africa. We then discuss implications for gender-responsive adaptation interventions.","author":"Johanne Niemann","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"d13138284964c18d5781bbfdbd2c7667775da9fd5702e78cdbde013ab87e8830","category":"Environment"}