{"title":"Apple reportedly planning big iPad changes, starting with a redesigned mini","link":"https://www.macworld.com/article/348015/apple-ipad-ipad-mini-ipad-pro-bezels-home-button-wireless-charging-airpower.html","date":1622814049000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>The iPad Pro with a 12.9-inch Retina XDR display and M1 processor is barely on shelves, but we’re already hearing rumors about the next round of iPad upgrades, which should arrive in later in 2021. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-06-04/apple-working-on-ipad-pro-with-wireless-charging-new-ipad-mini&amp;xcust=1-1-348015-0-0-0&amp;sref=https://www.macworld.com/feed\">According to a new Bloomberg report</a>, Apple is looking to update the entry-level iPad and iPad mini this year and possibly bring a big change to charging on the next iPad Pro.</p>\n\n\n\n<p>Mark Gurman reports that the iPad mini is due for its first redesign in six years, with “narrower screen borders” and the possible removal of the home button. Removing the Touch ID sensor from the front of the iPad mini would likely mirror the look of the iPad Air, with the fingerprint sensor built into the power button and slim, uniform bezels. We’ve previously heard rumors that Apple was looking to revamp the iPad mini, with <a href=\"https://www.macworld.co.uk/news/ipad-mini-2021-kuo-3804252/\">the screen size growing</a> to 8.4 inches from 7.9 inches.</p>\n\n\n\n<p>Additionally, Bloomberg reports that the iPad is “also working on a thinner version of its entry-level iPad geared toward students.” Apple <a href=\"https://www.macworld.com/article/234627/ipad-8th-generation-review.html\">launched the eighth-gen iPad in late 2020</a> with an A12 Bionic processor but no other changes. The iPad and iPad mini are reportedly slated for release later this year, likely at a fall event.</p>\n\n\n\n<p>Also in development is a new iPad Pro that could have a glass back for the first time. The reason, Gurman says, would to bring the iPad Pro “closer to iPhones,” and also enable wireless charging. Wireless charging isn’t very common on tablets, but recently <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://consumer.huawei.com/ph/community/details/HUAWEI-MatePad-Pro%3A-The-first-tablet-to-support-wireless-charging-as-well-as-wireless-reverse-chargi/topicId_102102/&amp;xcust=1-1-348015-0-0-0&amp;sref=https://www.macworld.com/feed\">Huawei</a> and <a href=\"https://www.amazon.com/Fire-HD-8-Plus-tablet-and-Wireless-Charging-Dock/dp/B087F2C185?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Amazon</a> have released models that support the tech. According to the report, Apple is testing “a similar <a href=\"https://www.macworld.com/article/234834/best-magsafe-cases-chargers-accessories-iphone-12-12-pro-12-pro-max-12-mini.html\">MagSafe</a> system” as introduced with the iPhone 12, but it’s unclear whether standard Qi chargers would also be supported.</p>\n\n\n\n<p>Additionally, Apple is also experimenting wit reverse wireless charging so AirPods and Apple Watches could use the iPad to fill up. That feature was originally rumored for the iPhone 11, but it never came to pass. Finally, Bloomberg reports that Apple is still working on “a future wireless charger that works similarly” to the <a href=\"https://www.macworld.com/article/234300/apple-is-reportedly-still-working-on-airpower-for-some-reason.html\">failed AirPower charging mat</a> as well as “alternative wireless charging methods that can work over greater distances than an inductive connection.” However, that technology is likely still years away, according to the report.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d13cb9fc3f854ea1402be5f6f48ad8f6a1ab19e0f19ed6e3e01ef12e2c7666f2","category":"Apple"}