{"title":"Diversity and composition of the bacterial communities associated with the Australian spittlebugs <i>Bathyllus albicinctus</i> and <i>Philagra parva</i> (Hemiptera: Aphrophoridae)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311938","date":1728568800000,"content":"<p>by Francesco Martoni, Lea Rako, Duncan Jaroslow, Caitlin Selleck, Pragya Kant, Narelle Nancarrow, Mark J. Blacket</p>\r\n\r\nSpittlebugs and froghoppers (Hemiptera: Cercopoidea) are insects feeding on xylem, which potentially can cause significant economic damage worldwide by transmitting plant pathogenic bacteria such as <i>Xylella fastidiosa</i>. Australia and New Zealand are currently free from <i>X</i>. <i>fastidiosa</i>, but they are home to at least 45 native spittlebug species. Among these, the Australian natives <i>Bathyllus albicinctus</i> (Erichson, 1842) and <i>Philagra parva</i> (Donovan, 1805) are particularly widespread and can be found across southern and eastern Australia, with <i>B</i>. <i>albicinctus</i> also in New Zealand. The potential that both species might be capable of vectoring <i>Xylella fastidiosa</i> poses a substantial biosecurity risk if the bacterium were to invade these regions. In this study, we examined 87 spittlebug nymphs collected across 12 different host plant species, in five locations in Victoria, Australia. Our objective was to explore the factors influencing bacterial communities within and between these widespread spittlebug species, considering geographic location, insect phylogenetics, and host plant associations. We employed COI barcoding to assess insect genetic variation and 16S high throughput sequencing (HTS) metabarcoding to analyse bacterial microbiome diversity across various host plants. Our findings revealed minimal genetic divergence among spittlebug individuals in the same species, highlighting conspecificity despite conspicuous morphological divergences. On the other hand, we recorded significant variation in bacterial communities harboured by <i>Bathyllus albicinctus</i> nymphs feeding on different plants, even when these were collected within close proximity to each other. Therefore, host plant association appeared to shape the bacterial communities of spittlebugs more than insect genetic divergence or geographical location. These diverse bacterial communities could potentially facilitate transmission of plant pathogenic bacteria, underscoring the risk of widespread transmission among numerous plant hosts through insect-plant interactions. This study emphasizes the critical need to understand these complex interactions, particularly in the context of biosecurity.","author":"Francesco Martoni","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d14481222c828b6d1fb8e1fe5d75862c308c2353f93f784d3d2fa8751091d1c2","category":"Interdisciplinary"}