{"title":"Effects of plasminogen activator inhibitor-1 deficiency on bone disorders and sarcopenia caused by adenine-induced renal dysfunction in mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311902","date":1728568800000,"content":"<p>by Yuya Mizukami, Naoyuki Kawao, Takashi Ohira, Kiyotaka Okada, Hisatoshi Yamao, Osamu Matsuo, Hiroshi Kaji</p>\r\n\r\nChronic kidney disease (CKD) is a significant global health issue and often involves CKD-mineral and bone disorder (MBD) and sarcopenia. Plasminogen activator inhibitor-1 (PAI-1) is an inhibitor of fibrinolysis. PAI-1 has been implicated in the pathogenesis of osteoporosis and muscle wasting induced by inflammatory conditions. However, the roles of PAI-1 in CKD-MBD and sarcopenia remain unknown. Therefore, the present study investigated the roles of PAI-1 in bone loss and muscle wasting induced by adenine in PAI-1-deficient mice. CKD was induced in PAI-1<sup>+/+</sup> and PAI-1<sup>-/-</sup> mice by administration of adenine for ten weeks. Muscle wasting was assessed by grip strength test, quantitative computed tomography (CT) analysis and muscle weight measurement. Osteoporosis was assessed by micro-CT analysis of femoral microstructural parameters. PAI-1 deficiency did not affect adenine-induced decreases in body weight and food intake or renal dysfunction in male or female mice. PAI-1 deficiency also did not affect adenine-induced decreases in grip strength, muscle mass in the lower limbs, or the tissue weights of the gastrocnemius, soleus, and tibialis anterior muscles in male or female mice. PAI-1 deficiency aggravated trabecular bone loss in CKD-induced male mice, but significantly increased trabecular bone in CKD-induced female mice. On the other hand, PAI-1 deficiency did not affect cortical bone loss in CKD-induced mice. In conclusion, PAI-1 is not critical for the pathophysiology of CKD-MBD or CKD-induced sarcopenia in mice. However, PAI-1 may be partly related to bone metabolism in trabecular bone in the CKD state with sex differences.","author":"Yuya Mizukami","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d14c9cc9659c6d270ff98d5af821c27819165734384b911431a07b2b8a02b97d","category":"Interdisciplinary"}