{"title":"Amazon Q brings generative AI-powered assistance to IT pros and developers (preview)","link":"https://aws.amazon.com/blogs/aws/amazon-q-brings-generative-ai-powered-assistance-to-it-pros-and-developers-preview/","date":1701192635000,"content":"<p>Today, we are announcing the preview of <a href=\"https://aws.amazon.com/q\">Amazon Q</a>, a new type of generative artificial intelligence (AI) powered assistant that is specifically for work and can be tailored to a customer’s business.</p> \n<p>Amazon Q brings a set of capabilities to support developers and IT professionals. Now you can use Amazon Q to get started building applications on AWS, research best practices, resolve errors, and get assistance in coding new features for your applications. For example, Amazon Q Code Transformation can perform Java application upgrades now, from version 8 and 11 to version 17.</p> \n<p>Amazon Q is available in multiple areas of AWS to provide quick access to answers and ideas wherever you work. Here’s a quick look at Amazon Q, including in integrated development environment (IDE):</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/2023-q-dev-rev-q-dev-mashup-1-1024x380.png\" width=\"1024\" height=\"380\" /></p> \n<p><strong><u>Building applications together with Amazon Q</u></strong><br /> Application development is a journey. It involves a continuous cycle of researching, developing, deploying, optimizing, and maintaining. At each stage, there are many questions—from figuring out the right AWS services to use, to troubleshooting issues in the application code.</p> \n<p>Trained on 17 years of AWS knowledge and best practices, Amazon Q is designed to help you at each stage of development with a new experience for building applications on AWS. With Amazon Q, you minimize the time and effort you need to gain the knowledge required to answer AWS questions, explore new AWS capabilities, learn unfamiliar technologies, and architect solutions that fuel innovation.</p> \n<p>Let us show you some capabilities of Amazon Q.</p> \n<p><strong>1. Conversational Q&amp;A capability</strong><br /> You can interact with the Amazon Q conversational Q&amp;A capability to get started, learn new things, research best practices, and iterate on how to build applications on AWS without needing to shift focus away from the AWS console.</p> \n<p>To start using this feature, you can select the Amazon Q icon on the right-hand side of the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/console-1.png\" width=\"3800\" height=\"1936\" /></p> \n<p>For example, you can ask, “What are AWS serverless services to build serverless APIs?” Amazon Q provides concise explanations along with references you can use to follow up on your questions and validate the guidance. You can also use Amazon Q to follow up on and iterate your questions. Amazon Q will show more deep-dive answers for you with references.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-q-dev-rev-2-1-2-1.png\" width=\"2026\" height=\"1948\" /></p> \n<p>There are times when we have questions for a use case with fairly specific requirements. With Amazon Q, you can elaborate on your use cases in more detail to provide context.</p> \n<p>For example, you can ask Amazon Q, “I’m planning to create serverless APIs with 100k requests/day. Each request needs to lookup into the database. What are the best services for this workload?” Amazon Q responds with a list of AWS services you can use and tries to limit the answer results to those that are accurately referenceable and verified with best practices.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-q-dev-rev-3-2-1.png\" width=\"2304\" height=\"2082\" /></p> \n<p>Here is some additional information that you might want to note:</p> \n<ul> \n <li>Amazon Q conversational Q&amp;A capability is currently in preview in all commercial AWS Regions.</li> \n <li>This capability is integrated into the <a href=\"https://console.aws.amazon.com/\">AWS Management Console</a>, <a href=\"https://aws.amazon.com/console/mobile/\">AWS Console Mobile Application</a>, <a href=\"https://docs.aws.amazon.com/\">AWS Documentation</a>, <a href=\"https://aws.amazon.com\">AWS websites</a>, and Slack and Teams through <a href=\"https://aws.amazon.com/chatbot/\">AWS Chatbot</a>, making it more convenient and easier to find what you need.</li> \n</ul> \n<p><strong>2. Optimize Amazon EC2 instance selection</strong><br /> Choosing the right <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> instance type for your workload can be challenging with all the options available. Amazon Q aims to make this easier by providing personalized recommendations.</p> \n<p>To use this feature, you can ask Amazon Q, “Which instance families should I use to deploy a Web App Server for hosting an application?” This feature is also available when you choose to launch an instance in the <a href=\"https://console.aws.amazon.com/ec2\">Amazon EC2 console</a>. In <strong>Instance type</strong>, you can select <strong>Get advice on instance type selection</strong>. This will show a dialog to define your requirements.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/2023-qdev-rev-ec2-1-1-1024x435.png\" width=\"1024\" height=\"435\" /></p> \n<p>Your requirements are automatically translated into a prompt on the Amazon Q chat panel. Amazon Q returns with a list of suggestions of EC2 instances that are suitable for your use cases. This capability helps you pick the right instance type and settings so your workloads will run smoothly and more cost-efficiently.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-qdev-rev-ec2-1-3-1024x653-1.png\" width=\"1024\" height=\"653\" /></p> \n<p>This capability to provide EC2 instance type recommendations based on your use case is available in preview in all commercial AWS Regions.</p> \n<p><strong>3. Troubleshoot and solve errors directly in the console</strong><br /> Amazon Q can also help you to solve errors for various AWS services directly in the console. With Amazon Q proposed solutions, you can avoid slow manual log checks or research.</p> \n<p>Let’s say that you have an <a href=\"https://aws.amazon.com/lambda\">AWS Lambda</a> function that tries to interact with an <a href=\"https://aws.amazon.com/dynamodb\">Amazon DynamoDB</a> table. But, for an unknown reason (yet), it fails to run. Now, with Amazon Q, you can troubleshoot and resolve this issue faster by selecting <strong>Troubleshoot with Amazon Q</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/resolve-2-1-1024x525.png\" width=\"1024\" height=\"525\" /></p> \n<p>Amazon Q provides concise analysis of the error which helps you to understand the root cause of the problem and the proposed resolution. With this information, you can follow the steps described by Amazon Q to fix the issue.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/22/resolve-2-4-1024x960.png\" width=\"1024\" height=\"960\" /></p> \n<p>In just a few minutes, you will have the solution to solve your issues, saving significant time without disrupting your development workflow. The Amazon Q capability to help you troubleshoot errors in the console is available in preview in the US West (Oregon) for <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a>, <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>, <a href=\"https://aws.amazon.com/ecs\">Amazon ECS</a>, and <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>.</p> \n<p><strong>4. Network troubleshooting assistance<br /> </strong>You can also ask Amazon Q to assist you in troubleshooting network connectivity issues caused by network misconfiguration in your current AWS account. For this capability, Amazon Q works with <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/what-is-reachability-analyzer.html\">Amazon VPC Reachability Analyzer</a> to check your connections and inspect your network configuration to identify potential issues.</p> \n<p>This makes it easy to diagnose and resolve AWS networking problems, such as “Why can’t I SSH to my EC2 instance?” or “Why can’t I reach my web server from the Internet?” which you can ask Amazon Q.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-q-dev-rev-vpc.png\" width=\"1133\" height=\"544\" /></p> \n<p>Then, on the response text, you can select <strong>preview experience here</strong>, which will provide explanations to help you to troubleshoot network connectivity-related issues.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-q-dev-rev-vpc-detail.png\" width=\"1041\" height=\"1335\" /></p> \n<p>Here are a few things you need to know:</p> \n<ul> \n <li>This capability is currently available in preview in the US East (N. Virginia).</li> \n <li>To learn more about the feature and sample questions, see <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/amazon-q-network-troubleshooting.html\">Getting started with Amazon Q network troubleshooting</a> in the AWS Documentation.</li> \n</ul> \n<p><strong>5. Integration and conversational capabilities within your IDEs</strong><br /> As we mentioned, Amazon Q is also available in supported IDEs. This allows you to ask questions and get help within your IDE by chatting with Amazon Q or invoking actions by typing <code>/</code> in the chat box.</p> \n<p>To get started, you need to install or update the latest AWS Toolkit and sign in to <a href=\"https://aws.amazon.com/codewhisperer/\">Amazon CodeWhisperer</a>. Once you’re signed in to Amazon CodeWhisperer, it will automatically activate the Amazon Q conversational capability in the IDE. With Amazon Q enabled, you can now start chatting to get coding assistance.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-q-dev-rev-sq1-rai.png\" width=\"2858\" height=\"1542\" /></p> \n<p>You can ask Amazon Q to describe your source code file.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-q-dev-feature-3.jpg\" width=\"2560\" height=\"1464\" /></p> \n<p>From here, you can improve your application, for example, by integrating it with Amazon DynamoDB. You can ask Amazon Q, “Generate code to save data into DynamoDB table called save_data() accepting data parameter and return boolean status if the operation successfully runs.”</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-q-dev-feature-4-509x1024.jpg\" width=\"509\" height=\"1024\" /></p> \n<p>Once you’ve reviewed the generated code, you can do a manual copy and paste into the editor. You can also select <strong>Insert at cursor</strong> to place the generated code into the source code directly.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/23/2023-q-dev-feature-5-1.jpg\" width=\"2560\" height=\"1522\" /></p> \n<p>This feature makes it really easy to help you focus on building applications because you don’t have to leave your IDE to get answers and context-specific coding guidance. You can try the preview of this feature in Visual Studio Code and JetBrains IDEs.</p> \n<p><strong>6. Feature development capability</strong><br /> Another exciting feature that Amazon Q provides is guiding you interactively from idea to building new features within your IDE and <a href=\"https://aws.amazon.com/codecatalyst/\">Amazon CodeCatalyst</a>. You can go from a natural language prompt to application features in minutes, with interactive step-by-step instructions and best practices, right from your IDE. With a prompt, Amazon Q will attempt to understand your application structure and break down your prompt into logical, atomic implementation steps.</p> \n<p>To use this capability, you can start by invoking an action command <code>/dev</code> in Amazon Q and describe the task you need Amazon Q to process.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-q-dev-rev-2023-q-dev-rev-ide-2-crop.png\" width=\"2343\" height=\"1722\" /></p> \n<p>Then, from here, you can review, collaborate and guide Amazon Q in the chat for specific areas that need to be implemented.</p> \n<p>Additional capabilities to help you ship features faster with complete pull requests are available if you’re using Amazon CodeCatalyst. In Amazon CodeCatalyst, you can assign a new or an existing issue to Amazon Q, and it will process an end-to-end development workflow for you. Amazon Q will review the existing code, propose a solution approach, seek feedback from you on the approach, generate merge-ready code, and publish a pull request for review. All you need to do after is to review the proposed solutions from Amazon Q.</p> \n<p>The following screenshots show a pull request created by Amazon Q in Amazon CodeCatalyst.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/16/pull-request-1.png\" width=\"3008\" height=\"1576\" /></p> \n<p>Here are a couple of things that you should know:</p> \n<ul> \n <li>Amazon Q feature development capability is currently in preview in Visual Studio Code and Amazon CodeCatalyst</li> \n <li>To use this capability in IDE, you need to have the Amazon CodeWhisperer Professional tier. Learn more on the <a href=\"https://aws.amazon.com/codewhisperer/pricing/\">Amazon CodeWhisperer</a> pricing page.</li> \n <li>To learn more about this feature, read: <a href=\"https://aws.amazon.com/blogs/aws/improve-developer-productivity-with-generative-ai-powered-amazon-q-in-amazon-codecatalyst-preview/\">Improve developer productivity with generative-AI powered Amazon Q in Amazon CodeCatalyst (preview)</a></li> \n</ul> \n<p><strong>7. Upgrade applications with Amazon Q Code Transformation<br /> </strong>With Amazon Q, you can now upgrade an entire application within a few hours by starting a guided code transformation. This capability, called Amazon Q Code Transformation, simplifies maintaining, migrating, and upgrading your existing applications.<strong><br /> </strong></p> \n<p>To start, navigate to the <strong>CodeWhisperer</strong> section and then select <strong>Transform</strong>. Amazon Q Code Transformation automatically analyzes your existing codebase, generates a transformation plan, and completes the key transformation tasks suggested by the plan.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/app-transform-button.png\" width=\"1056\" height=\"1042\" /></p> \n<p>Some additional information about this feature:</p> \n<ul> \n <li>Amazon Q Code Transformation is available in preview today in the AWS Toolkit for IntelliJ IDEA and the AWS Toolkit for Visual Studio Code.</li> \n <li>To use this capability, you need to have the Amazon CodeWhisperer Professional tier during the preview.</li> \n <li>During preview, you can can upgrade Java 8 and 11 applications to version 17, a Java Long-Term Support (LTS) release.</li> \n <li>To learn more about this feature, read: <a href=\"https://aws.amazon.com/blogs/aws/upgrade-your-java-applications-with-amazon-q-code-transformation-preview/\">Upgrade your Java applications with Amazon Q Code Transformation (preview)</a></li> \n</ul> \n<p><strong><u>Get started with Amazon Q today<br /> </u></strong>With Amazon Q, you have an AI expert by your side to answer questions, write code faster, troubleshoot issues, optimize workloads, and even help you code new features. These capabilities simplify every phase of building applications on AWS.</p> \n<p>Amazon Q lets you engage with AWS Support agents directly from the Q interface if additional assistance is required, eliminating any dead ends in the customer’s self-service experience. The integration with AWS Support is available in the console and will honor the entitlements of your AWS Support plan.</p> \n<p><span><strong>Learn more</strong></span></p> \n<ul> \n <li><a href=\"https://aws.amazon.com/q\">Amazon Q main product page</a><span><strong><br /> </strong></span></li> \n <li><a href=\"http://aws.amazon.com/q/aws\">Amazon Q details for IT pros and developers</a></li> \n <li><a href=\"https://aws.amazon.com/q/getting-started/\">Get started with Amazon Q in the AWS Management Console</a></li> \n</ul> \n<p><span><strong>Read more about Amazon Q</strong></span></p> \n<ul> \n <li><a href=\"https://aws.amazon.com/blogs/aws/introducing-amazon-q-a-new-generative-ai-powered-assistant-preview\">Introducing Amazon Q, a new generative AI-powered assistant (preview)</a></li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/improve-developer-productivity-with-generative-ai-powered-amazon-q-in-amazon-codecatalyst-preview/\">Improve developer productivity with generative-AI powered Amazon Q in Amazon CodeCatalyst (preview)</a></li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/upgrade-your-java-applications-with-amazon-q-code-transformation-preview\">Upgrade your Java applications with Amazon Q Code Transformation (preview)</a></li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/new-generative-ai-features-in-amazon-connect-including-amazon-q-facilitate-improved-contact-center-service\">New generative AI features in Amazon Connect, including Amazon Q, facilitate improved contact center service</a></li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/new-amazon-q-in-quicksight-uses-generative-ai-assistance-for-quicker-easier-data-insights-preview/\">New Amazon Q in QuickSight uses generative AI assistance for quicker, easier data insights (preview)</a></li> \n</ul> \n<p>— <a href=\"https://www.linkedin.com/in/donnieprakoso\">Donnie</a> &amp; <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Donnie Prakoso","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d14fec037c16e41211d914bd4b08ded9f2d7cf6e5b1eaf74124b47b87471b082","category":"Tech"}