{"title":"Finotypic plasticity: Predator‐induced plasticity in fin size, darkness and display behaviour in a teleost fish","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14130?af=R","date":1718863525000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8d3517cf-e33b-4c6e-a7b8-f8997745728a/jane14130-toc-0001-m.png\" alt=\"Finotypic plasticity: Predator-induced plasticity in fin size, darkness and display behaviour in a teleost fish\" />\n<p>Fish fin morphology is intimately linked to locomotor performance, and hence to behaviours that influence fitness, such as foraging and predator avoidance. We provide evidence for predator-induced fin enlargement. The expression of larger fins likely results in increaseed escape swimming performance and enhances the silhouette of a deep-bodied and hard-to-capture prey.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nFish fins are remarkable devices of propulsion. Fin morphology is intimately linked to locomotor performance, and hence to behaviours that influence fitness, such as foraging and predator avoidance. This foreshadows a connection between fin morphology and variation in predation risk. Yet, whether prey can adjust fin morphology according to changes in perceived risk within their lifetime (a.k.a. predator-induced plasticity) remains elusive.\n\nHere, we quantify the structural size of five focal fins in crucian carp (<i>Carassius carassius</i>) following controlled manipulations to perceived predation risk (presence/absence of pike <i>Esox lucius</i>). We also assess if crucian carp respond to increased predation risk by shifts in dorsal fin colouration, and test for differences in how fish actively use their dorsal fins by quantifying the area of the fin displayed in behavioural trials.\n\nWe find that crucian carp show phenotypic plasticity with regards to fin size as predator-exposed fish consistently have larger fins. Individuals exposed to perceived predation risk also increased dorsal fin darkness and actively displayed a larger area of the fin to potential predators.\n\nOur results thus provide compelling evidence for predator-induced fin enlargement, which should result in enhanced escape swimming performance. Moreover, fin-size plasticity may evolve synergistically with fin colouration and display behaviour, and we suggest that the adaptive value of this synergy is to enhance the silhouette of deep-bodied and hard-to-capture prey to deter gape-limited predators prior to attack. Together, our results provide new perspectives on the role of predation risk in development and evolution of fins.\n</p>","author":"Kaj Hulthén, \nJerker Vinterstare, \nP. Anders Nilsson, \nChrister Brönmark","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"d1529e7d9ac25c287ec8c1d0a600e69a22c46ca5fc4604e87657d2b5cf0ab4d8","category":"Environment"}