{"title":"Recent Siri Changes Remove Call, Email, and Voicemail Features Used by Low Vision and Blind Users","link":"https://www.macrumors.com/2021/09/29/siri-changes-features-removed/","date":1632951854000,"content":"With the recent release of <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, Apple appears to have made some changes to <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> functionality that have removed features relied on by low vision and blind <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/siri-glow.png\" />\r\n<br />\r\nSeveral ‌Siri‌ commands that provide details on phone calls, voicemails, and sending emails no longer appear to be working. The following commands used to be functional, but have recently been removed.\r\n<br />\r\n<ul>\r\n<br />\r\n \t<li>Do I have any voicemails?</li>\r\n<br />\r\n \t<li>Play my voicemail messages</li>\r\n<br />\r\n \t<li>Check my call history</li>\r\n<br />\r\n \t<li>Check my recent calls</li>\r\n<br />\r\n \t<li>Who called me?</li>\r\n<br />\r\n \t<li>Send an email</li>\r\n<br />\r\n \t<li>Send an email to [person]</li>\r\n<br />\r\n</ul>\r\n<br />\r\nOver the last two weeks, we've received several emails from ‌iPhone‌ users who are missing this key ‌Siri‌ functionality, or their relatives who are attempting to help them navigate the changes. The ‌Siri‌ feature removals have also been documented <a href=\"https://www.applevis.com/forum/ios-ipados/siri-unable-send-email\">on the AppleVis forums</a> for blind and low vision users of Apple products.\r\n<br />\r\n<blockquote>One of the people whom I support told me that she could no longer use Siri to send email from her iPhone 8 with iOS 14. I tried on my iPhone SE with iOS 15.0 and the response from Siri was \"sorry, I can't help with that'. Subsequently, I've had the same response on a phone running iOS 12. If this is a deliberate feature removal, it's certainly a loss to some users with sight loss who find it a convenient way to send a brief email.\r\n<br />\r\n\r\n<br />\r\nPrior to this last iOS update if Siri was asked to play voicemail Siri would - now Siri just states can't do that. Trying to find a work around around as my dad who is completely blind heavily relied on this feature.\r\n<br />\r\n\r\n<br />\r\nMy sister is blind and Siri would respond to voice commands ie, read my text, call Barbara, answer questions regarding weather and most importantly tell my sister who called her. As of today, Siri's response is \"I can't help with that\". Has the system changed? Is there something on the iPhone that needs to be in abled so Siri will aid my sister with knowing who called her in the past?</blockquote>\r\n<br />\r\nAsking ‌Siri‌ to provide details on recent phone calls or voicemails results in the following response: \"I can't help with that, but you can ask me to open the Phone app.\" Asking about email garners a similar response about ‌Siri‌ being unable to help.\r\n<br />\r\n\r\n<br />\r\nIt's worth noting that it's still possible to ask ‌Siri‌ to play the most recent voicemail message that's available, or a voicemail from a specific person, but ‌Siri‌ will not read out a list of all the available voicemails. The ‌Siri‌ commands seem to have disappeared when ‌iOS 15‌ was released, but iOS 14 users are also not able to use them anymore so it's not an issue tied to ‌iOS 15‌.\r\n<br />\r\n\r\n<br />\r\nWe asked Apple for comment on whether this was a bug or if there are alternate commands available for users, but after several days of waiting for a response, we did not hear back. A user on the AppleVis forums spoke to Apple support and was told that Apple is aware of the issue, so there's a possibility that this functionality will be re-added at some point.<div>Tag: <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/29/siri-changes-features-removed/\">Recent Siri Changes Remove Call, Email, and Voicemail Features Used by Low Vision and Blind Users</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/recent-siri-changes-remove-call-email-and-voicemail-features-used-by-low-vision-and-blind-users.2314474/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0hb24OTdPxc:xPWSdCg4Yac:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0hb24OTdPxc:xPWSdCg4Yac:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0hb24OTdPxc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d15b014b8fbe1c114c5ba3a9130665d1ab595de7b7e3179c243afabc94cbb0d4","category":"Apple"}