{"title":"A Review of Crowd Abnormal Behavior Recognition Technology Based on Computer Vision","link":"https://www.preprints.org/manuscript/202409.1879/v1","date":1727167362000,"content":"Crowd abnormal behavior recognition is one of the research hotspots in computer vision. Its goal is to use computer vision technology and abnormal behavior detection models to accurately perceive, predict, and intervene in potential abnormal behaviors of the crowd, and monitor the status of the crowd system in public places in real-time, to effectively prevent and deal with public security risks and ensure public life safety and social order. To this end, focusing on the crowd abnormal behavior recognition technology in the computer vision system, a systematic review study of its theory and cutting-edge technology is conducted. First, the crowd level and abnormal behaviors in public places are defined, and the challenges faced by crowd abnormal behavior recognition are expounded. Then, from the dimensions based on traditional methods and based on deep learning, the mainstream technologies of abnormal behavior recognition are discussed, and the design ideas, advantages, and limitations of various methods are analyzed. Next, the mainstream software tools are introduced to provide a comprehensive reference for the technical framework; Secondly, typical abnormal behavior datasets at home and abroad are sorted out, and the characteristics of these datasets are compared in detail from multiple perspectives such as scale, characteristics and uses, and the performance indicators of different algorithms on the datasets are compared and analyzed; Finally, the full text is summarized and the future development direction of crowd abnormal behavior recognition technology is prospected.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d15e0941c96a2a07e738bc0fe7ff3e24ab2d4631de8456f7dc4d966b7a7223c2","category":"Interdisciplinary"}