{"title":"The experimental implications of the rate of temperature change and timing of nutrient availability on growth and stoichiometry of a natural marine phytoplankton community","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12613?af=R","date":1723833029000,"content":"<h2>Abstract</h2>\n<p>Climate change increases the need to understand the effect of predicted future temperature and nutrient scenarios on marine phytoplankton. However, experimental studies addressing the effects of both drivers use a variety of design approaches regarding their temperature change rate and nutrient supply regimes. This study combines a systematic literature map to identify the existing bias in the experimental design of studies evaluating the phytoplankton response to temperature change, with a laboratory experiment. The experiment was designed to quantify how different temperature levels (6°C, 12°C, and 18°C), temperature regimes (abrupt vs. gradual increase), timings of nutrient addition (before or after the temperature change) and nutrient regimes (limiting vs. balanced) alter the growth and stoichiometry of a natural marine phytoplankton community. The systematic map revealed three key biases in marine global change experiments: (1) 66% of the studies do not explicitly describe the experimental temperature change or nutrient regime, (2) 84% applied an abrupt temperature exposure, and (3) only 15% experimentally manipulated the nutrient regime. Our experiment demonstrated that the identified biases in experimental design toward abrupt temperature exposure induced a short-term growth overshoot compared to gradually increasing temperatures. Additionally, the timing of nutrient availability strongly modulated the direction of the temperature effect and strength of growth enhancement along balanced N : P supply ratios. Our study stresses that the rate of temperature change, the timing of nutrient addition and the N : P supply ratio should be considered in experimental planning to produce ecologically relevant results as different setups lead to contrasting directions of outcome.</p>","author":"Anika Happe, \nAntonia Ahme, \nMarco J. Cabrerizo, \nMiriam Gerhard, \nUwe John, \nMaren Striebel","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"d1650532ac4ba2aa8d08fa5bee3f2956dec5583c4e414b2540c1af7988de4c83","category":"Environment"}