{"title":"Quality of Rainbow Trout (Oncorhynchus mykiss) Reared in Recirculating Aquaculture System and during Depuration Based on Chemical and Sensory Analysis","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3537294?af=R","date":1688972400000,"content":"<p>In recirculating aquaculture systems (RAS), off-flavors can accumulate in fish muscle tissue. They are problematic for consumer acceptance and the reputation of farmed fish products. Although off-flavors are not toxic at low concentrations, they often give fish muscle earthy, muddy, or other unwanted flavors. Traditionally, the study of off-flavors in fish focused on muddy and earthy off-flavors caused by geosmin (GSM) and 2-methylisoborneol (MIB), but other unwanted flavors and compounds have also been identified. In this study, the selected off-flavors were chemically quantified in fish from a RAS-rearing rainbow trout (<i>Oncorhynchus mykiss</i>) and in different stages of depuration. A group of trained panelists with experience in sensory evaluation was specifically trained in analyzing rainbow trout samples. The panelists evaluated the fish with a sensory profile of 29 sensory attributes (12 odor, 5 taste, and 12 flavor properties). Overall, the concentrations of all the studied off-flavor compounds decreased, some to below the limit of detection and others (e.g., octanal, octanoic acid, phenylacetaldehyde, and acetoin) to a certain low level. Moldy, earthy, and musty odors and flavors especially decreased during depuration compared to fish in RAS. This study shows the consistency of the chemical analysis and sensory profiling. It also provides important information about the effects of the depuration period in RAS and on the chemical and sensorial quality of rainbow trout.</p>","author":"Petra Camilla Lindholm-Lehto, \nNora Logrén, \nSaila Mattila, \nJani Tapio Pulkkinen, \nJouni Vielma, \nAnu Hopia, \nCarlos Rosas","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"d167342533787008d3eb54621c2293e8d1211ff82fd37255c8d12fa42bb03af3","category":"Environment"}