{"title":"iOS 17: How to Turn Your Photo Subjects into Message Stickers","link":"https://www.macrumors.com/how-to/turn-photo-subjects-into-message-stickers/","date":1692961660000,"content":"Apple in ‌iOS 16‌ introduced a <a href=\"https://www.macrumors.com/how-to/isolate-copy-share-subjects-photos/\">Remove Subject From Background</a> option for photos on your iPhone, and in ‌iOS 17‌, you can also use the feature to create and save your own stickers. Keep reading to learn how it works.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/iOS-17-Messages-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nIn iOS 16, Apple enhanced its Visual Look Up capability for photos by making it possible to isolate the subject of a picture from its background so that you can copy it to the clipboard for use elsewhere or share it in another app.\r<br />\n\r<br />\nWith iOS 17, Apple has taken the feature further by allowing you to export isolated photo subjects as stickers that you can use in Messages. And if the subject is in a Live Photo, <a href=\"https://www.macrumors.com/how-to/create-live-stickers-messages-ios/\">the sticker will even animate</a>.\r<br />\n\r<br />\nThere are a number of effects that can be added to make your digital stickers look more like real stickers, including a white outline, comic-like shading, a puffy 3D look, and a shiny, holographic finish. The sticker effects will animate and reflect the light appropriately, making your self-created stickers look professionally done.\r<br />\n\r<br />\nThe following steps show you how to create your first photo-sourced sticker in iOS 17.\r<br />\n<ol><li>Launch the Photos app and select an image from your library containing a well-defined subject.</li>\r<br />\n<li>Press and hold on the subject until it ripples and a white glow flows around its outline.</li>\r<br />\n<li>In the popup menu that appears, tap <strong>Add Sticker</strong>.</li>\r<br />\n<li>To change the look of your sticker, tap <strong>Add Effect</strong>, and you'll be given several options including <strong>Original</strong>, <strong>Outline</strong>, <strong>Comic</strong>, <strong>Puffy</strong>, and <strong>Shiny</strong>.</li>\r<br />\n<li>Tap <strong>Done</strong> to finish.</li></ol><img src=\"https://images.macrumors.com/article-new/2023/08/turn-photo-subject-into-sticker-ios.jpg\" alt=\"photos\" width=\"4320\" height=\"2700\" />\r<br />\n\r<br />\nThat's all you need to do. The next time you open Messages, you'll find it in your personal stickers collection, ready to send to friends and family. To use it in a Messages conversation thread, simply tap the <strong>+</strong> button next to the compose field, then tap <strong>Stickers</strong>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/ios-17-messages-stickers.jpg\" alt=\"stickers\" width=\"800\" height=\"450\" />\r<br />\nTap the sticker in question, then tap the <strong>Send</strong> button. Alternatively, you can long-press the sticker and drag it into the conversation, or even onto a specific message bubble, just like a tapback reaction.\r<br />\n<ul><li><a href=\"https://www.macrumors.com/how-to/use-emoji-as-stickers-messages/\">iOS 17: How to Use Emoji as Stickers in Messages</a></li></ul>\r<br />\nIn iOS 17, Apple has added several new features to its Messages app to make communicating with other Apple users more creative and fun. Check out our <a href=\"https://www.macrumors.com/guide/ios-17-messages/\">dedicated Messages roundup</a> to learn else is in store when iOS 17 is publicly released next month.<div>Tag: <a href=\"https://www.macrumors.com/guide/messages/\">Messages</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/turn-photo-subjects-into-message-stickers/\">iOS 17: How to Turn Your Photo Subjects into Message Stickers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-how-to-turn-your-photo-subjects-into-message-stickers.2399596/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d1678a3fba2d1b30403d894e06f6e6fe36637fd8bb512196e090da0d8cb3b7d7","category":"Apple"}