{"title":"Norovirus GII wastewater monitoring for epidemiological surveillance","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000198","date":1705586400000,"content":"<p>by Michelle L. Ammerman, Shreya Mullapudi, Julie Gilbert, Khaitlyn Figueroa, Felipe de Paula Nogueira Cruz, Kevin M. Bakker, Marisa C. Eisenberg, Betsy Foxman, Krista R. Wigginton</p>\r\n\r\nWhile the Centers for Disease Control and Prevention coordinates several outbreak and clinical surveillance systems for norovirus, norovirus is strongly under-reported due to individuals not seeking care or not being tested. As a result, norovirus surveillance using case reports and syndromic detection often lags rather than leads outbreaks. Digital epidemiology sources such as search term data may be more immediate, but can be affected by behavior and media patterns. Wastewater monitoring can potentially provide a comprehensive and consistent data stream that can help to triangulate across these different data sets. To assess the timeliness of norovirus wastewater testing compared with syndromic, outbreak and search term trend data for norovirus, we quantified human norovirus GII in composite influent samples from 5 wastewater treatment plants (WWTPs) using reverse transcription-digital droplet PCR and correlated wastewater levels to syndromic, outbreak, and search term trend data. Wastewater human norovirus (HuNoV) GII RNA levels were comparable across all WWTPs after fecal content normalization using Pepper mild mottle virus (PMMoV). HuNoV GII wastewater values typically led syndromic, outbreak, and search term trend data. The best correlations between data sources were observed when the wastewater sewershed population had high overlap with the population included by other monitoring methods. The increased specificity and earlier detection of HuNoV GII using wastewater compared to other data, and the ability to make this data available to healthcare, public health, and the public in a timely manner, suggests that wastewater measurements of HuNoV GII will enhance existing public health surveillance efforts of norovirus.","author":"Michelle L. Ammerman","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"d175f34c641e8a5887bd581e0fe0d657055807768d7aaf8280ee054900ee0b76","category":"Environment"}