{"title":"Spatio‐Temporal Dynamics of Aboveground Biomass in China's Oasis Grasslands Between 1989 and 2021","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003944?af=R","date":1710766424000,"content":"<h2>Abstract</h2>\n<p>Grassland provides multiple ecosystem services and plays a key role in preventing desert encroachment and maintaining oasis stability. In China, the area of cropland in oases has expanded significantly in recent decades, which results in a rapid increase in agricultural water demand and encroachment on grassland subsistence space. However, our knowledge about how the expansion of cropland affects oasis grasslands remains limited. We used machine learning, temporal segmentation of spectral trajectories, and maximum covariance analysis to generate an annual oasis grassland aboveground biomass (AGB) data set at 30-m resolution from 1989 to 2021 based on multiple remotely sensed and ground observation data sets, and investigated the dynamics of grassland AGB under cropland expansion in oases. We found that overall oasis grassland AGB increased significantly (0.3 gm<sup>−2</sup> yr<sup>−1</sup>, <i>P</i> &lt; 0.01) during 1989–2021, but trends in AGB were not consistent across basins. In the Yellow River, Turpan Hami, Qaidam, and southern Altai Mountains River Basins, AGB was dominated by a significant increase. Conversely, in all basins in southern Xinjiang, AGB showed a decreasing trend due to the rapid cropland expansion. Spatially, cropland expansion and AGB dynamics were strongly coupled. In regions characterized by agricultural concentration, grassland AGB benefitted from resource spillover via edge effects. However, in downstream areas or those with a low proportion of cropland, where most grasslands are distributed, the relationship between the two shifted to a trade-off. Our study provides a scientific basis for identifying priority areas for ecological restoration and for science-based planning of the scale of cropland in oases.</p>","author":"Peng Chen, \nShuai Wang, \nYanxu Liu, \nYijia Wang, \nJiaxi Song, \nQiang Tang, \nYing Yao, \nYaping Wang, \nXutong Wu, \nFangli Wei, \nSiyuan Feng","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"d17692364970b910f41351de1579d80ba3422854969577a3e56518a37039fcac","category":"Environment"}