{"title":"Trichloroethylene metabolite modulates DNA methylation-dependent gene expression in Th1-polarized CD4+ T cells from autoimmune-prone mice","link":"https://academic.oup.com/toxsci/article/199/2/289/7633745?rss=1","date":1711065600000,"content":"<span><div>Abstract</div>Trichloroethylene (TCE) is an industrial solvent and widespread environmental contaminant associated with CD4+ T-cell activation and autoimmune disease. Prior studies showed that exposure to TCE in the drinking water of autoimmune-prone mice expanded effector/memory CD4<sup>+</sup> T cells with an interferon-γ (IFN-γ)-secreting Th1-like phenotype. However, very little is known how TCE exposure skews CD4<sup>+</sup> T cells towards this pro-inflammatory Th1 subset. As observed previously, TCE exposure was associated with hypermethylation of regions of the genome related to transcriptional repression in purified effector/memory CD4 T cells. We hypothesized that TCE modulates transcriptional and/or epigenetic programming of CD4<sup>+</sup> T cells as they differentiate from a naive to effector phenotype. In the current study, purified naive CD4 T cells from both male and female autoimmune-prone MRL/MpJ mice were activated ex vivo and polarized towards a Th1 subset for 4 days in the presence or absence of the oxidative metabolite of TCE, trichloroacetaldehyde hydrate (TCAH) in vitro. An RNA-seq assessment and reduced representation bisulfite sequencing for DNA methylation were conducted on Th1 cells or activated, non-polarized cells. The results demonstrated TCAH’s ability to regulate key genes involved in the immune response and autoimmunity, including Ifng, by altering the level of DNA methylation at the gene promoter. Intriguing sex differences were observed and for the most part, the effects were more robust in females compared to males. In conclusion, TCE via TCAH epigenetically regulates gene expression in CD4<sup>+</sup> T cells. These results may have implications for mechanistic understanding or future therapeutics for autoimmunity.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"d184497f12c7c60e478654f47fcb997309beebb138de5bc619eac8b5084c923d","category":"Environment"}