{"title":"Natural Antimicrobials in Dairy Products: Benefits, Challenges, and Future Trends","link":"https://www.preprints.org/manuscript/202404.0338/v1","date":1712214740000,"content":"This review delves into using natural antimicrobials in the dairy industry and examines various sources of these compounds, including microbial, plant, and animal sources. It highlights dairy products' most commonly used natural antimicrobials, such as nisin, lysozyme, lactoferrin, chitosan, and essential oils. It discusses the mechanisms by which they inhibit microbial growth and improve the shelf life of dairy products. Moreover, the review explores encapsulation technology as a promising approach for increasing the viability of natural antimicrobials. It discusses how encapsulation technology can protect these compounds from environmental factors that can reduce their effectiveness, such as pH, temperature, and oxygen exposure. The review also highlights the different materials that can be used for encapsulation, such as alginate, chitosan, and starch, and discusses their properties and suitability for encapsulating different natural antimicrobials. Finally, the review examines the benefits and challenges of using natural antimicrobials in dairy products. While natural antimicrobials offer several advantages, including improved safety, quality, and sensory properties of dairy products, it's crucial to be aware of the challenges associated with their use, such as potential allergenicity, regulatory requirements, and consumer perception. The review concludes by emphasizing the need for further research to identify and develop effective and safe natural antimicrobials for the dairy industry to ensure the quality and safety of dairy products for consumers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d186327f58add3a7b8826884762e9f54dbdb33532ffc5e457b763133e7f109b0","category":"Interdisciplinary"}