{"title":"AWS Supply Chain update: Three new modules supporting upstream activities","link":"https://aws.amazon.com/blogs/aws/aws-supply-chain-update-three-new-modules-supporting-upstream-activities/","date":1705427016000,"content":"<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_nav_3.png\" width=\"236\" height=\"516\" />We are launching three new modules for <a href=\"https://aws.amazon.com/aws-supply-chain/\">AWS Supply Chain</a> today. These modules are designed to help you collaborate with your suppliers across all tiers of your supply chain, with the goal of helping you to maintain optimum inventory levels at each site in the chain. Here’s an overview:</p> \n<p><strong>Supply Planning</strong> – This module helps you to accurately forecast and plan purchases of raw materials, components, and finished goods. It uses multiple algorithms to create supply plans that include purchase orders and inventory transfer requirements.</p> \n<p><strong>N-Tier Visibility</strong> – This module extends visibility and collaboration beyond your enterprise’s internal systems to multiple external tiers of trading partners.</p> \n<p><strong>Sustainability</strong> – this module creates a more secure and efficient way for you to request, collect, and review data for carbon emissions, as well as reports on hazardous material used in the acquisition, manufacturing, transportation, and disposal of goods. You can now send data requests to multiple tiers of trading partners, track responses, send reminders to absentees, and provide a central repository to store and view responses.</p> \n<p>Let’s take a look at each one…</p> \n<p><span><strong>Supply Planning</strong></span><br /> <span>AWS Supply Chain</span> already includes a <a href=\"https://docs.aws.amazon.com/aws-supply-chain/latest/userguide/demand-planning.html\">Demand Planning</a> module which uses proprietary machine learning algorithms to forecast demand and generate a demand plan that is based on two or more years of historical order line data. The forecasts are granular and specific, including distribution centers and retail outlets.</p> \n<p>The new Supply Planning module uses the demand plan as an input. It looks at existing inventory, accounts for uncertainties, and supports additional business input including stocking strategies, ultimately generating purchase orders for components and raw materials, ready for review and approval. Here is the main page of the Supply Planning module:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_supply_2.png\" width=\"860\" height=\"591\" /></p> \n<p>The module also supports auto replenishment and manufacturing plans. The manufacturing plans work backward from a Bill of Materials (BoM) which is broken down (exploded) into individual components that are sourced from multiple direct and indirect upstream sources.</p> \n<p>Supply Planning is done with respect to a planning horizon and on a plan schedule, both of which are defined in the organization profile:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_supply_settings_2.png\" width=\"860\" height=\"630\" /></p> \n<p>The settings for this module also allow for customization of purchase order review and approval:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_supply_po_2.png\" width=\"860\" height=\"630\" /></p> \n<p><span><strong>N-Tier Visibility</strong></span><br /> This module helps you to work in a collaborative fashion with your vendors, the vendors that supply your vendors, and so forth. It automatically detects vendors and sets them up for on-boarding into <span>AWS Supply Chain</span>. The module supports manual and EDI-powered collaboration on purchase orders, while also helping to identify discrepancies and risks, and to find substitute vendors if necessary.</p> \n<p>The main page of the module displays an overview of my trading partners:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_ntier_2.png\" width=\"900\" height=\"812\" /></p> \n<p>The <strong>Portal status</strong> column indicates that some of these partners have already onboarded, others have been invited (and one let the invite expire), and others have yet to be invited. I can click <strong>Invite partners</strong> to extend invitations. I select the partners (these have generally been auto-discovered using data in the Supply Chain Data Lake), and click <strong>Continue</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_nt_pick_partners_2.png\" width=\"860\" height=\"564\" /></p> \n<p>Then I enter the contact information for each partner that I selected, and click <strong>Send invites</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_nt_review_send_2.png\" width=\"860\" height=\"366\" /></p> \n<p>The contact receives an invitation via email and can then accept the invite. After they have accepted, they can receive and respond to supply plans and purchase orders electronically (via email or EDI).</p> \n<p><span><strong>Sustainability</strong></span><br /> The Sustainability module helps you to request, receive, and review compliance and sustainability data from your partners. It builds on the partner network that I already described, and tracks requests for data:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_sust_dast_3.png\" width=\"711\" height=\"165\" /></p> \n<p>To request data, I select the type of data that I need and the partners that I need it from, then click <strong>Continue</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_sust_ask_data_2.png\" width=\"860\" height=\"626\" /></p> \n<p>Then I enter the details that define my request, including a due date. I can ask the chosen partners for a text response and/or a file response:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/01/12/sc_sust_request_details_2.png\" width=\"860\" height=\"992\" /></p> \n<p>The responses and files provided by each partner are written to the Supply Chain Data Lake and can also be exported to an <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> bucket.</p> \n<p><span><strong><span>AWS Supply Chain</span> Resources</strong></span><br /> If you are new to <span>AWS Supply Chain</span> and would like to learn more, here are some resources to get you started:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/aws-supply-chain/\">AWS Supply Chain</a> – Home page.</li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/aws-supply-chain-now-generally-available-mitigate-risks-and-lower-costs-with-increased-visibility-and-actionable-insights/\">AWS Supply Chain Now Generally Available – Mitigate Risks and Lower Costs with Increased Visibility and Actionable Insights</a> – Blog post.</li> \n <li><a href=\"https://aws.amazon.com/blogs/supply-chain/aws-supply-chain-announces-new-upstream-capabilities/\">AWS Supply Chain announces new upstream capabilities</a> – Blog post.</li> \n <li><a href=\"https://aws.amazon.com/blogs/supply-chain/improving-demand-planning-for-products-with-varying-lifecycles-with-aws-supply-chain/\">Improving demand planning for products with varying lifecycles with AWS Supply Chain</a> – Blog post.</li> \n <li><a href=\"https://www.youtube.com/watch?v=NQvYnUcTOdg\">AWS Supply Chain: Helping Woodside Energy optimize their supply chain</a> – Video.</li> \n</ul> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d187985d71b7d6c7627af214f73e4e747fededa945a931a6450b64eb5a1448cb","category":"Tech"}