{"title":"Pentagon explains odd transfer of 175 million IP addresses to obscure company","link":"https://arstechnica.com/?p=1760167","date":1619470857000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-data-800x560.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-data.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?assettype=image&amp;family=creative&amp;license=rf&amp;photographer=Andriy%20Onufriyenko&amp;sort=best#license\">Getty Images | Andriy Onufriyenko</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US Department of Defense puzzled Internet experts by apparently transferring control of tens of millions of dormant IP addresses to an obscure Florida company just before President Donald Trump left the White House, but the Pentagon has finally offered a partial explanation for why it happened. The Defense Department says it still owns the addresses but that it is using a third-party company in a \"pilot\" project to conduct security research.</p>\n<p>\"Minutes before Trump left office, millions of the Pentagon's dormant IP addresses sprang to life\" was the title of a <a href=\"https://www.washingtonpost.com/technology/2021/04/24/pentagon-internet-address-mystery/\">Washington Post article</a> on Saturday. Literally three minutes before Joe Biden became president, a company called Global Resource Systems LLC \"discreetly announced to the world's computer networks a startling development: It now was managing a huge unused swath of the Internet that, for several decades, had been owned by the US military,\" the Post said.</p>\n<p>The number of Pentagon-owned IP addresses announced by the company rose to 56 million by late January and 175 million by April, making it the world's largest announcer of IP addresses in the IPv4 global routing table.</p></div><p><a href=\"https://arstechnica.com/?p=1760167#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760167&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d1a05f0ece0b26df50bf2928ff32c44f4c34356beaf6e3b113015b8d9ed2af52","category":"Tech"}