{"title":"Does reducing smartphone use impact physical activity?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311248","date":1728655200000,"content":"<p>by Annaëlle Le Steunf, Ewen Page, Yannick Guillodo, Alain Saraux</p>\r\nIntroduction <p>A sedentary lifestyle and low levels of physical activity among the population are major public health challenges due to numerous associated health risks. These behaviors are influenced by a number of environmental and cultural factors, such as screen addiction.</p> Objective <p>To study the impact of reducing smartphone use by one hour per day for one week on physical activity.</p> Method <p>We conducted a descriptive epidemiological study that included 490 individuals. Participants were recruited by means of a media campaign called “Let’s put down our smartphones challenge”, which was conducted in Brest, France. The questionnaires were widely publicized, and candidates from all over France were able to participate. Data reflecting physical activity were collected before and after the challenge, one week apart, through an online questionnaire.</p> Results <p>Among the 490 participants, 126 (25.7%) succeeded in the challenge and reduced the time spent on their smartphones by more than 60 minutes. Among those 126 participants, 112 individuals (89%) increased their physical activity. On average, participants who succeeded in the challenge reduced their smartphone use by 110.57 minutes (±53.66) (<i>p</i>&lt; 0.001) and increased their number of steps by 841 (±14710) (<i>p</i> = 0.02). The proportion of patient reaching an increase of both 500 and 100 daily steps was statistically significant in the group reaching a reduction of smartphone use of 60 minutes versus the remainder (p = 0.016 and 0.018, respectively), but not for a cut off at 1000.</p> Conclusion <p>A reduction in the time spent using smartphones results in an increase in the average number of daily steps. Limiting the leisure time spent on screens is a potential strategy for addressing physical inactivity and a sedentary lifestyle.</p>","author":"Annaëlle Le Steunf","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d1a620e74bea9849b00bb1aa1b35923711e9bb136fc3cd2fae9c01a54e0bbd3d","category":"Interdisciplinary"}