{"title":"Comparative study of larvae production by the Nile tilapia (Oreochromis niloticus, Linné, 1758) Bouaké strain between earthen ponds and hapas","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16075?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>The aim of this study was to contribute to the development of tilapia aquaculture in Côte d’Ivoire by increasing the productivity of <i>Oreochromis niloticus</i> fry in fish hatcheries. Thus, the production of <i>Oreochromis niloticus</i> larvae was compared between two tilapia breeding systems, earthen ponds and hapas in ponds. Over 98 days, 900 broodstock fish were allowed to reproduce in two ponds of 500 m<sup>2</sup> and 900 others in 20 hapas of 50 m<sup>2</sup>, each installed in two ponds of 1200 m<sup>2</sup>. The sex ratio was one male for two females at a density of 0.9 breeders/m<sup>2</sup> at a density of 450 breeders per pond and 45 breeders per hapa. After breeding broodstock in both systems, larvae were harvested and counted every 14 days. The survival rate and growth of the broodstock, as well as the reproductive performance of the females, were evaluated. There was no significant difference between the survival rates of the broodstock in the two breeding systems (98.1 ± 0.4% in ponds and 97.4 ± 0.5% in hapas). Broodstock, however, showed significantly higher growth in ponds than in hapas. The quantity of larvae produced by females in ponds was significantly higher than that of females bred in hapas (<i>p</i> &lt; 0.05). Hence, the best reproductive performance was recorded in broodstock stocked in ponds (absolute productivity: 93.1 larvae per female, relative productivity: 0.3 larvae per g of female, system productivity: 3.9 ± 0.2 larvae·m<sup>−2</sup>·day<sup>−1</sup>).</p>","author":"Dieudonné Djétouan Akian, \nCrespin Luc Quenum, \nDaniel N’ Zi Koua, \nJoël Alain Kouakou Houra, \nFrédéric Clota, \nMarie‐Laure Bégout, \nKouakou Yao","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"d1b0696ab38ba4bab56384b3b33c53847566531d017cea26c9cfdd07b7bd9b2d","category":"Environment"}