{"title":"The 900 km drive to deliver faster time trial wheels to Mathieu van der Poel","link":"https://cyclingtips.com/2021/06/the-900-km-drive-to-deliver-faster-time-trial-wheels-for-mathieu-van-der-poel/","date":1625030472000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/E5Emt3GXEAMgaXe-650x433.jpeg\" /></div><h2>The 900 km drive to deliver faster time trial wheels to Mathieu van der Poel</h2><p>\n</p><p>The first time trial of the 108th <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> is nearly upon us, and Alpecin-Fenix is doing everything it can to keep <a href=\"https://cyclingtips.com/tag/mathieu-van-der-poel/\" target=\"_blank\">Mathieu van der Poel</a> in yellow just that little bit longer. According to a report from <a href=\"https://www.nieuwsblad.be/cnt/dmf20210629_96872429\" target=\"_blank\">Het Nieuwsblad</a>, part of that plan involved a 900 km drive from Andorra to Rennes, to deliver some faster time trial wheels for the race leader.</p>\n\n\n\n<p>Van der Poel is seemingly a natural dominator in many forms of cycling, but the time trial is not yet one of them. He’s only done nine individual time trials in his short professional road career, and while his best result was a fifth at last year’s BinckBank Tour, he’s still largely unproven against the clock. Ahead is the longest time trial (27.2 km) he’s ever faced. Word is he doesn’t have a time trial bike at home to train with. And he’s never been tested in a wind tunnel.</p>\n\n\n\n<p>Meanwhile, Julian Alaphilippe (Deceuninck-QuickStep) sits just eight seconds behind Van der Poel, second overall on GC. The French all-rounder’s prowess against the clock is far better known than Van der Poel’s. After all, who could forget <a href=\"https://cyclingtips.com/2019/07/alaphilippe-tops-thomas-in-the-tours-stage-13-time-trial-daily-news-digest/\" target=\"_blank\">the time trial Alaphilippe won in yellow at the 2019 Tour</a>? Behind him, other strong time trialists like Wout van Aert (Jumbo-Visma, +0:31) and Wilco Kelderman (Bora-Hansgrohe, +0:38) also lie in wait.</p>\n\n\n\n<p>If Van der Poel can hold onto the yellow jersey past stage 5, then he’ll likely do so until the peloton reaches the Alps on stage 8. And Alpecin-Fenix’s team manager, Christoph Roodhooft is clearly keen to make that happen. </p>\n\n\n\n<p>The story goes that Meindert Klem, a representative of <a href=\"https://cyclingtips.com/tag/princeton-carbonworks/\" target=\"_blank\">Princeton CarbonWorks</a>, met Roodhooft on a bike ride a year ago. According to Klem, after Van der Poel grabbed yellow, and after receiving permission from sponsor Shimano, Roodhooft reached out about getting some faster wheels for the stage 5 time trial. </p>\n\n\n\n<p>“I got a sudden call from Christoph on Monday morning asking if a set of Princeton Blur 6560 was available,” said former Olympic rower Klem in an interview with Het Nieuwsblad. “Canyon wanted Mathieu to be the classification leader even after the time trial.” </p>\n\n\n\n<p>That quoted Blur 6560 wheelset doesn’t exist, and so it’s assumed that Roodhooft sought a combination of the 60 mm deep <a href=\"https://cyclingtips.com/2018/09/princeton-carbonworks-wake-6560-wheelset-review-small-company-big-claims/\" target=\"_blank\">Wake 6560 </a>for the front and a Blur 633 Disc for the rear. Both wheels are tubeless or tubed clincher only, and so it’s likely they’ll be shod with Vittoria Corsa Speed tyres. </p>\n\n\n\n<figure><img /><figcaption>Van der Poel is expected to be rolling on the two wheels pictured on the left. </figcaption></figure>\n\n\n\n<p>The problem was that the Blur wheel is only produced in extremely limited quantities within the United States, and you can bet that availability within Europe is bordering on zero. The simplest path would have been to borrow a pair from Ineos Grenadiers, but of course, the British squad has its own agenda and assisting a competitor with a technical advantage they’ve invested in isn’t likely to happen. And then there’s the fact Van der Poel would likely need a disc-brake version of the wheels, and we know Ineos wouldn’t have that in their trucks. </p>\n\n\n\n<p>In the end, Klem located an unused pair with Ineos Grenadiers rider Cameron Wurf and recruited a friend (and obvious fan of cycling) to make the 10-hour drive from Wurf’s place in Andorra to hand-deliver the wheels to Alpecin-Fenix in Rennes. </p>\n\n\n\n<p>“I’m crazy about cycling, and what Mathieu has done in the past few days borders on the unbelievable,” said Mark Putter, owner of the Pyrenees-based hotel Les Deux Vélos. “If I can lend that boy a hand by delivering the fastest wheels, I think that’s a great job. It would be wonderful if he immediately keeps the yellow jersey with a second lead. Then it could be because of those wheels.”</p>\n\n\n\n<p>It’s unknown exactly how much time a pair of Princeton Blur 6560 wheels will save over the fairly flat 27.2 km course, but it’s clearly enough of an advantage for both Ineos Grenadiers and Alpecin-Fenix to use something other than what team sponsors provide.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/the-900-km-drive-to-deliver-faster-time-trial-wheels-for-mathieu-van-der-poel/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d1b331639e5380133bb99b490a4fc99ead4d04ca09a938a552b3cf0e3b728322","category":"Cycling"}