{"title":"Toward Contamination in Coastal Regions for Groundwater Quality, Fluoride, Nitrate and Human Health Risk Assessments Within Multi-aquifer Al-Hassa, Saudi Arabia","link":"https://www.preprints.org/manuscript/202403.1822/v1","date":1711702839000,"content":"Contamination in coastal regions attributed to fluoride and nitrate cannot be disregarded, given the substantial environmental and public health issues they present worldwide. Maintaining water quality is crucial for environmental well-being. This comprehensive study was performed to assess the spatial as well as indexical water quality, identify contamination sources, and evaluate associated health risks pertaining to nitrate and flouride in AlHassa region, KSA. The physiochemical results revealed a pervasive pollution of the overall groundwater. The dominant water type was Na-Cl, indicating saltwater intrusion and reverse ion exchange impact. Spatiotemporal variations in physicochemical properties suggest diverse hydrochemical mechanisms, with geogenic factors primarily influencing groundwater chemistry. The groundwater pollution index varied between 0.8426 and 4.7172, classifying samples as moderately to very highly polluted. Similarly, the synthetic pollution index (in the range of 0.5021-4.0715) revealed that none of the samples had excellent water quality, with various degrees of pollution categories. Nitrate Health Quotient (HQ) values indicated chronic human health risks ranging from low to severe, with newborns being the most vulnerable. Household use of nitrate-rich groundwater for showering and cleaning did not pose significant health risks. Fluoride HQ decreased with age, and children faced the highest risk of fluorosis. The Hazard Index (HI) yielded moderate to high-risk values. Nitrate risks were 1.21 times higher than fluoride risks, as per average HI assessment. All samples fell into the vulnerable category based on the Total Hazard Index (THI), with 88.89% classified as very high risk. This research provides valuable insights into groundwater quality, guiding water authorities, inhabitants, and researchers in identifying safe water sources and vulnerable human populations. The results highlight the need for appropriate treatment techniques and long-term coastal groundwater management plans.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1c3122f07d8366aa33194ef7b79802141dcf67a79e353fa645a5489338a2f50","category":"Interdisciplinary"}