{"title":"Disney+ Won't Offer a Cheaper Ad-Supported Plan Anytime Soon","link":"https://www.macrumors.com/2021/06/16/disney-plus-no-plans-for-ad-supported-plan/","date":1623831797000,"content":"With the popularity of Disney+ showing no signs of abating, Disney is satisfied with its paid subscriber model and has no plans to introduce a cheaper ad-supported tier anytime soon.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/disney-plus.jpg\" />\r\n<br />\r\nThat was the take-home message from Disney CEO Bob Chapek when asked about the possibility of a cheaper plan offering for its video streaming service, according to <em><a href=\"https://www.theverge.com/2021/6/15/22535861/disney-plus-cheaper-ad-supported-plan\">The Verge</a></em>. Speaking at the Credit Suisse 23rd Annual Communications Conference on Tuesday, Chapek said:\r\n<br />\r\n<blockquote>\"We're always re-evaluating how we go to market across the world, but we've got no such plans now to do that. We're happy with the models that we've got right now. We won't limit ourselves and say no to anything. But right now, we have no such plans for that.\"</blockquote>Discounted plans for ad-supported streaming have become increasingly popular with other services such as Hulu (which is owned by Disney) and HBO Max, which introduced an ads tier in May which cut its rate by $5. However, when it looks at the upward curve of its subscriber figures graph, Disney clearly sees no need for an alternative to its paid-for subscription.\r\n<br />\r\n\r\n<br />\r\nIndeed, Disney in March <a href=\"https://www.macrumors.com/2021/03/24/disney-plus-price-increase/\">raised</a> the price of its subscription streaming service by a dollar, from $6.99 to $7.99, with the yearly subscription also increasing. Despite the price hike, Disney+ continues to increase its subscriber base. In May the company <a href=\"https://www.macrumors.com/2021/05/13/disney-plus-103-million-subscribers/\">said</a> it had reached over 103 million global paid subscribers and that it expected to more than double that number by 2024, potentially surpassing Netflix.\r\n<br />\r\n\r\n<br />\r\nDisney+ launched at the same time as <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a>, but it has grown much more rapidly given the available back catalog of Disney, Marvel, and Star Wars content, along with new TV shows like \"The Mandalorian,\" \"WandaVision,\" and \"The Falcon and the Winter Soldier.\"\r\n<br />\r\n\r\n<br />\r\nApple has never provided details on ‌‌Apple TV+‌‌ subscribers so there's no direct comparison to be made, but Apple's subscriber numbers are nowhere near Disney's because Apple still has many people who are on free trials that have been continually extended. \r\n<br />\r\n\r\n<br />\r\nThat's set to change soon, however. From July 1, Apple is <a href=\"https://www.macrumors.com/2021/06/15/apple-tv-plus-three-month-free-trial/\">reducing</a> its one year free trial of ‌Apple TV+‌ with eligible Apple device purchases to just three months, which will truly test the staying power of its audience.\r\n<br />\r\n\r\n<br />\r\nApple is working hard to bolster its selection of original movies and TV shows, but it will be several years yet before ‌‌Apple TV+‌‌ has a catalog that can compete with Disney+. Going forward, Disney has set a target of 100+ new titles per year across Disney Animation, Disney Live Action, Marvel, Star Wars, and National Geographic.<div>Tag: <a href=\"https://www.macrumors.com/guide/disney-plus/\">Disney Plus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/16/disney-plus-no-plans-for-ad-supported-plan/\">Disney+ Won't Offer a Cheaper Ad-Supported Plan Anytime Soon</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/disney-wont-offer-a-cheaper-ad-supported-plan-anytime-soon.2301109/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n5BObEpoWqw:rEjwci4w4xU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n5BObEpoWqw:rEjwci4w4xU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/n5BObEpoWqw\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d1c66fd257afb2fa3de533c87d946c00336f17a7b6f1c4582d8568777bca4865","category":"Apple"}