{"title":"DNA Methylation and Subgenome Dominance Reveal the Role of Lipid Metabolism in Jinhu Grouper Heterosis","link":"https://www.preprints.org/manuscript/202407.2407/v1","date":1722406820000,"content":"Heterosis of growth traits in economic fish has benefited the production of aquaculture for many years, yet its genetic and molecular basis has been remained obscure. Nowadays, a new germplasm of hybrid Jinhu grouper (Epinephelus fuscoguttatus♀ × E. tukula♂), exhibiting paternal-biased growth heterosis, has provided an excellent model for investigating the potential regulatory mechanisms of heterosis. We integrated transcriptome and methylome to unravel the changes of gene expression, epigenetic modification, and subgenome dominance in Jinhu grouper compared with maternal E. fuscoguttatus. Integration analyses showed that the heterotic hybrids showed lower genomic DNA methylation levels than the purebred parent, and the up-regulated genes were mostly DNA hypomethylation. Furthermore, allele-specific expression (ASE) detected paternal subgenome dominance regulated paternal-biased heterosis, and paternal bias differentially expressed genes (DEGs) were wholly up-regulated in the muscle. Muti-omics results highlighted the role of lipid metabolism, particularly “Fatty acid synthesis”, “EPA biosynthesis”, and “Signaling lipids”, in Jinhu grouper heterosis formation. Coherently, our studies have proved that the eicosapentaenoic acid (EPA) of Jinhu grouper was greater than that of maternal E. fuscoguttatus (8.46% vs 7.46%). Finally, we constructed a potential regulatory network for control of the heterosis formation in Jinhu grouper. Among them, fasn, pparg, dgat1, igf1, pomca, fgf8a, and fgfr4, were identified as key genes. Our results provide new and valuable clues for understanding paternal-biased growth heterosis in Jinhu grouper, taking a significant step towards the molecular basis of heterosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1c9a3e50b005696e0a59052833426949ebb89250b584e81925deec3a6632366","category":"Interdisciplinary"}