{"title":"Exploring the Potential of Agriculture Diversification as a Pathway to Improved Smallholder Livelihood Dietary System in Nepal","link":"https://www.preprints.org/manuscript/202409.1928/v1","date":1727230500000,"content":"Agriculture is the major economic source for the national GDP of Nepal, where the larger population of smallholder farmers engage in farming and grow few major crops using limited resources. According to recent data, agriculture production is declining gradually in contrast to the exponential population growth rate. Also, Rural populations are shifting towards urban areas resulting in numerous challenges and problems of food insecurity and malnutrition. However, the major reason behind malnutrition all over the globe is due to monocropping. Agriculture diversification is the strategic approach to overcome these challenges. We articulate two theories of Utility-Maximization theory and Entitlement theory to build a new theory of Utility-entitlement, which helps explain the relationship and causes related to agriculture diversification and food variety in Nepal. The secondary data were collected from the Nepal Household Risk and Vulnerability Panel Survey conducted over three years (2016-18). We use the Simpson diversification index, food consumption score, and linear regression model as a method of analysis. The result reveals that Agriculture diversification and dietary diversity have a highly positive significant relationship, and the major factor associated with this is Market access. Upland type, canal or rainfed irrigation, and market access are the factors for agriculture diversification. As a policy recommendation, the government and development sector should focus on a geographical approach- an upland area, especially during the dry cropping season facilitated with infrastructure and transportation for easy market access.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1cd017dab410fddf020fd3da3b0c70adbf4a61bf668136e28982e81aff325aa","category":"Interdisciplinary"}