{"title":"Women's WorldTour Calendar 2021: The Rouleur Racing Guide","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide","date":1617187348000,"content":"\n      <p><span></span><span>After a late start due to the cancellation of the Australian races, the Women’s World Tour (WWT) season is well underway now. </span></p>\n<div></div>\n<p><span>So far, each WWT race has been won by a different rider from a different team; with Chantal van den Broek-Blaak (SD Worx) outdoing Elisa Longo Borghini (Trek-Segafredo) to take Strade Bianche, Longo Borghini taking Trofeo Alfredo Binda in emphatic style, Grace Brown (BikeExchange) time trialling to a win and upsetting the sprinters at De Panne, a classic show of speed and style from Marianne Vos (Jumbo Visma) at Gent-Wevelgem and the return of Annemiek van Vleuten (Movistar) at Flanders. </span></p>\n<p><span>Last year’s dominant duo of Anna van der Breggen (SD Worx) and Annemiek van Vleuten (Movistar) were absent from racing between Strade Bianche and Flanders. We saw a return to the Annemiek van Vleuten we're used to at Flanders, and Anna van der Breggen forcing the winning split, but will they be able to fend off an increasingly strong group of favourites throughout this season? Van der Breggen has yet to take a WWT win this season, but with Ardennes coming up that looks likely to change imminently. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/eight-questions-to-be-answered-in-women-s-cycling-in-2021\"><em><strong> Related – Eight questions to be answered in women's cycling in 2021</strong></em></a></p>\n<h4><strong>Races so far </strong></h4>\n<p><span>Strade Bianche 1. WWT (06/03) – <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-2021-debrief\">Debrief</a></span></p>\n<p><span>Trofeo Alfredo Binda 1.WWT  (21/03) – <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/trofeo-alfredo-binda-2021-video-debrief\">Debrief</a></span></p>\n<p><span>Oxyclean Classic Brugge-De Panne 1.WWT (24/03)</span></p>\n<p><span>Gent-Wevelgem In Flanders Fields 1.WWT (28/03)</span></p>\n<p><span>Tour of Flanders/Ronde van Vlaanderen 1.WWT (04/04) </span>– <a href=\"https://www.youtube.com/watch?v=eEdRzY-7_Sc&amp;t=2s\">Debrief</a></p>\n<br />\n<h3><b></b></h3>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00066_1024x1024.jpg?v=1617179834\" /></div>\n\n<p><em>Photo credit: Zac Williams/SWpix.com</em></p>\n<h3><b>Amstel Gold Race 1.WWT (18/04) </b></h3>\n<p><span>The first edition of the women’s Amstel Gold race was held in 2001, however there would only be a further two editions before the race was shelved with the organisers citing difficult logistics as the reason.</span></p>\n<p><span>It was in 2017— after a 14-year hiatus —that the revamped edition of the women’s Amstel Gold Race returned, with Anna van der Breggen taking the win. Due to the pandemic, the race was not held in 2020 and the 2021 version will be held on a closed </span><span><span>—</span></span>but no less challenging <span>—</span> 16.5km circuit featuring the Bemelerberg, Geulhemmerberg, and Cauberg with the women completing seven laps.</p>\n<p><span><strong>Favourites:</strong> Anna van der Breggen, Kasia Niewiadoma, Annemiek van Vleuten, Marianne Vos, Elisa Longo Borghini, Ashleigh Moolman Pasio.</span></p>\n<p><span><strong>Outsiders:</strong> Kristen Faulkner, Mavi Garcia, Marta Cavalli.</span></p>\n<br />\n<h3><b>La Fleche Wallonne 1.WWT (21/04)</b></h3>\n<p><span>The second Ardennes classic of the season is also one of the longest-established one-day races for women with the first edition held in 1998. </span></p>\n<p><span>If recent years are anything to go by this race belongs to Anna van der Breggen (SD Worx) who has won every edition since 2015 — can anyone challenge her on the Mur de Huy or will she take a seventh win?</span></p>\n<p><span><strong>Favourites:</strong> Anna van der Breggen, Annemiek van Vleuten, Marianne Vos, Kasia Newiadoma, Demi Vollering.</span></p>\n<p><span><strong>Outsiders:</strong> Kristen Faulkner, Mikayla Harvey.</span></p>\n<br />\n<h3><b>Liège–Bastogne–Liège 1.WWT (25/04)</b></h3>\n<p><span>The finale of last year’s fourth edition of Liège–Bastogne–Liège Femmes was nail-bitingly close as Grace Brown (BikeExchange) tried to chase down Lizzie Deignan (Trek-Segafredo) who had been away solo. Deignan held the Australian off but the final margin between Deignan and Brown was just nine seconds. </span></p>\n<p><span>This year, as if it wasn’t hilly enough, the 141km race features a new climb: the Côte de Desnié in addition to the rest of the back-loaded côtes. </span></p>\n<p><span><strong>Favourites:</strong> Lizzie Deignan, Anna van der Breggen, Marianne Vos, Annemiek van Vleuten, Kasia Niewiadoma. </span></p>\n<p><span><strong>Outsiders:</strong> Floortje Mackaij, Demi Vollering, Amanda Spratt.</span></p>\n<br />\n<h3><b>Festival Elsy Jacobs 2.Pro (30/04-02/05)</b></h3>\n<p><span>Only the second stage race of the season for the women but the start of a string of them throughout the month of May. Festival Elsy Jacobs might not be a World Tour race but it certainly attracts a World Tour crowd. </span></p>\n<p><span>Held in Luxembourg where the eponymous first ever women’s UCI Road World Championship and former Hour record holder was from, the race has been run since 2008. Marianne Vos has been victorious on three occasions while Anna van der Breggen has won two editions. The race was not held in 2020 but the previous four editions have each been won by different riders.  </span></p>\n<p><span><strong>Favourites:</strong> Lisa Brennauer, Christine Majerus.</span></p>\n<p><span><strong>Outsiders:</strong> Lizzy Banks, Lisa Klein.</span></p>\n<br />\n<h3><b>Vuelta a Burgos Féminas 2.WWT (20/05-23/05)</b></h3>\n<p><span>New to the WWT for 2021, Vuelta a Burgos Feminas started out as a Spanish National Cup race before moving up to UCI status in 2019. The race comes off the back of a series of 1.1 races in the north west of Spain and the four stages look set to be for the climbers.</span></p>\n<p><span><strong>Favourites:</strong> Annemiek van Vleuten, Mavi Garcia, Ashleigh Moolman Pasio, Anna van der Breggen.</span></p>\n<p><span><strong>Outsiders:</strong> Marta Cavalli, Ane Santesteban.</span></p>\n<strong>Internationale Lotto Thüringen Ladies Tour 1.Pro (25/05-30/05)</strong>\n<p><span>Again, not World Tour, but as the longest-running (and longest) women’s stage race on the calendar (held since 1986) the German race is worth a mention. </span></p>\n<p><span>The race, held in the German region of </span><span>Thuringia, was</span> upgraded to 2.Pro status in 2020 however due to the pandemic it was unable to run. Back again for 2021 and still with 2.Pro status, the six-day long race will be held in late may rather than its usual early June slot. </p>\n<p><span><strong>Favourites:</strong> Lisa Brennauer, Lisa Klein, Ellen van Dijk.</span></p>\n<p><span><strong>Outsiders:</strong> Kathrin Hammes, Liane Lippert.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200829LCB2044-A.S.O.__Thomas_Maheux_1024x1024.jpg?v=1617179462\" /></div>\n\n<p><em>Photo credit: A.S.O./ Thomas Maheux/SWPix.com</em></p>\n<h3><b>La Course 1.WWT (27/06)</b></h3>\n<p><span>Last year’s La Course was one of the most exciting races of the season, with Lizzie Deignan beating Marianne Vos in a sprint to the line in Nice after team mate Elisa Longo Borghini set her up perfectly. </span></p>\n<p><span>La Course has a mixed pedigree, starting out as a circuit race around the Champs Elysees on the final day of the men’s Tour de France </span></p>\n<p><span>This year’s edition will mark the longest in the event’s history at 130km and feature six ascents of the Mûr-de-Bretagne. It is also the last one-day event before the Olympics Road Race so expect the peloton to be sizing each other up. </span></p>\n<p><span><strong>Favourites:</strong> Lizzie Deignan, Marianne Vos, Anna van der Breggen, Annemiek van Vleuten, Kasia Niewiadoma, Elisa Longo Borghini, Cecille Uttrup Ludwig.</span></p>\n<p><span><strong>Outsiders:</strong> Évita Muzik, Marta Cavalli, Mavi Garcia, Soraya Paladin.</span></p>\n<br />\n<h3>Giro Rosa Internazionale Femminile 2.Pro (02/07-11/07)</h3>\n<p><span>Being demoted from WWT to 2.Pro this season when the organisers failed to supply live images of the race last year hasn’t deterred many high-profile riders from naming the Giro Rosa as a target race in 2021. </span></p>\n<p><span>Given that it’s so close to the Olympic it’s perhaps not a surprise that riders want to use the 10 day event as a tuneup before the big event. In true Giro Rosa style there is little to no information on the race as yet, other than it will be back up to the usual ten stages after being reduced to nine in 2020. </span></p>\n<p><span>After crashing out of the race while leading the GC in 2020, Annemiek van Vleuten will likely be back with a vengeance to claim her third win overall. </span></p>\n<p><span><strong>Favourites:</strong> Annemiek van Vleuten, Anna van der Breggen, Kasia Niewiadoma, Ashleigh Moolman Pasio, Cecilie Uttrup Ludwig.</span></p>\n<p><span><strong>Outsiders:</strong> Mikayla Harvey, Mavi Garcia, Soraya Paladin.</span></p>\n<br />\n<h3>Donostia San Sebastián Klasikoa Women 1.WWT (31/07)</h3>\n<p><span>A first edition of Itzulia Basque Country for women was due to take the place of Donostia San Sebastián Klasikoa this season, however due to the pandemic it was unable to go ahead. Organisers instead decided to hold another Donostia San Sebastián Klasikoa Women in place of the stage race, which will kick off in 2022 instead. </span></p>\n\n<p><span><span>Donostia San Sebastián Klasikoa Women was itself a new race in 2019, and has only had one pro edition so far, won by Lucy Kennedy (Team BikeExchange). </span><br /></span></p>\n<p>Favourites: Annemiek van Vleuten, Cecille Uttrup Ludwig, Lucy Kennedy</p>\n<p>Outsiders: Mavi Garcia, Janneke Ensing.</p>\n<h3>Postnord Vårgårda WestSweden TTT 1.WWT (07/08)</h3>\n<p><span>Since the World Championship TTT was taken off the calendar in 2018 this is one of the few</span><span><span>—</span></span> if not the only<span>—</span> TTT outing in the season for the women. </p>\n<p><span>In its earlier iterations it was dominated by Specialized-Lululemon (now Canyon//SRAM) and latterly by Boels Dolmans (now SD Worx) however it was Trek-Segafredo who took the last win in 2019.  </span></p>\n<p><span><strong>Favourites:</strong> SD Worx, Canyon//SRAM, Team BikeExchange.</span></p>\n<p><span><strong>Outsiders:</strong> Team DSM, Liv Racing, Ceratizit-WNT.</span></p>\n<br />\n<h3>Postnord Vårgårda WestSweden RR 1.WWT (08/08)</h3>\n<p><span>Usually an outing for the sprinters, the Swedish race was last won by Marta Bastianelli in 2019, however the inimitable Marianne Vos has taken the win three times in the race’s fourteen year history.</span></p>\n<br />\n<p><span><strong>Favourites:</strong> Emma Cecille Norsgaard, Chloe Hosking, Lotte Kopecky, Emilia Fahlin, Mariane Vos, Kirsten Wild, Elena Cecchini, Elisa Balsamo. </span></p>\n<p><span><strong>Outsiders:</strong> Letizia Paternoster, Arlenis Sierra, Lotta Henttala.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SF210312-10178_1024x1024.jpg?v=1615819391\" /></div>\n<h3><strong></strong></h3>\n<h3><strong>Ladies Tour of Norway 2.WWT (12/08-15/08)</strong></h3>\n<p><span>The Ladies Tour of Norway was due to collaborate with Danish and Swedish federations to organise a six-day ‘Battle of the North’ stage race across Norway, Denmark and Sweden last year. Unfortunately, the pandemic delayed the plans and </span><span>—</span> although the race is set to go ahead in 2022 <span>—</span> the Ladies Tour of Norway remains a standalone four-day stage race for 2021. </p>\n<p><span>Established in 2014, the race is relatively new but has been ambitious from the beginning, quickly rising to World Tour status in 2017 since when Marianne Vos has won every edition. </span></p>\n<p><span><strong>Favourites:</strong> Marianne Vos, Lorena Wiebes, Emma Cecille Norsgaard, Marta Bastianelli, Amalie Dideriksen.</span></p>\n<p><span><strong>Outsiders:</strong> Marta Cavalli, Lisa Klein, Coryn Rivera, Emilia Fahlin.</span></p>\n<br />\n<h3><strong>Simac Ladies Tour 2.WWT (24/08-29/08)</strong></h3>\n<p><span>Another stage race with a relatively long history relative to many women’s races, Boels Ladies Tour went by the name Holland Ladies Tour from when it was first held, in 1998, before changing names due to sponsorship, eventually becoming Boels Rentals Ladies Tour and now Simac Ladies Tour. </span></p>\n<p><span>The most recent winner was Christine Majerus in 2019. The race usually comprises a mix of flat and hillier stages as well as an individual time trial.</span></p>\n<p><span><strong>Favourites:</strong> Christine Majerus, Lizzie Deignan, Annemiek van Vleuten, Lisa Brennauer, Anna van der Breggen.</span></p>\n<p><span><strong>Outsiders:</strong> Marta Cavalli, Leah Thomas.</span></p>\n<h3><strong> GP de Plouay - Lorient- Agglomération Trophée CERATIZIT 1.WWT (31/08) </strong></h3>\n<p><span>One for the punchier riders who can make it over steep climbs, GP de Plouay favours riders like Lizzie Deignan and Marianne Vos who have won the race three times and twice between them. Although Anna van der Breggen has also taken the win at Plouay in a solo break.</span></p>\n<p><span><strong>Favourites:</strong> Anna van der Breggen, Lizzie Deignan, Anna van der Breggen.</span></p>\n<p><span>Outsiders: Amy Pieters, Grace Brown, </span>Lizzy Banks.</p>\n<h3><strong>Ceratizit Challenge by la Vuelta 2.WWT (03/09-05/09) </strong></h3>\n<p><span>The Ceratizit Madrid Challenge is usually one of the last WWT races </span>of the season. Coinciding with the final stages of the Vuelta a España, the race — much like La Course before it —started life as a criterium around the streets of the city. In recent years, however, it has been upgraded to a three day stage race featuring a time trial, road stage and a circuit race. </p>\n<p>In a turn up for the sponsors, the past two editions have been won by Lisa Brennauer of Ceratizit-WNT.</p>\n<p><span><strong>Favourites:</strong> Lisa Brennauer, Lorena Wiebes, Elisa Longo Borghini, Ellen van Dijk.</span></p>\n<p><span><strong>Outsiders:</strong> Alice Barnes, Marta Cavalli, Elisa Balsamo.</span></p>\n\n<h3><b>Paris Roubaix 1.WWT (02/10)</b></h3>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\"><em>Read our full Paris Roubaix Femmes 2021 Preview</em></a></strong></p>\n<p><span>The moment that a women's Paris Roubaix popped up on the revised 2020 calendar was a seminal one for women's cycling </span><span>—</span> one of the most legendary races of the sport would now be contested by the women's peloton, too. However due to the increasingly dire pandemic situation at the time, the 2020 edition was cancelled.</p>\n<p>Fans thought they only had to wait until 11th April for the first women’s race on the hallowed cobbled roads of ‘The Hell of the North’ but, once again, the race found itself thwarted by the ongoing public health situation in France. The now twice-postponed inaugural women's Paris Roubaix will take place a day before the men's race, on the 2nd October — let's hope it's third time lucky.</p>\n<p>For the men, the race has been held since 1896 and has a long and feted history. The route released for the women’s race last October was a shorter, modified version which the start in Denain, just south of Roubaix. </p>\n<p><span>At 116km the route may appear truncated but the punishing terrain means there will be no shortage of a challenge for the peloton. The route for the women’s race incorporates 29.5km of cobbles including some of the hardest sectors such as the Carrefour de l'Arbre. </span></p>\n<p><span>While the women’s peloton do race over cobbles in other classics, those at Paris Roubaix are a different beast as many teams found out when they went to recon the course last year. Equipment and course knowledge will play a big part for whoever wants to make history by winning the first women’s edition of this iconic race.</span></p>\n<p><span><strong>Favourites:</strong> Chantal van den Broek-Blaak, Anna van der Breggen, Ellen van Dijk, Lucinda Brand, Marianne Vos.</span></p>\n<p><span><strong>Outsiders:</strong> Lotte Kopecky, Ceylin del Carmen Alvarado, Lisa Brennauer, Amy Pieters.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_4174_1024x1024.jpg?v=1617179699\" /></div>\n<p><em>Photo credit: Alex Whitehead/SWPix.com</em></p>\n<h3><strong>The Women’s Tour 2.WWT (04/10-09/10)  </strong></h3>\n<p><span>Both a fan and rider favourite, the Women’s Tour has quickly taken the place of one of the best World Tour stage races on the women’s calendar. After being forced to cancel the 2020 event, the organisers announced that the race was postponed from its usual June spot to October for 2021.</span></p>\n<p><span>The race often covers some of the most gruellingly tough parcours in the UK and although it doesn’t feature mountain passes, there is plenty of climbing. </span>For 2021 the race will feature a time trial for the first time in its history. </p>\n<p><span>The race has also offered equal prize money since 2018, and as of this year will be showing the race live for the first time. The parcours for the 2021 race has yet to be released, but a mix of terrain can be expected. </span></p>\n<p><span><strong>Favourites:</strong> Marianne Vos, Anna van der Breggen, Lizzie Deignan, Kasia Niewiadoma, Cecille Uttrup Ludwig.</span></p>\n<p><span><strong>Outsiders:</strong> Ashleigh Moolman Pasio, Lizzy Banks, Josceline Lowden.</span></p>\n<br />\n<h3><strong>Tour of Chongming Island 2.WWT (14/10-17/10) </strong></h3>\n<p><span>One of the few races for pure sprinters on the WWT calendar, the Tour of Chongming Island has been held in Shanghai since 2007. The race’s palmares is a who’s who of women’s sprinting, with Chloe Hosking, Jolien d’Hoore, Lorena Wiebes, Ina-Yoko Teutenberg, and Kirsten Wild all having won the four-day stage race.</span></p>\n<p><span><strong>Favourites:</strong> Chloe Hosking, Kirsten Wild, Emma Cecille Norsgaard, Jolien d'Hoore, Lorena Wiebes.</span></p>\n<p><strong>Outsiders: </strong>Letizia Paternoster, Arlenis Sierra, Lotta Henttala.</p>\n<br />\n<h3>Tour of Guangxi 1.WWT (19/10) </h3>\n<p><span>One of the newest races on the WWT calendar, the Tour of Guangxi, like Chongming Island is one for the sprinters.</span></p>\n<p><span>Guangxi is usually the final WWT race of the season, but with Ronde van Drenthe postponed this season it takes the penultimate slot, although it is unlikely to shake up the overall classification.</span></p>\n\n<p><span>There aren't too many chances throughout the season for them to really stretch their legs and go flat out for a finish and with some of the early-season sprint opportunities thwarted by breakaways they will be itching to launch the burners and round off the season in style.</span></p>\n\n<p><span><strong>Favourites:</strong> Chloe Hosking, Kirsten Wild, Emma Cecille Norsgaard, Jolien d'Hoore, Lorena Wiebes, Amalie Dideriksen.</span></p>\n<p><span><strong>Outsiders:</strong> Lotte Kopecky, </span>Letizia Paternoster, Arlenis Sierra, Lotta Henttala.</p>\n<br />\n<h3><b>Ronde van Drenthe 1.WWT (23/10)</b></h3>\n<p><span>The sprinters will want to make it back from China for another outing at Ronde van Drenthe just in case it comes down to a bunch kick. In the past few editions a reduced group has come to the line but it's a race that's been won by some of the fastest legs in the peloton including Jolien d'Hoore and former world champion Amalie Dideriksen. </span></p>\n<p><span><strong>Favourites:</strong> Amalie Dideriksen, Lorena Wiebes, Chantal van den Broek-Blaak, Amy Pieters, Ellen van Dijk.</span></p>\n<p><span><strong>Outsiders:</strong> Kirsten Wild, Lisa Klein.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d1ce48b9460a48d099ec92e1c52561e768bbc1431a53fb3d237d6dba3aae5b18","category":"Cycling"}