{"title":"Identification of hub genes involved in gibberellin-regulated elongation of coleoptiles of rice seeds germinating under submerged conditions","link":"https://academic.oup.com/jxb/article/75/13/3862/7640082?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Rapid elongation of coleoptiles from rice seeds to reach the water surface enables plants to survive submergence stress and therefore plays a crucial role in allowing direct seeding in rice cultivation. Gibberellin (GA) positively influences growth in rice, but the molecular mechanisms underlying its regulation of coleoptile elongation under submerged conditions remain unclear. In this study, we performed a weighted gene co-expression network analysis to conduct a preliminarily examination of the mechanisms. Four key modules were identified with high correlations to the GA regulation of submergence tolerance. The genes within these modules were mainly involved in the Golgi apparatus and carbohydrate metabolic pathways, suggesting their involvement in enhancing submergence tolerance. Further analysis of natural variation revealed that the specific hub genes <span>Os03g0337900</span>, <span>Os03g0355600</span>, and <span>Os07g0638400</span> exhibited strong correlations with subspecies divergence of the coleoptile elongation phenotype. Consistent with this analysis, mutation of <span>Os07g0638400</span> resulted in a lower germination potential and a stronger inhibition of coleoptile elongation under submerged conditions. The hub genes identified in this study provide new insights into the molecular mechanisms underlying GA-dependent tolerance to submergence stress in rice, and a potential basis for future modification of rice germplasm to allow for direct seeding.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"d1d0cd6882a15e9c45fdfa84a9b2a06c4af39fa923143565c713f810cc73209f","category":"Environment"}