{"title":"Sex Differences in Human Brain Networks from the Perspective of Small-World Properties","link":"https://www.preprints.org/manuscript/202406.1772/v1","date":1719318254000,"content":"Based on non-invasive neuroimaging techniques and graph theory-based network analyses, many researchers have tried to use small-world network model to elucidate sex differences in the brain. This manuscript aims to compile the related research findings from the past few years and summarize the sex differences in human brain networks from the perspective of small-world properties. We reviewed published reports examining altered small-world properties in both the functional and structural brain networks between males and females. Based on four patterns of altered small-world properties proposed--randomization, regularization, stronger small-worldization and weaker small-worldization, we found that current results point to a significant trend toward more regularization in females and more randomization in males in the functional brain networks. As for particular topological properties, the most consistent findings include a significant shift toward higher global efficiency in males and higher local efficiency in females in the functional network studies. On the other hand, there seems to be no consensus to date on the sex differences in small-world properties of the structural brain networks. Nevertheless, we noticed that the sample sizes in many published studies are limited, and future studies with larger samples are warranted to obtain more reliable results. We anticipate that the conclusions in this manuscript will contribute to a deeper understanding of neurobiological mechanisms underlying the sex differences in the brain.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1de89d9d3b8bf859d7a0fcd864a31f0c11625bacbbc261f5c984349d1e26848","category":"Interdisciplinary"}