{"title":"A Laboratory Machine Verifying the Operation of a Hydraulic Rope Equalizer with Tensometric Sensors","link":"https://www.preprints.org/manuscript/202403.1555/v1","date":1711449409000,"content":"In mining machines with friction discs, but also in multi-rope traction elevators, it is necessary to distribute the applied tensile load, generated by the weight of the cage and counterweight, evenly in all cross-sections of the load-bearing ropes. Hydraulic devices used for this purpose can operate on the principle of Pascal's law. The article presents a structural design, a 3D model and an implemented solution of a laboratory device capable of simulating a practical method of evenly distributing the total weight of the load into partial tensile forces of the same size acting on a selected number of load-bearing ropes. The laboratory equipment uses two pairs of three steel cables of finite length for the simulations. During the experimental measurements, tensile forces derived from the tractive force of the piston rods, pushed into the bodies of the hydraulic cylinders by the pressure of the hydraulic oil supplied through the pipeline under the pistons of the hydraulic cylinders, were detected. The resulting amount of hydraulic oil pressure in the hydraulic circuit influenced by different values of the hydraulic oil pressures in the hydraulic cylinders and by the pressure in the supply pipe was experimentally studied on the laboratory equipment. Simulations were also carried out in order to detect the hydraulic oil pressure in the hydraulic circuit caused by the change in the different magnitudes of the tensile forces in the ropes From the experiments carried out, it follows that with the appropriate choice of hydraulic elements and the design of the hydraulic circuit, the weight of the load, acting as the total pulling force in the ropes, can be evenly distributed (with a deviation of up to 5%) to all cross-sections of the load-bearing ropes. If the exact values of the hydraulic oil volumes under the pistons of all hydraulic cylinders are not known, it is not possible to calculate the pressure values in the hydraulic circuit when the valves of the hydraulic pipes are gradually opened.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1f07e0399e14732ff8ec5fc25e8043b30d570554f1ce6ba067d6223be85d595","category":"Interdisciplinary"}