{"title":"Pro history: Roger De Vlaeminck dominates the 1975 Tour de Suisse","link":"https://www.cyclist.co.uk/in-depth/roger-de-vlaeminck-tour-de-suisse","date":1686741792000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/roger-de-vlaeminck-tour-de-suisse\">Pro history: Roger De Vlaeminck dominates the 1975 Tour de Suisse</a></p>\n\n<p>As the 77 starters of the 39th <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-suisse-preview\" target=\"_blank\">Tour de Suisse</a> assembled in Baden on 12th June 1975 for an uphill prologue to Baldegg, there was one key question hanging in the air: how would Eddy Merckx go?</p>\n\n\n\n<p>It may be surprising that observers would be questioning the prowess of the most successful cyclist of all time before any race, let alone one that he had claimed the previous year. He was also the reigning World Champion, having secured his third rainbow jersey the previous August in Montreal, and had enjoyed one of his finest spring Classics campaigns, winning Milan-San Remo, Amstel Gold Race, Tour of Flanders and Liège-Bastogne-Liège, as well as claiming podium spots at Paris-Roubaix and Flèche Wallonne within a single month, on top of winning the six-stage Setmana Catalana.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-suisse-preview\">Tour de Suisse men’s 2023: Route, how to watch, start list and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/monument-man-roger-de-vlaeminck-profile\">Monument man: Roger De Vlaeminck profile</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>But while 1975 had started well for Merckx, in mid-May he had been struck down with tonsilitis and missed the Giro d’Italia. He went to the Tour de Romandie and the Dauphiné Libéré instead, where he finished 14th and 10th respectively. There were just three days between the end of the Dauphiné and the start of the Tour de Suisse, hence the questions.</p>\n\n\n\n<p>‘We can assume that a Merckx in full possession of his means would find no rival up to his measure on the roads of Switzerland,’ wrote Jean-Pierre Gattoni in the <em>Journal de Genève</em> on the eve of the race. ‘But this is not the case and, if the Belgian starts as favourite despite everything, he will still have to watch over and tame men who have been hardened by the Tour of Italy.’</p>\n\n\n\n<p>One such rider who was indeed hardened by three weeks racing around Italy was the Brooklyn team’s star turn, Roger De Vlaeminck, who had also enjoyed a stellar start to the year. On the mud of the cyclocross circuit he’d won national and World Championship titles, while on the road he’d claimed stages at both the Tour of Sardinia and Tirreno-Adriatico. In April he took a third – then record-equalling – Paris-Roubaix win by outsprinting Merckx, André Dierickx and Marc Demeyer in the famous velodrome (he’d take a fourth two years later).</p>\n\n\n\n<p>De Vlaeminck took that early-season form into the Giro d’Italia, delivering a total of seven stage wins and the points jersey while finishing fourth overall in a race that featured major climbs in no fewer than half of the stages. No wonder that in a field of few genuine contenders, De Vlaeminck was ranked alongside Merckx as the most favoured of the starters of the 1975 Tour de Suisse.</p>\n\n\n\n<h3>A most memorable day</h3>\n\n\n\n<p>Ten stages lay in wait for the riders for a total distance of 1,629km. In between the 3.7km prologue in Baden and the 20.4km race-closing time-trial in Affoltern am Albis lay a number of stiff tests, including ascents of the Flüela, Maloja and Simplon passes, and finishes at ski-stations such as Täsch and Laax.</p>\n\n\n\n<p>De Vlaeminck started strongly, claiming the prologue by 14 seconds over TI-Raleigh’s Bert Pronk and putting 24 seconds into Merckx. That night he had the leader’s jersey on his back. The next day he won again, this time prevailing in a ten-man sprint into the town of Frick.</p>\n\n\n\n<p>De Vlaeminck was happy to already have two stage wins to his name but was concerned at the amount of work his team had put into chasing the break down, with no other teams willing to take the wind.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"842\" height=\"297\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg 842w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-750x265.jpg 750w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>‘At the Giro, there was more cooperation than here,’ De Vlaeminck said afterwards. ‘In Italy, I was only looking for stage wins while [here] I can envisage the overall victory. But if tomorrow I see that it starts to be again like today, I’ll let go.’ </p>\n\n\n\n<p>De Vlaeminck didn’t let go and by the time he took his fourth win of the race on Stage 5 the view was beginning to form that he was all but unbeatable.  </p>\n\n\n\n<p>By the time of the final day of racing, De Vlaeminck had a 52-second lead over Merckx. After being written off earlier in the race, Merckx had begun to find something of his old self. He’d attacked hard on multiple occasions on the stage to Laax and then won the penultimate day’s stage into Frauenfeld. Both times, De Vlaeminck held firm. Now there was just a 105km road stage followed by a 20.4km time-trial left on the last day to close out the race. It would take a Merckx-like performance to turn things around. But if anyone was capable of a Merckx-like performance…</p>\n\n\n\n<p>As it turned out De Vlaeminck was simply too strong. He won the morning’s road stage ahead of Merckx as well as the final time-trial, again over Merckx. It meant that De Vlaeminck finished the race with a record six stage wins, the points jersey and a final margin on GC of 55 seconds over, yes, Merckx.</p>\n\n\n\n<p>‘De Vlaeminck – Insatiable,’ was the simple headline the next day. <a href=\"https://www.cyclist.co.uk/in-depth/monument-man-roger-de-vlaeminck-profile\" target=\"_blank\">In 2018 De Vlaeminck told <em>Cyclist</em></a> that it remained a special memory.</p>\n\n\n\n<p>‘Eddy Merckx stood three times beside me on the podium that day,’ he said, ‘but every time he was one step lower.’ While he would win other stage races, the 1975 Tour de Suisse was De Vlaeminck’s only national tour win. But it was one achieved in a style that proved him to be more than the pure Classics specialist he is celebrated as today.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/roger-de-vlaeminck-tour-de-suisse\">Pro history: Roger De Vlaeminck dominates the 1975 Tour de Suisse</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d1f1107816c95bf50fc68659d573faabe6ccf8e5ba4d752cd5c624a2c2df9a4d","category":"Cycling"}