{"title":"Internalizing and Externalizing Symptoms in Individuals with Neurofibromatosis Type 1:  A Systematic Review and Meta-analysis","link":"https://www.preprints.org/manuscript/202408.1693/v1","date":1724560369000,"content":"Background/Objectives: The disparities in internalizing and externalizing symptoms between individuals with versus without neurofibromatosis type 1 (NF1) are poorly understood, based on mixed evidence in the literature. The current meta-analysis aimed to synthesize existing findings on the topic and explore moderators of the group disparities. Method: Electronic databases were searched from inception to March 26th 2024, which identified 59 eligible studies (N of NF1 = 3,182, mean ages 2.38 to 46.4 years). The primary outcome was differences in internalizing and externalizing symptoms between individuals with and without NF1. Data were analyzed using robust variance estimation and random-effects models. Results: Compared with unaffected controls, individuals with NF1 showed more severe depressive (k = 21; g = 0.43; 95% CI [0.21, 0.65]), anxiety (k = 24; g = 0.27; 95% CI [0.01, 0.54]), somatic (k = 27; g = 0.56; 95% CI [0.30, 0.83]), total internalizing (k = 75; g = 0.50; 95% CI [0.33, 0.67]), aggression (k = 33; g = 0.33; 95% CI [0.08, 0.58]), delinquency, (k = 37; g = 0.43; 95% CI [0.26, 0.60]), and total externalizing symptoms (k = 47; g = 0.24; 95% CI [0.13, 0.35]). Studies that included more participants with NF1 who had ADHD or a lower verbal IQ reported greater group disparities in total internalizing symptoms or aggression. Conclusions: Findings highlight the importance of including psychosocial needs in monitoring and treating NF1. Future research should identify predictors of internalizing and externalizing symptoms within the NF1 population to inform our knowledge and intervention development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d1f81a58130dd7c55eda93dd4327aa16451cedb0d73c573d9c624654fb5bfda1","category":"Interdisciplinary"}