{"title":"How To Get Web Design Clients Fast (Part 1)","link":"https://smashingmagazine.com/2021/03/web-design-clients-fast-part1/","date":1616061600000,"content":"<p>Starting a web design business isn’t difficult. There’s a low barrier to entry, and almost anyone with some kind of design skill can start an agency. But if we’ve learned one thing, it’s that building a successful design business takes more than just web design chops. Whether you’re a freelancer or a full-scale web design company, you’ll encounter the same problems.</p>\n<p>In this two-part series, we’ll share the agency growth <strong>lessons we’ve learned</strong>. In this first part, we break down the pricing model that’s worked best for us and explain how to leverage it in your business. In the next article, we’ll share proven sales techniques you can use as you scale.</p>\n<p>Most web designers started freelancing or taking on agency clients because they love design. But if you’ve created a design agency, you know the artistic work often gets put to the side. Instead of working on creative projects, you spend your time on business structure issues and pricing models. Client hassles take up your day. And you’re continually selling just to keep your roster full.</p>\n<p>The truth is that to run a <strong>successful web design firm</strong>, you need to take on the mindset of a business owner. And that’s very different than just designing. Now, you have to juggle client work and growth tasks — you’re either overloaded with work or selling hard to pay next months’ rent.</p>\n<p>That dangerous feast-and-famine cycle is what puts a lot of hardworking, creative entrepreneurs out of business. They’re overwhelmed with client work, then rushing to sell, and again and again. That kind of stress will make anyone think about getting a day job!</p>\n<p>As we grew our successful web design agency, we learned that this cycle is just the symptom of a fractured business model. To run a successful business, you need <strong>a steady stream</strong> of recurring income. This model lets you design while not stressing all the time or worrying about where your next client will come from.</p>\n<p>And to do that, you need to shift how you think about design — from a product to a service. In this two-part series, we’ll explain how to use this model to profitably grow your web design business. </p>\n<h3>Recurring Revenue: The Solution For A Profitable Web Design Business</h3>\n<p>Once you start thinking about your work as an ongoing service, everything changes. Instead of one-off sales with inconsistent cash flow and constant selling, you’ll be generating income each month with minimal maintenance work, like site refreshes and seasonal updates. And instead of a big project taking all your time, you’ll be able to sign on new clients quickly.</p>\n<p>The basis of a service model is recurring payments, where the money comes in without us needing to land a big client or rush to finish up a project. And that stable source of revenue leaves plenty of time to find new clients to keep our pipeline full.</p>\n<p>As you grow, you’ll want to focus on one metric: <strong>monthly recurring revenue</strong>, or MRR. Recurring revenue is like a subscription for your website services, and it’s money you can count on every month.</p>\n<p>MRR makes sense because, as a business owner, most costs are billed monthly. You have rent, salaries, electricity, phone, internet, and other expenses that repeat each month. All you’re doing is aligning your income to your costs. Doesn’t that make more sense?</p>\n<p>The first step to earning on this scheme is to find your <strong>breakeven number</strong>. That’s the amount you need to make each month to cover your expenses. First, calculate your one-off and recurring fixed costs. These are expenses like computers, software subscriptions, and salaries. For example, let’s say you’re a one-person agency and you spend $500 on software and equipment each month.</p>\n<p>Next, you’ll want to add up the <strong>variable expenses</strong> that increase with each website, like a hosting plan, security, distribution, and taxes. That amount is how much each site will cost you to keep for a month. Maybe in your case, hosting each website for a client will cost $10 per month.</p>\n<p>If you sell website hosting, maintenance, and updating services at $60 per month, you’ll earn $50 in profit per site. To meet your goal of $500, you only need 10 clients to pay your business expenses. What’s neat about this model is that profit is up to you. Every extra client after your breakeven number is profit—and it’s up to you how much you want to make!</p>\n<p>You don’t have to transition your agency or freelance business all at once. You can gradually add MRR clients alongside your big projects until the recurring revenue is enough to support you —making this an attractive model for existing designers looking to break away from the feast-and-famine cycle and start earning a steady income.</p>\n<p>This <strong>service model</strong> is a mindset shift, to be sure, but it’s a smarter way of doing business. To succeed, start thinking in terms of a recurring service — not a one-and-done product.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4f3327d0-3f4f-490e-952b-6b595b5ce70a/2-web-design-clients-fast.jpg\" /></p>\n<h3>How To Find The Perfect Pricing Tiers For Your Design Services</h3>\n<p>There’s a science to pricing your services correctly, and it’s very different from how you might quote a larger project. Here’s the structure we use that helps us grow as fast as possible.</p>\n<p>Think of the price point that your target market could afford. (We’ll talk more about target markets in the next section). When you create your pricing, it’s a good idea to have more than one tier. Have <strong>at least two options</strong>: a basic plan and another package with more features. Different customers have different budgets, and you want prices that are attractive to everyone. We’ve done well with three plans priced at $30, $50, and $100 USD per month.</p>\n<p>Each package starts with the initial website creation and ongoing services, such as seasonal changes or site updates. To differentiate your premium tiers, add advanced features like more storage, faster updates, extra subpages, detailed traffic statistics, multilingual support, and more. Just remember, you want to be profitable on all your tiers. Make sure the services provided in each one still work out to the profitability you want. Don’t give away free work!</p>\n<p>We also recommend charging an <strong>upfront design fee</strong> of around $500 USD for all tiers in addition to your monthly recurring payment. This fee ensures potential customers are serious and keeps you from losing too much money if a customer quits after just a few months.</p>\n<p>We also recommend against ever charging web design agency services by the hour—if that’s how you do it now, consider changing your pricing method. As a designer, your goal is to get faster at designing great websites, and you shouldn’t be punished for this! For example, we developed the website builder <a href=\"https://www.sitejet.io/en?utm_source=smashing&amp;utm_medium=referral&amp;utm_campaign=article-part1\">Sitejet</a> for our team. It cut our design time by 70%—but we still get paid the same. Our pricing scheme rewards us for efficiency, so we’re always trying to design great sites in less time.</p>\n<p>The final strategy for pricing is to keep experimenting. Some customers will want extra services, so test out new pricing tiers as you see fit. Don’t be afraid to try something new!</p>\n<h3>How To Find The Right Kind Of Customers To Grow Your Business</h3>\n<p>It’s exciting to scale a business—but the scary part is finding those first few MRR clients, especially if you’ve only ever done one-off projects before. These are the strategies we’ve learned you can use to build up your business and keep it growing.</p>\n<p>The first step is to create a <strong>unique brand voice</strong>, which may be different from the one you have now. Your voice for MRR clients depends a bit on the type of customers you’d like to attract. But in general, you’ll want to sell yourself as an affordable full-service website design agency. You’ll be selling to smaller businesses, focusing on excellent services at a price small and medium businesses (SMBs) can afford.</p>\n<p>The key to great marketing is to show how a website leads to more sales. When you work in the web development business, it’s easy to focus on the technical details behind the sites you create, but that’s a mistake. Don’t talk about a custom theme or better UX design. Instead, talk about getting featured on search engines or attracting customers who expect a modern website. We’ll cover this more in the second part of this article series.</p>\n<p>We’ve mentioned a few times that you should only look to SMBs at first. But why?</p>\n<p>There are a few reasons <strong>SMBs are the best place to start</strong>. First, SMBs bring in recurring revenue that most big clients can’t offer. Bigger clients expect a lot of work, but most local businesses will be happy to pay $50-100 USD per month for small changes like seasonal announcements. These only take a few minutes for you, which is why a lot of small sites usually result in more revenue than a few big projects.</p>\n<p>Second, small sites allow you to develop a portfolio quickly, which is helpful when you’re just starting to serve small businesses. If you’re designing new sites every week—instead of every few months—you’ll be able to show off your skills faster, which means it’ll be even easier to find new clients.</p>\n<p>And finally, <strong>small sites bring security</strong>. You’ve probably heard horror stories of designers or agencies with one or two clients. One quits for whatever reason and leaves the designers broke and desperate. The bigger your clients, the less you can afford to lose them, and the riskier your business model becomes.</p>\n<p>That’s why we recommend smaller clients, but a lot of them. If an agency with giant clients loses one or two, it can lead to bankruptcy. But if a handful of our clients canceled in one day, it would barely hurt our business. This helped us early on. In just a few months after using the MRR business model, we already had around 50 clients. That steady income let us hire more designers and keep growing the agency.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e110b470-a069-4128-8948-ec3f53f6e3c0/3-web-design-clients-fast.png\" /></p>\n<h3>How To Pick The Best Client Niche For You</h3>\n<p>The very first MRR client is always the most challenging—where do you look? You might be tempted to visit freelance marketplaces or randomly contact every local business, but don’t! The answer is more straightforward than you might expect. You just need to choose a single vertical or industry to start with. Once you’ve excelled at one niche, you can move to others. Using this strategy, we approached various sectors and are now servicing over 70 different verticals.</p>\n<p>Having a <strong>narrow niche</strong> makes it easier to sell to a prospective customer. For example, let’s say you’re trying to acquire a construction client. The best way to get them interested is to show them another construction website, especially if it’s one with a similar color scheme and branding. Sticking with similar businesses makes this easy.</p>\n<p>You’ll also develop skills and a reputation serving this vertical. For example, if you’ve created websites for ten hair salons in your local area, you’ll quickly become the go-to designer for salon owners.</p>\n<p> Being the “go-to designer” in a niche will bring in free referrals since local business owners are always looking for peer recommendations.</p>\n<p>How should you choose a vertical? Well, start by thinking of areas where you already have experience or references. Ask yourself these questions to find a good match for your expertise and skillset:</p>\n<blockquote><p>“What industries have you worked with before?”<br /><br />What businesses do you know about?”<br /><br />“What types of businesses have you worked in before, if any?”<br /><br />“What local businesses do you know about or use often?”<br /><br />“What interests do you have in common with various local businesses?”</p></blockquote>\n\n<p>An easy way to enter a niche is to study the clients you’re already serving. If you helped a corporate cosmetics company, local salons could be an easy fit. But it doesn’t just have to be design experience. If you had a part-time restaurant job in college, love clothes and fashion, or always recommend the same barber to friends, you might have a great starting place.</p>\n<p>Once you have this vertical, you’ll want to <strong>create buyer personas</strong> and target everything towards them. Spend some time planning out exactly who your ideal customers are. Think carefully about what the owners care about, what their days look like, and how a website will help them grow their business.</p>\n<p>Do some market research to learn more about your <strong>target persona</strong>. Searching online is easy, but you can get better information by calling those types of businesses or meeting some business owners. As you gather more information, you can use it to reach more business owners in the same vertical.</p>\n<p>As you grow, you can repeat this process to expand into more and more verticals.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/aa497f97-9ec1-4a47-892f-aceaee174433/1-web-design-clients-fast.jpg\" /></p>\n<h3>How To Find Great Clients</h3>\n<p>As you find more clients, it’s easy to say yes to everyone. But to stay profitable, you need to focus on your strengths and only take on clients that will help you reach your goals.</p>\n<p>First, you want to make sure every client is happy to pay your prices. The tiers help keep you flexible for different budgets, but if a client tries to bargain down your price, it’s a red flag. It’ll be stressful to work with them once you sign them on, and they’re probably not worth the effort. Also look out for clients who ask for special favors since extra work will eat away at your profits.</p>\n<p><strong>Note</strong>: <em>Of course, if enough clients ask for a specific service, you can consider creating a new tier or adding the feature to an existing package at a fair price. But don’t make special deals with individual clients.</em></p>\n<p>As we mentioned earlier, you should also avoid the temptation of big-ticket projects. While the number seems big, <strong>you’ll earn more with smaller websites</strong>. It sounds counterintuitive that small sites would make more, but it all comes back to the magic of recurring revenue.</p>\n<p>For example, let’s say a potential client asks you to create a sophisticated portal website for $10.000 USD. But in the same amount of time, you could build 15 simpler sites. Those smaller sites would generate $7.500 USD in setup fees and $750 in MRR. After a year, you would have earned almost twice as much from smaller sites than the big project!</p>\n<p>You also need to say no if a client asks you to help with other related services, like content marketing or social media. Unless these services are part of your agency growth plan, focus only on website design. The time you spend building a content strategy or promoting on Facebook is time you could be earning more recurring revenue with web design.</p>\n<p>A great solution here is to <strong>partner with other agencies</strong> or freelancers that specialize in these services. If someone asks for a logo or an ad campaign, you can refer them to your colleague, and in turn, they can mention you when their clients ask for website designs.</p>\n<p>One of the easiest ways to get more MRR clients for your web design service is word-of-mouth marketing. Your original customers have put their trust in you, and you need to reward that trust with incredible customer service and attention to detail. You can even showcase the sites you develop for them and (with their permission) list them as references to help potential customers make a decision.</p>\n<p> Treat your early customers well, provide prompt and friendly service, and you’ll keep them for years to come.</p>\n<p>But not only are strong client relationships important for referrals, they also help keep you profitable! The most time-intensive part of your job is finding new clients and designing their site. Every month a client happily pays you, the more profit you make off the original sale.</p>\n<h3>What We’ve Learned About Growing A Web Design Business</h3>\n<p>Running a web design agency isn’t easy. Our sincere hope is that some of the things that work for our team will work for you as well. Our agency has been going strong for years now, and the business still runs on the same principles we used when we started. What we’ve shared above is enough to get you started, but it’s only the beginning!</p>\n<p>As you grow, you’ll <strong>learn strategies</strong> that help you become more efficient and identify areas where you can improve. To give you an example: We focused a lot on process efficiency and built our design and management tool <a href=\"https://www.sitejet.io/en?utm_source=smashing&amp;utm_medium=referral&amp;utm_campaign=article-part1\">Sitejet</a> to reduce the creation time per website by 70% and optimized all customer interaction processes (e.g., feedback management) for more effortless communication. It’s created to help designers grow their business and give back time for what you love: being creative.</p>\n<p>Design skills are essential to making a living in the design world. But to succeed, you also need plenty of hard work and <strong>a willingness to experiment</strong> until you get it right. Start with the right mindset, and you’ll be amazed at what you can build.</p>\n<p>In this first part of our series, we’ve explained the basics of finding your first few MRR clients. But to keep growing, you need scalable sales to bring in a steady stream of high-quality clients. That’s what we’ll cover next: the step-by-step methods we’ve learned to scale an agency quickly. Stay tuned!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"d1fccd9333c82fc01c46f7e52b6893529883cd6d1990dd4cca8a03eb0c345971","category":"Tech"}