{"title":"Non‐senescent species are not immortal: Stress and decline in two planaria species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14184?af=R","date":1727841528000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/fdbb3c21-e38e-49da-8264-653bcd3a30fe/jane14184-toc-0001-m.png\" alt=\"Non-senescent species are not immortal: Stress and decline in two planaria species\" />\n<p>Our work offers an important contribution to understanding how species with negligible or negative senescence respond to variation in available resources that could result in suboptimal conditions of stress. Using potentially immortal planaria, with unique life histories, as our system we provide novel insight into this under-represented area of research.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPotential immortality is observed in several species (e.g. prickly pear cactus, hydra and flatworms) and is indicative of their negligible or even negative senescence rates. Unlike in senescent species, which experience reduced individual performance with age due to physiological degradation, species with negligible or negative senescence display mortality rates that remain constant or decline with age, respectively. These rates vary across taxa and are correlated with life history traits. Yet, the extent to which variable resource availability, a key driver of variation in life history traits, impacts species that show negligible or negative senescence is currently unknown.\n\nHere, we examine whether and how variation in the quantity, quality and feeding interval of resources impact population structure, population performance and life history trait trade-offs in two long-lived planaria that do not senesce: <i>Schmidtea mediterranea</i> and <i>Dugesia tahitiensis</i>. In a full factorial design, different combinations of resource quantity (reduced intake, standard intake and high intake) and quality (high and low quality) were provided in two different feeding intervals (7-day and 14-day intervals) for 19 weeks.\n\nWe show that variability in resource availability, via decreases in quantity, quality and frequency of resources, does not diminish population viability in either species but does result in suboptimal conditions of stress in <i>S. mediterranea</i>.\n\nThe high population viability we report can be attributed to two different mechanisms: increased reproduction or increased investment into maintenance at the expense of reproduction. Moreover, which mechanism was responsible for said high population viability was context-dependent and modulated by the specific life history strategy of the two planaria species.\n\nWe show that suboptimal conditions can cause stress responses that have significant impacts on non-senescent species. The context-dependent response we observe suggests that species that do not senesce but are subject to suboptimal conditions of stress may ultimately exhibit declines in performance and ultimately die. A clearer understanding of the impact of suboptimal conditions of resource availability on non-senescent species is needed to determine the extent of stress experienced and ultimately whether a species can truly be immortal.\n</p>","author":"Jacques A. Deere, \nPenelope Holland, \nAziz Aboobaker, \nRoberto Salguero‐Gómez","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"d1fdc811dc3bee72ff3f526e4ec8017573c4cecf0057526d0895b801e6c909fd","category":"Environment"}