{"title":"Impact of Renewable and Non-Renewable Energy Consumption on the Production of the Agricultural Sector in the European Union","link":"https://www.preprints.org/manuscript/202407.1196/v1","date":1721043471000,"content":"This study aims to find countries that differ in their development of the agricultural sector in terms of environmental care and to examine the relationship between renewable and non-renewable energy consumption and agricultural sector production in European Union countries. The classification of countries was conducted using the principal component method and biplot. Panel data for the period 2000-2022 and a VAR model, an impulse response function (IRF) and causality tests were used for the study. The results indicate two distinct groups of countries that significantly differ in adopting green agricultural practices. Only seven EU countries stand out for sustainable agriculture with low pesticide use, a significant share of organic farms and high use of renewable energy in agriculture. Energy consumption affects agricultural production differently in the two groups of countries studied: in countries with sustainable agriculture, an increase in renewable energy consumption translates into a positive increase in agricultural production. On the other hand, an increase in non-renewable energy consumption shows a dampening effect on agricultural production growth, especially in countries with less sustainable agriculture. The study results highlight the need to promote renewable energy development in agriculture and raise awareness about the adverse environmental effects of intensive agriculture while emphasising the positive impact of organic agriculture on agricultural production.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2087f3dc6db0365ec7742ee23aa808adf690da67fec1cd3e30dde7220d131d5","category":"Interdisciplinary"}