{"title":"Efficacy and effectiveness of COVID-19 vaccines in Africa: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306309","date":1719583200000,"content":"<p>by Tajudeen Raji, Mosoka Papa Fallah, Nebiyu Dereje, Francis Kakooza, Nicaise Ndembi, Mohammed Abdulaziz, Merawi Aragaw, Jean Kaseya, Alain Ngashi Ngongo</p>\r\nBackground <p>Data on COVID-19 vaccine effectiveness to support regional vaccine policy and practice are limited in Africa. Thus, this review aimed to evaluate the efficacy and effectiveness of COVID-19 vaccines administered in Africa.</p> Methods <p>We systematically searched peer-reviewed randomized controlled trials (RCTs), prospective and retrospective cohort studies, and case-control studies that reported on VE in Africa. We carried out a risk of bias assessment, and the findings of this review were synthesized and presented in a narrative form, including tables and figures. The synthesis was focused on COVID-19 VE against various levels of the disease condition and outcomes (infection, hospitalization or critical, and death), time points, and variants of concern.</p> Results <p>A total of 13 studies, with a total sample size of 913,285 participants, were included in this review. The majority (8/13) of studies were from South Africa and 38.5% (5/13) were randomized clinical trials. The studies reported that a full dose of Pfizer-BioNTech vaccine had a VE of 100% against COVID-19 infection by Beta (B.1.351) and Delta variants and 96.7% against hospitalization by Delta variant. The Johnson and Johnson vaccine had VE ranging from 38.1%-62.0% against hospitalization and 51.9%- 86% against critical disease by Beta (B 1.351) variant. The Oxford–AstraZeneca vaccine had a VE of 89.4% against hospitalization by the Omicron variant but was not effective against the B.1.351 variant (10.4%). The Sinopharm vaccine had a VE of 67% against infection and 46% against hospitalization by Delta variant.</p> Conclusions <p>COVID-19 vaccines administered in Africa were effective in preventing infections, hospitalization, and death. These review findings underscore the need for concerted efforts of all stakeholders to enhance the access and availability of COVID-19 vaccines and reinforce public awareness to reach the high-risk, unvaccinated group of the African population.</p>","author":"Tajudeen Raji","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d20aa0f0efafe80bc333059fcd950ac6be836ba803c70ea19b89b6bf6fe641b5","category":"Interdisciplinary"}