{"title":"Evaluation of formaldehyde when complete feed and soybean meal were inoculated with porcine epidemic diarrhea virus, porcine reproductive and respiratory syndrome virus, and Seneca Valley virus 1","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae121/7739740?rss=1","date":1724371200000,"content":"<span><div>Abstract</div>Formaldehyde has been found to decrease virus concentrations in feed and ingredient matrices. Continued research is needed to identify the appropriate inclusion levels and application time for different viruses in these matrices. The objective was to evaluate different inclusion levels of formaldehyde when applied either pre- or postinoculation of porcine epidemic diarrhea virus (<strong>PEDV</strong>), type 2 porcine reproductive and respiratory syndrome virus (<strong>PRRSV</strong>), and Seneca Valley virus 1 (<strong>SVV1</strong>) to complete feed or soybean meal. The experiment was designed in a 2 × 2 factorial with a formaldehyde-based product (Termin-8, Anitox Corporation, Lawrenceville, GA) applied either before virus inoculation (preinoculation) or after inoculation (postinoculation) at either a 2 or 3 kg/MT. On day 0, samples of the respective matrices were weighed in 50 g aliquots and added to 500 mL bottles. Formaldehyde was applied to the preinoculation samples at the respective inclusion levels and 50 µL of each virus were added to the postinoculation samples. All bottles were shaken and allowed to sit at room temperature for 24 h. On day 1, virus was added to the preinoculation samples and formaldehyde was added to the postinoculation bottles. Half of the samples were immediately processed (0 h) and the other half were incubated at room temperature for an additional 24 h. Samples were processed and aliquots were analyzed via triplex PCR. An application time × inclusion level interaction was observed for PEDV at 0 h and SVV1 and PEDV at 24 h in complete feed, where less viral RNA (<span>P</span> &lt; 0.05) was detected in the postinoculation samples at either inclusion level as compared to the positive controls. In soybean meal, the same interaction was observed in PEDV and PRRSV at 0 h and SVV1 and PEDV at 24 h with less detectable RNA observed (<span>P</span> &lt; 0.05) in the postinoculation samples regardless of inclusion level than the preinoculation counterparts and the controls. Overall, an application time effect was noticed in each matrix where less RNA was detected in the postinoculation samples at 0 h (<span>P</span> &lt; 0.05) compared to the preinoculation samples and the control, and at 24 h, both the pre- and postinoculation samples had less detectable RNA (<span>P</span> &lt; 0.05) than the control. Overall, formaldehyde can reduce detectable RNA immediately in contaminated complete feed and soybean meal, with greater decreases observed as mitigant contact time increases.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"d210a7501013144ceb500947a77948a72d0aaa2128f146ef1f4abbff69e59c83","category":"Environment"}