{"title":"Metabolic Dysfunction-associated Steatotic Liver Disease in Japan: Prevalence Trends and Clinical Background in the 10 Years Before the Coronavirus Disease 2019 Pandemic","link":"https://www.preprints.org/manuscript/202407.0202/v1","date":1719909937000,"content":"Background and Objectives: The trends in metabolic dysfunction-associated steatotic liver disease (MASLD) and related metabolic dysfunctions in Japan is unknown. Thus, we aimed to clarify the trends of these before the novel coronavirus disease 2019 pandemic in Japan. Materials and Methods: We included Japanese individuals aged 25-79 years who underwent health examinations at our center. We analyzed anthropometry, lifestyle-related disease, and nutritional intake in relation to MASLD trends from 2010-2019. Results: The prevalence of MASLD increased in all ages and body mass index (BMI) classes, reaching 30.3% in males and 16.1% in females, with MASLD accounting for 75% of steatotic liver cases and more than half of all type 2 diabetes mellitus (T2DM) and high waist circumference (HWC) cases. The increase in the prevalence of MASLD was due to an increase in that of steatotic liver itself, and there was no increase in the prevalence of other factors, such as overweight, T2DM, hypertension, and dyslipidemia. The prevalence of glucose metabolic disorders (GMDs) and hypertension decreased. National nutritional data showed an increase in energy intake, total fat, saturated fatty acids, monounsaturated fatty acids, and polyunsaturated fatty acids, which correlated with a decrease in GMDs. Salt intake also decreased, which correlated with hypertension. The MASLD group had a higher prevalence of all related metabolic factors than the non-MASLD group, especially HWC, T2DM, and hyperlipidemia. Conclusion: The prevalence of MASLD increased with that of steatotic liver, regardless of age or BMI. A relationship between increased dietary fat, increased steatotic liver, and decreased GMDs was suggested.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d210f9910c6a3e7db454bdc21dcae5836921c6a12e1c0d4ff9f8fc16f06fb61e","category":"Interdisciplinary"}