{"title":"The Possible Signs of Accretion from Interstellar Medium in the Atmospheres of G-K-Type Disk and Halo Stars","link":"https://www.preprints.org/manuscript/202410.1548/v1","date":1729504895000,"content":"The relationships between the relative abundances of chemical elements\n  and their second ionization potentials, as well as their condensation\n  temperatures, were analyzed using four published homogeneous abundance\n  surveys of halo and thin disk stars.\n   We selected 932 stars with effective\n  temperatures ranging from 4900 K to 5900 K and used the abundances of\n  10 chemical elements common  across all surveys: Mg, Si, Ca, Sc, Ti, V,\n  Cr, Mn, Fe, and Ni. The correlation coefficients between the relative\n  abundances of these elements and their second ionization potentials\n  and condensation temperatures were investigated in relation to\n  metallicity and the stars' location in the Galaxy.\n   The observed\n  correlations may result from certain physical processes, such as the\n  accretion of interstellar gas onto stellar atmospheres. We also\n  analyzed the dependencies of relative abundances on second ionization\n  potentials based on published abundance patterns in five halo stars.\n  Evidence of charge-exchange reactions in the atmospheres of these\n  stars was found.\n   For more accurate determination of stellar ages from\n  the abundance ratios of radioactive and stable chemical elements in\n  stellar atmospheres, processes such as charge-exchange reactions and\n  dust-gas separation should be considered in future detailed\n  investigations. Additionally, changes in the chemical abundances in\n  the atmospheres of halo stars after crossing the Galactic plane were\n  found to be possible.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d214271a6515a8089e7cd5dbb9f458c0c23859ffce4bd6758c55de8a4c84ce5a","category":"Interdisciplinary"}