{"title":"Fabian Cancellara on Milan-San Remo – the most difficult one day race","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/fabian-cancellara-on-milan-sanremo-the-most-difficult-one-day-race","date":1616068800000,"content":"\n      <p>Fabian Cancellara is the first to concede that Milan-San Remo looks like an easy race. Forget the cobbles of Flanders or Roubaix, or the short sharp hills of Liège or Lombardy: the road to San Remo is a dead straight line to the coast from Italy’s second city.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>“It looks quite easy when you see it on the map: up, down, up, down, finish. Quite easy, no?” Cancellara says.</p>\n<p>Yet Milan San Remo is anything but a five-step promenade. And it’s saying something when a rider who was handed an embarrassment of riches when it came to La Primavera calls it “the most difficult one-day race”.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-preview\"><em><strong>Related – Milan-San Remo 2021 Preview</strong></em></a></p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur-Classic-65_1024x1024.jpg?v=1596629685\" alt=\"Fabian Cancellara\"></p>\n<p>Cancellara was able to climb with the favourites on the ‘Tre Capi’ along the Riviera and lead the fast and furious ascents of the Cipressa and Poggio, the final two climbs that put paid to sprinters’ hopes when the hammer went down. He could dance with the daredevil descenders on the drop off the Poggio, so often slippery and treacherous with the moist spring air rolling in off the Mediterranean. He could sprint from a small group on the flat and wide Via Roma.</p>\n<p>Or he could attack solo, as he did when he won his first (and ultimately only) edition of San Remo in 2008. But the challenge, common to all-rounders, is that his “problem of luxury” meant he was often unable to make a decisive break.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-sanremo-matt-goss-romance-on-the-italian-riviera\">Related – Matt Goss's Milan-San Remo win: Romance on the Italian Riviera</a></strong></em></p>\n<p>“I had different cards to play, but it was too many because certain riders had the skill for the sprint, or to make a hard attack before. So it was always a case of balancing what will come and what could come in the finale of the race,” he says.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Milan_San-Remo_2008_05-e1516186856908_1024x1024.jpg?v=1596629746\" alt=\"Milan-Sanremo 2008\"></p>\n<p>Of course once rivals had got a taste of Cancellara’s extraordinary power inside the final few kilometres –a turn of speed that fuelled rumours of illegal mechanical assistance  that he became the most marked man in the field. Quite rightly, they learned an important lesson: give him an inch and it would be the last you’d see of him.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/top-10-finish-line-faces-of-milan-sanremo\"><em><strong>Top 10 Finish Line Face of Milan-San Remo</strong></em></a></p>\n<p>“After the first time I won everyone saw, not to let me go. ‘If he goes, you’re not gonna see him any more’. So I was a target, I had people on my wheels, half the day. When I went for a pee they stopped, I was so targeted!”</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/Italy_Photo_Press_699461_1024x1024.jpg?v=1596629788\" alt=\"Milan-Sanremo\"></p>\n<p>The longest race on the calendar, Milan-San Remo is a voyage into the unknown for riders. After almost seven hours in the saddle – riding through the solid grey winter of the plains of Lombardy and Piedmont and into the mild seaside spring – you only have one bullet left in the chamber by the time you reach San Remo.</p>\n<p>“You can only do one move, you don’t have the power for two moves,” Cancellara says. “So when you do it you want to do it properly.”</p>\n<p>Your mind can happily write cheques that your body can’t cash. Cancellara has five podiums in 10 starts – even coming second, second, third and second between 2011 and 2014 –  but only one of those was a win (compared to three wins from six podiums in Roubaix, and three from five in Flanders).</p>\n<p>“Once in a while I realised I was too strong, too super strong, that it cost me the win. It didn’t cost me the podium – I was for so many years on the podium in Milan-San Remo, second and third – but almost always someone was faster or smarter.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Milan-SanRemo_2012_09_1024x1024.jpg?v=1596629835\" alt=\"Milan-Sanremo\"></p>\n<p>“When I was with Simon Gerrans and Vincenzo Nibali [in 2012] I thought, ‘yeah, I’m gonna beat them,’ but after 300km that’s a mistake.</p>\n<p>“Even if you think you are so strong, that you have so much confidence… that confidence is one thing but it’s only on the finish line it counts.”</p>\n<div class=\"klaviyo-form-T7axNG\"></div>\n    ","author":"AppHQ Collaborator","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d2161bd6cc80db6edb6bc0a2ac9fdc300ae68370fcd07da73c1bb94c6b34b6eb","category":"Cycling"}