{"title":"MacRumors Giveaway: Win an iPad Keyboard From Typecase","link":"https://www.macrumors.com/2021/06/04/macrumors-giveaway-typecase/","date":1622830572000,"content":"For this week's giveaway, we've teamed up with <a href=\"https://typecase.co/?ref=jn20t1rk0l\">Typecase</a> to offer <em>MacRumors</em> readers a chance to win a <a href=\"https://typecase.co/collections/typecase-touch?ref=jn20t1rk0l\">Typecase Touch keyboard</a> designed for one of Apple's iPads.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/typecase-main.jpg\" />\r\n<br />\r\nTypecase makes a range of different keyboard options, and the Typecase Touch offers a full keyboard and a trackpad at an affordable price. Priced at $60 to $80 and <a href=\"https://www.amazon.com/stores/page/E5865432-09C8-40DB-B01D-3C580AB35DB3?maas=maas_adg_DF26E94DF47ABEC3DA5FDEF0802D6799_afap_abs&amp;ref_=aa_maas&amp;channel=MacRumors\">available from Amazon</a>, the Typecase Touch is available for the low-cost 10.2-inch iPad, the 10.9-inch iPad Air, the prior-generation 9.7-inch iPad Air, the 10.5-inch iPad Pro, the 11-inch iPad Pro models, and the 2020 12.9-inch iPad Pro.\r\n<br />\r\n\r\n<br />\r\nThe Typecase Touch is a case and keyboard combo so the iPad fits into a protective hardshell case that then connects to the keyboard. The case offers full iPad protection from scratches and drops, plus it has an auto sleep/wake feature when the keyboard case is opened or closed, and there's a holder for the Apple Pencil.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/typecase-design.jpg\" />\r\n<br />\r\nSize wise, the Typecase Touch measures in at 0.5 inches and it weighs 1.4 pounds. There's a built-in 2.4-inch precision trackpad that is compatible with all iPad models running the latest version of iPadOS, and it supports all of the gestures that are supported by Apple's more expensive Magic Keyboard. There also are left and right click buttons for quick and easy navigation.\r\n<br />\r\n\r\n<br />\r\nThe laptop-style keyboard offers a standard 78-key layout with 0.8mm travel and laser etched letters that never fade. There's support for iPadOS shortcuts for accessing the home screen, controlling brightness, and controlling media playback.\r\n<br />\r\n\r\n<br />\r\nA built-in 10-color RGB backlight lights up the keys, and it can be adjusted to your preferences with three brightness modes. The Typecase itself is also available in multiple color options like blue, black, purple, and gold.\r\n<br />\r\n\r\n<br />\r\nThere are seven use modes thanks to the Typecase's 360-degree hinge, which is able to rotate and pivot. The Typecase can be used to transform the iPad into a laptop, folded back flat for tablet mode, propped open in a drawing mode, angled for video watching or FaceTiming, and more. The Typecase Touch connects to an iPad over Bluetooth and it has a built-in battery that lasts for up to 90 days before needing to be recharged.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/typecase-viewing-angles.jpg\" />\r\n<br />\r\nWe have 10 Typecase iPad keyboards to give away to <em>MacRumors</em> readers, with each winner able to choose the keyboard appropriate for their device and their preferred color. To enter to win, use the Gleam.io widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winners and send the prizes. You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r\n<br />\r\n\r\n<br />\r\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. To offer feedback or get more information on the giveaway restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r\n<br />\r\n\r\n<br />\r\n<div><a href=\"https://gleam.io/6Svej/typecase-giveaway\">Typecase Giveaway</a></div>The contest will run from today (June 4) at 11:00 a.m. Pacific Time through 11:00 a.m. Pacific Time on June 11. The winners will be chosen randomly on June 11 and will be contacted by email. The winners will have 48 hours to respond and provide a shipping address before new winners are chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/04/macrumors-giveaway-typecase/\">MacRumors Giveaway: Win an iPad Keyboard From Typecase</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-ipad-keyboard-from-typecase.2299226/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=G5ViIJOXEvk:nR7ob2dC8dA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=G5ViIJOXEvk:nR7ob2dC8dA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/G5ViIJOXEvk\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d21a22be6447ae6c23402f9a2860e9bc7979ae339a498f9a725e93ae0465c5f7","category":"Apple"}