{"title":"Infections in Children with Acute Lymphoblastic Leukemia","link":"https://www.preprints.org/manuscript/202408.1348/v1","date":1724117952000,"content":"Background and Objectives: Infections are the most common and potentially life-threatening complications of the treatment of children with acute lymphoblastic leukemia (ALL). The aim of this study was to determine epidemiological, clinical and microbiological characteristics of infections in pediatric patients with ALL. Materials and Methods:  Twenty-three children (16 male and 7 female, mean age 5.9 years [range 1.3 to 12.2 years]) with ALL, treated at the Division of Hematology, Oncology and Clinical Genetics, Department of Pediatrics, Clinical Hospital Center Rijeka, Croatia, from January 1, 2015 to December 31, 2020, were included in the study Results: One hundred and four infectious episodes (IEs) were reported (average 4.5 IE per patient). IEs were more frequent in the intensive phases of antileukemic treatment. Neutropenia was present in 48 IEs (46.2%) with a duration greater than 7 days in 28 IEs (58.3%). The respiratory tract was the most common infection site (48.1%). We documented 49 bacterial (47.1%), 4 viral (3.9%), 4 fungal (3.9%) and 10 mixed isolates (9.6%), while in 37 IEs (35.6%) pathogen was not isolated. The most common causes of bacteremia were coagulase-positive staphylococci. The most frequent empirical therapy was third- and fourth-generation cephalosporins, followed by piperacillin/tazobactam. Modification of the first-line antimicrobial therapy was performed in 56.9% of IEs. Granulocyte-colony stimulating factor was administered in 53.8% of IEs, and intravenous immunoglobulins in 62.5% of IEs. One patient required admission to the intensive care unit. No infection-related mortality was reported. Conclusions: ALL patients have frequent IEs. Close monitoring, identification of risk factors, rapid empirical use of antibiotics in febrile neutropenia, and timely modification of antimicrobial therapy play a key role in reducing infection-related morbidity and mortality in children with ALL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2239f3c36088ec4b3dd62f2082e7378b892d318f1ac2dcc06222a8d61a29be4","category":"Interdisciplinary"}