{"title":"A Review and Meta-analysis of Semantic Segmentation Models in Land Use/ Land Cover Mapping","link":"https://www.preprints.org/manuscript/202405.0580/v1","date":1715244146000,"content":"Recent advancements in deep learning have spurred the development of numerous novel semantic segmentation models for land cover mapping, showcasing exceptional performance in delineating precise boundaries and producing highly accurate land cover maps. However, to date, no systematic literature review has comprehensively examined semantic segmentation models in the context of land cover mapping. This paper addresses this gap by synthesizing recent advancements in semantic segmentation models for land cover mapping from 2017 to 2023, drawing insights on trends, data sources, model structures, and performance metrics based on a review of 106 extracted articles. Our analysis identifies top journals in the field, including MDPI Remote Sensing, IEEE Journal of Selected Topics in Earth Science, and IEEE Transactions on Geoscience and Remote Sensing, IEEE Geoscience and Remote Sensing Letters, ISPRS Journal Of Photogrammetry And Remote Sensing as the leading journals. We find that research predominantly focuses on land cover, urban areas, precision agriculture, environment, coastal areas, and forests. Geographically, 35.29% of the study areas are located in China, followed by USA (11.76%), France (5.88 %), Spain (4%) and others. Sentinel-2, Sentinel-1, and Landsat satellites emerge as the most commonly used data sources. Benchmark datasets such as ISPRS Vaihingen &amp;amp; Potsdam, LandCover.ai, DeepGlobe, and GID datasets are frequently employed. Model architectures predominantly utilize encoder-decoder, and hybrid convolutional neural network-based structures because of their impressive performances, with limited adoption of transformer-based architectures due to its computational complexity issue, and slow convergence speed. Lastly, this paper highlights existing key research gaps in the field to guide future research directions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2275f1a40117fc5588a6584cd66c475464f32b41ec4f6e4fca8f0ab9050dd66","category":"Interdisciplinary"}