{"title":"Apple Apologizes to Researcher for Ignoring iOS Vulnerabilities, Says It's 'Still Investigating'","link":"https://www.macrumors.com/2021/09/27/apple-apologizes-for-ignoring-ios-vulnerabilities/","date":1632772529000,"content":"Last week, security researcher Denis Tokarev made several <a href=\"https://www.macrumors.com/2021/09/24/ios-15-zero-day-vulnerabilities-report/\">zero-day iOS vulnerabilities public</a> after he said that Apple had ignored his reports and had failed to fix the issues for several months.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iPhone-13-Security.jpg\" />\r\n<br />\r\nTokarev today told <em><a href=\"https://www.vice.com/en/article/g5gan4/apple-still-investigating-unpatched-and-public-iphone-vulnerabilities\">Motherboard</a></em> that Apple got in touch after he went public with his complaints and after they saw significant media attention. In an email, Apple apologized for the contact delay and said that it is \"still investigating\" the issues.<blockquote>\"We saw your blog post regarding this issue and your other reports. We apologize for the delay in responding to you,\" an Apple employee wrote. \"We want to let you know that we are still investigating these issues and how we can address them to protect customers. Thank you again for taking the time to report these issues to us, we appreciate your assistance. Please let us know if you have any questions.\"</blockquote>Apple <em>did</em> fix one of the vulnerabilities in iOS 14.7, but did not provide Tokarev with credit. Three others remain unaddressed, including a Game Center bug that allegedly allows any app installed from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> to access full <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> email and name, ‌Apple ID‌ authentication tokens, lists of contacts, and some attachments.\r\n<br />\r\n\r\n<br />\r\nDetails on all of the zero-day vulnerabilities have been <a href=\"https://habr.com/en/post/579714/\">published publicly</a> by Tokarev, which may prompt Apple to fix them faster.\r\n<br />\r\n\r\n<br />\r\nTokarev first contacted Apple about these bugs between March 10 and May 4, so Apple has had months to issue patches, but it's worth noting that several security researchers and Tokarev himself have confirmed that the bugs are not highly critical as exploiting them would require a malicious app to first receive ‌App Store‌ approval.\r\n<br />\r\n\r\n<br />\r\nStill, experts have criticized Apple's response and its bug bounty program. Cybersecurity expert Katie Moussouris told <em>Motherboard</em> that Apple's handling of the process is \"not normal and should not be considered normal,\" while researcher Nicholas Ptacek said that Apple's response comes across as a \"reaction to bad press.\"\r\n<br />\r\n\r\n<br />\r\nEarlier this month, <em>The Washington Post</em> interviewed more than two dozen security researchers to <a href=\"https://www.macrumors.com/2021/09/09/security-researchers-apple-bug-bounty-complaints/\">expose the flaws</a> in Apple's bug bounty program. Researchers said that Apple is slow to fix bugs and doesn't always pay out what's owed, leading researchers to be unhappy with Apple's program.\r\n<br />\r\n\r\n<br />\r\nAt the time, Apple's Head of Security Engineering and Architecture, Ivan Krstić, said that Apple is \"planning to introduce new rewards for researchers\" to expand participation, and that Apple is working toward offering new and even better research tools.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-security/\">Apple security</a>, <a href=\"https://www.macrumors.com/guide/vulnerabiltiies/\">Vulnerabiltiies</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/27/apple-apologizes-for-ignoring-ios-vulnerabilities/\">Apple Apologizes to Researcher for Ignoring iOS Vulnerabilities, Says It's 'Still Investigating'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-apologizes-to-researcher-for-ignoring-ios-vulnerabilities-says-its-still-investigating.2313992/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=peLycz0U9I8:ua58d9P8FZU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=peLycz0U9I8:ua58d9P8FZU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/peLycz0U9I8\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d24a0bccb1eed840f1ef7244d5cc7737e7c17ec0a46c186a0997ab66021c2813","category":"Apple"}