{"title":"iOS 17: 10 Features You Might Not Know About","link":"https://www.macrumors.com/2023/12/22/ios-17-ten-hidden-features/","date":1703272719000,"content":"<a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> has been available for a few months now, but there are so many new features in the update that some have gone under the radar. There are also hidden settings and little tweaks and changes that you might not know about, so we thought we'd round up some of the lesser-known ‌iOS 17‌ features.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\n<ul>\r<br />\n \t<li><strong>Messages</strong> - If you hold down the \"+\" button in the Messages app, you can get right to the photo picker to send an image. It's quicker than tapping \"+\" and then tapping on <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> to get to your images.</li>\r<br />\n \t<li><strong>Links in Mail</strong> - To add a link to text in the Mail app, copy a link, select the text, and then paste it to turn the text into a hyperlink.</li>\r<br />\n \t<li><strong>Add Text to Shapes</strong> - In the ‌Photos‌ app, if you've added a shape to an image using Markup, double tap it to be able to insert text.</li>\r<br />\n \t<li><strong>Laundry Symbols</strong> - You can use the Visual Look Up feature on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to figure out what a laundry symbol means. Just take a picture and tap on the Visual Look Up symbol in the ‌Photos‌ app to get symbol information.</li>\r<br />\n \t<li><strong>Apple Watch Ping</strong> - In the Control Center, there's a new option to ping your Apple Watch from your ‌iPhone‌ in case you misplace your Apple Watch.</li>\r<br />\n \t<li><strong>Focus Mode Silence Notifications</strong> - When setting up a Focus Mode, you can now choose to silence notifications always or only when the ‌iPhone‌ is locked.</li>\r<br />\n \t<li><strong>Journal App Lock</strong> - If you want to keep your journal entries secure, you can turn on the \"Lock Journal\" option in the Settings app to require <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a> to open up the Journal app.</li>\r<br />\n \t<li><strong>Journaling Schedule</strong> - Having trouble remembering to use the Journal app? Enable Journaling Schedule in the Journal section of the Settings app to get a reminder to add a journal entry at a specific day and time.</li>\r<br />\n \t<li><strong>Adjust Haptic Touch Speed</strong> - Under Accessibility &gt; Touch &gt; <a href=\"https://www.macrumors.com/guide/haptic-touch-vs-3d-touch-whats-the-difference/\">Haptic Touch</a> you can adjust the time that it takes to activate content with a long press. Options include fast, default, and slow, and the fast setting makes haptic touch feel closer to the now-removed <a href=\"https://www.macrumors.com/guide/3d-touch/\">3D Touch</a> feature.</li>\r<br />\n \t<li><strong>Shake to Undo</strong> - If you've move a <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> app or a widget and then change your mind on the position, you can use a shake to undo gesture to put the apps and widgets back where they were before you made the adjustment. </li>\r<br />\n</ul>\r<br />\nKnow of a hidden ‌iOS 17‌ feature that we didn't mention here? Let us know in the comments below.<br />This article, \"<a href=\"https://www.macrumors.com/2023/12/22/ios-17-ten-hidden-features/\">iOS 17: 10 Features You Might Not Know About</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-10-features-you-might-not-know-about.2414424/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d24dae08c8773085152b132635b4b8e815965f615e0deda4930619cb471e86e8","category":"Apple"}