{"title":"Ford picks a name for its electric pickup truck: The F-150 Lightning","link":"https://arstechnica.com/?p=1763748","date":1620662407000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Lightning_16x9-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Lightning_16x9.jpg\">Enlarge</a> <span>/</span> If you thought Ford would find it hard to resist reviving the Lightning brand for its electric F-150 pickup, you'd be right. (credit: Ford Motor Company)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>As many <a href=\"https://www.caranddriver.com/news/a36302400/ford-f-150-lightning-electric-name/\">have predicted</a>, Ford will revive the \"Lightning\" nameplate for the battery-electric version of its F-150 pickup truck. The formal reveal of the electric F-150 is scheduled to take place in Michigan on May 19, at which point we hope to get more information about this hotly anticipated electric vehicle. For now, Ford is keeping details like the vehicle's range and battery capacity to itself.</p>\n<p>Like the <a href=\"https://arstechnica.com/cars/2021/05/rivian-shares-some-cargo-specs-for-the-r1t-electric-pickup-truck/\">Rivian that we just wrote about</a> or the <a href=\"https://arstechnica.com/cars/2020/06/everything-we-know-about-the-new-ford-f-150-truck-including-the-hybrid/\">hybrid F-150s that are already on sale</a>, it sounds like the F-150 Lightning will come with on-board AC power outlets. \"America's favorite vehicle for nearly half a century is going digital and fully electric. F-150 Lightning can power your home during an outage,\" said Ford President and CEO Jim Farley in a statement sent to Ars.</p>\n<p>The original F-150 Lightning was a product of Ford's Special Vehicle Team. It debuted in 1993 as a high-performance variant of the F-150 pickup, which was offered until 1995. Then in 1999, a second F-150 Lightning arrived, this time based on the 10th-generation F-150.</p></div><p><a href=\"https://arstechnica.com/?p=1763748#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763748&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d24d399c53d24b7d4387765d8d99ea4ee250034c113aaaa931ef9569eeb2f3a3","category":"Tech"}