{"title":"Coastal Adaptation Pathways and Tipping Points for Typical Mediterranean Beaches Under Future Scenarios","link":"https://www.preprints.org/manuscript/202406.0272/v1","date":1717572040000,"content":"Coastal zones experience increasing climatic and human pressures, which lead to growing risks and tipping points (TPs) under future scenarios and natural resource scarcity. To avoid crossing TPs with irreversible coastal losses, this paper proposes the development of adaptation pathways based on advanced coastal oceanography and engineering knowledge that enables an objective assessment of evolving coastal risks. These pathways feature sequential interventions, combining conventional engineering works with nature-based solutions (NbS), steered by simulations and observations as a function of available coastal resources (space and sediment) and risks for infrastructure and socioeconomic assets. Such an adaptation has been developed for urban and peri-urban Mediterranean beaches, considering conventional coastal engineering together with NbS. Both types of interventions are assessed in terms of key physical variables, which serve to evaluate performance and estimate TPs. This analysis supports the new coastal protection and management plan promoted by the local government and the coastal adaptation plan of the central government. The approach and results illustrate the potential of adaptation pathways for beach sustainability, enhancing the compatibility between short/long-term coastal protection objectives under present/future climate and management scenarios. The adaptation pathways development underpins an increasing stakeholder cooperation to achieve shared decisions for coastal sustainability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d276bec3a0d3533eed1c3aaf1c369696a952ea228c1ec29b410d8db782c19872","category":"Interdisciplinary"}