{"title":"Relationship between Vitamin D Insufficiency, Lipid Profile and Atherogenic Indices in Healthy Women Aged 18&ndash;50 Years.","link":"https://www.preprints.org/manuscript/202406.0667/v1","date":1718099631000,"content":"Although vitamin D deficiency has been correlated with an increased risk of cardiovascular disease (CVD), there are few data on the association between 25-hydroxyvitamin D (25(OH) D) and atherogenic indices predictive of CVD. This study aimed to investigate the relationship of vitamin D status with lipid profile and atherogenic indices in adult women in Morocco. Three hundred healthy women, aged 18 to 50 years, from Meknes were included. Fasting 25(OH) D and lipid concentrations were determined using a one-step electrochemiluminescence-based immunoassay and an enzymatic method, respectively. Atherogenic indices (Atherogenic index of plasma (AIP), non-HDL cholesterol (Non-HDL-C), Atherogenic coefficient (AC), Castelli risk indices I and II (CRI-I and II), and CHOLIndex (CI)) were calculated using conventional lipid parameters. Logistic regression models and operating characteristic curve (ROC) analysis were used to assess the relationship of the variables and estimate the threshold of 25(OH) D levels associated with high atherogenic indices. 25(OH) D below 20 ng/ml was significantly associated with an enhanced risk of hypertriglyceridemia and elevated values of AIP, AC, Non-HDL-C, and CRI-I with an OR (95% CI) of 4.904 (1.856-12.959); 3.637(2.149-6.158); 3.589(1.673-7.700); 2.074(1.215-3.540), and 2.481(1.481-4.123), respectively. According to ROC analysis, the likelihood of hypertriglyceridemia and high values of AIP, AC, Non-HDL-C, and CRI-I were associated with 25(OH)D thresholds ≤15.15 ng/ml, ≤ 17.5 ng/ml, ≤ 19.8 ng/ml, ≤ 20.1 ng/ml and ≤ 19.5 ng/ml, respectively, all p &amp;lt; 0.01. Based on atherogenic indices, this study indicates that vitamin D below 20 ng/ml may increase the risk of cardiovascular disease in adult women. Additional health efforts are needed to raise awareness among women and healthcare providers in preventing and controlling cardiovascular risk factors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d27eada09df6e944c772ee2ef3a9e69046534b8ffd7ab83817753c0fb8f12731","category":"Interdisciplinary"}