{"title":"Molybdenum oxide-based catalyst towards better hydrogen production: effects of isothermal carburization","link":"http://link.springer.com/10.1007/s11356-024-33060-z","date":1712102400000,"content":"<h3>Abstract</h3>\n                  <p>Hydrogen (H<sub>2</sub>) represents a promising avenue for reducing carbon emissions in energy systems. However, achieving its widespread adoption requires more effective and scalable synthesis methods. Herein, we investigated the isothermal carburization process of the MoO<sub>3</sub> catalyst. This reaction was carried out at a constant temperature of 700 °C in a 60% CO/He stream, with hold reaction times varying (60-min, 90-min, and 120-min). This investigation was conducted using a micro-reactor Autochem with the aim of enhancing the yield of H<sub>2</sub>. The study focused on evaluating the chemical reduction and carburization behavior of the MoO<sub>3</sub> catalyst through X-ray diffraction (XRD), transmission electron microscopy (TEM), and CHNS elemental analysis. The XRD analysis revealed the formation of carbides, Mo<sub>2</sub>C, and MoO<sub>2</sub>, serving as active sites for subsequent H<sub>2</sub> production in the thermochemical water splitting (TWS) process. The carburization at a 60-min hold time exhibited enhanced H<sub>2</sub> production, generating approximately ~ 6.60 µmol of H<sub>2</sub> with a yield of up to ~ 32.90% and a conversion rate of ~ 54.83%. This finding emphasizes the essential role played by the formation of carbides, particularly Mo<sub>2</sub>C, in the carburization process, contributing significantly to the facilitation of H<sub>2</sub> production. These carbides serve as exceptionally active catalytic sites that actively promote the generation of hydrogen. This study underscores that the optimized duration of catalyst exposure is a key factor influencing the successful carburization of MoO<sub>3</sub> catalysts. This emphasizes how important carbide species are to increasing H<sub>2</sub> efficiency. Additionally, it is noted that carbon formation on the MoO<sub>3</sub> active sites can act as a potential poison to the catalysts, leading to rapid deactivation after prolonged exposure to the CO precursor.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"d27ff2d60a40d2158e50fdffa29544d7c0d8f5388cd64af74523ed41e3d569a7","category":"Environment"}