{"title":"AI กำลังเรียนเขียนโปรแกรม IBM เปิดตัว CodeNet ชุดข้อมูลโค้ดดิ้งขนาดใหญ่ สอน AI แปลงโค้ดข้ามภาษา","link":"https://www.blognone.com/node/122622","date":1620719130000,"content":"<div><div><div><p>ในงาน Think 2021 ของ IBM มีประกาศเปิดตัวโปรเจกต์ <a href=\"https://github.com/IBM/Project_CodeNet\">CodeNet</a> ชุดข้อมูลขนาดใหญ่ที่สร้างขึ้นเพื่อสอน AI เขียนโปรแกรม โดยชุดข้อมูลประกอบด้วยตัวอย่างโค้ด 14 ล้านชุดรวม 500 ล้านบรรทัด และในภาษาโปรแกรมที่แตกต่างกันไปกว่า 55 ภาษา ตั้งแต่ที่ยังมีนิยมใช้งานคือ C++, Java, Python และ Go ไปจนถึงภาษาดั้งเดิมอย่าง COBOL, Pascal และ FORTRAN</p>\n<p>IBM ระบุถึงปัญหาใหญ่ของวงการไอทีคือการแปลงโค้ดจากภาษาหนึ่งไปอีกภาษาหนึ่ง ที่แม้ระบบแปลงภาษาแบบใช้กฎแปลง (rule based) จะสามารถแปลงได้ 50-60% แต่ส่วนที่เหลือก็กลายเป็นส่วนที่มีความซับซ้อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/37f381ad48dbfc77b48bfac95b06778d.png\" /></p>\n<p>ปัจจุบันภาษาโปรแกรมมิ่งนั้นมีบริบทในตัวเองสูง การจะแปลภาษาให้เข้าใจนั้นยากและใช้เวลานาน ยิ่งโปรแกรมมีขนาดใหญ่เท่าไรก็ยิ่งแปลยากมากเท่านั้น จึงเป็นเรื่องท้าทายสำหรับ AI ที่จะทำแปลภาษาโปรแกรมมิ่ง โดยโปรเจกต์ CodeNet คาดว่าจะช่วยให้ AI เข้าใจบริบทของภาษาโปรแกรมมิ่งมากขึ้น</p>\n<p>นอกจากนี้ ตัวชุดข้อมูลมีโค้ดพร้อมกับข้อมูลประกอบ (metadata) ทำให้สามารถใช้เพื่อค้นหาโค้ด และตรวจจับโค้ดซ้ำซ้อน และยังมีสถานะการยอมรับโค้ดชุดต่างๆ ซึ่งจะช่วยให้ AI สามารถแยกแยะโค้ดที่ดีกับโค้ดที่มีปัญหาออกจากกันได้ง่ายขึ้น</p>\n<p>ความเป็นไปได้ที่จะใช้ปัญญาประดิษฐ์มาเขียนโปรแกรมมีมาหลายปีแล้ว สองปีก่อน OpenAI เคยสาธิตโมเดลปัญญาประดิษฐ์ GPT-2 และ<a href=\"https://www.blognone.com/node/108335\">พบว่ามันสามารถสร้างโค้ดออกมาได้</a> “สมจริง” แม้ตัวปัญญาประดิษฐ์จะไม่ได้ออกแบบมาสำหรับการเขียนโปรแกรมโดยตรง ดังนั้น การพัฒนาปัญญาประดิษฐ์เพื่อให้รองรับการเขียนโปรแกรมโดยตรงอาจจะสร้างแนวทางการเขียนโปรแกรมใหม่ๆ ที่ตัวโปรแกรมเมอร์สั่งการโค้ดในระดับสูงขึ้นไป</p>\n<p>ที่มา - <a href=\"https://research.ibm.com/blog/codenet-ai-for-code\">IBM</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ibm\">IBM</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/code\">Code</a></div><div><a href=\"/topics/programming\">Programming</a></div><div><a href=\"/topics/big-data\">Big Data</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d280bca1d4144a9e690e4a4f03a10e9b495a9d6a495424fbdc837b9f71154f81","category":"Thai"}