{"title":"Organophosphate ester flame retardants and plasticizers affect the phenotype and function of HepG2 liver cells","link":"https://academic.oup.com/toxsci/article/199/2/261/7633747?rss=1","date":1711065600000,"content":"<span><div>Abstract</div>Exposure to the organophosphate esters (OPEs), used as flame retardants and plasticizers, is associated with a variety of adverse health effects including an increase in the incidence of fatty liver diseases. The goal of this study was to investigate the effects of six OPEs, all detected in Canadian house dust, on the phenotype and function of HepG2 liver cells. We used high-content imaging to investigate the effects of these OPEs on cell survival, mitochondria, oxidative stress, lipid droplets, and lysosomes. Effects on the autophagy/lipophagy pathway were evaluated using confocal microscopy. The triaryl OPEs (isopropylated triphenylphosphate [IPPP], tris(methylphenyl) phosphate [TMPP], and triphenyl phosphate [TPHP]) were more cytotoxic than non-triaryl OPEs (tris(2-butoxyethyl) phosphate [TBOEP], tris(1-chloro-2-propyl) phosphate [TCIPP], and tris(1,3-dichloro-2-propyl) phosphate [TDCIPP]). Exposure to most OPEs increased total mitochondria, reduced reactive oxygen species, and increased total lipid droplet areas and lysosomal intensity. Potency ranking was done using the lowest benchmark concentration/administered equivalent dose method and toxicological prioritization index analyses to integrate all phenotypic endpoints. IPPP, TBOEP, and TPHP ranked as the most potent OPEs, whereas TMPP, TCIPP, and TDCIPP were relatively less bioactive. Confocal microscopic analysis demonstrated that IPPP reduced the colocalization of lipid droplets (PLIN2), lysosomes (LAMP1), and autophagosomes (p62), disrupting autophagy. In contrast, TBOEP rescued cells from bafilomycin A1-induced inhibition of autophagy and/or increased autophagic flux. Together, these data demonstrate that OPEs have adverse effects on HepG2 cells. Further, OPE-induced dysregulation of autophagy may contribute to the association between OPE exposure and adverse effects on liver lipid homeostasis.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"d281a11468dc711e0ea9af0de4b6d5d896aae9e94288cd9f0333231fa55ebef9","category":"Environment"}