{"title":"Netflix does cycling - What will 'Tour de France: Unchained' do for the sport?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/netflix-does-cycling","date":1686147360000,"content":"\n      <p><em>This article was originally published in Issue 114 of Rouleur magazine. </em></p>\n<p>“Netflix are a real bunch of c***s, aren’t they?” So said the Formula One star Daniel Ricciardo during the 2019 run of the Netflix docuseries Drive to Survive.</p>\n<p>The affable Australian may have had his tongue firmly in his cheek – the statement was a joking provocation. But it’s not yet certain how any of the cyclists who will feature in the upcoming Netflix docuseries about the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> felt as the cameras followed their every move.</p>\n<div></div>\n<p>The Box to Box Films crew who make Drive to Survive have become part of the furniture of Formula One, one of the world’s most prestigious sports. They are  woven into the rich tapestry of the exclusive paddock, and widely accepted – and  teased – by drivers, team principals, staff and fans alike.</p>\n<p>Drive to Survive has become a Netflix sensation. It was ranked number one in 27 countries worldwide and F1 saw a huge increase in younger and more diverse fans,  as well as exponential growth in the United States. With three American races now  scheduled for 2023, including a spectacular night race in Las Vegas in November, F1 has truly broken America. And with the Tour de France set to get ‘Netflixed’, the potential impact for cycling – and the sponsors it could attract – is huge.</p>\n<p>Cycling is about to find out if being ‘Netflixed’ will enable the sport to reach the fans other coverage cannot. The eight-part series has followed eight teams – Ag2r Citroën, Alpecin-Fenix, Bora-Hansgrohe, EF Education-EasyPost,  Groupama-FDJ, Ineos Grenadiers, Jumbo-Visma and Quick-Step Alpha Vinyl (now Soudal-Quick-Step) –  from the Classics in March to the climax of the Tour de France in Paris.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-05714.jpg?v=1686134742\" alt=\"Tour de France\" /><em>Jonas Vingegaard was last year's Tour de France winner (SWPix.com)</em></p>\n<p>On a commercial level, it is a no-brainer. The Tour de France is one of the biggest  sporting events in the world. It captures the imagination of cycling fans, sports fans and casual fans alike during those hot, heady summer days in July. Days are routinely planned around the finish of each stage, and days of the week become stage numbers and a nod to the parcours: “It’s stage 16 in the high mountains today.”</p>\n<p>Yet for the casual fan, a peek behind the curtain of this complicated, nuanced and chaotic world may entice them further into our beautiful sport. ASO’s ambitions were clear: to offer “unique immersion behind the scenes” and “to make the sport more accessible and meet an even wider audience”. And they are in safe hands. Box To Box Films is led by Academy Award-winning producer James Gay-Rees and Emmy-winning producer Paul Martin.</p>\n<p>Gay-Rees produced the critically acclaimed Senna and Amy documentaries, and together, he and Martin have produced Drive To Survive, surfing series Make or Break, Steven Gerrard documentary Make Us Dream and more. In short, they know how to turn any subject into a hit, and the Tour de France is a big opportunity.  </p>\n<p>There were rumblings in the F1 paddock of the documentary before the news was announced, and as a broadcaster working in both F1 and cycling, for me it is an  exciting prospect. In my experience, the crew are omnipresent in the paddock, yet work discreetly, thoroughly and efficiently, seemingly everywhere at once. As one of the sport’s presenters, I am all too aware of the lingering boom mic that will quietly creep into your periphery when talking on or off the record to drivers and media  alike. I recall having a conversation with David Coulthard last season, and suddenly noticing the crew listening in to pick up any behind-the-scenes nuggets.</p>\n<p>From time to time, they will record one of my opening links or paddock walks for scene-setting one-liners ahead of a big race. There is an added pressure, an extra frisson when you know they are listening in to an interview, and capturing content.</p>\n<p>Ian Holmes, the F1 director of media rights and content creation, has overseen the Drive to Survive project from its inception and readily admits its impact surpassed  all expectations. He said: “We had no idea it would be so successful – we had a hunch it could be, as this is original content, but it surpassed anything we dared to dream.</p>\n<p>“We felt the sport had traditionally had a velvet rope around it and we were missing an opportunity. One of the major goals was to open up this world.”</p>\n<p>The stats don’t lie; 89 per cent of fans think the series improves the fan experience and 81 per cent would recommend the series. It has made 85 per cent of casual fans consider themselves to be more engaged, and 82 per cent more likely to watch more races; 64 per cent of all viewers watched 12 or more races in 2020 compared to 43 per cent in 2019.</p>\n<p>Drive to Survive has also helped attract a younger age group – 57 per cent of viewers were aged 16-34. And it is precisely who is watching, as well as how many, that is crucial for a sport’s growth.  </p>\n<p>Holmes continued: “We have many fans all over the world who will watch a complicated two hours of entertainment, but Drive to Survive has really appealed to people who aren’t that regular core group.</p>\n<p>“We are seeing our average age go down, which is rare, and the percentage of women watching increase. These fans didn’t exist a few years ago. Where it is most valuable is in the nature of the person who has watched it.  </p>\n<p>“You want to appeal to everyone, in particular a new generation of fans coming  through, because they are your future. The narrower you are, the more you are at risk, so it’s important to have as many different touch-points as possible.”</p>\n<p>The extraordinary growth in the USA, as well as the diversification of who is watching F1, is an important part of Drive to Survive’s impact. In cycling for example, the US market is dwarfed by the European heartland, and the audience is generally white, mostly male and older. An SMG-You-Gov report in 2017 found the average age of UK viewers was late-50s.  </p>\n<p>The USA Grand Prix was the most attended race in F1 last season, with nearly  400,000 at the Circuit of the Americas, and 45 per cent of them were aged between 18- 34, growth of 20 per cent in that age bracket. Despite the time differences, the average audience per Grand Prix is 2.2 million. The US social media following grew 42 per cent and the audiences have grown more than 30 per cent from 2018.</p>\n<p>In 2020, the US audience for the Tour de France was 399,000 on average per stage – a 10-year high, partly due to the delay of the Tour until September, as well as the explosive racing. Yet it remains much smaller than the European market. France TV, for example, saw peaks of 6.3m on certain stages in the same year.</p>\n<p>While time differences play their part, F1 has found 43 per cent of Drive to Survive viewers almost always watch races live, even in the small hours of the morning.  Steve Fry, a UCI-accredited agent and co-owner of M2 Sports Management, knows how crucial the US market is to any sport’s commercial growth, but remains reserved about the impact of a Netflix documentary.</p>\n\n<p>“The economic impact of any sport being able to crack the USA is enormous and Netflix is the perfect platform,” he explained. “But whether it will be as impactful as it was for F1 is doubtful. There isn’t a big enough hook at the moment to engage a US audience. Imagine if we were doing this in the 90s, with Lance Armstrong. There isn’t an American leader at the moment.”  </p>\n<p>Even F1 can admit a Netflix documentary isn’t a quick fix. Holmes is quick to point  out he couldn’t quantify exactly the impact it has had overall. F1’s boost in popularity has also been thanks to a perfect storm, with one of the most extraordinary rivalries the sport has seen, between Lewis Hamilton and Max Verstappen, and affable and engaging characters coming to the fore.</p>\n<p>“After Liberty Media bought the sport, we put a lot of energy into marketing it in a way that has not been done before,” continued Holmes. “There is a Covid-19 factor  – F1 was one of the first sports back, we had a series on a streaming service people were watching, and the sports documentary genre became core content.  </p>\n<p>“If you factor in the terrific season we had last year and new faces in the sport, it’s a combination. But certainly Drive to Survive has been additive.”  </p>\n<p>Can cycling capture the world’s imagination the way the intense, dramatic and  ultimately controversial rivalry between Hamilton and Verstappen continues to? The Abu Dhabi title decider in 2021 was watched by 108m worldwide, and the season total was 1.55 billion.  </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00476-2.jpg?v=1686134947\" alt /><em>Last year's Tour was defined by the battle for yellow between Tadej Pogačar and Jonas Vingegaard (Image by SWPix.com)</em></p>\n<p>Cycling has great rivalries, big characters, and spectacular racing in stunning parts of the world. But is there a universal appeal and the platform for the masses to access it? And more problematically, will a laser focus on the Tour de France simply strengthen the race’s vice-like grip on the sport?</p>\n<p>Some would argue cycling’s racing structure and calendar, its idiosyncrasies, nuances and complexities are a point of difference, the very things that set it apart from other sports, and make it so beautifully chaotic and endearing. For some, these are issues that beleaguer the sport, and Fry is unsure if a documentary series can be a solution.</p>\n<p>He argued: “The fundamental issue is that cycling doesn’t have any structure. There is no narrative. Everyone gets F1 – whoever gets the most points over 22 races becomes world champion. It’s beautifully simple. Cycling has eight iconic events, five Monuments and three Grand Tours, but the Tour dominates. Cycling’s biggest race is its biggest issue.  </p>\n<p>“ASO know they have a monopoly on cycling. They aren’t going to give that up. It generates millions in profit. They only want to grow the Tour de France.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1407706919.jpg?v=1686135091\" alt /><em>Jumbo-Visma's Wout van Aert was last year's winners of the mountains classification (Image by Getty Images)</em></p>\n<p>Despite a positive experience with the QuadBox crew, Bora-Hansgrohe rider Max Schachmann is also somewhat cynical about its impact. The two-times Paris-Nice winner said: “It depends on the final product. The Tour de France is the most epic race, but cycling is not just one race. Hopefully it allows more fans in and the exposure from the Tour will help other races grow, too. But there is so much work to do. The UCI and ASO need to work on making the cake bigger for everyone and think about how to share it.”  </p>\n<p>Geraint Thomas, who came third in the 2022 edition of the Tour, remains more optimistic and excited about the Netflix effect. The 2018 Tour winner said: “If it can bring in a new audience and make cycling more popular, that’s great. I’ve watched Drive to Survive and it’s certainly got me into F1. You know much more about what goes on.  </p>\n<p>“People may find the Tour more interesting when they understand the different  aspects to it, and how teams work. It will be interesting for established cycling fans and new fans as well. Hopefully it brings in a bigger audience and ultimately more interest and money into the sport.”  </p>\n<p>Ralph Denk, the Bora-Hansgrohe boss, also believes cycling is ready for this moment in the spotlight and the chance to attract the biggest sponsors in world sport.</p>\n<p>“When we had the offer to join, we didn’t need to have a big internal discussion. We could see the big potential,” he said. “There will be a small revenue share of the income but that is not the main point. We hope it will create a new community of fans, who will see behind the sport.</p>\n<p>“At the moment the sponsor structure of our sport doesn’t attract the big players – Apple, Google, Amazon, Rolex, Coca-Cola, that you see in football and F1. But it has the potential – the product is good enough. We need the stage to show that. Cycling is ready.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1410265177.jpg?v=1686135157\" alt /><em>The Netflix documentary is due out tomorrow, Thursday June 8, 2023 (Image by Getty Images)</em></p>\n<p>However, there are also concerns about Netflix’s possible impact on cycling. During  the Tour, established media found themselves with less access to riders and teams  – on the surface of it through concerns around the resurgence of Covid-19, though Netflix crews suffered no such restrictions. There were also notable non-participants in the documentary – the UAE Emirates team along with its leader, yellow jersey contender and two-time champion Tadej Pogačar, and, of course, more than half the teams in the race. You could argue that the production company chose their participants well – the eight featured teams won 14 of the 21 stages and filled half of the eventual top 10. But can the documentary featuring eight out of 22 teams convey the complexity and nuance of the Tour? Or will a focus on particular narratives and star characters make the sport more appealing without needing to go into that much detail?</p>\n<p>Fry warned: “Teams are historically secretive organisations and don’t like divulging anything. Ironically for organisations that rely 100 per cent pretty much on  sponsorship, they are poor at PR.”</p>\n<p>However, the feedback on the filming process itself is overwhelmingly positive. Thomas said: “I wasn’t sure how much access they would have. But the crew were nice guys and that makes a big difference. I didn’t notice them too much and it didn’t affect how we raced.”</p>\n<p>Denk agreed the crew were respectful, knowledgeable and understanding, and while the team gave them the access they needed, they were granted privacy when necessary. “You cannot close the door. If we are committed to bringing this sport forward, this is what we must do. It was a surprise to me that some teams, especially UAE, weren’t part of it. They missed a good opportunity,” he said.  </p>\n<p>Quick-Step Alpha Vinyl (now Soudal-Quick-Step) said the filming was “easy” and relatively “non intrusive”, and explained the focus was mostly on Fabio Jakobsen, both his stage-winning sprints and desperate battle against the time cut in the mountains.</p>\n<p>DS Tom Steels reflected: “Filming in a cycling team is not that easy. The bus is where the riders relax, and it’s not a big place. Covid was also a difficulty; we were extra careful and wanted to be sure every rider could finish.  </p>\n<p>“But they were very helpful and the images we showed were authentic. We didn’t  pretend to be different than we usually are. If we ask, can we do it next year, it’s a positive answer.”  </p>\n<p>The impact of a documentary will ultimately depend on the product. It may help that the 2022 Tour was one of the best editions in decades. The peloton kicked the proverbial out of each other for 21 stages, and viewing figures were healthy, ASO reporting 150m cumulative in Europe alone and growth in Denmark after Jonas Vingegaard’s yellow-jersey-winning heroics.  </p>\n<p>Netflix offers a gargantuan platform with a transformative potential for this sport, if teams and riders grasp the opportunity and the eight-part documentary captures hearts and imagination. But the question remains, will cycling’s biggest race simply get bigger, or does a rising tide float all boats?</p>\n<p><em>Tour de France: Unchained will be released on June 8, 2023 on Netflix.</em></p>\n<p><em>Cover image: Zac Williams/SWpix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d2869bf2a0067d303e30c755cdcbb8a91a849c6bfc726608a2ee8911ef5325cb","category":"Cycling"}