{"title":"CAMTA3 repressor destabilization triggers TIR domain protein TN2-mediated autoimmunity in the Arabidopsis exo70B1 mutant","link":"https://academic.oup.com/plcell/article/36/5/2021/7600413?rss=1","date":1706918400000,"content":"<span><div>Abstract</div>Calcium-dependent protein kinases (CPKs) can decode and translate intracellular calcium signals to induce plant immunity. Mutation of the exocyst subunit gene <span>EXO70B1</span> causes autoimmunity that depends on CPK5 and the Toll/interleukin-1 receptor (TIR) domain resistance protein TIR-NBS2 (TN2), where direct interaction with TN2 stabilizes CPK5 kinase activity. However, how the CPK5–TN2 interaction initiates downstream immune responses remains unclear. Here, we show that, besides CPK5 activity, the physical interaction between CPK5 and functional TN2 triggers immune activation in <span>exo70B1</span> and may represent reciprocal regulation between CPK5 and the TIR domain functions of TN2 in <span>Arabidopsis</span> (<span>Arabidopsis thaliana</span>). Moreover, we detected differential phosphorylation of the calmodulin-binding transcription activator 3 (CAMTA3) in the <span>cpk5</span> background. CPK5 directly phosphorylates CAMTA3 at S964, contributing to its destabilization. The gain-of-function CAMTA3<sup>A855V</sup> variant that resists CPK5-induced degradation rescues immunity activated through <span>CPK5</span> overexpression or <span>exo70B1</span> mutation. Thus, CPK5-mediated immunity is executed through CAMTA3 repressor degradation via phosphorylation-induced and/or calmodulin-regulated processes. Conversely, autoimmunity in <span>camta3</span> also partially requires functional CPK5. While the TIR domain activity of TN2 remains to be tested, our study uncovers a TN2–CPK5–CAMTA3 signaling module for <span>exo70B1</span>-mediated autoimmunity, highlighting the direct embedding of a calcium-sensing decoder element within resistance signalosomes.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"d291a188289525e709466fddc3bb78be57f464a32c689fd26bab4117e76faeee","category":"Environment"}