{"title":"Apple Has Included Bitcoin Whitepaper in Every Version of macOS Since 2018","link":"https://www.macrumors.com/2023/04/06/macos-includes-bitcoin-whitepaper/","date":1680773930000,"content":"In every copy of macOS that has shipped since 2018, Apple has included the original Bitcoin whitepaper by Satoshi Nakamoto, and no-one seems to know why. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/07/apple-bitcoin-hack.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nThe baffling discovery (or rediscovery - see below) was recently made by <a href=\"https://waxy.org/2023/04/the-bitcoin-whitepaper-is-hidden-in-every-modern-copy-of-macos/\">developer and waxy.org writer Andy Baio</a>, who stumbled upon the PDF document while trying to fix a problem with his printer.\r<br />\n\r<br />\nAnyone with a Mac running macOS Mojave or later can see the PDF for themselves by typing the following command into Terminal:\r<br />\n\r<br />\n<strong>open /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf</strong>\r<br />\n\r<br />\nIf you're running macOS 10.14 or later, the 184 KB Bitcoin PDF should immediately open in Preview.\r<br />\n\r<br />\nThe document can also be located via Finder: Navigate to <strong>Macintosh HD -&gt; System -&gt; Library -&gt; Image Capture -&gt; Devices</strong>, then open the <strong>Contents -&gt; Resources</strong> folder. The whitepaper titled \"simpledoc.pdf\" should be in there.\r<br />\n\r<br />\nBaio found that in the macOS Image Capture utility, the Bitcoin whitepaper is used as a sample document for a device called \"Virtual Scanner II,\" which may or may not power Apple's Import from <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> feature, and is either hidden or not installed for everyone by default.\r<br />\n\r<br />\nBaio later discovered that he wasn't the first person to find the Bitcoin document or \"Virtual Scanner II.\" An <a href=\"https://discussions.apple.com/thread/252657375\">Apple Community post from 2021</a> queries its existence in macOS, in addition to a photo taken of a sign at San Francisco Bay's Treasure Island, after designer <a href=\"https://twitter.com/schwa23/status/1332600822643900416?s=20\">Joshua Dickens unearthed them</a> in 2020.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/bitcoin-whitepaper-macos.jpg\" alt width=\"1024\" height=\"729\" />\r<br />\nIt's not known why Apple would choose as a sample document Nakamoto's Bitcoin whitepaper. There has been widespread speculation about the identity of the presumed pseudonymous Bitcoin developer, which is only likely to add to the intrigue. What \"Virtual Scanner II\" refers to also remains unclear.\r<br />\n\r<br />\nAccording to a source who spoke to Baio, someone filed the Bitcoin paper with Apple as an issue nearly a year ago, and assigned it to the same engineer who put the PDF there in the first place, but that person hasn't taken action or commented on the issue since.\r<br />\n\r<br />\nThe mystery continues.<div>Tag: <a href=\"https://www.macrumors.com/guide/bitcoin/\">Bitcoin</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/06/macos-includes-bitcoin-whitepaper/\">Apple Has Included Bitcoin Whitepaper in Every Version of macOS Since 2018</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-has-included-bitcoin-whitepaper-in-every-version-of-macos-since-2018.2386059/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d29b705701468d495333c07cb1215201eb8642846ed0daadd8b599ab5e7266e5","category":"Apple"}