{"title":"Nexus between Green Technological Innovation, Renewable Energy Development, and Green Economic Growth: Role of Green Finance","link":"https://www.preprints.org/manuscript/202405.1304/v1","date":1716209634000,"content":"To meet the dual-carbon objective, China's economy needs to move from a carbon-intensive to a green economy. Green technology innovation and renewable energy development are key to promoting green economic growth. The study uses 2010–2022 provincial panel data from 30 Chinese provinces. The super-efficient SBM model measures the province's green economic growth index. A panel fixed-effects model is used to experimentally evaluate how green technology innovation and renewable energy development affect green economic growth. Green financing moderates and a panel threshold model tests the threshold effect of renewable energy development on green economic growth. The results demonstrate that (1) China's green economic growth is rising and has a \"U\" shape. (2) all selected variables significantly impact green economic growth. However, population density, government intervention, and industrial structure are inversely associated with GEG. Green economic growth is significantly boosted by the moderate role of green finance in the development of renewable energy and green technological innovation. (3) Renewable energy development has a single threshold non-linear effect on green economic growth, depending on its development level and green technological innovation. Considering China's current condition and research findings, this study examines the green energy transition to promote green economic growth and high-quality economic development. Meanwhile, puts forward some important policy recommendations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2b71383355239592ddc0c4dcefe9afab226d477d3af465b08283f897614bc87","category":"Interdisciplinary"}