{"title":"iOS 16.5 and macOS 13.4 bring sports news, Bluetooth fixes, and security updates","link":"https://arstechnica.com/?p=1940211","date":1684436718000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/iphone-14-pro.jpeg\" alt=\"The iPhone 14 Pro.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/iphone-14-pro.jpeg\">Enlarge</a> <span>/</span> The iPhone 14 Pro. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple has released a new batch of software updates for all of its platforms today, adding some of the last noteworthy features to iOS 16, iPadOS 16, and macOS Ventura before it announces their replacements at its Worldwide Developers Conference next month. The iOS and iPadOS 16.5 updates and macOS 13.4 update are available to download now.</p>\n\n<p>Apple is mostly done adding marquee features to these versions of its software, and the list of improvements is short. The biggest addition in iOS, macOS, and iPadOS is a sports tab in the Apple News app, which apparently makes it easier to follow sports news. And they resolve an issue across all operating systems that would keep Screen Time activity from being synced properly. And iOS and iPadOS pick up new Pride-themed wallpapers.</p>\n<p>The iOS and iPadOS 16.5 and macOS 13.4 updates also fix some outstanding bugs. In macOS, there’s a fix for a problem that would keep Macs from using an Apple Watch to unlock, plus a fix for Bluetooth keyboards taking too long to connect after a restart. The iOS update fixes a Spotlight freezing bug and problems with the Podcasts app in CarPlay.</p></div><p><a href=\"https://arstechnica.com/?p=1940211#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1940211&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d2b8efb54071227dd3fa912393f5f080785ee3dd0d2f0919aa501b46e0f3ea57","category":"Tech"}