{"title":"Modification and testing of SWAT for paddy field water consumption and yield","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.96?af=R","date":1727108157000,"content":"<h2>Abstract</h2>\n<p>SWAT model is one of the primary tools for assessing irrigation district water management and water-saving measures. However, its incapacity to consider the diverse growth and water requirements of paddy during various growth stages, as well as the insufficient availability of external water sources. This study introduces the Penman-Monteith equation and Jensen model into the SWAT framework, setting crop coefficients, crop base coefficients, and growth stage sensitivity indices based on the different growth stage. Additionally, modifications are made to the external water source available for irrigation and paddy field leakage modules, establishing a distributed agricultural hydrological model suitable for accurately simulating water balance elements and paddy yield in multi-source irrigation districts. The Yangshudang watershed in the Zhanghe irrigation district is chosen for the evaluation of the modified model's simulation performance, with a quantitative assessment of water-saving and yield-increasing effects. The results demonstrate that the modified model effectively meets the requirements for simulating paddy evapotranspiration of various growth stages, yield, agricultural irrigation water consumptions, and runoff, exhibiting a notable enhancement in performance. As two common water-saving measures in irrigation areas, intermittent irrigation and irrigation district renovation were used as two water-saving scenarios in the simulation of the modified SWAT model. Under intermittent irrigation, the watershed experiences a 6.58% reduction in net irrigation water use. In the scenario with irrigation district renovation, the water resources in the watershed are utilized more efficiently. The modified model from this study can be applied for assessing the synergistic effects of irrigation district water-saving and yield-increasing measures, providing crucial insights for the formulation of irrigation district water-saving strategies and water resource optimization plans.</p>","author":"Jialong Chen, \nYalong Li, \nWenbing Luo, \nLei Yu, \nZhike Zou, \nWenjuan Wang, \nShaozhe Huang, \nChi Tang, \nLei Ye, \nXue Xiao","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"d2c93728484ecd9725cc038cfc3ba98bf0e294d4e89aa6cabe8bb15b61ef8896","category":"Environment"}