{"title":"DeepMind ซื้อซอฟต์แวร์จำลองฟิสิกส์ MujoCo แจกให้ใช้ฟรีทันที เตรียมโอเพนซอร์สปีหน้า","link":"https://www.blognone.com/node/125334","date":1634573285000,"content":"<div><div><div><p>DeepMind บริษัทปัญญาประดิษฐ์ของกูเกิลประกาศเข้าซื้อ MuJoCo (Multi-Joint dynamics with Contact) ผู้ผลิตซอฟต์แวร์จำลองระบบฟิสิกส์ในโลกความเป็นจริง จากเดิมเป็นซอฟต์แวร์ของบริษัท Roboti LLC ตอนนี้ทาง DeepMind ประกาศให้ใช้งานได้ฟรีทันที</p>\n<p>ตัวโครงการ MuJoCo ที่จริงแล้วเป็นไลบรารีในภาษา C และสามารถอ่านข้อมูลโลกจำลองในฟอร์แมต MJCF ที่เป็นภาษา XML สำหรับการสร้างโลกจำลอง เช่น ลูกข่างที่กำลังหมุน, หรือลูกตุ้มที่แกว่งไปมาจากการแขวนบนเส้นด้าย ความแตกต่างของ MuJoCo กับระบบฟิสิกส์ในเกมเอนจินคือมันถูกออกแบบเพื่อความแม่นยำเป็นหลัก ไม่ใช่ประสิทธิภาพหรือเสถียรภาพ ทำให้มันสามารถจำลองระบบที่ซับซ้อนเช่น ลูกตุ้มแกว่งของนิวตัน (Newton's Cradle) หรือการรักษาโมเมนตัมเชิงมุมของวัตถุ</p>\n<p>เป้าหมายหนึ่งของการวิจัยปัญญาประดิษฐ์ทุกวันนี้คือการจำลองระบบควบคุมทางกายภาพ ที่ปัญญาประดิษฐ์ต้องควบคุมหุ่นยนต์และรับมือกับความเปลี่ยนแปลงในโลกความเป็นจริง โดยทั่วไปแล้วการฝึกปัญญาประดิษฐ์สามารถทำได้ด้วยการสร้างโลกจำลองในคอมพิวเตอร์เพื่อฝึกปัญญาประดิษฐ์อย่างหนักเหมือนได้ฝึกทำตามเป้าหมายในโลกความเป็นจริงนับหมื่นนับแสนครั้ง ระบบจำลองทางฟิสิกส์ที่มีความแม่นยำสูงจึงจำเป็นสำหรับการฝึกเช่นนี้</p>\n<p>ตอนนี้ทาง DeepMind ยังเปิดให้ใช้งานเฉพาะไบนารีที่คอมไพล์มาแล้วได้ฟรี และจะจัดระเบียบซอร์สโค้ดอีกครั้งก่อนจะเปิดซอร์สออกมาในปี 2022</p>\n<p>ที่มา - <a href=\"https://deepmind.com/blog/announcements/mujoco\">DeepMind</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/affd2dc3d6a1b6b41a862c4b25b7e819.jpg\" /></p>\n<p>ภาพ Newton's Cradle ที่จำลองใน MuJoco</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/deepmind\">DeepMind</a></div><div><a href=\"/topics/robotics\">Robotics</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d2cce09fb294c316ef55ff284d636fd591295e7ff1f1bfd08291ec7c6177e710","category":"Thai"}