{"title":"Molecular Characterization and Risk Factors Associated with Rotavirus among Children with diarrhoea.","link":"https://www.preprints.org/manuscript/202405.1456/v1","date":1716380774000,"content":"Introduction:\nRotavirus-induced acute diarrhoea continues to pose a significant health threat to children under 5 years old worldwide, despite the availability of effective vaccines. This study aimed to assess the prevalence, associated risk factors, and circulating genotypes of rotavirus among children under 5 admitted to Ikom Medical Centre due to diarrhea. Methodology: Stool samples were collected from 294 children under 5 with diarrhoea at Ikom Medical Centre. Rotavirus antigen detection was performed using rapid chromatographic immunoassay. Molecular techniques such as polyacrylamide gel electrophoresis (PAGE), RT-PCR, and semi-nested multiplex RT-PCR were used to analyze rotavirus strains. Data were obtained through questionnaires, and statistical significance was assessed using the chi-square test (P &lt; 0.05). Results: Among the 294 samples, 20.4% (60/294) tested positive for rotavirus. Significant risk factors influencing rotavirus prevalence included feeding status, toilet system, and duration of diarrhoea. The most prevalent genotype for VP7 was G4 (26.7%), and for VP4, it was genotype P[4] (23.3%). Predominant genotype combinations were G4P [4] (11.6%) and G12P[4] (6.7%), while non-typeable P[NT] was observed in 41.7% of cases. Conclusion: This study highlights the circulation of rotavirus in Ikom, Cross River State, emphasizing its neglected status despite its significant global impact on child mortality. Urgent attention is needed to address rotavirus as a serious public health concern, particularly in low-resource settings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2cd78e5dbd1202b51475d8f12b44230c08b8e28766b22a001752cd4549ea03b","category":"Interdisciplinary"}