{"title":"Cyclist Doorstep Rides, No6: komoot ambassador Liam Yates' Ashdown Forest loop","link":"https://www.cyclist.co.uk/in-depth/9617/cyclist-doorstep-rides-no6-komoot-ambassador-liam-yates-ashdown-forest-loop","date":1620996364000,"content":"<span>\n      <span><a href=\"/authors/liam-yates\">Liam Yates</a></span>\n  </span><div>  \n  <div>      <div><span>14 May 2021</span></div>    </div></div><p>\nThe historic roads and villages in East Sussex make for a great day out on two wheels</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/05/liam_yates_doorstep_1.jpg?itok=OeBaFIjJ\" />  </div>\n<div>\n      <p> <strong>Over an eight-week period, <em>Cyclist</em> and <em>komoot</em> are sharing some of their favourite rides and routes that are accessible from the doorstep. In part six of the series, we hear from <a href=\"https://www.komoot.com/user/739052563113\" target=\"_blank\">Liam Yates</a>, komoot ambassador and talented son of famous father Sean </strong></p>\n<p>The Ashdown Forest is an ancient area of tranquil open heathland occupying the highest sandy ridge-top of the High Weald.</p>\n<p>It has been my home for all my life, giving me not only the freedom to easily get outside and away from people but also the joy of an attachment to nature and the outdoors. </p>\n<p><a href=\"https://www.komoot.com/collection/1121279/-cyclist-doorstep-rides\" target=\"_blank\"><strong>See the Cyclist Doorstep Rides Collection on komoot</strong></a></p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/5405/blow-by-blow-inside-silca\">Blow by blow: inside Silca</a></div>      <div><a href=\"/reviews/5577/silca-grande-americano-seat-roll-review\">Silca Grande Americano Seat Roll review</a></div>      <div><a href=\"/garmin/9104/garmin-edge-1030-plus-gps-bike-computer-review\">Garmin Edge 1030 Plus GPS bike computer review</a></div>      <div><a href=\"/reviews/6361/wahoo-elemnt-roam-review-navigation-colour-screen-long-battery-life\">Wahoo Elemnt Roam long-term review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 114: on sale now!</a></div>    </div></div><p>\nAshdown Forest's origins lie as a medieval hunting forest created soon after the Norman conquest of England. By 1283 the forest was fenced in, enclosing an area of some 13,000 acres.</p>\n<p>In total there are 34 gates and hatches around the perimeter, still remembered in place names such as Chuck Hatch and Chelwood Gate.</p>\n<p>Historically these allowed local people to enter to graze their livestock, collect firewood, and cut heather and bracken for animal bedding.</p>\n<p>The area is famous as the setting for the Winnie-the-Pooh stories written by AA Milne, who lived on the Forest and would walk there with his son Christopher Robin.</p>\n<p>That’s something I always tell people wherever I am in the world, since everyone knows Winnie-the-Pooh and the 100-acre wood.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/05/liam_yates_doorstep_2.jpg\" />  </div>\n</div>\n<p>My Doorstep ride is a tarmac loop of the Ashdown Forest that starts and finishes in the small village of Forest Row.</p>\n<p>From my doorstep it’s uphill whatever way you go and the climbs to the forest will have you warmed up in no time at all. Once you’ve reached higher ground you’re rewarded with expansive views across the heavily wooded hills of the Weald to the chalk escarpments of the North and South Downs on the horizon.</p>\n<p>After the gradual climb of Priory Road you drop down to Weir Wood Reservoir, heading south towards Horsted Keynes before cutting back up to Chelwood Gate. Here you will find a lovely quiet lane to Sheffield Park then to one of my favourite cafes in the area at Fletching.</p>\n<p>Many of our long winter rides have stopped by Fletching Village Stores Cafe over the years, It’s a great cyclist-friendly location with some good quality food and drink to keep you going.</p>\n<p>Riding these roads is special to me and I often wonder what it would have been like to ride them 30 years ago when they were the training ground and roads to adventure for my father and his friends.</p>\n<p>He once told us a story about this one steep climb in particular that we always ride and how he went up there with Lance Armstrong on a training ride and tricked him into being in the wrong gear.</p>\n<p>It has a sharp right hand bend that ramps straight up to 25%, and Lance couldn’t change gear in time so he had to unclip and walk the rest.</p>\n<p>\nFrom Fletching you head north, climbing as the route take you up to Nutley and towards the centre of the Ashdown.</p>\n<p>Passing Friends Clump, the route runs along the top of the Forest to Kings Standing, where you should keep your eyes peeled as often there is an ice cream van parked up – even in the colder months.</p>\n<p>Down the long decent of Black Hill and then around through Hartfield, the route passes the amazing Pooh Corner cafe.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/05/liam_yates_doorstep_3.jpg\" />  </div>\n</div>\n<p>This is another popular place to stop and a must for anyone who wants to experience the Ashdown Forest to the full. Stopping for a slice of cake at this point would be a wise idea as you might need the energy for what’s still to come.</p>\n<p>Leaving Hartfield, the road takes you back up all the way to the top of the Forest once more where you will be greeted with some amazing views as you reach the top and turn towards the most well known climb in the area, Kidd’s Hill.</p>\n<p>\nHeading towards Chuck Hatch, there is one final climb to come and it’s possibly my favourite in the Ashdown Forest as it heads up Coleman's Hatch to Wych Cross, with just the downhill road back to Forest Row to come.</p>\n<p>Once you’ve completed the loop and you’re back in the village, there is a great brewery called the Hop Yard that my komoot route will lead you straight to. It’s the perfect place to grab a beer and pizza to relax after completing the ride. You won’t be disappointed.</p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d2cfc18296b190039fd1fbec9110bdd1f22d1cd2e3bdcf9add0167937dddce5f","category":"Cycling"}