{"title":"PSXII-25 Impacts of crude protein level and urea source on finishing performance of Nellore bulls","link":"https://academic.oup.com/jas/article/102/Supplement_3/776/7757901?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The interactions between two different crude protein levels [CP, 11 vs 14% of dry matter, DM] and two urea sources [US, feed-grade (FGU) vs. post-ruminal release (PRU)] on finishing performance of Nellore bulls were evaluated. Nellore bulls [n = 84; initial body weight (BW) = 448 ± 40.5 kg] were stratified from light to heavy and allocated to 7 groups of 4 replicate pens (28 pens in total, with three bulls per pen). The following treatments were assigned: 1) 11% CP with UC; 2) 11% CP with PRU; 3) 14% CP with UC; 4) 14% CP with PRU. At the beginning of the study, 7 bulls were slaughtered to determine initial carcass dressing (452 ± 62.6 kg; 52.8%). Diets consisted of sorghum silage, ground corn, rehydrated and ensiled corn, vitamin-mineral mix, soyhulls (11% CP diets) and soybean meal (14% CP diets). Kaolin was incorporated in diets for reach 100%. The PRU source (Trouw Nutrition, Netherlands) contained 82% urea on DM basis. In an in vitro assay, 27% of this urea was released into the rumen. The total mixed rations were manually mixed and offered ad libitum twice a day (0800 and 1600 h). Daily feed intake was recorded. The experimental period lasted 90 d. The bulls were weighed individually after 16 h of feed restriction on d 0 and d 90 of the experimental period. The statistical model included the fixed effects of CP, US, and the CP × US interaction, as well as the random effect of pen nested within treatment. Effects of CP × US were not detected (<span>P</span> ≥ 0.39) for any feedlot growth performance variable. Bulls fed 14% CP presented greater BW, carcass weight, and ADG at d 90 (<span>P</span> &lt; 0.04) than those fed 11% CP (608 vs. 594 kg, 339 vs. 329 kg, and 1.93 vs. 2.14 kg/d, respectively; Table). Diets with 14% CP diets tended to increase feed efficiency (F:G) in 6% CP compared with diets with 11% CP (<span>P</span> = 0.10; 178.6 vs. 189.7 g/kg, respectively). Although there was not effect of urea source on growth performance, bulls fed PRU presented greater F:G and carcass gain efficiency when compared with those eaten diets with FGU (<span>P</span> ≤ 0.06; 190 vs. 178 g/kg, 118 vs. 109 g/kg, respectively). Diets with 11% CP for finishing bulls negatively affected DM intake, animal performance, and carcass weight. The PRU inclusion in the finishing diets increases feed efficiency for carcass gain.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d2d3b86208e3dbd843af53e33e55b041fdf9ebca2465b08ff3ebfae63deba81a","category":"Environment"}