{"title":"Capacity to Consent in Healthcare: A Systematic Review and Meta-Analysis Comparing Patients with Bipolar Disorder and Schizophrenia Spectrum Disorder","link":"https://www.preprints.org/manuscript/202404.0004/v1","date":1711963182000,"content":"Background: Mental capacity is a fundamental aspect that enables patients to fully par-ticipate in various healthcare procedures. To assist healthcare professionals (HCPs) in assessing patients' capacity, especially in the mental health field, several standardized tools have been developed. These tools include the MacArthur Competence Assessment Tool for Treatment (MacCAT-T), the MacArthur Competence Assessment Tool for Clinical Research (MacCAT-CR), and the Competence Assessment Tool for Psychiatric Advance Directives (CAT-PAD). The core dimensions explored by these tools include Understanding, Appreciation, Reasoning, and Expression of a choice. \nObjective: This meta-analysis aimed to investigate potential differences in deci-sion-making capacity within the healthcare context among groups of patients with bi-polar disorder (BD) and schizophrenia spectrum disorder (SSD).\nMethods: A systematic search was conducted on Medline/Pubmed, and Scopus. Addi-tionally, Google Scholar was manually inspected, and a manual search of emerging re-views and reference lists of the retrieved papers was performed. Eligible studies were specifically cross-sectional, utilizing standardized assessment tools, and involving pa-tients diagnosed with BD and SSD. Data from the studies were independently extracted and pooled using random-effect models. Hedges g was used as a measure for outcomes. \nResults: Six studies were identified, with three studies using the MacCAT-CR, two studies the MacCAT-T, and one the CAT-PAD. The participants included 189 individuals with BD and 324 individuals with SSD. The meta-analysis revealed that patients with BD performed slightly better, and the difference was statistically significant, compared to patients with SSD, particularly in the domain of Appreciation (ES=0.23, 95% CI: 0.01 to 0.04, p=0.037). There was no statistically significant difference between the two groups for Understanding (ES=0.09, 95% CI: - 0.10 to 0.27, p=0.352), Reasoning (ES=0.18, 95% CI: - 0.12 to 0.47, p=0.074), and Expression of a choice (ES = 0.23, 95% CI: - 0.01 to 0.48, p=0.60). In the sensitivity analysis, furthermore, when considering only studies involving patients in symptomatic remission, the difference for Appreciation also resulted in non-significant (ES=0.21, 95% CI: -0.04 to 0.46, p=0.102). (ES=0.21, 95% CI: -0.04 to 0.46, p=0.102). \nConclusions: These findings indicate that there are no significant differences between patients with BD and SSD during remission phases, while differences are minimal during acute phases. The usefulness of standardized assessment of capacity at any stage of the illness should be considered, both for diagnostic-therapeutic phases and for research and advance directives. Further studies are necessary to understand the reasons for the overlap in capacity between the two diagnostic categories compared in this study.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2d6f652b30ee97af5a45692bab7cbd5088c3865bd09a06607f4b8f13f845695","category":"Interdisciplinary"}