{"title":"pH-Responsive Al2O3 Nanoparticles using Cymbopogan citratus Leaves Extract for the Removal of Inorganic Ions Through Photo-catalytic Degradation from Waste Water","link":"https://www.preprints.org/manuscript/202403.1151/v1","date":1710861095000,"content":"Water pollution is the main problem in the current scenario which is being faced by mankind due to the industrial and commercial effects. Industrial effluents contain heavy metals and inorganic ions like nitrates and phosphate ions. These ions are being included in waterways through industrial runoff. When the concentration of these hazardous pollutants increases in aquatic flora and fauna causes severe health problems. So remediation of these toxicants from water reserves is of chief importance. Conventional processes along with modern processes are being used for the treatment of industrial wastes. Photo-degradation is a modern method used for the degradation of inorganic ions due to its environmentally friendly nature and cost-effectiveness. In a recent study Aluminum oxide (Al2O3) nanoparticles were synthesized via a green approach at different pH by using Cymbopogan citratus (lemongrass) plant extract and these nanoparticles were used for the removal of inorganic ions from wastewater. The nanoparticles of different pH showed different % degradation of the inorganic ions in acidic medium removal of inorganic waste was less, in basic media % degradation was more as compared to acidic media but maximum % degradation was observed in neutral media like that average % degradation 91% and 81% was observed for nitrate and phosphate ions. The maximum absorbance occurred at 212nm and Al2O3 nanoparticles showed absorbance from 210nm-217nm. The R2 values of pseudo1st, 2nd, and BMG models were 0.956, 0.837, 0.7007 0.95, 0.896, and 0.756 for the nitrate and phosphate ions. Characterizations of synthesized particles were investigated by using UV-visible spectroscopy and other analytical methods like X-ray diffraction (XRD) and Fourier transform infrared spectroscopy (FTIR). The statistical analyses were done using Simple Linear regression (SLR).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d2df5f107d7ec6910c2b1156c566145998d9c23cd0a1309b8041820a8ade5190","category":"Interdisciplinary"}