{"title":"Effects of protein levels on production performance, nutritional values, and phase feeding of two-spotted cricket","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae039/7637842?rss=1","date":1711756800000,"content":"<span><div>Abstract</div>Two experiments were conducted to determine the effects of different protein levels on the growth performance, feed efficiency and nutritional values, and phase feeding of the 2-spotted cricket (<span>Gryllus bimaculatus</span> de Geer). In experiment 1, 4 crude protein (CP) diets were formulated to contain 18%, 20%, 22%, or 24% CP, respectively. A sample of 7-day-old 3,600 crickets was equally divided into 24 plastic boxes (150 crickets each) in a completely randomized design with 4 diets and 6 replications. In experiment 2, 2-phase feedings were used. For starting period (days 7–18), crickets in all treatments were fed a diet containing 22% CP. During the growing period (days 19–35), 3 groups of crickets were fed diets containing 18%, 20%, and 22% CP. In the overall period of experiment 1, the crickets fed with 22% CP diet had greater body weight compared to those fed with 18% CP diet. In addition, the crickets fed with 22% CP diet had the lowest feed conversion ratio (FCR). The broken-line model indicated the growth pattern changed on day 18. In experiment 2, the crickets fed with 20% CP diet from days 19 to 35 had greater growth performance and lower FCR than those fed with 18% CP, but not different from those fed with 22% CP. In conclusion, 22% CP can increase growth performance by improving the feed efficiency of crickets. The implementation of 2-phase feedings using 20% CP, during the growing period, could be considered as a cost-effective strategy for sustainable cricket production.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"d2e52c45dd02c460e4f96058c575f5392054e1fbaa4050740d1f3c98f1c3a0e1","category":"Environment"}