{"title":"ไลนัสชี้ shared library สร้างปัญหามากกว่าประโยชน์ หลายแพ็กเกจแชร์กับใครไม่ได้","link":"https://www.blognone.com/node/122516","date":1620200337000,"content":"<div><div><div><p>ไลนัสแสดงความเห็นว่า shared library นั้นสร้างปัญหามากกว่าประโยชน์ระหว่างการพูดคุยแก้ปัญหา clang ในเคอร์เนลทำงานได้ช้า ขณะที่ดิสโทรสำคัญอย่าง Fedora นั้นมีนโยบายบังคับให้แพ็กเกจต่างๆ ที่ใช้ไลบรารีจากแพ็กเกจอื่น<a href=\"https://docs.fedoraproject.org/en-US/packaging-guidelines/#_statically_linking_executables\">ต้องลิงก์แบบ dynamic เท่านั้น</a></p>\n<p>ไลบรารี dynamic หรือไฟล์ .dll บนวินโดวส์และ .so บนลินุกซ์ เป็นไลบรารีที่คอมไฟล์ไว้ล่วงหน้าแต่ไม่ใช่ไฟล์พร้อมรัน (executable) ด้วยตัวเอง แต่ต้องให้โปรแกรมอื่นๆ มารวมเอาไลบรารีเข้าไปเมื่อโหลดโปรแกรม การทำงานเช่นนี้ทำให้ระบบปฎิบัติการสามารถใส่ไลบรารีไว้เพียงชุดเดียว หลังจากนั้นทุกโปรแกรมก็สามารถใช้ไลบรารีร่วมกันได้ ทำให้ประหยัดพื้นที่ดิสก์และหน่วยความจำ</p>\n<p>ไลนัสแย้งว่าหากไม่ใช่ไลบรารีแกนกลางจริงๆ เช่นไลบรารี GUI อย่าง Gnome หรือ Qt แล้วอัตราการใช้ไลบรารีซ้ำกันนั้นน้อยมาก จนทำให้ดิสก์ที่ประหยัดได้มีเพียงเล็กน้อยเท่านั้น ส่วนการประหยัดหน่วยความจำก็น้อยมากและหลายครั้งก็เปลืองหน่วยความจำกว่าเดิม</p>\n<p>พร้อมกันนั้นไลนัสชี้ปัญหาของไลบรารี dynamic ว่ามีโครงการจำนวนมากสร้างไลบรารีที่ไม่มีคนอื่นใช้งานยกเว้นแต่โปรแกรมบางตัวเท่านั้ แต่โครงการก็ต้องคอมไพล์ไลบรารี dynamic ออกมา แม้การใช้งานจริงจะต้องใช้งานกับตัวโปรแกรมที่เวอร์ชั่นตรงกันเท่านั้น</p>\n<p>ที่มา - <a href=\"https://lore.kernel.org/lkml/CAHk-=whs8QZf3YnifdLv57+FhBi5_WeNTG1B-suOES=RcUSmQg@mail.gmail.com/\">kernel.org</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ac85f4a6f56b36e323f283d7d2db0b56.png\" /></p>\n<p>ภาพการทำงานของ linker โดย <a href=\"https://commons.wikimedia.org/wiki/File:Linker.svg\">Qef</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/linus-torvalds\">Linus Torvalds</a></div><div><a href=\"/topics/linux\">Linux</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d2e652d8e6bd4483b9439ef251503667e5640a4bde50b3eb3368f8644f8f5cf5","category":"Thai"}