{"title":"Vivaldi 6.0 Web Browser Introduces Tab Workspaces and Custom Icons","link":"https://www.macrumors.com/2023/04/19/vivaldi-6-mac-tab-workspaces-custom-icons/","date":1681898147000,"content":"<a href=\"https://vivaldi.com\">Vivaldi</a> web browser this week pushed out its sixth major release, bringing a new Workspaces feature and custom icons and themes to the highly configurable Mac app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/vivaldi-workspaces.jpg\" alt width=\"860\" height=\"484\" />\r<br />\nSimilar in functionality to virtual desktops, the new Workspaces feature is designed to further enhance the browser's powerful tab management by letting users organize tabs by category into separate workspaces and switch easily between them.\r<br />\n\r<br />\nFor example, users can create Workspaces for productivity, social media, news, and shopping, and then open related tabs within those Workspaces, making it possible to flip between different sets of tabs and keep workflows organized.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/vivaldi-6.jpg\" alt width=\"860\" height=\"484\" />\r<br />\nWorkspaces can also be used in conjunction with Tab Stacks (similar to Safari's Tab Groups). Vivaldi offers the example of maintaining a Sports workspace and having stacks for \"Football,\" \"Cricket,\" \"Racing,\" and \"Tennis\" to sub-organize your tabs.\r<br />\n\r<br />\nIn addition, Workspaces support Vivaldi's Tab Tiling feature, allowing users to view multiple tabs in a split-screen or grid within workspace groups. \r<br />\n\r<br />\n<div></div>\r<br />\nElsewhere in Vivaldi 6.0, the browser's built-in theming tools have been upgraded to include new Custom Icons, which can be found in the Themes Gallery. With different icon packs now supported, users can create anything from a Windows 95-inspired look, complete with the familiar buttons and colors, to something more artistic with the Hand Drawn style. \r<br />\n\r<br />\nUsers can head to Settings -&gt; Themes -&gt; Create more Themes to get started, or use the new filter on the Themes page to see only themes with new custom icons. \r<br />\n\r<br />\nVivaldi browser 6 is a free download for Mac available directly from the <a href=\"https://vivaldi.com\">Vivaldi website</a>. The browser includes built-in tracking protection, innumerable tab tools, a translation feature, Chrome extensions support, and much more.<div>Tag: <a href=\"https://www.macrumors.com/guide/vivaldi/\">Vivaldi</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/19/vivaldi-6-mac-tab-workspaces-custom-icons/\">Vivaldi 6.0 Web Browser Introduces Tab Workspaces and Custom Icons</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/vivaldi-6-0-web-browser-introduces-tab-workspaces-and-custom-icons.2387205/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d2ef2f05f41ecd078b34685c6b67217f20e294964ef7730505720c27ba524fed","category":"Apple"}