{"title":"223 Exploring the relationship between corn grain yield and residue quantity and quality","link":"https://academic.oup.com/jas/article/102/Supplement_3/185/7757199?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Corn residue grazing is an economical winter feed resource for cows in the Midwest. However, questions about changes in the feeding value have been raised. A 2-yr experiment was conducted to evaluate the effects of corn grain yield on the quantity and quality of corn residue. In yr 1, 32 hybrids were evaluated from four locations in Nebraska. In yr 2, 31 hybrids were evaluated from three locations in Nebraska. Each hybrid was harvested from four replicate plots. Three of the locations were irrigated and four were rainfed. Observed grain yields ranged from 1,416 to 22,318 kg/ha (23 to 355 bushels/acre) with a mean of 12,704 kg/ha (202 bushels/acre). As corn yield increased, the amount of grain relative to whole plant biomass (harvest index) increased (<span>P</span> &lt; 0.01). Harvest index ranged from 48.4% to 67.6% and averaged 59.3%. The increase in harvest index indicates there was less residue produced per kilogram of corn grain produced in greater yielding corn. However, as expected, total amount of residue (kg/ha) still increased (<span>P</span> &lt; 0.01) as grain yield (kg/ha) increased. Within the residue, the proportions of leaf and husk increased (<span>P</span> &lt; 0.01) slightly, stalk decreased (<span>P</span> &lt; 0.01) slightly, while the proportion of cob did not change (<span>P</span> = 0.62) as grain yield increased. On average, the observed plant proportions in this experiment were 15.8% husk, 18.6% leaf, 50.5% stalk and 15.1% cob (DM basis). As grain yield increased, the proportion of husk within residue increased from 14 to 21% and leaf increased from 17 to 24%. In contrast, the proportion of stalk within residue decreased from 53 to 41%. Cattle primarily consume leaf and husk when grazing corn residue, thus the availability and digestibility of those plant parts could be a key factor that affects diet quality of grazing cattle. Both the digestible organic matter (DOM, % of DM) in leaf and husk and the kilograms of DOM from leaf plus husk per 25.4 kilograms of grain declined (<span>P</span> &lt; 0.01) as grain yield increased. On average, the DOM (% of DM) for husk was 69.3% but declined from 83.6 to 56.4% with increasing in grain yield. The average DOM (% of DM) for leaf was 55.6% and declined from 65.3 to 41.6% as grain yield increased. The average amount of DOM from leaf plus husk was 3.6 kg/25.4 kg of grain (8 lb/bushel) and declined from 5.8 to 2.5 kg/25.4 kg of grain (12.8 to 5.5 lb/bushel) as grain yield increased. Thus, the concentration of nutrients in corn residue declined as grain yield increased, meaning greater yielding corn had reduced quality residue. The impacts of this decline in diet quality on cow performance should be further evaluated.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d2f80985846b3813428a1317a3bba90bc36d94e5b4a1d809ceaadad30b11479e","category":"Environment"}