{"title":"The interplay of <i>Pseudomonas aeruginosa</i> and <i>Staphylococcus aureus</i> in dual-species biofilms impacts development, antibiotic resistance and virulence of biofilms in <i>in vitro</i> wound infection models","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304491","date":1716904800000,"content":"<p>by Pia Katharina Vestweber, Jana Wächter, Viktoria Planz, Nathalie Jung, Maike Windbergs</p>\r\n\r\nDue to high tolerance to antibiotics and pronounced virulence, bacterial biofilms are considered a key factor and major clinical challenge in persistent wound infections. They are typically composed of multiple species, whose interactions determine the biofilm’s structural development, functional properties and thus the progression of wound infections. However, most attempts to study bacterial biofilms <i>in vitro</i> solely rely on mono-species populations, since cultivating multi-species biofilms, especially for prolonged periods of time, poses significant challenges. To address this, the present study examined the influence of bacterial composition on structural biofilm development, morphology and spatial organization, as well as antibiotic tolerance and virulence on human skin cells in the context of persistent wound infections. By creating a wound-mimetic microenvironment, the successful cultivation of dual-species biofilms of two of the most prevalent wound pathogens, <i>Pseudomonas aeruginosa</i> and <i>Staphylococcus aureus</i>, was realized over a period of 72 h. Combining quantitative analysis with electron microscopy and label-free imaging enabled a comprehensive evaluation of the dynamics of biofilm formation and matrix secretion, revealing a twofold increased maturation of dual-species biofilms. Antibiotic tolerance was comparable for both mono-species cultures, however, dual-species communities showed a 50% increase in tolerance, mediated by a significantly reduced penetration of the applied antibiotic into the biofilm matrix. Further synergistic effects were observed, where dual-species biofilms exacerbated wound healing beyond the effects observed from either <i>Pseudomonas</i> or <i>Staphylococcus</i>. Consequently, predicting biofilm development, antimicrobial tolerance and virulence for multi-species biofilms based solely on the results from mono-species biofilms is unreliable. This study underscores the substantial impact of a multi-species composition on biofilm functional properties and emphasizes the need to tailor future studies reflecting the bacterial composition of the respective <i>in vivo</i> situation, leading to a more comprehensive understanding of microbial communities in the context of basic microbiology and the development of effective treatments.","author":"Pia Katharina Vestweber","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d301da537af59e8addc5254106b12ec87b055edb422290f92e0ed49c9720817b","category":"Interdisciplinary"}