{"title":"The role of mental health in the relationship between nursing care satisfaction with nurse-patient relational care in Chinese emergency department nursing","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309800","date":1725372000000,"content":"<p>by Hui Huang, Jing Cui, Hua Zhang, Yuhui Gu, Haosheng Ni, Ya Meng</p>\r\nBackground <p>The relationship between a nurse and a patient is a key part of nursing that can impact how happy the patient is with the care they receive. It appears that the nurse’s mental health can also affect this connection. However, there is little research on this topic. So, the aim of the present study was to determine the correlation of nurse’s mental health with nurse–patient relational care and nursing care satisfaction.</p> Methods <p>A total of 532 nurses and 532 patients from 13 Level-III hospitals of Hubei province (China) completed a China Mental Health Survey, general information questionnaire, the Nursing Care Satisfaction Scale, and Relational Care Scale.</p> Results <p>Age, nurse working years, and night shift last month were correlated with mental health score (<i>r</i> = -0.142, <i>r</i> = -0.150, <i>r</i> = 0.164, <i>p</i> &lt; 0.05). Nurse’s mental health was correlated with relational care score and nursing care satisfaction score (r = -0.177, <i>r =</i> -0.325, <i>p &lt; 0</i>.<i>05</i>). Also, relational care score, patients age and gender were correlated with nursing care satisfaction score (<i>r</i> = 0.584 and <i>r</i> = 0.143, <i>x</i><sup>2</sup> = 11.636, <i>p</i> &lt; 0.05). Descriptive information of nurses had a direct impact on nurses’ mental health (direct effect = 0.612, 0.419–0.713). Nurses’ mental health had a direct effect on relational care score (direct effect = 0.493, 0.298–0.428) and an indirect effect on nursing care satisfaction score (indirect effect = 0.051, 0.032–0.074). Relational care score and patient’s descriptive information had also a direct effect on nursing care satisfaction score (direct effect = 0.232, 0.057–0.172 and 0.057, 0.347–0.493).</p> Conclusion <p>This study showed that the better the mental health of nurses, the more patients feel satisfied with nursing services.</p>","author":"Hui Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d30f4eddd1138bf82bb563641d3dac8d6505d5baf0bf7fa37607c721483db6b1","category":"Interdisciplinary"}