{"title":"One-Step Fabrication of Composite Hydrophobic Electrically Heated Graphene Surface for Anti-Icing","link":"https://www.preprints.org/manuscript/202407.0123/v1","date":1719919685000,"content":"Ice accumulation poses considerable challenges in transportation, notably in the domain of general aviation. The present study combines the strengths and limitations of conventional aircraft de-icing techniques with the emerging trend toward all-electric aircraft. The study aims to utilize laser-induced graphene (LIG) technology to create a multifunctional surface, seamlessly integrating hydrophobic properties with efficient electrical heating to mitigate surface icing effectively. We investigated the utilization of a 10.6 μm CO2 laser for direct writing on polyimide (PI), a widely-used insulating encapsulation material. From the thermomechanical perspective, our initial analysis using COMSOL Multiphysics software revealed that when the laser power P exceeds 5 W, the PI substrate experience ablative damage. The experimental results show that when P ≤ 5W, an increase in power has a positive impact on the quality, surface porosity, roughness reduction, line-spacing reduction, and water contact-angle enhancement of the graphene. Conversely, when P &amp;gt; 5 W, higher power negatively affects both the substrate and the graphene structure by inducing excessive ablation. However, it influences the graphene line height positively and is consistent with overall experimental-simulation congruence. Furthermore, the incorporation of high-quality graphene resulted in a surface that exhibited higher contact angles (CA &amp;gt; 120°), lower energy consumption, and higher heating efficiency compared to the use of traditional electrically heated materials for anti-icing applications. The potential applications of this one-step fabrication method extend across various industries, particularly aviation, marine engineering, and other ice-prone domains. Moreover, the method has extensive prospects for addressing pivotal challenges associated with ice formation and serves an innovative and efficient anti-icing technology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d3274bd6f7eb68f4e30887322ed830e6ff91e380a6a02fe4a42f1f79fef7e7f1","category":"Interdisciplinary"}