{"title":"Tour de France Femmes avec Zwift 2023 stage two preview - a testing day in the Massif Central","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-avec-zwift-2023-stage-two-preview-a-testing-day-in-the-massif-central","date":1690129876000,"content":"\n      <p><b>Distance:</b><span> 148km<br /></span><b>Start location: </b><span>Clermont-Ferrand <br /></span><b>Finish location: </b><span>Mauriac<br /></span><b>Stage type: </b><span>Hilly <br /></span><b>Start time: </b>13:05 CEST<br /><b>Finish time (approx):</b><span> 17:18 CEST</span></p>\n<p><span>The Massif Central is renowned for its mountains and plateaus, spanning 15% of France. It has frequently played a role in the<a href=\"https://www.rouleur.cc/pages/tour-de-france\"> Tour de France</a> as it serves as link between the Pyrenees and the Alps, providing thrilling stages as the riders navigate the undulating terrain. With over 9,000 named mountains in the region, the Massif Central offers a playground full of fun for both cyclists and race organisers. The highest peak in the area is the Puy de Sancy, an ancient stratovolcano that has remained inactive for around 220,000 years. </span></p>\n<div></div>\n<p>Although the Puy de Sancy is famous for skiing rather than for cycling, the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes </a>will skirt the peak as they traverse through Mont-Dore en route to Mauriac. However, there are other peaks within the Massif Central that have strong ties to cycling, the Tour in particular, including the Puy de Dôme and Mont Aigoual. While this year's Tour de France Femmes route doesn't include these legendary climbs, the region's rugged terrain still makes for thrilling and demanding stages that can greatly impact the overall standings of the race. </p>\n<p> </p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_two.jpg?v=1689167251\" alt /></span></p>\n<p><span></span><i><span>Stage two profile sourced via ASO </span></i></p>\n<p>The second stage, starting from Clermont-Ferrand, will present a challenging day for the women's peloton as they confront six categorised climbs. With several short yet steep ascents, we can expect GC contenders to battle it out in to minimise any time losses. The first categorised climb appears after a gradual uphill section section from the city, at approximately 40 kilometres into the stage. The Côte du Mont-Dore, although short at 1.3km, boasts an average of 6.6%, making an idea springboard for riders eager to seize any opportunity. The remainder of the first half of the stage consists mostly of downhill sections, with the exception of the Côte de la Stèle. </p>\n<p>The climbs are concentrated in the latter half of the stage, as the riders enter the final circuit around Mauriac. The circuit commences with the Côte des Plaines, a 4.5km climb with an average gradient of 5.5%. Without respite, the peloton will face the Côte des Boissières and Côte de Merlhac before encountering a decisive climb just 500m from the finish line. This final ascent could prove to be the determining factor in deciding the stage winner.  </p>\n<h3><span><strong>Contenders</strong></span></h3>\n<p><span>Stage two of the 2023 Tour de France Femmes offers up an even harder profile to the opening stage and we can expect to see a similar contingent of riders battling for victory. It looks too difficult for the sprinters to make it over the five categorised climbs today and it is seeming like it won’t be down to the Tourmalet to give us all of the general classification action from this year’s race. We could expect some of the key contenders overall to be in contention for a stage win in the second day of the race. </span></p>\n<p><span>One rider who might want to stop this, however, is current yellow jersey wearer <strong>Lotte Kopecky</strong> of SD Worx. Although not a pure climber, the Belgian rider proved that she is more than capable of performing on the shorter, punchy ascents when she won the opening stage of the Tour and she will be looking to win again, and hold on to yellow in stage two. However, SD Worx also have other options in the shape of <strong>Demi Vollering</strong> who might go for a solo move if it gives her the chance to gain time on her GC rivals, as well as <strong>Marlen Reusser</strong> who is also well-suited to a long range attack. </span></p>\n<p>Outside of SD Worx, <strong>Ashleigh Moolman</strong> of AG Insurance-Soudal-Quick Step is another contender for today, she performed well on the opening stage and crossed the line frustrated about missing out on the win. The same can be said for <strong>Marianne Vos</strong> of Jumbo-Visma, she came close to victory on stage one and could also do well today, but this depends on if she manages to get herself over the climbs. We all know not to underestimate Vos, however.</p>\n<p><span>FDJ-Suez have been vocal that they come to the Tour de France Femmes with the goal of stage wins in mind and stage two could be a perfect opportunity for the French squad<strong>. Cecilie Uttrup Ludwig</strong> will relish the rolling, hard terrain and could be in with a chance, as could <strong>Marta Cavalli</strong> or <strong>Évita Muzic</strong> – FDJ have a number of options. From Lidl-Trek, <strong>Elisa Longo Borghini</strong> is the best option for the American squad, she looked strong on stage one and will likely go even better in a stage that has more climbing.</span></p>\n<p><span><strong>Kasia Niewiadoma</strong> and <strong>Elise Chabbey</strong> of Canyon//SRAM could be in with a chance too, as could<strong> Liane Lippert</strong> (Movistar). Lippert may be working in the services of defending Tour champion <strong>Annemiek van Vleuten</strong>, however, who could also fancy her chances on stage two. </span></p>\n<p><span><strong>Mavi García</strong> of Liv Racing TeqFind is also a rider who could perform well on today’s stage, as could <strong>Veronica Ewers</strong> of EF Education-Tibco-SVB.</span></p>\n<h3><span><strong>Prediction</strong> </span></h3>\n<p><span>We're betting on Ashleigh Moolman to take victory today. The South African rider looked strong on stage one and will be even better suited to today's terrain.</span></p>\n<p><em><span>Cover image: ASO/Thomas Maheux</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d32f059dc2f7334a8a78c9be318eddce020ddfd5261eca197baeecd1bc42e07f","category":"Cycling"}