{"title":"Effects of older age on contraction-induced intramyocellular acidosis and inorganic phosphate accumulation <i>in vivo</i>: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308336","date":1727272800000,"content":"<p>by Luke R. Arieta, Zoe H. Smith, Amanda E. Paluch, Jane A. Kent</p>\r\n\r\nAlthough it is clear that the bioenergetic basis of skeletal muscle fatigue (transient decrease in peak torque or power in response to contraction) involves intramyocellular acidosis (decreased pH) and accumulation of inorganic phosphate (Pi) in response to the increased energy demand of contractions, the effects of old age on the build-up of these metabolites has not been evaluated systematically. The purpose of this study was to compare pH and [Pi] in young (18–45 yr) and older (55+ yr) human skeletal muscle <i>in vivo</i> at the end of standardized contraction protocols. Full study details were prospectively registered on PROSPERO (CRD42022348972). PubMed, Web of Science, and SPORTDiscus databases were systematically searched and returned 12 articles that fit the inclusion criteria for the meta-analysis. Participant characteristics, contraction mode (isometric, dynamic), and final pH and [Pi] were extracted. A random-effects model was used to calculate the mean difference (MD) and 95% confidence interval (CI) for pH and [Pi] across age groups. A subgroup analysis for contraction mode was also performed. Young muscle acidified more than older muscle (MD = -0.12 pH; 95%CI = -0.18,-0.06; <i>p</i>&lt;0.01). There was no overall difference by age in final [Pi] (MD = 2.14 mM; 95%CI = -0.29,4.57; <i>p</i> = 0.08), although sensitivity analysis revealed that removing one study resulted in greater [Pi] in young than older muscle (MD = 3.24 mM; 95%CI = 1.72,4.76; <i>p</i>&lt;0.01). Contraction mode moderated these effects (<i>p</i> = 0.02) such that young muscle acidified (MD = -0.19 pH; 95%CI = -0.27,-0.11; <i>p</i>&lt;0.01) and accumulated Pi (MD = 4.69 mM; 95%CI = 2.79,6.59; <i>p</i>&lt;0.01) more than older muscle during isometric, but not dynamic, contractions. The smaller energetic perturbation in older muscle indicated by these analyses is consistent with its relatively greater use of oxidative energy production. During dynamic contractions, elimination of this greater reliance on oxidative energy production and consequently lower metabolite accumulations in older muscle may be important for understanding task-specific, age-related differences in fatigue.","author":"Luke R. Arieta","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d3324815ccb11f83c77968236071ae92e5b9ec86ad84b0cf62df5656a55c78f6","category":"Interdisciplinary"}