{"title":"How to add widgets to the macOS Sonoma Desktop","link":"https://www.macworld.com/article/1981562/how-to-add-widgets-desktop-macos-sonoma.html","date":1689765300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The key new feature in macOS Sonoma is the ability to add widgets to the Desktop. They’re no longer banished to the notification shade that slides opens when you click on the time in the menu bar. In Sonoma, widgets can exist anywhere on the Desktop so you can see them all the time. This new widget implementation gives you instant access to the information you need. Let’s look at how to add widgets to your Desktop.</p>\n\n\n\n<p>Check out our <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS Sonoma guide</a> for more information about the latest version of the Mac operating system.</p>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li><span>Time to complete: </span><span>  5 minutes</span></li><li>Materials required: macOS Sonoma</li><li>Cost: Free</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Edit Widgets</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-edit-widgets.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Sonoma Desktop Widgets Edit\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>When you first install macOS Sonoma, you can find your widgets like before by clicking the date and time in the menu bar. In the sidebar that appears, you’ll find a tab for the new Desktop widgets. You can click it to get started, but if you don’t see that section, just click <em>Edit Widgets</em> at the bottom of the column.</p>\n\n\n\n<p>You can also Control-click (or two-finger tap on a trackpad) on the Finder and select <em>Edit Widgets</em> in the pop-up menu.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Pick your widgets</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widgets-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"sonoma widgets\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The widget browser will appear from the bottom of the screen. Peruse the browser until you find the widget you want. You’ll find that widgets are available in different sizes and styles. For example, the Clock widget has options for displaying the time in a different city, or options for a World Clock.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Place a widget</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-place-widget.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Sonoma place desktop widget\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>To place a widget, you can click and then drag the widget wherever you want on the Desktop. Or you can click it and it automatically appears in the upper left of the Desktop; you can then click and drag to move it.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Customize your widgets</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-widget-options.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Sonoma Desktop Widgets options\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>After you’ve placed a widget, it can be adjusted at any time.</p>\n\n\n\n<ul>\n<li>You can move it by clicking and dragging.</li>\n\n\n\n<li>Control-click on a widget to see a pop-up menu that lets you adjust its size or remove the widget.</li>\n\n\n\n<li>Some widgets allow you to click on them to open the full app or to access an expanded interface. Some widgets, such as the Podcast widget, have a limited set of controls within the widget that you can use so the full app doesn’t have to be opened.</li>\n</ul>\n\n\n\n<p>If you drag a file, folder, or other item to the Desktop and on top of a widget, macOS places the item in the closest available Desktop space. It does not launch the file in the widget’s app.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>5.</span>\n<h3>Widget settings in Desktop &amp; Dock</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-desktop-dock-widgets-settings.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"sonoma desktop dock widget settings\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The Desktop &amp; Dock system setting has a few helpful options.</p>\n\n\n\n<p><strong>Show widgets</strong>: Don’t want widgets at all on the Desktop? The Desktop section of this setting has a place where you can turn them off with the flip of a switch.</p>\n\n\n\n<p><strong>Widget style</strong>: In the Widgets section of this setting, you have options for the color appearance of widgets<em>:</em></p>\n\n\n\n<ul>\n<li><strong>Automatic</strong>: Adjusts the appearance between Full-color and Monochrome. When you’re in the Finder, widgets appear as Full-color. Widgets will dim to Monochrome whenever you are in an app and you can see the Finder in the background.</li>\n\n\n\n<li><strong>Monochrome</strong>: Displays the widget as it looks when it’s dimmed all the time, even while in the Finder.</li>\n\n\n\n<li><strong>Full-color</strong>: Displays the full set of colors all the time, even when widgets are in the background.</li>\n</ul>\n\n\n\n<p><strong>Use iPhone widgets</strong>: This provides the option to allow or not allow iPhone widgets. The iPhone needs to be on the same Wi-Fi network or nearby for widgets to update.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>6.</span>\n<h3>On every Desktop</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/sonoma-desktip-widgets-mission-control.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Sonoma Desktop Widgets multiple\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If you like to use multiple Desktops, know that widgets will appear on all Desktops. For example, if you create a second Desktop in Mission Control, when you switch back and forth between the two, your widgets follow you.</p>\n\n\n\n<p>During the Sonoma beta period, Apple does not provide a way to assign widgets to specific Desktops. Whether Apple will provide this feature is unknown.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d337f002ec42b1acb6f749ea26988f911fd35252f6659462e52a1ae8305e2732","category":"Apple"}