{"title":"Mark Zuckerberg on Vision Pro","link":"https://www.instagram.com/reel/C3TkhmivNzt","date":1707937257000,"content":"\n<p>I really found this interesting for a few reasons. First, it’s just incredibly down-to-earth. Most of the video was shot in a single take, using a Quest 3. Just very casual — but it’s the CEO of a $1 trillion company reviewing and critiquing the rival product from a $3 trillion company. I can’t imagine Tim Cook (or Sundar Pichai) making a video like this. It would just be so out of character for Cook and for Apple itself. But this felt very natural coming from Zuckerberg. Apple is clearly better at making computers, but Meta is just as clearly better at social media. And I really would love to hear Tim Cook’s thoughts on the Quest 3 and how it compares to Vision Pro.</p>\n\n<p>Zuck makes the case that Quest 3 isn’t just good for its price — he goes all-in and argues that it’s a better headset, period. Whether you agree with him or not, he does a good job delineating the very different trade-offs Meta and Apple chose to make.</p>\n\n<p>At the end, he makes the case that each new generation of computing devices has an open alternative and a closed one from Apple. (It’s interesting to think that these rivalries might be best thought of not as closed-vs.-open, but as Apple-vs.-the-rest-of-the-industry.) I’m not quite sure where he’s going with that, though, because I don’t really see how my Quest 3 is any more “open” than my Vision Pro. Are they going to license the OS to other headset makers?</p>\n\n<p>Lastly, Zuckerberg, discussing Apple’s decision to use hand-tracking for control of the interface, just casually mentions that hand-tracking is effectively a stop-gap until we get a “neural interface”.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/02/14/zuckerberg-vision-pro\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d339ecd8268139e01883e74dbb029227a4a3f789475b5ebc19395f8ce6553c57","category":"Tech"}