{"title":"Webex App Now Available for Apple Vision Pro","link":"https://www.macrumors.com/2024/02/06/webex-vision-pro/","date":1707255150000,"content":"Cisco today <a href=\"https://blog.webex.com/hybrid-work/immersive-meetings-with-webex-on-apple-vision-pro/\">announced the launch</a> of a Webex video conferencing app designed for the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>. The app is designed to provide an immersive meeting experience that fills the space around the user.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/webex-vision-pro.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe Webex app supports Personas, allowing Vision Pro wearers to have a visual representation of themselves in video calls while wearing the headset, and it also works with spatial audio.\r<br />\n\r<br />\n<div></div>\r<br />\n<blockquote>Webex for Apple Vision Pro takes full advantage of the powerful capabilities built natively into visionOS. After joining a Webex meeting, you can arrange individual participant videos and a separate shared content window that scale to life-size with intuitive pinch and drag gestures. You can use the infinite canvas of Apple Vision Pro to resize and re-arrange these windows, enabling you to collaborate without being bound by a fixed screen. Your persona is a dynamic, natural representation of your face and hand movements that allows others to see you in Webex while you're wearing Apple Vision Pro. With these flexible layouts, multitasking has never been better.</blockquote>\r<br />\nWebex features such as AI background noise removal, real-time translations, closed captions, and live polling are integrated into the app. Meetings can be transferred between the Vision Pro and the Mac or the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> by opening up the Webex app and tapping the join button.\r<br />\n\r<br />\nWebex can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> on ‌Apple Vision Pro‌.<br />This article, \"<a href=\"https://www.macrumors.com/2024/02/06/webex-vision-pro/\">Webex App Now Available for Apple Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/webex-app-now-available-for-apple-vision-pro.2418699/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d33a7aa3702b6c1fb813aa519e9f401ab0118e00ffbfa462eab31a10a078a2fa","category":"Apple"}