{"title":"Exploring the flavor changes in mung bean flour through lactobacillus fermentation: insights from volatile compounds and non‐targeted metabolomics analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13545?af=R","date":1713283417000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Mung beans are abundant in nutrition, but their leguminous flavor limits their development. Lactic Acid Bacteria (LAB) fermentation can decrease unwanted bean flavors in legumes and enhance their flavor. This study examined the influence of Lactobacillus fermentation on the flavor characteristics of mung bean flour (MBF) using volatile compounds and non-targeted metabolomics.</p>\n<h2>Results</h2>\n<p><i>Lactobacillus plantarum</i> LP90, <i>Lactobacillus casei</i> LC89, and <i>Lactobacillus acidophilus</i> LA85 eliminated 61.37%, 48.29%, and 43.73% of the primary bean odor aldehydes from MBF. The results of relative odor activity values (ROAV) showed that fermented mung bean flour (FMBF) included volatile chemicals that contributed to fruity, flowery, and milky aromas. These compounds included ethyl acetate, hexyl formate, 3-hydroxy-2-butanone, and 2,3-butanedione. The levels of amino acids with a fresh sweet flavor increased significantly by 93.89%, 49.40%, and 35.27% in LP90, LC89, and LA85, respectively. A total of 49 up-regulated and 13 down-regulated significantly differential metabolites were annotated, and 10 metabolic pathways were screened for contributing to the flavor. The correlation between important volatile compounds and non-volatile substances relies on two primary metabolic pathways: the citric acid cycle pathway and the amino acid metabolic system.</p>\n<h2>Conclusion</h2>\n<p>The flavor of MBF was greatly enhanced by the process of Lactobacillus fermentation, with LP90 having the most notable impact. These results serve as a reference for identifying the flavor of FMBF.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Yuqi Xue, \nJie Chen, \nLei Wang, \nYuwen Wang, \nFei Xu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d33f1161bfaac14e4ec9344101d5793c0ac9e793f0412338223c02bc904d8bb1","category":"Environment"}