{"title":"Marble processing effluent treatment sludge in waste poly(ethylene terephthalate) pyrolysis as catalyst–II: recovery from pyrolytic fluids","link":"http://link.springer.com/10.1007/s13762-023-05388-5","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>In this study, feedstock and energy recovery potential from fluid fraction of catalytic pyrolysis of poly(ethylene terephthalate) plastic waste in the presence of marble processing effluent physico-chemical sludge catalyst were investigated. The contribution of the study is both symbiotic disposal of two kinds of wastes and produced valuable products. The pyrolysis fluid products obtained at 300–700 °C and 10–50% catalyst dose were inquired via chemical, thermogravimetric and chromatographic means. Main recoverable compounds were in the benzene group, followed by the esters, alcohols and ketones. The variety of organic components in pyrolytic gas was detected in aliphatic compounds (alkanes and alkenes) followed by the oxygenated organics and aromatic compounds. Benzoic acid, Methanone diphenyl(benzophenone), 1,1biphenyl, 9H Fluorene, Octane, Methyl benzene, some Benzene and Heptene derivatives were the components that are easily recoverable from the pyrolytic fluids. All these recoverable components are economically important feedstocks utilized in industrial processes. Optimization of recovery and enrichment methods of these compounds is recommended for further study. More thermally stable products formed and the higher final thermal residue of pyrolytic oil and oligomer products were obtained at higher pyrolysis temperatures. Their T<sub>5</sub>, T<sub>10</sub> and T<sub>50</sub> values varied between 36–44, 44–54, and 72–84 °C, respectively, while they were 131–154, 141–160 and 217–313 °C for oligomers. Calorific values of the produced oligomers were in the range of 5541–6984 cal/g. This study indicated that the thermochemical degradation of poly(ethylene terephthalate) with marble sludge catalyst is important approach for material and energy recovery in terms of fluid products of the process.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"d341673af67769685a674dc5cd54da3987a297ed2505dbe7789dd7798bdf8e0a","category":"Environment"}