{"title":"Reappraising Natures and Perspectives of Wasteland in Developing World with a Focus on India","link":"https://www.preprints.org/manuscript/202403.1130/v1","date":1710847264000,"content":"This article seeks to provide an improved and more comprehensive understanding of the concept and theories on wasteland. It achieves this by focusing on the Indian context allowing us to unpack the importance of including multiple perspectives of wasteland narratives; this means including more positive narratives of the potential of wasteland to inform and improve prospects for land policies in the global south. Wasteland is commonly recognized as an underutilized category of land that may transform into a valuable resource base with proper management measures. The term waste has multiple angles that carry different notions ranging from fallow to agroforestry land in the global south and Brownfield to green space in the global north. We conduct a narra-tive review approach to qualitatively analyze the concept wastelands studied in pre-existing lit-erature from 1970 to present. The unsystematic literature review approach incorporates multiple elements of wasteland discourse, like understanding the meaning of the term on a global scale, setting out the meaning of the term waste into multiple perspectives explicitly in the Indian con-text, along with different classes and management approaches of wasteland from a national per-spective. The multiple perspectives of wasteland not only generate misconception on land resource but spawn difficulties in land use policy particularly for Indian scenario. For sustainable land use policy, reclaiming wasteland would be the best possible way for India and other countries in Global South, which requires a comprehensive methodological overview on wasteland narrative.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d352187045106092e0ef0d89fba45e9337c9ba2a4ca9c21e143c3cd2814c8a60","category":"Interdisciplinary"}