{"title":"Prediction of carbon emissions from public buildings in China’s Coastal Provinces under different scenarios ——A case study of Fujian Province","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307201","date":1721743200000,"content":"<p>by Yanyan Ke, Rui Fan, Yan Yang, Pingying Wang, Jiarui Qi</p>\r\n\r\nWith the rapid pace of industrialization and the increasing intensity of human activities, the global climate change and energy crisis have reached a heightened level of severity. Consequently, achieving an early peak in carbon emissions has become an imperative in addressing this pressing issue. Particularly, coastal provinces, known for their developed economies, high population density, and substantial building energy consumption, have emerged as significant contributors to carbon emissions. Notably, public buildings, serving as critical constituents of the construction industry, possess immense potential for both energy conservation and emissions reduction. In light of this, the present study focuses on Fujian Province, situated along the coast, and constructs a carbon emission estimation model for public buildings based on the Kaya identity. This model takes into account various factors specific to Fujian Province, including population characteristics, economic conditions, tertiary industry development, public building area, and energy consumption. Through scenario analysis, the study projects that the year of peak carbon emissions for public buildings in Fujian Province is estimated to be 2030, 2035, and 2040 under low-carbon, baseline, and high-carbon scenarios respectively. The corresponding peak carbon emission levels are anticipated to reach 23.62 million t, 24.18 million t, and 24.76 million t CO<sub>2</sub>. Lastly, based on local policies and actual conditions, the study proposes a set of policy measures and feasible approaches tailored to Fujian Province, aiming to achieve an early peak in carbon emissions.","author":"Yanyan Ke","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d3590686cac3e5fb06a504368fd191ff11b4f235676989089bf1d23bbbdaf1ae","category":"Interdisciplinary"}