{"title":"The impact of prenatal mental health on birth outcomes before and during the COVID-19 pandemic in Anhui, China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308327","date":1722952800000,"content":"<p>by Tianqi Zhao, Gian S. Jhangri, Keith S. Dobson, Jessica Yijia Li, Shahirose S. Premji, Fangbiao Tao, Beibei Zhu, Shelby S. Yamamoto</p>\r\n\r\nAdverse birth outcomes remain challenging public health problems in China. Increasing evidence indicated that prenatal depression and anxiety are associated with adverse birth outcomes, highlighting the importance and severity of prenatal depression and anxiety in China. The COVID-19 pandemic is likely to further exacerbate prenatal mental health problems and increase the risk of adverse birth outcomes. The aim of this study is to assess and compare the impacts of prenatal mental health issues on birth outcomes before and during the COVID-19 pandemic in Ma’anshan, Anhui, China. Participants in this study were women who visited local maternal and child health hospitals in Ma’anshan, Anhui, China. Two independent sets of individual maternal data (n<sub>pre-pamdemic</sub> = 1148; n<sub>pandemic</sub> = 2249) were collected. Prenatal depression and anxiety were measured online using the Edinburgh Postnatal Depression Scale (EPDS) and the General Anxiety Disorder-7 (GAD-7). Adverse birth outcomes were determined using hospital-recorded infant birth weight and gestational age at delivery. In this study, we found that the pandemic cohort had lower mean EPDS and GAD-7 scores than the pre-pandemic cohort. The prevalence of prenatal depression (14.5%) and anxiety (26.7%) among the pandemic cohort were lower than the pre-pandemic cohort (18.6% and 36.3%). No significant difference was found in the prevalence of adverse birth outcomes comparing the two cohorts. Prenatal depression was associated with small gestational age only in the pandemic cohort (OR = 1.09, 95% CI 1.00–1.19, p = 0.042). Overall, this study highlighted an association between prenatal depression and small for gestational age in Anhui, China. Addressing prenatal depression may thus be key in improving birth outcomes. Future studies could focus on potential causal relationships.","author":"Tianqi Zhao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d377aecb33479a0cfba2977de7c3ea8a5457dc1ea8e1378a441992de5f946808","category":"Interdisciplinary"}