{"title":"Some Users Reporting Excessive Battery Drain Following iOS 14.6 Update","link":"https://www.macrumors.com/2021/06/01/ios-14-6-users-reporting-battery-drain/","date":1622551832000,"content":"Following the release of iOS and iPadOS 14.6 last week, some users have taken to social media and online forums to note that their devices have been experiencing excessive battery drain since installing the software updates.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/14.6-on-iPhone-12-feature.jpg\" />\r\n<br />\r\nThe <a href=\"https://discussions.apple.com/search?q=ios%2014.6%20battery&amp;page=1&amp;content=filterDiscussions\">Apple Support Community</a> and MacRumors forums are <a href=\"https://forums.macrumors.com/search/2739140/?q=iOS+14.6+battery\">riddled with posts</a> from users stating their device now drains faster following the update. One user on the Apple support forums notes their experience with their iPhone 11 Pro and Apple Smart Cover draining faster than normal following the update: \r\n<br />\r\n<blockquote>iPhone 11Pro did the same after update. I have had an Apple Smart Cover on it since day 2 of being new. Never had to remove it. Today, after yesterday’s update, it wiped out my phone to 2% and ran my cover down to 15%. Normally the phone stays at 100% and the cover might get as low as 20% after a 15 hour day with no plugging in. Battery health has maintained 100% for over a year. Must be part of the health recalibration. The Smart Cover battery icon is no longer on the lock or Home Screen when plugging or unplugging it. </blockquote>It is worth noting that many factors contribute to a device's battery life, including its battery health. Users with degraded batteries can expect shorter battery life. According to the forums, however, the issue seems to be impacting all devices, regardless of specific battery health.\r\n<br />\r\n\r\n<br />\r\nOn the MacRumors forums, <a href=\"https://forums.macrumors.com/threads/battery-issues-on-ios-14-6-iphone-11-pro.2297859/post-29942015\">one user notes</a> that their iPhone 12 Pro not only drained faster than normal but also began to overheat while simply browsing Safari. An accompanying post recalls a similar experience with an iPhone 12 mini:\r\n<br />\r\n<blockquote>Yes I updated my 12 mini from 14.2 to 14.6 a couple days ago, and in the proceeding last 2 mornings when I woke up i used my phone for a few minutes looking at messages and checking Macrumours, and battery dropped suddenly with the back of phone warming up just like others have reported. School boy mistake on my part, I always check reports of battery drains before updating IOS versions, but didnt this time</blockquote>With iOS 14.5, Apple <a href=\"https://www.macrumors.com/2021/03/31/ios-14-5-iphone-11-battery-recalibration/\">introduced a new battery health recalibration</a> feature for iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max. The new feature allows the system to recalibrate the battery health of the device in order to address possibly inaccurate battery health readings. Following the update released last month, <a href=\"https://www.macrumors.com/2021/04/16/iphone-11-battery-recalibration-results/\">users have noticed</a> that their iPhone 11 battery health has changed following the recalibration process.\r\n<br />\r\n\r\n<br />\r\nAfter any iOS update, users can expect normal battery drain in the days following due to the system reindexing Spotlight and conducting other housekeeping tasks. However, iOS 14.6 was released more than a week ago, and users continue to note the battery drain on their devices. If the issue is indeed software related, Apple may decide to address it in a subsequent update to iOS 14.6 or provide a patch in iOS 14.7, currently in beta testing.<div>Tag: <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/01/ios-14-6-users-reporting-battery-drain/\">Some Users Reporting Excessive Battery Drain Following iOS 14.6 Update</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/some-users-reporting-excessive-battery-drain-following-ios-14-6-update.2298742/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GhjmdpzqiF8:mXe1oNcjTak:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GhjmdpzqiF8:mXe1oNcjTak:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/GhjmdpzqiF8\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d37ee228bbbf2005914b788ce94de1967df4e7fecae62bfaa4c4ea0a2ca649b9","category":"Apple"}