{"title":"Cathodoluminescence Analysis of Charge Carrier Recombination in Photovoltaic Absorber Materials","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.011/7719437?rss=1","date":1721779200000,"content":"<span>After generation via light excitation, photovoltaic (PV) devices rely on transport of excess charge carriers (electron/holes) to create a photovoltage that can generate a current in an external circuit. Optimizing performance of PV devices necessitates an intimate understanding of features in PV absorber materials than can inhibit excess charge carriers from reaching the contact of the appropriate polarity to mitigate their effects through processing modifications. There are several common offenders that can reduce charge carrier collection, namely, 1) extended defects (grain boundaries, dislocations, anti-phase boundaries, etc.), 2) heterointerfaces (p-n junctions, precipitates), and point defects. Such features reduce charge carrier collection by enhancing recombination via sub-bandgap energy levels resulting from modifications to the optoelectronic properties of the bulk semiconductor. Recombination can occur non-radiatively through deep levels and generate heat in the semiconductor as well as radiatively through energy levels closer to the conduction or valence band edges. In the latter case photons are emitted and understanding the spatial distribution, relative intensity, and spectral character of these photons can provide valuable information about the quality of PV absorber materials and potential performance limitations. In this contribution we exploit cathodoluminescence (CL) imaging and spectroscopy, a powerful SEM-based technique with sub-micron spatial resolution, to study various PV absorber materials and also demonstrate how combining CL with other complimentary characterization techniques can yield greater understanding of factors limiting PV device performance.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"d3847e328ed8efa7e18be74f280aa824c9e3797ae0c1af2c1189f5305902e5f0","category":"Environment"}