{"title":"Antibacterial activities of Miang extracts against selected pathogens and the potential of the tannin-free extracts in the growth inhibition of <i>Streptococcus mutans</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302717","date":1715176800000,"content":"<p>by Aliyu Dantani Abdullahi, Kridsada Unban, Chalermpong Saenjum, Pratthana Kodchasee, Napapan Kangwan, Hathairat Thananchai, Kalidas Shetty, Chartchai Khanongnuch</p>\r\n\r\nBacterial pathogens have remained a major public health concern for several decades. This study investigated the antibacterial activities of Miang extracts (at non-neutral and neutral pH) against <i>Bacillus cereus</i> TISTR 747, <i>Escherichia coli</i> ATCC 22595, <i>Salmonella enterica</i> serovar Typhimurium TISTR 292 and <i>Streptococcus mutans</i> DMST 18777. The potential of Polyvinylpolypyrrolidone (PVPP)-precipitated tannin-free Miang extracts in growth-inhibition of the cariogenic <i>Streptococcus mutans</i> DMST 18777 and its biofilms was also evaluated. The tannin-rich fermented extracts had the best bacterial growth inhibition against <i>S</i>. <i>mutans</i> DMST 18777 with an MIC of 0.29 and 0.72 mg/mL for nonfilamentous fungi (NFP) Miang and filamentous-fungi-processed (FFP) Miang respectively. This observed anti-streptococcal activity still remained after PVPP-mediated precipitation of bioactive tannins especially, in NFP and FFP Miang. Characterization of the PVPP-treated extracts using High performance liquid chromatography quadrupole-time of flight-mass spectrometry (HPLC-QToF-MS) analysis, also offered an insight into probable compound classes responsible for the activities. In addition, Crystal violet-staining also showed better IC<sub>50</sub> values for NFP Miang (4.30 ± 0.66 mg/mL) and FFP Miang (12.73 ± 0.11 mg/mL) against S. <i>mutans</i> DMST 18777 biofilms <i>in vitro</i>. Homology modeling and molecular docking analysis using HPLC-MS identified ligands in tannin-free Miang supernatants, was performed against modelled <i>S</i>. <i>mutans</i> DMST 18777 sortase A enzyme. The <i>in silico</i> analysis suggested that the inhibition by NFP and FFP Miang might be attributed to the presence of ellagic acid, flavonoid aglycones, and glycosides. Thus, these Miang extracts could be optimized and explored as natural active pharmaceutical ingredients (NAPIs) for applications in oral hygienic products.","author":"Aliyu Dantani Abdullahi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d38575051d5c3c5938217ed01375077fdf0c366e2600e5b1fb7790ba58913533","category":"Interdisciplinary"}