{"title":"A new, global optical sediment trap calibration","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10592?af=R","date":1708082732000,"content":"<h2>Abstract</h2>\n<p>Autonomous sensors for gravitational carbon flux in the ocean are critically needed, because of uncertainties in the projected response of the biological carbon pump (BCP) to climate change, and the proposed, engineered acceleration of the BCP to sequester carbon dioxide in the ocean. Optical sediment trap (OST) sensors directly sense fluxes of sinking particles in a manner that is independent of, and complementary to, other autonomous, sensor-derived estimates of BCP fluxes. However, limited intercalibrations of OSTs with traditional sediment traps and uncharacterized, potential biases have limited their broad adoption. A global field data set spanning three orders of magnitude in carbon flux was compiled and used to develop empirical models predicting particulate organic carbon flux from OST observations, and intercalibrating different sensor designs. These data provided valuable constraints on the uncertainty in the predicted carbon flux and showed a quantitative, theoretically consistent relationship between observations from OSTs with collimated and diffuse optical geometries. While not designed for this purpose, commercial beam transmissometers have been used as OSTs, so two models were developed quantifying the biases arising from the transmissometer's housing geometry and optical beam diameter. Finally, an algorithm for the quality control of beam transmissometer-derived OST data was optimized using sensitivity tests. The results of this study support the expansion of OST-based gravitational carbon flux measurements and provide a framework for interpretation of OST measurements alongside other gravitational particle flux observations. These findings also suggest key features that should be included in designs of future, purpose-built OST sensors.</p>","author":"Margaret L. Estapa, \nColleen Andrea Durkin, \nWayne H. Slade, \nChristine L. Huffard, \nSean P. O'Neill, \nMelissa M. Omand","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"d385f8cb429d152a7148e6e157a400344091af8a89e664dea2414567ce2b0beb","category":"Environment"}