{"title":"The iPhone 13 and 14 are getting faster wireless charging with iOS 17.2","link":"https://www.macworld.com/article/2164050/ios-17-2-qi2-charger-support-iphone-13-14.html","date":1701874878000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When <a href=\"https://www.macworld.com/article/2117707/ios-17-2-beta-is-out-now-and-includes-the-journal-app.html\">iOS 17.2 arrives next week</a>, it’ll bring a new Journal app, some new Weather features, and Contact Key Verification for Messages. And if you own an iPhone 13 or 14, it’ll also bring support for Qi2 wireless charging, which might be the best feature of all.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2128673/what-is-qi2-is-qi2-iphone-wireless-charging-better-than-magsafe.html\">Qi2</a> is basically MagSafe for everyone, opening up magnetic charging to the rest of the world. Of course, the iPhone 13 and 14 already have MagSafe, but under the Qi1 standard, non-MagSafe-certified chargers only deliver 7.5W of power when connected. With Qi2 support, you’ll get 15W charging even when using <a href=\"https://www.macworld.com/article/230820/the-best-wireless-chargers-for-your-iphone.html\">chargers</a> from Anker, Belkin, and others.</p>\n\n\n\n<p>Of course, your old MagSafe-compatible chargers won’t magically deliver 15W charging now that your iPhone supports Qi2. You’ll need a new Qi2 charger to get the higher speeds, and these should begin arriving soon at prices far less than Apple charges. Apple launched the iPhone 15 in September with Qi2 support, but opening it up to hundreds of millions of older iPhones will surely get the ball rolling faster.</p>\n\n\n\n<p>After the release candidate arrived Tuesday, iOS 17.2 will likely be released on Monday or Tuesday of next week. </p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d3868cab00bebc6bebe235908067782e290178c81a1e48e9f96d43752f4c3bf3","category":"Apple"}