{"title":"Factors associated with under-five mortality in Rwanda: An analysis of the Rwanda Demographic and Health Survey 2020","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003358","date":1718719200000,"content":"<p>by Mgole Eliud Mkama, Mark Momoh Koroma, Xiaofen Cheng, Jindan Zhang, Duo Chen, Lushi Kong, Bei Li</p>\r\n\r\nDespite global and Rwandan progress in reducing under-five mortality, the risk of children dying before their fifth birthday persists, necessitating intensified research on determinants. Thus, this study analyzed the birth history data to shed light on the underlying causes of under-five mortality in Rwanda. The study is a secondary analysis of data sourced from the 2020 Rwanda Demographic and Health Survey (RDHS) cross-sectional design. Using SPSS, the data was cleaned, recoded, and weighted, with descriptive and inferential statistics applied. The dependent variable was the child’s living status, while independent variables included socio-demographic, media exposure status of mothers, child, and environmental factors. A total of 10267 under-five children of all interviewed mothers were included in the final analysis, of which 12.3% (1260) died. Maternal age (25–34 years: AOR = 1.514, 95% CI = 1.130–2.029, p = 0.005; 45+: AOR = 13.226, 95% CI = 9.253–18.905, p&lt;0.001), occupational status (agricultural workers and other services), and three or more births within five years (AOR = 1.895, 95% CI = 1.433–2.508, p&lt;0.001) significantly increase the risk of under-five mortality. Conversely, maternal education (primary: AOR = 0.821, p = 0.023; secondary: AOR = 0.533, p&lt;0.001; higher: AOR = 0.365, p = 0.010) and higher wealth indexes (middle: AOR = 0.743, p = 0.001; rich: AOR = 0.612, p&lt;0.001), as well as current breastfeeding (AOR = 0.524, 95% CI = 0.455–0.603, p-value &lt;0.001), are associated with lower under-five mortality. Child sex significantly impacts under-five mortality (AOR = 0.873, 95% CI = 0.770–0.991, p = 0.035), favoring females over males. Conversely, multiple birth type children face higher under-five mortality (AOR = 3.541, 95% CI = 2.727–4.599, p&lt;0.001) compared to singletons. Children in the northern (AOR = 1.478, 95% CI = 1.086–2.011, p = 0.013) and eastern (AOR = 1.470, 95% CI = 1.097–1.971, p = 0.010) regions are more susceptible to mortality compared to those in the central (Kigali) region. Additionally, under-five mortality is higher when using water from tanks and other sources (AOR = 2.240, 95% CI = 1.471–3.411, p&lt;0.001) than piped water. This study identifies crucial factors linked to under-five mortality, underscoring the importance of prioritizing them in interventions to enhance Rwandan under-five survival rates.","author":"Mgole Eliud Mkama","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d38d2f4645b9f6102c16f88967b2e2fa8d842e02690c9e99246eacffcfad7fc5","category":"Environment"}