{"title":"Apple Seeds Eighth Beta of macOS Big Sur 11.3 to Developers","link":"https://www.macrumors.com/2021/04/13/apple-seeds-macos-big-sur-11-3-beta-8/","date":1618333729000,"content":"Apple today seeded the eighth beta of an upcoming <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a> 11.3 update to developers for testing purposes, with the new beta coming one week after the launch of <a href=\"https://www.macrumors.com/2021/04/08/macos-big-sur-11-3-beta-7/\">the seventh beta</a> and more than two months after the <a href=\"https://www.macrumors.com/2021/02/01/apple-releases-macos-big-sur-11-2/\">release of macOS Big Sur 11.2</a>, a bug fix update.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/macOS-Big-Sur-Feature-Blue.jpg\" />\r\n<br />\r\nDevelopers can download the ‌‌‌macOS Big Sur‌‌‌ 11.3 beta using the Software Update mechanism in System Preferences after installing the proper profile from the Apple Developer Center.\r\n<br />\r\n\r\n<br />\r\n‌macOS Big Sur‌ 11.3 introduces more customization options for Safari, adding a way to rearrange the different sections on the Start Page like Favorites, Reading List, <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> Suggestions, Privacy Report, and more. Developers also have access to a new integration to develop features for the Start Page.\r\n<br />\r\n\r\n<br />\r\nThe update includes optimizations for using iOS apps on <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Macs. When running <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> apps on ‌M1‌ Macs, there's a Touch Alternatives preference pane that allows users to set keyboard commands for touch input alternatives, plus iPadOS apps launch with a larger window if the Mac's display allows it. Touch Alternatives can be enabled for ‌iPhone‌ or ‌iPad‌ apps by clicking on the app's name in the menu bar and then selecting the Preferences option. Touch Alternatives let you customize taps, swipes, and drags.\r\n<br />\r\n\r\n<br />\r\nApple has added a \"Controller Emulation\" feature <a href=\"https://www.macrumors.com/2021/03/22/macos-big-sur-11-3-controller-emulation-m1/\">that can be enabled </a>for ‌iPhone‌ and ‌iPad‌ apps to map game controller buttons to keyboard keys and mouse buttons. Controller Emulation will allow ‌‌iPhone‌‌ and ‌‌iPad‌‌ games that have controller support built in to be accurately controlled with a keyboard and/or mouse when those games are played on an ‌‌M1‌‌ Mac.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/game-control-emulation.png\" />\r\n<br />\r\nIn the Reminders app, reminder lists can be sorted by Due Date, Creation Date, Priority, or Title, and there is an option to print lists by going to File &gt; Print. Reminders can also be moved manually across lists with drag and drop, something that wasn't possible before.\r\n<br />\r\n\r\n<br />\r\nApple is adding a new \"Made For You\" library shortcut in <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> for finding personal mixes and Replay playlists, and the Listen Now section has been updated with support for highlighting live events.\r\n<br />\r\n\r\n<br />\r\nThe ‌Apple Music‌ app includes a new autoplay option that allows the streaming service to continue to play music after a playlist or music queue ends. ‌Apple Music‌ sources music similar to what's in a person's ‌Apple Music‌ library, similar to the autoplay feature added in <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/macos-big-sur-apple-music-autoplay.jpg\" />\r\n<br />\r\nWith this feature enabled, ‌Apple Music‌ audio will not end even after a playlist or album is over. To check that it's on, play a playlist or album and then click on the three dot/line menu button in the upper right hand corner. From there, make sure the infinity symbol is toggled on.\r\n<br />\r\n\r\n<br />\r\nIn the <a href=\"https://www.macrumors.com/guide/apple-news-plus/\">Apple News</a> app, there's a redesigned ‌Apple News‌+ tab with a dedicated \"For You\" section and a new Browse tab that makes it easier to browse through available content. The new For You section is designed to help ‌Apple News‌+ users find favorite magazines and newspapers much faster, plus it adds new tools for managing downloaded issues.\r\n<br />\r\n\r\n<br />\r\n‌macOS Big Sur‌ 11.3 adds support for the latest PlayStation 5 DualSense and Xbox Series X/S controllers for use with macOS games, and there's an updated \"Support\" interface when accessing \"About This Mac.\" The new design includes details on your warranty and it allows for starting a repair right from the Mac interface.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/macos-big-sur-beta-support.jpg\" />\r\n<br />\r\nThe tab works similarly to the <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a> coverage menu in the iOS Settings app, which lets users request repairs, buy an ‌AppleCare‌ plan, and check their coverage.\r\n<br />\r\n\r\n<br />\r\nFor <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> users, ‌macOS Big Sur‌ 11.3 <a href=\"https://www.macrumors.com/2021/02/03/macos-11-3-homepod-stereo-pairs/\">brings support</a> for ‌HomePod‌ Stereo pairs, allowing a set of paired HomePods to be set as the default sound output option, with the two HomePods showing up as a single selectable speaker rather than separate as in prior versions of macOS.\r\n<br />\r\n\r\n<br />\r\nCode in ‌macOS Big Sur‌ 11.3 suggests that the Optimized Battery Charging feature <a href=\"https://www.macrumors.com/2021/02/18/macos-11-3-optimized-battery-charging-meetings/\">will now make sure</a> the Mac's battery is fully charged before a scheduled calendar event. The Mac will charge to 100 percent three hours before a calendar event's start time.\r\n<br />\r\n\r\n<br />\r\nOptimized Battery Charging is designed to preserve the lifespan of the Mac's battery by limiting the amount of time that a Mac sits at 100 percent battery.\r\n<br />\r\n\r\n<br />\r\nIn Safari, there's support for <a href=\"https://www.macrumors.com/2021/02/18/safari-to-support-webm-after-11-years/\">WebM video playback</a>, allowing users to play WebM videos using Apple's browser. WebM is a niche video format designed to be a royalty-free alternative to the H.264 codec used in the MP4 format. WebM allows video files to remain small without sacrificing quality and can be played with little processing power, making it ideal for webpages and browsers.\r\n<br />\r\n\r\n<br />\r\nThere are also appear to be new assets that suggest a feature for mapping game controller buttons to keyboard layouts, and there's a Game Center toggle to enable or disable connections with friends, which lets games set you up with your friends or prevents apps from accessing that info.\r\n<br />\r\n\r\n<br />\r\nMore on ‌macOS Big Sur‌ can be found in <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">our macOS Big Sur roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/13/apple-seeds-macos-big-sur-11-3-beta-8/\">Apple Seeds Eighth Beta of macOS Big Sur 11.3 to Developers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-seeds-eighth-beta-of-macos-big-sur-11-3-to-developers.2291564/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=YvCMuuv2fYE:ckSK0zz6g6Y:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=YvCMuuv2fYE:ckSK0zz6g6Y:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/YvCMuuv2fYE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d3919352cd556e2b37b3f94ec53360c101410ee0a9c8b547d91f73c37a71009c","category":"Apple"}