{"title":"CES 2024: Rabbit r1 AI Assistant Wants to Do Tasks for You","link":"https://www.macrumors.com/2024/01/09/ces-2024-rabbit-r1/","date":1704837881000,"content":"AI startup Rabbit today announced the launch of <a href=\"https://www.rabbit.tech\">the Rabbit r1</a>, a mobile device that's designed to simplify the experience of using a smartphone. The r1 runs rabbit OS, an operating system powered by a Large Action Model (LAM).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/rabbit-r1.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe Large Action Model is able to learn how humans use computers, or more specifically, how r1 users take advantage of apps. Rabbit says that the r1 can understand complex user intentions, operate user interfaces, and perform actions on behalf of the user. The OS was trained on data from people interacting with apps, allowing the r1 to do tasks like ordering pizza, booking ride services, playing music, communicating with people, and more, through voice commands.\r<br />\n\r<br />\n<div><blockquote><p>Introducing r1. Watch the keynote. <br /><br />Order now: <a href=\"https://t.co/R3sOtVWoJ5\">https://t.co/R3sOtVWoJ5</a> <a href=\"https://twitter.com/hashtag/CES2024?src=hash&amp;ref_src=twsrc%5Etfw\">#CES2024</a> <a href=\"https://t.co/niUmjFvKvE\">pic.twitter.com/niUmjFvKvE</a></p>— rabbit inc. (@rabbit_hmi) <a href=\"https://twitter.com/rabbit_hmi/status/1744781083831574824?ref_src=twsrc%5Etfw\">January 9, 2024</a></blockquote> </div>\r<br />\nThe Rabbit r1 can be interacted with using a push-to-talk button on the side, and it understands natural language requests. There are no apps on the r1, and tasks are performed over the internet.\r<br />\n\r<br />\nDesigned in partnership with Teenage Engineering, the r1 has a 2.88-inch touch screen, a camera that rotates for capturing photos and videos and taking video calls, a scroll wheel for navigation purposes, and a USB-C port for charging. There is a 1,000mAh battery, and battery life depends on usage. While there is no subscription associated with the Rabbit r1, it does need a SIM card for cellular data.\r<br />\n\r<br />\nUsers can teach the r1 to perform tasks, including multi-step tasks such as researching a location, booking a hotel, securing restaurant recommendations, and finding activities. Once the r1 has learned a task, it can repeat the action independently. It supposedly can even interact with apps like Photoshop, performing multi-step actions within the software.\r<br />\n\r<br />\nThe Rabbit r1 needs to be provided with a user's logins for various services in order to complete tasks involving those services. \r<br />\n\r<br />\nThe Rabbit r1 can be <a href=\"https://www.rabbit.tech\">pre-ordered from the Rabbit website</a> for $200. It is expected to ship to customers in March or April of 2024<div>Tag: <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/ces-2024-rabbit-r1/\">CES 2024: Rabbit r1 AI Assistant Wants to Do Tasks for You</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ces-2024-rabbit-r1-ai-assistant-wants-to-do-tasks-for-you.2415922/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d39af4d75db49695c602dba263207de72ca9a19e24149e3a419a24ac90182f2d","category":"Apple"}