{"title":"Bike theft heat map shows local hotspots","link":"https://www.cyclist.co.uk/news/9466/bike-theft-heat-map-shows-local-hotspots","date":1617807907000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>7 Apr 2021</span></div>    </div></div><p>\nOnline tool developed by Bikmo pinpoints all 74,573 reported cases in the last 12 months, revealing the most and least affected areas</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/credit_bikmo_city_of_london.jpg?itok=rGhvpJkf\" />  </div>\n<div>\n      <p> A new bike theft heat map that shows the most and least affected areas in England and Wales has been unveiled.</p>\n<p>Cycling insurer Bikmo revealed the online tool at <a href=\"http://bike-theft-map.bikmo.com\" target=\"_blank\">bike-theft-map.bikmo.com</a>, which takes publicly available data from the police of all the 74,573 reported cases of bike theft from 2020 to pinpoint the most and least affected areas both locally and nationally.</p>\n<p>Alongside the map, Bikmo revealed the areas with the highest and lowest number of cases per 100,000 residents.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/04/credit_bikmo.jpg?itok=0c-0qIXH\" />  </div>\n</div>\n<p>Unsurprisingly, the worst area for bike theft was the City of London with a rate of 6,345 per 100,000 residents, followed by Cambridge with a rate of 1,531, Hackey with 943 – which also recorded the highest total number of thefts, 2,325 – followed by Tower Hamlets with a rate of 807 and Oxford with 725.</p>\n<p>While the total numbers show that thefts decreased by 11% in 2020 compared to the previous year including Cambridge recording a 554% drop – potentially resulting from a lack of students locking bikes up around the city, Hackney still saw a 46% increase.</p>\n<p>Meanwhile, the Greater Manchester areas take up four of the top five 'safest' areas followed by West Devon, which saw seven thefts per 100,000 residents.</p>\n<p>While population density makes the majority of these results easily explainable, Bikmo has also noted that Greater Manchester Police was found to have failed to report over 80,000 crimes last year, which potentially reveals how those areas seem 'safe'.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/reviews/7898/cervelo-aspero-review\">Cervélo Áspero review</a></div>      <div><a href=\"/sram/9405/sram-rival-etap-axs\">Sram Rival eTap AXS: bringing wireless electronic shifting to the masses</a></div>      <div><a href=\"/in-depth/7978/faster-always-faster-the-story-of-cervelo\">The history of Cervélo bikes</a></div>      <div><a href=\"/cannondalecomp\">Competition: Win a Cannondale SuperSix Evo Neo 2 e-bike</a></div>    </div></div><p>\nBikmo CEO David George said of the map, 'As more and more people begin to realise the many benefits of cycling during the pandemic, it is only natural that fears around bike theft will rise. We are proud to today unveil a brand new public tool, allowing riders across the country to view annual bike theft rates in their local area and identify hotspots where crimes are being reported.</p>\n<p>'The new tool will be regularly updated to provide an ongoing resource to members of the public. We hope this will be useful to the fast growing number of riders, and help increase awareness in high-risk areas.'</p>\n<p>While the map may help to find the best spot to park your bike – or good places for cyclists to live or ride – we'd still recommend getting <a href=\"/reviews/690/buyers-guide-choosing-the-best-bike-lock\">a good bike lock</a> and insurance.</p>\n<p>For more information on the tracker visit <a href=\"http://bike-theft-map.bikmo.com/\" target=\"_blank\">bikmo.com</a></p>\n<p><em>Images: Bikmo</em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/bikes\">Bikes</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d39b709f9fe125bd27e186a12b6c8f97a5ad189ae6134fa81cb41ce0056770b7","category":"Cycling"}