{"title":"In Vitro Neuroendocrine Differentiation of BPH-1 Cells under &beta;2 Adrenergic Receptor Stimulation","link":"https://www.preprints.org/manuscript/202409.0748/v1","date":1725973826000,"content":"Objectives: Epidemiologic and experimental animal studies have shown that stress can alter tumor growth and that adrenergic fibers from the sympathetic nervous system, acting through stromal β2-adrenergic receptors, promote tumor cell survival during the initial phases of cancer development. Recent epidemiological data suggest that beta blocker intake improves survival of prostate cancer patients. Methods: Signaling mediated by β-adrenergic receptors promotes neuroendocrine differentiation in prostate cancer cell line. Although neuroendocrine cells are a minor population in the epithelial compartment of normal prostate glands, the population of neuroendocrine-like cells that express markers such as SYN, Bcl-2, Dll-3, and AMACR correlates with cancer progression, androgen-independent state, and poor prognosis in prostate cancer patients. As recent studies show that an increase in neuroendocrine cell density occurs before development of benign prostatic hyperplasia (BPH), a non-lethal disease affecting the transition zone, in hypertensive rats, we investigated whether neuroendocrine differentiation is associated with BPH. Results: Our results showed that isobutyl-methyl-xanthine and forskolin leading to sustained activation of the cAMP/PKA pathway led to an increase in neuroendocrine differentiation markers in BPH-1 cell line. Similar results were observed by combining the β-adrenergic receptors agonist isoproterenol with forskolin. These treatments reduced BPH-1 cell proliferation rates by 40% and 60%, respectively. Effects on neuroendocrine markers expression and cell proliferation were fully reversed by the β2 blocker carvedilol. Conclusion: These data suggest that β-adrenergic receptors are linked to the development of neuroendocrine-like cells in BPH. As 20% of the prostate cancer tumors occur in this zone, this observation warrants further investigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d3a75203620acd1358d76394f9b87c19ac9fd60a9778b2dadeb0130a3db87ca2","category":"Interdisciplinary"}