{"title":"Throw out all those black boxes and say hello to the software-defined car","link":"https://arstechnica.com/?p=1943172","date":1685562716000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/A231365_large-800x533.jpg\" alt=\"An Audi Q6 e-tron prototype in the snow\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/A231365_large-scaled.jpg\">Enlarge</a> <span>/</span> The prototype of the Q6 e-tron is the first on the new Premium Platform Electric (PPE) technology architecture. (credit: Audi)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One of the auto industry trends I'm most excited about these days is the move to clean-sheet designs for car platforms and architectures. For decades, features have accumulated like cruft in new vehicles: a box here to control the antilock brakes, a module there to run the cruise control radar, and so on. Now engineers and designers are rationalizing the way they go about building new models, taking advantage of much more powerful hardware to consolidate all those discrete functions into a small number of domain controllers.</p>\n<p>The behavior of new cars is increasingly defined by software, too. This is merely the progression of a trend that began at the end of the 1970s with the introduction of the first electronic engine control units; today, code controls a car's engine and transmission (or its electric motors and battery pack), the steering, brakes, suspension, interior and exterior lighting, and more, depending on how new (and how expensive) it is. And those systems are being leveraged for convenience or safety features like adaptive cruise control, lane keeping, remote parking, and so on.</p>\n<p>Of course, this only works if that software is any good. \"There is absolutely no question that software has been treated like a stepchild—I always say the fifth wheel in the car. So like a necessity, but not something that has been managed with care,\" said Maria Anhalt, CEO of the automotive supplier Elektrobit, which develops digital systems and software for OEMs.</p></div><p><a href=\"https://arstechnica.com/?p=1943172#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1943172&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d3a877fdd628740179f76dd18fbdf21ae8bb11e6f90bff0f9af7be0d7088591c","category":"Tech"}