{"title":"Saffron-cowled Blackbirds’ reduced nest success in Argentina’s agricultural land highlights the importance of non-agricultural habitat for its conservation","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae006/7601956?rss=1","date":1707177600000,"content":"<span><div>Abstract</div>The Saffron-cowled Blackbird (<span>Xanthopsar flavus</span>) is a globally endangered icterid endemic to the southern South American grasslands. Temperate grasslands are among the most threatened ecosystems in South America due to their high rate of land use change. In northeastern Argentina, over the last century, the conversion of natural grasslands to livestock farming, croplands, and afforestation has resulted in significant losses of breeding habitat for the Saffron-cowled Blackbird. Consequently, it has suffered severe populational declines, and its remaining populations are fragmented. In order to understand the impact of agricultural systems on the Saffron-cowled Blackbird populations, we studied its breeding biology (clutch size, hatching success, nestling production, and fledgling success) and the main parameters that influence nest survival rate in five breeding habitat types. During the breeding seasons of 2015 to 2019, we located nests and monitored their fate. We found that the cumulative probability of nest survival over the entire nesting cycle (i.e. laying, incubation, and chick rearing) was 0.06, and was lower for nests situated in grazed land covers. Conversely, nest survival was greater in breeding sites without agricultural use, particularly in marshes. Predation was the main cause of nest failure (76%), followed by brood parasitism (10%), and trampling by cattle and agricultural machinery (6%). Brood parasitism rates were higher in grazed paddocks, contributing together with predation to the failure of nests in this habitat. Our findings indicate a negative impact of livestock ranching on Saffron-cowled Blackbird reproduction. Non-agriculture habitats, such as wetlands and flooded areas, are important as refuges for nesting. Thus, the creation of breeding refuges (non-productive sites) within agricultural matrices, in association with biodiversity-friendly agricultural practices, is crucial to ensure the Saffron-cowled Blackbird’s maintenance.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"d3abdf80135a7913a7f29cecd8bc5dd80888b333058cf97768a4931144defcbf","category":"Environment"}