{"title":"Structural Optimization of High-Pressure Polyimide Mixers Based on Neural Networks and Genetic Algorithms","link":"https://www.preprints.org/manuscript/202406.0769/v1","date":1718159951000,"content":"Currently, foam mixers are predominantly categorized into two types: low-pressure and high-pressure. Low-pressure mixers primarily use agitator rotation to mix materials. However, they face challenges such as difficulty in cleaning and complex structures. High-pressure mixers, widely adopted for their structural simplicity and lack of need for cleaning devices, effectively mitigate issues associated with low-pressure mixers. Nonetheless, they encounter problems with uneven mixing when processing high-viscosity materials. Historically, the primary solution to this issue was increasing the working pressure. However, the capacity to increase pressure is finite, and higher pressure demands higher quality materials for the mixers. To address the issues high-pressure mixers face when dealing with high-viscosity materials, this study focuses on the polyimide high-pressure mixer. After reviewing previous studies, four design variables were selected: the mixer's impingement angle, inlet diameter, outlet diameter, and impingement pressure. Using a Full Factorial Design of Experiments (DOE), the significance of the impact exerted by these four variables on Mixing Unevenness was analyzed, determining the extent of their influence. Optimal Latin Hypercube Sampling generated several random sample points, followed by the establishment of both a Back Propagation (BP) Neural Network approximation model and a Kriging approximation model. A Genetic Algorithm was then applied to optimize these two approximation models, resulting in the optimal combination of design variables. The research findings indicate that the BP Neural Network exhibits higher predictive accuracy compared to the Kriging prediction model. The optimal combination of parameters, optimized through the Genetic Algorithm (GA), reduced the Mixing Unevenness by 69.1%, effectively decreasing the Mixing Unevenness of the mixer head.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d3acedb10143e0c0eef043885b8ee8f609fd3995a2ecbae8d29e88df0a226073","category":"Interdisciplinary"}