{"title":"PSLBII-9 Further evaluation of monensin and protein supplementation on in situ degradability of low-quality forage fed to cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/652/7757744?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The effect of including monensin in a protein supplement fed to cattle consuming low-quality forage (LQF; 4.1% CP) was preliminarily evaluated by Solis et al. (2018). Previously, the effects of monensin and protein supplementation on in situ DM disappearance kinetics of low-quality forage (LQF; 4.1% CP) were reported. Continuing this work, samples were further evaluated to analyze fiber disappearance kinetics. The experiment was described in detail by Solis et al. (2018). Briefly, ruminally cannulated cows (n = 4) were used in a 4×4 Latin Square design with treatments arranged as a 2 × 2 factorial. Factors included: 1) monensin (0 or 200 mg∙cow<sup>-1</sup>∙d<sup>-1</sup>), and 2) protein supplement (0 or 0.64 kg∙cow<sup>-1</sup>∙d<sup>-1</sup> CP provided as cottonseed meal). A premix (0.23 kg∙cow<sup>-1</sup>∙d<sup>-1</sup> allowed for monensin inclusion. Animals were individually housed and fed at 0600h daily. An initial 14-d withdrawal period was used to avoid carryover effects from previous monensin feeding. A 10-d adaptation period was required for optimal monensin response. Thus, d 1 to 4 of each period, animals were provided LQF, d 5 to 14 were designated for treatment adaptation, and sampling occurred d 15 to 20. Samples of LQF were weighed into 10 × 20 cm polyester bags in replicates of six for each hour. On d 15, bags were inserted into the ventral area of the rumen, and replicates removed after 0, 4, 8, 16, 24, 48, 72, and 96 h of incubation. Upon removal, bags were placed in iced water, rinsed, and frozen until final bag removal. Bags were then washed in a commercial washing machine and dried at 55°C to a constant weight. Dried residues were then analyzed for neutral detergent fiber (NDF). In situ NDF degradation data were fitted to the first-order exponential model with a discrete lag using the iterative Marquardt method, NLIN procedure of SAS 9.4. Analysis of NDF was further investigated using GLIMMIX procedure of SAS 9.4. No interactions between protein and monensin were observed for any NDF disappearance parameter measured. There was no interaction (<span>P</span> ≥ 0.38) between protein and monensin for any NDF disappearance parameter measured. Protein reduced (<span>P</span> = 0.04) potentially degradable NDF (from 73.5% to 63.5%) likely due to the increased (<span>P</span> ≤ 0.01) rate of NDF degradation (from 0.02% to 0.04%/h). Monensin had no effect (Mem &gt; <span>P</span> ≥ 0.21) on potentially degradable NDF or rate of degradation. Protein supplementation reduced lag time (<span>P</span> = 0.03) from 9.37 to 4.84 h, while monensin had no effect (<span>P</span> = 0.37). Protein increased (<span>P</span> ≤ 0.01) residue from 32.9 to 41.5 while monensin supplementation had no effect (<span>P</span> = 0.22). Due to the protein induced increase in fiber degradation, it is likely that LQF consumption will increase, enhancing forage utilization in production operations. However, monensin inclusion did not provide added benefit to fiber degradation, suggesting that adding monensin to a protein supplement will not provide added improvement compared with protein alone.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d3b89e7de78e565cf3dbf15dec2692f9eb7a4841b88e3760c0df87b67bc810d2","category":"Environment"}