{"title":"Apple Employees Asked to Return to Offices for Three Days a Week Starting in September","link":"https://www.macrumors.com/2021/06/02/apple-employees-returning-to-work/","date":1622674696000,"content":"Apple corporate employees will be returning to the office for three days a week starting in early September, Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> told workers today in a memo that was seen by <em><a href=\"https://www.theverge.com/2021/6/2/22465846/apple-employees-return-office-three-days-week-september\">The Verge</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/06/apple-park-drone-june-2018-2.jpg\" />\r\n<br />\r\n\"For all that we've been able to achieve while many of us have been separated, the truth is that there has been something essential missing from this past year: each other,\" Cook said in the memo. \"Video conference calling has narrowed the distance between us, to be sure, but there are things it simply cannot replicate.\"\r\n<br />\r\n\r\n<br />\r\nMost employees will be asked to return to their offices on Mondays, Tuesdays, and Thursdays, with the option of working remotely on Wednesdays and Fridays. Teams that require in-person work will return to the office for four to five days a week.\r\n<br />\r\n\r\n<br />\r\nEmployees will also be able to work entirely remotely for up to two weeks every year, but the remote work requests will need to be approved by managers.\r\n<br />\r\n\r\n<br />\r\nCook wrapped up the memo by saying that he's looking forward to seeing employee faces. \"I know I'm not alone in missing the hum of activity, the energy, creativity and collaboration of our in-person meetings and the sense of community we've all built,\" he wrote.\r\n<br />\r\n\r\n<br />\r\nApple employees are likely expecting to be required to return to Apple campuses and offices around the world, as Apple has always heavily focused on the importance of in-person collaboration. Back in March, Apple CEO ‌Tim Cook‌ said that he <a href=\"https://www.macrumors.com/2021/03/18/tim-cook-apple-employees-return-to-work/\">couldn't wait</a> for employees to return to work, and he said that Apple would implement a \"hybrid environment\" for the return.<br />This article, \"<a href=\"https://www.macrumors.com/2021/06/02/apple-employees-returning-to-work/\">Apple Employees Asked to Return to Offices for Three Days a Week Starting in September</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-employees-asked-to-return-to-offices-for-three-days-a-week-starting-in-september.2298990/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Qh5zzfNx8f4:AZhIFSZlxVQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Qh5zzfNx8f4:AZhIFSZlxVQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Qh5zzfNx8f4\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d3ce4848033e184c70970111afeb43dd0c7ad8e82c119f1c63a7281c13782bbe","category":"Apple"}