{"title":"What is the Relationship Between Plant Trait Diversity and Geodiversity? A Plot‐Based, Pan‐European Analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13904?af=R","date":1724252064000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Heterogeneity of the Earth's abiotic surface and subsurface (geodiversity) is increasingly recognised as an important driver of biodiversity. Theoretically, species' traits should match to abiotic conditions in the local environment. Here, we test this for the first time at a continental extent by analysing the relationships between geodiversity and plant trait diversity in forested vegetation plots across Europe, at three plot sizes (100, 400 and 1000 m<sup>2</sup>).</p>\n<h2>Location</h2>\n<p>Europe.</p>\n<h2>Time Period</h2>\n<p>1930–present.</p>\n<h2>Major Taxa Studied</h2>\n<p>Plants.</p>\n<h2>Methods</h2>\n<p>We analysed geodiversity–trait diversity relationships across Europe at 1 km resolution using 2637 forested vegetation plots from the sPlotOpen database. We computed geodiversity (topographic, landform, wetness and soil physical and chemical heterogeneity) variables, combined with climate and land use data to analyse the direct and indirect effects of geodiversity on plant trait diversity, using structural equation modelling.</p>\n<h2>Results</h2>\n<p>Topographic heterogeneity, and annual temperature to a lesser degree, showed significant positive weak to moderately strong association with plant trait richness and evenness across all plot sizes. We also detected multiple highly significant but weak effects of geodiversity components on trait diversity dimensions. Some notable exceptions include moderate negative effects of soil silt heterogeneity on trait divergence across 1000 m<sup>2</sup> plots and positive and weak negative effects of TWI and soil sand heterogeneity on trait evenness, respectively. Explained variance was low across models, but higher for models from 1000 m<sup>2</sup> vegetation plots. Evidence for the indirect effects of geodiversity on trait diversity was extremely weak.</p>\n<h2>Main Conclusions</h2>\n<p>Our findings suggest variable-specific effects of geodiversity on trait diversity, with significant effects of multiple geodiversity components but dominated by topographic heterogeneity. Importantly, data precision is limited, and we are thus trying to detect signal amongst high noise. Hence, the significant but weak signals we detect may indicate more important underlying patterns than our effect sizes suggest.</p>","author":"Grant Vernham, \nJoseph J. Bailey, \nRichard Field, \nFranziska Schrodt","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"d3e5322e7c7c4abf58e5d4fa4f9273bd298ea1f82ed93e109a71a82acf6eaa29","category":"Environment"}