{"title":"The relationship between workplace bullying and family functioning: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310300","date":1726581600000,"content":"<p>by Yang Jie, Daniella Mokhtar, Nurul-Azza Abdullah</p>\r\n\r\nWhile the occupational and health-related consequences of workplace bullying have received extensive research attention, the effects of workplace bullying on the family domain have been largely ignored. Based on the PRISMA framework, the Scopus, Web of Science, PsycINFO, and PubMed databases were searched up to May 12, 2024, for articles on associations between workplace bullying and family functioning. A total of 1347 articles were identified, of which 37 were found after review to meet the criteria for inclusion. All the included studies found a direct or indirect association between workplace bullying and family functioning. Most studies are grounded in the conservation of resources (COR) theory, spillover theory, crossover theory, and work-family interface model. Negative affect (emotions), work-family conflict (WFC), and burnout were considered essential mechanisms explaining the links between workplace bullying and family functioning, with personal resources (demands) as the main moderators. Most studies focus on the one-way impact of workplace bullying on family functioning, mainly using cross-sectional, non-randomized self-report designs. Future research will benefit from using a longitudinal design, continued characterization of the workplace bullying-family functioning relationship, including its nature, direction, processes, and boundary conditions in various industrial and cultural contexts, together with the use of models for the integration of research findings.","author":"Yang Jie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d3e7c8ab9ef803cfdcc555cfa8c5dc1e5f20c1ccda5a2cbfb82fdd0129c83fbf","category":"Interdisciplinary"}