{"title":"Natural soda lakes provide compatible conditions for RNA and membrane function that could have enabled the origin of life","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae084/7627925?rss=1","date":1710806400000,"content":"<span><div>Abstract</div>The origin of life likely occurred within environments that concentrated cellular precursors and enabled their co-assembly into cells. Soda lakes (those dominated by Na<sup>+</sup> ions and carbonate species) can concentrate precursors of RNA and membranes, such as phosphate, cyanide, and fatty acids. Subsequent assembly of RNA and membranes into cells is a long-standing problem because RNA function requires divalent cations, e.g. Mg<sup>2+</sup>, but Mg<sup>2+</sup> disrupts fatty acid membranes. The low solubility of Mg-containing carbonates limits soda lakes to moderate Mg<sup>2+</sup> concentrations (∼1 mM), so we investigated whether both RNAs and membranes function within these lakes. We collected water from Last Chance Lake and Goodenough Lake in Canada. Because we sampled after seasonal evaporation, the lake water contained ∼1 M Na<sup>+</sup> and ∼1 mM Mg<sup>2+</sup> near pH 10. In the laboratory, nonenzymatic, RNA-templated polymerization of 2-aminoimidazole-activated ribonucleotides occurred at comparable rates in lake water and standard laboratory conditions (50 mM MgCl<sub>2</sub>, pH 8). Additionally, we found that a ligase ribozyme that uses oligonucleotide substrates activated with 2-aminoimidazole was active in lake water after adjusting pH from ∼10 to 9. We also observed that decanoic acid and decanol assembled into vesicles in a dilute solution that resembled lake water after seasonal rains, and that those vesicles retained encapsulated solutes despite salt-induced flocculation when the external solution was replaced with dry-season lake water. By identifying compatible conditions for nonenzymatic and ribozyme-catalyzed RNA assembly, and for encapsulation by membranes, our results suggest that soda lakes could have enabled cellular life to emerge on Earth, and perhaps elsewhere.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"d3e73d9b922ba1df98959ac3b6cbf3ac83007087d7ab725753a2ae2190a9295c","category":"Interdisciplinary"}