{"title":"Leveraging Bioactive Proteins and Peptides from Lumbricus Earthworms: Targeting SOCS2 E3 Ligase for Cardiovascular Therapy through Molecular Dynamics Simulations","link":"https://www.preprints.org/manuscript/202409.1346/v1","date":1726643803000,"content":"SOCS2, an E3 ubiquitin ligase, regulates the JAK/STAT signaling pathway, essential for cytokine signaling and immune responses. Its dysregulation contributes to cardiovascular diseases (CVDs) by promoting abnormal cell growth, inflammation, and resistance to cell death. This study aimed to elucidate the molecular mechanisms underlying the interactions between Lumbricus-derived proteins and peptides and SOCS2, with a focus on identifying potential therapeutic candidates for CVDs. Utilizing a multifaceted approach, advanced computational methodologies, including 3D structure modeling, protein-protein docking, 100 ns molecular dynamics (MD) simulations, and MM/PBSA calculations, were employed to assess the binding affinities and functional implications of Lumbricus-derived proteins on SOCS2 activity. The findings revealed that certain proteins, such as Lumbricin, Chemoattractive glycoprotein ES20, and Lumbrokinase-7T1, exhibited similar activities to standard antagonists in modulating SOCS2 activity. Furthermore, MM/PBSA calculations were employed to assess the binding free energies of these proteins with SOCS2. Specifically, Lumbricin exhibited an average ΔGbinding of -59.25 kcal/mol, Chemoattractive glycoprotein ES20 showed -55.02 kcal/mol, and Lumbrokinase-7T1 displayed -69.28 kcal/mol. These values suggest strong binding affinities between these proteins and SOCS2, reinforcing their potential therapeutic efficacy in cardiovascular diseases. Further in vitro and animal studies are recommended to validate these findings and explore broader applications of Lumbricus-derived proteins.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d3ec60b754a533b36630f4f5a157bc6f48a943f2e436b59dde7907b88c1ddcf7","category":"Interdisciplinary"}