{"title":"YouTube’s TikTok clone, “YouTube Shorts,” is live in the US","link":"https://arstechnica.com/?p=1746035","date":1614625588000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/14-980x1021.jpg\" alt=\"\"></div>\n        <p>\n          YouTube Shorts. It's like TikTok.                       [credit:\n                        Ron Amadeo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>YouTube's clone of TikTok, \"YouTube Shorts,\" is rolling out to the US as we speak. The feature launched in India this September and was first spotted on US devices by <a href=\"https://www.xda-developers.com/youtube-tiktok-like-shorts-feature-is-rolling-out-in-beta-in-the-us/\">XDA Developers.</a> Just like TikTok, Shorts lets users make and share bite-sized, one-minute videos, and users can swipe between them on the mobile app.</p>\n<p>The YouTube Shorts section shows up on the mobile apps section of the YouTube home screen and for now has a \"beta\" label. It works exactly like TikTok, launching a full-screen vertical video interface, and users can swipe vertically between videos. As you'd expect, you can like, dislike, comment on, and share a short. You can also tap on a user name from the Shorts interface to see all the shorts from that user. The YouTube twist is that shorts are <em>also</em> regular YouTube videos and show up on traditional channel pages and in subscription feeds, where they are indistinguishable from normal videos. They have the normal YouTube interface instead of the swipey TikTok interface. This appears to be the only way to view these videos on desktop.</p>\n<p>A big part of TikTok is the video editor, which allows users to make videos with <a href=\"https://www.youtube.com/watch?v=iODI9D-T6jY\">tons of effects</a>, music, filters, and variable playback speeds that contribute to the signature TikTok video style. The YouTube Shorts editor seems <a href=\"https://support.google.com/youtube/answer/10059070?hl=en#:~:text=YouTube%20Shorts%20are%20vertical%20videos,experience%20made%20for%20short%20videos.\">nearly featureless</a> in comparison, offering only speed options and some music.</p></div><p><a href=\"https://arstechnica.com/?p=1746035#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1746035&comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d3f0accd50ca5a6d61d834d7219ff7d0ef12e538617075e400fc69d2748eeaca","category":"Tech"}