{"title":"Robust capital cost optimization of generation and multitimescale storage requirements for a 100% renewable Australian electricity grid","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae127/7634795?rss=1","date":1711324800000,"content":"<span><div>Abstract</div>Transitioning from a fossil-fuel-dependent economy to one based on renewable energy requires significant investment and technological advancement. While wind and solar technologies provide lower cost electricity, enhanced energy storage and transmission infrastructure come at a cost for managing renewable intermittency. Energy storage systems vary in characteristics and costs, and future grids will incorporate multiple technologies, yet the optimal combination of storage technologies and the role of interconnectors in alleviating storage needs are not widely explored. This study focuses on optimal generation-storage capacity requirements to elucidate associated investments. We propose a multitimescale storage solution consisting of three storage categories and an interconnector between Australia’s eastern and western grids. Subsequently, through an extensive sensitivity analysis, we investigate the impact of specific storage technologies and cost variations. Our findings demonstrate that the proposed interconnector offers a cost-effective solution, reducing generation and storage power capacity needs by 6 and 14%, respectively, resulting in 4% savings on overall investment costs. Moreover, the study’s sensitivity analysis reveals that wind generation provides 50–70% of the energy demand for the least-cost solution. Despite storage inefficiencies, long-duration storage would need to be deployed to support power capacity for 2–4 days, representing 15–40% of peak demand, depending on future technology costs. Subsequently, achieving a fully renewable electricity sector in Australia requires a significant expansion of generation and storage infrastructure, with a 13-fold increase in storage power capacity and a 40-fold increase in storage energy capacity compared to existing levels.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"d3f3a9a988928fc0707d48212823769cd8b4c955178d029a13bf36b06cefc171","category":"Interdisciplinary"}