{"title":"Epigenetics of conotruncal congenital heart disease: Protocol for a systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302642","date":1714485600000,"content":"<p>by Elhadi H. Aburawi, Linda Östlundh, Hanan E. Aburawi, Rami H. Al Rifai, Akshaya Bhagavathula, Abdelouahab Bellou</p>\r\nBackground <p>Conotruncal congenital heart defects (CTD) are a subset of congenital heart diseases (CHD) that involve structural anomalies of the right, left, or both cardiac outflow tracts. CHD is caused by multifactorial inheritance and changes in the genes or chromosomes. Recently, CHD was found to be due to epigenetic alterations, which are a combination of genetic and other environmental factors. Epigenetics is the study of how a gene’s function changes as a result of environmental and behavioral influences. These causative factors can indirectly cause CHD by altering the DNA through epigenetic modifications. This is a protocol for a systematic review and meta-analysis that aims to explore whether the strength of association between various epigenetic changes and CTD types varies by race. Furthermore, to determine and compare the changes in gene expression of each mutation.</p> Methods <p>Our protocol follows the Preferred Reporting Items for Systematic Reviews and Meta-Analyses Protocol (PRISMA-P) guidelines. A comprehensive pre-search has been developed in PubMed and PubMed’s Medical Subject Headings (MeSH). The final search will be performed in June 2023 in PubMed, Embase, Scopus, Web of Science, Cochrane Library, CIANHL, and PsycInfo, without restrictions on publication years. The Covidence systematic review software will be used for blinded screening and selection. Conflicts will be resolved by a third, independent reviewer. The risk of bias in selected studies will be assessed using the National Heart, Lung, and Blood Institute (NHLBI) Quality Assessment Tool for Observational Cohort and Cross-Sectional Studies. The data to be extracted will cover basic information on the included studies, study sample size, number of patients with various types of epigenetic changes, number of patients with various CTD types, measures of association and their 95% confidence interval between each epigenetic change and each CTD. The protocol has been registered with the International Prospero Register of Systematic Review (PROSPERO) [CRD42023377597].</p> Discussion <p>To the best of our knowledge, this protocol outlines the first systematic review and meta-analysis of the epigenetics of CTD. There is a growing body of evidence on epigenetics and its indirect involvement in disease by altering the DNA through epigenetic modifications in the genes associated with the causative factors for CHD. We will conduct a comprehensive and systematic search for literature in the above-mentioned seven core biomedical databases. It is very important to identify population-specific risk factors for CHD, which will have significant creative, custom-made, and effective prevention programs for the future generation.</p>","author":"Elhadi H. Aburawi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d3f97cc35bb3d4ca05eef367e5124c07167f00411ac329c0b713417f5d6b6de8","category":"Interdisciplinary"}