{"title":"iStat Menus review: A dashboard smorgasbord for the macOS menu bar","link":"https://www.macworld.com/article/538718/mac-gems-istat-menus-review.html","date":1632992400000,"content":"<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div></div><h3>Price When Reviewed</h3><p>Individual: $11.99, $9.99 upgrade; Family Pack: $14.99, $12.99 upgrade </p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Bjango</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$10</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bjango.com/mac/istatmenus/&amp;xcust=1-1-538718-2-539072-14020&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bjango.com/mac/istatmenus/&amp;xcust=1-1-538718-1-0-0&amp;sref=https://www.macworld.com/feed\">iStat Menus 6</a> gives you access at a glance to a dashboard’s worth of statistics, graphs, states, and speeds of your Mac’s CPU, disks, network, battery, and memory—as well as throwing in the kitchen sink, offering clocks and the current and forecast weather—through dropdown menu bar items. If you need or want to know what’s going in any nook and cranny on your Mac, or what time (and day) it is in, say, Auckland, New Zealand, for example, the app has you covered.</p>\n\n\n\n<p>iStat Menus provides an exhaustive amount of information, but it shines at the task for three reasons. First, it’s compact, putting the information in dropdown menus instead of occupying valuable screen real estate and attention. Second, it’s highly configurable, letting you choose just which items you want to monitor or view, and how much of that data is previewed in miniature in the menu bar.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac-gems-istat-menus-memory-popout.png?w=1200\" /><figcaption>iStat Menus shows information at a glance in the menu bar, more details with a dropdown menu, and even more with popup visualizations and charts when you hover over certain data.</figcaption></figure></div>\n\n\n\n<p>Third, over the 15-year lifespan of the programmer, developer Bjango has kept up to pace with the state of clean, easy-to-parse interface design, while also packing in a quite absurd amount of information without sacrificing legibility.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac-gems-istat-menus-extra-stuff.png?w=582\" /><figcaption>You can combine information into a single menu and dropdown, but it’s easy to go overboard.</figcaption></figure></div></div>\n\n\n\n<p>The app can create a series of menus for each category of thing it supports showing: weather, CPU &amp; GPU, memory, disk, network, sensors, battery/power, and time. (Six months of weather data is included in the purchase price.) If you want to keep your menu bar relatively clean, the Combined option in iStat Menus allows grouping together any of the available stats and data into a single menu.</p>\n\n\n\n<p>A Notification section allows configurable alerts and banners based on data the app monitors or at given times of day, such as the temperature of a CPU or GPU rising too high or when you’re running low on disk storage.</p>\n\n\n\n<p>You can fall down the rabbit hole of tricking out the software, as each categories lets you customize what data and indicator appears in the menu bar and then what kind of data shows up when you click the dropdown menu. You can then set the order in which items appear in the menu and much more.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac-gems-istat-menus-main-screen-1.png?w=1200\" /><figcaption>The appearance of the customization screens is far more complex than actually using them.</figcaption></figure></div></div>\n\n\n\n<p>But Bjango keeps it surprisingly approachable by using drag-and-drop simplicity to select and arrange the items you want with graphic previews of how your choices will appear.</p>\n\n\n\n<p>While dashboard-style interfaces have waxed and waned—including Apple’s own Dashboard that thrived from about 2004 to 2014—iStat Menus has remained true to its core. It combines the best intent of a dashboard in providing you with an array of well-presented information in one place without getting in your face.</p>\n\n\n\n<p><em>We reviewed <a href=\"https://www.macworld.com/article/221096/mac-gems-istat-menus-is-a-standout-app-for-monitoring-your-mac.html\">version 4 in 2013</a> and <a href=\"https://www.macworld.com/article/224427/istat-menus-5-provides-more-system-information-in-a-prettier-package.html\">version 5 in 2014</a>. With version 5, we said, “iStat’s excellent customization panels let you choose exactly what you want to see.”</em></p>\n\n\n\n<p><em>Welcome to the return of Mac Gems, a column that ran for many years and highlighted great nuggets of Mac software—apps that have a high utility, have a sharp focus on a limited set of problems to solve, and are generally developed by an individual or small company. With the strong resurgence of the Mac in recent years, we want to celebrate tools we use and that readers recommend to make the most of your macOS experience. Stay tuned for weekly updates, and send your suggestions to the Mac Gems Twitter feed (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macgems&amp;xcust=1-1-538718-1-0-0&amp;sref=https://www.macworld.com/feed\">@macgems</a>).</em></p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d3fe274e599ec2be20a6f0e2ecd9fda9b122bf05ef218240cdb4e5a116f01d21","category":"Apple"}