{"title":"Apple Invites Developers to Cupertino for Workshop on Optimizing Apps for Performance and Battery Life","link":"https://www.macrumors.com/2023/09/06/apple-developer-center-app-optimization-event/","date":1694040137000,"content":"Apple today sent out emails inviting developers to visit the Apple Developer Center in Cupertino, California for a workshop on app optimization. Apple says that developers can learn to maximize app performance to \"give people a great experience.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/Apple-Park-View.jpeg\" alt width=\"1440\" height=\"790\" />\r<br />\nAttendees will learn how to optimize Apple frameworks and what Apple tools can be used for identifying and resolving performance issues. Apple engineers will be on hand to provide support, app testing, and advice.\r<br />\n\r<br />\nThe all-day event that runs from 9:00 a.m. to 4:00 p.m. Pacific Time is set to take place at the Apple Developer Center on September 27, 2023. The event is free, and registration is first come, first serve. It is not clear how many spots are open to developers<blockquote>Join us for an all-day, in-person event and discover how to improve your app experience by maximizing performance. Learn how to optimize your use of Apple frameworks, identify and resolve performance issues with tools like Instruments and Xcode Organizer, and get advice from Apple engineers on reducing launch time, hang rate, memory footprint, and more. Plus, you'll have the opportunity to test your apps and get hands-on support. Hosted at the Apple Developer Center in Cupertino.</blockquote>Apple <a href=\"https://www.macrumors.com/2022/06/05/apple-developer-center-opens/\">opened the Apple Developer Center</a> in June of 2022, just ahead of the 2022 Worldwide Developers Conference. Apple has described the Developer Center as a \"world class facility\" where developers can meet with Apple engineers, designers, and experts.\r<br />\n\r<br />\nThere are dedicated lab areas at the Developer Center, along with work pods, briefing centers, a studio with stage, and more. Meeting rooms are named after prior macOS releases, and the studio room is named Big Sur.\r<br />\n\r<br />\nOutside of WWDC 2022 and 2023, Apple has extended limited invitations to developers to visit the Developer Center at <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a>. The September 27 meetings will take place following the introduction of new iPhones on September 12 and after the launch of <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, which we are expecting to see released around September 20.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/06/apple-developer-center-app-optimization-event/\">Apple Invites Developers to Cupertino for Workshop on Optimizing Apps for Performance and Battery Life</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-invites-developers-to-cupertino-for-workshop-on-optimizing-apps-for-performance-and-battery-life.2400661/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d3ff0431b3f3da7dd776d4a56ca1abbe566f31670c2ed38e0a73e1d7dfc00930","category":"Apple"}