{"title":"Utilization of Vestibular Information for Balance Control in Children with Chiari I Malformation","link":"https://www.preprints.org/manuscript/202409.0573/v1","date":1725861320000,"content":"Background: Surgery for Chiari I malformation (CMI) is indicated when typical clinic-radiological features (syringomyelia, exertional headaches, sleep apnea syndrome, tetraparesis) are present. Sometimes patients have atypical complaints suggestive of otolaryngological (ENT) involvement, and it is sometimes difficult for the neurosurgeon to determine if these complaints are related to the CMI. Our aim was to describe postural control pattern in children with CMI using Computerized Dynamic Posturography. To our knowledge, this is the first study addressing postural instability in paediatric CMI patients.\n\nMethods: twenty-eight children aged 6 to 17 years with both radiologically confirmed CMI and clinical ENT complaints were included. Children were separated into 2 groups: operated and non-operated patients, basing on neurosurgical indication. Epidemiologic and posturographic results (CDP - Equitest®) were compared between both groups, as well as pre and post operatively in the group 2. \n\nResults: in Group 2 patients, significant improvement of global SOT was found after intervention. When the three sensorial aspects of postural control calculated by the system were independently assessed, the greatest improvement was in the vestibular ratio. \nWe also observed an altered CoG pattern (“lateral deviation”) in the Group 2 patients, which significantly differed from Group 1. Lateral deviation was significantly reduced postoperatively in Group 2 patients. A correspondence between preoperative MRI and side of lateralisation on posturography was found in 4 children, but this cannot be regarded as significant due to the low number of patients. \n\nConclusions: postural control seems to improve after surgery for CMI in children, mostly due to improvement in vestibular function. There is a correspondence between the side of lateral deviation and the side of greatest tonsillar descent on MRI and perioperatively. Further studies are needed to support these results and to confirm utility of CDP in CMI patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d4134e9495b2beb2ffbfa28d78a966c70f96ef4a4d2e092cf366e860459361e7","category":"Interdisciplinary"}