{"title":"How a game about dwarves mining in space has helped me weather the pandemic","link":"https://arstechnica.com/?p=1787136","date":1629032430000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/DRG_Screenshot_005-copy-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/DRG_Screenshot_005-copy.jpg\">Enlarge</a> <span>/</span> <em>Deep Rock Galactic</em> is a bug-killing, gold-mining good time.  (credit: Ghost Ship Games)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>I've never loved online multiplayer games. I'm always up for a few rounds of <em>Smash Bros. </em>or <em>Towerfall</em> on the couch with a couple beers and a couple buds, but when it comes to playing online, I never put in the work to find a group I could play with regularly. I also never wanted to invest the time it would take to really get <em>good</em> at highly competitive first-person shooters or <a href=\"https://en.wikipedia.org/wiki/Multiplayer_online_battle_arena\">MOBAs</a> or battle royale games. But like so many things—working, parenting, my relationship to the concept of time—that began to change when the pandemic hit. Couch multiplayer was no longer an easy option, but I was starving for human interaction, so I turned to my PC.</p>\n<p>What began with me and one other person intermittently dabbling in <em>Age of Empires II </em>eventually became a group of three to four people who were meeting to play games once or twice a week, every week. We started with group <a href=\"https://www.geoguessr.com/\" target=\"_blank\">Geoguessr</a> sessions and a sort of pass-the-controller-style thing where we'd chat while we took turns streaming <a href=\"https://store.steampowered.com/app/270880/American_Truck_Simulator/\" target=\"_blank\"><em>American Truck Simulator</em></a>. Then we played <a href=\"https://store.steampowered.com/app/386940/Ultimate_Chicken_Horse/\" target=\"_blank\"><em>Ultimate Chicken Horse</em></a> until we'd unlocked all the levels, and we stuck with <a href=\"https://arstechnica.com/gaming/2020/08/fall-guys-review-a-perfect-amount-of-cheap-stupid-fun-with-online-friends/\" target=\"_blank\"><em>Fall Guys</em></a> through a couple of seasons. But it wasn't until a group replay of <em>Left 4 Dead 2</em> that we realized what we <em>really</em> wanted was a game where we could work together. And when we were done with <em>that</em>, at long last, we landed on the game this piece is actually about: <a href=\"https://www.deeprockgalactic.com/\" target=\"_blank\"><em>Deep Rock Galactic</em></a>.</p>\n<p><em>Deep Rock Galactic </em>(hereafter <em>DRG</em>) is a co-op game where between one and four players suit up to explore the planet Hoxxes IV, collecting its resources and fighting its hostile insectoid inhabitants on behalf of a comically heartless, hypercapitalist space mining corporation. You only have a few distinct mission types to choose from, but the tunnels of Hoxxes IV (and the enemy encounters) are all procedurally generated and you can play as any one of four classes, making each playthrough unique. Also, you're all dwarves.</p></div><p><a href=\"https://arstechnica.com/?p=1787136#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1787136&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d41bc40f3235f3fa237edfb099d25689fe6f0aba4f2c359fac064a0cbafc6d4d","category":"Tech"}