{"title":"Life‐history of the spiny butterfly ray, Gymnura altavela (Chondrichthyes: Myliobatiformes), kept under human care in a marine aquarium","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15862?af=R","date":1720654699000,"content":"<h2>Abstract</h2>\n<p>The Rio de Janeiro Marine Aquarium (AquaRio) is the first to successfully maintain and reproduce the spiny butterfly ray (<i>Gymnura altavela</i>), providing unique information about the species' biology. Seven rays were kept in captivity between 2018 and 2023, two captured on the southeastern coast of Brazil and five born in the aquarium. The applied abiotic conditions and nutrition allowed for the survival, growth, and reproduction of these individuals. Growth parameters (asymptotic disk width—DW<sub>\n   <i>∞</i>\n</sub> and growth coefficient—<i>k</i>) were estimated based on the von Bertalanffy model using the Fabens method for males and females separately. The best models estimated DW<sub>\n   <i>∞</i>\n</sub> = 106.47 cm and <i>k</i> = 0.396 for males and DW<sub>\n   <i>∞</i>\n</sub> = 172.2 cm and <i>k</i> = 0.190 for females. Sexual dimorphism was corroborated, with females reaching larger sizes and presenting slower growth rates than males. The estimated <i>k</i> values were higher than those estimated for rays of similar size to <i>G. altavela</i> in the natural environment, probably due to the constant water temperature (around 25.5°C), food abundance, low population density, reduced predation rates, and high water quality in the captive environment. A comparison of the captivity findings with other studies on <i>G. altavela</i> age and growth in the Atlantic and Mediterranean indicates a broad phenotypic plasticity regarding growth. Three <i>G. altavela</i> reproductions were recorded, with size at birth appearing to be a key factor for pup's survival. Behavioral pattern observations associated with reproduction are also described, encompassing chasing and copulation, whereas the species’ internal morphology is described through coelomic cavity ultrasound scanning.</p>","author":"Clara V. Teixeira‐Leite, \nFrancisco Marcante Santana, \nRafael Franco Valle, \nVeronica Takasuka, \nMatheus Felix de Góes, \nShayra Peruch Bonatelli, \nSergio Ricardo Santos, \nMarcelo Vianna","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"d41c3eac3df70f5955cafb3a98041caa8e54ccb597de75a4a068c8334bdd8396","category":"Environment"}