{"title":"PodSwap สตาร์ทอัพรับเปลี่ยนแบต AirPods ตัดราคาแอปเปิล ช่วยลดปัญหาขยะอิเล็กทรอนิกส์","link":"https://www.blognone.com/node/123669","date":1626086808000,"content":"<div><div><div><p>AirPods หูฟังของ Apple ที่ขึ้นชื่อเรื่องความสะดวกในการใช้งาน แต่กลับไม่สะดวกเท่าไรเมื่อมีอายุหลายปี ผู้ใช้หลายคนพบว่าความจุแบตเตอรี่ลดลงจาก 4-5 ชั่วโมง เหลือเพียงชั่วโมงเดียวบางครั้งก็ไม่ถึงชั่วโมงโดยผู้ใช้ไม่มีทางเปลี่ยนแบตเตอรี่ด้วยตัวเอง</p>\n<p>ปัจจุบันถ้าผู้ใช้นำหูฟังแบตเตอรี่เสื่อมเข้าศูนย์ Apple ก็จะได้หูฟังใหม่ให้แทน โดยมีค่าใช้จ่าย 98 ดอลลาร์ (เปลี่ยนข้างเดียวได้) แม้จะถูกกว่าซื้อใหม่ในราคา 159 ดอลลาร์ แต่ก็ยังมีราคาแพง และ Apple ก็จะนำหูฟังเก่าไปรีไซเคิลแม้จะนำชิ้นส่วนหลายชิ้นมาใช้ใหม่ได้ ทำให้เกิดขยะอิเล็กทรอนิกส์อยู่ดี</p>\n<p><a href=\"https://www.thepodswap.com/\">PodSwap</a> บริษัทสตาร์ทอัพในไมอามี่ ที่ก่อตั้งโดย Emma Stritzinger และ Emily Alpert ช่วงปลายปี 2020 ให้บริการเปลี่ยน AirPods ทั้งสองข้าง ในราคา 59 ดอลลาร์  โดย PodSwap จะส่ง AirPods ที่มาจากผู้ใช้คนอื่น แต่ผ่านกระบวนการเปลี่ยนแบต ทำความสะอาด และฆ่าเชื้อโรคเรียบร้อยแล้ว ไปให้ผู้ใช้บริการ ส่วนผู้ใช้บริการก็ต้องส่งหูฟังคู่เก่าของตัวเอง กลับมาเข้ากระบวนการเปลี่ยนแบตและทำความสะอาด เตรียมส่งต่อให้ผู้ใช้คนอื่นต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fc9ce7b10dc50bd38c59839b67945dd5.jpg\" /></p>\n<p>Emily Alpert หนึ่งในผู้ก่อตั้ง ระบุว่ากระบวนการเปลี่ยนแบต เป็นผลจากการลองผิดลองถูกหลายครั้ง มีการใช้ทั้งแรงคนและหุ่นยนต์ร่วมกัน เพราะ AirPods แต่ละชิ้น อาจมีการประกอบที่แตกต่างกันเล็กน้อย ทำให้กระบวนการเปลี่ยนแบตมีความซับซ้อนสูงมาก</p>\n<p>แต่ PodSwap ก็ยังมีปัญหาอยู่บ้าง โดย Kif Leswing จาก <a href=\"https://www.cnbc.com/2021/07/10/apple-airpod-battery-life-problem-shows-need-for-right-to-repair-laws.html\">CNBC</a> ที่ทดลองใช้บริการ PodSwap พบปัญหาเล็กน้อยในครั้งแรกที่ใช้งาน โดยเขาได้หูฟัง Gen1 และ Gen2 มาอย่างละข้าง แต่เมื่อแจ้ง PodSwap ไป บริษัทก็ส่งหูฟังมาให้ใหม่ และเขาก็ส่งหูฟังที่ได้มาผิด พร้อมกับหูฟังของเขากลับคืนไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/73e6ad499918bfa6c148262536c8f0ff.jpg\" /><em>ภาพการแกะหูฟัง AirPods 2 จาก <a href=\"https://www.ifixit.com/Teardown/AirPods+2+Teardown/121471\">iFixit</a></em></p>\n<p>ปัญหาช่างภายนอกไม่สามารถซ่อมแซมอุปกรณ์อิเล็กทรอนิกส์รุ่นใหม่ๆ ได้นับเป็นปัญหาสำคัญของอุตสาหกรรมอิเล็กทรอนิกส์ทั่วโลก ในสหรัฐฯ มีความพยายามผลักดันสิทธิ์การซ่อม (right to repair)<br />\nโดยโจ ไบเดน ก็เพิ่งสั่งให้ FTC ร่างกฎ <a href=\"https://www.blognone.com/node/123614\">right to repair</a> เพื่อลดการผูกขาดการซ่อมแซมอุปกรณ์อิเล็กทรอนิกส์ รวมถึงสนับสนุนให้บริษัทออกแบบอุปกรณ์อิเล็กทรอนิกส์ที่สามารถซ่อมได้ง่ายขึ้น เพื่อยืดอายุการใช้งาน และลดขยะอิเล็กทรอนิกส์ในอนาคต แต่หนทางของกฎนี้ยังยาวไกล พร้อมทั้งอาจเจอแรงต้านจากบริษัทต่างๆ ได้</p>\n<p>แม้ PodSwap จะยังมีจุดขลุกขลักอยู่บ้าง และกฎ right to repair อาจใช้เวลานานกว่าร่างจะเสร็จและถูกนำไปบังคับใช้จริง แต่สิทธิ์ในการซ่อมของผู้บริโภคที่ยืดหยุ่นขึ้น และอนาคตที่อุปกรณ์อิเล็กทรอนิกส์จะถูกออกแบบมาเพื่อรองรับการซ่อมของผู้บริโภคและช่างอิสระมากขึ้น ก็ดูจะสดใสขึ้นเรื่อยๆ</p>\n<p>ที่มา - <a href=\"https://www.cnbc.com/2021/07/10/apple-airpod-battery-life-problem-shows-need-for-right-to-repair-laws.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/airpods\">AirPods</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d422f3b27b993d97ccfc7a5febdcda947ec73cf7fcf0d5d0de67bf0d1f3938dc","category":"Thai"}