{"title":"A Guide to HashiCorp at KubeCon Europe Virtual 2021","link":"https://www.hashicorp.com/blog/a-guide-to-hashicorp-at-kubecon-europe-virtual-2021","date":1620115200000,"content":"<p>As KubeCon + CloudNativeCon Europe Virtual kicks off this week, HashiCorp will once again be sponsoring the event, hosting informative deep-dive sessions, and answering questions at our digital booth. Our technical experts will also be on-hand to do product demos.</p>\n<p>HashiCorp continues to make Kubernetes a first-class citizen in our ecosystem with ongoing roadmaps for Kubernetes integrations within HashiCorp Terraform, Vault, and Consul. Over a year ago, we deepened our commitment with Kubernetes and many other projects <a href=\"https://thenewstack.io/hashicorp-deepens-integrations-with-kubernetes-and-cncf-projects/\">by joining the Cloud Native Computing Foundation (CNCF)</a>. Today, HashiCorp <a href=\"https://landscape.cncf.io/selected=terraform\">Terraform</a>, <a href=\"https://landscape.cncf.io/?selected=vault\">Vault</a>, <a href=\"https://landscape.cncf.io/selected=consul\">Consul</a>, <a href=\"https://landscape.cncf.io/selected=nomad\">Nomad</a>, and <a href=\"https://landscape.cncf.io/?selected=packer\">Packer</a> all fit into the <a href=\"https://landscape.cncf.io/\">official CNCF landscape diagram</a>. HashiCorp’s portfolio of products currently integrates with many CNCF projects, including Kubernetes, Spinnaker, Helm, the Container Networking Interface (CNI), Envoy, Prometheus, gRPC, Jaeger, Open Tracing, the Service Mesh Interface (SMI), and more.</p>\n<p>This blog showcases some of the most recent product enhancements relating to Kubernetes and orchestration in general and also lays out our schedule of events and activities for the week of KubeCon.</p>\n<h2><a href=\"#consul-1-10-a-global-scale-service-mesh\">»</a><a></a>Consul 1.10: A Global Scale Service Mesh</h2>\n<p><a href=\"https://www.consul.io/\">HashiCorp Consul</a> has become an increasingly popular option in the evolving service mesh market by taking a heterogeneous integration approach that differentiates it from offerings such as Google’s Istio or Linkerd (part of the CNCF). We will be releasing Consul 1.10 GA shortly after KubeCon (June), but <a href=\"https://www.hashicorp.com/blog/announcing-consul-1-10-beta\">the beta is already available</a>.</p>\n<p>Consul 1.10 continues to build on the momentum of Consul 1.9, adding additional service mesh enhancements for both Kubernetes and non-Kubernetes users. The new <a href=\"https://www.consul.io/docs/connect/transparent-proxy\">Transparent Proxy</a> helps developers enable Consul’s mesh functionality without having to define upstreams in both the application code and Kubernetes manifest. Consul will detect the destination from the application code and route it to the corresponding Envoy proxy. This makes it easier for developers to deploy new applications into the mesh and ensures mTLS is consistently applied to these services.</p>\n<p>Consul 1.10 also introduces the ability to deploy Prometheus and Grafana via the Consul Helm Chart and gather enhanced metrics from Kubernetes environments including Pod and Envoy data. These metrics can then be fed directly into Consul’s observability UI, providing greater insights into the performance of a Consul service mesh. You can download the Consul 1.10 beta now from the <a href=\"https://github.com/hashicorp/consul/releases\">Consul release page</a> or Helm chart.</p>\n<p>Lastly, our Consul managed service on the HashiCorp Cloud Platform (HCP) reached GA this year (currently available for AWS), making HCP Consul the fastest and easiest way to run our Enterprise service mesh. On top of that, we recently released benchmarks for Consul running a service mesh with 10,000 nodes. The key result showed five Consul servers were able to deliver control plane updates to 172,000 service instances (containers) in under one second. Read more about the <a href=\"https://www.hashicorp.com/cgsb\">Consul Global Scale Benchmark here</a>.</p>\n<h2><a href=\"#nomad-1-1-improved-efficiency-and-performance\">»</a><a></a>Nomad 1.1: Improved Efficiency and Performance</h2>\n<p>The increased customer adoption of HashiCorp Nomad is a strong validation that the orchestration market <a href=\"https://thenewstack.io/the-case-for-multiple-orchestrators/\">is not \"one tool fits all.\"</a>  Customers including <a href=\"https://www.hashicorp.com/case-studies\">Cloudflare, Roblox, Q2 Software, and more</a> have adopted Nomad as an alternative or supplement to Kubernetes because of its simplicity and flexibility. We recently announced the <a href=\"https://www.hashicorp.com/blog/announcing-hashicorp-nomad-1-1-beta\">Nomad 1.1 beta release</a>, which delivers many new features for greater scheduling flexibility and a simplified operator experience. Here are the changes:</p>\n<ul>\n<li>The core Nomad scheduler now includes several new resource control mechanisms to unlock higher efficiency and better performance.</li>\n<li>New CSI volume management capabilities for broader stateful workload support are included.</li>\n<li>The Nomad Autoscaler now supports horizontal cluster autoscaling on AWS, Azure, and Google Cloud.</li>\n<li>The UI and API have several new features simplifying the operator experience.</li>\n</ul>\n<h2><a href=\"#community-office-hours-kubecon-europe-deep-dives\">»</a><a></a>Community Office Hours: KubeCon Europe Deep Dives</h2>\n<p>Throughout KubeCon, our Engineering and Developer Advocate teams will be available to answer live questions while hosting KubeCon-focused deep dive sessions for our products. You can find links to each of the livestreams on our <a href=\"https://www.hashicorp.com/community/office-hours\">Community Office Hours page</a> and check out the schedule below.</p>\n<p>KubeCon Europe Deep Dives</p>\n<ul>\n<li>Tuesday, May 4\n<ul>\n<li><strong>Security</strong>: 16:00 CEST | 10:00 EDT | 7:00 PDT</li>\n<li><strong>Waypoint</strong>: 17:00 CEST | 11:00 EDT | 8:00 PDT</li>\n</ul>\n</li>\n<li>Wednesday, May 5\n<ul>\n<li><strong>Nomad</strong>: 17:00 CEST | 11:00 EDT | 8:00 PDT</li>\n</ul>\n</li>\n<li>Thursday, May 6\n<ul>\n<li><strong>Terraform</strong>: 16:00 CEST | 10:00 EDT | 7:00 PDT</li>\n</ul>\n</li>\n<li>Friday, May 7\n<ul>\n<li><strong>Consul</strong>: 14:30 CEST | 8:30 EDT | 5:30 PDT</li>\n</ul>\n</li>\n</ul>\n<p>Our Developer Advocate team will be hanging out in our CNCF Slack workspace</p>\n<p>throughout the conference if you want to ask questions or just chat throughout the day.</p>\n<p>We will also have a virtual booth within the KubeCon platform that you can visit to see product demos. <a href=\"https://hashi.co/3vpJVqk\">Register here</a> and it will take you directly to our booth.</p>\n<h2><a href=\"#see-you-there\">»</a><a></a>See You There</h2>\n<p>We’re looking forward to connecting with all of you at KubeCon + CloudNativeCon Europe Virtual and helping you improve your operational excellence in the cloud. Visit <a href=\"https://learn.hashicorp.com/\">HashiCorp Learn</a> for technical walkthroughs on all of our products.</p>","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"d427183f7228a5e11c5121f11349a25d23a615b1f2932ab597534e9498bc4d1d","category":"Tech"}