{"title":"IL MIGLIORE. Marco Pantani (Documentary). Review.","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/il-migliore-marco-pantani-documentary-review","date":1634317472000,"content":"\n      <p><span>On July 27, 1998, I was 12 years old. I was in Les Deux Alpes, France, training on the glacier with my ski club for a week.</span></p>\n<p><span>We were skiing every morning, while in the afternoon, we did athletic training. But not that day. That day, despite heavy storms (</span><em><span>les orages</span></em><span>), the coaches took us to watch the fifteenth stage of the Tour de France (Grenoble - Les Deux Alpes, 189 km).</span></p>\n<p><span>By around 5 pm, I was at the finish line with some friends. We followed the stage on the big screen and were among the first to see him arrive. The Mercatone Uno's yellow and green outfit appeared suddenly – a mirage emerging from the fog.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/marco-pantani-rise-and-fall\"><em><strong>Related – Marco Pantani: Rise and Fall</strong></em></a></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_17_1024x1024.png?v=1634307365\" /><em>A photograph of Pantani in the Briançon - Les Deux Alpes stage. Photo: IL MIGLIORE. Marco Pantani. Okta Film.</em></p>\n<p>I still remember his weary smile, the bald steaming head, and the pronounced veins on his temples. He leaned over the handlebars to catch his breath. I was so close that I gave him a pat on the shoulder, congratulating him: \"Bravo, Marco!\" As if we were old buddies.</p>\n<p>He stood up for a moment, with that weary smile still painted on his face. I like to think that he heard my words and that he smiled at that too. But who knows.</p>\n<p>Then, just as he had arrived, he disappeared. A yellow and green dot, a magical mirage, vanishing back into the fog. I never saw him in person again. And before those 10 seconds in Les Deux Alpes, I had never met him.</p>\n<p>But he was one of my sports heroes, and after touching his shoulder, I didn't wash my hand for a whole week.</p>\n<p>This was – and in part still is – the magnetic and irrepressible force of Marco Pantani.</p>\n<p><span>The latest documentary o</span>n the Pirate (Il Migliore. Marco Pantani. Directed by Paolo Santolini, produced by Okta Film with Rai Cinema, in collaboration with the Marco Pantani Foundation and distributed to cinemas by Nexo Digital di, distributed by cc) describes – in a calm, soft way – why Pantani struck where others did not: at the heart.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/products/pantani-art-print-jakob-sorenson\">Buy the cover photo to this article, by Jakob Kristian Sørenson, as a print</a></strong></em></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_03_1024x1024.png?v=1634307001\" /><em>Pantani in his first youth competitions. Photo: IL MIGLIORE. Marco Pantani. Okta Film.</em></p>\n<p>Through unpublished images and intimate conversations with family and friends, we access a side to the man we usually are not accustomed to. Santolini's approach to Pantani's history is unique. He's also from Romagna, and his intent was to look at the social and cultural universe where Pantani grew up. And thanks to this angle, we see a Pantani that perhaps we did not know before.</p>\n<p>His friend Moreno Lotti (Jumbo) describes him as \"a charismatic patacca\" (slang which means something like a loser). He was a quiet person, a bit \"dumb,\" he says, but able to transform himself and those next to him.</p>\n<p>Marco Pantani – the one who transformed himself – was an atavistic force, a classical hero who touched the deepest chords of the human soul. He was Dionysus fighting Apollo.</p>\n<p><span>Then there was Marco Pantani, the </span><em><span>loser</span></em><span>. Santolini mostly describes this Pantani. The one who loved </span><span>sausage and onion </span><em><span>piadina</span></em><span> wraps – and </span>ones with Nutella too. This Pantani was even afraid to introduce his girlfriend Christina – a Danish club dancer who dressed as a diver during her shows – to his mother because she had dyed hair.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_01_1024x1024.png?v=1634307126\" /><em>Marco Pantani as a child, still with a thick head of hair. Photo: IL MIGLIORE. Marco Pantani. Okta Film.</em></p>\n<p>Pino Roncucci, his mentor and sports director when he was still an amateur at the Giacobazzi, describes him as a \"loser in the true sense of the word.\" And in the sense that something bad always happened to him. The only years, says Roncucci, in which Pantani's preparation had been successful and without incident were 1992 (when he won the Giro amateurs with Giacobazzi) and 1998 when he won the Giro and the Tour.</p>\n<p><span>Pantani </span><em><span>the loser </span></em><span>loved night walks during the cold winters in Cesenatico, when there was no-one in the streets of the Romagna town. He loved hunting, and he loved being with the friends he grew up with.</span></p>\n<p>Of humble origins (\"I'm not a daddy's son,\" he says at one point in the documentary), Pantani struggled to find success and had overcome serious injuries before becoming a champion. When he was expelled from the Giro in 1999 for high hematocrit values, he saw his personal and family struggles – those sacrifices – muddied and ruined forever. \"I believe in values, I believe in men, and therefore being hurt in the feelings is more important than being hurt in the body,\" he told the press shortly after the episodes of Madonna di Campiglio. He decided to hide from the public, and his friends, and strayed onto a path from which he never emerged again.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_13_1024x1024.png?v=1634307240\" /><em>The statue of Pantani in Cesenatico, on a snowy day. Photo: IL MIGLIORE. Marco Pantani. Okta Film.</em></p>\n<p>The Pantani who beat Armstrong at the 2000 Tour (first on the Ventoux, and then in Courchevel), says his former spokesman and friend Andrea Agostini, was just 75% of Pantani. But, unfortunately, the real Pantani – the Dionysus of his best years – disappeared in Madonna di Campiglio.</p>\n<p>\"In Campiglio there was no Madonna. They cheated me,\" Pantani said. He also wrote this sentence on the walls of his bedroom. Just to remember what happened.</p>\n<p>On several occasions, in Santolini's documentary, it is pointed out that the truth about Pantani has not yet been written.</p>\n<p>Did Marco Pantani dope? Was the Mafia really behind the hematocrit values that decreed the end of the legendary Pantani?</p>\n<p>Despite countless inquiries that have been opened, closed, reopened, and then closed again, these are questions to which we may never have answers.</p>\n<p>However, Pantani's evocative force will remain intact in the future too.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_16_1024x1024.png?v=1634307566\" /><em>Another photo of Pantani as a young man taken from Santolini's documentary. Photo: IL MIGLIORE. Marco Pantani. Okta Film.</em></p>\n<p>And the proof of that is that even in a slow documentary like IL MIGLIORE, when images of Pantani attacking appear, we still feel that instinct to jump from our sofa to cheer the Pirate on.</p>\n<p>When we look at Pantani's exploits, it's difficult to escape a sense of nostalgia and helplessness. Nostalgia for a time when cycling had perhaps more problems, but maybe more personality. And impotence because the desire remains to rewind the tape to that June 5, 1999, in Madonna di Campiglio and leave Pantani free to ride.</p>\n\n<p><span>Who knows where he would have arrived. Who knows what he would have done. Who knows if he heard me when I yelled, \"Bravo Marco!\"</span></p>\n<p>Who knows, who knows, who knows ...<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_07_1024x1024.png?v=1634307673\" /></p>\n\n<p>IL MIGLIORE. Marco Pantani will be in Italian cinemas only on 18, 19 and 20 October for the Pantani Days. If you happen to be in Italy then, you can find the cinema closest to you that will be showing it <a href=\"https://www.nexodigital.it/il-migliore-marco-pantani/\" target=\"_blank\">here</a>.</p>\n<p><em>IL MIGLIORE. MARCO PANTANI, produced by Okta Film with Rai Cinema, in collaboration with the Marco Pantani Foundation and with the participation of Stregonia, Capelletti-Ehlers and the Friuli Venezia Giulia Audiovisual Fund, is distributed to the cinema by Nexo Digital in collaboration with the Media Partners Radio DEEJAY and MYmovies.it.</em></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IL_MIGLIORE_Marco_Pantani_Okta_Film_08_1024x1024.png?v=1634307723\" /></span></p>\n\n<p><span><em><strong><a href=\"https://www.rouleur.cc/products/pantani-art-print-jakob-sorenson\">Buy the cover photo to this article, by Jakob Kristian Sørenson, as a print</a></strong></em></span></p>\n\n<div></div>\n\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d42adbf9a8fd9a69d4dad3ee87372943439e6d68b634f19e5a6a24816ae9fbf6","category":"Cycling"}