{"title":"Management of Vulnerable Plaques to Achieve Complete Revascularization with Plant-Based Diets (PBDs)","link":"https://www.preprints.org/manuscript/202404.1467/v1","date":1713864120000,"content":"Coronary heart disease (CHD) has become a prevalent issue in Indonesia, resulting in a majority of fatalities and illnesses. The most recent guidelines in the United States for managing patients with chronic coronary syndrome (CCS) have undergone significant changes, with the recommendation for conducting percutaneous coronary intervention (PCI) strictly limited to patients who continue to experience symptoms despite receiving optimal medical treatment (OMT). However, adopting this approach may lead to increased morbidity and mortality due to the presence of vulnerable plaque. Vulnerable plaque is characterized by minimal obstruction during coronary angiography (40-70%) and may not produce ischemia during physiological studies. Identifying vulnerable plaques can be accomplished through several methods, among which computed tomography coronary angiography (CTCA) is the most cost-effective approach. Recently, experts have employed different techniques, either with stents or drug-coated balloons, to manage vulnerable plaques, showing the methods to be safe and effective. The other challenge faced by patients with CCS is the possibility of achieving complete revascularization (CR) to reduce the likelihood of future major adverse cardiac events (MACE) and mortality. Both approaches, identifying and intervening in the vulnerable plaque, are difficult to perform in developing countries due to the limited budget. Studies have shown that plant-based diets (PBD) can reverse atherosclerotic plaque and stabilize vulnerable plaque, possibly leading to CR. PBD is an affordable and effective approach, but it requires healthcare providers skilled in educating and implementing this dietary approach with their patients. Large-scale randomized controlled trials in PBD, specifically aimed at addressing the vulnerable plaque and achieving CR, are necessary before implementing the PBD intervention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d43246094b8a7c777ea4f0f1304b790d58c0cd79822bf6276bb21d13d43d2c13","category":"Interdisciplinary"}