{"title":"Impacts of the Early Eocene Climatic Optimum (EECO, ∼53‐49 Ma) on Planktic Foraminiferal Resilience","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004820?af=R","date":1723120446000,"content":"<h2>Abstract</h2>\n<p>The Early Eocene Climatic Optimum (EECO; ∼53 and 49 Ma) records the warmest long-term global average temperature and highest CO<sub>2</sub> levels of the Cenozoic. Multiple transient global warming events occur within the EECO, offering an opportunity to investigate the impact of extreme heat on planktic foraminifera. Pacific Ocean Drilling Program (ODP) Sites 1209–1210 (Shatsky Rise) provide an excellent age model and stable isotope records to link biotic data with the carbon cycle across the interval here analyzed (55.6 and 49.93 Ma). We combine carbonate production proxies with changes in planktic foraminiferal assemblages and test-size. Our data show that during the EECO planktic foraminiferal assemblages were permanently modified, besides transient changes. At the EECO onset, abundance of the genera <i>Morozovella</i> and <i>Chiloguembelina</i> decreased at 53.28 and 52.85 Ma, respectively, confirming published Atlantic Ocean data and thus the global decline of these genera. Given the dominance and large size of <i>Morozovella</i> in early Eocene tropical assemblages, we postulated that this change would have reduced foraminiferal production and the assemblage test-size. In contrast, we record a slight increase in test-size within assemblages, controlled by the now dominant genus, <i>Acarinina</i>. The decrease in coarse fraction weight, partially controlled by dissolution, during times of stable foraminferal mass accumulation rate indicates enhanced calcareous nannofossil productivity reducing the foraminiferal contribution to the sediment. During the EECO, despite the decrease in abundance of some genera, species replacement within communities highlights the resilience of pelagic carbonate production, emphasizing the critical role of planktic foraminifera in regulating the marine food web and global carbon cycling.</p>","author":"Giulia Filippi, \nRuby Barrett, \nDaniela N. Schmidt, \nRoberta D'Onofrio, \nThomas Westerhold, \nValentina Brombin, \nValeria Luciani","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"d43454100584674f5f94d64565dc2b950119b9afe018a36cdb190d0b0a097897","category":"Environment"}