{"title":"The fierce battle for polka dots continues to deliver at the Tour de France","link":"https://cyclingtips.com/2021/07/the-fierce-battle-for-polka-dots-continues-to-deliver-at-the-tour-de-france/","date":1626040145000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/poels1-650x433.jpg\" /></div><h2>The fierce battle for polka dots continues to deliver at the Tour de France</h2><p>\n</p><p>The battle for the most hotly contested jersey at the Tour de France raged on as the peloton rode into Andorra on Sunday, and the final week of the race should offer plenty of entertainment to come, too. And no, we’re not talking about the battle for yellow (or white, or green).</p>\n\n\n\n<p>It is Wout Poels (Bahrain Victorious), not Tadej Pogačar (UAE Team Emirates) or Mark Cavendish (Deceuninck-QuickStep), who sits atop the standings for the must-watch battle at the 2021 Tour de France right now: the thrill-ride that has been the polka dot jersey competition.</p>\n\n\n\n<p>Sure, Pogačar <em>could</em> lose his more-than-five-minute lead in the mountains. But barring a crash or a major meltdown, he has a pretty firm grip on yellow, and his rivals seem to be thinking a lot about second and third place right now instead the top step on the final podium. Cavendish, meanwhile, will have to make the time cut on some tough stages and hold off the more versatile types who can go for a few more intermediate sprints – but his lead is pretty solid as well, and is it really all that entertaining waiting for the gruppetto to arrive in the Pyrenees?</p>\n\n\n\n<p>Meanwhile, Poels, Mike Woods (Israel Start-Up Nation), Nairo Quintana (Arkéa-Samsic), and Wout van Aert (Jumbo-Visma) are locked in a fierce battle for mountains points that is guaranteed to stay fierce through the next several days, and it’s possible that few other names could get into the mix in the week ahead.</p>\n\n\n\n<p>The mountains classification is the one to watch right now at the 2021 Tour.</p>\n\n\n\n<p>If you haven’t been paying close attention thus far, here’s where things stand as we head into the second rest day: Poels leads the classification with 74 points after taking over the polka dots from Woods on stage 15, where Poels was able to nab the maximum of 10 points on the Cat 1 Montée de Mont-Louis, and then pick up more points with high finishes atop the next three climbs. Woods has dropped to second at 66 points after wearing the jersey on Sunday. Quintana, who scored maximum points at the Tour’s highest elevation on the Port D’Envalira climb on stage 15, is currently in third with 64 points, and Van Aert has the same points total after picking points on some of the earlier climbs on the day. Bauke Mollema (Trek-Segafredo) is in fifth at 41 points.</p>\n\n\n\n<p>Often, most of the action in the KOM battle at the Tour de France takes place up the road, as the opportunists crest mountain summits well ahead of the peloton. Pogačar’s brilliant and aggressive performance at the 2020 Tour saw him take both the polka dots and the yellow jersey, but the pendulum has swung back in favor of the escapees this year with the UAE team and the other GC-focused squads content to allow the breaks to stay clear.</p>\n\n\n\n<p>As such, all of the main polka dot contenders have worked hard trying to get into breaks over the past few days, and in general, they’ve had success. That has given those of us watching the race a chance to see big names locking horns several times a day – even as the GC contenders behind them have been either unable or unwilling to shake things up on the steep gradients.</p>\n\n\n\n<p>That trend should continue in the coming days, with three of the last six stages offering major opportunities for mountain points.</p>\n\n\n\n<p>After Monday’s rest day, Tuesday’s stage 16 will be a chance for the polka dot hopefuls to go up the road again, with one Cat 1, two Cat 2s, and a Cat 4 climb on a profile that looks good for the break to stay clear. Stage 17 will throw two Cat 1s at the peloton before an hors categorie finale atop the Col du Portet, which will offer double points as a summit finish. Stage 18 will be the last big day for the polka dot jersey battle and a decisive one at that, with two Cat 4s before two hors categorie climbs, the Col du Tourmalet and then the summit finish at Luz Ardiden, which will again offer double points.</p>\n\n\n\n<p>There’s always a chance that the GC teams will put in the work in the final week to reel the escapees in, putting the mountains title in play for the actual top climbers in the race – but that’s not really the way things have gone so far, and that’s been a boon for anyone hoping for an entertaining battle. After all, the very best climbers in the race already get to battle for the yellow jersey most of the time, and it’s not always the most exciting showdown.</p>\n\n\n\n<p>When the riders who are not only strong climbers, but also <em>aggressive</em> ones, are in the mix for the mountains classification, every mountaintop counts. There are plenty to come in the last several stages of this race, so here’s hoping the battle for polka dots continues to rage on just as fiercely this coming week.</p>\n\n\n\n<p>“The opportunity is there. Hopefully the escapees get enough space,” Poels said after Sunday’s stage. “I feel good anyway. Normally my third week in a Grand Tour is good. Six more days to Paris. It sounds close, but it’s still far away.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/the-fierce-battle-for-polka-dots-continues-to-deliver-at-the-tour-de-france/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d43e19fee64d0ccb1c8b6dfa40b32232110fbe3e3ab76d20eb10a9c799d6550e","category":"Cycling"}