{"title":"Could UX Be The Key To Unlocking Web3 Mass Adoption?","link":"https://smashingmagazine.com/2023/04/ux-web3-mass-adoption/","date":1682436600000,"content":"<p>Let’s pretend you are interested in trying out Web3 (aka Blockchain or Crypto). You might have experience with various software tools from Web 2.0 and think Web3 is going to be as equally user-friendly, right?</p>\n<p>You get a blockchain wallet, and that’s your passport to everything in the space. Once you’ve got your wallet set up, you’re free to take advantage of blockchain apps. Well, that’s how it works in theory. The reality is far more complex and is enough to confuse even pretty technical people.</p>\n<p>So let’s say you start by getting a wallet. Which wallet? Well, there are hundreds to choose from, so just pick one you like the look of. Not that one, though; it doesn’t work with the blockchain you need it to.</p>\n<p>And when you set it up, make sure you keep a digital and physical copy of your 24-word seed phrase safe. Lose that, and someone could syphon all of the assets in the wallet.</p>\n<p>Set it up? Awesome. Now just head to the project you want to use and... Oh, wait. Before you can sync your wallet and log in, you need to add and switch to a different network. Done that? Perfect.</p>\n<p>Ok, now we’re ready to jump into the <strong>decentralized web</strong>! How long will a transaction take? I don’t know. It could be a few seconds, could be a few hours. It really depends on network congestion and what it is you’re looking to transfer.</p>\n<p>Once that transaction has gone through, make sure you get a different wallet — ideally a hardware wallet — to keep everything safe. Yeah, I know there are fees involved, but that’s the price of having full control of your own assets and data.</p>\n<p>Well done, you’ve actioned a single transaction in Web3! Give yourself a pat on the back because it’s anything but simple.</p>\n<p>This is, sadly, not an exaggeration. This is what we expect new users to Web3 to do to get set up with a new project or platform. Is it any wonder that most people find the space confusing and frustrating?</p>\n<p>I’ll soon come onto the issues in Web3 adoption and how we might be able to solve them. But first, let’s address the elephant in the room and speak briefly about what Web3 actually is.</p>\nWhat Exactly Is Web3 (And Why Should We Care)?\n<p>If we’re being blunt, Web3 is little more than a marketing term. Something brands in the space have conjured up to put a little distance between themselves and the negative public view of crypto.</p>\n<p>However, there is a difference between Web 2.0 and Web3. At a high level, Web3 brands are built on blockchain technology, which allows a more decentralized approach to their operation. These brands also tend to focus on <strong>transparency</strong>, <strong>security</strong>, and <strong>accessibility</strong>.</p>\n<p>In effect, the key benefits include:</p>\n<ul>\n<li>Better security (fewer single points of failure);</li>\n<li>Better interconnectivity and fewer controlling intermediaries.</li>\n</ul>\n<p>But what does that actually mean?</p>\n<p>Well, really, it’s about <strong>returning more control to the user and removing multiple intermediaries</strong>. In Web3, brands want users to control their owned assets and their data. They want to remove or limit the control of large, centralized entities.</p>\n<p>Users are at the mercy of these large centralized entities. If these entities decide to implement a rule change, fare increase, or even experience negative outcomes themselves, the end users have no say in the matter and are often the ones who suffer.</p>\n<p>Brands in the Web3 space are looking at how they can limit the amount of control centralized entities exert.</p>\n<p>I’ll use financial systems as a starting point to highlight this.</p>\n<p>If you want to set up a bank account, you often need to fill in an application and provide several forms of ID and information. Once you’re approved, you get an account.</p>\n<p>That account comes with certain rules and regulations which you must abide by. If the bank decides you’re not abiding by the rules, they’ll close your account. If the bank decides that you shouldn’t have the ability to send funds internationally, you can’t. If the bank decides to hike its interest rates and fees, you have to pay them.</p>\n<p>You are at their mercy because they own the infrastructure you need. It might not sound like an issue, and it’s not for the vast majority of people in Western nations. But access to a stable financial system can be a difficult thing for those in developing nations.</p>\n<p>Let’s also think about how something like an international transfer is processed. If you want to send money to another country (or even someone who uses a different bank), there’s a <a href=\"https://www.sciencedirect.com/science/article/pii/S2666285X21000923\">multi-step chain of approvals</a> and communications that needs to happen.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/1-correspondent-banking-model.png\" /></p>\n<p>Now, each of these steps comes with a fee and a delay. Meaning it can take more than a few days for your payment to process.</p>\n<p>With the decentralized nature of blockchain, though, you could <a href=\"https://www.ft.com/content/454be1c8-2577-11e5-9c4e-a775d2b173ca\">send funds directly to the recipient</a> without any intermediaries. That means fewer delays and zero chance a centralized entity within the system will decline the payment.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/2-embedding-distributed-ledger-technology-network-model.png\" /></p>\n<p>Now, let’s also talk briefly about the security of it all.</p>\n<p>In the image above, you can see that there is one centralized ledger in the traditional banking system. If that one centralized entity is compromised, either through a hack or some form of error, everything suffers.</p>\n<p>With blockchain tech, there’s a <strong>distributed ledger</strong>. If one of the “nodes” is attacked or fails, there are still multiple other copies that can be used to form backups and keep the system running.</p>\n<p>As blockchain works on consensus between all nodes, you’d need to simultaneously attack 51% of the nodes to assume control. Currently, on Ethereum, there are <a href=\"https://etherscan.io/nodetracker\">10,637</a> nodes across the globe.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/3-ethereum-nodes-top-countries.png\" /></p>\n<p>An attacker would have to assume control of 5425 nodes at the same time. And even then, there are precautions and methods to prevent ongoing damage. As such, it’s generally considered to be far more secure than centralized systems.</p>\n<p>All of the above might be focused on the financial. However, it’s true for any blockchain-based use case. From finance to data to the simple transference of ownership paperwork. It is more secure, more direct, and more easily controlled by the end user.</p>\n<p>Now, there are issues with things like energy consumption that are being addressed. However, when we’re just looking at onboarding new users, there’s one big problem with blockchain-based apps and Web3. The UX is generally terrible.</p>\nWhy UX Is Key To Unlocking Web3’s Potential\n<p>Let’s be blunt about this. Most people don’t care about the tech behind a service, nor do they want a convoluted, complex system to activate the most simple of actions.</p>\n<p><em>People want convenience.</em></p>\n<p>They want to quickly understand what a product does and how to achieve the benefit it offers. Great products attract users because they help people achieve their goals faster, easier, or cheaper than the existing method.</p>\n<p>And yet, it feels like most Web3 projects are created by engineers, for engineers. The complexity extends beyond the actual service and includes how these projects explain themselves. The self-help documentation is often full of technical jargon most will never understand.</p>\n<p>I mean, check out this paragraph from <a href=\"https://looksrare.org/\">LooksRare</a> (one of the <a href=\"https://decentreviews.co/best/nft-marketplaces\">most popular NFT marketplaces</a>). It’s a simple statement about what they do.</p>\n<blockquote>“LooksRare’s smart contracts are custom-built within a modular system that enables new features to be rolled out over time — without compromising security — thanks to standardized signatures that clearly define the execution scope.”</blockquote>\n\n<p>I spend all day analyzing Web3 projects, and it takes me more than a second to decipher what they mean. Imagine trying to convince someone not in the space that they should take a chance on Web3 with the above. Right now, the only people truly involved in Web3 are those who have persisted through jargon-filled explanations and complex user journeys.</p>\n<p>If QWeb3 and blockchain technology ever have a hope of going mainstream, everything needs to be simplified. The <a href=\"https://www.smashingmagazine.com/2018/01/friction-ux-design-tool/\">friction to onboarding new users</a> needs to be reduced so that we can welcome those who aren’t technical. We need to make it so simple the generations that didn’t grow up with cell phones and video games can action a transaction. And that includes everything from the language used to the systems to onboard new users.</p>\n<p>Here are a few of the overarching elements that should be addressed.</p>\nCore Elements Of Better Web3 UX\n<p>I’ll get into detail on these a little later on. First, I want to outline what I believe to be the major, big-picture difficulties that need to be overcome in the space.</p>\n<h3>Clear Communication</h3>\n<p>Too many projects fall back on jargon-filled explanations. They sound fancy, but they also limit who understands what the project does. It’s common when new developments are made, as most of the documentation is made by highly technical people. The issue is it’s <strong>extremely limiting</strong>.</p>\n<p>Most people don’t care about how an L2 scaling solution helps improve the speed and efficiency of an underlying layer-1 blockchain without compromising cryptographic security. What they want is to quickly and safely send funds.</p>\n<p>One of the best pieces of advice I received when first starting as a copywriter was to imagine you’re explaining concepts to a group of young children. If you can do that, even the most tech-unsavvy people out there will quickly understand why they need your offer.</p>\n<p><a href=\"https://www.smashingmagazine.com/2022/03/easy-information-architecture/\">Clear answers to key questions</a> is critical to enabling your users to help themselves.</p>\n<p>There’s a prime example of this below. You might not need to go that simple, but it definitely shouldn’t be as complex as most people make it.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/4-coinbase-annual-users-graph.png\" /></p>\n<p>Most Web3 apps have a fraction of that.</p>\n<p>So the question is, what do these exchanges do differently? Well, they take the complexity out of cryptocurrency. Let’s look at <a href=\"https://www.coinbase.com/\">Coinbase’s</a> onboarding.</p>\n<p>To sign up, they’ve used a common Web 2.0 sign-up process. It’s just your name, email address, and password. People are familiar with this, and anyone who’s been on the internet for more than a day will likely have auto-fill add in these details in a few clicks.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/5-coinbase-sign-up-process.png\" /></p>\n<p>Once you’ve confirmed your email, you’re in the main dashboard. You’ll need to provide some details for the financial <em>know-your-customer (KYC)</em> checks, but then you’re ready to go. The whole thing takes maybe 2 minutes before you’re “interacting with the blockchain” and able to buy some cryptocurrency.</p>\n<p>And even that’s made easier. On the main dashboard, there’s a huge \"buy\" button that brings up a modal where you simply add how much of the cryptocurrency you want to buy.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/6-coinbase-purchase-process.png\" /></p>\n<p>A few clicks later, you own some cryptocurrency. If you remove the approval of your KYC info, the whole process could be done in around 5 minutes. Likely the same time it would take you to process a bank transfer of some kind.</p>\n<p>And notice how there was no mention of or need to set up:</p>\n<ul>\n<li>Blockchain,</li>\n<li>Crypto wallets,</li>\n<li>Seed phrases.</li>\n</ul>\n<p>The onboarding and usage mirror that of a familiar Web 2.0 system. The wallets and blockchain elements are all hidden from the user. This is how most tech-heavy businesses operate.</p>\n<p><strong>No one needs to see or know how the sausage is made.</strong> You don’t see YouTube going to great efforts to talk about how videos are stored and secured on their servers and then streamed to millions of devices. People simply click “upload” and then are given a link to share so others can watch it.</p>\n<p>It’s so simple a child can do it. And it’s that level of simplicity blockchain-based brands should be aiming for. Crypto exchanges do this so well, and yet few other Web3 brands are mimicking their successful approach.</p>\n<p>So, if you’re a UX professional and want to get involved in Web3, what are the primary opportunities you could explore as a new revenue stream?</p>\nUX Opportunities For Entrepreneurs And Designers In Web3\n<p>If I had to sum it up, the biggest opportunities in Web3 are in making everything more accessible for non-technical people. Think of how difficult it would have been to set up a website before popular website-building platforms and companies.</p>\n<p>No one wants to code their own CMS and figure out how to host it on a domain. It’s way too complex for most people. As soon as companies like Cloudflare and <a href=\"https://www.smashingmagazine.com/2020/01/complete-guide-wordpress-multisite/\">WordPress</a> came along, the potential for people to set up their own digital businesses exploded.</p>\n<p>We need the same level of simplicity UX in Web3.</p>\n<p>The person or team who solves any of the below issues will be on to a winner. They’ll have something the industry desperately needs for its growth, and I wouldn’t be surprised if great brands line up at the door of those offering these solutions. Here are a few of the biggest opportunities as I see them.</p>\n<p>Now, I’ll preface this by saying there is <em>a lot</em> to be improved in Web3. Too much to cover in detail in this piece. So for the sake of brevity, I’ve segmented into two primary segments. First up is the issue with engineering.</p>\n<h3>Engineering Issues In Web3</h3>\n<p>I’d argue that engineering issues are more important for Web3 adoption. You can improve the marketing and general UI as much as you like, but if the products don’t work as intended or have huge flaws that prevent people from getting the best from them, it’s all in vain.</p>\n<p>One of the major issues with the functionality of Web3 engagement is with wallets, more specifically, wallet recovery.</p>\n<h4>Wallet Recovery Without Compromising Security</h4>\n<p>This is a big one, in my opinion. As mentioned above, <a href=\"https://decentreviews.co/best/crypto-wallets\">blockchain wallets</a> are key to engagement with Web3 brands. They’re incredibly secure. So secure that if you lose that 12 or 24-word recovery seed phrase, you lose access to your wallet and its contents, probably forever.</p>\n<p>It’s a huge risk. Some people take to writing their seed phrase on a piece of paper which obviously compromises security in more ways than one.</p>\n<p>So what’s the solution? How can we keep that wallet’s security without making it so unforgiving that people are locked out of their own identity and assets?</p>\n<p>One of the proposed solutions is to use what Vitalik Buterin calls a <a href=\"https://vitalik.ca/general/2021/01/11/recovery.html\">social recovery wallet</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/7-social-recovery-wallet.jpg\" /></p>\n<p>In short, you add a couple of trusted guardians to your wallet. If you lose access, you ask them to authorise its transfer to a new address. It’s not perfect, but it’s, unfortunately, the best option we have right now.</p>\n<p>This removes that single point of failure and turns the whole “I lost my seed phrase” from a complete loss into a slight hassle of asking friends or family to help you transfer to a new address.</p>\n<p>If anyone out there can figure out how to create a better solution, they’ll be welcomed with open arms in Web3.</p>\n<p><strong>Potential fixes:</strong></p>\n<ul>\n<li><strong>Social recovery systems</strong> as mentioned above.</li>\n<li><strong>Backup seed phrase to the cloud.</strong> (There are security risks here.) Potentially using a <a href=\"https://decentreviews.co/best/decentralized-storage\">decentralized storage service</a> to segment the seed phrase and store those segments separately.</li>\n<li><strong>Using <a href=\"https://inpher.io/technology/what-is-secure-multiparty-computation/\">multi-party computation</a> to secure wallets.</strong> In this method, the private key could be split between a cloud server and a device like your phone. Both parties have to be available to access the wallet. Kind of like <a href=\"https://www.smashingmagazine.com/2022/08/authentication-ux-design-guidelines/\">2FA authentication</a>.</li>\n</ul>\n<h4>Interoperability Between Different Blockchains</h4>\n<p>Blockchains are, unfortunately, siloed. Ethereum is different from Solana, and they don’t exactly work well together yet. If you want to work across chains, you need to work through multiple front-ends — blockchain bridges — and submit a lot of different bridge transactions. All of which are costly and cumbersome.</p>\n<p>This is what the ecosystem <a href=\"https://medium.com/1kxnetwork/blockchain-bridges-5db6afac44f8\">looks like</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/8-blockchain-ecosystem.png\" /></p>\n<p>It’s a real pain to navigate. Most people will try to move assets and information across chains through centralized exchanges or individual cross-chain bridges, which is, at best, highly inefficient.</p>\n<p>What’s needed is a method for assets and chains to interact with one another more seamlessly — for the end user to have a single dashboard that could pull details or assets from Chain 1 and use them on Chain 2 without the user having to do any manual moving of currencies or assets through a third-party service.</p>\n<p>It’s a big problem, but the unlocking of this not only hugely improves UX but should foster greater innovation and growth in the sector as a whole.</p>\n<p><strong>Potential fixes:</strong></p>\n<ul>\n<li>There is sadly no real fix for this. There will continue to be new chains popping up. The best solution is for people to work on <strong>interoperability protocols</strong> that allow users to interact with two chains seamlessly.</li>\n</ul>\n<h4>Financial Off-ramps</h4>\n<p>One of the most talked about uses of blockchain technology is cryptocurrency. The big usability issue with crypto is that few places outside of Web3-specific services accept it as payment, and it’s peculiarly difficult to change back into fiat currency.</p>\n<p>Imagine you have $1000 of Ethereum in your wallet and need $800 USD to pay a bill. If you wanted to turn that Ethereum into USD, you’d have to do something like the below:</p>\n<ol>\n<li>Log into a crypto exchange;</li>\n<li>Sync your wallet;</li>\n<li>Add your funds from your wallet to the Exchange’s wallet;</li>\n<li>Exchange your ETH for USD for a transfer fee;</li>\n<li>Withdraw the USD to your bank for yet another fee.</li>\n</ol>\n<p>You’ll spend a good deal on fees, and the process takes longer than it should. There are some cool tools out there that are working to make the financial off-ramps simpler, but we’re still in the early days.</p>\n<p>The faster and easier this process can be made, the more likely it is that crypto payments will be more popular. And for the person who solves this they have a great revenue-generating business on their hands.</p>\n<p>I mean, think of how amazing Stripe has been for digital payments. Now add digital assets into the mix, and you can see the potential.</p>\n<p><strong>Potential fixes:</strong></p>\n<ul>\n<li>Creation of a <strong>crypto exchange-like service within an app</strong> that converts your crypto to select fiat currencies for you. You could even white-label some of the crypto exchange’s institutional services and do this for the user for a small fee.</li>\n<li><strong>Integration with various existing payment solutions.</strong> Apple Pay lets users use their Coinbase debit card for payments. You can also leverage a brand like MoonPay to enable easier on and off-ramps in the app. There’s a lot of disruption potential here. There are a handful of companies doing this, proving it is viable, but not enough yet to be competitive.</li>\n</ul>\n<h3>Communication And Education Issues In Web3</h3>\n<p>In addition to the basic functionality and ease of use issues with Web3 projects, we also have the marketing side of things.</p>\n<p>Even if Web3 brands simplify the processes, they still talk about them in highly technical terms and make little to no effort to make it understandable to those not in the space. Below are a few of these issues and potential fixes in detail.</p>\n<h4>Marketing And Communications</h4>\n<p>Right now, Web3 is by engineers and for engineers. People are working on use cases that can really help non-technical people with their day-to-day lives, but they’re not succinctly communicating how it can help them.</p>\n<p>And so, these great tools are being overlooked by the people they’re built to help.</p>\n<p>One of the biggest opportunities I see is in better marketing and communications.</p>\n<p>We, of course, need copy that explains what a product does. But more so, we need <a href=\"https://www.smashingmagazine.com/2021/04/content-fundamental-part-web-design-process/\">good UX copywriters and content producers</a> to create information and education on how to simply set up the service and get the most from it. Without this, you might be able to attract new users, but they won’t get the most from your tool or stick around for a long time.</p>\n<p>Make it simple, remove the jargon, and ensure even complete non-technical newbies understand how to achieve the key benefit with minimal effort. Manage to do this, and the project should succeed.</p>\n<p><strong>Potential fixes:</strong></p>\n<ul>\n<li>Hire technical writers from customer-facing, but <strong>highlight technical, Web 2.0 brands to help simplify messaging</strong>.</li>\n<li><strong>Make use of existing communication channels.</strong> A lot of Web3 brands don’t offer a bridge between something like email and Discord, meaning only those already in the space get the detail they need to onboard effectively.</li>\n</ul>\n<h4>Simplifying Transactions</h4>\n<p>There are two major problems with blockchain transactions right now:</p>\n<ol>\n<li>Addresses,</li>\n<li>The way transactions are processed.</li>\n</ol>\n<p>Let’s first look at addresses.</p>\n<p>My public Ethereum address is 0xde590D7ba25Ae2eCEAbbde7546D4Cbe94cc66961.</p>\n<p>That’s not a typo. If I want someone to send me something, I need to give them that address. And they need to type it into the recipient field when sending funds without a mistake.</p>\n<p>If either one of us messes it up, the transaction doesn’t fail, but the assets being sent are lost. Yeah, that’s right. You don’t get a nice warning message. The funds are sent to an address that doesn’t exist, and you’ve no way of easily getting them back.</p>\n<p>These long hashes for addresses are also terrible when it comes to figuring out who sent what and when. Here’s a look at the <a href=\"https://etherscan.io/\">Etherscan</a> run down for my address:</p>\n<p><img src=\"https://files.smashing.media/articles/ux-web3-mass-adoption/9-etherscan-address-transaction-search.png\" /></p>\n<p>Finding a particular transaction in that mess is insanely difficult. We need a way to simplify the way people refer and identify accounts and how the transactions are listed. The long-form cryptographic hashes are so user-unfriendly it’s unreal. It’s honestly amazing they’ve managed to get this far.</p>\n<p>One of the tools aiming to help with this is <a href=\"https://ens.domains/\">ENS Domains</a>. Much like buying a website domain, you buy an ENS domain, and that shows up instead of the long hash.</p>\n<p>In the above, I had that insanely long hash as my address. With an ENSDomain, someone doesn’t need that as they can find my account by searching for <em>PJBoyle.eth</em>. That makes it much easier to find and send me assets or see how I’m engaging on the chain. But it’s only for Ethereum, which is why we also need that interoperability I mentioned earlier.</p>\n<p>The second issue is in the way transactions are processed.</p>\n<p>A lot of dApps need you to sign the agreement at each and every stage. Basically, to action one thing on the chain, you might have to stop the process in order to click “agree” multiple times. It’s a longer, more inefficient way of doing things and requires too much action from the user.</p>\n<p>A solution that rolls all of these actions into one for a single-user authentication could improve the UX. Here’s an example diagram:</p>\n<p></p><blockquote><p>above is how a typical Defi app works today<br /><br />below is how I think it should work<br /><br />first, complete all actions (on simulated data if necessary), then batch-sign everything. more than one signature per interaction should be an anti-pattern <a href=\"https://t.co/wQ8aSv0kNQ\">pic.twitter.com/wQ8aSv0kNQ</a></p>— Hasu⚡️🤖 (@hasufl) <a href=\"https://twitter.com/hasufl/status/1538793436085637121?ref_src=twsrc%5Etfw\">June 20, 2022</a></blockquote> <p></p>\n<p>Both of these improvements would make transacting so much easier and simpler, which should enable more people to get into Web3.</p>\n<p><strong>Potential fixes:</strong></p>\n<ul>\n<li>Roll out more <strong>services like ENS Domains</strong>, where abstract addresses are transformed into easily memorable phrases.</li>\n<li><strong>Reduce the load on the user.</strong> Don’t make them triple-check everything. Reduce the number of steps they have to take by rolling all confirmations into one approval.</li>\n</ul>\nToday’s Problems Are Tomorrow’s Opportunities\n<p>All of these problems are really because of the early nature of the tech.</p>\n<p>None of the above will be the end of Web3, but for the people or teams who are able to solve them and make the entire ecosystem more user-friendly, these problems could be the catalyst that grows tomorrow’s most impactful businesses.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"d443e6fa25702bf9e9d9536e5925260367f76f889b6177d9ac4bc245a557ac77","category":"Tech"}