{"title":"Evidence of Subsurface Control on the Coevolution of Hillslope Morphology and Runoff Generation","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037301?af=R","date":1728476434000,"content":"<h2>Abstract</h2>\n<p>Topography is a key control on runoff generation, as topographic slope affects hydraulic gradients and curvature affects water flow paths. Simultaneously, runoff generation shapes topography through erosion, affecting landscape morphology over long timescales. Previous modeling efforts suggest that subsurface hydrological properties, relative to climate, are key mediators of this relationship. Specifically, when subsurface transmissivity and water storage capacity are low, (a) saturated areas and storm runoff should be larger and more variable, and (b) hillslopes shorter and lower relief, assuming other geomorphic factors are held constant. However, it remains uncertain whether subsurface properties can exert such strong controls on emergent properties in real landscapes. We compared emergent hydrological function and topography in two watersheds with very similar climatic and tectonic history, but very different subsurface properties due to contrasting bedrock lithology. We found that hillslopes were systematically shorter and saturated areas more dynamic at the lower transmissivity site. To test whether these features could be the result of coevolution between topography, hydrological function, and subsurface properties, we estimated all parameters of a coupled groundwater-landscape evolution model for each site. Limitations were revealed in the model's ability to reproduce aspects of morphology and hydrologic behavior, however, model results suggested differences in hillslope length and variably saturated area between the sites could be explained by differences in subsurface properties, and not by differences in geomorphic process rates alone. This work demonstrates one way subsurface hydrology can profoundly affect landscape evolution.</p>","author":"David G. Litwin, \nCiaran J. Harman","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"d44aa544b9c7c640365a230a3c4bba59eb6686b85ad2d6f8be99e614fd6809bf","category":"Environment"}