{"title":"Multiscale Interactions Between Local, Short and Long-term Spatio-Temporal Mechanisms And Their Impact on California Wildfire Dynamics","link":"https://www.preprints.org/manuscript/202405.2126/v1","date":1717151391000,"content":"California has experienced a surge in wildfires, prompting research into contributing factors, including weather and climate conditions. This study investigates the complex, multiscale interactions between large-scale climate patterns, such as the Boreal Summer Intraseasonal Oscillation (BSISO), El Niño Southern Oscillation (ENSO), and the Pacific Decadal Oscillation (PDO), and their influence on moisture and temperature fluctuations, and wildfire dynamics in California. The combined impacts of PDO and BSISO on intraseasonal fire weather changes, the interplay between Fire Weather Index (FWI), relative humidity, vapor pressure deficit (VPD), and temperature in assessing wildfire risks, and geographical variations in the relationship between FWI and climatic factors within California are examined. The study employs a multi-pronged approach, analyzing wildfire frequency and burned areas alongside climate patterns and atmospheric conditions. Findings reveal significant variability in wildfire activity across different climate conditions, with heightened risks during specific BSISO phases, La-Niña, and cool PDO. The influence of BSISO varies depending on its interaction with PDO. Temperature, relative humidity, and VPD show strong predictive significance for wildfire risks, with significant relationships between FWI and temperature in elevated regions (correlation, r &amp;gt; 0.7, p ≤ 0.05) and FWI and relative humidity along the Sierra Nevada Mountains (r ≤ -0.7, p ≤ 0.05).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d44abf7b4252407ac44d0704a94ee0a0ec4b03ee0334b69e189b0316c4977e97","category":"Interdisciplinary"}