{"title":"Spotify on iOS to Bring Back In-App Purchases, Beta Code Suggests [Updated]","link":"https://www.macrumors.com/2023/12/07/spotify-on-ios-in-app-purchases/","date":1701956913000,"content":"Spotify appears to be bringing in-app payments back to its iOS app, based on code strings unearthed in the latest beta.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/08/General-Spotify-Feature.jpg\" width=\"2500\" height=\"1407\" />\r<br />\n<em>MacRumors</em> contributor Aaron Perris discovered the new code references to an in-app payment system, including an IAP checkout screen and purchase retry panels for failed purchases.\r<br />\n\r<br />\nIt's not clear what the IAP references relate to, but the fact that they are included is curious in itself. Spotify has not allowed customers to sign up for a Spotify Premium subscription through the ‌<a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>‌ for the last seven years.\r<br />\n\r<br />\nThere is no mechanism for subscribing to Spotify through the Spotify app, as Spotify has restricted signups to its website in order to avoid paying Apple's fees. \"You can't upgrade to Premium in the app,\" reads Spotify's \"Premium\" section in its iOS app. \"We know, it's not ideal.\" \r<br />\n\r<br />\nOver the years, Apple and Spotify have had a long running dispute over Apple's ‌App Store‌ policies, with multiple public conflicts over app and subscription fees and app rejections due to Spotify's attempts to skirt the up to 30 percent cut that Apple takes from purchases.\r<br />\n\r<br />\nIn comments made in <a href=\"https://www.macrumors.com/2022/11/30/facebook-spotify-app-store-criticism/\">November 2022</a>, Spotify CEO Daniel Ek accused Apple of giving developers \"the illusion of control,\" and said that the ‌‌App Store‌‌ is a \"threat to the future of the internet\" that denies consumers choice.\r<br />\n\r<br />\nEk also clashed with Apple over Spotify's <a href=\"https://www.macrumors.com/2022/10/25/spotify-audio-book-app-update-rejected-apple/\">audiobooks feature</a>. Apple in 2022 rejected Spotify's audiobook update several times and ultimately did not allow Spotify to direct users to purchase audiobooks through an in-app email signup button.\r<br />\n\r<br />\nThings are different over on Android devices. Since November 2020, Spotify has been be able to bill Android users directly in the Google Play version of Spotify without needing to go through the Google Play billing system. \r<br />\n\r<br />\nThis is because Spotify uses Google's \"<a href=\"https://support.google.com/googleplay/android-developer/answer/12570971\">User Choice Billing</a>,\" a feature that allows Android users to make purchases using the payment option they prefer. User Choice Billing is essentially an alternative billing option for in-app purchases, and it comes with a reduced fee.\r<br />\n\r<br />\nApple offers no alternative billing from the ‌App Store‌. There are two exceptions, however, including South Korea and the Netherlands. Regulators in these countries have forced Apple to allow some apps to use third-party payment providers.\r<br />\n\r<br />\nWith Google adopting options for alternative billing and <a href=\"https://www.macrumors.com/2022/04/11/apple-faces-further-charges-in-eu-antitrust-case/\">continued regulatory pressure</a>, it is possible that Apple will also fold and expand the Dutch and South Korea processes to other countries and app types. However, whether the IAP references in Spotify's code relate to such a plan is unknown. Another possibility is that Spotify is preparing to increase the price of its subscriptions to account for Apple's commission on in-app purchases. \r<br />\n\r<br />\nEarlier this week, Spotify announced it will lay off about 1,500 employees, or 17% of its workforce, as the company seeks to downsize after a period of aggressive spending on podcasts and audiobooks. The latest round of cuts is the third in a year, with Spotify still facing annual financial losses amounting to hundreds of millions of dollars.\r<br />\n\r<br />\n<b>Update</b>: Spotify <a href=\"https://www.theverge.com/2023/12/7/23992162/spotify-denies-its-bringing-in-app-payments-back-to-ios\">tells <em>The Verge</em></a> it has \"no plans to switch IAP [in-app payments] on at the moment.\"<div>Tag: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/07/spotify-on-ios-in-app-purchases/\">Spotify on iOS to Bring Back In-App Purchases, Beta Code Suggests [Updated]</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-on-ios-to-bring-back-in-app-purchases-beta-code-suggests-updated.2413063/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d44b25817184d8962ce9c6055923e87f0a8d37407a720af33206223c4cf2e2f8","category":"Apple"}