{"title":"FTC v. Microsoft document leak outs detailed plans for mid-gen Xbox refresh","link":"https://arstechnica.com/?p=1969219","date":1695135529000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Screenshot-2023-09-19-at-10.25.58%E2%80%AFAM-800x449.jpeg\" alt=\"A leaked internal slide deck shows an unusually detailed preview of the Xbox Series X's proposed mid-generation refresh.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Screenshot-2023-09-19-at-10.25.58%E2%80%AFAM.jpeg\">Enlarge</a> <span>/</span> A leaked internal slide deck shows an unusually detailed preview of the Xbox Series X's proposed mid-generation refresh. (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US Federal Trade Commission's case against Microsoft didn't ultimately block the company's proposed $68.7 billion acquisition of Activision Blizzard, but leaked documents from the case are giving us an unusually detailed look at Microsoft's near-future plans for the Xbox. Court documents <a href=\"https://www.theverge.com/2023/9/19/23880111/microsoft-xbox-series-x-new-design-refresh\">published by the Verge</a> include a slide deck, complete with renders, that detail a mid-generation refresh of both Xbox Series consoles, plus a revamped controller with an updated design and new features.</p>\n<p>The biggest changes are coming to the Xbox Series X. Codenamed \"Brooklin,\" the updated console looks like a marriage of the original boxy monolith that is the Series X and the cylindrical design of <a href=\"https://arstechnica.com/gadgets/2017/04/apple-is-completely-redesigning-the-mac-pro-again/\">Apple's old \"trash can\" Mac Pro</a>. The console would be all-digital, ditching its optical drive but stepping up from 1TB to 2TB of internal storage. The port on the front changes from USB-A to USB-C, and the console would include Wi-Fi 6E and Bluetooth 5.2 upgrades.</p>\n<p>On the inside, the console's CPU and GPU would use a 6 nm manufacturing process instead of the current 7 nm process. Because the specs are changing, this means power consumption will go down, and the deck indicates that the console's power supply will be 15 percent smaller than the current Series X (that measures out to around 270 W, based on the 315 W capacity of the current power supply). An \"all-new southbridge\" will \"modernize IO,\" and a \"new low-power standby mode\" would use just 20 percent as much power as the current console's standby mode.</p></div><p><a href=\"https://arstechnica.com/?p=1969219#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969219&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d459e18a45dbb747eeb9f9e722a68cd4dde269513ce1ea4f47d331b04f112df2","category":"Tech"}