{"title":"Lizzie Deignan in at the deep end as she makes her racing return","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/lizzie-deignan-on-her-come-back-to-the-womens-peloton-and-ardennes-classics","date":1681855650000,"content":"\n      <p><span>First days are never easy. The butterflies' sensation fills your stomach and your mind is left wondering what the day will bring. It is especially hard for women who come back from maternity leave, having had their lives completely changed with a new addition to their family. But for Lizzie Deignan this is her second time returning to the professional peloton after maternity leave, and no amount of nerves is wavering her confidence in her abilities to be riding with the best. </span></p>\n<p><span>The Trek-Segafredo rider is perhaps the most notable proof that female cyclists can have children and still come back to winning races. After having her daughter Orla in 2018, Deignan returned the following season in 2019 and went on to win the Women’s Tour the same year. Before announcing she was expecting a second child in September 2022, Deignan had added an impressive list of victories next to her name, including </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\"><span>Paris-Roubaix</span></a><span> Femmes, Tour de Suisse Women’s, and </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\"><span>Liège-Bastogne-Liège</span></a><span> Femmes. </span></p>\n<p><span>Six months after giving birth to her son, Deignan made her 2023 debut at one of the toughest one-day races in the Women’s WorldTour calendar – La Flèche Wallonne – where she placed 88th overall. The British rider then followed this up a few days later at Liège-Bastogne-Liège Femmes, where she snuck up the rankings to 63rd. </span></p>\n<p><span>However, this was not the original plan for the 34-year-old. Instead, Deignan had planned to make her debut at Vuelta a España Femenina, which starts next week on Monday May 6. But her team had not had the best of luck in the Classics with injuries and illnesses, so Deignan was called into action two weeks earlier than expected. </span></p>\n<p><span>\"I did plan to have a bit longer to prepare for the Vuelta as I just thought that would have been a nicer, easier transition, but you know, professional sport isn’t about what is easier or nicer all the time,\" Deignan said ahead of Flèche Wallonne.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVosSWpix.com1994.jpg?v=1681839023\" alt=\"Lizzie Deignan celebrating her Paris-Roubaix win\" /><em>Lizzie Deignan was the first ever Paris-Roubaix Femmes winner </em></p>\n<p>\"At the end of the day, I am a teammate and it’s really important for me to support them. I could see that they were struggling in terms of filling the spots and it would be silly for me to be at home training, when actually I can get the same things I need from racing. It just means I am not going to be as comfortable in starting as I would have liked.\"</p>\n<p><span>Deignan proved to be a vital asset to the Trek-Segafredo team, putting in vulable work at both Flèche Wallonne and Liège-Bastogne-Liège. The latter closed the women’s Classics season with Deignan’s team-mate Elisa Longo Borghini placing second after going head-to-head with SD Worx rider Demi Vollering. This podium finish rounded off a strong Ardennes Classics for Trek-Segafredo, with the team's out-and-out climber Gaia Realini coming third at Flèche Wallonne and Shirin van Arooij placing third at Amstel Gold. </span></p>\n<h3><b>Making her comeback 2.0</b></h3>\n<p><span>Two years have passed since Deignan was last racing, and while age is just a number, returning to any form of sport is never going to be as easy, especially at such a high level. Deignan admitted that coming back for a second time round had been harder than before. Thankfully her Trek-Segafredo team is putting no pressure on her to achieve immediate results. </span></p>\n<p><span>\"Physically I’m good, training has gone really well and all my endurance numbers are really good. I feel really physically fit but in terms of that top end, race punch fitness, I don’t have that, and I cannot ignore that. You know, I haven’t made those steps in training yet to win a race.\"</span></p>\n<p><span>She added: \"In terms of my power and stuff, it has definitely taken a little bit longer this time around, and that has been difficult physically. I’m still a bit in the unknown in terms of where my form will be in comparison to the other riders.\"</span></p>\n<p><span>Testing her form at Flèche Wallonne and Liège-Bastogne-Liège, Deignan will now be aiming for the Vuelta. With two races under her belt and seven days of racing ahead of her, this may well be the momentum Diegnan is looking for to get her back to her winning ways. She is certainly a rider who has proven she can be in the running for the GC when she is at her peak, it’ll just be a question as to whether she’ll be at this stage after little time in the peloton.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20201004LBF1059-A.S.O._Thomas_Maheux.jpg?v=1681839101\" alt=\"Lizzie Deignan at Liege\" /><em>The British rider added the iconic Monument, Liège-Bastonge-Liège, to her palmarès in 2020</em></p>\n<h3><b>Keeping up with the peloton</b></h3>\n<p><span>Deignan has been keeping up with women’s racing while she has been on maternity leave, seeing for herself the dominance that SD Worx has had in the Classics. But she is not threatened by the Dutch team's winning streak and notes that there are still plenty of opportunities remaining for her and her team in the months to come. </span></p>\n<p><span>\"We know that Lotte Kopecky and Demi Vollering are exceptional athletes. But I think it's a long season, and it's really easy to quickly jump to conclusions about the team. </span></p>\n<p><span>\"And from an inside perspective, I know the challenges that some of our top riders have faced, like Elisa having Covid and still managing to pull off a third in </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\"><span>Flanders</span></a><span> is a pretty exceptional performance. I think it will get more competitive as the season goes on and things balance out a bit. But yeah, they've dominated the spring for sure. The season is long, we'll be back,\" she said. </span></p>\n<p><span>She’ll be lining up alongside teammates Amanda Spratt, Shirin van Anrooij and Gaia Realini at the Vuelta next week – a strong squad for Trek Segafredo – with all three riders having had exceptional starts to the 2023 season. Just being pipped to the post by SD Worx, Trek-Segafredo have secured five second-place finishes in the Classics, as well as a victory for Van Anrooij at Trofeo Alfredo Binda and another first for Longo Borghini at the inaugural <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">Women’s UAE Tour</a>. </span></p>\n<p><b>Thoughts for the future</b></p>\n<p><span>So much of Deignan’s life has changed since starting her career over 10 years ago, but her return to Trek-Segafredo has felt like nothing has changed. The 34-year-old is going into her first season back with an open mind as she doesn’t know exactly when she’ll return to her best form. She is aware the women’s peloton is getting more and more competitive, and believes it is a case of remaining realistic. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_6791_b8338bd1-8344-4c31-9563-2f63bfc691e7.jpg?v=1681839192\" alt=\"Lizzie Deignan in the Women's Tour\" /><em>Lizzie Deignan is the only rider to have won the Women's Tour more than once</em> </p>\n<p>\"I remember the last time I came back after maternity leave, I found that with each race there was a significant improvement in terms of race rhythm, feeling and sensation on the bike.\" Deignan said. </p>\n<p><span>Already looking ahead to the future of her career she added: “The things that motivate me are the World Championships and Olympics, it would also be really exciting to take part in the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\"><span>Tour de France Femmes</span></a><span> and also the new opportunities now available. I’m the rider with the most Monuments at the moment, so I’d like to try and go for new Monuments that I don’t have yet like Milan-Sanremo and Il Lombardia.</span></p>\n<p><span>\"I would love to be able to aim for five Monuments in my career – that would be special.\"</span></p>\n<h3><b>British talent</b></h3>\n<p><span>Throughout her career Deignan has been the leading light of British women's road racing. While her return to the professional peloton will excite many of the British fans, and with few British winners making their mark in Deignan’s absence, will she feel a pressure to fill this role again?</span></p>\n<p><span>\"You might not be seeing the riders on the podium or in the top 10 right now, but I think there is a generation coming through that I hope will put me under pressure as I don’t want to be comfortable in selection and things like that,\" she said, pointing to the burgeoning career of young British riders like Pfeiffer Georgi, Alice Towers and Anna Henderson. “I’m certainly not sitting here thinking, OK, Glasgow, I’m sure I’m going to have a spot on the team, which I think is a reflection of the riders coming up.\"</span></p>\n<p><span>\"Previously I knew I was a shoe in for Yorkshire but I don’t feel like that for Glasgow. I think I have to prove myself to be in that team now, and I think that's a really good indication of where the talent is.\"</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d45beb32f806c68b66071dd52182f55b1c31a1ebd01f303f5150e44488a03f60","category":"Cycling"}