{"title":"Demographic isolation and attitudes toward group work in student-selected lab groups","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310918","date":1727186400000,"content":"<p>by Mitra Asgari, Amy E. Cardace, Mark A. Sarvary</p>\r\n\r\nSmall group work has been shown to improve students’ achievement, learning, engagement, and attitudes toward science. Previous studies that focused on different methods of group formation and their possible impacts mainly focused on measures of students’ academic ability, such as GPA, SAT scores, and previous familiarity with course content. However little attention has been given to other characteristics such as students’ social demographic identities in research about group formation and students’ experiences. Here, we studied the criteria students use to form lab groups, examined how the degree of demographic isolation varies between student-selected and randomly-formed groups, and tested whether demographic isolation is associated with group work attitudes. We used a pre-post survey research design to examine students’ responses in a large-enrollment biology laboratory course. Descriptive analyses showed that “students sitting next to me” (57%) followed by the combination of “students sitting next to me” and “friends” (22%) were the two most common criteria students reported that they considered when forming research groups. Notably, over 80 percent of students reported forming groups with those who sat nearby. We studied instances where students were isolated by being the only members of a historically marginalized population in their lab groups. The prevalence of demographic isolation in student-selected groups was found to be lower than in the simulated randomly assigned groups. We also used multilevel linear regression to examine whether being an isolated student was associated with attitudes about group work, yielding no consistent statistically significant effects. This study contributes to growing knowledge about the relationship between students’ demographic isolation in groups and group work attitudes.","author":"Mitra Asgari","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d46eb076e63eb04a7c19e599f5a692ab7efb10f80df13e0d8206bb12f02ce578","category":"Interdisciplinary"}