{"title":"Effects of dietary supplement of ε‐polylysine hydrochloride on laying performance, egg quality, serum parameters, organ index, intestinal morphology, gut microbiota and volatile fatty acids in laying hens","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13198?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>ε-polylysine hydrochloride (ε-PLH) is a naturally occurring antimicrobial peptide extensively utilized in the food and medical industries. However, its impact on animal husbandry remains to be further explored. Therefore, the present study aimed to determine the effect of ε-PLH on laying hens' health and laying performance.</p>\n<h2>RESULTS</h2>\n<p>Dietary supplementation with ε-PLH to the diet significantly increased average egg weight during weeks 1–8. Meanwhile, compared with the control group, supplementation with ε-PLH decreased the feed egg ratio during weeks 9–12 and egg breakage rate during weeks 9–16 ，whereas it increased eggshell strength during weeks 1–4 and 13–16 . The ε-PLH 0.05% group increased yolk percentage during weeks 5–8 and yolk color during weeks 1–4 . Furthermore, ε-PLH supplementation significantly increased the concentrations of total protein, albumin, globulin and reproductive hormones estradiol, as well as decreased interleukin-1 beta and malondialdehyde in the serum. Compared with the control group, supplementation with 0.05% ε-PLH significantly increased the relative abundance of <i>Cyanobacteria</i> and <i>Gastranaerophilales</i> and decreased the abundance of <i>Desulfovibrio</i> and <i>Streptococcus</i> in the cecum microbiota. In addition, ε-PLH 0.1% supplementation also increased acetic acid content in the cecum.</p>\n<h2>CONCLUSION</h2>\n<p>Dietary supplementation with ε-PLH has a positive impact on both productive performance and egg quality in laying hens. Furthermore, ε-PLH can also relieve inflammation by promoting the immunity and reducing oxidative damage during egg production. ε-PLH has been shown to improve intestinal morphology, gut microbial diversity and intestinal health. © 2023 Society of Chemical Industry.</p>","author":"Han Wang, \nJianqing Wu, \nMoran Hu, \nHaoxin Zhang, \nXiaolong Zhou, \nSongbai Yang, \nKe He, \nFeifei Yan, \nHangfeng Jin, \nShaojie Chen, \nAyong Zhao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d474b546000d0bc98302c50b658f4daee24efeedc261fe3f565aae9da519c8b0","category":"Environment"}