{"title":"'Life is full of snakes on every level': Thibau Nys is letting nothing stop him reach the very top","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/life-is-full-of-snakes-on-every-level-thibau-nys-is-finding-his-own-way-to-the-very-top","date":1703577603000,"content":"\n      <p>“Life is a game,” Thibau Nys says. “And it’s full of snakes on every level.” I look at him quizzically. “It is,” he shoots back. In what way? “In every way. There will always be some people trying to bring you down. You just need to get over it. And them.”</p>\n<div></div>\n<div></div>\n<p>At just 21-years-old, Nys is a deep thinker, and an even sharper and faster speaker. He points to the tattooed snake on his lower right forearm. “I’m really into art,” he says, “and this is my body’s art. I don’t do the drawings, but I try to find my own inspiration and create it.”</p>\n<p>He lifts up his short sleeved jersey to reveal a selection of tattoos: an angel, a race pin, 2002 - denoting the year of his birth - and the name of the town he lives - Baal. He then hovers over the moon and two stars, the latter representing his mum, Isabelle, and his father Sven, a cycling legend. “I was born from two stars, and landed on the moon,” he says, rather poetically.</p>\n<p>The Lidl-Trek rider comes down his arm and lands on two 3D dice. The three visible sides of one dice each show six dots. 6-6-6. It’s like the devil, I tell him. “Oh really? I didn’t know,” he says. “The meaning behind it is that you need to have luck in life, but at a certain moment you need to make your own luck. When you throw a six, it’s one part of the luck puzzle, but the other part is creating it yourself.”</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/can-tadej-pogacar-achieve-cycling-s-elusive-feat-the-giro-tour-double\"><strong><em>Read more: Chasing the double: Can Tadej Pogačar really succeed at the Giro and the Tour?</em></strong></a></p>\n<p>This autumn, Nys has been creating his own name for himself. Trying to come out of his father’s shadow will be the eternal, perhaps impossible, task for the young Belgian. Nys Senior is a cyclocross legend, a winner of two world titles and over 140 professional victories. To many, he is the godfather of the discipline.</p>\n<p>But Nys Junior is carving his own path. In October, racing for the cyclocross team Baloise-Trek Lions, he won the first round of the UCI Cyclocross World Cup in Waterloo, United States, and then won the prestigious Koppenbergcross. “I didn’t have the feeling that I was going over my limit. That was my level.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1726773779.jpg?v=1703173312\" alt=\"Thibau Nys, waterloo\" /></p>\n<p><em>Nys won the first round of the CX World Cup in the USA earlier this year (Getty Images)</em></p>\n<p>Since then, though, he’s placed seventh, sixth and 19th in subsequent World Cup rounds, and has thus taken a three week break; he will resume cyclocross over the intense Christmas period. “The way I started the season put the expectations quite high,” he says, in between mouthfuls of yoghurt and bread. Too high? “No, not too high. I felt I was ready to do it, to be able to stay at that level for the rest of the winter season. But that was not the case. It’s mentally a bit difficult to not ride those results anymore.”</p>\n<p>What happened? “Maybe it’s because I am young, 21. I am pretty confident that what I showed in the first weeks of the season I will be able to show for a much longer period in the next couple of years. It’s about learning, getting stronger. It feels a bit shit to drop a little back, but I know I can perform way better than I am right now.”</p>\n<p>Being the son of Sven, Thibau should be racing cyclocross. Any perception it’s forced upon the reigning U23 world champion, however, is wide of the mark. “It gives me a lot of joy, does cyclocross,” he smiles, his spiky blonde hair and clean fade a nod to his tender years. “When it’s all going well, performances are good, it’s like living a dream, like being on a cloud. Road is also nice but cyclocross is more…” A community? A family discipline? “Yeah, you know, it’s cooler. Winning races my dad used to win, coming back to the same courses with all the history of him being there, that’s cool.”</p>\n<p>His dad is always on hand for advice and tips. “When I think about it, I ask him a lot. It’s really nice to have someone like him next to me. The sport has changed so much, it’s like a completely different thing now, but I feel like I am learning more and more these days, when I thought I would be learning less and less. My dad’s a big part of my learning.”</p>\n<p>This winter, cyclocross’s Big Three - Mathieu van der Poel, Wout van Aert and Tom Pidcock - have all drastically reduced their participation in the muddy races. Is a spot opening up for a new cross king? “Maybe,” Nys responds. “But it’s not something that’s playing on my mind right now. I just want to get the best version of myself into races each week. If it’s without Mathieu and Wout, then I’ll try for the podium. If it’s with them, I will try to follow them as long as possible and I’ll be happy with a top-five spot.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1638160664_26ec7b32-3400-4144-8b00-2aab103f8ace.jpg?v=1703173203\" alt=\"Thibau Nys\" /></p>\n<p><em>Nys will be looking to capitalise more on opportunities to win on the road in 2024 (Getty Images)</em></p>\n<p>He comes back to his form - it’s clearly troubling him. “It’s been difficult not showing the best of myself. I think in cyclocross it’s more difficult to be consistent. It’s so intense, you know. When you come out of the weekend quite fucked up, it’s difficult to train during the week and still be fresh the following Sunday. Even more so when you combine it with a long road season. It’s more important to be fresh in cyclocross than on the road as every pedal counts from the first second onwards. If you miss two or three percent, you can’t show yourself. Everything needs to fall in place.”</p>\n<p>He will race four of the blockbuster Christmas races, and then target the elite World Championships in early February. Then, he’ll swap the cyclocross Baloise-Trek Lions colours for the road jersey of Lidl-Trek. In 2023, he took his first two pro wins. “From the Tour de Romandie [in late April] to the National Championships [at the end of June], I was at a really high level.” He expects more next year. “My goals are quite simple: to get stronger, to learn more, to step up my game, and to win more. I felt like I missed some opportunities to finish off more chances last year. They were there, but I missed them due to a lack of experience. I need to make sure I don’t make the same mistakes.”</p>\n<p>Entering just his second year as a professional, and carrying the weight of one of Belgium’s greatest cycling surnames, Nys is fiercely competitive and strikingly confident. “I’m still figuring out myself, trying to be the best. I’ll get there.” Not even the snakes will get in his way.</p>\n<p><em>Cover image by Alex Whitehead/SWPix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d47bce240394962bb57645dd35b38c06f175a11b938f0649fd97691f67230c57","category":"Cycling"}