{"title":"Effects of food resources on the longevity, survival, and fecundity of Paracentrobia subflava adults, an egg parasitoid of the corn leafhopper pest Dalbulus maidis","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12906?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c0cffc74-8246-4336-8745-305b70a16628/aab12906-toc-0001-m.png\" alt=\"Effects of food resources on the longevity, survival, and fecundity of Paracentrobia subflava adults, an egg parasitoid of the corn leafhopper pest Dalbulus maidis\" />\n<p>Process of evaluating longevity and survival to different artificial diets and honeydew of the corn pest <i>Dalbulus maidis</i> in the egg parasitoid <i>Paracentrobia subflava</i> (A). In addition, assess <i>P</i>. <i>subflava</i>'s fecundity with food (honey) and without food (B).\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The diet consumed by adult parasitoids can affect longevity, survival, and fecundity. Honeydew from sap-sucking insects is an abundant food resource in the field; however, artificial diets such as commercial bee honey are often used in lab rearing. The parasitoid <i>Paracentrobia subflava</i> (Girault) (Hymenoptera: Trichogrammatidae) is a natural enemy of <i>Dalbulus maidis</i> (DeLong) (Hemiptera: Cicadellidae). The longevity and survival of <i>P</i>. <i>subflava</i> when fed natural and artificial diets under controlled conditions have not been studied. Further, the fecundity of <i>P</i>. <i>subflava</i> when fed a diet of honey has not been investigated. Therefore, our first objective was to analyse the longevity and survival of <i>P</i>. <i>subflava</i> when fed (1) honeydew of the corn leafhopper <i>D</i>. <i>maidis</i>, (2) honey + water, (3) honey + water + pollen, (4) water, and (5) nothing (control). Our second objective was to evaluate <i>P</i>. <i>subflava</i> fecundity upon exposure to <i>D</i>. <i>maidis</i> eggs, comparing parasitoids fed with honey + water versus controls (no food or water). In the second objective, honey was chosen since it was determined during the first objective to be the optimal food. The longevity of adult parasitoids (laboratory-reared and field-collected) was high when fed on honey and low when fed other diets. The highest longevity was achieved with honey + water: 17 days, while the survival of adult parasitoids was only 3 days for honeydew. Interestingly, fecundity, in terms of the percentage of parasitism and the percentage of emergence, did not differ between parasitoid females that had access to honey + water as a food resource and those that had no food or water.</p>","author":"Rosaura Torres‐Moreno, \nGustavo Moya‐Raygoza","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"d480a387375884d94a613fd9f61bcafcbb3b52a2d16225e5e522f7489ab37d81","category":"Environment"}