{"title":"Apple Releases First Beta of visionOS 1.1 to Developers","link":"https://www.macrumors.com/2024/02/06/apple-releases-first-beta-of-visionos-1-1/","date":1707243286000,"content":"Apple today released the first beta of an upcoming <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> 1.1 update for developers, allowing developers to test new features ahead of the software seeing a public launch. This is the first beta version of ‌visionOS‌ software that Apple has made available since the headset launched last Friday.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/visionOS-Home-Screen.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nThe ‌visionOS‌ beta can be downloaded by going to the Settings app on the device and toggling on developer betas. A registered developer account is required, and Apple recommends making a backup before installing new software.\r<br />\n\r<br />\n‌visionOS‌ 1.1 brings Apple Device management to the Vision Pro. With this functionality, IT departments at companies and educational institutions can manage Vision Pro headsets in the same way they manage iPhones, iPads, and Macs.\r<br />\n\r<br />\nApple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> recently said that Apple believes the Vision Pro will have a range of enterprise uses, from assisting in surgeries to managing warehouses and providing guides for complex mechanical work.\r<br />\n\r<br />\nApple's enterprise marketing head Jeremy Butcher <a href=\"https://techcrunch.com/2024/02/06/apple-brings-enterprise-device-management-to-the-vision-pro/\">told <em>TechCrunch</em></a> that the company wants to give businesses the tools they need to manage the Vision Pro at scale. \"So the good news is we've got a lot of great technology to bring over to Vision Pro in that regard,\" he said.\r<br />\n\r<br />\nDevice management on the Vision Pro will include managed Apple IDs, single sign-on, identity management, and security.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/06/apple-releases-first-beta-of-visionos-1-1/\">Apple Releases First Beta of visionOS 1.1 to Developers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-first-beta-of-visionos-1-1-to-developers.2418674/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d4891783b74e54361638a79bd079e3943fb148d4690fa0b3e084040a4529fc04","category":"Apple"}