{"title":"PSIII-10 Impact of late gestation vitamin A and D injection on offspring growth and immune parameters in piglets","link":"https://academic.oup.com/jas/article/102/Supplement_2/334/7664792?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Supranutritional use of vitamins may have an impact on mortality rates of sows and piglets. Specifically, injection of vitamin A, and vitamin A and D (VitAD) has improved subsequent preweaning mortality when given to sows after weaning and improved immune response in offspring when administered to cattle in late gestation. However, little work has been conducted to investigate developmental impacts of gestational vitamin supplementation in piglets that may impact immune development. To investigate the relationship of VitAD supplementation on offspring development, this study evaluated sows (n = 20) injected intramuscularly with VitAD (312,000 IU vitamin A, 52,500 IU vitamin D) or a saline at d 85 of gestation. Effect of VitAD on performance and immune development was assessed from birth through wk 5 post weaning. Starting at birth (n = 95 VitAD, n = 114 control) piglet serum was collected weekly during the 4 wk lactation period, and a subset of piglets were bled weekly through the nursery. Blood was analyzed for retinol concentrations from birth through 5 wk post weaning and immune parameters via complete blood count analysis for 5 wk post weaning. Milk samples were also collected weekly during lactation and assessed for retinol concentrations via liquid chromatography. Data were assessed via a mixed procedure (SAS 9.4) with sow as random and treatment as fixed variables. Covariate of wean age was assessed for post weaning growth and of sampling time for retinol and CBC analysis. At farrowing, differences in birth weights were not observed (<span>P</span> ≥ 0.69). Through the lactation phase, control piglets had a tendency for increased average daily gain (<span>P</span> ≥ 0.07); however, no differences (<span>P</span> ≥ 0.27) were observed in piglet growth performance during the nursery phase. Blood and immune parameters assessed were not different across treatments from birth through 9 wk of age. Circulating retinol concentrations were greater in the control group, (<span>P</span> ≤ 0.05) at 15, 22, and 28 d of age, compared with VitAD. Milk retinol concentrations were increased in the VitAD group on d 8 of life, (<span>P</span> ≤ 0.05), but not at any other time during lactation. These results suggest that supplementation of VitAD on d 85 of gestation in sows impacts the retinol concentrations in milk for a limited period, but not growth or circulating retinol and immune parameters in piglets at any age. Based on these data, efficacy of supranutritional injection of VitAD may be timing specific and limited to benefiting the litter during lactation. Further research is needed to assess specificity of timing and impacts on piglet health and survival.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d4899ae1f90a45e5b335cff02270181225c71abce5fecb422ed8f821289d953d","category":"Environment"}