{"title":"wcm.03.2024.267.273","link":"https://www.watconman.org/wcm-03-2024-267-273/","date":1714706776000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>EVALUATION OF GROUNDWATER SALINITY AND SUITABILITY FOR IRRIGATION PURPOSES ON SOUTH COASTAL JEMBER REGENCY</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Ikhlas Nur Muhammad, Sri Astutik, Indarto, Muhammad Asyroful Mujib, Era Iswara Pangastuti , Fahmi Arif Kurnianto</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.02.2024.267.273\">10.26480/wcm.02.2024.267.273</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Coastal areas are vulnerable to seawater intrusion. This research focused on the south coast of Jember Regency to analyze the distribution of salinity levels and suitability for agricultural irrigation. The research was a quantitative research, field survey method to analyze salinity level using parameter EC (Electrical Conductivity), and irrigation suitability using parameter (TDS, SAR, &amp; %Na). Analyze the distribution of irrigation suitability samples using Wilcox and USSL diagrams, and visualized in maps using IDW interpolation. Salinity level is dominated by medium class with a total of 47 samples, and interpolation results are dominated by medium class with an area of 15,648 ha. Irrigation suitability based on the Wilcox diagram shows the dominance of samples in the good class totaling 7 samples, with interpolated %Na dominated by the excellent class with an area of 14,122 ha. Analysis of irrigation suitability based on USSL diagram is dominated by medium class (C3-S1) with a total of 7 samples, and SAR interpolation results are dominated by excellent class with an area of 26,209 ha. Analysis of irrigation suitability based on TDS parameters is dominated by the class none risk with a total of 57 samples, with interpolation results dominated by the class none risk with an area of 25,663 ha. Mapping provides an overview of salinity and irrigation suitability in the study area. These findings can be the basis for more efficient water management in coastal areas.</div>\n<h3>Keywords</h3>\n<p><span>irrigation quality asessment, geographic information system (gis), salinity, agriculture</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Water is importance in agricultural irrigation activities. Irrigation is key in succesfully increasing rice crop production in paddy fields (Permatasari and Vienastra, 2022). The value of irrigation quality can be a limitation in the use of water for agricultural irrigation (Mawali and Wantasen, 2020). Irrigation is the application of water to the soil to supply essential moisture for plant growth (Astutik and Suhardi., 2021). Coastal areas in Indonesia generally have land that used as agricultural land. The need water for agricultural irrigation purposes to meet food needs in Indonesia continues to increase in line with population growth in Indonesia (Jannata et al., 2015). Coastal areas are vulnerable to seawater intrusion.Seawater intrusion is a coastal environmental problem that threatens the quality and sustainability of groundwater aquifers in coastal areas (Hussain et al., 2019).<br />\nSalinity in agricultural irrigation can affect crop growth. High salinity can inhibit water absorption by plant roots due to the high concentration of dissolved ions in the water (Bassuony et al., 2014; Ma’ruf, 2016). High salt content in irrigation water can affect soil permeability and plant growth (Amiri et al., 2015). Salinity levels can be measured using electrical conductivity, agricultural irrigation suitability can be measured using Sodium Adsorption Ratio (SAR), Percentage Sodium (%Na), and Total Dissolved Solids (TDS) (Wang et al., 2020). Each parameter has a function and used to assessing the suitability of agricultural irrigation. Sodium calculation used to determine the reaction of soil conditions and its effect on soil permeability (Cahyadi et al., 2020). High salt content in water can inhibit soil permeability and cause disrupted plant growth (Amiri et al., 2015). Soil permeability can be poor when exposed to high concentrations of ions by sodium, causes hard soil and reduces permeability (Ismail et al., 2023).</p>\n<p>The southern coast of Jember is vulnerable to seawater intrusion problems. Hidayatullah and Aulia interview results with farmers in the study area, identified a problems with crop productivity that occur when sea levels rise (Hidayatullah and Aulia, 2020). Other research supported by a group researcher showed that some area of research location are vulnerable to seawater intrusion using geoelectric methods to detect (Santoso et al., 2013). The South Coast of Jember Regency has land generally used as agricultural land. Based on the problems that can occur in coastal areas, it is necessary to monitor the quality of irrigation to determine the use of irrigation purposes. This research designed to evaluate the quality of agricultural irrigation in the South Coastal area of Jember to maximize the suitability of irrigation use in the agricultural sector.</p>\n<h3><strong>2. GEOLOGICAL CONDITIONS OF RESEARCH LOCATION</strong></h3>\n<p>The landscape of the South Coastal region of Jember Regency has diverse geological conditions. The dominant lithologic composition in the study area is sedimentary rock due to the geological process of sedimentation. Figure 1 shows the distribution of geology in the study area.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"769\" height=\"548\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F1.jpg 769w, https://www.watconman.org/wp-content/uploads/2024/05/F1-300x214.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1: </strong>Geological map of South Coastal Jember Regency (Sapei et al., 1992).</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The South Coast of Jember Regency, based on geologic sheets copied shows that the South Coastal area of Jember Regency dominated by lithology in the form of alluvial rocks (Qa), which consists of crusts, pebbles, sand and clay (Sapei et al., 1992). This lithology is sensitive to seawater intrusion (Barbieri, 2023). Other formation dominated by karst lithology (Tmp), which consists mainly of limestone. In addition, the volcanic lithology of the Argopuro Tuff Formation (Qvat) also characterizes this structure.<br />\nAreas consisting of sand, gravel and pebbles are highly susceptible to seawater intrusion. Previous research by a group researcher used geoelectric methods to identify four trajectories in the coastal area of Sumberejo Village, Jember Regency (Santoso et al., 2013). Tracks 1, 2 and 3, dominated by sand and gravel, showed a higher risk vulnerability to seawater intrusion, while track 4 is clay layers and had a lower risk of intrusion.</p>\n<h3><strong>3. METHODS AND MATERIALS</strong></h3>\n<p><strong>3.1 Research Location</strong></p>\n<p>The research study area includes several coastal areas on the south coast of Jember Regency. The coordinates of the research study area stretch from 8°18’27”N and 8°22’51”N to 113°18’11”E and 113°44’15”East. The study area has an area of 27,131 ha. The study area is visualized in Figure 2.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"782\" height=\"556\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F2.jpg 782w, https://www.watconman.org/wp-content/uploads/2024/05/F2-300x213.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/F2-768x546.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong> Map of research location and sample points</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The study involved the collection of water samples. A total of 66 samples were collected for water physics analysis on TDS and EC (Electrical Conductivity) parameters. Meanwhile, another 11 samples were used for water chemistry analysis on %NA and SAR parameters.</p>\n<p><strong>3.2 Sample Collections and Classification</strong></p>\n<p>Sample collect using in situ method was conducted using HI Portable 9813-6 to test EC and TDS parameters on 66 samples. The 11 samples with the highest values will undergo ex situ testing for chemical parameters, such as SAR and %Na. Water chemistry analysis was conducted by Biosaint laboratory, using the Atomic Absorption Spectrometry (AAS) method to measure cations such as Ca, Mg, Na, and K. Sample coordinates were determined using a Garmin eTrex 30, and mapping was perform using ArcGIS 10.3. The HI Portable 9813-6 calibration process used HI 7031L6 material.</p>\n<p>This study used several parameters in assessing the suitability of agricultural irrigation quality. This study used several parameters in assessing the suitability of agricultural irrigation quality. The SAR parameter use to evaluate the level to which sodium in water replaces calcium and magnesium in the soil (Sabrina, 2018). %Na calculation is use to determine the reaction of soil conditions and its effect on soil permeability (Cahyadi, 2020). The SAR calculation was measured using the equation 1 (Richards, 1954).</p>\n<p>SAR= Na/√(((Ca+Mg)/2) ) (1)<br />\nThe %Na calculation was measured using the equation 2 (Wilcox, 1955).<br />\n%Na=(Na+ K)/(Ca+Mg+Na+K) (2)</p>\n<p>Sample quality was characterized using Wilcox and United States Salinity Laboratory (USSL) diagrams. Distributions were interpolated using Inverse Distance Weighted (IDW) using power 2 or default functions. The suitability class for mapping salinity levels used EC reference data and for irrigation suitability values used SAR, TDS and %Na values. The following is a table description of salinity levels and irrigation suitability based on experts:\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1023\" height=\"189\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T1.jpg 1023w, https://www.watconman.org/wp-content/uploads/2024/05/T1-300x55.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/T1-768x142.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"493\" height=\"387\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T2T3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T2T3.jpg 493w, https://www.watconman.org/wp-content/uploads/2024/05/T2T3-300x235.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"488\" height=\"169\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T4.jpg 488w, https://www.watconman.org/wp-content/uploads/2024/05/T4-300x104.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>4. RESULT AND ANALYSIS</strong></h3>\n<p><strong>4.1 Statistical Analysis of Physical Parameters</strong></p>\n<p>The results of the water quality measurements on the parameters show how the water’s the physical characteristics. EC and TDS have a strong correlation. EC and TDS values are directly proportional, in which the higher the EC value, the higher the TDS value. The results of the research parameter survey resulted in 66 sample points spread across the study area.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"688\" height=\"409\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F3.jpg 688w, https://www.watconman.org/wp-content/uploads/2024/05/F3-300x178.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>Correlation of TDS and EC Data</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>EC and TDS values have a high level of correlation. The high correlation value represented in the R² value. The R² value shows a value of 0.9889 or 98.89%, which concluded that the value has a correlation level of 98.89% and defined as a strong correlation.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"506\" height=\"158\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T5.jpg 506w, https://www.watconman.org/wp-content/uploads/2024/05/T5-300x94.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The classification results in Table 5 show the class distribution for the TDS parameter. The tested water samples show that most are in the none risk class with 57 samples, while the slight to moderate risk class has 7 samples, and the other 2 samples belong to the severe risk class. Based on these results, the use of agricultural irrigation based on TDS parameters can be considered effective and safe, given that the majority of samples are in the none risk category.</p>\n<p><strong>4.2 Statistical Analysis of Chemical Parameters</strong></p>\n<p>Chemical parameters use in the calculation of SAR and %Na formulas. This chemical parameter measurement has a total of 11 samples in the research study area. The determination of sampling was taken with consideration of the highest value in the previous physical parameter testing. The results of chemical calculations are in Table 6 as follows.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1018\" height=\"311\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T6.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T6.jpg 1018w, https://www.watconman.org/wp-content/uploads/2024/05/T6-300x92.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/T6-768x235.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Data calculation results display the condition of water quality in each sample. The concentration content value of each element has a role in the quality level of each parameter. Areas with high sodium concentrations have poor water quality.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"538\" height=\"384\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F4.jpg 538w, https://www.watconman.org/wp-content/uploads/2024/05/F4-300x214.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 4: </strong>USSL diagram of irrigation quality classification (Richards, 1954)</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The USSL diagram displays the level of conformity with two parameters correlated between SAR and EC. Visualizing the diagram above, we can conclude that of the eleven samples, the trend of data distribution is in the medium quality class (C3-S1) with 7 samples, good quality class (C2-S1) with 2 samples, and very bad quality class (C4-S4) with 2 samples.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"613\" height=\"298\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F5.jpg 613w, https://www.watconman.org/wp-content/uploads/2024/05/F5-300x146.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 5: </strong> Wilcox diagram irrigation quality classification (Wilcox, 1955)</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Interpretation of %Na values using Wilcox diagrams. The results on the Wilcox diagram show that 7 samples are in the good to permissible quality class, 2 samples are in the excellent to good quality class, and 2 samples are in the unsuitable quality class.</p>\n<p><strong>4.3 Salinity Level Mapping and Distribution</strong></p>\n<p>High Electrical Conductivity (EC) is one of the indicators to assessing level of salinity. Salinity levels are measured using physical measurements through EC measurements. A high EC level can be an initial assessment of a solution that contain electrical charge on the ions in the mineral. The predicted areas with high salinity levels are visualized in Figure 6.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"630\" height=\"450\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F6.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F6.jpg 630w, https://www.watconman.org/wp-content/uploads/2024/05/F6-300x214.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 6: </strong> Mapping of salinity levels and distribution</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Monitoring water quality and salinity levels in coastal areas is necessary. Monitoring salinity levels is an effort to monitor whether or not coastal aquifers have been intruded. Seawater intrusion can have a negative impact on water utilization, both as water needs for drinking and agricultural irrigation. The distribution of salinity area based on the mapping results is presented in Table 7.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"488\" height=\"205\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T7.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T7.jpg 488w, https://www.watconman.org/wp-content/uploads/2024/05/T7-300x126.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The dominant area shows medium salinity class with an area of 15,648 ha. The mapping results show some areas categorized as very high salinity such as in the Sumberejo Village area. Areas with alluvial lithology are vulnerable to seawater intrusion. Barbieri explained that general salination affects alluvial aquifers, karst and alluvial coastal areas (Barbieri, 2023). Previous research using geoelectric methods showed relevance in suspecting seawater intrusion in the area. Research by a group researcher stated that some areas in Sumberejo Village have rock lithology in the form of gravel and sandstone, so this area has a high vulnerability and is easily penetrated by sea water (Santoso et al., 2013).</p>\n<p><strong>4.4 Water Quality Mapping for Irrigation Designation and Distribution</strong></p>\n<p>The suitability and provisions of parameters in the assessment of irrigation water quality in this study use physical parameters, namely TDS, and chemical parameters using SAR and %Na. The quality of irrigation water determines its suitability for use.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"689\" height=\"493\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/F7.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/F7.jpg 689w, https://www.watconman.org/wp-content/uploads/2024/05/F7-300x215.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 7: </strong>Mapping level of suitability for agricultural irrigation based on SAR values by (Richards, 1954), %Na by (Wilcox, 1955) and TDS by (Peterson, 1999).</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"487\" height=\"443\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/T8.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/T8.jpg 487w, https://www.watconman.org/wp-content/uploads/2024/05/T8-300x273.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results of irrigation suitability mapping based on TDS values show that the study area dominated by water quality with none risk class for agriculture irrigation with an area of 25,663 ha. The SAR parameter shown the study area dominated by a excellent irrigation quality class with an area of 26,209 ha. The %Na parameter in the study area dominated with excellent class quality with an area reaching 14,122 ha.</p>\n<h3><strong>5. DISCUSSION</strong></h3>\n<p><strong>5.1 Salinity Level and Agricultural Irrigation Condition of the Study Area</strong></p>\n<p>In general, the study area dominated by the medium salinity class based on the classification and mapping results. The medium salinity class is at the value level of 0.25 dS/m to 0.75 dS/m with an area of 15,648 ha. The medium salinity class quality has good quality as an agricultural designation. The EC parameter indicates the level of conductivity of the solution. The higher the level of conduction in water can be an assumed indication that the water has certain minerals that affect it.<br />\nHigh salinity values are a problem in the agricultural sector. High salinity in water can affect plant growth. High salinity inhibits the absorption of water by plant roots due to the high osmosis pressure in water caused by high concentrations of dissolved ions, which can affect plant growth (Bassuony et al., 2014; Ma’ruf, 2016). Groundwater aquifers that are infiltrated by seawater cause groundwater to have salinity content, a salinity level of groundwater aquifer create negative impact on the community, especially with land that used as agriculture. Areas with high salinity in the study area are in Sumberejo Village.<br />\nAnalysis of irrigation suitability based on TDS parameters shows the interpolation results are dominated by the class none risk with an area of 25,663 Ha. Irrigation use in the study area based on TDS analysis has a safe condition that can be use properly for agricultural irrigation. TDS is use to assessing the level of solids dissolved in water. The dissolved solids component needs to be analyze continously regarding the concentration level.</p>\n<p>Chemical analysis of SAR values based on interpolation, show that study area dominated with excellent class quality within area of 26,209 ha. The use of irrigation in the study area in the SAR analysis is excellent class quality and safe properly for agricultural irrigation. SAR values can determine the level of sodicity of a soil. Soil permeability can be poor when exposed to high concentrations of sodium ions, causing the soil to become hard and reducing permeability in soil (Ismail et al., 2023).<br />\nThe %Na analysis in the interpolation results is dominant in the excellent class with an area of 14,122 ha. The study area has very safe irrigation conditions and safe use as agricultural irrigation. A high %Na value indicates the level of dissolved salt content in the water. High salt content in water can inhibit soil permeability and cause disrupted plant growth (Amiri et al., 2015).<br />\nThe results of the USSL diagram show the dominance of quality is in medium quality (C3-S1) as many as 7 samples. The results of the USSL diagram dominated by medium quality and safe for use as agricultural irrigation. Wilcox diagram assesses suitability using two parameters, namely %Na and EC. The results of the Wilcox diagram show that the samples are dominated by good to acceptable classes as many as 7 samples.</p>\n<p>Monitoring of agricultural irrigation water quality is an attempt to prevent the unsuitability of agriculture irrigation water that can adversely affect the suboptimal use of land as agriculture in areas with high water salinity levels in the region. The demand of water irrigation to fulfill food demand continues increase in line with population growth in Indonesia (Jannata et al., 2015). Agricultural irrigation management in coastal areas is importance to be monitored and controlled.</p>\n<p>Irrigation water in the study area in each test parameter shows that it is dominantly at a safe value and is still suitable for agricultural irrigation. Water with a high concentration of values and prone to be used as agricultural irrigation is in the area in Sumberejo Village. Areas with a bad water quality conditions require special treatment if they function as agricultural irrigation.</p>\n<h3><strong>6. CONCLUSION</strong></h3>\n<p>Based on the results of the study, there are conclusions that have been summarized on the analysis of the level of salinity and the level of suitability of agricultural irrigation on each parameter used in the assessment. The value of the salinity level in the region is divided into several salinity classes, the widest dominance is at the medium salinity level with an area of 15,648 ha. Irrigation suitability on the TDS parameter shows that the largest area dominated in the none risk class with an area of 25,663 ha. The suitability of the SAR parameter shows that the area in excellent class with an area of 26,209 ha.</p>\n<p>The suitability of agricultural irrigation on the %Na parameter shows that the coverage in the excellent class with an area of 14,122 ha. The conclusion of the results of this study is that the southern coastal area of Jember Regency generally has the suitability of irrigation in the use of agricultural irrigation. The suggestion of this research in improving the quality of studies in future researchers is to test with more samples so that the data will be even more accurate. The farmers need adjust the right commodity for high salinity areas. The Farmers in high salinity that have irrigation and soil problems can use rainwater irrigation by making water reservoirs and do soil liming again if the soil dominated by sodium minerals (sodic).</p>\n<h3><strong>ACKNOWLEDGMENTS</strong></h3>\n<p>Special thanks to the support of LP2M University of Jember for funding support through the KeRis Terpadu grant on behalf of Muhammad Asyroful Mujib. My gratitude also goes to the coastal research survey team for assisting in observation and data collection. Also, thank you to the farmer or communities who are willing to provide water for testing in this study.</p>\n<h3><strong>REFERENCES</strong></h3>\n<p>Amiri, V., Sohrabi, N., and Dadgar, M.A., 2015. Evaluation of groundwater chemistry and its suitability for drinking and agricultural uses in the Lenjanat plain, central Iran. Environmental Earth Sciences, 74, Pp. 6163-6176.</p>\n<p>Astutik, S., and Suhardi, D., 2021. Rehabilitasi Jaringan Irigasi untuk Peningkatan Produksi Pertanian. In Seminar Keinsinyuran Program Studi Program Profesi Insinyur (Vol. 1, No. 1).</p>\n<p>Barbieri, M., 2023. Groundwater salinity: origin, impact, and potential remedial measures and management solutions. Frontiers in Water, 5, Pp. 1202576.</p>\n<p>Bassuony, M.A., Ali, M.E., Abdel Hameed, A.H. and Jahin, H.S., 2014. Evaluation of irrigation water quality in different regions of north east Delta-Egypt. Int. J. Eng. Appl. Sci, 5 (1), pp. 10-16.</p>\n<p>Cahyadi, A., Haryono, E., Adji, T.N., Widyastuti, M., Riyanto, I.A., Aji, A.P.K., Fatchurohman, H., Tastian, N.F. and Muhammad, D.T.N., 2020. Temporal variation of water suitability for paddy irrigation needs at karst springs influenced by allogenic recharge in Gunungsewu Karst Area, Indonesia. In E3S Web of Conferences (Vol. 200, p. 02024). EDP Sciences.</p>\n<p>Hussain, M.S., Abd-Elhamid, H.F., Javadi, A.A. and Sherif, M.M., 2019. Management of seawater intrusion in coastal aquifers: a review. Water, 11 (12), Pp. 2467.</p>\n<p>Ismail, E., Snousy, M.G., Alexakis, D.E., Gamvroula, D.E., Howard, G., El Sayed, E., Ahmed, M.S., Ali, A. and Abdelhalim, A., 2023. Multivariate Statistical Analysis and Geospatial Mapping for Assessing Groundwater Quality in West El Minia District, Egypt. Water, 15 (16), Pp. 2909.</p>\n<p>Jannata, J., Abdullah, S.H. and Priyati, A., 2015. Analisa Kinerja Pengelolaan Irigasi Di Daerah Irigasi Lemor, Kabupaten Lombok Timur, Nusa Tenggara Barat: Performance Analysis On Irrigation Management At Lemor Irrigation Area, East Lombok, West Nusa Tenggara. Jurnal Ilmiah Rekayasa Pertanian Dan Biosistem, 3 (1), pp. 112-121.</p>\n<p>Ma’ruf, A., 2016. Respon beberapa kultivar tanaman pangan terhadap salinitas. Bernas: Jurnal Penelitian Pertanian, 12 (3), Pp. 11-19.</p>\n<p>Mawali, F. and Wantasen, S., 2020. The Quality of Irrigation Water on The Cultivation of Rice Plants (Oryza sativa L.). Jurnal Agroekoteknologi Terapan, 1 (2), Pp. 32-34.</p>\n<p>Permatasari, A.A., and Vienastra, S., 2022. Kelayakan Air Tanah untuk Irigasi Pertanian Menggunakan Sodium Arbsoption Ratio (SAR). COMSERVA: Jurnal Penelitian dan Pengabdian Masyarakat, 2 (5), Pp. 497-505.</p>\n<p>Peterson, H.G., 1999. Fact sheet: field irrigation and water quality. Agriculture and Agri-Food Canada-Prairie Farm Rehabilitation Administration: Agriculture and Agri-Food Canada.</p>\n<p>Richards, L.A., 1954. Diagnosis and improvement of saline and alkali soils (No. 60). Soil and Water Conservative Research Branch, Agricultural Research Service, US Department of Agriculture.</p>\n<p>Santoso, T., Piyantari, N., and Hiskiawan, P., 2013. Pendugaan Intrusi Air Laut Dengan Metode Geolistrik Resistivitas 1D di Pantai Payangan Desa Sumberejo Jember. Berkala Sainstek, 1 (1), Pp. 17-19.</p>\n<p>Sapei, T., Suganda, A.H., and Astadiredja, K.A.S., 1992. Geological Map of The Jember Quadrangle, Jawa. Bandung, Indonesia.</p>\n<p>Wang, Z., Wang, S., Liu, W., Su, Q., Tong, H., Xu, X., Gao, Z. and Liu, J., 2020. Hydrochemical characteristics and irrigation suitability evaluation of groundwater with different degrees of seawater intrusion. Water, 12 (12), Pp. 3460.</p>\n<p>Wilcox, L., 1955. Classification and use of irrigation waters (No. 969). US Department of Agriculture.\n</p></div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>267-273</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>3</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8312/\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/3wcm2024/3wcm2024-267-273.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Natasha","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"d490f1d9fa38e9a665d0331c6bbf050381ca6d0b61488a7e5592494681f428f1","category":"Environment"}