{"title":"Apple patches a serious zero-day flaw in iOS, macOS, tvOS updates","link":"https://www.macworld.com/article/2214715/apple-zero-day-flaw-ios-macos-tvos-updates.html","date":1706011926000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>On Monday, Apple released the latest round of updates to iOS, iPadOS, macOS, watchOS, and tvOS, which include a few new features, a smattering of bug fixes, and some pretty important security patches. Among them is a patch for a vulnerability that may have been exploited in the wild—in other words, you should rush to patch it.</p>\n\n\n\n<p>The zero-day is the first Apple has fixed this year. It affects the following models: iPhone XS and later, iPad Pro 12.9-inch 2nd generation and later, iPad Pro 10.5-inch, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 6th generation and later, and iPad mini 5th generation and later, as well as Macs running Sonoma, Ventura, and Monterey, and all Apple TV models. It was discovered as part of the WebKit Bugzilla program.</p>\n\n\n\n<p><strong>WebKit CVE-2024-23222</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been exploited.</li>\n\n\n\n<li><strong>Description:</strong> A type confusion issue was addressed with improved checks.</li>\n\n\n\n<li><strong>WebKit Bugzilla:</strong> 267134</li>\n</ul>\n\n\n\n<p>The updates also include a strange Time Zone patch that may allow an app to view a user’s phone number in system logs, as well as about a dozen other patches for Apple Neural Engine, Kernel, Safari, Finder, and Shortcuts, and several other system featrues.</p>\n\n\n\n<p>Additionally, Apple released iOS 16.7.5 and iOS 15.8.1 to address a pair of zero-day WebKit flaws that were previously patched in iOS 17.1.2 last year.</p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d498c364840711426428ab7cde612fe2bf2689194ac698f9f4bc52ef4eede88d","category":"Apple"}