{"title":"Connect an old Apple display to a new Mac to give it new life","link":"https://www.macworld.com/article/233993/connect-old-apple-display-to-a-new-mac-to-give-it-new-life.html","date":1623744000000,"content":"\n<div>\n<section><div></div></section><p>From 1999 until 2016, Apple released and continued to sell a series of external digitally connected displays optimized for Mac users. The displays started with DVI connectors, shifted to the Apple-made ADC connection, then back to DVI, expanded to dual-link DVI, pivoted to industry-standard Mini DisplayPort, and finally ended with Thunderbolt 2 connectors. After not making a display for a while, Apple returned to the market with its own Thunderbolt 3 display, the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/pro-display-xdr/&amp;subid1=1-1-233993-0-0-0\">Pro Display XDR</a>, and began shipping it in December 2020 for a minimum of $5,000.</p>\n\n\n\n<p>And, gosh, do a lot of those older Apple monitors remain out in the field and in use. Apple never releases much in the way of unit sales, but it’s a fair guess that several million displays were sold. While monitors dim and components fail over time, re-using an external Apple display with a new USB-C or Thunderbolt 3 Mac remains one of the top questions Macworld gets from its readers</p>\n\n\n\n<p>That question has cropped up more than ever since vast numbers of people who worked in office have suddenly had to shift to working from home. Many of us have or prefer a two-monitor display; some readers have sent us pictures of <em>several</em> monitors driven by the same Mac.</p>\n\n\n\n<p>You may have upgraded your Mac since 2015 or 2016 and abandoned an older Apple display for compatibility reasons, but now it looks awfully appealing for your work-at-home situation. Let’s look through the options across generations of Apple equipment.</p>\n\n\n\n<p>(Also, don’t forget that if you have an iPad that can run iOS 13 and a Mac model released since about 2015 running macOS Catalina, you can <a href=\"https://www.macworld.com/article/3406837/how-to-use-sidecar-to-make-your-ipad-a-secondary-mac-display.html\">use the Sidecar feature</a> to extend your Mac with an iPad. If you don’t meet the parameters or want other options, check out the more broadly compatible <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://lunadisplay.com/&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">Luma Display</a>, as well as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.duetdisplay.com/&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">Duet Display</a>, which works with Apple and other mobile and desktop platforms. We also have <a href=\"https://www.macworld.com/article/3532366/add-a-second-display-to-your-mac.html\">instructions</a> on connecting more modem displays (and even an old iMac) as a second display. )</p>\n\n\n\n<p>In this article, I discuss compatibility with Thunderbolt 3, which relies on the USB-C connector. All of Apple’s current Macs include Thunderbolt 3, a high-speed data-transfer standard. Apple’s version also allows for backwards compatibility with Thunderbolt 2 and via adapters can directly connect to HDMI, DisplayPart, and USB 2 and 3, among other standards. Docks extend compatibility further, with Mini DisplayPort, VGA, DVI, and other formats. (While we’ve written about this before across several articles, we decided to consolidate everything we knew, alongside newer and better-reviewed adapters, into a single place.)</p>\n\n\n\n<p>Only a single Mac model ever included a USB-C connector that didn’t include Thunderbolt 3: the 12-inch MacBook that Apple introduced in 2015, updated in subsequent years, and discontinued in 2019. I’ll note below exceptions for clarity.</p>\n\n\n\n<p>Because it’s more likely you have access to a newer Apple Display than an older one, I’ll address the four digital standards Apple used in reverse order: Thunderbolt 2, Mini DisplayPort, ADC, and DVI (including dual-link DVI for larger displays).</p>\n\n\n\n<p>If you’re not sure what display you have, look at the back to find its model number (not its name, which often remains the same across many revisions), then enter that detail into Google to find the full technical specifications and connector type.</p>\n\n\n\n<p>Finally, a MagSafe warning. Apple offered MagSafe and MagSafe 2 connectors with some of its later-generation monitors to let you use the display as a hub: plug in one or two cables and MagSafe, and your laptop was set to go. Apple has never licensed MagSafe to third parties, even though you can find MagSafe “adapters” for USB-C, these products likely violate Apple patents and haven’t been certified by Apple.</p>\n\n\n\n<p>As a result, if you use one and it damages your Mac, you could lose your computer and unbacked-up data for the minor convenience of reusing the display’s charging port, and it’s plausible that Apple would try to deny warranty repair (if it remained under warranty). Just read the one-star reviews on these products for more details. I’ve also noticed that retailers are cracking down on their sale, as there are almost none currently available at Amazon as I write this.</p>\n\n\n\n<h2>Thunderbolt 2</h2>\n\n\n\n<div><div><figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://images.techhive.com/images/article/2015/05/apple-thunderbolt-display-back-100584288-orig.jpg&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\"><img src=\"https://images.techhive.com/images/article/2015/05/apple-thunderbolt-display-back-100584288-orig.jpg\" /></a><figcaption><p>The back of the Apple Thunderbolt Display.</p>\n</figcaption></figure></div></div>\n\n\n\n<p>From 2011 to 2016, Apple sold its Apple Thunderbolt Display, a 27-inch 2560×1440-pixel monitor that relied on a Thunderbolt 2 connector to carry data to and from a Mac along with a MagSafe or MagSafe 2 connector (depending on model) for charging. The monitor featured a 720p iSight (front-facing) camera, mic and speakers, and several connections: one gigabit ethernet port, one FireWire 800 port, and three USB ports.</p>\n\n\n\n<div><div><figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://images.techhive.com/images/article/2017/05/mac911-mdp-tb-symbols-100721374-orig.jpg&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\"><img src=\"https://images.techhive.com/images/article/2017/05/mac911-mdp-tb-symbols-100721374-medium.jpg\" /></a><figcaption><p>DisplayPort connector symbol (left); Thunderbolt 2 (right)</p>\n</figcaption></figure></div></div>\n\n\n\n<p>You can look at the squat Thunderbolt 2 jack to find a lightning-bolt symbol to ensure it’s not an earlier monitor that uses an identical-appearing connector shape, but only handles Mini DisplayPort. (That symbol is a rectangle with a vertical line on either side.)</p>\n\n\n\n<p>Apple sells a <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MMEL2AM/A/thunderbolt-3-usb-c-to-thunderbolt-2-adapter&amp;subid1=1-1-233993-0-0-0\">Thunderbolt 2 to Thunderbolt 3 adapter</a> ($49) that lets you simply plug the Apple Thunderbolt Display into the adapter and the adapter into a Thunderbolt 3 port. (Note: This does <em>not</em> work with a 12-inch MacBook, which has disappointed many purchasers.)</p>\n\n\n\n<p>While the Thunderbolt 2 cable doesn’t power to a Mac laptop, it should allow use of all the other ports on the display. If you have trouble getting the camera to work, seeing only a black feed, try this trick to fix a software agent <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.fosketts.net/2016/11/24/2016-macbook-pro-facetime-hd-camera-not-working/&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">at Stephen Foskett’s blog</a>.</p>\n\n\n\n<h2>Mini DisplayPort</h2>\n\n\n\n<p>Moving back in time, we look at the LED Cinema Display. A 24-inch model (1920×1200 pixels) was sold from 2008 to 2010, and a 27-inch version (2560×1440 pixels) from 2010 to 2013. This display series sported a three-ended cable with a USB 2.0 plug, MagSafe power, and a MiniDisplayPort. It also had a 480p iSight, a mic, and speakers, and a USB 2.0 hub with three ports built into the back.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2020/03/apple-cinema-display-24-100836625-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2020/03/apple-cinema-display-24-100836625-medium.jpg\" /></a><figcaption><p>Apple LED Cinema Display</p>\n</figcaption></figure></div>\n\n\n\n<p>Even though Thunderbolt 2 and Thunderbolt 3 carry DisplayPort video using the DisplayPort standard, the way in which that signal is put over the wire makes it incompatible with Thunderbolt. Confusing, I know, and an irritant for people since early Thunderbolt days.</p>\n\n\n\n<p>To use an LED Cinema Display with a modern Mac over USB-C, you need an adapter or a dock. Either adapter or dock can be USB-C compatible (for a 12-inch MacBook) or Thunderbolt 3 compatible.</p>\n\n\n\n<p>(Note! You cannot pass single DVI or dual-link DVI with a DVI-to-Mini DisplayPort adapter through a Mini DisplayPort adapter. The DVI-based signal can’t be encapsulated in that sequence. Most adapters and docks warn buyers, some of whom buy anyway and leave 1-star reviews in the comments.)</p>\n\n\n\n<p>You have three solid choices for adapters:</p>\n\n\n\n<ul><li><strong>Pass-through USB-C power:</strong><span> A great adapter with USB-C power passthrough is the </span><a href=\"https://www.amazon.com/dp/B01N4FQNYW?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">UPTab USB-C to Mini DisplayPort Adapter</a><span> ($34.95). That’s useful with a laptop with one or two ports, like the 12-inch MacBook and all Thunderbolt 3 MacBook Air and MacBook Pro models.</span> </li><li><strong>Video only:</strong><span>: If you have extra ports, are working with a desktop computer, or are using a MacBook Air and don’t mind occupy one port with power and one with the display adapter, your best option is the </span><a href=\"https://www.amazon.com/dp/B01N2ORP84?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">ITD Itanda USB-C to Mini DisplayPort Adapter</a><span>, which is half as expensive ($18.99).</span> </li><li><strong>Monoprice option:</strong><span> Monoprice offers a simple adapter, its </span><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.monoprice.com/product?p_id=24273&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">Monoprice Select Series USB-C to Mini DisplayPort Adapter</a><span> ($24).</span> </li></ul><p>With docks, there are options abound, but the cost is far higher. If you are looking to rescue an LED Cinema Display and don’t need the array of other ports in a dock, consider purchasing a far less expensive DisplayPort or HDMI display and use a USB-C adapter for either of those formats to connect to your Mac.</p>\n\n\n\n<p>However, if you want the ports <em>and</em> to connect an LED Cinema Display, consider these docks.</p>\n\n\n\n<p>For the 24-inch USB Cinema Display:</p>\n\n\n\n<ul><li><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://eshop.macsales.com/item/OWC/TCDK10PMHSG/&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">OWC USB-C Dock</a><span> ($119), in addition to Mini DisplayPort, this powered dock includes gigabit ethernet, one USB-C USB 3.1 port, four USB Type A 3.1 ports, a combination audio input/output port, and an SD Card slot. If you later switch to another monitor, OWC includes a Mini DisplayPort to HDMI adapter. OWC notes explicitly its dock cannot support the 27-inch model LED Cinema Display.</span> </li></ul><p>For either the 24-inch or 27-inch USB Cinema Display:</p>\n\n\n\n<ul><li><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://eshop.macsales.com/shop/docks/owc-thunderbolt-3-dock&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">OWC Thunderbolt 3 Dock</a><span> ($294.75) brings two Thunderbolt 3 ports to the mix, as well as gigabit ethernet, a combo audio in/out jack, optical (S/PDIF) output, SD and Micro SD Card slots, and four USB 3.1 Type A ports. It supports simultaneous displays via Mini DisplayPort and Thunderbolt 3.</span> </li></ul><h2>ADC and DVI</h2>\n\n\n\n<p>Finally, we’re all the way back to the earliest range of digitally connected Apple LCD displays of a usable size. From 1999 to 2004, Apple released the 22-inch Apple Cinema Display (DVI in 1999, ADC in 2000), the 23-inch Cinema HD Display (ADC, 2002), the 20-inch Apple Cinema Display (ADC, 2003; DVI, 2004), and the 23-inch (DVI, 2004) and 30-inch (dual-link DVI, 2004) Cinema HD Display models. These ranged from 1600×1024 pixels for the earliest to 2560×1600 for the last largest monitor.</p>\n\n\n\n<div><figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://images.techhive.com/images/article/2016/05/apple-cinema-hd-display-30-100661045-orig.jpg&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\"><img src=\"https://images.techhive.com/images/article/2016/05/apple-cinema-hd-display-30-100661045-orig.jpg\" /></a><figcaption><p>Apple 30-inch Cinema HD Display</p>\n</figcaption></figure></div>\n\n\n\n<p>For all the DVI-based displays except the 30-inch HD model, you can turn to a simple, inexpensive adapter. For displays with ADC, you will have to find on eBay or elsewhere an ADC to DVI adapter, which were once plentiful. You might even have one in your junk box of old adapters. (Don’t try to fool me; I know you have one.)</p>\n\n\n\n<p>A few well-reviewed adapters include one from <a href=\"https://www.amazon.com/dp/B0768RFQ83?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Benfei</a> ($16.99), <a href=\"https://www.amazon.com/dp/B012B58JRM/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Cable Matters</a> ($19.99), and <a href=\"https://www.amazon.com/dp/B07GWDXTWX/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Weton</a> ($25). Weton’s adapter also supports output to VGA and HDMI.</p>\n\n\n\n<p>The dual-link DVI port on the 30-inch Apple Cinema HD Display requires a different approach to pair together the separate DVI signals that drove the larger display. At least one reader had success with <a href=\"https://www.amazon.com/gp/product/B07QKM856C/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">the Club 3D dual-link DVI to USB-C adapter</a> ($44).</p>\n\n\n\n<p>You can also opt to find a Apple Mini DisplayPort to Dual-Link DVI Adapter, which is no longer manufactured, but shows up on eBay and elsewhere from time to time. Monoprice also offered such an item, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.monoprice.com/product?p_id=6904&amp;xcust=1-1-233993-0-0-0&amp;sref=https://www.macworld.com/feed\">but it’s out of stock</a>, too, of course. This adapter paired with a Mini DisplayPort adapter or dock with the port noted for Mini DisplayPort-era monitors has worked for some.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d49d6412206dd9172a838e20f2adbb86f55bbfedc9bc8d88e740d8650f44b3ca","category":"Apple"}