{"title":"172 Effects of post-MSC DDGS inclusion in gestation diets on total tract nutrient and energy digestibility compared with other fiber sources","link":"https://academic.oup.com/jas/article/102/Supplement_2/190/7664687?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The high fiber content of corn dried distiller grains with solubles (DDGS) make it an ideal candidate for inclusion in gestation sow diets. Gestating sows, however, have greater utilization of fibrous ingredients, and nutrient values attained in grower pigs are not representative of nutrient metrics for gestating sows. The objective of this study was to evaluate apparent total tract digestibility (ATTD) of energy and nutrients from post-protein separation (post-MSC) DDGS provided to gestating sows in comparison with soyhulls and sugar beet pulp; two commonly used fiber sources in gestation diets. Pregnant sows [n = 22; parity 0 to 1; initial body weight (BW) = 190 ± 10 kg] were allocated to 1 of 6 dietary treatments in a crossover design with two collection periods (period 1 from d 40-59 of gestation and period 2 from d 60-79 of gestation) to attain at least 7 observations per treatment. Two of the six diets were practical corn-soybean meal-based gestation diets with either soyhulls (17.5% inclusion) or post-MSC DDGS (15% inclusion) to determine ATTD of energy and nutrients in complete diets. The remaining four diets included a corn-basal diet and the basal diet plus 30% inclusion of post-MSC DDGS, soyhulls, or sugar beet pulp. Titanium dioxide was included as an indigestible marker to calculate ATTD. Sows were fed experimental diets (2.2 kg/d in a single feeding) in two 20-d collection periods where the initial 14 d considered a diet adaptation period followed by 5 d for total collection of urine (collected using urine catheters inserted on d 14) and grab fecal samples. Energy values for the post-MSC DDGS, soyhulls, and sugar beet pulp in the corn-basal diets were calculated using differential procedure. Data were analyzed with ANOVA and fixed to a mixed linear model using treatment as the main effect and collection period as a random variable. The ATTD of the post-MSC DDGS practical diet was 8% greater in ATTD of crude protein and 13% greater in ATTD of ether extract than the practical soyhull diet (<span>P</span> &lt; 0.01). The ATTD of gross energy of post-MSC DDGS was 16% greater than soyhulls (<span>P</span> &lt; 0.01). This resulted in an 800 and 750 kcal/kg greater digestible energy and metabolizable energy content, respectively on an as-fed basis in post-MSC DDGS compared with soyhulls and sugar beet pulp (<span>P</span> &lt; 0.01). The post-MSC DDGS also had a net energy value (as-fed basis) 700 kcal/kg greater than soyhulls and sugar beet pulp. In conclusion, post-MSC DDGS is suitable for inclusion in gestating sow diets as a fiber source while meeting the energy needs of the gestating sow.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d4a26231e0c3701be7434e1487d9ce0c1dcf4717aa946b1c1aa8cf7b7164d59a","category":"Environment"}