{"title":"Future iPhones may be able to detect depression, cognitive decline","link":"https://www.macworld.com/article/358489/future-iphones-may-be-able-to-detect-depression-cognitive-decline.html","date":1632239055000,"content":"<div>\n<section><div></div></section><p>While rumors about future health and fitness features usually pertain to the Apple Watch, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apple.news/Aq21yq0Z_TJyT1JEIFJj6Yg&amp;xcust=1-1-358489-1-0-0&amp;sref=https://www.macworld.com/feed\">a report in The Wall Street Journal</a> says Apple is looking to expand the iPhone’s role as well. Sources and documents seen by the Journal say that Apple is developing iPhone features that could help diagnose depression and cognitive decline.</p>\n\n\n\n<p>Apple is reportedly investigating whether the data collected for mobility, physical activity, sleep patterns, typing behavior and more can be used to find patterns that are associated with mental health conditions and create algorithms to detect them. In a project called “Seabreeze,” Apple is working with UCLA to study anxiety, depression, and stress. Another project called “Pi” is with Biogen to study cognitive development. </p>\n\n\n\n<p>The Wall Street Journal also reports that Apple has an undisclosed project with Duke University to help detect childhood autism. According to the Journal’s sources, the research “looks at using the iPhone’s camera to observe how young children focus, how often they sway back and forth, and other measures.”</p>\n\n\n\n<p>The Journal cautions that these research projects are in their early stages, and it’s possible Apple may find that the result does not lead to new iPhone features. However, Apple is reportedly “excited” about the possibilities of the research and how it may help find treatment in an era where rates of depression and other mental conditions are rising.</p>\n\n\n\n<p>The report notes that privacy issues could come up. Stressing user privacy has been a priority for Apple, and if the company does develop algorithms, they will likely work on the iPhone without sending data to Apple’s servers.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d4a5c80e828a2be28cc4e43ec6308a4b2872627b80fb31669333df0a659c3c42","category":"Apple"}