{"title":"Apple gets a much-needed win in Apple Watch court case","link":"https://www.macworld.com/article/2229595/apple-watch-alivecor-court-case-heart-rate-data.html","date":1707312087000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Just weeks after a judge found Apple at fault in its patent case with Masimo, forcing the company to <a href=\"https://www.macworld.com/article/2202755/kill-apple-watch-blood-oxygen-tool.html\">disable the blood-oxygen sensor</a> on new units, Apple got some good news in a separate Apple Watch case over heart monitoring.</p>\n\n\n\n<p>A <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/legal/apple-beats-alivecor-lawsuit-over-heart-rate-apps-apple-watch-2024-02-07/&amp;xcust=1-1-2229595-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">U.S. District Court judge ruled</a> that Apple will not have to face a trial over third-party access to Apple Watch heart rate data following an antitrust suit filed by AliveCor. AliveCor, which claims to have developed the world’s first personal ECG with KardiaBand, accused Apple of using “tactics in the heart rate analysis market [that] have injured competition, reduced consumer choice, and potentially damaged public health.”</p>\n\n\n\n<p>However, the judge didn’t agree, ruling that Apple’s watchOS 5 upgrade to the Apple Watch’s heart rate algorithm, which impacted KardiaBand’s functionality, was not anticompetitive and did not warrant the case going to trial. In a statement, Apple said: “AliveCor’s lawsuit challenged Apple’s ability to improve important capabilities of the Apple Watch that consumers and developers rely on, and today’s outcome confirms that is not anticompetitive. We thank the Court for its careful consideration of this case, and will continue to protect the innovations we advance on behalf of our customers against meritless claims.”</p>\n\n\n\n<p>AliveCor, which is also suing Apple over patent infringements, said it is “deeply disappointed” in the decision and plans to appeal.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d4a61541b24bf868482369f02c8cb7087fd2d316881b77638c67023e7c85528e","category":"Apple"}