{"title":"Effect of Vitamin C, D3, CA Supplements and Olive Paste Enriched with Mountain Tea on Health Biomarkers in Postmenopausal Women with Osteopenia or Osteoporosis: A Prospective Interventional Study","link":"https://www.preprints.org/manuscript/202404.1811/v1","date":1714273085000,"content":"Low dietary intake of calcium, vitamin D, vitamin C and magnesium has been associated with increased risk of osteoporosis. The purpose of the study was to evaluate changes in several bone health indicators and metabolic biomarkers in postmenopausal women, with high osteopenia or osteoporosis, followed by a nutritional intervention program. 115 apparently healthy postmenopausal women (52±8 years old) were randomized into four groups: group I (n=40) received daily 1000 mg vitamin C, 100 mcg vitamin D3, 500 mg calcium(Ca) and 300 mg magnesium (Mg); group II (n=42) received daily 100 mcg vitamin D3, 500 mg Ca and 300 mg Mg; group III (n=18) received daily 5 mg bisphosphonates, 100 mcg vitamin D3, 500 mg Ca and 300 mg Mg; and group IV (n=15) received daily about 364 mg polyphenols via an innovative functional food (50 g olive paste enriched with mountain tea extract) along with 100 mcg vitamin D3, 500 mg Ca and 300 mg Mg. Groups I -III received supplementation for a year whereas group IV for 5 months. Changes in bone health indicators and metabolic biomarkers were assessed at the beginning and at the end of the study. Anthropometric indices and whole-body bone mineral density (BMD) were also evaluated at the beginning and at the end of the intervention period. The results revealed improved elevated levels of 25(OH)D3, in groups II, III and IV (+3,71% and +1.45% and +5.62% respectively). Significant positive changes were recorded, for whole-body BMD, in all four study groups. Significant beneficial changes for total cholesterol were observed in group IV (-2.07%, P&amp;lt;0.05) and positive changes in group I for HDL biomarker (+61.62%, P&amp;lt;0.05). Additional larger-scale clinical trials and intervention studies are considered essential, to fully investigate and elucidate associations between dietary components and biochemical indices of bone health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d4ae81a39206d3c4ffe12eb6f494a17a0b30589882617a908aa954c805679f90","category":"Interdisciplinary"}