{"title":"Reduction of Xenogeneic Epitopes on Porcine Endothelial Cells by Periodate Oxidation","link":"https://www.preprints.org/manuscript/202406.0207/v1","date":1717565276000,"content":"Background: Patterns of humoral immune responses represent a major hurdle in terms of pig-to-human xenotransplantation approaches. The best-known xenogeneic glycan antigens pre-sent in pigs are the αGal (Galili-antigen) and the non-human sialic acid Neu5Gc. As there are further differences between porcine and human cellular surface glycosylation, a much broader range of glycan epitopes with xeno-reactive relevance can be anticipated. Therefore, we set-out to chemically modify porcine cellular surface glycans in a global approach by applying sodium peri-odate (NaIO4) oxidation. Methods: Porcine endothelial cells were exposed to oxidation with 1 to 5 mM NaIO4 for different time periods at 37°C or 4°C and under static or dynamic conditions. The impact on cellular sur-vival was determined applying live/dead-assays. Oxidation of αGal-epitopes was assessed by flu-orescence microscopy-based quantification of isolectin-B4 (IL-B4) staining. Overall immunogenic-ity of porcine cells was determined by human serum antibody binding. Results: Treatment of porcine endothelial cells and tissues with NaIO4 led to a reduced binding of the αGal-specific IL-B4 and/or human serum antibodies. NaIO4 revealed to be cytotoxic when performed at elevated temperature and for prolonged time. However, by applying 2 mM NaIO4 for 60 min at 4°C a high extent of cellular viability and a relevant reduction of detectable αGal epitope were observed. No differences were detected irrespectively on whether the cells were oxi-dized under static or flow conditions. Conclusion: Glycan epitopes on living cells can be oxidized with NaIO4 while maintaining their viability. Accordingly, this strategy holds promise to prevent immune reactions mediated by pre-formed anti-glycan antibodies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d4c10a9b3c957cdd6717ba79e68b6a3f89546fb23a6275f5e6c1fc7bea568e81","category":"Interdisciplinary"}