{"title":"ดีอีเอสเพิ่มข้อบังคับจัดเก็บข้อมูลระบุตัวตน ต้องเก็บข้อมูลมากกว่าเดิมร้านเน็ตต้องตั้งกล้องวงจรปิด","link":"https://www.blognone.com/node/124235","date":1629008617000,"content":"<div><div><div><p>วันที่ 13 ส.ค. กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม ประกาศกฎหมายลูกของพ.ร.บ.คอมพิวเตอร์ฯ หลักเกณฑ์การเก็บรักษาข้อมูลจราจรทางคอมพิวเตอร์ของผู้ให้บริการ พ.ศ. 2564 ลงราชกิจจานุเบกษา  มีข้อกำหนดเพิ่มเติมหลายเรื่อง และแบ่งแยกประเภทผู้ให้บริการรูปแบบใหม่ๆ อย่าง Clubhouse และ Telegram ด้วย</p>\n<p>ประกาศฉบับนี้เป็นการอัปเดตจาก<a href=\"https://www.nbtc.go.th/getattachment/27f00aa9-5e67-449f-960d-29dc5b19d87a/540-551.pdf.aspx?ext=.pdf\">ประกาศฉบับเดิมเมื่อปี 2007</a> ที่ออกตามพ.ร.บ.คอมพิวเตอร์ฯ ฉบับแรก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/053a4d32806ff22742c11d3937bea1d4.jpeg\" /><br />\nนายชัยวุฒิ ธนาคมานุสรณ์ รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (ดีอีเอส)</p>\n<p>พ.ร.บ.คอมพิวเตอร์ฯ ระบุให้ผู้ให้บริการต้องเก็บล็อกที่สามารถระบุรายละเอียดผู้ใช้บริการเป็นรายบุคคลได้ (Identification and Authentication) เช่น ลักษณะการใช้บริการ Proxy Server, Network Address Translation (NAT) หรือ Proxy Cache หรือ Cache Engine หรือบริการ Free Internet หรือ Wi-Fi Hotspot มาแต่แรก แต่ประกาศฉบับใหม่นี้เพิ่ม มาตรฐานการเก็บข้อมูลจราจรเข้ามาในภาคผนวก ข. มีเงื่อนไขหลายประการเพิ่มเติม เช่น รายละเอียดการใช้บริการในระบบคอมพิวเตอร์, ข้อมูลตัวอุปกรณ์ที่เข้าใช้งาน (system ID), รายงานการล็อกอินต้องระบุถึงการล็อกอินที่ไม่สำเร็จ, ไปจนถึงรายละเอียดธุรกรรมที่กำลังใช้งาน</p>\n<p>ประกาศฉบับนี้ยังเพิ่มหมวดหมู่ผู้ใ้หบริการเพิ่มเติมเข้ามาอีกสองหมวด ได้แก่ บริการสื่อสารและแอปสโตร์ ที่รวมถึง  เช่น App Store, Google Play, Clubhouse และ Telegram โดยเรียกว่า \"ผู้ให้บริการโปรแกรมคอมพิวเตอร์ ซอฟต์แวร์ เทคโนโลยีปัญญาประดิษฐ์, แอปพลิเคชัน ที่ให้บุคคลทั่วไปสามารถติดต่อสื่อสารข้อมูลถึงกันได้ (Online Application Store)\" ในขณะที่แพลตฟอร์มหลักอย่าง Facebook, YouTube, WhatsApp, LINE, Instagram ถูกจัดอยู่ในหมวดหมู่ \"ผู้ให้บริการสื่อสังคมออนไลน์รวมถึงผู้ให้บริการในฐานะสื่อกลางในการรับส่งข้อมูลผ่านระบบเครือข่ายคอมพิวเตอร์ไม่ว่าจะมีระบบบอกรับสมาชิกหรือไม่ก็ตาม\"</p>\n<p>สำหรับกรณีที่เป็นผู้ให้บริการร้านอินเทอร์เน็ตก็ต้องจัดเก็บข้อมูล จะต้องติดตั้งกล้องวงจรปิดและบันทึกรายละเอียดการเข้าใช้งานของผู้ใช้บริการหรือลูกค้าในร้านของตนที่สามารถระบุตัวตนได้ และทำบันทึกที่เกี่ยวข้องกับการเข้าใช้บริการของลูกค้าของตนในแต่ละวันเพื่อให้ใช้เป็นหลักฐานที่ตรวจสอบได้ในภายหลัง</p>\n<p>ที่มา - <a href=\"http://www.ratchakitcha.soc.go.th/DATA/PDF/2564/E/188/T_0009.PDF\">ประกาศกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม</a>, <a href=\"https://plus.thairath.co.th/topic/speak/100305\">ไทยรัฐพลัส</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/law\">Law</a></div><div><a href=\"/topics/clubhouse\">Clubhouse</a></div><div><a href=\"/topics/telegram\">Telegram</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d4c97fa678a047c871c6666ab41c6c92a7783c2e1d17b25d6651d0827af97362","category":"Thai"}