{"title":"watchOS 10 could be the star of WWDC with ‘notable’ UI changes on the way","link":"https://www.macworld.com/article/1680558/watchos-10-wwdc-upgrade-changes-user-interface.html","date":1680614070000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Of all the operating systems set to be released at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a>, watchOS generally gets the least attention. But a new report says version 10 will be the surprise hit of WWDC, bringing a “fairly extensive upgrade.”</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1642624542458904576&amp;xcust=1-1-1680558-1-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman of Bloomberg</a>, Apple is planning to deliver a substantial upgrade to watchOS this year in contrast to iOS 17 and macOS 14, which is expected to have few blockbuster features. Gurman doesn’t divulge any details as to what Apple may be planning but says to expect “notable changes to the user interface.”</p>\n\n\n\n<figure><div>\n<blockquote><p>I believe the new watchOS should be a fairly extensive upgrade — with notable changes to the user interface — unlike iOS 17. It’s important for watchOS to have a big year given that the Apple Watch hardware updates will be anything but major. The device is poised for a more… <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/cXFOrLkawE&amp;xcust=1-1-1680558-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/cXFOrLkawE</a></p>— Mark Gurman (@markgurman) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1642624542458904576?ref_src=twsrc%5Etfw&amp;xcust=1-1-1680558-1-0-0&amp;sref=https://www.macworld.com/feed\">April 2, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>On the contrary, <a href=\"https://www.macworld.com/article/782575/watchos9-features-release-how-to-install.html\">watchOS 9</a> was an extremely minor update, with Low Power Mode, a few new workout features, support for medication tracking, and some Sleep app enhancements.  </p>\n\n\n\n<p>While the Apple Watch has gone through several design changes over the years, watchOS has stayed remarkably consistent. Each year, Apple brings a couple of new features and apps, and a handful of watch faces, but it’s yet to get a massive overhaul like iOS 7 or Mac OS X. It’s not clear whether this update will be along those lines or bring less obvious changes like watchOS 3, but Gurman says watchOS will have a big year “given that the Apple Watch hardware updates will be anything but major.”</p>\n\n\n\n<p>WWDC kicks off on June 5 with a keynote at 10 a.m. PT, where Apple will preview the 2023 updates to its suite of OSes, including iOS 17, macOS 14, and watchOS 10. It could also be the launch of Apple’s <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">first AR headset</a> along with xrOS. It’s been previously reported that iOS 17 and macOS 14 will have fewer new features than usual due to Apple’s focus on the development of its AR headset.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d4ce830bf95ab6e87e9034b75338354c2a3bcd0b7a76a443e2dd413f73fb3eaa","category":"Apple"}