{"title":"Apple Directs Users Not to Hang Up on Operators in Accidental Crash Detection Calls","link":"https://www.macrumors.com/2023/04/05/crash-detection-support-document-update/","date":1680733680000,"content":"With the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models, Apple introduced <a href=\"https://www.macrumors.com/how-to/iphone-14-disable-car-crash-detection/\">a Crash Detection feature</a> that is designed to contact emergency services automatically should a collision be detected. Crash Detection has already saved lives, but there have also been a number of complaints about the option <a href=\"https://www.macrumors.com/2022/11/30/crash-detection-triggered-by-skiers/\">accidentally triggering</a> at ski resorts, amusement parks, and in other non-emergency high-activity situations.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/iphone-14-pro-car-crash-detection.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nApple has introduced <a href=\"https://www.macrumors.com/guide/ios-16-4-new-features/\">Crash Detection optimizations</a> in the last several <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a> updates to try to cut down on false calls, and now the company has new recommendations for users that accidentally activate the crash detection feature. In an updated <a href=\"https://support.apple.com/en-us/HT213225\">Crash Detection support document</a>, Apple directs users not to hang up if an accidental call is placed, and to instead explain to the emergency responder that help is not required.<blockquote>If the call has been made, but you don't need emergency services, don't hang up. Wait until a responder answers, then explain that you don't need help.</blockquote>Apple also removed a line in the support document that suggested users cancel a call during the timer period. \"If you don't need to contact emergency services, tap Cancel and confirm that you don't need emergency services,\" read the sentence that has been pulled from the document.\r<br />\n\r<br />\nThe Crash Detection support site continues to suggest that users should dismiss an alert if they are able to do so, but Apple appears to want to put a stop to <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users canceling or hanging up on an already-started emergency call and leaving emergency responders wondering what happened.\r<br />\n\r<br />\nEmergency dispatchers around ski slopes have been <a href=\"https://www.macrumors.com/2023/01/14/apple-feedback-on-false-911-calls/\">particularly unhappy</a> with the number of accidental calls that are being received from Crash Detection. Skiing and snowboarding tumbles are able to trigger Crash Detection, and with the heavy clothing worn with these activities, ‌iPhone‌ and Apple Watch users sometimes don't notice that an emergency call has been placed.\r<br />\n\r<br />\nIn <a href=\"https://www.macrumors.com/2023/02/03/apple-responds-to-false-crash-detection-report/\">Colorado's Summit County</a>, for example, 185 accidental Crash Detection calls were received in a week in January, wasting time and resources needed for actual emergencies. Summit County emergency services director Trina Dummer said in February that the situation threatens to \"desensitize dispatchers and divert limited resources from true emergencies.\"\r<br />\n\r<br />\nApple in response sent four representatives to Summit County to observe the emergency call center, and further optimizations have since been added.\r<br />\n\r<br />\nCrash Detection is available on the ‌iPhone 14‌ models and the latest Apple Watch models. Using sensors like the accelerometer and gyroscope, it can detect a severe car crash and automatically call emergency services if a user does not respond to an alert within 20 seconds.<br />This article, \"<a href=\"https://www.macrumors.com/2023/04/05/crash-detection-support-document-update/\">Apple Directs Users Not to Hang Up on Operators in Accidental Crash Detection Calls</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-directs-users-not-to-hang-up-on-operators-in-accidental-crash-detection-calls.2386018/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d4d07d8fa6379b5f5e519f61619890d302e38863805c87ef6bd922fd8fe0dbc3","category":"Apple"}