{"title":"With 7,000+ satellites and growing, is space sustainable? An Ars Frontiers recap","link":"https://arstechnica.com/?p=1945689","date":1686070658000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Ars-Frontiers-2023-Livestream-1-20-33-screenshot-800x450.png\" alt=\"Eric Berger (upper left) moderated a panel featuring (clockwise) Alex Fielding, Charity Weeden, and Bhavya Lal on the topic of satellites and low-Earth orbit.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Ars-Frontiers-2023-Livestream-1-20-33-screenshot.png\">Enlarge</a> <span>/</span> Eric Berger (upper left) moderated a panel featuring (clockwise) Alex Fielding, Charity Weeden, and Bhavya Lal on the topic of satellites and low-Earth orbit. (credit: Ars Technica)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The space industry has seen a dramatic uptick in the number of satellites launched into low-Earth orbit in recent years. Much of this growth, but not all of it, has been driven by the rapid expansion of SpaceX's Starlink megaconstellation, which is now populated by more than 4,000 satellites.</p>\n<p>In our space panel for Ars Frontiers, I had the pleasure of discussing the implications of this growth in satellites and space-based services with a distinguished panel of experts. Many issues, good and bad, have arisen, from the cluttering of low-Earth orbit to the development of powerful tools used in conflict, such as synthetic aperture radar and communications in Ukraine. You can watch <a href=\"https://www.youtube.com/watch?v=P5yPqdOUHsU&amp;t=4736s\">the entire discussion here</a>.</p>\n<p>It's important to realize how much the environment in low-Earth orbit has changed over the last five years. This is the area of space from about 100 km in the atmosphere up to about 2,000 km. But the majority of satellites are clustered within a few hundred kilometers of the surface of the Earth.</p></div><p><a href=\"https://arstechnica.com/?p=1945689#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1945689&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d4d76fac1c8cc627d5b1632c3fb1216f86b2137363487b4037212f93ef140bdf","category":"Tech"}