{"title":"Road and gravel bike rim width: Everything you need to know","link":"https://www.cyclist.co.uk/in-depth/10254/road-gravel-bike-rim-width","date":1637060308000,"content":"<span>\n      <span><a href=\"/authors/joseph-delves\">Joseph Delves</a></span>\n  </span><div>  \n  <div>      <div><span>16 Nov 2021</span></div>    </div></div><p>\nThe Cyclist guide to understanding how rim width affects the performance of your bike </p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2/24//internal_rim_width.jpg?itok=IzhjihRW\" />  </div>\n<div>\n      <p> Back when most <a href=\"/buying-guides/4343/best-road-bike\" target=\"_blank\">road bikes</a> used rim brakes and <a href=\"/in-depth/9790/best-of-the-best-cyclist-s-favourite-gravel-bikes\" target=\"_blank\">gravel bikes</a> hadn't been invented, rim width was barely a consideration, but these days it's an important spec detail that's worth paying attention to whether you're shopping for a new bike, new wheels, or a replacement set of tyres.</p>\n<p>It used to be the case that almost all roadies believed narrow tyres were faster, so rims rarely needed to support tyres wider than 28mm. In any case, rim width was naturally limited by the available space between your rim brake pads. This situation rolled along happily enough until a few innovations arrived in quick succession.</p>\n<p>First, disc brakes suddenly meant rim design wasn't restricted by the requirement to also provide a braking surface. Secondly, advances in physics and aerodynamics led to the understanding that wider rims and <a href=\"/buying-guides/8408/best-road-cycling-tyres-the-best-tyres-for-all-occasions\" target=\"_blank\">road bike tyres</a> can often be more aerodynamic and faster rolling.</p>\n<p>Finally, the style of bikes people wanted to ride and the attributes they prized changed. With greater interest in grip and comfort among roadies, along with wider <a href=\"/buying-guides/9253/buyers-guide-the-best-gravel-bike-tyres\" target=\"_blank\">gravel tyres</a>, suddenly everyone wanted wider tyres. To provide support to these increasingly swollen treads, rims also began to grow in width.</p>\n<p>Now rim width is not just a measurement but a selling point. A key factor when buying a bike or <a href=\"/buying-guides/1178/buyers-guide-wheel-upgrades\" target=\"_blank\">upgrading your wheelset</a>, we'll explain which width is correct for you...</p>\n<h2>How is bicycle rim width measured?</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2/25//rim_width.jpg?itok=hNbeutfL\" />  </div>\n</div>\n<p>Bicycle rims have an inner and outer width. The internal rim width is the more crucial. You can find this by measuring the distance across the interior of the rim. The measurement is taken between the crotchets (or hooks) that hold the tyre bead in place, or simply between the inner walls of the rim on a hookless rim.</p>\n<p>The exterior width won't affect tyre compatibility, although it does influence aerodynamics. You can find it by measuring across the widest part of the rim from one outer surface to the other.</p>\n<p>Rather than measuring, you could also look up the rim's ISO (International Standards Organisation, or ETRTO (European Tyre and Rim Technical Organisation) number. The first part of this number is the bead seat diameter (BSD). This describes the diameter of the rim at the point where the tyre bead sits. A standard 700c wheel will have a BSD of 622mm.</p>\n<p>The second number is the inner rim width. This can range from a little above 10mm on older road rims to over 20mm on the latest carbon models. Gravel and mountain bike rims can be significantly wider.</p>\n<p>For example, <a href=\"/mavic/8990/mavic-wheels-2021-mavic-launches-new-era-with-refined-range\" target=\"_blank\">Mavic's Ksyrium S wheelset</a> has an internal rim width of 19mm, so its ISO/ETRTO number would be 622-19.</p>\n<h2>Tyre width vs. rim width: What’s the best rim width for road bikes?</h2>\n<h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2020/03/swiss_alpes_vaudoises_078.jpg?itok=g_cHcyRl\" />  </div>\n</div>\n</h2>\n<p>In recent years, elite racers have gone from using 23mm tyres to often employing models as wide as 30mm. Given that they are grippier, comfier, and safer, many road bikes now come with 28-32mm tyres as standard. Even for dedicated racers, 28mm is close to becoming the new normal.</p>\n<p>To accommodate these wider tyres it's a good idea to look for an internal rim width around 18-23mm. Matched to a carbon rim with an exterior a couple of millimetres wider than the tyre itself, this should provide the best aerodynamic profile without adding excessive weight. Resulting in a smoother and faster ride, you'll be happy you made the switch.</p>\n<p>Need a little more detail on why? Let's get into it.</p>\n<h3>Rim width and aerodynamics</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/tyre_cross_section.jpg?itok=Q6rqXACe\" />  </div>\n</div>\n<p>Going fast on a road bike often comes down to aerodynamics. To make a wheelset aerodynamically efficient, the shape of both tyre and rim need to be considered together. This is important as using a rim that's slightly wider than your tyre will generally result in the most aerodynamic profile. Traditionally, rims have held tyres that balloon outwards above them.</p>\n<p>However, this has been proved to be a poor arrangement for smoothing the airflow over both components. Instead, a rim that slightly overhangs the tyre by around a millimetre provides a better silhouette. This was an easy enough proposition when people stuck to using 23mm tyres. However, as riders have shifted to wider tyres in search of greater comfort and improved real-world performance, rim widths struggled to keep up.</p>\n<p>Happily, the emergence of disc brakes has freed designers to reconsider the shape of the rim. Combined with carbon fibre construction, it's now common to find road bike rims with exterior profiles up to 30-32mm wide. Ideally suiting them to use with tyres around 28-30mm wide, some firms such as Hunt even build out the sides of their rims to increase the difference between the tyre's width and the width of the rim.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10194/rapha-headquarters-london\">The good cult: Behind the scenes at Rapha</a></div>      <div><a href=\"/news/7438/pippa-york-calls-for-inclusion-of-lgbtq-community-in-sport\">Pippa York calls for inclusion of LGBTQ community in sport</a></div>      <div><a href=\"/rapha/9902/british-cycling-and-rapha-partner-for-inclusivity-initiative\">British Cycling and Rapha partner for inclusivity initiative</a></div>      <div><a href=\"/in-depth/8502/comment-to-prescribe-cycling-first-you-need-to-make-it-more-inclusive\">Comment: To prescribe cycling, first you need to make it more inclusive</a></div>      <div><a href=\"/tutorials/9120/how-to-get-on-zwift-without-a-smart-turbo-trainer\">How to get on Zwift without a smart turbo trainer</a></div>    </div></div><h3>Other factors</h3>\n<p>Beyond the high science of aerodynamics, changing the width of your rims will affect the shape of your tyres. While tyres have a nominal width that roughly corresponds to the distance across their widest part when inflated, their actual width will change depending on the dimensions of the rim they're mounted to. The average road tyre can actually lose or gain a couple of millimetres of width depending on the rim it's fitted to.</p>\n<p>At the same time, using the ideal width rim will lend the tyre a better shape. A little blunter and less light bulb-like, the shape imparted by a wider rim will provide a larger volume of air, a more gentle radius, and less deformation. Letting your tyres roll smoother and some cases faster, it's a great way of improving their performance.</p>\n<h3>Rim width, tyre volume and tyre pressure</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2020/03/tyre_pressure.jpg?itok=9O6MxHeS\" />  </div>\n</div>\n<p>In recent years road cyclists have realised that while pumping your tyres rock hard might feel fast, the inability of high-pressure tyres to absorb vibration actually makes you slower. This reduction in average tyre pressures has also accelerated the switch to wider rims. You can dig into the science with our in-depth feature on <a href=\"/%5Bhttps%3A//www.cyclist.co.uk/in-depth/8131/can-wider-tyres-and-lower-pressures-make-you-faster%5D\" target=\"_self\">how wider tyres and lower pressures can make you faster</a>.</p>\n<p>Unfortunately, narrow tyres like the 23mm models formerly found on most bikes don't like to be run too soft due to their low volume. Instead, if you want to run lower pressures on your road bike, you're better swapping to tyres in the 25-32mm range. This trend for wider rubber means even basic wheelsets have generally increased a few millimetres in width over the past decade to better accommodate broader tyres.</p>\n<h3>Matching tyre width and rim width</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2020/06/wider-tyres-lower-pressure-3.png?itok=djm-pOgI\" />  </div>\n</div>\n<p>Of course, almost any width tyre can be made to fit onto the rim of a correct diameter wheel (one key exception being road systems that have safety-critical compatibility criteria). However, this doesn't mean that every tyre will be happy when fitted to any old rim.</p>\n<p>Generally, wider tyres pair better with wider rims. Imagine a balloon. Think how the knot pinches its shape at the bottom; this is a bit like a very narrow rim constricting a wide tyre. You might get a nice round shape, but how stable will it be to ride on?</p>\n<p>Next, think of the tyres on a car. The width of the rim and the sides of the tyre's casing are almost equal; this provides a very stable pairing. The final alternative is a rim that's too wide for the tyre; this is often what happens if you try and run a narrow 23mm tyre on the latest wide road rims. As the tyre tries to span the gap, it loses its depth and takes on a flattened profile. This harms handling and, in extreme cases, can be dangerous. It's why matching rim and tyre width is essential.</p>\n<p>Annoyingly though, there's no hard and fast rule for matching tyres and rims. This is compounded by the fact tyres listed as the same width often measure differently in real life. However, as a rough rule of thumb, if you want to run tyres towards the broader end of those found on road bikes (like those in the 28-32mm range), look for road wheels with the widest internal rim measurements (17-22mm). Alternatively, if you're happy with narrower tyres (in the 23-28mm range), rims with more restricted 14-17mm internal widths will generally be fine.</p>\n<p>If possible, see if either your wheel or tyre maker offers specific recommendations.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10194/rapha-headquarters-london\">The good cult: Behind the scenes at Rapha</a></div>      <div><a href=\"/news/7438/pippa-york-calls-for-inclusion-of-lgbtq-community-in-sport\">Pippa York calls for inclusion of LGBTQ community in sport</a></div>      <div><a href=\"/rapha/9902/british-cycling-and-rapha-partner-for-inclusivity-initiative\">British Cycling and Rapha partner for inclusivity initiative</a></div>      <div><a href=\"/in-depth/8502/comment-to-prescribe-cycling-first-you-need-to-make-it-more-inclusive\">Comment: To prescribe cycling, first you need to make it more inclusive</a></div>      <div><a href=\"/tutorials/9120/how-to-get-on-zwift-without-a-smart-turbo-trainer\">How to get on Zwift without a smart turbo trainer</a></div>    </div></div><h3>A note on hookless rims</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/01/agrimsectionspokefront.jpg?itok=4iQPCBaR\" />  </div>\n</div>\n<p>Hookless rims do without the traditional crochet or hook that normally helps hold the tyre in place. Lighter and more robust, you'll be seeing more of these tubeless-specific rims in the near future.</p>\n<p>One key thing to remember is that hookless rims are less able to accommodate tyres outside of their specified size range. That's why if you're using hookless wheels, you must check your tyres and wheels are compatible via the manufacturer's approved list.</p>\n<h2></h2>\n<h2>What's the best rim width for gravel bikes?</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/06/swartberg_pass_gravel_bike_04.jpg?itok=4DALPgrQ\" />  </div>\n</div>\n<p>Selecting a rim width for gravel bikes can be a bit trickier. With gravel bikes almost universally using disc brakes, there's no reason not to also use wide rims. But how wide?</p>\n<p>If you're using tyres in the 33-38mm range, a wide stance road rim will work fine. Alternatively, gravel-specific wheelsets will often have rims with an internal width in the 20-26mm range. As you start to push beyond 40mm tyres or switch to more mountain bike-style tyres, you may want to go even wider, as this will provide better support and stability, especially at lower pressures.</p>\n<p>If you use your gravel bike as a do-everything machine, an internal dim width of 21-23mm is the sweet spot, as this will work well with everything from 28mm road tyres to moderately chunky gravel rubber.  </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/components\">Components</a></div>    </div></div>","author":"jdelves","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d4dfb9adbfe6d72e0946afc0646c0a4e34b423201cca36893eb86c0a9ae87fc8","category":"Cycling"}