{"title":"Redox regulation of meristem quiescence: outside/in","link":"https://academic.oup.com/jxb/article/75/19/6037/7658921?rss=1","date":1714176000000,"content":"<span><div>Abstract</div>Quiescence is an essential property of meristematic cells, which restrains the cell cycle while retaining the capacity to divide. This crucial process not only facilitates life-long tissue homeostasis and regenerative capacity but also provides protection against adverse environmental conditions, enabling cells to conserve the proliferative potency while minimizing DNA damage. As a survival attribute, quiescence is inherently regulated by the products of aerobic life, in particular reactive oxygen species (ROS) and the redox (reduction/oxidation) mechanisms that plant have evolved to channel these into pervasive signals. Adaptive responses allow quiescent cells to compensate for reduced oxygen tension (hypoxia) in a reversible manner, while the regulated production of the superoxide anion (O<sub>2</sub>·<sup>−</sup>) facilitates cell division and the maintenance of stem cells. Here we discuss the role of ROS and redox reactions in the control of the quiescent state in plant meristems, and how this process is integrated with cellular energy and hormone biochemistry. We consider the pathways that sense and transmit redox signals with a focus on the central significance of redox regulation in the mitochondria and nucleus, which is a major regulator of quiescence in meristems. We discuss recent studies that suggest that ROS are a critical component of the feedback loops that control stem cell identity and fate, and suggest that the ROS/hypoxia interface is an important ‘outside/in’ positional cue for plant cells, particularly in meristems.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"d4e07506016d7d85ec3f78a525eb8755d2e2520f7816312b788de2a7fa509ef9","category":"Environment"}