{"title":"Putin wants to know why Russia can only build 40 satellites a year","link":"https://arstechnica.com/?p=1979681","date":1698691495000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1747242039-800x596.jpg\" alt=\"Russian President Vladimir Putin (L) and Roscosmos Space Corporation Chief Yuri Borisov peruse an exhibit while visiting the Korolev Rocket and Space Corporation Energia, October 26, 2023, in Korolev, Russia.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1747242039-scaled.jpg\">Enlarge</a> <span>/</span> Russian President Vladimir Putin (L) and Roscosmos Space Corporation Chief Yuri Borisov peruse an exhibit while visiting the Korolev Rocket and Space Corporation Energia, October 26, 2023, in Korolev, Russia. (credit: Contributor/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Based on <a href=\"https://lookerstudio.google.com/u/0/reporting/699ab106-4b2f-4f50-ac4e-759e2d15c650/page/p_1pl12ogu6c\">preliminary data</a>, nearly 2,400 spacecraft have been launched into orbit this year. A significant majority of these, about 75 percent, were Starlink satellites built and flown by SpaceX. But other countries, such as China, have also built and launched hundreds of satellites this year.</p>\n<p>There has been a dramatic growth in the production and launch of satellites into low-Earth orbit in recent years due to a few different trends. One is the commercialization of satellite production. Satellites for Earth observation and communication are becoming smaller and more affordable, and thanks to rideshare options, it costs less to launch them.</p>\n<p>Second, and most importantly, is the emergence of satellite megaconstellations that provide low-latency broadband Internet. Most prominent among these is SpaceX's Starlink constellation, but it is far from alone. In addition to the nearly 4,000 Starlink satellites in orbit, OneWeb has about 600 operational spacecraft. Other commercial constellations, including Amazon's Project Kuiper, are also coming. And both China and the European Union have announced plans to develop megaconstellations for communications purposes.</p></div><p><a href=\"https://arstechnica.com/?p=1979681#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979681&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d4e4147e92ecca951ce1b09a6d0263b90297a6ab26209addd141727062488fb4","category":"Tech"}