{"title":"Massive stocking of chum salmon (<i>Oncorhynchus keta</i>) fry fattens non-native brown trout (<i>Salmo trutta</i>) in Hokkaido, Japan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307552","date":1721397600000,"content":"<p>by Kentaro Honda, Koh Hasegawa, Masatoshi Ban, Yutaka Yano, Yuhei Ogura</p>\r\n\r\nIn Japan, stocked chum salmon (<i>Oncorhynchus keta</i>) fry may have become the perfect prey for non-native brown trout (<i>Salmo trutta</i>), which are popular targets of anglers. If this is the case, fry stocking which is intended to boost commercial fishing may be helping to sustain the populations of an invasive predator. We used dietary and biochemical analyses to examine whether brown trout quickly restore their nutritional status following wintertime declines by preying upon chum salmon fry that are stocked in spring. We targeted six rivers in Hokkaido, Japan, three with fry stocking and three without. Changes in brown trout condition factor, triglyceride contents in muscle and serum, serum insulin-like growth factor-1 (IGF-1; an indicator of short-term growth), and docosahexaenoic acid (DHA; an essential fatty acid abundant in fish) content in muscle were examined between before stocking and during the stocking period in the six rivers. Dietary analysis showed that brown trout preyed on fry during the stocking period in all stocked rivers. Their nutritional status tended to be higher during the stocking period than before stocking in stocked rivers, but not in unstocked rivers. These results suggest that the massive stocking of chum salmon fry provides brown trout with the perfect prey to quickly restore their nutritional status and fuel increased growth; this may therefore be a controversial issue among stakeholders.","author":"Kentaro Honda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d4e687e2527ede5df3fe8e590777376ecdac11e14e9f17f4316018fceec6357f","category":"Interdisciplinary"}