{"title":"Re‐designing a yield‐improving strategy of pear orchards in the Yangtze River Basin, China","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13856?af=R","date":1725088984000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Pear yield is a primary source of income for smallholder farmers in China, yet significant yield disparities exist among different smallholders. Systematic analyses of limiting factors and the feasibility of solutions at the smallholder level are limited. This study employs a novel DEED (Describe, Explain, Explore, and Design) research cycle centered on smallholders to formulate yield-improving strategies.</p>\n<h2>RESULTS</h2>\n<p>A comprehensive survey of 173 smallholders in the Yangtze River pear district, encompassing Zhejiang province, Jiangxi province, and Shanghai city, was conducted to delineate the current yield status. The boundary line analysis model was applied to elucidate the contributions of various yield-limiting factors. Findings reveal an average yield ranging from 16.7 to 19.3 t ha<sup>−1</sup>, with a potential highest yield of 37.5 t ha<sup>−1</sup>. Fertilizer nitrogen (N) was identified as the most pervasive yield-limiting factor, constituting 62.7% of the average limitation at the regional level and 37.7% at the individual smallholder level, surpassing other yield-related factors in all three regions. Subsequently, a 2-year field optimization experiment was conducted to explore the potential for yield improvement through adjustments in N fertilizer rates. Compared with traditional farmer management (FM), the N fertilizer optimization treatment (OPT) resulted in a 38.1% and 22.5% increase in yield for 2022 and 2023, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>These results identify N fertilizer application rate as the most important yield-limiting factor and verify the feasibility of optimizing N fertilizer management practices for improving pear yield. This study integrates farmer surveys, boundary line models, and field experiments to provide valuable insights into addressing yield disparities among smallholders in the pear industry. © 2024 Society of Chemical Industry.</p>","author":"Hong Chen, \nJinling Chen, \nHaoran Fu, \nYanmei Ye","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d4f0a04a0b6e1bfe28c1a5f04891610fa621bc39965bbec3c54ed056c9c2a7d3","category":"Environment"}