{"title":"Scientists create new class of “Turing patterns” in colonies of E. coli","link":"https://arstechnica.com/?p=1744613","date":1614121824000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div class=\"video\"><div class=\"wrapper\" style=\"display:block\" type=\"text/html\" width=\"980\" height=\"550\" src=\"https://www.youtube.com/embed/mLAQl5M4PKo?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen></div><p class=\"caption\" style=\"font-size:0.8em\">Scientists have shown how a new class of Turing patterns work by using synthetic biology to create them from scratch in the lab. </p></div>\n<p>Shortly before his death, Alan Turing published a provocative paper outlining his theory for how complex, irregular patterns emerge in nature—his version of <a href=\"https://en.wikipedia.org/wiki/Just_So_Stories\">how the leopard got its spots</a>. These so-called Turing patterns have been observed in physics and chemistry, and there is growing evidence that they also occur in biological systems. Now a team of Spanish scientists has managed to tweak <a href=\"https://en.wikipedia.org/wiki/Escherichia_coli\"><em>E. coli</em></a> in the laboratory so that the colonies exhibit branching Turing patterns, according to <a href=\"https://pubs.acs.org/doi/10.1021/acssynbio.0c00318\">a recent paper</a> published in the journal Synthetic Biology.</p>\n<p>\"By using <a href=\"https://en.wikipedia.org/wiki/Synthetic_biology\">synthetic biology</a>, we have a unique opportunity to interrogate biological structures and their generative potential,\" <a href=\"https://www.santafe.edu/news-center/news/sole-and-colleagues-create-turing-patterns-lab\">said co-author Ricard Solé</a> of Universitat Pompeu Fabra in Barcelona, Spain, who is also an external professor at the Santa Fe Institute. \"Are the observed mechanisms found in nature to create patterns the only solutions to generate them, or are there alternatives?\" (Synthetic biology <a href=\"https://www.genome.gov/about-genomics/policy-issues/Synthetic-Biology\">typically involves</a> stitching together stretches of DNA—which can be found in other organisms, and be entirely novel—and inserting into an organism's genome.)</p>\n<p>In synthetic biology, scientists typically stitch together long stretches of DNA and insert them into an organism's genome. These synthesized pieces of DNA could be genes that are found in other organisms or they could be entirely novel.</p></div><p><a href=\"https://arstechnica.com/?p=1744613#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1744613&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d4fc3577f340e78827ab35922dc07410a240fd2fdc5af991d5c15d5a6b166056","category":"Tech"}