{"title":"Sendai virus-mediated RNA delivery restores fertility to congenital and chemotherapy-induced infertile female mice","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae375/7748050?rss=1","date":1725321600000,"content":"<span><div>Abstract</div>Current infertility treatment strategies focus on mature gametes, leaving a significant proportion of cases with gamete progenitors that stopped complete differentiation. On the other hand, recent advancements in next-generation sequencing have identified many candidate genes that may promote maturation of germ cells. Although gene therapy has shown success in mice, concerns about the integration of DNA vectors into oocytes hinder clinical applications. Here, we present the restoration of fertility in female mice through Sendai virus (SeV)-mediated RNA delivery. Ovaries lacking <span>Kitl</span> expression exhibit only primordial follicles due to impaired signaling to oocytes expressing the KIT tyrosine kinase. Despite SeVs being immunogenic and larger than the blood-follicle barrier, the administration of <span>Kitl</span>-expressing SeVs reinitiated oogenesis in genetically infertile mice that have only primordial follicles, resulting in the birth of normal offspring through natural mating. This virus also effectively addressed iatrogenic infertility induced by busulfan, a widely used cancer chemotherapy agent. Offspring born through SeV administration and natural mating displayed normal genomic imprinting patterns and fertility. Since SeVs pose no genotoxicity risk, the successful restoration of fertility by SeVs represents a promising approach for treating congenital infertility with somatic cell defects and protecting fertility of cancer patients who may become infertile due to loss of oocytes during cancer therapy.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"d50227ebec9456aa88f36f68ce6a377e33fb571dda4ea88eae1d48c85351c025","category":"Interdisciplinary"}