{"title":"Impact of Severe Obesity on Outcomes in Single-Level Anterior Cervical Discectomy and Fusion (ACDF): A Large-Scale Comparative Study","link":"https://www.preprints.org/manuscript/202409.1912/v1","date":1727179615000,"content":"Background: Anterior cervical discectomy and fusion (ACDF) is a common procedure for cervical radiculopathy and myelopathy. Severe obesity (BMI ≥40 or BMI ≥35 with comorbidities) is associ-ated with increased perioperative risks. This study examines the impact of severe obesity on out-comes in patients undergoing single-level ACDF. \nMethods :Data from the Nationwide Inpatient Sample (2016-2019) were analyzed, including 85,585 patients who underwent single-level ACDF. Patients were classified as severely obese (n = 4,935) or non-obese (n = 80,650). Outcomes such as length of stay, complications, and in-hospital mortali-ty were compared using SPSS and MATLAB, with a significance level of p &lt; 0.05. \n Results: Severely obese patients were younger (54 vs. 55.7 years, p &lt; 0.001) and had more comor-bidities like type 2 diabetes (38% vs. 17.8%, p &lt; 0.001) and obstructive sleep apnea (31.1% vs. 9.5%, p &lt; 0.001). They experienced longer hospital stays (1.92 vs. 1.65 days, p &lt; 0.001) but similar in-hospital mortality (0.1%, p = 0.506). Severe obesity was linked to higher odds of complications, the risk of developing dehiscence was 8.2 times higher in severely obese patients. Respiratory failure had an odds ratio of 6.5, while myocardial infarction showed an odds ratio of 5.5. Horner syn-drome was 4.7 times more likely to occur, and pulmonary edema had an odds ratio of 4.5. Dural tear risk was also significantly elevated, with an odds ratio of 4.1.The risk of developing acute kid-ney injury were 2.6 times higher, while the risk of pulmonary embolism was 2.5 times higher. Dysphonia was also more common in severely obese patients, with an odds ratio of 2.2. \nConclusion:\nSevere obesity is associated with higher complication rates and longer hospital stays following ACDF. Tailored perioperative management is essential to mitigate risks and improve outcomes in this high-risk population.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d50aba60f7d64bf9c28084ec853640dec99c8a34b2d7e745645a98d1ac59b6d8","category":"Interdisciplinary"}