{"title":"Evidence of Dextral Strike-Slip Movement of the Alakol Lake Fault in the Western Junggar Based on Remote Sensing","link":"https://www.preprints.org/manuscript/202405.0509/v1","date":1715168794000,"content":"The NW-SE trending dextral strike-slip faults on the north side of the Tian Shan play an important role in accommodating the crustal shortening, which mainly includes the Karatau fault, Talas-Fergana fault, Dzhalair-Naiman fault, Aktas fault, Dzhungarian fault (also named Bolokenu-Aqikekuduk fault) and Chingiz fault. The classic viewpoint is that the strike-slip fault is the adjustment product caused by the difference of the crustal shortening from west to east. Another viewpoint attributes the dextral strike-slip fault to large-scale sinistral shearing. The Alakol Lake Fault is situated along the northern margin of the Dzhungarian Gate, stretching for roughly 150 km from Lake Ebinur to Lake Alakol. Our team utilized aerial photographs, Satellite Stereo-imagery, and field observation to map the distribution of the Alakol Lake fault. Our findings provided evidence supporting the assertion that the fault is a dextral strike-slip fault. In reference to its spatial distribution, Lake Alakol is situated in a pull-apart basin that lies between two major dextral strike-slip fault lines: the Chingiz and Dzhungarian faults. The Alakol Lake Fault serves as a connecting point for these two faults, resulting in the formation of a mega NW-SE dextral strike-slip fault zone. According to our analysis of the dating samples taken from the alluvial fan, as well as our measurement of the displacement of the riser and gully, it appears that the Alakol Lake fault has a dextral strike-slip rate of 0.8-1.5mm/yr. The strike-slip rate of the Alakol Lake fault is comparatively higher than that of the Chingiz fault in the northern region (~0.7 mm/yr), but slower than that of the Dzhungarian fault in the southern (3.2-5 mm/yr). The Chingiz-Alakol-Dzhungarian fault zone shows a gradual decrease in deformation towards the interior of the Kazakhstan platform. We contend that the rate of deformation observed is better explained by the crustal shortening adjustment model, rather than the large-scale sinistral shearing model.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d510172373013bb2ade343b5dbd8578c79b98dd9252c0c7952fcffbcc26b04e8","category":"Interdisciplinary"}