{"title":"HDC1 Promotes Primary Root Elongation by Regulating Auxin and K+ Homeostasis in Response to Low K+ Stress","link":"https://www.preprints.org/manuscript/202410.1149/v1","date":1728987500000,"content":"Plants frequently encounter relatively low and fluctuating potassium (K+) concentrations in soil, with roots serving as the primary responders to this stress. Histone modifications, such as de-/acetylation, can function as epigenetic marks on stress-inducible genes. However, the signaling network between histone modifications and the low K+ (LK) response pathways remains unclear. This study delves into the regulatory role of Histone Deacetylase Complex 1 (HDC1) in primary root growth of Arabidopsis thaliana under K+ deficiency stress. Using a hdc1-2 mutant line, we observed that HDC1 positively regulates root growth under LK conditions. Compared to wild-type (WT) plants, the hdc1-2 mutant exhibited significantly inhibited primary root growth under LK conditions, whereas HDC1-overexpression lines displayed opposite phenotypes. No significant difference was observed under HK conditions. Further analysis revealed that the inhibition of hdc1-2 on root growth was due to reduced meristem cell proliferation rather than cell elongation. Notably, the root growth of hdc1-2 shows reduced sensitivity compared to WT after auxin treatment under LK conditions. HDC1 may regulate root growth by affecting auxin polar transport and subsequently auxin sensation, as evidenced by altered expression of auxin transport genes. Moreover, our study reveals a brake function of HDC1 in the regulation of CBL-CIPK-K+ channel related genes, thereby establishing a molecular link between histone deacetylation, auxin signaling, and CBL-CIPK pathway in response to K+ deficiency.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d517179b4c18c6d548c699765c827ed2d2f056ca4056278653fe08e87d716447","category":"Interdisciplinary"}