{"title":"Apple Explores iPhone 'Privacy Screens', Macs With Adjustable Viewing Angles","link":"https://www.macrumors.com/2023/11/22/iphone-privacy-screens-adjustable-viewing-angles/","date":1700661363000,"content":"Earlier this year, <em><a href=\"https://www.wsj.com/articles/apple-iphone-security-theft-passcode-data-privacya-basic-iphone-feature-helps-criminals-steal-your-digital-life-cbf14b1a\">The Wall Street Journal</a></em> published an in-depth report highlighting instances of thieves watching <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> owners enter their passcode before stealing the device in order to gain access to the device, data, and money.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/appleprivacyad-cleaned.jpg\" width=\"1600\" height=\"872\" />\r<br />\nWith knowledge of the ‌iPhone‌'s passcode, a thief can easily reset the victim's <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> password in the Settings app, even if <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a> or <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> is enabled. It also allows a thief to use <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a>, send Apple Cash, and access banking apps using passwords stored in <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> Keychain. \r<br />\n\r<br />\n\"We sympathize with users who have had this experience and we take all attacks on our users very seriously, no matter how rare,\" said Apple in response to the report. \"We will continue to advance the protections to help keep user accounts secure.\" \r<br />\n\r<br />\nApple did not provide any specific details about any next steps it might take to increase security, but there are indications that Apple may be seeking a hardware solution to scupper the scourge of so-called \"shoulder surfers.\" \r<br />\n\r<br />\nCurrent displays on Apple devices provide a 170-degree field of view, making it easier for others to glance at your ‌iPhone‌, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, or Mac screen. To counter this, two new patents by Apple propose innovative solutions to restrict screen visibility to just the user.\r<br />\n\r<br />\nThe first patent, \"<a href=\"https://image-ppubs.uspto.gov/dirsearch-public/print/downloadPdf/11822103\">Privacy Films for Curved Displays</a>,\" introduces a special screen covering that limits light emission to a single direction. \r<br />\n\r<br />\nPositioned directly in front of the screen, the user is witness to the display's full quality and optimal brightness. However, onlookers attempting to peek from even a slight angle to the left or right of this position are not so lucky, and see either a completely obscured view or, more likely, a blurred image.\r<br />\n\r<br />\nThe second patent, \"<a href=\"https://image-ppubs.uspto.gov/dirsearch-public/print/downloadPdf/11822165\">Displays with Adjustable Angles of View</a>,\" is designed for flat screens, and describes how a user could adjust a Mac's viewing angle in real-time to act as a filter. \r<br />\n\r<br />\nIn one embodiment, the user is able to control the screen's polarization using an array of adjustable louvres, effectively limiting visibility from side-on viewing angles and increasing the privacy of onscreen content. The patent also describes how a liquid crystal element could be used that restricts the visibility of certain colors when the screen is not viewed directly. \r<br />\n\r<br />\nAs with any filed patent, the technology is unlikely to appear in any product soon, if at all, but it does offer an interesting look at how Apple is considering ways to overcome privacy issues when users access their devices in public spaces.\r<br />\n\r<br />\nUntil such a time, users can adopt best practices for their own smartphone privacy, such as switching from a four-digit passcode to an alphanumeric passcode, which is more difficult for thieves to spy on. This can be done in the Settings app under ‌Face ID‌ &amp; Passcode → Change Passcode.\r<br />\n\r<br />\n<em>(Via <a href=\"https://appleinsider.com/articles/23/11/21/apple-working-on-privacy-tech-to-make-shoulder-surfing-iphone-screens-harder\">AppleInsider</a>.)</em><div>Tag: <a href=\"https://www.macrumors.com/guide/patent/\">Patent</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/22/iphone-privacy-screens-adjustable-viewing-angles/\">Apple Explores iPhone 'Privacy Screens', Macs With Adjustable Viewing Angles</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-explores-iphone-privacy-screens-macs-with-adjustable-viewing-angles.2411700/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d52b3fcb1deb4a75bc86eab8d19bad4eec6ae855aaaea7d6f16f3f17dda7567f","category":"Apple"}