{"title":"wcm.03.2024.368.373","link":"https://www.watconman.org/wcm-03-2024-368-373/","date":1719472321000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>EVALUATION AND STATISTICAL ANALYSIS OF SURFACE WATER QUALITY IN OUED ASSAKA IN THE PROVINCE OF GUELMIME, MOROCCO</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Mariam El-Marmara, Mouhsine Hadineb, Ghizlane Fattahb, Fatima Zahra Moussaidc, Bachegour, Hikmac, Jamal Mabroukid*, Mohammed Fekhaouia</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.03.2024.368.373\">10.26480/wcm.03.2024.368.373</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />One of the main environmental problems in Morocco is the water issue, due to the health and economic consequences of water pollution and inadequate sanitation, as well as the pressure on resources caused by increasing water demand. Water pollution is a scourge that threatens Morocco and other African countries. Morocco has one of the smallest natural water reserves in the world. In this respect, the Guelmim province region has seen an increase in critical points in terms of problems linked to the water system, which is defined by a fertile depression that threatens to flood, as well as problems linked to the scarcity of water resources and erosion. There are even environmental threats. In this study, we analyzed the water quality of the Oued d’Assaka basin in the Guelmim province. The results obtained showed that the alkalinity level of the water was stable, as the hydrogen potential was stable between 6.5 and 8.5. The electrical conductivity of the Assaka basin showed an increase in values exceeding standards by 2140 µs.cm-1 on point 4 and 4830 µs.cm-1 on point 2 of the sampling. Statistical analyses based on Pearson correlation were carried out for some of the physicochemical parameters analyzed in this study, notably pH, temperature, turbidity, and water hardness.</div>\n<p> </p>\n<h3>Keywords</h3>\n<p><span>Assaka; Pollution; water quality; Pearson correlation; statistical analysis (SPSS).</span></p>\n<h3>1. INTRODUCTION</h3>\n<div>\n<p>The main reasons for wastewater treatment before its possible reuse are Morocco’s drought, the demands of economic development, the generalization of access to drinking water for all citizens, and the protection of receiving environments. It is crucial for socio-economic development at local, regional, and national levels (Bhateria and Jain, 2016; Noureddine et al 2024; El Mahmouhi et al., 2016). Consequently, water resource management remains a major challenge, particularly in countries with arid or semi-arid climates, where these resources are crucial to the development of human, economic, and social activities (Taleb et al., 2021). Water is a natural resource vital to the survival of any ecosystem. For a society faced with growing water needs, preserving its quality remains an absolute priority (Afi et al., 2022). It is crucial to socio-economic development at local, regional, and national levels (El-Moustaqim et al., 2024; El-Moustaqim et al., 2023; Lesley et al., 2023). Consequently, water resource management remains a major challenge, particularly in countries with arid or semi-arid climates, where these resources are crucial to the development of human, economic, and social activities (mondiale de la Santé, 2019). One of the main environmental problems in Morocco is the water issue, due to the health and economic consequences of water pollution and inadequate sanitation, as well as the pressure exerted on resources by increasing water demand (Mabrouki et al., 2019; Mabrouki et al., 2022; Mabrouki et al., 2022, Mabrouki et al., 2023, Mabrouki et al., 2022). Water resources remain a major challenge to be preserved and used efficiently, particularly in countries with arid or semi-arid climates (Hem, 1959; Kijjanapanich, 2013). These reserves have a significant impact on human, economic, and social activities. Natural and human constraints, as well as water management and conservation, can affect the quality of natural surface water. In the province of Guelmim, numerous springs are frequently found in wadi beds ( Kouassi et al., 2013). They are used in construction, play a role in the development of the agricultural sector, and are a major tourist attraction and place of relaxation (Oumara and El Youssfi, 2022). The water table exploited in the Guelmim Plain is the most important aquifer recognized in the southern Anti-Atlas. The rapid expansion of the region’s population centers and the growing development of agricultural activity have led to overexploitation of the aquifer, resulting in a significant drop in water levels (Taleb, 2021; Lesley et al, 2023). In recent years, periods of drought have become increasingly common, resulting in an extremely large deficit that affects almost the entire country (Kouassi et al., 2013; Oumara and El Youssfi, 2022; Mahmouhi, 2016). The watershed appears to be a static unit of the landscape, but it is a dynamic and changing area hydrologically. Thus, the watershed is generally delimited on the surface by ridgelines, whose slopes divide the water between the different catchment areas (El Attaoui et al., 2023; Vecchio and Kuper, 2022; ATTOU, 2014). With the world’s population growth and economic development, water consumption has almost doubled over the last fifty years. A great deal of work has already been done on the issue of water in Africa, and in particular on drinking water in large African cities located in arid or semi-arid environments (Lenntech, 2024; Boulal, 2017). In the Assaka area, domestic wastewater is discharged directly into public spaces. Rainwater from the internal basins of the town of Guelmim is considerable and poses a flooding risk for houses along the Assif Ouzro and Targa Oufella rivers (Agence du Bassin Hydraulique de Draa Oued Noun, 2024; El Blidi, 2006; Agoumi and Debbarh, 2005). In the absence of a sewage treatment plant or controlled landfill to stabilize it, the product of the cleaning of cesspools is discharged directly into the natural environment (Bergier, 2009; du Maroc, n.d.). This is a problem of road communication between the two banks and, consequently, of the equipment department. Existing constructions on the bed of the chaâbats and hermetic obstacles erected in the path of the runoff increase the risk of flooding (Bergier, 2009 ; Gharbi, 1986).<br />\nThis work aims to provide a clear picture of the state of water quality in Oued Assaka de Guelmim, and to determine some of the origins of water pollution, within the limits of the analyses carried out at the various water quality monitoring network points, based on Moroccan water quality standards and the hydrogeological study of the region.</p>\n<h3>2. MATERIALS AND METHOD</h3>\n<p><strong>2.1 Presentation of the study area</strong><br />\nThe province of Guelmim, which was created by decree no. 2.79.123 of 01-01-1979, is located in the southeast of the Kingdom and is part of the Guelmim Oued Noun region. Assaka or the center of Targa-Wassay lies to the east-west of the town of Guelmime, some twenty kilometers away, and is served by the RP1300 provincial road (Chouafa Nesrine, 2022; Mohammed and Anas, 2021). Housing and cultivated land are concentrated on the left bank of Oued Assaka. Average annual rainfall is around 120 mm, but there is considerable random variability between 15 mm and 300 mm. At its mouth, the Oued Assaka basin, which drains the Guelmim basin, covers an area of 6,840 km2 (du Maroc, n.d.; Humbert, 2013). The Oued Assaka, which crosses the coastal relief via a gorge, collects the residual floodwaters from these basins and from a complementary basin of 410 km2, after spreading out over the plain (Mohammed and Anas, 2021; Mekki et al., 2021).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"463\" height=\"291\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/F1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/F1.jpg 463w, https://www.watconman.org/wp-content/uploads/2024/06/F1-300x189.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Figure 1: Presentation of the study area.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The Guelmim basin (Figure 1) is structured as a syncline, centered on the Jbel Tayert, crowned by the quartzite bars of the terminal Acadian. The fill on either side of these reliefs consists of plio-quaternary blanket deposits overlying the bedrock Acadian shales. In these areas, domestic wastewater is discharged directly into public spaces (Gharbi, 2024; Albab et al., 2013). Rainwater from the city’s internal basins is considerable and poses a flooding risk for houses along the Assif Ouzro and Targa Oufella rivers. In the absence of a sewage treatment plant or controlled landfill to stabilize it, the sewage from cesspools is discharged directly into the natural environment. Wastewater from the municipal abattoir and slaughterhouse residues are also affected (Moussa et al., 2012; El Arabi, 2021).</p>\n<p><strong>2.2 Climate conditions</strong><br />\nThe study area is characterized by an arid climate (Figure 2), with very frequent winds causing sand accumulation (Brouyère et al., 2022; Ouhamdouch et al., 2018). The study area is characterized by a pre-Saharan climate where temperatures benefit from oceanic influence in the Guelmim basin to very arid Saharan conditions with harsh winters (between -7°C and -1°C) and hot summers (44°C) in the Drâa basin (Bekkar et al., 2023). Despite its latitude, the Atlantic Ocean more or less mitigates the effect of the Saharan continental climate. Average annual rainfall is around 120 mm but with considerable random irregularity, ranging from 15 mm to 300 mm (Bouaicha and Benabdelfadel, 2010; SIREDD Guelmim-Oued Noun, 2024).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"580\" height=\"231\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture.jpg 580w, https://www.watconman.org/wp-content/uploads/2024/06/Capture-300x119.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Figure 2: Presentation of the Assaka wadi in Guelmim province.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.3 Sampling method and Physical-chemical analysis</strong></p>\n<p>The water samples used for analysis in this study were taken during the period February 2021 to January 2022, of which four points were logically selected to sample the waters of the Oued d’Assaka basin in the Guelmim province and to carry out the physicochemical and other quality assessment analyses. Water flow velocities at survey points at the time of sampling the water body itself, current velocity is approximated by following a dropped object along a 10 m path.<br />\nTo assess the basin’s quality parameters and to identify the most polluting tributary or Oued in the feeder network, thus calling on the relevant departments to take action to reduce the level of pollution. The sampling campaign took into account the lithological diversity of the basin, as well as the distribution of activities at four points over twelve months, with sampling carried out successively over the months from February 30, 2021, to January 17, 2022.<br />\nPhysical-chemical parameters include pH, electrical conductivity EC, and temperature T°C, measured (in situ) in the field, and turbidity analyzed in the laboratory. These parameters were determined according to the analysis methods recommended by AFNOR standards. Results were evaluated and visualized using Excel 2016 software.</p>\n<p><strong>2.4 Statistical analysis</strong><br />\nPrincipal component analysis was performed on the mean annual values of the physico-chemical parameters characterizing the four sampling points. This analysis highlighted the correlations between the various water parameters. Statistical analysis of the data was carried out using Microsoft Excel 2016 (Microsoft Corp) and SPSS Statistics (SPSS Inc.).</p>\n<p>Mean values and standard deviations were determined. Pearson correlation coefficients were calculated.</p>\n<h3>3. RESULT AND DISCUSSION</h3>\n<p><strong>3.1 Physical and chemical characterization</strong></p>\n<p>Detailed results of physico-chemical analyses of Guelmim province waters used in the Oued d’Assaka watershed are shown in Figure 3.</p>\n<p><strong>3.1.1 pH</strong></p>\n<p>The pH is also influenced by acid precipitation, biological activity, and certain industrial discharges. The quality criterion values for raw water supply are between 6.5 and 8.5, and between 6.5 and 9.0, to protect aquatic life. The pH values of the Assaka watershed show visible stability (Figure 3 (a)). The stable neutrality of the waters in the basin could be the result of an equilibrium between the high levels of carbon dioxide and dissolved calcium bicarbonates, stabilized by the buffering effect resulting from the high mineralization of the waters (Savean, 2014; Ouyang, 2005).</p>\n<p><strong>3.1.2 Temperature</strong></p>\n<p>Temperature variation in the Assaka basin of Guelmim province (Figure 3 (b)) displays distinct seasonal characteristics, reflecting regional climatic fluctuations. Data collected over several months reveal trends that highlight thermal differences between seasons. During the summer months, temperatures tend to reach higher levels, with peaks generally observed between months 9 and 12, due to increased sunshine and warmer weather conditions. In contrast, spring months show lower temperatures, with minimum values recorded between March and May, attributable to reduced sunshine and cooler climatic influences.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"546\" height=\"561\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/Picture4.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/Picture4.png 546w, https://www.watconman.org/wp-content/uploads/2024/06/Picture4-292x300.png 292w, https://www.watconman.org/wp-content/uploads/2024/06/Picture4-40x40.png 40w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Figure 3: (a): Changes in pH at four points in the Assaka basin during the sampling period. (b): Variation in temperature during the sampling period. (c): Electrical conductivity differences at four locations. (d): Turbidity evolution.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.1.3 Electrical Conductivity </strong></p>\n<p>The electrical conductivity of water expresses its overall mineralization and reflects its ionic charge. It is proportional to the concentration of ionizable salts, which in turn depends in part on water temperature. It is an index of the abundance of ions in water (Yehya, 2015). The Assaka basin waters analyzed show generally high conductivity values (Figure 3 (c)), well above the Guide Value set by European standards (100 µs.cm-1). They generally range from 2140 µs.cm-1 at sampling point 4 to 4830 µs.cm-1 at sampling point 2. The high mineralization of the water at this point may be due either to the existence of a local saline geological formation or to the particularly marked impact of discharges (Quarouch et al., 2014).</p>\n<p><strong>3.1.4 Turbidity </strong></p>\n<p>Turbidity refers to the content of turbid matter in a liquid. In watercourses, it is generally caused by colloidal particles that absorb, scatter, and/or reflect light. It is measured by various methods of photometry of turbid media, such as nephelometry, opacimeter, and turbidimetry. It is expressed in NTU (Nephelometric Turbidity Unit) (Chouafa Nesrine, 2022). Calibration is performed using solid controls. Turbidity data collected from four different sampling points reveal a significant variation in water clarity in the Assaka basin at Guelmim (Ouzanni et al., 2023). Turbidity values range from 16.80 NTU to 150 NTU (Figure 3 (d)), indicating a range from slightly turbid to very turbid water.</p>\n<p><strong>3.2 Statistical physicochemical study of the water in study point in doued Assaka </strong></p>\n<p>Water samples from the Assaka basin showed alkaline pH values ranging from 8 to 8.1, with an average of 8.075. Seasonal mean pH values ranged from 8 in spring to 8.1 in summer, and remained constant for the rest of the seasons (Table 1), indicating that there was no discernible change in pH concentration.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"687\" height=\"107\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-1.jpg 687w, https://www.watconman.org/wp-content/uploads/2024/06/Capture-1-300x47.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The values observed were, however, within the WHO safe limits for consumption. A similar trend was also observed for conductivity. Conductivity values ranged from 3219.2 µs/cm to 3065 µs/cm, with an overall mean value of 3298.35 µs/cm. Table 2 shows the seasonal mean<br />\nvalues for conductivity. The highest conductivity at the Assaka basin sampling points may be due to the degree of dissolved ions, pollutants, organic matter, and water temperature (Mekki et al., 2021).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"687\" height=\"205\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-2.jpg 687w, https://www.watconman.org/wp-content/uploads/2024/06/Capture-2-300x90.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"688\" height=\"257\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/Capture-3.jpg 688w, https://www.watconman.org/wp-content/uploads/2024/06/Capture-3-300x112.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Pearson’s analysis was used to establish the matrix shown in Table 3. According to the data in the correlation table, there is a strong correlation between pH and COD, with a positive and significant value (r = 0.966*). This is due to several factors, notably biological activity such as the decomposition of matter, which can lead to a decrease in pH due to the production of organic acids, resulting in a strong significant correlation between pH and COD. As well as chemical substances present in the water that can influence both pH and COD. Certain compounds present in water can react with others to form acids or bases, influencing pH and COD. This analysis reveals a strong correlation between temperature and COD, with a value of (r = 0.954), a positive and significant correlation. Similarly for chloride and magnesium ions, with a value of (r = 0.996), the explanation for this strong correlation can be traced back to the contents of the basin, in particular the minerals rich in chloride and magnesium. As the water flows through these materials, the ions are dissolved, increasing the concentration in the water. Water sources in the Assaka basin, such as aquifers and rivers, can be influenced by the same geological processes that favour materials. Anthropogenic activities such as agricultural irrigation, industry and the use of de-icing salts can increase ion concentrations, leading to a strong correlation (Hem, 1959; Chen et al., 2022; Lin et al., 2019; Elassassi et al., 2022).</p>\n<h3>4. CONCLUSION</h3>\n<p>Organic pollutants and heavy metals are the main pollutants. High loads and complex effluents render the water’s assimilative capacity ineffective in most cases. It is therefore essential to find effective and accessible treatments. In this study, we analyzed the water quality of the Oued d’Assaka basin in Guelmim province. Statistical analyses based on Pearson correlation were carried out for some of the physicochemical parameters analyzed in this study, notably pH, temperature, electrical conductivity, COD, suspended solids, chloride, magnesium, sulfate and nitrate ions, turbidity, water hardness, and others. The results obtained for these analyses in the Assaka catchment studied showed a stable or alkalinity level of the water, as the Hydrogen potential and takes its stability between the interval of 6.5 and 8.5 by mean values oscillating between (7.77 and 8.34) indicating a satisfactory balance of notable acidity. The temperature at the study site varies seasonally according to regional chemical changes. Physico-chemical parameters showed a strong correlation between temperature and COD with a value of (r = 0.954), while chloride and magnesium ions showed a value of (r = 0.996) according to statistical analysis of the data using Pearson’s correlation.</p>\n<h3>REFERENCES</h3>\n<p>Afi, C., Hallam, J., Mimouni, A., Msanda, F., and Ait Aabd, N., 2022. Saline Water Irrigation Effect on Oil Yield and Quality of Argan Trees Domesticated in Laâyoune, Morocco. Environmental Sciences Proceedings, 16 (1), Art. no 1, 2022, doi: 10.3390/environsciproc2022016045.</p>\n<p>Agence du Bassin Hydraulique de Draa Oued Noun, 2024. Consulté le: 29 janvier 2024. [En ligne]. Disponible sur: https://www.abhdon.ma/page/Eaux-de-surface</p>\n<p>Agoumi A. and Debbarh, A., 2005. Ressources en eau et bassins versants du Maroc: 50 ans de développement, Report Prepared Within the Framework of the “Water: Management of Scarcity” Organized by the Association of Moroccan Engineers of Bridges and Roads, Pp. 13‑62.<br />\nAlbab, S., Ezaidi, A., Benssaou, M., and Kabbachi, B., 2013. Le patrimoine naturel – géologique et oasien – au service du développement géotouristique dans la province de Sidi Ifni et son arrière-pays oasien (Maroc), Collection EDYTEM. Cahiers de géographie, 14 (1), P p. 117‑130. doi: 10.3406/edyte.2013.1229.</p>\n<p>ATTOU, M.B., 2014. La nouvelle stratégie de l’Etat dans l’espace présaharien, Guelmim à l’heure de la, régionalisation élargie, Revue AFN Maroc N, 15, Pp. 16.</p>\n<p>Bekkar, A., Hssina, B., Douzi, S., and Khadija, D., 2023. Transformer-Based Model for Multi-Horizon Forecasting Ozone in Marrakech city, Morocco. Pp. 8. doi: 10.1109/SITA60746.2023.10373756.</p>\n<p>BERGIER, P., 2009. Où voir les oiseaux dans le Sahara Atlantique marocain », Go-South Bulletin, 6, Pp. 1‑71,<br />\nBhateria, R., and Jain, D., 2016. Water quality assessment of lake water: a review. Sustainable Water Resources Management, 2, Pp. 161-173.</p>\n<p>Bouaicha, R., and Benabdelfadel, A., 2010. Variabilité et gestion des eaux de surface au Maroc, Sécheresse, 21 (4), Pp. 325‑326, oct. 2010, doi: 10.1684/sec.2010.0272.</p>\n<p>Boulal, M., Boulanouar, M., Ghamizi, M., and Boutin, C., 2017. Qualité de l’eau et faune aquatique des puits dans la région de Tiznit (Anti-Atlas occidental, Maroc) », Bulletin de la Société d’Histoire Naturelle de Toulouse, 153, Pp. 25‑41.<br />\nBrouyère, S., Glaude, R., Hutzemakers, J., Orban, P., and Goderniaux, P., 2022. Impact du changement climatique sur les ressources en eaux souterraines de Wallonie: des prédictions du passé aux observations du présent », in Journée d’étude. Eau potable: de la protection des ressources à la consommation, 2022.</p>\n<p>Chen, J., Zhang, H., Xue, J., Yuan, L., Yao, W., and Wu, H., 2022. Study on spatial distribution, potential sources and ecological risk of heavy metals in the surface water and sediments at Shanghai Port, China, Marine Pollution Bulletin, 181, Pp. 113923, août 2022. doi: 10.1016/j.marpolbul.2022.113923.</p>\n<p>Chouafa Nesrine, M.G.M., 2022. Analyse de la qualité de l’eau potable distribuée à Guelma.<br />\ndu Maroc, R., LES SOURCES D’EAU DANS LE BASSIN MEDITERRANEEN.</p>\n<p>El Arabi, S., 2021. L’accueil des migrants subsahariens à Tiznit: géographie et éthique de la villerefuge, LocalAcc Monographies, Monographies, 1.</p>\n<p>El Attaoui, Z., Sossi, F. Z. A., and El Khatori, Y., 2023. La gestion des risques menaçant la qualité de l’eau: application du PGSSE et la méthode HACCP, in SHS Web of Conferences, EDP Sciences, Pp. 01037.</p>\n<p>El Blidi, S., Fekhaoui, M., Serghini, A., and El Abidi, A., 2006. Rizières de la plaine du Gharb (Maroc): qualité des eaux superficielles et profondes, Bulletin de l’Institut Scientifique, Rabat, section Sciences de la Vie, 28, Pp. 55‑60.</p>\n<p>Elassassi, Z., Ougrad, I., Bedoui, I., Kara, M., El Bouch, M., Assouguem, A., and Chaouch, A. (2022). Spatial and Temporal Variations of the Water Quality of the Tiflet River, Province of Khemisset, Morocco. Water, 14 (12), 1829. doi: 10.3390/w14121829.</p>\n<p>El-Moustaqim, K., Benchrifa, M., Mabrouki, J., and Hmouni, D., 2024. Interaction between the Microalgae Cultivation System and Its Effects on Nutrient Removal from Wastewater, Pp. 70‑79. doi: 10.1201/9781003436218-8.</p>\n<p>El-Moustaqim, K., El Bakraoui, H., Mabrouki, J., Fouad, Y., Slaoui, M., Hmouni, D., and Igbigbi, T. L., 2023. Combination of Microalgae Method, Decantation, and Filtration for Domestic Wastewater Treatment. Sustainability, 15 (22). doi: 10.3390/su152216110.<br />\nGharbi, S., 1986 Le bassin-versant de ras el maa (maroc) : etude hydrologique, These de doctorat, Toulouse 2, 1986. Consulté le: 29 janvier 2024. [En ligne]. Disponible sur: https://www.theses.fr/1986TOU20045</p>\n<p>Hem, J.D., Study and Interpretation of the Chemical Characteristics of Natural Water. U.S. Government Printing Office, 1959.<br />\nHUMBERT, A., 2013. LES PALMERAIES DU PAYS DES ID BRAHIM ET DES AΪT HERBIL: UN ESPACE EN CRISE DU SUD-OUEST MAROCAIN (PROVINCE DE GUELMIM).<br />\nKijjanapanich, P., 2013. Sulfate reduction for remediation of gypsiferous soils and solid wastes, These de doctorat, Paris Est, 2013. Consulté le: 10 février 2024. [En ligne]. Disponible sur: https://www.theses.fr/2013PEST1188</p>\n<p>Kouassi, A.M., Mamadou, A., Ahoussi, K.E and Biemi, J., 2013. Simulation de la conductivité électrique des eaux souterraines en relation avec leurs propriétés géologiques: cas de la Côte d’Ivoire, Revue Ivoirienne des Sciences et Technologie, 21, Pp. 138‑166.<br />\nLesley, M.N.Y.O., de Dieu, N.J., Félicien, L.M. R., Isidore, N. M., NSONA, M., Promesse, B. M. L. J. C., and Maurille, O. J., 2023. Utilisation des indices de qualité et de pollution organique dans l’évaluation de la qualité physicochimique des eaux de surface de la ville de Brazzaville (Congo), Géologie et ressources naturelles en Afrique centrale, impact sociétal et développement durable, Pp. 65.</p>\n<p>Lin, L., Li, C., Yang, W., Zhao, L., Liu, M., Li, Q., and Crittenden, J.C., 2020. Spatial variations and periodic changes in heavy metals in surface water and sediments of the Three Gorges Reservoir, China. Chemosphere, 240, 124837. doi: 10.1016/j.chemosphere.2019.124837.</p>\n<p>Mabrouki, J., Azoulay, K., Elfanssi, S., Bouhachlaf, L., Mousli, F., Azrour, M., &amp; El Hajjaji, S., 2022. Smart System for Monitoring and Controlling of Agricultural Production by the IoT, in IoT and Smart Devices for Sustainable Environment, M. Azrour, A. Irshad, et R. Chaganti, Éd., in EAI/Springer Innovations in Communication and Computing, Cham: Springer International Publishing, Pp. 103‑115. doi: 10.1007/978-3-030-90083-0_8.</p>\n<p>Mabrouki, J., Benchrifa, M., Ennouhi, M., Azoulay, K., Bencheikh, I., Rachiq, T., and El Hajjaji, S. 2023. Geographic Information System for the Study of Water Resources in Chaâba El Hamra, Mohammedia (Morocco) Pp. 469‑474. doi: 10.1007/978-3-031-26254-8_67.<br />\nMabrouki, J., El Yadini, A., Bencheikh, I., Azoulay, K., Moufti, A., and El Hajjaji, S. 2019. Hydrogeological and Hydrochemical Study of Underground Waters of the Tablecloth in the Vicinity of the Controlled City Dump Mohammedia (Morocco), in Advanced Intelligent Systems for Sustainable Development (AI2SD’2018), vol. 913, M. Ezziyyani, Éd., in Advances in Intelligent Systems and Computing, 913, Cham: Springer International Publishing, Pp. 22‑33. doi: 10.1007/978-3-030-11881-5_3.</p>\n<p>Mabrouki, J., Fattah, G., Al-Jadabi, N., Abrouki, Y., Dhiba, D., Azrour, M., and Hajjaji, S. E., 2022. Study, simulation and modulation of solar thermal domestic hot water production systems », Model. Earth Syst. Environ, 8 (2), Pp. 2853‑2862, juin 2022, doi: 10.1007/s40808-021-01200-w.</p>\n<p>Mabrouki, J., Fattah, G., Kherraf, S., Abrouki, Y., Azrour, M., &amp; El Hajjaji, S., 2022. Artificial intelligence system for intelligent monitoring and management of water treatment plants », Emerging Real-World Applications of Internet of Things, Pp. 69‑87.<br />\nMahmouhi, N., El Wartiti, M., Astite, W. S., Kemmou, S., and El Bahi, S., 2016. The use of geographic information system for the extraction of physical characteristics of assaka watershed: sub-basins of sayed and oum laachar wadis (southern Morocco). International Journal of Innovation and Applied Studies, 16 (2), Pp. 370-377.,</p>\n<p>Mahmouhi, N.E., Wartiti, M.E., Wissem, S.A., Kemmou, S., and Bahi, S.E., 2016. Utilisation des systèmes d’information géographiques et des modèles hydrologiques pour l’extraction des caractéristiques physiques du bassin versant d’Assaka (Guelmim, sud du Maroc), 16 (2). \\</p>\n<p>Mekki, I., Ferchichi, I., Taoujouti, N., Faysse, N., and Zaïri, A. A., 2021. Analyse de l’extension des palmeraies oasiennes et de son impact sur les ressources en eau souterraine dans la région de Kébili, sud-ouest de la Tunisie, 2021.<br />\nMohammed P.B., and Anas, I.B., 2021. Analyse climatique et hydrologique du bassin de Draa et l’unité de Guelmim et proposition des mesures pour garantir la sécurité hydrique.</p>\n<p>Mondiale de la Santé, O., 2019. Stratégie de l’OMS sur l’eau, l’assainissement et l’hygiène 2018-2025, Organisation mondiale de la Santé.<br />\nMoussa, A.B., Chahlaoui, A., Rour, E. H., Chahboune, M., and Aboulkacem, A., 2012 Étude Du Changement De L’etat Des Eaux De L’oued Khoumane A La Confluence Avec Les Eaux Thermales De La Source Ain Hamma Moulay Idriss Maroc, LARHYSS Journal P-ISSN 1112-3680 / E-ISSN 2521-9782, 11, Art. no 11. Consulté le: 28 janvier 2024. [En ligne]. Disponible sur: http://larhyss.net/ojs/index.php/larhyss/article/view/136</p>\n<p>Noureddine, N. A., Kharbach, O., Sabil, A., and Benichou, A., 2024. Vers une Économie Circulaire au Maroc: Défis, Stratégies et Perspectives. Revue Française d’Economie et de Gestion, 5 (1).<br />\nOuhamdouch, S., Bahir, M., and Carreira, P., 2018. Impact du changement climatique sur la ressource en eau en milieu semi-aride : exemple du bassin d’Essaouira (Maroc). rseau, 31 (1), Pp. 13‑27. doi: 10.7202/1047050ar.<br />\nOumara N.G.A. and El-Youssfi L., 2022. Salinization of Soils and Aquifers in Morocco and the Alternatives of Response », Environmental Sciences Proceedings, 16 (1), Art. no 1. doi: 10.3390/environsciproc2022016065.<br />\nOuyang, Y., 2005. Evaluation of river water quality monitoring stations by principal component analysis, Water Research, 39 (12), Pp. 2621‑2635, juill. 2005, doi: 10.1016/j.watres.2005.04.024.</p>\n<p>Ouzanni, H., Nafia, K., and Ghachi, M.E., 2023. Analyse du fonctionnement hydrologique de la source d’ASKKAR: suivi, mesure et analyse 2022-2023 (Bassin versant de l’Oued El Abid-Maroc-) », Revue Internationale de la Recherche Scientifique (Revue-IRS), 1 (5), Art. no 5, oct. 2023. doi: 10.5281/zenodo.8400908.</p>\n<p>Production d’ eau potable – Lenntech, 2024. Consulté le: 6 février, [En ligne]. Disponible sur: https://www.lenntech.fr/applications/potable/eau-potable.htm<br />\nQuarouch H., Kuper M., Abdellaoui, E.H., and Bouarfa, S., 2014. Eaux souterraines, sources de dignité et ressources sociales: cas d’agriculteurs dans la plaine du Saïss au Maroc.</p>\n<p>Savean, M., 2014. Modélisation hydrologique distribuée et perception de la variabilité hydro-climatique par la population du bassin versant de la Dudh Koshi (Népal) », These de doctorat, Montpellier 2. Consulté le: 30 janvier 2024. [En ligne]. Disponible sur: https://www.theses.fr/2014MON20222<br />\nSIREDD Guelmim-Oued Noun. Consulté le: 10 février 2024. [En ligne]. Disponible sur: https://siredd.environnement.gov.ma/Guelmim-Oued-Noun/SIG/SigIndex</p>\n<p>TALEB, R. B., Naimi, M., Chikhaoui, M., and Sabir, M., 2021. Utilisation de SWAT pour la modélisation hydrologique et l’évaluation du rendement des sédiments dans le bassin versant de Nakhla, Maroc », Revue Marocaine des Sciences Agronomiques et Vétérinaires, 9 (4), Pp. 616‑628.</p>\n<p>Vecchio, K.D., and Kuper, M., 2022. La mise en visibilité des eaux souterraines au Maroc: un processus historiquement lié aux politiques de développement de l’irrigation, Développement durable et territoires. Économie, géographie, politique, droit, sociologie, 12 (3).</p>\n<p>Yehya, T., 2015. Etude des procédés electrochimiques et biologiques pour le traitement des eaux: application à l’élimination des nitrates et de la carbamazepine, These de doctorat, Clermont-Ferrand 2. Consulté le: 10 février 2024. [En ligne]. Disponible sur: https://www.theses.fr/2015CLF22660</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"991\" height=\"190\" src=\"https://www.watconman.org/wp-content/uploads/2024/06/t6.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/06/t6.jpg 991w, https://www.watconman.org/wp-content/uploads/2024/06/t6-300x58.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/06/t6-768x147.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>From the information provided, it can be concluded that the annual volume of surface runoff from urban areas in the country is 327.66 million m3. At the same time, the amount of pollutants that enter water bodies through surface runoff from urban areas is 368149 tonnes per year for suspended solids, 36815 tonnes per year for organic impurities, and 10281 tonnes per year for petroleum products. After 2021, it will be necessary to install storm sewer systems in all settlements where there is a threat of contamination of surface and groundwater.</p>\n<h3>4. DISCUSSION</h3>\n<p>Kazakhstan has significant water resources, including rivers, lakes and groundwater. However, the distribution of water resources is uneven across the country. Accordingly, water supply in some Kazakh cities and regions may be uneven and insufficient. This is due to various factors, including old infrastructure, outdated technologies and population growth. In some cases, this can lead to problems with the quality of drinking water. Agriculture is a major consumer of water in Kazakhstan. It is important to develop and implement methods and technologies of agriculture with low water consumption in order to reduce pressure on water resources and ensure food security. Equally important is the issue of wastewater disposal and management (Shahini and Bali, 2023). Insufficient drainage systems and improper wastewater management can lead to water pollution and environmental degradation (Melnyk et al., 2023; Dzihora and Stolyarenko, 2020).</p>\n<p>For sustainable development and management of water resources, Kazakhstan should actively work on the creation of modern infrastructure systems of water supply and sanitation, develop and implement innovative agricultural methods, comply with environmental standards and cooperate with international partners. Raising public awareness about water conservation and the need for sustainable water resources management also plays an important role. Educational programmes and information campaigns can help create a more responsible attitude to water resources. Kazakhstan can cooperate with neighbouring countries and international organisations in the field of water resources management, especially within the framework of basin approaches to river and lake management, in order to solve common problems and promote sustainable development.</p>\n<p>There is an uneven distribution of water resources in Kazakhstan, and this has an impact on water consumption and disposal in different regions of the country. The northern regions, such as Astana and Almaty, have richer water sources, which allows them to have a stable water supply. While the southern and south-western regions are experiencing a shortage of water resources, which can cause problems with providing the population with water. It is worth objecting to the ambiguity in the issue of disposal and pollution. In some regions of Kazakhstan, wastewater disposal and treatment systems do not always meet modern standards. This can lead to pollution of water resources and create environmental problems. Uneven distribution of water and problems with water supply and disposal are urgent challenges that require attention and appropriate measures on the part of the state and society.</p>\n<p>According to the results of recent studies by some researhcer, low-voltage electrocoagulation of iron is an effective method of tertiary treatment of urban wastewater, which can be especially useful for removing indicators of intestinal pathogens and bacteria, including those that may be resistant to antibiotics (Bicudo et al., 2021). This method is based on the process of electrocoagulation, in which an electric current is passed through the wastewater, which leads to the formation of microdrops of iron precipitation. These iron droplets serve as coagulants that aggregate and collapse bacteria and suspended particles, making them easier to remove from the water. Iron can also affect the molecular structures of bacteria, which contributes to their inactivation. These data are consistent with the theses given in the previous section, the use of low-voltage electrocoagulation of iron in the wastewater treatment process demonstrates technological progress in the field of water treatment and allows improving the quality of treated water, reducing the risks of diseases and minimising the impact of antibiotic-resistant bacteria on the environment.</p>\n<p>Referring to the definition by a group researchers solution related to the availability and use of water for electrolysis in the production of hydrogen play an important role in modern energy and ecology (Simoes et al., 2021). Electrolysis of water is a process in which water is decomposed into hydrogen and oxygen using electrical energy. The hydrogen produced in this way can be used as a clean energy source or for the production of hydrogen fuel cells, which makes this process an important element of the transition to more environmentally sustainable technologies. According to the authors’ conclusions and analysing the results obtained, the availability and use of water for electrolysis may raise some questions, especially in regions where water resources are limited. This can increase competition for water resources between industry, agriculture, and hydrogen production. Therefore, it is important to develop and implement effective electrolysis technologies that minimise the need for water and promote the lean use of this resource.</p>\n<p>A group researcher determined that the situation with wastewater treatment and reuse in the main Asian countries is of particular importance, given the population growth and industrial development in the region (Cheng et al., 2022). Many Asian countries face challenges in the field of water treatment and wastewater management. The authors’ conclusions confirm the results of this study – solving these problems requires not only investments in water treatment infrastructure, but also the development of effective strategies for water resources management and creative water use. The importance of international cooperation and exchange of experience to develop the most effective solutions in the field of water treatment and sustainable management of water resources in the Asian region is highlighted.</p>\n<p>In recent studies, authors identified that wastewater infrastructure plays an important role in achieving the Sustainable Development Goals set by the United Nations (Delanka-Pedige et al., 2021). One of the key goals related to water supply and disposal is Sustainable Development Goal No. 6: “Guarantee the availability and management of water and sanitation for all”. This goal includes ensuring access to clean drinking water and sanitation for all citizens, which is of great importance for creating sustainable cities and improving the quality of life of the population. Despite the results obtained, the wastewater infrastructure in cities should be designed and developed in such a way as to ensure the collection, treatment, and disposal of wastewater with minimal negative impact on the environment. This includes the construction of modern water treatment systems, as well as the management and processing of treated wastewater. A sustainability-oriented approach also implies compliance with environmental standards and consideration of future needs and climate change.</p>\n<p>Kumar and Hong have shown that the Internet plays an important role in ensuring the safe monitoring and management of wastewater treatment systems (Kumar and Hong, 2022). This technology allows collecting and analysing data on the condition and operation of treatment facilities in real-time, which allows operators to quickly respond to any problems or accidents. One of the key advantages is the ability to monitor various water parameters, such as pollution level, oxygen level, pH, and other characteristics. This allows the detection of anomalies and changes in water quality, which may indicate potential problems with the purification processes.</p>\n<p>As noted by some researchers, the problem of water stress and water footprint accounting are becoming increasingly relevant in the context of increasing demand for water resources in the world (Wang et al., 2021). Water stress occurs when the demand for water exceeds the available resources in a certain region or locality. This can be caused by various factors, including climate change, population growth, and economic development. Water footprint accounting is a methodology for estimating and accounting for the total volume of water used in production and consumer processes. This includes water used in agriculture, production of goods and services, and water consumed by the population. Water footprint accounting identifies which economic sectors and products are the main users of water resources. These findings confirm the results of this study. Both of these aspects are related to sustainable management of water resources and minimisation of water stress. Understanding the water footprint helps companies and governments develop strategies to reduce water consumption, increase resource efficiency, and improve the sustainability of water systems. It is also important to combat global challenges such as climate change and reduced availability of clean drinking water.</p>\n<h3>5. CONCLUSION</h3>\n<p>Issues of water consumption and wastewater disposal in the RK have a significant impact on economic development and the state of the environment. Unresolved problems in this area can cause serious consequences for the country. The most important aspects of this problem require a coherent and multifaceted approach that covers both economic and environmental aspects. First of all, it is necessary to ensure stable and uniform water supply in all regions of the country. This is important to meet the needs of the population, agriculture, and industry. Solving this problem requires investments in the modernisation of water supply infrastructure and the creation of efficient wastewater disposal systems.</p>\n<p>The uneven distribution of water resources in the country leaves some regions in short supply, which requires the development of infrastructure and technologies to ensure a stable water supply. Agriculture, as a major consumer of water, should switch to more efficient methods and technologies to reduce the burden on water resources. Water disposal and pollution problems also require attention. It is necessary to modernise wastewater disposal and treatment systems in order to minimise the negative impact on the environment and ensure cleaner water resources. Strengthening education and information campaigns on water conservation issues can help change behaviour and instil a culture of water conservation among citizens. International cooperation in water resources management is also important, especially in the framework of basin approaches. Kazakhstan should continue to cooperate with neighbouring countries and international organisations in order to solve common problems and ensure sustainable management of water resources.</p>\n<p>In general, water resources management in the RK requires a comprehensive analysis, joint efforts and strategic planning to ensure access to clean water for all, maintain ecological balance, and promote sustainable development of the country. It is also necessary to investigate the impact of climate change on the availability and quality of water resources in different regions of the RK, and to develop adaptation measures to ensure the sustainability of water supply and water treatment.</p>\n<h3>REFERENCES</h3>\n<p>Absametov, M.K., Zhakibayeva, A.Z., Murtazin, Y.Z.H., Livinskiy, Y.U.N., Jabassov, A.M., 2023. Assessment of supportability, condition and the outlook for the groundwater resources use for drinking water supply in the West Kazakhstan region. Geography and Water Resources, 2, Pp. 3-15.</p>\n<p>Adamkulova, C., Aitbaev, Z., 2024. Ensuring climate resilience in Central Asia through the establishment of a water management education program. Journal of Water and Climate Change, 15 (4), Pp. 1551-1564. https://doi.org/10.2166/wcc.2023.560</p>\n<p>Aslam, A., Khan, S.J., Shahzad, H.M.A., 2022. Anaerobic membrane bioreactors (AnMBRs) for municipal wastewater treatment-potential benefits, constraints, and future perspectives: An updated review. Science of The Total Environment, 802, Article number 149612.</p>\n<p>Baitova, A.A., 2021. Features of engineering and geological properties of Kazakhstan. Soils. Innovative Scientific Research, 2-1 (4), Pp. 188-196.</p>\n<p>Beisembin, K.R., 2010. Way to increase the effective management of water resources in Kazakhstan. Science and New Technologies, 9, Pp. 28-31.</p>\n<p>Bicudo, B., van Halem, D., Trikannad, S.A., Ferrero, G., Medema, G., 2021. Low voltage iron electrocoagulation as a tertiary treatment of municipal wastewater: Removal of enteric pathogen indicators and antibiotic-resistant bacteria. Water Research, 188, Article number 116500.</p>\n<p>Cheng, Z., Zhao, Y., Wang, N., Song, T., Song, Z., 2022. Assessing the impact of the strictest water resources management policy on water use efficiency in China. Water, 14 (15), Article number 2291.</p>\n<p>Delanka-Pedige, H.M.K., Munasinghe-Arachchige, S.P., Abeysiriwardana-Arachchige, I.S.A., Nirmalakhandan, N., 2021. Wastewater infrastructure for sustainable cities: Assessment based on UN sustainable development goals (SDGs). International Journal of Sustainable Development &amp; World Ecology, 28 (3), Pp. 203-209.</p>\n<p>Dzihora, Y., Stolyarenko, H., 2020. Membrane regeneration methods in wastewater treatment. Bulletin of Cherkasy State Technological University, 25 (2), Pp. 97-104. https://doi.org/10.24025/2306-4412.2.2020.196814</p>\n<p>Easa, H.K., Majid, A., Al-Hatem, A.I., Othman, N.A., Bloh, A.H., Ali, A.H., Kalmatov, R., 2024. Sustainability in irrigation practices through 5G optimization of water resources. Conference of Open Innovation Association, FRUCT (Pp. 201-210). Tampere: IEEE Computer Society.</p>\n<p>Kumar, P.M., Hong, C.S., 2022. Internet of things for secure surveillance for sewage wastewater treatment systems. Environmental Research, 203, Article number 111899.</p>\n<p>Martini, S., Larras, F., Boyé, A., Faure, E., Aberle, N., Archambault, P., Bacouillard, L., Beisner, B.E., Bittner, L., Castella, E., Danger, M., Gauthier, O., Karp-Boss, L., Lombard, F., Maps, F., Stemmann, L., Thiébaut, E., Usseglio-Polatera, P., Vogt, M., Laviale, M., Ayata, S.D., 2021. Functional trait‐based approaches as a common framework for aquatic ecologists. Limnology and Oceanography, 66 (3), Pp. 965-994.</p>\n<p>Melnyk, V., Shafarenko, M., Ostapenko, Zh., Kosova, V., Rhuzinska, L., 2023. Interaction of microbiological and membrane technologies of wastewater treatment. Scientific Reports of the National University of Life and Environmental Sciences of Ukraine, 6 (106), Article number 2. http://dx.doi.org/10.31548/dopovidi6(106).2023.002</p>\n<p>Myskovets, I., Molchak, Y., 2023. Environmental problems from rainfall runoff. Scientific Horizons, 26 (8), Pp. 109-116. https://doi.org/10.48077/scihor8.2023.109</p>\n<p>Papamichael, I., Chatziparaskeva, G., Pedreño, J.N., Voukkali, I., Candel, M.B.A., Zorpas, A.A., 2022. Building a new mind set in tomorrow fashion development through circular strategy models in the framework of waste management. Current Opinion in Green and Sustainable Chemistry, 36, Article number 100638.</p>\n<p>Pluchinotta, I., Pagano, A., Vilcan, T., Ahilan, S., Kapetas, L., Maskrey, S., Krivtsov, V., Thorne, C., O’Donnell, E., 2021. A participatory system dynamics model to investigate sustainable urban water management in Ebbsfleet Garden City. Sustainable Cities and Society, 67, Article number 102709.</p>\n<p>Ramírez-Coronel, A.A., Mohammadi, M.J., Majdi, H.S., Zabibah, R.S., Taherian, M., Prasetio, D.B., Gabr, G.A., Asban, P., Kiani, A., Sarkohaki, S., 2023. Hospital wastewater treatment methods and its impact on human health and environments. Reviews on Environmental Health, 1, Pp. 1-6. https://doi.org/10.1515/reveh-2022-0216</p>\n<p>Scanlon, B.R., Fakhreddine, S., Rateb, A., de Graaf, I., Famiglietti, J., Gleeson, T., Grafton, R.Q., Jobbagy, E., Kebede, S., Kolusu, S.R., Konikow, L.F., Long, D., Mekonnen, M., Schmied, H.M., Mukherjee, A., MacDonald, A., Reedy, R.C., Shamsudduha, M., Simmons, C.T., Sun, A., Taylor, R.G., Villholth, K.G., Vörösmarty, C.J., Zheng, C., 2023. Global water resources and the role of groundwater in a resilient water future. Nature Reviews Earth &amp; Environment, 4 (2), Pp. 87-101.</p>\n<p>Shahini, E., Bali, F., 2023. Economic impact of restructuring the municipal wastewater treatment system in San Francisco: Possibilities for application in Ukrainian realities. Scientific Bulletin of Mukachevo State University. Series “Economics”, 10 (1), Pp. 29-36. https://doi.org/10.52566/msu-econ1.2023.029</p>\n<p>Shuka, L., Çullaj, A., Shumka, S., Miho, A., Duka, S., Bachofen, R., 2011. The spatial and temporal variability of limnological properties of Bovilla reservoir (Albania). Water Resources Management, 25 (12), Pp. 3027-3039. https://doi.org/10.1007/s11269-011-9788-z</p>\n<p>Simoes, S.G., Catarino, J., Picado, A., Lopes, T.F., di Berardino, S., Amorim, F., Gírio, F., Rangel, C.M., de Leão, T.P., 2021. Water availability and water usage solutions for electrolysis in hydrogen production. Journal of Cleaner Production, 315, Article number 128124.</p>\n<p>Skarbøvik, E., Shumka, S., Mukaetov, D., Nagothu, U.S., 2010. Harmonised monitoring of Lake Macro Prespa as a basis for integrated water resources management. Irrigation and Drainage Systems, 24 (3-4), Pp. 223-238. https://doi.org/10.1007/s10795-010-9099-1</p>\n<p>Suieubayeva, S., Denissova, O., Kabdulsharipova, A., Ozpen, A.I., 2022. The agricultural sector in the Republic of Kazakhstan: Analysis of the state, problems and ways of solution. Eurasian Journal of Economic and Business Studies, 4 (66), Pp. 19-31.</p>\n<p>Tian, X., Engel, B.A., Qian, H., Hua, E., Sun, S., Wang, Y., 2021. Will reaching the maximum achievable yield potential meet future global food demand? Journal of Cleaner Production, 294, Article number 126285.</p>\n<p>Valeyev, A.G., 2021. Use of underground and surface water resources for the economic and drinking needs of the North Kazakhstan region. Geography and Water Resources, 4, Pp. 48-52.</p>\n<p>Wang, D., Hubacek, K., Shan, Y., Gerbens-Leenes, W., Liu, J., 2021. A review of water stress and water footprint accounting. Water, 13 (2), Article number 201.</p>\n<p>Yespolov, T.I., Tireuov, K.M., Kerimova, U.K., 2022. Water resources in agriculture of the Republic of Kazakhstan: A view of scientists on rational use, prospects and management. Problems of AgriMarket, 3, Pp. 155-163.</p>\n<p>Ziyabekova, L.M., 2023. Improving the water resources management system in the Republic of Kazakhstan. Astana: Academy of Public Administration under the President of the Republic of Kazakhstan.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>362-367</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>3</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8574\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/3wcm2024/3wcm2024-368-373.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"dgnoraina","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"d52c53b995afa947637d4b8d5d2b92d97130e82418d6c1558dd8026c256d6a02","category":"Environment"}