{"title":"Flashing vs steady bike lights: which is safest and what does the law say?","link":"https://www.bikeradar.com/advice/buyers-guides/flashing-bike-lights/","date":1696521600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-591733764-edb21e3.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Participants cycling through the night on the return leg to Paris. (Photo by Christophe Calais/Corbis via Getty Images)\" title=\"Participants cycling through the night on the return leg to Paris. (Photo by Christophe Calais/Corbis via Getty Images)\" />                                            <p>Most front and rear bike lights have the option to run in either a steady or flashing mode. Does one make you more visible on the road than the other? Can flashing lights pose a danger to other road users? And are flashing lights even legal?</p>\n<p>Here, we take a look at research comparing the visibility of flashing and steady lights, speak to Epilepsy Action to find out whether flashing lights pose a risk to other road users, and look at what the law says on flashing lights.</p>\n<p>If you’re looking for general, buying advice, check out our in-depth reviews and buyer’s guides for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lights-for-road-cycling/\">best bike lights</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-lights/\">mountain bike lights</a>.</p>\n<h2>Are flashing bike lights illegal?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The best lights for road cycling\" title=\"The best lights for road cycling\" />\n\n</div><div><figcaption><span><i></i> In the UK, your bike must be fitted with a front and rear light between sunset and sunrise.</span></figcaption><span> <i>Russel Burton / Immediate Media</i></span></div>\n<p>Current <a href=\"https://www.bikeradar.com/features/bike-light-laws-in-the-uk-what-you-need-to-know/\">bike light laws in the UK</a> dictate cyclists are required to use front and rear lights on public roads – white on the front, red on the rear – between sunset and sunrise.</p>\n<p>These are subject to minimum output requirements.</p>\n<p>A 2005 amendment to <a href=\"https://www.legislation.gov.uk/uksi/2005/2559/contents/made\">The Road Vehicles Lighting (Amendment) Regulations</a> made using flashing lights on a bicycle in the UK legal.</p>\n<p>The regulations state that, if you choose to use flashing lights, they must flash at a frequency between 1-4hz – which is between one and four flashes per second.</p>\n<p>However, in other countries, the rules differ.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lupine SL AF front light\" title=\"Lupine SL AF - 01\" />\n\n</div><div><figcaption><span><i></i> German’s StVZO bike light regulations dictate, among other things, that bike lights must have a steady beam.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Germany’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/stvzo-bike-lights/\">StVZO bike light</a> regulations dictate that flashing bike lights are not permitted on either the front or rear of a bike. The regulations state this is because flashing patterns can be distracting to other road users.</p>\n<p>Flashing bikes are also outlawed in the Netherlands and Austria.</p>\n<p>In some places, flashing lights are reserved for emergency vehicles only – allowing other road users a clear cue of an emergency.</p>\n<p>This is the case <a href=\"https://app.leg.wa.gov/wac/default.aspx?cite=204-21-230\" target=\"_blank\">in Washington state</a>, where flashing white lights are prohibited except for on emergency vehicles.</p>\n<h2>Flashing or steady lights?</h2>\n<p>While cyclists in some countries may not have a choice, many of the best bike lights offer both flashing and steady modes.</p>\n<p>Riders may have a personal preference, but what evidence is there in favour of either?</p>\n<p><a href=\"https://www.proquest.com/docview/1919016416\" target=\"_blank\">A 2017 study</a> from Clemson University compared the visibility of flashing and steady rear lights. Using a long, straight road and a curved road, researchers looked at how light choice affected detection distance.</p>\n<p>The study found the flashing light was far superior on the straight road, allowing detection of the rider from three times the distance of the steady light. This equated to detection 82m sooner, on average.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cyclists lined up at traffic lights at night in London\" title=\"Cyclists lined up at traffic lights at night in London\" />\n\n</div><div><figcaption><span><i></i> Good lights can help you stand out in a busy urban environment.</span></figcaption><span> <i>Mike Kemp / Getty Images</i></span></div>\n<p>Earlier detection with a flashing light makes sense – <a href=\"http://publicaties.minienm.nl/documenten/strategisch-plan-verkeersveiligheid-2008-2020-van-voor-en-door-i\" target=\"_blank\">research shows</a> our eyes are better at detecting moving or changing stimuli and it seems we can make use of this to be seen from a greater distance when cycling.</p>\n<p>In addition, participants from this study commented that the steady light looked like a motorcyclist from a distance, while the flashing light enabled them to identify the road user as a cyclist sooner.</p>\n<p>Speaking to BikeRadar, <a href=\"http://www.visualexpert.com/index.html\" target=\"_blank\">Marc Green</a> – an authority on assessing human factors in collision analysis – said that research comparing steady and flashing lights is difficult to interpret “because there are so many variables (day/night, front/side/back view, the existence of other conspicuity aids, etc.)”.</p>\n<p>A full summary of this research will follow in the next edition of his book, but he added that “from a high-level view, it looks to me like this: [whether you choose to run] steady or flashing makes no difference in rural areas… but flashing is better in urban areas where there are a lot of steady background lights”</p>\n<h2>Do flashing bike lights affect depth perception?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bookman Curve 3 compact rear light for cycling\" title=\"6 of the best compact rear lights 04\" />\n\n</div><div><figcaption><span><i></i> When used on their own, flashing lights can distort depth perception.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>It is widely believed that flashing lights make it harder for drivers and other road users to detect distance and speed of travel because the stimulus is not constant.</p>\n<p>Though it relates specifically to strobe lights used on emergency vehicles, <a href=\"https://www.fireengineering.com/leadership/are-your-emergency-warning-lights-working-for-you/#gref\" target=\"_blank\">an article</a> published in <em>Fire Engineering</em> states “the viewer has depth perception difficulty… at night with strobes, unless the strobe is reflecting off of a nearby object.”</p>\n<p>It explains this phenomenon: “depth perception is a product of binocular vision. The viewer needs points at which his view can be fixed. Since strobe flashes are so brief, there aren’t enough visual clues for the eye to fix on.”</p>\n<p>Green also states <a href=\"http://www.visualexpert.com/Resources/readthis.html\" target=\"_blank\">in an article on his website</a> that “flashing lights are then better because they stand out from backgrounds of steady lights”. However, he cautions that “it is difficult to localise single lights… [and] distance is especially hard to judge.”</p>\n<h2>Are overshoes the answer?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SealSkinz AllWeather LED overshoe\" title=\"SealSkinz AllWeather LED overshoe\" />\n\n</div><div><figcaption><span><i></i> Some brands produce overshoes that integrate an LED light into the heel.</span></figcaption><span> <i>Sealskinz</i></span></div>\n<p>The 2017 Clemson University study also examined mounting lights to the heels of a cyclist.</p>\n<p>The study found that “when steady lights were mounted to the cyclist’s pedalling heels, participants [identified the cyclist] from a mean distance that was 1.7 times greater than when a flashing light was mounted to the seatpost”.</p>\n<p>This figure increased to 5.5 times when compared to a steady light mounted to the seatpost.</p>\n<p>While this might sound like an outlandish place to fit lights, many <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-overshoes/\">overshoes</a> and some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-shoes/\">winter cycling shoes</a> include loops on the rear to attach small lights for this very purpose.</p>\n<p>Pedal reflectors – which are a legal requirement in the UK – could perform a similar function.</p>\n<h2>What else should we consider?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lupine bike light on Stvzo setting\" title=\"Lupine bike light on Stvzo setting\" />\n\n</div><div><figcaption><span><i></i> StVZO bike lights have a cut-off beam shape.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>There are certain scenarios where factors other than visibility to vehicles will determine your choice.</p>\n<p>For example, when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-in-a-group/\">riding in a group</a> at night, a steady rear light will be appreciated by your fellow riders – the group needs to be seen, but cycling close to a flashing rear light can be distracting or dazzling.</p>\n<p>Indeed, there’s a safety risk if the dazzle impedes depth perception for someone riding on your wheel, which could be further worsened in wet conditions.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cyclist checking for directions on smartphone whilst out in the countryside on a dark foggy evening\" title=\"Cyclist checking for directions on smartphone whilst out in the countryside on a dark foggy evening\" />\n\n</div><div><figcaption><span><i></i> A steady light is a much better choice when riding in unlit areas.</span></figcaption><span> <i>Getty</i></span></div>\n<p>Chris Alston, the senior training officer at Cycling UK, also says a steady front light should be used when riding on dark roads or paths.</p>\n<p>“The use of flashing lights when <a href=\"https://www.bikeradar.com/advice/skills/cycling-at-night/\">cycling at night</a> can enable the rider to be seen, while also saving battery power,” says Alston. “However, riders are advised to consider using a fixed [front] beam in areas with no street lighting to enhance the visibility of the road/trail ahead.”</p>\n<p>This may also be a good option for riding in the dark in traffic-free situations such as cycle paths, where cyclists come into close proximity heading in opposite directions. A steady front light will allow you to see the way ahead, allow other path users to see you, and avoid dazzling them as you pass.</p>\n<h2>Are flashing lights dangerous for those with epilepsy?</h2>\n<p>The lights cyclists use inevitably affect other road users, one particular concern being the impact flashing lights could have on people with epilepsy. However, according to Epilepsy Action, photosensitive epilepsy is rare.</p>\n<p>“Around 1 in 100 people in the UK have epilepsy and of these people, around 3 in 100 have seizures that are triggered by flashing or flickering lights or patterns,” says Claudie Christie, media officer at the charity.</p>\n<p>Triggers can vary from person to person, according to Christie, and lights that flash between 16-25 times per second are most likely to trigger a seizure – far faster than the legal limit for lights in the UK.</p>\n<p>While Christie says “a small number of people” are sensitive to rates as low as three flashes per second, “legal bike lights which flash between one and four times per second are unlikely to trigger a seizure for most people with photosensitive epilepsy.”</p>\n<h2>What about reflectors and reflective clothing?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Group of road cyclists riding at night\" title=\"Group of road cyclists riding at night\" />\n\n</div><div><figcaption><span><i></i> Reflective highlights on clothing can help drivers mark you out as a cyclist.</span></figcaption><span> <i>Adam Gasson / Immediate Media</i></span></div>\n<p>Leaving lights aside for a moment, reflectors and reflective clothing can also play a key part in ensuring you’re seen on the bike when it gets dark.</p>\n<p>Some <a href=\"https://www.tandfonline.com/doi/full/10.1080/17543266.2021.1928758\" target=\"_blank\">studies have shown</a> wearing high-visibility clothing or accessories on parts of your body that move – for example, your cycling shoes, pedals, overshoes or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-helmets/\">helmet</a> – can improve your visibility when riding in the dark.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Look Geo Trekking Vision pedals\" title=\"Look Geo Trekking Vision\" />\n\n</div><div><figcaption><span><i></i> Pedal reflectors – which are a legal requirement in the UK – can also enhance visibility. </span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>Dubbed ‘biomotion’ garments by some brands and researchers, the movement and location of these reflective highlights “greatly enhances drivers’ ability to recognise both pedestrians… and cyclists”.</p>\n<h2>So, what lights should you run on your bike?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Six of the best: Rear bike lights - Be safe and be seen, night or day\" title=\"6 of the best rear bike lights 07\" />\n\n</div><div><figcaption><span><i></i> If you want to stay visible, running a flashing and steady light is likely your best bet.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Currently, whether you opt for a flashing or steady light is your choice in the UK, and it seems there may be advantages to both, depending on the situation.</p>\n<p>Given the importance of being seen by vehicles approaching from behind, the evidence suggests running a flashing rear light is a clear win in terms of attracting the attention of other road users.</p>\n<p>Choosing a rear light with a lower flash rate or with a less severe flash pattern (e.g., not on/off flash) should reduce dazzle for other road users and minimise the risk to those with photosensitive epilepsy.</p>\n<p>Combining this with a steady rear light could then maximise the ability of other road users to detect your distance and speed – allowing you to be detected early, identified as a cyclist and approached safely.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lezyne Micro Drive 600XL front light for road cycling - bean shot\" title=\"lezyne\" />\n\n</div><div><figcaption><span><i></i> A steady front light is likely to be the best option for most scenarios.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Though evidence may suggest a flashing front light to be more visible than a steady beam, there are other factors to consider here.</p>\n<p>Most bike headlights are brighter than rear lights. Most bike lights also use wide beams without a cut-off that could dazzle drivers or other cyclists. Any cyclist who has shared a bike path with an oncoming strobing light can attest to this.</p>\n<p>For drivers looking ahead or in a rear-view mirror, a bright flash in an otherwise mirror can be confusing, and obscure other details.</p>\n<p>There will always be edge cases – in the daytime, in low visibility, you may want to run a flashing front light – but at night, running a steady front beam is the most appropriate option for other road users. If you wish to run a flashing front light, use common sense and ensure it is at a low enough power and angled such that it will not dazzle other users.</p>\n<p> </p>","author":"Alice Thomson","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d52febcde8e612dae0e8b2c98040cb0393b0c295de6f291eb7bad3bcc78f0b2b","category":"Cycling"}