{"title":"Influence of compression garments on proprioception: A systematic review and meta‐analysis","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15144?af=R","date":1718724740000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/662ae42e-06fb-4e3c-a3d5-504cc733ef12/nyas15144-gra-0001-m.png\" alt=\"Influence of compression garments on proprioception: A systematic review and meta-analysis\" />\n<p>Compression garments (CGs) are commonly used in rehabilitation and sports contexts to enhance performance and speed up recovery. Despite the growing use of CGs in recent decades, there is no unanimous consensus on their overall influence on joint proprioception. In this current meta-analysis, we aim to fill this knowledge gap by assessing the impact of CGs on joint proprioception.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Compression garments (CGs) are commonly used in rehabilitation and sports contexts to enhance performance and speed up recovery. Despite the growing use of CGs in recent decades, there is no unanimous consensus on their overall influence on joint proprioception. In this current meta-analysis, we aim to fill this knowledge gap by assessing the impact of CGs on joint proprioception. We conducted a literature search across seven databases and one registry. Ultimately, we included 27 studies with 671 participants. The meta-analysis revealed that wearing CGs resulted in a significant reduction in absolute error during joint position sensing (Hedges’ <i>g</i>: −0.64, <i>p</i> = 0.006) as compared to no CGs. However, further analyses of variables such as constant error (<i>p</i> = 0.308), variable error (<i>p</i> = 0.541) during joint position sense tests, threshold to detect passive motion (<i>p</i> = 0.757), and active movement extent discrimination (<i>p</i> = 0.842) did not show a significant impact of CGs. The review also identified gaps in the reporting of certain outcomes, such as parameters of CGs, reporting of performance, individual-reported outcomes, and lack of placebo comparators. Consequently, this review provides guidelines for future studies that may facilitate evidence-based synthesis and ultimately contribute to a better understanding of the overall influence of CGs on joint proprioception.</p>","author":"Shashank Ghai, \nFinn Nilson, \nJohanna Gustavsson, \nIshan Ghai","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"d532a9cb58f2e50b80c659ef77b4be327921641a43cd12b27a68204b566412f9","category":"Environment"}