{"title":"Get ready for something new from BikeRadar and MBUK – we’re expanding our MTB video coverage on YouTube","link":"https://www.bikeradar.com/news/mbuk-video-trailer/","date":1678712412000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/MBUK-trailer-still-8ed255d.png?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Will Soffe, video presenter for MBUK and BikeRadar\" title=\"Will Soffe, video presenter for MBUK and BikeRadar\" />                                            <p>Get ready for something new from BikeRadar and MBUK!</p>\n<p>Our friends at Mountain Biking UK are venturing into video, bringing the trails, tech and personalities of Britain’s best-selling mountain biking magazine to life on BikeRadar’s YouTube channel.</p>\n<p>In weekly episodes dropping on BikeRadar, we’ll be celebrating the endless fun you can have on a mountain bike, with help from some familiar faces.</p>\n<p>We’ll be bringing the joy of riding to video, showcasing the most exciting tech, telling the stories that run through the sport and sharing the culture, lifestyle and spirit that make mountain biking so special.</p>\n<p>Hosted by <a href=\"https://www.bikeradar.com/author/willsoffe/\">Will Soffe</a>, the magazine’s former staff writer, and with former BikeRadar videographer <a href=\"https://www.bikeradar.com/author/maxwilman/\">Max Wilman</a> behind the camera, our expanded MTB video coverage will complement BikeRadar’s existing content on YouTube, where we’ll continue to deliver the world’s best buying and riding advice.</p>\n<p>On that note, eagle-eyed viewers may have noticed that we’ve recently grown BikeRadar’s video team, with the addition of dedicated road cycling and mountain biking presenters.</p>\n<p>Back to MBUK, and you can expect to see regular appearances from the rest of the team, too, along with some big names from the world of MTB, including Olly Wilkins, the Athertons and more.</p>\n<p>The first video goes live at <a href=\"http://www.youtube.com/@bikeradar\">www.youtube.com/@bikeradar</a> on Wednesday 15 March. Check out the trailer now!</p>\n\n<h2>What you can look forward to…</h2>\n<p>Here’s a sneak peek at some of the videos that’ll be live on the channel soon.</p>\n<h3>Surrey’s rowdiest singletrack</h3>\n<p>Don’t miss ‘A Lap With… Olly Wilkins’, where Odub shows us around his local Surrey Hills trails.</p>\n<h3>The Revolution’s over</h3>\n<p>Gutted by the news that Revolution Bike Park was to close, we headed up to north Wales to get the full lowdown – and enjoy some farewell laps at this legendary venue.</p>\n<h3>Mullet mania!</h3>\n<p>Will loves mixing wheel sizes so much that he’s ‘mulleted’ all his bikes. But why? And is it something you should think about doing, too?</p>\n<h3>Tales from the trails</h3>\n<p>We head to Dyfi Bike Park, where the world-beating <a href=\"https://www.mbuk.com/tag/the-athertons/\">Athert</a>o<a href=\"https://www.mbuk.com/tag/the-athertons/\">n siblings</a> show us how to shred their home tracks.</p>\n<h3>Mountain biking worldwide</h3>\n<p>All the latest news, tech and opinions from across the sport, delivered in inimitable MBUK style.</p>\n<h2>Meet the team…</h2>\n<h3>Will Soffe, presenter</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The MBUK team will be there racing</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Moustachioed air ace Will Soffe worked as a mechanic and suspension technician for the likes of Atherton Racing, Fox suspension, British Cycling and others before joining MBUK, so he knows a thing or two about bikes and how to ride them.</p>\n<h3>Max Wilman, videographer</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> BikeRadar and MBUK videographer Max Wilman on a Vitus Sommet 297 AMP mountain bike</span></figcaption><span> <i>Max Wilman / Our Media</i></span></div>\n<p>Before joining the BikeRadar video team, Max enjoyed the cushy life of an overseas bike guide and then photographer. When he’s not staring down the barrel of the lens, he can be found trail building, riding laps or working on converting his big yellow van.</p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d53ae56217bb39d30ef7c1e8b047cd2134cf2afb5b2a486ffb18c3","category":"Cycling"}