{"title":"The best workouts and training plans on Zwift","link":"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/","date":1637593860000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Zwift-workouts-and-training-plans-e0067c8.jpg?quality=45&amp;resize=620,413\" />                                            <p>Although <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> is great for just jumping on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> and free-riding for fun, it’s also a powerful training tool with an abundance of workouts and training plans to help you take your fitness to the next level.</p>\n<p>Whether you ride road, gravel or mountain bikes (or a bit of everything), there’s a training plan suitable for you and, because they’re all based around <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">Functional Threshold Power (FTP)</a> – the maximum average power you can sustain for approximately one hour – the training plans and workouts are all tailored specifically to your current level of fitness.</p>\n<p>Zwift has worked with race-winning coaches, such as former Italian national time-trial champion Marco Pinotti, and USA Cycling Level 1 coach Shayne Gaffney, to create workouts and training plans designed to improve your fitness and strength on the bike.</p>\n<p>Once you’ve got your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">Zwift setup</a> sorted, all you need to do is jump on and pedal. From there, you can take a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">Zwift FTP or ramp test</a> to establish your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>, allowing you to target specific intensities through your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">interval training</a> and really fast-track your fitness.</p>\n<section><div>\n        <h2>How to sign up to Zwift</h2>\n<p>Visit the <a href=\"https://www.zwift.com/\" target=\"_blank\">Zwift website</a> to sign up for a free 7-day trial. After your trial period ends, Zwift costs £12.99 / $14.99 per month.</p>\n<p>\n\n    </p></div>\n    </section><h2>Flexibility</h2>\n<p>Rather than prescribing a set workout at a set time, all of the training plans on Zwift are flexible, meaning you can adjust them around your own schedule.</p>\n<p>Each workout will give you a window in which to complete any given session, meaning it’s much easier to fit around your personal schedule. You can also complete workouts outdoors – simply mark as ‘done outdoors’ on the plan in-game.</p>\n<p>New workouts will then unlock automatically once a designated rest period has passed.</p>\n<p>As you go, you’ll earn experience points and stars for completed intervals. Best of all, if you work out online, you no longer have to do it alone because you can join the thousands of other riders on the platform in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\">Zwift group rides</a> and races, to help you stay motivated.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Zwift’s workouts and training plans are a sure-fire way to improve your fitness in a short space of time.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>Stress points</h2>\n<p>The difficulty level of a workout is measured in ‘stress points’ (sometimes shortened to ‘SP’).</p>\n<p>Based on the duration and intensity of a session, the higher the stress points score of a workout, the harder it will be, and vice versa.</p>\n<p>The maximum stress score you can generate within a single hour is 100. For reference, this would be generated if you rode at exactly your FTP for the entire hour.</p>\n<p>One of the great features of using this kind of metric (it’s similar to the Andrew Coggan/Training Peaks TSS metric that riders who <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">train with a power meter</a> may already be familiar with) is that it’s relative to everyone.</p>\n<p>Even if you’re fitter, the stress points of any given workout will still be the same – you simply do the workout at higher power numbers.</p>\n<p>With this in mind, Zwift categorises its training plans into three different tiers: beginner, intermediate and advanced.</p>\n<p>Average stress points per week will tend to rise with the tiers (though this isn’t always the case) and as you move up. You’ll also do more intense intervals and target specific areas of fitness according to the type of plan you choose, rather than simply making broad gains in general fitness.</p>\n<p>We’ve chosen a few of our favourite training plans and workouts to get you started, but this is by no means an exhaustive list. For the full rundown of what’s available, head to the Zwift app.</p>\n<h2>Beginner training plans on Zwift</h2>\n<p>If you’re new to cycling and/or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor cycling</a>, or are perhaps just coming back to the bike from a break, it’s a good idea to start out with one of the beginner-level plans.</p>\n<p>They’re designed to give you a relatively easy introduction to the world of interval training, while still ensuring you get in a decent workout and make those all-important fitness gains.</p>\n<h3>Zwift 101: 1 week / 2 hours per week</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Zwift 101 offers a gentle introduction to the world of structured interval training.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>This plan only lasts a week, so it’s intended to act more as an introduction to Zwift’s training interface and the world of structured interval training.</p>\n<p>It contains a couple of introductory workouts and two of the most popular short workouts, as well as a ramp test in the middle of the week to help you accurately measure your FTP before you start on a longer plan.</p>\n<h3>FTP Builder: 4 to 6 weeks / 5 hours per week / 255 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The FTP Builder focuses on developing sustainable aerobic power.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>The FTP Builder plan focuses on building sustainable aerobic power, with the majority of sessions consisting of endurance and tempo intervals.</p>\n<p>Designed for riders who perhaps haven’t done a structured training plan before, the workouts are simple and easy to understand, and most last under an hour.</p>\n<h3>Fondo: 3 to 4 weeks / 3 hours per week / 177 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Training for a sportive or a long ride? This plan’s for you.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Created for cyclists who are building up to a long ride, or sportive/gran fondo, the Fondo is another great plan for anyone who’s new to structured training or coming back to the sport from a break.</p>\n<p>The plan focuses mostly on endurance and tempo intervals, but there is also a bit of work at threshold and beyond mixed in to give your fitness a boost.</p>\n<h3>Pebble Pounder: 5 to 6 weeks / 4 hours per week / 199 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> As a gravel-focused training plan for beginners, the Pebble Pounder is a great way to improve your fitness for off-road riding.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>The Pebble Pounder is a gravel-focused training plan, which aims to steadily build your aerobic ability. That means plenty of time spent just below your threshold (also known as ‘sweetspot’), as well as some <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> workouts and pedalling exercises.</p>\n<p>With three workouts per week, plus an optional weekend ride (ideally spent outside on your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a> honing your handling skills), this is a great plan for anyone working towards an event or adventure.</p>\n<h3>Back to Fitness: 10 to 12 weeks / 1 hour per week / 84 stress points per week</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Back to Fitness plan is ideal for riders returning from a break.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’re coming back to cycling after a break or perhaps an injury, then the Back to Fitness training plan is designed to ease you back into regular riding so you can realise sustainable, long-term fitness gains.</p>\n<p>Designed by former pro racers and Olympic gold medalists Kristin Armstrong and Dani Rowe, this plan features just two short sessions per week. This leaves you with extra time to add volume through <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">base training</a> endurance rides, if you are keen to do more.</p>\n<h2>Intermediate training plans on Zwift</h2>\n<p>These plans are aimed at the more dedicated cyclist who, perhaps, already has a decent level of fitness and is looking to add structure to their training, or build on specific areas of fitness.</p>\n<h3>Active Offseason: 8 to 12 weeks / 9 hours per week / 446 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Active Offseason plan is based on nine hours of training a week.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’re a dedicated cyclist, with a good amount of time to train and looking to add structure to your winter, this could be the ideal plan for you. The workouts focus mostly on building up your endurance, but there is a little bit of tempo, threshold and above mixed in.</p>\n<p>There are some big days in this plan, leading to a relatively high number of average stress points per week, but there are also plenty of prescribed rest days to ensure you don’t overdo it.</p>\n<h3>Build Me Up: 10 to 12 weeks / 5 hours per week / 318 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Build Me Up plan promises a big leap in fitness.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’re serious about your training but a bit tight on time, the Build Me Up plan will help you make a big improvement to your aerobic engine.</p>\n<p>There’s a good mix of intensities in this plan, but tempo, threshold and Vo2 max intervals make up a significant portion of the work.</p>\n<h3>Zwift Racing: 4 to 6 weeks / 4 hours per week / 246 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> If virtual racing is your thing, this could be the training plan for you.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’ve ever dabbled in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-racing/\">Zwift racing</a>, you’re likely well aware it can be incredibly intense, especially in the opening kilometres when everyone’s fresh and the adrenaline is pumping.</p>\n<p>So whether you’re looking to prepare for your first tilt at full-gas indoor racing, to compete for a better finishing position or to move up a category, the Zwift Racing training plan is designed to help you achieve those goals.</p>\n<h3>Dirt Destroyer: 4 to 6 weeks / 5 hours per week / 273 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Dirt Destroyer training plan is designed for mountain bikers looking to build on an established base of fitness.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Designed by professional coach Matt Rowe, the Dirt Destroyer training plan is for mountain bikers and will upgrade your ability to keep putting out the power at low cadences, as well as repeating the large surges in effort required to scale steep and technical courses.</p>\n<p>Expect to have to react to constantly changing power and cadence levels across high-intensity workouts and at least five hours of training per week.</p>\n<h2>Advanced training plans on Zwift</h2>\n<p>At this level, you’ll need to have a solid base of fitness already established because things can get quite intense.</p>\n<p>Look at these plans when you’re coming up to a period of competition or have a big event coming up for which you want to be on form.</p>\n<h3>Crit Crusher: 4 to 8 weeks / 4 hours per week / 233 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Crit Crusher focuses on sprint and breakaway repetitions.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Focusing on sprint and breakaway repetitions, this plan was created as a race tune-up for criterium (short road races around circuits) and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-a-cyclocross-bike/\">cyclocross</a> races, and will help sharpen your legs for whatever kind of riding you do.</p>\n<p>The average stress points per week aren’t high on this plan, but there are a lot of hard and fast efforts, so Zwifters taking it on will want to have a decent base of fitness already in the bank. This is a great plan to use in the run-up to competition to hone top-end performance.</p>\n<h3>Singletrack Slayer: 7 to 10 weeks / 7 hours per week / 366 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Singletrack Slayer training plan is designed to prepare you for the rigours of XC racing. Don’t expect too many easy days here!</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Intended for experienced mountain bikers, the Singletrack Slayer training plan will push your limits with plenty of high-intensity workouts and pedalling drills designed to replicate the demands of <a href=\"https://www.bikeradar.com/advice/buyers-guides/top-5-2021-cross-country-bikes/\">cross-country racing</a>.</p>\n<p>As with other Advanced-level training plans, you’ll need a decent base of fitness under your belt before attempting this. For those on the final run-in to a key event though, it could be just what you need to sharpen your fitness.</p>\n<h3>TT Tune Up: 5 to 8 weeks / 7 hours per week / 391 stress points per week (average)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> TT Tune Up includes six workouts a week.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>With six workouts a week, this plan requires a large commitment, but if you’re looking for a big boost to your top-end power you’ll reap the rewards when you complete it.</p>\n<p>As the name suggests, this will suit those who want to excel in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time trials</a>, but recovery periods are limited, so you’ll need to be in good condition going into it.</p>\n<h2>Workouts on Zwift</h2>\n<p>If you’ve already got a training plan from elsewhere or just don’t want to commit fully to one yet, then Zwift has a large catalogue of individual workouts to get you working hard and targeting specific areas of your fitness.</p>\n<h3>Emily’s Short Mix: 00:30 / 44 stress points</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Emily’s Short Mix takes only 30 minutes, making it a good choice if you’re pressed for time.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>This workout is ideal if you’re short on time. With 44 stress points accumulated in half an hour, it packs a lot of bang for its buck.</p>\n<h3>2×20 FTP Intervals: 01:20 / 101 stress points</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> This FTP session is a turbo trainer classic.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>A classic turbo trainer workout, the 2×20 FTP Intervals session is perfect for anyone riding time trials. The long, hard intervals force you to concentrate on holding your power and position constant over longer durations.</p>\n<p>If you’ve got a time-trial bike, do this session on that and try to stay in the TT position for the entire duration of each 20-minute interval.</p>\n<h3>Mat Hayman Paris Roubaix 1: 01:21 / 97 stress points</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mat Hayman used Zwift as a training tool before winning Paris-Roubaix.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Indoor training on Zwift was crucial to <a href=\"https://www.bikeradar.com/features/pro-bike/meet-the-aero-bike-that-won-paris-roubaix-mathew-haymans-scott-foil/\">Mat Hayman’s famous win</a> at the hardest one-day race on the cycling calendar. It enabled him to replicate the kind of efforts required not just to hang tough with the likes of Tom Boonen across the infamous cobbled sectors, but also to outsprint him in the Roubaix velodrome for the win.</p>\n<p>Now, thanks to his former coach Kevin Poulton, you can experience something of what it took to win that famous Monument with this session that was built using Hayman’s power profile from the race, condensed down to a more manageable 81 minutes.</p>\n<p>Be warned, though, it’s as hard as the cobbles of Northern France.</p>\n<h3>SST (Long): 02:10 – 163 stress points</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> SST stands for Sweet Spot Training.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>SST stands for Sweet Spot Training, which is a small sub-zone around 90 to 95 per cent of FTP (we’ve got a separate explainer on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/sweetspot-training/\">sweet spot training</a>). It gets its name because it’s intense enough to provoke great physical adaptations, but easy enough that you can do lots of it without overly fatiguing your body.</p>\n<p>If you’re feeling really keen and you want a longer ride to accumulate those stress points, this is an ideal session.</p>\n<h3>Workout of the Week</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Can’t decide on your next session? Workout of the Week makes a weekly recommendation.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’re the kind of rider who chimes with the saying “variety is the spice of life”, then Zwift’s Workout of the Week section is perfect for you.</p>\n<p>As the name suggests, workouts in this category are updated on a weekly basis to keep things fresh and engaging.</p>\n<p>If you’re not following a set training plan, then these workouts are an easy way to incorporate some structured interval training into your weekly riding without needing to overthink things too much.</p>\n<h2>Custom workouts on Zwift</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can also create your own custom workouts on Zwift.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’ve reached this point in the article and are thinking that none of the above quite matches what you’re looking for, well, don’t worry. Zwift also lets you easily create custom workouts from its Training page.</p>\n<p>Zwift uses a simple drag and drop interface that makes designing your ultimate sweat-sesh a cinch – you just grab blocks from the right-hand column (there are blocks for all the different power zones, plus warm-up, cool down, intervals, free riding, text prompts and cadence) and use the mouse or text boxes to expand the length and difficulty of each interval.</p>\n<p>You can then tag your workout with a category and give it a suitable name. Handily, Zwift has a more in-depth <a href=\"https://zwift.com/news/12975-zwift-how-to-creating-a-custom-workout\" target=\"_blank\">guide to building custom workouts</a> if you need a little more guidance.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d53d21fb070959f3e741f61c44b4bae0ac9e32bf855cbb1e8f11d2459249c2de","category":"Cycling"}