{"title":"An Alternative Voice UI To Voice Assistants","link":"https://smashingmagazine.com/2021/06/alternative-voice-ui-voice-assistants/","date":1624028400000,"content":"<p>For most people, the first thing that comes to mind when thinking of voice user interfaces are voice assistants, such as Siri, <a href=\"https://www.smashingmagazine.com/2019/12/voice-skills-google-assistant-amazon-alexa/\">Amazon Alexa or Google Assistant</a>. In fact, assistants are the only context where most people have ever used voice to interact with a computer system. </p>\n<p>While voice assistants have brought <strong>voice user interfaces</strong> to the mainstream, the assistant paradigm is not the only, nor even the best way to use, design, and create voice user interfaces.</p>\n<p>In this article, I’ll go through the issues voice assistants suffer from and present a new approach for voice user interfaces that I call direct voice interactions.</p>\n<h3>Voice Assistants Are Voice-Based Chatbots</h3>\n<p>A voice assistant is a piece of software that uses natural language instead of icons and menus as its user interface. Assistants typically answer questions and often proactively try to help the user.</p>\n<p>Instead of straightforward transactions and commands, <strong>assistants mimic a human conversation</strong> and use natural language bi-directionally as the interaction modality, meaning it both takes input from the user and answers to the user by using natural language.</p>\n<p>The first assistants were dialogue-based question-answering systems. One early example is Microsoft’s <a href=\"https://en.wikipedia.org/wiki/Office_Assistant\">Clippy</a> that infamously tried to aid users of Microsoft Office by giving them instructions based on what it thought the user was trying to accomplish. Nowadays, a typical use case for the assistant paradigm are chatbots, often used for customer support in a chat discussion.</p>\n<p>Voice assistants, on the other hand, are chatbots that <strong>use voice instead of typing and text</strong>. The user input is not selections or text but speech and the response from the system is spoken out loud, too. These assistants can be general assistants such as Google Assistant or Alexa that can answer a multitude of questions in a reasonable way or custom assistants that are built for a special purpose such as fast-food ordering.</p>\n<p>Although often the user’s input is just a word or two and can be presented as selections instead of actual text, as the technology evolves, the conversations will be <strong>more open-ended and complex</strong>. The first defining feature of chatbots and assistants is the use of natural language and conversational style instead of icons, menus, and transactional style that defines a typical mobile app or website user experience.</p>\n<p><strong>Recommended reading</strong>: <em><a href=\"https://www.smashingmagazine.com/2017/08/ai-chatbot-web-speech-api-node-js/\">Building A Simple AI Chatbot With Web Speech API And Node.js</a></em></p>\n\n<p>The second defining characteristic that derives from the natural language responses is the illusion of a persona. The tone, quality, and language that the system uses define both the assistant experience, the illusion of empathy and susceptibility to service, and its persona. The idea of a good assistant experience is like <strong>being engaged with a real person</strong>.</p>\n<p>Since voice is the most natural way for us to communicate, this might sound awesome, but there are two major problems with using natural language responses. One of these problems, related to how well computers can imitate humans, might be fixed in the future with the development of <strong>conversational AI technologies</strong>, but the problem of how human brains handle information is a human problem, not fixable in the foreseeable future. Let’s look into these problems next.</p>\n<h3>Two Problems With Natural Language Responses</h3>\n<p>Voice user interfaces are of course user interfaces that use voice as a modality. But voice modality can be used for both directions: for inputting information from the user and outputting information from the system back to the user. For example, some elevators use <a href=\"https://www.smashingmagazine.com/2019/03/sanity-portabletext-speech-synthesis/\">speech synthesis</a> for confirming the user selection after the user presses a button. We’ll later discuss voice user interfaces that only use voice for inputting information and use traditional graphical user interfaces for showing the information back to the user.</p>\n<p>Voice assistants, on the other hand, <strong>use voice for both input and output</strong>. This approach has two main problems:</p>\n<h4>Problem #1: Imitation Of A Human Fails</h4>\n<p>As humans, we have an innate inclination to attribute human-like features to non-human objects. We see the features of a man in a cloud drifting by or look at a sandwich and it seems like it’s grinning at us. This is called <strong>anthropomorphism</strong>. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f277cf7d-91da-46f2-ad3b-b51bf1fb34d4/5-alternative-voice-ui-to-voice-assistants.jpg\" /></p>\n<p>This phenomenon applies to assistants too, and it is triggered by their natural language responses. While a graphical user interface can be built somewhat neutral, there’s no way a human could not start thinking about whether the voice of someone belongs to a young or an old person or whether they are male or a female. Because of this, the user almost starts to think that the assistant is indeed a human.</p>\n<p>However, we humans are very good at <strong>detecting fakes</strong>. Strangely enough, the closer something comes to resembling a human, the more the small deviations start to disturb us. There is a feeling of creepiness towards something that tries to be human-like but does not quite measure up to it. In robotics and computer animations this is referred to as the “<a href=\"https://www.scientificamerican.com/article/why-uncanny-valley-human-look-alikes-put-us-on-edge/\">uncanny valley</a>”.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cfb3e5ac-5f1a-48c7-9b39-80447e76d375/10-alternative-voice-ui-to-voice-assistants.jpg\" /></p>\n<p>The better and more human-like we try to make the assistant, the creepier and disappointing the user experience can be when something goes wrong. Everyone who has tried assistants has probably stumbled upon the problem of responding with something that feels idiotic or even rude.   </p>\n<p>The uncanny valley of voice assistants poses a problem of quality in assistant user experience that is hard to overcome. In fact, the <strong>Turing test</strong> (named after the famous mathematician Alan Turing) is passed when a human evaluator exhibiting a conversation between two agents cannot distinguish between which of them is a machine and which is a human. So far, it has never been passed.</p>\n<p>This means that the assistant paradigm sets <strong>a promise of a human-like service experience</strong> that can never be fulfilled and the user is bound to get disappointed. The successful experiences only build up the eventual disappointment, as the user begins to trust their human-like assistant.</p>\n<h4>Problem 2: Sequential And Slow Interactions</h4>\n<p>The second problem of voice assistants is that the turn-based nature of natural language responses causes delay to the interaction. This is due to how our brains process information. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f16e78a0-3812-41f6-9c8a-816794cc3f9c/12-alternative-voice-ui-to-voice-assistants.png\" /></p>\n<p>There are two types of data processing systems in our brains:</p>\n<ul>\n<li>A <strong>linguistic system</strong> that processes speech;</li>\n<li>A <strong>visuospatial system</strong> that specializes in processing visual and spatial information.</li>\n</ul>\n<p>These two systems can operate in parallel, but <strong>both systems process only one thing at a time</strong>. This is why you can speak and drive a car at the same time, but you can’t text and drive because both of those activities would happen in the visuospatial system.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b85e2240-ffe8-493a-a8a6-3060a5c02433/3-alternative-voice-ui-to-voice-assistants.jpg\" /></p>\n<p>Similarly, when you are talking to the voice assistant, the assistant needs to stay quiet and vice versa. This creates a <strong>turn-based conversation</strong>, where the other part is always fully passive.</p>\n<p>However, consider a difficult topic you want to discuss with your friend. You’d probably discuss face-to-face rather than over the phone, right? That is because in a face-to-face conversation we use non-verbal communication to give realtime visual feedback to our conversation partner. This creates a bi-directional information exchange loop and enables <strong>both parties to be actively involved</strong> in the conversation simultaneously.</p>\n<p>Assistants don’t give realtime visual feedback. They rely on a technology called end-pointing to decide when the user has stopped talking and replies only after that. And when they do reply, they don’t take any input from the user at the same time. The experience is fully unidirectional and turn-based.</p>\n<p>In a <strong>bi-directional</strong> and <strong>realtime face-to-face</strong> conversation, both parties can react immediately to both visual and linguistic signals. This utilizes the different information processing systems of the human brain and the conversation becomes smoother and more efficient.            </p>\n<p>Voice assistants are stuck in unidirectional mode because they are using natural language both as the input and output channels. While voice is up to four times faster than typing for input, it’s significantly slower to digest than reading. Because <strong>information needs to be processed sequentially</strong>, this approach only works well for simple commands such as “turn off the lights” that don’t require much output from the assistant.</p>\n<p>Earlier, I promised to discuss voice user interfaces that employ voice only for inputting data from the user. This kind of voice user interfaces benefit from the best parts of voice user interfaces — naturalness, speed and ease-of-use — but don’t suffer from the bad parts — uncanny valley and sequential interactions</p>\n<p> Let’s consider this alternative.</p>\n<h3>A Better Alternative To The Voice Assistant</h3>\n<p>The solution to overcome these problems in voice assistants is letting go of natural language responses, and replacing them with realtime visual feedback. <a href=\"https://www.speechly.com/blog/advantages-of-voice-user-interfaces/\">Switching feedback to visual</a> will enable the user to give and get feedback simultaneously. This will enable the application to react without interrupting the user and enabling a bidirectional information flow. Because the information flow is bidirectional, its throughput is bigger. </p>\n<p>Currently, the top use cases for voice assistants are setting alarms, playing music, checking the weather, and asking simple questions. All of these are <strong>low-stakes tasks</strong> that don’t frustrate the user too much when failing.</p>\n<p>As David Pierce from the <em>Wall Street Journal</em> once wrote:</p>\n<blockquote>“I can’t imagine booking a flight or managing my budget through a voice assistant, or tracking my diet by shouting ingredients at my speaker.”<br /><br />— David Pierce from <a href=\"https://www.wsj.com/articles/what-siri-alexa-and-google-assistant-can-doand-annoyingly-still-cant-do-11559480400\">Wall Street Journal</a></blockquote>\n\n<p>These are information-heavy tasks that need to go right.</p>\n<p>However, eventually, the voice user interface will fail. The key is to cover this as fast as possible. A lot of errors happen when typing on a keyboard or even in a face-to-face conversation. However, this is not at all frustrating as the user can recover simply by clicking the backspace and trying again or asking for clarification.</p>\n<p>This <strong>fast recovery from errors</strong> enables the user to be more efficient and doesn’t force them into a weird conversation with an assistant.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/23a92489-25dc-4724-bc4b-f9557d448635/11-alternative-voice-ui-to-voice-assistants.png\" /></p>\n<p>“Isn’t this semantics?”, you might ask. If you are going to talk to the computer does it really matter if you are talking directly to the computer or through a virtual persona? In both cases, you are just talking to a computer!   </p>\n<p>Yes, the difference is subtle, but critical. When clicking a button or menu item in a GUI (<strong>G</strong>raphical <strong>U</strong>ser <strong>I</strong>nterface) it is blatantly obvious that we are operating a machine. There is no illusion of a person. By replacing that clicking with a voice command, we are improving the human-computer interaction. With the assistant paradigm, on the other hand, we are creating <strong>a deteriorated version of the human-to-human interaction</strong> and hence, journeying into the uncanny valley.</p>\n<p>Blending voice functionalities into the graphical user interface also offers the potential to harness the power of different modalities. While the user can use voice to operate the application, they have the ability to use the traditional graphical interface, too. This enables the user to <strong>switch between touch and voice</strong> seamlessly and choose the best option based on their context and task. </p>\n<p>For example, voice is a very efficient method for inputting rich information. Selecting between a couple of valid alternatives, touch or click is probably better. The user can then replace typing and browsing by saying something like, “Show me flights from London to New York departing tomorrow,” and select the best option from the list by using touch.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0b56b184-6f7f-48e7-a741-c5c53ab87821/4-alternative-voice-ui-to-voice-assistants.png\" /></p>\n<p>Contrary to the traditional turn-based voice assistant systems that wait for the user to stop talking before processing the user request, systems using streaming spoken language understanding actively try to comprehend the user intent from the very moment the user starts to talk. As soon as the user says something actionable, the UI instantly reacts to it.</p>\n<p>The instant response immediately validates that the system is understanding the user and encourages the user to go on. It’s analogous to a nod or a short “a-ha” in human-to-human communication. This results in longer and more complex utterances supported. Respectively, if the system does not understand the user or the user misspeaks, <strong>instant feedback enables fast recovery</strong>. The user can immediately correct and continue, or even verbally correct themself: “I want this, no I meant, I want that.” You can try this kind of application yourself in our <a href=\"https://fashion.speechly.com/\">voice search demo</a>. </p>\n<p>As you can see in the demo, the realtime visual feedback enables the user to correct themselves naturally and encourages them to continue with the voice experience. As they are not confused by a virtual persona, they can relate to possible errors in a similar way to typos — not as personal insults. The experience is <strong>faster and more natural</strong> because the information fed to the user is not limited by the typical rate of speech of about 150 words per minute.</p>\n<p><strong>Recommended reading</strong>: <em><a href=\"https://www.smashingmagazine.com/2017/05/designing-voice-experiences/\">Designing Voice Experiences</a> by Lyndon Cerejo</em></p>\n\n<h3>Conclusions</h3>\n<p>While voice assistants have been by far the most common use for voice user interfaces so far, the use of natural language responses makes them inefficient and unnatural. Voice is a great modality for inputting information, but listening to a machine talking is not very inspiring. This is the big issue of voice assistants. </p>\n<p>The future of voice should therefore not be in conversations with a computer but in <strong>replacing tedious user tasks</strong> with the most natural way of communicating: <em>speech</em>. Direct voice interactions can be used to improve form filling experience in web or mobile applications, to create better search experiences, and to enable a more efficient way to control or navigate in an application.</p>\n<p>Designers and app developers are constantly <strong>looking for ways to reduce friction</strong> in their apps or websites. Enhancing the current graphical user interface with a voice modality would enable multiple times faster user interactions especially in certain situations such as when the end-user is on mobile and on the go and typing is hard. In fact, voice search can be <a href=\"https://www.youtube.com/watch?v=Q2gwzTWADns\">up to five times faster</a> than a traditional search filtering user interface, even when using a desktop computer. </p>\n<p>Next time, when you are thinking about how you can make a certain user task in your application easier to use, more enjoyable to use, or you are interested in increasing conversions, consider whether that user task can be described accurately in natural language. If yes, complement your user interface with a voice modality but <strong>don’t force your users</strong> to conversate with a computer.</p>\n<h4>Resources</h4>\n<ul>\n<li>“<a href=\"https://www.uxmatters.com/mt/archives/2018/10/voice-first-versus-the-multimodal-user-interfaces-of-the-future.php\">Voice First Versus The Multimodal User Interfaces Of The Future</a>,” Joan Palmiter Bajorek, UXmatters</li>\n<li>“<a href=\"https://www.speechly.com/blog/voice-application-design-guide/\">Guidelines For Creating Productive Voice-Enabled Apps</a>,” Hannes Heikinheimo, Speechly</li>\n<li>“<a href=\"https://www.uxmatters.com/mt/archives/2021/01/6-reasons-your-touch-screen-applications-should-have-voice-capabilities.php\">6 Reasons Your Touch-Screen Apps Should Have Voice Capabilities</a>,” Ottomatias Peura, UXmatters </li>\n<li><a href=\"https://www.smashingmagazine.com/2018/12/mixing-tangible-intangible-multimodal-interfaces-adobe-xd/\">Mixing Tangible And Intangible: Designing Multimodal Interfaces Using Adobe XD</a>, Nick Babich, Smashing Magazine<br />(<em>Adobe XD can be for prototyping something similar</em>)</li>\n<li>“<a href=\"https://rain.agency/efficiency-speed-sound-promise-voice-enabled-operations/\">Efficiency At The Speed Of Sound: The Promise Of Voice-Enabled Operations</a>,” Eric Turkington, RAIN</li>\n<li>A <a href=\"https://fashion.speechly.com/\">demo</a> showcasing realtime visual feedback in eCommerce voice search filtering (<a href=\"https://www.youtube.com/watch?v=xI68NT8D1m8&amp;ab_channel=Speechly\">video version</a>)</li>\n<li><a href=\"https://www.speechly.com/\">Speechly</a> provides developer tools for this kind of user interfaces</li>\n<li>Open source alternative: <a href=\"http://voice2json.org/\">voice2json</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"d54674da18bbebd343d7e78b48910097d2b63c143d0e609e2988b1e10e9fb4ec","category":"Tech"}