{"title":"Epic Games Asks Supreme Court to Hear Apple Case","link":"https://www.macrumors.com/2023/09/27/epic-games-supreme-court/","date":1695851040000,"content":"<a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> today filed a petition for a writ of certiorari with the Supreme Court, which basically means the company is asking the Supreme Court to make a ruling in its ongoing legal battle with Apple.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/app-store-blue-banner-epic-1.jpg\" alt width=\"1794\" height=\"1009\" />\r<br />\nThe Supreme Court is the last stop for ‌Epic Games‌ after it lost an appeal earlier this year. The Ninth Circuit Court of Appeals in April 2023 <a href=\"https://www.macrumors.com/2023/04/24/epic-games-loses-appeal-app-store-battle/\">sided with the lower court</a> and ruled that Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> rules do not violate antitrust law by not allowing for third-party marketplaces.\r<br />\n\r<br />\nSince 2020, Epic has been pushing for a ruling that would allow it to skirt the ‌App Store‌ and offer apps directly to consumers through sideloading or an alternate store, but its legal arguments <a href=\"https://www.macrumors.com/2021/09/10/epic-games-vs-apple-decision/\">have not been successful</a>. Epic ultimately wants to sell digital skins and other goods to its Fortnite customers without having to give Apple a 30 percent cut of its proceeds.<blockquote>Epic also offers digital goods--such as outfits--that users can purchase for use within Fortnite. Epic has invested vast sums in developing not just Fortnite but those digital add-ons, to which Apple contributes nothing. But Apple required Epic to use its IAP and pay the 30% commission on every in-app purchase that any iPhone user made directly from Epic, no matter how many years after downloading Fortnite from the App Store.</blockquote>Epic's 488 page filing lists several reasons why the Supreme Court should hear the case, focusing on errors made by the lower courts and the significance of the case, as any major ‌App Store‌ change would impact hundreds of thousands of developers.\r<br />\n\r<br />\nThe Supreme Court could opt not to hear Epic's case, and it only accepts a fraction of the cases that it is asked to review each year.\r<br />\n\r<br />\nWhen the Ninth Circuit Court of Appeals made its decision, it upheld the ruling of the lower court, including the mandate that Apple allow developers to direct customers to purchase options outside of the ‌App Store‌. Apple does not want to make these ‌App Store‌ changes, and so it too may ask the Supreme Court to make a ruling on that portion of the case.\r<br />\n\r<br />\nApple back in in July <a href=\"https://www.macrumors.com/2023/07/17/app-store-rule-change-epic-games-delayed/\">was given 90 days</a> after the appeals court ruling to decide whether it would petition the Supreme Court. Apple has not yet contacted the Supreme Court, nor has it hit that 90 day limit. When the 90-day limit expires, Apple will either need to ask the Supreme Court to hear the case or implement the ‌App Store‌ changes that it has been ordered to make.<div>Tags: <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/27/epic-games-supreme-court/\">Epic Games Asks Supreme Court to Hear Apple Case</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/epic-games-asks-supreme-court-to-hear-apple-case.2405160/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d5465b769175436af9e899abcf614541b8f72ac2e772399c429ae1f7abff6644","category":"Apple"}