{"title":"Physical activity and depression symptoms in people with osteoarthritis-related pain: A cross-sectional study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003129","date":1721311200000,"content":"<p>by Michaela C. Pascoe, Rhiannon K. Patten, Alexander Tacey, Mary N. Woessner, Matthew Bourke, Kim Bennell, Phong Tran, Michael J. McKenna, Vasso Apostolopoulos, Rebecca Lane, Jakub Koska, Alev Asilioglu, Jodie Sheeny, Itamar Levinger, Alexandra Parker</p>\r\n\r\nOsteoarthritis is a leading cause of chronic pain and is associated with high rates of depression. Physical activity reduces depression symptoms and pain levels. It remains unknown if physical activity is associated with lower symptoms of depression irrespective of pain levels in individuals with osteoarthritis. We explored whether pain mediated or moderated the relationship between levels of physical activity engagement and depression symptoms. Individuals with osteoarthritis who were waiting for an orthopaedic consultation at a public hospital in Melbourne, Australia, were recruited. Data collected on pain levels, physical activity engagement and depression symptoms. Descriptive statistics were used to summarise participant characteristics. Moderation and mediation analyses were used to establish the impact of pain on the relationship between physical activity and depression, after adjusting for demographic and joint specific characteristics. The results indicated that the inverse association between physical activity and depression depended on the level of pain, such that the association was stronger in people with greater pain. The mediation results confirm that participating in physical activity is indirectly, inversely associated with symptoms of depression through lower levels of pain. The highest levels of pain were associated with the most potential benefit in terms of reduction in symptoms of depression from engaging in physical activity. Physical activity may be particularly important to manage depression symptoms in people with greater osteoarthritis-related pain as patients with the highest pain may have the greatest benefits.","author":"Michaela C. Pascoe","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d5487039a4f21bef5248bfd4ccc3b80cdd7fd0945a73601757d266882eeeb703","category":"Environment"}