{"title":"SiFive เปิดตัวซีพียู RISC-V รุ่นใหม่ P870 และ X390 ประสิทธิภาพเธร็ดเดียวดีขึ้น 50%","link":"https://www.blognone.com/node/136197","date":1697085387000,"content":"<div><div><div><p>SiFive บริษัทผู้ออกแบบชิป RISC-V เจ้าดัง เปิดตัวซีพียูใหม่สองรุ่นคือ Performance P870 และ Intelligence X390</p>\n<p><strong>SiFive Performance P870</strong> เป็นซีพียูระดับเรือธงรุ่นท็อปสุดของ SiFive ซึ่งเป็นการอัพเกรดใหญ่จาก <a href=\"https://www.blognone.com/node/126280\">P650 ของปี 2021</a> และ <a href=\"https://www.sifive.com/press/sifives-new-high-performance-processors-offer-a-significant\">P670 ของปี 2022</a> โดยประสิทธิภาพสูงสุด (peak performance) แบบเธร็ดเดียวเพิ่มจากรุ่นก่อนถึง 50%</p>\n<p>SiFive P870 ยังรองรับการต่อเป็นคลัสเตอร์ขนาดสูงสุด 32 คอร์ รองรับ Ubuntu และ Automotive Grade Linux อย่างเป็นทางการ อีกทั้งยังผ่านเกณฑ์ข้อกำหนดของกูเกิลในการรัน Android บน RISC-V ด้วย เหมาะแก่การซื้อพิมพ์เขียวไปต่อยอดทำโซลูชันประเภทต่างๆ ที่ต้องการสมรรถนะสูงและรัน Linux/Android (เช่น การทำเซิร์ฟเวอร์ในศูนย์ข้อมูล) โดยเบื้องต้นมีบริษัทผลิตชิปอย่าง Cadence ประกาศแล้วว่าจะนำไปใช้งาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/27171ba1256dc18b19f0ff5599d73c65.png\" /></p>\n<p><strong>SiFive Intelligence X390</strong> เป็นซีพียูกลุ่ม edge ประมวลผลที่ปลายทาง ต่อยอดจาก Intelligence X280 รุ่นก่อนหน้า โดยปรับประสิทธิภาพการประมวลผลเวกเตอร์เพิ่ม 4 เท่า รองรับการขยายชุดคำสั่งเวกเตอร์ผ่าน SiFive Vector Coprocessor Interface eXtension (VCIX) ซึ่งบริษัทที่ซื้อพิมพ์เขียวไปสามารถนำ X390 ไปใช้ร่วมกับ accelerator เฉพาะทางของตัวเองได้</p>\n<p>ทั้ง P870 และ X390 สามารถนำมาใช้ร่วมกันได้ (ตามภาพ) โดย P870 ใช้เป็นซีพียูหลักสำหรับงานทั่วไป (scalar) และ X390 ใช้เป็น NPU ประมวลผลงาน AI ร่วมกับชิปคัสตอมพิเศษของลูกค้าแต่ละราย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/22c880730e2c79b2197dcdbe1e4d7a1c.jpg\" /></p>\n<p>คูแข่งสำคัญของ SiFive คือ Arm ที่มีโมเดลธุรกิจเป็นการขายพิมพ์เขียวเหมือนกัน เมื่อสถาปัตยกรรม RISC-V ได้รับความนิยมมากขึ้นเรื่อยๆ SiFive ในฐานะผู้นำวงการนี้ย่อมได้รับความสนใจมากที่สุดจากกลุ่มลูกค้าเดียวกันกับ Arm (Krste Asanović ผู้ก่อตั้ง SiFive คือผู้สร้าง RISC-V ตอนเป็นนักวิจัยอยู่ที่ Berkeley)</p>\n<p>ที่มา - <a href=\"https://www.sifive.com/press/sifive-announces-differentiated-solutions-for-generative\">SiFive</a>, <a href=\"https://venturebeat.com/games/sifive-unveils-two-new-high-performance-risc-v-processors/\">VentureBeat</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sifive\">SiFive</a></div><div><a href=\"/topics/risc-v\">RISC-V</a></div><div><a href=\"/topics/cpu\">CPU</a></div><div><a href=\"/topics/processor\">Processor</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d54f344f7e07545396d6a4fa3587df15c412cd9142c3a4680fcbde824f8729d9","category":"Thai"}