{"title":"Research on the Interaction Mechanisms between ScCO2 and Low-Rank / High-Rank Coal with ReaxFF-MD Force Field","link":"https://www.preprints.org/manuscript/202405.0822/v1","date":1715586879000,"content":"CO2 geological sequestration in coal seams can achieve the dual objectives of CO2 emission reduction and enhanced coalbed methane production, making it a highly promising carbon capture and storage technology. However, the injection of CO2 into coal reservoirs in the form of supercritical fluid (ScCO2) leads to complex physicochemical reactions with the coal seam, altering the properties of the coal reservoir and impacting the effectiveness of CO2 sequestration and methane production enhancement.In this paper, theoretical calculations based on ReaxFF-MD were conducted to study the interaction mechanism between ScCO2 and the macromolecular structure of both low-rank and high-rank coal, to address the limitations of experimental methods. The reaction of ScCO2 with low-rank coal and high-rank coal exhibits significant differences. At swelling stage, the low-rank coal experiences a decrease in aromatic structure and aliphatic structure, high-rank coal shows an increase in aromatic structure and a decrease in aliphatic structure, while swelling phenomenon is more pronounced in high-rank coal. At dissolution stage, low-rank coal is initially decomposed into two secondary molecular fragments, and then recombine to form new molecular structure, the aromatic structure increased and the aliphatic structure decreased. In contrast, high-rank coal occurs stretches-breakage-movement-reconnection, a reduction in aromatic structure and an increase in aliphatic structure.The primary reasons for these variations lie in distinct molecular structure compositions and the properties of ScCO2, leading to different reaction pathways of functional group and aromatic structure. The reaction pathways of functional groups and aromatic structures in coal can be summarized as follows: the breakage of the O-H bond in hydroxyl groups, the breakage of the C-OH bond in carboxyl groups, transformation of aliphatic structures into smaller hydrocarbon compounds or formation of long-chain alkenes, and various pathways involving broken, rearrangement, recombination of aromatic structures. In low-rank coal, there is a higher abundance of oxygen-containing functional groups and aliphatic structures. The breakage of O-H and C-OH chemical bonds results in the formation of free radical ions, while some aliphatic structures detach to produce hydrocarbons. Additionally, some of these aliphatic structures combine with carbonyl groups and free radical ions to generate new aromatic structures. Conversely, in high-rank coal, the lower content of oxygen-containing functional groups and aliphatic structures, along with stronger intramolecular forces, results in fewer chemical bond breakages and makes it less conducive to the formation of new aromatic structures.These results elucidate the specific deformations of different chemical groups, offering a molecular-level understanding of the interaction between CO2 and coal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5573f04c91eec06b0893e758ebc94f83edb7cf25b04b761e7d30dd94b7a69d1","category":"Interdisciplinary"}