{"title":"Understanding sexual health service access for gay, bisexual and other men who have sex with men in Ireland during the COVID-19 crisis: Findings from the EMERGE survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306280","date":1719842400000,"content":"<p>by Adam Shanley, Kate O’Donnell, Peter Weatherburn, John Gilmore, T. Charles Witzel</p>\r\nBackground <p>In the Republic of Ireland, the COVID-19 crisis led to sexual health service closures while clinical staff were redeployed to the pandemic response. Gay, bisexual and other men who have sex with men (gbMSM) face pre-existing sexual health inequalities which may have been exacerbated. The aim of this study is to understand sexual health service accessibility for gbMSM in Ireland during the COVID-19 crisis.</p> Methods <p>EMERGE recruited 980 gbMSM in Ireland (June-July 2021) to an anonymous online survey investigating well-being and service access through geo-location sexual networking apps (Grindr/Growlr), social media (Facebook/Instagram/Twitter) and collaborators. We fit multiple regression models reporting odds ratios (ORs) to understand how demographic and behavioural characteristics (age, sexual orientation, HIV testing history/status, region of residence, region of birth and education) were associated with ability to access services.</p> Results <p>Of the respondents, 410 gbMSM accessed sexual health services with some or no difficulty and 176 attempted but were unable to access services during the COVID-19 crisis. A further 382 gbMSM did not attempt to access services and were excluded from this sample and analysis.Baseline: mean age 35.4 years, 88% gay, 83% previously tested for HIV, 69% Dublin-based, 71% born in Ireland and 74% with high level of education.In multiple regression, gbMSM aged 56+ years (aOR = 0.38, 95%CI:0.16, 0.88), not previously tested for HIV (aOR = 0.46, 95%CI:0.23, 0.93) and with medium and low education (aOR = 0.55 95%CI:0.35, 0.85) had lowest odds of successfully accessing services.GbMSM with HIV were most likely to be able to access services successfully (aOR = 2.68 95%CI:1.83, 6.08).Most disrupted services were: STI testing, HIV testing and PrEP.</p> Conclusions <p>Service access difficulties were found to largely map onto pre-existing sexual health inequalities for gbMSM. Future service development efforts should prioritise (re)engaging older gbMSM, those who have not previously tested for HIV and those without high levels of education.</p>","author":"Adam Shanley","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d563b5c3f866ecc339b703f3dbdddf9827d5c90fb8acf2c1449b743218ed1102","category":"Interdisciplinary"}