{"title":"Nikola Tesla’s historic Wardenclyffe lab site at risk after devastating fire","link":"https://arstechnica.com/?p=1987006","date":1701285549000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/tesla5CROP-800x533.jpg\" alt=\"historic photo of low brick building with a steel tower with dome rising from the roof\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/tesla5CROP.jpg\">Enlarge</a> <span>/</span> Nikola Tesla's Wardenclyffe plant on Long Island circa 1902 in partial stage of completion. (credit: Public domain)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Back in 2012, a <a href=\"https://www.npr.org/2012/08/24/159925435/zap-cartoonist-raises-1-million-for-tesla-museum\">crowdfunding effort</a> on Indigogo <a href=\"http://www.cnn.com/2012/08/21/tech/innovation/tesla-museum-campaign/index.html\">successfully raised</a> the funds necessary to purchase the <a href=\"https://en.wikipedia.org/wiki/Wardenclyffe_Tower\">Wardenclyffe Tower site</a> on Long Island, New York, where Serbian inventor <a href=\"https://en.wikipedia.org/wiki/Nikola_Tesla\">Nikola Tesla</a> once tried to build an ambitious wireless transmission station. The goal was to raise additional funds to build a $20 million <a href=\"https://teslasciencecenter.org\">Tesla Science Center</a> there, with a museum, an educational center, and a technological innovation program. The <a href=\"https://en.wikipedia.org/wiki/Tesla_Science_Center_at_Wardenclyffe\">nonprofit group</a> behind the project finally broke ground this April after years of basic restoration work—only to experience a devastating setback last week, two days before Thanksgiving, when a fire broke out.</p>\n<p>Over 100 firefighters from 17 local departments responded and battled the flames throughout the night, as residual embers led to two additional outbreaks. One firefighter sustained bruised ribs after falling off a ladder, but there were no other injuries or fatalities. Once <a href=\"https://teslasciencecenter.org/fire-at-wardenclyffe/\">the blaze</a> was extinguished, the TSC group called in their engineers to assess the damage and make recommendations for repairs. While an investigation is ongoing as to the cause of the fire, Fire Chief Sean McCarrick said <a href=\"https://www.youtube.com/watch?v=-UovhWEi10E&amp;t=1390s\">during a press conference</a> on Tuesday, November 28, that they had ruled out arson. According to project architect Mark Thaler, there was nothing flammable in the lab that could have caused the fire, although the back buildings had wood-frame roofs.</p>\n<p>The original brick building, designed by Stanford White, is still standing, although there is considerable damage to the structure of the roof, steel girders, chimney, cupola, and a portion of a wall. Some elements have been irreparably destroyed, but fortunately all museum artifacts in TSC's collection were stored offsite. The most pressing concern is that water from the firehoses saturated the brick walls, according to Thaler, since the upcoming colder winter temperatures could freeze that moisture and cause the brick work to break apart and collapse. The engineers have also recommended adding strategic wall supports to both the interior and exterior to shore up the structure.</p></div><p><a href=\"https://arstechnica.com/?p=1987006#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987006&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d564d3863dbe7b987fa9df0a9523febcde51670e81cbdb03a791a4eb769df4f7","category":"Tech"}