{"title":"Closing the skills and talent divide","link":"https://www.hashicorp.com/blog/closing-the-skills-and-talent-divide","date":1700683200000,"content":"<p>In the world of talent acquisition, organizations face a myriad of challenges attracting, motivating, and retaining top talent. Despite recent economic shifts, the search for \"top talent\" remains intense as vendors, hyperscalers, and large organizations all vie for the same pool of candidates.</p>\n\n<p>Recently, I joined HashiCorp Field CTOs Sarah Polan and Christian Reilly on the <a href=\"https://podcasts.apple.com/us/podcast/hashicast-navigating-cloud-adoption-for-c-suites/id1710524211\">HashiCast: Navigating the Cloud for C-Suites podcast</a> to discuss <a href=\"https://podcasts.apple.com/us/podcast/overcoming-the-skills-gap/id1710524211?i=1000634785064\">Overcoming the Skills Gap</a>. Together, we  explored strategies to build a team that has the skills needed to drive your cloud initiatives. Here are some thoughts on the ideas we cover:</p>\n\n<h3>You can’t hire instant perfection</h3>\n\n<p>Many executives expect to hire perfection, demanding individuals who can hit the ground running. However, the reality is that settling into a new role often takes time; many studies suggest that a <a href=\"https://www.gallup.com/workplace/246242/essential-ingredients-effective-onboarding-program.aspx\">12-month onboarding period</a> is the norm, particularly in the tech sector. The question then becomes: Is hitting the ground running a realistic expectation, or should organizations reassess their onboarding strategies?</p>\n\n<p>Trying to hire perfection elongates the hiring process, and with this comes an associated cost. The<a href=\"https://www.shrm.org/resourcesandtools/hr-topics/talent-acquisition/pages/the-real-costs-of-recruitment.aspx\"> Society for Human Resource Management</a> suggests that hiring costs could run 90% - 200% of the original position budget. And the impact can be felt beyond the financial burden, as not filling a position can put higher workloads on existing team members, decrease productivity and even impact customer satisfaction.</p>\n\n<h3>Psychology matters</h3>\n\n<p>Best practices involve not just hiring based on technical skills but understanding the psychology of individuals, including how the importance of diverse teams with varied backgrounds and skill sets helps create high-performing organizations that are focused on innovative problem solving. </p>\n\n<p>Podcast co-host Sarah Polan is a great example. After being a professional opera singer, family circumstances and her interest in technology fueled a career change. Critically, the skills Sarah learned in very different roles have been hugely significant in her success as a Field CTO. (Read more about Sarah’s story: <a href=\"https://wearetechwomen.com/inspirational-woman-sarah-polan-field-cto-hashicorp/\">Inspirational Woman: Sarah Polan.</a>)</p>\n\n<h3>Leveraging diversity to build holistic teams</h3>\n\n<p>By understanding the unique strengths of each team member, leaders can build comprehensive teams that drive innovation and value for the organization. The key is to shift from a checkbox exercise to a strategic approach that considers holistic team development. </p>\n\n<h3>Meeting employee expectations</h3>\n\n<p>This post-pandemic era has seen huge shifts in employee expectations. The so-called 'great resignation' movement highlighted the importance of purpose and feeling valued. Organizations that invest in employee development and create a sense of belonging  are likely to retain talent longer, contributing to overall stability and growth as identified by Gartner in <a href=\"https://www.gartner.com/en/articles/employees-seek-personal-value-and-purpose-at-work-be-prepared-to-deliver#:%7E:text=Bottom%20line%3A%20People%20seek%20purpose,will%20stay%20at%20their%20positions.\">The Human Deal Framework</a> </p>\n\n<p>In addition, flexibility and autonomy in work arrangements have gained prominence, with <a href=\"https://business.linkedin.com/talent-solutions/global-talent-trends/archival/global-talent-trends-may-2023#employee-values\">LinkedIn's Global Talent Trends</a>, May 2023 survey emphasizing their importance. As organizations navigate a changing landscape, questions arise about whether to adopt a remote-first, hybrid, or community-building approach. Evolving workforce dynamics, <a href=\"https://www.gflesch.com/blog/average-attrition-rate-in-tech\">marked by shorter job tenures</a>, suggest the need to shift in how companies approach talent acquisition and retention.</p>\n\n<h3>AI’s looming impact</h3>\n\n<p>There is also an urgent need to explore the impact of AI on talent acquisition. Whilst AI has the potential to enhance communication, streamline processes, and access hidden talent pools, important questions about AI’s bias and ethical usage remain. </p>\n\n<p>In addition, the concept of AI as a “co-pilot” for employees prompts intriguing reflections on shifting entry-level requirements and the evolving role of humans in the workforce. AI-driven learning platforms are already playing a pivotal role in this transformation, efficiently evaluating employees' skills and knowledge gaps. Adaptive learning systems adjust the pace of learning to individual progress, enabling a more personalized and effective onboarding experience. AI-powered virtual assistants and chatbots can also offer real-time support to new hires, addressing queries, providing guidance on company policies, and easing newcomers’ transition into the organization. </p>\n\n<p>If you would like to know more about the evolving talent landscape that demands a strategic and adaptive approach from organizations, <a href=\"https://podcasts.apple.com/us/podcast/overcoming-the-skills-gap/id1710524211?i=1000634785064\">take a listen</a> and subscribe to the podcast using the links at the end of the post. </p>\n\n<p>I believe that only by embracing diversity, prioritizing employee development, and leveraging technology responsibly, can organizations position themselves to attract, motivate, and retain top talent in today's dynamic and competitive market – and thus help close the skills gap.</p>\n\n<h2>Subscribe to Navigating the Cloud for C-Suites</h2>\n\n<p>To avoid missing a single episode of Navigating the Cloud for C-Suites, subscribe to the series on your favorite podcast platform as we journey toward a brighter and more efficient future in the cloud together:</p>\n\n<ul>\n<li>Subscribe to <a href=\"https://podcasts.apple.com/gb/podcast/hashicast-navigating-cloud-adoption-for-c-suites/id1710524211\">Navigating the Cloud for C-Suites on Apple Podcasts</a></li>\n<li>Subscribe to <a href=\"https://podcasts.apple.com/us/podcast/hashicast-navigating-cloud-adoption-for-c-suites/id1710524211\">Navigating the Cloud for C-Suites on Google Podcasts</a></li>\n<li>Subscribe to <a href=\"https://open.spotify.com/show/0bsatHLD7tWS7WxzDF8aJQ\">Navigating the Cloud for C-Suites on Spotify</a></li>\n<li>Subscribe to the <a href=\"https://feeds.acast.com/public/shows/65128f160cb2640011a8df8f\">Navigating the Cloud for C-Suites RSS feed</a></li>\n</ul>\n","author":"James Footman","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"d565fb52cfe76ca01734dd0e7130e17d54c1a5142632ca10853dca95da07afc0","category":"Tech"}