{"title":"Regaining policy attention for a health insurance capitation payment reform in Ghana: A prospective policy analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003265","date":1717077600000,"content":"<p>by Gilbert Abotisem Abiiro</p>\r\n\r\nCapitation as a provider payment mechanism gained policy attention by the Ghana National Health Insurance Scheme (NHIS) in 2012 and was piloted in the Ashanti Region, Ghana. Recent studies revealed that the policy was suspended in 2017 due to inappropriate policy framing, actor contestations, unclear policy design characteristics, and an unfavorable political context. However, the NHIS still has interest in capitation as a provider payment option. Using the modified political process model, a prospective policy analysis was conducted to explore how to: i) appropriately reframe policy debates; ii) create political opportunities; and iii) mobilize resources to reattract policy attention to capitation in Ghana. Cross-sectional qualitative data were gathered in December, 2019 from semi-structured interviews with a purposive sample of 18 stakeholders and complemented with four community-level focus group discussions with 41 policy beneficiaries in the pilot region. All data were tape-recorded and transcribed. The analysis was thematic, using the NVivo 12 software. The results revealed that an appropriate reframing of the policy requires policy renaming, refinement of certain policy design characteristics (emergency care, capitation rates, choice and assignment of providers) and refocusing policy communication and advocacy on the health benefits of capitation instead of its cost containment intent. To create political opportunities for policy re-implementation, a politically sensitive approach with broader stakeholder consultations should be adopted. Policy advocacy and communication should be evidenced-based and led by politically neutral agents. An equitable capitation policy implementation requires resourcing health facilities, especially the lower-level facilities, with improved infrastructure, consumables, improved information management systems and well-trained personnel to enhance their service delivery capacities. The study concludes that there exists stakeholder interest in the capitation policy in Ghana and calls for an effective reframing, creation of political opportunities, and mobilization of needed resources to regain policy attention.","author":"Gilbert Abotisem Abiiro","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d56a5481a936e06f27a1472afeb8fc4f51fa370832cfd0abe85306536ff7826a","category":"Environment"}