{"title":"Mozilla เปิดตัว Firefox Focus ใหม่ พร้อมเพิ่มฟีเจอร์ด้านรหัสผ่านให้ Firefox Mobile","link":"https://www.blognone.com/node/125115","date":1633446152000,"content":"<div><div><div><p>Mozilla เผยอัพเดตเกี่ยวกับ Firefox สามเรื่องใหญ่ ๆ โดยมี Firefox Focus, Firefox for Mobile และ Firefox for Windows</p>\n<p>สำหรับเรื่องแรก FIrefox Focus เบราว์เซอร์เน้นความเป็นส่วนตัวจาก Mozilla จะปรับโฉมใหม่ โดยเพิ่มสีใหม่, โลโก้ใหม่ และธีมมืด พร้อมฟีเจอร์ shortcut สำหรับเข้าเว็บไซต์ที่ใช้งานบ่อย ๆ ได้รวดเร็ว, เพิ่มไอคอนรูปโล่ที่สามารถกดเปิดหรือปิด individual tracker ได้ทันทีจากช่องค้นหา และเพิ่ม global counter สำหรับแสดงว่าบล็อค tracker ไปแล้วกี่ตัว</p>\n<p>ถัดมาเป็นเรื่องของ Firefox for Mobile ทาง Mozilla ได้เพิ่มฟีเจอร์ใหม่ดังนี้</p>\n<ul>\n<li>เพิ่มและบันทึกรหัสผ่านได้ง่ายขึ้น โดยรหัสผ่านจะบันทึกไว้บน Firefox และซิงค์ไปใช้กับเดสก์ท็อปได้ด้วย</li>\n<li>ฟีเจอร์ autofill สามารถใช้กรอกรหัสผ่านกับแอปอื่นได้</li>\n<li>ปลดล็อกรหัสผ่านด้วยลายนิ้วมือหรือใบหน้าด้วยระบบไบโอเมตริกบนมือถือ</li>\n</ul>\n<p>ฟีเจอร์ทั้งหมดนี้ Firefox for Android จะเริ่มใช้งานได้ก่อน จากนั้น Mozilla จะอัพเดตเวอร์ชัน iOS ตามมาทีหลังภายในปีนี้</p>\n<p>สุดท้ายเป็นเรื่องของ Firefox on Windows จากการที่ Microsoft ปรับนโยบายใหม่ของสโตร์บน Windows 11 ที่เปิดกว้างและยืดหยุ่นมากขึ้น Mozilla จึงประกาศเตรียมส่ง Firefox ให้ดาวน์โหลดบนสโตร์ โดยคาดว่าจะเปิดให้ดาวน์โหลดภายในปีนี้</p>\n<p>ที่มา - <a href=\"https://blog.mozilla.org/en/mozilla/news/news-from-firefox-focus-and-firefox-on-mobile/\">Mozilla Blog</a>, <a href=\"https://www.engadget.com/mozilla-firefox-focus-mobile-updates-130514586.html\">Engadget</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/03a8e416dd199c5e641940233af49183.png\" /><br />\nภาพจาก Mozilla</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/firefox\">Firefox</a></div><div><a href=\"/topics/mozilla\">Mozilla</a></div><div><a href=\"/topics/browser\">Browser</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d56ebc1996081cc531ba2ce71035e76447bb53555126b18292ee9e29ed7c150e","category":"Thai"}