{"title":"★ 70/30 Is Fine for Me, but Not for Thee","link":"https://daringfireball.net/2021/05/70_30_fine_for_me_but_not_for_thee","date":1620407017000,"content":"\n<p><a href=\"https://www.theverge.com/2021/4/29/22409285/microsoft-store-cut-windows-pc-games-12-percent\">Tom Warren, writing for The Verge last week</a>:</p>\n\n<blockquote>\n  <p>Microsoft is shaking up the world of PC gaming today with a big\ncut to the amount of revenue it takes from games on Windows. The\nsoftware giant is reducing its cut from 30 percent to just 12\npercent from August 1st, in a clear bid to compete with Steam and\nentice developers and studios to bring more PC games to its\nMicrosoft Store. […]</p>\n\n<p>These changes will only affect PC games and not Xbox console games\nin Microsoft’s store. While Microsoft hasn’t explained why it’s\nnot reducing the 30 percent it takes on Xbox game sales, it’s\nlikely because the console business model is entirely different to\nPC. Microsoft, Sony, and Nintendo subsidize hardware to make\nconsoles more affordable, and offer marketing deals in return for\na 30 percent cut on software sales.</p>\n</blockquote>\n\n<p>This thing about the console gaming platforms being inherently different from other computing platforms is <a href=\"https://twitter.com/timsweeneyepic/status/1273276548569841667\">exactly what Epic has been arguing</a> to justify their objection to the 70/30 split on iOS and Android but <em>not</em> the exact same 70/30 split on PlayStation, Xbox, or Switch — <a href=\"https://www.theverge.com/2021/4/28/22407939/fortnite-biggest-platform-revenue-playstation-not-ios-iphone\">despite the fact that Fortnite generates far more revenue on those platforms</a>.</p>\n\n<p>I cry bullshit.</p>\n\n<p>The reason Microsoft cut its commission on games in the Windows Store but not on Xbox isn’t because Xbox has a different business model. It’s because Xbox has been a completely closed system ever since it debuted 20 years ago, and Windows is effectively completely open — and on that open Windows platform, Valve’s Steam is the leading store for games. Competition from Steam (which still takes 30 percent from game sales) drove Microsoft to lower its commission in the Windows Store. There is no Steam for Xbox, nor any other alternatives. Xbox has competition, but only against other platforms, not within the Xbox platform itself. Microsoft would be a lot more likely to lower its commission on Xbox games in its own Xbox store if they also allowed alternative app stores or subscription game-streaming services on Xbox, but I don’t think they’d budge on the 70/30 Xbox split even if they were selling Xbox hardware for a healthy profit.</p>\n\n<p><a href=\"https://www.ndswitch.com/\">The Switch retails for $250–300</a>. PlayStation 5 retails for $400–500. Xbox Series X is $500, and lower-specced Series S is $300. Apple’s iPod Touch starts at $200, and iPads start at $329. The iPhone SE, which debuted last year with the then-top-of-the-line A13 chip, starts at just $400.</p>\n\n<p>Yes, we know Apple makes high profit margins on iPhones. And, among numerous juicy nuggets spewing from the Epic v. Apple trial, we now have a Microsoft executive — VP of business development for gaming and entertainment Lori Wright — <a href=\"https://www.geekwire.com/2021/epic-v-apple-trial-reveals-microsoft-never-made-money-off-xbox-hardware/\">testifying under oath that they’ve never “earn[ed] a profit on the sale of an Xbox console”</a>. But legally speaking: So what? Is Microsoft saying that if they were able to turn a profit selling Xbox hardware they’d reduce their commission on game sales? Or open Xbox to competing app stores and game-streaming services? (Spoiler: no, they’re not saying that.)</p>\n\n<p>How exactly is the $300-ish Nintendo Switch a different thing altogether than a $300-ish iPad or iPod Touch? Just because most companies make no money selling razors but reap profits by selling blades at high margins doesn’t mean a company that does sell its razors for a profit is legally or even ethically obligated to sell its blades for lower margins.</p>\n\n<p>You can argue that the 70/30 split is too high, but it holds no water to argue that it’s too high only for iOS and Android, but not for Xbox, PlayStation, and Switch.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d577c7855013ab43cd6fb8c90bc3d5e8c657431b557ea12be520ccc4c9fbcf60","category":"Tech"}