{"title":"บริษัทศูนย์ข้อมูลรวมตัวก่อตั้ง \"สมาคมดาต้าเซ็นเตอร์แห่งประเทศไทย\"","link":"https://www.blognone.com/node/137944","date":1706601648000,"content":"<div><div><div><p>เมื่อสัปดาห์ที่ผ่านมา กลุ่มบริษัทด้านศูนย์ข้อมูลในประเทศไทยหลายแห่ง ลงนามข้อตกลงเพื่อก่อตั้ง <strong>‘สมาคมดาต้าเซ็นเตอร์แห่งประเทศไทย’</strong> (Thailand Data Centre Council หรือ TDCC)</p>\n<p>สมาชิกร่วมก่อตั้งมีด้วยกัน 5 รายคือ</p>\n<ul>\n<li>บริษัท เอมส์ ดาต้า เซ็นเตอร์ (ประเทศไทย) จำกัด</li>\n<li>บริษัท อีโวลูชั่น ดีซี (ไทยแลนด์) จำกัด</li>\n<li>บริษัท เอ็นทีที โกลบอล ดาต้า เซ็นเตอร์ส (ประเทศไทย) จำกัด</li>\n<li>เอสที เทเลมีเดีย โกล บอล ดาต้าเซ็นเตอร์ (ประเทศไทย)</li>\n<li>บริษัท เทเลเฮ้าส์ (ประเทศไทย) จำกัด</li>\n</ul>\n<p>วัตถุประสงค์ของสมาคมมีด้วยกัน 6 ข้อ ได้แก่</p>\n<ul>\n<li>เป็นตัวแทนของอุตสาหกรรมดาต้าเซ็นเตอร์: โดยร่วมมือในการผลักดันการแข่งขันในอุตสาหกรรมหรือภาคส่วนต่าง ๆ ที่เกี่ยวข้อง</li>\n<li>ให้คำปรึกษาและสนับสนุนด้านกฎระเบียบ: ให้คำแนะนำ ระบุความท้าทายและเสนอแนวทางต่าง ๆ ด้านกฎหมายและข้อบังคับที่เกี่ยวข้องกับอุตสาหกรรมกับหน่วยงานสาธารณะอย่างเหมาะสม</li>\n<li>ขยายธุรกิจระหว่างประเทศ: สนับสนุนและส่งเสริมสมาชิกในการขยายศักยภาพธุรกิจ พร้อมยกระดับการแข่งขันไปสู่เวทีระดับโลก</li>\n<li>พัฒนาด้านวิชาชีพ: ส่งเสริมการเติบโตทางวิชาชีพของผู้ประกอบการดาต้าเซ็นเตอร์และบุคลากรในอุตสาหกรรมดิจิทัลให้สอดคล้องกับมาตรฐานสากล</li>\n<li>ให้คำปรึกษาและสนับสนุนหลักปฏิบัติด้านจริยธรรม: ร่วมมือกับหน่วยงานภาครัฐและเอกชนเพื่อสนับสนุนการดำเนินธุรกิจอย่างมีจริยธรรมสำหรับอุตสาหกรรมดาต้าเซ็นเตอร์ของไทย โดยนำเสนอแนวปฏิบัติให้มีความสอดคล้องกับบรรทัดฐานระดับสากล</li>\n<li>พัฒนาอุตสาหกรรม: ดำเนินกิจกรรมเสริมเพื่อสนับสนุนการพัฒนาอุตสาหกรรมดาต้าเซ็นเตอร์ของประเทศไทย หรือดำเนินการตามที่ได้รับมอบหมายจากหน่วยงานภาครัฐที่เกี่ยวข้อง</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/61114f639f55df7af04140e40e9b23f8.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/data-center\">Data Center</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d57caf640b98c47effff1693ed8ecce2dbf39f7fa380478477e2f7778177b83e","category":"Thai"}