{"title":"Best mountain bike jackets 2021 | 17 waterproof and hybrid jackets tried and tested by our experts","link":"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-mountain-biking/","date":1637835000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Waterproof-mountain-biking-jacket-eb31c75.jpg?quality=90&amp;resize=620,413\" />                                            <p>A good mountain bike jacket will keep you riding through all weathers and, as a result, is possibly the most important item in your winter wardrobe if you live somewhere with a wet climate.</p>\n<p>It might also be the most expensive piece of kit you own. You can spend a lot of money on one of the best mountain bike jackets, but do you have to?</p>\n<p>Generally, the more you pay, the more you get, in terms of performance – by which we mean breathability, durability, features or a combination of all three. This isn’t always the case, though.</p>\n<p>Working out exactly what you need your jacket for can help you narrow down your options and avoid spending money on features you don’t need.</p>\n<p>Our expert testers have spent days and weeks out on the trails, putting different mountain bike jackets to the test in the most difficult conditions, to bring you the best-performing options for every type of rider.</p>\n<p>The jackets here are designed for mountain biking, with a cut and features to match the intended use. If you’re after a jacket for road riding, we’ve got a separate guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">best waterproof cycling jackets</a>.</p>\n<h2>How to choose the best mountain bike jacket</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Where to start when buying a jacket for mountain biking? Read on!</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h3>What type of riding are you doing?</h3>\n<p>Before parting with any cash, think about the sort of riding you do. If you’re a cross-country fiend who spends all day in the saddle in the most extreme conditions, then you ideally want a high waterproof rating (20,000mm) combined with maximum breathability (30,000g/m²).</p>\n<p>If your style is more bike park or downhill runs, then breathability will be less important. In fact, a heavier jacket may suit you better than a lightweight style because it’ll keep you warm in the downtime.</p>\n<p>Fit is individual because we all have different body shapes, so you really do need to try before you buy.</p>\n<h3>Finding the Goldilocks zone</h3>\n<p>We’ve tested a selection of fully waterproof garments alongside some hybrid jackets that combine water-resistance with breathability and warmth.</p>\n<p>Balancing protection from the elements with breathability is a key consideration when choosing a mountain bike jacket.</p>\n<p>The very best waterproof jackets will help keep water out while also allowing the moisture generated from riding to escape, though there’s always a limit as to how breathable any waterproof garment can be.</p>\n<p>Equally, while a hybrid jacket may not keep you bone dry, it may keep you warm and comfortable by better regulating your body temperature. Ultimately, it’s about choosing a jacket suited to where and how you ride, so you can hit that Goldilocks zone.</p>\n<h3>It’s all in the details</h3>\n<p>The good news is that there are now some excellent designs that combine low weight, performance and durability.</p>\n<p>Does that mean jackets made from materials with a lower breathability rating will always be hot? The short answer is no – construction details such as gills or pit zips and vents that can be opened up will aid cooling, as will double (two-way) front zips.</p>\n<p>These features mean you can adapt a jacket to suit your ride and the conditions on any given day. Layering also helps. A good baselayer will pull moisture away from your body and hold it until it can escape through your jacket, helping to keep you dry and, therefore, warmer.</p>\n<p>You can read our buyer’s guide at the end of this article for more advice on how to choose the best jacket for your needs.</p>\n<p>And while you’re with us, read our guide to <a href=\"https://www.bikeradar.com/features/winter-mountain-biking-what-to-wear-where-to-ride-and-how-to-set-up-your-bike/\">winter mountain bike clothing</a> for more advice on staying warm and dry. We’ve also got buyer’s guides to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-mtb-trousers/\">best waterproof MTB trousers</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-gloves/\">best mountain bike gloves</a> and <a href=\"/advice/buyers-guides/best-winter-cycling-shoes/\">best winter cycling shoes</a>, for both road riders and mountain bikers.</p>\n<section><div>\n        <h2>Best mountain bike jackets in 2021 | 17 jackets rated by our expert testers</h2>\n<ul><li><strong><strong>Patagonia Dirt Roamer: </strong></strong>£210 / $229</li>\n<li><strong>7Mesh Copilot</strong>: £220 / $250 / €250 as tested</li>\n<li><strong><strong>7Mesh Guardian:</strong></strong> £352 / $400 / €350</li>\n<li><strong>Endura MTR Shell:</strong> £140 / $199.99 / €164.99</li>\n<li><strong>Patagonia Micro Puff Hoody: </strong>£250 / $299</li>\n<li><strong>Patagonia Rainshadow Jacket:</strong> £230</li>\n<li><strong>POC Signal: </strong>£320 / €350 / $350</li>\n<li><strong>Rapha Explore Hooded Gore-Tex Pullover:</strong> £250</li>\n<li><strong>Thrudark Skirmish:</strong> £345</li>\n<li><strong>Rab Zenith</strong>: £250 / €300 / $300</li>\n<li><strong>dhb Trail Waterproof Jacket</strong>: <span>£150 / €170 / $190 / AU$273</span></li>\n<li><strong>B</strong><b>erghaus Changtse:</b> £290 / €350</li>\n<li><strong>Endura MT500 Waterproof Jacket II:</strong> £230 / $329</li>\n<li><strong>Jack Wolfskin Atlas Tour:</strong> £150</li>\n<li><strong>On Waterproof Anorak:</strong> £320 / $359.99 / €359.95</li>\n<li><strong>POC AVIP Rain:</strong> £295 / $300  / €350</li>\n<li><strong>RAB Arc Jacket</strong>: £200 / $260</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Patagonia Dirt Roamer</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Dirt Roamer is an all-rounder weatherproof jacket that proved to be surprisingly versatile.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£210 / $229 as tested</li>\n<li>Excellent cut</li>\n<li>Versatile layer</li>\n<li><strong>Protection</strong>: water-resistant</li>\n</ul><p>Although not strictly a waterproof, this weatherproof, packable jacket is a true all-rounder that’s perfect for those days with quick changes in weather.</p>\n<p>The DWR finish keeps water off well and dries quickly when wet, but this is not a choice for the worst conditions.</p>\n<p>The fit is exceptional, with a dropped tail, generous sleeves and over-helmet hood</p>\n<p>It’s so breathable that it easily transitions from cooler starts to warmer finishes. Our tester found it ideal for spring and autumn rides in the UK with just a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-base-layers/\">baselayer</a> underneath.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>7Mesh Copilot</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The 7Mesh Copilot is one of the best lightweight jackets we’ve tested.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£220 / $250 / <span>€250 as tested</span></li>\n<li>Lightweight protection</li>\n<li>Comfortable cut</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>Made from a Gore-Tex Paclite Plus fabric, the 7Mesh Copilot is a lightweight, packable jacket that’s waterproof and superbly breathable.</p>\n<p>The cut is relaxed with ample space for layering but, thanks to its shape and cut, it articulates with you to stay in place no matter what. It’s easy to forget you’re wearing this jacket – it really is that comfortable.</p>\n<p>The Copilot boasts clever details such as one-handed adjustable drawcords on the hood and hem, an angled chest pocket that’s easy to access (and positions its contents so they don’t get in the way), a generously-sized hood, taped seams and waterproof zips.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>7Mesh Guardian jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> 7Mesh has a reputation for nailing the mountain bike-specific detailing.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><span>£352 / $400 / €350 as tested</span></li>\n<li><span>Lots of great details</span></li>\n<li><span>Exceptional breathability</span></li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p><span>7Mesh’s Guardian jacket has a great reputation, but at </span>£352 / $400 / €350 <span>it doesn’t come cheap. Fortunately, though, its performance doesn’t disappoint.</span></p>\n<p><span>It’s cut impeccably, with brilliant details all over and its breathability is fantastic for a totally waterproof jacket.</span></p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/7mesh-guardian-jacket-review/\" target=\"_blank\"><span>Read our full review of the 7Mesh Guardian jacket</span></a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Endura MTR Shell jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The MTR is a lightweight packable shell that takes up next to no space in a pack.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£140 / $199.99 / €164.99 <span>as tested</span></li>\n<li>Can fit in a jersey pocket</li>\n<li>No pockets</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>Endura’s MTR shell jacket is a packable waterproof jacket designed primarily for off-road use. It packs up small enough to fit in a jersey pocket, but doesn’t compromise on performance or durability.</p>\n<p>Our tester also found the fit to be spot on, with plenty of length and strategically placed stretch panels that enable a full range of movement.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/endura-mtr-shell-jacket-review/\" target=\"_blank\">Read our full review of the Endura MTR Shell jacket</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Patagonia Micro Puff Hoody</h3>\n<ul><li>\n    </li>\n</ul><div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The Patagonia Micro Puff Hoody leaves plenty of room to comfortably ride a bike.</span></figcaption><span> <i>Alex Evans / Immediate Media</i></span></div>\n<ul><li>£250 / $299 <span>as tested</span></li>\n<li>Impressively warm</li>\n<li>Packs down into its own pocket</li>\n<li><strong>Protection</strong>: water-resistant</li>\n</ul><p>The Micro Puff Hoody from Patagonia is a lightweight, soft-shell garment that looks good both on and off the bike.</p>\n<p>It’s seriously warm thanks to the use of synthetic PlumaFill insulation and the DWR coating is effective, but we’d still recommend using this as a mid-layer in the worst of conditions.</p>\n<p>Despite minimalist looks and a fit that’s neither tight nor slack, it’s full of useful storage pockets. It’s impressively packable too, folding down neatly and easily into its own pocket. Our tester loves his so much that he’s rarely seen without it.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/patagonia-micro-puff-hoody-review/\">Read our full review of the Patagonia Micro Puff Hoody</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>POC Signal</h3>\n<ul><li>\n    </li>\n</ul><div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The POC Signal is expensive but performs superbly.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£320 / €350 / $350 as tested</li>\n<li>All-weather protection</li>\n<li>Smart and well-considered details</li>\n<li><strong>Protection:</strong> waterproof</li>\n</ul><p>Even in the worst conditions, the Signal kept us dry and comfortable. The material is breathable when working hard, and there’s further ventilation from underarm gills, a back vent and the two-way zip.</p>\n<p>Its lightweight, three-layer ripstop fabric is soft enough to wear against bare arms. The fit is close but not restrictive, and styling is sleek. It packs into its own zipped back pocket, and has a smaller side pocket too.</p>\n<p>Design is efficient across the board – it has a good interface between hood and helmet straps, shaped cuffs that sit just right, and a long drop-back that hangs perfectly flat, courtesy of side elastic in the hem.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Rapha Explore Hooded Gore-Tex Pullover</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Explore from Rapha is a jacket unlike any other on this list.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£250 <span>as tested</span></li>\n<li>Unique style</li>\n<li>Good for a wide range of temperatures</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>Rapha’s uniquely styled Explore jacket was originally marketed at <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">gravel riding</a>, but can make a great choice for commuters or mountain bikers too.</p>\n<p>Constructed from three-layer Gore-Tex Active material, the Explore does waterproofing with an impressive level of breathability and makes for a low overall 220g weight in a size large.</p>\n<p>It’ll pack down into a supplied sack, where it can double as a pillow, or smaller still to wedge into a pack or jersey pocket.</p>\n<p>Not everyone wants a pullover, but we didn’t miss a full-length zip when wearing this jacket.</p>\n<p>It was comfortable in a range of temperatures, ranging from single digits right through to mild 17-degrees celsius autumn conditions.</p>\n<p>It’s a wildcard choice, but one that we really enjoyed.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Thrudark Skirmish</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Thrudark Skirmish is an excellent (and very expensive) option for riders who want a multi-use jacket.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£345 as tested</li>\n<li>Cross-functional design</li>\n<li>Waterproof and breathable, with an excellent cut</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>This jacket from new UK brand ThruDark is a cross-functional piece designed for extreme weather.</p>\n<p>A fully-adjustable hem and hood allow you to seal it tight, with a deep yoke vent on the back and underarm perforations for airflow.</p>\n<p>It’s hard to get a great fit both on and off the bike, but this Dorset-based outfit has managed it. The Skirmish’s long tail drops into position, its shaped cuffs fall perfectly over the backs of the hands, the sleeves articulate with every movement and the hood’s slightly stiffened peak keeps the rain out of your eyes.</p>\n<p>The three-layer eVent fabric breathes well and is durable. In torrential rain, we still didn’t overheat. With nifty details, such as an internal chest pocket, this jacket is worth considering despite the very high price.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Rab Zenith waterproof jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Zenith is a highly breathable waterproof made for multi-activity use.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£250 / €300 / $300 <span>as tested</span></li>\n<li>Great breathability</li>\n<li>Cross-functionality for other outdoor pursuits</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>Featuring easy-access front pockets, a large wired peak hood that’ll fit over a helmet, long pit zips and a longer hem than a dedicated cycling jacket, the Rab Zenith is a multi-use waterproof that won’t leave you having to compromise.</p>\n<p>Exceptional breathability thanks to the GORE-TEX Paclite Plus construction has proven to be a major advantage, with additional ventilation features should you need them on warmer rainy days.</p>\n<p>The fast-drying material also beads water well thanks to the DWR coating, and Rab offers a reproofing service for this to keep your jacket performing as new, season after season.</p>\n<p>You’ll need those deep pockets to afford this top-tier option, but it’ll pay off in the Zenith’s practical versatility.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/rab-zenith-waterproof-jacket-review/\">Read our full review of the Rab Zenith waterproof jacket</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>dhb Trail waterproof jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The dhb Trail waterproof offers great performance and comfort at a good price.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£150 / €170 / $190 / AU$273 <span>as tested</span></li>\n<li>Great value for the quality</li>\n<li>Hood doesn’t work over helmet for taller riders</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>With many features that are typically reserved for higher-price jackets, the Trail waterproof from dhb reflects the brand’s solid reputation for great-quality, excellent-value cycling kit.</p>\n<p>The high-stretch, 20k/20k material features a three-layer construction that’s durable, teamed with long, mesh-lined pockets that double up as vents.</p>\n<p>Shaped cuffs, a fold-away hood that also fits over a helmet, and a clever drop-hem adjustment all contribute to the great fit of the jacket.</p>\n<p>The stretch fabric comes into play on the bike, meaning you can achieve a slimmer fit without limiting the freedom of movement.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/dhb-trail-waterproof-review/\">Read our full review of the dhb Trail waterproof jacket</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Berghaus Changtse jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> All the zips on the Changtse are water resistant and the full-length front zip is also two-way.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><span>£290 / €350 as tested</span></li>\n<li><span>Technical construction with lots of vents and pockets</span></li>\n<li><span>Do-everything credentials</span></li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p><span>The Changtse is absolutely packed with features. It uses a number of different Gore-Tex waterproof fabrics across the jacket for optimal performance in each area. </span></p>\n<p><span>There’s Paclite Plus on areas such as the chest and arms, which are more prone to wear, while the core is made from Active Shell for greater breathability.</span></p>\n<p><span>It’s not a bike-specific jacket, but the cut and flexibility are good enough that it never feels like a compromise.</span></p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/berghaus-changtse-jacket-review/\" target=\"_blank\"><span>Read our full review of the Berghaus Changtse jacket</span></a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Endura MT500 Waterproof Jacket II</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The MT500 Waterproof has been improved for this second iteration.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£230 / $329 <span>as tested</span></li>\n<li>Adjustable helmet hood</li>\n<li>Multiple pockets</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>An update to the popular MT500 jacket only adds to the appeal of this excellent fully featured waterproof layer.</p>\n<p>The three-layer waterproof fabric performs well and, combined with the refined fit and plentiful storage, adds up to a garment that does not disappoint.</p>\n<p>The 536g (large) MT500 kept our tester both dry and comfortable during challenging conditions.</p>\n<p>It’s also been designed to work well with a backpack, and we can confirm it does just that.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Jack Wolfskin Atlas Tour</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Jack Wolfskin’s Atlas Tour is good for more than just riding in.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£150 <span>as tested</span></li>\n<li>Multi-sport design</li>\n<li>Solid value for money</li>\n<li><strong>Protection</strong>: waterpoof</li>\n</ul><p>The 515g (large) Atlas Tour represents good value for money, particularly when you consider this fully featured waterproof has been designed to meet the needs of cyclists, but with extended use for hikers too.</p>\n<p>This multi-sport approach does not hinder the jacket or lead to a compromise in fit or performance.</p>\n<p>The two-layer design warmed up quicker than some, but the temperature was easily controlled with the zip.</p>\n<p>Three pockets, an adjustable helmet-compatible hood and reflective highlights complete an impressive feature list.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>On Waterproof Anorak</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The material is very light, and that’s complemented by bonded hems.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><span>£320 / $359.99 / €359.95 as tested</span></li>\n<li><span>Light and athletic fit</span></li>\n<li><span>Hydrophobic inner helps wick perspiration away</span></li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p><span>On’s Waterproof Anorak isn’t a cycling-specific jacket, but its performance impresses nevertheless. The half-length zip isn’t perhaps the most practical option for getting On’s Waterproof Anorak on and off while on the bike, but it does reduce bulk a bit, and fashionistas will likely welcome the alternative look.</span></p>\n<p><span>We didn’t notice any compromise in breathability either, possibly thanks to the hydrophilic elements on the innermost layer of the jacket’s three-ply fabric. </span></p>\n<p><span>It’s an especially good jacket for those who do a bit of running as well as cycling because it can readily share duties across the two sports.</span></p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/on-waterproof-anorak-review/\" target=\"_blank\"><span>Read our full review of the On Waterproof Anorak</span></a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Patagonia Rainshadow jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> We found the Patagonia Rainshadow shined both on and off the trails.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£230 <span>as tested</span></li>\n<li>Unassuming styling</li>\n<li>Well thought-out storage</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>Should you purchase the Rainshadow jacket from Patagonia, we are willing to wager it will quickly become your most-used jacket.</p>\n<p>Despite not being bike-specific, the 397g (medium) Rainshadow excels both on and off the trails. It’s better at colder conditions than mild ones, but the pit zips mean it is useful for both. The fit is roomier than most bike-specific clothing, which in this case is no bad thing.</p>\n<p>The three-layer fabric is light to wear, with some useful stretch meaning plenty of mobility. We were also big fans of this jacket’s generous pockets with their long zip pulls.</p>\n<p>The Rainshadow will quickly pack down into its own chest pocket too.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>POC AVIP rain jacket</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> So bright that it hurts, but the AVIP was designed for visibility.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£295 / $300  / €350 <span>as tested</span></li>\n<li>Comfortable even against bare skin</li>\n<li>Tear-resistant fabric</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>The style, colour and cut are reminiscent of a road jacket, but in reality POC’s AVIP is more of a multi-purpose cycling waterproof.</p>\n<p>Its tear-resistant Vectran fabric, for example, means it can stand up to the rigours of XC and gravel when a true road jacket might be too delicate.</p>\n<p>The three-layer waterproof fabric does its job well too, but the lack of a hood might be a deal-breaker for some off-road cyclists. If that’s not a problem for you, though, there’s a lot to like here, with great on-bike performance and fit.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/poc-avip-rain-jacket-review/\" target=\"_blank\">Read our full review of the POC AVIP rain jacket</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Rab Arc</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Rab Arc is a durable, multi-purpose jacket.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<ul><li>£200 / $260 <span>as tested</span></li>\n<li>Multi-function styling that works on the bike</li>\n<li>Sturdiness means good warmth and durability</li>\n<li><strong>Protection</strong>: waterproof</li>\n</ul><p>The Rab Arc jacket isn’t made specifically for cycling, but this compromise means it brings more versatility to the table.</p>\n<p>In particular, the cut is a little boxy on the bike, but the 422g jacket feels great when you’re not riding – unlike cycling-specific jackets, which are often poorly shaped for off-bike use.</p>\n<p>Generously sized front pockets and a hood that fits comfortably over a helmet only further its credentials.</p>\n<p>The fabric is three-layer rip-stop with a high-quality and durable feel. This adds a bit of weight and a fair bit of warmth, but it also means it’s more likely to stand the test of time.</p>\n<p>The Rab Arc has now been replaced with the Rab Arc Eco, made with 100% post-consumer recycled polyester.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/jackets-and-vests/jackets/rab-arc-cycling-jacket-review/\">Read our full review of the RAB Arc</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>What to look for in a jacket for mountain biking</h2>\n<h3>Water-resistant zips</h3>\n<p>These keep wind and rain out without the need for a storm flap. They’re easy to identify by the smooth seal that closes protectively over the teeth, but can be stiff to use.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Look for water-resistant zips for the best waterproofing qualities.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h3>Two-way zips</h3>\n<p>Double zips allow you to open the jacket from the bottom as well as the top to help you cool down faster – useful when you’re working up a sweat.</p>\n<h3>Drop tail</h3>\n<p>A longer back to ensure your lower back is covered and help keep mud and spray off the seat of your shorts or riding trousers.</p>\n<p>Adjustability here is also handy, so look for elasticated drawcords to help you cinch in the hem. Check the length is right for you by jumping on a bike when you’re trying a jacket on.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A dropped tail will better match your on-bike riding position.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h3>Dropped cuff</h3>\n<p>Cuffs that are shaped to extend over the back of the hand integrate with gloves more smoothly than those with Velcro adjusters, and channel rain over, rather than inside, your gloves.</p>\n<p>They’re also more comfortable to wear, moving freely with your body as you ride, and shed water better, because there are no creases for moisture to gather inside.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dropped cuffs are designed to extend over the back of the hand and channel rain over, rather than inside, your gloves.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h3>Lined collar</h3>\n<p>A fleecy inner collar not only feels more comfortable against your skin, it absorbs stray drips before they run down your neck.</p>\n<h3>Helmet-compatible hood</h3>\n<p>A hood that goes over a helmet is our preferred style for practicality, although some riders like one that fits underneath. Check it can be cinched in to reduce its volume and keep your peripheral vision clear.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A helmet-compatible hood will allow you to tog up over your helmet, with adjustability to get the fit just right.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h3>Vents</h3>\n<p>Vents help heat and sweat to escape. They can either be zipped or open with gill-like slits. If you wear a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hydration-packs/\">hydration pack</a>, check the straps don’t obstruct the jacket’s vents, and look for double-ended zips, which give more ventilation options.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Vents will help keep you cool when the fabric reaches its limit.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h2>Jackets explained</h2>\n<h3>Breathability</h3>\n<p>Multi-layer fabrics can be both waterproof and breathable because the membrane layer has billions of tiny pores. These pores are large enough for water vapour to escape, but too small for water droplets to pass through.</p>\n<p>The breathability is the rate at which a fabric allows heat from inside to escape, in the form of water vapour, measured as the Water Vapour Transmission rating (WVTR).</p>\n<p>Search for ratings over 20,000g/m²/24hr for good material breathability. There is, however, a limit as to how breathable any waterproof fabric can be if you’re riding hard or the weather is warm.</p>\n<h3>Waterproofing</h3>\n<p>The waterproof rating of a fabric will tell you if it’s suitable for wet-weather riding, from fine drizzle through to a prolonged downpour. This is measured in a lab, testing the height of a 1in diameter column of water that a fabric will withstand before it leaks, measured in millimetres.</p>\n<p>Higher numbers here indicate a greater resistance to water seeping through. As a guide, 10,000mm is a good benchmark, with 20,000mm better for prolonged or extreme conditions.</p>\n<p>If you’re looking for a waterproof for wet-weather riding, double-check that the seams are taped: otherwise, these are weak points for waterproof garments.</p>\n<h3>Three-layer fabric</h3>\n<p>A fabric consisting of an outer shell over a waterproof membrane with an inner backing.</p>\n<p>This lining helps protect the membrane and prolong the life of the jacket. It also gives a smoother feel against the skin, and may have wicking properties, too.</p>\n<h3>2.5-layer fabric</h3>\n<p>Here, the waterproof membrane has a thin coating applied to the inside, rather than a proper lining. This type of jacket is often typified by a rubbery feel, but the ‘half’ layer makes the material lighter and more packable.</p>\n<h3>DWR</h3>\n<p>Durable Water Repellent treatment (DWR) is often used on the outside of garments to help water and dirt bead off the material’s surface without soaking in. You’ll commonly find this treatment on waterproof jackets, trousers and baggy shorts.</p>\n<p>A DWR treatment can wear out or wash off over time, but a little TLC can make your jacket feel as good as new. Read our guide to <a href=\"https://www.bikeradar.com/features/how-to-rejuvenate-your-waterproof-cycling-gear/\">reproofing a waterproof jacket</a>.</p>\n<h3>PFCs</h3>\n<p>Perfluorinated and poly-fluorinated chemicals are often used in the production of DWR finishes, but break down very slowly once released into the environment. Many brands are now moving to PFC-free materials, so check the blurb.</p>\n<p>When it comes to reproofing your waterproof cycling gear, opt for a PFC-free treatment for the greenest option.</p>\n<h3>Articulated</h3>\n<p>This is when a fabric is cut along the lines of active use, so that it follows the shape of your arm or curve of your back when in the riding position.</p>\n<p>A design of this type allows free movement without the need to be baggy, but may be less suitable for use off the bike.</p>\n<p>If you only want one waterproof jacket to do it all, you might have to compromise somewhat in this department.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d57c743dc120e32ee39048515bddd8de389e76e30d46b4a639bbf629deaf21e1","category":"Cycling"}