{"title":"Apple Releases tvOS 17.2 With Revamped Apple TV App","link":"https://www.macrumors.com/2023/12/11/apple-releases-tvos-17-2/","date":1702317480000,"content":"Apple today released tvOS 17.2, the second major update to the tvOS 17 operating system that came out in September 2023. tvOS 17.2 comes more than <a href=\"https://www.macrumors.com/2023/10/25/apple-releases-tvos-17-1/\">a month after tvOS 17.1</a>, an update that expanded the availability of the Enhanced Dialogue feature.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/10/Apple-TV-2022-Feature-Blue.jpg\" width=\"2500\" height=\"1406\" />\r<br />\ntvOS 17.2 can be downloaded using the Settings app on the ‌<a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>‌. Go to System &gt; Software Update to get the new software. ‌‌Apple TV‌‌ owners who have automatic software updates activated will be upgraded to tvOS 17.2 automatically.\r<br />\n\r<br />\nWith tvOS 17.2, Apple is introducing upgrades to the ‌Apple TV‌ app, which is the central content hub on the device. The app features a sidebar with content from Apple services and streaming services that integrate with the Watch Now tvOS feature.\r<br />\n\r<br />\nApple has included dedicated sections for Search, Watch Now, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a>, Sports, the store for making purchases, and the library that houses purchased TV shows and movies. There are also sections for streaming services like ABC, CBS, Comedy Central, Hulu, ESPN, Discovery, Peacock, Prime Video, and more.\r<br />\n\r<br />\nClicking into each streaming service provides details on what's available on that service, and there is also an updated \"My TV\" section that replaces the prior \"My Channels\" section.\r<br />\n\r<br />\nApple has removed the ability to purchase TV shows and movies from the standalone iTunes TV Shows and iTunes Movies apps, and is directing customers to the ‌Apple TV‌ app to make purchases. The changes to the TV app are intended to streamline content purchasing and viewing.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_TV\">Apple TV (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-tv-and-home-theater.100\">Apple TV and Home Theater</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/11/apple-releases-tvos-17-2/\">Apple Releases tvOS 17.2 With Revamped Apple TV App</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-tvos-17-2-with-revamped-apple-tv-app.2413391/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d58ea28179cbe87b99bb9897e96be9e0a48b72011a304cde0a46da38e3eecff0","category":"Apple"}