{"title":"Comparing Genetic Ne Reconstructions Over Time With Long‐Time Wolf Monitoring Data in Two Populations","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70022?af=R","date":1729232022000,"content":"<h2>ABSTRACT</h2>\n<p>Many methods are now available to calculate <i>N</i>\n<sub>\n   <i>e</i>\n</sub>, but their performance varies depending on assumptions. Although simulated data are useful to discover certain types of bias, real empirical data supported by detailed known population histories allow us to discern how well methods perform with actual messy and complex data. Here, we focus on two genomic data sets of grey wolf populations for which population size changes of the past 40–120 years are well documented. We use this background to explore in what detail we can retrieve the known population history from these populations, in the light of pitfalls relating to population history, sampling design and the change in the spatial scale at which <i>N</i>\n<sub>\n   <i>e</i>\n</sub> is estimated as we go further back in time. The Scandinavian wolf population was founded in the early 1980s from a few individuals and has gradually expanded up to 510 wolves. Although the founder event of the Scandinavian population was detected by GONE, the founding effective population size was strongly overestimated when the most recent samples were used, but less so when older samples were considered. Nevertheless, the present-day <i>N</i>\n<sub>\n   <i>e</i>\n</sub> corresponds to theoretical expectations. The western Great Lakes wolf population of Minnesota is the only population in the contiguous United States that persisted throughout the 20th century, surviving intense persecution. We found a good concordance between the estimated <i>N</i>\n<sub>\n   <i>e</i>\n</sub> and trends in census size data, but the reconstruction of <i>N</i>\n<sub>\n   <i>e</i>\n</sub> clearly highlights the difficulty of interpreting results in spatially structured populations that underwent demographic fluctuations.</p>","author":"Laia Pérez‐Sorribes, \nPau Villar‐Yanez, \nLinnéa Smeds, \nJoachim Mergeay","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"d58f5d489e3a82baf00f236adf19c429bc7cf0866834c6d0f9629f6169740abd","category":"Environment"}