{"title":"Van Rysel EDR CF: bringing performance to the masses","link":"https://www.cyclist.co.uk/sponsored/9667/van-rysel-edr-cf-bringing-performance-to-the-masses","date":1622020807000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>1 Jun 2021</span></div>    </div></div><p>\nDecathlon’s in-house performance road bike brand is producing high-quality results and wallet-friendly prices</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/05/van_rysel_edr_cf_rider.jpg?itok=UzVd9yMB\" />  </div>\n<div>\n      <p> Since founder Michel Leclercq opened its first store in Lille 45 years ago, Decathlon has become a worldwide hacienda for lovers of the outdoors. Through a series of subsidary brands such as Quechua and Kipsta, it is a one-stop shop for everything from kettlebells to fishing reels, camping stoves to archery sets. All great quality, all outstanding value.</p>\n<p>It has also long been the perfect place to buy yourself a bike. Predominantly through its B’Twin range, Decathlon has been mass producing road bikes around the globe for decades and is regarded as one of the leading manufacturers for entry-level cyclists. However, it had yet to really crack the high-end performance road bike market.</p>\n<p>That is why in 2018, Van Rysel was born. Yet another in-house brand from Decathlon, this time with the sole objective of manufacturing high-quality performance road bikes that could compete with the very best while retaining Decathlon’s mantra of offering high-quality products that are accessible to the masses. And the result of this new brand? The EDR CF, Van Rysel’s most advanced road bike yet.</p>\n<p><b><br />\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/05/van_rysel_edr_cf.jpg\" />  </div>\n</div>\n<p></p></b></p>\n<h3><b>Built to race</b></h3>\n<p>EDR CF stands for endurance race, which would suggest this latest bike from Van Rysel has been constructed as a comfortable endurance bike that has been tweaked to offer race-like qualities. However, according to Van Rysel product manager Yann Le Fraillec, it is actually the other way around.</p>\n<p>‘The name should be race endurance, rather than endurance race because the philosophy of this bike is based on competition,’ explains Le Fraillec.</p>\n<p>‘We believe that our customers are using their bike to perform on all terrains, from mountains to cobbles, and therefore need a complete bike built for all situations. So while there are parts of the design which suggest endurance and comfort, the main purpose of the EDR CF was actually building a bike for all conditions.’</p>\n<p>Ultimately, the EDR CF is a bike that proves comfort and performance are not mutually exclusive. The geometry is racy: the 397mm reach dimension gives the rider room to stretch into a lower, more aerodynamic position but is balanced with a long 1,001cm wheelbase for better stability, especially on rougher surfaces.</p>\n<p>The frame has dropped seatstays and factored in clearance for 30mm tyres, again nods towards comfort and endurance, yet the frame is markedly stiff when climbing, refusing to waste watts when the rider pushes down hard onto the pedals out of the saddle.</p>\n<p>And it is also light, weighing just 890g for the frame and fork in a medium, a number made ever more impressive when Le Fraillec admits that while important, ‘weight was not a priority’ and that the frame ‘could have been much lighter with technologies currently available’ had Van Rysel sacrificed on frame aesthetics.</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/05/van_rysel_edr_cf_detail.jpg\" />  </div>\n</div>\n<h3><b>Late to the game</b></h3>\n<p>The EDR CF is also the first performance road bike from Van Rysel to utilise disc brakes. That reads as somewhat of a shock considering the majority of the market has been using disc brakes on road bikes for almost half a decade now and some have even made the decision to exclusively use disc brakes throughout their road bike ranges. But there is reasoning for this late development and it boils down to Van Rysel being part of a company that is much more than just a bike brand.</p>\n<p>‘Decathlon is a big, global outdoors company so sometimes when it comes to making a big change, like introducing disc brakes to performance road bikes, it can take longer than with other companies,’ explains Le Fraillec.</p>\n<p>‘When Van Rysel was born, it wasn’t simply a renaming exercise to move away from the Decathlon or the B’Twin name. The real purpose was to create a smaller, agile team that could be focused on creating high-end performance road bikes and action these changes quicker.</p>\n<p>‘For a few years, we were still in the legacy of Decathlon, but now we are on a different path with a clearer focus. Yes, this means we have been late on gravel, e-bikes, and, until now, disc brake performance road bikes but by the end of 2021, this will no longer be an issue and we will be at the same level as the top competitors.’</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/05/van_rysel_edr_cf_rider2.jpg\" />  </div>\n</div>\n<p>So while it took a while for Van Rysel to find its own feet and catch up on technologies such as disc brakes on road bikes, now it has joined the party, the fact that it is still ultimately part of the wider Decathlon family will only help it in the long run.</p>\n<p>‘Being part of Decathlon is one of the biggest advantages Van Rysel has. We have a network of stores across the world that can not only sell you a Van Rysel bike but also provide technicians to help you set up your bike, mechanics to help with any after-market repair and stores to help you buy any product beyond the bike.’</p>\n<p>Because Van Rysel is still owned by the behemoth that is Decathlon, it can continue to do things such as offer a five-year warranty on carbon frames and forks. And it is also ultimately the reason Van Rysel is able to retain its ultimate philosophy of producing high-quality products that are priced fairly for the consumer. In the UK, the Van Rysel EDR CF Ultegra costs £2,999.99.</p>\n<p>For a full carbon fibre race bike with a full mechanical Shimano Ultegra disc groupset, tubeless-ready Fulcrum Racing3 wheels and tubeless-ready Hutchinson Fusion 5 Performance tyres, that’s as competitive as it gets.</p>\n<p><b><i>Explore the full Van Rysel range online at <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5702419426&amp;iu=/359/impcount.co.uk\" target=\"_blank\">decathlon.co.uk</a></i></b> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/road-bikes\">Road bikes</a></div>    </div></div>","author":"HughA","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d59b9c0feff109f4347319002b92a6baaca72dd1c6f4ce7db85e13e6f0c71f50","category":"Cycling"}