{"title":"Multi-Modal Spectroscopic Characterization and Defect Identification in SnO2/Ga2O3 Nanostructures","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.303/7720447?rss=1","date":1721779200000,"content":"<span>Semiconducting oxide nanostructures with a wide range of morphologies are emerging as a viable candidate for applications such as optical and mechanical resonators and solar cells. However, attaining effectively doped oxide nanowires with controllable conductivity is still a challenge [<a href=\"#ozae044.303-B1\">1</a>]. Designing semiconducting oxide nanostructures requires extensive understanding of their morphology and demands efficient multimodal characterization methods. Multimodal spectroscopy is the concept of combining several different spectroscopies onto one platform, thereby expanding the range of analytical capabilities available on that single platform. Besides the obvious benefit of cost reduction, having multiple analytical spectroscopies offers the added benefit of sample colocalization so that multiple complementary measurements can be made at the same location of the sample. The benefit of colocalization is particularly important as feature sizes get smaller, from a few microns to nanometers in size. In this study, Scanning Electron Microscope was integrated with cathodoluminescence (SEM-CL) and as a complementary information an external optical microscope coupled with photoluminescence (PL) and Raman spectroscopy were used to achieve co-localized high-resolution imaging and chemical mapping. Fig.1a, shows the image of the CL-PL instrument. Further, using the coordinates re-localization technology, nanoGPS navYX, shape engineered SnO<sub>2</sub> nanostructures grown on Ga<sub>2</sub>O<sub>3</sub> nanowires were characterized in detail to understand the optical properties and defect characteristics. Panchromatic CL images identified the region of illumination on connected nanowires. The CL emission from Ga<sub>2</sub>O<sub>3</sub> is composed of two components (3.3 and ∼ 3.0 eV). However, the Ga<sub>2</sub>O<sub>3</sub> nanowire tested had covered SnO<sub>2</sub> nanostructures and hence a weaker 3.3 eV emission, a stronger orange band (∼ 1.94 eV) corresponding to the SnO<sub>2</sub> nanostructure was observed. The orange band was attributed to the oxygen vacancies in SnO<sub>2</sub>. Photoluminescence and Raman mapping of the nanowires are carried out to understand the chemical nature of the local defects on SnO<sub>2</sub> /Ga<sub>2</sub>O<sub>3</sub> nanostructures. SEM micrograph of the bow-like nanostructure is shown in Fig.1b. The main axis of the structure is made of Ga<sub>2</sub>O<sub>3</sub> nanowire, while SnO<sub>2</sub> growth is seen at the center. Detailed synthesis and transmission electron microscopy study on these structures are reported elsewhere [<a href=\"#ozae044.303-B1\">1</a>]. Towards understanding the optical properties of the Ga<sub>2</sub>O<sub>3</sub> and SnO<sub>2</sub> nanostructures, first a panchromatic CL image was taken (Fig.1c), which identified the region of illumination. Monochromatic CL (MCL) images and the spectrum corresponding to the Ga<sub>2</sub>O<sub>3</sub> and SnO<sub>2</sub> nanostructures are shown in Fig. 2(a &amp; b). The CL emission from Ga<sub>2</sub>O<sub>3</sub> is composed of two components (3.3 and ∼ 3.0 eV) [<a href=\"#ozae044.303-B1\">1</a>,<a href=\"#ozae044.303-B2\">2</a>]. However, the Ga<sub>2</sub>O<sub>3</sub> nanowire tested had covered SnO<sub>2</sub> nanostructures and hence a weaker 3.3 eV emission, a stronger orange band (∼ 1.94 eV) corresponding to the SnO<sub>2</sub> nanostructure. The orange band was attributed to the oxygen vacancies in SnO<sub>2</sub> [<a href=\"#ozae044.303-B1\">1</a>,<a href=\"#ozae044.303-B3\">3</a>]. The photoluminescence map and the spectra recorded from the same sample are shown in Figure 2c. Larger laser spot used in the PL spectroscopy resulted in a convoluted Ga<sub>2</sub>O<sub>3</sub> and SnO<sub>2</sub> peaks. In Fig.2c PL map, higher 640 nm band intensity is seen on the regions where SnO<sub>2</sub> is deposited. It is believed that the native defects of SnO<sub>2</sub> are responsible for the enhanced emission [<a href=\"#ozae044.303-B1\">1</a>]. In summary, the methodology presented in this study is a generic one and can easily be extended to other semiconduction nanostructures.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"d59d6b104dcacb1a4584253418693f7dc1a3e596ed30aa9353af7524aacc4bb3","category":"Environment"}