{"title":"Perception of Individualized Nursing Care in Acute Medical and Perioperative Settings: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202409.1546/v1","date":1726752902000,"content":"Abstract: Individualized nursing care allows a systematic assessment and intervention, considers the patient's preferences, values, and context, and contributes to a positive care trajectory. However, its operationalization has proven to be challenging. This research aims to determine which items of nursing care individualization are most integrated into nurses' clinical practice, and those that are less included. A cross-sectional study was conducted on 122 eligible and registered nurses at a Hospital Center, in Ophthalmology (operating room and inpatient ward), Cardiology Service, Internal Medicine, and Medical Emergency Unit, in Portugal. The Indi-vidualized Care Scale nursing version (ICS-Nurse) was used for the assessment, including three sub-dimensions: clinical situation, personal life situation, and decisional control over care-related decisions. Analyses were performed using Cronbach's Alpha and Principal Component Analysis to confirm the relationships between the variables, suggested by the literature and previous studies. In the results, no statistically significant differences were identified between the sociodemographic profile and the sub-dimensions of individualization. Nurses overall have a good perception of the importance of individualized care (4.06 ± 0.46 ICS-A-NURSE), but face difficulties in its implementation during the last shift worked (3.97 ± 0.49 ICS-B-NURSE). The sub-dimensions more integrated into the care environment were clinical situations and decisional control, and the less integrated were the personal lives of patients. This study identifies key aspects of the individualization of nursing care in acute and perioperative settings, as its omission represents a failure to address the multidimensional health needs of patients, families, and caregivers. We suggest the development of training programs that promote a holistic approach, as well as future studies that consider patient outcomes related to the individualization of nursing care.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5a39bbc72c73c008ba416e15cc40b38ae9d5d110fb501aef98bd70a097af682","category":"Interdisciplinary"}