{"title":"An investigation into waste handler’s knowledge of management of isolation waste: A case study of Dr George Mukhari Academic Hospital, Gauteng, South Africa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305224","date":1718028000000,"content":"<p>by Mmatlou Ouma Moloisi, Stanley Chibuzor Onwubu</p>\r\nBackground <p>The proper management of isolation waste is of utmost importance in healthcare facilities to prevent the spread of infections and protect both healthcare workers and the general public. This study investigated waste handlers’ knowledge of the management of isolation waste at Dr. George Mukhari Academic Hospital in Gauteng, South Africa.</p> Methods <p>A survey was conducted to assess waste handlers’ understanding of waste types, colour codes, safety precautions, and awareness of internal policies related to isolation waste management.</p> Results <p>The study found that the majority of waste handlers demonstrated a good understanding of waste types generated in the isolation unit, including sharps waste, human tissue waste, infectious waste, and general waste. They also correctly identified examples of sharp waste, such as injections, blades, glass slides, and needles. Additionally, most respondents were aware of the colour code used for representing infectious waste as \"yellow\" and \"red.\" The study revealed a statistically significant association between waste handlers’ age and their knowledge of isolation waste, suggesting that age may influence their understanding of waste management practices. Furthermore, experience was found to be significantly associated with waste handlers’ knowledge of the health-hazardous nature of isolation waste. While the majority of waste handlers recognized the importance of wearing protective clothing and correctly marking isolation waste, some respondents were not aware of the internal policy for waste handling such as guidelines and protocols specific to the segregation, packaging, labeling, and disposal of waste generated within the isolation units.</p> Conclusion and contribution <p>These findings highlight the importance of continuous training, targeted education, and policy dissemination to ensure effective waste management and adherence to safety protocols among waste handlers.</p>","author":"Mmatlou Ouma Moloisi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d5a3dfa895f8284f8293371ca9e5775eddd149940b4a2155fb4f604565e06c82","category":"Interdisciplinary"}