{"title":"Selection of reference miRNAs for RT-qPCR assays in endometriosis menstrual blood-derived mesenchymal stem cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306657","date":1722348000000,"content":"<p>by Sabrina Yukari Santos Hacimoto, Ana Clara Lagazzi Cressoni, Lilian Eslaine Costa Mendes da Silva, Cristiana Carolina Padovan, Rui Alberto Ferriani, Júlio César Rosa-e-Silva, Juliana Meola</p>\r\n\r\nChoosing appropriate reference genes or internal controls to normalize RT-qPCR data is mandatory for the interexperimental reproducibility of gene expression data obtained by RT-qPCR in most studies, including those on endometriosis. Particularly for miRNAs, the choice for reference genes is challenging because of their physicochemical and biological characteristics. Moreover, the retrograde menstruation theory, mesenchymal stem cells in menstrual blood (MenSCs), and changes in post-transcriptional regulatory processes through miRNAs have gained prominence in the scientific community as important players in endometriosis. Therefore, we originally explored the stability of 10 miRNAs expressions as internal control candidates in conditions involving the two-dimensional culture of MenSCs from healthy women and patients with endometriosis. Here, we applied multiple algorithms (geNorm, NormFinder, Bestkeeper, and delta Ct) to screen reference genes and assessed the comprehensive stability classification of miRNAs using RefFinder. Pairwise variation calculated using geNorm identified three miRNAs as a sufficient number of reference genes for accurate normalization. MiR-191-5p, miR-24-3p, and miR-103a-3p were the best combination for suitable gene expression normalization. This study will benefit similar research, but is also attractive for regenerative medicine and clinics that use MenSCs, miRNA expression, and RT-qPCR.","author":"Sabrina Yukari Santos Hacimoto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d5affc396d8a48ecf29920ffa3b340daee978378d22426a361194f9e8c354f4e","category":"Interdisciplinary"}