{"title":"Apple Vision Pro Developers Asked to Avoid 'VR' Branding and Hints at 'Vision' Product Line","link":"https://www.macrumors.com/2024/01/09/vision-pro-developers-asked-to-avoid-vr-branding/","date":1704806223000,"content":"Apple is asking developers to avoid mention of \"AR\" and \"VR,\" as well as the Vision Pro as a generic \"headset,\" when listing their apps on the <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/visionos-app-preview.jpg\" width=\"1470\" height=\"827\" />\r<br />\n<a href=\"https://developer.apple.com/visionos/submit/\">Apple's developer website</a> now features new requirements for Vision Pro apps (via <em><a href=\"https://9to5mac.com/2024/01/08/apple-visionos-apps-ar-vr/\">9to5Mac</a></em>), including how to appropriately list their apps on the ‌visionOS‌ ‌App Store‌. Instructions about how developers should describe their apps include specific prohibition of the terms augmented reality (AR), virtual reality (VR), extended reality (XR), or mixed reality (MR).\r<br />\n\r<br />\nInstead, developers should adopt the \"spatial computing\" phrasing that Apple has touted since the Vision Pro's announcement in June last year. The push is likely part of Apple's continued effort to disassociate the Vision Pro headset from other products in the space from the likes of Meta and forge its own path in the minds of customers.<blockquote><strong>Spatial computing</strong>: Refer to your app as a spatial computing app. Don't describe your app experience as augmented reality (AR), virtual reality (VR), extended reality (XR), or mixed reality (MR).</blockquote>Similarly, Apple requests that app developers do not refer to the Vision Pro generically as a \"headset.\"<blockquote><strong>Apple Vision Pro</strong>: Always typeset Apple Vision Pro as three words with an uppercase A, V, and P followed by lowercase letters. Don't break Apple Vision Pro over two lines. Don't use the article the before Apple Vision Pro. Apple Vision Pro apps are available on the App Store or can be downloaded from the App Store. It's acceptable to say Name of app for Apple Vision Pro when your promotion is focused on features and benefits related to Apple Vision Pro. Don't refer to Apple Vision Pro generically as a \"headset.\" The phrase \"Apple Vision Pro\" can't be included in your app name, but it can be included in your app description.</blockquote>Apple is also continuing to change mentions of \"<a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>\" to \"Apple Vision\" throughout its beta cycle. For example, Apple now refers to \"Mac, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, Apple Vision apps\" instead of \"Mac, ‌iPad‌, ‌Apple Vision Pro‌ apps.\" Apple's website features a \"Vision\" product tab instead of a \"Vision Pro\" tab, but the gradual shift toward \"Apple Vision\" branding appears to add credence to the idea of Apple building a \"Vision\" product line.\r<br />\n\r<br />\nThe Vision Pro is positioned as a high-end device with a $3,499 price tag, but there have been a multitude of rumors about Apple's plans to release a <a href=\"https://www.macrumors.com/2023/11/28/work-on-multiple-next-gen-vision-pro-headsets/\">cheaper headset</a> in the future. Such a device would make sense as an \"Apple Vision\" headset, just as the ‌iPad‌ is to the <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> or the <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> is to the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/vision-pro-developers-asked-to-avoid-vr-branding/\">Apple Vision Pro Developers Asked to Avoid 'VR' Branding and Hints at 'Vision' Product Line</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-developers-asked-to-avoid-vr-branding-and-hints-at-vision-product-line.2415856/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d5af5145ab548c16453b1c8475e0f1fb1a7f2fd6c174257811da57d444885336","category":"Apple"}