{"title":"A Deep Learning Classification Scheme for PolSAR Image Based on Polarimetric Features","link":"https://www.preprints.org/manuscript/202404.0594/v1","date":1712615364000,"content":"Polarimetric features extracted from polarimetric synthetic aperture radar (PolSAR) images contain abundant scattering information of objects. Utilizing this information for PolSAR image classification can improve accuracy and enhance object monitoring. Although significant progress has been achieved in related research, there are still issues such as insufficient utilization of polarimetric information and features. In this paper, a deep learning classification method based on polarimetric channel power features for PolSAR is proposed. The distinctive characteristic of this method is that the polarimetric features inputted into the deep learning network are the power values of polarimetric channels, where these channels are treated equivalently and contain complete polarimetric information. In terms of experimental comparative study, besides polarimetric power combinations, three different data input schemes were employed as data for the input end of the convolutional neural network (CNN), taking into account existing research. The neural networks utilizes the extracted polarimetric features to classify images, and the classification accuracy analysis is employed to compare the strengths and weaknesses of different input schemes. It is worth mentioning that the polarized characteristics of the data input scheme mentioned in this article have been derived through rigorous mathematical deduction, and each polarimetric feature has clear physical meaning. By testing different data input schemes on the Gaofen-3 (GF-3) PolSAR image, the experimental results show that the method proposed in this article outperforms existing methods and can improve the accuracy of classification to a certain extent, validating the effectiveness of this method in large-scale area classification.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5af54e5231c734cd2d6eb5a2d2485a868dc937011e1c8793bdeb261736987e8","category":"Interdisciplinary"}