{"title":"OpenAI เปิดตัวเฟรมเวิร์กสำหรับให้คะแนนประเมินความปลอดภัยของ AI ก่อนตัดสินใจ deploy","link":"https://www.blognone.com/node/137297","date":1702947439000,"content":"<div><div><div><p>OpenAI ประกาศเฟรมเวิร์กสำหรับการเตรียมความพร้อม เพื่อใช้ในการประเมินว่าโมเดล AI นั้น มีความปลอดภัยแค่ไหน ซึ่งคาดว่าจัดทำเพื่อให้การตรวจสอบ AI ว่าปลอดภัยหรือไม่เป็นขั้นเป็นตอนที่ชัดเจนขึ้น</p>\n<p>โดย OpenAI มีทีมที่รับผิดชอบด้านความปลอดภัยของ AI อยู่แล้ว ซึ่งมีหน้าที่ดูแลตรวจสอบโมเดล AI ต่าง ๆ แบ่งเป็น 3 กลุ่มคือ โมเดลที่ดีพลอยแล้ว เป็นระบบที่ปลอดภัย, โมเดลที่อยู่ในขั้นตอนเตรียมความพร้อม (Preparedness) ซึ่งต้องประเมินความปลอดภัยตามเฟรมเวิร์กก่อนดีพลอย และโมเดลความสามารถสูงในอนาคต (Superalignment)</p>\n<p>เฟรมเวิร์กเพื่อการเตรียมความพร้อม (Preparedness Framework) ใช้การประเมินและลงคะแนนในสกอร์การ์ด แบ่งเป็นระดับต่ำ กลาง สูง และรุนแรง โดยดูความปลอดภัย 4 ด้านคือ ความปลอดภัยทางไซเบอร์, CBRN (AI สร้างสูตรเคมี, ชีววิทยา, รังสีวิทยา และนิวเคลียร์), AI โน้มน้าวความคิดคน และ AI ที่มีความคิดอิสระ (Model Autonomy) ซึ่งภาพรวมต้องได้คะแนนในระดับ ต่ำหรือกลาง เท่านั้น จึงสามารถดีพลอยโมเดล AI นั้น หากสูงกว่านั้น จะต้องไปปรับการใช้งานให้คะแนนต่ำลงก่อน</p>\n<p>เมื่อผ่านการให้คะแนนในเฟรมเวิร์ก ทีมความปลอดภัยจะส่งต่อให้กลุ่มทำงานหลักพิจารณา แล้วส่งต่อให้กับฝ่ายบริหารเพื่อตัดสินใจขั้นตอนสุดท้ายว่าจะดีพลอย AI นี้หรือไม่ โดยให้สิทธิยับยั้งสำหรับบอร์ดบริษัทหากมองว่ามีความเสี่ยง</p>\n<p><a href=\"https://cdn.openai.com/openai-preparedness-framework-beta.pdf\">ดูรายละเอียดทั้งหมดของ Preparedness Framework ได้ที่นี่</a></p>\n<p>ที่มา: <a href=\"https://openai.com/safety/preparedness\">OpenAI</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fe61d093e088c0f44b7cbfcd688d6a97.png\" /></p>\n<blockquote><p>Our Preparedness Team will drive technical work, pushing the limits of our cutting edge models to run evaluations and closely monitor risks, including during training runs. Results will be synthesized in scorecards that track model risk. <a href=\"https://t.co/ybv2dHhLss\">pic.twitter.com/ybv2dHhLss</a></p>\n<p>— OpenAI (@OpenAI) <a href=\"https://twitter.com/OpenAI/status/1736809604892569861?ref_src=twsrc%5Etfw\">December 18, 2023</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d5b86c1dc611fdf637ee36538013f0491b6bcbf84af3eb398ce21b7e038a7f7a","category":"Thai"}