{"title":"Bike fits explained: what is a bike fit and should you get one?","link":"https://www.bikeradar.com/advice/sizing-and-fit/bike-fit-explained-what-is-a-bike-fit-and-should-you-get-one/","date":1679738400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/retulspecializedmtbfit-d1cd7a1.jpeg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"retul bike fit\" title=\"retulspecializedmtbfit\" />                                            <p>A professional bike fit can help you ride comfortably and efficiently, but is something many riders don’t see the point of, despite bike fitting being a burgeoning field.</p>\n<p>We almost all experience some aches and pains when cycling or afterwards. Some of that might be unavoidable, but a proper bike setup that’s tailored to your individual size and shape will often alleviate or remove many such issues. It may make you faster too.</p>\n<p>There are numerous <a href=\"https://www.bikeradar.com/advice/fitness-and-training/revealed-the-10-biggest-bike-fit-myths/\">myths and misconceptions about bike fitting</a>, so read on to learn more about bike fits, why you need one, what’s involved and what it might cost.</p>\n\n<h2>What is a bike fit?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Pro bike fits are often supported by specialist analysis software.</span></figcaption><span> <i>David Rome / Future Publishing</i></span></div>\n<p>A bike fit is a service where a professional fitter will assess your riding goals and history as well as your anatomy, then look at your position on your bike and your pedalling dynamics. They’ll modify how your bike is set up, to improve your comfort and how efficiently you pedal.</p>\n<p>That’s often done with the help of tools such as adjustable stationary bikes, video capture and analysis software, although an expert eye is also an important tool to identify potential problem areas.</p>\n<p>James Thomas, a bike fit specialist at Bicycle Richmond says the starting point for a bike fit is the rider, not their current bike: “Often, a bike fitter is presented with a bike which may or may not be right [for the rider] and they adhere to the limitations of that bike,” he says. Therefore, understanding the rider’s needs is the first step.</p>\n<p>When it comes to the bike, sometimes it may just be a matter of adjusting setup such as your saddle height and how far back it is on its rails.</p>\n<p>A bike fitter may suggest other changes such as a <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-the-best-saddle/\">saddle</a> that better suits your sitbone anatomy or a different stem length or pedal system. A fitter may use a pressure pad on the saddle to understand how your weight is distributed when riding.</p>\n<h2>Should you get a bike fit?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Specialists argue that anyone who spends a lot of time in the saddle could do with a bike fit.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>A bike fit is increasingly seen as part and parcel of the bike-buying experience. It’s important to get set up correctly so you’re comfortable as you ride and are pedalling as efficiently as possible.</p>\n<p>“If you intend on spending any amount of time on a bicycle, then you should have someone look at your position and interaction with the bike,” says Thomas.</p>\n<p>Riding a bike involves repeating a quite limited range of motion thousands of times, with your body sat most of the time in a more-or-less static position, so the risk of discomfort or injury if you’re not set up right is high, even though cycling is a low-impact sport.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A poorly fitted bike can constrain your ability to produce power.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>A bike fit can increase your power output as well. Thomas cites examples of riders who have seen increases of up to 50 watts in their <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP</a> after a fit.</p>\n<p>“Fundamentally, if you’ve got someone who is fighting their position, and all [a bike fitter] has to do is bring it into range for them, it’s not hard to find that sort of power,” he comments.</p>\n<p>It’s important to realise too that a bike fit isn’t a one-off thing, says Nas Karimi, in-house bike fitter at Pearson Cycles in London.</p>\n<p>As time goes by and you ride more, you may become more or less flexible, so you should plan to have a repeat bike fit every few years, to make sure that your setup is still optimal for you. Other factors such as injury, weight changes or, for a woman, childbirth may also alter your fit.</p>\n<p>“Optimising a human being on a bike is a constantly moving target. It’s a constantly changing entity, which feeds the thought that bike fitting is a process rather than a [single] event,” Thomas states.</p>\n\n<h2>What happens at a bike fit?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A bike fitter will consider your riding level and and training load before making adjustments.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>A bike fitter will usually start off by finding out the type of riding you’re doing and plan to do, how fit you are, how often you ride and any particular issues you have with your cycling and general health. That can take up to an hour.</p>\n<p>The fitter will also need to take some body measurements such as height and inside-leg length. There may be stance and foot-arch height analysis too, to work out how your feet are naturally positioned as you stand or sit and mobility analysis to assess flexibility.</p>\n<p>“These are metrics that we constantly refer back to. For example, if someone is falling to one side we look back at the measurements and may notice that they have move pronation in that particular foot. It indicates that the foot might need more support. It helps us do a better job,” Thomas states.</p>\n<p>You need to start with that initial off-bike analysis, says Innes Ogilvie, who runs <a href=\"https://www.bramblers.scot/\" target=\"_blank\">Bramblers</a> in Leith, Scotland and specialises in bike fit. He’ll often spend as much time looking at off-bike biometrics as on-bike position.</p>\n<p>“It’s important to make sure that you’re not missing anything which might be better treated by a physiotherapist,” he points out.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Many bike fitters start with cleat position.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>Karimi stresses the importance of looking at your shoe setup, and foot and <a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\">cleat position</a> first.</p>\n<p>“If this isn’t right, it can show up in misalignment and pain further up the leg,” he says. “Most people don’t understand the structure of their feet and how that, and any differences between their two feet, affect foot stability when on the bike.”</p>\n<p>That’s an area covered too by a <a href=\"https://www.bikeradar.com/features/retul-bike-fitting-and-the-benefits-of-custom-insoles/\">Retul bike fit</a>, where custom insoles may be part of the solution offered.</p>\n<p><a href=\"https://www.bikeradar.com/features/wide-shoes-why-you-need-them-and-which-brand-makes-the-best/\">Wider shoes</a> might help if you’re experiencing foot discomfort. As part of a fit, Karimi will assess your footwear, whether it matches the shape of your feet and whether it’s the right size for them.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shoe width has implications for comfort further up the body.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>“Don’t assume all size-44 shoes will be the right fit for you,” Karimi advises. “If the fit isn’t right, your feet may not be fully engaged with the pedals, particularly if the shoe is too large for you. Your feet shouldn’t feel as if they can move around too much.”</p>\n<p><a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\">Cleat position</a> is another area a bike fitter is likely to pay close attention to. There’s no general rule as to what will work for a rider, says Karimi, and positioning the cleats further back may work better for riders with larger feet, whereas a more aggressive position on the bike might call for more forward cleat positioning, although this can lead to compression of the joints in the forefoot. Rubbing on the cranks is an indication that foot positioning isn’t optimal.</p>\n<p>A bike fit will include on-bike analysis of your pedalling dynamics, often with video capture, and your bike fitter will adjust components such as your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">saddle height</a> and <a href=\"https://www.bikeradar.com/features/how-to-adjust-your-mountain-bike-saddle-angle/\">angle</a>, and drop and reach to your <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">handlebars</a>.</p>\n<p>These are all interrelated. “Saddle setback influences saddle height, weight distribution, hip function, and reach to the handlebars. So there are four parameters there that need to be considered just by changing one metric. It’s not rocket science, but it is complex,” says Bicycle Richmond’s Thomas.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Besides potentially being more comfortable, a narrow handlebar can offer aero advantages.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>A fitter may suggest changes to components too, such as a <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-the-best-saddle/\">different saddle</a>, different <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">bar width or shape</a> or different <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">crank length</a> to better suit your dimensions. A change of stem length might change your reach and so how extended you are on the bike.</p>\n<p>A fitter will look at your pedal stroke as you ride and if you’re pedalling knee-in or knee-out at the top of the stroke, which may mean adjusting your stance width, says Karimi. Bikes’ Q-factors don’t change with size, he points out, so changing pedal spindle length and cleat positioning can help compensate for this.</p>\n<p>A different set of pedals can make a difference. <a href=\"https://www.bikeradar.com/news/2021-wahoo-speedplay-pedals/\">Wahoo Speedplay</a> is a favourite system for fitters, because of the pedals’ high adjustability, with 6mm of side-to-side adjustment per pedal to match your optimal <a href=\"https://www.bikeradar.com/features/stance-width-what-it-is-and-why-you-should-care/\">stance width</a> and 13mm of fore/aft adjustment.</p>\n<p>Depending on the services you’ve selected, a full bike fit might take up to three hours. A good bike fitter will usually include a follow-up after a few weeks of riding with your new position. Some might even give a money-back guarantee if you don’t feel the fit has worked for you.</p>\n<h2>Are there different types of bike fit?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Retul provides bike fits in studios or even at your home.</span></figcaption><span> <i>Specialized / Retul</i></span></div>\n<p>You’ll find branded bike fit services from a number of major brands offered in different shops.</p>\n<p>One of the best known is Retul, which is owned by Specialized. The fit includes a 3D motion analysis, using position makers on your joints and cameras to map out your motion as you pedal. That’s analysed by computer to identify aspects of your pedalling that, says Retul, can’t be spotted by the human eye.</p>\n<p>Ogilvie at Bramblers uses the Bioracer 3D motion capture system to analyse your pedalling dynamics. This system also includes a pressure pad that’s placed over your saddle to understand saddle pressure distribution as you ride.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Selle Italia claims its ID match finds the ideal insoles for your arch shape.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>The idMatch system, owned by Selle Italia, uses a large red stationary bike with motorised saddle and handlebars. As you ride, cameras record your motion and this is translated by the system into small adjustments of your position as you continue to pedal. The system includes machines to check cleat positioning and stance as well. It keeps a huge database of products, so the fitter can suggest those which would suit your anatomy and riding style.</p>\n<p>Trek too has its own bike fit system, again backed up by a stationary bike designed to allow it to alter your position and analyse video of your riding using specialist software. There’s a saddle pressure analysis package too, designed to help you select the right saddle.</p>\n<p><a href=\"https://www.bikeradar.com/features/guru-fit-a-new-approach-to-bike-fitting-video/\">Guru</a> is yet another branded system with a machine-adjusted stationary bike that fine tunes your position as you ride based on 3D camera analysis. The bike is tiltable to simulate ascending and descending.</p>\n<p>There are other systems out there which allow analysis and adjustment, while some fitters will ask you to bring your own bike and use that, fitted to a turbo, to fine tune your fit.</p>\n<h2>Do you need a different fit for different types of riding?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> An endurance road bike fit should be more relaxed than on a racier set up.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>Position on the bike is very different for different types of riding. As road bikes are so diverse, there’s a lot of variation within <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road bike geometry</a>.</p>\n<p>A road racer will usually want a much lower position than an endurance cyclist for example.</p>\n<p>Triathletes and time trial riders adopt a more extreme position, sitting much further forward with their arms lower. A bike fit for tri and TT bikes also needs to optimise the position of arm rests and bar extensions.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Time trial and triathlon bike fit needs to be very precise to balance aerodynamics and power output.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>“There are different needs for gravel bikes, for example,” says Thomas. “I would set someone up shorter and taller, because you have less weight over the front wheel, less likelihood of washing the front wheel out because of the nature of riding off road.</p>\n<p>“But for road and gravel, there’s an argument for the ‘engine room’ (saddle height, setback and reach) staying more or less the same,” he continues.</p>\n<p><a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">Mountain bike geometry</a> also reflects the discipline’s requirements. Riders need to shift their weight as they ride and to pedal effectively once they reach a climb. <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cyclocross-racing/\">Cyclocross</a> too has its own specifics, to allow quick mounting and dismounting, in addition to similar balance needs to MTB and gravel riders.</p>\n<h2>Is a bike fit worth it?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A bike fit can pay dividends by improving efficiency and comfort.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>A bike fit is <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-much-difference-does-a-bike-fit-make/\">absolutely worth it</a>, to ensure that you’re comfortable as you ride, you lower the risk of injury and that your position allows you to pedal as efficiently as possible.</p>\n<p>“It can remove a lot of guesswork from the equation,” says Thomas. “I think it is pound-for-pound the best investment a rider can make.”</p>\n<p>Research has shown that even a small change in leg extension, for example, can yield significant increases in pedalling efficiency.</p>\n<p>A bike fitter might pick up asymmetries in your body which are affecting your riding too. If your feet are different sizes, your cleat position might need to be different for each, for example.</p>\n<p>Leg length can be different or your natural foot position might also be different left to right. A bike fitter might recommend shims or adjustment to shoe cant to compensate.</p>\n<h2>How much does a bike fit cost?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A bike fit is a modest investment compared to top-end hoops.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>A pro bike fit will usually cost a few hundred pounds. Many fitters will have an off-the-shelf menu of fixed price fitting options, from the basic which will let you find the <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-sizing/\">right size bike</a> for you, through to sophisticated scans and motion capture. You might get follow-up advice included after a few weeks of riding.</p>\n<p>If you want advice on specific aspects of your fit, you can usually ask for an hourly rate too.</p>\n<p>Some bike shops will offer a discounted or free bike fit and initial set-up of your bike as part of the purchase of a new bike.</p>\n<p>A bike fitter should also give you a written report of your fit and key dimensions, so you can potentially use this to set up other bikes in future.</p>\n<p>Even if you have to pay for a bike fit separately, it’s relatively inexpensive compared to the cost of a bike. It’s one of the more affordable <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-upgrades/\">bike upgrades</a> and will arguably have a greater effect on your enjoyment and riding efficiency.</p>\n<p>“Many would scoff at £200, £300, £400 for a bike fit, but they’ll very willingly spend £1,500, £2,000, even £3,000 on wheels,” Thomas points out.</p>\n<h2>How can you find a bike fit near you?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A basic fitting service is often included in a bike shop purchase.</span></figcaption><span> <i>Getty</i></span></div>\n<p>Many bike shops now have a bike fitting service in house, which they’ll offer as an extra cost add-on to a bike purchase or as a stand-alone service if you’ve already bought your bike somewhere else. So the best place to start is at your local bike shop.</p>\n<p>It’s also worthwhile to ask other cyclists you know for a recommendation. If you ride in a club, it’s likely that fellow riders will have invested in one. You can always resort to Google.</p>\n<h2>Can you do a bike fit yourself?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> While it’s important to know how to tinker with sizing yourself, it won’t compensate for professional input.</span></figcaption><span> <i>Wayne Reid / Our Media</i></span></div>\n<p>There’s a lot you can do yourself to make your <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-position/\">ride position</a> more comfortable or your pedalling more efficient, says Ogilvie, and people can often get a pretty good set-up doing it themselves.</p>\n<p>We’ve got lots of advice on how to tackle common causes of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-fix-5-of-the-most-common-causes-of-bike-pain/\">pain when cycling</a> and specific problems like <a href=\"https://www.bikeradar.com/advice/fitness-and-training/exercises-and-tips-for-avoiding-back-pain-when-cycling/\">back pain</a> and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-knee-pain-the-problem-areas/\">knee pain</a>.</p>\n<p>Both Karimi and Ogilvie point out that it also helps if you understand something about what’s involved, what you can change with your bike’s set-up and if you have already experimented a bit if you do later opt for a professional fit.</p>\n<p>“Listen to your body. If it feels too long, it almost definitely is. If you feel like you’re reaching too far at the bottom of the pedal stroke, it’s almost certain that your saddle is too high,” says Thomas. Make small changes to things like saddle height and ride with them to see how they work for you.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Discomfort often arises when we try to mimic an aggressive, pro position on our own bikes.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>Karimi stresses the importance of making small changes and riding with them for a few weeks, rather than trying to alter everything in one go. He also points out that changing, for example, your saddle fore and aft position will alter the distance from your pedals to your saddle, so you may need to adjust your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">saddle height</a> too to compensate.</p>\n<p>That’s something that Ogilvie stresses too: ”It’s important to look at fit holistically,” he says, “as saddle comfort and stability are often the most important things and can be affected by factors like crank length, for example.”</p>\n<p>What you’re not going to be able to do, which a pro bike fit will include, is a more detailed analysis of your pedalling style and how to improve it. A pro bike fitter will have a lot of experience working with other riders too, and will be able to spot problems like body asymmetry which you would probably not be aware of and propose ways to address this.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d5ba6f246ad1ad2d4fd0dd100411b295210b8e58509acbee2d30b4b4c1fe4306","category":"Cycling"}