{"title":"Thomas takes on the double: how far can he go at the Giro and Tour in 2024?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/geraint-thomas-to-ride-the-giro-tour-double-in-2024","date":1706200389000,"content":"\n      <p><span>The Giro-Tour double: can he do it? Will he do it? Will anyone ever again do it? Cycling fans across the world are all asking each other the same question, pondering whether 2024 is the season when Marco Pantani is finally replaced as the answer to the quiz question: who was the last rider to win the sport’s two biggest Grand Tours in the same season?</span></p>\n<div></div>\n<div></div>\n<p><span>But wait a second, we’re not talking about Tadej Pogačar’s chances, but instead that of a rider 12 years his senior, Geraint Thomas, for the Welshman has announced that he will be returning to the </span><i><span>Corsa Rosa</span></i><span> “to have another bash at it” in 2024, before then switching his attention to the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> – despite indicating several times that the chapter had closed on his Tour career.</span></p>\n<p><span>Thomas hasn’t made public his goals in both races – it’s highly plausible that he will be one of three Ineos Grenadiers leaders at the Tour, a situation he has come out on top in before – but it can be assumed that he’s heading back to the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> to seek revenge.</span></p>\n<p><span>It was last May that the Briton agonisingly lost the Italian race on the penultimate day by 14 seconds to Primož Roglič, and part of the anguish he and his supporters felt was that it was presumed that was his last best chance to win a second Grand Tour to go alongside his 2018 Tour de France triumph.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_-Giro_d_Italia_2023_-_Stage_10-04863.jpg?v=1706196031\" /></span><em><span>Geraint Thomas spent eight days in the pink jersey at the 2023 Giro d'Italia</span></em></p>\n<p><span>Yet Thomas has repeatedly stressed that, although he’ll be turning 38 on the final weekend of this year’s Giro, age has not yet caught up with him, and instead of seeing a decline in his condition, his performance metrics indicate a rider only getting better. </span></p>\n<p><span>So, can he spring a surprise and win the Giro? To do so, he’ll have to find a way past Pogačar, a daunting task he’s barely ever achieved. In fact, in 72 race days competing against each other, Thomas has only bettered Pogačar’s results on five occasions: two were in the spring of 2019, when the Slovenian was just a few months into his neo-pro season; and one was an inconsequential sprint stage at the 2022 Tour de France. </span></p>\n<p><span>But what will give Thomas hope is that he has previously profited when Pogačar has had one of his rare off-days, the Ineos man putting over a minute into the UAE Team Emirates rider on that infamous Col du Granon Tour stage in 2022, and then besting Pogačar’s time trial performance at last year’s World Championships in Glasgow by 62 seconds. With the Giro containing 68 time trialling kilometres, and visiting the rarefied air of the high Dolomites that Thomas excelled in eight months ago, the veteran can sense an opportunity. A slim one, but nonetheless an ajar door that could be prised open.</span></p>\n<p><span>Of course, there will be others on the start list beside Pogačar. A lot is expected of Cian Uijtdebroeks, now of Visma-Lease a Bike, and intrigue surrounds the return of Nairo Quintana to Movistar. There are also the wildcards of Wout van Aert (Visma-Lease a Bike )and Julian Alaphilippe (Soudal–Quick-Step). Pitch an on-form Thomas against that quintet, and whoever else might be a contender, and why can’t he once again land himself a place on the podium?</span></p>\n<p><span> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PB1_7978.jpg?v=1706195879\" /><em>Geraint Thomas came 10th in the elite time trial at the World Championships last year, with Tadej Pogačar placing 21st </em></span></p>\n<p>There are, however, obvious reasons to doubt his prospects. A curious fact is, despite racing his first professional races in 2005, Thomas has only attempted to ride two Grand Tours in the same season three times before: in 2015, when he wasn’t yet a GC rider; in 2017, only to crash out of the Giro and Tour; and in 2023 when he disappointed at the Vuelta following his near-miss in the Giro. It’s hard to draw too many conclusions other than to say last season was his only proper fist at a Grand Tour double, and though he thrived in one, he was in survival mode in the other.</p>\n<p><span>Assuming he has a strong Giro, will he be able to maintain his form during the ensuing five weeks before the Tour gets underway, and then reach another performance peak in the subsequent three weeks? And will that condition be good enough to once again go toe-to-toe with Pogačar, as well as Roglič, Jonas Vingegaard and Remco Evenepoel? </span></p>\n<p><span>What is certain is that Thomas’s planned participation in both Grand Tours reflects his status in the Ineos Grenadiers team, a confidence that, in the absence of one of the so-called Big Four among their ranks, he is their general classification talisman, and can pick and choose his calendar. Only a few years ago, with Thomas seemingly on the way out, and Ineos banking their house on Egan Bernal, such an eventuality would have been viewed as far-fetched and highly unlikely. But here we are; sport is unpredictable, and Thomas has made a career out of surprising onlookers. Is there one more, maybe two more, up his sleeve. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d5c159e41f30928ca12bb2f1b44660cf5d18a07cb28c5c7b6b74da2e33aebc4c","category":"Cycling"}