{"title":"Macs, mixed-reality, and more: Will June be Apple’s biggest month ever?","link":"https://www.macworld.com/article/1935627/apple-releases-june-2023-wwdc-reality-headset-macbook-ios-17.html","date":1685644755000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>June is always a big month for Apple enthusiasts. WWDC always starts off the month with a look at all the new operating system updates coming to your iPhone, iPad, Mac, Apple Watch, and Apple TV in the fall, and developers get an early beta version right away.</p>\n\n\n\n<p>The unveiling of iOS 17, macOS 14, and watchOS 10 would be exciting enough, but Apple also often releases new products at WWDC, and this year we expect a new 15-inch Macbook Air. We might see updates to the Mac Studio as well and perhaps even, finally, a peek at the Mac Pro powered by Apple Silicon.</p>\n\n\n\n<p>This year is expected to be a WWDC for the history books, though. Just about everyone expects Apple to mark its entry into a major new product category for the first time since Apple Watch with the unveiling of its mixed reality headset (likely dubbed Reality Pro or Reality One). The headset isn’t expected to be available until at least the fall, but we should get our first glimpse into what it looks like and how it works.</p>\n\n\n\n<p>Here’s a brief rundown of everything we expect from Apple in June, both at WWDC and throughout the month.</p>\n\n\n\n<h2>Worldwide Developers Conference</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> is a week-long event that kicks off with a big keynote presentation at 10 am PT on Monday, June 5. That’s where all the most exciting announcements happen–we’ll get a look at the new operating system updates for the fall, including iOS 17, macOS 14, and watchOS 10.</p>\n\n\n\n<p>Developer betas for the new operating systems generally release right away, with public betas starting a few weeks later (possibly in July). There are developer sessions throughout the week, and interesting little details often trickle out of those, too.</p>\n\n\n\n<p>However, this year’s WWDC will feature a lot more than just software. Rumors say Apple will <a href=\"https://www.macworld.com/article/1937070/wwdc-15-inch-macbook-air-mac-pro-studio-imac-announcements.html\">unveil “several” new Macs</a> along with our first look at the long-rumored new <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">mixed-reality headset</a>.</p>\n\n\n\n<h2>New hardware</h2>\n\n\n\n<p><strong>15-inch MacBook Air:</strong> For months now we’ve been telling you of rumors that the <a href=\"https://www.macworld.com/article/819516/15-inch-macbook-air-release-date-specs-rumors.html\">15-inch MacBook Air</a> would launch in the spring. We expect Apple to announce it at WWDC, with availability either immediately or the following week. </p>\n\n\n\n<p><strong>Mac Pro with Apple silicon: </strong>The Mac Pro is the last remaining Mac to still have Intel processors, and it’s past due for its Apple silicon makeover. Apple has used the WWDC stage to announce the past three Mac Pros: the Intel G5 tower in 2006; the <a href=\"https://www.macworld.com/article/221185/the-wait-is-nearly-over-apple-unveils-new-mac-pro.html\">cylinder in 2013</a>; and the <a href=\"https://www.macworld.com/article/232855/mac-pro-2019-best-features.html\">current model</a> in 2019, not to mention the <a href=\"https://www.macworld.com/article/230126/imac-pro-features-faq-pricing-specs-release.html\">iMac Pro</a> in 2017. The <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Apple Silicon Mac Pro</a> is likely not going to be as expandable and upgradeable as the current Intel-based model, though.</p>\n\n\n\n<p><strong>Mac Studio with M2 processors:</strong> The latest rumors say<a href=\"https://www.macworld.com/article/1935502/apple-trade-in-mac-studio-13-inch-m2-macbook-air-pro.html\"> Apple is going to start trade-ins on Mac Studio computers</a> in the first week of June, which is a good indication that the current M1-based models will get M2-based upgrades. We expect them to be very similar to the current Mac Studio, but with M2 Max and new M2 Ultra chips.</p>\n\n\n\n<p><strong>Reality Pro:</strong> Last but definitely not least, there are very strong indications that <a href=\"https://www.macworld.com/article/1937070/wwdc-15-inch-macbook-air-mac-pro-studio-imac-announcements.html\">Apple will unveil its AR/VR headset</a> at WWDC. We expect it to be called Reality Pro and to make all the current VR and AR products look like silly toys, with cutting-edge specs and software that no competitor has even tried to bring to market. While we will see a lot about the product itself, its operating system, development tools, and apps, we probably will <em>not</em> get a firm release date or price just yet. Those details will probably not come until later this year.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Mac Studio Display\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/03/Mac-Studio-Display-07.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>The Mac Studio could finally get its M2 refresh at WWDC.</p></figcaption></figure><p>Willis Lai/Foundry</p></div>\n\n\n\n<h2>Apps and software updates</h2>\n\n\n\n<p>WWDC is all about software. It’s a developer conference after all, so this is the first look at the coming operating systems and their associated features, frameworks, and services for developers and users. We’ll see the new iOS, iPadOS, watchOS, and macOS, and developers will get their first access to beta versions. Public betas often come later, typically in July after several developer beta releases.</p>\n\n\n\n<p><strong>iOS 16.6 et al:</strong> All eyes are on iOS 17, but if you’re not a registered developer, it’s the <a href=\"https://www.macworld.com/article/1923832/ios-16-6-beta-features-release-date.html\">iOS 16.6</a> update you can look forward to in June (along with <a href=\"https://www.macworld.com/article/1923841/macos-ventura-13-5-beta-features-updates-install.html\">macOS 13.5</a> and watchOS 9.6). Those are in beta now, and don’t appear to contain much in the way of new features. iMessage Contact Key Verification is rumored to be a part of this release, but it’s not yet active in the beta and is really meant as an advanced security measure for users who are at risk of being targeted by state actors and the like.</p>\n\n\n\n<p><strong>iOS 17:</strong> We’ll be introduced to iOS 17 at WWDC, and developers will get access to an incomplete and somewhat unreliable beta right away, with the public beta likely coming in July. You can <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">read all about iOS 17 here</a>, but it is expected to be more about quality-of-life improvements and updates to existing apps and features than any major changes.</p>\n\n\n\n<p><strong>iPadOS 17:</strong> We haven’t heard much about <a href=\"https://www.macworld.com/article/1794980/ipados-17-release-date-features-compatibility-beta.html\">iPadOS 17</a>, other than that it will carry forth many of the same improvements coming in iOS 17. We might get the same lock screen customization found in iOS 16, though. Again, this will come in the form of a developer beta in June, with a public beta probably in July.</p>\n\n\n\n<p><strong>watchOS 10:</strong> This is rumored to be one of the biggest watchOS updates in years, with some significant changes to the core interface. Smart app-driven widgets or cards reminiscent of the “Glances” that were removed back in watchOS 3 are said to be a highlight of this release. It’s a good idea–people don’t like opening apps on their Apple Watch, and there needs to be an easier way to get at the key information and features they provide. <a href=\"https://www.macworld.com/article/1792869/watchos-10-release-date-new-features.html\">Read more about watchOS 10 here</a>.</p>\n\n\n\n<p><strong>macOS 14:</strong> Of course, Apple’s oldest platform needs to keep pace with its others, especially now that they use Apple-designed processors. The ecosystem has never been more holistic, and we expect that to be the thrust of <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS 14</a>: making your Mac work together better with other Apple products.</p>\n\n\n\n<h2>Services</h2>\n\n\n\n<h3>Apple TV+</h3>\n\n\n\n<p>Here are the shows, series, and movies we expect to release on Apple TV+ in June. If you want to know what’s coming later, check our <a href=\"https://www.macworld.com/article/340717/apple-tv-plus-upcoming-shows-future-moves-series-release-dates-film-television.html\">full guide to upcoming Apple TV+ content</a>.</p>\n\n\n\n<p><strong>The Crowded Room:</strong> Inspired by the biography <em>The Minds of Billy Milligan</em>, this is a multi-season anthology series that Apple says will, “explore the true and inspirational stories of those who have struggled and learned to successfully live with mental illness.” The first season will be 10 episodes. <strong>June 9</strong></p>\n\n\n\n<p><strong>Duck &amp; Goose: When Duck Met Goose:</strong> A new special in advance of the new season of <em>Duck &amp; Goose</em>. When Thistle gets upset with her new neighbor, Bluebird recalls the bumpy days of Duck and Goose’s early friendship. <strong>June 9</strong></p>\n\n\n\n<p><strong>The Snoopy Show (season 3):</strong> The world-famous beagle is back! Dig into new adventures with Snoopy, along with his best pal, Woodstock, and the rest of the Peanuts gang. <strong>June 9</strong></p>\n\n\n\n<p><strong>Lovely Little Farm (season 2):</strong> Return to the farm with season two where Jill and Jacky continue to nurture Quackety Duck Duck, Al Alpaca Pickle Pony, and meet some new friends along the way. <strong>June 16</strong></p>\n\n\n\n<p><strong>Swagger (season 2):</strong> The sports drama inspired by Kevin Durant’s experiences in the world of youth basketball is back for a second season. <strong>June 23</strong></p>\n\n\n\n<p><strong>Hijack:</strong> A seven-part series, told in real-time, about a seven-hour flight to London that is hijacked and the business negotiator who tries to save the passengers. <strong>June 28</strong></p>\n\n\n\n<h3>Apple Arcade</h3>\n\n\n\n<p>Apple releases new games to Apple Arcade on Fridays, but not every Friday is marked by a new game or significant update. Check our <a href=\"https://www.macworld.com/article/232599/apple-arcade-faq-list-of-games-price-compatibility-coming-soon.html\">Apple Arcade FAQ</a> for a full list of Apple Arcade games and more details on the service. Some games are released with no forewarning, but you’ll often see several projects listed in the Coming Soon section.</p>\n\n\n\n<p>In early May, Apple released <a href=\"https://www.macworld.com/article/232599/apple-arcade-faq-list-of-games-price-compatibility-coming-soon.html\">20 new Apple Arcade games at once</a>, and then nothing else since. Will the releases resume in June? We have no idea, but we’ll update this article as we learn more.</p>\n\nApple, iOS, MacBook, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d5c53031e429dd7681f877a8d3feea70acad733c857eb8b56fdc4ae4041a7703","category":"Apple"}