{"title":"Can a turbo trainer damage a carbon frame? How to look after your bike when riding indoors","link":"https://www.bikeradar.com/advice/fitness-and-training/using-bike-on-turbo-trainer/","date":1699023600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/GettyImages-1648761160-e4df403.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"BURRIANA, SPAIN - AUGUST 30: Remco Evenepoel of Belgium and Team Soudal - Quick Step - Red Leader Jersey warming up on the roller after the 78th Tour of Spain 2023, Stage 5 a 184.6km stage from Burriana to Burriana / #UCIWT / on August 30, 2023 in Morella, Spain. (Photo by Tim de Waele/Getty Images)\" title=\"78th Tour of Spain 2023 - Stage 5\" />                                            <p>If you’ve taken to indoor training in recent years, you’re not alone. More and more riders are moving indoors for quality training time on a smart trainer away from traffic and bad weather.</p>\n<p>You and your bike won’t get covered in road or trail filth. But Will Smith, a mechanic at Havebike bike repair shop, says your bike will still be subject to wear and tear.</p>\n<p>Here are four reasons why you need to look after your bike, even if you’re <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">cycling indoors</a>.</p>\n<h2>1. Sweat isn’t good for your bike</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Kickr Headwind fan for indoor cycling\" title=\"Wahoo Kickr Headwind fan for indoor cycling\" />\n\n</div><div><figcaption><span><i></i> Even with a fan cooling you, you’ll need to keep sweat off your bike.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Even in a cold garage and with a gale-force fan blowing on you during a session, or with your windows wide open, you’ll get hot and sweaty.</p>\n<p>That sweat can find its way into expensive parts and the salt that it contains can corrode them over time.</p>\n<p>Smith says it’s very easy for sweat to find its way into <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-headsets/\">headset</a> bearings, shift levers and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-handlebar-tape/\">bar tape</a>, and it can also cause metal cable guides to seize to the frame.</p>\n<p>“We’ve seen a few examples recently where levers and bars have corroded to such an extent, they needed totally replacing,” he says.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo indoor cycling\" title=\"Wahoo indoor cycling\" />\n\n</div><div><figcaption><span><i></i> Exposing expensive components to sweat is not a good idea.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>He advocates placing a towel over your bars to collect the sweat; you can also buy ‘bike bras’ to cover the top of the bike, and frame protector sprays, but there’s still a risk to bar tape and shifters.</p>\n<p>Other <a href=\"https://www.bikeradar.com/advice/buyers-guides/turbo-trainer-accessories/\">turbo trainer accessories</a>, such as a cap, can also reduce how much sweat drips off you.</p>\n<p>As with riding outside, you still need to <a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">keep your bike clean</a> and dry.</p>\n<p>“In an ideal world you would wash your bike after every session, but this isn’t practical for many so if you can do it after every third session, this should stop the build-up,” says Smith.</p>\n<h2>2. A turbo could damage your frame</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo indoor cycling\" title=\"Wahoo indoor cycling\" />\n\n</div><div><figcaption><span><i></i> Full-gas efforts could be putting unexpected stress on your frame. If you’re concerned, check your bike manufacturer’s warranty.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>When you’re putting in a big effort, particularly out of the saddle, it’s natural to swing your weight from side to side.</p>\n<p>And the relative safety of doing all-out efforts on the turbo, compared to on the road in the midst of cars, is one of the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits of indoor cycling</a>.</p>\n<p>Some trainers, such as the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-move-review/\">Wahoo Kickr Move</a>, allow side-to-side motion. But if your bike is held rigidly in the trainer, you’re putting side loads on your frame, <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a>, seatstays and chainstays that they weren’t necessarily designed for.</p>\n<p>“Depending on the trainer type and use, it may potentially apply unusual forces on your bicycle, wear parts and/or weaken or damage your bicycle,” reads an addendum to Specialized’s owner’s manual on trainer use.</p>\n<p>“This is especially true for carbon fibre bicycles rigidly attached to the trainer.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Scott Addict RC 40 road bike\" title=\"Scott Addict RC 40 - 16\" />\n\n</div><div><figcaption><span><i></i> On the turbo, you can’t throw the bike from side to side as much as you can outdoors.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Smith says normal seated efforts shouldn’t be a problem, but issues a word of caution over more vigorous efforts. “Out of the saddle, the bike won’t move from side to side as it does on the road, so that energy has got to go somewhere.”</p>\n<p>Regardless, it’s worth checking whether your bike brand’s guarantee will cover damage specifically caused by using your bike on an indoor trainer.</p>\n<p>“Until recently some of the very big brands said in their T&amp;Cs that warranties were invalidated if you were using your bike on a turbo or any type of mounting,” says Smith.</p>\n<p>With the massive increase in the number of riders taking to the indoor trainer, that position has started to change, with some bike makers now building and testing their frames so that they can cope with use in a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"VIKERSUND, NORWAY - AUGUST 24: Kim Cadzow of New Zealand and Team Jumbo-Visma warming up prior to the 9th Tour of Scandinavia 2023 - Battle Of The North - Stage 2 a 150.5km stage from Vikersund to Norefjell 791m / #UCIWWT / on August 24, 2023 in Vikersund, Norway. (Photo by Luc Claessen/Getty Images)\" title=\"9th Tour of Scandinavia 2023 - Battle Of The North - Stage 2\" />\n\n</div><div><figcaption><span><i></i> If you own multiple bikes, it could be best to spare your best one from the turbo trainer.</span></figcaption><span> <i>Luc Claessen/Getty Images</i></span></div>\n<p>Specialized has tested and certified all model year 2020 (and onwards) road bikes for trainer use, though the brand’s other bikes, and those road bikes prior to MY2020, are “used on trainers at your own risk”.</p>\n<p>The brand does, however, suggest riders “consider using an old bike with a metal frame and components you are not using on the road”.</p>\n<p>Meanwhile, since 2019, Canyon has provided a <a href=\"https://www.canyon.com/en-gb/support-articles/how-to-use-canyon-bikes-in-turbo-trainer.html\" target=\"_blank\">list of models approved for use on turbo trainers</a> – as well as those models that are explicitly not compatible with specific turbo trainers.</p>\n<p>The brand has also issued guidelines for trainer use. For example, its <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a> are not approved for use and Canyon bikes with thru-axles are only approved for use with direct-drive trainers.</p>\n<p>The bottom line, however, is to check any brand guidelines and your warranty before you clamp your £10,000 bike to your trainer for a flat-out <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">interval training</a> session.</p>\n<h2>3. You can damage your components</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub\" title=\"Zwift Hub\" />\n\n</div><div><figcaption><span><i></i> The cassette on a direct-drive smart trainer should be compatible with your rear derailleur.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>If you mount your bike using a skewer, make sure you use the one that’s specific to your trainer; a skewer from a wheel may not hold your bike securely.</p>\n<p>“Worst case scenario could result in the bike slipping and falling out of the turbo,” says Smith.</p>\n<p>Take particular care when mounting your bike on a trainer. Ensure that the frame is securely attached via the quick-release or thru-axle, and that no other part of the trainer and bike are in contact with one another.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo indoor cycling\" title=\"Wahoo indoor cycling\" />\n\n</div><div><figcaption><span><i></i> Don’t clamp your bike too tightly on to the trainer.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>“Also, be careful to avoid clamping the bike too tightly,” he continues. “It’s human nature to tighten it up as much as possible but this can result in crushed bearings, a damaged <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">freehub</a> or ultimately a <a href=\"https://www.bikeradar.com/advice/workshop/workshop-what-to-watch-for-when-buying-a-used-carbon-frame/\">damaged or even cracked frame</a>.”</p>\n<p>If you’re riding a direct-drive trainer, Smith also says you should use a <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a> that doesn’t exceed the capacity of your <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a>.</p>\n<p>Smith is less concerned with damage to the front wheel from it sitting static on the floor or in a riser block.</p>\n<p>He advises <a href=\"https://www.bikeradar.com/features/how-to-inflate-a-bicycle-tyre-everything-you-need-to-know-about-pumps-valves-pressure-and-more/\">keeping your tyres pumped up</a> and rotating the front wheel occasionally, so the pressure isn’t always in one place. It’s a good idea to check that riding in one spot hasn’t affected spoke tension and wheel truing as well.</p>\n<h2>4. You still need to check for wear</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"BAR-SUR-AUBE, FRANCE - JULY 27: Marianne Vos of Netherlands and Jumbo Visma Women Team yellow leader jersey warming up on rollers after the 1st Tour de France Femmes 2022, Stage 4 a 126,8km stage from Troyes to Bar-Sur-Aube / #TDFF / #UCIWWT / on July 27, 2022 in Bar-sur-Aube, France. (Photo by Dario Belingheri/Getty Images)\" title=\"1st Tour de France Femmes 2022 - Stage 4\" />\n\n</div><div><figcaption><span><i></i> On a wheel-on turbo trainer, your rear tyre can wear quickly.</span></figcaption><span> <i>Dario Belingheri/Getty Images</i></span></div>\n<p>Keep your <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">drivetrain clean and lubricated</a>. Sweat may end up on your chain and you may also be putting high loads through it during high-intensity workouts.</p>\n<p>Smith also points out that you’re not coasting or freewheeling on a descent often on a turbo, so your gears are turning for longer than on a comparable-length ride – great for your fitness, but possibly leading to more wear and tear than you think.</p>\n<p>“You may see some higher-than-normal wear rates on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\">drivetrain</a>, so check <a href=\"https://www.bikeradar.com/advice/workshop/how-to-know-when-its-time-to-replace-your-bicycle-chain/#:~:text=The%20chain%20and%20cassette%20should,can%20differ%20from%20the%20above.\">chains and cassettes for wear</a>,” he says.</p>\n<p>And if you’re using a wheel-on trainer, rather than a direct-drive smart trainer, fit a turbo trainer tyre at the rear. Turbo-specific tyres are made from a tougher compound capable of standing up to more wear and tear.</p>\n<p>“Otherwise, your nice new fast rubber will be a squared-off mess with a polished surface in no time,” he says. “That outdoor ride you’ve been training for could be a disappointment as the rear wheel slips from under you on every corner or you puncture more easily.”</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d5c6a8fe49097a2dc186840ac6a1e2bee6bd4ba22d9e16e556b8a93d4615f7dc","category":"Cycling"}