{"title":"iOS 17.2 is worth installing now for the quality-of-life improvements alone","link":"https://www.macworld.com/article/2164433/ios-17-2-features-little-improvements.html","date":1702377000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The big headline feature of iOS 17.2, which arrived Monday, is the new Journal app, which provides a safe and encrypted means of writing about the events in your daily life. It uses on-device processing to suggest locations, events, photos, music, and more to round out your entries. It also includes a new Journaling Suggestions API that lets developers add “personalized journaling suggestions” to third-party journaling apps.</p>\n\n\n\n<p>But if you’re not excited about journaling, you’ll still want to grab iOS 17.2 right away. There aren’t any other really huge new features, but rather many small quality-of-life improvements spread throughout common apps and services.</p>\n\n\n\n<p>Take <strong>Weather</strong>, for instance. Weather’s easily one of the most popular home-screen widgets, but you don’t have a lot of options. With iOS 17.2 you get several more good options such as next-hour precipitation, daily forecast, current conditions, and sunrise/sunset times. There’s also a nice new wind map and moon calendar, in addition to seeing actual precipitation amounts (not just percent chance) for any day in the 10-day forecast.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 17.2 Weather wind\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?quality=50&amp;strip=all 4149w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?resize=300%2C210&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?resize=768%2C538&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?resize=1200%2C841&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?resize=1536%2C1077&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-wind.jpg?resize=2048%2C1436&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"841\" /></figure><p>Foundry</p></div>\n\n\n\n<p><strong>Apple Music</strong> <a href=\"https://www.macworld.com/article/2164226/apple-music-wont-get-collaborative-playlists-until-next-year.html\">didn’t get its planned collaborative playlists yet</a>, but that doesn’t mean it didn’t get some nice additions. Instead of “liking” songs, you now “favorite” them. There’s a new Favorites playlist that includes all the songs you’ve marked as a favorite, too. And if you like to listen to music to fall asleep or study or whatever, but are tired of all those very purpose-driven tracks messing up your suggestions and history, Apple has added a Focus Filter for Apple Music that lets you turn off the music history while in that Focus mode.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 17.2 Music Focus\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?quality=50&amp;strip=all 4149w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?resize=300%2C210&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?resize=768%2C538&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?resize=1200%2C841&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?resize=1536%2C1077&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-music-focus.jpg?resize=2048%2C1436&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"841\" /><figcaption>In iOS 17.2, you can add a filter to your Focus modes to prevent them from impacting your Apple Music history.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Are you tired of entering your weight, blood pressure, body fat, or whatever else you track into the Health app every day? You don’t want to buy some fancy expensive connected scale (with yet another app and poor battery life) so every day you open <strong>Health</strong>, then tap <em>Browse</em>, then <em>Body Measurements</em> or <em>Cycle Tracking</em>, then a category, then <em>Add Data</em>…  well that whole song-and-dance goes away in iOS 17.2. Now you can just tell Siri. You can even use your Apple Watch to do it when you update to watchOS 10.2. You can log your weight, menstruation cycle, body temp, body fat, blood sugar, blood pressure, and more. And you can ask Siri for data from the Health app too, which is a lot faster than looking it up.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 17.2 Siri Health itegration\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?quality=50&amp;strip=all 4149w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?resize=300%2C210&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?resize=768%2C538&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?resize=1200%2C841&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?resize=1536%2C1077&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/12/ios-17-2-siri-health.jpg?resize=2048%2C1436&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"841\" /><figcaption>You can add, and ask for, Health data using Siri in iOS 17.2.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Ever wonder why Apple’s <strong>Clock</strong> widgets are all analog? So did we! And apparently so did everyone else, because Apple has now, for the first time ever (somehow), added a digital clock widget in iOS 17.2.</p>\n\n\n\n<p>The <strong>Action button</strong> is a handy feature of iPhone 15 Pro, and now you can set it to Translate, where your iPhone will listen and auto-detect a spoken language, translating it to English (or your system’s default).</p>\n\n\n\n<p>Speaking of the iPhone 15 Pro (and Pro Max), <strong>autofocus</strong> now works faster when you’re focusing on a small faraway object using the telephoto camera.</p>\n\n\n\n<p>The new <strong>Messages</strong> interface in iOS 17 is somewhat controversial, to say the least. Apple hid all the iMessage functions behind a fly-up menu next to the text entry box, which frees up space but takes some getting used to. (Pro tip: You can drag items in the Messages menu to reorder them!) The new menu isn’t going anywhere, but iOS 17.2 does add some nice new features to simplify things, including an arrow in the upper-right to jump back your first unread message in a thread, body shapes and poses on Memoji, and the ability to add a sticker as a reaction.</p>\n\n\n\n<p>Oh, and you can now <strong>AirDrop</strong> things like movie tickets, boarding passes, and other tickets/passes. It works with the “hold the tops of your iPhones together” feature introduced in iOS 17.</p>\n\n\n\n<p>In recent years, it’s been clear that the latest iOS version starts to shine after the dot-two release, and iOS 17.2 is no exception. Apple is definitely not done—we’ll get new releases with significant features well into next year—but iOS 17 is finally starting to feel really polished.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d5d2abe67c42b0a7e54615556b2676239e2fbd740ee333b20e6d157b632e1b26","category":"Apple"}