{"title":"Quantum Effects on Cosmic Scales as an Alternative to Dark Matter and Dark Energy","link":"https://www.preprints.org/manuscript/202407.1065/v1","date":1720784593000,"content":"The spin-torsion theory is a gauge theory approach to gravity that expands upon Einstein's general relativity (GR) by incorporating the spin of microparticles. In this study, we further develop the spin-torsion theory to examine spherically symmetric and static gravitational systems that involve free-falling macroscopic particles. We posit that the quantum spin of macroscopic matter becomes noteworthy on cosmic scales. We further assume that the Dirac spinor and Dirac equation adequately capture all essential physical characteristics of the particles and their associated processes. A crucial aspect of our approach involves substituting the constant mass in the Dirac equation with a scale function, allowing us to establish a connection between quantum effects and the scale of gravitational systems. This mechanism ensures that the quantum effect of macroscopic matter is scale-dependent and diminishes locally, a phenomenon not observed in microparticles. For any given matter density distribution, our theory predicts an additional quantum term, the quantum potential energy (QPE), within the mass expression. QPE induces time dilation, distance contraction, and thus mimics a gravitational well.  When applied to cosmology, our theory yields a static cosmological model. The QPE serves as a counterpart to the cosmological constant introduced by Einstein to balance gravity in his static cosmological model. The QPE also offers a plausible explanation for the origin of the Hubble redshift (traditionally attributed to the universe's expansion). The predicted luminosity distance-redshift relation aligns remarkably well with SNe Ia data from the cosmological sample of SNe Ia.  In the context of galaxies, QPE functions as the equivalent of dark matter. The predicted circular velocities align well with the rotation curve data from the SPARC (Spitzer Photometry and Accurate Rotation Curves database) sample.  Importantly, our conclusions in this paper are reached through a conventional approach, with the sole assumption of the quantum effects of macroscopic matter on large scales, without the need for additional modifications or assumptions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5d2e68ae12c8321298ac6278fbd0aa0d3f22c4c12e3df0b354f67f9dfb3a63d","category":"Interdisciplinary"}