{"title":"Carbon and carbon-13 in the preindustrial and glacial ocean","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000434","date":1720447200000,"content":"<p>by Andreas Schmittner, Nathaniel J. Fillman</p>\r\n\r\nDespite their importance for Earth’s climate and paleoceanography, the cycles of carbon (C) and its isotope <sup>13</sup>C in the ocean are not well understood. Models typically do not decompose C and <sup>13</sup>C storage caused by different physical, biological, and chemical processes, which makes interpreting results difficult. Consequently, basic observed features, such as the decreased carbon isotopic signature (δ<sup>13</sup>C<sub>DIC</sub>) of the glacial ocean remain unexplained. Here, we review recent progress in decomposing Dissolved Inorganic Carbon (DIC) into preformed and regenerated components, extend a precise and complete decomposition to δ<sup>13</sup>C<sub>DIC</sub>, and apply it to data-constrained model simulations of the Preindustrial (PI) and Last Glacial Maximum (LGM) oceans. Regenerated components, from respired soft-tissue organic matter and dissolved biogenic calcium carbonate, are reduced in the LGM, indicating a decrease in the active part of the biological pump. Preformed components increase carbon storage and decrease δ<sup>13</sup>C<sub>DIC</sub> by 0.55 ‰ in the LGM. We separate preformed into saturation and disequilibrium components, each of which have biological and physical contributions. Whereas the physical disequilibrium in the PI is negative for both DIC and δ<sup>13</sup>C<sub>DIC</sub>, and changes little between climate states, the biological disequilibrium is positive for DIC but negative for δ<sup>13</sup>C<sub>DIC</sub>, a pattern that is magnified in the LGM. The biological disequilibrium is the dominant driver of the increase in glacial ocean C and the decrease in δ<sup>13</sup>C<sub>DIC</sub>, indicating a reduced sink of biological carbon. Overall, in the LGM, biological processes increase the ocean’s DIC inventory by 355 Pg more than in the PI, reduce its mean δ<sup>13</sup>C<sub>DIC</sub> by an additional 0.52 ‰, and contribute 60 ppm to the lowering of atmospheric CO<sub>2</sub>. Spatial distributions of the δ<sup>13</sup>C<sub>DIC</sub> components are presented. Commonly used approximations based on apparent oxygen utilization and phosphate are evaluated and shown to have large errors.","author":"Andreas Schmittner","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"d5d8352f74491a2503774ce237895304e0280c12ea1d26bd0da128ea4c73d920","category":"Environment"}