{"title":"Everything You Can Do With the Double Tap Gesture on Apple Watch","link":"https://www.macrumors.com/2023/10/25/watchos-10-1-double-tap-gesture/","date":1698263182000,"content":"With the <a href=\"https://www.macrumors.com/2023/10/25/apple-releases-watchos-10-1/\">watchOS 10.1 update</a> that came out today, Apple has added Double Tap to the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a> and <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra 2</a> devices. Double Tap was announced when the new models were introduced, but it took some time for Apple to implement it. With Double Tap, you can activate some Apple Watch functions with just one hand.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Apple-Watch-Ultra-2-double-tap-gesture-230912-Faeture-Blue.jpg\" width=\"1960\" height=\"1102\" />\r<br />\nUsing Double Tap requires you to tap your thumb and index finger together twice, and when you do this, you'll see a little icon on the Apple Watch to let you know that the tap was recognized. Double Tap uses the sensors in the Apple Watch to detect minute movements and blood flow when the fingers are positioned in a certain way. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/apple-watch-ultra-double-tap-feature-green.jpg\" width=\"2210\" height=\"1243\" />\r<br />\nThere are a number of things you can do with Double Tap, and Apple has made it work with some of the most common actions that you might need to perform with one hand.\r<br />\n<ul>\r<br />\n \t<li>Open the Smart Stack from the watch face, and then Double Tap again to scroll through widgets.</li>\r<br />\n \t<li>Answer phone or <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> calls.</li>\r<br />\n \t<li>Hang up phone or ‌FaceTime‌ calls.</li>\r<br />\n \t<li>When you get an iMessage, Double Tap to view it, and then Double Tap again if you need to scroll.</li>\r<br />\n \t<li>Reply to a Message using dictation and then send it with Double Tap.</li>\r<br />\n \t<li>Act on notifications - Apple says a Double Tap on an incoming notification will activate the primary action, such as snoozing a reminder or replying to a message.</li>\r<br />\n \t<li>Pause, resume, and end a timer.</li>\r<br />\n \t<li>Stop and resume the stopwatch.</li>\r<br />\n \t<li>Snooze an alarm.</li>\r<br />\n \t<li>Play and pause music, podcasts, or audiobooks (or skip a track, depending on settings).</li>\r<br />\n \t<li>Change to the Elevation view in the Compass app.</li>\r<br />\n \t<li>Start or stop automatic Workout reminders when a workout is detected.</li>\r<br />\n<li>Take a photo with the Camera Remote.</li>\r<br />\n<li>Record a voice memo in the Voice Memo app.</li>\r<br />\n<li>Change Flashlight modes.</li>\r<br />\n</ul>\r<br />\nIn the Apple Watch app under Gestures, you can opt to change the playback option from play/pause to skip, and the Smart Stack option from Advance (swaps through the widgets) to Select (opens a widget's associated app).\r<br />\n\r<br />\nWhile Double Tap can be used with third-party apps through incoming notifications, there is no Double Tap API for third-party apps at the current time. Developers can still customize their apps for Double Tap to an extent by assigning the action that should occur when a Double Tap gesture is used on an incoming notification.\r<br />\n\r<br />\nDouble Tap is limited to the ‌Apple Watch Series 9‌ and the ‌Apple Watch Ultra 2‌ because, as Apple executives said in a <a href=\"https://www.tomsguide.com/features/apple-watch-9-how-apple-redefined-the-smartwatch\">recent interview with <em>Tom's Guide</em></a>, the S9 chip in the new models is the first that is powerful enough for the gesture system.\r<br />\n\r<br />\nTo use Double Tap, ‌Apple Watch Ultra 2‌ and ‌Apple Watch Series 9‌ owners will need to update their devices to watchOS 10.1 through the Apple Watch app on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. watchOS 10.1 requires an ‌iPhone‌ running <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> or later.\r<br />\n\r<br />\nNote that Double Tap <a href=\"https://support.apple.com/en-us/HT213942\">will not work</a> when Low Power Mode, Sleep Focus, Theater Mode, or Water Lock is activated, and you must first raise your wrist to wake the Apple Watch to perform the gesture. Double Tap also does not work on watches that are paired as a <a href=\"https://www.macrumors.com/guide/family-setup/\">Family Setup</a> watch.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-programming.135\">Apple Programming</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/25/watchos-10-1-double-tap-gesture/\">Everything You Can Do With the Double Tap Gesture on Apple Watch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/everything-you-can-do-with-the-double-tap-gesture-on-apple-watch.2408671/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d5dfeadb935f29853b54c3a89e1a6856ddf325c12881dc15cda58c94c433c2b6","category":"Apple"}