{"title":"Assessment of Attitudes towards Respiratory Syncytial Virus Vaccination: Internet Survey Results on Awareness and Acceptance among Pregnant Women in Poland","link":"https://www.preprints.org/manuscript/202410.0510/v1","date":1728364253000,"content":"Background/Objectives: Respiratory syncytial virus (RSV) is a major cause of severe lower res-piratory tract infections in infants, particularly in vulnerable populations such as preterm new-borns and those with underlying health conditions. The approval of the RSVpreF vaccine for pregnant individuals offers a new strategy to reduce the burden of RSV-associated illness in newborns. The aim of this study was to assess RSV vaccination coverage among pregnant wom-en, identify factors contributing to vaccination hesitancy, and evaluate the knowledge of the bene-fits of vaccination among patients in Poland. Methods: The study was conducted on 668 re-spondents from Poland. The study utilized an original, anonymous questionnaire consisting of 23 questions, which was distributed via social media platforms from July 25 to August 1, 2024. Par-ticipants, including women who had recently given birth or were about to, were recruited through Facebook groups and Instagram. Results: We confirmed that responders with medical back-grounds had statistically greater knowledge about RSV than non-medical individuals. Addi-tionally, indivudals with medical medical backgrounds were more likely to receive the RSV vac-cination during pregnancy, as were patients who obtained vaccination information directly from their physician. Furthermore, a key finding was that patients who had previously received vac-cinations for other diseases, such as influenza and pertussis, were more likely to opt for RSV vac-cination. Conclusions: Vaccination against RSV during pregnancy is a crucial method for safe-guarding newborns from infection and its severe complications. Awareness of RSV and vaccina-tion rates among pregnant women remains low, necessitating educational initiatives and public health campaigns to improve coverage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5e5617a083def90eb6c7e890974cd9c41ffcf9b4884dd5193e2ce6bbae6e17b","category":"Interdisciplinary"}