{"title":"242 Awardee Talk: Dietary supplementation of blends of organic acids and monoglycerides alleviated diarrhea and systemic inflammation of weaned pigs experimentally infected with enterotoxigenic Escherichia coli F18","link":"https://academic.oup.com/jas/article/102/Supplement_3/231/7757411?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study aimed to investigate the effects of dietary supplementation of organic acids, monoglycerides, and combination of both on growth performance, diarrhea, and immune responses of weaned pigs experimentally infected with a pathogenic <span>Escherichia coli</span> (<span>E. coli</span>) F18. Pigs (n = 40; body weight = 7.81 ± 0.84 kg) were individually housed and randomly assigned to one of four treatment groups (10 replicates/treatment): basal diet (control), basal diet supplemented with organic acids blend (formic acid, lactic acid, and sodium formate) at 0.3%, monoglycerides blend at 0.3%, or combination of both the organic acids blend at 0.2% and the monoglycerides blend at 0.2%. The experiment lasted 28 d, with 7 d before and 21 d after the first inoculation (d 0). All pigs were orally inoculated with <span>E. coli</span> F18 (10<sup>10</sup> CFU/3 mL) for 3 consecutive days from d 0. Growth performance was measured weekly and daily fecal score was recorded throughout the experiment. Fecal samples were collected on d 0, 2, 5, 7, 10, 14, and 21 post-inoculation (PI) to confirm the presence of β-hemolytic coliforms in the feces. Whole blood samples were collected on d 0, 5, and 14 PI to perform complete blood count analysis. Porcine Cytokine/Chemokine13-Plex Discovery Assay (Eve Technology, Canada) was also conducted with serum samples from d 0, 5, and 14 PI. All data were analyzed by ANOVA using the PROC MIXED of SAS with a pig as the experimental unit. The frequency of diarrhea was calculated and analyzed by Chi-square test. Supplementation of organic acids, monoglycerides, or the combination of both significantly reduced (<span>P</span> &lt; 0.05) the frequency of diarrhea (25.5 to 29.8%) compared with control (39.3%). <span>E. coli</span> F18 infection increased (<span>P</span> &lt; 0.05) counts of total white blood cells, neutrophils, and lymphocytes on d 5 and 14 PI, compared with d 0. Supplementation of the combination of organic acids and monoglycerides reduced (<span>P</span> &lt; 0.05) the counts of total white blood cells, lymphocytes, and the ratio of neutrophils to lymphocytes, and tended (<span>P</span> &lt; 0.10) to reduce neutrophil count on d 5 PI, compared with control. Pigs fed with monoglycerides had greater (<span>P</span> &lt; 0.05) neutrophil counts than pigs in the control group on d 14 PI. Pigs fed with monoglycerides tended (<span>P</span> &lt; 0.10) to have decreased serum granulocyte-macrophage colony-stimulating factor (GM-CSF), interleukin-1 alpha (IL-1α), and tumor necrosis factor (TNF) -alpha concentrations on d 0, 5, or 14 PI compared with control. However, supplementation of organic acids, monoglycerides, or the combination of both had limited impacts on growth performance throughout the experiment. In conclusion, dietary supplementation of organic acids, monoglycerides, and the combination of both may alleviate diarrhea or systemic inflammation of weaned pigs during <span>E. coli</span> F18 infection by modulating related cytokines.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d5e6a9be5f61dda7eb25043dc9950ed42f9b48212f20875806bcc017e645aa2a","category":"Environment"}