{"title":"The best Mario games ever made","link":"https://arstechnica.com/?p=1814258","date":1637758836000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1229470434-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1229470434.jpg\">Enlarge</a> <span>/</span> Mario loves us. We love Mario. (credit: BEHROUZ MEHRI / Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ars Technica Editor-in-Chief Ken Fisher has a rule: If you have a dumb, fun conversation in the Ars Slack that lasts for more than 10 minutes, it's <em>probably</em> worth turning that conversation into some kind of article. And that's how a weekday water-cooler-style discussion about <a href=\"https://en.wikipedia.org/wiki/Platonic_idealism\" target=\"_blank\">Platonic idealism</a> and Mario became what you're reading now!</p>\n<p>For people of a certain age—which, dear readers, most of us are—\"video games\" and \"Nintendo\" meant practically the same thing. (There are even a few of us who are <em>older</em> than a certain age, who came from the Great Long Long Ago time when \"video games\" meant \"Atari,\" and even those few acknowledge Nintendo's culture-changing dominance in the mid-to-late 1980s.) So all of us have played at least a few different games featuring the world's most famous plumber, Mario Mario. (Yeah, his last name is also <a href=\"https://nintendoeverything.com/miyamoto-says-marios-full-name-is-mario-mario/\" target=\"_blank\">Mario</a>. Which means his brother's name is Luigi Mario. Which means that calling Luigi \"Green Mario\" is actually correct! <a href=\"https://www.youtube.com/watch?v=xSTN3mHEAOA\" target=\"_blank\">Vindication</a>!)</p>\n<p>A few Ars staffers volunteered to brave the inevitable slings and arrows of the comments section to put down their thoughts on a simple question: out of every video game in which Mario made an appearance, which one is your absolute top-shelf favorite, and why?</p></div><p><a href=\"https://arstechnica.com/?p=1814258#p3\">Read 44 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814258&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d5e9776003512c3a340a6dae57a7287aa3c128de3813fb323a65b41321559eff","category":"Tech"}