{"title":"เจาะลึกคุณสมบัติเชิงเทคนิค 5G จาก AIS ติดปีกอุตสากรรมไทยสู่ Smart Manufacturing","link":"https://www.blognone.com/node/123201","date":1623895200000,"content":"<div><div><div><p>AIS Business จัดงาน AIS Business Digital Future 2021 - Your Trusted Smart Digital Partner งานสัมมนาออนไลน์ครั้งใหญ่ประจำปี พูดคุยเทรนด์เทคโนโลยีที่จำเป็นในภาคอุตสาหกรรม บทความที่แล้ว Blognone ได้สรุปส่วนหนึ่งจากงานสัมมนาในหัวข้อ <a href=\"https://www.blognone.com/node/123003\">5G กับการเตรียมความพร้อมอุตสาหกรรมสู่ Smart Manufacturing 4.0</a></p>\n<p>อีกหัวข้อยังคงเน้นเรื่อง 5G ในหัวข้อ Is 5G Ready for Smart Manufacturing: How does 5G Transform the Factory Automation มาเจาะรายละเอียดเพิ่มเติมว่า 5G มีส่วนช่วยพัฒนาอุตสาหกรรมในด้านใดบ้าง และยกกรณีตัวอย่างเครือข่าย 5G ของ AIS ที่ใช้งานจริงแล้วในโรงงานไทยอย่าง Bosch, SNC Former</p>\n<p>ผู้เข้าร่วมบรรยายในหัวข้อนี้คือ กรรณิกา ตันติการุณย์ ผู้เชี่ยวชาญด้านการพัฒนาระบบสำหรับธุรกิจองค์กร AIS และ จรัญ สินสวัสดิ์มงคล ผู้จัดการฝ่ายพัฒนาโครงข่ายอนาคต AIS</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/207645c8a24ea78d53a2b366bb96fbb2.jpeg\" /></p>\n<h3>5G กับการเพิ่มโอกาสทางธุรกิจมูลค่าสูง 475 ล้านเหรียญภายในปี 2025</h3>\n<p>คุณกรรณิกา ให้ภาพรวมเกี่ยวกับเครือข่าย 5G มาพร้อมความสามารถในการเชื่อมต่ออุปกรณ์, เซนเซอร์ และโรบอทในโรงงานทีละมากๆ ได้ในคราวเดียวกัน ช่วยเพิ่มประสิทธิภาพการผลิต ลดดาวน์ไทม์ในโรงงาน ยกตัวอย่างการใช้งานที่เป็นไปได้คือ Mobile Robots, AGV (Automated Guided Vehicle), AMR (Autonomous Mobile Robot), Predictive Maintenance, Asset Tracking, Augmented Reality และ Connected Product ซึ่งจะช่วยลดค่าใช้จ่ายในการดำเนินการ และเพิ่มประสิทธิภาพให้กับการผลิตด้วย</p>\n<p>จากชาร์ตข้างล่างจะเห็นได้ว่า เครือข่าย 5G จะช่วยปรับปรุงเส้นทางการผลิตในระบบ automation เปิดทางสู่การพัฒนา collaborative robots หรือการทำงานร่วมกันระหว่างหุ่นยนต์ในโรงงาน การควบคุมหุ่นยนต์ผ่านคลาวด์ เป็นต้น รายงานของ Author D. Little บริษัทที่ปรึกษาแก่ธุรกิจคาดว่า 5G จะสร้างโอกาสทางธุรกิจสำหรับองค์กรทั่วโลกได้มากถึง 475 ล้านเหรียญภายในปี 2025</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fa4ec4c0a0f2916b80817a99ff3d01be.png\" /></p>\n<p>ในประเทศไทย 5G จะเริ่มมีบทบาทอย่างยิ่งสำหรับกลุ่มธุรกิจต่างๆ โดยเฉพาะอุตสาหกรรมการผลิต (manufacturing) รายงานของ Author D. Little  พบกรณีศึกษาการใช้งาน 5G ในอุตสาหกรรมการผลิต 49% กลุ่มธุรกิจค้าปลีก (retail) 20% และการขนส่ง (transport &amp; logistics) 10%<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/3aadb3fec7d6f68f263e7023859f2c1c.png\" /></p>\n<p>\"สำหรับการทำ Smart Manufacturing 4.0 การตั้งเป้าหมายการทดสอบโซลูชันเพื่อขยายผล (proof of scale) แทนการทดสอบการใช้งาน (proof of concept) จะทำให้ได้ผลลัพท์ที่ใช้งานจริงได้แบบเป็นรูปธรรม\" คุณกรรณิกากล่าว</p>\n<h3>คุณสมบัติ 5G นำธุรกิจก้าวสู่ยุค Smart Manufacturing</h3>\n<p>ด้านคุณจรัญ ผู้ดูแลเชิงเทคนิคเรื่องเครือข่าย 5G โดยเฉพาะ มาเล่ารายละเอียดเจาะลึกเชิงเทคนิค ว่าในแง่การใช้งานจริงนั้น 5G มีคุณสมบัติที่เหมาะกับอุตสาหกรรมการผลิตอย่างไรบ้าง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/43954af47069079daeb16fef400a1687.png\" /></p>\n<ul>\n<li><strong>High Speed</strong> การรับส่งข้อมูลอย่างรวดเร็ว แลกเปลี่ยนข้อมูลปริมาณมากได้ถึงระดับ 20 Gbps ต่อยอดสู่ fixed wireless access เครือข่ายอินเทอร์เน็ตความเร็วสูงในองค์กร ช่วยให้การส่งข้อมูลข้ามกันไปมาในองค์กรทำได้เร็วเพราะมีแบนด์วิธกว้างขึ้น นอกจากนี้ยังต่อยอดสู่ video analytic ได้ด้วย</li>\n<li><strong>Very Fast Response</strong> ตอบสนองต่อการควบคุมที่มี latency ต่ำระดับต่ำกว่า 10 millisecond นับว่าเร็วขึ้น ทำให้เป็นไปได้ที่จะใช้งานรูปแบบใหม่ๆ เช่นการควบคุมรถยนต์อัตโนมัติ, การควบคุมพาหนะในโรงงานด้วยรีโมทคอนโทรลได้ทีละหลายตัว และ collaborative robots เป็นต้น</li>\n<li><strong>Coverage &amp; Mobility</strong> สามารถออกแบบพื้นที่ครอบคลุมได้ตามความเหมาะสมขึ้นอยู่กับพื้นที่โรงงาน ครอบคลุมระดับกิโลเมตร ซึ่งมีประสิทธิภาพสูงกว่า Wi-Fi นอกจากนี้ยังรองรับการเคลื่อนที่ไปมาของอุปกรณ์ รองรับการเปลี่ยนตำแหน่งของอุปกรณ์ในสายการผลิตได้เร็ว ไม่มีปัญหา connection drop ระหว่างเคลื่อนย้าย</li>\n<li><strong>Network Slicing</strong> การจัดสรรแบนด์วิธให้เหมาะสมกับแต่ละแอปพลิเคชันที่ต้องการใช้งาน ถือเป็นคุณสมบัติเฉพาะที่มีอยู่ใน 5G เท่านั้น โดย AIS ก็จะมาทำหน้าที่บริหารเครือข่ายให้แตกต่างตามแต่ละพื้นที่ได้</li>\n<li><strong>Edge Computing</strong> คือการดึงการประมวลผลจากคลาวด์มาอยู่ใกล้ๆ กับอุปกรณ์ โดยสามารถติดตั้งในเครือข่าย 5G ตามพื้นที่ที่ต้องการใช้งาน เพื่อความตอบสนองของแอปพลิเคชันที่เร็วขึ้น ข้อมูลไม่ต้องเดินทางไปไกล</li>\n<li><strong>Private 5G Network</strong> คือ การออบแบบเครือข่ายพิเศษเฉพาะสำหรับการใช้งานของอุตสาหกรรม เพิ่มความเสถียร และเพิ่มความปลอดภัยของข้อมูลสร้างความมั่นใจแก่คู่ค้า</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/20cb3be0127eb139da665adb42ae505b.png\" /></p>\n<p>\"เทคโนโลยี 5G ถูกออกแบบจาก outside in คือ ทำอย่างไรให้มีเครือข่ายที่รองรับความต้องการจากทุกภาคส่วนในอุตสาหกรรมได้ การมี Network Slicing จะทำให้มั่นใจได้ว่าทราฟฟิกหรือข้อมูลที่ส่งได้รับการบริหารจัดการที่ดีที่สุดบนเครือข่าย 5G\" คุณจรัญกล่าว</p>\n<h3>เครือข่าย 5G จาก AIS ครอบคลุม 77 จังหวัดทั่วไทย</h3>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ef60efc2f7570e72d25d8c93d2debab9.png\" /></p>\n<p>AIS ได้เข้าไปร่วมพัฒนาและให้บริการ 5G สำหรับโซลูชัน Smart Manufacturing กับโรงงานอุตสาหกรรมในประเทศไทยแล้วหลายแห่ง อาทิ Bosch, SNC Former โดยมีทีมผู้เชี่ยวชาญและความพร้อมด้านเครือข่าย 5G ทั้งแบบ SA (Stand Alone) และ NSA (Non-Standalone) ที่ตอบโจทย์สำหรับอุตสาหกรรม ครอบคลุมแล้วทั้ง 77 จังหวัดทั่วประเทศ</p>\n<p>สนใจบริการจาก AIS Business ติดต่อเจ้าหน้าที่ที่ดูแลท่าน หรือคลิก <a href=\"https://business.ais.co.th/\">Ais Business</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/manufacturing\">Manufacturing</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d5eb7a835e2a8410af6e5cf5dec7eb521a9a420ae69348e769f570b24297a03f","category":"Thai"}