{"title":"Anthropogenic Impacts on the Marine Environment: An Empirical Study from China","link":"https://www.preprints.org/manuscript/202403.0800/v2","date":1714636879000,"content":"Marine industries are dependent on the ocean and often have a direct impact on the marine environment. Although previous studies have talked about pollution from marine industries, it is not known to what extent and to what extent these behaviors affect the ocean. Therefore, this study examines the impacts of major marine industries on the marine environment, using China as an example. The Ministry of Ecology and Environment of the People's Republic of China categorizes the quality of seawater into Class I, Class II, Class III, Class IV, and Inferior Class IV in descending order according to the quality from good to poor. In this study, water quality of Class I and Class II are defined as good quality seawater, Class III as average quality, Class IV and Class IV as poor quality, and the proportion of the area of seawater with different water quality to the total area of the sea area symbolizes the overall quality of the marine environment. We use panel data from 11 provinces and cities along the coast of mainland China from 2006 to 2020, estimated by the full feasible generalized least squares (FGLS) method, to study the impacts of the development of coastal tourism, marine transportation, marine shipbuilding, marine salt, mariculture, and marine fishing on the marine environment. The empirical results show that, in descending order of the degree of influence, the marine industries that cause a decrease in the area of good quality seawater are coastal tourism, mariculture and shipbuilding, and the marine industries that cause an increase in the area of poor quality seawater are marine transportation and shipbuilding, while the marine salt industry has no obvious influence on the marine environment, and the development of the marine fishing industry indirectly contributes to the improvement of the marine environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5f5d243ae7c40f803a6222e5ee1738ea2ff4471969bf475f35d4bbb7770dd52","category":"Interdisciplinary"}