{"title":"Bring on the rain: weatherproof jackets explained","link":"https://www.cyclist.co.uk/in-depth/9645/bring-on-the-rain-weatherproof-jackets-explained","date":1621608256000,"content":"<span>\n      <span><a href=\"/authors/sam-challis\">Sam Challis</a></span>\n  </span><div>  \n  <div>      <div><span>24 May 2021</span></div>    </div></div><p>\nThe latest waterproof, breathable fabrics mean there’s more than one way to stay dry on a bike</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/05/gore_c5_gore-tex_shakedry_1985.jpg?itok=8rrMMAQv\" />  </div>\n<div>\n      <p> <strong>Pictured above: Gore C5 Gore-tex Shadedry 1985, </strong>£250, <a href=\"https://www.ultimateoutdoors.com/050971/gore-men-s-c5-gore-tex-shakedry-1985-jacket-050971/\" target=\"_blank\">buy now from Ultimate Outdoors</a></p>\n<p><strong>Photography</strong>: Rob Milton</p>\n<p>Go back to the beginning of the 1800s and the closest thing you could get to a waterproof jacket was made of oiled cotton, which was not only heavy and uncomfortable but smelled pretty terrible too.</p>\n<p>Later on, rubberised waterproof garments such as the Mackintosh appeared – equally smelly – and were in turn followed by oilskins, waxed jackets and eventually PU-coated nylon jackets. They all had their drawbacks: some were heavy, some were flappy, some made the wearer wetter from sweat than the rain would have made them.</p>\n<p>It wasn’t until the 1970s that the first truly breathable, waterproof jackets arrived when WL Gore came up with Gore-Tex, which employed a patented membrane that allowed water vapour to escape whilst repelling water droplets. Since then Gore-Tex has become the byword for breathable waterproofs, but it’s not the only game in town. </p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 114: on sale now!</a></div>    </div></div><h3>Standards to meet</h3>\n<p>Lab testing protocols are the common benchmarks that define the respective performances of these fabrics. Water resistance is measured by the amount of water in millimetres that can be suspended above the fabric before the pressure causes it to start seeping through. Breathability is quantified by the rate at which water vapour passes through one square metre of a fabric in 24 hours, measured in grams.</p>\n<p>For some context, typical mid-range fabrics usually boast around 5,000mm of water resistance and 5,000g of breathability. Real-world performance is impossible to equate to these figures, so knowing the exact values isn’t important. In general, though, the higher these values are, the better the garment is likely to perform.</p>\n<p>Pearl Izumi’s approach to weatherproof rainwear centres around its PI Dry technology. ‘For any waterproof jacket to perform best it’s important that the face fabric doesn’t absorb water, so that water vapour can continue to pass through it,’ says Andrew Hammond, global brand manager at Pearl Izumi.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/05/assos_equipe_rs_schlosshund.jpg\" />  </div>\n</div>\n<p><strong>Assos Equipe RS Schlosshund Evo, </strong>£290, <a href=\"https://www.alpinetrek.co.uk/assos-equipe-rs-schlosshund-rain-jacket-evo-cycling-jacket/\" target=\"_blank\">buy now from Alpinetrek</a><a href=\"http://www.assos.com\" target=\"_blank\"> </a></p>\n<p>‘Durable Water Repellent [DWR] finishes can be used to keep water in droplet form to prevent absorption into the face fabric but they eventually wear off. PI Dry is sometimes called a “PWR” by our team, because it is permanent and lasts the entire life of the garment.’</p>\n<p>Hammond says this is achieved by applying an environmentally friendly coating to each individual fibre in a fabric bath.</p>\n<p>‘Not only does this mean that fabrics will not absorb water, it also helps maintain the technical yarn structure so wicking performance and fabric feel aren’t compromised.’</p>\n<p><a href=\"http://www.dennismags.co.uk/cyclist\"><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/clickable_subs_promo.jpg\" /></a></p>\n<p>This means the technology can be applied just as easily to garments such as bibtights to produce protective kit that, once you’re wearing it, doesn’t feel any different to regular gear.</p>\n<p>Meanwhile SchlossTex fabric from Assos concentrates on breathability and stretchability, which means that the company’s waterproof jackets shed water while fitting snugly and keeping the rider well ventilated.</p>\n<p>‘The fabric is designed to absorb sweat and pull it out of the garment,’ says Assos textiles officer Claudio Lanfranconi. ‘The inner lining transfers the humidity to the more hydrophilic membrane that draws the sweat and pulls it to the external fabric. As that’s in direct contact with air it helps to dry and release the humidity faster.’</p>\n<p>It is this design that Assos credits with helping its Equipe RS Schlosshund Evo rain jacket achieve a breathability rating of 27,000g.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/05/pearl_izumi_torrent_wxb.jpg\" />  </div>\n</div>\n<p><strong>Pearl Izumi Torrent WXB, </strong>£174.99, <a href=\"https://www.freewheel.co.uk/pearl-izumi-men-s-torrent-wxb-jacket-varn125\" target=\"_blank\">buy now from Freewheel</a><a href=\"http://www.freewheel.co.uk\" target=\"_blank\"> </a></p>\n<h3>Head poncho</h3>\n<p>Of course, Gore hasn’t been resting on its laurels for the past half-century. Its latest Shakedry technology has revolutionised rainwear by shedding the face fabric entirely. Gore says this was possible because of its unique Gore-Tex membrane, which is apparently durable enough to be exposed.</p>\n<p>‘One square inch of the Gore-Tex membrane has nine billion pores and each of these tiny holes is 20,000 times smaller than a water droplet. This means water can’t get in but sweat can get out,’ says Gore’s fabric specialist, Tobi Pickart. ‘With no face fabric our jackets can be lighter and more packable as well as permanently waterproof and highly breathable.’</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 114: on sale now!</a></div>    </div></div><p>\nShakedry doesn’t have any real performance downsides, however the cost of garments is currently very high, and the fabric is mostly only available in black, which isn’t the safest colour for cyclists riding in wet, gloomy weather.</p>\n<p>Fortunately it does seem that this will change in the near future: ‘We’re able to digitally print onto the Shakedry fabric now so colour can be added to it,’ says Pickart.</p>\n<p>If the price can come down too then we’ll see the latest and arguably greatest waterproof fabric available to the masses. But as Pearl Izumi and Assos show, it’s far from the modern-day cyclist’s only option for pedalling comfortably in wet weather. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/jackets\">Jackets</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d5f58b5e9b30383d30559afc8634aa27d7588f07dfacedb4a3a9ed34c33bc588","category":"Cycling"}