{"title":"Wearable Biosensor Technology in Education: A Systematic Review","link":"https://www.preprints.org/manuscript/202403.0831/v1","date":1710399258000,"content":"Wearable Biosensor Technology (WBT) has emerged as a transformative tool in the educational system over the past decade. This systematic review encompasses a comprehensive analysis of WBT utilization in educational settings over a 10-year span (2012-2022), highlighting both the evolution of this field and its integration to address challenges in education by integrating technology to solve specific educational challenges, such as enhancing student engagement, monitoring stress and cognitive load, improving learning experiences, and providing real-time feedback for both students and educators. By exploring these aspects, the review sheds light on the potential implications of WBT for the future of learning. A rigorous and systematic search of major academic databases, including Google Scholar and Scopus, was conducted in accordance with PRISMA guidelines. Relevant studies were selected based on predefined inclusion and exclusion criteria. The articles selected were assessed for methodological quality and bias using established tools. The process of data extraction and synthesis followed a structured framework. Key findings include the shift from theoretical exploration to practical implementation with the EEG being the predominant measurement, aiming to explore mental states, physiological constructs, and teaching effectiveness. Wearable biosensors are significantly impacting the educational field, serving as an important resource for educators and a tool for students. Their application has the potential to transform and optimize academic practices through sensors that capture biometric data, enabling the implementation of metrics and models to understand the development and performance of students and professors in an academic environment, as well as to gain insights into the learning process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d5f6a252eeeb41e79db4290c80a772cc2a93f568f98766282c9c03150e2ab3a5","category":"Interdisciplinary"}