{"title":"Phenotypic and Genomic Evaluation of ProbioGel (A Probiotic-Infused Cellulose Hydrogel) for Antimicrobial Activity","link":"https://www.preprints.org/manuscript/202409.1780/v1","date":1727161576000,"content":"Bacterial infections pose a serious threat to human health, and the overuse of antibiotics has led to the rise of multidrug-resistant bacteria. Numerous current wound dressings, which may cause skin irritation or allergies are insufficient in handling large wounds, often leading to infections. This highlights the need for better antibacterial materials. Nypa fruticans (Nipa palm), native to Southeast Asia, has long been utilized for various purposes because of its multiple benefits such as its antimicrobial properties, presence of probiotics, and high cellulose content. This study evaluates the use of cellulose hydrogel from nipa fronds, loaded with probiotics (ProbioGel), as an antimicrobial agent to prevent infections. The study involved an in-vitro assay using the Kirby-Bauer method to evaluate the gel’s antimicrobial properties against common wound pathogens. Additionally, whole genome sequencing and promoter analysis were done to identify genes supporting their biochemical properties. The results showed ProbioGel exhibited significant antimicrobial activity against Staphylococcus aureus, Escherichia coli, Staphylococcus epidermidis, and Candida albicans due to the presence of genes encoding lysozyme, carnobacteriocin B2, and fatty acid ABC transporter ATP binding in the Lacticaseibacillus paracasei BCRC-16100. This study highlighted the potential of ProbioGel as an innovative and effective antimicrobial and anti-infection agent for wound care. The discovery of genes in the probiotic strain responsible for encoding antimicrobial peptides further supports its therapeutic potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d603d51b62d0417f068d5161007834912da92eeac6401e400b7d1a2ff268e996","category":"Interdisciplinary"}