{"title":"Schistosoma mansoni infection induces hepatic metallothionein and S100 protein expression alongside metabolic dysfunction in hamsters","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae104/7623695?rss=1","date":1709769600000,"content":"<span><div>Abstract</div>Schistosomiasis, a widespread neglected tropical disease, presents a complex and multifaceted clinical-pathological profile. Using hamsters as final hosts, we dissected molecular events following <span>Schistosoma mansoni</span> infection in the liver—the organ most severely affected in schistosomiasis patients. Employing tandem mass tag–based proteomics, we studied alterations in the liver proteins in response to various infection modes and genders. We examined livers from female and male hamsters that were: noninfected (control), infected with either unisexual <span>S. mansoni</span> cercariae (single-sex) or both sexes (bisex). The infection induced up-regulation of proteins associated with immune response, cytoskeletal reorganization, and apoptotic signaling. Notably, <span>S. mansoni</span> egg deposition led to the down-regulation of liver factors linked to energy supply and metabolic processes. Gender-specific responses were observed, with male hamsters showing higher susceptibility, supported by more differentially expressed proteins than found in females. Of note, metallothionein-2 and S100a6 proteins exhibited substantial up-regulation in livers of both genders, suggesting their pivotal roles in the liver's injury response. Immunohistochemistry and real-time-qPCR confirmed strong up-regulation of metallothionein-2 expression in the cytoplasm and nucleus upon the infection. Similar findings were seen for S100a6, which localized around granulomas and portal tracts. We also observed perturbations in metabolic pathways, including down-regulation of enzymes involved in xenobiotic biotransformation, cellular energy metabolism, and lipid modulation. Furthermore, lipidomic analyses through liquid chromatography–tandem mass spectrometry and matrix-assisted laser desorption/ionization mass spectrometry imaging identified extensive alterations, notably in cardiolipin and triacylglycerols, suggesting specific roles of lipids during pathogenesis. These findings provide unprecedented insights into the hepatic response to <span>S. mansoni</span> infection, shedding light on the complexity of liver pathology in this disease.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"d617107761009b8fa1aa7b0ea2ba8f9715fe761243dae950ababf5da1ff8e65c","category":"Interdisciplinary"}