{"title":"Influence of Flow Channel Structural Parameters on the Hy-draulic Performance and Anti&ndash;clogging Performance of Variable Flow Emitters","link":"https://www.preprints.org/manuscript/202408.0716/v1","date":1723302666000,"content":"Variable flow emitters are a new type of emitter for underground drip irrigation that are used in locations where soil moisture is difficult to transport to the surface, which leads to crop emer-gence difficulties. The flow channel structure parameters of emitters affect the hydraulic per-formance of the emitter and its anticlogging ability. In this study, the variable flow emitter at the conventional low–flow water supply stage is taken as the research object. A combination of CFD numerical simulation of a two–phase flow of water and sand and clear water testing of test samples is applied to study the influence laws of 10 groups of variable flow emitter structural combinations on the effluent flow rate (q), flow index (x), particle passage rate and flow field inside the flow channel. The results show that the Realizable k–ε turbulence model can be used to simulate the flow field inside the variable flow emitter flow channel. The nRMSE between the measured and simulated values of q is 11.23%, and the relative error between the measured and simulated values of x is 4.66%, which gives a high simulation accuracy. The polar analysis shows that the tooth angle A has the smallest effect on the effluent flow rate q0.1 under 0.1 MPa, x, and particle passage rate of the variable flow emitter. The depth of the flow channel D, the spacing of the teeth B, and the height of the teeth E have a different order of precedence in the influence of the three indices, which are D &gt; B &gt; E &gt; A, B &gt; E &gt; D &gt; A, and E &gt; B &gt; D &gt; A, respectively. The value of particle passage rate is positively correlated with the mean flow velocity (v) and the mean turbulent kinetic energy (k) in the flow channel, and particle passage rate tends to increase and then decrease with the increase of x. The retention time (t) of the particles in the flow channel is closely related to the magnitude of v and k. Three multivariate linear regression equations (R2 = 0.883 ~ 0.995) were constructed for q0.1, x, and particle passage rate versus the flow channel structural parameters. Using the scipy.optimize.minimize function in Python, we de-termined the three optimal combinations of flow channel structural parameters corresponding to better hydraulic performance: q0.1 is 1.5 or 2 L/h (objective function y = min x), better clogging resistance (y = max particle passage rate), and both (y = min (0.5 x - 0.5 particle passage rate)). The research results can provide a ref-erence for the optimal design of variable flow emitters.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d61c38535336acbfae13e113ae33caf8bcf4425f3f11c838cb815ee1a3159a26","category":"Interdisciplinary"}