{"title":"iPhone 13 and Apple Silicon","link":"https://creativestrategies.com/iphone-13-and-apple-silicon/","date":1632355145000,"content":"\n<p>Ben Bajarin, writing at Creative Strategies:</p>\n\n<blockquote>\n  <p>While I will admit there is a small percentage of Apple customers\nwho upgrade every year and a percentage more who upgrade every two\nyears because they are on upgrade plans, the vast majority of\nconsumers upgrade every 3-4 years. I thought it would be\ninteresting to look at some basic iPhone benchmarks through the\nyears and look at how much performance improvement happens every\nfour years.</p>\n</blockquote>\n\n<p>Incremental improvements every year turn into profound improvements over 3–4 years. It’s like the technology version of compound interest. It adds up.</p>\n\n<blockquote>\n  <p>As I benchmarked the A15 Bionic in different ways and pondered how\nApple spends its transistor budget with each A-series chip cycle,\nan interesting shift emerged for iPhone 13. Going back to how\nApple spends their transistor budget on features, not necessarily\nperformance, for the A15, Apple looks to have had the most GPU\ngains YoY since the A9. For the past five years, Apple has had an\naverage of 19% GPU gains YoY but for the A15 Bionic, <em>Apple has\nincreased GPU performance by 52%</em>.</p>\n\n<p>This intentional increase in GPU performance over CPU performance\nspeaks to the more graphically intense features Apple had in mind\nfor iPhone 13 that is demonstrated in things like macro\nphotography, macro video, and Cinematic Mode. Developers also now\nhave a dramatically increased GPU at their disposal to create new\napp experiences around and can leverage new augmented reality\ntechniques, visual computing and AI, and more.</p>\n</blockquote>\n\n<p>It’s almost enough to make one think that Apple is ready to release high-end professional Macs built around Apple GPUs.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/09/22/bajarin-iphone-13-apple-silicon\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d624c41ef41d1fda4f7e66530198c162903fc52d33b7e1f7702a15accf339576","category":"Tech"}