{"title":"PSXIII-24 Inclusion of dried distillers grains with solubles in feedlot diets containing flint corn and citrus pulp: Metabolism and performance of finishing Nellore bulls","link":"https://academic.oup.com/jas/article/102/Supplement_3/791/7757763?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Considering the growing accessibility of dried distillers grains with solubles (DDGS) in Brazil, coupled with the limited research examining its integration into conventional confinement diets in the southeast region, comprising ingredients such as flint corn, citrus pulp, and whole cottonseed, there is a clear imperative for conducting studies to determine optimal inclusion levels of this product in such diets. The objective of the study was to compare the performance (experiment 1) and metabolism (experiment 2) of Nellore bulls finished with diets containing 0, 10, 20, 30, or 40% DDGS (% DM) in total replacement of whole cottonseed and partial replacement of ground flint corn and citrus pulp. In experiment 1, Nellore bulls [n = 368; body weight (BW) = 420 ± 30 kg] were used, allocated in 60 experimental pens for 125 d (n = 12 pens per treatment), evaluating variables such as dry matter intake, average daily gain (ADG), feed efficiency, observed net energy (NE) for maintenance and gain, and carcass characteristics. In experiment 2, rumen-cannulated Nellore bulls (n = 30; BW = 503 ± 46) were kept in individual pens for 21 d (n = 6 animals per treatment), evaluating ruminal parameters (proportion of short-chain fatty acids, ammonia concentration, ruminal pH) and apparent digestibility of nutrients in the total tract. The experimental design adopted was randomized blocks, and the data were analyzed using R v. 4.3.1 (R Core Team, 2023). Linear increases were observed in carcass adjusted final BW (<span>P</span> = 0.013), carcass adjusted ADG (<span>P</span> = 0.024), carcass adjusted feed efficiency (<span>P</span> = 0.0003), hot carcass weight (<span>P</span> = 0.0004), and dressing percentage (<span>P</span> &lt; 0.0001) with the incremental inclusion of DDGS in the diets (Table 1). For every 10-percentage unit inclusion in these type of diets, hot carcass weight is increased by 2.56 kg. Additionally, the inclusion of DDGS resulted in linear increases in observed NE for maintenance (<span>P</span> = 0.001) and NE for gain (<span>P</span> = 0.001), calculated according to Zinn and Shen (1998). Digestibility outcomes, determined through the difference of nutrients present in the consumed diet and in the feces, exhibited linearly decreasing effects with the escalating inclusion of DDGS for dry matter (<span>P</span> = 0.004), organic matter (<span>P</span> = 0.004), neutral detergent fiber (<span>P</span> = 0.01), acid detergent fiber (<span>P</span> = 0.04), and total digestible nutrients (<span>P</span> = 0.004). We also observed linear increases for isobutyrate (<span>P</span> = 0.004) and isovalerate (<span>P</span> = 0.002) as the DDGS level in the diet increased. The 40% DDGS diet exhibited 0.6 mmol/100 mol and 0.7 mmol/100 mol more of isobutyrate and isovalerate, respectively, compared with the 0% DDGS diet. In summary, a high inclusion of DDGS emerges as a viable alternative in the nutrition of <span>Bos indicus</span> cattle fed diets containing ground flint corn and citrus pulp, manifesting significant improvements in performance and carcass quality.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d6261c2e5939af9cb42085192cdf87722ec159f4efb12969bff98c38993b64c2","category":"Environment"}