{"title":"125 Effects of Saccharmyces yeast postbiotics on nursey pig muscle fiber cross-sectional area and oxidative capacity","link":"https://academic.oup.com/jas/article/102/Supplement_2/56/7664964?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This study aimed to determine effects of dietary supplementation of <span>Saccharomyces</span> yeast postbiotics (celluTEIN, Puretein Bioscience, LLC, Minneapolis, MN) on nursery pig muscle fiber cross-sectional area (CSA), isoform, and succinate dehydrogenase (SDH) staining intensity. Newly weaned pigs [n = 32; 16 barrows and 16 gilts; 21 d of age, body weight (BW) 6.05 ± 0.24 kg] were stratified by BW within sex, placed in individual pens, and randomly assigned to one of two dietary treatments within each two-pig strata. Dietary treatments included pigs supplemented 0 (CON; n = 16) or 175 g/ton (CT; n = 16) of celluTEIN to their standard three-phase nursery ration. Pigs were harvested at d 35 of feeding and the longissimus lumborum muscle was collected for mean SDH staining intensity and immunohistochemistry analyses. Data were analyzed as a completely randomized design with pig as the experimental unit and treatment as the fixed effect. Statistical significance was determined at <span>P</span> ≤ 0.05. There were no treatment effects on type I and type IIB muscle fiber CSA (<span>P</span> &gt; 0.14), but CT pigs had greater type IIA and type IIX muscle fiber CSA compared with CON (<span>P</span> &lt; 0.05). When not analyzed by fiber isoform, pigs fed CT had a greater (<span>P</span> = 0.02) average muscle fiber CSA than CON pigs. There were no treatment effects on muscle fiber type percentage or SDH intensity of all fiber types (<span>P</span> ≥ 0.23); however, when calculated as a muscle fiber CSA ratio, CT type IIA fibers had a smaller ratio (darker staining/µm<sup>2</sup>) than CON type IIA fibers (<span>P</span> = 0.05). There were no treatment effects for type I, IIX, and IIB ratios (<span>P</span> &gt; 0.21). In conclusion, supplementing <span>Saccharomyces</span> yeast postbiotics during the nursery period increased muscle fiber hypertrophy and type IIA fiber oxidative capacity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d637626edca5ba5646eae44209cbebacb558fdf4b1eec09121e8e7350f354b3f","category":"Environment"}