{"title":"Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More","link":"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/","date":1615644023000,"content":"Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/top-stories-13mar2021.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"aligncenter size-full wp-image-788670\" />\r\n<br/>\r\nThis week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro models later this year, a mixed reality headset in 2022, augmented reality glasses by 2025, and maybe even some sort of augmented reality contact lenses by the 2030s. Read on below for details on these stories and more! \r\n<br/>\r\n\r\n<br/>\r\n<h2>Next Apple Event Rumored for March 23</h2>\r\n<br/>\r\nMarch is a common month of the year for Apple to announce new or updated products, and this year will likely be no exception.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Screen-Shot-2021-03-08-at-1.00.47-PM.png\" alt=\"\" width=\"2160\" height=\"1176\" class=\"aligncenter size-full wp-image-787459\" />\r\n<br/>\r\nA reliable Chinese leaker known as \"Kang\" this week <a href=\"https://www.macrumors.com/2021/03/08/apple-event-march-23-kang/\">said an Apple Event is planned for Tuesday, March 23</a>, with potential new products including Apple's <a href=\"https://www.macrumors.com/guide/airtags/\">long-awaited AirTags</a> item trackers, <a href=\"https://www.macrumors.com/2021/03/09/mini-led-ipad-pro-release-date-rumor/\">a new iPad Pro with a Mini-LED display</a>, <a href=\"https://www.macrumors.com/2021/03/10/leaked-renders-for-third-gen-airpods/\">third-generation AirPods</a>, and a new Apple TV. A wildcard possibility is a redesigned iMac with an Apple silicon chip.\r\n<br/>\r\n\r\n<br/>\r\nIf the rumor is accurate, Apple should officially announce the event early next week. Due to the ongoing pandemic, the event will surely be another virtual affair with a prerecorded video from Apple Park.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac</h2>\r\n<br/>\r\nAfter <a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">adding a \"while supplies last\" notice to its iMac Pro product page</a> and removing all upgrade options for the computer late last week, Apple confirmed to MacRumors that <a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">the iMac Pro will be discontinued when supplies run out</a>. The computer remains available for now, but delivery estimates are several weeks out.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg\" alt=\"\" width=\"2254\" height=\"1268\" class=\"aligncenter size-full wp-image-787349\" />\r\n<br/>\r\nApple said the latest 27-inch iMac introduced in August is the preferred choice for the vast majority of pro iMac users, and said customers who need even more performance and expandability can choose the Mac Pro. Of course, it may be worth exercising patience, as rumors suggest that Apple is working on <a href=\"https://www.macrumors.com/2021/01/15/apple-redesigned-imacs-slimmer-bezels/\">a redesigned iMac with an Apple silicon chip</a> for release this year and performance should be quite impressive.\r\n<br/>\r\n\r\n<br/>\r\nApple previously confirmed that its transition to Apple silicon across Macs will be completed by around June 2022.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</h2>\r\n<br/>\r\nThe iMac Pro wasn't the only Apple product to be discontinued over the past week, with Apple also announcing that it has <a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">discontinued the original HomePod</a>, with orders only available while supplies last. Apple says it will focus its efforts on the smaller and cheaper HomePod mini, which was launched last November.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/HomePodandMini-feature-orange.jpg\" alt=\"\" width=\"1436\" height=\"808\" class=\"aligncenter size-full wp-image-783454\" />\r\n<br/>\r\nApple had hoped that the ‌HomePod‌'s high-quality sound would give it an edge over competing products, but sales of the ‌HomePod‌ have always been lackluster with so many more affordable options on the market. Apple has been selling the ‌HomePod‌ for &#36;299, but it was originally priced at &#36;350. The ‌HomePod mini‌ is available for &#36;99.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Should You Buy a Super Cheap Refurbished iPhone From Amazon?</h2>\r\n<br/>\r\nAmazon maintains lists of its best selling products, and right now, the best-selling smartphone that's available from Amazon is an Amazon \"Renewed\" iPhone 8, which is frequently priced below &#36;200.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/refurb-thumb-3.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"aligncenter size-full wp-image-787860\" />\r\n<br/>\r\nThat's super cheap for an ‌iPhone‌, and cheaper than Apple's own refurbished price for the same device, so in our latest YouTube video, we <a href=\"https://www.macrumors.com/2021/03/09/amazon-renewed-iphone/\">picked up one of these Amazon Renewed iPhones to see if it's worth the savings</a>.\r\n<br/>\r\n\r\n<br/>\r\nAmazon's \"Renewed\" devices are all pre-owned and are not Apple certified, but Amazon says they've been professionally \"inspected, tested, and cleaned\" by Amazon-qualified suppliers. Note that the iPhones come from various third-party suppliers and are not necessarily provided direct by Amazon.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Two New Apple Silicon MacBooks Expected to Enter Mass Production in Second Half of 2021</h2>\r\n<br/>\r\nApple is planning redesigned 14-inch and 16-inch MacBook Pro models powered by Apple silicon for release in the second half of 2021, according to well-regarded analyst Ming-Chi Kuo, and a <em>Nikkei Asia</em> report this week lent credence to that timeframe.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/2021-mbp-hdmi-slot-3d.jpg\" alt=\"\" width=\"2500\" height=\"1406\" class=\"aligncenter size-full wp-image-786284\" />\r\n<br/>\r\nIn a report focused on <a href=\"https://www.macrumors.com/2021/03/09/iphone-12-mini-production-cut-report/\">Apple slashing iPhone 12 mini orders</a> from suppliers, the publication briefly noted that Apple has <a href=\"https://www.macrumors.com/2021/03/09/apple-silicon-macbooks-production-report/\">pushed back mass production of the two new MacBooks from May or June until the second half of the year</a>. The report refers to the notebooks as \"MacBooks,\" but it is likely this is referring to the upcoming MacBook Pro models.\r\n<br/>\r\n\r\n<br/>\r\nThe second half of the year begins in July, so there should be ample time for Apple's suppliers to ramp up production for a launch later in the year.\r\n<br/>\r\n\r\n<br/>\r\nKuo expects the new MacBook Pro models to feature brighter displays with Mini-LED backlighting, a new design with a flat-edged top and bottom, <a href=\"https://www.macrumors.com/2021/02/22/2021-macbook-pro-sd-hdmi-port-kuo/\">an HDMI port and SD card reader</a>, classic MagSafe charging with a magnetic power cable, and physical function keys instead of the Touch Bar.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Kuo: Apple to Launch Mixed Reality Headset in Mid 2022 and Augmented Reality Glasses by 2025</h2>\r\n<br/>\r\nApple plans to release its long-rumored mixed reality AR/VR headset \"in mid-2022,\" followed by augmented reality glasses by 2025, well-regarded <a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/\">analyst Ming-Chi Kuo said this week</a>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg\" alt=\"\" width=\"2006\" height=\"1129\" class=\"aligncenter size-full wp-image-781971\" />\r\n<br/>\r\nKuo also looked far into the future and predicted that Apple will <a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-ar-contact-lenses-2030s/\">launch \"contact lenses\" at some point after 2030</a>. He said this product will bring electronics from the era of \"visible computing\" to \"invisible computing,\" but there is \"no visibility\" for this product yet and he offered no further details.\r\n<br/>\r\n\r\n<br/>\r\nApple is highly committed to AR/VR technologies, according to Kuo, who has a \"positive view\" about Apple's future in the space.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Apple Accuses Former Employee of Stealing Trade Secrets and Leaking Them to Media</h2>\r\n<br/>\r\nApple this <a href=\"https://www.macrumors.com/2021/03/11/apple-employee-stole-trade-secrets-lawsuit/\">filed a lawsuit</a> against Simon Lancaster, a former employee who allegedly used his position within the company to steal \"sensitive trade secret information\" from Apple that was then leaked to a journalist and published in rumor articles.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/project-x-feature-yellow.jpg\" alt=\"\" width=\"2500\" height=\"1406\" class=\"aligncenter size-full wp-image-788446\" />\r\n<br/>\r\nLancaster worked at Apple for more than a decade, using his seniority to attend internal meetings and access documents that Apple says were \"outside the scope of his job's responsibilities.\" Details he obtained were published in media articles that \"cited a 'source' at Apple.\"\r\n<br/>\r\n\r\n<br/>\r\n<h3>MacRumors Newsletter</h3>\r\n<br/>\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br/>\r\n\r\n<br/>\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/mar-11-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/top-stories-apple-event-rumored-for-march-23-imac-pro-and-homepod-discontinued-and-more.2288201/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=b_5QjoJIJqM:yiHncL9Xwoc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=b_5QjoJIJqM:yiHncL9Xwoc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/b_5QjoJIJqM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d63addf3e24dc526cf1fab793e2bf99e278bef8da7d0a58097c02d1ca48719e4","category":"Apple"}