{"title":"Power Meter Pedals In The Pro Peloton?","link":"https://www.dcrainmaker.com/2023/07/power-meter-pedals-in-the-pro-peloton.html","date":1688402853000,"content":"<p></p>\n<p>One of the most common questions I got after my <a href=\"https://www.dcrainmaker.com/2023/07/tour-de-france-2023-bike-computers-and-power-meters.html/\">‘Power Meters and Bike Computers of the Tour de France 2023’ post</a> is whether or not any teams were using power meter pedals, and if not – why not?</p>\n<p>To begin, no men’s WorldTour pro teams are using power meter pedals this year at the Tour de France. However, the history and reasoning (and future) is quite interesting. In fact, some of those same teams have their men’s development squads (Lotto Dstny), as well as their WorldTour women’s teams (a whole bunch) on power meter pedals. Let alone all the other continental teams using power meter pedals. Said differently, the exclusion of power meter pedals is very specific to just the WorldTour men’s teams. And, specific to the last few years – as teams have used them sporadically a decade ago.</p>\n<p>So, the question is – why?</p>\n<p>In the video above I dive into all the reasons, but essentially it comes town to one big current reason, and a bunch of historical reasons that are no longer really an issue.</p>\n<h3><span>Drivetrain Sponsorships:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/P1099092.jpg\"><img title=\"P1099092\" src=\"https://media.dcrainmaker.com/images/2023/07/P1099092_thumb.jpg\" alt=\"P1099092\" width=\"720\" height=\"480\" /></a></p>\n<p>The main current reason is sponsorships. Professional cycling teams are virtually 100% reliant on sponsorships. This includes team-name sponsorships like Jumbo or Trek, but also gear sponsorships for different components on the bicycle. In some cases, there are many options for components on the bicycles, but in on particular category – the options are actually fairly limited: The drivetrain. That component suite includes the crankset, chain, cassette, and derailleurs. Basically, the things you pedal and shift that in turn drive the bicycle forward. The pedals themselves aren’t generally considered part of that (technically), though in this context it matters a bit.</p>\n<p>While there are basically three main drivetrain manufacturers (Shimano, SRAM, Campagnolo), alongside smaller but certainly visible brands, FSA and ROTOR. However, when it comes to sponsorships, Shimano sponsors more than half the Tour de France pro peloton. This has long been the case, with the company maintaining that level of sponsorship for at least the last decade I’ve been tracking it. Sometimes we see other brands increase their sponsorship levels, such as SRAM when they launched eTAP, for specific product launches – but Shimano has been a steady and always-there entity.</p>\n<p>The thing is, up till the last 2-3 years, Shimano didn’t care much about the power meter side. Throughout most of the 2010’s, Shimano sponsored drivetrains, but teams had separate power meter sponsors. Those two coexisted together like peanut butter and chocolate, but starting in <a href=\"https://www.dcrainmaker.com/2018/04/shimano-dura-ace-r9100p-power-meter-in-depth-review.html\">2016 Shimano introduced their first power meter</a>, the DuraAce R9100P. Over the next year or so, we saw existing power meters like 4iii and Stages on those Shimano cranksets disappear as exclusivity agreements took effect. Even now, the single team with 4iiii left has a mix of bikes where some of them are 4iiii power meters and some of them are Shimano power meters.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/P1099091.jpg\"><img title=\"P1099091\" src=\"https://media.dcrainmaker.com/images/2023/07/P1099091_thumb.jpg\" alt=\"P1099091\" width=\"720\" height=\"480\" /></a></p>\n<p>When it comes to sponsorships, each component has a ‘price’, which also varies by the popularity of the team. Something like a smart trainer sponsorship floats this year in the $115,000-$130,000/year realm, an ever-slow increase each year. Whereas a drivetrain costs more. Likewise, sponsoring a team like Jumbo-Visma costs more than Intermarche or Cofidis, due to popularity/results. Sometimes there are ‘package’ deals – such as <a href=\"https://www.dcrainmaker.com/2022/07/tour-de-france-which-smart-trainers.html\">Garmin/Tacx sponsoring of bike computers + trainers</a>, or Elite’s sponsoring of trainers + water bottles/cages. And so on.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/TacxTrainers.jpg\"><img title=\"TacxTrainers\" src=\"https://media.dcrainmaker.com/images/2023/07/TacxTrainers_thumb.jpg\" alt=\"TacxTrainers\" width=\"720\" height=\"480\" /></a></p>\n<p>As Shimano aimed to promote its power meter more and more, it required more teams to switch to it. They effectively outbid the smaller power meter companies, entities like Stages, 4iiii, and others that had power meter sponsorships on Shimano drivetrains. Shimano wanted to demonstrate their power meter offering was good enough for the world’s pros. Of course, we <a href=\"https://www.dcrainmaker.com/2023/02/shimano-r9200p-power-meter-review-astonishingly-bad.html\">know that’s technically not true</a>, but sponsorship is rarely about being the best – it’s about paying the most.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/P1099093.jpg\"><img title=\"P1099093\" src=\"https://media.dcrainmaker.com/images/2023/07/P1099093_thumb.jpg\" alt=\"P1099093\" width=\"720\" height=\"480\" /></a></p>\n<p>Thus in effect, Shimano, and SRAM to a far lesser extent (they only sponsor 3 teams), have slowly edged out many other players. However, there are still a number of spots remaining. Those teams are taken up by existing drivetrain and power meter players including FSA/Power2Max, 4iiii, and ROTOR. Which, we’ll get to in a moment.</p>\n<h3><span>Historical reasons:</span></h3>\n<p>Now, before we talk about the future, we need to talk about the past. There’s roughly five historical reasons why power meters pedals haven’t been popular in the Tour de France or WorldTour Teams. That said, we do need to acknowledge power meter pedals have indeed been used by WorldTour teams for whole seasons.</p>\n<p>Back in <a href=\"https://www.dcrainmaker.com/2014/07/checking-france-touque.html\">2014 for example, we saw Garmin Vector 1 power meter pedals</a> used in the Tour de France on a few bikes:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/Vector1usage.jpg\"><img title=\"Vector1usage\" src=\"https://media.dcrainmaker.com/images/2023/07/Vector1usage_thumb.jpg\" alt=\"Vector1usage\" width=\"720\" height=\"480\" /></a></p>\n<p>And likewise, <a href=\"https://www.dcrainmaker.com/2017/05/giro-ditalia-2017-trainers-powermeters-tech.html\">in the Giro in 2017</a>, we saw Favero bePro power meter pedals used by one team:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/BePro.jpg\"><img title=\"BePro\" src=\"https://media.dcrainmaker.com/images/2023/07/BePro_thumb.jpg\" alt=\"BePro\" width=\"720\" height=\"480\" /></a></p>\n<p>And there’s also been sporadic occasions of the Look power meter solution (mainly in the Polar days) used over the years by WorldTour teams. But these were mostly a flash in the pan.</p>\n<p>Historically though, the five main reasons power meter pedals were avoided were as follows:</p>\n<p><strong>A) Cleat Type:</strong> Back when <a href=\"https://www.dcrainmaker.com/2013/09/garmin-vector-review.html\">Garmin first introduced Vector 1</a> (and <a href=\"https://www.dcrainmaker.com/2015/08/powertap-p1-pedals-review.html\">PowerTap introduced the PowerTap P1</a>), these were only on LOOK-KEO style cleats. While there are plenty of riders riding LOOK-KEO cleats in the Pro peloton, the bigger issue at the time was actually individual sponsorships. There were challenges with Team Cannondale back then, and riders having individual pedal sponsorships. While it’s somewhat mind-boggling that a rider’s individual pedal sponsorship could override a team-name-level sponsorship, Garmin decided not to fight it. Either way, cleat type is no longer an issue. In Garmin’s case alone, <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">on Rally, they now support LOOK-KEO, Shimano SPD-SL, and Shimano SPD pedal types</a>. In <a href=\"https://www.dcrainmaker.com/2022/02/wahoo-powrlink-speedplay-power-meter-review.html\">Wahoo’s case they’ve got Speedplay</a>. In Favero’s case <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">both LOOK-KEO</a> and <a href=\"https://www.dcrainmaker.com/2021/07/assioma-shimano-variant.html\">SPD-SL</a>, and <a href=\"https://www.dcrainmaker.com/2021/03/srm-x-spd-power-meter-in-depth-review.html\">SRM has SPD</a> and <a href=\"https://www.dcrainmaker.com/2018/12/srm-exakt-power-meter-pedals-in-depth-review.html\">LOOK-KEO</a>. In other words, cleat type is no longer a blocker at a broad level, and even within that, team sponsorships have ‘improved’ such that pedal sponsorship at the team level is commonplace (if not the norm) now.</p>\n<p><strong>B) Finicky Install:</strong> The next issue back in the day was team mechanics complained about the finicky install process of first-generation power meter pedals, it’s one of the reasons we saw <a href=\"https://www.dcrainmaker.com/2014/07/checking-france-touque.html\">teams use empty/disconnected Garmin Vector 1 pedals back in 2014</a>. That was especially notable for the Garmin Vector 1/2 pedals, and even more-so for the <a href=\"https://www.dcrainmaker.com/2012/07/polar-look-keo-power-systempedal-based.html\">LOOK-Polar</a> (and then <a href=\"https://www.dcrainmaker.com/2018/12/srm-exakt-power-meter-pedals-in-depth-review.html\">LOOK-SRM</a>) solutions. In the case of the Garmin Vector 1/2 pedals, they required being torqued to a very specific spec using a special crow-foot adapter, while concurrently requiring an on-bike calibration process to ‘set’ the install angle. They also required pods that mechanics had to be a bit more careful around. But the LOOK solution was even worse, requiring an even wonkier tool that was easily prone to installation errors. Albeit, the bulkier PowerTap P1  from the same era had none of those problems. And ultimately, all of today’s power meter pedals from Garmin, Favero, Wahoo, and even SRM have done away with those issues. Installation of a current-gen power meter pedal from Garmin/Favero/Wahoo is identical to that of a regular pedal.</p>\n<p><strong>C) Cornering Angle:</strong> Way-back-when, some of the power meter pedals (like the PowerTap P1) had lower cornering angle due to stack height. That was considered a concern for some, but that was mainly in the crit scene – not the WorldTour racing scene. These days though, the max cornering angle between most power meter pedals and a non-power variant is virtually identical (if not identical). And the last decade has shown this is simply not an issue for 99.99% of riders, including pro-level riders. Or, they know not to try pedaling through a corner at more than 38* of cornering angle, because you’d have hit a regular pedal at that angle anyway.</p>\n<p><strong>D) Weight:</strong> Historically, some of the power meter pedals were quite bulky, either in physical weight or physical size. Things like extra pods added to that. And while road-based power pedals still weigh more than their lightest non-power counterpart, the difference is relatively small. And specifically, it’s relatively small when the issue isn’t actually minimizing the bike weight anymore. With the UCI’s 6<a href=\"https://www.cyclist.co.uk/in-depth/uci-weight-limit\">.8KG minimum bike-weight rule</a>, teams could easily undercut that with components today. Instead, managing to meet that threshold is frankly becoming more of a challenge. Heck, if teams or riders actually cared about weight like Weight Weenies forums, they wouldn’t be choosing heavy Garmin Edge 1040 GPS bike computers, or the Hammerhead Karoo 2 (equal weight).</p>\n<p><strong>E) Accuracy:</strong> Historically speaking, all of these power meters were actually accurate to the same spec as their crankset or related counterparts. However, one of the challenges was that ‘Finicky Install’ but I noted earlier. This was especially true for the LOOK-based Polar &amp; SRM solutions, which were quite hard to install properly and consistently, to get accurate numbers. Likewise, if the Garmin or early Favero bePRO units weren’t properly torque’d down, they’d run the same risk. But these days, again, the current-gen offerings from Garmin/Favero/Wahoo/SRM are perfectly accurate, and, as shown, far <a href=\"https://www.dcrainmaker.com/2023/02/shimano-r9200p-power-meter-review-astonishingly-bad.html\">more accurate than the Shimano power meters</a> that are on more than half the peloton. Accuracy simply isn’t an issue here either.</p>\n<p>Ok, so with looking at the current situation and the historical reasons, will things change?</p>\n<h3><span>Going Forward:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/07/P1099089.jpg\"><img title=\"P1099089\" src=\"https://media.dcrainmaker.com/images/2023/07/P1099089_thumb.jpg\" alt=\"P1099089\" width=\"720\" height=\"480\" /></a></p>\n<p>I should point out first that I don’t really care whether or not teams (or consumers) use power meter pedals. There are plenty of pros and cons as to which power meter solution one should use. I <a href=\"https://www.dcrainmaker.com/2022/04/power-meter-pedal-buyers-guide.html\">outline some of those in this post</a>. All I care about is accurate data. Rather, there’s just been lots of questions as to why the men’s WorldTour teams aren’t using them.</p>\n<p>Because again, the women’s teams are. Wahoo has 3-4 teams that will likely be seen on Wahoo’s POWRLINK Zero power meters at the <a href=\"https://www.dcrainmaker.com/2022/07/womens-tour-de-france-2022-the-bike-computers-trainers-and-power-meters.html\">Tour de France Femmes avec Zwift</a> later this month. Garmin has at least one using it there, and Favero undoubtedly also has at least one too.</p>\n<p>In talking to both Wahoo &amp; Garmin, both companies nearly mirrored the same message back: Existing drivetrain contracts currently block their power meter pedal attempts on the men’s side.h</p>\n<p>In Wahoo’s case, Bruce Sandell, head of Wahoo’s global partnerships said: “It is a case of legacy deals in most cases, that we are waiting to run out…..as they do we are moving teams onto SPEEDPLAY.” He went on to say that teams have started requesting their Speedplay pedals, and in particular the AERO model, given the aero gains. Of course, at present, there isn’t an AERO version of the POWRLINK power meter (only a ZERO variant).</p>\n<p>Likewise, Andrew Silver, Garmin’s Cycling Division lead, said “we would for sure support Rally usage if / when the opportunity arises – but it is a contractual question as well as a product one – e.g. power meters cross over into drivetrain/component supplier territory”. He went onto note that the Lotto Dstny women’s pro team as well as the Lotto Dstny men’s development team currently ride Garmin Rally pedals already.</p>\n<p>If we look at the opportunities for non-Shimano/SRAM teams today, there are a number of potential openings. For example, Team Cofidis has no power meter sponsor today, and just uses a random collection of SRM &amp; Stages power meters. Likewise, Team UAE doesn’t appear to have a power meter sponsor either, instead, the bike sponsorship included the Shimano drivetrain and in turn, they just happened to pick R9200P on that. Further, if we look at existing partnerships, Wahoo’s partnership with Team Education first already covers a number of Wahoo products (pedals, bike computers, trainers, etc…). Team EF currently has an FSA/Power2Max sponsorship. While Power2Max has three current TdF teams, I suspect they aren’t hard-set on that number/teams. My guess would be that Team EF would be probably the most natural fit for a future Wahoo power meter sponsorship – especially if they could get rid of the pods and offer an AERO version.</p>\n<p>Point is, it would not at all surprise me to see power meter pedals return to the pro peloton in 2024. Certainly, 2023 is effectively ‘over’ in terms of sponsorship changes at the equipment level – but negotiations are likely already happening for next season.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"d64845e0ea756a5f36b46e2a36d903ef41a2b32dac3739ed315854f5ab7c1965","category":"Cycling"}