{"title":"แอปเปิลเปิดตัว Xcode Cloud บริการคอมไพล์และทดสอบแอปอัตโนมัติ, Swift Playground เขียนแอปได้เต็มรูปแบบ","link":"https://www.blognone.com/node/123054","date":1623092597000,"content":"<div><div><div><p>แอปเปิลเปิดตัวฟีเจอร์สำคัญสำหรับนักพัฒนาในงาน WWDC นอกเหนือจากการอัพเดต API ตามรอบการอัพเดตระบบปฎิบัติการแล้ว ยังมีเปิดตัวเครื่องมือพัฒนาอีกหลายรายการ</p>\n<p>บริการแรกคือ Xcode Cloud บริการคลาวด์สำหรับการคอมไพล์แอป, ทดสอบ, และกระจายแอปรุ่นทดสอบให้เทสเตอร์ บริการนี้ทำให้นักพัฒนาไม่ต้องใช้เครื่องตัวเองในการคอมไพล์เอง ลดระยะเวลาที่เครื่องโหลดหนักลง  ตัวบริการเริ่มทดสอบวงปิดในปีนี้และเปิดบริการจริงในปีหน้า ส่วนราคาจะแจ้งภายหลัง</p>\n<p>แอป Swift Playground อัพเดตเป็นเวอร์ชั่น 4 สำหรับเรียนเขียนโค้ดบน iPad เพิ่มความสามารถในการเขียนแอปเต็มรูปแบบ สามารถเขียนแอปด้วย SwiftUI ได้ทันที รวมถึงสามารถส่งแอปขึ้น App Store โดยตรง</p>\n<p>ภาษา Swift เองก็มีอัพเดตฟีเจอร์ async, await, actor ทำให้เขียนโค้ดที่รันแบบขนานได้โดยไม่ยุ่งยาก ตอบสนองผู้ใช้ได้แม้มีงานเบื้องหลังหนักๆ</p>\n<p>ฟีเจอร์สำหรับนักพัฒนาอื่นๆ เช่น</p>\n<ul>\n<li>หน้าจอ App Store ปรับแต่งได้ตามกลุ่มเป้าหมาย สามารถทดสอบไอคอนหรือภาพหน้าจอว่าแบบใดได้ผลดี</li>\n<li>RealityKit 2 เพิ่มฟีเจอร์สแกนวัตถุสามมิติ</li>\n<li>Virtual Game Controller API อำนวยความสะดวกสำหรับนักพัฒนาเกมที่ต้องการสร้างตัวคอนโทรลเลอร์บนหน้าจอพร้อมๆ กับรองรับคอนโทรลเลอร์จริง</li>\n<li>Xcode 13 ทำงานร่วมกับ Xcode Cloud และบริการทำงานร่วมกันอื่นๆ เช่น GitHub, GitLab, Bitbucket ได้ดีขึ้น</li>\n</ul>\n<p>ที่มา - <a href=\"https://www.apple.com/newsroom/2021/06/apple-introduces-new-developer-tools-and-technologies-to-create-even-better-apps/\">Apple</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/64fa50bea26e6d4a8a0c7c234737d8ee.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/programming\">Programming</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d64b9b76d37cab955eb835b6fe9df39fe8223a2651b49b2758ff68c8be2947d1","category":"Thai"}