{"title":"Enhancing Bioactive Compound Classification through the Synergy of Fourier-Transform Infrared Spectroscopy and Advanced Machine Learning Methods","link":"https://www.preprints.org/manuscript/202404.0195/v1","date":1712055221000,"content":"Bacterial infections and resistance to antibiotic drugs represent the highest challenges to public health. The search for new and promising compounds with anti-bacterial activity is a very urgent matter. In order to promote the development of platforms enabling to the discovery of compounds with anti-bacterial activity, Fourier Transformed Mid-Infrared (FT-MIR) spectroscopy associated with the machine learning algorithms were used to predict the impact of compounds extracted from Cynara cardunculus against Escherichia coli cells. According to the plant tissue (seeds, dry and fresh leaves, and flowers) and the solvents (ethanol, methanol, acetone, ethyl acetate, and water), compounds with different compositions concerning, phenol content, antioxidant, and antimicrobial activity were obtained. Principal component analysis of spectra, allowed to discriminate compounds that inhibit the E. coli growth, according to the conventional assay. The supervised classification models enabled the prediction of the compound's impact on the E. coli growth, with the accuracy for the test data: Partial least squares-discriminant analysis of 94%; Support vector machines of 89%; k-Nearest neighbor of 72%; and a Backpropagation network of 100%. According to the promising results, the integration of FT-MIR spectroscopy with machine learning presents a high potential to promote the discovery of new compounds with antibacterial activity, thereby streamlining the drug exploratory process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d64e2ffd966378e32599d3e819703669f294a386cdff0096d6b5190592a4f204","category":"Interdisciplinary"}