{"title":"Australia also wants Google to unbundle search from Android","link":"https://arstechnica.com/?p=1808409","date":1635439823000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly.jpg\">Enlarge</a> <span>/</span> Let's see, you landed on my \"Google Ads\" space, and with three houses... that will be $1,400.  (credit: Ron Amadeo / Hasbro)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Australian Competition and Consumer Commission (ACCC) is the latest government regulatory body to take issue with how Google does business. As <a href=\"https://www.reuters.com/technology/australia-plans-make-google-offer-alternative-search-engines-smartphones-2021-10-28/\">Reuters</a> reports, the ACCC wants Google to show a \"choice screen\" to Android users, allowing them to pick a default search engine other than Google Search. The commission also wants to limit Google's ability to pay Apple and other vendors or platforms to be their default search engine.</p>\n<p>ACCC Chair Rod Sims explained the commission's reasoning in a statement:</p>\n<blockquote>\n<p>We are concerned that Google's dominance and its ability to use its financial resources to fund arrangements to be the default search engine on many devices and other means through which consumers access search, such as browsers, is harming competition and consumers. Google pays billions of dollars each year for these placements, which illustrates how being the default search engine is extremely valuable to Google's business model.</p>\n</blockquote>\n<p>Market research firm <a href=\"https://www.kantarworldpanel.com/global/smartphone-os-market-share/\">Kantar</a> says Android has a 60 percent share of the smartphone market, while on iOS and macOS, Google pays Apple an estimated <a href=\"https://9to5mac.com/2021/08/25/analysts-google-to-pay-apple-15-billion-to-remain-default-safari-search-engine-in-2021/\">$15 billion per year</a> to be the default search on Safari. Google also pays Mozilla <a href=\"https://www.zdnet.com/article/sources-mozilla-extends-its-google-search-deal/\">$400 million</a> per year to remain the default on Firefox. Google has a 94 percent share of the Australian search engine market.</p></div><p><a href=\"https://arstechnica.com/?p=1808409#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808409&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d65e82c84bd0c2b47907943ac3e71fc1a6fb417966bc66d07e37d4bf4c097a47","category":"Tech"}