{"title":"Facebook อาจต้องขายกิจการ Giphy ออกไป เพราะเข้าข่ายผูกขาดโซเชียลมีเดีย","link":"https://www.blognone.com/node/124238","date":1629082850000,"content":"<div><div><div><p>เดือน พ.ค. ปี 2020 Facebook ประกาศ<a href=\"https://www.blognone.com/node/116374\">ควบรวมกิจการ  Giphy</a> เว็บพอร์ทัลรวมรูป GIF หลังจากนั้นไม่นาน หน่วยงานด้านการแข่งขันและตลาด (Competition and Markets Authotiry - CMA) ของสหราชอาณาจักรเข้ามา<a href=\"https://www.blognone.com/node/116902\">สอบสวน</a>การควบรวมกิจการว่าจะส่งผลต่อการแข่งขันในกลุ่มผู้ให้บริการโซเชียลมีเดียหรือไม่</p>\n<p>ล่าสุด มีรายงานจาก CMA ว่าต้องการยับยั้งการควบรวมโดยให้เหตุผลว่า GIF เป็นเนื้อหาส่วนหนึ่งที่โพสต์ลงโซเชียลมีเดียในหลากหลายแพลตฟอร์ม การลดตัวเลือกหรือคุณภาพของ GIF อาจส่งผลกระทบอย่างมีนัยสำคัญต่อวิธีที่ผู้คนใช้โซเชียลมีเดีย ด้าน Facebook บอกว่า ไม่เห็นด้วยกับเหตุผลของ CMA และจะเดินหน้าแก้ไขความเข้าใจผิดต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a54be0b3ed10e94240704add72238e8c.png\" /></p>\n<p>CMA บอกด้วยว่าโซเชียลมีเดียรายใหญ่ส่วนใหญ่ที่แข่งขันกับ Facebook ก็ใช้ Giphy กันทั้งนั้น และ Giphy ยังเป็นผู้ให้บริการภาพ GIF รายใหญ่รายเดียว การเป็นเจ้าของ Giphy ของ Facebook อาจนำไปสู่การปฏิเสธแพลตฟอร์มอื่นๆ ที่อยากเข้าถึงบริการ GIF ของตนได้</p>\n<p>ช่วงการสอบสวน CMA ยังให้เหตุผลด้วยว่า ก่อนเข้าควบรวม Giphy กำลังสร้างธุรกิจโฆษณาซึ่งจะกลายเป็นอีกหนึ่งผู้แข่งขันของ Facebook การเข้าควบรวมทำให้ Giphy ต้องหยุดโครงการไว้ แต่ Facebook บอกว่าไม่จริง และให้เหตุผลว่า Giphy ไม่มีฐานผู้ใช้งานของตัวเองและพึ่งพา Facebook เพื่อให้ได้เข้าถึงผู้ใช้งานด้วยซ้ำ</p>\n<p>มีรายงานจากบุคคลที่อยู่ใกล้ชิดกับเหตุการณ์บอกว่า Giphy ระดมทุน 150 ล้านดอลลาร์ในช่วง 8 ปีที่ผ่านมา แต่ยังไม่มีกำไร และเงินเริ่มหมดตอนที่ขายกิจการให้ Facebook และมีพนักงาน Giphy หลายรายที่ไม่ได้เข้ามาเป็นส่วนหนึ่งของ Facebook ด้วย ซึ่ง Facebook ได้จ่ายเงินให้กับหุ้นส่วนใหญ่ของ Giphy แล้ว</p>\n<p>สำหรับคำตัดสินครั้งสุดท้ายอย่างเป็นทางการของ CMA จะสิ้นสุดช่วงต้นเดือนตุลาคม</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/8/12/22621957/facebook-giphy-deal-blocked-uk-regulator\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/giphy\">Giphy</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/united-kingdom\">United Kingdom</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d65ee6376ea428c379325f9273544b07277ad9bba12a0cb90ff3385da224c5b9","category":"Thai"}