{"title":"Dragon Age: Dreadwolf teaser proves EA hasn’t forgotten about the game","link":"https://arstechnica.com/?p=1988420","date":1701721554000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div></div>\n<p>Hey, remember <em>Dragon Age: Dreadwolf</em>? It has been over a year since <a href=\"https://arstechnica.com/gaming/2022/06/bioware-reveals-dreadwolf-as-the-next-dragon-age-title/\">the game's title was first revealed</a> and almost exactly five years since the then-unnamed sequel was <a href=\"https://www.youtube.com/watch?v=Nw3lrXlti-8\">first announced at the 2018 Game Awards</a>. And today, just to make sure you didn't forget about the long-in-development game completely, Bioware and EA are <a href=\"https://www.youtube.com/watch?v=tCokMTQ6qKk\">out with yet another teaser</a> presaging a \"full reveal\" planned for summer 2024.</p>\n<p>The short \"Dragon Age Day\" video, titled \"Thedas Call,\" features unseen voiceovers speaking over airborne, still-life shots of three locations that will feature in the new game. An <a href=\"https://www.ea.com/games/dragon-age/news/da-day-2023\">accompanying blog post</a> goes into a bit more detail on the locations, describing \"the desolate, beautiful badlands of the Anderfels with curtains of distant mountainous spires. The twisting channels and gleaming towers of Antiva, where Crows may lurk in any shadow. The turquoise seas of Rivain with its rushes of greenery and hardy sea-faring people.\"</p>\n<p>The short teaser concludes with a statement that seemingly comes from Solas (aka Fen'harel), the Dread Wolf that will serve as the game's antagonist: \"All the world will soon share the peace and comfort of my reign.\" And EA's blog post expands on Solas' motivation as \"not a man who sees himself as evil, but someone who believes he's fighting for a good cause and is willing to get his hands dirty.\"</p></div><p><a href=\"https://arstechnica.com/?p=1988420#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1988420&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d663abd2c892d77da6724c66b4f6476ccfb78b834fc600ded19d70ab36342c73","category":"Tech"}