{"title":"Perceptions of surgery in Nicaragua: A cross-sectional survey study within the surgery for the people project","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003835","date":1729173600000,"content":"<p>by John Dutton, Neil Parikh, Maria Cabrera, Carolina Robleto, Mikyla Lambert, Emily Jones, Sonia Treminio, Dory Barkhordarzadeh, Allyn Auslander, Ruben Ayala</p>\r\n\r\nBarriers to medical care include lack of proper infrastructure and equipment; however, cultural barriers to care and poorly perceived quality of care, especially surgical care, can also negatively impact a patient’s utilization of healthcare services. This study used patient-survey data from three unique municipalities in Nicaragua to examine pre-hospital barriers to care, including previous experience with healthcare, and how those experiences impact patient perceptions of surgery and care-seeking behavior. Surveys were administered in Siuna, Rosita, and Bonanza, Nicaragua between July 2019 and September 2020. Survey participants were aged 18-years or older that live in communities served by the Ministry of Health. The surveys were open response and multiple-choice format. Surveys included questions about structural/cultural/financial barriers to care, communication barriers, and knowledge of healthcare services. Data was managed using REDCap tools and analysis was completed using R. Individuals that previously visited a health post were significantly more likely to have a positive perception of surgery compared to those who had not (OR = 1.4) (p = 0.019). This finding remained significant after adjustment for education, age, and municipality. However, previous hospital visits did not have a significant impact on perception of surgery. Individuals with higher transportation costs reported a negative perception of surgery (40.4%), as well as those who used private transportation (29.1%) (p&lt;0.001). Participants that reported travel obstacles were 2.64 times as likely to have a positive perception of surgery (p&lt;0.001), even when adjusted for all demographics except site. These findings suggest that individuals who previously interacted with only lower-level healthcare environments were significantly more likely to have a positive perception of surgery. Counterintuitive findings show that access to public transport, transportation costs &gt;2USD, and cell-phone usage increased negative perception of surgery. This study demonstrates the complexity of variables that impact perceptions of healthcare services while highlighting areas of focus for future targeted investments.","author":"John Dutton","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d66eadaa8da6d5f9b34376e67534f8724dc89a92f0b6e55225be21e6ace8bcf5","category":"Environment"}