{"title":"Comparative efficacy and safety of traditional Chinese medicine injections in patients with transient ischemic attack: A systematic review and network meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307663","date":1721829600000,"content":"<p>by Yunhao Yi, Guangheng Zhang, Shimeng Lv, Yuanhang Rong, Hui Liu, Ming Li</p>\r\nObjectives <p>Traditional Chinese medicine (TCM) injections are extensively utilized for the treatment of transient ischemic attack (TIA). However, it remains unclear which specific TCM injection exhibits superior efficacy. In this study, we conducted a network meta-analysis to compare the clinical efficacy and safety of various TCM injections in the treatment of TIA, with the aim of identifying the optimal treatment regimen.</p> Design <p>We searched seven databases to collect information on nine TCM injections for the treatment of transient randomized controlled trials (RCTs) for the treatment of transient ischemic attacks were collected from the establishment to August 2023. The methodological quality and risk of bias were assessed using the RoB 2.0 evaluation tool, and reticulated Meta-analysis was performed using R software and Stata software.</p> Results <p>We ultimately included 58 RCTs involving 5502 patients and comprising 9 TCM injections. In terms of improving the total effective rate, Shuxuetong injection (P-score = 0.69) was the most effective. In addition, Shuxuetong injection was most effective in lowering total cholesterol (P-score = 1.00) and triglyceride (P-score = 1.00) levels. Notably, Shuxuetong injection remained the most prominent in reducing fibrinogen (P-score = 0.91). However, among other blood hemorheology indicators, Dengzhanhuasu injection was the best regimen in reducing plasma viscosity (P-score = 1.00), whole blood viscosity (high shear rate) (P-score = 0.87), and whole blood viscosity (low shear rate) (P-score = 0.90). It was found that Yinxingyetiquwu injection (P-score = 0.72) was the most effective in reducing the incidence of cerebral infarction. In terms of safety, 22 studies reported adverse effects and descriptive analyses showed that the number of adverse effects of combination therapy was comparable to that of conventional therapy and that the safety profile was good.</p> Conclusions <p>TCM injections in combination with CT may be a safe and effective intervention for patients with TIA, of which Shuxuetong injection, Dengzhanhuasu injection, and Yinxingyetiquwu injection may be more noteworthy. The quality of the literature included in the study was low, so further validation is needed with larger sample sizes, higher quality, and more rigorously designed RCTs.</p> Systematic review registration <p>[PROSPERO], identifier [CRD42023443652].</p>","author":"Yunhao Yi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d66f2084b2ac650ec5e7a591ddc5c3cb158e9ddc945f5c98af2c967688fb772b","category":"Interdisciplinary"}