{"title":"Evaluation of cytotoxic effect of siphonochilone from African ginger: an in vitro analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24308?af=R","date":1715692793000,"content":"<h2>Abstract</h2>\n<p>Plants provide a wide array of compounds that can be explored for potential anticancer properties. Siphonochilone, a furanoterpene that represents one of the main components of the African plant <i>Siphonochilus aethiopicus</i>, shows numerous health benefits. However, to date, its antiproliferative properties have not been tested. The aim of this study was to analyze the cytotoxic effects of siphonochilone on a panel of cancer cell lines and its underlying mechanism of action. Our results demonstrated that siphonochilone exhibited significant cytotoxic effects on pancreatic, breast, lung, colon, and liver cancer cell lines showing a IC<sub>50</sub> ranging from 22 to 124 μM at 72 h of treatment and highlighting its cytotoxic effect against MCF7 and PANC1 breast and pancreas cancer cell lines (22.03 and 39.03 μM, respectively). Cell death in these tumor lines was mediated by apoptosis by the mitochondrial pathway, as evidenced by siphonochilone-induced depolarization of the mitochondrial membrane potential. In addition, siphonochilone treatment involves the generation of reactive oxygen species that may contribute to apoptosis induction. In this work, we described for the first time the cytotoxic properties of siphonochilone and provided data about the molecular processes of cell death. Although future studies will be necessary, our results support the interest in this molecule in relation to their clinical application in cancer, and especially in breast and pancreatic cancer.</p>","author":"Alba Ortigosa‐Palomo, \nDavid Fuentes‐Ríos, \nFrancisco Quiñonero, \nConsolación Melguizo, \nRaul Ortiz, \nJuan M. López‐Romero, \nJose Prados","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"d670e9206b89aeb19bbf333dde875fdac9d3d3e6962286c542e8bfde0315eae2","category":"Environment"}