{"title":"Le Col expand their support of Drops-Le Col s/b Tempur","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/le-col-expand-their-support-of-drops-le-col-s-b-tempur","date":1629370931000,"content":"\n      <p><span>Cycling apparel brand Le Col, title sponsor of Drops Le-Col s/b Tempur, has announced that it is expanding its support of the team for a further two years as well as tripling the investment in the team. </span></p>\n<p><span>The brand came on as the Continental team’s title sponsor earlier this year in the British-registered squad’s sixth season. Since its inception in 2016, Drops’ kit design has been an iconic feature of the team with their ‘colour the road’ slogan.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Le_Col_banner_e50a4915-3934-4cbe-ac1d-7d67a7aa6abb_1024x1024.jpg?v=1629303372\" /><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\">Discover Rouleur's women's newsletter</a></strong></em></span></p>\n<p><span>The team’s 2021 Le Col kit is bespoke to the squad and the profits of all replica kits sold go towards funding the team for racing expenses as well as other endeavours such as Joss Lowden’s upcoming Hour Record attempt in Switzerland next month. </span></p>\n<p><span>“Our commitment goes beyond the kit, and with the Drops-Le Col team we have a collective set of matched goals, values and ideas to work on,” says Yanto Barker, founder of Le Col and former professional rider. “This is an incredibly exciting team, with some of the strongest young bike racers. It’s been an honour to work with the Drops team for the past few seasons, and we are looking forward to that relationship continuing as Le Col pledge to triple our investment with title sponsorship.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RhodePhoto_HealthyAgeingTour_2021-8267_1024x1024_d9dfbb0b-2a69-4a02-8bf8-5682338a6f0b_1024x1024.jpg?v=1629302772\" /></span></p>\n<p><span>Long-term sponsorship deals are integral to securing the future of teams and in turn the job security of their riders and staff. Brands like Le Col pledging to extend their support across multiple seasons contribute to the increasing professionalisation of women’s cycling. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/against-the-clock-joss-lowden-of-drops-le-col-s-b-tempur\">Related – Against the clock: Joss Lowden of Drops-Le Col s/b Tempur</a></strong></em></p>\n<p><span>Le Col’s extended support of the team means that after six seasons at Continental level, the team are able to apply for one of the fifteen Women’s WorldTour licenses available for 2022. If they step up to the highest level then the team will be guaranteed entry to Women’s WorldTour events including the inaugural women’s Tour de France.  </span></p>\n<p><span>The team recently instituted a <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/menstrual-gains-drops-le-col-p-b-tempurs-rider-wellness-programme\">Rider Wellbeing Programme</a> to ensure that riders are racing and training in a healthy and balanced way. The programme includes nutritional and mental wellbeing support as well as monitoring the menstrual cycle to protect against the side-effects of chronic energy deficiency. </span></p>\n<p><span>With all of this in place, Drops-Le Col s/b Tempur have achieved some impressive results this season including 22-year-old Portuguese rider Maria Martins taking the national road race title and third at the UCI 1.1 Ronde de Mouscron. Elsewhere, Joss Lowden recently claimed the overall GC at the Tour de Feminin in the Czech Republic by over five minutes. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RhodePhoto_RondeVanVlaanderen_2021-08685_1024x1024_92eac9d1-8277-4a78-83a6-4ac34b8e2e83_1024x1024.jpg?v=1629303046\" /></span></p>\n<p><span>‘The support of Le Col means that we have the necessary financial support to reach our goals of building a women’s team that can compete on the world stage,” says the team’s general manager, Tom Varney. “It's fantastic that they are also our clothing partner that work with us to develop some of the fastest and best-performing women’s kit available. Challenges like Joss Lowden’s Hour Record attempt wouldn’t be possible if it wasn’t for Le Col’s commitment to the team.”</span></p>\n<p><span>Lowden will travel to the Velodrome Suisse in Grenchen next month to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/against-the-clock-joss-lowden-of-drops-le-col-s-b-tempur\">attempt to claim the record,</a> currently held by Vittoria Bussi. Le Col has contributed financially to her effort but has also been integral in logistical support and aero testing to ensure that the 33-year-old has the best possible chance.  </span></p>\n<p><span>For the remainder of the 2021 road season, the team are due to take part in some of the biggest races on the women’s calendar including The Women’s Tour and the first ever women’s Paris-Roubaix in October. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d670e2ea9b3039c3fea76cfd9b95038f6089f6c6e65b2ecca107b95e6804e5ac","category":"Cycling"}