{"title":"Testing the information centre hypothesis in a multilevel society","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14131?af=R","date":1720070644000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0218ab3c-2b56-4b71-9dbd-d79046b21a8c/jane14131-toc-0001-m.png\" alt=\"Testing the information centre hypothesis in a multilevel society\" />\n<p>We extend the information centre hypothesis, which initially focused on information transmission between individuals, by demonstrating that information can also be transmitted between entire social groups that roost communally, forming multilevel societies.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIn various animal species conspecifics aggregate at sleeping sites. Such aggregations can act as information centres where individuals acquire up-to-date knowledge about their environment. In some species, communal sleeping sites comprise individuals from multiple groups, where each group maintains stable membership over time.\n\nWe used GPS tracking to simultaneously record group movement in a population of wild vulturine guineafowl (<i>Acryllium vulturinum</i>) to investigate whether communal sleeping sites can facilitate the transfer of information among individuals across distinct groups. These birds live in large and stable groups that move both together and apart, often forming communal roosts containing up to five groups.\n\nWe first test whether roosts provide the opportunity for individuals to acquire information from members of other groups by examining the spatial organization at roosts. The GPS data reveal that groups intermix, thereby providing an opportunity for individuals to acquire out-group information.\n\nWe next conduct a field experiment to test whether naïve groups can locate novel food patches when co-roosting with knowledgeable groups. We find that co-roosting substantially increases the chances for the members of a naïve group to discover a patch known to individuals from other groups at the shared roost. Further, we find that the discovery of food patches by naïve groups subsequently shapes their space use and inter-group associations. We also draw on our long-term tracking to provide examples that demonstrate natural cases where communal roosting has preceded large-scale multi-group collective movements that extend into areas beyond the groups' normal ranges.\n\nOur findings support the extension of the information centre hypothesis to communal sleeping sites that consist of distinct social groups.\n</p>","author":"Danai Papageorgiou, \nWismer Cherono, \nGabriella Gall, \nBrendah Nyaguthii, \nDamien R. Farine","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"d675ffb026799f98bb67452d3ff6472cc87cddc616a1838a362d25daf6bc22ff","category":"Environment"}