{"title":"Demographics and exploitation of threatened cyprinid, Hypselobarbus kolus from a small‐scale reservoir fishery in the Western Ghats hot spot, India","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12456?af=R","date":1717046370000,"content":"<h2>Abstract</h2>\n<p>The Western Ghats region (part of Western Ghats-Sril Lanka biodiversity hotspot) in India, is known not only for its rich ichthyodiversity and endemism but also as a region that continues to face various human pressure on its freshwater ecosystem through over-exploitation, habitat destruction and alien fish invasion. Insufficient data regarding the demographics and exploitation pattern of threatened freshwater fishes in the Western Ghats (WG) region serves as a barrier to effectively managing and conserving these species in a sustainable manner. In this study, growth, mortality and exploitation level of an endemic and threatened cyprinid, <i>Hypselobarbus kolus</i> were investigated based on the specimen collected by tribal fishers through small-scale fishery in Poringalkuthu Reservoir, Chalakudy River, WG, India. The asymptotic length (<i>L∞</i>) and growth rate (<i>K</i>) (growth parameters) of <i>H. kolus</i> were estimated as 341.25 mm and 0.64 year<sup>−1</sup> respectively. The potential longevity (<i>t</i>\n<sub>\n   <i>max</i>\n</sub>) and length at first capture (<i>L</i>\n<sub>\n   <i>c</i>\n</sub>\n<i>)</i> were found to be 4.69 years and 249.34 mm respectively. The fishing mortality (<i>F</i> = 1.20 year<sup>−1</sup>) of <i>H. kolus</i> was higher than the natural mortality (<i>M</i> =.65 year<sup>−1</sup>) suggesting an unsustainable level of exploitation for the species within the present study area. Current exploitation rate is greater than <i>E</i>\n<sub>\n   <i>50</i>\n</sub> and 68% of the predicted maximum exploitation (<i>E</i>\n<sub>\n   <i>max</i>\n</sub>\n<i>)</i> points out the possibility of uncertain future of the stock under current exploitation rate. An integrative conservation approach, including fishing closure during spawning seasons, mesh size regulation, quotas system for local tribes and fishermen will ensure to sustainable harvesting for the species in the WG hotspot.</p>","author":"Chelapurath Radhakrishnan Renjithkumar, \nKuttanelloor Roshni","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"d675365d959dc912a2d06066572b4489078df7a9fcd227874348f09c3b6d8761","category":"Environment"}