{"title":"Characterization of Qu-aroma of Medium-High Temperature Daqu from Different Production Areas Using Sensory Evaluation, E-nose, and GC-MS/O Analysis","link":"https://www.preprints.org/manuscript/202409.0232/v1","date":1725412107000,"content":"BACKGROUND: Qu-aroma is a critical quality indicator for medium-high temperature Daqu (MT-Daqu), significantly influencing the aroma profile of strong-aroma Baijiu (SAB). SAB is produced across various regions in China, each with unique environmental conditions and production techniques. These regional differences are likely to cause variations in the Qu-aroma of MT-Daqu. Despite this, comprehensive research on the variations in Qu-aroma across different regions has been lacking. This study aims to address this gap by utilizing Gas Chromatography-Olfactometry-Mass Spectrometry (GC-O-MS) and electronic nose (E-nose) technology, combined with sensory evaluation, to analyze the differences in Qu-aroma characteristics and volatile compound profiles of MT-Daqu from seven distinct production areas.RESULTS: Sensory analysis identified seven broad aroma categories and 25 specific aromas characterizing the Qu-aroma of MT-Daqu samples. Chen aroma and roasted aroma were notably more prevalent in MT-Daqu samples from Sichuan compared to those from other regions (P &lt; 0.05), while the fermentation aroma was less prominent in Sichuan samples. In total, 123 volatile compounds were detected in MT-Daqu, with 46 classified as aroma-active compounds. Among these, 21 aroma-active compounds were identified as markers distinguishing Sichuan MT-Daqu from those produced in non-Sichuan regions, showing significant differences in their concentrations (P &lt; 0.05). Additionally, six major aroma-active compounds-ethyl isovalerate, ethyl heptanoate, hexanal, 1-nonanal, (E)-2,4-decadienal, and 2,3-dimethyl-5-ethylpyrazine-were found to significantly contribute to the aroma differences between Sichuan and non-Sichuan MT-Daqu.CONCLUSION: This study delineates the distinct Qu-aroma characteristics of MT-Daqu from various SAB production areas and identifies the aroma-active compounds responsible for these differences. The insights gained from this research offer valuable guidance for optimizing flavor profiles in MT-Daqu production, potentially enhancing the overall quality and regional distinctiveness of the product.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d67c70f5cc5b158bff89adce612cb1fbd51753643f21657183222fdf693acf2c","category":"Interdisciplinary"}