{"title":"Van der Poel’s coach explains what makes him different from the rest of us","link":"https://cyclingtips.com/2021/07/van-der-poels-coach-explains-what-makes-him-different-from-the-rest-of-us/","date":1625513939000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/mvdp-650x434.jpg\" /></div><h2>Van der Poel's coach explains what makes him different from the rest of us</h2><p>\n</p><p>When Mathieu van der Poel pulled out of the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> this past weekend, he was closing the book on a debut Tour appearance that would make any pro envious. With nary a Grand Tour start on his career palmares before he rolled out from Brest on June 26, Van der Poel went on to win a stage (and finish in the top 10 in three other stages) and then spend six days in the yellow jersey.</p>\n\n\n\n<p>He left the race after losing yellow to focus his attentions on his next yellow-tinged objective (a mountain bike gold medal at the Olympics) and he’s sure to be among the favorites for that, too. For some time now, it’s felt as if the 26-year-old Dutchman can achieve practically any goal he sets his mind to. It’s pretty clear that he’s got something, or some things, that us mere mortals and even many of his rivals in the pro peloton lack – so we spoke to his coach to find out what sets Van der Poel apart.</p>\n\n\n\n<p>As you’d probably expect, there are oh-so-many ways in which the four-time cyclocross world champ, Monument winner, and Grand Tour stage winner is different from the rest of us. According to Kristof de Kegel, who is also performance manager at Alpecin-Fenix, Van der Poel’s physical gifts go beyond his impressive power numbers and bike handling abilities.</p>\n\n\n\n<p>“What surprises me always the most is his adaptability,” De Kegel told CyclingTips. “His body is so fast – we have some standards, we have some theories, which we all know from out of the sports science: The base buildup has to be so [many] weeks, and then when that is okay, you need that time to build up intensity, and then the rider will be good. And then we need a bit of taper. With Mathieu, it’s all way shorter. His body adapts way quicker to the stimulus that we give his body. That’s the big difference.”</p>\n\n\n\n<p>In short, Van der Poel isn’t just naturally better at riding than almost anyone else on the peloton; he’s also good at getting even better. That goes beyond what De Kegel calls his natural adaptability too. Van der Poel has instincts. Really, really good instincts. He’s also a good communicator.</p>\n\n\n\n<p>“It’s always very important as an athlete that you can always communicate with your coach and try to tell him what you feel exactly,” De Kegel said. “That is very difficult, but Mathieu is very good in that. One simple example there is that he can ride perfectly without a power meter. If you ask him to do intervals of 400 watts, whatever, and just take his power meter off, I’m pretty sure that he will never be further off than seven or eight watts.”</p>\n\n\n\n<p>Much like his racing, Van der Poel’s training incorporates multiple disciplines, which makes sense considering the way he sprinkles ‘cross, MTB, and road goals throughout his season. De Kegel says that a varied training program is key because the variety is what Van der Poel loves most.</p>\n\n\n\n<p>“What is very important for Mathieu is that we give him some kind of different tasks, different goals, because he likes that,” De Kegel said. “He likes being on different bikes, having different goals, and trying to mix that as much as possible. Even this year with the Tour and the Olympics, we also tried that. Our last preparation towards this Tour was that we had a very good altitude camp and also on that altitude camp, towards the Tour, one month ago, we also mixed mountain biking and road cycling because that motivates him and we also believe for him, it’s very easy to make a transfer from one bike to another.”</p>\n\n\n\n<p>That certainly proved to be the case on stage 5 of the Tour de France, when Van der Poel seamlessly transitioned to riding the TT bike despite not having spent much time on it this year. Finishing fifth on the stage, he managed to hold onto his yellow jersey, and then kept it for a little while longer.</p>\n\n\n\n<figure><img /><figcaption>Mathieu van der Poel on stage 5 of the Tour de France.</figcaption></figure>\n\n\n\n<p>Of course, it helps that the power he can put out is just so high. Those great instincts, communications skills, and versatility all help him make the most of his more basic physical gifts, which are abundant, to say the least.</p>\n\n\n\n<p>De Kegel preferred not to divulge too many raw numbers, but he said that Van der Poel set his all-time record for five-minute power en route to victory at Mûr-de-Bretagne on <a href=\"https://cyclingtips.com/2021/06/mathieu-van-der-poel-takes-an-emotional-victory-on-stage-2-of-the-tour-de-france/\" target=\"_blank\">stage 2</a>, holding <em>551 watts</em> over five minutes on the punchy climb – after 180 km of racing and having put in a prior attack too.</p>\n\n\n\n<p>According to De Kegel, there aren’t any holes in his entire power profile. As De Kegel put it, Van der Poel “has no real weak spots,” whether that’s “from five seconds all-out to 90 minutes. It’s stable, and good.”</p>\n\n\n\n<p>Over the next few weeks, Van der Poel will focus on leveraging that impeccable power profile towards his mountain bike goals. De Kegel says that Van der Poel already did his most serious training block at the altitude camp prior to the Olympics, allowing him to focus on getting dialed in other areas ahead of Tokyo.</p>\n\n\n\n<p>“We focus still a bit on heat adaptation and acclimatization in total for Tokyo, because we expect some specific demands, considering heat and things like that,” De Kegel said.</p>\n\n\n\n<p>We won’t have to wait long to see how things come together for Van der Poel off-road. He will take on the Olympic mountain bike event on July 26.</p>\n\n\n\n<p>Targeting an Olympic medal on the mountain bike a matter of weeks after wearing yellow at the Tour will be a challenge, but he’s Mathieu van der Poel, after all. He’s made a career out of delivering on the hype, even when the expectations are enormous.</p>\n\n\n\n<p>As you might expect, De Kegel sees it in training all the time. Even after three years of working with the Dutch star, De Kegel is constantly surprised by just how good Van der Poel is, and how much he continues to improve.</p>\n\n\n\n<p>“I always think, ‘This has to be, somewhere, the end,'” De Kegel said of Van der Poel’s peak power numbers. “Each time I see a new all-time record, the one-minute, five-minute, or 20-minute [power], whatever, I think, “This has to be it now. We need to do it with these kinds of values for the next three to four years.’ But then, each time, there comes a moment where he has a new challenge and the training comes together, and then you see a new value. I don’t know where this will end up.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/van-der-poels-coach-explains-what-makes-him-different-from-the-rest-of-us/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d682060c52e7f3b6f14e456d884de8d731a0a2352ff7adf6fe5b8cebcf3da66a","category":"Cycling"}