{"title":"Zuckerberg Now Claims Apple's App Tracking Transparency Rules Could Benefit Facebook","link":"https://www.macrumors.com/2021/03/18/zuckerberg-anti-tracking-benefit-facebook/","date":1616107877000,"content":"Despite campaigning heavily against Apple's upcoming anti-tracking rules, Facebook CEO Mark Zuckerberg today said that Facebook will \"be in a good position\" when Apple begins enforcing App Tracking Transparency and could even benefit from the changes.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Facebook-Feature.jpg\" alt=\"\" width=\"2250\" height=\"1266\" class=\"aligncenter size-full wp-image-786419\" />\r\n<br/>\r\n\"It's possible that we may even be in a stronger position if Apple's changes encourage more businesses to conduct more commerce on our platforms by making it harder for them to use their data in order to find the customers that would want to use their products outside of our platforms,\" Zuckerberg said in a Clubhouse meeting this afternoon.\r\n<br/>\r\n\r\n<br/>\r\nAs <em><a href=\"https://www.cnbc.com/2021/03/18/zuckerberg-facebook-may-be-in-stronger-position-after-apple-ios-14.html\">CNBC</a></em> points out, this is the most positive statement that Facebook has made yet about Apple's its App Tracking Transparency rules. It's possible that Facebook is changing its narrative as it has become clear that Apple has no plans to delay the implementation of App Tracking Transparency, and Facebook's attempts to stop it gave gained little steam.\r\n<br/>\r\n\r\n<br/>\r\nWith the launch <a href=\"https://www.macrumors.com/2021/02/01/apple-releases-ios-14-5-beta-1-to-developers/\">of iOS 14.5</a>, apps like Facebook will have to get express user permission before accessing an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>'s advertising identifier or IDFA, which is used to track usage across apps and websites for ad targeting purposes.\r\n<br/>\r\n\r\n<br/>\r\nFacebook has railed against Apple's planned privacy updates, taking out <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">full page newspaper ads</a> that aimed to position Apple as the <a href=\"https://www.facebook.com/business/apple-ios-14-speak-up-for-small-business\">enemy of small businesses</a>. Facebook has claimed that businesses that use Facebook's advertising tools will suffer because they won't be able to target ads as effectively as they can now, but there are questions about <a href=\"https://www.macrumors.com/2021/03/11/facebook-employees-app-tracking-transparency/\">how much data</a> small businesses need to get their ads in front of the right customers.\r\n<br/>\r\n\r\n<br/>\r\nApp Tracking Transparency will impact Facebook's view-through conversion tracking, which lets ad companies determine how many people saw an ad and didn't click it, but later made a purchase related to the ad. The IDFA allows Facebook to match up those who buy an item with those who saw an ad, but without the IDFA, advertisers will not be able to accurately measure the effectiveness of Facebook and Instagram ads.\r\n<br/>\r\n\r\n<br/>\r\nAccording to <em>CNBC</em>, Facebook has been preparing for App Tracking Transparency with the introduction of Facebook Shops and Instagram Shops, where brands can list and sell items directly on the social networks. Zuckerberg said that more than 250 million people are actively using the shops feature.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/18/zuckerberg-anti-tracking-benefit-facebook/\">Zuckerberg Now Claims Apple&#039;s App Tracking Transparency Rules Could Benefit Facebook</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/zuckerberg-now-claims-apples-app-tracking-transparency-rules-could-benefit-facebook.2288837/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=VoGl5GzipRg:Tl_Rq1en-J4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=VoGl5GzipRg:Tl_Rq1en-J4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/VoGl5GzipRg\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d69d06bd76be9fc38af356c8e8cde5fc06b4ac3764c29e058fb02e1df9e266f9","category":"Apple"}