{"title":"When it comes to solar farms, sheep are great groundskeepers","link":"https://arstechnica.com/?p=1806928","date":1635110805000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1226802459-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1226802459.jpg\">Enlarge</a> <span>/</span> Sheep may safely graze. (credit: <a href=\"https://www.gettyimages.com/detail/photo/solar-power-station-with-sheep-royalty-free-image/1226802459?adppopup=true\">Karl-Friedrich Hohl / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>What makes a good spot for livestock and a good spot for solar farms often overlaps. They’re both large, quite flat, and get a good amount of sun, being free from tall vegetation. As such, solar producers are increasingly leasing farm land for their operations.</p>\n<p>The increase in solar production has environmental benefits, but it can come at the price of diminished agriculture production. That’s why there’s a growing interest in finding ways of combining ag and solar production in one place. For Todd Schmit, an associate professor of agribusiness at Cornell University, this means bringing out the sheep.</p>\n<p>It’s still a new field (Editor’s note: pun so unintended that Doug didn’t even see it until I asked), but some farmers are partnering with solar producers, the former using the latter’s land for grazing. The solar producers pay farmers to ship their sheep over to their operations, and the sheep chow down on the weeds and other plants that might grow to the point they block the Sun from reaching the panels.</p></div><p><a href=\"https://arstechnica.com/?p=1806928#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1806928&amp;comments=1\">Comments</a></p>","author":"Doug Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d6a35b2210a67ff6d86c46a95232450a56fd81e6acf1994c2ea3de35d8a93d75","category":"Tech"}