{"title":"Business Model of TechCrunch","link":"https://markpeak.net/business-model-of-techcrunch/","date":1707979361000,"content":"<p>Danny Crichton อดีตบรรณาธิการบริหารของ TechCrunch (ปัจจุบัน<a href=\"https://www.luxcapital.com/people/danny-crichton\">ทำงานอยู่กับบริษัทลงทุน Lux Capital</a>) <a href=\"https://www.luxcapital.com/securities/techcrunch-plus-termination\">เขียนเล่าประวัติของ TechCrunch</a> หลังจาก<a href=\"https://www.adweek.com/media/techcrunch-shutters-subscription-layoffs/\">ประกาศปิดบริการเนื้อหาแบบสมาชิก TechCrunch+</a> ในช่วงปลายเดือนมกราคม ทำให้เรามีโอกาสเข้าใจเบื้องหลังโครงการธุรกิจของสื่อออนไลน์แบบ TechCrunch ได้ชัดเจนขึ้น</p>\n\n\n\n<p>คนที่ติตดามวงการ startup คงไม่มีใครไม่รู้จัก TechCrunch โดยประวัติย่อๆ ของเว็บคือ Michael Arrington ก่อตั้งในปี 2005 ในยุคที่ startup เริ่มบูมใหม่ๆ (ไล่ๆ กับโครงการบ่มเพาะอย่าง Y Combinator) ก่อนขายให้ AOL ในปี 2010 แล้วหลังจากนั้น Arrington ก็ไปทำอย่างอื่น เป็นนักลงทุน VC เหมือนเดิม ส่วน TechCrunch กลายเป็นสื่อที่รันโดยนักข่าวมืออาชีพที่เปลี่ยนไปตามยุคสมัย ไม่ใช่ founder-led อีกต่อไป</p>\n\n\n\n<p>นอกจากตัวสื่อหน้าเว็บแล้ว ผลิตภัณฑ์สำคัญของ TechCrunch ยังมีตัวงานสัมมนา Disrupt ที่เป็นต้นแบบของงานสัมมนาสาย startup ทั่วโลก และฐานข้อมูล Crunchbase ที่คอยเก็บสถิติการระดมทุนของบริษัท-นักลงทุนต่างๆ (ภายหลัง Crunchbase ถูก spinoff ไปเป็นอีกบริษัท)</p>\n\n\n\n<p>บทความของ Danny Crichton วิเคราะห์เบื้องหลังความสำเร็จในธุรกิจสื่อของ TechCrunch ว่าเป็นเพราะ “พื้นที่โฆษณา” ของ TechCrunch มีมูลค่าสูงเป็นพิเศษ เนื่องจากอยู่ในอุตสาหกรรมเฉพาะทาง (startup) ที่มีมูลค่าสูงและการแข่งขันสูง </p>\n\n\n\n<blockquote>\n<p>Its business secret was simple, but hard to replicate and equally hard to scale: its ad space was much more valuable than other digital media companies, and it had a terrific and consistent events business.</p>\n</blockquote>\n\n\n\n<p>จำนวนผู้อ่านของ TechCrunch อาจมีไม่มากเมื่อเทียบกับสื่อหัวใหญ่ๆ แบบดั้งเดิม (หรือแม้แต่สื่อออนไลน์อื่นๆ ในเครือ AOL เช่น Huffington Post ที่เป็นข่าวทั่วไป) แต่พื้นที่โฆษณากลับมีค่าดั่งทอง เพราะเป็นสนามรบระหว่าง disruptor ทั้งหลาย (พวก startup) และบริษัทใหญ่ๆ ที่กลัวการถูก disrupt</p>\n\n\n\n<blockquote>\n<p>On ads, TechCrunch became a key battleground between tech companies for the hearts and minds of its audience of early-stage founders, who might accidentally be locking in purchasing decisions worth hundreds of millions of dollars as they built their startups. Profitably for TechCrunch, its ads were bought to lock out competitors in massive, multi-billion dollar markets.</p>\n</blockquote>\n\n\n\n<p>แน่นอนว่าบริษัท startup เล็กๆ ไม่มีใครมีเงินมาลงโฆษณาหรอก แต่การที่ TechCrunch ลงข่าวของ startup เหล่านี้อย่างต่อเนื่องรัวๆ (ต้นทางใช้คำว่า beat) ทำให้บริษัทใหญ่ๆ ต้องมาลงโฆษณาแข่งในพื้นที่เดียวกัน ตรงนี้ Crichton บอกว่าพื้นที่โฆษณาของ TechCrunch มีมูลค่าแพงกว่า HuffPost ราว 5-10 เท่าเลยทีเดียว</p>\n\n\n\n<blockquote>\n<p>TechCrunch’s beat coverage is on new startups disrupting the old incumbents — and those incumbents wanted to be sure that no one forgot they were still in the fight. That gave TechCrunch key leverage on its ad space that few other digital media companies could match.</p>\n</blockquote>\n\n\n\n<p>ถ้าเจาะเข้ามาดูโครงสร้างคอนเทนต์ของ TechCrunch จะพบว่าทราฟฟิก 90% เข้าไปอ่านเรื่องของบริษัทใหญ่ๆ เช่น Facebook, Apple, Tesla โดยคอนเทนต์เหล่านี้มีต้นทุนต่ำมากในการผลิต เช่น เขียนบทความสั้นๆ ว่า Elon Musk โพสต์เรื่องอะไร ก็ได้มาแสนเพจวิวแบบง่ายๆ</p>\n\n\n\n<blockquote>\n<p>Critically, this coverage was eminently affordable. Writing up an article on the latest ravings of Elon Musk might take about 15 minutes (there usually wasn’t that much to say other than his statement, after all), but that one article could drive 100,000 page views or more.</p>\n</blockquote>\n\n\n\n<p>การผสมผสานระหว่างต้นทุนคอนเทนต์ราคาต่ำ กับพื้นที่โฆษณาราคาแพง กลายเป็นสูตรสำเร็จที่ทำให้ TechCrunch ไปได้ในเชิงธุรกิจ</p>\n\n\n\n<blockquote>\n<p>That was the secret treasure that funded the real in-depth reporting: cheap coverage of a big tech company coupled with the lucre of comparatively extraordinary ad revenue.</p>\n</blockquote>\n\n\n\n<p>ฝั่งคอนเทนต์สาย startup นั้นต้องใช้แรงเยอะกว่ากันมาก และมีฐานคนอ่านน้อยกว่ากันมาก ทำให้หลายสื่อคู่แข่งไม่สนใจทำคอนเทนต์ลักษณะนี้ (ซึ่งมีความเป็น “บริการกระจายข่าว” ที่แทบไม่สร้างรายได้) แต่กลับกลายเป็นว่าการทำข่าว startup ที่ไม่มีใครรู้จัก ทำให้ TechCrunch มีเครือข่ายของ CEO/founder ที่กว้างใหญ่มาก และกลายมาเป็นจุดต่างสำคัญของธุรกิจอีเวนต์</p>\n\n\n\n<blockquote>\n<p>Startup-related articles got a fraction of the readership of an article on Apple, since no one is searching on Google for the name of a startup they have never heard of before. So why bother? Indeed, many of TechCrunch’s now-dead competitors didn’t bother. The key insight though is that these articles attract the startup CEOs and founders, and it is precisely this demographic that is so valuable for advertisers. Startup coverage was a form of service journalism, and one that happened to create a perpetual revenue machine.</p>\n</blockquote>\n\n\n<div>\n<figure><img loading=\"lazy\" width=\"620\" height=\"408\" src=\"https://markpeak.net/wp-content/uploads/2024/02/disrupt.jpg\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/disrupt.jpg 620w, https://markpeak.net/wp-content/uploads/2024/02/disrupt-300x197.jpg 300w\" /></figure></div>\n\n\n<p>โมเดลธุรกิจของงานอีเวนต์ Disrupt ใช้วิธีขายบัตรราคาถูกให้ผู้ก่อตั้ง startup เล็กๆ แล้วขายบัตรราคาแพงให้บริษัทใหญ่ๆ เพื่อดึงดูดให้คนเจ๋งๆ รุ่นใหม่ๆ เข้ามาในงาน แล้วทำกำไรจากบริษัทใหญ่ที่อยาก “เข้ามาเป็นส่วนหนึ่ง” ของพื้นที่เดียวกัน</p>\n\n\n\n<blockquote>\n<p>Disrupt attracts around 10,000 attendees per year, and the fruits of that service journalism on startups kept on giving. Disrupt offered Founder Pass packages that were quite affordable even for the youngest companies, while charging eye-watering sums for business executives from legacy technology companies. The economic price discrimination is and was brilliant: make sure the “cool kids” are there, and then charge the so-called “grown-ups” to be around them.</p>\n</blockquote>\n\n\n\n<p>ในฝั่งต้นทุนอีเวนต์ยิ่งดีเข้าไปอีก เพราะ TechCrunch ไม่ต้องจ่ายเงินค่าพูดให้กับคนขึ้นเวทีเลย (ได้ขึ้นเวที ได้แสงก็คุ้มแล้ว), คนจัดการเวทีก็ใช้นักข่าวเองนั่นแหละ ประหยัดค่าพิธีกร และช่องทางการโฆษณาอีเวนต์ก็ผ่านสื่อหน้าเว็บของตัวเองอย่างเดียว ไม่ต้องไปทำโฆษณาอีเวนต์ผ่านทางอื่น</p>\n\n\n\n<blockquote>\n<p>TechCrunch’s events were more profitable compared to the industry norm since most of them were local to San Francisco, none of the speakers were paid, panels could be constructed by accomplished beat writers who already knew who should be there (greatly reducing the number of event planners required), and the site itself became the best advertising medium to sell tickets and sponsorships, vastly reducing marketing costs.</p>\n</blockquote>\n\n\n\n<p>อ่านแล้วเหมือนจะดีทุกอย่าง โลกสวยสดใส แต่ปัญหาของโมเดลธุรกิจ 2 ขา (สื่อ-อีเวนต์) มีปัญหาตรงที่มันสเกลรายได้ให้โตขึ้นเรื่อยๆ ได้ยาก เพราะบริษัทยักษ์ใหญ่ที่เป็นแหล่งเงินนั้นมีจำนวนจำกัด ฝั่งของอีเวนต์เองก็ไม่สามารถสร้างจำนวนงานให้ถี่กว่าเดิม หรือเพิ่มปริมาณคนเข้าร่วมได้อีกมากนัก</p>\n\n\n\n<blockquote>\n<p>The unique economics for TechCrunch around advertising and events funded the organization well, but they have an obvious flaw: they don’t really scale. There isn’t an infinite universe of big tech companies or venture-backed bubble companies willing to spend lavish sums on ad space. As for events, they rarely get better with ever more attendees, and it’s hard to replicate the scarce thrill of a flagship event multiple times per year.</p>\n</blockquote>\n\n\n\n<p>แต่เมื่อมีเป้าหมายเรื่องการเติบโตทางธุรกิจไปอีกเรื่อยๆ ทำให้ TechCrunch ต้องหาธุรกิจขาที่สาม นั่นคือ subscription (ตอนแรกใช้ชื่อว่า Extra Crunch ภายหลังเป็น TechCrunch+) โดยเป็นธุรกิจที่มีรายได้ค่อนข้างเสถียร (สมาชิกจ่ายเงินให้ต่อเนื่องทุกเดือน/ปี)</p>\n\n\n\n<blockquote>\n<p>Extra Crunch as a subscription offering was meant to be the stabilizing third leg of the revenue tripod. Ads and events are both heavily influenced by global macro factors, but subscription offered a route to more predictable long-term revenues.</p>\n</blockquote>\n\n\n\n<p>แนวทางคอนเทนต์ของ Extra Crunch คือนำเสนอเนื้อหาเกี่ยวกับบริษัท startup สักแห่งแบบเจาะลึก ทั้งเรื่องราวการก่อตั้ง และวิเคราะห์โมเดลธุรกิจ (ภายหลังโมเดล subscription ลักษณะนี้บูมขึ้นมาจาก Substack แต่ตอนนั้นไม่มีมากนัก)</p>\n\n\n\n<blockquote>\n<p>When we were conceiving the new product in late 2017 and early 2018, the idea was simple: offer compelling analysis of successful startups from both business and product lenses. That’s where the idea of an “EC-1” came from (named for the SEC Form S-1 filings for IPOs). TechCrunch would cover the founding stories of companies, but also the intricacies of their revenue models and unique product eccentricities</p>\n</blockquote>\n\n\n\n<p>อย่างไรก็ตาม ปัญหาของธุรกิจลักษณะนี้กลับไปอยู่ที่ต้นทุนในการผลิตคอนเทนต์นั้นแพงมาก (10,000 ดอลลาร์ต่อบทความ 10,000 คำ หรือตกคำละ 1 ดอลลาร์) แต่สิ่งที่เป็นปัญหายิ่งกว่านั้นคือ ต่อให้จ่ายแพงก็หาคนมาเขียนไม่ได้ เพราะนักข่าวสายธุรกิจล้มหายตายจากไปจากวงการแล้ว หลังยุคสื่อดิจิทัลมาทำลายสื่อสิ่งพิมพ์ธุรกิจลงไป เหลือแต่นักเขียนที่ทำงานให้สื่อการเงินใหญ่ๆ พวก Bloomberg, WSJ, FT เท่านั้น</p>\n\n\n\n<blockquote>\n<p>For digital media writers, these profiles were relatively plum assignments. Roughly 10,000 words, $10,000 or a dollar per word for freelancers, a travel budget.</p>\n\n\n\n<p>What was missing, in the end, were the writers themselves, a sociological puzzle that took about two years for me to understand. Thanks to digital media economics the past two decades, business journalism had been wrecked by downsizing, limiting or outright ending the careers of thousands of reporters.</p>\n</blockquote>\n\n\n\n<p>นักข่าวที่มาทำคอนเทนต์เชิงลึกแบบนี้ได้ ต้องใช้เวลาบ่มเพาะนาน ต้องมีความรู้ ความเชี่ยวชาญ ความสนใจในอุตสาหกรรมนั้นๆ อย่างมาก ซึ่งหายากมาก</p>\n\n\n\n<blockquote>\n<p>If you want to improve coverage of the automotive industry, an editor must seek out and develop a reporter who loves cars and understands how they get manufactured; what points of competition exist between companies; what auto economics are and how they are changing; and what disruption might look like for the industry in the years ahead. Passion plus perspective plus precision is asking a lot of one person or even a small band of reporters.</p>\n</blockquote>\n\n\n\n<p>และต่อให้หาคนที่เก่งระดับนี้ได้ ก็มีโอกาสโดนแย่งตัวสูง เพราะคนที่มีคุณสมบัติเหล่านี้สามารถไปทำงานในอุตสาหกรรมที่ “จ่ายดีกว่า” ได้ เช่น VC หรือไปทำงานกับแบรนด์ใหญ่ๆ ในอุตสาหกรรมนั้นๆ แหละ </p>\n\n\n\n<blockquote>\n<p>Even if you can find that talent, then the challenge becomes one of compensation. If someone understands the venture industry well enough, then they can almost certainly get a job at a VC firm and make a multiple of their media salary. Reporting on cloud infrastructure? They can triple their salary working at Amazon Web Services, without the daily doom of media layoffs</p>\n</blockquote>\n\n\n\n<p>แม้ว่า TechCrunch+ สามารถสร้างฐานสมาชิกได้ระดับหนึ่ง (หลักหมื่นคน) แต่ก็ไม่สามารถเติบโตได้อย่างที่คาดหวังในทางธุรกิจ ทำให้ต้องตัดสินใจเลิกทำธุรกิจนี้ไป</p>\n\n\n\n<p>ธุรกิจสื่อจำนวนมากมีความฝันอยากทำ subscription เพื่อเป็นโมเดลธุรกิจตรงระหว่างสื่อกับผู้อ่าน ไม่ต้องผ่านคนกลางอย่างการโฆษณา แต่ไม่ใช่ทุกคนที่ทำสิ่งนี้ได้สำเร็จ และเอาจริงๆ แล้วอาจมีเพียงสื่อใหญ่ๆ เพียงไม่กี่รายเท่านั้นที่คนยอมจ่ายเงินเป็นจำนวนมากพอ</p>\n\n\n\n<blockquote>\n<p>a media company that cannot convince enough readers to pay for it has a very limited time horizon in today’s world. Subscription offers a path to true sustainability by cutting every aggregator and middleman out of the equation and connecting an audience straight to a newsroom.</p>\n</blockquote>\n\n\n\n<p><a href=\"https://www.adweek.com/media/techcrunch-shutters-subscription-layoffs/\">บทความใน Adweek</a> บอกว่าสื่อหลายรายก็เลิกทำ subscription ไปแล้ว หรือผ่อนคลาย paywall ให้อ่านได้ง่ายขึ้น (<a href=\"https://markpeak.net/breaking-paywall/\">เคสของ Quartz เคยเขียนถึงไปแล้ว</a>)</p>\n\n\n\n<blockquote>\n<p>Time and Quartz both ended their digital subscription programs in recent years, while Business Insider and Gannett have loosened their paywalls to make more content widely accessible.</p>\n</blockquote>\n\n\n\n<p>ในฐานะคนทำสื่อไอทีเหมือนกัน ได้เห็นเบื้องหลังของ TechCrunch แล้วก็มองเห็นตัวเองซ้อนทับอยู่เยอะเหมือนกัน แถมบริบทของไทยที่เรื่อง subscription ทำได้ยากกว่ากันมาก ก็ถือเป็นความท้าทายในภาพใหญ่ของธุรกิจสื่อว่าจะเดินหน้าไปในรูปแบบไหนต่อ</p>The post <a href=\"https://markpeak.net/business-model-of-techcrunch/\">Business Model of TechCrunch</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"d6a37ebbbfb589193f78ea20a97f72efa0382c3709518079bff666814bcd72b5","category":"Thai"}