{"title":"Development of SSR markers for genetic diversity analysis and species identification in <i>Polygonatum odoratum</i> (Mill.) Druce based on transcriptome sequences","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308316","date":1727100000000,"content":"<p>by Gen Pan, Jing Xie, Yuhui Qin, Shuihan Zhang</p>\r\n\r\n<i>Polygonatum odoratum</i> (Mill.) Druce is a well-known traditional Chinese herb belonging to the <i>Polygonatum</i>. However, the understanding of the genetic diversity of this species at the molecular level is limited due to the lack of transcriptomic and genomic information. In this study, 37,387 unigenes were assembled based on the transcriptome sequencing of the rhizome of <i>Polygonatum odoratum</i> (Mill.) Druce., and 11,021 single- sequence repeats (SSR) motifs, mainly consisting of single-nucleotide repeats (44.44%), dinucleotides (31.06%), and trinucleotides (22.59%), were identified. Based on these SSR motifs, 9,987 primer pairs of SSR markers were designed and 68 SSR markers were randomly selected for verification, of which 21 SSR markers showed polymorphisms among the 24 <i>Polygonatum odoratum</i> germplasms. Ninety-four alleles were detected: the observed alleles ranged from 2 to 11, the effective alleles varied from 1.086 8 to 4.916 8, the Shannon diversity index was 0.173 2~1.749 7, and the polymorphism information content PIC ranged from 0.076 7 to 0.803 9. Based on our analysis of genetic diversity (SSR genotypes) and population structure, we divided the 24 germplasm resources into two groups, indicating that the germplasm with similar geographical origins can be grouped together. In addition, the primers ‘YZ14’ and ‘YZ47’ could effectively distinguished the related species: <i>Polygonatum kingianum</i> Coll.et Hemsl., <i>Polygonatum sibiricum</i> Red., <i>Polygonatum cyrtonema</i> Hua, <i>Polygonatum zanlanscianense</i> Pamp. and <i>Polygonatum odoratum</i> (Mill.) Druce. This is the first study in which a dataset of expressed sequence tag (EST)-SSR markers is constructed for the <i>Polygonatum odoratum</i> (Mill.) Druce, and these newly developed EST-SSR markers provided a very efficient tool for genetic relationship analysis, species identification and marker-assisted selection breeding of <i>Polygonatum odoratum</i> (Mill.) Druce.","author":"Gen Pan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d6acc19789f18df72f22f1c98c0bab28cc782847d13179e665f3c1387b3babb1","category":"Interdisciplinary"}