{"title":"An Improved Method of Mitigating Orbital Errors in Multiple SAR Interferometric Pairs Analysis for Interseismic Deformation Measurement: Application to the Tuosuo Lake Segment of the Kunlun Fault","link":"https://www.preprints.org/manuscript/202405.1560/v1","date":1716466526000,"content":"It is challenging to precisely measure the slow interseismic crustal deformation rate from SAR data. The long-wavelength orbital errors, owing to the uncertainties in satellite orbit vectors, commonly exist in SAR interferograms, which degrade the precision of the InSAR products and become the main barrier of extracting interseismic tectonic deformation. In this study, we propose a novel temporal network orbital correction method that is able to isolate the far-fault tectonic deformation from the mixed long-wavelength signals based on its spatio-temporal characteristic. The proposed approach is straightforward in methodology but could effectively separate the subtle tectonic deformation from glaring orbital errors without ancillary data. Both synthetic data and real Sentinel-1 SAR images are used to validate the reliability and effectiveness of this method. The derived InSAR velocity fields clearly present the predominant left-lateral strike-slip motions of the Tuosuo Lake segment of the Kunlun fault in western China. The fault-parallel velocity differences of 5-6 mm/yr across the fault between areas ~50 km away from the fault trace are addressed. The proposed method presents significantly different performance from traditional quadratic approximate method in the far-field. Through the implementation of the proposed method, the RMSE between the LOSGPS and our derived descending InSAR LOS is reduced to less than one-third of the previous study, suggesting its potential to enhance the availability of InSAR technology for interseismic crustal deformation measurement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d6aee372435ce45f2da75c71848eb39db982a35abe70d3f5625ab6f8cd25c9b5","category":"Interdisciplinary"}