{"title":"ก.คลังสหรัฐ แบนบริษัทจีน 8 รายเกี่ยวข้องสอดส่องอุยกูร์, DJI โดนคำสั่งห้ามลงทุน","link":"https://www.blognone.com/node/126359","date":1639712458000,"content":"<div><div><div><p>กระทรวงการคลังสหรัฐ (Department of the Treasury) ออกคำสั่งแบนบริษัทเทคโนโลยีจีน 8 ราย ที่สนับสนุนการสอดส่องชาวมุสลิมอุยกูร์ ในมณฑลซินเจียงของประเทศจีน</p>\n<p>คำสั่งแบนนี้มีผลให้บุคคลในสหรัฐอเมริกา ไม่สามารถซื้อหรือขายหุ้นของบริษัทเหล่านี้ในตลาดหลักทรัพย์ได้</p>\n<p>บริษัทเทคโนโลยีจีนทั้ง 8 รายได้แก่</p>\n<ul>\n<li>Cloudwalk Technology Co., Ltd. ผู้พัฒนาซอฟต์แวร์จดจำใบหน้า ที่รัฐบาลจีนใช้จดจำชาวทิเบตและอุยกูร์</li>\n<li>Dawning Information Industry Co., Ltd. ผู้พัฒนาระบบ big data ให้กองทัพจีน</li>\n<li>Leon Technology Company Limited ผู้พัฒนาระบบสอดส่องให้รัฐบาลจีน</li>\n<li>Megvii Technology Limited ผู้พัฒนาระบบสอดส่อง โดยเฉพาะระบบ AI แยกแยะบุคคล <strong>ข้อมูลจากรัฐบาลสหรัฐระบุว่าเทคโนโลยีของ Megvii ส่งมาขายในประเทศไทยด้วย</strong></li>\n<li>Netposa Technologies Limited ผู้พัฒนาฐานข้อมูลใบหน้า ที่มีทั้งข้อมูลใบหน้าและ GPS ตามพิกัด ใช้กับคน 2.5 ล้านคนในซินเจียง</li>\n<li>SZ DJI Technology Co., Ltd. ผู้ผลิตโดรนรายใหญ่ของโลก ให้หน่วยงานซินเจียงใช้บินโดรนสอดส่อง</li>\n<li>Xiamen Meiya Pico Information Co., Ltd. ผู้พัฒนาแอพมือถือสำหรับตามรอยข้อมูลในมือถือของประชาชน</li>\n<li>Yitu Limited. ผู้พัฒนาระบบจดจำใบหน้า และใช้กับกล้องวงจรปิดในประเทศจีน</li>\n</ul>\n<p><a href=\"https://www.blognone.com/node/120184\">กรณีของ DJI เคยถูกกระทรวงพาณิชย์ของสหรัฐสั่งแบนทำการค้ามาแล้วตั้งแต่ปี 2020</a> คำสั่งนี้ของกระทรวงการคลังเป็นการแบนห้ามซื้อขายหุ้นด้วย</p>\n<p><img src=\"https://i.imgur.com/eki4J9M.jpg\" /></p>\n<p>ที่มา - <a href=\"https://home.treasury.gov/news/press-releases/jy0538\">U.S. Department of the Treasury</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dji\">DJI</a></div><div><a href=\"/topics/usa\">USA</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/drone\">Drone</a></div><div><a href=\"/topics/surveillance\">Surveillance</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d6c209536c29d0e451b7d665a6fb3aa0ae091295b36f7e57733686ff1cfe4cf2","category":"Thai"}