{"title":"The weak genetic structure of Melolontha melolontha (L.) and Melolontha hippocastani (Fabr.), two important forest pests, indicates their large population sizes and effective gene flow","link":"https://academic.oup.com/forestry/article/97/5/692/7606133?rss=1","date":1707523200000,"content":"<span><div>Abstract</div>Cockchafers <span>Melolontha</span> spp. are polyphagous root pests and outbreak species of considerable economic importance to forestry in Europe. Knowledge of genetic diversity within and between cockchafer populations is largely unexplored but could lead to more effective monitoring and management strategies of these pests. In this study, we fill several gaps in the knowledge of the genetic population structure of <span>Melolontha melolontha</span> and <span>Melolontha hippocastani</span>. Using microsatellite loci and over 200 individuals per species, we examined the genetic structure of <span>Melolontha</span> spp. populations collected from three primary outbreak areas in central and southeastern Poland. We demonstrated that our focal species share some common genetic patterns, such as considerable genetic diversity within subpopulations (within sampling sites) with minor effects of past bottlenecks possibly masked by current population sizes. The estimates of effective population sizes, although subject to wide credibility intervals, indicated a large number of individuals contributing to further generations of the population. The migration rates exceed the threshold of one per generation required for gene flow and maintenance of population equilibrium, indicating limited impact from forest management practices on either cockchafer species. While genetic differentiation was observed in <span>M. melolontha</span> populations, supported by various indices (fixation index, principal coordinate analysis, assignment tests), the <span>M. hippocastani</span> populations were genetically similar. This disparity may hint at the potential historical divergence between these species. In this aspect, more detailed phylogeographic and population genetic studies covering a large area of the Palaearctic distributions of both species are required. Our findings constitute one of the initial efforts aimed at delineating the genetic diversity, differentiation, population structure, gene flow, and migration patterns within <span>Melolontha</span> spp. This exploration is especially significant for <span>M. hippocastani</span>, given its completely unexplored genetic population structure.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"d6c85f6b46379d4d860c407d008fa010d8f0570deea13bd711d7be07e5abd3b4","category":"Environment"}