{"title":"An Improved Large Kernel-Based Remote Sensing Land Cover Segmentation Algorithm","link":"https://www.preprints.org/manuscript/202405.1035/v1","date":1715772714000,"content":"Land cover segmentation, a fundamental task within the domain of remote sensing, boasts a broad spectrum of application potential. In this article, we focus on the land cover segmentation tasks and complete the following research work: Firstly, to address the issues of uneven distribution of foreground and background and significant differences in target scales in remote sensing images, we propose a decoder called MDCFD based on multi-dilation rate convolution fusion. The decoder utilizes dilated convolution to expand the receptive field, enhancing the model's ability to capture global features and thus improving the model's ability to distinguish between foreground and background. Meanwhile, we design a multi-dilation rate convolution fusion module (MDCFM), which fuses the outputs of different dilation rate convolution layers. Secondly, aiming at the problems of diverse scenes, significant differences between categories, and many background interferences in remote sensing images, we propose a hybrid attention module called LKSHAM based on large kernel convolution. This module combines spatial attention and channel attention mechanisms and combines the two attention modules in series. By introducing large kernel convolution, the model's ability to extract contextual information is improved. At the same time, we adopt a strategy of decomposing large kernel convolution into multiple depthwise convolutions to reduce computational complexity. The improved network models designed by this paper can achieve an improvement of over 1.1% in the mIoU metric on segmentation tasks on the Potsdam and Vaihingen datasets.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d6d7b2204699ceb70cbb13ab5ad6e356c9c7f90496858f49e91c9c6d4dea2132","category":"Interdisciplinary"}