{"title":"YouTube Premium and Music Surpasses 50 Million Subscribers","link":"https://www.macrumors.com/2021/09/03/youtube-music-premium-50-million/","date":1630660786000,"content":"YouTube says it has passed 50 million subscribers for its Premium and Music subscriptions, making it the \"fastest growing music subscription\" service in the world, <a href=\"https://blog.youtube/news-and-events/50-million/\">according</a> to YouTube's global head of music, Lyor Cohen. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/youtube.jpg\" />\r\n<br />\r\nYouTube says that it has more than 50 million paying subscribers collectively across YouTube Premium and YouTube Music. The Google-owned service says it attributes this milestone to several factors, but mainly due to how subscribers can get \"uninterrupted access to the largest and most diverse catalogue of music, artists and culture\" through its subscriptions.\r\n<br />\r\n<blockquote>We've got killer products in YouTube Music and YouTube Premium that deliver truly unique value to artists and creators and the best experience for music fans and video lovers. We're in our own lane -- there's no other place where fans can get uninterrupted access to the largest and most diverse catalogue of music, artists and culture. We're making it easy for music fans to go deep and find their thing -- whether that's on YouTube or the YouTube Music app. </blockquote>YouTube Music comes as part of a YouTube Premium subscription but can also be purchased standalone. With YouTube Premium, customers can download videos for offline viewing, play videos in the background playback, no ads, and more. \r\n<br />\r\n\r\n<br />\r\nYouTube Music is one of many competitors to <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, and it's hard to name a winner purely based on subscriber count. Apple doesn't provide specific subscriber figures, but the latest estimate was <a href=\"https://www.macrumors.com/2019/06/27/apple-music-60-million-paid-subscribers/\">60 million subscribers in 2019</a>. Three years on, the number is likely higher. Additionally, <a href=\"https://www.macrumors.com/guide/apple-one/\">Apple One</a>, which bundles ‌Apple Music‌ with other Apple's services, makes it harder to determine how many ‌Apple Music‌ subscribers are out there. <div>Tags: <a href=\"https://www.macrumors.com/guide/youtube/\">YouTube</a>, <a href=\"https://www.macrumors.com/guide/youtube-music/\">YouTube Music</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/03/youtube-music-premium-50-million/\">YouTube Premium and Music Surpasses 50 Million Subscribers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/youtube-premium-and-music-surpasses-50-million-subscribers.2309602/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=L39eJplwM4o:QN14SaG8qIc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=L39eJplwM4o:QN14SaG8qIc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/L39eJplwM4o\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d6e792fabb33807e16e1889f0dc7cbade64c57e2976caa4ef67698aa63d80840","category":"Apple"}