{"title":"New – Amazon EBS Snapshots Archive","link":"https://aws.amazon.com/blogs/aws/new-amazon-ebs-snapshots-archive/","date":1638233343000,"content":"<p>I am pleased to announce the availability of Amazon EBS Snapshots Archive, a new storage tier for the long-term retention of <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (EBS)</a> snapshots of your EBS volumes.</p> \n<p>In a nutshell, EBS is an easy-to-use high-performance block storage service for your <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> instances. An EBS volume mounted to your EC2 instances lets you boot an operating system and store data for your most performance-demanding workloads. You may use EBS snapshots to create point-in-time copies of your volume data. The first snapshot of a volume contains all of the data written into that volume. Subsequent snapshots are incremental. Snapshots are stored on <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>, and they may be shared between AWS accounts and AWS Regions.</p> \n<p>The ability to take frequent snapshots and easily restore volumes makes EBS snapshots an obvious choice for your data management strategy, alongside other backup options. The incremental nature of snapshots makes them cost-effective for daily and weekly backups that need immediate restores. However, you were telling us that business compliance and regulatory needs have meant that you needed to retain EBS snapshots for longer periods of time (months or years). For example, snapshots taken at the end of a project, or snapshots for test and development preserved for future project releases. The vast majority of these snapshots are taken and never read. For these snapshots, you are looking to lower your storage costs. Today, to benefit from lower storage costs, you may have written complex scripts involving temporary EC2 instances to restore snapshots, mount the corresponding volumes, and transfer the data to lower-cost storage tiers, such as <a href=\"https://aws.amazon.com/glacier/\">Amazon Glacier</a>.</p> \n<p>EBS Snapshots Archive provides a low-cost storage tier to archive full, point-in-time copies of EBS Snapshots that you must retain for 90 days or more for regulatory and compliance reasons, or for future project releases. Now, you can easily archive and manage EBS Snapshots, thereby eliminating the need for custom scripts and third-party tools to manage these snapshots. This lets you move your rarely accessed snapshots to EBS Snapshots Archive to achieve up to 75% lower storage costs, and avoid licensing costs for third-party tools. Furthermore, you can retrieve an archived snapshot within 24-72 hours, and, once restored, use the snapshot to recover an EBS volume.</p> \n<p>As per usual, let me show you how it works.</p> \n<p><span><strong>How to Get Started<br /> </strong></span>I have a snapshot available in the US East (N. Virginia) Region, and I want to archive this snapshot for compliance reasons. I open the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, navigate to <strong>EC2</strong>, then to <strong>Snapshots</strong>. I select the snapshot I want to archive, and select the <strong>Actions</strong> menu. I select the <strong>Archive snapshot</strong> menu option.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-32-05.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-32-05-1024x403.png\" /></a></p> \n<p>I carefully read the confirmation message :-), and I select <strong>Archive snapshot</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-32-17.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-32-17-1024x579.png\" /></a></p> \n<p>I may monitor the progress of the archive operation with the new <strong>Storage Tier</strong> tab at the bottom of the screen. After some time, depending on the size of the snapshot, the <strong>Tiering status</strong> becomes <img src=\"https://s.w.org/images/core/emoji/12.0.0-1/72x72/2705.png\" /> <strong>Archival completed</strong>.<strong><br /> </strong></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-51-26.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-51-26-1024x399.png\" /></a>Archived snapshots stay visible in the console. The new <strong>Storage tier</strong> column indicates the tier used for storage (Standard or Archive).</p> \n<p><span><strong>How do I Restore a Volume?</strong></span><br /> Restoring a volume from EBS Snapshots Archive is a two-step process. First, I retrieve the snapshot from EBS Snapshots Archive to its original snapshot ID, using <code>RestoreSnapshotTier</code> API call or the management console. It takes between 24-72 hours to retrieve the snapshot from the archive, depending on the snapshot size. Once retrieved, the snapshot appears as a regular snapshot on my account. At this stage, I hydrate the retrieved snapshot into an EBS volume using the default snapshot restore or <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-fast-snapshot-restore.html\">Fast Snapshot Restore</a> (FSR) for expedited restores, just like usual.</p> \n<p>A <a href=\"https://aws.amazon.com/cloudwatch/\">CloudWatch</a> event is generated when the snapshot is restored. You may listen to this event to avoid pulling the status with the API.</p> \n<p>A <code>CreateVolume</code> API call on an archived snapshot will fail. You must restore a snapshot from archive before you use it to create a volume.</p> \n<p>Using the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, I select the snapshot that I want to restore, I select the <strong>Actions</strong> menu, and then I select the <strong>Restore snapshot from archive</strong> menu option.<strong><br /> </strong></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-57-05.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-57-05-1024x502.png\" /></a></p> \n<p>I have the choice to restore the snapshot permanently, or just temporarily. At the end of the temporary duration, the standard tier snapshot is deleted, and only the archive is preserved.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-57-31.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/18/2021-11-18_21-57-31-1024x770.png\" /></a></p> \n<p>After a while, depending on the snapshot size, the archive is restored to standard storage and may be used to recreate a volume, just like usual. I may monitor the progress of the retrieval and the lifetime for temporarily restored archives in the new <strong>Storage tier</strong> tab in the bottom half of the screen. Temporary restored snapshots may be kept for up to 180 days.</p> \n<p><span><strong>Pricing and Availability<br /> </strong></span>EBS Snapshots Archive is available for you today in 17 AWS Regions. At the time of launch, it is not available in the two Regions in China, Asia Pacific (Seoul), Asia Pacific (Osaka), Canada (Central), and South America (São Paulo).</p> \n<p>As per usual, you pay as-you-go, with no minimum or fixed fees. There are two metrics that influence EBS Snapshots Archive billing: data storage and data retrieval. We charge you $0.0125 per GB-month of stored data and $0.03 per GB retrieved. You are charged for a 90-day period at minimum. This means that if you delete a snapshot archive or permanently restore it less than 90 days after creation, then we charge for the full 90-day period. <a href=\"https://aws.amazon.com/ebs/pricing/\">The EBS pricing page has the details</a>.</p> \n<p>Go ahead and <a href=\"https://console.aws.amazon.com/ec2/v2/home#Snapshots:visibility=owned-by-me;sort=snapshotId\">start to configure your long term storage for EBS snaphots</a> today.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d6ef24d697c29340a963d12c1effca12266d8f38c42686c8a2d49b7a440f81d3","category":"Tech"}