{"title":"Synergistic effects of ferulic acid esterase‐producing lactic acid bacteria, cellulase and xylanase on the fermentation characteristics, fibre and nitrogen components and microbial community structure of Broussonetia papyrifera during ensiling","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13239?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The high fibre content of whole plants of <i>Broussonetia papyrifera</i> limits its efficient utilization. Ferulic acid esterase (FAE), in combination with xylanase, can effectively cleave the lignin–carbohydrate complex, promoting the function of cellulase. However, little is known about the impact of these additives on silage. To effectively utilize natural woody plant resources, FAE-producing <i>Lactiplantibacillus plantarum</i> RO395, xylanase (XY) and cellulase (CE) were used to investigate the dynamic fermentation characteristics, fibre and nitrogen components and microbial community structure during <i>B. papyrifera</i> ensiling.</p>\n<h2>RESULTS</h2>\n<p><i>Broussonetia papyrifera</i> was either not treated (CK) or treated with FAE-producing lactic acid bacteria (LP), CE, XY, LP + CE, LP + XY or LP + CE + XY for 3, 7, 15, 30 or 60 days, respectively. In comparison with those in the CK treatment, the <i>L. plantarum</i> and enzyme treatments (LP + CE, LP + XY and LP + XY + CE), especially the LP + XY + CE treatment, significantly increased the lactic acid concentration and decreased the pH and the contents of acid detergent insoluble protein and NH<sub>3</sub>-N (<i>P</i> &lt; 0.05). Enzyme addition improved the degradation efficiency of lignocellulose, and a synergistic effect was observed after enzyme treatment in combination with LP; in addition, the lowest acid detergent fibre, neutral detergent fibre, hemicellulose and cellulose contents were detected after the LP + CE + XY treatment (<i>P</i> &lt; 0.05). Moreover, CE, XY and LP additions significantly improved the microbial community structure, increased the relative abundance of <i>Lactiplantibacillus</i> and Firmicutes, and effectively inhibited undesirable bacterial (<i>Enterobacter</i>) growth during ensiling.</p>\n<h2>CONCLUSION</h2>\n<p>FAE-producing <i>L. plantarum</i> and the two tested enzymes exhibited synergistic effects on improving the quality of silage, which indicates that this combination can serve as an efficient method for improved <i>B. papyrifera</i> silage utilization. © 2023 Society of Chemical Industry.</p>","author":"Qiang Yu, \nJinyi Xu, \nMengxin Li, \nYulong Xi, \nHong Sun, \nYixiao Xie, \nQiming Cheng, \nPing Li, \nChao Chen, \nFuyu Yang, \nYulong Zheng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"d6f2191cb519943a83d9537cee0dcb9d554e7502870aac3a3aec98026236993f","category":"Environment"}