{"title":"Charting the Ethical Frontier in Newborn Screening: Insights from the NBSTRN ELSI Researcher Needs Survey","link":"https://www.preprints.org/manuscript/202403.1068/v1","date":1710840147000,"content":"From 2008 to 2024, the Newborn Screening Translational Research Network (NBSTRN), part of the National Institute of Child Health and Human Development (NICHD) Hunter Kelly Newborn Screening Program, served as a robust infrastructure to facilitate groundbreaking research in newborn screening (NBS), rare disease, and genomics. Over fifteen years, NBSTRN developed into a significant international network, supporting innovative research on novel technologies to screen, diagnose, treat, manage, and understand the natural history of more than 280 rare diseases. A key component of these efforts has been the development of resources and expertise for the newborn screening community in ethical, legal, and social issues (ELSI). This paper presents findings from a survey conducted by the NBSTRN team with input from one of theNBSTRN's expert workgroups, the Bioethics and Legal Workgroup. With responses from 88 members of the NBS community including researchers and state NBS programs, the survey found that individuals rely on internal and collegial ELSI resources and highlighted a substantial demand for structured, accessible training and resources. The survey’s insights emphasize the importance of privacy and informed consent in NBS research, and suggested a need for improved collaborative tools and educational programs focused on ELSI for the NBS community. The survey results may inform future efforts in ELSI and NBS research including the development of expanded ELSI tools that leverage digital platforms and consultative services.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d6fd8664a942f76dbc3e7102a9fe0698bfcda9222a7f0befbb5e18a66f935e3b","category":"Interdisciplinary"}