{"title":"ชุมชนคริปโตฮังการี เตรียมสร้างอนุสาวรีย์ Satoshi Nakamoto ผู้สร้างบิตคอยน์ กลางกรุงบูดาเปสต์","link":"https://www.blognone.com/node/122835","date":1621925245000,"content":"<div><div><div><p>Satoshi Nakamoto คือนามแฝงที่อยู่บน White Paper เอกสารชี้แจงจุดประสงค์และอธิบายการทำงานของบิตคอยน์ ปัจจุบันยังไม่มีใครรู้ว่าตัวจริงของเขาเป็นใครกันแน่ เขาส่งข้อความถึงเหล่านักพัฒนาเป็น<a href=\"https://www.forbes.com/sites/peterizzo/2021/04/26/10-years-ago-today-bitcoin-creator-satoshi-nakamoto-sent-his-final-message/?sh=2180233e10dd\">ครั้งสุดท้ายในวันที่ 26 เมษายน ปี 2011</a> หรือราว 10 กว่าปีมาแล้ว แล้วหายสาบสูญไป</p>\n<p>ล่าสุด 4 เว็บไซต์และองค์กรบิตคอยน์ในฮังการี คือ Mr.Coin เว็บกระดานเทรดบิตคอยน์, Crypto Academy เว็บคอร์สออนไลน์สอนเกี่ยวกับคริปโต, Blockchain Hungary Association สมาคมบล็อกเชนฮังการี และ Blockchain Budapest สมาคมบล็อกเชนประจำเมืองหลวง รวมเงินกับเงินบริจาคของสมาชิกชุมชนคริปโตในฮังการีทั้งหมด 10,556.94 ดอลลาร์ หรือราว 331,000 บาท เป็นทุนให้ศิลปิน Réka Gergely และ Tamás Gilly สร้างรูปปั้นครึ่งตัวของ Satoshi Nakamoto ตาม<a href=\"https://gyorfiandras.blog.hu/2021/04/15/szoborallitas_a_bitcoin_alkotojanak\">ไอเดียของ András Györfi</a> นักข่าวสายคริปโตชาวฮังการี</p>\n<p>ลักษณะของรูปปั้นจะยังเป็นบุคคลลึกลับ แต่ส่วนใบหน้าจะทำจากวัตถุสะท้อนคล้ายกระจก ที่สามารถสะท้อนใบหน้าผู้ที่ผ่านไปผ่านมาได้ ตามไอเดียที่ว่า Satoshi Nakamoto จะเป็นใครก็ได้ในโลกนี้ และสะท้อนเอกลักษณ์ความ Decentralized หรือการเป็นเงินไร้ศูนย์กลางของบิตคอยน์ โดยรูปปั้นจะตั้งอยู่ในกรุงบูดาเปสต์ และยังไม่มีกำหนดการเสร็จสิ้น</p>\n<p>ที่มา - <a href=\"https://www.entrepreneur.com/article/372770?utm_source=feedly&amp;utm_medium=webfeeds\">Entrepreneur.com</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d6e2d1f8f613fa0a837656e07f816012.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bitcoin\">Bitcoin</a></div><div><a href=\"/topics/hungary\">Hungary</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d6fea94f5a2630667f1476ad2e8047aae619b8677ec79d1936fffb886285c181","category":"Thai"}