{"title":"TRBP, a Major Component of the RNAi Machinery, Is Subjected to Cell Cycle-dependent Regulation in Human Cancer Cells of Diverse Tissue Origin","link":"https://www.preprints.org/manuscript/202410.0640/v1","date":1728477803000,"content":"Transactivation Response Element RNA-binding Protein (TRBP) is a double-stranded RNA-binding protein widely known for its critical contribution to RNA interference (RNAi), a conserved mechanism of gene-expression regulation mediated through small non-coding RNA moieties (ncRNAs). Nevertheless, TRBP has proved to be also involved in other molecular pathways and biological processes, such as cell growth, organism development, spermatogenesis and stress response. Mutations or aberrant expression of TRBP have been previously associated with diverse human pathologies, including Alzheimer’s disease, Cardiomyopathy and Cancer, with TRBP playing essential role(s) in proliferation, invasion and metastasis of tumor cells. Hence, the present study aims to investigate new, still elusive, functions and properties of TRBP, particularly regarding its cell cycle-dependent regulation during cancer-cell division. Our results unveil, for the first time, the tight and remarkable, mitosis-dependent, control of TRBP protein expression, as clearly evidenced by the lack of its immunofluorescence-facilitated detection, during mitotic phases, in several human cancer-cell lines of different tissue origin. Notably, the obtained TRBP-downregulation patterns seem to derive from molecular mechanisms that act independently of oncogenic activities (e.g., malignancy grade), metastatic capacities (e.g., low versus high) and mutational signatures (e.g., p53-/- or p53ΔΥ126) of cancer cells. Taken together, we, herein, propose that TRBP serves as a novel cell cycle-dependent regulator, likely exerting mitosis-suppression functions, and, thus, its mitosis-specific downregulation can hold strong promise to be exploited for the efficient and successful prognosis, diagnosis and (radio-/chemo-)therapy of diverse human malignancies, in the clinic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d6ff98b5b3c86a09d056c8069a71ded40c7bf4120d05ab66975b4d14436c026f","category":"Interdisciplinary"}