{"title":"The Antitumoral Effect In Ovo of a New Inclusion Complex from Dimethoxycurcumin with Magnesium and Beta-Cyclodextrin","link":"https://www.preprints.org/manuscript/202403.0909/v1","date":1710497497000,"content":"Abstract: Breast cancer is one of the leading causes of death in the female population due to the re-sistance of cancer cells to many anticancer drugs used. Curcumin has cytotoxic activities against breast cancer cells, although it has limited use due to its poor bioavailability and rapid metabolic elimination. The synthesis of metal complexes of curcumin and curcuminoids is a relevant topic in the search for more active and selective derivatives of these molecular scaffolds. However, solubil-ity and bioavailability are concomitant disadvantages of these types of molecules. To overcome such drawbacks, the preparation of inclusion complexes offers a chemical and pharmacologically safe option for improving the aqueous solubility of organic molecules. Herein, we describe the preparation of the inclusion complex of dimethoxy curcumin magnesium complex with cyclodex-trin (DiMeOC-Mg-BCD, 5) in the stoichiometric relationship 1:1. This new inclusion complex's solubility in aqueous media (PBS) was improved by a factor of 6x over the free metal complex (DiMeOC-Mg). Furthermore, 5 affects cell metabolic rate, cell morphology, cell migration, induced apoptosis, and downregulation of the MMP-2 and MMP-9, IL-6, and STAT3 expression levels on MDA MB 231 cell lines. Results of an antitumor assay in an in-ovo model showed up to 30% inhi-bition of tumour growth for breast cancer (MDA-MB-231) when using 5 (0.650 mg/Kg dose), and 17.29 % inhibition with the free homoleptic metal complex (1.5 mg/Kg dose, DiMeOC-Mg). While the formulation of inclusion complexes from metal complexes of curcuminoids demonstrates its usefulness in improving the solubility and bioavailability of these metallodrugs, the new DiMeOC-Mg-BCD exhibits excellent potential for use as a therapeutic agent in the battle against breast cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d700c7fc10e82a9c3e3517ac1f25250206c9dc8ed4505aa27bcadbdd1989e4c1","category":"Interdisciplinary"}