{"title":"Review: Sonnet's Latest eGPU Breakaway Pucks Give Your Intel Mac a Graphics Boost and Extra Connectivity","link":"https://www.macrumors.com/review/sonnet-egpu-breakaway-pucks/","date":1616180985000,"content":"Back in January, Sonnet announced <a href=\"https://www.macrumors.com/2021/01/06/sonnet-announces-egpu-docks-with-amd-radeon/\">updated versions of its eGPU Breakaway Pucks</a>, offering <a href=\"https://www.sonnettech.com/product/egpu-breakaway-puck/overview.html\">new options equipped with Radeon RX 5500 XT and RX 5700 graphics processors</a> for Intel-based Macs. The docks connect to a host Mac over Thunderbolt 3 and allow for more powerful graphics capabilities than the included graphics in many Macs while also providing some dock capabilities such as additional USB ports and display connections.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/sonnet-pucks.jpg\" alt=\"\" width=\"1600\" height=\"898\" class=\"aligncenter size-full wp-image-789186\" />\r\n<br/>\r\nI've been testing out both versions of the Breakaway Puck for a few weeks now, and I've found that they do offer significantly better graphics performance, particularly if you're using an older machine like the 2016 15-inch MacBook Pro with Radeon Pro 450 graphics that I use as my main machine.\r\n<br/>\r\n\r\n<br/>\r\nBoth models of the eGPU Breakaway Puck have the same design, featuring a metal enclosure with perforations on the top, front, and sides to help ventilate the dock, which can get quite hot during heavy usage. A large fan is designed to exhaust heat out through the top of the dock, and it will cycle on and off as needed.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/sonnet-puck-front.jpg\" alt=\"\" width=\"1600\" height=\"836\" class=\"aligncenter size-full wp-image-789187\" />\r\n<br/>\r\nThe docks measure in at about 6 inches by 5 inches and about 2 inches high, so a bit larger than some standard Thunderbolt 3 docks like my favored CalDigit TS3 Plus, but the Sonnet docks of course come with eGPU capabilities and the large fan that require a larger size. It's still a pretty compact design that fits well on a desk.\r\n<br/>\r\n\r\n<br/>\r\nThe overall look is pretty unobtrusive with the black metal and fairly small branding with the company and product name. The most distinctive design element is a wavy blue light on the top of the dock that gives it a bit of a splash and lets you know that it's powered up and connected to a computer.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/sonnet-puck-mac.jpg\" alt=\"\" width=\"1600\" height=\"901\" class=\"aligncenter size-full wp-image-789188\" />\r\n<br/>\r\nThe Radeon RX 5500 XT version comes with 4GB of GDDR6 video memory, while the Radeon RX 5700 model comes with 8GB.\r\n<br/>\r\n\r\n<br/>\r\nTo quantitatively assess the eGPU performance, I ran several benchmarks using both my machine's built-in graphics and the Breakaway Pucks, and I unsurprisingly found significant improvements when using the eGPU.\r\n<br/>\r\n\r\n<br/>\r\nFor my first test, I used Geekbench 5's Compute Benchmark, which rang up Metal scores of averaging 12,085 over three runs using the built-in discrete graphics on my MacBook Pro. Scores improved substantially when I added Sonnet's Breakaway Puck to my system, with the 5500 XT yielding Metal scores averaging 41,595 and the 5700 averaging 56,249. As a point of comparison, I also ran the test on an <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> with 7-core GPU, and that came in with an average score of 18,828.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/geekbench.jpg\" alt=\"\" width=\"1860\" height=\"520\" class=\"aligncenter size-full wp-image-789685\" />\r\n<br/>\r\nMy next set of tests came from the GFXBench Metal suite of benchmarking tools, and I similarly found massively improved frame rates in several popular offscreen benchmark tests, again averaged over three runs for each test. In all three benchmarks, the 5500 XT Breakaway Puck delivered approximately four times as many frames per second as my MacBook Pro did on its own, while the 5700 XT puck's advantage was more like five to six times. As with the Geekbench tests, the &zwnj;M1&zwnj; &zwnj;MacBook Air&zwnj; came in somewhere in the middle.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/gfxbench.jpg\" alt=\"\" width=\"1860\" height=\"1720\" class=\"aligncenter size-full wp-image-789686\" />\r\n<br/>\r\nMy final set of tests involved some rendering using DaVinci Resolve. My test footage was a nearly 11-minute 4K clip that I rendered without any additional processing to 1080p using several different codecs: H.264, Apple ProRes 422, and Apple ProRes 422 HQ.\r\n<br/>\r\n\r\n<br/>\r\nThese tests are where things started to get a bit more interesting, as while both pucks cut render times by more than half compared to my MacBook Pro running on its own, the results for the two pucks were very similar and in some cases, the 5500 XT GPU performed better than the 5700 GPU.\r\n<br/>\r\n\r\n<br/>\r\nWith DaVinci Resolve also having just been updated with Apple silicon support, I was also able to run the tests on my &zwnj;M1&zwnj; &zwnj;MacBook Air&zwnj;, where I once again found intermediate performance, which is quite impressive for a low-end consumer machine using Apple's first effort at a custom Mac chip, and it'll be very interesting to see how much Apple can improve performance on upcoming M-series chips aimed at more powerful Macs.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/davinci.jpg\" alt=\"\" width=\"1860\" height=\"1620\" class=\"aligncenter size-full wp-image-789687\" />\r\n<br/>\r\nI talked with the folks at Sonnet about my results and my observations that the renders were not making full use of the eGPUs' capabilities over the course of each run, starting out at nearly 100% but tailing off toward 70% or less after a minute or so.\r\n<br/>\r\n\r\n<br/>\r\nSonnet's engineering team concluded that it appeared the rest of my MacBook Pro's hardware was a limiting factor in my tests, as even when using an eGPU, the CPU and other components like system memory can become performance bottlenecks. In those cases, the eGPU ends up being at the mercy of thermal throttling or other constraints of the host system and unable to reach peak speeds.\r\n<br/>\r\n\r\n<br/>\r\nFor that reason, it's worth highlighting that, at least for my MacBook Pro, the very similar performance between the two eGPUs means that for certain tasks the 5500 XT puck performs just as well as the more expensive 5700 puck, so that's something you might want to consider if you're weighing a purchase.\r\n<br/>\r\n\r\n<br/>\r\nMoving on to the dock capabilities of the pucks, you won't see the breadth of port options available on some regular Thunderbolt docks, but they do give you some decent expansion options. Displays are obviously a big feature for docks to support, and Sonnet's pucks come equipped with a downstream Thunderbolt 3 port, a DisplayPort 1.4 port, and an HDMI 2.0b port for maximum connectivity.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/sonnet-puck-rear.jpg\" alt=\"\" width=\"1600\" height=\"742\" class=\"aligncenter size-full wp-image-789189\" />\r\n<br/>\r\n4K and 5K displays, and even Apple's 6K Pro Display XDR, are all compatible with the Breakaway Puck, and I tested things out with an LG UltraFine 5K display and had no issues. The puck can support up to four 4K displays simultaneously if you take advantage of the DisplayPort and HDMI ports and then use a Thunderbolt 3 to Dual DisplayPort or Dual HDMI adapter.\r\n<br/>\r\n\r\n<br/>\r\nIt would be nice to see a few other port options like Ethernet or some additional USB-C ports, but at least the two 5 Gbps USB-A ports support a broad range of peripherals. The dock can supply up to 60 watts of power to a host computer, which may not be quite enough if you've got a more powerful machine like a 15-inch or 16-inch MacBook Pro, so you may have to connect a separate power adapter.\r\n<br/>\r\n\r\n<br/>\r\nThe fan on the Breakaway Puck does put out a decent bit of noise, so if you're used to a quiet work environment it will definitely be noticeable as it cycles on and off, particularly if it's placed prominently on your desk. \r\n<br/>\r\n\r\n<br/>\r\nFor power users who really need the GPU horsepower these Breakaway Pucks can provide, they are a solid addition in a space-saving and even portable design. With souped-up graphics capabilities, display connectivity, and some additional USB expansion, they are good options that can pay for themselves if you're a professional user looking to speed up graphics-intensive tasks. Most consumers will not, however, have a need for this additional hardware.\r\n<br/>\r\n\r\n<br/>\r\nIt would be nice to see some even newer and higher-end GPU options in these pucks, but it no doubt takes time to get them integrated into these dock designs, and there's undoubtedly also some effort by Sonnet to target a balance between price and power that will result in the broadest appeal for these accessories.\r\n<br/>\r\n\r\n<br/>\r\nOf course, things become murkier looking toward the future, as Apple's latest Macs based on Apple silicon don't support eGPUs. But there are still plenty of Intel-based Macs out there, so Mac eGPU solutions like Sonnet's Breakaway Pucks will have a market for some time to come.\r\n<br/>\r\n\r\n<br/>\r\nSonnet's eGPU Breakaway Pucks come bundled with a fairly large external power brick that you'll need to tuck away somewhere and a 0.5-meter Thunderbolt 3 cable. The RX 5500 XT version is priced at &#36;599.99 through <a href=\"https://www.amazon.com/Sonnet-eGPU-Breakaway-Puck-Radeon/dp/B08R15F7B2\">Amazon</a> and <a href=\"https://www.sonnetstore.com/collections/egpu-enclosures/products/egpu-breakaway-puck-5500xt\">Sonnet</a>, while the RX 5700 version is priced at &#36;899.99 through <a href=\"https://www.amazon.com/Sonnet-eGPU-Breakaway-Puck-Radeon/dp/B08R17T93F\">Amazon</a> and <a href=\"https://www.sonnetstore.com/collections/egpu-enclosures/products/egpu-breakaway-puck-5700\">Sonnet</a>.\r\n<br/>\r\n\r\n<br/>\r\n<small><em>Note: Sonnet provided MacRumors with the Breakaway Pucks on loan for the purpose of this review. No other compensation was received.</em></small><div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/thunderbolt-3/\">Thunderbolt 3</a>, <a href=\"https://www.macrumors.com/guide/sonnet/\">Sonnet</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/review/sonnet-egpu-breakaway-pucks/\">Review: Sonnet&#039;s Latest eGPU Breakaway Pucks Give Your Intel Mac a Graphics Boost and Extra Connectivity</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/review-sonnets-latest-egpu-breakaway-pucks-give-your-intel-mac-a-graphics-boost-and-extra-connectivity.2288931/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FI1Xb16VUoM:ssxCjiKgt5U:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FI1Xb16VUoM:ssxCjiKgt5U:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/FI1Xb16VUoM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d703ffe88b5df1b200c6d3afda32da44acfa82f08a8a1d86f237ec934522dd62","category":"Apple"}