{"title":"Effects of poor maternal diet during gestation are detected in F2 offspring","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae055/7642707?rss=1","date":1712620800000,"content":"<span><div>Abstract</div>Poor maternal nutrition of F0 ewes impairs F1 offspring growth, with minimal differences in glucose tolerance or select metabolic circulating factors, and independent of differences in residual feed intake (RFI). To determine if poor maternal nutrition in F0 ewes alters F2 offspring growth, circulating leptin, feed efficiency, or glucose tolerance, F0 ewes (<span>n</span> = 46) pregnant with twins were fed 100% (control), 60% (restricted), or 140% (over) of National Research Council requirements from days 30 ± 0.02 of gestation until parturition. At 16 to 19 mo of age, female F1 (<span>n</span> = 36) offspring were bred to generate F2 offspring [CON-F2 (<span>n</span> = 12 ewes; 6 rams), RES-F2 (<span>n</span> = 7 ewes; 13 rams), or OVER-F2 (<span>n</span> = 13 ewes; 9 rams) corresponding to diets of the granddam (F0)]. Lamb body weights (BW) and blood samples were collected weekly from days 0 to 28 and every 14 d until day 252 of age. Circulating leptin was measured in serum at days 0, 7, 14, 56, 210, and 252. An intravenous glucose tolerance test was performed at days 133 ± 0.28. At days 167 ± 0.33, individual daily intake was recorded over a 77-d feeding period to determine RFI. Rams were euthanized at days 285 ± 0.93, and body morphometrics, loin eye area (LEA), back fat thickness, and organ weights were collected and bone mineral density (BMD) and length were determined in the right hind leg. During gestation, OVER-F1 ewes tended to be 8.6% smaller than CON-F1 ewes (<span>P</span> ≤ 0.06). F2 offspring were of similar BW from birth to day 70 (<span>P</span> ≥ 0.20). However, from days 84 to 252, RES-F2 offspring tended to be 7.3% smaller than CON-F2 (<span>P</span> ≤ 0.10). Granddam diet did not influence F2 ram body morphometrics, organ or muscle weights, LEA, adipose deposition, or leg BMD (<span>P</span> ≥ 0.84). RES-F2 (−0.20) and CON-F2 (−0.45) rams tended to be more feed efficient than CON-F2 ewes (0.31; <span>P</span> ≤ 0.08). No effects of granddam diet were observed on glucose or insulin average or baseline concentrations, area under the curve, first-phase response, or ratio (<span>P</span> ≥ 0.52). However, CON-F2 rams (297 mg/dL ± 16.5) had a greater glucose peak compared with RES-F2 rams (239 mg/dL ± 11.2; <span>P</span> = 0.05). Peak insulin concentrations were not influenced by granddam diet (<span>P</span> = 0.75). At d 56, RES-F2 and OVER-F2 offspring had 53.5% and 61.8% less leptin compared with CON-F2 offspring, respectively (<span>P </span>≤ 0.02). These data indicate that poor maternal nutrition impacts offspring growth into the second generation with minimal impacts on offspring RFI, glucose tolerance, and circulating leptin.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"d708d29ba27358a1a4dc1032952ad63ac4e5ffbfffecacebcaab9c6a07977a5f","category":"Environment"}