{"title":"A life-cycle approach highlights the nutritional and environmental superiority of agroecology over conventional farming: A case study of a Mediterranean farm","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000066","date":1719583200000,"content":"<p>by Alik Pelman, Jerke W. De Vries, Sigal Tepper, Gidon Eshel, Yohay Carmel, Alon Shepon</p>\r\n\r\nProviding equitable food security for a growing population while minimizing environmental impacts and enhancing resilience to climate shocks is an ongoing challenge. Here, we quantify the resource intensity, environmental impacts and nutritional output of a small (0.075 ha) low-input subsistence Mediterranean agroecological farm in a developed nation that is based on intercropping and annual crop rotation. The farm provides one individual, the proprietor, with nutritional self-sufficiency (adequate intake of an array of macro- and micro-nutrients) with limited labor, no synthetic fertilizers or herbicides, and zero waste, effectively closing a full farm-table-farm cycle. We find that the agroecological farm outperforms conventional farming as practiced in the same country in terms of both lower environmental burdens, across all examined environmental metrics (63% lower on average) per kg produce, and higher nutritional score (66% higher on average). Per equal farmland, the environmental lopsidedness was even higher (79% lower than conventional farming on average), with nearly the same nutritional score (3% lower on average). Moreover, when considering total land area, which includes farmland and supporting non-agricultural lands, as well as postgate impacts and food losses, the advantage of the agroecological system over conventional farming is even more pronounced. Situated within a Mediterranean region that is undergoing rapid climate change, this food system is a unique case study of nutrition- and environment-oriented food production system. While its deployment potential is limited by lack of supportive policies, it nonetheless represents one of the most starkly bold alternatives to current food systems.","author":"Alik Pelman","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"d70ae487e959168c5961435c9fa6c7b6a9b961859a74330a89fddd7e9551f4d2","category":"Environment"}