{"title":"The function of red and banded patterns in snakes: the ophiophagy hypothesis","link":"https://academic.oup.com/biolinnean/article/142/4/375/7465288?rss=1","date":1702080000000,"content":"<span><div>Abstract</div>The functions of bright bands in coral and other snakes have long been a puzzle. The most common opinion is that coral snakes display aposematic marks and that other red and black banded snakes in the Americas are mimics of coral snakes. I previously found that this prevailing opinion is weakly supported and unlikely, that red and bands had probably evolved independently or conjointly many times, and that a present selection for bands and red seems to exist in a significant fraction of the world. Here, I review the potential selective forces for red and bands in snakes. I find that snakes as predators are a priori plausible selective agents. I find that ophiophagy appears to be an exceptionally high risk in snakes that are themselves ophiophagous. Testing the working hypothesis that bands and red are protective against snake predators via their association with ophiophagy, as ophiophagous snakes are at higher risk, I find that the consumption of elongate vertebrates predicts band and red coloration with a very high level of confidence: red and bands are probably defensive against snake predators. Noting an apparent correlation of coloration with specific defensive behaviours and ontogenetic colour changes, I review both and find that ophiophagous snakes are remarkable for using stereotypical defences and not being aggressive, while ontogenetic colour changes seem to affect red and bands in snakes disproportionately. Defence against ophidian predators may be an unexpected natural selection shaping the appearance and behaviours of many snakes.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"d717c1afc5fad675b614aaf73b077e4da72cd6a276a8769e14514980b21c24d8","category":"Environment"}