{"title":"Zwift Kills Zwift Hub Classic, Wahoo Further Drops KICKR CORE Prices: Two Companies Increase Partnership","link":"https://www.dcrainmaker.com/2023/11/wahoo-further-reduces-kickr-core-prices-increases-zwift-partnership-again.html","date":1700579173000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2023/06/Wahoo-KICKR-CORE-Flywheel_thumb_thumb.jpg\" /></p>\n<p>At this point, it’s probably really only a matter of time before we see the <a href=\"https://www.dcrainmaker.com/2018/09/wahoo-kickr-core-trainer-in-depth-review-2.html\">Wahoo KICKR CORE</a> with an orange paint job and called Zwift Hub 2. But, before we get there, let’s first explain what Wahoo (and Zwift) have just announced. Some might see this as merely a price change, but I think that’d be incredibly naive.</p>\n<p>A lot of things are changing, some of them minor, but some of them pretty big and will certainly impact both consumers and industry alike, even if not a consumer of Zwift or Wahoo.</p>\n<h3><strong>What’s Changing:</strong></h3>\n<p>From today, four things happen happen immediately, but that’s really on the beginning:</p>\n<p><strong>#1) Drop the Floor:</strong> The Wahoo KICKR CORE price permanently reduced from $599USD to $449USD: This is no longer just a <a href=\"http://www.dcrainmaker.com/deals\">Black Friday sale</a>, and I don’t see it indicative of some new model coming. It’s reality setting in. This price will also be available at retail stores/bike shops too, not just Wahoo’s own site.</p>\n<p><strong>#2) All-Inclusive:</strong> The Wahoo KICKR CORE is also going to be available for $599 but WITH both a pre-installed cassette (8/9/10/11/12 speeds) AND 1-year of Zwift. This is only available on WahooFitness.com and Zwift.com</p>\n<p><strong>#3) The Hook-Up:</strong> Wahoo is making Wahoo/Zwift bundles for all their other hardware products that upsell it by $100 to include 1-year of Zwift. And if you buy one of the other hardware units via retailer, you can buy a $100 Zwift up-sell package afterwards.</p>\n<p><strong>#4) Zwift Hub Classic Killed Off:</strong> The new<a href=\"https://www.dcrainmaker.com/2023/10/zwift-hub-one-zwift-cog-clicks-review.html\"> Zwift Hub One with the Zwift Cog</a> remains, but the <a href=\"https://www.dcrainmaker.com/2022/10/zwift-hub-smart-trainer-in-depth-review-the-best-bang-for-your-buck.html\">cassette-inclusive version called the Zwift Hub Classic</a> is gone, no longer listed on Zwift’s site.</p>\n<p>It’s kinda amazing to see how quickly things have moved since this summer. Just back in June the two companies were in lawsuit hell fighting over everything, with one of many snippets where Wahoo was saying these sorts of pricing would be the downfall for the company:</p>\n<blockquote><p>“Zwift, which is only selling the Hub direct to consumers via its website, Wahoo’s higher price for its KICKR trainers is based on the cost structure it has built for its KICKR trainers, which has multiple sales channels (independent bike dealer (IBD), national retailer, and direct to consumer) that each require their own sales forces and marketing teams, which results in additional operating expenditures. In addition, Wahoo also has significant operating expenses related to ongoing research and development activities that are required to launch new, innovative products, which investors recognize are important to the company’s growth and financial health as they fuel product purchases and revenue growth.” – Nathan Fenwick (Wahoo Fitness CFO, Case 1:22-cv-01295-CFC Document 22 – Filed 11/17/22)</p></blockquote>\n<p>Less than a year later and here we are – with such pricing, while concurrently releasing press releases including more honeymoon-like statements:</p>\n<blockquote><p>“Wahoo’s new bundles will revolutionize the indoor cycling experience. Our goal is to provide customers with unprecedented options, affordability, and an easy, enjoyable onboarding process. Together with Zwift, we are thrilled to be able to offer the broadest range of choice and functionality in the indoor cycling category, helping to build the beer athlete in all of us.” – Chip Hawkins (Founder of Wahoo Fitness – Nov 21, 2023)</p></blockquote>\n<p>Of course, if you’re a consumer – this is all fantastic news. At least in the short term. The long-term is far messier. But hey – Zwift effectively succeeded in dropping the floor out of the mainstream trainer pricing realm. $449 is the new $899. A move that Elite likely already saw coming, when they priced their <a href=\"https://www.dcrainmaker.com/2023/09/elite-wahoo-reduce-list-prices-on-trainers.html\">Elite Suito-T at $549 a few months back</a>.</p>\n<p>So, just to flesh out some details here on each component, here’s the new KICKR CORE-specific pricing options:</p>\n<p>Option 1 – No Cassette: $449USD<br />\nOption 2 – With Cassette and Zwift: $599USD</p>\n<p>And further, on the non-CORE Wahoo hardware models, here’s the pricing where you get one year of Zwift included:</p>\n<p>● KICKR BIKE at US$4,099.99EU€4,099.99/UK£3,599.99/CA$5,439.99 /<br />\n● KICKR BIKE SHIFT at US$3,099.99/EU€3,099.99/UK£2,799.99/CA$4,339.99 /<br />\n● KICKR MOVE at US$1,699.99/EU€1,699.99/UK£1,499.99/CA$2,289.99<br />\n● KICKR at US$1,399.99/EU€1,399.99/UK£1,199.99/CA$2,019.99 /<br />\n● KICKR ROLLR at US$699.99/EU€699.99/UK£649.99/CA$939.99<br />\n● KICKR SNAP at US$399.99/EU€399.99/UK£349.99/CA$739.99</p>\n<p>Now, setting aside consumer competition for a second (after all, Zwift only entered the hardware game a year ago), there are many industry losers here. Some more immediate, some will take a bit of time. So, let’s dig into that.</p>\n<h3><span><strong>A Quirky Future:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2022/10/DSC_3320_thumb.jpg\" /></p>\n<p>Short term, the biggest loser here is Garmin/Tacx, followed closely by Elite. I’d say Saris too – but frankly I’m not even sure they’re making trainers at this point. Everything has gone quiet after the sale to the <a href=\"https://www.dcrainmaker.com/2022/10/saris-cycling-group-acquired-by-ca-global.html\">no-name brand holding company more than a year ago</a>. Garmin’s biggest gap isn’t the Zwift tack-on $100 membership, instead, it’s the Flux 2 pricing just being non-competitive. Elite probably has less to lose here merely because they have a lesser footprint globally than Garmin/Tacx. Proportionally though, it’s still gonna be tough for them.</p>\n<p>However, longer term, I’ve gotta imagine the real (biggest) loser here is JetBlack (or, more technically their manufacturing facilities/partners). JetBlack currently works closely with Zwift on the Zwift Hub One. And at this juncture, I just don’t see how the future continues there. There’s just no need for even the Zwift Hub One, given the current trajectory of the Wahoo/Zwift partnership, which has escalated in closeness faster than a <em>50 Shades of Gray</em> movie.</p>\n<p>Specifically, there’s no reason to have a Zwift Hub One anymore. The Zwift Hub One is certainly good, but in this parity-priced scenario, the Wahoo KICKR CORE is, and always has been, slightly better (though, it lacks the new auto-cal and race mode of the Zwift Hub, but those should be easy for Wahoo to add via firmware update). Thus, Zwift could easily paint the legs and flywheel orange, and call it <em>Zwift Hub 2</em>. Or <em>Zwift Hub by Wahoo</em>, or whatever the heck that want to call it. And the <a href=\"https://www.dcrainmaker.com/2023/10/zwift-hub-one-zwift-cog-clicks-review.html\">Zwift Hub One</a> (with the Zwift Cog)? No biggie – that Cog can go on any trainer, since again, the software side of that comes from the Zwift app telling the trainer what to do. Having that be part of the KICKR CORE is just one software update away.</p>\n<p><img title=\"ZwiftFuture.png\" src=\"https://media.dcrainmaker.com/images/2023/11/ZwiftFuture-1.png\" alt=\"ZwiftFuture\" width=\"719\" height=\"402\" /></p>\n<p>That all seems to be a given at this point to me. Anything less would be silly, again, given the trajectory of the partnership.</p>\n<p>The real question at the end of the day is: Will Zwift buy Wahoo? And that’s messier, obviously. Zwift fund-raised a boatload (some<a href=\"https://www.crunchbase.com/organization/zwift\"> $620 million dollars</a>), and doesn’t really have anywhere to put that money. Best we can tell, Zwift isn’t turning a profit at this point, and also isn’t meaningfully growing subscription-count-wise. At least compared to the estimates/hopes/dreams given to investors a few years ago.</p>\n<p>As a result, at some point, those investors are eager for a return on that investment – and that’s certainly <a href=\"https://www.forbes.com/sites/jimosman/2020/07/10/zwift-ipo-top-esports-stocks-2020/\">not going to come from an IPO of Zwift</a>. This is no financial environment to IPO an indoor cycling company. That party bus left the station, and crashed about 3 years ago.</p>\n<p>Instead, buying Wahoo would begin to give investors a return on their investment that’s real-world tangible. If Wahoo is to be believed, once they sorted their debt pieces out <a href=\"https://www.dcrainmaker.com/2023/05/wahoo-fitness-founder-buys-company-back-from-banks.html\">this past spring and bought themselves back</a>, they were otherwise profitable. And while indoor cycling gear sales have been down/flat the last 2 years post-COVID-peak-bubble, there are signs it’s slowly starting to solidify again. Not in a bubble way, but in a ‘light at the end of the tunnel’ way. It’d also give Wahoo’s new investors a solid pay-day as well.</p>\n<p>Of course, how much of that $620M cash Zwift actually has left is a bigger question. Concurrently, how much Wahoo would accept for sale is also a question. When Tacx sold to Garmin in Feb 2019, it was stated in the <a href=\"https://www.quotenet.nl/zakelijk/a219389/zwetend-de-quote-500-in-koos-en-peter-tacx-verkopen-hometrainerbedrijf-voor-170-miljoen-219389/\">Dutch media it did</a> so for about €170M (~$185M USD). At the time, it was also stated Wahoo was a bigger company than Tacx. Certainly, valuations have grown considerably for both Tacx &amp; Wahoo since then. And concurrently Zwift has been spending money. Again, where that middle-ground between what Zwift has left, and what Wahoo would ask for, is the big question.</p>\n<p>Of course, none of that would be good for consumers long term, and probably not even short-term. It would essentially create a behemoth that could only really be countered by a Garmin-like sized company, which has shown no real interest in substantially expanding the Tacx App beyond what it was when they bought it. Of course, all of this is overshadowed by Peloton, which continues to slowly but surely expand it’s footprint into areas likely once considered more sport-focused (and <a href=\"https://www.pelobuddy.com/peloton-virtual-reality-survey/\">survey’s this week indicate it’s looking at lots of options</a> for expansion, including naming Zwift by name).</p>\n<p>Either way, interesting times ahead. The good news though is that unlike 3-4 years ago in peak-COVID, this isn’t a fast-moving indoor trainer arms race. Everyone who might ever have bought a trainer, has one, thus, there’s less urgency to be the ‘winner’ in this realm, because most consumers have already chosen a platform. Instead, it’s a smaller battle to convince someone to ditch an existing platform/older trainer. Still, it’ll be interesting to see how companies like Garmin, Elite, and others respond.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"d7230999c43fbfba858cb91bbe23330a1d18c53d46127d4877aa9f5e0b13657a","category":"Cycling"}