{"title":"Adult-onset asthma morbidity and related economic costs in middle age due to intentional chronic absenteeism in high school: An epidemiologic study using the national longitudinal survey of youth 1979 data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306451","date":1722607200000,"content":"<p>by Zongqiang Liao, Neville Francis, Kevin Brooks</p>\r\nObjective <p>Many authors examined the individual and societal impact of school absenteeism. Nevertheless, no empirical study has looked at the potential direct correlation between deliberate school absences and chronic illnesses in mid-adulthood. Our goal is to investigate any potential direct links between purposeful school absences and adult-onset asthma in middle age, as well as measure any associated costs of asthma.</p> Methods <p>Data were sourced from the National Longitudinal Survey of Youth 1979, a nationally representative survey. The outcome measure was self-reported asthma in mid-adulthood. School records of absenteeism from grades nine through twelve were the key explanatory variables. Logistic regressions were performed with controls for demographic, economic and health variables. Predicted probabilities from the regressions were used to quantify costs of adult-onset asthma in middle age due to intentional high school absenteeism.</p> Results <p>More years of chronic absenteeism in high school were associated with higher risk of adult-onset asthma in middle age. Four years of chronic absenteeism in high school during the late 1970s through the early 1980s could potentially have incurred between $817 million to $1 billion of asthma related costs in 2002, when these students were in their mid-adulthood. These potential asthma related costs due to high school absenteeism are sizeable considering that this high school cohort only accounted for six percent of the U.S. population.</p> Conclusions <p>Reducing high school absenteeism could lower the incidence of adult-onset asthma in middle age, and its associated future economic burden.</p>","author":"Zongqiang Liao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d726a94f6559418681050f6109857f02fa1a9055678234c719a2b92b9491f5cd","category":"Interdisciplinary"}