{"title":"Comparing the Efficiency of Particle Swarm and Harmony Search Algorithms in Optimizing the Muskingum-Cunge Model","link":"https://www.preprints.org/manuscript/202408.1850/v1","date":1724685057000,"content":"Floods in various regions cause irreparable damage to infrastructure, agricultural lands, and industrial centers. In recent years, due to the effects of climate change and, in particular, the increased activity of the monsoon system in the Balochistan region located in southern Sistan and Baluchestan province, local rivers have overflowed, causing widespread flooding and significant damage. Accurate flood routing not only provides decision-makers with precise information about flood volume and flow behavior but also facilitates planning for effective preventive measures. In this study, the Muskingum-Cunge model was used to simulate floods in eight major rivers of Balochistan, including Kajou, Sarbaz, Nik Shahr, Kehir, Bahu, Sia Jangal, Rapch, and Kamb. The model parameters (K and X) were optimized using two machine learning algorithms: Particle Swarm Optimization (PSO) and Harmony Search (HS). The results showed that in most stations, the PSO algorithm outperformed HS. The algorithms were evaluated using the coefficient of residual mass (CRM), normalized root mean square error (NRMSE), efficiency (EF), and agreement index (d). For instance, at the Kajou station, PSO improved CRM by 0.017, Ef by 0.921, d by 0.982, and NRMSE by 0.099 compared to HS. At the Kamb station, both algorithms yielded comparable results. Considering the overall better performance of the PSO algorithm in most evaluation indices, it can be concluded that this algorithm is a more suitable option for optimizing the parameters of the Muskingum-Cunge model and simulating flood hydrographs with higher accuracy at most of the studied stations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d72c1c72fc270cb6508686e08d868d89fe0b8a9498eb4fe5c096a23b9b116768","category":"Interdisciplinary"}