{"title":"Comparative Analysis of Shear Bond Strength in Orthodontic Brackets between Milled and 3D-Printed Definitive CAD-CAM Restorations","link":"https://www.preprints.org/manuscript/202409.2073/v1","date":1727337339000,"content":"Objective: To evaluate the effect of different surface treatment methods on the shear bond strength (SBS) of metal brackets bonded to two types of CAD/CAM composite restorations: milled and 3D-printed.\nMaterials and Methods: A total of 160 flat-shaped specimens (10×10×2 mm³) were prepared from four different CAD-CAM composites; two milled (Lava Ultimate™ [LU], and Grandio™ [GR]) and two 3D-printed (Crowntec™ [CT] and C&amp;B Permanent™ [CB]). These specimens underwent thermocycling (5000 cycles at 5-55 °C), then were categorized based on the surface treatment into four groups (n=10): Group C (control, no surface treatment), Group HF (treated with 9.6 % hydrofluoric acid), Group DB (mechanical roughening by a diamond bur), and Group SB (sandblasting using aluminum oxide). Metal brackets were bonded, stored in artificial saliva for 24 hours, then thermocycled again. Shear bond strength (SBS) was tested using a universal testing machine until bracket debonding occurred. The adhesive remnant index (ARI) was assessed using a stereomicroscope to quantify the residual adhesive following debonding. \nResult: Regarding material, GR and LU restorations had significantly higher SBS values compared to CT and CB, ranging from 13.90 MPa to 20.35 MPa. Regarding surface treatment, SB and HF groups showed significantly higher SBS values. The ARI scores showed different adhesive modes of failure, with higher instances of scores 0 and 1 which indicate no or minimal adhesive remaining.\nConclusion: Both milled and 3D-printed materials had adequate SBS for clinical use, with milled materials showing superior results. Surface treatments like sandblasting and HF significantly improved bond strength, with adhesive failure being common.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d730abb2fb841a606f8ee2a9cc9fa764e5a7d008bb31d932cab4d4589752e3eb","category":"Interdisciplinary"}