{"title":"Assessment of University Students' behavioral Intentions to Use ChatGPT：A Comprehensive Application Based on the Innovation Diffusion Theory and the Technology Acceptance Model","link":"https://www.preprints.org/manuscript/202406.1835/v1","date":1719393640000,"content":"The application of OpenAI's advanced artificial intelligence language model, ChatGPT, in education has garnered widespread attention from the academic community. The openness and intelligence features of ChatGPT demonstrate great potential and value in supporting students' learning, daily life, and communication. This study, grounded in the theoretical frameworks of Innovation Diffusion Theory (IDT) and the Technology Acceptance Model (TAM), conducted a systematic empirical analysis through a questionnaire survey of 677 university students who had used or were currently using ChatGPT. The results indicate that the six perceived attributes of innovation significantly influence university students' behavioral intention to use ChatGPT, while attitudes towards ChatGPT, perceived usefulness, and perceived ease of use indirectly influence students' behavioral intention to continue using ChatGPT. Based on the findings of this study, we propose an extended Technology Acceptance Model (TAM) that incorporates key elements of Innovation Diffusion Theory (IDT) to optimize the application of advanced technologies, such as ChatGPT, in education, thereby improving students' learning efficiency and behavioral performance. These findings not only provide important insights into the complex relationships between college students’ perceptions of ChatdGPT technology and predictors of behavioral intentions, but can also help relevant education departments, higher education institutions, and university teachers to effectively plan and evaluate the use of ChatGPT as a learning tool.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d73c6746ddf7e5c2feaeed1cde37edcf18d485e822d766fbc8ebb8193e04d46c","category":"Interdisciplinary"}