{"title":"David Pogue Had Suspicions Regarding Missing OceanGate Titanic Submarine","link":"https://deadline.com/2023/06/cbs-oceangate-titanic-submarine-viral-david-pogue-safety-concerns-1235420540/","date":1687388105000,"content":"\n<p>Jake Kanter, writing for Deadline:</p>\n\n<blockquote>\n  <p>A six-month-old CBS report on OceanGate’s Titanic tourism\nsubmarine is going viral on social media after reporter David\nPogue raised safety concerns about the now-missing vessel.</p>\n\n<p>Pogue visited OceanGate’s operations last year and was submerged\nin the $1M submarine, named Titan, which vanished off the coast of\nCanada on Sunday. It was carrying a pilot and four passengers,\nincluding OceanGate CEO Stockton Rush. [...]</p>\n\n<p>“It seems like this submersible has some elements of MacGyvery\njerry-rigged-ness. You are putting construction pipes as ballast,”\nPogue said to Rush in an interview.</p>\n\n<p>“I don’t know if I would use that description,” Rush replied. He\nadded that the OceanGate worked with Boeing and Nasa on the\npressure vessel. “Everything else can fail. Your thrusters can go,\nyour lights can go, you’re still going to be safe.”</p>\n\n<p>Pogue said he was nervous before boarding and revealed some of\nthe contents of the waiver form he was required to sign. This\ndescribed the submarine as an “experimental submersible vessel\nthat has not been approved or certified by any regulatory body\nand could result in physical injury, disability, emotional trauma\nor death.”</p>\n</blockquote>\n\n<p>Hindsight is 20-20, blah blah blah, but there’s no way you could have gotten me to go on this thing. So many <a href=\"https://techcrunch.com/2023/06/20/a-whistleblower-raised-safety-concerns-about-oceangates-submersible-in-2018-then-he-was-fired/\">red flags</a>, not the least of which is that the vessel’s lone portal was only certified for a depth of 1,300 meters, but the Titanic wreck is 3,800 meters deep.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/21/pogue-titan\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d7487a61e0b05c1c216abe6f15c5298866e7fad6ca455545c642497e802406ab","category":"Tech"}