{"title":"2024 iPad Pro to Use LCD Panel Instead of OLED or Mini-LED, Claims Sketchy Report","link":"https://www.macrumors.com/2023/10/20/2024-ipad-pro-lcd-panel-not-oled-or-mini-led/","date":1697792582000,"content":"Apple's next-generation 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> will revert to an LCD display instead of adopting OLED panel technology, claims a controversial new report coming out of Asia.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/ipad-pro-red.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIt has been widely reported that Apple's next ‌iPad Pro‌ models will be the first Apple tablets to debut superior OLED panels, with rumors suggesting they will begin shipping <a href=\"https://www.macrumors.com/2023/07/07/ipad-pro-oled-display-mass-production-early-2024/\">around the middle of next year</a>.\r<br />\n\r<br />\nThat's not necessarily the case, according to a confusing new <em><a href=\"https://www.digitimes.com/news/a20231019PD217/apple-led-display-panel-mobile-devices-pc-ce.html\">DigiTimes</a></em> report. \r<br />\n\r<br />\nThe Taiwan-based outlet now claims Apple will in fact revert to using LCD backlighting for its upcoming 12.9-inch ‌iPad Pro‌ model, putting it on par with the existing 11-inch model. The current 12.9-inch ‌iPad Pro‌ features a mini-LED display that Apple calls a \"Liquid Retina XDR display,\" while the 11-inch variant uses an inferior LCD-based \"Liquid Retina Display.\"  \r<br />\n\r<br />\nThe report alleges that the high production cost of using mini-LED backlights in the 12.9-inch ‌iPad Pro‌ has been a \"hurdle for broader industry adoption,\" and that Apple's pivot back to conventional backlight technology \"could be motivated by the company's focus on scalability and market penetration.\" \r<br />\n\r<br />\nAs a result of the component changes, production of the new 12.9-inch iPads could be postponed to \"early 2024 at the latest,\" having originally been slated to start in \"early November,\" adds <em><a href=\"https://www.macrumors.com/guide/digitimes-com/\">DigiTimes</a></em>.\r<br />\n\r<br />\nSeveral things don't add up in this latest report. As covered previously by <em>MacRumors</em>, ‌<em>‌DigiTimes‌</em> on Thursday alluded to the same report in its \"Before Going to Press\" section by claiming that a <a href=\"https://www.macrumors.com/2023/10/19/apple-working-on-larger-ipad-air/\">forthcoming 12.9-inch iPad Air may feature LCD backlighting</a> as opposed to the mini-LED backlighting used in the 12.9-inch ‌iPad Pro‌.\r<br />\n\r<br />\nHowever, the fully published report no longer mentions this alleged larger \"12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>,\" and simply makes a passing reference to \"a new ‌iPad Air‌\" that will also use traditional LCD backlighting like the next ‌iPad Pro‌.\r<br />\n\r<br />\nTo add to the confusion, the full article contradicts itself by repeating the previously reported claim that \"industry insiders indicate... Apple might launch a new ‌iPad Pro‌ with AMOLED displays earliest in 2024, sourcing mainly from Samsung Display and LG Display.\" \r<br />\n\r<br />\nPutting aside the other inconsistencies in the above claims, if the next 12.9-inch ‌iPad Pro‌ reverted from mini-LED to traditional LCD panel technology, it would be considered a major regression for Apple's most premium tablet offering, especially given that OLED display technology is perhaps <a href=\"https://www.macrumors.com/2023/10/18/2024-ipad-pro-what-to-expect/\">the most anticipated upgrade</a> coming to the next-generation ‌‌iPad Pro‌‌ models. \r<br />\n\r<br />\nGiven the contradictions in <em>‌DigiTimes‌</em>' reporting, not to mention its history for misinterpreting supply chain information, this claim alone should be taken with a large grain of salt until other sources can corroborate it. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">DigiTimes</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/20/2024-ipad-pro-lcd-panel-not-oled-or-mini-led/\">2024 iPad Pro to Use LCD Panel Instead of OLED or Mini-LED, Claims Sketchy Report</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/2024-ipad-pro-to-use-lcd-panel-instead-of-oled-or-mini-led-claims-sketchy-report.2408159/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d74eccb9c7bf18dd37e6ed3751c72781f11b586aa2debedefe59d1835df08456","category":"Apple"}