{"title":"A Comprehensive Review of Semantic Segmentation and Instance Segmentation in Forestry: Advances, Challenges, and Applications","link":"https://www.preprints.org/manuscript/202407.1056/v1","date":1721003097000,"content":"This article presents a succinct overview of the progress, obstacles, and uses of semantic segmentation and instance segmentation within the forestry domain. The objective of this review is to conduct a critical analysis of the current literature pertaining to segmentation techniques and provide a methodical summary of their impact on forestry-related activities, including but not limited to tree species classification, forest inventory, and ecological monitoring such as retrieval of dominant tree species. Through the process of synthesizing pivotal discoveries from multiple studies, this comprehensive analysis provides valuable perspectives on the present status of research and highlights prospective areas for further exploration. The primary topics addressed encompass the approach employed for executing the examination, the fundamental discoveries associated with semantic segmentation and instance segmentation in the domain of forestry, and the ramifications of these discoveries for the discipline. The results indicate that the utilization of semantic segmentation methods has been efficacious in the field of forestry for the precise identification of tree species. Such methods also aid in tracking of deforested regions over the course of time by separating other land-use classes from  forested regions. Additionally, the employment of instance segmentation techniques exhibits potential in the demarcation of individual trees. Instance segmentation offers promising results due to deep learning models based on forest point clouds. However, several challenges persist in the successful implementation of semantic segmentation methods such as the presence of occlusions, overlapping branches, and intricate structures hampers the accurate segmentation of trees. Additionally, instance segmentation approaches that utilize models are mostly trained by using laser scanning data based on forest types which are  typically trained on specific laser scanning data and forest types that create limitations in generalization from high to low resolution point clouds. Due to this reason, the existing approaches often struggle with handling these complex structures, leading to the need for manual methods for extracting measurements from forest point clouds. The review culminates by underscoring the necessity for additional research to tackle current obstacles and augment the precision and relevance of segmentation methodologies in the field of forestry. In general, the present article provides a significant reference for scholars and professionals who are interested in utilizing segmentation techniques in the field of forestry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d765645326dcc9497d3e95c9bd640c1496f943b789bb9ab1c693325747e54e60","category":"Interdisciplinary"}