{"title":"Analyzing the Role of Changing Climate on the Variability of Intensity-Duration-Frequency Curve Using Wavelet Analysis","link":"http://link.springer.com/10.1007/s11269-024-03812-0","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Climate change has significantly influenced the occurrence of extreme events and their outcomes in developing countries, like Pakistan. This research investigates the impact of climate variability on the development of Intensity Duration Frequency (IDF) curves using wavelet analysis across two Pakistani cities i.e. Abbottabad and Islamabad. IDF curves are produced utilizing the Statistical Software Package (HEC-SSP) and Hydrological Engineering Center and Watershed Modeling System (WMS), where daily meteorological (i.e., rainfall, and the approx. temperature) data from 1960 to 2020 (60 years) at Abbottabad and Islamabad was gathered from Pakistan Meteorological Department (PMD). Initially, the relation between the observed data was extracted by applying the slope approaches of Mann-Kendall and Sen. Following the removal of serial correlation, generalized IDF curves are developed utilizing the time and turnaround for both stations. Finally, climate variability’s impact on IDF curves was studied using wavelet analysis applied to three different pairs of input data, i.e., maximum, minimum, and mean temperatures against the developed IDF curves. Results showed that wavelet analysis are extremely useful to monitor the climate variability’s influence/role on frequency and return periods of flood events (i.e., IDF curves). The developed IDF curves showed higher intensities during the monsoon period, whereas lower intensities of IDF curves are observed in other months against the 24 hours’ duration of different return periods. Results also depicted that Abbottabad has experienced higher intensity of rainfall as compared with Islamabad city, which might be linked due to the changing climate and the use of land in both cities and verified by the results obtained from wavelet analysis. Increased cloud cover and precipitation resulted from the orographic effect, coupled with the influence of lower temperatures at elevated altitudes. Wavelet analysis showed a strong impact of climate (i.e., temperature) on IDF curves, where significant changes in the period and frequency are observed between the two cities. Overall, this study will be useful to understand how IDF curves are affected by climate variability while predicting the future flood events and sustainable design of urban drainage system.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"d76d97421b4c050bd1a97c4357d55e6ddfe9260be81780b3871125ca61550149","category":"Environment"}