{"title":"MPV17 Prevented Myocardial Ferroptosis and Ischemic Cardiac Injury through Maintaining SLC25A10 Mediated Mitochondrial Glutathione Import","link":"https://www.preprints.org/manuscript/202409.1896/v1","date":1727167744000,"content":"Ferroptosis is a recently identified iron-dependent programmed cell death with lipid peroxides accumulation and condensation and compaction of the mitochondria. Recent study indicated that ferroptosis played a pivotal role in ischemic cardiac injury with the mechanisms remained largely unknown. This study demonstrated that iron overload occurred in the ischemia/reperfusion (I/R) cardiac tissues, which initiated myocardial ferroptosis. The expression levels of mitochondrial inner membrane protein MPV17 were reduced when ferroptosis occurred in cardiomyocytes treated with high levels of iron or in the ischemic cardiac tissues. Overexpression of MPV17 delivered via adenovirus significantly reduced ferroptosis in both cardiomyocytes subject to high levels of iron and cardiac I/R tissues. Mitochondrial glutathione (mtGSH), crucial for reactive oxygen species (ROS) scavenging and mitochondrial homeostasis maintenance, was depleted during myocardial ferroptosis caused by iron overload. The mechanistic study showed that MPV17 could increase mtGSH levels through maintaining the protein homeostasis of SLC25A10, which was a mitochondrial inner-membrane glutathione transporter. The absence of MPV17 during iron overload resulted in the ubiquitination-dependent degradation of SLC25A10, leading to impaired mitochondrial glutathione import. Moreover, we found that MPV17 was the targeted gene of Nrf2, which played a pivotal role in preventing lipid peroxides accumulation and ferroptosis. The decreased expression levels of Nrf2 led to the inactivation of MPV17 during iron overload-induced myocardial ferroptosis. In summary, this study demonstrated the critical role of MPV17 in protecting cardiomyocytes from ferroptosis and elucidated the Nrf2-MPV17-SLC25A10/mtGSH signaling pathway in the regulation of myocardial ferroptosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d76efe2237385a3aae74729bf3bbe777e43385e12454431716e34cf83464744b","category":"Interdisciplinary"}