{"title":"Assessment of the Impact of Medication Regimen Complexity on Medication Adherence and Glycemic Control in Management of Type-2 Diabetes","link":"https://www.preprints.org/manuscript/202408.0382/v1","date":1722937888000,"content":"Background and Aim: Patients with Type 2-diabetes condition tend to have multiple medications in various dosage which leads to complex medication regimens. Complexity of regimen results in poor adherence, uncontrolled glycemic value and treatment failure. The research aimed to investigate medication regimen complexity index, medication adherence, and impact of medication regimen complexity on glycemic control and medication adherence.Materials and Methods: A Crossectional Study methods was conducted at Bheri Hospital Nepalgunj, among 145 Diabetes patients. Medication adherence was assessed by using a General Medication Adherence Scale (GMAS Nep-Tool). Medication regimen complexity was assessed by using a Medication Regimen Complexity Index (MRCI) tool. Chi-square test, One-way ANOVA, Paired t-test, and binary logistic regression were used for inferential statistics.  Results: This study shows that most of the participants were female and aged group 50-59 years. Hypertension was the most common comorbidity, followed by hypothyroidism. The majority of participants exhibited partial adherence 90 (62.1%) to their medication regimen.  It was seen that medications prescribed for diabetes were more complex than non-diabetes medications (Mean±SD MRCI: 8.28±3.155 vs. 4.57±2.107). The negative correlation was seen with diabetes MRCI and medication adherence (r=-0.090). There was statistically significant association between diabetes MRCI and glycemic control, (p&lt;0.05). Binary logistic regression revealed that females had lower odds of high MRCI compared to males ( multivariate p-value: 0.014, AOR: 0.403, 95% CI: 0.195-0.832), while sedentary lifestyle showed high Diabetes MRCI (COR: 4.709, 95% CI: 0.962-23.05) and abnormal BMI were associated with higher MRCI (binary p-value: 0.067, COR: 2.30, 95% CI: 0.942-5.65; multivariate p-value: 0.092, AOR: 2.323, 95% CI: 0.878-5.67).  Conclusion:  Diabetes medications are more complex, reducing adherence and worsening A1C outcomes. Simplifying regimens improves results, with MRCI being valuable for healthcare providers. The medication adherence and therapeutic outcomes can be improved by the improved by the involvement of clinical pharmacist using MRCI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d77523a4ad7c539c75d089199287aba46eb42e8dee89daaeef8d36cdb0d5fc12","category":"Interdisciplinary"}