{"title":"Surveillance of Bacterial Load and Multi-drug Resistant Bacteria on Surfaces of Public Restrooms","link":"https://www.preprints.org/manuscript/202403.1215/v1","date":1710983037000,"content":"Public restrooms are often a hub of microbial contamination, and the examination of bacterial contamination in these facilities can serve as an important indicator of the transmission of infectious diseases. This study was conducted to determine the prevalence of bacterial contamination in public restrooms based on the economic class of the building. Samples were collected from various spots in 32 restrooms found in 10 shopping malls, classifying them into two categories: upper-end restrooms and lower-end restrooms. The findings showed that the level of contamination was higher in the lower-end restrooms, with the seat being the most contaminated area. The most dominant Gram-positive bacteria were coagulase-negative staphylococci species, making up 86% of the identified Gram-positive isolates. The most dominant Gram-negative bacteria identified were Klebsiella pneumoniae and Pseudomonas aeruginosa. The antibiotic sensitivity test results revealed the presence of multi-drug resistant bacteria among the Gram-positive and negative isolates, including Staphylococcus haemolyticus, Staphylococcus kloosi, Acinetobacter baumanii, and Pseudomonas aeruginosa. In conclusion, the study underscores the significance of monitoring bacterial contamination in public restrooms and the need for measures to reduce the spread of infectious diseases. Further research is crucial to gain a complete understanding of the bacterial contamination in public restrooms and their resistance patterns, to ensure the safety and health of the public. The implementation of improved cleaning practices and hands-free designs in restrooms can help reduce the risk of cross-contamination and prevent the spread of diseases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d778a7b78f81a3b384c5935aad602b728919f9f69405106c4321d3b39dde4b8a","category":"Interdisciplinary"}