{"title":"Pedestrian deaths soared in a handful of states in 2022","link":"https://arstechnica.com/?p=1949323","date":1687406509000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-543442676-800x533.jpg\" alt=\"Pedestrian deaths soared in a handful of states in 2022\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-543442676-scaled.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>America was a dangerous place to be a pedestrian in 2022. Preliminary data analyzed by the Governors Highway Safety Association (GSHA) found that 7,508 pedestrians were killed in traffic crashes last year, the highest number of deaths since 1981. But the carnage is very unevenly distributed; 26 states and the District of Columbia actually became safer for pedestrians during 2022, and the nationwide year-on-year increase in pedestrian traffic deaths was just 1 percent. Overall, there was a 0.3 percent reduction in fatal vehicle crashes in the US last year.</p>\n<p>The last few years have seen an alarming rise in pedestrian fatalities. In 2010, 4,302 pedestrians were killed by US traffic, accounting for 13 percent of all traffic deaths. But by 2021, the number of pedestrian deaths had increased by 77 percent to 7,624.</p>\n<p>You might have noticed that's actually a little higher than the number that the GHSA is projecting for 2022; Oklahoma was apparently unable to provide 2022 data, and the data reported by the State Highway Safety Offices is usually about 2 percent greater than the data in the National Highway Traffic Safety Administration's Fatality Analysis Reporting System. Therefore the 2021 number for comparison, excluding Oklahoma, was 7,443 pedestrians.</p></div><p><a href=\"https://arstechnica.com/?p=1949323#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949323&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d786a3d74b951cb36990e3af4ddef3ab8fd4fc3df73575fe1ede954c6ee9a6db","category":"Tech"}