{"title":"The ski mountaineer who climbed straight into cycling’s WorldTour","link":"https://cyclingtips.com/2021/04/the-ski-mountaineer-who-climbed-straight-into-cyclings-worldtour/","date":1619658748000,"content":"<p>Primoz Roglic’s transformation from ski jumper to Grand Tour champion is the stuff of cycling folklore. Now, eight years after the Slovenian swapped his skis for wheels, another winter athlete is trying to make his mark on professional road cycling.</p>\n\n\n\n<p>Last week, 28-year-old Anton “Toni” Palzer made his pro racing debut with Bora-Hansgrohe at the Tour of the Alps. Judging by the German’s debut outing, there’s reason to be excited about what the future might hold.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00033064-017-1340x893.jpeg\" /></figure>\n\n\n\n<p>Palzer was born and raised in Ramsau bei Berchtesgaden, a small town nestled in the south-eastern corner of Germany, right near the border with Austria. Having lived among the Bavarian Alps his whole life, it’s no surprise Palzer has an affinity for the high mountains.</p>\n\n\n\n<p>He’s an accomplished mountain runner who, in addition to winning many uphill races, set the <a href=\"https://www.strava.com/activities/3672704750\" target=\"_blank\">fastest-known time</a> for the <a href=\"https://www.redbull.com/int-en/toni-palzer-watzmann-record\" target=\"_blank\">crossing of the three peaks of the Watzmann mountain</a> in June 2020. But Palzer is best known as one of the world’s top ski mountaineers.</p>\n\n\n\n<p>Ski mountaineering (or ‘skimo’) is a skiing discipline that involves climbing mountains either on skis or with skis strapped to your back (depending on the gradient), and skiing down those mountains. Palzer spent 11 years competing at the highest level and claimed a bunch of skimo World Cup and World Championship podiums along the way.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CMKt3nbnUFG/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CMKt3nbnUFG/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>In 2020, Palzer started looking for a new challenge.</p>\n\n\n\n<p>“Ski mountaineering was my passion for many years and I enjoyed great success, but, at some point, I realised that it was not quite as fulfilling as it used to be,” he said in an interview on the <a href=\"https://www.redbull.com/ke-en/theredbulletin/anton-palzer-ski-mountaineer-to-pro-cyclist-interview\" target=\"_blank\">Red Bull website</a>. “Sooner or later I would have started losing that feeling of happiness it gave me, which probably would have made me less successful too. Irrespective of how good your physical condition is, you need 100% motivation to achieve great results.”</p>\n\n\n\n<p>Palzer’s relationship with Bora-Hansgrohe began in early 2020. Palzer was looking for a way to shake up his skimo training when his friend Lukas Pöstlberger, a rider at Bora-Hansgrohe, recommended speaking with team coach Helmut Dollinger.</p>\n\n\n\n<p>“We have been working together since April [2020] and it was soon clear that some of his performance values, such as his VO2max, are exceptional,” Dollinger said of Palzer in a Bora-Hansgrohe press release in late 2020. “In summer, he trains a lot on the bike anyway, so we examined his data in detail. However, the decisive factor for this change was that Toni was certain that he wanted to try it.”</p>\n\n\n\n<p>Palzer had been thinking about giving cycling a proper go for a while, so when team management asked whether he could envisage switching sports, Palzer was more than interested.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CNHTyprHXu3/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CNHTyprHXu3/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>Bora-Hansgrohe announced Palzer’s signing in December 2020. “It may look like a daring venture and a certain risk is definitely involved, but we have been following Toni for quite a long time and are convinced of his physical abilities,” team manager Ralph Denk said at the time. “You can see from examples like Roglic or [Michael] Woods <em>[a former middle-distance runner – ed.]</em> that such an experiment can be successful, and we have always said that we would scout within different sports.</p>\n\n\n\n<p>“I don’t mean to say that Toni will be competing for the Tour victory within two years. However, we see a lot of potential in him, particularly in the high mountains. In summer, he trained on the bike for a week with some of our riders in Austria, which worked out very well, and from a technical standpoint, he is also quite strong.”</p>\n\n\n\n<p>Palzer didn’t start racing with the team immediately – he wanted to throw everything at one final winter of ski mountaineering. He did join the team for a couple training camps though, including a two-week stint at Lake Garda in northern Italy in January. It was at that camp that a driver <a href=\"https://cyclingtips.com/2021/01/seven-bora-hansgrohe-riders-car-crash/\" target=\"_blank\">collided with seven Bora-Hansgrohe riders</a>, Palzer included. Wilco Kelderman, Andreas Schillinger and Rüdiger Selig were the worst injured while Palzer suffered only minor injuries.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CKMqigpnOw5/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CKMqigpnOw5/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>Palzer’s final ski mountaineering event was the world championships in Andorra in early March. There he took home an <a href=\"https://www.instagram.com/p/CMAOE1PH2fW/\" target=\"_blank\">emotional silver medal</a> in the Vertical Race – a discipline that, as the name suggests, is <a href=\"https://www.strava.com/activities/4888546434\" target=\"_blank\">all about the climbing</a>, without any of the descending that often follows in a skimo race.</p>\n\n\n\n<p>(The video below shows Palzer winning silver at the skimo world championships. It’s also just a wonderful profile of the athlete and his father, Wolfgang – just be sure to turn on English subtitles.)</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Unlike Primoz Roglic, who spent three years in the Continental ranks before riding at the highest level, Palzer jumped in head first, signing and racing with a WorldTour team. After a two-week <a href=\"https://www.strava.com/activities/5062586038\" target=\"_blank\">altitude training camp</a> at Gran Canaria in late March and early April, Palzer’s first race was the five-day, second-tier Tour of the Alps. Palzer finished in a promising 47th place overall, roughly 20 minutes behind overall winner Simon Yates (BikeExchange).</p>\n\n\n\n<p>The race went better than both Palzer and his sports directors had expected. He impressed others too. “On Wednesday I met Simon Yates and Gianni Moscon at the doping control,” Palzer told German newspaper <a href=\"https://www.sueddeutsche.de/sport/radsport-anton-palzer-bergsteiger-1.5273193\" target=\"_blank\">Süddeutsche Zeitung</a>. “They then asked me how I actually do it – that I can keep up, even though I was only on skis a month ago. My teammate Felix Großschartner, who finished second on Wednesday, also said that I’m doing really well. I’m happy with that.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CN-rbaiHgp5/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CN-rbaiHgp5/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>In a sense, it’s not terribly surprising that Palzer was able to finish well inside the first half of the field. His extraordinary <a href=\"https://www.sportslab.at/blogs/news/toni-palzer-meine-eltern-haben-mir-eine-aussergewohnliche-pumpe-geschenkt\" target=\"_blank\">VO2max of 92 mL/kg/min</a> is close to the very <a href=\"https://cyclingtips.com/2019/06/what-the-highest-ever-vo2max-tells-us-about-genetics-and-cycling-success/\" target=\"_blank\">peak</a> of what’s been recorded in humans. His threshold power of 370 watts, at 62 kg, gives him a threshold power-to-weight ratio of roughly 6.0 W/kg – <a href=\"https://cyclingtips.com/2017/06/just-how-good-are-male-pro-road-cyclists/\" target=\"_blank\">right at home</a> among the world’s best.</p>\n\n\n\n<p>Palzer seems to fare fine uphill when the pace is consistent. He’s used to constant, hard efforts from years of ski mountaineering, a sport where any increases in intensity only tend to happen in the closing minutes of a race. Where Palzer struggled at the Tour of the Alps, though, was in the surging bunch, when spikes of power disrupted the regular rhythm he’s used to.</p>\n\n\n\n<p>“You really have to go over the limit extremely often; about 10 to 20 times a day,” he said. “And just so that you can keep up. You start a climb with 500 watts for the first three minutes. That’s enormous.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/COBI9ZrHEp_/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/COBI9ZrHEp_/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>Palzer’s cardiovascular system certainly isn’t letting him down. He just needs time to develop his leg strength.</p>\n\n\n\n<p>“I can’t get 100% of my power on the bike yet,” he said. “I’m running out of strength in my legs. But my cardiovascular system is keeping up well. I’m not at the limit, although we climbed almost 3,000 meters in altitude on Tuesday and Wednesday and even had to overcome 3,800 meters on Thursday.”</p>\n\n\n\n<p>While Palzer will need to improve to be more competitive at the highest level, he’s welcoming the challenge. The way he sees it, discovering where he’s lacking will only help him focus his training.</p>\n\n\n\n<p>“After this week you have an actual sense: ‘Where do I stand? What needs to be improved?’ And then you can build on that in a targeted manner,” he said.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/SI202007010121_hires_jpeg_24bit_rgb_news-1340x1005.jpeg\" /><figcaption>Palzer is an accomplished mountain runner. This shot was taken during his successful attempt at a record-breaking sub-three-hour crossing of the Watzmann, near his home town in Bavaria. (Image: Philipp Reiter/Red Bull Content Pool)</figcaption></figure>\n\n\n\n<p>But as Palzer is learning, being a great cyclist is about much more than your VO2max or how much power you can produce. It’s also about positioning in the bunch, conserving energy, and for Palzer especially, it’s adapting to life as part of a team.</p>\n\n\n\n<p>“The most important goal now will be to integrate myself well into the team, to learn as much as possible from my new teammates and to put myself in the service of the squad,” he said. “The challenges for me personally are, on the one hand, embarking on the development from individual sportsman to team player, and also a certain change of rhythm: Up until now I was primarily a winter sportsman, and now the focus is on summer.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/SI201701230069_hires_jpeg_24bit_rgb-1340x894.jpeg\" /><figcaption>Image: Hans Herbig/Red Bull Content Pool</figcaption></figure>\n\n\n\n<p>While he’s got plenty to work on, Palzer’s debut at the Tour of the Alps was an impressive one. He showed that, despite it being his first race in the pro peloton, he’s not out of his depth. Not by a long shot. His positive attitude is certainly a boon too. It won’t just help him in his quest to improve; it already seems to be affecting those around him too.</p>\n\n\n\n<p>“I think what I, above all, bring to the table is an enthusiasm that can be contagious,” he told Red Bull. “On Lake Garda I was in such high spirits for the entire two weeks. The sports directors said: ‘Toni, it is so refreshing to see how much you enjoy training!’ My friend Lukas Pöstlberger added: ‘Since you joined, I have experienced an extra boost of motivation’. That makes me very happy, of course.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CN5UGi6nXBd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CN5UGi6nXBd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Anton Palzer (@antonpalzer)</a></p></div></blockquote> \n\n\n\n<p>So far, Palzer is happy he chose to swap his skis for wheels. “It was the right decision,” he said. “I am extremely motivated to get really good at the sport and I also believe that I can be. When I look at what I can ride now with just zero experience and zero bike kilometers, I firmly believe that in a few years I can do something good.”</p>\n\n\n\n<p>He appears to have everything he needs to turn that belief into reality. With a few years of strength and conditioning work, and time spent working on his positioning and racecraft, the German could well be an imposing force.</p>\n\n\n\n<p>For now, Palzer will spend a couple weeks at home before heading to his next race: the five-day, UCI 2.1 Tour of Hungary. In all likelihood he’ll be there riding in support of a teammate. Likewise at most races he’ll attend this year. At some point though, we’re going to see Toni Palzer let off the leash in his favourite terrain: the high mountains. And when that happens: watch out.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/the-ski-mountaineer-who-climbed-straight-into-cyclings-worldtour/\">The ski mountaineer who climbed straight into cycling’s WorldTour</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d795f88cfa55ff98b60d669286408ad05d8b47af08aeee4a317001b2d36dc4d1","category":"Cycling"}