{"title":"Orbital and Intracranial Complications of Pediatric Rhinosinusitis Treated with Surgical Therapy: Institution Report of a Tertiary Referral Italian Center","link":"https://www.preprints.org/manuscript/202408.0430/v1","date":1722952913000,"content":"Introduction:  Acute rhinosinusitis (ASR) is a common condition in children, which can be burdened by orbital complication (OC) or intracranial complications (IC) that are rare but have potential for serious sequelae; therefore, it needs prompt diagnosis and treatment. The first line of treatment is intravenous antibiotic therapy. In case of failure of clinical improvement after 48 hours, hypovisus or negative prognostic factors (intracranial abscess, large orbital abscess or in intraconic or lateral localization, cavernous sinus thrombosis), surgical treatment is indicated. \n\nObjective: the purpose of this work is to describe the clinical profile, treatments and outcome of a series of patients undergoing surgical treatment for complications of ARS at a tertiary referral center.\n\nMaterial and methods: a retrospective analysis of clinical databases was conducted to identify all patients under 16 years of age who underwent surgical treatment for complications of ARS during the 20-year period 2000-2023. Demographic characteristics, clinical data, radiological investigations, surgical treatment, and follow-up performed were reported for each case.\n\nResults: 29 patients (20 males and 9 females), mean age 13 years, were included, 69% of whom had OC, 21% had IC, and 7% had both OC and IC. The main symptoms of OC were orbital edema, hypovisus and diplopia; while the main symptoms of IC were headache, fever, comitial seizures and focal neurological symptoms.\nMean hospitalization time was 11.75 (± 9.2) days. The mean length of hospital stay (LOS) was 9.1 days for OC, 21 days for IC and 14 days for OC + IC. A single patient manifested a Potts Puffy Tumor, with a LOS of 10 days.\nBasal CT and gadolinium-enhanced MRI were performed in all cases. Intravenous antibiotic therapy and surgical clearance was undertaken. The majority of patients (76%) underwent  endoscopic endonasal approach, 24% external transorbital approach, 1,16% orbital decompression and  0,58% superior eyelid approach. Any complications related to the surgical procedures were found. All patients with hypovisus and diplopia had complete recovery. During follow-up 7 patients (24%) had sinus recurrences, at a time range of 1 to 4 years after surgery.\n\nConclusion: our experience, in agreement with the data reported in the literature, confirmed the importance of appropriate diagnostic-therapeutic management to avoid potentially serious sequelae of complicated ARS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d797561b7ad474613bca16e2871d713e01d60320b1f127d7ce3ded51972fc460","category":"Interdisciplinary"}