{"title":"Differential associations between experiences of contraceptive care and subsequent contraceptive access and preferences among family planning patients by racial and ethnic identity: Evidence from Arizona, Iowa, and Wisconsin","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312111","date":1728655200000,"content":"<p>by Megan L. Kavanaugh, Madeleine Haas, Ayana Douglas-Hall</p>\r\n\r\nWhile many frameworks exist for building person-centered and equitable systems of contraceptive care, evidence indicates that the reality of patients’ experiences of care is often not in alignment with these ideals. Historical and current contexts of racism in the healthcare system contribute to negative perceptions and experiences of care, as well as reduced care-seeking behavior, for those who identify as Black, Indigenous, and people of color (BIPOC). Our objective in this analysis is to examine whether people’s past experiences of contraceptive care are a driver of subsequent barriers to contraceptive access, and whether this relationship differs across racial and ethnic identity. We draw on panel data from five waves of surveys collected between 2018–2023 among patients ages fifteen and older seeking family planning care at sites that receive public funding for these services in Arizona, Iowa, and Wisconsin. Overall and stratified by race/ethnicity, we examine cross-sectional and longitudinal associations between patients’ experiences of high-quality, person-centered contraceptive care and three contraceptive access outcomes: use of preferred contraception, satisfaction with contraceptive method, and experience of no barriers to accessing preferred contraception. We find longitudinal associations between patients experiencing higher-quality, more person-centered contraceptive care and subsequent satisfaction with contraceptive methods. Among non-Hispanic white-identifying patients, we find similar associations between shifting to higher-quality contraceptive care and use of preferred contraception, but we find no statistical relationship between experiencing higher-quality care and subsequent contraceptive outcomes for patients who identify as Black, Indigenous, or Person of Color (BIPOC). Highlighting the dissonance between clinical guidance for quality contraceptive care and patient experiences of care, and especially whether similar experiences across racial and ethnic identity lead to differential outcomes, is a crucial step toward bringing contraceptive care systems into alignment with principles of sexual and reproductive health equity.","author":"Megan L. Kavanaugh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d79c3ae8bcfc44ea171b82e989d07cbcb35a3047e16272a65d6fb8a2a32dce3b","category":"Interdisciplinary"}