{"title":"EA ใจดี ปลดสิทธิบัตรเทคโนโลยีให้นักพัฒนาอื่นใช้ฟรี เพื่อผลประโยชน์ของผู้พิการ","link":"https://www.blognone.com/node/124412","date":1629880558000,"content":"<div><div><div><p>EA ออกแถลงการ <a href=\"https://www.ea.com/commitments/positive-play/accessibility-patent-pledge\">Accessibility First Patent Pledge</a> ร่วมแบ่งปันเทคโนโลยีที่บริษัทจดสิทธิบัตรไว้ ให้บริษัทอื่นใช้ได้ฟรี เพื่อผลประโยชน์แก่การใช้งานและเล่นเกมของผู้พิการ โดย 5 สิทธิบัตรที่ EA ปลดล็อกชุดแรกมีดังนี้</p>\n<ul>\n<li>ระบบตรวจสอบและประมวลผลภาพที่มีความสว่างคล้ายกันแบบอัตโนมัติ ช่วยผู้ที่มีปัญหาด้านการมองเห็นสี ให้มองเห็นได้ง่ายขึ้น (สิทธิบัตรหมายเลข <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=10118097\">US 10,118,097</a> และ <a href=\"https://patents.google.com/patent/CN107694092B/en\">CN 107694092</a>)</li>\n<li>ระบบตรวจจับอัตราส่วนคอนทราสต์ และระบบปรับเรนเดอร์ ที่จะช่วยตรวจสอบและปรับปรุงคอนทราสต์ เพื่อช่วยให้การมองเห็นเช่นกัน (สิทธิบัตรหมายเลข <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=10878540\">US 10,878,540 </a></li>\n<li>ระบบปรับเสียงตามลักษณะตอบสนองทางกายภาพของผู้ใช้แบบเรียลไทม์ ที่จะปรับการเล่นเสียง โดยคำนึงจากปัญหาด้านการได้ยินของผู้ใช้ สิทธิบัตรนี้เป็นการจดทะเบียนไอเดียไว้ล่วงหน้า ยังไม่มีการพัฒนาโดย EA เป็นสิทธิบัตรหมายเลข <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=10790919\">US 10,790,919</a></li>\n<li>สุดท้ายคือระบบการสื่อสารแบบอิงบริบทในวิดีโอเกม หรือระบบ ping ในเกม Apex Legends นั่นเองสิทธิบัตรหมายเลข <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=11097189\">US 11,097,189</a></li>\n</ul>\n<p>ระบบ ping ในเกม Apex Legends คือระบบที่ช่วยให้ผู้เล่นสื่อสารในเกมได้โดยใช้แค่การชี้และคลิก โดยไม่ต้องพูดเอง และการสื่อสารจะเปลี่ยนไปตามสิ่งที่ผู้เล่นชี้ในฉากและในเมนู เช่น เมื่อผู้เล่นเปิดหน้าเมนู นำเม้าส์ไปชี้ที่ช่องใส่กระสุนที่ว่างเปล่าของตัวเอง แล้วกดปุ่ม ping ตัวละครก็จะพูดว่า “ฉันต้องการกระสุนชนิด…” หรือการชี้ไอเท็มที่พบในฉากแล้วกด ping เพื่อให้ตัวละครพูดว่า “มีไอเท็ม … ตรงนี้นะ”</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ce623824a9ba42240e21aa552f7ccb36.png\" /></p>\n<p>ผู้เล่นยังสามารถเลือกคำสั่งจาก ping wheel เพื่อเลือกบอกสิ่งต่างๆ กับเพื่อนร่วมทีมเพิ่มเติมได้ เช่น เพื่อใช้บอกว่ามีศัตรูอยู่ในพื้นที่ที่ผู้เล่นชี้ ให้เฝ้าระวังพื้นที่ที่ผู้เล่นชี้ หรือบอกให้โจมตีศัตรูที่ผู้เล่นชี้พร้อมกันทันที</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/366b04ffdcbd0f855547377bd076f8e8.png\" /></p>\n<p>ระบบนี้ที่ได้เสียงตอบรับที่ดีมากจากผู้เล่น เพราะช่วยให้ผู้เล่นสื่อสารกันเข้าใจได้ แม้เข้าใจภาษาอังกฤษแค่เพียงพื้นฐาน หรือมีปัญหาทางการได้ยิน เพราะจะมีตัวหนังสือบทบรรยายสิ่งที่ตัวละครพูด หรือลูกศรชี้และไฮไลท์ไอเท็มกับศัตรูขึ้นบอกในเกมเมื่อผู้เล่นกด ping ด้วย</p>\n<p>EA ยังปล่อยซอร์สโค้ดสำหรับระบบปรับสีภาพและคอนทราสต์สำหรับผู้มีอาการตาบอดสี ให้นักพัฒนานำไปใช้งานได้ฟรีบน <a href=\"https://github.com/electronicarts/Tunable-Colorblindness-Solution\">github</a> รวมถึงให้สัญญาว่าจะไม่มีการฟ้องร้องผู้ที่นำเทคโนโลยีในสิทธิบัตรเหล่านี้ไปใช้ และอาจปลดล็อกสิทธิบัตรอื่นให้อีกในอนาคต</p>\n<p>Chris Bruzzo รองประธานผู้บริหารฝั่งการค้าและมาร์เก็ตติ้งของ Positive Play โครงการเพื่อปรับปรุงสังคมเกมของ EA ระบุว่าการแชร์สิทธิบัตรครั้งนี้ เป็นไปเพราะอยากเห็นชุมชนเทคโนโลยี หันมาแชร์เทคโนโลยีที่จะสร้างประโยชน์ให้กับผู้อื่น เช่นผู้พิการ และช่วยให้ผู้คนสามารถสื่อสารกันได้ง่ายขึ้น โดยลดความ toxic ในเกมเช่นการเหยียดเพศหรือเหยียดสีผิวจากการพิมพ์สื่อสารหรือคุยด้วยเสียงได้ด้วย</p>\n<p>แม้ EA จะมี<a href=\"https://www.blognone.com/node/119354\">ประเด็นปัญหาด้านการหารายได้จากระบบกล่องสุ่ม</a> หรือ loot box ก่อนหน้านี้ แต่ก็<a href=\"https://www.blognone.com/node/123307\">เริ่มปรับปรุงระบบมากขึ้นในช่วงหลัง</a> รวมถึงการเปิดกว้างทางสิทธิบัตรครั้งนี้ ก็ถือได้ว่าเป็นการตัดสินใจที่ค่อนข้างใจกว้างอีกครั้งของ EA</p>\n<p>ที่มา - <a href=\"https://www.gamesindustry.biz/articles/2021-08-23-ea-shares-five-innovations-via-accessibility-patent-pledge-wants-other-devs-to-do-the-same\">gameindustry.biz</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ea\">EA</a></div><div><a href=\"/topics/accessibility\">Accessibility</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d79f42859ce46e5795f239663324a70f8d458e6c420ccb5fb55066782174d336","category":"Thai"}