{"title":"Attitude toward vaccination against COVID-19 and acceptance of the national “QazVac” vaccine in the Aktobe city population, West Kazakhstan: A cross-sectional survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303854","date":1715868000000,"content":"<p>by Saltanat T. Urazayeva, Saulesh S. Kurmangaliyeva, Asset A. Kaliyev, Kymbat Sh. Tussupkaliyeva, Arman Issimov, Aisha B. Urazayeva, Zhuldyz K. Tashimova, Nadiar M. Mussin, Toleukhan Begalin, Aimeken A. Amanshiyeva, Gulaiym Zh. Nurmaganbetova, Shara M. Nurmukhamedova, Saule Balmagambetova</p>\r\n\r\nThe scale of emergency caused by COVID-19, the ease of survey, and the crowdsourcing deployment guaranteed by the latest technology have allowed unprecedented access to data describing behavioral changes induced by the pandemic. The study aimed to present the survey results identifying attitudes toward vaccination against COVID-19 among the population of West Kazakhstan, the level of confidence in the national QazVac vaccine, and the role of different sources of information on COVID-19 in decision-making concerning vaccination. A computer-assisted survey was conducted using WhatsApp messenger. Overall, 2,009 participants responded, with a response rate of 92%. Most (83.1%) were immunized against COVID-19; among them, 20.1% obeyed the request of their employers that had been practiced within non-pharmaceutical interventions to contain the disease. The youngest respondents, individuals with a college education, students, and employed people, as well as those with chronic diseases, showed positive attitudes toward vaccination (all p&lt;0.05). About two-thirds of respondents (69.2%) expressed trust in all types of vaccines against COVID-19. Of those who refused vaccination (16.9%), about one-third feared vaccination consequences, and more than a third (38.2%) reported anti-vaccine sentiments. The decisive factors in accepting vaccination were trust in official sources of information (reports of medical experts, etc.) and, mainly, subjectively interpreted sufficiency of information about the disease, which had increased the odds of being vaccinated by 63.9% (OR 1.71, 95% CI [1.3;2.26], p&lt;0.05). Confidence in the domestic QazVac vaccine was expressed by 37.7% of respondents. History and severity of COVID-19 disease did not play a role in positive perceptions of vaccination, while illness after vaccination substantially affected vaccination approval (p 0.021). No significant differences have been observed regarding the overall performance across five vaccines (QazVac, Sputnik V, CoronaVac, Hayat-Vax, and BioNTech/Pfizer) available for Kazakhstan’s population (p 0.27).","author":"Saltanat T. Urazayeva","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d7a2d9e34335c420acc39cad50dc29f484855a157ebb004ddf9914fb02bef9e9","category":"Interdisciplinary"}