{"title":"Enve is making an adventure cycling reality TV show","link":"https://cyclingtips.com/2021/08/enve-is-making-an-adventure-cycling-reality-tv-show/","date":1629420600000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Screen-Shot-2021-08-20-at-12.45.02-pm-650x366.png\" /></div><h2>Enve is making an adventure cycling reality TV show</h2><p>\n</p><p>Do you like reality television that pits people against the elements? Do you like bikes? Would you like something that combines the two in one convenient package? </p>\n\n\n\n<p>Well, I’ve got some great news for you: Enve is getting into the reality TV game with an adventure cycling-themed show: the All Terrain Bicycle Challenge.</p>\n\n\n\n<p>Enve? Yes, <a href=\"https://cyclingtips.com/tag/enve/\">that Enve</a>: the Utah-based carbon composite bicycle and components manufacturer. Having established themselves as a premium brand in the cycling space, their latest foray is into the entertainment game, under the guiding hand of the eccentric adventure cycling influencer, <a href=\"https://www.instagram.com/ultraromance/?hl=en\">Benedict/Ronnie/UltraRomance</a>. </p>\n\n\n\n<p>The brand has a casting call out for five contestants in the forthcoming series. These contestants will each build up a lovely pink <a href=\"https://crustbikes.com/collections/frames/products/crust-x-enve-bombora\">Crust Bombora</a> frameset to their specs – choosing between 650B or 700C wheels, SPD or platform pedals, flat bars or drop bars, and making gear selections to best tackle the ‘World’s Most Challenging ATB Route’.  </p>\n\n\n\n<p>After setting up their bikes – BYO bikepacking bags – the contestants will be flown to an “undisclosed insanely rugged rural location” in the US, where they’ll have 18 hours to complete a 73 mile (117 km) course with around 11,345 feet (3,450 m) of elevation gain. Along the way, they’ll face mental and physical challenges (“rope bridges, tree climbing, moss naps!”), mechanical challenges (“cold forging, the wrong handlebars, spearfishing!”) and emotional challenges (“haunted train tunnels, bonking, the rapture!”)</p>\n\n\n\n<p>Is it all a glorified ad? Yes. But also, it seems like it could be a lot of fun. If you’re in the US and up for the challenge, <a href=\"https://atb.life/\">apply here</a>.  </p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/enve-is-making-an-adventure-cycling-reality-tv-show/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d7a4511e714622aecee5a7ca83fcb00eb1c93e36f2e1c1b49390be9b43464d67","category":"Cycling"}