{"title":"Mobilisation towards formal employment in the healthcare system: A qualitative study of community health workers in South Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002226","date":1710943200000,"content":"<p>by Hlologelo Malatji, Frances Griffiths, Jane Goudge</p>\r\n\r\nIn low and middle-income countries, community health workers (CHWs) play a critical role in delivering primary healthcare (PHC) services. However, they often receive low stipends, function without resources and have little bargaining power with which to demand better working conditions. Using a qualitative case study methodology, we studied CHWs’ conditions of employment, their struggle for recognition as health workers, and their activities to establish labour representation in South Africa. Seven CHW teams located in semi-urban and rural areas of Gauteng and Mpumalanga Provinces were studied. We conducted 43 in-depth interviews, 10 focus groups and 6 observations to gather data from CHWs and their representatives, supervisors and PHC facility staff. The data was analysed using thematic analysis method. In the rural and semi-urban sites, the CHWs were poorly resourced and received meagre remuneration, their employment outsourced, without employment benefits and protection. As a result of these challenges, the CHWs in the semi-urban sites established a task team to represent them. They held meetings and caused disruptions in the health facilities. After numerous unsuccessful attempts to negotiate for improved conditions of employment, the CHWs joined a labour union in order to participate in the local Bargaining Council. Though they were not successful in getting the government to provide permanent employment, the union negotiated an increase in their stipend. After the study ended, during the height of COVID-19 in 2020, when the need for motivated and effective CHWs became more apparent to decision makers, the semi-urban-based teams received permanent employment with a better remuneration. The task team and their protests raised awareness of the plight of the CHWs, and joining a formal union enabled them to negotiate a modest salary increase. However, it was the emergency created by the world-wide COVID-19 pandemic that forced decision-makers to acknowledge their reliance on this community-based cadre.","author":"Hlologelo Malatji","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d7a6564dc5b14c4c84d2e2bf0b3cdf55d63814f9c99df7a60759233716493fa9","category":"Environment"}