{"title":"Coral recruitment in the Toliara region of southwest Madagascar: Spatio‐temporal variability and implications for reef conservation","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12794?af=R","date":1712924137000,"content":"<h2>Abstract</h2>\n<p>Investigating coral recruitment is critical to better understand replenishment and resilience capacities of coral reef ecosystems and to improve their conservation. Here, we examined the spatio-temporal patterns of coral recruitment and the influence of confamilial adult coral cover in the region of Toliara, southwest Madagascar. Terracotta tiles were immersed from October to late January over a 3-year period (2018–2021) at 10 stations located on major reef habitats. Overall recruitment rates were relatively high compared to those of other reefs in the Southwestern Indian Ocean, ranging from 219.20 recruits.m<sup>−2</sup> in 2018–2019 to 156.30 recruits.m<sup>−2</sup> in 2020–2021. Recruit assemblages were dominated by Acroporidae (45.5%) and Pocilloporidae (45.0%), whereas Poritidae (1.9%) and “other” recruits (3.6%) were rarely recorded. Recruitment patterns varied among stations and habitats, with higher rates in patch reef (187.06 recruits.m<sup>−2</sup>) and outer slope stations (156.99 recruits.m<sup>−2</sup>) compared to inner slope stations (108.04 recruits.m<sup>−2</sup>). With the exception of “other” recruits, recruitment rates decreased between 2018 and 2019 and 2019 and 2020, followed by an increase in 2020–2021 that reached or even exceeded initial values at some stations. The abundance of Pocilloporidae recruits was positively correlated with the cover of confamilial adult corals, highlighting potential stock–recruitment or recruitment–limitation relationships, or an aggregative settlement of young stages near the established adult colonies, whereas no such relationships were recorded for other coral family categories. This study identified sites on the outer slope and patch reefs to consider prioritizing for protection as recruitment hotspots, as well as degraded inner slope sites that could benefit from restoration, with the important caveat that any measures should be accompanied by alternative income-generating activities through local involvement that suits the Malagasy context, such as locally marine managed areas.</p>","author":"Radonirina Lebely Botosoamananto, \nGildas Todinanahary, \nLahitsiresy Max Gasimandova, \nMahery Randrianarivo, \nFrançois Guilhaumon, \nLucie Penin, \nMehdi Adjeroud","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"d7b06a529fdfabf841382dd1f49d02b6b19ca00f3c1c8d81756003b516601c75","category":"Environment"}