{"title":"A pathogenesis-related protein, PRP1, negatively regulates root nodule symbiosis in Lotus japonicus","link":"https://academic.oup.com/jxb/article/75/11/3542/7624544?rss=1","date":1709856000000,"content":"<span><div>Abstract</div>The legume-rhizobium symbiosis represents a unique model within the realm of plant-microbe interactions. Unlike typical cases of pathogenic invasion, the infection of rhizobia and their residence within symbiotic cells do not elicit a noticeable immune response in plants. Nevertheless, there is still much to uncover regarding the mechanisms through which plant immunity influences rhizobial symbiosis. In this study, we identify an important player in this intricate interplay: <span>Lotus japonicus</span> PRP1, which serves as a positive regulator of plant immunity but also exhibits the capacity to decrease rhizobial colonization and nitrogen fixation within nodules. The <span>PRP1</span> gene encodes an uncharacterized protein and is named Pathogenesis-Related Protein1, owing to its orthologue in <span>Arabidopsis thaliana</span>, a pathogenesis-related family protein (At1g78780). The <span>PRP1</span> gene displays high expression levels in nodules compared to other tissues. We observed an increase in rhizobium infection in the <span>L. japonicus prp1</span> mutants, whereas <span>PRP1</span>-overexpressing plants exhibited a reduction in rhizobium infection compared to control plants. Intriguingly, <span>L. japonicus prp1</span> mutants produced nodules with a pinker colour compared to wild-type controls, accompanied by elevated levels of leghaemoglobin and an increased proportion of infected cells within the <span>prp1</span> nodules. The transcription factor Nodule Inception (NIN) can directly bind to the <span>PRP1</span> promoter, activating <span>PRP1</span> gene expression. Furthermore, we found that PRP1 is a positive mediator of innate immunity in plants. In summary, our study provides clear evidence of the intricate relationship between plant immunity and symbiosis. PRP1, acting as a positive regulator of plant immunity, simultaneously exerts suppressive effects on rhizobial infection and colonization within nodules.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"d7b4c69512b8ef44f53b6890e06dd72f87088b4d61145b70dcc5041cf55ab963","category":"Environment"}