{"title":"GM kills more than CarPlay support, it kills choice","link":"https://arstechnica.com/?p=1928486","date":1680300313000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/carplay-800x319.png\" alt=\"Apple CarPlay screenshot showing Devo's freedom of choice playing\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/carplay.png\">Enlarge</a> <span>/</span> Use your freedom of choice. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A long while back, Toyota told me it didn't want to give up interior real estate to Apple’s CarPlay. The automaker felt that losing that space to the tech company would be a huge mistake. Fast forward a few years, and after what I assume were some internal struggles, it caved and now you can get CarPlay and Android Auto on your fancy new Highlander, Prius, Tacoma, or Camry. It seemed like a silly decision had been reversed. Now it’s GM’s turn to go down the same path.</p>\n<p>Today, <a href=\"https://arstechnica.com/cars/2023/03/gm-confirms-its-dropping-apple-carplay-and-android-auto-from-2024-evs/\">news dropped that GM would be phasing out CarPlay support in future EVs</a>. In its partnership with Google, it hopes that all the features you get from mirroring your iPhone can be replaced with <a href=\"https://arstechnica.com/gadgets/2023/01/android-automotive-goes-mainstream-a-review-of-gms-new-infotainment-system/\">an Android Automotive feature</a>. GM, like Toyota before it, wants to control the digital real estate in its vehicles. It’s a revenue-based and walled-garden (ironically against Apple) decision that will cost them.</p>\n<p>Software-driven vehicles should be about choice. Instead, GM is making a short-sighted decision based on a trickle of revenue under the guise of better integration. Owning all the data that a vehicle generates while driving around could be a great source of cash. The problem is potential customers have become accustomed to choosing which device they use to navigate, chat, text, and rock out within their vehicle. They’ve grown weary of being mined for data at the expense of their choice and they’re really not all that keen on <a href=\"https://arstechnica.com/cars/2023/03/very-few-consumers-want-subscriptions-in-their-cars-survey-shows/\">in-car subscription services</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1928486#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1928486&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d7b4f8066f1d877346c3db5b31506a12afd4bbd9a84c019e0c12ed1de432ba92","category":"Tech"}