{"title":"Planetary-Scale Computing – 9.95 PFLOPS & Position 40 on the TOP500 List","link":"https://aws.amazon.com/blogs/aws/planetary-scale-computing-9-95-pflops-position-41-on-the-top500-list/","date":1624912647000,"content":"<p>Weather forecasting, genome sequencing, geoanalytics, computational fluid dynamics (CFD), and other types of high-performance computing (HPC) workloads can take advantage of massive amounts of compute power. These workloads are often spikey and massively parallel, and are used in situations where time to results is critical.</p> \n<p><span><strong>Old Way</strong></span><br /> Governments, well-funded research organizations, and Fortune 500 companies invest tens of millions of dollars in supercomputers in an attempt to gain a competitive edge. Building a state-of-the-art supercomputer requires specialized expertise, years of planning, and a long-term commitment to the architecture and the implementation. Once built, the supercomputer must be kept busy in order to justify the investment, resulting in lengthy queues while jobs wait their turn. Adding capacity and taking advantage of new technology is costly and can also be disruptive.</p> \n<p><span><strong>New Way</strong></span><br /> It is now possible to build a virtual supercomputer in the cloud! Instead of committing tens of millions of dollars over the course of a decade or more, you simply acquire the resources you need, solve your problem, and release the resources. You can get as much power as you need, when you need it, and only when you need it. Instead of force-fitting your problem to the available resources, you figure out how many resources you need, get them, and solve the problem in the most natural and expeditious way possible. You do not need to make a decade-long commitment to a single processor architecture, and you can easily adopt new technology as it becomes available. You can perform experiments at any scale without long term commitment, and you can gain experience with emerging technologies such as GPUs and specialized hardware for machine learning training and inferencing.</p> \n<p><span><strong>Top500 Run</strong></span></p> \n<div>\n <img src=\"https://media.amazonwebservices.com/blog/2021/DL_Borneo_Forest_Deforestation_2.jpeg\" />\n <span>Descartes Labs optical and radar satellite imagery analysis of historical deforestation and estimated forest carbon loss for a region in Kalimantan, Borneo.</span>\n</div> \n<p>AWS customer <a href=\"https://descarteslabs.com/\">Descartes Labs</a> uses HPC to understand the world and to handle the flood of data that comes from sensors on the ground, in the water, and in space. The company has been cloud-based from the start, and focuses on geospatial applications that often involves petabytes of data.</p> \n<p>CTO &amp; Co-Founder <a href=\"https://www.linkedin.com/in/mike-warren-3a0439b1/\">Mike Warren</a> told me that their intent is to never be limited by compute power. In the early days of his career, Mike worked on simulations of the universe and built multiple clusters and supercomputers including <a href=\"https://ieeexplore.ieee.org/document/1592642\">Loki</a>, <a href=\"https://www.wired.com/1998/07/do-it-yourself-supercomputers/\">Avalon</a>, and <a href=\"https://www.sciencedaily.com/releases/2004/06/040623082018.htm\">Space Simulator</a>. Mike was one of the first to build clusters from commodity hardware, and has learned a lot along the way.</p> \n<p>After retiring from <a href=\"https://www.lanl.gov/\">Los Alamos National Lab</a>, Mike co-founded Descartes Labs. In 2019, Descartes Labs used AWS to power a <a href=\"https://www.top500.org/\">TOP500</a> run that delivered 1.93 PFLOPS, landing at <a href=\"https://www.top500.org/system/179693/\">position 136</a> on the <a href=\"https://www.top500.org/lists/top500/2019/06/\">TOP500 list for June 2019</a>. That run made use of 41,472 cores on a cluster of C5 instances. Notably, Mike told me that they launched this run without any help from or coordination with the EC2 team (because Descartes Labs routinely runs production jobs of this magnitude for their customers, their account already had sufficiently high <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-resource-limits.html\">service quotas</a>). To learn more about this run, read <a href=\"https://medium.com/descarteslabs-team/thunder-from-the-cloud-40-000-cores-running-in-concert-on-aws-bf1610679978\">Thunder from the Cloud: 40,000 Cores Running in Concert on AWS</a>. This is my favorite part of that story:</p> \n<blockquote>\n <p>We were granted access to a group of nodes in the AWS US-East 1 region for approximately $5,000 charged to the company credit card. The potential for democratization of HPC was palpable since the cost to run custom hardware at that speed is probably closer to $20 to $30 million. Not to mention a 6–12 month wait time.</p>\n</blockquote> \n<p>After the success of this run, Mike and his team decided to work on an even more substantial one for 2021, with a target of 7.5 PFLOPS. Working with the EC2 team, they obtained an <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-capacity-reservations.html\">EC2 On-Demand Capacity Reservation</a> for a 48 hour period in early June. After some “small” runs that used just 1024 instances at a time, they were ready to take their shot. They launched 4,096 EC2 instances (C5, C5d, R5, R5d, M5, and M5d) with a total of 172,692 cores. Here are the results:</p> \n<ul> \n <li><strong>Rmax</strong> – 9.95 PFLOPS. This is the actual performance that was achieved: Almost 10 quadrillion floating point operations per second.</li> \n <li><strong>Rpeak</strong> – 15.11 PFLOPS. This is the theoretical peak performance.</li> \n <li><strong>HPL Efficiency </strong>– 65.87%. The ratio of Rmax to Rpeak, or a measure of how well the hardware is utilized.</li> \n <li><strong>N</strong>: 7,864,320 . This is the size of the matrix that is inverted to perform the Top500 benchmark. N<sup>2</sup> is about 61.84 trillion.</li> \n <li><strong>P x Q</strong>: 64 x 128. This is is a parameter for the run, and represents a processing grid.</li> \n</ul> \n<p>This run sits at position 40 on the June 2021 TOP500 list, and represents a 417% performance increase in just two years. When compared to the other CPU-based runs, this one sits at position 20. The GPU-based runs are certainly impressive, but ranking them separately makes for the best apples-to-apples comparison.</p> \n<p>Mike and his team were very pleased with the results, and believe that it demonstrates the power and value of the cloud for HPC jobs of any scale. Mike noted that the <a href=\"https://en.wikipedia.org/wiki/Connection_Machine\">Thinking Machines CM-5</a> that took the top spot in 1993 (and made a guest appearance in <a href=\"https://jurassic-pedia.com/cm-5-thinking-machine/\">Jurassic Park</a>) is actually slower than a single AWS core!</p> \n<p>The run wrapped up at 11:56 AM PST on June 4th. By 12:20 PM, just 24 minutes later, the cluster had been taken down and all of the instances had been stopped. This is the power of on-demand supercomputing!</p> \n<p><span><strong>Imagine a Beowulf Cluster</strong></span><br /> Back in the early days of <a href=\"https://slashdot.org/\">Slashdot</a>, every post that referenced some then-impressive piece of hardware would invariably include a comment to the effect of “Imagine a <a href=\"https://en.wikipedia.org/wiki/Beowulf_cluster\">Beowulf cluster</a>.” Today, you can easily imagine (and then launch) clusters of just about any size and use them to address your large-scale computational needs.</p> \n<p>If you have planetary-scale problems that can benefit from the speed and flexibility of the <a href=\"https://aws.amazon.com/\">AWS Cloud</a>, it is time to put your imagination to work! Here are some resources to get you started:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/hpc/\">AWS High Performance Computing</a> page.</li> \n <li><a href=\"https://aws.amazon.com/hpc/resources/\">AWS HPC Resources</a>.</li> \n <li><a href=\"https://aws.amazon.com/blogs/hpc/\">AWS HPC Blog</a>.</li> \n <li><a href=\"https://workshops.aws/categories/HPC\">AWS HPC Workshops</a>.</li> \n <li><a href=\"https://aws.amazon.com/hpc/parallelcluster/\">AWS ParallelCluster</a>.</li> \n <li><a href=\"https://aws.amazon.com/hpc/partner-solutions/?partner-solutions-cards.sort-by=item.additionalFields.partnerNameLower&amp;partner-solutions-cards.sort-order=asc&amp;awsf.partner-solutions-filter-partner-type=*all&amp;awsf.Filter%20Name%3A%20partner-solutions-filter-partner-location=*all&amp;awsf.partner-solutions-filter-partner-location=*all\">AWS High Performance Computing Competency Partners</a>.</li> \n</ul> \n<p><span><strong>Congratulations</strong></span><br /> I would like to offer my congratulations to Mike and to his team at Descartes Labs for this amazing achievement! Mike has worked for decades to prove to the world that mass-produced, commodity hardware and software can be used to build a supercomputer, and the results more than speak for themselves.</p> \n<p><a href=\"https://twitter.com/m_warren/status/1409525977147838477\"><img src=\"https://media.amazonwebservices.com/blog/2021/mike_early_cluster_1.png\" /></a></p> \n<p>To learn more about this run and about Descartes Labs, read <a href=\"https://blog.descarteslabs.com/achieves-number-41-in-top500-cloud-based-supercomputing?utm_campaign=Award-2021-TOP500&amp;utm_content=171067767&amp;utm_medium=web&amp;utm_source=aws\">Descartes Labs Achieves #41 in TOP500 with Cloud-based Supercomputing Demonstration Powered by AWS, Signaling New Era for Geospatial Data Analysis at Scale</a>.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p> \n<p><strong>PS</strong> – The original version of this post indicated that this run qualified for position 41. After publication, one of the entries was removed and this blog post has been updated accordingly.</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d7c34c8df113acb46d78491bef5e1f9a2faa2530c283c94ddbcf173945175b6b","category":"Tech"}