{"title":"Estimation Network for Multiple Chemical Parameters of Astragalus Leaves Based on Attention Mechanism and Multivariate Hyperspectral Features","link":"https://www.preprints.org/manuscript/202409.1405/v1","date":1726656469000,"content":"In the context of smart agriculture, accurately estimating plant leaf chemical parameters is crucial for optimizing crop management and improving agricultural yield. Hyperspectral imaging, with its ability to capture detailed spectral information across various wavelengths, has emerged as a powerful tool in this regard. However, the complex and high-dimensional nature of hyperspectral data poses significant challenges in extracting meaningful features for precise estimation. To address this challenge, this study proposes an end-to-end estimation network for multiple chemical parameters of Astragalus leaves based on attention mechanism (AM) and multivariate hyperspectral features (AM-MHENet). We leveraging HybridSN and multilayer perception (MLP) to extract prominent features from the hyperspectral data of Astragalus membranaceus var. mongholicus (AMM) leaves and stems, as well as the surface and deep soil surrounding AMM roots. This methodology allows us to capture the most significant characteristics present in these hyperspectral data with high precision. The AM is subsequently used to assign weights and integrate the hyperspectral features extracted from different parts of the AMM. The MLP is then employed to simultaneously estimate the chlorophyll content (CC) and nitrogen content (NC) of AMM leaves. Compared with estimation networks that utilize only hyperspectral data from AMM leaves as input, our proposed end-to-end AM-MHENet demonstrates superior estimation performance. Specifically, AM-MHENet achieves an R2 of 0.983 with an RMSE of 0.73 for the estimation of CC in AMM leaves. For NC estimation, AM-MHENet achieves an R2 value of 0.977 with an RMSE of 0.27. These results underscore AM-MHENet’s effectiveness in significantly enhancing the accuracy of both CC and NC estimation in AMM leaves. Moreover, these findings indirectly suggest a strong correlation between the development of AMM leaves and stems, as well as the surface and deep soil surrounding the roots of AMM, and directly highlight the ability of AM to effectively focus on the relevant spectral features within the hyperspectral data. This findings from this study could offer valuable insights into the simultaneous estimation of multiple chemical parameters in plants, thereby making a contribution to the existing body of research in this field.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d7c4926b897877a6b71f5dcca7e5d02a1e2aaedf291d521677524bd605f37a8e","category":"Interdisciplinary"}