{"title":"Differences in Children and Adolescents with Depression before and after a Remediation Program: An Event Related Potentials Study","link":"https://www.preprints.org/manuscript/202405.1717/v1","date":1716796697000,"content":"Depression is diagnosed when a specific set of symptoms appear over a defined period with a certain intensity. According to the DSM-5, Major Depressive Disorder (MDD) is diagnosed when five or more symptoms are present over a two-week period. Depression, a debilitating mental health disorder affecting millions worldwide, poses a complex challenge for researchers and clinicians. In children and adolescents, depression can result in negative outcomes such as substance abuse, academic problems, risky sexual behavior, physical health issues, impaired social relationships, and a thirty-fold increased risk of suicide. This paper presents the findings of a study that evaluated the effectiveness of Cognitive Behavioral Therapy (CBT) alone and CBT combined with selective ser-otonin reuptake inhibitors (SSRIs) in a remediation program. The study included 16 children and adolescents with depression (8 males and 8 females) and 16 typically developing peers (8 males and 8 females) aged 9 to 15 years (M = 11.94, SD = 2.02). Baseline evaluations using Event-Related Po-tentials (ERPs), the Children Depression Inventory (CDI), and reaction time tests showed that participants with depression had cognitive deficits in attention and memory, indicated by longer P300 latencies. After undergoing remediation with either CBT alone or CBT combined with med-ication, the children and adolescents with depression exhibited lower CDI scores and shorter P300 latencies and reaction times compared to before remediation and relative to the control group.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d7c582dac9aff3e69b43b28ed645b41bff462259a03eb775de876d98c1b55464","category":"Interdisciplinary"}