{"title":"Judge in Upcoming Epic v. Apple Trial to Limit In-Person Attendees","link":"https://www.macrumors.com/2021/03/26/epic-v-apple-trial-limited-attendees/","date":1616790100000,"content":"Apple and <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> lawyers are continuing to plan for their upcoming May 3 bench trial, and in a preparatory conference held today, the judge overseeing the case said that attendance will be limited due to the ongoing global health crisis (via <em><a href=\"https://www.law360.com/articles/1369202\">Law360</a></em>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite_apple_featured.jpg\" alt=\"\" width=\"2140\" height=\"1204\" class=\"aligncenter size-full wp-image-754674\" />\r\n<br/>\r\nU.S. District Judge Yvonne Gonzalez Rogers has been <a href=\"https://www.macrumors.com/2021/03/01/epic-vs-apple-in-person-trial-may-3/\">planning for an in-person trial</a> because she believes that the case is significant enough that the court should hear it in person. She has also said in the past that Apple and &zwnj;Epic Games&zwnj; witnesses in the case will be less likely to lie when sworn in in a physical courtroom.\r\n<br/>\r\n\r\n<br/>\r\nCOVID-19 cases are dropping in the San Francisco Bay Area and people are getting vaccinated, which means the courtrooms are able to open up. Regardless of whether attendees have been vaccinated, however, masks will be required.\r\n<br/>\r\n\r\n<br/>\r\n&zwnj;Epic Games&zwnj; and Apple will each be limited to six people in the courtroom at a time, and the press and the public will not be able to attend in person, but live audio will be provided. All testifying witnesses will be given a clear mask so that the judge is able to clearly see responses, and legal teams will be able to wear cordless microphones to make them easy to hear.\r\n<br/>\r\n\r\n<br/>\r\nUnused rooms in the courthouse may be able to be used for legal team meetings, but Gonzalez Rogers recommended that Apple and &zwnj;Epic Games&zwnj; rent office space across from the courthouse in case it's needed.\r\n<br/>\r\n\r\n<br/>\r\nThe trial is set to take place on May 3, and each side will have 45 hours to present their case. Each side is also allowed to submit 100,000 words that can be split up among experts for reports, and the deadline for exchanging reports is April 27.\r\n<br/>\r\n\r\n<br/>\r\nApple and &zwnj;Epic Games&zwnj; are expected to call a number of high-profile witnesses. Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>, Apple Fellow <a href=\"https://www.macrumors.com/guide/phil-schiller/\">Phil Schiller</a>, and Apple Senior Vice President of Software Engineering Craig Federighi will all be attending to defend the company's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> practices. \r\n<br/>\r\n\r\n<br/>\r\nCook will be directly examined for one hour, with a one hour cross examination also included. Federighi will testify for two hours with a one hour cross examination, while Schiller, who is in charge of the &zwnj;App Store&zwnj;, will testify for a total of 10 hours. Apple last week said that its senior executives are eager to share the impact that the &zwnj;App Store&zwnj; has had on economies around the world.<blockquote>Our senior executives look forward to sharing with the court the very positive impact the ‌&zwnj;App Store&zwnj;‌ has had on innovation, economies across the world and the customer experience over the last 12 years. We feel confident the case will prove that Epic purposefully breached its agreement solely to increase its revenues, which is what resulted in their removal from the ‌&zwnj;App Store&zwnj;‌. By doing that, Epic circumvented the security features of the ‌&zwnj;App Store&zwnj;‌ in a way that would lead to reduced competition and put consumers' privacy and data security at tremendous risk.</blockquote>&zwnj;Epic Games&zwnj; witnesses include &zwnj;Epic Games&zwnj;‌ CEO Tim Sweeney and other Epic employees, and third-party witnesses will include executives from Facebook, Microsoft, Nvidia. &zwnj;Epic Games&zwnj; also intends to call on iTunes chief <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a> and former iOS software chief Scott Forstall, who was involved in the &zwnj;App Store&zwnj;'s launch.\r\n<br/>\r\n\r\n<br/>\r\nApple lawyers today said all but one witness will testify in person, and Epic too plans to have most of its witnesses appear in person.\r\n<br/>\r\n\r\n<br/>\r\nThe May 3 trial will focus on <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">Epic's accusation</a> that Apple is a \"behemoth seeking to control markets, block competition, and stifle innovation\" by imposing \"anti-competitive restraints\" against &zwnj;App Store&zwnj; developers and employing \"monopolistic practices in markets.\" &zwnj;Epic Games&zwnj;' most popular title, Fortnite, has been out of the &zwnj;App Store&zwnj; for months now as the two companies await the trial. \r\n<br/>\r\n\r\n<br/>\r\n&zwnj;Epic Games&zwnj; plans to argue that the 30 percent cut that Apple takes from apps is \"oppressive,\" as is the rule that requires developers to use in-app purchases. Apple recently <a href=\"https://www.macrumors.com/2020/11/18/apple-drops-app-store-fees/\">lowered the 30 percent commission rate</a> to 15 percent for developers that make under &#36;1 million in a given calendar year, but this does not apply to major developers like &zwnj;Epic Games&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\nApple will argue that its &zwnj;App Store&zwnj; prices are fair and in line with <a href=\"https://www.macrumors.com/2021/02/25/valve-apple-data-request-for-epic-games-case/\">other competing software marketplaces</a>, and that its &zwnj;App Store&zwnj; policies offer important protections for consumers.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/fortnite/\">Fortnite</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/26/epic-v-apple-trial-limited-attendees/\">Judge in Upcoming Epic v. Apple Trial to Limit In-Person Attendees</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/judge-in-upcoming-epic-v-apple-trial-to-limit-in-person-attendees.2289718/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=rrY6k0Mc_dk:gRtxB4j761Q:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=rrY6k0Mc_dk:gRtxB4j761Q:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/rrY6k0Mc_dk\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d7c5235e60dd29c03468e93f7286020f33b4249ba63713787e660eab8b7df353","category":"Apple"}