{"title":"ดิสนีย์อยากระงับข้อพิพาทกับ Scarlett Johansson จากการฉาย Black Widow ลง Disney+","link":"https://www.blognone.com/node/124386","date":1629780092000,"content":"<div><div><div><p>มีความคืบหน้า<a href=\"https://www.blognone.com/node/123969\">คดีฟ้องร้องโดย Scarlett Johansson นักแสดงนำหนัง Black Widow ฟ้องร้องบริษัทดิสนีย์</a> จากการสตรีมหนังใน Disney+ ทำให้สูญเสียผลประโยชน์ในฐานะนักแสดง โดยทนายความของดิสนีย์ร้องต่อศาลเพื่อระงับข้อพิพาทหรือ อนุญาโตตุลาการ</p>\n<p>เนื้อหาส่วนหนึ่งในคำร้องของทนายความดิสนีย์ระบุว่าตามสัญญาระบุว่า ตัวหนังจะต้องมีการฉายในโรงหนังไม่ต่ำกว่า 1,500 จอ ซึ่งหนังเรื่องนี้เปิดตัวจริงมากกว่า 9,600 จอในสหรัฐอเมริกาและกว่า 30,000 จอทั่วโลก นอกจากนี้ ทนายความของดิสนีย์ยังมีปัญหากับคำกล่าวอ้างของ Johansson ที่ว่าเธอสูญเสียรายได้จากโมเดลฉายหนังคู่กับสตรีมมิ่ง ซึ่งไม่ได้ระบุแน่ชัดในสัญญา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6faaa66b9582de0c3cac75afa0d7c59d.png\" /></p>\n<p>ยังไม่รู้แน่ชัดว่าฝั่ง Johansson จะยอมรับการระงับข้อพิพาทหรือไม่ แต่ The Hollywood Reporter รายงานอ้างคำสัมภาษณ์ทนายความ John Berlinski ว่า Marvel ให้สัญญาว่าจะฉาย Black Widow ในโรงทั่วไปเหมือนกับหนังเรื่องอื่นๆ และยืนยันว่า Disney+ จะไม่เข้ามากินส่วนแบ่งเพื่อหวังเพิ่มยอดผู้ใช้งานบนแพลตฟอร์ม ทางทนายความตั้งตารอจะยื่นหลักฐานเพื่อพิสูจน์คดีนี้ต่อไป</p>\n<p>คดีนี้เป็นที่ถกเถียงในวงกว้าง ที่ไปไกลกว่าการเปรียบเทียบประสบการณ์ระหว่างดูหนังในโรงและสตรีมมิ่ง แต่ยังรวมถึงรายได้นักแสดงและทีมงานผู้สร้างหนังด้วย</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/8/23/22638553/disney-black-widow-lawsuit-arbitration-motion-scarlett-johansson\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/disney-plus\">Disney+</a></div><div><a href=\"/topics/marvel\">Marvel</a></div><div><a href=\"/topics/streaming\">Streaming</a></div><div><a href=\"/topics/movie-0\">Movie</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d7ceed1a563a223549ad95c955186a5dbe1c57275f87cf6a9e8b877b3882fafa","category":"Thai"}