{"title":"Domestication and the evolution of crops: variable syndromes, complex genetic architectures, and ecological entanglements","link":"https://academic.oup.com/plcell/article/36/5/1227/7577726?rss=1","date":1705536000000,"content":"<span><div>Abstract</div>Domestication can be considered a specialized mutualism in which a domesticator exerts control over the reproduction or propagation (fitness) of a domesticated species to gain resources or services. The evolution of crops by human-associated selection provides a powerful set of models to study recent evolutionary adaptations and their genetic bases. Moreover, the domestication and dispersal of crops such as rice, maize, and wheat during the Holocene transformed human social and political organization by serving as the key mechanism by which human societies fed themselves. Here we review major themes and identify emerging questions in three fundamental areas of crop domestication research: domestication phenotypes and syndromes, genetic architecture underlying crop evolution, and the ecology of domestication. Current insights on the domestication syndrome in crops largely come from research on cereal crops such as rice and maize, and recent work indicates distinct domestication phenotypes can arise from different domestication histories. While early studies on the genetics of domestication often identified single large-effect loci underlying major domestication traits, emerging evidence supports polygenic bases for many canonical traits such as shattering and plant architecture. Adaptation in human-constructed environments also influenced ecological traits in domesticates such as resource acquisition rates and interactions with other organisms such as root mycorrhizal fungi and pollinators. Understanding the ecological context of domestication will be key to developing resource-efficient crops and implementing more sustainable land management and cultivation practices.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"d7d5b01d05d6e86ae248dcff938b11229b1731974fa861f8c04f459d69cd40dc","category":"Environment"}