{"title":"Senators slam Facebook, say it’s using Big Tobacco playbook to hook kids","link":"https://arstechnica.com/?p=1799950","date":1633093380000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235604584-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235604584.jpg\">Enlarge</a> <span>/</span> Sen. Marsha Blackburn (R-Tenn.) speaks as Facebook head of global safety, Antigone Davis, testifies before a hearing of the Senate Subcommittee on Consumer Protection focusing on Facebook, Instagram, and mental health harms on September 30, 2021. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/senator-marsha-blackburn-speaks-as-facebook-global-head-of-news-photo/1235604584?adppopup=true\">Patrick Semansky / POOL / AFP</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Senators spent three hours yesterday grilling Facebook’s head of global safety, Antigone Davis, as she attempted to defend the company’s approach to handling the mental wellbeing of children who use its services.</p>\n<p>“Facebook has taken Big Tobacco’s playbook,” said Sen. Richard Blumenthal (D-Conn.), chair of the Senate Commerce Subcommittee on Consumer Protection. “It has hidden its own research on addiction and the toxic effects of its products, it has attempted to deceive the public and us in Congress about what it knows, and it has weaponized childhood vulnerabilities against children themselves.”</p>\n<p>The hearings come on the heels of a Wall Street Journal <a href=\"https://www.wsj.com/articles/facebook-instagram-kids-tweens-attract-11632849667?mod=article_inline\">investigation</a> that revealed that Facebook has been sitting on a cache of research that shows just how harmful its products can be for children under the age of 18. The whistleblower documents, which also have been <a href=\"https://arstechnica.com/tech-policy/2021/09/leaked-documents-reveal-the-special-rules-facebook-uses-for-5-8m-vips/\">turned over</a> to Congress, offer “deep insight into Facebook’s relentless campaign to recruit and exploit young users,” Blumenthal said.</p></div><p><a href=\"https://arstechnica.com/?p=1799950#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799950&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d7d6d429672a6295015a9b1671627a9ab8ee67ea2c8b4e7b38bd5453026e3431","category":"Tech"}