{"title":"Community building, male allies and accessibility: How to close the gender gap in sport","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/close-the-gap","date":1709881201000,"content":"\n      <p><em>This article was originally published in Rouleur 121: Close the Gap – the sequel to our groundbreaking women’s edition. <a href=\"https://www.rouleur.cc/collections/rouleur-magazine/products/issue-121\">Buy your copy of this magazine in the Rouleur Emporium</a>.</em></p>\n<p><em></em>The mission of <em>Rouleur 121: Close the Gap</em> was to empower more women to take part not just in cycling, competitive and otherwise, but in sports in general. From training through the menstrual cycle, to overcoming stereotypes and building welcoming communities, we wanted to help close the gap between men’s and women’s participation in sport. While progress has been made, there is still work to be done. </p>\n<p>We invited six inspiring and powerful women who have an incredible breadth of varied experience in sports to give their thoughts on how to narrow the gap between male and female participation in sport, from building communities, to having more male allies and making sport more accessible for all women.</p>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/01_ORLA_CHENNAOUI_OK_MontseGalbany.jpg?v=1709737560\" /></em></p>\n<div>\n<div>\n<div>\n<h3><span>Society must enable cycling and active transport as a safe option for everybody</span></h3>\n<p><em>by Orla Chennaoui</em></p>\n<p>I used to see cycling as a sport, but now it is an entire way of life. Riding my bike for everyday journeys, to the shops, on the school run, for hospital appointments and nights out with friends, has given me a bigger boost to my mental, as well as physical, fitness than I could ever have imagined. I would dearly love to see more women feeling safe and comfortable riding their bikes in everyday life.</p>\n<p>Laws need to change to protect vulnerable road users, and infrastructure has to be improved to facilitate a greener, fitter future. We need to get serious about campaigning for change, in the same way we saw in the Netherlands in the 1970s. We almost dismiss the Dutch model as being impossible in car-centric countries, completely overlooking the fact they were on the same automotive trajectory as the rest of us, until people power forced a change. The best time to have done this in the UK, and other countries around the world, was then (or even before), but the second-best time is now and we shouldn’t pay any heed to the inertia and fatalism that seems to prevent positive steps ever being taken.</p>\n<p>We also need to change attitudes within the communities of people who ride bikes. If you travel on two wheels, you are a cyclist, and there is no hierarchy. You don’t need Lycra, you don’t need a road bike, you don’t need approval from any peer group to qualify as a cyclist. Riding an e-bike isn’t cheating; this isn’t a race. I’d love to see more promotion of everyday riding on social media, instead of feeds packed with sepia shots of matching kit on shiny limbs on beautiful mountain passes. As aspirational as these images are, they’re not realistic for the vast majority of people, and we shouldn’t have any conception of cycling clothes, because any clothes should be cycling clothes.</p>\n<p>Simple, basic, everyday bike riding gives a feeling more beautiful than anything that can be captured on instagram. The wind on your face, the sensation of breathing the fresh air, the feeling of motion, the rhythm of pedalling, the sense of satisfaction that comes from having got somewhere under your own steam are all personally empowering, and the wider benefits – less pollution and congestion – are passed on to everybody.</p>\n<p>More generally, in bike riding as in all things, I would love to get to the stage where we can simply enjoy the endeavour, without feeling the sole responsibility for constant campaigning for equality. I want to hear male voices making our spaces safer from their own peers, I want to see male campaigners trying to force change on their side. We still live in a man’s world and I would love to see more of them, more of you, take a greater responsibility for the part you play, however unwittingly.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/02_LIZZIE_DEIGNAN_OK_MontseGalbany.jpg?v=1709737256\" /></p>\n<div>\n<div>\n<div>\n<h3><strong>We need more male allies</strong></h3>\n<p><em>by Lizzie Deignan </em></p>\n<p><span>I had a conversation with my teammates recently about male allies, like, do we even have any? Do we know any, in either men’s or women’s cycling? We came up with a handful, but it underlined to me the importance of male allies and how impactful they can be. </span></p>\n<p>In society, there are still mostly men in charge at the top. In cycling, men are making the decisions on sponsorship and in race organisations, the president of the UCI is male... We’re still in a male-dominated society, and as long as that doesn’t change – and it will, because we’re catching up – we need male allies. One of the biggest jobs is to get rid of the dinosaurs. As long as people don’t stand up to people like Patrick Lefevere [<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-enough-is-enough-patrick-lefevere-s-comments-must-be-stopped\">Soudal–Quick-Step team boss, renowned for offensive commentary</a>] the situation will continue, because people like him have louder voices. Being silent can mean being complicit, and I think many men potentially don’t realise the impact they can have by speaking out.</p>\n<p>Men need to understand that it is also their responsibility to push for equality. Everybody is self-interested to a certain degree, but it’s about educating everybody that their voice is important, all the way from the top of the sport to the grassroots. There are great examples out there, like Mark Cavendish, who has always been a brilliant ally. He shows up on the roadside at the Women’s tour, he’s spoken vocally about his admiration for Marianne Vos – he was asked about his 34 stage wins at the Tour, and he pointed out Marianne had just won 34 in the Giro. I’ve also heard about a big rider – one of the biggest in the world – only signing for a team if they started a women’s team, and that is hugely impactful. Trek developed a special lightweight paintjob for Mads Pedersen’s bike in the Classics and he said he would only ride it if the female leaders were given the same paintjob.</p>\n<p>We had a Zoom call to introduce us to the new sponsors at Lidl recently, and Kenneth McGrath, the Lidl CEO, told us that the main reason they came on board as a sponsor with Trek was that we had a women’s team. These things are vitally important, but they are also still comparatively rare. I’ve had the luxury and privilege of being supported by male allies my whole life. I felt very much championed by the men in my family, and my husband completely supports my dreams and aspirations – I’m only able to do the job I do because of him, and it’s an unusual situation.</p>\n<p>Recently, when Urška Žigart came close to winning a stage of the Tour de Suisse, Het Nieuwsblad reported her as “Tadej Pogačar’s girlfriend” in the headline instead of using her name. This is a national newspaper (which still gives Patrick Lefevere a column). So male allies’ voices will need to be louder than that. I think the next generation is being brought up differently and will be better educated. That will have its own impact, but we must always question our own unconscious biases.</p>\n<p>The Black Lives Matter movement opened my eyes, because in a selfish way, I hadn’t realised how white our sport was. Sexism has always been at the forefront of my mind because it affects me, but I needed to understand the positive impact I can have on diversity, even though it doesn’t directly affect me. Men: think in the same way.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/04_SYDNEY_CASSIDY_OK_MontseGalbany.jpg?v=1709737282\" /></p>\n<div>\n<div>\n<div>\n<h3><strong>Let’s welcome everyone</strong></h3>\n<p><em>by Sydney Cassidy </em></p>\n<p><span>Building friendships and communities is key to bringing more women into sport. We also need to ensure that social media and other platforms put out messages that show people how doing sport or going to the gym can be a social and friendly activity. With my experience and my audience, a lot of people have reached out to me and said that, as adults, they struggle to meet new people and make friends. It’s not like school days where you just bump into people; it can be really difficult. </span></p>\n<p><span>Using sport as a way to connect with others and build relationships with people that you can meet up with weekly or fortnightly is helpful. I think we’d see a lot more women getting into sport if they understood that it was a space which would welcome them with open arms. It’s important to try and help women to see that sport is so much more than a competitive environment or a space with really tight guidelines. </span><span>There shouldn’t be certain ways you have to do things and it doesn’t have to be an individual thing, either. Even cycling can be quite an independent sport in some ways, but it’s not just about the activity, it’s about the before and the after, as well as the conversations and small talk that happens in between. </span></p>\n<p><span>For myself, that’s where my content creation comes into play. I noticed that there was a big, sociable part of the gym community that I wouldn’t have really known existed if I hadn’t stumbled upon it. I wanted to share that from an observational, fly-on-the- wall perspective and show people it was there. A lot of people responded that they didn’t even know this was how people could interact with each other in sport, in the gym, in that environment. I think more awareness about the good in communities in sports would be a great way to encourage people to get involved. </span></p>\n<p><span>It’s about breaking down the expectations we have set for ourselves about what sport should be. You don’t need to wear the best clothing or have the best things, you can just turn up and come and join, judgement-free. The people who are already into it mostly just have a passion for it and want to encourage others too. Another thing that matters to me is showing people that environments like the gym are safe places that can be entered from any experience level, whether you have never been before or you are very advanced, it’s a welcoming space for all. </span></p>\n<p><span>A lot of people feel like they want to join, but there is always a ‘but’. When I set up my ‘Gym Girls Locker Room’ Facebook community, it grew to over 100,000 members in 40 weeks. That came out of me feeling like women needed more of a place for them to connect with others and feel that community spirit. So many people on that page have found friends and support, and that community helps people work through their anxieties or lack of confidence that they might have. </span></p>\n<p><span>For me, when I found friends in the gym, I suddenly noticed a complete shift in the way I held myself there and approached it. It became something I enjoyed and there was more than one reason to go there. It wasn’t just about the sport part, it was about maintaining good relationships and having a place to chat and socialise. Especially with so many people working from home, sport can be a place to meet people with similar values to you.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/03_STEPHANIE_HILBORNE_OK_MontseGalbany.jpg?v=1709737320\" /></span></p>\n<div>\n<div>\n<div>\n<h3><strong>Breaking the cycle: it’s time to stop stereotyping</strong></h3>\n<p><em>by Stephanie Hilborne</em></p>\n<div>\n<div>\n<div>\n<p><em>“Let me tell you what I think of bicycling. I think it has done more to emancipate women than anything else in the world...... I stand and rejoice every time I see a woman ride by on a wheel... the picture of freedom, untrammelled.”</em></p>\n<p><span>— Susan B. Anthony, campaigner for women’s suffrage [1820-1906]</span></p>\n<p><span>Do you recall riding a bicycle as a child with happy nostalgia? The exhilaration of the wind in your face and your hair as you sped down a hill, the freedom and sense of adventure? It granted us independence and self-reliance, liberating us from dependency on adults. However, between the carefree days of youth and the responsibilities of female adulthood, nearly half of women (49 per cent) get off their bikes. The statistics paint a disheartening picture. Just 12 per cent of women have ridden a bicycle at least twice in the past four weeks compared to 22 per cent of men. </span></p>\n<p><span>Regrettably, the gender disparity in cycling is not a recent phenomenon. In the 1890s, cycling emerged as a popular leisure pursuit, captivating people with the newfound ‘freedom machines’. For women, bicycles expanded their horizons and offered a taste of independence from the oppression they endured at home and in wider society. However, the long, cumbersome skirts and corsets of the Victorian era presented a challenge and if that wasn’t hard enough, women riding bicycles often faced verbal abuse and accusations of promiscuity, even brick-throwing, for daring to defy societal expectations. </span></p>\n<p><span>Fortunately, we no longer need to dodge flying bricks in the streets, but many women still perceive cycling as risky, mainly due to fear of harassment, traffic dangers and inadequate cycling infrastructure. Added to this, in the UK women have 42 minutes less leisure time than men per day, so heading off on a two-wheeled adventure or substituting motorised transport for a bike becomes challenging. Why is this? Gender stereotyping continues to limit women’s lives with damaging and long-lasting effects. </span></p>\n<p><span>From the moment they are born, girls are treated differently to boys. We recently conducted research at Women in Sport which found girls as young as five are bombarded with messages that crush their sense of adventure and self-belief and make them feel responsible and vulnerable. We expect them to avoid taking risks, to stay safe and clean, look pretty and care for others. It is simply so wrong to stifle girls’ freedom like this. Most very young girls don’t feel they belong in sport or on a bike even at primary school and by secondary school, less than half of girls (45 per cent) have good or very good self-belief compared to 61 per cent of boys. This matters. </span></p>\n<p><span>Anxiety in teenage girls is spiralling upwards along with self-harm and eating disorders; yet riding a bike, playing sport and getting outside can be powerful antidotes. By midlife our research shows that women are suffering from the cumulative impact of decades of gender stereotyping. They are shouldering the vast majority of unpaid care duties and trying to sustain a job while managing a myriad of menopausal symptoms. Their own needs are largely ignored by society and they can feel invisible. Yet sustaining fitness and activity levels for women of this age has life-changing benefits, transforming our happiness, mental wellbeing and physical health. </span></p>\n<p><span>The story doesn’t get much cheerier as a result. As women reach later life, or ‘wiser life’ as I like to think of it, they are twice as likely as men to suffer a fracture after a fall, in no small part because they have missed out on the load-bearing exercise needed to guard their bones against lack of oestrogen. </span></p>\n<p><span>This unnecessary suffering must end. Cycling can build resilience, self-belief and a sense of belonging. We must allow girls to take risks, let them to go fast, take a tumble, get up and indulge in the joy of a mud-splattered face. Our teenage daughters deserve time away from toxic social media and the judgmental eye to feel the freedom of a bike. Women in midlife should be released to reclaim their bodies and embrace the joy of movement. Over the last 140 years the humble bicycle has had a positive impact on the lives of women. It’s brought independence and liberation – even if that’s just an hour away from the humdrum of everyday life. It’s time we empowered more women to take their seat in the saddle and pedal on.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/05_JOOLS_WALKER_OK_MontseGalbany.jpg?v=1709737528\" /></span></p>\n<div>\n<div>\n<div>\n<h3><strong>Breaking barriers: making cycling more inclusive for women of colour</strong></h3>\n<p><em>by Jools Walker</em></p>\n<p><span>In recent years, especially during the pandemic, the cycling community has grown rapidly, and the activity is gaining popularity around the globe. However, while cycling has become more mainstream, certain barriers to entry still exist for different communities, particularly for women of colour (WOC). We in the cycling community must address these challenges and work towards making cycling a more inclusive and empowering activity for everyone. </span></p>\n<p><span>To make cycling more inclusive for women of colour, it’s crucial that we acknowledge and address the barriers that they face. One critical aspect is representation – ensuring that women of colour are visible and represented positively in the cycling community. This can be achieved by featuring WOC cyclists in media and advertising, and sponsoring events highlighting their achievements. Moreover, bike companies and organisations should actively promote diversity within their own teams in terms of gender and ethnicity. By creating an inclusive working environment, these entities will be better equipped to understand and cater to the needs of women of colour on bikes. </span></p>\n<p><span>Creating a supportive and welcoming community is essential for fostering inclusivity in cycling. To achieve this, it’s important to establish safe spaces where women of colour can engage with other cyclists with similar experiences and challenges. Organising group rides specifically for WOC, or creating online communities and forums, can provide a platform for connection, sharing of information, and mutual support. Furthermore, organising workshops and training sessions targeted towards black women can help address any lack of knowledge or access to resources. </span></p>\n<p><span>We can empower women of colour to become confident and skilled cyclists by providing more education and mentorship opportunities. Empowerment is vital to making cycling more inclusive for women of colour. The feeling of empowerment will likely lead to joining the cycling community and actively participating in the activity. This empowerment can be achieved through various means, such as leadership opportunities, visibility, and recognition. Cycling clubs and organisations can offer leadership roles to women of colour within the cycling community, enabling them to contribute their unique perspectives and influence positive change. Additionally, creating platforms to showcase the achievements of WOC cyclists can be a source of inspiration for others. Recognising accomplishments through awards, magazine features, or social media shout-outs can boost confidence and encourage more WOC out there to take up cycling. </span></p>\n<p><span>By embracing inclusivity, building a supportive community, and empowering women of colour, we can dismantle the current barriers in cycling. We must work together to create an inclusive and welcoming environment where WOC feel valued, supported, and empowered. Only then can we truly unlock the full cycling potential for everyone. Let’s ride towards a more inclusive future, one pedal stroke at a time!</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/06_ISLA_ROWNTREE_OK_MontseGalbany.jpg?v=1709737542\" /></span></p>\n</div>\n</div>\n</div>\n<h3><strong>Create lifelong cyclists by facilitating cycling</strong></h3>\n<p><em>by Isla Rowntree </em></p>\n<p>Cycling is so embedded in my life that it’s one of the foundations of my identity. It’s what I do. Cycling is a thread where all aspects of my life are interwoven – professional, workplace, sporting, social, leisure, how I do my holidays... It is completely a part of me. While I appreciate that this is not for everyone, I am an evangelist about it, and it’s where my idea for Islabikes and children’s bikes came from. I realised at a point about 20 years ago that children’s bikes were so poor that they might actually put some kids off cycling. In creating particularly children’s bikes, I had the goal of making cycling a more accessible and enjoyable experience, and therefore leading to more people as adults continuing to do it and having it as part of their lives.</p>\n<p>It’s also important to recognise that as people age, they have different needs. Recognising those physical changes and encouraging the use of e-bikes can make a big difference to extending people’s cycling lives. I’ve been involved in those things at an industry level, but there are bits that the public don’t see me doing, such as taking people out and encouraging them. I see cycling as something that can fit into so many different people’s lives in so many different ways.</p>\n<p>I’m passionate about active travel and integrating cycling into normal life – it can make us happier and healthier, whatever shape or form it takes. Competitive sport has potential benefits, even if that’s not something I’ve been so publicly identified with. But the important bit is the active travel benefits. On the personal side, if you can cycle short journeys – to work, to do the shopping, to go to school – you just feel better and are physically healthier. You are also mentally healthier and you get to your school or workplace more able to do what you’ve gone there to do well, and to a higher standard. There are wider societal benefits as well – we can have fewer cars choking up our roads, we can reduce our NHS bill if all of us are physically and mentally healthier. And there are economic benefits that spin out of that. There is a social benefit from organised riding. I started in a traditional cycling club when I was 12 and I’ve watched generations of people in that club, going through their different life stages.</p>\n<p>I’ve seen how important that social aspect is to people as they age, and being able to continue to ride is very important for wellbeing. The electric bike has allowed people to get that benefit much closer to their end of life. Everything we can do to facilitate lifelong cycling has to be a good thing.</p>\n<div></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d7d930be85a7cdceeda71c8f5a70d7a8cc9003d60cd4d726f9e2af721fc0df22","category":"Cycling"}