{"title":"Android Auto starts flagging more powerful “parked” apps on the home screen","link":"https://arstechnica.com/?p=2007579","date":1709579750000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/chrome_KW37ohR4SP-1-800x450.png\" alt=\"Android Auto can have giant screens like this, but limited software means you'll often still need your phone.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/chrome_KW37ohR4SP-1.png\">Enlarge</a> <span>/</span> Android Auto can have giant screens like this, but limited software means you'll often still need your phone. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Android Auto and its big brother, the Android Automotive OS (AAOS), are getting a bit better at being a real computer. As spotted by <a href=\"https://www.smartdroid.de/android-auto-jetzt-in-neuer-version-11-4-gestartet/\">SmartDroid.de</a>, the home screen interface will now start labeling apps that only work in parked mode. They get a little \"P\" badge on top of the icon. Previously this would show an error message only after you opened it.</p>\n<p>Android Auto and Android Automotive OS are both Google's in-car interface and mostly share the same apps. Android Auto is powered by your phone, which plugs into the car and takes over the dashboard screen, replacing (for a time) the built-in infotainment system. The Android Automotive OS takes Google's \"infotainment replacement\" interface and builds it right into the car as the only infotainment system. With Android Automotive OS (AAOS) car companies can ship Android as the car OS, just as phone manufacturers ship Android as the phone OS. The OS is skinnable, so it often ends up looking different, but that was the idea it started with.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/2024-02-27-06-32-29.webp\"><img alt=\"Google's GameSnacks icon, with a &quot;P&quot; badge indicating it only works while parked. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/2024-02-27-06-32-29-300x201.webp\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/2024-02-27-06-32-29-640x428.webp 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/2024-02-27-06-32-29.webp\">Google's GameSnacks icon, with a \"P\" badge indicating it only works while parked. </a> (credit: <a href=\"https://www.smartdroid.de/android-auto-jetzt-in-neuer-version-11-4-gestartet/\">SmartDroid.de</a>)</p></div>\n<p>One of the more frustrating things about both flavors of Android Auto is that you have this big, powerful car screen in front of you that <em>could</em> be more useful than a phone but never is. Android Auto and its apps all assume you are blasting down the road at 60 mph while using them and rarely consider the possibility that you might be stopped at a red light or in park or that the touch screen is being used by a passenger. This means for most apps the safety lockouts are always on, so you're only allowed to view nine Google Maps results, and you can never see your entire music library, among other limitations.</p></div><p><a href=\"https://arstechnica.com/?p=2007579#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2007579&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d7debf295df886e1cd021ad9f0e66710b242a82ace2e4cf851779ba71eef06fa","category":"Tech"}