{"title":"Accurately predicting rare and poorly detectable species habitat for spatial protection","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14664?af=R","date":1716955260000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/826df401-3550-4095-b890-a90d2b323de6/jpe14664-toc-0001-m.png\" alt=\"Accurately predicting rare and poorly detectable species habitat for spatial protection\" />\n<p>Being able to accurately model species distribution is critical to reliable and transparent biodiversity and conservation assessments. By modelling accurate ‘core’ and ‘unsuitable’ habitats with models that minimise omission and commission rates respectively, conservation measures could be targeted in specific spatial areas that maximise the protection of rare and poorly detected species. This method therefore helps minimise impacts on stakeholders, while providing managers with increased confidence in the model predictions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nWith the loss of biodiversity worldwide, understanding species distribution is essential for species management, but modelling the distribution of rare and poorly detectable species can be challenging because of data gaps and observer biases. Over- or under-predictions are frequent, leading to uncertainty in spatial management measures, particularly for highly mobile and data-poor species.\n\nHere we developed a ‘Combined Model for Accurate Prediction’ to accurately predict the distribution of data-poor and rare species. This modelling framework aims to improve the accuracy of both predicted ‘core’ and ‘unsuitable’ habitats, to help support managers with spatial protection measures. We tested the combined modelling approach on 11 data-poor and rare diadromous fish during their at-sea life history phase and used the combined model to analyse the adequacy of existing marine protected areas (MPAs) for these fish.\n\nThe combined modelling approach modelled both ‘core’ and ‘unsuitable’ habitats with high accuracy. Of the seven diadromous species modelled, most MPAs designated to protect diadromous fish are outside their core habitats. Furthermore, when their core habitat was within an MPA, only 50% of this area was designated to protect them. These results highlight inadequate protection of the existing networks of MPAs for protected and threatened species.\n\n<i>Synthesis and applications</i>. Being able to accurately model species distribution is critical to reliable and transparent biodiversity and conservation assessments. By modelling accurate ‘core’ and ‘unsuitable’ habitats with models that minimise omission and commission rates respectively, conservation measures could be targeted in specific spatial areas that maximise the protection of rare and poorly detected species. This method therefore helps minimise impacts on stakeholders, while providing managers with increased confidence in the model predictions.\n</p>\n<h2>Résumé</h2>\n<p>\n\nAvec la perte de biodiversité mondiale, la compréhension de la distribution des espèces est essentielle pour leur gestion. Néanmoins modéliser la distribution des espèces rares et peu détectables peut s'avérer difficile en raison d'un manque de de données et des biais entre observateurs. Les sur-prédictions ou sous-prédictions sont fréquentes. Cela entraîne une incertitude dans les mesures de gestion spatiale, en particulier pour les espèces très mobiles et pour lesquelles les données sont insuffisantes.\n\nNous avons développé ici un ‘modèle combiné pour une prédiction précise’ afin de prédire avec précision la distribution des espèces rares et pauvres en données. Ce cadre de modélisation vise à améliorer la précision des prédictions à la fois sur les habitats ‘cœur’ et des habitats ‘inappropriés’, afin d'aider les gestionnaires à mettre en place des mesures de protection spatiale. Nous avons testé cette approche de modélisation combinée sur 11 poissons migrateurs amphihalins rares et pauvres en données pendant leur phase de vie en mer afin d'analyser la pertinence des aires marines protégées (AMP) existantes pour ces poissons.\n\nL'approche de modélisation combinée a permis de modéliser les habitats ‘cœur’ et ‘inappropriés’ avec une grande précision. Sur les sept espèces migratrices amphihalines modélisées, la plupart des AMP désignées pour protéger ces espèces se trouvent en dehors de leurs habitats ‘cœur’. En outre, lorsque ce dernier se trouvait dans une AMP, seuls 50% de cette zone étaient désignés pour les protéger. Ces résultats mettent en évidence la protection insuffisante des réseaux d'AMP existants pour les espèces protégées et menacées.\n\n<i>Synthèse et applications</i>. Il est essentiel de pouvoir modéliser avec précision la distribution des espèces pour obtenir des évaluations fiables et transparentes de la biodiversité et mieux guider les mesures de conservation. En modélisant les habitats ‘cœur’ et ‘inappropriés’ avec des modèles qui minimisent à la fois les faux positifs et négatifs, les mesures de conservation pourraient être ciblées dans des zones spatiales spécifiques qui maximisent la protection des espèces rares et mal détectées. Cette méthode permet donc de minimiser l'impact sur les activités socio-économiques, tout en donnant aux gestionnaires une plus grande confiance dans les prédictions du modèle.\n</p>","author":"Sophie A. M. Elliott, \nGaspard Dubost, \nEtienne Rivot, \nAnthony Acou, \nVincent Toison, \nElodie Réveillac, \nLaurent Beaulaton","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"d7e84e08d6b7f06931200f3fcf9e014ad022777f59a5452695eb3526dec77445","category":"Environment"}