{"title":"A machine learning approach in a monocentric cohort for predicting primary refractory disease in Diffuse Large B-cell lymphoma patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311261","date":1727791200000,"content":"<p>by Marie Y. Detrait, Stéphanie Warnon, Raphaël Lagasse, Laurent Dumont, Stéphanie De Prophétis, Amandine Hansenne, Juliette Raedemaeker, Valérie Robin, Géraldine Verstraete, Aline Gillain, Nicolas Depasse, Pierre Jacmin, Delphine Pranger</p>\r\nIntroduction <p>Primary refractory disease affects 30–40% of patients diagnosed with DLBCL and is a significant challenge in disease management due to its poor prognosis. Predicting refractory status could greatly inform treatment strategies, enabling early intervention. Various options are now available based on patient and disease characteristics. Supervised machine-learning techniques, which can predict outcomes in a medical context, appear highly suitable for this purpose.</p> Design <p>Retrospective monocentric cohort study.</p> Patient population <p>Adult patients with a first diagnosis of DLBCL admitted to the hematology unit from 2017 to 2022.</p> Aim <p>We evaluated in our Center five supervised machine-learning (ML) models as a tool for the prediction of primary refractory DLBCL.</p> Main results <p>One hundred and thirty patients with Diffuse Large B-cell lymphoma (DLBCL) were included in this study between January 2017 and December 2022. The variables used for analysis included demographic characteristics, clinical condition, disease characteristics, first-line therapy and PET-CT scan realization after 2 cycles of treatment. We compared five supervised ML models: support vector machine (SVM), Random Forest Classifier (RFC), Logistic Regression (LR), Naïve Bayes (NB) Categorical classifier and eXtreme Gradient Boost (XGboost), to predict primary refractory disease. The performance of these models was evaluated using the area under the receiver operating characteristic curve (ROC-AUC), accuracy, false positive rate, sensitivity, and F1-score to identify the best model. After a median follow-up of 19.5 months, the overall survival rate was 60% in the cohort. The Overall Survival at 3 years was 58.5% (95%CI, 51–68.5) and the 3-years Progression Free Survival was 63% (95%CI, 54–71) using Kaplan-Meier method. Of the 124 patients who received a first line treatment, primary refractory disease occurred in 42 patients (33.8%) and 2 patients (1.6%) experienced relapse within 6 months. The univariate analysis on refractory disease status shows age (p = 0.009), Ann Arbor stage (p = 0.013), CMV infection (p = 0.012), comorbidity (p = 0.019), IPI score (p&lt;0.001), first line of treatment (p&lt;0.001), EBV infection (p = 0.008) and socio-economics status (p = 0.02) as influencing factors. The NB Categorical classifier emerged as the top-performing model, boasting a ROC-AUC of 0.81 (95% CI, 0.64–0.96), an accuracy of 83%, a F1-score of 0.82, and a low false positive rate at 10% on the validation set. The eXtreme Gradient Boost (XGboost) model and the Random Forest Classifier (RFC) followed with a ROC-AUC of 0.74 (95%CI, 0.52–0.93) and 0.67 (95%CI, 0.46–0.88) respectively, an accuracy of 78% and 72% respectively, a F1-score of 0.75 and 0.67 respectively, and a false positive rate of 10% for both. The other two models performed worse with ROC-AUC of 0.65 (95%CI, 0.40–0.87) and 0.45 (95%CI, 0.29–0.64) for SVM and LR respectively, an accuracy of 67% and 50% respectively, a f1-score of 0.64 and 0.43 respectively, and a false positive rate of 28% and 37% respectively.</p> Conclusion <p>Machine learning algorithms, particularly the NB Categorical classifier, have the potential to improve the prediction of primary refractory disease in DLBCL patients, thereby providing a novel decision-making tool for managing this condition. To validate these results on a broader scale, multicenter studies are needed to confirm the results in larger cohorts.</p>","author":"Marie Y. Detrait","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d7e8cbc8852760482a8ebfcdd60c2939d088f4b0cc2e622b6ad8fe07b37d5c47","category":"Interdisciplinary"}