{"title":"Perceptions of mental health, suicide and working conditions in the construction industry—A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307433","date":1721829600000,"content":"<p>by Kristina Aurelius, Mia Söderberg, Viktoria Wahlström, Margda Waern, Anthony D. LaMontagne, Maria Åberg</p>\r\nObjective <p>The aim of the study was to explore perceptions of mental ill health, suicidal behaviour and working conditions among male construction workers, in order to gain an in-depth understanding of these phenomenon and to identify relevant avenues for workplace interventions.</p> Method <p>Data were collected in individual and group interviews, and 43 individuals from the Swedish construction industry, workers, union representative and managers, participated in the study. Inductive thematic analysis was used to analyse the data.</p> Results <p>Five main themes were found: Difficult to talk about mental health, Demanding working environment affects mental health, Substance abuse among construction workers, Importance of management, and Need for routines and social support in the workplace. Many participants reported that there was a stigma related to mental health. Suicides that had occurred among colleagues were perceived to come out of the blue. The working environment in the construction industry was perceived to have a negative effect on mental health, and it was reported that the management played an important role in both the cause and prevention of mental health problems.</p> Conclusions <p>The results from this Swedish study are in accordance with previous international research regarding a macho culture, stigma of mental health and a demanding working environment in the construction industry. The study adds to existing knowledge by highlighting that suicides were perceived to be very unexpected, that poor physical health affected mental health and that many participants did not know how to deal with mental health issues in the workplace.</p>","author":"Kristina Aurelius","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d7efb41edb483b4005f4da6bb9db92d2b42674bbaf62d01f143c1c0dc791b97d","category":"Interdisciplinary"}