{"title":"Amniotic Fluid and Maternal Serum Laeverin Levels and Their Correlations with Fetal Size and Placental Volume in the Second Trimester of Pregnancy&mdash;A Prospective Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202407.1793/v1","date":1721782321000,"content":"Introduction: Laeverin is an extravillous trophoblast marker playing a significant role in the trophoblast migration. The purpose of this study was to evaluate the association between the amniotic and serum laeverin concentrations at 16-22 weeks of gestation and the fetal and placental ultrasound measurements in healthy, unaffected pregnancies. Materials and methods: This was a prospective cross-sectional study. Pregnant women with singleton pregnancies undergoing amniocentesis were recruited consecutively. Fetal structural malformations and/or aneuploidy were exclusion criteria. Fetal biometric parameters and placental growth/perfusion were measured in 44 high-risk pregnancies who had no pregnancy complication and any other chronic disease. Maternal serum and amniotic levels of laeverin were essayed with sandwich enzyme-linked immunosorbent assay. Results: Serum laeverin levels are decreasing slightly with the maternal age in mid-gestation. Serum laeverin level correlated negatively slightly with head size of the fetus with the gestational length at delivery (β=-0.38, 95% confidence interval (CI) -0.03-0.01), while the amniotic laeverin level correlated strongly with the abdominal circumference of the fetus (β=-0.64, 95% CI: -0.03-0.01). Furthermore, laeverin level in the amnion correlated moderately and positively with the placental volume (β=0.46, 95% CI: 0.01-0.08). Conclusions: Laeverin levels detected in the serum and in the amniotic fluid denotes the fetoplacental growth in uncomplicated high-risk pregnancies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d7efb7cbf3e3ca617dadf334eca3438847ca56b990be857ec2f67d5f2df1e00c","category":"Interdisciplinary"}