{"title":"Apple's App Store, Safari, and iOS Officially Designated 'Gatekeepers' in EU","link":"https://www.macrumors.com/2023/09/06/app-store-safari-and-ios-designated-gatekeepers/","date":1694003288000,"content":"Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, Safari browser, and iOS operating system have today formally been designated as \"gatekeepers\" in the European Union, an official classification that requires adherence to strict new regulations (via <a href=\"https://www.bloomberg.com/news/articles/2023-09-06/eu-challenges-apple-microsoft-in-new-antitrust-push-to-rein-in-big-tech\"><em>Bloomberg</em></a>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/01/European-Commisssion.jpg\" alt width=\"1080\" height=\"719\" />\r<br />\nThe EU's Digital Markets Act (DMA) seeks to curtail the power of major tech companies. Designated \"gatekeeper\" platforms will now face prohibition against favoring their own services over those of rivals. These platforms will also be prevented from combining personal data across different services and will have to allow users the option to download apps from alternative platforms. In a statement, Apple told <em>Bloomberg</em> \"We remain very concerned about the privacy and data security risks the DMA poses for our users.\"\r<br />\n\r<br />\nWhile Apple's ‌App Store‌, Safari, and iOS have been officially classified as gatekeepers, iMessage currently remains exempt from the list. Apple has recently stated that the user base of its iMessage service in Europe <a href=\"https://www.macrumors.com/2023/09/05/imessage-isnt-popular-enough-for-regulation/\">may not be large enough</a> to warrant its inclusion under the DMA's regulations. The European Commission is in the process of investigating the validity of this claim, alongside Microsoft's Bing and Edge.\r<br />\n\r<br />\nAlongside Apple, the European Commission has also listed services from other technology firms including Alphabet's Google Search, Amazon's marketplace, and Bytedance's TikTok, bringing the total to 22 services that now fall under DMA's provisions.\r<br />\n\r<br />\nTo be classified as a \"gatekeeper\" under the DMA, a company must fulfill certain criteria, including having sales across the EU of at least €7.5 billion, or a market capitalization of €75 billion or above. The designation also requires platforms or services to have more than 45 million monthly active users and over 10,000 active business users annually within the EU.\r<br />\n\r<br />\nCompanies that do not adhere to the new regulations risk facing EU investigations, substantial fines, and the imposition of \"behavioral or structural remedies.\" The fines can amount to 10 percent of a company's global turnover, with a 20 percent penalty for repeat violations.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/safari/\">Safari</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/06/app-store-safari-and-ios-designated-gatekeepers/\">Apple's App Store, Safari, and iOS Officially Designated 'Gatekeepers' in EU</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-app-store-safari-and-ios-officially-designated-gatekeepers-in-eu.2400592/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d7f0b8cd7b51398d2253f8aced2a7ec13d82144ee5edc60bb7c82566c76499d3","category":"Apple"}