{"title":"Report: iPhone 14 Pro Models to Feature Tough Titanium Alloy Chassis","link":"https://www.macrumors.com/2021/07/26/iphone-14-2022-pro-models-titanium-case/","date":1627287124000,"content":"Next year's \"<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> 14\" series is expected to feature high-end models with a new titanium alloy chassis design, claims a new investors report by JP Morgan Chase. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/iphone-12-pro-gold.jpg\" />\r\n<br />\r\nAccording to the report, the use of titanium alloy will be one of the biggest changes to the case design in the 2022 ‌iPhone‌ series, and Foxconn will be the exclusive manufacturer of the titanium frames for the high-end models.\r\n<br />\r\n\r\n<br />\r\nIf the report is accurate, the use of titanium in an ‌iPhone‌ would be a first for Apple. The company currently uses the material for some <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a> models, and the physical <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> is made of titanium, but the latest iPhones are made of aluminum and stainless steel.\r\n<br />\r\n\r\n<br />\r\nCompared to stainless steel, titanium has a relatively high hardness that makes it more resistant to scratches, and its stiffness makes it durable enough to withstand bending. It's as strong as steel but 45% lighter, and twice as strong as aluminum while being only 60% heavier. It's also more resistant to corrosion compared to many other alloys. \r\n<br />\r\n\r\n<br />\r\nThe material does have some drawbacks, though. Oil from fingerprints can be readily seen on bare titanium and titanium alloy surfaces, leaving unattractive marks on consumer devices. The hardness of titanium also makes it difficult to etch, which can make it less attractive.\r\n<br />\r\n\r\n<br />\r\nHowever, Apple has been researching how it can overcome both of these issues. Recent patent filings reveal that Apple is looking at the use of <a href=\"https://www.macrumors.com/2021/02/23/titanium-anti-fingerprint-coatings-research/\">thin oxide coatings for metal surfaces</a> which can significantly reduce the appearance of fingerprints on devices. The company has also <a href=\"https://www.macrumors.com/2021/01/26/apple-researching-titanium-macbook-casings/\">outlined</a> a blasting, etching, and chemical process that can give titanium enclosures a high-gloss surface finish for a more attractive appearance.\r\n<br />\r\n\r\n<br />\r\nMeanwhile, JP Morgan Chase's report also corroborates rumors that next year's ‌iPhone‌ will feature greater specification changes than the upcoming <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a>, suggesting that Apple is earmarking 2022 as an ‌iPhone‌ \"supercycle,\" or a year in which dramatically more people than usual upgrade to the latest models.\r\n<br />\r\n\r\n<br />\r\nThe report corroborates other rumors that Apple does not plan to introduce a 5.4-inch ‌iPhone‌ 14 mini, with the mini line ending after the ‌iPhone 13‌. <a href=\"https://www.macrumors.com/2021/04/14/kuo-no-new-iphone-mini-in-2022/\">According to analyst Ming-Chi Kuo</a>, Apple will instead offer two 6.1-inch iPhones and two 6.7-inch iPhones, so both the standard ‌iPhone‌ 14 and the ‌iPhone‌ 14 Pro will be available in those two size options.\r\n<br />\r\n\r\n<br />\r\nThe report also mentions the market rumor that <a href=\"https://www.macrumors.com/2020/12/09/iphone-13-may-revive-touch-id/\">Touch ID could return to the iPhone</a> in some form, if not this year then next, either <a href=\"https://www.macrumors.com/2020/01/29/kuo-2021-iphone-touch-id-power-button-lcd/\">implemented in the side button</a> or in the form of an <a href=\"https://www.macrumors.com/2021/06/23/kuo-2022-iphones-under-screen-touch-id/\">in-display fingerprint sensor</a>.\r\n<br />\r\n\r\n<br />\r\nOther rumors suggest at least some 2022 iPhones will no longer have a notch, with Apple instead adopting a <a href=\"https://www.macrumors.com/2021/03/01/kuo-some-2022-iphones-punch-hole-display/\">punch-hole design</a> that's previously been used for some Android devices. For all the details on the rumors floating around for the ‌iPhone‌ 14, check out the <a href=\"https://www.macrumors.com/roundup/iphone-13/#beyond_2021\">last section of our iPhone 13 guide</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/2022-iphones/\">2022 iPhones</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/26/iphone-14-2022-pro-models-titanium-case/\">Report: iPhone 14 Pro Models to Feature Tough Titanium Alloy Chassis</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-iphone-14-pro-models-to-feature-tough-titanium-alloy-chassis.2305497/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mba5Rs_F5rA:cZ6FzCfb5b4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mba5Rs_F5rA:cZ6FzCfb5b4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/mba5Rs_F5rA\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d7f0b1bfc9b3ff8d5157872f09d47c4027624b321b08bb77aff30802a37eb88a","category":"Apple"}