{"title":"The death of Google Glass is a Reality check for Apple","link":"https://www.macworld.com/article/1655151/google-glasss-discontinued-reality-one-headset.html","date":1679148900000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Welcome to our Apple Breakfast column, which includes all of the Apple news you missed last week in a handy bite-sized roundup. We call it Apple Breakfast because we think it goes great with a morning cup of coffee or tea, but it’s cool if you want to give it a read during lunch or dinner hours too.</p>\n\n\n\n<h2>Glass half full</h2>\n\n\n\n<p>Google Glass is a failure. That isn’t exactly news, but it is now official: The company this week finally <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.google.com/glass-enterprise/customer/answer/13417888&amp;xcust=1-1-1655151-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">discontinued</a> the business version of the product, which itself replaced the deeply unpopular consumer devices whose wearers were subjected to mockery and occasional physical violence, and coined the term “Glass-hole.” An inglorious tale has come to an end, and not a moment too soon.</p>\n\n\n\n<p>Then again, the timing is notable and a little surprising because it comes mere months before Apple is expected to make its own entry into the world of face-mounted computing with a mixed-reality headset. (Skeptics may point out that we’ve been waiting for the headset for years and insist that they will believe it when they see it, but the chorus of leaks and rumors is becoming deafening.) This suggests that one of these two tech giants has completely misread the market: Google thinks it’s the right time to get out of augmented reality–or its own vague approximation of it, as I’ll explain in a bit–and Apple thinks it’s the right time to get in. They can’t both be right.</p>\n\n\n\n<p>Google’s negative experiences in this field can be salutary for Apple, for which this will be a hugely significant launch with the potential to usher in a wide-ranging ecosystem that one day rivals the success of the iPhone, or to tarnish Tim Cook’s legacy forever. Apple needs to look at the things Google got wrong, and the obstacles it was unable to overcome, and find a different path… or simply hope that the market has changed enough that the same methods will now be more successful. That’s where the importance of timing comes in.</p>\n\n\n\n<p>The single biggest problem facing both companies, Google then and Apple now, is how different a face-mounted device is from the tech products we spend most of our time using. The introduction of tablets and smartwatches essentially reproduced the experience of the smartphone on a larger or smaller screen and didn’t require a paradigm shift in the user’s relationship with the device. It was still a smallish glowing rectangle concealed somewhere about your person which you took out and looked at when it required attention. But a pair of smart glasses or particularly a mixed-reality headset demands a relationship with technology, and with the world around you, that is unprecedented in most users’ lives.</p>\n\n\n\n<p>Google Glass was an “in your face” object in more ways than one and managed to make its users look like hipster showoffs, mad futurists, and Orwellian informants at the same time. And this was a comparatively discreet product that at least somewhat mimicked the appearance of a regular pair of spectacles. How much more annoying will passers-by find a mixed-reality device that covers your eyes and much of your head? How long will it be before a Reality One user gets openly mocked?</p>\n\n\n\n<p>The hope, here, is that the world has moved on and that Google Glass was considered especially provoking because it was ostentatiously new. Apple can benefit in this regard from Google’s unselfish work getting the world used to smart glasses, which no longer seem quite as space-age as they did in 2013. Furthermore, when a product’s user base hits a critical mass it no longer seems odd. Apple will be hoping to normalize its headset through a combination of weight of sales and marketing know-how. Plenty of people thought “iPad” was a hilariously bad brand name until all of their friends suddenly owned one.</p>\n\n\n\n<p>The key here, and the way to avoid Google’s mistakes, will be both to deliver the benefits of AR and to make the public know what those benefits are. Because, as my colleague Jason Cross points out, Google Glass wasn’t really an AR product at all. Rather it was a fancy heads-up display with no ability to interact with real-world objects. And so its users were accepting the public shame of wearing an AR device without seeing such a product’s benefits. It was all pain–literally, in some cases—and no gain. It’s perhaps no coincidence that Microsoft’s HoloLens, which really is an AR device, is still going strong, or at least still going.</p>\n\n\n\n<p>Apple won’t, I suspect, be happy with a niche role in the corporate sector like that carved out by HoloLens, or in medical or educational settings, but that still leaves us without a clear understanding of what Reality One’s killer consumer app will be. Bearing in mind that it will also offer virtual reality features, one possibility is home gaming, but there remains the suspicion that Apple doesn’t really understand the gaming market, and that VR gamers will have far better and likely cheaper options elsewhere. It could also give Apple its way into the metaverse, as nauseating as that word is to even type.</p>\n\n\n\n<p>But the most promising point is this: Thanks to its many talented app developers, Apple doesn’t necessarily have to decide what the product is for. It just has to put the hardware out there and see where the community takes it. Maybe it will be used primarliy for gaming, maybe social or educational, or maybe users will abandon the outside world entirely and take refuge in an imagined universe free of poverty and hate. If you build it–and build it properly–they will come.</p>\n\n\n\n<p>It’s probably worth making sure the name of the product doesn’t lend itself to an obvious insult, however.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3811721/apple_breakfast_logo.jpg?quality=50&amp;strip=all\" alt=\"Apple Breakfast logo\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Reviews (and previews) corner</h2>\n\n\n\n<p>Our <a href=\"https://www.macworld.com/article/1656045/iphone-14-plus-review-2.html\">review of the iPhone 14 Plus</a> (in yellow) finds a great phone at a <strong>not-so-great price</strong>.</p>\n\n\n\n<p>Apple’s <strong>first 3nm chip</strong> is shaping up to be a big step up from the A16. Find out more in our <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-performance-ram-neural-engine.html\">A17 preview</a>.</p>\n\n\n\n<h2>Trending: Top stories</h2>\n\n\n\n<p>We round up <a href=\"https://www.macworld.com/article/1641957/iphone-15-pro-upgrades-solid-state-buttons-usb-c-periscope-camera.html\">four iPhone 15 upgrades</a> that will make you <strong>want one right now</strong>.</p>\n\n\n\n<p>Yes, Apple will <strong>‘fake’ zoomed photos</strong> on the iPhone 15 too–but <a href=\"https://www.macworld.com/article/1662062/iphone-15-periscope-zoom-galaxy-s23-fake-moon.html\">how far will it go?</a></p>\n\n\n\n<p>There’s a new <strong>reality distortion field</strong> because Tim Cook is doomed, <a href=\"https://www.macworld.com/article/1656366/tim-cook-legacy.html\">reckons the Macalope</a>.</p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1658491/mac-ipad-pro-future.html\">key to the Mac’s survival</a> isn’t a new Air–it’s the <strong>next iPad Pro</strong>.</p>\n\n\n\n<p><strong>Microsoft Word for Mac</strong> is about to get <a href=\"https://www.macworld.com/article/1655082/microsoft-word-mac-zoom-paste-plain-text-shortcut.html\">two huge shortcuts</a> we’ve wanted for years.</p>\n\n\n\n<p>A <a href=\"https://www.macworld.com/article/1661382/apple-antitrust-regulations-political-wrangling.html\">political shift</a> may give Apple a reprieve in the <strong>U.S. antitrust push</strong>.</p>\n\n\n\n<p>Apple <strong>trims hiring and bonuses</strong> as revenue dips, but <a href=\"https://www.macworld.com/article/1659568/apple-hiring-bonuses-layoffs-falling-revenues.html\">steers clear of layoffs</a>.</p>\n\n\n\n<h2>The rumor mill</h2>\n\n\n\n<p>Tim Cook overruled the <strong>AR/VR headset</strong> design team’s objections to a 2023 launch, according to <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">a new report</a>.</p>\n\n\n\n<p>Apple is <a href=\"https://www.macworld.com/article/1661939/siri-bobcat-tvos-beta-language-generation-chatgpt.html\">believed</a> to be testing a next-gen <strong>‘Bobcat’ language generation</strong> for Siri.</p>\n\n\n\n<p>The <strong>iPhone 15 Pro</strong> might start at more than $1,000, in the Pro line’s <a href=\"https://www.macworld.com/article/1660095/iphone-15-pro-price-hike-features.html\">first ever price hike</a>.</p>\n\n\n\n<p>The iPhone 15 Ultra, meanwhile, will reportedly <a href=\"https://www.macworld.com/article/1662854/famed-android-leaker-iphone-15-ultra-will-break-the-record-for-thinnest-bezels.html\">‘break the record’</a> for <strong>thinnest bezels</strong>.</p>\n\n\n\n<p>Apple is working on <a href=\"https://www.macworld.com/article/1656002/airpods-update-health-features-hearing-aid-fda.html\">turning AirPods into a ‘health tool’</a> to <strong>boost hearing</strong>.</p>\n\n\n\n<h2>Podcast of the week</h2>\n\n\n\n<p>The third and possibly final season of <strong>Ted Lasso</strong> is here so we thought this would be a good time to check in with our thoughts on Apple TV+. Is Apple doing enough to keep up with the competition? That’s on this episode of the Macworld Podcast!</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>You can catch every episode of the Macworld Podcast on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://open.spotify.com/show/3uyZkE4tjbwNNrJCLsBUAM&amp;xcust=1-1-1655151-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Spotify</a>, <a href=\"https://soundcloud.com/macworld\" target=\"_blank\">Soundcloud</a>, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/us/podcast/id563933198&amp;xcust=1-1-1655151-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Podcasts app</a>, or <a href=\"https://www.macworld.com/opinion/podcast\">our own site</a>.</p>\n\n\n\n<h2>Software updates, bugs &amp; problems</h2>\n\n\n\n<p>iOS 16.4 beta 4 <a href=\"https://www.macworld.com/article/1481562/ios-16-4-beta-features-release-date.html\">has arrived</a>, bringing <strong>new emoji</strong> and several enhancements.</p>\n\n\n\n<p>Plus: <strong>macOS Ventura 13.3 beta 4</strong> is <a href=\"https://www.macworld.com/article/1515239/macos-ventura-13-3-beta-features-emoji-home-install.html\">now available</a> too.</p>\n\n\n\n<p>And with that, we’re done for this week. If you’d like to get regular roundups, sign up for <a href=\"https://www.macworld.com/newsletters/signup\">our newsletters</a>. You can also follow us <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macworld&amp;xcust=1-1-1655151-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Twitter</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.facebook.com/Macworld/&amp;xcust=1-1-1655151-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Facebook</a> for discussion of breaking Apple news stories. See you next Saturday, enjoy the rest of your weekend, and stay Appley.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d8121c6a6ea0970037d6c9e6a0bc90b4c5f71879516b52dec7e459f3eca4a64c","category":"Apple"}