{"title":"Unraveling the Threads Controlling Pakistan&rsquo;s Gendered Nation-Building Ideology","link":"https://www.preprints.org/manuscript/202407.0436/v1","date":1720092989000,"content":"Historically, the military and non-religious, sub-continent’s intellectual elite Muslim men crafted state ideologies before partition, by actively contributing to sociocultural constructs prevalent to this day, in service of colonial patriarchal concepts. The purpose of this ideological collaboration has been to mould a Pakistani cis-gendered female child primarily into the ideal “Pakistan-Muslim” bride for marriage, carried out through her family and society. This has shaped the lives of cis-gendered female children in Pakistan through coerced, gendered control, implemented as prescriptive societal norms. These norms are rooted in colonial, patriarchal ideologies and are functions of capital and coercion intentionally perpetuated to erase her pluralistic identity, reducing her to a central resource within a family unit. To the military concept of nationalism, her mind and her body symbolize the unification and centralization of a statist ideology.   Thus, the military state plays an essential role in shaping her purpose around the concept of nationalism. The intellectual elite, via the state, uphold colonial, patriarchal ideologies, where the primary identity of a cis-gendered female child is actualized through her marriage.  The cis-gendered female child’s life is a vehicle to unify the state’s two-fold “Pakistani-Muslim” agenda, by implementing a ‘singular statist narrative’. A narrative that attempts to resolve two major tensions: First, it seeks to wipe out the possibility of a nation connecting with and exploring its own immense, internal ethnocultural diversity. It does this by imposing an imagined “homogenous Muslim” identity — which doesn’t exist — and is instead imported from multiple countries to reinforce a ‘singular statist narrative’, Second, it aims to control the mixing of local, sociocultural narratives by bridging any disjuncture between them by labelling colonial institutional patriarchy concepts as inherently “Pakistani”; in service of its preferred ‘singular statist narrative’.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d81881f10b59349f98eb44b4991a4ad2f39d64b905a0a884d38ce4d130d18039","category":"Interdisciplinary"}