{"title":"Apple Reportedly Planning to Switch Technology Behind A17 Bionic Chip to Cut Costs Next Year","link":"https://www.macrumors.com/2023/06/23/apple-to-switch-tech-behind-a17-to-cut-costs/","date":1687530432000,"content":"The A17 Bionic chip initially used in the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> and ‌iPhone 15 Pro‌ Max later this year will fundamentally differ from a version of the same chip set to be manufactured in 2024, a new rumor claims.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/A17-Feature-Dark.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nThe A17 Bionic is expected to be Apple's first chip manufactured with a <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> fabrication process, resulting in major performance and efficiency improvements over the 5nm technique used for the A14, A15, and A16 chips. The initial version of the A17 Bionic chip will reportedly be manufactured <a href=\"https://www.macrumors.com/2023/05/15/apple-tsmc-3nm-production-capacity/\">using TSMC's N3B process</a>, but Apple is planning to switch the A17 over to N3E sometime next year. The move is said to be a cost-cutting measure that could come at the expense of reduced efficiency.\r<br />\n\r<br />\nN3B is TSMC's original ‌3nm‌ node created in partnership with Apple. N3E, on the other hand, is the simpler, more accessible node that most other TSMC clients will use. N3E has fewer EUV layers and lower transistor density than N3B, resulting in efficiency tradeoffs, but the process can provide better performance. N3B has also been ready for mass production for some time longer than N3E, but it has much lower yield.\r<br />\n\r<br />\nN3B was effectively designed as a trial node and is not compatible with TSMC's successor processes including N3P, N3X, and N3S, meaning that Apple will need to redesign its future chips to take advantage of TSMC's advancements. Apple was originally believed to be planning to use the N3B for the A16 Bionic chip, but had to revert to N4 because it was not ready in time. It may be the case that Apple is using the N3B CPU and GPU core design originally designed for the A16 Bionic for the initial A17 chips, before switching to the original A17 designs with N3E later in 2024. This architecture will presumably be iterated on through TSMC's successor nodes for chips like the \"A18\" and \"A19.\"\r<br />\n\r<br />\nIt seems highly unlikely that Apple would make such a drastic change to the A17 Bionic during the product cycle of the ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max, so the N3E version of the chip may instead be destined for next year's standard <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> and ‌iPhone 16‌ Plus models. The A15 Bionic chip in the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> and ‌iPhone 14‌ Plus is a higher binned variant with one additional GPU core than the A15 used in the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> and ‌iPhone 13‌ mini, so some cross-generational differences despite outwardly featuring the same chip would not be unheard of.\r<br />\n\r<br />\nThe rumor comes from a <a href=\"https://weibo.com/u/1833340431\">Weibo user</a> who claims to be an integrated circuit expert with 25 years of experience working on Intel's Pentium processors. Earlier this year, they were first to claim that the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and ‌iPhone 15 Pro‌'s USB-C port and accompanying charging cables <a href=\"https://www.macrumors.com/2023/02/10/apple-planning-to-limit-iphone-15-usb-c-port/\">will feature a Lightning-like authenticator chip</a>, potentially limiting their functionality with Apple-unapproved accessories — a rumor that went on to be <a href=\"https://www.macrumors.com/2023/02/28/iphone-15-usb-c-accessories-limited-without-mfi/\">corroborated</a> by more established sources. They were also first to say that the standard ‌iPhone 14‌ models would retain the A15 Bionic chip, with the A16 being exclusive to the <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a> models.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a>, <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/tsmc/\">TSMC</a>, <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/23/apple-to-switch-tech-behind-a17-to-cut-costs/\">Apple Reportedly Planning to Switch Technology Behind A17 Bionic Chip to Cut Costs Next Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reportedly-planning-to-switch-technology-behind-a17-bionic-chip-to-cut-costs-next-year.2393938/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d81bca369e2a08a2a90475ea7207351ed465fe0cbb40f3c6f12b36da86645563","category":"Apple"}