{"title":"Apple's Notes App Now Lets You Create Links Between Notes","link":"https://www.macrumors.com/2023/06/06/apple-notes-create-links-between-notes/","date":1686049636000,"content":"Apple's stock Notes app got hardly any screen time during yesterday's WWDC keynote, but one powerful addition to the app in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> is a new ability to link notes and connect related notes together.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/linking-notes-ios-17.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nWith just a few taps, you can create links between notes, making it easy to jump from one idea to another. Long press on a space in any note, and a new \"Add Link\" option can be found in the pop-up menu. Tapping it lets you link to another note by searching its title or entering a URL. \r<br />\n\r<br />\nYou can create an optional alternative title for the link, or just stick with the original title for clarity. Once you're done, the link appears as hyperlink-style underlined text in your note, and tapping it snaps you straight into the note you linked to.\r<br />\n\r<br />\nThe Notes app also offers an additional, quicker way to add links: Typing two greater-than symbols (&gt;&gt;) into a note invokes a list containing your six most recently modified notes, and tapping one instantly adds a link to that note.\r<br />\n\r<br />\nThe same feature can be found in iPadOS 17 and macOS Sonoma, and it means you can now create wiki-style collections of interlinked notes, allowing you to organize your thoughts or discover new connections and associations between ideas. \r<br />\n\r<br />\n‌iOS 17‌, iPadOS 17, and macOS Sonoma are available in developer beta versions now and will be officially released in the fall. <div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/apple-notes/\">Apple Notes</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/06/apple-notes-create-links-between-notes/\">Apple's Notes App Now Lets You Create Links Between Notes</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-notes-app-now-lets-you-create-links-between-notes.2391838/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d8233c877f2823ea7a13687117177349c3a2389643c8c268f6bc11b67687ed1c","category":"Apple"}