{"title":"Unveiling the molecular mechanisms of the type IX secretion system's response regulator: Structural and functional insights","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae316/7724518?rss=1","date":1722384000000,"content":"<span><div>Abstract</div>The type IX secretion system (T9SS) is a nanomachinery utilized by bacterial pathogens to facilitate infection. The system is regulated by a signaling cascade serving as its activation switch. A pivotal member in this cascade, the response regulator protein PorX, represents a promising drug target to prevent the secretion of virulence factors. Here, we provide a comprehensive characterization of PorX both <span>in vitro</span> and <span>in vivo</span>. First, our structural studies revealed PorX harbors a unique enzymatic effector domain, which, surprisingly, shares structural similarities with the alkaline phosphatase superfamily, involved in nucleotide and lipid signaling pathways. Importantly, such pathways have not been associated with the T9SS until now. Enzymatic characterization of PorX's effector domain revealed a zinc-dependent phosphodiesterase activity, with active site dimensions suitable to accommodate a large substrate. Unlike typical response regulators that dimerize via their receiver domain upon phosphorylation, we found that zinc can also induce conformational changes and promote PorX's dimerization via an unexpected interface. These findings suggest that PorX can serve as a cellular zinc sensor, broadening our understanding of its regulatory mechanisms. Despite the strict conservation of PorX in T9SS-utilizing bacteria, we demonstrate that PorX is essential for virulence factors secretion in <span>Porphyromonas gingivalis</span> and affects metabolic enzymes secretion in the nonpathogenic <span>Flavobacterium johnsoniae</span>, but not for the secretion of gliding adhesins. Overall, this study advances our structural and functional understanding of PorX, highlighting its potential as a druggable target for intervention strategies aimed at disrupting the T9SS and mitigating virulence in pathogenic species.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"d823597d29718d2f5e7e894ee8314d664d86259c44ca7e46ded118ef5fd6fab3","category":"Interdisciplinary"}