{"title":"Anomaly Detection Using Machine Learning in Hydrochemical Data From Hot Springs: Implications for Earthquake Prediction","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034748?af=R","date":1718711085000,"content":"<h2>Abstract</h2>\n<p>This study explores the potential of machine learning algorithms for earthquake prediction, utilizing fluid chemical anomaly data from hot springs. Six hot springs, located within an active fault zone along the southeastern coast of China, were carefully chosen as hydrochemical monitoring sites for an extended period of two and a half years. Using this data, a prediction model integrating six algorithms was developed to forecast <i>M</i> ≥ 5 earthquakes in Taiwan. The model's performance was validated against recorded earthquake events, and the factors influencing its predictive capability were analyzed. Our comprehensive analysis conclusively demonstrates the superiority of machine learning algorithms over traditional statistical methods for earthquake prediction. Additionally, including sampling time in the data sets significantly improves the model's predictive performance. However, it is important to note that the model's predictive performance varies across different hot spring and indicators type, highlighting the importance of identifying optimal indicators for specific scenarios. The model parameters, including the anomaly detection rate (P) and earthquake response time threshold (M), significantly impact the model's predictive capabilities. Therefore, adjustments are needed to optimize the model's performance for practical use. Despite limitations such as the inability to differentiate pre-earthquake anomalies from post-earthquake anomalies and pinpoint the precise location of earthquakes, this study successfully showcases the potential of machine learning algorithms in earthquake prediction, paving the way for further research and improved prediction methods.</p>","author":"Ruijie Zhu, \nFengtian Yang, \nXiaocheng Zhou, \nJiao Tian, \nYongxian Zhang, \nMiao He, \nJingchao Li, \nJinyuan Dong, \nYing Li","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"d82a3955999e3e5aa6a26e0292243a81b81f943e36fdd89e56711085e0a14427","category":"Environment"}