{"title":"PSXII-1 Comparative analysis of the training response of Raramuri Criollo and Angus Cattle to virtual fencing","link":"https://academic.oup.com/jas/article/102/Supplement_3/604/7757659?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Virtual fencing (VF) collars rely on GPS tracking and audio warning-electric cueing to exclude or contain livestock inside geofencing zones. Behavioral differences between breeds may occur that explain differences in adaptation to VF. Training response of nonlactating Raramuri Criollo (RC) and Angus-Herford (AH) cattle to a commercial VF system was compared at the Jornada Experimental Range (USDA-ARS) in Las Cruces, NM during November and December, 2023. Thirty RC and 30 AH cows naive to VF were instrumented with Nofence collars (Molde, Norway) and randomly allocated by breed to rectangular pens (n = 6) of similar size (0.16 ha). Cows were fed wheat hay ad libitum in feeding stations at the east and west ends. Unrestricted water, mineral supplements and shade were provided at the center of pens. Two VF exclusion areas of similar size (280 m<sup>2</sup>) were set in the east and west ends, establishing eventual VF restricted zones (RZ). The training was divided into six 3-d periods. In period 1, RZ were deactivated, allowing cows to adapt to feed, peers, operators and pens. In period 2, RZ were activated on the west end of each pen, with the east side serving as VF containment zone (CZ). In period 3, RZ were switched to the east side, with the west side serving as the CZ. Both RZ were deactivated in period 4 to serve as an extinction phase. The RZ configuration in periods 2 and 3 were repeated in periods 5 and 6, serving as testing phase. Audio warnings (AW), electric pulses (EP), and the ratio (RT) of EP to AW were analyzed with a repeated measures model to evaluate fixed effects of breed, period, day(period), and all interactions according to a completely randomized design with day(period) as repeated factor. Significant effects were tested using LSD (<span>P</span> &lt; 0.05). Both AW and EP were affected by the triple interaction, indicating greater AW and EP in d 1 of period 2 for AH than RC cows. Likewise, AW were greater for AH in period 2, and EP were greater for AH cows in periods 2 and 3 and for RC cows only in period 2. Among day(period), AW and EP were greater for both breeds in d 1 of period 2, and in d 1 of period 3 for AH. No interaction in RT was detected, but mean values were greater for AH than RC, in periods 2 and 3 than 5 and 6, and in d 1 than d 2 and both than d 3, as anticipated. The RT declined through time suggesting that both breeds learned to respond safely to changing VF configurations, but consistent behavioral differences may explain a different VF risk assessment and vigilance of RC cows compared with AH cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d82b67016578b96e3918b1a3ec0afaf7ba90ee9c375c1a9299b347f54e732fca","category":"Environment"}