{"title":"Advancing equitable access to digital mental health in the Asia-Pacific region in the context of the COVID-19 pandemic and beyond: A modified Delphi consensus study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002661","date":1718028000000,"content":"<p>by Jill K. Murphy, Shirley Saker, Promit Ananyo Chakraborty, Yuen Mei (Michelle) Chan, Erin E. Michalak, Matias Irrarazaval, Mellissa Withers, Chee H. Ng, Amna Khan, Andrew Greenshaw, John O’Neil, Vu Cong Nguyen, Harry Minas, Arun Ravindran, Angela Paric, Jun Chen, Xing Wang, Tae-Yeon Hwang, Nurashikin Ibrahim, Simon Hatcher, Vanessa Evans, Raymond W. Lam</p>\r\n\r\nThe COVID-19 pandemic had an unprecedented impact on global mental health and well-being, including across the Asia-Pacific. Efforts to mitigate virus spread led to far-reaching disruption in the delivery of health and social services. In response, there was a rapid shift to the use of digital mental health (DMH) approaches. Though these technologies helped to improve access to care for many, there was also substantial risk of access barriers leading to increased inequities in access to mental health care, particularly among at-risk and equity-deserving populations. The objective of this study was to conduct a needs assessment and identify priorities related to equitable DMH access among at-risk and equity-deserving populations in the Asia Pacific region during the first year of the COVID-19 pandemic. The study consisted of a modified Delphi consensus methodology including two rounds of online surveys and online consultations with stakeholders from across the region. Study participants included policy makers, clinicians and service providers, and people with lived experience of mental health conditions. Results demonstrate that vulnerabilities to negative mental health impacts and access barriers were compounded during the pandemic. Access barriers included a lack of linguistically and culturally appropriate DMH options, low mental health literacy and poor access to technological infrastructure and devices, low levels of awareness and trust of DMH options, and lack of policies and guidelines to support effective and equitable delivery of DMH. Recommendations to improve equitable access include ensuring that diverse people with lived experience are engaged in research, co-design and policy development, the development and implementation of evidence-based and equity-informed guidelines and frameworks, clear communication about DMH evidence and availability, and the integration of DMH into broader health systems. Study results can inform the development and implementation of equitable DMH as its use becomes more widespread across health systems.","author":"Jill K. Murphy","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d82d251b27d870b914932838fb8d2453ad1d29a398d33faa2d800e91e836ac70","category":"Environment"}