{"title":"Apple Music Testing Feature That Imports Libraries From Other Services","link":"https://www.macrumors.com/2024/02/20/apple-music-testing-playlist-import-feature/","date":1708419305000,"content":"<a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> is testing a new feature that allows users to import songs and playlists into their library from rival streaming services like Spotify. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/apple-music-songshift-transfer.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nReferences to the feature in the latest ‌Apple Music‌ beta for Android were first spotted by a <a href=\"https://www.reddit.com/r/AppleMusic/comments/1at8g93/apple_music_470beta_1359_for_android_apple/\">Reddit user</a>, and <em>MacRumors</em> has now independently confirmed that the references are indeed in the APK, or Android Package Kit.\r<br />\n\r<br />\nThe feature appears to be a collaborative effort with <a href=\"https://www.songshift.com\">SongShift</a>, a long-running third-party service that enables users to transfer their music libraries and playlists between different music streaming services. \r<br />\n\r<br />\nImages shared on Reddit show new prompts in ‌Apple Music‌ for Android that offer to \"add saved music and playlists you made in other music services to your ‌Apple Music‌ library.\" The option also appears in the Android app's settings.\r<br />\n\r<br />\nThe feature does not yet appear to be fully functional, and the screens are not showing for everyone running the beta, suggesting Apple is at an early stage of A/B testing, or split testing the feature. A/B testing is a method used to compare two versions of the same app, and users are randomly exposed to either version. Statistical analysis is then used to determine which variation performs better for a given conversion goal. \r<br />\n\r<br />\nThird-party music transfer services have been available for a few years, but many have limited functionality without a one-off payment or subscription. There's no guarantee that ‌Apple Music‌ will take the SongShift integration through to full development, but if it does retain the feature, there's a good chance it will eventually appear in the ‌Apple Music‌ app for Apple devices. <div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/20/apple-music-testing-playlist-import-feature/\">Apple Music Testing Feature That Imports Libraries From Other Services</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-testing-feature-that-imports-libraries-from-other-services.2419913/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d83aab3a6e59a3e81d4f2446625c2c4870aa6a5bec08223efc32f2970a8292b8","category":"Apple"}