{"title":"Data-driven nexus between malaria incidence and World Bank indicators in the Mekong River during 2000–2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003764","date":1727100000000,"content":"<p>by Phuong Hoang Ngoc Nguyen</p>\r\n\r\nThe increase in hydro dams in the Mekong River amidst the prevalence of multidrug-resistant malaria in Cambodia has raised concerns about global public health. Political conflicts during Covid-19 pandemic led cross-border movements of malaria cases from Myanmar and caused health care burden in Thailand. While previous publications used climatic indicators for predicting mosquito-borne diseases, this research used globally recognizable World Bank indicators to find the most impactful indicators related with malaria and shed light on the predictability of mosquito-borne diseases. The World Bank datasets of the World Development Indicators and Climate Change Knowledge Portal contain 1494 time series indicators. They were stepwise screened by Pearson and Distance correlation. The sets of five and four contain respectively 19 and 149 indicators highly correlated with malaria incidence which were found similarly among five and four GMS countries. Living areas, ages, career, income, technology accessibility, infrastructural facilities, unclean fuel use, tobacco smoking, and health care deficiency have affected malaria incidence. Tonle Sap Lake, the largest freshwater lake in Southeast Asia, could contribute to the larval habitat. Seven groups of indicator topics containing 92 indicators with not-null datapoints were analyzed by regression models, including Multiple Linear, Ridge, Lasso, and Elastic Net models to choose 7 crucial features for malaria prediction via Long Short Time Memory network. The indicator of people using at least basic sanitation services and people practicing open defecation were health factors had most impacts on regression models. Malaria incidence could be predicted by one indicator to reach the optimal mean absolute error which was lower than 10 malaria cases (per 1,000 population at risk) in the Long Short Time Memory model. However, public health crises caused by political problems should be analyzed by political indexes for more precise predictions.","author":"Phuong Hoang Ngoc Nguyen","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d8513f51e99b9e5f5a7789ab2c1c6d2954b5ec2ed1608ae43741cdcea83e5fb2","category":"Environment"}