{"title":"Associations between environmental factors and running performance: An observational study of the Berlin Marathon","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312097","date":1729087200000,"content":"<p>by Katja Weiss, David Valero, Elias Villiger, Volker Scheer, Mabliny Thuany, Felipe J. Aidar, Raphael Fabrício de Souza, Ivan Cuk, Pantelis T. Nikolaidis, Thomas Rosemann, Beat Knechtle</p>\r\n\r\nExtensive research has delved into the impact of environmental circumstances on the pacing and performance of professional marathon runners. However, the effects of environmental conditions on the pacing strategies employed by marathon participants in general remain relatively unexplored. This study aimed to examine the potential associations between various environmental factors, encompassing temperature, barometric pressure, humidity, precipitation, sunshine, cloud cover, wind speed, and dew point, and the pacing behavior of men and women. The retrospective analysis involved a comprehensive dataset comprising records from a total of 668,509 runners (520,521 men and 147,988 women) who participated in the ’Berlin Marathon’ events between the years 1999 and 2019. Through correlations, Ordinary Least Squares (OLS) regression, and machine learning (ML) methods, we investigated the relationships between adjusted average temperature values, barometric pressure, humidity, precipitation, sunshine, cloud cover, wind speed, and dew point, and their impact on race times and paces. This analysis was conducted across distinct performance groups, segmented by 30-minute intervals, for race durations between 2 hours and 30 minutes to 6 hours. The results revealed a noteworthy negative correlation between rising temperatures and declining humidity throughout the day and the running speed of marathon participants in the ’Berlin Marathon.’ This effect was more pronounced among men than women. The average pace for the full race showed positive correlations with temperature and minutes of sunshine for both men and women. However, it is important to note that the predictive capacity of our model, utilizing weather variables as predictors, was limited, accounting for only 10% of the variance in race pace. The susceptibility to temperature and humidity fluctuations exhibited a discernible increase as the marathon progressed. While weather conditions exerted discernible influences on running speeds and outcomes, they did not emerge as significant predictors of pacing.","author":"Katja Weiss","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d8574fd1e36d055de90bcdbbafee247b01917e30774b313d92a5465da28fa9ec","category":"Interdisciplinary"}