{"title":"Children of Tomorrow","link":"https://markpeak.net/children-of-tomorrow/","date":1634460174000,"content":"<p><em>ภาพประกอบ <a href=\"https://www.pexels.com/photo/brown-and-green-grass-field-during-sunset-1237119/\">Jonathan Petersson / Pexels</a></em></p>\n<p>เมื่อพูดถึงกระแสความเปลี่ยนแปลง คนจำนวนไม่น้อยมักนึกถึงเพลง Wind of Changes ของวง Scorpions</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Wind_of_Change_(Scorpions_song)\">บริบทของเพลงนี้</a>คือแต่งในปี 1991 ช่วงที่สหภาพโซเวียตกำลังล่มสลาย ในเนื้อเพลงเลยมีพูดถึงมอสควา (Moskva) หรือมอสโก และสวนสาธารณะ Gorky Park (ตั้งชื่อตามนักเขียน Maxim Gorky)</p>\n<p>ท่อนฮุกของเพลงนี้ พูดถึงสายลมแห่งการเปลี่ยนแปลง ในจุดที่ “เด็กๆ แห่งอนาคต” วาดฝันของพวกเขากัน</p>\n<blockquote><p>Take me to the magic of the moment<br />\nOn a glory night<br />\nWhere the children of tomorrow share their dreams</p></blockquote>\n<p></p>\n<p>ช่วงนี้ได้อ่านบทความหลายชิ้นที่พูดถึงเรื่องนี้ เลยอยากมาบันทึกไว้เป็นหลักเป็นแหล่งสักหน่อย</p>\n<p>ชิ้นแรกมาจาก อ.นิธิ อีกแล้ว พูดถึง “<a href=\"https://www.matichonweekly.com/column/article_471610\">ฐานความคิดของการเปลี่ยนแปลง</a>” โดยชี้ประเด็นว่า ถึงแม้การเกิดขึ้นของคนรุ่นใหม่มาดันคนรุ่นก่อนหน้านั้น มันเป็นสิ่งที่เกิดขึ้นแล้วมานับไม่ถ้วนในประวัติศาสตร์</p>\n<p>แต่การเปลี่ยนแปลงที่กำลังจะเกิดขึ้นนี้มันยิ่งใหญ่กว่าครั้งก่อนๆ มาก</p>\n<blockquote><p>ผมและอีกหลายคนกำลัง “รู้สึก” ว่า ความเปลี่ยนแปลงที่กำลังจะเกิดในเมืองไทยเวลานี้ จะไม่เหมือนครั้งก่อนๆ อย่างน้อยก็เพราะมันมีความเปลี่ยนแปลงทางสังคมที่กว้างใหญ่ไพศาลกว่าเดิมรองรับ อันเป็นความเปลี่ยนแปลงที่ได้สั่งสมเงื่อนไขมานานและกระทบต่อคนจำนวนมาก เช่น คนชั้นกลางขยายจำนวนเพิ่มขึ้นไปอีกหลายเท่าตัว แต่ไม่ใช่คนชั้นกลางที่อาจโผล่พ้นความอัตคัดขาดแคลนได้เต็มที่เหมือนเดิม หากเป็นคนชั้นกลางระดับล่างที่ไม่ได้มีวุฒิบัตรการศึกษาสูงนัก แต่เข้ามาผลิตและบริโภคในตลาดของคนชั้นกลางเต็มตัว ฯลฯ</p></blockquote>\n<p>นอกจากในแง่จำนวนและปริมาณแล้ว อ.นิธิ ยังพูดถึง “ฐานความคิด” ของการเปลี่ยนแปลงรอบนี้ด้วยว่า มันไม่ใช่แค่การขับไล่ผู้นำ แต่เป็นการจินตนาการถึงสังคมที่ดีอย่างเป็นรูปธรรมด้วย</p>\n<blockquote><p>ผมหมายความแต่เพียงความคิดทางการเมืองที่มากกว่าการขับไล่ผู้นำซึ่งตนไม่พอใจเท่านั้น หากมีจินตนาการถึงสังคมที่ดี หรือการเมืองที่ดี ว่าอาจเกิดขึ้นได้ด้วยการจัดองค์กรทางสังคมและการเมืองอย่างไร</p>\n<p>ที่สำคัญกว่านั้นก็คือ แม้ว่าส่วนใหญ่ของมวลชนอาจไม่มีจินตนาการเช่นนั้นชัดเจนนัก แต่จำนวนของคนที่มีจินตนาการดังกล่าวมีมากกว่าความเปลี่ยนแปลงทางการเมืองทุกครั้งที่เคยเกิดขึ้นในเมืองไทย บางคนอาจเป็นผู้นำการเคลื่อนไหว แต่อีกหลายคนเป็นแต่เพียงผู้สนับสนุน ทั้งในถนนและนอกถนน ส่งเสียงให้ได้ยินผ่านสื่อโซเชียลซึ่งทำให้ประชาชนมีเสียงดังอย่างไม่เคยมีมาก่อน</p>\n<p>ลองเปรียบเทียบกับความเปลี่ยนแปลงทางการเมืองในปี 2475 แม้ว่าส่วนใหญ่ของกลุ่มผู้นำอาจมีความคิดทางสังคมและการเมืองที่ชัดเจน แต่คณะราษฎรเองก็มีจำนวนของผู้เข้าร่วมน้อยมาก ในขณะที่ประชาชนส่วนใหญ่รู้สึกเพียงไม่พอใจต่อการบริหารงานของระบอบเก่าเท่านั้น</p></blockquote>\n<p>อ.นิธิ วิเคราะห์ปัจจัยว่าเกิดจากการเสพสื่อตะวันตกที่กว้างขวางขึ้นมาก (ผมเคยเขียนถึงเรื่องนี้ไปแล้วในตอน <a href=\"https://markpeak.net/on-demand-and-global-village/\">Global Village</a> แต่เน้นไปที่สื่อบันเทิงเป็นหลัก) ตัวอย่างสื่อที่ อ.นิธิ เอ่ยถึงคือ <a href=\"https://markpeak.net/common-sense/\">สามัญสำนึก (Common Sense) ของ Thomas Paine</a> ที่สำนักพิมพ์ Bookscape นำมาแปลจำหน่าย (คนที่สนใจเรื่องนี้ แนะนำให้อ่าน<a href=\"https://www.facebook.com/photo/?fbid=10158702651659001&amp;set=a.10150231255859001\">โพสต์เล่าเบื้องหลังการออกหนังสือ Common Sense โดย อ.ปกป้อง จันวิทย์</a> บรรณาธิการสำนักพิมพ์)</p>\n<p>การที่คนเข้าถึงความคิดจากโลกตะวันตกเหล่านี้ ทำให้คนไทยจินตนาการถึงเมืองไทยในอีกรูปแบบหนึ่งที่แตกต่างออกไปจากปัจจุบัน (<a href=\"https://markpeak.net/imagined-communities/\">Imagined Communities</a>)</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.nandialogue.com/exclusive-anon-nampa\">\n\t\t\t\t\t<img src=\"https://www.nandialogue.com/wp-content/uploads/2021/10/cover-7.jpg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.nandialogue.com/exclusive-anon-nampa\">\n\t\t\tExclusive ‘จอมยุทธ์’ อานนท์ นำภา เปิดน่านฟ้าบทสนทนาเสรี\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.nandialogue.com/exclusive-anon-nampa\">\n\t\t\t<p>nan dialogue ภูมิใจนำเสนอบทสัมภาษณ์พิเศษ ว่าด้วยมุมมองและความคิดของ อานนท์ นำภาเชื้อชวนให้สังคมไทยสำรวจตรวจสอบสิ่งที่เห็นและเป็นอยู่</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t\t\twww.nandialogue.com\t</div>\n</div>\n<p>อีกบทความคือ บทสัมภาษณ์ทนายอานนท์ นำภา โดยคุณวรพจน์ พันธุ์พงศ์ ที่สัมภาษณ์อานนท์ในเชิงลึกหลายประเด็น</p>\n<blockquote><p>คนรุ่นใหม่เป็นเจเนอเรชั่นที่ประหลาด เขาไม่รู้สึกกลัวเหมือนเราเคยกลัว ผมจะพูดเสมอว่าการที่ผมไปปราศรัย ผมต้องใช้ความกล้ามากที่จะพูดแต่ละครั้ง แต่กับคนรุ่นใหม่ เด็กมัธยมฯ เขาไม่ได้ใช้ความกล้า เขาใช้สามัญสำนึก คือไม่รู้สึกกลัวในสิ่งที่พูด เพราะคิดว่าไม่ใช่เรื่องผิด แต่ผมกลัว กังวล เราอยู่ในการหล่อหลอมที่ต้องกลัว ระมัดระวัง ต้องใช้คำพูดที่ไม่ผิดกฎหมาย</p>\n<p>ทำไมผมพูดแล้วคนจำนวนมากรับฟังได้ เพราะผมมีความกลัวไง ผมต้องบิดคำ พลิ้ว ดัด แต่น้องๆ ขึ้นเวที เขาไม่มีความกลัวแบบเรา มันไม่ใช่ความกล้าด้วยนะ เขาพูดซื่อๆ แบบปกติ มือไม้ไม่สั่น แต่เราสั่น นี่คือความต่างของผมกับน้อง</p></blockquote>\n<p>ประเด็นของอานนท์ชี้ให้เห็นว่า วิธีคิดของคนรุ่นใหม่แตกต่างไปจากเดิมมาก มีคนมาพูดให้ผมฟังหลายครั้งเหมือนกัน (ต่างกรรมต่างวาระ) ว่าคนรุ่นใหม่จะคิดว่าตัวเองเป็นประชากรของโลก และมีแนวคิดเรื่องประเทศต่างไปจากคนรุ่นก่อนๆ นี่คงเป็นหลักฐานอีกชิ้นที่บ่งบอกถึงทิศทางเดียวกันนี้</p>The post <a href=\"https://markpeak.net/children-of-tomorrow/\">Children of Tomorrow</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"d85c3e17008e420b8bd764631e6cc6f73b266d72b645faf410c39a5775aaeb0c","category":"Thai"}