{"title":"Seismic Nowcasting: A Holistic Artificial Neural Network Predictive Model","link":"https://www.preprints.org/manuscript/202405.0972/v2","date":1723793406000,"content":"A contemporary technique for calculating seismic risk is earthquake nowcasting (EN), which analyzes the progression of the earthquake (EQ) cycle in fault systems. 'Natural time' is a novel idea of time that serves as the foundation for EN assessment. The earthquake potential score (EPS), which has been discovered to have useful uses regionally and worldwide, is a unique tool EN uses to predict seismic risk. For the estimation of the EPS for the occurrences with the highest magnitude among these applications, we have since 2021 concentrated on Greece territory, applying sophisticated Artificial Intelligence (AI) algorithms, both wise (semi)supervised and unsupervised models, along with a customized dynamic sliding window technique that performs as a stochastic filter able to fine-tune the geo seismic occurrences. Long short-term memory (LSTM) neural networks, random forests, and clustering (geospatial) models are three machine learning techniques that are particularly good at finding patterns in vast databases and may be used to enhance earthquake prediction performance. In this study, we attempt to forecast whether practical Machine-learning and AI/Game-theoretic-based approaches can help predict big earthquakes and the normal future seismic cycle for 6-12 months. Specifically, we focus on answering two questions for a given region: (1) Is there a chance that a significant earthquake—say, one with a magnitude of M ≥ 6.0 will happen in the upcoming year? (2) What is the largest earthquake magnitude predicted in the upcoming year, and with which exact geographic coordinates (GCS)? Our results are quite promising and project a high precision accuracy score (≥ 98%) for seismic nowcasting in terms of four predictive parameters: the approximate (a) latitude, (b) longitude, (c) focal depth, and (d) magnitude of the phenomena.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d86496ef93a4e1bba7668227e05314e3a7cc817aa1e4d4a5c85b08e2d5fed80c","category":"Interdisciplinary"}