{"title":"Parental brain through time: The origin and development of the neural circuit of mammalian parenting","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15111?af=R","date":1713373495000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3da084dc-edb8-4ed8-8b0c-fcc12f035028/nyas15111-gra-0001-m.png\" alt=\"Parental brain through time: The origin and development of the neural circuit of mammalian parenting\" />\n<p>This review explores the potential origins and subsequent evolution of mammalian parental care. The fundamental neural circuitry underlying mammalian parental care likely traces its roots to hypothalamic preoptic neurons originally dedicated to territory and egg guarding in early vertebrates. Reproduction in challenging environments drove the selection for terrestrial reproduction in tetrapods and lactation and endothermy in amniotes. The established maternal care circuit could have served as the basis for the development of cooperative social behaviors in therian mammals.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This review consolidates current knowledge on mammalian parental care, focusing on its neural mechanisms, evolutionary origins, and derivatives. Neurobiological studies have identified specific neurons in the medial preoptic area as crucial for parental care. Unexpectedly, these neurons are characterized by the expression of molecules signaling satiety, such as calcitonin receptor and BRS3, and overlap with neurons involved in the reproductive behaviors of males but not females. A synthesis of comparative ecology and paleontology suggests an evolutionary scenario for mammalian parental care, possibly stemming from male-biased guarding of offspring in basal vertebrates. The terrestrial transition of tetrapods led to prolonged egg retention in females and the emergence of amniotes, skewing care toward females. The nocturnal adaptation of Mesozoic mammalian ancestors reinforced maternal care for lactation and thermal regulation via endothermy, potentially introducing metabolic gate control in parenting neurons. The established maternal care may have served as the precursor for paternal and cooperative care in mammals and also fostered the development of group living, which may have further contributed to the emergence of empathy and altruism. These evolution-informed working hypotheses require empirical validation, yet they offer promising avenues to investigate the neural underpinnings of mammalian social behaviors.</p>","author":"Kumi O. Kuroda, \nKansai Fukumitsu, \nTakuma Kurachi, \nNami Ohmura, \nYuko Shiraishi, \nChihiro Yoshihara","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"d86ad91ca42204e35f35d2fba9120354f97bc18c2e030e489d3b7f742df02f27","category":"Environment"}