{"title":"Current Treatment Methods in Pancreatic Cancer and the Need for Improvement","link":"https://www.preprints.org/manuscript/202410.1569/v1","date":1729504614000,"content":"Pancreatic cancer, one of the deadliest cancers worldwide, necessitates improved therapeutics due to its low survival rate (12% in 5 years) and typically late-stage diagnosis [1]. This malignancy tends to present asymptomatically until advanced stages, leading to high rates of metastasis and limiting surgical options [2]. Genetic mutations in key genes like KRAS, CDKN2A, TP53, and SMAD4 are central to pancreatic cancer pathogenesis, driving uncontrolled cell proliferation and making treatment difficult [3]. Current treatment modalities include surgery, chemotherapy, radiation, and emerging immunotherapies. Surgery, particularly the Whipple procedure, offers the only potential cure but is applicable in just 15-20% of cases due to the late diagnosis [4]. Chemotherapy, though commonly used, offers limited long-term survival benefits [5]. Radiation therapy has seen advancements with techniques like stereotactic body radiation therapy (SBRT), which shows promise in reducing toxicity and improving outcomes [6] . Immunotherapy, particularly mRNA vaccines, has demonstrated potential in prolonging recurrence-free survival (&gt;18 months), especially when combined with traditional therapies (13.4 months with surgical resection alone) [7] . Combinations of different treatments have been found to be effective. The challenge of early pancreatic cancer diagnosis mirrors the difficulty of disease management. Prophylactic immunotherapies, like vaccines, could offer a crucial breakthrough for prevention and recurrence reduction. As pancreatic cancer remains difficult to treat effectively, continued research and development in preventative and therapeutic strategies are essential to improving outcomes","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d86ccb3e6ee7e7abb45c8d985963758edb4f5a3242c1687ef9ebbf30f0994e8b","category":"Interdisciplinary"}