{"title":"Future Changes in Floods, Droughts, and Their Extents in the Alps: A Sensitivity Analysis With a Non‐Stationary Stochastic Streamflow Generator","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004238?af=R","date":1712746699000,"content":"<h2>Abstract</h2>\n<p>Spatially compounding droughts and floods challenge water management and may become more severe in a warming climate. However, the influence of climate change on widespread hydrologic extremes remains largely unknown because they are neither well represented in observations nor in models. Here, we present a non-stationary stochastic streamflow generator that captures streamflow dependencies between different catchments and represents seasonal covariations of streamflow with temperature. We run this model for 925 nearly natural catchments in the Alps to generate daily streamflow time series for a reference period and three warming levels of 1, 2, and 3°C. Then, we identify drought and flood events, determine their spatial extents, and assess changes in all of these characteristics. This sensitivity analysis for different warming levels suggests that changes in flood characteristics and spatial extent are substantially weaker than those in drought characteristics and spatial extent. While floods show changes in their timing toward earlier in the year, simulated changes in magnitude, volume, duration, and spatial extent are negligible. In contrast, droughts show changes not just in timing but also intensity, deficit, duration, and extent. Specifically, droughts are projected to intensify, last longer, and slightly increase in spatial extent, with the magnitude of change increasing with the warming level. These projected changes highlight the need to develop adaptation strategies in particular for droughts. Such adaptation strategies should go beyond local adaptation and consider that extreme events become more widespread in a warming world.</p>","author":"Manuela I. Brunner, \nEric Gilleland","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"d8710e72149f0e3a5cbf2958563a7baf9a01ce87bb004aeda826df90ad9fe879","category":"Environment"}