{"title":"ESPN, Fox, and Warner Bros. Announce Super-Sports Streaming Bundle","link":"https://espnpressroom.com/us/press-releases/2024/02/espn-fox-and-warner-bros-discovery-forming-joint-venture-to-launch-streaming-sports-service-in-the-u-s/","date":1707264264000,"content":"\n<p>ESPN:</p>\n\n<blockquote>\n  <p>ESPN, a subsidiary of The Walt Disney Company, FOX and Warner Bros. Discovery have reached an understanding on principal terms to form a new Joint Venture (JV) to build an innovative new platform to house a compelling streaming sports service. The platform brings together the companies’ portfolios of sports networks, certain direct-to-consumer (DTC) sports services and sports rights – including content from all the major professional sports leagues and college sports. The formation of the pay service is subject to the negotiation of definitive agreements amongst the parties. The offering, scheduled to launch in the fall of 2024, would be made available directly to consumers via a new app. Subscribers would also have the ability to bundle the product, including with Disney+, Hulu and/or Max. […]</p>\n\n<p>By subscribing to this focused, all-in-one premier sports service, fans would have access to the linear sports networks including ESPN, ESPN2, ESPNU, SECN, ACCN, ESPNEWS, ABC, FOX, FS1, FS2, BTN, TNT, TBS, truTV, as well as ESPN+.</p>\n</blockquote>\n\n<p>“Hulu, but this time we’re desperate.”</p>\n\n<p>I get the appeal. The idea is that they want to bring to streaming what cable TV was to the over-the-air era - “<em>If you pay for this one bundle, you can watch all sports.</em>” That’s what cable TV still is today. If there’s a big game in college or pro sports, I know I can watch it on some channel somewhere in my cable TV lineup. With cable TV, there’s never a question of whether I can watch a game. The only question is which channel.</p>\n\n<p>Missing from this new partnership, though: NBC Universal. You know, the network of channels owned by … America’s biggest cable TV company, <a href=\"https://www.vulture.com/2011/01/30_rock_kabletown_nbc.html\">Kabletown</a>. You can’t call it “all sports” without the Olympics or Sunday Night Football.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/02/06/super-sports-bundle\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d871c9050396edfabb2988da2dfe09ef6a25e9c3165369369a9a5ef45de3dddd","category":"Tech"}