{"title":"Schwalbe has recycled over 9 million bike tubes in Europe. Now it wants to do the same in the U.S.","link":"https://www.cyclingtips.com/2023/05/schwalbe-bike-tube-recycling-united-states/","date":1684352742000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/TubeRecycling-2.jpg?width=1200\" alt=\"Schwalbe has recycled over 9 million bike tubes in Europe. Now it wants to do the same in the U.S.\" /></figure><p>Bike tubes seem like something that should be recyclable, but in any at-home municipal recycling program that’s not the case. One tire manufacturer, however, has figured out a way to make recycling used tubes a reality.</p>\n<p>In 2015, <a href=\"http://cyclingtips.com/tag/schwalbe\">Schwalbe</a> began turning old tubes back into brand new ones. In those eight years, Schwalbe has made inroads into diverting materials from landfills and keeping them in circulation, recycling over 9 million tubes across five countries in Europe.</p>\n<p>Come June 1, it will bring that same program to the United States.<span> </span></p>\n<p>“Since 2015, Schwalbe has been leading the way in Europe in establishing the circular economy within the cycling industry because for us, taking responsibility is not an option, but a natural part of our business,” said Sean Cochran, marketing manager for Schwalbe North America.</p>\n<p><strong>Also read: <a href=\"https://www.cyclingtips.com/2023/05/e-bike-battery-recycling/\" target=\"_blank\">The ‘Hungry for Batteries’ campaign seeks to make e-bike battery recycling easier</a></strong></p>\n<p>The process starts with a network of bike shops that collect old tubes and ship them to Schwalbe. If you have old tubes lying around, regardless of tube brand, you can bring them to a participating Schwalbe dealer who will handle the rest.</p>\n<p>Those tubes are then bundled up by Schwalbe and sent to its manufacturing plant in Indonesia, where the brand’s production partner, Hung A, has developed a proprietary devulcanization process to recover butyl from tubes and recycle the materials.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Recycling_material.jpg?width=730\" alt width=\"1800\" height=\"1197\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Recycling_material.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Recycling_material.jpg?width=190 190w\" /><figcaption><span>Tubes shredded up for recycling.</span> (Photo: Courtesy Schwalbe)</figcaption></figure>\n<p>While on the surface shipping old tubes halfway across the world may sound like a less than environmentally friendly process, the German tire company says that, all things accounted for, recycling actually ends up saving over 80 percent of the energy input compared to creating tubes from virgin materials.<span> </span></p>\n<p>Additionally, recycling keeps old tubes out of landfills by creating a cradle-to-cradle loop where materials are kept in use <i>and</i> are of high enough quality to be used again for the same purpose (i.e. making more bike tubes from old bike tubes).<span> </span></p>\n<p>Keeping all of that material out of landfills is especially beneficial because by Schwalbe’s own estimate tubes take centuries to decompose in that setting. Expanding into the United States gives Schwalbe even more opportunity to divert bicycle tubes from landfills. The brand cites a statistic that 10 million inner tubes are discarded each year in the country alone.</p>\n<p>“Rather than seeing old tubes as trash, we see them in as a valuable resource to produce new, high-quality tubes.” Cochran said.</p>\n<p>The program accepts tubes from any brand and kicks off in June with select Schwalbe dealers. There are plans to expand to hundreds of dealers by the end of 2023.</p>\n<p>For now, recycling tubes is not a money-saving move for Schwalbe, but rather a commitment to the brand’s corporate social responsibility initiatives.<span> </span></p>\n<p>“We operate these programs at a net loss but do so because it is the right thing to do,” Cochran said.</p>\n<h2>Recycling versus down-cycling</h2>\n<p>Schwalbe’s tube recycling program is a true act of recycling, where materials are recovered and can be turned into the same items they were before. That’s especially important for consumable goods like bike tubes that wear over time and need to be replaced.<span> </span></p>\n<p>Unfortunately, more commonly “recycling” initiatives are actually down-cycling, the process of turning old or discarded materials into products of lesser value.<span> </span></p>\n<p>“In a world where natural resources are increasingly exploited and under pressure, it’s important to develop and support real recycling technologies, not a down-cycling scheme that is an extension of the linear economy,” Cochran said.</p>\n<p>Carbon fiber is one material in cycling where down-cycling has shown up.</p>\n<p>A recent trend in cycling products is toward thermoplastic composites, which can be remolded into new products. But the individual carbon fibers become shorter in the process of reusing them, meaning the material is structurally less strong and has become lower value.</p>\n<p>Instead of becoming another wheel or frame, that reformed carbon is pressed into something like a tire lever. It’s better than sending the material to a landfill at the end of its life, but is not the same as finding a way to infinitely reuse a material for the same purpose.<span> </span></p>\n<p>This isn’t to say Schwalbe has completely removed virgin materials from its tubes. The brand says that 20 percent of its tubes are made with recycled material, but the limiting factor is how much material the brand can collect for recycling.<span> </span></p>\n<p>Schwalbe says it is looking to expand that percentage with increased material from the U.S. and by expanding into more European countries this year.<span> </span></p>\n<p>The brand also introduced a tire recycling program in Germany last year which converts tires into reusable raw materials through a process called pyrolysis. As with tube recycling, Schwalbe claims 80 percent energy savings from this process over using virgin materials.<span> </span></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d87680e58e8ef96366f3a22a09769731d9531ae6e40176eda15801cc3f2d7336","category":"Cycling"}