{"title":"Development of a rapamycin-inducible protein-knockdown system in the unicellular red alga Cyanidioschyzon merolae","link":"https://academic.oup.com/plphys/article/196/1/77/7687701?rss=1","date":1717459200000,"content":"<span><div>Abstract</div>An inducible protein-knockdown system is highly effective for investigating the functions of proteins and mechanisms essential for the survival and growth of organisms. However, this technique is not available in photosynthetic eukaryotes. The unicellular red alga <span>Cyanidioschyzon merolae</span> possesses a very simple cellular and genomic architecture and is genetically tractable but lacks RNA interference machinery. In this study, we developed a protein-knockdown system in this alga. The constitutive system utilizes the destabilizing activity of the FK506-binding protein 12 (FKBP12)-rapamycin-binding (FRB) domain of human target of rapamycin kinase or its derivatives to knock down target proteins. In the inducible system, rapamycin treatment induces the heterodimerization of the human FRB domain fused to the target proteins with the human FKBP fused to S-phase kinase-associated protein 1 or Cullin 1, subunits of the SCF E3 ubiquitin ligase. This results in the rapid degradation of the target proteins through the ubiquitin-proteasome pathway. With this system, we successfully degraded endogenous essential proteins such as the chloroplast division protein dynamin-related protein 5B and E2 transcription factor, a regulator of the G1/S transition, within 2 to 3 h after rapamycin administration, enabling the assessment of resulting phenotypes. This rapamycin-inducible protein-knockdown system contributes to the functional analysis of genes whose disruption leads to lethality.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"d8774f1867fd46ccac66188f4fe719e4a0e7e1d2136972f058226679291273b7","category":"Environment"}