{"title":"Sex and organ specific proteomic responses to vitamin C deficiency in the brain, heart, liver, and spleen of <i>Gulo</i><sup>-/</sup><sup>-</sup> mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311857","date":1728568800000,"content":"<p>by Lucie Aumailley, Michel Lebel</p>\r\n\r\nRecent advances in mass spectrometry have indicated that the water-soluble antioxidant vitamin C differentially modulates the abundance of various proteins in the hepatic tissue of female and male mice. In this study, we performed LC-MS/MS to identify and quantify proteins that correlate with serum vitamin C concentrations in the whole brain, heart, liver, and spleen tissues in mice deficient for the enzyme L-Gulonolactone oxidase required for vitamin C synthesis in mammals. This work shows for the first time that various biological processes affected by a vitamin C deficiency are not only sex specific dependent but also tissue specific dependent even though many proteins have been identified and quantified in more than three organs. For example, the abundance of several complex III subunits of the mitochondrial electron transport chain correlated positively with the levels of serum vitamin C only in the liver and not in the other tissues examined in this study even though such proteins were identified in all the organs analyzed. Western blot analyses on the Uqcrc1 and Uqcrfs1 complex III subunits validated the mass spectrometry results. Interestingly, the ferritin subunits represented the few quantified protein complexes that correlated positively with serum vitamin C in all the organs examined. Concomitantly, serum ferritin light chain 1 was inversely correlated with vitamin C levels in the serum. Thus, our study provides an initial comprehensive atlas of proteins significantly correlating with vitamin C in four organs in mice that will be a useful resource to the scientific community.","author":"Lucie Aumailley","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d87f9c0ac9997a80e45f8e5bc01db8ebbc5a144a308227dbffecb82b1c152c66","category":"Interdisciplinary"}