{"title":"Playdate preview: You won’t believe how fun this dorky, $179 game system is","link":"https://arstechnica.com/?p=1780800","date":1626973258000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/IMG_1696-800x449.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/IMG_1696.jpg\">Enlarge</a> <span>/</span> On Thursday, July 29, you will be able to preorder the $179 Playdate game system. It is very, very yellow—and actually quite fun! (credit: Sam Machkovech)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Lately, I find myself reminiscing about the era when digital playthings looked like toys. You may rightfully question my nostalgia about Tamagotchis, <a href=\"https://arstechnica.com/gaming/2018/03/play-tamagotchi-mc-hammer-and-more-lcd-handheld-wonders-in-your-browser/\">handheld LCD games</a>, and the purple, handle-loaded GameCube, but my line of work revolves mostly around testing products with mature aspirations. Sometimes, I want companies to lighten up and put the \"fun\" in \"functionality.\"</p>\n<p>That bias contributes in some part to my interest in the <a href=\"http://play.date\">Playdate</a>, a <a href=\"https://arstechnica.com/gaming/2021/06/playdate-the-console-with-a-crank-gets-july-preorder-for-179-game-details/\">$179 portable gaming system that errs on the side of childish, low-powered fun</a>. I've spent three weeks testing the system's \"near-final\" hardware ahead of preorders opening up on 1 pm ET on Thursday, July 29, and I can confirm that it's indeed fun to look at. Luckily, it's also fun, simple, and accessible to hold, play with, and share with every friend that I can.</p>\n<p>Later this year, the Playdate will reclaim the ground once dominated by Nintendo's '90s \"Play It Loud\" Game Boys. This handheld looks like something you'd pull out of a <em><a href=\"https://www.youtube.com/watch?v=rDG0c3saE4I\">Yo Gabba Gabba</a></em> monster's pouch: squat, thin, banana-yellow, and ready to be tickled with a twist of its built-in rotary crank. But make no mistake—the Playdate's creators at the game-publishing firm Panic have taken this device's fun very seriously, and the results have surprised me (especially in one key aspect).</p></div><p><a href=\"https://arstechnica.com/?p=1780800#p3\">Read 58 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780800&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d885bb5fe8cc63c16035220f89b953ec25fa737f0136783642efefdba5d19dd6","category":"Tech"}