{"title":"Emergent plant presence and richness alter competitive interactions between two floating plants","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae013/7617333?rss=1","date":1709251200000,"content":"<span><div>Abstract</div>Interactions between two plant species can be influenced by the presence of other plant species and such an effect may change as the diversity of the other species increases. To test these hypotheses, we first constructed aquatic communities consisting of 1, 2 and 4 emergent plant species and then grew ramets of <span>Lemna minor</span> only, ramets of <span>Spirodela polyrhiza</span> only or ramets of both <span>L. minor</span> and <span>S. polyrhiza</span> within these aquatic communities. We also included controls with ramets of <span>L. minor</span>, <span>S. polyrhiza</span> or both but without any emergent plants. Biomass and number of ramets of <span>L. minor</span> and <span>S. polyrhiza</span> were significantly smaller with than without the emergent plants, but they did not differ among the three richness levels. The presence of <span>S. polyrhiza</span> did not significantly affect the growth of <span>L. minor</span>, and such an effect was not dependent on the richness of the emergent plant species. Without the emergent plant species, the presence of <span>L. minor</span> markedly reduced biomass (−92%) and number of ramets (−88%) of <span>S. polyrhiza</span>. However, such a competitive effect of <span>L. minor</span> on <span>S. polyrhiza</span> became much weaker in the presence of one emergent plant species (−46% biomass and −39% number of ramets) and completely disappeared in the presence of two or four emergent plant species. Therefore, both the presence and richness of emergent plant species can alter competitive interactions between the two duckweed species. These findings highlight the importance of species diversity in regulating plant–plant interactions.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"d886bef687c05b8e65653fda1c5c808543e0dce532f76c01c08e8fa668f2f37c","category":"Environment"}