{"title":"3D Automated Mineralogical Classification, Characterization and Quantification of Blended Portland Cements using X-ray Microscopy, Deep Learning, and AI","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.188/7719569?rss=1","date":1721779200000,"content":"<span>3D X-ray imaging is widely used to characterize a variety of materials. For cements, it provides an imaging and analyses advantage over other techniques because it allows imaging of the full sample rather than in 2D alone, it is non-destructive, and allows imaging at the multiscale for improvements in resolution with each successive scan. However, cement and concrete cores can be fundemantally challenging to image at high resolution because of a large core size and consequential limited X-ray penetration, a diverse grain/aggregate size, and the variable chemical composition and density (atomic number) of the material components. These challenges can make quantification of all of the key features difficult. This can lead to long scan times because many projections are required to be collected, and exposure times are long to limit noise in the resulting scan(s), consequently reducing sample throughput. Therefore, an improvement in the image acquisition and analyses workflow is needed to enhance data for more authentic segmentation and quantification. Here, we have applied a module within the ZEISS Advanced Reconstruction Toolbox (ART) called DeepRecon Pro to a series of blended Portland cement samples to improve the quality of the 3D data. Following this, we apply a quantitiative deep learning approach via ZEISS Mineralogic 3D to apply automated mineralogical/phase classification and characterization. These approaches greatly improve the quality of data and streamline the quantification process for cements.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"d888421442ab570b0c7f876d34b4b06b85d50f4430e7196149c491ad8518b641","category":"Environment"}