{"title":"Investigation of CFRP Concrete Reinforcement Ageing Using Microwave Infrared Thermography Method (MIRT)","link":"https://www.preprints.org/manuscript/202404.0998/v1","date":1713245768000,"content":"This study presents the utilization of the Microwave InfraRed Thermography (MIRT) technique to identify and analyze the defects in the carbon-fiber-reinforced polymer (CFRP) composite rein-forcement of concrete specimens. At first, a set of the numerical models was created, comprising of the broadband pyramidal horn antenna and the analyzed specimen. The utilization the system operating at a power of 1000W in a continuous mode, operating at frequency of 2.45 GHz was analyzed. The specimen under examination comprised a compact concrete slab that was covered with an adhesive layer, thereafter, topped with a layer of CFRP. An air gap represented a defect at the interface between the concrete and CFRP within the adhesive layer. In the modelling stage the study investigated three separate scenarios: a sample with no defects, a sample with a defect located at the center, and a sample with a numerous additional random defects located at the rim of the CFRP matte, to analyze the effect of the natural reinforcement degradation in this area. The next phase of the study involved conducting experiments to confirm the results obtained from nu-merical modeling. In the experiments the concrete sample aged for 10 years with the defect in the center and naturally developed defects at the CFRP rim was used. The study employed numerical modeling to explore the phenomenon of microwave heating in complex structures. The aim was to assess the chosen antenna design and identify the most effective experimental setup. These con-clusions were subsequently confirmed through experimentation. The observations made during the heating process were particularly remarkable, since they deviated from earlier studies that solely conducted measurements of the sample post-heating phase. The findings demonstrate that MIRT has the capacity to be employed as a technique for detecting flaws in concrete structures reinforced with CFRP.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d88b4804158e5ba935fde86f2dfedc5b309412be1c9dae0cc35c631af1f34eb5","category":"Interdisciplinary"}