{"title":"OneCycling: racing revolution or improbable pipe dream?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/onecycling-questions-answered-the-idea-the-key-players-the-problems-and-the-prospects","date":1707753205000,"content":"\n      <p><em><span>As bike riders around the world begin their racing season, discussion has erupted that cycling could be on the verge of a Saudi-backed LIV Golf-esque transformation, with a breakaway league among its proposals. Chris Marshall-Bell has closely been following developments and speaking with sources for several months.</span></em></p>\n<h3><b>The idea</b></h3>\n<p><span>OneCycling’s objectives are an updated rehash of three previous proposals – from 1997, 2007 and 2011 – to make cycling financially sustainable and less dependent on the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, which accounts for an estimated 80% of the commercial interest in the sport. All, however, have failed, mostly because ASO, the promoter of the Tour, was unwilling to relinquish any control of cycling’s prized asset.</span></p>\n<div></div>\n<div></div>\n<p><span>Nevertheless, talks began in 2021 on a new model to make cycling richer, stronger and more appealing to a global audience, with a streamlined racing calendar in which the best riders would compete more regularly against each other, races would finish on Sundays, and TV rights would be bundled into one package. It is said that the sport’s entire television deals, including ASO’s races, could be bought for around €25m. The idea is to aggregate all parties – teams, race organisers and the UCI – under one unified umbrella where profits are shared out. Presently, the only stakeholders making significant money from cycling are ASO and RCS, organisers of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>.</span></p>\n<p><span>Contrary to various media reports, it would not be a breakaway league per se, because the UCI is opposed to any closed system. The current working proposal for the league – mooted as being called the OneCycling Series – is that points would be scored from competing races. That means teams would still compete in non-competing races, such as the Tour de France, but points from the Tour would not be added to a league unless ASO signed up.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/cy23-tdf-js-17-0023.jpg?v=1707749759\" /><em><span>Image by James Startt</span></em></span></p>\n<p><span>Similarly, there would be no new races in Europe, but a desire to improve the offering and prestige of sometimes century-old races, and bring them into a more structured and comprehensible system that is easy to discern how teams and riders are performing. There is, however, a willingness to tap into existing and emerging markets around the world, with the possibility of creating new top-tier races outside of Europe. It is hoped that things can be tied up before the next WorldTour cycle begins in 2026.</span></p>\n<h3><b>Who’s involved</b></h3>\n<p><span>The talks were initiated, somewhat surprisingly, by the UCI’s president David Lappartient, who coined the phrase OneCycling. He immediately found acquaintances in Richard Plugge, the general manager of Visma-Lease a Bike; in Soudal–Quick-Step’s owner Zdenek Bakala (and his associate Bessel Kok); as well as from Ineos Grenadiers, EF Education-EasyPost and Lidl-Trek. In time, that number has swelled to include Bora-Hansgrohe (although it’s believed that they continue to have doubts) and Bahrain-Victorious. Several other teams, including UAE Team Emirates and Alpecin-Deceuninck, have not yet signed up as shareholders, but are being kept abreast of developments. Assuming OneCycling gets off the ground, teams and organisers would be able to become shareholders at a later date, but would receive less revenue from the project than founding members.</span></p>\n<p><span>Last summer, more than half the WorldTour teams sent a strongly-worded letter to Plugge and co. calling on them to pause the OneCycling project, after accusations that they had been deliberately excluding the presence of smaller teams at the negotiation table to try and force through the proposals. To add to their ire, no women’s teams were contacted until a few months ago.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1493983507.jpg?v=1707749841\" /><em><span>Image of Richard Plugge by Getty Images</span></em></span></p>\n<p><span>ASO, who also organise the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a>, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a> and the Critérium du Dauphiné, have yet to be convinced by the project, while RCS, organiser of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a> and the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour</a> as well as the Giro, have cooled their interest. At present, the only big race organiser pushing the plans is Flanders Classics, a company that has been expanding its portfolio and power in recent times. Indeed, its chief, former basketball player Tomas Van Den Spiegel, has replaced Plugge as OneCycling’s main figurehead in recent months, supported by Mia Norrman, the president of EF Pro Cycling. The two gave a much-cited talk at December’s WorldTour seminar.</span></p>\n<p><span>Although RCS has stepped away, the Italian company was an early supporter, and it is thought that it was one of the parties who helped to initially attract interest from Saudi Arabia, the Gulf state that has controversially – and to the backdrop of sportswashing accusations – been buying up sporting properties around the world to diversify their economy. The country’s Public Investment Fund (PIF) last year delegated their interest in OneCycling to SRJ Sports Investment, a subsidiary of PIF. It is understood that the Saudis have been disappointed by the regular media reports and frequent leaks to the press, but that they remain interested – for now. In contrast to what the UCI would like, the Saudis are pushing for a limited number of teams to take part, believed to be capped at 10. At present, their wish would be fulfilled.</span></p>\n<p><span>CVC Partners, an investment group, has also been in discussions, but it’s the consultancy firm, Ernst &amp; Young (EY), that has been leading the negotiations. EY has a long history in the sport, and has been hired by the UCI for various pieces of consultancy work down the years; they were also consultants for Velon, an organisation set up in 2014 to work on behalf of teams. To date, Velon has not been active in OneCycling talks, but there is a growing consensus that they must be involved and consulted.</span></p>\n<h3><b>The prospects</b></h3>\n<p><span>In November, shortly after </span><a href=\"https://www.reuters.com/sports/cycling/top-cycling-teams-explore-creating-new-competitive-league-sources-2023-10-25/\"><span>news emerged of the plans</span></a><span> and the</span><a href=\"https://podcasts.apple.com/mx/podcast/special-report-is-saudi-arabias-pif-behind-cyclings/id1686928353?i=1000632858150\"><span> involvement of the Saudis</span></a><span>, all the men’s WorldTour teams were asked to sign a non-disclosure agreement (NDA) relating to the project. A small majority, most hesitantly, signed, granting them access to the finer details.</span></p>\n<p><span>Talks were planned at January’s AlUla Tour in Saudi Arabia, and hopes were raised that ASO’s de facto leader, Yann Le Moenner, could be persuaded to join the project given that he was also in the Kingdom at the time. There were mixed reports as to whether anything of note emerged from meetings in Saudi Arabia. Just a few days later, though, 11 teams met with EY in London to discuss the project, and eight signed a letter of interest. A day after, they also held further discussions with SRJ in the British capital. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_-Giro_d_Italia_2023_-_Stage_16-09180.jpg?v=1707750116\" /></span><em><span>Image by SWPix.com</span></em></p>\n<p><span>News of meetings may seem like things are progressing, but there remain several hurdles, some perhaps insurmountable: ASO and RCS are not at the boardroom table, and without the three Grand Tours and four of the five Monuments signing up to the plans, it’s difficult to see how a comprehensive and notable league that would be appealing to both investors and new fans could be formed. Therefore, the two organisers, as has been the case for decades, remain the kingmakers.</span></p>\n<p><span>Secondly, the UCI’s commitment has been questioned, with some wondering whether its president, Lappartient, is playing politics to ensure that he’s kept abreast of any factions that might form. Most critically, the business model presented has been accused of lacking any plan on how a return on investment can be generated, the age-old problem with attracting significant wealth into cycling. It has also been suggested that part of any initial investment – and</span><a href=\"https://www.reuters.com/sports/cycling/saudis-srj-exclusive-talks-invest-about-250-mln-new-cycling-league-source-2024-02-02/\"><span> some reports indicate as much as €250m</span></a><span> – would come as a loan, and that would have to be paid back. It must be added that such a figure wouldn’t revolutionise the sport – €250m is the combined budget of around eight men’s WorldTour teams.</span></p>\n<p><span>Additionally</span><i><span>, Rouleur</span></i><span> has been told of dissatisfaction around the rights that shareholders would be subject to, including the requirement for any sponsorship deals to be reviewed and potentially renegotiated within the terms of the project. Further to that, current plans involve race organisers taking home a greater share of the revenue than teams would. One insider said: “I’ve not seen a more one-sided proposition than this. Teams would be required to sign away every single right they have.” Moreover, concern has been voiced by various people that the parties leading the project are trying to force through the plans to ensure that they receive their multi-million euro commissions.</span></p>\n<p><span>But as long as the plotters have the Saudis at the negotiating table, as well as an understanding that there is almost unanimous support among stakeholders for change, anything is possible. A meeting with the UCI is taking place on February 20, and there are other meetings planned at the end of the month. It is widely thought that a significant announcement could come within the next few weeks, and as one team source said: “There are still conversations ongoing that teams are not completely aligned with, but I think it’s happening.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d899cae3cf3e3d936fa30d7163569449b59ec00bee06711b6aed97b7e83f16e5","category":"Cycling"}