{"title":"3,5-dimethyl-2,4,6-trimethoxychalcone Lessens Obesity and Metabolic Dysfunction-Associated Fatty Liver Disease (MAFLD) in Leptin-Deficient ob/ob Mice","link":"https://www.preprints.org/manuscript/202407.1697/v1","date":1721635816000,"content":"Chalcones constitute an important group of natural compounds abundant in fruits and comestible plants. They are a subject of increasing interest because of their biological activities including antidiabetic and anti-obesity effects. The simple chalcone structural scaffold can be modified at multiple sites with different chemical moieties. Here we generated an artificial chalcone, i.e., 3,5-dimethyl-2,4,6-trimethoxychalcone (TriMetChalc), derived from 2′,4′-Dihydroxy-6′-methoxy-3′,5′-dimethylchalcone (DMC). DMC is the major compound of Cleistocalyx operculatus, a plant widely used in Asia for its anti-hyperglycemic activity. Using ob/ob mice as an obesity model, we ported that, after 3 weeks of per os administration, TriMetChalc modified food intake through the specific activation of brain structures dedicated to the regulation of energy balance. TriMetChalc also decreased weight gain, glucose intolerance and hepatic steatosis. Moreover, through extensive liver lipidomic analysis, we identified TriMetChalc-induced modifications that could contribute to improving the liver status of the animals. Hence, TriMetChalc is a chalcone derivative capable of reducing food intake and addition of glucose intolerance, and hepatic steatosis in a mouse model of obesity. In light of these results, we believe that TriMetChalc action deserves to be more deeply evaluated over longer treatment periods and/or in combination with other chalcones with protective effects on the liver.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d8a4f7d64bc4a72ec7937fafb8faf1d3fbc0d8cbb4ba09502613bedad3ab9a64","category":"Interdisciplinary"}