{"title":"Panel of serum biomarkers for differential diagnosis of idiopathic interstitial lung disease and interstitial lung disease-secondary to systemic autoimmune rheumatic disease","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311357","date":1727964000000,"content":"<p>by Miriana d’Alessandro, Paolo Cameli, Caroline V. Cotton, Janine A. Lamb, Laura Bergantini, Sara Gangi, Sarah Sugden, Lisa G. Spencer, Bruno Frediani, Robert P. New, Hector Chinoy, Elena Bargagli, Edoardo Conticini</p>\r\nBackground <p>Interstitial lung disease (ILD) may complicate the course of systemic autoimmune rheumatic disease (SARD) and diagnostic biomarkers are needed. Krebs von den Lungen-6 (KL-6), ferritin (FER) and interleukin 6 (IL-6) have been involved in the ILD development. Our study aimed to compare KL-6, FER, IL-6 and soluble mesothelin-related peptide (SMRP) concentrations in a cohort of idiopathic and SARD-ILD.</p> Methods <p>3169 patients were enrolled in the “UK Biomarkers in Interstitial Lung Disease (UK-BILD) Study”. We selected patients affected by SARD-ILD and idiopathic ILD (usual interstitial pneumonia-idiopathic pulmonary fibrosis and fibrotic non-specific interstitial pneumonia). Serum marker concentrations were measured through chemiluminescent assays (Fujirebio Europe, Ghent, Belgium).</p> Results <p>1013 patients were selected for the study: 520 (51.3%) had idiopathic ILD and 493 (48.7%) SARD-ILD. Idiopathic ILD patients displayed higher KL-6 values than SARD-ILD (p = 0.0002). FER and SMRP, though within normal ranges, were significantly higher in idiopathic ILD (p&lt;0.0001). Logistic regression showed good sensitivity (69.4%) and specificity (80.4%) selecting the variables FER and KL-6 concentrations, age and gender-male correlated with a diagnosis of idiopathic ILD.</p> Conclusion <p>Our study showed the excellent diagnostic value of KL-6 for detecting ILD, which irrespective of the final diagnosis and extent of disease, is always elevated and is a reliable biomarker of lung fibrosis in various diseases, ranging from idiopathic to autoimmune forms. Our study proposed an ILD differentiation model including clinical background. In this context, combination of serum markers and clinical data, as seen in our cohort, may lead to a further improvement in diagnostic accuracy for ILD.</p>","author":"Miriana d’Alessandro","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d8b1f3219040c7001c6610b5831de0e9fb4bcdb2e764368d4885baeb36f03aea","category":"Interdisciplinary"}