{"title":"A Convergence Science Approach to Understanding the Changing Arctic","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004157?af=R","date":1714114800000,"content":"<h2>Abstract</h2>\n<p>Science, engineering, and society increasingly require integrative thinking about emerging problems in complex systems, a notion referred to as convergence science. Due to the concurrent pressures of two main stressors—rapid climate change and industrialization, Arctic research demands such a paradigm of scientific inquiry. This perspective represents a synthesis of a vision for its application in Arctic system studies, developed by a group of disciplinary experts consisting of social and earth system scientists, ecologists, and engineers. Our objective is to demonstrate how convergence research questions can be developed via a holistic view of system interactions that are then parsed into material links and concrete inquiries of disciplinary and interdisciplinary nature. We illustrate the application of the convergence science paradigm to several forms of Arctic stressors using the Yamal Peninsula of the Russian Arctic as a representative natural laboratory with a biogeographic gradient from the forest-tundra ecotone to the high Arctic.</p>","author":"Valeriy Y. Ivanov, \nPeter S. Ungar, \nJohn P. Ziker, \nSvetlana Abdulmanova, \nGerardo Celis, \nAndrew Dixon, \nDorothee Ehrich, \nIvan Fufachev, \nOlivier Gilg, \nMary Heskel,  Desheng Liu, \nMarc Macias‐Fauria, \nValeriy Mazepa, \nKarl Mertens, \nPavel Orekhov, \nAlexandria Peterson, \nOlga Pokrovskaya, \nAleksey Sheshukov, \nAleksandr Sokolov, \nNatalia Sokolova, \nMarcus Spiegel, \nMatt Sponheimer, \nFlorian Stammler, \nTyeen Taylor, \nAlexandra Terekhina, \nVictor Valdayskikh, \nAlexander Volkovitskiy, \nJingfeng Wang, \nWenbo Zhou","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"d8b610a3471efb106de61d3700a2580a1dfe51effbfbe552aa26e050f1220c95","category":"Environment"}