{"title":"Spatial modelling and estimation of mammals' mortalities by Pantanal 2020 megafires","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14789?af=R","date":1727334000000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b859fa57-4977-417d-8efa-3421a259d8e1/jpe14789-toc-0001-m.png\" alt=\"Spatial modelling and estimation of mammals' mortalities by Pantanal 2020 megafires\" />\n<p>With the approach used, we were able to: (i) identify mortality hotspots associated with landscape features; (ii) simultaneously identify the most affected species and assess the average relationships for all the assemblage of medium- and large-sized mammals. We discuss conservation and management actions in two contexts: species prioritization for rescuing and monitoring; and territory prioritization for fire prevention and fighting.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nExtreme wildfire events, such as the Pantanal 2020 megafires, are expected to become more common. Assessing the impacts of such extreme events on wildlife is imperative for conservation planning. Direct observation of carcasses can provide valuable information on how these impacts relate to spatial heterogeneity.\n\nHere, we use double-observer carcass surveys to assess the numbers and spatial patterns of direct mortalities of medium- to large-sized mammals resulting from the Pantanal 2020 megafires in a large reserve (1080 km<sup>2</sup>) in the northern Pantanal wetland. Accounting for imperfect detection, we model the spatial variation in mortality occurrence and abundance, testing the effects of habitat-related variables and wildfire severity using multi-species N-mixture models.\n\nWe found that 26 out of 27 species of medium and large-sized mammals died from the fires with a mean estimate of around 49 thousand individuals. The most affected species included capuchin monkeys, agoutis, peccaries, tapirs, brocket deer, tamanduas, coatis and capybaras.\n\nDirect mortality of mammals by wildfires was affected by landscape factors related to species habitats, species traits (probably related to escape or refuge strategies), and the intensity of the wildfires. Mortalities presented a general positive relationship with non-flooded forests (a fire-sensitive habitat in Pantanal) and with the severity of wildfires. Artificial water bodies, a common landscape structure in Pantanal, had 7.5 times more deaths than other areas.\n\n<i>Synthesis and applications</i>: With the approach used, we were able to: (i) identify mortality hotspots associated with landscape features; (ii) simultaneously identify the most affected species and assess the average relationships for all the assemblage of medium- and large-sized mammals. We discuss conservation and management actions in two contexts: species prioritization for rescuing and monitoring; and territory prioritization for fire prevention and fighting.\n</p>\n<h2>Resumo</h2>\n<p>\n\nEventos de incêndios ambientais extremos, como os megaincêndios de 2020 no Pantanal, devem se tornar cada vez mais comuns. Avaliar os impactos desse tipo de evento extremo em animais silvestres é importante para o planejamento de conservação. A observação diretas de carcaças pode fornecer informações valiosas sobre como esses impactos se relacionam com a heterogeneidade espacial da paisagem.\n\nNós usamos amostragens de carcaças com protocolo de observadores duplos para estimar os números e avaliar os padrões espaciais da mortalidade direta de mamíferos de médio e grande porte resultantes dos megaincêndios de 2020 em uma reserva (1080 km<sup>2</sup>) no Pantanal Norte. Levando em conta a detecção imperfeita, modelamos a variação espacial na ocorrência e abundância das mortalidades, tesando os efeitos de variáveis relacionadas com o hábitat das espécies e com a severidade dos incêndios usando modelos de mistura de abundância multiespécie.\n\nEncontramos que 26 de 27 espécies de mamíferos de médio e grande porte morreram diretamente devido aos incêndios, com uma estimativa média de em torno de 49 mil indivíduos. As espécies mais afetadas incluem macacos-prego, cutias, catetos, queixadas, antas, veados mateiro e catingueiro, tamanduás-mirins, quatis e capivaras.\n\nA mortalidade direta de mamíferos pelo fogo foi influenciada por aspectos da paisagem relacionados ao hábitat das espécies, por características das espécies provavelmente relacionadas a estratégias de fuga ou refúgio e pela intensidade dos incêndios. As mortalidades apresentaram uma relação positiva geral com florestas não-alagáveis (um hábitat sensível ao fogo no Pantanal) e com a severidade dos incêndios. Tanques (pequenos lagos artificiais), uma estrutura comum na paisagem do Pantanal, apresentou 7,5 vezes mais mortes do que em outras áreas.\n\n<i>Síntese e aplicações</i>: Com a abordagem usada, fomos capazes de: (i) identificar áreas críticas de concentração de mortalidade associadas a aspectos da paisagem; e (ii) simultaneamente identificar as espécies mais afetadas e avaliar as relações médias para toda a assembleia de mamíferos de médio e grande porte. Nós discutimos ações de manejo e conservação em dois contextos: priorização de espécies para resgate e monitoramento; e priorização territorial para combate e prevenção de incêndios.\n</p>","author":"Ismael V. Brack, \nJosé L. P. Cordeiro, \nAndreas Kindel, \nBarbara Z. Rangel, \nDanielle Crawshaw, \nDener Heiermann, \nDouglas O. Berto, \nFernando L. Sicuro, \nGabriela S. de Oliveira, \nGuilherme Servi Gonçalves, \nIngridi C. Franceschi, \nIsabel S. Lermen, \nMarcione B. de Oliveira, \nPedro A. Thomas, \nRafaella A. A. de Oliveira, \nThais F. Conceição, \nLuiz F. B. de Oliveira","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"d8b7cc76eae91d8bd1b4d5bdcb2dd08722c4db968136359c80c6724fa1399602","category":"Environment"}