{"title":"Windows 11 for Mac in the Works, Says Parallels Desktop","link":"https://www.macrumors.com/2021/07/01/windows-11-on-mac-parallels-desktop/","date":1625144212000,"content":"The popular software for virtualizing Windows on macOS, Parallels Desktop, has confirmed that support for the newly announced Windows 11 is in the works for Mac computers.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/Windows-11-Parallels-Feature.jpg\" />\r\n<br />\r\nLast week, Microsoft unveiled Windows 11, the next major version of the Windows operating system. Obviously, Windows 11 won't be supported on Mac computers, but as is normal, some Mac users run virtualized desktops on their Mac with Windows.\r\n<br />\r\n\r\n<br />\r\nAs reported by <em><a href=\"https://www.imore.com/windows-11-mac-works-parallels-confirms\">iMore</a></em>, Parallels has confirmed that it is waiting to dig into Windows 11, once all of its features, such as Teams integration and Android apps, are released and part of the Windows 11 Preview build before they starting working on Mac compatibility. As per the report:\r\n<br />\r\n<blockquote>\"Since Windows 11 has just been announced recently, the Parallels Engineering team is waiting for the official Windows 11 Insider Preview build to start studying changes introduced in the new OS to deliver full compatibility in future Parallels Desktop updates,\" Nick Dobrovolskiy, SVP of Engineering and Support told iMore. Microsoft's first Insider preview build came out on Monday, but the rollout was a bumpy one and it doesn't include all of the new features that are coming to Windows 11 later this year such as Microsoft Teams integration or support for Android apps.</blockquote> No specifics were given, but Parallels did say that it \"will surely do everything that's possible to make it happen.\" On Intel-based Mac computers, users can natively run Windows using Boot Camp, as well as through virtualization. However, running Windows natively through Boot Camp is no longer possible on all Apple silicon Macs, leaving virtualization to be the only option.<div>Tag: <a href=\"https://www.macrumors.com/guide/parallels/\">Parallels</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/01/windows-11-on-mac-parallels-desktop/\">Windows 11 for Mac in the Works, Says Parallels Desktop</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/windows-11-for-mac-in-the-works-says-parallels-desktop.2302915/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mGU7kzAYBxY:TKbsno6Yke4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mGU7kzAYBxY:TKbsno6Yke4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/mGU7kzAYBxY\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d8bdbce7d9488ad05095b30864b6a6c04596051c87f42708d7d79e3a08c4cb6a","category":"Apple"}