{"title":"Does the combination jersey at the Tour de France have a place in modern cycling?","link":"https://www.cyclist.co.uk/in-depth/combination-jersey","date":1688483520000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/combination-jersey\">Does the combination jersey at the Tour de France have a place in modern cycling?</a></p>\n\n<p>Ever since the inception of the Tour de France’s iconic yellow jersey, the <em>maillot jaune</em>, in 1919, the race’s jerseys have become universal symbols for cycling known even by those that don’t follow the sport. Over <a href=\"https://www.cyclist.co.uk/in-depth/history-of-an-icon-100-years-of-the-tour-de-frances-yellow-jersey\" target=\"_blank\">those 104 years</a> the sport has grown, evolved, innovated, endured scandals, adapted and grown again.</p>\n\n\n\n<p>The 2023 <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> offers a now-typical spectacle: the battle for the general classification, for stages, for sponsorship airtime, for <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-prize-money\" target=\"_blank\">prize money</a>, for a chance to be a part of history, for jerseys. While the sprint jersey has been updated to <a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-strade-bianche\" target=\"_blank\">a new green</a> and the combativity number switched from red to gold, there will, as per usual, be four jerseys: yellow, green, white and polka dots. But there is one relic of days gone by that some think is due a return: the combination jersey.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/news/how-to-watch-and-live-stream-the-tour-de-france\">How to watch and live stream the Tour de France 2023</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/british-riders-tour-de-france\">Lads on (Grand) Tour: The 7 British riders at the 2023 Tour de France</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>What was the Tour de France combination jersey?</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032715/creative_commons_combination_jersey-728x970.jpeg\" alt=\"creative_commons_combination_jersey\" /><figcaption><em>Greg LeMond’s La Vie Claire combination jersey. This file is licensed under the Creative Commons Attribution-Share Alike 4.0 International <a href=\"https://creativecommons.org/licenses/by-sa/4.0/legalcode\" target=\"_blank\">license</a>.</em></figcaption></figure></div>\n\n\n<p>From 1968 to 1989 the combination classification featured at the Tour de France as one for the all-rounders. Points were awarded based on positioning in the main classifications. For example, first in the general classification would bring one point, while second would earn two points. The rider with the lowest total would be awarded the combination jersey.</p>\n\n\n\n<p>It began with a white jersey being awarded to the <em>combiné</em> leader from 1968 to 1975, however after 1975 that then represented the best young rider, and after some adjustments to criteria, it was settled on being awarded to the best-placed rider under 26 years of age, a rule which is still in place today. </p>\n\n\n\n<p>Following a five-year absence, the combination classification was reinstated in 1980, but the patchwork design – pictured above – only arrived in 1985. Incorporating all the jerseys, it featured pops of yellow and green on the chest and sleeves to represent the general and points classifications, with patches of white, red and then polka dots at the bottom for the mountains classification.</p>\n\n\n\n<p>Eagle-eyed fans may notice the red patch on the right shoulder doesn’t align with any of the Tour de France’s traditional jerseys. That’s because between 1966 and 1989 there was an intermediate sprints classification, which had its own red jersey from 1984. Unfortunately, that too would suffer the same fate as the combination jersey.</p>\n\n\n\n<p>Greg LeMond’s time in the jersey is arguably the most memorable, partly because his La Vie Claire team’s jersey had a Mondrian-inspired design that wasn’t dissimilar to the combination jersey, meaning he blended in enough with his teammates while still standing out in the bunch.</p>\n\n\n\n<h2>Why did the Tour de France get rid of the combination jersey?</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032717/pascal_pavaniafp_via_getty_images-647x970.jpg\" alt=\"pascal_pavaniafp_via_getty_images\" /><figcaption><em>Jean-François Bernard of Tobisha-La Vie Claire, in the combination jersey, on his way to winning the stage 24 ITT of the 1987 Tour de France. He won the stage by 1’44” over Stephen Roche. Pascal Pavani/AFP via Getty Images.</em></figcaption></figure></div>\n\n\n<p>Too many cooks spoil the broth apparently and Tour de France race director Jean-Marie Leblanc decided too many jerseys spoiled the Tour. To ‘modernise’ the race, Leblanc ditched both the combination and intermediate sprint classifications. He also withdrew support for the Tour de France Féminin – so much for modernising.</p>\n\n\n\n<p>Christopher Thompson, author of <em>The Tour de France: A Cultural History</em>, says, ‘Leblanc decided to cut back on the number of classifications because he thought it was encouraging riders to dope. The number of jerseys meant there were many ways for riders to earn money, and so there was pressure on them to be racing hard all the time.’</p>\n\n\n\n<h2>Does the combination jersey have a place in modern cycling?</h2>\n\n\n\n<figure><img width=\"970\" height=\"648\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-970x648.jpg\" alt=\"podium of cycling race with rider in green and rider in yellow with mannequins to the right with polka dot and white jerseys\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-970x648.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-768x513.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-1536x1026.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-2048x1368.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-750x501.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-1140x761.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/GettyImages-pogacar-2021-tour-de-france-jerseys-350x233.jpg 350w\" /><figcaption>Tadej Pogačar bagged three jerseys on his way to the 2021 Tour de France victory. Do we really want to add another mannequin to the podium?</figcaption><figcaption>Tim de Waele/Getty Images</figcaption></figure>\n\n\n\n<h3>Maybe not…</h3>\n\n\n\n<p>In recent years the King of the Mountains competition – along with its famous polka dot jersey – has been a dud, with yellow jerseys <a href=\"https://www.cyclist.co.uk/tags/tadej-pogacar\" target=\"_blank\">Tadej Pogačar</a> and Jonas Vingegaard accidentally winning as a side effect of their race for the overall title ahead of riders who give their all for that one jersey. It’s likely a new combination competition would have the same problem with much better opportunities to win points up mountains, gain time and then get sprint points when contesting the stage wins. </p>\n\n\n\n<p>Then there would be the issue of which jerseys take precedence. For example, on Stage 2 of the 2023 Tour de France, Simon Yates (Jayco-AlUla) wore the green jersey by default; he wasn’t first in the points classification, but leader Adam Yates (UAE Team Emirates) was in the more important yellow jersey, so Simon wore the jersey just to satisfy the sponsor’s requirement for it to be on display on every stage.</p>\n\n\n\n<p>Such issues aren’t limited to the earlier stages of the race either. In the 2021 Tour de France, Jonas Vingegaard wore the white jersey from Stage 9 until the very end on Stage 21, despite being second in the young rider classification behind Pogačar. That’s long enough that viewers might have struggled to remember who was actually leading the competition all that time.</p>\n\n\n\n<p>Would an additional jersey add another dimension to the race or would it be another accidental award for the yellow jersey, and just get worn by the second-place rider anyway?</p>\n\n\n\n<h3>Maybe…</h3>\n\n\n\n<p>The Tour de France regularly goes through periods of when a single rider or team dominates. Miguel Induráin won five Tours back to back, L*nce *rmstrong won seven and more recently Team Sky won every Tour bar one from 2012 to 2019. </p>\n\n\n\n<p>Cycling’s governing body the UCI cut team sizes in Grand Tours from nine to eight riders after the 2017 season to ease the dominance of stronger teams (and help rider/convoy safety). </p>\n\n\n\n<p>UAE Team Emirates’ Tadej Pogačar looked to be going in the same direction, winning back-to-back in 2020 and 2021, but Jonas Vingegaard broke the streak last year (and will be hoping to start his own era).</p>\n\n\n\n<p>To add some spice, perhaps we need something new that riders can fight for. Say, an aesthetically iconic jersey not seen in recent history and a competition that could be adjusted for modern cycling? One that may encourage riders that aren’t quite on the top level of the yellow jersey competition to spread their wings? One that breakaway riders could fight for to earn extra TV time for their sponsors? One that could suit the most versatile riders like Wout van Aert?</p>\n\n\n\n<h2>The verdict</h2>\n\n\n\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-970x646.jpg\" alt=\"cyclist in multicoloured jersey getting a push\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032742/pascal_pavani_staff_via_getty.jpg 1772w\" /><figcaption><em>Jean-François Bernard during stage 18 of the 1987 Tour de France.</em> </figcaption><figcaption>Pascal Pavani/AFP via Getty Images</figcaption></figure>\n\n\n\n<p>The combination classification shouldn’t be reinstated unless the categorisation is tweaked because it’s more than likely it would be another jersey for the general classification winner. </p>\n\n\n\n<p>It was won by the yellow jersey more than half the time it featured in the race, belonging to riders including Tour de France icons Eddy Merckx from 1969-1972 and again in 1974, Bernard Hinault in 1981 and 1982, Laurent Fignon in 1983 and 1984 and Greg Lemond in 1986.</p>\n\n\n\n<p>Given Pogačar is routinely compared to Merckx and that the former won the yellow, white <em>and</em> polka dot jerseys in 2020 and 2021, it’s hard not to see him triumphing in the return of the combined classification. However apart from Merckx, no rider did it more than twice, so maybe we’d still see a regular shake-up.</p>\n\n\n\n<p>The fact the patchwork combination jersey only lasted between 1985 and 1989 but is fondly remembered for splashing colour on the peloton does present a strong case for bringing it back. Perhaps the return of the jersey could bring some additional colour and joy to the Tour de France.</p>\n\n\n\n<h3>Maximum chaos?</h3>\n\n\n\n<p>Alternatively, we could leave the combination classification in the past but stop jerseys being worn by second placed riders and combine the jerseys if a rider is leading more than one.</p>\n\n\n\n<p>Remember this?</p>\n\n\n\n<figure><img width=\"970\" height=\"724\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-970x724.jpg\" alt=\"cyclist in half and half yellow and polka dot jersey\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-970x724.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-300x224.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-768x573.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-750x559.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril-1140x850.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/09/03032746/cyril.jpg 1181w\" /><figcaption><em>Cyril Dessel at the 2006 Tour de France.</em> </figcaption><figcaption>Alexandre Marchi via Getty Images</figcaption></figure>\n\n\n\n<p>On a serious note, lowering the age cut-off for the white jersey competition from 26 to 23 could make a big difference. That way there would be less chance of it being won by the yellow jersey, and more chance of an extra race within the race. Even when exceptional riders like Pogačar come through they’d only win it once or twice, not four times in a row. And while we’re at, how about we revert back to red combativity numbers and the classic green jersey? Thank you.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/combination-jersey\">Does the combination jersey at the Tour de France have a place in modern cycling?</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Robyn Davidson &#124; Editorial Assistant","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"d8c6bfbf9d12588e1fe8761f23233c1b7fd827d2efa3c35858451cd73274f0a6","category":"Cycling"}