{"title":"Barriers to uptake of referral services from secondary eye care to tertiary eye care and its associated determinants in L V Prasad Eye Institute network in Southern India: A cross-sectional study-Report II","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303401","date":1715695200000,"content":"<p>by Debananda Padhy, Giridhar Pyda, Srinivas Marmamula, Rohit C. Khanna</p>\r\nAim <p>To investigate the barriers to the uptake of referral services from secondary care centers (SC) to a higher-level tertiary care center (TC) in Southern India.</p> Methods <p>A cross-sectional study was conducted in the Mahabubnagar district of Telangana, India, between February 1, 2018 to January 31, 2019 and all those referred from SC to TC between January 1, 2013 to December 30, 2016 were identified for interview. Based on inclusion criteria, of the 960 participants identified, 681 (70.9%) participated in the study. A validated study questionnaire was administered to all participants. Information collected were the demographic details, details related to their referral and barriers to referral. The participants that presented at TC were considered compliant and who did not, were non-compliant. Reasons for non-compliance was also collected.</p> Results <p>The mean age those interviewed was 46.1 years (SD: 17.3 years) and 429 (63%) were males and 252 (37%) were females. Overall, 516 (75.8%) were compliant, and 165 (24.2%) were non-compliant. The major factors for non-compliance were economic (16.4%) and attitudinal (44.2%) barriers. Within the attitudinal barrier category, the most prevalent individual attitudinal barriers were ‘too busy to go to the eye center for treatment (16.4%)’and ‘able to manage routine daily activities with current vision (12.1%)’. The multivariable analysis showed that the non-compliant participants had only visited the SC once prior to the referral (odds ratio: 2.82; 95% CI: 1.43–5.57) (p = 0.003).</p> Conclusions <p>Participants with only one SC visit, were less likely to comply with referrals and the major barriers to compliance were economical and attitudinal. It is important to address these specific barriers to provide proper counseling to participants during referrals.</p>","author":"Debananda Padhy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d8d7d9008e32351d6d5fd7367927d7bc621e88dabb0357a321aff3e917852a29","category":"Interdisciplinary"}