{"title":"Hidden iOS 16.4 reference hints at possible imminent AirPods launch","link":"https://www.macworld.com/article/1667528/new-airpods-launch-hidden-ios-reference.html","date":1679493960000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The new iOS 16.4 software update contains <a href=\"https://www.macworld.com/article/1660169/ios-16-4-new-features-upgrade-home-architecture-emoji-web-app.html\">a few new features</a> everyone should check out, but an eagle-eyed engineer has spotted something that could be much bigger. Hidden inside the latest code are references to an as-yet unidentified AirPods model and a new AirPods case, a strong sign that Apple plans to launch its rumored budget AirPods in the near future.</p>\n\n\n\n<p>Twitter user <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/aaronp613&amp;xcust=1-1-1667528-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">@aaronp613</a> spotted the references in the code. The new AirPods have the model number A3048, while the case is labeled as A2968. What does this mean? The one thing we can be sure of is that it doesn’t refer to an existing model: Apple has previously used A1523 and A1722 (2017), A2032 and A2031 (2019), A2084 and A2083 (2019 AirPods Pro), A2096 (AirPods Max), A2565 and A2564 (2021), and A2931, A2699, and A2698 (2022 AirPods Pro). This will be the first AirPods model with an A3* designation.</p>\n\n\n\n<figure><div>\n<blockquote><p>Exclusive: iOS 16.4 references new AirPods with the model number A3048 and a new AirPods case with the model number A2968</p>— Aaron (@aaronp613) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/aaronp613/status/1638248393070768147?ref_src=twsrc%5Etfw&amp;xcust=1-1-1667528-1-0-0&amp;sref=https://www.macworld.com/feed\">March 21, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>The case is unknown too. Apple has released AirPods cases labeled A1602, A1938, A2190, A2566, A2700, and A2897. Again, this is a higher designation than any known model, which logically would mean something newer, although it isn’t always that straightforward.</p>\n\n\n\n<p>Apple is believed to have <a href=\"https://www.macworld.com/article/1471084/new-airpods-max-lite-in-pipeline-report.html\">two upcoming AirPods models</a> in the pipeline: a budget set of AirPods that will be priced around $99, and at the other end of the pricing spectrum, the second-gen AirPods Max. The code is more likely to be a reference to the former, as the AirPods Max case (the divisive Smart Case) doesn’t appear to have a model number–I can’t find one on mine, at any rate, and it isn’t among the codes listed on Apple’s website–whereas the so-called AirPods Lite would presumably get their own simpler or less feature-rich charging case, hence the A2968 code.</p>\n\n\n\n<p>The case could also be a reference to a replacement case for the 3rd-gen AirPods and 2nd-gen AirPods Pro, both of which are expected to get USB-C updates at some point this year.</p>\n\n\n\n<p>Giveaway code references like this usually surface when Apple is almost ready to launch new hardware. After all, someone is likely to spot the reference, and the company usually likes to keep things as secret as possible for as long as possible. Yet <a href=\"https://www.macworld.com/article/1471084/new-airpods-max-lite-in-pipeline-report.html\">previous rumors</a> have pegged the next two AirPods launches as arriving in 2024 at the earliest. If that were true, including a reference to one of them this early would be bizarre, since <a href=\"https://www.macworld.com/article/1519552/ios-17-wishlist-features-app-library-siri-app-store-2fa.html\">iOS 17</a> will have come out by then and could easily incorporate any necessary code updates to accommodate the new hardware.</p>\n\n\n\n<p>Does this mean we can therefore expect cheap new AirPods before or at WWDC in June? This would be a surprise, but it now seems a genuine possibility. In the meantime, <a href=\"https://www.macworld.com/article/678255/best-airpods-apple-headphones-compared.html\">check out our comparison of the AirPods models</a> Apple currently sells now to see which one is best for your ears.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d8e4d55b279a12e3158829be5e4f3231cb790c6272214dcb70820115b92015a5","category":"Apple"}