{"title":"Neuronal Ceroid Lipofuscinosis in a Mixed Breed Dog with a Splice Site Variant in CLN6","link":"https://www.preprints.org/manuscript/202405.0054/v1","date":1714544101000,"content":"A 23-month-old neutered male dog of unknown ancestry presented with a history of progressive neurological signs that included anxiety, cognitive impairment, tremors, seizure activity, ataxia, and pronounced visual impairment. The clinical signs were accompanied by global brain atrophy. Due to progression in the severity of disease signs, the dog was euthanized at 26 months of age. Examination of tissues collected at necropsy revealed dramatic intracellular accumulations of autofluorescent inclusions in the brain, retina, and cardiac muscle. The inclusions were immunopositive for subunit c of mitochondrial ATP synthase, and their ultrastructural appearances were similar to those of lysosomal storage bodies that accumulate in some of the neuronal ceroid lipofuscinosis (NCL) diseases. The also dog exhibited widespread neuroinflammation. Based on these findings, the dog was deemed likely to have suffered from a form of NCL. A whole genome sequence analysis of the proband’s DNA revealed a homozygous C to T substitution that altered the intron 3 – exon 4 splice site of CLN6. Other mutations in CLN6 cause NCL diseases in humans and animals including dogs. CLN6 protein was undetectable with immunolabeling in the tissues of the proband. Based on the clinical history, fluorescence and electron-microscopy, immunohistochemistry, and molecular genetic findings, the disorder in this dog is classified as an NCL resulting from the absence of CLN6 protein. Screening the dog’s genome for a panel of breed-specific polymorphisms indicated that its ancestry included numerous breeds, with no single breed predominating. This suggests that the CLN6 disease variant is likely to be present in other mixed breed dogs and at least some of the ancestral breeds.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d8e4d79e5a6f9548c9fcf7f3df1560bb8ebaad6630a34864952084b4dddeb7db","category":"Interdisciplinary"}