{"title":"Drivers are 24% more likely to speed when using adaptive cruise control","link":"https://arstechnica.com/?p=1749239","date":1615574368000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-687602330-800x513.jpg\" alt=\"Before anyone else runs to the comments to point it out, almost no adaptive cruise control systems will engage at speeds above 95 mph.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-687602330.jpg\" class=\"enlarge-link\" data-height=\"1386\" data-width=\"2162\">Enlarge</a> <span class=\"sep\">/</span> Before anyone else runs to the comments to point it out, almost no adaptive cruise control systems will engage at speeds above 95 mph. (credit:  Peter Dazeley/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Another day, another Insurance Institute for Highway Safety study looking at <a href=\"https://arstechnica.com/cars/2021/03/strapping-a-giant-teddy-bear-to-a-car-in-the-name-of-highway-safety/\">how people are using advanced driver assistance systems</a>. Like the study we covered on Wednesday, this one also concerns adaptive cruise control (ACC), which uses forward-looking radar to control the distance to a vehicle in front of it (unlike old-fashioned cruise control, which will happily rear-end someone if you don't turn it off). Sadly, the findings are not encouraging. In its study, the IIHS found that drivers were much more likely to speed while using ACC.</p>\n<p>Back in the mid-'90s, the National Highway Traffic Safety Administration <a href=\"https://www.nhtsa.gov/DOT/NHTSA/NRD/Multimedia/PDFs/Crash%20Avoidance/1998/icc1998.pdf\">evaluated the then-new technology</a> (PDF), logging 35,000 test miles (56,000 km). The NHTSA found that \"ACC is remarkably attractive to most drivers. The research indicates that, because ACC is so pleasing, people tend to utilize it over a broad range of conditions and to adopt tactics that prolong the time span of each continuous engagement.\" However, the agency's results also suggested \"that ACC usage has induced some elevation in the speeds that would otherwise prevail in conventional (i.e., manual and [conventional cruise control]) driving.\"</p>\n<p>The IIHS notes that ACC is marketed as a convenience feature, not a safety feature, but also notes that some studies have linked it to a decrease in crashes and insurance claims. However, this link may be muddied by the fact that the system is usually used in combination with forward collision warning or automatic emergency braking. For example, the claims that Tesla Autopilot reduced crashes by 40 percent <a href=\"https://arstechnica.com/cars/2019/02/in-2017-the-feds-said-tesla-autopilot-cut-crashes-40-that-was-bogus/\">actually turned into a finding that it increased crash rates by 59 percent</a> once properly analyzed.</p></div><p><a href=\"https://arstechnica.com/?p=1749239#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1749239&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d8eb674e89b2545d20f5191e83d8853fa103b77c6561b6c27be9fb411f453e15","category":"Tech"}