{"title":"Marbled paper, frosty fireworks among 2023 Gallery of Fluid Motion winners","link":"https://arstechnica.com/?p=1987438","date":1702056023000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/fluid1-800x448.jpg\" alt=\"Harvard University graduate student Yue Sun won a Milton Van Dyke Award for her video on the hydrodynamics of marbled paper.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/fluid1.jpg\">Enlarge</a> <span>/</span> Harvard University graduate student Yue Sun won a Milton Van Dyke Award for her video on the hydrodynamics of marbled paper. (credit: Y. Sun/Harvard University et al.)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Marbled paper is an art form that dates back at least to the 17th century, when European travelers to the Middle East brought back samples and bound them into albums. Its visually striking patterns arise from the complex hydrodynamics of paint interacting with water, inspiring a <a href=\"https://physics.aps.org/articles/v16/201\">winning video entry</a> in this year's Gallery of Fluid Motion.</p>\n<p>The American Physical Society's Division of Fluid Dynamics sponsors the gallery each year as part of its annual meeting, featuring videos and posters submitted by scientists from all over the world. The objective is to highlight \"the captivating science and often breathtaking beauty of fluid motion\" and to \"celebrate and appreciate the remarkable fluid dynamics phenomena unveiled by researchers and physicists.\"</p>\n<p>The three videos featured here are the winners of the Milton Van Dyke Awards, which also included three winning posters. There were three additional general video winners—on the atomization of impinging jets, the emergent collective motion of condensate droplets, and the swimming motion of a robotic eel—as well as three poster winners. You can view all the 2023 entries (winning and otherwise) <a href=\"https://gfm.aps.org\">here</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1987438#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987438&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d90c117cf6fc3cadca1a208b5f4ecf5a5168d11e18a4303d6e6ddf50c108c143","category":"Tech"}