{"title":"‘The first loser’ - How could Filippo Ganna have won Milan-Sanremo?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-first-loser-could-filippo-ganna-have-won-milan-sanremo","date":1679166606000,"content":"\n      <p><span>The rueful shake of the head when he crossed the finish line gave it away and Filippo Ganna didn’t hide it in his post-race interviews either: the Italian rider wanted more from <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a>. It’s a quality of an athlete of his talent that while everyone else is talking about how surprisingly impressive Ganna’s performance was, he was left feeling as if he had lost the chance of taking the biggest road victory of his career when he was close enough to touch it.</span></p>\n<p><span>“I’m a little bit disappointed, I think everyone is with second place,” he said after the race. “It’s the first of the losers. Now I’m disappointed but maybe tomorrow I’ll realise I arrived second in Sanremo.”</span></p>\n<div></div>\n<p><span>While the Italian rider might not have had time to reflect on the positive aspects of his performance so soon after an adrenaline-filled finish, it’s undeniable that his result has signified a clear step forward in his one-day racing prowess. Ganna proved he was climbing well during the recent edition of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\" target=\"_blank\">Tirreno-Adriatico</a> and cemented that today as he sat tight on two-time <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> winner Tadej Pogačar’s wheel on the Poggio, despite carrying at least an additional ten kilogrammes of weight compared to the Slovenian.</span></p>\n\n<p><span><span>When Mathieu van der Poel </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/destiny-patience-and-the-form-of-his-life-mathieu-van-der-poel-s-milan-sanremo-masterpiece\">launched his winning move</a><span>, Ganna was behind Pogačar who was unable to close the gap, likely spent from his earlier attack on the climb. Perhaps if Ganna had been on the wheel of Van der Poel instead, he would have been able to follow the Dutch rider, but in just a few seconds the gap had been created and it was too late. Maybe that is the moment that Ganna was thinking back to as he crossed the finish line so visibly disappointed.</span></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/190323_POOL_1099Cycling_Milan-Sanremo_c_Tim_De_Waele-Getty_Images_46f083d8-89ed-46c2-be33-bf060dfc04e6_1024x1024.jpg?v=1679166038\" alt /></span><em><span>Image: RCS/Pool</span></em></p>\n<p><span>However, it could be argued that there was more that Ganna could have done in the run-in to the finish line to drag himself back into contention for victory. As he chased Van der Poel alongside Pogačar and Wout van Aert, the Italian rider was pulling short and sharp turns, seemingly not wanting to contribute to a coherent chase. Cracks began to show in the Italian’s armoury on the descent of the Poggio, too: he was letting gaps open on the hairpin bends and repeatedly had to chase hard to get back onto the wheel of Van Aert. </span></p>\n<p><span>No one will ever know how it might have changed things if Ganna was able stay closer to Van Aert on the descent and had pulled longer and stronger turns, and perhaps Van der Poel would have had the strength to stay away anyway, but it’s something that the Italian rider could have done differently to give himself a shot of winning in Milan-Sanremo. It’s understandable if, at the time, he didn’t want to do too much work and drag Wout van Aert to the line as he believed the Belgian would have a better final sprint, but Ganna proved by finishing second that he was the fastest finisher of that trio in the end.</span></p>\n<p><span>The positive that can be taken from these mistakes, however, is that Ganna is likely now fully aware of his form compared to some of the key favourites for the upcoming Classics. The Ineos Grenadiers rider knows that he can, in fact, outsprint Wout van Aert, and he can climb with Tadej Pogačar on punchy ascents. He knows that when his teammate, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade-Bianche</a> winner Tom Pidcock, isn’t racing, or is having a bad day, he can take up the mantle as the team leader for the Ineos Grenadiers with impressive style. </span></p>\n<p><span>Ganna may leave Milan-Sanremo feeling like he made mistakes or wishing that he had won the sprint for first place, rather than second, but he can also leave with a new found confidence for the rest of his spring campaign. The 26-year-old won’t have hairpin descents to contend with in races like E3 Harelbeke or Paris-Roubaix, and he’s proven that Ineos Grenadiers should put their full support behind him for these events. There’s a lot more to come from Top Ganna yet this spring.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d90d23e27fc703fc5f1de45e58bc2f62ea34b4a3f62fac0a7818328d5cd00904","category":"Cycling"}