{"title":"The Time Interval Only Set, Part 1","link":"https://www.preprints.org/manuscript/202209.0151/v5","date":1710849260000,"content":"A time interval only description necessarily needs its own independent definitions, without one moment time coordinates to it. In this paper derived are time interval only set properties, including commutation relations, addition, multiplication and derivatives. Time interval only set commutation relations, consistent with one moment time set properties, are introduced by defining correspondence relations for these sets. Time development and equilibrium within the time interval description depend on the well-known ‘mean velocity theorem’ and the time interval version of the Legendre transform. In contrast, usually applied is only the traditional vector and one moment time coordinate kinematic approach from Newton’s laws. The main results of this paper are correspondences and time interval only set commutation relations. All other properties are derived from these results, while for the time interval only set, different from the one moment time set the canonical property is not valid. The time interval only description can be applied assuming spherical symmetric star-source radiation propagation, with finite time intervals for realistic measurement events. From time development with (a-)symmetry of time intervals, and from Curie’s principle, change can be described with a set theoretic approach. Time interval only set properties include the time interval only version of Noether charges and structure constants. A time interval only description for wave propagation, including group-velocity, for zero and non-zero mass wave particles, relates to the properties of the time interval only set. A second result in terms of the time interval only description is propagation wave energy equivalence with gravitation energy, derived from time interval only set commutation relations. A time interval approach, however including one moment time description dependence, was introduced in earlier publications of this author. In part 1 investigated are the time interval only set and its properties, a forthcoming part 2 to application of the time interval only description to specific groups of stars as emission sources.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d90e6fce97600e3c51542ebd4b78bad691e174e4235039cfdb432970c71f8653","category":"Interdisciplinary"}