{"title":"Prediction models for post-discharge mortality among under-five children with suspected sepsis in Uganda: A multicohort analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003050","date":1714399200000,"content":"<p>by Matthew O. Wiens, Vuong Nguyen, Jeffrey N. Bone, Elias Kumbakumba, Stephen Businge, Abner Tagoola, Sheila Oyella Sherine, Emmanuel Byaruhanga, Edward Ssemwanga, Celestine Barigye, Jesca Nsungwa, Charles Olaro, J. Mark Ansermino, Niranjan Kissoon, Joel Singer, Charles P. Larson, Pascal M. Lavoie, Dustin Dunsmuir, Peter P. Moschovis, Stefanie Novakowski, Clare Komugisha, Mellon Tayebwa, Douglas Mwesigwa, Martina Knappett, Nicholas West, Nathan Kenya Mugisha, Jerome Kabakyenga</p>\r\n\r\nIn many low-income countries, over five percent of hospitalized children die following hospital discharge. The lack of available tools to identify those at risk of post-discharge mortality has limited the ability to make progress towards improving outcomes. We aimed to develop algorithms designed to predict post-discharge mortality among children admitted with suspected sepsis. Four prospective cohort studies of children in two age groups (0–6 and 6–60 months) were conducted between 2012–2021 in six Ugandan hospitals. Prediction models were derived for six-months post-discharge mortality, based on candidate predictors collected at admission, each with a maximum of eight variables, and internally validated using 10-fold cross-validation. 8,810 children were enrolled: 470 (5.3%) died in hospital; 257 (7.7%) and 233 (4.8%) post-discharge deaths occurred in the 0-6-month and 6-60-month age groups, respectively. The primary models had an area under the receiver operating characteristic curve (AUROC) of 0.77 (95%CI 0.74–0.80) for 0-6-month-olds and 0.75 (95%CI 0.72–0.79) for 6-60-month-olds; mean AUROCs among the 10 cross-validation folds were 0.75 and 0.73, respectively. Calibration across risk strata was good: Brier scores were 0.07 and 0.04, respectively. The most important variables included anthropometry and oxygen saturation. Additional variables included: illness duration, jaundice-age interaction, and a bulging fontanelle among 0-6-month-olds; and prior admissions, coma score, temperature, age-respiratory rate interaction, and HIV status among 6-60-month-olds. Simple prediction models at admission with suspected sepsis can identify children at risk of post-discharge mortality. Further external validation is recommended for different contexts. Models can be digitally integrated into existing processes to improve peri-discharge care as children transition from the hospital to the community.","author":"Matthew O. Wiens","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d915efcf18642a8d70b4e00ff7761c1e296d61bfaefd9697f48583f804958fc4","category":"Environment"}