{"title":"PSXII-28 Physiochemical and nutritional characteristics of the newly developed value-added blended fat stimulated feed product in comparison with commercial protein and energy feeds","link":"https://academic.oup.com/jas/article/102/Supplement_3/779/7757716?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objectives of this study were to determine physiochemical and nutritional characteristics of the newly developed value-added blended fat stimulated feed product (BFSFP) in comparison with commercial protein and energy feeds. The new value-added BFSFB with three-batch samples (BFSFP1, BFSFP2, BFSFP3) were developed. Barley grain (n = 3) and canola meal samples (n = 3) were obtained from Canadian Feed Research Center. Chemical composition and nutrient profiles were determined using standard feed analysis methods (e.g., AOAC, NRC-energy). The treatment design was a one-way structure. The experimental design was a CRD with feed treatments as a fixed effect. The data were analyzed using the Mixed model procedure of SAS. Tukey’s method was used for multi-treatment comparison. The results showed that compared with commercially available energy-rich and protein-rich feeds, the BFSFP had greater (<span>P</span> &lt; 0.05) ether extract (EE) than both canola meal and barley grain [4.8 vs. 1.0, 1.6 % dry matter (DM), respectively]. It had decreased ash content than canola meal but greater than barley grain (<span>P</span> &lt; 0.05). For protein chemical profiles, the BFSFP had less (<span>P</span> &lt; 0.05) CP (31.0 vs. 41.6, 12.5%DM), SCP (4.9 vs. 9.1, 3.4% DM), and NPN (11.0 vs. 18.2, 9.2% CP) than canola meal but greater than barley grain. The BFSFP had greatest NDICP (2.6 vs. 0.9, 0.4%CP) and ADICP (0.14 vs. 0.30, 0.06%DM) than both canola meal and barley grain. For carbohydrate chemical profiles, the BFSFP had greater (<span>P</span> &lt; 0.05) carbohydrate (58.1 vs. 50.4, 83.7%DM) and starch (4.5 vs. 1.3, 55.9%DM) than canola meal but less than barley grain. The BFSFP had greater (<span>P</span> &lt; 0.05) NDF (42.9 vs. 28.6, 18.9%DM) and hemicellulose (27.7 vs. 10.5, 12.9%DM) than both canola meal and barley grain. The BFSFP had had less (<span>P</span> &lt; 0.05) ADF (12.7 vs. 17.5, 5.7%DM) and ADL (3.0 vs. 8.0, 0.8%DM) than canola meal but greater barley grain. As to energy profle, the BFSFP had no significant difference in NE for lactation when compared with barley grain and canola meal (1.80 vs 1.93 vs. 1.69 Mcal/kg DM, <span>P</span> &gt; 0.05). The BFSFP had similar in NE for growth (1.29 Mcal/kg DM) when compared with canola meal (1.29 vs. 1.20 Mcal/kg DM, <span>P</span> &gt; 0.05) but less than barley (1.29 vs 1.42 Mcal/kg DM, <span>P</span> &lt; 0.05). In conclusion, the newly developed blended fat stimulated feed product differed in physiochemical and nutritional characteristics in comparison with commercially available energy-rich and protein-rich feeds.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d920d2a75aa924421738c6af7c09d24e29b6d8ed0f56f7bd363336115eb6ae99","category":"Environment"}