{"title":"Tobias Foss: Jumbo-Visma's Joker Card at the 2021 Giro d'Italia","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tobias-foss-jumbo-vismas-joker","date":1620517912000,"content":"\n      <p><span>The scene is the 2020 Giro d’Italia, stage one. Heading into Palermo, a timetrial would decide the first owner of the <em>maglia rosa</em>. Of course, Filippo Ganna won with supreme ease that day, but 31 seconds behind and rounding out the top five was Jumbo Visma's Tobias Foss.</span></p>\n<p><span>Just 23-years-old, it was Foss’ Grand Tour debut. Foss is a former winner of the Tour de l’Avenir, a race also won by <span>Tadej Pogačar </span>and Egan Bernal. This fact alone added intrigue regarding Foss’ performance, which isn’t surprising considering the two riders that won the race before him are now Tour de France champions.</span></p>\n<div></div>\n<p><span>It was a strong start for Foss, who arrived at the race in support of Steven Kruijswijk. In his neo-pro season, </span>Foss showed signs of strength in the mountains too. He was in the 22-man group of favourites on the difficult stage five which finished in Camigliatello Silano, before also performing well on the leg-sapping climb to Roccaraso.</p>\n<p><span>That would be Foss’ final stage at the 2020 Giro d’Italia, though. The Norwegian was forced to abandon after Steven Kruijswijk tested positive for COVID-19, effectively ending Kruisjwijk and Foss’ season.</span></p>\n<p><span>Following the winter break, Tobias Foss began his second WorldTour season in Italy with Strade Bianche and Tirreno-Adriatico. Foss was consistent throughout Tirreno, earning top-25s on the two queen stages: a mountain-top finish on the Prati di Tivo and the stage five to Castelfidardo which took place in conditions which can only be described as apocalyptic.</span></p>\n<div></div>\n<p><span>Next, Foss finished fourth in the 13.9km time-trial at the Itzulia Basque Country Tour where he rode in support of <span>Primož Roglič</span>. Next up, the Giro d’Italia. </span></p>\n<p><span>Still aged just 23, Foss entered the 2021 Giro with increased experience and confidence that he can compete at the front end of the WorldTour.</span></p>\n<p><span>Foss’ self-belief would only increase as the opening time-trial went on, particularly as he passed his minute man Simon Pellaud heading into the final 900 metres. It would only be another minute until Foss crossed the line and knew he’d taken the provisional best time by an impressive nine seconds ahead of <span>Matthias Brändle</span>.</span></p>\n<p><span>For more than just a moment, it looked like Foss could even go into the <em>maglia rosa</em> as Remi Cavagna, one of the pre-stage favourites, was unable to surpass the time set by the talented Norwegian. However, Foss’ teammate <span>Edoardo Affini</span> and later Filippo Ganna would later answer that question. Nonetheless, a podium-place for Foss in the opening time-trial was an exceptional performance.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_1102_1024x1024.jpg?v=1620499153\" /></span><i><span>Tobias Foss is an accomplished time-trialist. (Image credit: </span></i><i><span>Alex Whitehead/SWpix)</span></i></p>\n<p><span>Whilst sitting on the hotseat, Foss exclaimed, \"I didn’t do a lot of prologues until I was a pro. I executed a really good time trial and I am happy with that, the result will just be a bonus.\" When asked on his personal aspirations for the Giro d'Italia, Foss said: \"The shape is good, we have George who is also in really good shape. I think we can be a good duo and I can help him well. We’ll take it day-by-day and see how it ends.\"</span></p>\n<p><span>Foss remains coy on his own GC ambitions despite the advantage he now enjoys over his teammate — Foss leads Bennett by 28 seconds.</span></p>\n<p><span>When you consider the next couple of stages which increase in difficulty until the treacherous uphill finish to Sestola on stage four, Foss’ may yet be given the opportunity to wear the <em>maglia rosa</em> at this Giro. Filippo Ganna and Edoardo Affini are the only riders ahead of Foss in the general classification and are both much bulkier than Foss, who is an adept climber. Should both struggle at some point over the next few stages, Foss may see pink close-up sooner rather than later. </span></p>\n<p><span>No matter how Jumbo-Visma choose to employ Tobias Foss at the 104th Giro d'Italia, they can be assured that they have an ever-improving stage racer with an already elite time trial. No one knows exactly how Foss' body will respond to a three-week race; he's never completed a Grand Tour. This may give him some freedom throughout the race, should his team allow it of course. </span><span>Just years after he left Team Joker, Foss will play exactly that role for Jumbo-Visma at this Giro d'Italia. The joker.</span></p>\n<p><i><span>Cover image: </span></i><i><span>LUCA BETTINI/AFP via Getty Images</span></i></p>\n<div></div> \n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d925b125ccd11b3dc8c3a28a86658ccb6b3fdd5c68fd6e41a8c32c9f2df464eb","category":"Cycling"}