{"title":"KOJI AWARENESS, a self-rating whole-body movement assessment system, has intersession reliability and comparability to external examiner rating","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308973","date":1723730400000,"content":"<p>by Hiroshi Takasaki, Shunsuke Kanayasu</p>\r\n\r\nKOJI AWARENESS is a newly developed self-rating whole-body movement assessment system that includes 11 domains and 22 tests. The primary aim of this study was to investigate the intersession reliability of KOJI AWARENESS, and the secondary aim was to determine whether a fixed bias existed between self-rating and external examiner rating. Fifty university students rated their movement ability in two separate sessions; an external examiner also rated the students’ movement ability. Participants were blinded to their scores at the first session as well as the external examiner’s rating scores. The primary analysis included examining the intersession reliability of the total score with intraclass correlation coefficients (ICCs). ICC values were interpreted as follows: insufficient, &lt; .7 and sufficient, ≥ .7. To achieve the secondary aim, Bland–Altman analysis was performed. ICC for the intersession reliability was .86 with a 95% confidence interval (CI) of .77 to .92 and a minimum detectable change (MDC) of 5.15. Bland–Altman analysis revealed fixed bias as the 95% CIs of the mean difference between the two different rating scores (−3.49 to −2.43 and −3.94 to −2.98 in the first and second sessions, respectively) did not include 0 in the data of each session. However, no proportional bias was identified because no statistically significant Pearson’s correlation (P &gt; .05) was noted between the means of the two methods and the mean difference between the two different methods in each session. This study identified that KOJI AWARENESS has sufficient intersession reliability among relatively young and healthy participants. External examiner rating tended to have lower total scores than self-rating; however, the bias was below the MDC and seemed not to be clinically significant.","author":"Hiroshi Takasaki","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d9268fd3bd2c9dcd37a15211a6678f09818e44c6c124906b73a073b656a0c876","category":"Interdisciplinary"}