{"title":"296 Effects of dietary antimicrobials on the ruminant gastrointestinal tract microbiome","link":"https://academic.oup.com/jas/article/102/Supplement_2/215/7665008?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Monensin, tylosin, and chlortetracycline (CTC) are antimicrobials frequently employed in high grain feedlot cattle diets to inhibit liver abscesses and enhance growth. However, increased public concerns regarding antibiotic resistance have created a pressing need to develop alternative strategies. A more mechanistic understanding of how antimicrobial drugs effect the microbiome in the ruminant gastrointestinal tract (GIT) may help develop effective alternatives. Therefore, the objective of this study was to determine changes in the GIT microbiome of grain-fed feedlot steers after antimicrobial drug administration. Thirty individually housed Angus x Simmental steers [body weight (BW) = 355 ± 16.8 kg] previously fed a 56% forage diet were immediately transitioned to a 93% concentrate diet and assigned to one of three treatments (10 steers/treatment): 1) control, without antibiotics, 2) 75 mg of tylosin and 200 mg of monensin per animal per day (TYLMON), and 3) 70 mg of CTC per animal per day. Fecal samples were collected on d 0, 7, 14, 28, 56, 112, and at slaughter and digesta were obtained from the rumen, jejunum, and cecum at slaughter. DNA was extracted from samples, amplified via 16S PCR, and sequenced. Jejunal samples had the least alpha diversity compared with ruminal, cecal, or fecal samples (<span>P</span> &lt; 0.001). There were no differences in measures of alpha diversity in the ruminal, jejunal, or cecal digesta at slaughter (<span>P</span> ≥ 0.10). However, overall measures of alpha diversity (Shannon entropy, observed features) in feces were greater in CTC-fed steers (<span>P</span> ≤ 0.009) as well as in TYLMON-fed steers (<span>P</span> ≤ 0.04) compared with control steers. Measures of alpha diversity for all treatments decreased in feces from d 0 to 7, then increased from d 7 to slaughter (time effect, (<span>P</span> ≤ 0.001). There were no differences in fecal alpha diversity between treatment groups on d 0 (<span>P</span> ≥ 0.50), but by d 28 both TYLMON and CTC treated steers had greater fecal alpha diversity compared with the control steers (<span>P</span> ≤ 0.05). With regard to differential abundance, <span>Phascolarctobacterium</span> and <span>Prevotellaceae</span> UCG-003 were more abundant in feces of control steers relative to antimicrobial treated steers (<span>P</span> &lt; 0.05). <span>Bifidobacterium</span>, <span>Dorea</span>, CAG-56, and <span>Erysipelotrichaceae</span> UCG-003, were the 4 genera found to be in the greatest abundance in the feces of TYLMON-fed relative to control steers (<span>P</span> &lt; 0.05). <span>Akkermansia</span>, <span>Succinivibrio</span>, and <span>Turicbacter</span> were the 3 genera found to be in the greatest abundance in the feces of CTC-fed compared with control steers (<span>P</span> &lt; 0.05). Taken together, these data suggest that differences in the microbiome associated with dietary antimicrobial treatment occur to a greater extent in the lower sections of the GIT, and that these changes in the microbiome occur after 28 d of feeding.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"d92982d4708b68d2a06a5375060a1fb57d71eb1da462bb0ee8bdd2e7cdaba5cf","category":"Environment"}