{"title":"Effects of livestock grazing on rangeland condition, plant species richness and wild ungulate population in a semi‐arid savannah","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13295?af=R","date":1720973935000,"content":"<h2>Abstract</h2>\n<p>This field study in a semi-arid savannah at Senkelle Swayne's Hartebeest Sanctuary, Ethiopia, examined livestock grazing effects on rangeland condition, plant species composition and richness, and population of the endangered Swayne's hartebeest (<i>Alcelaphus buselaphus swaynei</i>). Rangeland condition was analysed using a common protocol for the assessment of semi-arid rangelands. A total count method was used to estimate ungulate numbers. Grazing reduced all measures of range condition and productivity and affected the composition and richness of the herbaceous species. Grazing also induced an increase in the density and number of encroaching woody species <i>Vachellia seyal</i> and <i>Senegalia senegal</i>. The population of the Swayne's hartebeest significantly affected by livestock grazing (mean number of hartebeests observed under moderately and lightly grazed sites were 10.00 ± 2.49 and 6.75 ± 2.06, respectively). No individual hartebeest was observed roaming in the heavily grazed zone, which implies an effective reduction in the extent of habitat available for the hartebeest. The overall condition of the rangeland was poor. Measures to reduce livestock presence in areas from which the hartebeest has been displaced and controlled seasonal livestock grazing within non-sensitive parts of the Sanctuary may benefit the hartebeest. Coupled with these, livestock exclusions for up to a year and interseeding may help improve rangeland condition and hartebeest's habitat.</p>\n<h2>Résumé</h2>\n<p>Cette étude de terrain dans une savane semi-aride du Sanctuaire du bubale de Senkelle Swayne, en Éthiopie, a examiné les effets du broutage du bétail sur l'état des pâturages, la composition et la richesse des espèces végétales et la population du bubale de Swayne (<i>Alcelaphus buselaphus swaynei</i>), une espèce menacée d'extinction. L'état des pâturages a été analysé à l'aide d'un protocole courant pour l'évaluation des pâturages semi-arides. Une méthode de comptage total a été utilisée pour estimer le nombre d'ongulés. Le broutage a réduit toutes les mesures de l'état et de la productivité des pâturages et a affecté la composition et la richesse des espèces herbacées. Le broutage a également entraîné une augmentation de la densité et du nombre des espèces ligneuses envahissantes <i>Vachellia seyal</i> et <i>Senegalia senegal</i>. La population de bubales de Swayne est considérablement affectée par le broutage du bétail (le nombre moyen de bubales observés dans les sites modérément et légèrement broutés était de 10,00 ± 2,49 et 6,75 ± 2,06, respectivement). Aucun bubale n'a été observé dans la zone fortement broutée, ce qui traduit une réduction effective de l'étendue de l'habitat disponible pour les bubales. L'état général des pâturages était médiocre. Les mesures visant à réduire la présence du bétail dans les zones d'où le bubale a été déplacé et le contrôle du broutage saisonnier du bétail dans les parties non sensibles du sanctuaire peuvent être avantageux pour le bubale. En outre, l'exclusion du bétail pendant un an et l'ensemencement intermédiaire peuvent contribuer à améliorer l'état des pâturages et l'habitat du bubale.</p>","author":"Dejene Beyene, \nYonas Berhanu, \nAyana Angassa","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"d93066b164ab9214bb5eacfa00b2dc042b842f55509a675a95bfcf3c0157172d","category":"Environment"}