{"title":"Archaeologists: Roman soldiers used this built-in fridge to keep their wine cool","link":"https://arstechnica.com/?p=1970546","date":1695765967000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/fridgeTOP-800x533.jpg\" alt=\"ancient walled archaeological dig\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/fridgeTOP.jpg\">Enlarge</a> <span>/</span> Archaeologists excavating a Roman legionary fortress found a ceramic \"wine fridge.\" (credit: <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">Rjdeadly/CC BY-SA 4.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Roman soldiers occupying what is now northern Bulgaria along the Danube River had to deal with all manner of uprisings against the empire, but at least they could keep their wine reasonably cool. Archaeologists <a href=\"https://arkeonews.net/archaeologists-discovered-how-wine-was-cooled-in-roman-legions-on-the-danube/\">have discovered</a> a 2,000-year-old built-in ceramic structure they believe was used to store wine and perishable foods.</p>\n<p>It's a rare find and the second such \"refrigerator\" to be discovered at a former fortress at the archaeological site of <a href=\"https://en.wikipedia.org/wiki/Novae_(fortress)\">Novae.</a> The first was <a href=\"https://arkeonews.net/an-ancient-fridge-have-uncovered-at-the-roman-legionary-fortress-of-novae-bulgaria/\">found last year</a>: a container made of ceramic plates beneath the floor of a military barracks room. It was most likely used to store food, based on the ceramic vessels and small baked bone fragments found along with it, as well as charcoal and a bowl that may have been used to burn incense to ward off insects.</p>\n<p>This latest find is noteworthy because it has an additional cooling element in the form of a lead pipe (connected to a system of aqueducts) running along one side. The fragments of wine-drinking vessels, bowls, and animal bones should help the team re-create the soldiers' last meal, according to team leader Piotr Dyczek, an archaeologist at the University of Warsaw in Poland.</p></div><p><a href=\"https://arstechnica.com/?p=1970546#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970546&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d95674ca590c8fb7e3b2e7c81781d35512583ffb07ec5ccec4a7258698412b78","category":"Tech"}