{"title":"Scientists say they have found more moons with oceans in the Solar System","link":"https://arstechnica.com/?p=1937036","date":1683299921000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/PIA00041-800x615.jpg\" alt=\"The complex terrain of Ariel is viewed in this image, the best Voyager 2 color picture of the Uranian moon.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/PIA00041.jpg\">Enlarge</a> <span>/</span> The complex terrain of Ariel is viewed in this image, the best Voyager 2 color picture of the Uranian moon. (credit: NASA/JPL)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In recent decades, NASA has sent large spacecraft—Galileo and Cassini, respectively—to fly around Jupiter and Saturn to explore the dozens of moons that exist in those planetary systems.</p>\n<p>The spacecraft investigated all manner of intriguing moons, from little radiation-saturated hellholes to a world covered in volcanoes. But the most consistently interesting discovery made by these probes was that Jupiter and Saturn are surrounded by small and large moons covered in ice, possessing large water oceans below, or both. This was exciting because where there is water in its liquid state, there is the possibility of life.</p>\n<p>In response to these discoveries, NASA is planning to launch a mission to Europa, an ice-encrusted moon in the Jovian system, as early as 2024. Another mission may launch to Saturn's moon Titan a few years later, where there are oceans of liquid methane on the surface. And just last month, <a href=\"https://arstechnica.com/science/2023/04/europe-is-about-to-launch-one-of-its-most-ambitious-missions-ever/\">the European Space Agency launched</a> a spacecraft, Juice, to explore several icy moons at Jupiter.</p></div><p><a href=\"https://arstechnica.com/?p=1937036#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937036&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d95781a1716f07603e3962882d5e5c19184c134241e3c09013e5e83d7957be96","category":"Tech"}