{"title":"Amazon อัพเดตสินค้าตระกูล Echo: Echo Show 8 รุ่นใหม่, จอสั่งการ Echo Hub และแว่น Echo Frames","link":"https://www.blognone.com/node/135845","date":1695253185000,"content":"<div><div><div><p>Amazon เปิดตัวฮาร์ดแวร์ในตระกูล Echo ชุดใหญ่ ที่มาพร้อมความสามารถของ Alexa ซึ่งคราวนี้มีสินค้าใหม่แว่นตาด้วย</p>\n<p>เริ่มที่สินค้าแรก <strong>Echo Show 8</strong> สมาร์ทสกรีนในบ้านรุ่นที่ 3 มาพร้อมดีไซน์ใหม่ ระบบเสียงที่ปรับปรุงให้รองรับ Spatial Audio ส่วนวิดีโอคอลก็มีคุณภาพมากขึ้นด้วยกล้องหน้า 13MP และระบบเสียงที่ตัดเสียงรบกวนได้ดีมากขึ้น</p>\n<p>อีกจุดขายของ Echo Show 8 คือความสามารถที่เรียกว่า Adaptive Content ที่ใช้เทคโนโลยีของกล้องจับภาพ เพื่อปรับการแสดงเนื้อหาบนหน้าจอให้เหมาะสมกับปัจจุบัน ตัวอย่าง เมื่อผู้ใช้งานยืนอยู่ห่างจากหน้าจอ Echo Show 8 จะปรับการแสดงเนื้อหาให้มองเห็นได้ชัดแม้อยู่ไกลอัตโนมัติ หรือหากเปิดการตั้งค่าบุคคล เนื้อหาข่าวหรือข้อมูลอื่นก็จะแสดงตามการตั้งค่าของคนนั้น ความสามารถนี้จะใช้งานได้ใน Echo Show 8 2nd Gen ด้วย รวมถึง Echo Show รุ่นอื่นในอนาคต</p>\n<p>ราคาขายอยู่ที่ 149.99 ดอลลาร์ สินค้าเริ่มจัดส่งเดือนตุลาคม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/90634ff5c481b069d1a0cfd83189e2f8.png\" /></p>\n<p>สินค้าถัดมาคือ <strong>Echo Hub</strong> จอภาพติดผนังขนาด 8 นิ้ว สำหรับควบคุมสั่งการอุปกรณ์สมาร์ทโฮมในบ้าน เรียกดูข้อมูลต่าง ๆ รวมถึงภาพจากกล้องในบ้าน หรือตั้งค่าการทำงานอัตโนมัติต่าง ๆ รองรับการควบคุมอุปกรณ์สมาร์ทโฮมมากกว่า 140,000 รายการ รวมถึงอุปกรณ์มาตรฐานเชื่อมต่อ Zigbee, Sidewalk, Bluetooth, Matter และ Thread</p>\n<p>Echo Hub จะเริ่มขายภายในปีนี้ แต่ยังไม่ระบุเวลา ราคาอยู่ที่ 179.99 ดอลลาร์</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fd784237eaef9b653946124bb75209de.png\" /></p>\n<p>ถัดมาเป็นแว่นตา <strong>Echo Frames</strong> รุ่นใหม่ ซึ่ง Amazon บอกว่ามีการออกแบบที่เน้นแฟชั่นมากขึ้น มีตัวเลือกเลนส์หลากหลาย ทั้งกันแดด แว่นสายตา จนถึงเลนส์ตัดแสงฟ้า บอดี้ใช้วัสดุที่ลดน้ำหนักลง ให้สวมใส่ได้สบาย แบตเตอรี่อยู่ได้นาน 6 ชั่วโมง โดยมีการเล่นสื่อหรือสนทนาตลอดเวลา ระบบเสียงก็ปรับปรุงให้เบสชัดขึ้นสามเท่า การรับรู้เสียงของ Alexa ดีขึ้นกว่าเดิมสิบเท่า ราคาเริ่มต้นที่ 269.99 ดอลลาร์</p>\n<p>นอกจากนี้ Amazon ยังเปิดตัว <strong>Carrera Smart Glasses</strong> ซึ่งร่วมมือกับแว่นตา Carrera เพื่อให้มีตัวเลือกแว่นตาอัจฉริยะที่มีสไตล์มากขึ้น ราคาเริ่มต้นที่ 389.99 แต่ยังไม่ระบุเวลาเริ่มส่งมอบ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ba1b39ffa3e48a778b78fc3497a7c9d4.png\" /></p>\n<p>ที่มา: <a href=\"https://press.aboutamazon.com/2023/9/amazon-unveils-next-generation-echo-show-8-all-new-echo-hub-and-new-echo-frames\">Amazon</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/amazon-echo\">Amazon Echo</a></div><div><a href=\"/topics/alexa\">Alexa</a></div><div><a href=\"/topics/smart-home\">Smart Home</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d95c18bb09cbad24038ea8a718cf4f12d0d16eb3cf8a8d35adb1b1c544c2e80f","category":"Thai"}