{"title":"ตำรวจไซเบอร์กวาดล้างแก๊งคอลเซ็นเตอร์ในกรุงเทพ ตั้งกล่อง Sim Box ตามตึกสำนักงาน","link":"https://www.blognone.com/node/136339","date":1697861860000,"content":"<div><div><div><p>กองบัญชาการตำรวจสืบสวนสอบสวนอาชญากรรมทางเทคโนโลยี (บช.สอท.) ร่วมกับ กสทช. และ AIS แถลงข่าวการจับแก๊งคอลเซ็นเตอร์ในกรุงเทพ ที่แอบติดตั้งกล่อง Sim Box ที่หนึ่งกล่องบรรจุซิมการ์ดจำนวนมาก ตามบริเวณอาคารสำนักงานต่างๆ เพื่อใช้เป็นจุดโทรไปหลอกลวงประชาชน</p>\n<p>กล่อง Sim Box หรือ GSM Gateways ที่จับกุมได้รองรับการใส่ซิมการ์ด 32 ซิมต่อกล่อง กระจายตัวอยู่ 5 จุดทั่วกรุงเทพ รวมแล้ว 10 กล่อง วิธีการใช้งานคือคนร้ายจะโทรผ่านอินเทอร์เน็ต ส่งทราฟฟิกมายัง Sim Box เพื่อให้ฝั่งผู้รับเห็นเป็นเบอร์โทรศัพท์ปกติ (ไม่ใช่หมายเลข IP Phone ที่มี prefix นำหน้า ซึ่งคนเริ่มเรียนรู้และไม่กล้ารับสายแล้ว)</p>\n<p>พล.ต.อ.ดร.ณัฐธร เพราะสุนทร กสทช.ด้านกฎหมายและประธานอนุกรรมการบูรณาการบังคับใช้กฎหมายความผิดทางเทคโนโลยี แถลงว่าช่วงหลัง กสทช. และสำนักงานตำรวจแห่งชาติ กวาดล้างเสาโทรคมนาคมผิดกฎหมายตามแนวชายแดนประเทศเพื่อนบ้าน ทำให้แก๊งคอลเซ็นเตอร์ย้ายกลับเข้ามาตั้งฐานในประเทศไทย โดยเฉพาะในกรุงเทพ และใช้วิธีโทรผ่านกล่อง Sim Box แทน</p>\n<p>เดิมที แก๊งคอลเซ็นเตอร์ใช้วิธีเช่าบ้าน ตั้งเราเตอร์เพื่อต่อกับกล่อง Sim Box จำนวนมาก ทำให้เจ้าหน้าที่ตรวจจับการใช้งานที่มากผิดปกติได้ง่าย แต่ภายหลังเปลี่ยนมาใช้วิธีเช่าอาคารสำนักงาน ใช้เราเตอร์ของอาคาร เพื่อแฝงตัวกับปริมาณการใช้งานของธนาคาร แถมดัดแปลงรูปลักษณ์ภายนอกของกล่อง Sim Box ให้เหมือนแอมปลิฟายเออร์ของเครื่องเสียง เพื่อให้ตรวจจับได้ยากขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f18806bc7525c26a335e8f441e81f4c1.jpg\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e3f27ab67e806baed42d3d4cd72a5406.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/police\">Police</a></div><div><a href=\"/topics/scam\">Scam</a></div><div><a href=\"/topics/telecom\">Telecom</a></div><div><a href=\"/topics/nbtc\">NBTC</a></div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/crime\">Crime</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d95ed987e5d51d326845f097caa4740c29cad40342a48814cb053380a9e558a3","category":"Thai"}