{"title":"Toyota has built an EV with a fake transmission, and we’ve driven it","link":"https://arstechnica.com/?p=1980015","date":1698757056000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Z8S_9029-800x533.jpg\" alt=\"A man's hand operates the gear lever in a Lexus EV\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Z8S_9029-scaled.jpg\">Enlarge</a> <span>/</span> The Lexus UX300e is an electric crossover available in Europe, China, and Japan, but not usually with three pedals or a gear lever. (credit: Toyota)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside><span>Toyota provided flights from Newark, NJ, to Tokyo, Japan, and five nights in a hotel so we could attend the Japan Mobility Show plus subsequent briefings and test drives. Ars does not accept paid editorial content.</span></aside>\n<p>Electric cars do a lot of things well. They're smooth. They're quiet. They're easier on the environment, and they're even <a href=\"https://www.stuff.co.nz/motoring/news/104016920/driving-an-ev-makes-you-less-stressed-more-focused\">scientifically proven to be less stressful</a>. But what they don't tend to be is engaging, at least not in the way that <a href=\"https://arstechnica.com/cars/2023/02/the-final-shift-which-manual-transmission-will-be-the-last/\">a traditional car with three pedals and a stick shift</a> is.</p>\n<p>A manual car requires a lot more of the driver. That level of forced engagement brings with it a sort of focus that can make the simple act of driving a lot more fun. In an ideal world, it would be possible to layer that kind of engagement on top of the otherwise ideal EV experience.</p>\n<p>That is exactly what Toyota has done with what it calls the \"Manual BEV concept.\" Think of it as an EV that brings all the hands-on enjoyment of a manual transmission—despite lacking a manual transmission. It's something of a testbed to find ways to bring more fundamental driver enjoyment to the next generation of battery-powered electric vehicles, and after running a few laps around Toyota's test track in one, I'm convinced every sports-oriented EV in the future needs this.</p></div><p><a href=\"https://arstechnica.com/?p=1980015#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980015&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d9672d6f9259808ee834a2bb86c7817d3d1d0e5a6a7d6272aa553ca2d930c627","category":"Tech"}