{"title":"Direct-On-Filter Analysis of Airborne Engineered Nanomaterials using Correlative Microscopy and Spectroscopy","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.269/7719961?rss=1","date":1721779200000,"content":"<span>Engineered nanomaterials (ENMs) are used in a wide variety of applications especially high-performance products for aerospace, automobiles, sports equipment, and construction. The toxicity and adverse health effects of ENMs are likely a multifaceted function of their particle physical, chemical, and surface properties. Specific morphologies and spectroscopic features of airborne ENMs have been used as fingerprints for identifying materials and quantifying their exposures in occupational settings [<a href=\"#ozae044.269-B1\">1</a>, <a href=\"#ozae044.269-B2\">2</a>]. Scanning Electron microscopy (SEM) is known for its capabilities for conducting size-specific measurements in micro and nanoscales and elemental determination by using Energy Dispersive Spectroscopy (EDS). With Raman becoming an important analytical tool for aerosol characterization [<a href=\"#ozae044.269-B1\">1</a>] and recent development of Optical Photothermal Infrared (O-PTIR) spectroscopy [<a href=\"#ozae044.269-B3\">3</a>], there’s a growing need to combine these structural and micro-molecular techniques with conventional surface imaging and elemental analysis performed by using SEM-EDS. Images and spectroscopic information obtained from different scales across multiple instruments are often very complementary for correlative measurements of the same regions of interest (ROI). However, achieving high accuracy and simplicity of co-localized observation across different instruments has been a key challenge.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"d971a931d1a1590e64cbf13ad51332c508ee3899c3ff23adf3fd39881239bb6e","category":"Environment"}