{"title":"Safari 15 Users Say New Tab Design is Counterintuitive","link":"https://www.macrumors.com/2021/10/04/safari-15-tab-design-complaints/","date":1633370705000,"content":"Safari 15's controversial new design on the Mac has led to complaints about the way the browser indicates which tab is active.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/safari-15-tabs.jpg\" />\r\n<br />\r\nAs illustrated <a href=\"https://daringfireball.net/2021/10/the_tragedy_of_safari_15_quote_unquote_tabs\">by <em>Daring Fireball</em>'s John Gruber</a>, there was never any ambiguity about which tab is active in previous versions of Safari, with an active tab shown with lighter shading that matches the browser's toolbar.\r\n<br />\r\n\r\n<br />\r\nIn Safari 15, however, tabs have a new button-like design with a rounder and more defined appearance. Apple has also inverted its shading of tabs, with an active tab now having darker shading and inactive tabs having lighter shading. The change has annoyed Gruber and other users, as evidenced by <a href=\"https://www.reddit.com/r/apple/comments/q098o1/anyone_else_annoyed_by_how_safari_15_indicates/\">this Reddit thread</a> with nearly 1,000 upvotes.\r\n<br />\r\n\r\n<br />\r\n\"The design is counterintuitive,\" wrote Gruber. \"What sense does it make that no matter your settings, the active tab is rendered with less contrast between the tab title and the background than background tabs? The active tab should be the one that pops.\"\r\n<br />\r\n\r\n<br />\r\nIn a Safari 15 window with two tabs open, especially from the same website, Gruber said determining which tab is active is basically a guessing game. Gruber acknowledged that it is easier to discern the active tab when more than two tabs are open, but he said the confusion with exactly two tabs should have been reason enough to scrap the design change.\r\n<br />\r\n\r\n<br />\r\n\"I can't tell you how many times I closed the tab that I needed because of this,\" one Reddit user expressed in frustration.\r\n<br />\r\n\r\n<br />\r\nUnfortunately for users who do not like the new design, Apple has not made any changes to the shading of tabs in either the <a href=\"https://www.macrumors.com/2021/10/01/safari-15-1-beta-for-macos-now-available/\">Safari 15.1 beta</a> or the latest version of the experimental Safari Technology Preview browser.<div>Tag: <a href=\"https://www.macrumors.com/guide/safari/\">Safari</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/04/safari-15-tab-design-complaints/\">Safari 15 Users Say New Tab Design is Counterintuitive</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/safari-15-users-say-new-tab-design-is-counterintuitive.2315360/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=h9Sem34Lt9w:fm3E-bZkIyE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=h9Sem34Lt9w:fm3E-bZkIyE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/h9Sem34Lt9w\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d9732f1f6524154262b6b48c91310e20f4c388875834abff6d4d805f4e1e7e8c","category":"Apple"}