{"title":"Thermal refugia reinforce macroalgal resilience against climate change in the southeastern Bay of Biscay","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17481?af=R","date":1724137200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/61ade71d-c15c-464e-a8ab-6ae72949b661/gcb17481-toc-0001-m.png\" alt=\"Thermal refugia reinforce macroalgal resilience against climate change in the southeastern Bay of Biscay\" />\n<p>Understanding how marine ecosystems respond to global warming is crucial for their protection. We studied subtidal macroalgal communities in the southeastern Bay of Biscay for over 30 years. By estimating the thermal traits of hundreds of species, we analyzed how temperature influenced community dynamics. Warm-affinity species replaced cold-affinity species, leading to a tropicalization of the ecosystem. Yet, some areas acted as refugia, with few changes over 30 years. Our study found that temperature drove this shift, with macroalgal communities reacting quickly to changes in sea surface temperature. Identifying and protecting refugia is vital for maintaining ecosystem stability amid climate change.</p>\n<br />\n<h2>Abstract</h2>\n<p>Rising global temperatures present unprecedented challenges to marine ecosystems, demanding a profound understanding of their ecological dynamics for effective conservation strategies. Over a comprehensive macroalgal assessment spanning three decades, we investigated the spatiotemporal evolution of shallow-water benthic communities in the southern Bay of Biscay, uncovering climate-resilient areas amidst the ongoing phase shift in the region. Our investigation identified seven locations serving as potential climate refugia, where cold-affinity, canopy-forming macroalgal species persisted and community structure was similar to that observed in 1991. We unveiled a clear association between the emergence of these refugia, sea surface temperature (SST), and the Community Temperature Index, positioning SST as a significant driver of the observed phase shift in the region. Warming processes, defined as tropicalization (increase of warm-affinity species) and deborealization (decrease of cold-affinity species), were prominent outside refugia. In contrast, cooling processes, defined as borealization (increase of cold-affinity species) and detropicalization (decrease of warm-affinity species), prevailed inside refugia. Refugia exhibited approximately 35% lower warming processes compared to non-refuge areas. This resulted in a dominance of warm-affinity species outside refugia, contrasting with the stability observed within refugia. The persistence of canopy-forming species in refuge areas significantly contributed to maintaining ecosystem diversity and stability. These findings underscored the pivotal role of climate refugia in mitigating climate-driven impacts. Prioritizing the protection and restoration of these refugia can foster resilience and ensure the preservation of biodiversity for future generations. Our study illustrates the importance of refining our understanding of how marine ecosystems respond to climate change, offering actionable insights essential for informed conservation strategies and sustainable environmental management.</p>","author":"O. Arriaga, \nP. Wawrzynkowski, \nN. Muguerza, \nI. Díez, \nJ. González, \nJ. M. Gorostiaga, \nE. Quintano, \nM. A. Becerro","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"d97f652d1177d37f7e7b5f0371ab9372555bef133229d18ee297fe7fe4a2ef6b","category":"Environment"}