{"title":"Latitudinal variation in seagrass communities with special emphasis on post-tsunami status in the Andaman and Nicobar archipelago, India","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300654","date":1710943200000,"content":"<p>by Swapnali Gole, Nehru Prabakaran, Sumit Prajapati, Sohini Dudhat, Himansu Das, Sivakumar Kuppusamy, Jeyaraj Antony Johnson</p>\r\n\r\nWe studied spatial variation in seagrass communities in the Andaman and Nicobar archipelago (ANI), India using latitude as a surrogate variable. We classified the ANI into five latitudinally distinct island groups: North &amp; Middle Andaman, Ritchie’s archipelago, South Andaman, Little Andaman, and the Nicobar archipelago. We evaluated the Importance Value Index (IVI) for species to determine the ecologically dominant seagrasses within each Island group. Later, we related our findings to investigate the three decadal pre- and post-tsunami status of seagrass habitats in the ANI which were severely impacted by the Indian Ocean tsunami of 2004. Six of the 11 observed species, such as <i>Halophila ovalis</i>, <i>Halophila beccarii</i>, <i>Halophila minor</i>, <i>Halodule pinifolia</i>, <i>Thalassia hemprichii</i>, and <i>Cymodocea rotundata</i>, dominated the seagrass population among all island groups. Seagrass composition significantly varied across the five investigated latitudinal gradients. Seagrass communities in ’Ritchie’s Archipelago and Nicobar’ and ’South Andaman and Little Andaman’ revealed the highest and lowest variation. Further, Ritchie’s Archipelago and Nicobar had the highest species richness (n = 10), followed by North &amp; Middle Andaman (n = 8), and the lowest in South and Little Andaman (n = 6). Despite similar species richness and composition, Nicobar contributed to the highest seagrass coverage compared to the lowest recorded in the Ritchie’s Archipelago. Our observations on the re-colonization of disturbed areas by early successional and historical species suggest recovery of the seagrass population in the ANI post-disturbance. Lastly, co-variates associated with latitude as a surrogate warrant further investigation.","author":"Swapnali Gole","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d980b5eac837b33a691d058714a810863e9b16e3911a55751cab120705c75eab","category":"Interdisciplinary"}