{"title":"After 6 long months, an Android phone finally cloned the iPhone 14","link":"https://arstechnica.com/?p=1922987","date":1678400052000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/1631563827077185536.jpg\" alt /></div>\n          <p>\n            The first dynamic island clone. They're actually proud of this.                           [credit:\n                              Realme                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>A hearty congratulations to Android manufacturer Realme for being the first to clone the iPhone 14's <a href=\"https://arstechnica.com/gadgets/2022/09/iphone-14-and-14-pro-review-a-picture-is-worth-a-thousand-dollars/3/\">Dynamic Island</a>. It was a rough six months, but everyone at the Chinese OEM (a subsidiary of BBK, same as OnePlus/Oppo) pulled together and made this generic product.</p>\n<p>The Realme C55 launched in Indonesia for around $195 and features a new \"Mini Capsule\" UI. When it's time to show a specific type of notification, this phone has two black bars that shoot out from the front camera lens, displaying more info than you'd normally get in a single status bar icon. It looks just like the iPhone 14's new Dynamic Island notification space. While iPhone's display dead space is due to it housing a bunch of FaceID sensors, there's no new hardware here (that will take a bit longer to copy), just a normal front-facing camera that turns into a giant pill.</p>\n<p>Apple's end-to-end control over the OS and app ecosystem means all sorts of apps use the Dynamic Island notification motif, but Realme is just an Android manufacturer that makes an Android skin, so it looks like the <a href=\"https://c.realme.com/global/post-details/1631563142717833216\">only actual notification</a> that shows up in the \"Mini Capsule\" is your battery status. Plug the phone in and you'll see some charging stats. With a low battery, the pill will get a red outline and warn you your phone's about to die. Realme also has plans for an update that will show a step counter and data usage.</p></div><p><a href=\"https://arstechnica.com/?p=1922987#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1922987&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d984f711fc68cec4ffa8952724ffc89eaebb4a9a72271fdab71070","category":"Tech"}