{"title":"New 2D Super Mario Bros. Wonder, RPG remake lead Nintendo Direct reveals","link":"https://arstechnica.com/?p=1949137","date":1687364602000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-21-at-11.18.37-AM-800x419.png\" alt=\"Super Mario in elephant form\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-21-at-11.18.37-AM.png\">Enlarge</a> <span>/</span> Are you going to enjoy playing <em> Super Mario Bros. Wonder</em>? It might help if you gauge your reaction to shiny, moustache-under-the-trunk Elephant Mario. (credit: Nintendo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The stinger, the bit Nintendo knew everybody was going to remember, was Mario as an elephant. It could almost make you forget the surreal revisit to a traditional 2D Mario game the company had just finished showing you.</p>\n<div><div></div><p>My favorite video. </p></div>\n<p>The trailer for <a href=\"https://supermariobroswonder.nintendo.com/\"><em>Super Mario Bros. Wonder</em></a> starts off in familiar territory, minus the talking flower that urges Mario \"onward and upward!\" Mario hops over a pipe, onto some Goombas, and dodges a Piranha Plant. Then he's bouncing off some spherical hippos, past some Goombas that are...  wearing toupees? He does some rail grinding, jumps through some waterfalls—typical Mario things.</p>\n<p>But then he touches a blue \"Wonder Flower,\" reflective goo starts pulsing around the corners of the screen, and a typical pipes-and-baddies level goes bizarre. Pipes rise, spout water, and worm-wiggle around. Another level is all silhouettes against an ethereally purple background, but Mario can stretch himself five times as tall. Mario becomes a spiked ball. Mario rides a sheep stampede. It ends when Mario finds a Wonder Seed, and the Mushroom Kingdom looks relatively recognizable.</p></div><p><a href=\"https://arstechnica.com/?p=1949137#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949137&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d987c03d25c6d1db1a3cb8fa8f2e697363621edb99f2af75318db5d7c0003286","category":"Tech"}