{"title":"A Method to Assess and Explain Changes in Sub‐Daily Precipitation Return Levels From Convection‐Permitting Simulations","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035969?af=R","date":1716447600000,"content":"<h2>Abstract</h2>\n<p>Reliable projections of extreme future precipitation are fundamental for risk management and adaptation strategies. Convection-permitting models (CPMs) explicitly resolve large convective systems and represent sub-daily extremes more realistically than coarser resolution models, but present short records due to the high computational costs. Here, we evaluate the potential of a non-asymptotic approach, the Simplified Metastatistical Extreme Value (SMEV) to provide information on the future change of extreme sub-daily return levels based on CPM simulations. We focus on a complex-orography area in the North Eastern Italy and use three 10-year time periods COSMO-crCLIM simulations (2.2 km resolution) under RCP8.5 scenario. When compared to a block r-maxima approach currently used in similar applications, the proposed approach shows reduced uncertainty in rare return level estimates (about 5%–10% smaller confidence interval) and can improve the quantification of future changes from CPM simulations. We evaluate these changes and their statistical significance in return levels for 1–24 hr durations. The changes show an interesting spatial organization associated with orography, with significant positive changes located at high elevations. These positive changes tend to increase with increasing return period and decreasing duration. Because SMEV can separate the roles of event intensity and occurrence, it allows for physical interpretations of these changes. We suggest that non-asymptotic approaches permit the quantification of change in rare extremes within available CPM runs.</p>","author":"Eleonora Dallan, \nMarco Borga, \nGiorgia Fosser, \nAntonio Canale, \nBardia Roghani, \nMarco Marani, \nFrancesco Marra","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"d9882e71d997f6c21e8309a18a237eca6aa69d2da463cc762ad6b8dfafa5983f","category":"Environment"}