{"title":"Coherent long‐term body‐size responses across all Northwest Atlantic herring populations to warming and environmental change despite contrasting harvest and ecological factors","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17187?af=R","date":1709888358000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/4bce34f8-7e6a-4211-8d74-01403a123852/gcb17187-toc-0001-m.png\" alt=\"Coherent long-term body-size responses across all Northwest Atlantic herring populations to warming and environmental change despite contrasting harvest and ecological factors\" />\n<p>Declining body size has been observed for numerous populations worldwide, but little is known of the combined roles of climate, harvest, and ecological factors in this trend. Using data on length-at-age on sixteen herring populations in the Northwest Atlantic, we demonstrate that coherent responses to warming and some large-scale environmental influence can explain most of the size variation experienced over more than five decades, despite variation over time and among populations in key factors such as fishing pressure. Our study raises important questions concerning the potential for short-term management action on size, a key aspect of productivity and ecological functioning.</p>\n<br />\n<h2>Abstract</h2>\n<p>Body size is a key component of individual fitness and an important factor in the structure and functioning of populations and ecosystems. Disentangling the effects of environmental change, harvest and intra- and inter-specific trophic effects on body size remains challenging for populations in the wild. Herring in the Northwest Atlantic provide a strong basis for evaluating hypotheses related to these drivers given that they have experienced significant warming and harvest over the past century, while also having been exposed to a wide range of other selective constraints across their range. Using data on mean length-at-age 4 for the sixteen principal populations over a period of 53 cohorts (1962–2014), we fitted a series of empirical models for temporal and between-population variation in the response to changes in sea surface temperature. We find evidence for a unified cross-population response in the form of a parabolic function according to which populations in naturally warmer environments have responded more negatively to increasing temperature compared with those in colder locations. Temporal variation in residuals from this function was highly coherent among populations, further suggesting a common response to a large-scale environmental driver. The synchrony observed in this study system, despite strong differences in harvest and ecological histories among populations and over time, clearly indicates a dominant role of environmental change on size-at-age in wild populations, in contrast to commonly reported effects of fishing. This finding has important implications for the management of fisheries as it indicates that a key trait associated with population productivity may be under considerably less short-term management control than currently assumed. Our study, overall, illustrates the need for a comparative approach within species for inferences concerning the many possible effects on body size of natural and anthropogenic drivers in the wild.</p>","author":"Manuelle Beaudry‐Sylvestre, \nHugues P. Benoît, \nJeffrey A. Hutchings","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"d988771fd3c2c3eaa69a65329bced56c7dd502d334f77b7c6053a6cef1c4d016","category":"Environment"}