{"title":"Game changers | 12 innovations that changed road cycling","link":"https://www.bikeradar.com/features/cycling-innovations/","date":1623321000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/10/20200929_SB_5DSR_MG_3259-4c28ee8.jpg?quality=45&amp;resize=620,413\" />                                            <p>In many ways, the bicycle is largely unchanged since the late 19th century. But along the way, there have been numerous technological developments that have changed road cycling and the way we ride – many of which are still with us today.</p>\n<p>Here we’ll look at the top inventions that have changed the art of cycling for the better, and alongside the older tech that has come to define the bikes we ride today, we have also included more recent innovations that will continue to shape the sport in the future.</p>\n<p>Cycling tech is always evolving and, in a short space of time, these innovations have already changed the sport – and are set to become even more commonplace in the years to come.</p>\n<h2>1. Quick-release skewers</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Quick-release skewers made for quicker wheel changes in races and easier repairs.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>From one slice of misfortune, an empire was built. When Italian racing cyclist Tullio Campagnolo found himself struggling in a race in the cold back in 1927 after being unable to remove his rear wheel due to numb hands, he vowed to come up with a better system than wingnuts for holding the wheel in place.</p>\n<p>Three years later he had designed the <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-axle-standards/\">quick-release skewer</a>. The original design was not much different to the ones we use today: a steel skewer through a hollow axle with a nut at one end and a cam lever at the other.</p>\n<p>Just like today, flipping the lever allowed the wheel to be removed and replaced in a fraction of the time it had previously taken. For the pros, this meant speedy mid-race changes. For the rest of us, quicker and easier roadside repairs, even if thru-axles are now becoming commonplace on road bikes with disc brakes.</p>\n<h2>2. Clipless pedals</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Look still leads the clipless pedal game, alongside the likes of Shimano and Speedplay.</span></figcaption><span> <i>James Huang/Future Publishing</i></span></div>\n<p>In 1984, Look launched the first successful <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">clipless pedals</a>. Called the PP65, the pedal utilised technology the French firm was already using in its ski bindings, to revolutionise the crucial component that delivers your power to the bicycle.</p>\n<p>So successful was the Look concept, using a cleat on the sole of the shoe that clips into a spring-loaded mechanism on the back of the pedal, that it has become an industry standard, with the great majority of clipless pedal systems from other companies resembling Look’s design – even if materials have changed in the last three decades.</p>\n<p>Earlier attempts at a toe-clip-free pedal were seen as unsafe for road use, but after Look changed the game – and Bernard Hinault won the 1985 <a href=\"https://www.bikeradar.com/official-tour-de-france-guide-2021/\">Tour de France</a> on his PP65s – we never looked back.</p>\n<h2>3. Carbon fibre</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can even get carbon fibre spokes, like on these Cadex wheels.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>If the first major weight savings in bicycle manufacture came with the introduction of aluminium frame tubing and wheel rims (as we’ll come on to), it was the rise of carbon fibre technology that really kicked the weight weenie phenomenon into overdrive.</p>\n<p>That lightness has also enabled time trial and, increasingly, road bikes to chase aero gains without suffering too much of a weight penalty and as many modern bikes are built from one-piece moulds, weights have fallen further.</p>\n<p>The same technology of using carbon fibres to reinforce polymers has since been applied to handlebars, seatposts, wheels, pedals and saddles. In short, pretty much everything.</p>\n<p>The result is a bike such as the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/2021-giant-tcr-advanced-sl-0-disc-review/\">Giant TCR Advanced SL 0 Disc</a> that even in a size large and with bottle cages weighs a UCI-bothering 6.71kg.</p>\n<h2>4. GPS computers</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> GPS cycling computers have probably changed cycling more than any other tech in recent years.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>It could well be argued that the cycle computer itself changed the face of cycling, giving us an increasing amount of information from speed through to heart rate at our fingertips. But the introduction of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">GPS bike computer</a> has taken things to a whole new level to the point where riding without one is almost a statement.</p>\n<p>The giant on the scene is Garmin, which launched the first in its series of Edge cycle computers back in 2000, though Wahoo has since challenged Garmin’s title.</p>\n<p>Not only can GPS devices track a wealth of ride information without the need for a magnet on your wheel and sensor on your fork, but by linking to the internet they enable you to share that data.</p>\n<p>Since the arrival of Strava, this has made every ride a competitive ride for those who are so inclined to competing – with others or their own previous times – on segment leaderboards.</p>\n<p>GPS technology also allows for many cycling computers to act as navigators, meaning we can plot or download routes on our computers and then follow them without getting lost. Hopefully.</p>\n<h2>5. Electronic groupsets</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Electronic gears are becoming more mainstream, thanks to the technology trickling down to more affordable groupsets.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Despite Mavic’s dalliance with the concept in the 1990s, with its Zap and Mektronic systems, it was the arrival of Shimano’s Dura-Ace Di2 in 2009 that brought electronic shifting into the mainstream.</p>\n<p>Since debuting at the 2009 Tour of California, <a href=\"https://www.bikeradar.com/advice/workshop/shimano-di2-setup/\">Shimano Di2</a> technology has trickled down to the company’s second-tier Ultegra groupset and increasingly comes as standard on bikes at around the £4,000 mark.</p>\n<p>Electronic groupsets have since launched from SRAM and Campagnolo, and are also commonplace now, with more affordable groupsets like <a href=\"https://www.bikeradar.com/news/sram-rival-axs/\">SRAM Rival AXS</a> opening up the world of electronic shifting to many more people.</p>\n<p>The ease and precision of an electric gear change are hard to beat, and for the less mechanically minded among us, so is the minimal maintenance. No more gear cables? Yes, please.</p>\n<h2>6. Pneumatic tyres</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Will clinchers and tubes remain the go-to choice or will tubeless setups reign supreme?</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>It is inconceivable in the modern age, but there was a time when cyclists rolled – or rather bumped – around on what were little more than refined wagon wheels with iron bands wrapped around wooden wheels.</p>\n<p>Solid rubber would replace metal, but progress really began when John Dunlop designed a pneumatic tyre to be filled with air in 1887. His Dunlop Tyre Co soon followed and the world’s cyclists thanked him as increased speed and comfort became the norm.</p>\n<p>Across the English Channel, one Édouard Michelin came up with the idea of the removable tyre in 1891 that would allow for the removal and repair of a separate <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a>. The clincher tyre most of us ride today was effectively born.</p>\n<p>Manufacturers have since improved puncture resistance and developed the hook bead to allow tyres to run at higher pressures, but essentially they are refining the design rather than reinventing it.</p>\n<p>What about <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tubeless-road-tyres/\">tubeless tyres</a>, you may ask? It is true that in recent years more and more cyclists are choosing <a href=\"https://www.bikeradar.com/features/how-to-set-up-road-tubeless-tyres/\">tubeless setups for their road bikes</a>, and even some professional teams – who are often slow to give up what they hold dear – are making the switch. But as BikeRadar’s Matthew Loveridge found, the lack of standardisation within the world of tubeless means <a href=\"https://www.bikeradar.com/features/tubeless-tyres-pro-peloton/\">the takeover hasn’t quite arrived</a>.</p>\n<p>If and when it does, will the shift be as significant as going from refined wagon wheels to clinchers and tubes? We’ll let you decide that one.</p>\n<h2>7. STI levers</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> STI shifters have come a long way since their early days but functionally they remain very similar.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>The arrival of Shimano’s STI (Shimano Total Integration) system in 1990 heralded one of the most fundamental changes in race bike design we have ever seen.</p>\n<p>The passing years have added a sepia-tinged sheen to the days of down-tube shifting, but the reality is that the birth of integrated braking and shifting levers changed the way we ride for the better.</p>\n<p>Not only did their arrival end the need for riders to remove their hands from the bars to shift gear, but they also led to a redesign of the brake lever hoods, making them ergonomically more comfortable for spending hours riding on.</p>\n<p>Developments over the years have seen weight reduced and function refined to cater for a larger spread of gears, but both Campagnolo and SRAM offer their own takes on the original system, and with the increasing electrification of <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a> there has been no looking back.</p>\n<h2>8. Aluminium wheel rims</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> It wasn’t long ago that aluminium rims were still being used in the professional peloton.</span></figcaption><span> <i>James Huang</i></span></div>\n<p>Just as steel frames were replaced with aluminium frames for a reduction in weight, so too were steel rims on bike wheels replaced with the lighter metal – a technological revolution introduced by Mavic with its Duralumin rims in the 30s.</p>\n<p>Carbon fibre wheels are becoming more prevalent and affordable, with brands now including carbon wheels as standard on many stock bikes. Carbon rims lag behind their aluminium counterparts when it comes to braking efficiency, but the rise of <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">disc brakes on road bikes</a> has, by and large, made this a redundant point.</p>\n<h2>9. Lycra</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> High-stretch, Lycra shorts have become the go-to choice for many road cyclists.</span></figcaption><span> <i>Alé</i></span></div>\n<p>There may well be a trend towards lightweight specialist woollen jerseys these days, but the liberation of cyclists from the woollen kit of old due to the invention and adoption of Lycra should not be underestimated.</p>\n<p>Lighter, more breathable and tighter fitting than its natural predecessor, Lycra cycling kit has become the go-to for many cyclists. Lycra <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">cycling shorts</a> are an essential piece of kit for many cyclists, while aerodynamic and close-fitting <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-jerseys/\">cycling jerseys</a> that reduce drag and often work to wick away sweat have become standard.</p>\n<p>Lycra also opened up the possibility of all-in-one skinsuits for time trials and circuit races, and many professional riders wear these at stage races too.</p>\n<p>Material developments in road cycling kit aren’t just limited to Lycra. Time has also seen the traditional chamois leather in the seat of cycling shorts replaced by comfier, more hygienic synthetic padding.</p>\n<h2>10. Derailleur gears</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Derailleur systems have remained practically the same since the 1980s.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>The advent of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a> system transformed cycling, enabling riders to shift the chain between a set of sprockets to provide an ever-widening range of gears. As the system has been refined, almost all roads have become accessible.</p>\n<p>The early stirrings of rudimentary derailleur systems began in the 19th century, with cyclo-tourists devising systems that enabled them to change gear on the rear wheel by lifting the chain from sprocket to sprocket with a long rod.</p>\n<p>Real progress arrived with the introduction of the cable-shifted parallelogram derailleur in the early 20th century, and by 1937 the days of Tour de France riders having to flip their back wheels to change gear for the mountains were gone.</p>\n<p>The introduction of indexed gears by Shimano in the 1980s, which allowed for quicker shifting, and electronic groupsets in the 2000s, has been the major advance in what essentially remains the same system at its most basic level.</p>\n<h2>11. Hydraulic disc brakes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> On a disc brake bike, the rotor, which is a separate component that is fixed to the hub, provides the braking surface.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Few road bike developments in recent years have caused as much of a stir as hydraulic disc brakes. Mountain bikers were quick to adopt disc brakes for the increased stopping power but many roadies weren’t so keen to give up their beloved rim brakes, adopting an “if it ain’t broke don’t fix it” approach.</p>\n<p>Colnago was the first brand to put disc brakes on a road bike in 2012, collaborating with Formula to create the <a href=\"https://www.bikeradar.com/news/colnago-launch-c59-disc/\">Colnago C59 Disc</a>. The following year, SRAM unveiled its <a href=\"https://www.bikeradar.com/news/sram-red-22-11-speed-hydraulic-mechanical-group-full-details/\">HRD disc groupset</a> and Shimano launched <a href=\"https://www.bikeradar.com/news/shimano-dura-ace-di2-11-speed-and-disc-brakes-for-2013/\">disc brakes for its Ultegra groupset</a>. Back then, disc brakes weren’t allowed in road races so there was little point in introducing a disc-specific Dura-Ace groupset.</p>\n<p>Fast-forward a few years and many non-competitive cyclists had embraced the improved braking performance of hydraulic disc brakes as well as the other opportunities discs opened up, such as increased tyre clearance and keeping brake blocks away from carbon rims.</p>\n<p>Now, most bike brands have shifted towards designing road bikes with hydraulic disc brakes, and some have stopped manufacturing rim brake bikes altogether. Despite some purists still sticking to the rim brake, the tide has undoubtedly turned.</p>\n<h2>12. Power meters</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> SRM secured the first patent for a crank-based power meter in 1987.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>In 1987 a patent was awarded to Ulrich Schoberer, founder of SRM, for the first crank-based power meter on a bicycle. By the early 1990s, the technology had begun to make its way into the professional ranks, with early adopters including Greg LeMond and the German national team.</p>\n<p>The advantages to riders were the same then as they are now: being able to get quick and reliable insight into how you are performing on the bike.</p>\n<p>Power is the most accurate metric for measuring performance because it tells you the workload you are putting out, regardless of external factors such as headwind and gradient, and will allow you to reliably track your progress over time.</p>\n<p>As <a href=\"https://www.bikeradar.com/features/best-power-meters-9-tested/\">power meters</a> have developed, they can now measure power output from different parts of the bike, including the pedals, but the most common position for a power meter is – like the earliest SRM patent – on the cranks.</p>\n<p>Like much cycling tech, over the years power meters have also become more affordable. And, with the availability of training apps, power meters have become more widely adopted by riders wanting to use data to improve their fitness</p>\n<p><em>What would you include in your list of road cycling innovations? Is there anything we’ve missed or have we included something that you don’t think is worthy of a top spot? Let us know in the comments below.</em></p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d997e107cf846dcabcd5bdfa0bb8ee8dddcd35d12c77b94db9bf8d885914b24a","category":"Cycling"}