{"title":"Apple busts prolific Twitter leaker Analyst941, so be careful what you believe","link":"https://www.macworld.com/article/1816449/leaker-analyst941-twitter-busted-apple-sting-operation.html","date":1683741937000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We’re happy to tell you about the latest rumors for various Apple products and services here at Macworld, but we always remind you of the caveat: Be careful what you believe. Some rumors are well-founded, some are made up, and some are correct at the time but Apple’s plans change. We do our best to remind you that such information is only a rumor and not present it as fact, and to identify and link to the original source as often as possible.</p>\n\n\n\n<p>Case in point: Apple has busted <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941&amp;xcust=1-1-1816449-1-0-0&amp;sref=https://www.macworld.com/feed\">@analyst941</a>, which has dropped a lot of leaks lately about iOS 17 and other upcoming Apple releases. The leaker has deleted their Twitter account and left a farewell message explaining what happened on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/&amp;xcust=1-1-1816449-1-0-0&amp;sref=https://www.macworld.com/feed\">MacRumors forums</a>, where they go by “anonymous-A-S.”</p>\n\n\n\n<p>In the message, the leaker describes how Apple found them out. Over time, Apple gave a different set of false information about upcoming products to various employees suspected of being the source of leaks. It looks like @analyst941’s sister, an Apple employee, got specific supposed release dates for <a href=\"https://www.macworld.com/article/1814473/final-cut-logic-pro-ipad-subscription-launch.html\">Final Cut Pro and Logic on iPad</a>. The combination of release dates they posted–Final Cut Pro coming in 2024 and Logic in 2025–was unique to his sister, and the source of the leaks thus identified.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Anonymous Macrumors\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?quality=50&amp;strip=all 1774w, https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?resize=300%2C260&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?resize=768%2C665&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?resize=1200%2C1039&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/macrumors-forums-anonymous.jpg?resize=1536%2C1330&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"1039\" /><figcaption>Anonymous-A-S left this farewell message explaining the situation on the MacRumors forums.</figcaption></figure><p>MacRumors forums</p></div>\n\n\n\n<h2>Be careful what you believe</h2>\n\n\n\n<p>Apple is a famously secretive company that goes to great lengths to protect its upcoming projects from the outside world. This includes not only serious security and legal measures for its employees and suppliers, but almost certainly also operations to “poison the well” with false information, strategic planted “leaks” to gauge fan response, and situations like this one where unique false information is given to suspected leakers inside the company in order to help identify them. Famously, one of the original Apple rumor sites, Think Secret, was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macobserver.com/tmo/article/apple_subpoenas_mac_rumor_sites_over_audio_product&amp;xcust=1-1-1816449-1-0-0&amp;sref=https://www.macworld.com/feed\">forced to shut down</a> and faced a lawsuit after publishing a planted leak about a Firewire audio box.</p>\n\n\n\n<p>So whenever you read an Apple rumor–here or anywhere else–carefully consider the source and its track record. In this case, @analyst941 first made a name for themselves by leaking correct information about the <a href=\"https://www.macworld.com/article/1069195/iphone-14-pro-dynamic-island-features-apps.html\">Dynamic Island</a> prior to the iPhone 14 Pro launch last year. </p>\n\n\n\n<p>This year, they <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">detailed a bunch of features about iOS 17</a>, many of which found their way into our own rumor roundups. This leaker getting busted both validates those prior leaks (they had a real inside source) and calls them into question (some of the info may be deliberately wrong as part of Apple’s sting operation). In all honestly, we’ll probably never know if this story is true either.</p>\n\n\n\n<p>We’ve said it before and we’ll say it again: It is best to assume is actually true until Apple officially announces it. We’ve seen too many seemingly reliable rumors turn out wrong or simply never materialize. According to typically reliable sources, the 15-inch MacBook Air was originally going to be released at a March event (there wasn’t one), and then in April (which came and went), and is now supposed to be announced and ship at WWDC in June. </p>\n\n\n\n<p>Those rumors came from often-accurate sources, but they still never came to pass, either because they had bad information or because Apple’s plans shifted. And ultimately, it just leads to disappointment.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"d99d2abf2d73b4cb0325be904e686ecfcccd6c6503c6a745b00655d0a9bcff0e","category":"Apple"}