{"title":"Analysis of Emergency Services on Patient Satisfaction with Social Security Administration Agency","link":"https://www.preprints.org/manuscript/202409.1214/v1","date":1726534586000,"content":"This study aims to understand the role of BPJS Kesehatan as a variable that mediates or mediates the relationship between emergency services and patient satisfaction. This can include how administrative processes, access to services, or costs incurred by BPJS affect the relationship between service and satisfaction. Quantitative studies of a correlational nature are a part of this investigation. In order to forecast endogenous variables (Y) Purchase decisions, researchers conduct correlational studies, which examine the link between one or more variables and other factors. Here, X represents emergency services, Y stands for patient satisfaction, and M for BPJS are the exogenous variables. The purpose of this research is to examine the role of BPJS as a moderator between the impact of emergency services on patients' levels of satisfaction. There were 120 people that filled out the survey, and the margin of error was 10% (based on a 90% truth rate and a 10% error rate). Purposive sampling was used to select participants for the aforementioned studies. Warppls 8.0 and the Warp Partial Least Square program were utilized for data analysis in this investigation. The study found that PKD significantly and positively affected 71% of participants' happiness with the impact they received. With a 63% influence, PKD has a favorable and statistically significant effect on BPJS. Patient satisfaction is significantly impacted by BPJS, which has a favorable association. When looking at the connection between community satisfaction and emergency services, BPJS is a key mediator. Community satisfaction can be enhanced through the provision of fast and excellent emergency services, and BPJS plays a vital role in mediating this relationship. The beneficial effect of emergency services on community satisfaction can be amplified if BPJS is able to offer sufficient coverage while simultaneously reducing costs and expediting administrative processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"d9a29972da87aee5dabd8b6b1e80d6adc6a003fd2daa80a5c4cdc2820b70ea5c","category":"Interdisciplinary"}