{"title":"Apple Releases watchOS 10.4 With Fix for Ghost Touch Bug","link":"https://www.macrumors.com/2024/03/07/apple-releases-watchos-10-4/","date":1709835233000,"content":"Apple today released watchOS 10.4, the fourth update to the <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a> operating system that was <a href=\"https://www.macrumors.com/2023/09/18/apple-releases-watchos-10/\">released in September</a>. watchOS 10.4 comes over a month after watchOS 10.3, <a href=\"https://www.macrumors.com/2024/01/22/apple-releases-watchos-10-3/\">a minor update</a> that brought a new watch face.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/watchOS-10-Launch-Feature.jpg\" width=\"2560\" height=\"1440\" />\r<br />\n‌‌watchOS 10‌‌‌.4 can be downloaded for free through the Apple Watch app on an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> running <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> or later by opening it up and going to General &amp; Software Update. To install the new software, the Apple Watch needs to have at least 50 percent battery and it needs to be placed on a charger.\r<br />\n\r<br />\nwatchOS 10.4 adds support for <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-adds-new-emoji/\">new emoji characters</a> that were also added to the ‌iPhone‌, including lime, edible brown mushroom, phoenix, broken chain, shaking head vertically (as in a \"yes\" nod), and shaking head horizontally (a \"no\" head shake).\r<br />\n\r<br />\nThere is also a Setting to disable the Double Tap feature on Apple Watch when using Vision Pro, and an option to double tap to show an expanded notification. Apple also included a fix for a bug that could cause some users to <a href=\"https://www.macrumors.com/2024/02/10/apple-watch-series-9-ultra-2-touch-screen-issue/\">experience \"ghost touches\" on the display</a>, a problem that was affecting the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a> and Ultra 2.\r<br />\n\r<br />\nApple's release notes for the update are below:<blockquote>watchOS 10.4 includes new features, improvements, and bug fixes, including:\r<br />\n- Tap to Show Full Notification setting now allows you to double tap to expand the notification\r<br />\n- Using Apple Pay with Confirm with AssistiveTouch will require a passcode for additional security and will not support double clicking the side button\r<br />\n- Resolves an issue that causes some users to experience false touches on the display\r<br />\n- Fixes an issue that prevents contacts from syncing to Apple Watch for some users\r<br />\n\r<br />\nFor information on the security content of Apple software updates, please visit this website: https://support.apple.com/kb/HT201222</blockquote>\r<br />\nMore on the features that have been added in ‌watchOS 10‌ to date can be <a href=\"https://www.macrumors.com/roundup/watchos-10/\">found in our dedicated roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/07/apple-releases-watchos-10-4/\">Apple Releases watchOS 10.4 With Fix for Ghost Touch Bug</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-watchos-10-4-with-fix-for-ghost-touch-bug.2421309/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d9a454cddf6b047e7db4be686e8025129e48cf6a532d24c54c711a8487de160b","category":"Apple"}