{"title":"A 50 percent more efficient big rig? Meet Super Truck II","link":"https://arstechnica.com/?p=1979247","date":1698423890000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/5i8a5087-ret_rgb-800x534.jpg\" alt=\"A brightly colored tractor trailer drives on the highway\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/5i8a5087-ret_rgb-scaled.jpg\">Enlarge</a> <span>/</span> This is the Freightliner Super Truck II, the result of Daimler Trucks North America's work partly funded by the Department of Energy. (credit: Daimler Trucks NA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In America, we move most of our stuff by road—trucks carried almost five times as much cargo as trains in 2017, <a href=\"https://www.bts.gov/newsroom/2017-north-american-freight-numbers#:~:text=Trucks%20carried%2069.1%20percent%20of,%3B%20and%20pipeline%2C%200.7%20percent.\">according to the</a> Bureau of Transportation Statistics. While it's true that personal vehicles contribute the majority of our transport-related carbon emissions, <a href=\"https://www.cbo.gov/system/files/2022-12/58566-co2-emissions-transportation.pdf\">a quarter still comes from bigger trucks and buses</a>. When it comes to the biggest trucks on our roads—the Class 8 trucks that can pull up to 80,000 lbs (36.2 tonnes)—there's a lot of room for improvement, which is where Super Truck II comes in. The Department of Energy funded a challenge to double the efficiency of 18-wheeler trucks, and the big machine you see in the photos here is Freightliner's response.</p>\n<p>In fact, the story dates back to 2010 and the first DoE Super Truck program, <a href=\"https://www.oemoffhighway.com/trends/hybrids/article/10602353/doe-supertruck-program-updates\">which eventually funded four truck makers</a> (including Daimler Trucks, which owns Freightliner) to develop a heavy truck with 50 percent better efficiency than anything then in production.</p>\n<p>Super Truck II got going in 2017, a couple of years after the end of the first program. Having already demonstrated that big efficiency savings were possible, Super Truck II has been about developing them into something production-ready.</p></div><p><a href=\"https://arstechnica.com/?p=1979247#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979247&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d9aa972513f1f0e118bcf24897e6c9c56f1e9d2b77c1936cf0dd38055d96e1f4","category":"Tech"}