{"title":"BIKE COMMUTING AT -3F","link":"https://moots.com/bikecommutingat-3f/","date":1607031001000,"content":"<p>“Ride as much or as little, or as long or as short as you feel. But ride.”</p>\n<p>—Eddy Merckx<span></span></p>\n<p>Those are good words to live by as a diehard bike rider. Sometimes that simple short ride is a 3.75-mile commute to the Moots shop and this year we have been fortunate to hang on to fall/early winter without being clobbered by massive snows just yet. As the days are short, we look to pedal most anytime the opportunity presents itself. Commutes count in our book. The snows will come (they always do) but for now we are slowly being acclimatized to the cold.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/tempImageg14LPJ.jpg\" /></p>\n<p>Opposite of the sunrise image the moon goes down in the western sky.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/tempImage8Lo92x.jpg\" /></p>\n<p>The commuter rig set up:</p>\n<p>Psychlo X RSL, 1x eTap 11 speed, Challenge Grifo tires with just enough air in them to roll, amazing grip in cold snow. Insulated bottle for longer rides.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/tempImageHRv32D.jpg\" /></p>\n<p>Welcome to Moots. Arriving at the building after the cold commute all frosted up.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/tempImagetkYp8D.jpg\" /></p>\n<p>What do you wear when it’s -3F? My list:</p>\n<p>I start by what I’ll wear at the shop all day; denim jeans, cotton T-shirt and merino wool socks (yes, cotton kills) but for the 3.75mile trip it’s fine.</p>\n<p>Next I layer:</p>\n<p>Craft rain pants: I pull these over what I’m wearing as they provide wind block and trap my body heat.</p>\n<p>Primaloft Smartwool jacket: I got this at their factory sale and it does a good job of insulating the core.</p>\n<p>7MESH Launch Edition rain jacket: This traps body heat and breaks the wind well….durable as hell.</p>\n<p>Mavic GoreTex winter riding boots (mountain bike style). If you’ve never had a pair of winter riding boots and ride in the cold, get some!</p>\n<p>Mavic Helmet, well because you gotta protect the noodle. I use a Giro winter helmet insert to help block wind. I also use a Vermarc WindTex winter hat, which covers all the important tender skin on my head/ears and has a bill that helps when it’s snowing sideways.</p>\n<p>Neck gator (Moots logo of course), get it neck GATOR. <img src=\"https://s.w.org/images/core/emoji/13.0.1/72x72/1f609.png\" /></p>\n<p>Hands: Mavic lobster style mitts and on days like -3F, I add an over mitt (Camo) that I found in a Minnesota surplus store for $4. Czech Republic represent!</p>\n<p>Eye protection: The bigger the better. I’m using Oakley JawBreaker’s, easy to change to a clear lens for the night commute home. Nothing worse than having your eyelashes freeze together mid-commute.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/tempImageIeLH5a.jpg\" /></p>\n<p>Mitts, inside of mitts.</p>\n<p>Let us know about your commute on your Moots! It doesn’t have to be long, epic or even bitter cold. Hit me up at jonc at moots dot com to get your commute documented!</p>\n<p>The post <a href=\"https://moots.com/bikecommutingat-3f/\">BIKE COMMUTING AT -3F</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"d9b359fe213506334c487e90e65a461af911bff6a7f20c6e12291144e4d73210","category":"Cycling"}