{"title":"กสทช. อังกฤษสอบสวนผู้ให้บริการคลาวด์ ค่าส่งข้อมูลอออกแพงอาจมีผลเสียต่อการแข่งขัน","link":"https://www.blognone.com/node/133313","date":1680678850000,"content":"<div><div><div><p>Ofcom หรือกสทช. สหราชอาณาจักรประกาศผลการศึกษาตลาดคลาวด์ในประเทศ ที่ครองตลาดโดย AWS และ Azure โดยมี Google Cloud ตามมาห่าง และพบว่ามีหลายปัจจัยที่ส่งผลให้ตลาดไม่สามารถแข่งขันกันได้เต็มที่ โดยระบุถึงพฤติกรรมของผู้ให้บริการคลาวด์ 3 ประการ ได้แก่</p>\n<ul>\n<li>ค่าส่งข้อมูลออก (egress fee) ค่าบริการในการส่งข้อมูลออกจากคลาวด์นั้นแพงกว่าปกติมาก โดยเฉพาะในผู้ให้บริการคลาวด์รายใหญ่ระดับ hyperscaler ส่งผลให้ลูกค้าไม่อยากย้ายไปคลาวด์เจ้าอื่น</li>\n<li>ข้อจำกัดทางเทคนิค ความไม่เข้ากันของซอฟต์แวร์ที่ทำให้การทำงานข้ามคลาวด์ทำงานได้ยากขึ้น</li>\n<li>สัญญาการใช้งานคลาวด์ ที่ผู้ให้บริการคลาวด์มักเสนอส่วนลดเมื่อลูกค้าสัญญาว่าจะใช้บริการมากขึ้นถึงระดับหนึ่ง ทำให้ลูกค้าอยากใช้งานคลาวด์เจ้าเดียวกับทุกบริการแม้จะมีบางบริการที่คลาวด์เจ้าอื่นให้บริการได้ดีกว่า</li>\n</ul>\n<p>Ofcom ยังระบุว่าคลาวด์รายใหญ่นั้นมีสัดส่วนกำไรสูงมากพร้อมๆ กับส่วนแบ่งตลาดที่สูง สภาพนี้ทำให้น่ากังวลว่าผู้ให้บริการรายเล็กจะแข่งขันได้ยากขึ้นเรื่อยๆ</p>\n<p>ตอนนี้โครงการศึกษาเดินทางมาครึ่งทาง ทาง Ofcom จะเปิดรับฟังความคิดเห็นต่อผลการสอบสวนครั้งนี้ และเมื่อการศึกษาเสร็จสิ้น จะออกเป็นคำแนะนำถึงมาตรการต่างๆ ต่อไป กำหนดออกคำแนะนำภายในวันที่ 5 ตุลาคมนี้</p>\n<p>ที่มา - <a href=\"https://www.ofcom.org.uk/news-centre/2023/ofcom-proposes-to-refer-uk-cloud-market-for-investigation\">Ofcom</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/857ec640668a49730d5c9bde3d0beb50.png\" /></p>\n<p>ส่วนแบ่งตลาดคลาวด์ในสหราชอาณาจักรเมื่อปี 2021</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ofcom\">Ofcom</a></div><div><a href=\"/topics/cloud\">Cloud</a></div><div><a href=\"/topics/united-kingdom\">United Kingdom</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"d9dd17dc657e52e8483ba5242e35f4d5b1991a7c9495e9bd1c362c1d9eb9d764","category":"Thai"}