{"title":"Quantitative cross-species comparison of serum albumin binding of per- and polyfluoroalkyl substances from five structural classes","link":"https://academic.oup.com/toxsci/article/199/1/132/7633746?rss=1","date":1711065600000,"content":"<span><div>Abstract</div>Per- and polyfluoroalkyl substances (PFAS) are a class of over 8000 chemicals, many of which are persistent, bioaccumulative, and toxic to humans, livestock, and wildlife. Serum protein binding affinity is instrumental in understanding PFAS toxicity, yet experimental binding data is limited to only a few PFAS congeners. Previously, we demonstrated the usefulness of a high-throughput, <span>in vitro</span> differential scanning fluorimetry assay for determination of relative binding affinities of human serum albumin for 24 PFAS congeners from 6 chemical classes. In the current study, we used this assay to comparatively examine differences in human, bovine, porcine, and rat serum albumin binding of 8 structurally informative PFAS congeners from 5 chemical classes. With the exception of the fluorotelomer alcohol 1H, 1H, 2H, 2H-perfluorooctanol (6:2 FTOH), each PFAS congener bound by human serum albumin was also bound by bovine, porcine, and rat serum albumin. The critical role of the charged functional headgroup in albumin binding was supported by the inability of albumin of each species tested to bind 6:2 FTOH. Significant interspecies differences in serum albumin binding affinities were identified for each of the bound PFAS congeners. Relative to human albumin, perfluoroalkyl carboxylic and sulfonic acids were bound with greater affinity by porcine and rat serum albumin, and the perfluoroalkyl ether acid congener bound with lower affinity to porcine and bovine serum albumin. These comparative affinity data for PFAS binding by serum albumin from human, experimental model, and livestock species reduce critical interspecies uncertainty and improve accuracy of predictive bioaccumulation and toxicity assessments for PFAS.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"d9e0df4748c3c1d05129887f4ef2afb32f52a357d882260c92455592eecbe7fd","category":"Environment"}