{"title":"Analyze large amounts of graph data to get insights and find trends with Amazon Neptune Analytics","link":"https://aws.amazon.com/blogs/aws/introducing-amazon-neptune-analytics-a-high-performance-graph-analytics/","date":1701279424000,"content":"<p>I am happy to announce the general availability of <a href=\"https://aws.amazon.com/neptune/features/\">Amazon Neptune Analytics</a>, a new analytics database engine that makes it faster for data scientists and application developers to quickly analyze large amounts of graph data. With Neptune Analytics, you can now quickly load your dataset from <a href=\"https://aws.amazon.com/neptune/\">Amazon Neptune</a> or your data lake on <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>, run your analysis tasks in near real time, and optionally terminate your graph afterward.</p> \n<p>Graph data enables the representation and analysis of intricate relationships and connections within diverse data domains. Common applications include social networks, where it aids in identifying communities, recommending connections, and analyzing information diffusion. In supply chain management, graphs facilitate efficient route optimization and bottleneck identification. In cybersecurity, they reveal network vulnerabilities and identify patterns of malicious activity. Graph data finds application in knowledge management, financial services, digital advertising, and network security, performing tasks such as identifying money laundering networks in banking transactions and predicting network vulnerabilities.</p> \n<p>Since <a href=\"https://aws.amazon.com/blogs/aws/amazon-neptune-generally-available/\">the launch of <span>Neptune</span> in May 2018</a>, thousands of customers have embraced the service for storing their graph data and performing updates and deletion on specific subsets of the graph. However, analyzing data for insights often involves loading the entire graph into memory. For instance, a financial services company aiming to detect fraud may need to load and correlate all historical account transactions.</p> \n<p>Performing analyses on extensive graph datasets, such as running common graph algorithms, requires specialized tools. Utilizing separate analytics solutions demands the creation of intricate pipelines to transfer data for processing, which is challenging to operate, time-consuming, and prone to errors. Furthermore, loading large datasets from existing databases or data lakes to a graph analytic solution can take hours or even days.</p> \n<p>Neptune Analytics offers a fully managed graph analytics experience. It takes care of the infrastructure heavy lifting, enabling you to concentrate on problem-solving through queries and workflows. Neptune Analytics automatically allocates compute resources according to the graph’s size and quickly loads all the data in memory to run your queries in seconds. Our initial benchmarking shows that Neptune Analytics loads data from Amazon S3 up to 80x faster than existing AWS solutions.</p> \n<p><a href=\"https://docs.aws.amazon.com/neptune-analytics/latest/userguide/algorithms.html\">Neptune Analytics supports 5 families of algorithms covering 15 different algorithms</a>, each with multiple variants. For example, we provide algorithms for path-finding, detecting communities (clustering), identifying important data (centrality), and quantifying similarity. <a href=\"https://en.wikipedia.org/wiki/Pathfinding\">Path-finding algorithms</a> are used for use cases such as route planning for supply chain optimization. <a href=\"https://en.wikipedia.org/wiki/Centrality\">Centrality algorithms</a> like <a href=\"https://en.wikipedia.org/wiki/PageRank\">page rank</a> identify the most influential sellers in a graph. Algorithms like <a href=\"https://en.wikipedia.org/wiki/Component_(graph_theory)\">connected components</a>, <a href=\"https://en.wikipedia.org/wiki/Cluster_analysis\">clustering</a>, and similarity algorithms can be used for fraud-detection use cases to determine whether the connected network is a group of friends or a fraud ring formed by a set of coordinated fraudsters.</p> \n<p>Neptune Analytics facilitates the creation of graph applications using <a href=\"https://opencypher.org/\">openCypher</a>, presently one of the widely adopted graph query languages. Developers, business analysts, and data scientists appreciate openCypher’s SQL-inspired syntax, finding it familiar and structured for composing graph queries.</p> \n<p><strong><span>Let’s see it at work<br /> </span></strong>As we usually do on the AWS News blog, let’s show how it works. For this demo, I first navigate to Neptune in the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>. There is a new <strong>Analytics</strong> section on the left navigation pane. I select <strong>Graphs</strong> and then <strong>Create graph</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/10/2023-11-10_13-28-35.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/10/2023-11-10_13-28-35.png\" alt=\"Neptune Analytics - create graph 1\" width=\"800\" height=\"225\" /></a></p> \n<p>On the <strong>Create graph</strong> page, I enter the details of my graph analytics database engine. I won’t detail each parameter here; their names are self-explanatory.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.32.11-PM.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.32.11-PM.png\" alt=\"Neptune Analytics - Create graph 1\" width=\"800\" height=\"684\" /></a></p> \n<p>Pay attention to <strong>Allow from public</strong> because, the vast majority of the time, you want to keep your graph only available from the boundaries of your VPC. I also create a <strong>Private endpoint</strong> to allow private access from machines and services inside my account VPC network.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.33.58-PM.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.33.58-PM.png\" alt=\"Neptune Analytics - Create graph 2\" width=\"800\" height=\"703\" /></a></p> \n<p>In addition to network access control, users will need proper IAM permissions to access the graph.</p> \n<p>Finally, I enable <strong>Vector search</strong> to perform similarity search using embeddings in the dataset. The dimension of the vector depends on the large language model (LLM) that you use to generate the embedding.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.34.10-PM.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/Screenshot-2023-11-21-at-2.34.10-PM.png\" alt=\"Neptune Analytics - Create graph 3\" width=\"800\" height=\"329\" /></a></p> \n<p>When I am ready, I select <strong>Create graph</strong> (not shown here).</p> \n<p>After a few minutes, my graph is available. Under <strong>Connectivity &amp; security</strong>, I take note of the <strong>Endpoint</strong>. This is the DNS name I will use later to access my graph from my applications.</p> \n<p>I can also create <strong>Replicas</strong>. A replica is a warm standby copy of the graph in another Availability Zone. You might decide to create one or more replicas for high availability. By default, we create one replica, and depending on your availability requirements, you can choose not to create replicas.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/10/2023-11-10_14-49-18.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/10/2023-11-10_14-49-18.png\" alt=\"Neptune Analytics - create graph 3\" width=\"800\" height=\"629\" /></a></p> \n<p><span><strong>Business queries on graph data<br /> </strong></span>Now that the Neptune Analytics graph is available, let’s load and analyze data. For the rest of this demo, imagine I’m working in the finance industry.</p> \n<p>I have a dataset obtained from the <a href=\"https://www.sec.gov/\">US Securities and Exchange Commission (SEC)</a>. This dataset contains the list of positions held by investors that have more than $100 million in assets. Here is a diagram to illustrate the structure of the dataset I use in this demo.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/netptune-graph-demo-dataset-structure-v1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/netptune-graph-demo-dataset-structure-v1.png\" alt=\"Nuptune graph analytics - dataset structure\" width=\"823\" height=\"266\" /></a></p> \n<p>I want to get a better understanding of the positions held by one investment firm (let’s name it “Seb’s Investments LLC”). I wonder what its top five holdings are and who else holds more than $1 billion in the same companies. I am also curious to know what are other investment companies that have a similar portfolio as Seb’s Investments LLC.</p> \n<p>To start my analysis, I create a <a href=\"https://docs.aws.amazon.com/neptune/latest/userguide/graph-notebooks.html\">Jupyter notebook in the Neptune section of the </a><a href=\"https://console.aws.amazon.com\">AWS Management Console</a>. In the notebook, I first define my analytics endpoint and load the data set from an S3 bucket. It takes only 18 seconds to load 17 million records.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-04-07.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-04-07.png\" alt=\"Neptune Analytics - load data\" width=\"800\" height=\"221\" /></a></p> \n<p>Then, I start to explore the dataset using openCypher queries. I start by defining my parameters:</p> \n<pre><code>params = {'name': \"Seb's Investments LLC\", 'quarter': '2023Q4'}</code></pre> \n<p>First, I want to know what the top five holdings are for Seb’s Investments LLC in this quarter and who else holds more than $1 billion in the same companies. In openCypher, it translates to the query hereafter. The <code>$name</code> parameter’s value is “Seb’s Investment LLC” and the <code>$quarter</code> parameter’s value is 2023Q4.</p> \n<pre><code>MATCH p=(h:Holder)--&gt;(hq1)-[o:owns]-&gt;(holding)\nWHERE h.name = $name AND hq1.name = $quarter\nWITH DISTINCT holding as holding, o ORDER BY o.value DESC LIMIT 5\nMATCH (holding)&lt;-[o2:owns]-(hq2)&lt;--(coholder:Holder)\nWHERE hq2.name = '2023Q4'\nWITH sum(o2.value) AS totalValue, coholder, holding\nWHERE totalValue &gt; 1000000000\nRETURN coholder.name, collect(holding.name)</code></pre> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-17-12.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-17-12.png\" alt=\"Neptune Analytics - query 1\" width=\"800\" height=\"567\" /></a></p> \n<p>Then, I want to know what the other top five companies are that have similar holdings as “Seb’s Investments LLC.” I use the <code>topKByNode()</code> function to perform a vector search.</p> \n<pre><code>MATCH (n:Holder)\nWHERE n.name = $name\nCALL neptune.algo.vectors.topKByNode(n)\nYIELD node, score\nWHERE score &gt;0\nRETURN node.name LIMIT 5</code></pre> \n<p>This query identifies a specific Holder node with the name “Seb’s Investments LLC.” Then, it utilizes the Neptune Analytics custom vector similarity search algorithm on the embedding property of the Holder node to find other nodes in the graph that are similar. The results are filtered to include only those with a positive similarity score, and the query finally returns the names of up to five related nodes.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-17-57.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-11-14_08-17-57.png\" alt=\"Neptune Analytics - query 2\" width=\"800\" height=\"402\" /></a></p> \n<p><span><strong>Pricing and availability<br /> </strong></span>Neptune Analytics is available today in seven AWS Regions: US East (Ohio, N. Virginia), US West (Oregon), Asia Pacific (Singapore, Tokyo), and Europe (Frankfurt, Ireland).</p> \n<p>AWS charges for the usage on a pay-as-you-go basis, with no recurring subscriptions or one-time setup fees.</p> \n<p>Pricing is based on configurations of memory-optimized Neptune capacity units (m-NCU). Each m-NCU corresponds to one hour of compute and networking capacity and 1 GiB of memory. You can choose configurations starting with 128 m-NCUs and up to 4096 m-NCUs. In addition to m-NCU, storage charges apply for graph snapshots.</p> \n<p>I invite you to read <a href=\"https://aws.amazon.com/neptune/pricing/\">the Neptune pricing page for more details</a></p> \n<p>Neptune Analytics is a new analytics database engine to analyze large graph datasets. It helps you discover insights faster for use cases such as fraud detection and prevention, digital advertising, cybersecurity, transportation logistics, and bioinformatics.</p> \n<p><strong><span>Get started</span><br /> </strong> Log in to the <a href=\"https://console.aws.amazon.com/neptune\">AWS Management Console</a> to give Neptune Analytics a try.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d9e7a7e07b8ed0e356f1c4e19ac979d2e6e82040c4bf5be524713783e4457c5b","category":"Tech"}