{"title":"Microbial life‐history strategies mediate microbial carbon pump efficacy in response to N management depending on stoichiometry of microbial demand","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17311?af=R","date":1715685908000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/600311c3-12cb-48cd-b95e-41c8d96a526a/gcb17311-toc-0001-m.png\" alt=\"Microbial life-history strategies mediate microbial carbon pump efficacy in response to N management depending on stoichiometry of microbial demand\" />\n<p>The soil microbial carbon pump is increasingly acknowledged as being directly linked to soil organic carbon (SOC) accumulation and stability. The contribution of microbial necromass to SOC and microbial life strategies displayed two distinct responses in two soils after N amendment. We showed that the effects of continuous N addition on the contribution of microbial necromass to total SOC formation and carbon stability depends strongly on the microbial life strategies. Such information could foster N management optimization to facilitate long-term soil carbon sequestration in agro-ecosystem.</p>\n<br />\n<h2>Abstract</h2>\n<p>The soil microbial carbon pump (MCP) is increasingly acknowledged as being directly linked to soil organic carbon (SOC) accumulation and stability. Given the close coupling of carbon (C) and nitrogen (N) cycles and the constraints imposed by their stoichiometry on microbial growth, N addition might affect microbial growth strategies with potential consequences for necromass formation and carbon stability. However, this topic remains largely unexplored. Based on two multi-level N fertilizer experiments over 10 years in two soils with contrasting soil fertility located in the North (Cambisol, carbon-poor) and Southwest (Luvisol, carbon-rich), we hypothesized that different resource demands of microorganism elicit a trade-off in microbial growth potential (Y-strategy) and resource-acquisition (A-strategy) in response to N addition, and consequently on necromass formation and soil carbon stability. We combined measurements of necromass metrics (MCP efficacy) and soil carbon stability (chemical composition and mineral associated organic carbon) with potential changes in microbial life history strategies (assessed via soil metagenomes and enzymatic activity analyses). The contribution of microbial necromass to SOC decreased with N addition in the Cambisol, but increased in the Luvisol. Soil microbial life strategies displayed two distinct responses in two soils after N amendment: shift toward A-strategy (Cambisol) or Y-strategy (Luvisol). These divergent responses are owing to the stoichiometric imbalance between microbial demands and resource availability for C and N, which presented very distinct patterns in the two soils. The partial correlation analysis further confirmed that high N addition aggravated stoichiometric carbon demand, shifting the microbial community strategy toward resource-acquisition which reduced carbon stability in Cambisol. In contrast, the microbial Y-strategy had the positive direct effect on MCP efficacy in Luvisol, which greatly enhanced carbon stability. Such findings provide mechanistic insights into the stoichiometric regulation of MCP efficacy, and how this is mediated by site-specific trade-offs in microbial life strategies, which contribute to improving our comprehension of soil microbial C sequestration and potential optimization of agricultural N management.</p>","author":"Liyang Yang, \nAlberto Canarini, \nWushuai Zhang, \nMing Lang, \nYuanxue Chen, \nZhenling Cui, \nYakov Kuzyakov, \nAndreas Richter, \nXinping Chen, \nFusuo Zhang, \nJing Tian","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"d9ea254af575bb948a49bbdcd918f83c3f4a4e8973b9acea136356f402cd3295","category":"Environment"}