{"title":"Jony Ive Writes Touching Letter About Steve Jobs a Decade After His Passing","link":"https://www.macrumors.com/2021/10/04/jony-ive-shares-remembrance-of-steve-jobs/","date":1633362136000,"content":"Steve Jobs passed away 10 years ago tomorrow, and in commemoration, Apple's former design chief Jony Ive has <a href=\"https://www.wsj.com/articles/jony-ive-steve-jobs-memories-10th-anniversary-11633354769\">penned a remembrance</a> of his friend and colleague for <em>WSJ. Magazine</em>. In his first public comments about Jobs since delivering his eulogy in 2011, Ive reflected on his memories of Jobs across nearly 15 years of working together.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/steve-jobs-jony-ive.jpeg\" />\r\n<br />\r\n\"We had lunch together most days and spent our afternoons in the sanctuary of the design studio,\" wrote Ive. \"Those were some of the happiest, most creative and joyful times of my life. I loved how he saw the world. The way he thought was profoundly beautiful.\"\r\n<br />\r\n\r\n<br />\r\nIve said that he and Jobs had a shared curiosity that formed the basis of a joyful collaboration. \"He was without doubt the most inquisitive human I have ever met,\" wrote Ive.\r\n<br />\r\n\r\n<br />\r\n\"Steve was preoccupied with the nature and quality of his own thinking,\" said Ive. \"He expected so much of himself and worked hard to think with a rare vitality, elegance and discipline. His rigor and tenacity set a dizzyingly high bar. When he could not think satisfactorily he would complain in the same way I would complain about my knees.\"\r\n<br />\r\n\r\n<br />\r\nIve believes that Jobs was not distracted by money or power and was instead driven to make something useful for humanity.\r\n<br />\r\n\r\n<br />\r\nIve left Apple in 2019 to <a href=\"https://www.macrumors.com/2019/06/27/jony-ive-leaving-apple/\">create his own independent design firm LoveFrom</a> with fellow designer and longtime friend Marc Newson, and he said that he still collaborates with Apple, without sharing any specific details. Ive also continues to work with Laurene Powell Jobs, who is focused on philanthropic work through her company Emerson Collective.\r\n<br />\r\n\r\n<br />\r\n\"When her brilliant and inquisitive children ask me about their dad I just cannot help myself,\" wrote Ive, about Powell Jobs' children. \"I can talk happily for hours describing the remarkable man I loved so deeply.\"\r\n<br />\r\n\r\n<br />\r\nIve ended off with some very touching words:<blockquote>Steve's last words to me were that he would miss talking together. I was sitting on the floor next to his bed, my back against the wall.\r\n<br />\r\n\r\n<br />\r\nAfter he died, I walked out into the garden. I remember the sound of the latch on the wooden door as I gently pulled it closed.\r\n<br />\r\n\r\n<br />\r\nIn the garden, I sat and thought how talking often gets in the way of listening and thinking. Perhaps that is why so much of our time together was spent quietly.\r\n<br />\r\n\r\n<br />\r\nI miss Steve desperately and I will always miss not talking with him.</blockquote>The full remembrance <a href=\"https://www.wsj.com/articles/jony-ive-steve-jobs-memories-10th-anniversary-11633354769\">can be read at <em>WSJ. Magazine</em></a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/steve-jobs/\">Steve Jobs</a>, <a href=\"https://www.macrumors.com/guide/jony-ive/\">Jony Ive</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/04/jony-ive-shares-remembrance-of-steve-jobs/\">Jony Ive Writes Touching Letter About Steve Jobs a Decade After His Passing</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/jony-ive-writes-touching-letter-about-steve-jobs-a-decade-after-his-passing.2315340/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9vkTdXH6nkg:mdkgYOmIg7E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9vkTdXH6nkg:mdkgYOmIg7E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/9vkTdXH6nkg\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d9ef3bce1898f82c3ffa6c1080c10a831f34a73baea08b6b8f579c1d8e87bbe1","category":"Apple"}