{"title":"Epigenetic processes involved in response to pesticide exposure in human populations: a systematic review and meta-analysis","link":"https://academic.oup.com/eep/article/doi/10.1093/eep/dvae005/7655450?rss=1","date":1713571200000,"content":"<span><div>Abstract</div>In recent decades, the use of pesticides in agriculture has increased dramatically. This has resulted in these substances being widely dispersed in the environment, contaminating both exposed workers and communities living near agricultural areas and via contaminated foodstuffs. In addition to acute poisoning, chronic exposure to pesticides can lead to molecular changes that are becoming better understood. Therefore, the aim of this study was to assess, through a systematic review of the literature, what epigenetic alterations are associated with pesticide exposure. We performed a systematic review and meta-analysis including case-control, cohort and cross-sectional observational epidemiological studies to verify the epigenetic changes, such as DNA methylation, histone modification and differential microRNA expression, in humans who had been exposed to any type of pesticide. Articles published between the years 2005 and 2020 were collected. Two different reviewers performed a blind selection of the studies using the Rayyan QCRI software. Post-completion, the data of selected articles were extracted and analyzed. Most of the 28 articles included evaluated global DNA methylation levels, and the most commonly reported epigenetic modification in response to pesticide exposure was global DNA hypomethylation. Meta-analysis revealed a significant negative correlation between Alu methylation levels and β-hexachlorocyclohexane, <span>p</span>,<span>p'</span>-dichlorodiphenyldichloroethane and <span>p,p′</span>-dichlorodiphenylethylene levels. In addition, some specific genes were reported to be hypermethylated in promoter regions, such as <span>CDKN2AIGF2, WRAP53α</span> and <span>CDH1</span>, while <span>CDKN2B</span> and <span>H19</span> were hypomethylated due to pesticide exposure. The expression of microRNAs was also altered in response to pesticides, as miR-223, miR-518d-3p, miR-597, miR-517b and miR-133b that are associated with many human diseases. Therefore, this study provides evidence that pesticide exposure could lead to epigenetic modifications, possibly altering global and gene-specific methylation levels, epigenome-wide methylation and microRNA differential expression.</span>","author":"","siteTitle":"Environmental Epigenetics Current Issue","siteHash":"5549213f473d96cee0cf7ca1db1da1a69239cc267977bfd813fd34781f2cddbb","entryHash":"d9f0fd4b11cd9d39dc13fdd8a97ffbb813603effc4616122ace0cdb50726c708","category":"Environment"}