{"title":"How to keep fit over 40 | 7 ways to defy ageing and boost your cycling","link":"https://www.bikeradar.com/advice/fitness-and-training/how-to-keep-fit-over-40/","date":1698505255000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/how-to-stay-fit-over-40-3b7f251.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Man riding turbo trainer indoors with graphic overlay that says 'BikeRadar indoor training week'.\" title=\"how-to-stay-fit-over-40\" />                                            <p>Are you older than 40 and worrying that your cycling performance will recede quicker than your hairline? You don’t need to.</p>\n<p>With a few training, nutritional and gear tweaks, you’ll discover age is no impediment to perfect pedalling.</p>\n<p>In this guide, we run through the seven things you can do to keep fit and boost your cycling performance.</p>\n<h2>1. Raise the intensity</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Black and white image of male road cyclist\" title=\"Age Concern - 01\" />\n\n</div><div><figcaption><span><i></i> Ageing athletes should raise intensity rather than duration, according to coach Joe Friel.</span></figcaption><span> <i>Robert Smith / Our Media</i></span></div>\n<p>Top cycling coach Joe Friel, who is 80 and still riding strong, says: “Workout duration, intensity and frequency are three elements of training that can be manipulated to produce fitness.</p>\n<p>“As we age, there’s a tendency to increase duration at the expense of intensity. Workouts become longer and slower as weekly volume becomes the focus of training.</p>\n<p>“But the ageing athlete needs to do the opposite. Workouts over 80 per cent of your max heart rate should be the basis of your training, around two to three times per week. This change results in shorter training sessions but a higher weekly average intensity.”</p>\n<p>The reason for this is down to maintaining a solid aerobic capacity. Many of us know that maximum heart rate declines with age. Hence, the parochial method of calculating your maximum heart rate – 220 minus your age.</p>\n<p>A lower heart rate reduces cardiac output, which is the amount of blood pumped by the heart each minute. Throw in a less efficient lung function and your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> could go into freefall. But research shows that, as Friel says, raising the intensity of sessions slows the decline.</p>\n<h2>2. Change your nutrition</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Two boiled eggs in egg cups with a runny yolk and three toasted cheesbread soldiers on a blue-rimmed white plate on a wooden table top.\" title=\"Bolied Eggs With Soldiers\" />\n\n</div><div><figcaption><span><i></i> Try protein-rich foods, such as eggs.</span></figcaption><span> <i>David Burden Photography </i></span></div>\n<p>Another component of recovery and training is <a href=\"https://www.bikeradar.com/advice/nutrition/get-your-nutrition-right-with-our-guide-to-pre-ride-during-and-post-ride-fuelling/\">nutrition</a>. Small tweaks are needed as you age, because older adults may need higher quantities of some micronutrients.</p>\n<p>“Although differences in metabolism and physiological function occur with ageing, the nutrition associated with exercise and sport remains similar between younger and older adults,” says James Carter, senior director at the Gatorade Sports Science Institute.</p>\n<p>“Older adults may have greater demands for some micronutrients, which can easily be met with a varied diet, and protein requirements may also increase to prevent loss of muscle mass. While younger adults require 20-25g protein per meal and after exercise, for older adults this should rise to 30-40g.”</p>\n<p>Protein-rich foods include eggs, almonds, chicken breast, milk and yoghurt.</p>\n<p>Though the evidence isn’t yet conclusive, hugely experienced triathlon coach Jo Lewis recommends taking glucosamine supplements.</p>\n<p>“If I haven’t taken them, I creak more than I do normally!” she says.</p>\n<p>Lewis also highlights how nutrition should change during the menopause, with good fats and calcium (from milk) key. Good fats combat heart disease, which post-menopausal women may be at risk of due to lower oestrogen levels.</p>\n<h2>3. Boost testosterone</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Young man doing lunges with dumbbells in gym.\" title=\"Young man doing lunges with dumbbells in gym\" />\n\n</div><div><figcaption><span><i></i> Weight training is anabolic, resulting in increases in testosterone levels.</span></figcaption><span> <i>Jackyenjoyphotography / Getty Images</i></span></div>\n<p>It’s widely publicised that strength plummets as you age and, without recognising this, it will happen. You see, muscles comprise thousands of fibres and each one is innervated by a single nerve.</p>\n<p>The passage of time results in nerve loss and the death of the associated muscle fibre. Research has shown that the vastus medialis muscle in your thigh contains around 800,000 fibres at 20; by 60, it’ll be 250,000.</p>\n<p>That’s why you need to take control of your hormones. When Lance Armstrong confessed to doping, the exhaustive list included testosterone.</p>\n<p>Now, we’re not condoning administering synthetic testosterone in the name of cycling performance – it’s illegal and the side effects will leave you with shrunken testicles – but the reason Armstrong <em>et al</em> took testosterone is because of the positive effect it has on cycling performance.</p>\n<p>“Testosterone preserves and increases lean muscle mass, improves cognitive function, increases bone density preventing conditions like osteoporosis, and raises your ability to recover from a workout,” says Dr Will Mangar.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jack Evans, digital writer at BikeRadar, climbing a hill in Wales.\" title=\"jack-evans-climbing\" />\n\n</div><div><figcaption><span><i></i> Testosterone levels drop from the age of 30.</span></figcaption><span> <i>Felix Smith / Our Media </i></span></div>\n<p>The problem is, testosterone levels drop from the age of 30. Cycling, though providing physical and psychological benefits, accentuates the problem.</p>\n<p>Studies have shown 90 minutes of submaximal exercise results in a slight decrease in testosterone levels, while exercise of moderate to hard intensity for more than two hours results in a significant decrease.</p>\n<p>It’s suggested that increased cortisol levels, a loss of body mass and changes in luteinising hormone, which helps to create testosterone, could be responsible.</p>\n<p>“That’s where <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-simple-strength-and-conditioning-exercises-you-can-do-at-home/\">weight training</a> comes in,” says Mangar. “While cycling is often a catabolic activity, weight training is anabolic, resulting in increases in testosterone levels. I see athletes in their 40s doing nothing but cycling, and their performance is plateauing.</p>\n<p>“For those who are doing weights, bodyweights or plyometrics, their power output, recovery and stamina go up, all because they’re increasing testosterone levels, which are then maximising gains from endurance rides. I’d recommend riders over 35 split their week between 80 per cent riding and 20 per cent weights.”</p>\n<p>Mangar also says that employing the major muscle groups is key to boosting testosterone levels, so he recommends squats that work quads and glutes.</p>\n<p>Testosterone levels are highest in the morning, so there’s an argument that ‘am’ rides see bigger gains than ‘pm’ alternatives.</p>\n<h2>4. Bodyweight exercises to work the major muscle groups</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Woman exercising in custom made gym, in a small converted garage at home, specifically set up for gym exercises.\" title=\"Woman performs pull up in home gym, in converted garage\" />\n\n</div><div><figcaption><span><i></i> Try bodyweight exercises to work major muscle groups.</span></figcaption><span> <i>Justin Lambert / Getty Images</i></span></div>\n<p>To work the major muscle groups, you should do three sets of each exercise listed below, ideally to exhaustion. Failing that, as many as you can do in a minute before moving on to the next exercise.</p>\n<h4>Squat thrust</h4>\n<p>Place your hands shoulder-width apart on the floor. Stretch your legs out behind you as if you were about to do a press-up. In one movement, bring both legs into a tuck position, bending your knees into your chest. Repeat. You can also do alternate-leg squat thrusts.</p>\n<h4>Pull-up</h4>\n<p>You’ll need a bar to pull yourself up on for this one. Many parks now feature these, or you could improvise with a strong, conveniently placed branch.</p>\n<p>With palms facing forwards, clamp the bar that’s within reach above your head, keeping your hands shoulder-width apart. Raise your chin to the bar and lower. Repeat. Having your palms facing towards you makes the exercise easier; arms far apart makes it harder.</p>\n<h4>Burpee</h4>\n<p>From standing, drop into a squat position with your hands on the ground in front of you. Kick your feet back so you’re in a high plank position. Immediately jump your feet in towards your hands, then jump straight up. Repeat.</p>\n<h4>Press-up</h4>\n<p>Lie face-down on the floor, with your feet close together and hands palms-down on the floor, under your shoulders. Push up using your arms, keeping your core engaged, back straight and elbows in. Lower back down to the starting position.</p>\n<h2>5. Tweak your cleats</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Age concern - tweak your cleats when you age\" title=\"Age Concern - 03\" />\n\n</div><div><figcaption><span><i></i> Subtle tweaks to your cleat position can have major comfort rewards.</span></figcaption><span> <i>Andy Saunders (AS Design)</i></span></div>\n<p>“Problems can arise from the sport the cyclist came from,” says experienced bike fitter John Dennis.</p>\n<p>“You might get middle-aged individuals coming from golf or football, who tend to be the ones who are asymmetrical on the bike because they’re coming from sports involving lots of turning.”</p>\n<p>The muscles around the hips are a bit twisted, so you over-compensate. Cue an imbalanced pelvis, which results in you over-extending when pedalling, leading to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-knee-pain-the-problem-areas/\">knee issues</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Age concern - tweak your cleats when you age\" title=\"Age Concern - 02\" />\n\n</div><div><figcaption><span><i></i> Adjusting cleat position is one way to minimise the risk of knee pain.</span></figcaption><span> <i>Andy Saunders (AS Design)</i></span></div>\n<p>“You have various options of what you can do at the foot to offer more control of the knee,” Dennis says, “but a primary one involves cleat position. We usually set the cleat back slightly so the pressure is split across the head of the metatarsals, rather than beneath the big toe joint. It’s useful for people who might have weaker calf muscles or ankles, or if their foot’s unstable.”</p>\n<p>Alongside <a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\">adjusting your cleat position</a>, there’s also the option of wedges beneath the cleat, again to counter the imbalance.</p>\n<p>“Placing an extra footbed in the shoe will support your foot in the neutral position. In-shoe wedges can have a different effect, because when you put a wedge beneath a cleat, you’re affecting the whole shoe; under the arch, it’s just the foot.”</p>\n<h2>6. Speed up recovery</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mid adult man with digital tablet sleeping on sofa at home.\" title=\"Man sleeping on sofa at home\" />\n\n</div><div><figcaption><span><i></i> As you start to age, recovery takes longer.</span></figcaption><span> <i>Morsa Images / Getty Images</i></span></div>\n<p>What you do between training is just as important. “As you start to age, recovery takes longer,” explains exercise physiologist and professor David James of the University of Gloucestershire.</p>\n<p>“It’s also well established that high-intensity rides, which older riders should do more of, may result in impaired immune function for up to three days post-ride. This period post-exercise has also been associated with a higher incidence of upper-respiratory infections.”</p>\n<p>So, what can you do? Ideas for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/the-basics-of-recovery-explained/\">improved recovery</a> include compression socks, ideally a bespoke pair to elicit the necessary pressure to stimulate greater blood flow and accelerated breakdown of toxins; and a protein-carb drink after high-intensity sessions to begin muscle repair and boost immunity. But the greatest impact comes from sleep.</p>\n<p>“You produce less human growth hormone as you age, so sleep’s essential to maximise what you do produce,” says Friel. “The standard I use to determine if an athlete is getting enough sleep is this: if you have to use an alarm clock to wake up in the morning, you didn’t get enough sleep. Go to bed earlier.”</p>\n<p>If you’re struggling with shut-eye, sleep expert Nick Littlehales recommends a room temperature of 17-18°C, no smartphone use in bed and buying a less expensive mattress but replacing it more often. “I’d also recommend a dawn-light simulator to ease you into the day,” he adds.</p>\n<h2>7. Train your brain</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Canyon Ultimate CF SLX 8 Di2 road bike\" title=\"Canyon Ultimate CF SLX 8 Di2 - 05\" />\n\n</div><div><figcaption><span><i></i> Sprint intervals have been shown to further improve BDNF.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>When you exercise, the brain creates its very own fertiliser through a protein known as brain-derived neurotrophic factor (BDNF).</p>\n<p>Larissa True refers to it as “Miracle-Gro for the brain” and it’s an area that the professor of kinesiology at New Mexico State University researched for her Harvard dissertation.</p>\n<p>“Brain-derived neurotrophic factor is secreted in the brain and is known to regenerate neurons throughout the neural system. That potentially means we can cycle longer and faster without getting injured,” says True.</p>\n<p>“It’s also important in motor learning and long- and short-term memory, both of which can be affected as you age. The interesting thing is its secreted levels are activity-dependent; in other words, the more active you are, the more BDNF is secreted.”</p>\n<p>A German study has also shown the brain-derived neurotrophic factor benefits of daily aerobic exercise were improved further with sprint intervals, the researchers noting that the sprinting group learnt vocabulary words 20 per cent quicker than the non-sprinters.</p>\n<p>The BDNF is thought to bind receptors in the synapses to increase voltage and improve voltage strength.</p>\n<p>Follow these steps and you could <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-keep-cycling-through-your-40s-50s-60s-70s-and-beyond/\">keep cycling through your 50s, 60s, 70s and beyond</a>.</p>","author":"Mark Bailey","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"d9f5ce9ec24635fc2de5fed240a197c4fd05f87d5e02619a00579dffce5fa921","category":"Cycling"}