{"title":"Factors influencing IMF assistance in the Sub-Saharan African region","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307071","date":1721138400000,"content":"<p>by Kalindu Abeywickrama, Nehan Perera, Sithesha Samarathunga, Harshani Pabasara, Ruwan Jayathilaka, Krishantha Wisenthige</p>\r\n\r\nThis study examines the determinants influencing the likelihood of Sub-Saharan African (SSA) countries seeking assistance from the International Monetary Fund (IMF). The IMF, as a global institution, aims to promote sustainable growth and prosperity among its member countries by supporting economic strategies that foster financial stability and collaboration in monetary affairs. Utilising panel-probit regression, this study analyses data from thirty-nine SSA countries spanning from 2000 to 2022, focusing on twelve factors: Current Account Balance (CAB), inflation, corruption, General Government Net Lending and Borrowing (GGNLB), General Government Gross Debt (GGGD), Gross Domestic Product Growth (GDPG), United Nations Security Council (UNSC) involvement, regime types (Closed Autocracy, Electoral Democracy, Electoral Autocracy, Liberal Democracy) and China Loan. The results indicate that corruption and GDP growth rate have the most significant influence on the likelihood of SSA countries seeking IMF assistance. Conversely, factors such as CAB, UNSC involvement, LD and inflation show inconsequential effects. Notable, countries like Sudan, Burundi, and Guinea consistently rank high in seeking IMF assistance over various time frames within the observed period. Sudan emerges with a probability of more than 44% in seeking IMF assistance, holding the highest ranking. Study emphasises the importance of understanding SSA region rankings and the variability of variables for policymakers, investors, and international organisations to effectively address economic challenges and provide financial assistance.","author":"Kalindu Abeywickrama","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d9f776fa39cf77e2ca654739f5e0f6657a4af8d2b413c57b64b870c4af61acce","category":"Interdisciplinary"}