{"title":"Starlink bug frustrates users: “They don’t have tech support? Just a FAQ? WTF?”","link":"https://arstechnica.com/?p=1982976","date":1699635641000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-starlink-800x533.jpg\" alt=\"Photo illustration with Starlink logos displayed on a smartphone and PC screen.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/09/getty-starlink.jpg\">Enlarge</a> (credit: Getty Images | SOPA Images )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Starlink's lack of traditional customer support options is making life difficult today for new users affected by a bug that reset their accounts. A bunch of customers received an email from no-reply@starlink.com last night that said, \"Your Starlink Account Has Been Reset. All pending orders and deposits have been refunded. You are welcome to visit Starlink.com to place a new order at any time using the same email address.\"</p>\n<p>One Ars reader who got the account-reset email contacted us about the problem, and many others are complaining in Reddit threads. Starlink's <a href=\"https://auth.starlink.com/forgot-password\">account-recovery page</a> that allows users to request password resets with an email address or phone number hasn't been working for them.</p>\n<p>\"When I try to reset my password via the email option, I get the error 'User not found,'\" we were told by Adam, a Starlink customer in Alabama who preferred that we not publish his last name. When Adam tried to reset his password by entering his phone number, he received a text message with a password-reset link. But that didn't work, either. \"After I type in a new password, I get the error message 'User disabled,'\" Adam told us.</p></div><p><a href=\"https://arstechnica.com/?p=1982976#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1982976&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d9f7e861db8aa95b31b48e68f0917daa260711a1eec8d202b25532340e260c2d","category":"Tech"}