{"title":"Association between self-reported oral habits and oral health related quality of life of adolescents in Ibadan, Nigeria","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003218","date":1716472800000,"content":"<p>by Folake Barakat Lawal, Ejiro Idiga, Omotayo Francis Fagbule, Iyanuoluwa Jesupemi Ajayi, Folakemi Amusa, Ooreoluwa Adejumo, Mary Ebelechukwu Osuh, Orighoye Tosan Temisanren, Taiwo Akeem Lawal</p>\r\n\r\nOral habits such as nail biting, thumb/digit sucking and teeth grinding could be harmful, and may lead to teeth misalignment, anterior open bite, protruded or flared upper anterior teeth especially if they persist into adolescence. Such orofacial dysfunction may result to impairment of the Oral Health Related Quality of Life (OHRQoL) of an individual. The extent to which oral habits affect the major domains of the self-reported outcomes remains understudied especially during adolescence, a unique period of growth, where there is increased aesthetic desire, increased self-awareness, and unique social and psychological needs. The aim of this study, therefore, was to determine the prevalence of oral habits and its association with oral health related quality of life of adolescents. This cross-sectional study was conducted among 700 adolescents aged 10 to 19 years (with mean age 14.6 (±1.3) years) attending 14 secondary schools in Ibadan, Nigeria. Data were collected using a self-administered questionnaire, which assessed sociodemographic characteristics of the students, oral habits and OHRQoL with Oral Health Impact Profile 5 (OHIP-5). Data were analyzed with SPSS and p value was at &lt;5%. Mann Whitney U statistics was used to test for associations between OHIP-5 scores and presence or absence of oral habits. Logistic regression was used for multivariate analysis. A total of 363 (51.9%; 95%CI = 48.1%–55.6%) bite their nails, 216 (30.9%; 95%CI = 27.5%–34.4%) breathe with their mouth, 122 (17.4%; 95%CI = 14.7%–20.4%) suck their lips, 89 (12.7%; 95%CI = 10.3%–15.4%) grind their teeth together and 32 (4.6%; 95%CI = 3.1%–6.7%) sucked their thumbs. A total of 403 (81.1%) adolescents who engaged in at least an oral habit reported an impairment of their OHRQoL. Painful aching in the mouth was the most frequently affected OHRQoL item reported by the adolescents who engaged in oral habits. Those who sucked their thumbs (OR = 2.3, 95%CI = 1.1–4.7, p = 0.028) and those who sucked their lips were more likely to have poorer OHRQoL (OR = 1.6, 95%CI = 1.1–2.5, p = 0.024). Oral habits were prevalent among the adolescents and affected their OHRQoL. Those who sucked their thumbs and lips were more likely to report poorer OHRQoL than those who did not.","author":"Folake Barakat Lawal","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"d9fa5124ce062cf93d8c57dd1fbc47577f8e6e6fa86b4b3a90664a7d4e1ac409","category":"Environment"}