{"title":"Assessing climate change and health provisions among staff in higher education institutions: A preliminary investigation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304019","date":1716300000000,"content":"<p>by Walter Leal Filho, Maria Alzira Pimenta Dinis, Amanda Lange Salvia, Javier Sierra, Helena Vasconcelos, Claire Henderson-Wilson, Samo Diatta, T. V. Lakshmi Kumar, Maria Gabriela Meirelles, Fernanda Carvalho</p>\r\n\r\nClimate change can have direct and indirect effects on human health. Direct effects can include an increase in extreme weather events, such as heatwaves and floods, as well as an increase in the spread of vector-borne and infectious diseases, which may lead to a set of health problems and diseases. Indirect effects can include changes in air quality, water availability, and food production and distribution. These changes can lead to an increase in respiratory problems, malnutrition, and increased food insecurity. There is a perceived need to investigate the extent to which Higher Education Institutions (HEIs) are engaged in efforts to foster a greater understanding of the connections between climate change and health. In this context, this preliminary investigation offers an overview of the relationships between climate change and health. By means of a survey among teaching staff and researchers at HEIs from 42 countries across all continents working on the connection between climate change and health. The study has investigated the extent to which current provisions for education and training on the connection between climate change and health are being considered and how current needs in terms of policy development, research, and training are being met. A series of case studies illustrate how universities worldwide are actively developing strategies and implementing measures to address climate change and health. The study concludes by providing specific recommendations aimed at facilitating the handling of issues related to climate change and health in a higher education context.","author":"Walter Leal Filho","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"d9fb06d7226f4704b254cbc4d2d454653bbc9f77517bb54e4b89fb55edd84d35","category":"Interdisciplinary"}