{"title":"28 Investigation of protein deposition pattern of PIC337×Camborough commercial pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/74/7664810?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of the trial was to investigate the protein deposition pattern of PIC337×Camborough commercial pigs. A total of 1,064 barrows and gilts [PIC337×Camborough, initial body weight (BW) = 6.0 ± 0.1 kg] were used in the trial with 38 mixed sex pens, 28 pigs per pen. At the beginning of the trial, the lightest 10% of the barrows and gilts were selected and placed in four pens (equal numbers of barrows and gilts within a pen), and the remaining pigs were randomly placed into the other pens (equal numbers of barrows and gilts within a pen). A common 6-phase corn-soybean based wean-to-finish diets were fed throughout the trial. Dietary net energy and standardized ileal digestible lysine levels were (6-10 kg BW: 2,600 Kcal/kg and 1.35%; 10-20 kg BW: 2,520 Kcal/kg and 1.30%; 20-38 kg BW: 2,470 Kcal/kg and 1.20%; 38-72 kg BW: 2,450 Kcal/kg and 0.98%; 72-127 kg BW: 2,450 Kcal/kg and 0.87%; and 127-149 kg BW: 2,450 Kcal/kg and 0.77%). On d 97 after placement, 5 barrows and 5 gilts with BW close to pen average were selected for individual BW by a portable scale and 10<sup>th</sup> rib backfat and loin depth measurements (ExaGo portable ultrasound scanner, Imv imaging, UK). Then on d 111, 117, 136, 142, and 167 after placement, the same 5 barrows and 5 gilts were measured for individual BW, 10<sup>th</sup> rib backfat and loin depth. The fat-free lean mass is estimated by the equation 6.783-0.6198×(10<sup>th</sup> rib backfat depth, mm)+0.1578×(10<sup>th</sup> rib loin depth, mm)+1.0362×(warm carcass weight, kg). A constant carcass yield of 75% was used to estimate warm carcass weight. Data were analyzed using a linear mixed model in R Studio (Version 3.5.2, R Core Team; Vienna, Austria). The average BW of pigs at the 6 measurements were: 77.2, 92.4, 99.2, 122.5, 128.0, and 153.6 kg, respectively. The average daily gain (ADG) was 1,139, 1,155, 1,145, 1,126, and 977 g/d for 77.2 to 92.4 kg BW, 92.4 to 99.2 kg BW, 99.2 to 122.5 kg BW, 122.5 to 128.0 kg BW, and 128.0 to 153.6 kg BW, respectively. The average daily 10<sup>th</sup> rib backfat depth gain was 0.05, 0.08, 0.15, 0.17, and 0.20 mm/d. The average daily 10<sup>th</sup> rib loin depth gain was 0.42, 0.43, 0.41, 0.39, and 0.23 mm/d. The average daily fat-free lean mass gain (ADFFLG) was 547, 551, 528, 515, and 422 g/d. The fitted quadratic model for ADG is 83.57782 + 19.90632 × (BW, kg)-0.09176×(BW, kg)<sup>2</sup>, and the calculated maximum ADG was 1,163 g/d when BW was 108.5 kg. The fitted quadratic model for ADFFLG is 85.90926 + 9.23773 × (BW, kg) - 0.04591 × (BW, kg)<sup>2</sup>, and the calculated maximum ADFFLG is 550.6 g/d when BW was 100.6 kg. Under the conditions of the current trial, PIC337×Camborough pigs reaches the maximum rate of protein deposition at BW between 100.6 and 108.5 kg.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"da009706ffdf27e3875141a3df7c9848689ac7ccf857f76198dcce816c1d4d79","category":"Environment"}