{"title":"DuckDuckGo Browser Gets Encrypted Bookmark and Password Syncing","link":"https://www.macrumors.com/2024/02/15/duckduckgo-browser-password-sync/","date":1707991457000,"content":"<a href=\"https://duckduckgo.com\">DuckDuckGo Browser</a> users can now securely sync their favorites, bookmarks, and passwords across multiple devices, without having to set up an account or sign in to use it.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/duckduckgo-sync.jpg\" width=\"2080\" height=\"1144\" />\r<br />\nThe privacy-first browser enables this through its new \"Sync &amp; Backup\" feature, which generates a QR code on mobile devices or an alphanumeric code on a computer to establish syncing.\r<br />\n\r<br />\nAs per DuckDuckGo's privacy, DuckDuckGo doesn't track users, and cannot access users' synced data, including passwords in the browser's built-in password manager, which encrypts passwords locally. When private sync is used, all data stays securely encrypted throughout the syncing process, since the unique key needed to decrypt it is stored only on the devices.\r<br />\n\r<br />\nBackup &amp; Sync also enables users to migrate bookmarks and passwords to a new device, and sync their Email Protection account between devices. (DuckDuckGo Email Protection is a free email forwarding service that removes hidden email trackers and lets users create unique private email addresses on the fly.)\r<br />\n\r<br />\nAccording to DuckDuckGo, the new feature works across most Windows, Mac, Android, and <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> devices, and can be found in the browser's Settings (Sync &amp; Backup ➝ Sync With Another Device). Those only working with one device can choose Sync and Back Up This Device from the Single-Device Setup section. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/duckduckgo.jpg\" width=\"1600\" height=\"900\" />\r<br />\nAfter setup, the browser generates a Recovery PDF document that contains the user's unique, locally generated Recovery Code, which can be used to gain access to synced data if the associated devices are lost or damaged.\r<br />\n\r<br />\nDuckDuckGo's browser offers more than a dozen privacy protections, including ad tracker blocking and cookie pop-up removal. It is available for <a href=\"https://apps.apple.com/app/duckduckgo-private-browser/id663592361?platform=iphone\">iOS devices on the App Store</a> and for Mac on the <a href=\"https://apps.apple.com/gb/app/duckduckgo-private-browser/id663592361\">Mac App Store</a> and <a href=\"https://duckduckgo.com/mac\">DuckDuckGo website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/duckduckgo/\">DuckDuckGo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/15/duckduckgo-browser-password-sync/\">DuckDuckGo Browser Gets Encrypted Bookmark and Password Syncing</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/duckduckgo-browser-gets-encrypted-bookmark-and-password-syncing.2419502/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"da00da7e9bcb3718810929486a9aef49c005a51ec60d2528d68fb92f856759a8","category":"Apple"}