{"title":"Apple Podcasts Launches New Subscription Analytics Dashboard","link":"https://www.macrumors.com/2023/08/21/apple-podcasts-subscription-analytics/","date":1692633600000,"content":"Starting <a href=\"https://podcasters.apple.com/5314-introducing-subscription-analytics-delegated-delivery-linkfire\">today</a>, Apple Podcasts creators have access to a new Subscription Analytics dashboard that provides an overview of how their podcast subscriptions are performing. The free tool is available via the <a href=\"https://podcastsconnect.apple.com/\">Apple Podcasts Connect</a> website.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Podcasts-Subscription-Analytics.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nOn the Overview tab, creators can view how many listeners started a free trial, how many listeners are paid subscribers, the percentage of listeners who convert from a free trial to a paid subscription, the estimated proceeds generated from subscriptions, and more. There is also a map with a breakdown of subscribers by country/region.\r<br />\n\r<br />\nAdditional data and filters are available on the Trends tab, allowing creators to keep track of activations, cancellations, renewals, and more.\r<br />\n\r<br />\nApple Podcasts began allowing podcasts to offer subscriptions in June 2021 as a way to monetize their shows. Depending on the podcast, subscribers may receive benefits such as ad-free listening, early access to episodes, bonus episodes, and other exclusive perks. Podcasts can offer subscriptions on a per-month and per-year basis.\r<br />\n\r<br />\nApple also announced that Podbean now supports Delegated Delivery, a feature that allows podcast creators to upload, manage, and distribute their subscriber episodes through participating third-party hosting providers. Audiomeans, Captivate, Podspace, and Transistor will add support by the end of the year, according to Apple.\r<br />\n\r<br />\nLast, there is a new <a href=\"https://www.linkfire.com/podcasts\">Linkfire for Podcasts</a> marketing and analytics toolkit built for podcasters, and it has exclusive integration with Apple Podcasts. Linkfire for Podcasts is launching in beta today, and will be available to all creators worldwide for free later this year. \r<br />\n\r<br />\nMore details about Subscription Analytics and the other announcements are available <a href=\"https://podcasters.apple.com/5314-introducing-subscription-analytics-delegated-delivery-linkfire\">on the Apple Podcasts website</a> and in a <a href=\"https://podcasters.apple.com/support/5311-understanding-subscription-analytics\">support document</a>.\r<br />\n\r<br />\niOS 17 includes <a href=\"https://www.macrumors.com/2023/06/08/whats-new-ios-17-podcasts-app/\">several enhancements to the Apple Podcasts app</a> on the iPhone, including a redesigned Now Playing screen. The software update should be released in September and is compatible with the iPhone XS and newer.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a>, <a href=\"https://www.macrumors.com/guide/apple-podcasts-subscriptions/\">Apple Podcasts Subscriptions</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/21/apple-podcasts-subscription-analytics/\">Apple Podcasts Launches New Subscription Analytics Dashboard</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-podcasts-launches-new-subscription-analytics-dashboard.2399226/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"da0a0fff9e613511ff1b58c36e91d99f73dcbad4a597f85165463b757327d3da","category":"Apple"}