{"title":"How to fix a MacBook that won’t charge","link":"https://www.macworld.com/article/671526/how-to-fix-a-macbook-that-wont-charge.html","date":1699893985000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If your MacBook Pro or MacBook Air won’t charge, or the charger isn’t working, getting things working can be a race against time as the battery drains. In this article we’ll look at the possible reasons why your Mac laptop might not be charging, and how you can fix it.</p>\n\n\n\n<p>We’ll also look at what to do if your Apple laptop doesn’t hold a charge and if it’s delivering a lot less battery life than Apple advertises.</p>\n\n\n\n<h2>Why is my MacBook not charging?</h2>\n\n\n\n<p>There could be a simple reason why your MacBook Air or MacBook Pro won’t charge. The battery may be faulty, there could be a problem with the charging cable, an issue with macOS could be causing your battery not to charge sufficiently, or your Mac may be part of a recall due to a fault. We discuss reasons why your MacBook won’t charge, and suggest some fixes below. </p>\n\n\n\n<p>Another reason why your MacBook might not be charging is that the Mac may have paused charging in order to extend the life of the battery. The battery health features of recent versions of macOS from Big Sur onwards include charging not starting until the battery slips below 90% or 93% capacity and charging stopping once the battery is at 80% if the Mac will be left plugged in for a long time. The Optimized Battery Charging features are designed to reduce battery aging and is on by default on Macs with M1, M2, M3-series chips, and Intel Macs with the T2 security chip. </p>\n\n\n\n<p>If your Mac has stopped charging due to Optimized Battery Charging you can resume charging by clicking on the battery icon in the menu at the top of the screen and choose: Charge to Full Now. </p>\n\n\n\n<p>You can also turn off Optimized Battery Charging by following these steps:</p>\n\n\n\n<ol>\n<li>Open System Settings (or System Preferences in older versions of macOS). </li>\n\n\n\n<li>Click on Battery. </li>\n\n\n\n<li>Click on the i icon beside Battery Health. </li>\n\n\n\n<li>Deselect Optimised Battery Charging. </li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Optimized Battery Charging macOS\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?quality=50&amp;strip=all 1654w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?resize=300%2C267&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?resize=768%2C684&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?resize=1200%2C1069&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Optimized-batttery-charing-MacOS.jpg?resize=1536%2C1369&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"1069\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>What to do if a MacBook won’t charge  </h2>\n\n\n\n<p>Start off with these simple checks to establish what the issue is that is stopping your Mac from charging. We also have some more advanced fixes to try.</p>\n\n\n\n<div>\n<div></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Check the connections </h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/space-black-macbook-pro-magsafe-cable.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"The Space Black MacBook Pro comes with a braided black MagSafe cable.\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>We have to ask… Is the MacBook definitely plugged in? Disconnect the charging cable from the laptop and plug it in again.</p>\n\n\n\n<p>Check the plug socket too. Is the socket turned on? Try using a different wall socket. Plug something else into the socket to see it it works. We know all this sounds a bit basic, but double-check before you go any further.</p>\n\n\n\n<p>Make sure your power adaptor is connected properly. Each Apple laptop adaptor comes in two parts, the square adaptor and its removable plug that connects to the wall, and the charge cable. Pull the two apart and put them back together.</p>\n\n\n\n<p>What does your Apple adaptor look like? Is it in pristine condition or has it got any tears in the cable? Is the adaptor discolored in any way? Does it look burnt out? If so, try a different adaptor (I once took a MacBook Air to an Apple Store because it wasn’t charging. It turned out the fault was with the MagSafe charger which wasn’t functioning. Apple replaced the charger and all was well.)</p>\n\n\n\n<p>Make sure you are using the correct power adapter and cable. For example, you may have a Mac that charges via USB-C, but not all USB-C cables are equal. Some cannot be used for charging. There are also various types of MagSafe cables that your Mac might require for charging – there are no less than three versions of MagSafe for Mac. You need to make sure you are using the correct one. See our <a href=\"https://www.macworld.com/article/671596/complete-guide-to-apple-magsafe-what-is-magsafe.html\">guide to MagSafe</a>. You should ideally use the charger that came with your Mac, including the included power brick. If you are using a low-wattage cable your Mac may not be able to draw sufficient power to charge. </p>\n\n\n\n<p>Speaking of the power brick – is it overheating? If your power adapter is getting too hot it may not function. Make sure it isn’t covered by anything.</p>\n\n\n\n<p>Also, check the power port on your Apple laptop for dust. This can prevent the connector from making a clean connection to the Mac and stop you from charging it up correctly.</p>\n\n\n\n<p>If your Mac isn’t charging follow these steps:</p>\n\n\n\n<ol>\n<li>Unplug the charging cable from your Mac. </li>\n\n\n\n<li>Wait a few seconds. </li>\n\n\n\n<li>Plug the cable back in. </li>\n</ol>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Check your battery</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Battery-service-Macbook-1.jpg?quality=50&amp;strip=all\" alt=\"Battery service MacBook\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>As we explain in <a href=\"https://www.macworld.com/article/673875/how-to-test-a-macbook-battery-see-if-it-needs-replacing-replace-it.html\">How to test a MacBook battery</a> it’s actually quite simple to check your MacBook battery to see if it needs replacing. </p>\n\n\n\n<p>To check is whether there is a problem with your battery follow these steps:</p>\n\n\n\n<ol>\n<li>Click on the battery charge icon at the top right of the desktop near the clock. </li>\n\n\n\n<li>Click on Battery Settings. This will open the battery section of System Settings (you can also get here from System Settings &gt; Battery).</li>\n\n\n\n<li>Check what the advice besides Battery Health. </li>\n</ol>\n\n\n\n<p>In our case battery health is normal, but in an older Mac we saw a warning that we should Service Battery (as shown above). </p>\n\n\n\n<p>On older Macs you should follow these steps to check battery health:  </p>\n\n\n\n<ol>\n<li>Hold down the Alt/Option key.</li>\n\n\n\n<li>Click the battery charge icon at the top right of the desktop near the clock.</li>\n\n\n\n<li>After the Condition heading at the top of the menu you’ll see one of four battery status messages: Normal, Replace Soon, Replace Now, and Service Battery.</li>\n</ol>\n\n\n\n<p>If your battery is described as Normal you should have nothing to worry about in terms of battery health. If it suggests Replace Soon, Replace Now or Service Battery then that may well be the cause of your battery charging issues. </p>\n\n\n\n<p>If your battery needs replacing you should read <a href=\"https://www.macworld.com/article/1679604/replace-macbook-battery.html\">Should you replace your MacBook battery or pay Apple to do it?</a></p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Update your software</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Software-Update-Sonoma.jpg?quality=50&amp;strip=all\" alt=\"Software Update Sonoma\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Sometimes a software update may fix your Mac charging problems.</p>\n\n\n\n<p>For example, when Apple issued the macOS Monterey 12.2 update a bug was introduced that caused some Mac batteries to drain really quickly in sleep mode. The issue was found to be related to an issue with Bluetooth and a subsequent <a href=\"https://www.macworld.com/article/678417/macos-monterey-12-2-1-fixes-mac-battery-drain-issue.html\">macOS 12.2.1 update addressed the battery drain problem</a>.</p>\n\n\n\n<p>Make sure that your Mac is running the most recent version of the macOS software. Go to System Settings &gt; General &gt; Sofware Update (or System Preferences &gt; Software Update in older versions of macOS) to check that there isn’t an update. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Find out if your Mac’s been recalled</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/MacBook-Pro-Battery-recall.jpg?quality=50&amp;strip=all\" alt=\"MacBook Pro Battery recall\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Check to see if your Mac – specifically the battery – has been recalled. We have details of  <a href=\"https://www.macworld.com/article/673631/macbook-recalls-and-repair-programs-is-your-mac-included.html\">MacBook Recalls and repair programs here</a>.</p>\n\n\n\n<p>In the summer of 2019 Apple recalled some MacBook Pros due to concerns about the battery overheating. Click the link for information about the  <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/15-inch-macbook-pro-battery-recall&amp;xcust=1-1-671526-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">15-inch MacBook Pro battery recall</a> for units sold between 2015 and 2017.</p>\n\n\n\n<p>There was also a recall of 2016-2017 MacBook Pro (non Touch Bar) models relating to a component failure causing the built-in battery to expand, but that program is no longer running. </p>\n\n\n\n<p>Your Mac’s charger might also be part of a recall. Apple has <a href=\"https://www.macworld.com/article/673585/apple-recalls-wall-plugs-over-safety-fears.html\">recalled some of its wall plugs over safety concerns, find out if yours is affected</a>.</p>\n\n\n\n<p>We have a separate article where we <a href=\"https://www.macworld.com/article/676373/apple-repairs-price-guide-and-how-long-repairs-take.html\">discuss everything you need to know about getting Apple products repaired</a>.  </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>5.</span>\n<h3>Reset the battery</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Reset-SMC-Mac.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"MacBook Keyboard Reset SMC Mac\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If you are still having no luck getting to the bottom of your Mac charging issues, you could reset the battery. The process you follow to reset the battery in your MacBook Pro or MacBook Air will be determined by the age of your Mac, and whether it has an Intel chip or an Apple chip inside. </p>\n\n\n\n<p>It is unlikely that your Mac has a removable battery as that hasn’t been the case since before 2012. However, if your Mac is old enough to have a removable battery you could remove the battery, disconnect the power adapter, hold down the power key for 10 seconds before replacing the battery and then plug the power adapter back in. The battery will reset when you restart the Mac. If your Mac is that old it’s probable that this process isn’t going to help this aging battery recover though.  </p>\n\n\n\n<p>For Macs that don’t have a removable battery, the process to reset the battery requires you to reset the SMC (System Management Controller). This is a chip on your Mac’s logic board that controls the power. </p>\n\n\n\n<p>Resetting the SMC can help with battery and power-related problems, however, the process for resetting SMC is different depending on the age of your Mac. </p>\n\n\n\n<p>These are the steps you need to follow if your Mac has an Intel processor. </p>\n\n\n\n<ol>\n<li>Shut down the MacBook.</li>\n\n\n\n<li>Connect the power adapter.</li>\n\n\n\n<li>Hold down Control + Shift+ Option/Alt and the Power button for about four seconds. Then release all four together.</li>\n\n\n\n<li>Press the Power button to start up the Mac again.</li>\n</ol>\n\n\n\n<p>If you have an Apple silicon Mac – with an M1, M2 or M3-series chip inside you won’t be able to reset the SMC because there is no system management controller–all functions that were previously handled by the chip are now embedded in the processor. This doesn’t mean you are stuck and can’t reset things: all you need to do is turn your Mac off, wait about 30 seconds, and turn it on again.</p>\n\n\n\n<p>If you’d like to find out more, read out full tutorial on <a href=\"https://www.macworld.com/article/669231/how-to-reset-the-smc-on-an-m1-or-intel-mac.html\">resetting the SMC</a>. <span>Also see: </span><a href=\"https://www.macworld.com/article/671809/how-to-fix-a-mac-2.html\" target=\"_blank\">How to fix a Mac.</a></p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>6.</span>\n<h3>Get the Mac serviced</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/status_of_service__thumb.jpg?quality=50&amp;strip=all\" alt=\"Can I get Mac repaired\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If the above advice doesn’t help then you should take your MacBook to Apple (or an Apple reseller that is an Apple Authorized Service Provider) for servicing and maybe consider having the battery replaced.</p>\n\n\n\n<p>You’ll need to find out whether your Mac qualifies to be serviced by Apple. It depends on whether the Mac is still under warranty or if you have AppleCare. Here’s how to check if you are covered:</p>\n\n\n\n<ol>\n<li>Click <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://checkcoverage.apple.com/&amp;xcust=1-1-671526-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">here</a> to go to Apple’s Service and Support website. </li>\n\n\n\n<li>Enter your serial number (you can find it by clicking on the Apple menu &gt; About This Mac).</li>\n\n\n\n<li>Prove you aren’t a robot.</li>\n</ol>\n\n\n\n<p>You will be taken to a page that explains what cover you have. In our case it indicates that Consumer Law May Apply and suggests we talk to an advisor.</p>\n\n\n\n<p>If you have Apple Cover, or your Mac is still within warranty then it is easy to set up a repair.  <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://getsupport.apple.com/?sn=C2QSLLPPFVH3&amp;locale=en_GB&amp;xcust=1-1-671526-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Just go through the options here</a>. We suggest Startup or Power &gt; Charging tips or troubleshooting. You’ll see options to Talk to Apple support, schedule a call, start a chat session, or bring in for repair. </p>\n\n\n\n<p>We have this article about <a href=\"https://www.macworld.com/article/673081/how-to-get-a-mac-repaired.html\">getting a Mac repaired</a>. We also look at <a href=\"https://www.macworld.com/article/342272/ultimate-mac-diy-repair-guide.html\">Mac DIY repair guide</a> and <a href=\"https://www.macworld.com/article/676373/apple-repairs-price-guide-and-how-long-repairs-take.html\">how long Apple repairs take and how much they cost.</a></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\n\n\n<p>Hopefully the above will have helped you solve your MacBook battery charging problems. There are a number of ways you can preserve the life of your battery in order to avoid such problems in the future, as well as settings you may want to change if you are finding that your battery still isn’t charging. Find out more in: <a href=\"https://www.macworld.com/article/677517/how-to-keep-a-macbooks-battery-healthy.html\">How to keep a MacBook battery healthy</a>. </p>\n\n\n\n<p>One of our top tips is not to leave a Mac plugged in all the time. It’s good practice to let your battery completely discharge and then recharge once in a while. We have the following advice about <a href=\"https://www.macworld.com/article/671184/how-to-save-macbook-battery-life.html\">improving battery life</a>. </p>\n\n\n\n<div></div>\n\n\nMac, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"da0dc065397b3aee6baa555fc1c8cb9befc95414b5d95af5de6cfcecf44170a1","category":"Apple"}