{"title":"Diversity of Thrips Associated With Soybean Grown in Different Plant Arrangements","link":"https://www.preprints.org/manuscript/202407.1173/v1","date":1721065491000,"content":"One of the most important agrotechnical factors that influence the growth conditions of crops is plant density. Alterations in habitat conditions result in the emergence of phytophagous organisms, whose development is closely associated with host plants. The objective of this study was to assess the abundance and species composition of thrips (Thysanoptera) collected in soybean plants of different varieties cultivated under different plant arrangements (row spacing, number of seeds sown differed). The research was conducted at two locations in southwestern Poland between 2015 and 2018. The herbivores that inhabit plants were caught using an entomological net. The experiments were carried out using the complete randomised block design, with four replications. Regardless of location and treatment, thrips were the most numerous group of pests. Thrips tabaci and T. fuscipes were the dominant species within the collected material. A total of 24 species of thrips were identified and their dietary specialisation was determined. The assemblages of studied insects were also analysed due to the density of the plants and the stage of development. The increase in the sowing density of soybean (90 seeds per m2) resulted in a greater total number of thrips compared to a lower sowing density (50 seeds per m2). The number of thrips significantly increased during the flowering period and shortly after the flowering time, which made them a significant threat to the plants. Therefore, it is crucial to develop innovative pest management strategies tailored to effectively grow soybean to mitigate potential pest-related challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"da0f215142e773d285a1f40b64d26ee72415fc3459c6db42a633ce5bfee86483","category":"Interdisciplinary"}