{"title":"Advancing fine branch biomass estimation with lidar and structural models","link":"https://academic.oup.com/aob/article/134/3/455/7683439?rss=1","date":1716854400000,"content":"<span><div>Abstract</div><div>Background and Aims</div>Lidar is a promising tool for fast and accurate measurements of trees. There are several approaches to estimate above-ground woody biomass using lidar point clouds. One of the most widely used methods involves fitting geometric primitives (e.g. cylinders) to the point cloud, thereby reconstructing both the geometry and topology of the tree. However, current algorithms are not suited for accurate estimation of the volume of finer branches, because of the unreliable point dispersions from, for example, beam footprint compared to the structure diameter.<div>Method</div>We propose a new method that couples point cloud-based skeletonization and multi-linear statistical modelling based on structural data to make a model (structural model) that accurately estimates the above-ground woody biomass of trees from high-quality lidar point clouds, including finer branches. The structural model was tested at segment, axis and branch level, and compared to a cylinder fitting algorithm and to the pipe model theory.<div>Key Results</div>The model accurately predicted the biomass with 1.6 % normalized root mean square error (nRMSE) at the segment scale from a <span>k</span>-fold cross-validation. It also gave satisfactory results when scaled up to the branch level with a significantly lower error (13 % nRMSE) and bias (−5 %) compared to conventional cylinder fitting to the point cloud (nRMSE: 92 %, bias: 82 %), or using the pipe model theory (nRMSE: 31 %, bias: −27 %). The model was then applied to the whole-tree scale and showed that the sampled trees had more than 1.7 km of structures on average and that 96 % of that length was coming from the twigs (i.e. &lt;5 cm diameter). Our results showed that neglecting twigs can lead to a significant underestimation of tree above-ground woody biomass (−21 %).<div>Conclusions</div>The structural model approach is an effective method that allows a more accurate estimation of the volumes of smaller branches from lidar point clouds. This method is versatile but requires manual measurements on branches for calibration. Nevertheless, once the model is calibrated, it can provide unbiased and large-scale estimations of tree structure volumes, making it an excellent choice for accurate 3D reconstruction of trees and estimating standing biomass.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"da10082ab68f97da2dd212c8bd7c1516d83136517cd0c8005ee9fe959cb9b86b","category":"Environment"}