{"title":"Mouse embryos grow for days in culture, but the requirements are a bit nuts","link":"https://arstechnica.com/?p=1751042","date":1616255398000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Visel-Pen-mouse-embryo-CROPPED-e1616255191202-800x542.jpeg\" alt=\"A gross white blob looks vaguely like a human ear.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Visel-Pen-mouse-embryo-CROPPED-e1616255191202.jpeg\" class=\"enlarge-link\" data-height=\"812\" data-width=\"1199\">Enlarge</a> <span class=\"sep\">/</span> A mouse embryo with the nervous system highlighted in blue. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://newscenter.lbl.gov/2014/03/24/new-technique-for-identifying-gene-enhancers/\">Lawrence Berkeley Lab</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Embryos start out as a single cell, and have to go from there to a complicated array of multiple tissues. For organisms like insects or frogs, that process is pretty easy to study, since development takes place in an egg that's deposited into the environment shortly after fertilization. But for mammals, where all of development takes place inside the reproductive tract, understanding the earliest stages of development is a serious challenge. Performing any experiments on a developing embryo is extremely difficult, and effectively impossible at some stages.</p>\n<p>This week, however, progress has been made with both human and mouse embryos. On the human side, researchers have used induced stem cells to create embryo-like bodies that perform the first key step in development, catching them up to where mouse research has been for decades. On the mouse side, however, a research team has gotten mouse embryos to go for nearly a week outside the uterus. While that opens up a world of experiments that hadn't previously been possible, the requirements for getting it to work means that it's unlikely to be widely adopted.</p>\n<h2>To grow mice, you need rats</h2>\n<p>The mouse work was somewhat more interesting technically, so we'll get to that first. One of the most critical steps in the development of vertebrates is called gastrulation. The process takes some cells that have been set aside during the early embryo, and converts them into three critical layers that go on to form the embryo: the skin and nerves, the lining of the gut, and everything else.</p></div><p><a href=\"https://arstechnica.com/?p=1751042#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1751042&comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da140e3f20f27476ccb282aac7934cb3ff95a33ea3c0074f9f6e5b2191759600","category":"Tech"}