{"title":"Exploring the therapeutic mechanisms of resveratrol for treating arecoline‐induced malignant transformation in oral epithelial cells: insights into hub targets","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13664?af=R","date":1719491350000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Betel nut chewing is a significant risk factor for oral cancer due to arecoline, its primary active component. Resveratrol, a non-flavonoid polyphenol, possesses anti-cancer properties. It has been shown to inhibit arecoline-induced oral malignant cells in preliminary experiments but the underlying mechanism remains unclear. This research therefore aimed to explore the potential therapeutic targets of resveratrol in treating arecoline-induced oral cancer.</p>\n<h2>METHODS</h2>\n<p>Data mining identified common targets and hub targets of resveratrol in arecoline-induced oral cancer. Gene set variation analysis (GSVA) was used to score and validate the expression and clinical significance of these hub targets in head and neck cancer (HNC) tissues. Molecular docking analysis was conducted on the hub targets. The effect of resveratrol intervention on hub targets was verified by experiments.</p>\n<h2>RESULTS</h2>\n<p>Sixty-one common targets and 15 hub targets were identified. Hub targets were highly expressed in HNC and were associated with unfavorable prognoses. They played a role in HNC metastasis, epithelial-mesenchymal transition, and invasion. Their expression also affected immune cell infiltration and correlated negatively with sensitivity to chemotherapeutic agents such as bleomycin and docetaxel. Experiments demonstrated that resveratrol down-regulated the expression of the hub targets, inhibited their proliferation and invasion, and induced apoptosis.</p>\n<h2>CONCLUSION</h2>\n<p>Resveratrol inhibits the arecoline-induced malignant phenotype of oral epithelial cells by regulating the expression of some target genes, suggesting that resveratrol may be used not only as an adjuvant treatment for oral cancer, but also as an adjuvant for oral cancer prevention due to its low toxicity and high efficacy. © 2024 Society of Chemical Industry.</p>","author":"Zhen Sun, \nXiaopeng Guo, \nChangya Li, \nJunjun Ling, \nAoshuang Chang, \nHouyu Zhao, \nXianlu Zhuo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"da1cb820243640fbcf4edc8691534a0ffe72d8aec46ad87e599b4e83dae6ae07","category":"Environment"}