{"title":"App Store scammer bilks $600K in bitcoin from iPhone user","link":"https://www.macworld.com/article/342142/app-store-scammer-bilks-600k-in-bitcoin-from-iphone-user.html","date":1617205669000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>When iPhone user Phillipe Christodoulou downloaded the Trezor app from the App Store in February, he thought he was getting a way to check his bitcoin balance by plugging his Trezor device into his iPhone&rsquo;s Lightning port via a micro USB-to-Lightning adapter. Instead, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.washingtonpost.com/technology/2021/03/30/trezor-scam-bitcoin-1-million/&amp;xcust=1-1-342142-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">the Washington Post reports</a>, he lost his entire savings in an instant&mdash;17.1 bitcoin worth $600,000.</p>\n\n\n\n<p>Trezor is not a fly-by-night bitcoin company. It was one of the first companies to offer a personal hardware wallet and has been endorsed by Twitter&rsquo;s Jack Dorsey. But Trezor doesn&rsquo;t make an iPhone app and its U2F hardware token doesn&rsquo;t work with the iPhone. Trezor&rsquo;s website does state that, &ldquo;Use of your Trezor device on iOS is currently not (yet) supported,&rdquo; but unless you&rsquo;re diving into the tech specs you could miss it.</p>\n\n\n\n<p>The device Christodoulou used stores a personal 12- to 24-word recovery seed and has a display &ldquo;to fully inform you about the authentication request before you approve it.&rdquo; The app he used seemingly took that information to siphon bitcoin from his account. </p>\n\n\n\n<p>But Christodoulou doesn&rsquo;t blame Trezor for the theft. He blames Apple for approving the app in the first place. Apple told the Washington Post, &ldquo;In the limited instances when criminals defraud our users, we take swift action against these actors as well as to prevent similar violations in the future,&rdquo; and a search in the App Store for a Trezor app doesn&rsquo;t bring up any specific results. Apple declined to tell the Washington Post whether it has contacted the authorities about the app.</p>\n\n\n\n<p>According to the publication, Apple approved the app as &ldquo;a &lsquo;cryptography&rsquo; app that would encrypt iPhone files and store passwords,&rdquo; and the developer specifically told Apple that it was &ldquo;not involved in any cryptocurrency.&rdquo; However, it quickly changed itself into a cryptocurrency wallet, which Apple doesn&rsquo;t allow but also doesn&rsquo;t track until alerted by a user. Once it was notified of this particular scam, Apple removed the app and a follow-up app that appeared days later in the store.</p>\n\n\n\n<p>Apple told Christodoulou it is looking into the issue, but it&rsquo;s unlikely he&rsquo;s the last iPhone user to suffer such a scam. In the same report, in fact, iPhone user James Fajcz also claims he was duped by a fake Trezor app to the tune of $14,000.</p>\n</div></body></html>","author":"Michael Simon","siteTitle":"How to share a Mac’s drive with another Mac, whether Intel or Apple silicon","siteHash":"539a74e02eb4d5300027eb3e5fed7a754910a96d4e4f390bdaa8c3ed1b979e5d","entryHash":"da22ba66479e39c4db812a768e01f286e6565a7ffacd4c5b5c9fdc6131372abe","category":"Apple"}