{"title":"Giraffe productivity and calf survival in a savannah area outside an east African protected area: Implications for conservation","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13265?af=R","date":1713250800000,"content":"<h2>Abstract</h2>\n<p>Protection of nursery areas where newborn survival is successful is critical to recovery of endangered mammals. In Kenya, 2014 to 2022, we surveyed Endangered Masai giraffes (<i>Giraffa camelopardalis tippelskirchi</i>) on the Siria Plateau at Oloirien Group Ranch (OGR) and Oloisukut Conservancy (OC), and in the Rift Valley's Mara Triangle Conservancy (MTC). MTC and OC have high lion densities while OGR does not. Using counts and photographic mark-recapture (PMR), we estimated percentages of newborn (&lt;3 months) and juvenile giraffe calves (&lt;1 year) per adult female and per total giraffes sampled. Cormack-Jolly-Seber models were used to estimate annual survival of giraffes at OGR. The mean percentage of newborn calves: adult female at OGR (~18%) was significantly higher than at OC (3.3%) and MTC (0%). The mean juvenile: adult female percentage at the Siria Plateau sites was 62 ± 12.8% versus 12% in MTC. Total juvenile calves averaged 22% on the plateau, four times higher than MTC (5.3%). At OGR, giraffe survival for all ages and sexes was 0.86, higher than protected areas with lions. Only one female giraffe in 229 used both plateau sites, suggesting independent matrilines. Human-populated savannah next to reserves contributes to giraffe recovery, but nursery areas like OGR need robust protection.</p>\n<h2>Résumé</h2>\n<p>La protection des zones d’élevage, où la survie des nouveau-nés est assurée, est essentielle au rétablissement des mammifères menacés. Au Kenya, de 2014 à 2022, nous avons étudié les girafes Masai (Giraffa camelopardalis tippelskirchi) en voie de disparition sur le plateau de Siria à Oloirien Group Ranch (OGR) et Oloisukut Conservancy (OC), et dans le Mara Triangle Conservancy (MTC) de la vallée du Rift. Le MTC et l’OC ont une forte densité de lions, ce qui n’est pas le cas de l’OGR. En utilisant des comptages et des marquages-recaptures photographiques (PMR), nous avons estimé les pourcentages de nouveau-nés (&lt; 3 mois) et de jeunes girafes (&lt; 1 an) par femelle adulte et par l’ensemble des girafes échantillonnées. Les modèles de Cormack-Jolly-Seber ont été utilisés pour estimer la survie annuelle des girafes à l’OGR. Le pourcentage moyen de nouveau-nés girafes par femelle adulte à l’OGR (~18 %) était considérablement plus élevé qu’à l’OC (3,3 %) et au MTC (0 %). Le pourcentage moyen de jeunes par rapport aux femelles adultes sur les sites du plateau de Siria était de 62 ± 12,8 % contre 12 % dans le MTC. Le nombre total de jeunes girafes était en moyenne de 22 % sur le plateau, soit quatre fois plus que dans le MTC (5,3 %). À l’OGR, le taux de survie des girafes, tous âges et sexes confondus, était de 0,86, soit plus élevé que dans les zones protégées où vivent des lions. Seule une girafe femelle sur 229 a utilisé les deux sites du plateau, ce qui suggère des matrilignes indépendantes. La savane peuplée d’hommes à proximité des réserves contribue au rétablissement des girafes, mais les zones d’élevage comme l’OGR nécessitent une protection solide.</p>","author":"C. Dustin Becker, \nPetra Elisabeth Campbell, \nLeslie Ann Kadane, \nReuben Kilutori Nagut, \nDavid Limpaso Kinata, \nHenry C. Stevens","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"da29d7bf294171572ac8813b2b796bfa6aaacbbedae13bb1197170913fa62e0b","category":"Environment"}