{"title":"Projecting Global Mercury Emissions and Deposition Under the Shared Socioeconomic Pathways","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004231?af=R","date":1713245404000,"content":"<h2>Abstract</h2>\n<p>Mercury (Hg) is a naturally occurring element that has been greatly enriched in the environment by human activities like mining and fossil fuel combustion. Despite commonalities in some carbon dioxide (CO<sub>2</sub>) and Hg emission sources, the implications of long-range climate scenarios for anthropogenic Hg emissions have yet to be explored. Here, we present comprehensive projections of anthropogenic Hg emissions extending to the year 2300 and evaluate impacts on global atmospheric Hg deposition. Projections are based on four Shared Socioeconomic Pathways (SSPs) ranging from sustainable reductions in resource and energy intensity to rapid economic growth driven by abundant fossil fuel exploitation. There is a greater than two-fold difference in cumulative anthropogenic Hg emissions between the lower-bound (110 Gg) and upper-bound (235 Gg) scenarios. Hg releases to land and water are approximately six times those of direct emissions to air (600–1,470 Gg). At their peak, anthropogenic Hg emissions reach 2,200–2,600 Mg a<sup>−1</sup> sometime between 2010 (baseline) and 2030, depending on the SSP scenario. Coal combustion is the largest determinant of differences in Hg emissions among scenarios. Decoupling of Hg and CO<sub>2</sub> emission sources occurs under low-to mid-range scenarios, though contributions from artisanal and small-scale gold mining remain uncertain. Future Hg emissions may have lower gaseous elemental Hg (Hg<sup>0</sup>) and higher divalent Hg (Hg<sup>II</sup>), resulting in a higher fraction of locally sourced Hg deposition. Projected reemissions of previously deposited anthropogenic Hg follow a similar temporal trajectory to primary emissions, amplifying the benefits of primary Hg emission reductions under the most stringent mitigation scenarios.</p>","author":"Benjamin M. Geyman, \nDavid G. Streets, \nColin P. Thackray, \nChristine L. Olson, \nKevin Schaefer, \nElsie M. Sunderland","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"da2ef1bae938e7415660d982f8ae6330e6e6f1675366721b2e379269a4348350","category":"Environment"}