{"title":"Habitat remediation followed by managed connectivity reduces unwanted changes in evolutionary trajectory of high extirpation risk populations","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304276","date":1717077600000,"content":"<p>by Gina F. Lamka, Janna R. Willoughby</p>\r\n\r\nAs we continue to convert green spaces into roadways and buildings, connectivity between populations and biodiversity will continue to decline. In threatened and endangered species, this trend is particularly concerning because the cessation of immigration can cause increased inbreeding and loss of genetic diversity, leading to lower adaptability and higher extirpation probabilities in these populations. Unfortunately, monitoring changes in genetic diversity from management actions such as assisted migration and predicting the extent of introduced genetic variation that is needed to prevent extirpation is difficult and costly <i>in situ</i>. Therefore, we designed an agent-based model to link population-wide genetic variability and the influx of unique alleles via immigration to population stability and extirpation outcomes. These models showed that management of connectivity can be critical in restoring at-risk populations and reducing the effects of inbreeding depression. However, the rescued populations were more similar to the migrant source population (average F<sub>ST</sub> range 0.05–0.10) compared to the historical recipient population (average F<sub>ST</sub> range 0.23–0.37). This means that these management actions not only recovered the populations from the effects of inbreeding depression, but they did so in a way that changed the evolutionary trajectory that was predicted and expected for these populations prior to the population crash. This change was most extreme in populations with the smallest population sizes, which are representative of critically endangered species that could reasonably be considered candidates for restored connectivity or translocation strategies. Understanding how these at-risk populations change in response to varying management interventions has broad implications for the long-term adaptability of these populations and can improve future efforts for protecting locally adapted allele complexes when connectivity is restored.","author":"Gina F. Lamka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"da34cf2dcb7b53cb888e10d78f67cac6c942847da2d4495aabf9ab1a60f41014","category":"Interdisciplinary"}