{"title":"Study on CO2 Enhanced Oil Recovery and Storage in Near-depleted Edge-bottom Water Reservoirs","link":"https://www.preprints.org/manuscript/202409.2193/v1","date":1727429321000,"content":"Geological storage of carbon dioxide (CO2) is a crucial technology for mitigating global temperature rise. Near-depleted edge-bottom water reservoirs are attractive targets for CO2 storage, as they can not only enhance oil recovery (EOR) but also provide important potential candidates for geological storage. This study investigated CO2 enhanced oil recovery and storage for a typical near-depleted edge-bottom water reservoir that had been developed for a long time with a recovery factor of 51.93%. To improve the oil recovery and CO2 storage, new production scenarios are explored. At the near-depleted stage, by comparing the four different scenarios of water injection, gas injection, water alternating gas injection, and bi-directional injection, the highest additional recovery of 8.64% is achieved by the bi-directional injection scenario. Increasing the injection pressure leads to a higher gas-oil ratio and liquid production rate. After shifting from the near-depleted to depleted stage, the most effective approach to improve CO2 storage capacity is to increase reservoir pressure. At 1.4 times the initial reservoir pressure, the maximum storage capacity is 6.52×108 m3. However, excessive pressures boosting poses potential storage and leakage risks. Therefore, lower injection rates and longer intermittent injections are expected to achieve a larger amount of long-term CO2 storage. Through the numerical simulation study, a gas injection rate of 80,000 m3/day and a schedule of 4-6 years injection with 1 year shut-in was shown to be effective for the case considered. During 31 years of CO2 injection, the percentage dissolved CO2 increased from 5.46% to 6.23% during the near-depleted period, and to 7.76% during the depleted period. This study acts as a guide for the CO2 geological storage of typical near-depleted edge-bottom water reservoirs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"da3a82cd843d861724df20cf3f71b5486dd2db927e2a5030fce97d2c7e881bf4","category":"Interdisciplinary"}