{"title":"As cars get heavier, even small speed differences matter in a crash","link":"https://arstechnica.com/?p=1740226","date":1612710052000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Volvo-safety-event-8-800x451.jpg\" alt=\"An orange Volvo SUV after a crash test.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Volvo-safety-event-8.jpg\" class=\"enlarge-link\" data-height=\"1154\" data-width=\"2048\">Enlarge</a> <span class=\"sep\">/</span> A Volvo XC90 SUV following a crash test in Sweden. (credit: Jonathan Gitlin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>At the end of January, safety researchers at the AAA Foundation for Traffic Safety and the Insurance Institute for Highway Safety <a href=\"https://www.iihs.org/topics/bibliography/ref/2218\">published a study showing that small increases in speed have big consequences during a crash</a>. After crashing three identical cars at increasing speed, the study showed that a car that aces the test across the board at 40mph (64km/h), with just a 15 percent change of serious injury may get a failing grade overall, with a 59 percent chance of serious injury at 50mph (80km/h). At 56mph (90km/h), the result was even worse; the 50th percentile male crash test dummy only had a 21 percent chance of escaping serious injury or worse.</p>\n<p>No doubt, <a href=\"https://arstechnica.com/cars/2019/05/this-institute-crash-tests-cars-to-make-us-all-safer/\">the fact that vehicles are designed to pass a 45mph (73km/h) crash test</a> and not something at highway speed has something to do with the results of the study. But it's also a reminder of basic physics: a vehicle's kinetic energy is equal to half its mass multiplied by the square of its speed. So, the average US light-duty vehicle—<a href=\"https://www.forbes.com/sites/samabuelsamid/2019/01/03/new-vehicles-keep-getting-heavier-or-are-they/?sh=780f2ca64518\">which weighs about 4,000lbs (1,814kg)</a>—has 11.2kJ when it's traveling at 25mph (40km/h) but 22kJ at 35mph (56km/h), a fact that people can use next time someone complains that city speed limits are too slow.</p>\n<p>But speed is, literally, only part of the equation. Local authorities can set limits on how fast we can drive, but no one's going to stop you buying a 5,000lb (2,268kg) car instead of a 4,000lb one. And big cars are attractive to the general public. Ironically, much of this trend is fueled by the fact that safety sells, and the biggest, heaviest cars are the safest—for their occupants, at least. Pedestrians or people in older or smaller cars? Not so much.</p></div><p><a href=\"https://arstechnica.com/?p=1740226#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1740226&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da4279f17b32748f9fb6be5e6042e5050f07b8a4e62823b5e24e84afa4fb09ea","category":"Tech"}