{"title":"Examining btrfs, Linux’s perpetually half-finished filesystem","link":"https://arstechnica.com/?p=1780232","date":1632483025000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1320378299-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1320378299.jpg\">Enlarge</a> <span>/</span> We don't recommend allowing btrfs to directly manage a complex array of disks—floppy or otherwise. (credit: <a href=\"https://www.gettyimages.com/detail/photo/old-floppy-disk-mountain-compared-to-usb-memory-royalty-free-image/1320378299\">Faustino Carmona Guerrero via Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Btrfs—short for \"B-Tree File System\" and frequently pronounced \"butter\" or \"butter eff ess\"—is the most advanced filesystem present in the mainline Linux kernel. In some ways, btrfs simply seeks to supplant ext4, the default filesystem for most Linux distributions. But btrfs also aims to provide next-gen features that break the simple \"filesystem\" mold, combining the functionality of a RAID array manager, a volume manager, and more.</p>\n<p>We have good news and bad news about this. First, btrfs is a perfectly cromulent single-disk ext4 replacement. But if you're hoping to replace ZFS—or a more complex stack built on discrete RAID management, volume management, and simple filesystem—the picture isn't quite so rosy. Although the btrfs project has fixed many of the glaring problems it launched with in 2009, other problems remain essentially unchanged 12 years later.</p>\n<h2>History</h2>\n<p>Chris Mason is the founding developer of btrfs, which he began working on in 2007 while working at Oracle. This leads many people to believe that btrfs is an Oracle project—it is not. The project belonged to Mason, not to his employer, and it remains a community project unencumbered by corporate ownership to this day. In 2009, btrfs 1.0 was accepted into the mainline Linux kernel <a href=\"https://www.linux-magazine.com/Online/News/Kernel-2.6.29-Corbet-Says-Btrfs-Next-Generation-Filesystem\">2.6.29</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1780232#p3\">Read 54 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780232&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da4481fa7bf353d7fc6dedd4a2ce7f1dc996a9a7403a1f9222d2a1e63fdf4b5f","category":"Tech"}