{"title":"Detection of Mulberry Leaf Diseases in Natural Environments Based on Improved YOLOv8","link":"https://www.preprints.org/manuscript/202406.1021/v1","date":1718359659000,"content":"Mulberry leaves, when infected by pathogens, can suffer significant yield loss or even death if early disease detection and timely spraying are not performed. To enhance the detection performance of mulberry leaf diseases in natural environments and to precisely locate early small lesions, we propose a high-precision, high-efficiency disease detection algorithm named YOLOv8-RFMD. Based on improvements to You Only Look Once version 8 (YOLOv8), we first proposed the Multi Dimension Feature Attention (MDFA) module, which integrates important features at the pixel-level, spatial and channel dimensions. Building on this, we designed the RFMD Module, which consists of the Conv-BatchNomalization-SiLU (CBS) module, Receptive-Field Coordinated Attention (RFCA) Conv, and MDFA, replacing the Bottleneck in the model’s Residual block. We then employed Adown down sampling structure to reduce the model size and computational complexity. Finally, to improve the detection precision of small lesion features, we replaced the complete intersection over union (CIOU) loss function with the Normalized Wasserstein Distance (NWD) loss function. Results show that the YOLOv8-RFMD model achieves an mAP50 of 94.3% and an mAP50:95 of 67.8% on experimental data, representing increases of 2.9% and 4.3% respectively compared to the original model. The model size is reduced by 0.53 MB to just 5.45 MB, and the number of floating-point operations is reduced by 0.3 G to only 7.8 G. The improved model meets the deployment requirements of mobile embedded devices and can provide a theoretical reference for the automated spraying operations of mulberry leaves.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"da46d87122b41be5b69d28218b32b54dca5ce675b541cd6dfaf86a95f00a7972","category":"Interdisciplinary"}