{"title":"Our essential training plan for mountain biking","link":"https://www.bikeradar.com/advice/fitness-and-training/mountain-bike-training/","date":1691589613000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/08/GettyImages-1241236069-e414aaa.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"France's Myriam Nicole competes during the Women's Downhill Competition of the UCI Mountain Bike World Cup in Leogang, Austria, on June 11, 2022. - Austria OUT (Photo by JFK / APA / AFP) / Austria OUT (Photo by JFK/APA/AFP via Getty Images).\" title=\"CYCLING-MOUNTAIN BIKING-WC-WOMEN-AUT\" />                                            <p>Mountain biking demands a high level of fitness and a mix of physical, technical and mental abilities.</p>\n<p>Whether gravity or endurance-focused, as a mountain biker, you’ll need to blend skills such as cornering fast and spotting good lines with the strength to produce high-power bursts repeatedly on loose terrain.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-training-plan/\">Training plans</a> for mountain biking can be quite different from the approaches you might take for other cycling disciplines, such as road or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/gravel-riding-training-plan/\">gravel riding</a>.</p>\n<p>In this guide, we take a closer look at how you can get in shape specifically for mountain biking and what you’ll need to know to do so.</p>\n<h2>How do MTB disciplines differ and what does this mean for training?</h2>\n<p>One way to start getting fit for mountain biking is by understanding the demands of the different <a href=\"https://www.bikeradar.com/advice/fitness-and-training/mountain-bike-race-formats-explained/\">mountain bike race formats</a> so you can tailor the type of rides and training sessions you do in preparation.</p>\n<h3>Cross-country mountain biking</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"CANNOCK, ENGLAND - AUGUST 03: Isla Short of Team Scotland competes during the Women's Cycling Mountain Bike Cross-country Final on day six of the Birmingham 2022 Commonwealth Games at Cannock Chase Forest on August 03, 2022 in Cannock, England. (Photo by Justin Setterfield/Getty Images)\" title=\"Cycling Mountain Bike - Commonwealth Games: Day 6\" /></div><div><figcaption><span><i></i> XC racing tests a rider’s endurance and fatigue resistance.</span></figcaption><span> <i>Justin Setterfield / Getty Images</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-country-racing-guide/\">Cross-country (XC) racing disciplines</a>, such as Olympic, short track and marathon, test a rider’s endurance and fatigue resistance.</p>\n<p>Riders will often hover around 80 to 90 per cent of their maximum heart rate, depending on the length of the race.</p>\n<p>Olympic-distance cross-country mountain bike racing has been reported to be one of the most aerobically taxing sports, second only to cross-country skiing, with pro riders having among the highest <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> values ever recorded.</p>\n<p>Race intensities usually start out high from the gun, with the course quickly narrowing down into singletrack. A good sprint off the start line is key to getting a strong position and not being held up by slower riders.</p>\n<p>Although at first glance the intensity profile of MTB XC racing might seem similar to a road race in its punchy nature, a key difference between the two is the intensity really never lets up in XC racing.</p>\n<p>There’s often no peloton you can sit within to shelter and recover, and typically very minimal drafting. The only real chance to get some respite is on descents, but even these are still very physically taxing, given you’re having to lift and manoeuvre your bike around the terrain.</p>\n<p>We see this reflected in athletes’ heart rate data, which doesn’t recover on descents as much as you might expect if it were on the road.</p>\n<h3>Downhill mountain biking</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"France's Loic Bruni competes in the men's elite mountain bike downhill final at the Nevis Range Mountain Resort, near Fort William in the Scottish Highlands, during the UCI Cycling World Championships in Scotland on August 5, 2023. (Photo by ANDY BUCHANAN / AFP) (Photo by ANDY BUCHANAN/AFP via Getty Images)\" title=\"CYCLING-MOUNTAIN BIKE-DOWNHILL-WC-MEN-FINAL\" /></div><div><figcaption><span><i></i> Upper-body strength and strength endurance are key to downhill mountain biking.</span></figcaption><span> <i>Andy Buchanan / AFP / Getty Images</i></span></div>\n<p>Downhill racing is yet another beast. Good technical skill is a big prerequisite of this discipline. However, upper-body strength and strength endurance (the ability to keep producing force over a longer time frame) are also needed in order to maintain control over and around obstacles.</p>\n<p>Short, hard sprints are also a common feature. A well-developed base of aerobic fitness will help keep a good supply of oxygen flowing to the working muscles and the brain to maintain concentration.</p>\n<h3>Enduro racing</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Male mountain biker Alex Evans riding a We Are One Arrival 152 enduro mountain bike fitted with SRAM's XX T-Type Eagle Transmission Powermeter AXS groupset\" title=\"SRAM XX T-Type Eagle Transmission Powermeter AXS groupset-12\" /></div><div><figcaption><span><i></i> Enduro demands a mix of endurance and upper-body strength.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/beginners-guide-to-enduro-racing/\">Enduro racing</a> is in many ways a combination of marathon and downhill racing, usually incorporating timed downhill sections, interspersed with lower-intensity riding, that can amount to many hours in the saddle.</p>\n<p>The overall intensity of Enduro racing isn’t as high as for marathon racing, but the ability to ride for many hours while keeping something in the tank for later runs is essential.</p>\n<h2>Types of MTB fitness to work on</h2>\n<p>Just as there are several disciplines within mountain biking, there are different components of the fitness needed to ride strongly and perform well off-road.</p>\n<h3>Repeatability and sustained power</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Vitus E-Mythique LT VRX electric enduro mountain bike ridden by BikeRadar's Senior Technical EditorAlex Evans on Angry Sheep in Innerleithen, Scotland\" title=\"Vitus E-Mythique LT VRX 9\" /></div><div><figcaption><span><i></i> Repeatability depends a lot on endurance.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>The ability to repeat hard efforts throughout a ride or race is key to cross-country and enduro.</p>\n<p>Repeatability depends a lot on your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-endurance/\">endurance</a>, which itself relies upon your ability to tap into your body’s fat stores as a source of fuel between efforts, as well as muscular strength.</p>\n<p>It also helps to have a good VO2 max, or capacity to take on and process oxygen to produce energy, because this helps you recover faster from hard efforts.</p>\n<p>We often hear about the idea of ‘burning matches’ in punchy races, where every hard effort above the rider’s maximal sustainable power expends a ‘match’. Having a higher VO2 max can help make these matches bigger and restock your matchbox during a race.</p>\n<p>Repeatability is particularly relevant for short-track and Olympic-distance cross-country, where there are typically many hard efforts per lap.</p>\n<p>Marathon and enduro races, as well as long mountain bike rides in general, rely a little less on the ability to repeat high-power efforts and are more about sustained power. In other words, the ability to keep plugging away hour after hour at a moderate tempo. This also depends on endurance, but additionally on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP</a> or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">critical power</a>.</p>\n<p>Downhill racing is less reliant on repeatability and sustained power. That being said, the types of training that develop these fitness attributes are also good for developing general aerobic fitness.</p>\n<p>This can still be helpful for downhill riding because it will help prevent you from working too close to your aerobic limits, which would compromise your ability to maintain concentration.</p>\n<h4>How to improve repeatability and sustained power</h4>\n<p>You can develop your repeatability and sustained power by:</p>\n<ul><li>Including plenty of long, low-intensity rides performed at zone 2 <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zone</a> intensity (i.e. between roughly 55 and 75 per cent of your FTP or a 3-4/10 effort level) within your training.</li>\n<li>Doing rides that are a little longer than your norm. For example, if you usually ride up to 3 hours, try stretching this out to 3.5 hours. Alternatively, you can add some ‘fatigue-resistance’ efforts to the end of your longer rides, such as 5x 2 minutes at FTP or a 7/10 effort.</li>\n<li>Working on leg strength through lifting heavy weights.</li>\n</ul><p>If you particularly want to develop repeatability, you can also include <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">intervals</a> that target VO2 max. A good session involves 4-5x 6 minutes at around 102-108 per cent FTP or an 8/10 effort, with roughly 4 minutes of recovery.</p>\n<p>As you get better at this session, you can add a 30-second hard start at the beginning of each effort (at around 120-130 per cent FTP or a 9/10 effort) to help lift your oxygen consumption and heart rate more rapidly.</p>\n<p>To target sustained power, you might want to focus more on longer intervals at a ‘sweet spot’ intensity (roughly 80-95 per cent FTP, or around a 5/10 effort level). A good example would be 3x 15-minute efforts.</p>\n<p>Take care not to do these intervals too often though, because they can create a lot of fatigue. They should be repeated no more than twice per week, or once per week if you’re also doing other types of intervals.</p>\n<h3>Short-duration power</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"IZU, JAPAN - JULY 27: (L-R) Detailed view of Sina Frei and Linda Indergand of Team Switzerland ride during the Women's Cross-country race on day four of the Tokyo 2020 Olympic Games at Izu Mountain Bike Course on July 27, 2021 in Izu, Shizuoka, Japan. (Photo by Tim de Waele/Getty Images)\" title=\"Cycling - Mountain Bike - Olympics: Day 4\" /></div><div><figcaption><span><i></i> XC races often include climbs between 30 seconds and 5 minutes.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>Many cross-country courses involve punchy climbs lasting between 30 seconds and 5 minutes. This is often where a winning move is made, and short-duration power is a key attribute to hone.</p>\n<p>Your short-duration power will depend on your ability to tap into your so-called ‘fast twitch’ muscle fibres, and to generate energy through a process called ‘glycolysis’. It is closely linked with VO2 max.</p>\n<h4>How to improve your short-duration power</h4>\n<p>Building short-duration power can be achieved by:</p>\n<ul><li>Performing intervals that last between 30 and 90 seconds at near-maximum intensity, allowing plenty of time to recover between efforts (generally, recoveries should last six times the length of the interval). An example would be 6x 60 seconds near-max efforts, with 6 minutes of recovery between each effort.</li>\n<li>Performing VO2 max intervals, like the 4-5x 6-min efforts described above.</li>\n<li>Working on leg strength through lifting heavy weights.</li>\n</ul><p>Short-duration power is slightly less relevant for downhill and enduro riding, which typically involve even shorter sprints lasting just a few seconds.</p>\n<h3>Sprints</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Focus Jam2 SL 9.9 full suspension mountain eBike - eMTB\" title=\"Focus Jam2 SL 9.9 - 07\" /></div><div><figcaption><span><i></i> Sprinting ability is essential for enduro and downhill riding.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>A sprint generally lasts between 5 and 20 seconds. A good ability to sprint is critical for downhill and enduro racing because there’s often limited opportunity to put down power between technical sections of a descent.</p>\n<p>In these disciplines, sprinting is often performed at a high <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> and speed.</p>\n<p>Sprinting is also important in cross-country, particularly short-track and Olympic-distance racing, in order to get a good position off the start line and into the singletrack.</p>\n<p>In this case, the sprint is performed from standing, and will usually start with a high-torque effort, building cadence as you get up to speed.</p>\n<h4>How to improve your sprinting</h4>\n<p>The ability to sprint is a lot to do with how well your neuromuscular system can ‘switch on’ your fast-twitch muscle fibres and tell these to contract in synchrony. It’s therefore mainly a case of practising sprints in training to improve neural connectivity.</p>\n<p>You should make sure the characteristics of your sprints simulate the conditions in racing. So try doing standing-start sprints if you’re training for cross-country, and high-speed, high-cadence sprints if targeting downhill or enduro.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/strength-training-cycling/\">Weight training</a> and plyometrics can also help improve sprint ability. If using weights, aim for roughly 6-8 reps per set, selecting a weight that’s challenging, but also light enough that you can perform the concentric movement (the part where the muscle shortens) explosively.</p>\n<h3>Upper-body strength</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Haibike Lyke CF 11 full suspension mountain eBike - eMTB\" title=\"Haibike Lyke CF 11 - 03\" /></div><div><figcaption><span><i></i> Mountain biking uses the upper body to help lift and manoeuvre the bike.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>One big difference between road cycling and mountain biking is the extent to which the upper body is used to help lift and manoeuvre the bike over technical terrain.</p>\n<p>The forearms, wrists and hands typically take the brunt of this, but it also helps to have good <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-build-a-stronger-core/\">core strength</a>, so working on these abilities, in particular, should be a focus of all types of MTB training, especially for downhill and enduro.</p>\n<h4>How to improve your upper-body strength</h4>\n<p>Some ways to help develop upper-body strength include:</p>\n<ul><li>Doing longer rides on your mountain bike, on rough terrain. This is arguably one of the best ways to improve your upper-body strength for mountain biking because you’re engaging the muscles you use most for the sport. However, you can also work on things such as grip strength in the gym. Doing deadlifts with a kettlebell or barbell requires to you lift and hold a heavy weight in a similar motion to on the bike.</li>\n<li>Following a twice-weekly core strength routine that targets the abdominals, lower back and glutes.</li>\n</ul><h3>Importance of different abilities by MTB discipline</h3>\n<p>The table below shows the relative importance of repeatability, sustained power, short-duration power, sprints and upper-body strength across different mountain bike disciplines.</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th></th><th>Repeatability </th><th>Sustained power</th><th>Short-duration power</th><th>Sprints</th><th>Upper-body strength </th></tr></thead><tbody><tr><td><b>Short-track cross-country</b></td><td>✭✭✭✭✭</td><td>✭✭✭✩✩</td><td>✭✭✭✭✭</td><td>✭✭✭✩✩</td><td>✭✭✭✩✩</td>        </tr><tr><td><b>Olympic cross-country</b></td><td>✭✭✭✭✭</td><td>✭✭✭✭✩</td><td>✭✭✭✭✩</td><td>✭✭✭✩✩</td><td>✭✭✭✩✩</td>        </tr><tr><td><b>Marathon cross-country</b></td><td>✭✭✭✭✩</td><td>✭✭✭✭✭</td><td>✭✭✭✩✩</td><td>✭✭✩✩</td><td>✭✭✭✩✩</td>        </tr><tr><td><b>Enduro</b></td><td>✭✭✭✩✩</td><td>✭✭✭✭✩</td><td>✭✭✩✩✩</td><td>✭✭✭✭✩</td><td>✭✭✭✭✭</td>        </tr><tr><td><b>Downhill</b></td><td>✭✭✩✩✩</td><td>✭✩✩✩✩</td><td>✭✭✩✩✩</td><td>✭✭✭✭✭</td><td>✭✭✭✭✭</td>        </tr></tbody></table></div>\n\n<h2>Switching between MTB and road riding</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ribble CGR Ti Enthusiast road bike\" title=\"Ribble CGR Ti Enthusiast - 21\" /></div><div><figcaption><span><i></i> If you switch between disciplines, build your base fitness and then tailor your training later in the season.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Many of the fitness attributes you will develop in mountain bike training (particularly cross-country and enduro) overlap with road cycling.</p>\n<p>The key to switching between disciplines often lies in spending time <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">building your base</a> of aerobic fitness and endurance early in the year when you’re not competing. When you’re a month or two out from your competitions, you can start to ‘fine-tune’ your fitness profile to suit the demands of any upcoming rides or events.</p>\n<p>For example, if you’re planning to do a <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-a-sportive/\">sportive</a> or <a href=\"https://www.bikeradar.com/features/routes-and-rides/audax/\">audax</a> on the road bike, you might prioritise training to work on sustained power and FTP in the lead-up to that event, and then switch to focusing on short-duration power and explosivity leading into an XC race.</p>\n<p>Make sure to train on both road and mountain bikes, and across various types of terrain, because in terms of muscle fibre recruitment, each will be a little different.</p>\n\n<h2>Tips for getting the most from your MTB training</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Cyclist in red top riding the Decathlon Rockrider MTB Race 900 Team Edition hardtail through woodland\" title=\"Decathlon Rockrider MTB Race 900 Team Edition - 16\" /></div><div><figcaption><span><i></i> Taking the time to measure your performance and understand your strengths and weaknesses is key to making the most of your MTB training.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>To help make sure you get the best results from your MTB training time and energy investment, here are some pointers and key considerations.</p>\n<h3>Get your base training in early</h3>\n<p>The earlier part of the year is the time to work on your sustainable power and repeatability.</p>\n<p>Because these abilities are developed largely through higher volumes of lower-intensity riding, it can be hard to develop them once you get to the summer months. By then, you’ll be spending a lot of your time either tapering, racing or recovering.</p>\n<h3>Get specific</h3>\n<p>When you get closer to an event or race season, aim to do your interval sessions on the mountain bike and on loose, rough terrain.</p>\n<p>This will feel quite different from performing efforts when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor training</a> or on the road because you’ll be recruiting your muscle fibres a little differently.</p>\n<h3>Balance your intensity</h3>\n<p>Try to make sure you have a balance between higher-intensity and lower-intensity riding within your week.</p>\n<p>Even if you’re time-limited, low-intensity riding is really important for developing sustainable power and repeatability, and isn’t something that can be short-cut by just adding extra intensity.</p>\n<p>As a general rule, we recommend no more than two harder sessions per week (i.e. sessions that have substantial time spent above 75 per cent FTP or 70 per cent max heart rate), with the remainder being low-intensity.</p>\n<h3>Don’t neglect your skills</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Man bunny hopping on bike.\" title=\"How to bunnyhop\" /></div><div><figcaption><span><i></i> Try building skills training into endurance rides.</span></figcaption><span></span></div>\n<p>It can be tricky figuring out how to incorporate skills training alongside fitness development sessions without making all of your rides fairly high-intensity.</p>\n<p>We recommend incorporating skills training into the mid-point of your long endurance rides (which are quite fatiguing), or before or after a set of intervals. This means your easier rides in the week remain easy.</p>\n<p>You can also replace your interval sessions, aiming to ride technical terrain at pace.</p>\n<h3>Plan strength training carefully</h3>\n<p>In order to make sure you still have some easy days in your week, try to perform any strength or weight training on a harder bike training day.</p>\n<p>It’s common for people to schedule this type of training on their days off the bike, but this can mean you never get the chance to properly recover between harder sessions.</p>\n<h3>Understand your strengths and limiters</h3>\n<p>Try to always be gathering both subjective and objective data on where you may be stronger or weaker so that you know where to focus your MTB training attention.</p>\n<p>For example, if you are training for marathon rides and races and you’re already adept at punchy efforts but struggle with sustained power, then spending more time in the saddle or performing longer efforts would be a smart move.</p>\n<p>Likewise, if you are training for downhill and notice you struggle with putting down power in short sprints, then build some sprinting workouts into your training.</p>\n<h3>Track your progress</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Garmin Fenix 6 Pro Solar GPS smartwatch\" title=\"Garmin Fenix 6 Pro Solar GPS smartwatch-9\" /></div><div><figcaption><span><i></i> It’s a good idea to find ways to measure your fitness.</span></figcaption><span> <i>Alex Evans / Immediate Media</i></span></div>\n<p>Find ways to test your fitness to measure how you’re improving.</p>\n<p>The testing protocols you use should be relevant to the fitness attributes you’re trying to develop.</p>\n<p>If you’re trying to build your short-duration power and you <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">train with power</a>, then perhaps test your maximum 1-minute and 5-minute power every eight weeks.</p>\n<p>If you’re looking to build repeatability, then try performing a short maximum effort at the start and end of a long ride, and look at how much your power has changed.</p>\n<h3>Vary your cadence</h3>\n<p>Think about performing efforts at a lower cadence and/or standing out of the saddle to more closely replicate real-world riding conditions.</p>","author":"Tom Bell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"da522ddc770f04966c742850aee6024e08e7e96891a033c5401cde1de97f6849","category":"Cycling"}