{"title":"File Access Auditing Is Now Available for Amazon FSx for Windows File Server","link":"https://aws.amazon.com/blogs/aws/file-access-auditing-is-now-available-for-amazon-fsx-for-windows-file-server/","date":1623186291000,"content":"<p><a href=\"https://aws.amazon.com/fsx/windows/\">Amazon FSx for Windows File Server</a> provides fully managed file storage that is accessible over the industry-standard Server Message Block (SMB) protocol. It is built on Windows Server and offers a rich set of enterprise storage capabilities with the scalability, reliability, and low cost that you have come to expect from AWS.</p> \n<p>In addition to key features such as user quotas, end-user file restore, and Microsoft Active Directory integration, the team has now added support for the auditing of end-user access on files, folders, and file shares using Windows event logs.</p> \n<p><strong><u>Introducing File Access Auditing</u></strong><br /> File access auditing allows you to send logs to a rich set of other AWS services so that you can query, process, and store your logs. By using file access auditing, enterprise storage administrators and compliance auditors can meet security and compliance requirements while eliminating the need to manage storage as logs grow over time. File access auditing will be particularly important to regulated customers such as those in the financial services and healthcare industries.</p> \n<p>You can choose a destination for publishing audit events in the Windows event log format. The destination options are logging to <a href=\"http://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html\">Amazon CloudWatch Logs</a> or streaming to <a href=\"https://aws.amazon.com/kinesis/data-firehose/\">Amazon Kinesis Data Firehose</a>. From there, you can view and query logs in <span>CloudWatch Logs</span>, archive logs to <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>, or use AWS Partner solutions, such as Splunk and Datadog, to monitor your logs.</p> \n<p>You can also set up Lambda functions that are triggered by new audit events. For example, you can configure <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> and <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/AlarmThatSendsEmail.html\">Amazon CloudWatch alarms</a> to send a notification to data security personnel when unauthorized access occurs.</p> \n<p><strong><u>Using File Access Auditing on a New File System</u></strong><br /> To enable file access auditing on a new file system, I head over to the Amazon FSx console and choose <strong>Create file system</strong>. On the <strong>Select file system type</strong> page, I choose <strong>Amazon FSx for Windows File Server</strong>, and then configure other settings for the file system. To use the auditing feature, <strong>Throughput capacity</strong> must be at least <strong>32 MB/s</strong>, as shown here:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/02/Picture-1.png\" /></p> \n<p>In <strong>Auditing</strong>, I see that <strong>File access auditing</strong> is turned on by default. In <strong>Advanced</strong>, for <strong>Choose an event log destination</strong>, I can change the destination for publishing user access events. I choose <strong><span>CloudWatch Logs</span></strong> and then choose a <span>CloudWatch Logs</span> log group in my account.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/02/Picture-2.png\" /></p> \n<p>After my file system has been created, I launch a new <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> Instance and join it to my Active directory. When the instance is available, I connect to it using a remote desktop client. I open File Explorer and follow the <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/getting-started-step2.html\">documentation</a> to map my new file system.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/07/file-share0.jpg\" /></p> \n<p>I open the file system in Windows Explorer and then right-click and select <strong>Properties</strong>. I choose <strong>Security</strong>, <strong>Advanced</strong>, and <strong>Auditing</strong> and then choose <strong>Add</strong> to add a new auditing entry. On the page for the auditing entry, in <strong>Principal</strong>, I click <strong>Select a principal</strong>. This is who I will be auditing. I choose <strong>Everyone</strong>. Next, for <strong>Type</strong>, I select the type of auditing I want (Success/Fail/All). Under <strong>Basic permissions</strong>, I select <strong>Full control</strong> for the permissions I want to audit for.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/08/auditing-entry-10.jpg\" /></p> \n<p>Now that auditing is set up, I create some folders and create and modify some files. All this activity is now being audited, and the logs are being sent to <span>CloudWatch Logs</span>.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/08/file-share-create-files0.jpg\" /></p> \n<p>In the CloudWatch Logs Insights console, I can start to query the audit logs. Below you can see how I ran a simple query that finds all the logs associated with a specific file.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/08/log-insights0.jpg\" /></p> \n<p><strong><u>Continued Momentum</u></strong><br /> File access auditing is one of many features the team has launched in recent years, including: <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/self-managed-AD.html\">Self-Managed Directories</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/high-availability-multiAZ.html\">Native Multi-AZ File Systems</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/sql-server.html\">Support for SQL Server</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/shadow-copies-fsxW.html\">Fine-Grained File Restoration</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/supported-fsx-clients.html#on-premise-access\">On-Premises Access</a>, a <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/remote-pwrshell.html\">Remote Management CLI</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/using-data-dedup.html\">Data Deduplication</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/managing-file-shares.html#manage-file-shares-pwrshell\">Programmatic File Share Configuration</a>, <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/manage-encrypt-in-transit.html\">Enforcement of In-Transit Encryption</a>, <a href=\"https://aws.amazon.com/blogs/aws/amazon-fsx-for-windows-file-server-storage-size-and-throughput-capacity-scaling/\">Storage Size and Throughput Capacity Scaling</a>, and <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/managing-user-quotas.html\">Storage Quotas</a>.</p> \n<p><strong><u>Pricing</u></strong><br /> File access auditing is free on Amazon FSx for Windows File Server. Standard pricing applies for the use of <a href=\"https://aws.amazon.com/cloudwatch/pricing/\">Amazon CloudWatch Logs</a>, <a href=\"https://aws.amazon.com/kinesis/data-firehose/pricing/?nc=sn&amp;loc=3\">Amazon Kinesis Data Firehose</a>, any downstream AWS services such as <a href=\"https://aws.amazon.com/redshift/\">Amazon Redshift</a>, <a href=\"https://aws.amazon.com/s3/\">S3</a>, or <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>, and any AWS Partner solutions like Splunk and Datadog.</p> \n<p><strong><u>Available Today<br /> </u></strong><strong>File access auditing</strong> is available today for all new file systems in all AWS Regions where Amazon FSx for Windows File Server is <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">available</a>. Check our <a href=\"https://docs.aws.amazon.com/fsx/latest/WindowsGuide/file-access-auditing.html\">documentation</a> for more details.</p> \n<a href=\"https://twitter.com/thebeebs\">— Martin</a>","author":"Martin Beeby","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"da64b1ed1e100289a637ad3859544279d358a876db288ca9d9ab9ccfcf2c2c54","category":"Tech"}