{"title":"218 Weaning weights associated with improved performance of grow-finish pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/225/7664943?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This study was conducted to evaluate the downstream impact of wean weight (WW) on finishing pig performance. Individual body weights (BW) were recorded at the time of weaning using the LeeO individual animal identification system. Finisher performance evaluation started at d 57 post-weaning. Pigs (n = 1,276; PIC 800 x DNA 241 F1) were blocked by wean age (20.6 ± 1.5 d) and sex, ranked in order of individual WW (6.05 ± 1.43 kg), and divided into BW quartiles to create four WW treatment groups [WW Quartile (Q) 1, 2, 3, and 4; Table 1]. Pigs (n = 21) in the same Q were housed in each pen yielding 15 replicate pens per quartile. Pigs were fed common diets formulated in a 4-phase sequence from the time of placement in the finisher through marketing, which occurred on a fixed-BW basis targeting 131.5 kg. Pen BW and feed disappearance were recorded every 3 wk and at marketing, and individual BW were recorded on d 134 post-weaning. Data were analyzed using linear mixed effects models in the lme4 package of R. Differences in mean BW of each Q were evident at weaning (<span>P</span> &lt; 0.001), start of finisher evaluation (d 57, <span>P</span> &lt; 0.001), and through d 121 (<span>P</span> &lt; 0.001); by d 144, the BW between Q3 and Q4 did not differ (126.6 vs 129.0 kg, respectively, <span>P</span> &gt; 0.05). Overall average daily gain (ADG) and average daily feed intake (ADFI) were greater (<span>P</span> &lt; 0.001) for finishing pigs of either Q3 or Q4 compared with Q1, but no difference (<span>P</span> &gt; 0.10) in gain to feed ratio (G:F) was observed between quartiles from 28.0 to 131.5 kg BW. Pigs in Q3 and Q4 required fewer (<span>P</span> &lt; 0.001) days on feed than pigs in either Q1 or Q2, which culminated in an overall linear (<span>P</span> &lt; 0.001) effect such that a 0.45-kg advantage in WW resulted in 2.25 d less to reach a market BW of 131.5 kg. Coefficient of variation (CV) in BW at d 134 post-weaning was greater (<span>P</span> &lt; 0.001) for pigs in Q1 compared with pigs in Q2, Q3, or Q4. Backfat depth was thicker (<span>P</span> &lt; 0.05) for Q1 pigs compared with Q4 pigs but did not differ from pigs in Q2 or Q3. A decrease (<span>P</span> &lt; 0.001) in carcass ADG was seen for pigs in the lightest 50% of the population compared with those in Q4. In conclusion, even though feed efficiency was not impacted by WW, heavier WW resulted in fewer days to reach desired market weight while simultaneously resulting in improved carcass characteristics.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"da65eb1202ebfb0ebd45b558c535624e05710a0ebe680713558ba453db14cd0a","category":"Environment"}