{"title":"Survival costs and benefits of reproduction: A register‐based study in 20th century Estonia","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15127?af=R","date":1716399022000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0772dd57-05ca-448b-8622-8d7c99082e59/nyas15127-gra-0001-m.png\" alt=\"Survival costs and benefits of reproduction: A register-based study in 20th century Estonia\" /><p>We studied the associations between parity and survival among 579,271 Estonians born in 1905–1945. Natural selection for increased lifespan was stronger in men than in women. However, the median lifespan increased during the study period in women but stagnated in men. Survival costs of reproduction were detected among individuals with high parities, as mothers of two and fathers of two and three children had the highest median lifespans.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Patterns of individual variation in lifespan and senescence depend on the associations between parental survival and reproductive rates. We studied the associations between parity and survival among 579,271 Estonians born between 1905 and 1945 and in a cohort with a completed lifespan born in 1905−1927. For this cohort, selection for increased lifespan operated on both sexes, but it was stronger in men than in women. However, the median lifespan increased between the subsequent cohorts in women but stagnated in men. Selection for longer lifespan was caused by the below-average lifespan of individuals with no or single offspring. Despite a general positive selection for lifespan, survival costs of reproduction were also detected among a relatively small proportion of individuals with high parities, as mothers of two and fathers of two and three children had the highest median lifespans. Fathers of more than six children had better survival than fathers of few children in their reproductive age, but this association reversed after age 70. The reversal of this association between survival and parity at old age indicates that relative mortality risks between those with lower versus higher parities change across ages, as predicted by the antagonistic pleiotropy theory of aging.</p>","author":"Richard Meitern, \nPeeter Hõrak","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"da6ea2142730da1d29fb4f2f60291d8e42a349d13ced505851a0e11c24514df4","category":"Environment"}