{"title":"Validation of a new acoustic telemetry transmitter for the study of predation events in small fishes","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15827?af=R","date":1717627385000,"content":"<h2>Abstract</h2>\n<p>Acoustic telemetry has emerged as an important tool for studying the movement and behavior of aquatic animals. Predation-sensing acoustic transmitters combine the functions of typical acoustic transmitters with the added ability to identify the predation of tagged animals. The objective of this paper was to assess the performance of a newly miniaturized acid-based predation-sensing acoustic transmitter (Innovasea V3D; 0.33 g in air). We conducted staged predation events in the laboratory where acoustically tagged rainbow trout (<i>Oncorhynchus mykiss</i>) were fed to largemouth bass (<i>Micropterus nigricans</i>) at 3.3–7.0, 9.0–10.8, 16.0–20.0, and 22.0–25.8°C. We also conducted false-positive tests where tagged rainbow trout were held at 10.0 and 16.8°C without the risk of predation. Predation events were successfully identified in 92% of the staged predation trials. Signal lag (i.e., the time required for a predation tag to indicate that predation occurred) ranged from 0.11 to 6.29 days and decreased strongly with increasing water temperature and increased with increasing body mass of the tagged prey. Tag retention in the gut of the predator was much more variable than signal lag and was influenced by water temperature and individual predators but not by prey mass. No false positives were detected after 60 days at either temperature (<i>n</i> = 27 individuals). Although the relationships between water temperature, signal lag, and retention time are likely species-specific, the data reported here provide useful information for the use of these transmitters to study predation in wild fishes, especially for temperate, freshwater fish.</p>","author":"Mitchell B. Shorgan, \nHeather Bauer Reid, \nSilviya V. Ivanova, \nAaron T. Fisk, \nSteven J. Cooke, \nGraham D. Raby","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"da8929ba1517e4d95ccbc92c3cafc3fba062bc61ca272b53c8ed3be9abc8f77f","category":"Environment"}