{"title":"An engineering student made a USB-C iPhone because Apple won’t","link":"https://www.macworld.com/article/543867/engineering-student-a-usb-c-iphone-video.html","date":1634046374000,"content":"<div>\n<section><div></div></section><p>It’s basically a foregone conclusion that Apple won’t be making an iPhone with USB-C, so a robotics student has made his own.</p>\n\n\n\n<p>In a short video posted on YouTube, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://kenp.io&amp;xcust=1-1-543867-1-0-0&amp;sref=https://www.macworld.com/feed\">Ken Pillonel</a>, a master’s degree student in robotics at the Swiss Federal Institute of Technology, has shown off what looks to be an iPhone X or XS with a USB-C port where the lightning port would be. In the video, Pillonel shows the iPhone charging and transferring data when a MacBook Pro USB-C power adapter is plugged in.</p>\n\n\n\n<figure><div>\n\n</div></figure><p>To switch out the port, Pillonel reverse-engineered Apple’s C94 connector on the USB-C-to-Lightning cable to make a custom printed circuit board with a female USB-C port small enough to fit inside the iPhone. He then was able to attach the board to the iPhone’s logic board. It’s obviously not something the average iPhone user should or even could attempt, but it’s a fascinating look into how difficult it is to create even small components in the products we use every day.</p>\n\n\n\n<p>USB-C in the iPhone is something of a hot-button issue after the European Commission proposed a new rule that would force smartphones to use USB-C for charging. Even though it’s likely years away, there’s a possibility that Apple would be forced to swap out Lightning for USB-C on the iPhone some years down the road, so Pillonel’s video is a neat proof of concept that shows how Apple could bring USB-C without sacrificing any of the other components in the phone.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/usb-c-iPhone-mod-board.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=SAekbJf4Gsw&amp;xcust=1-1-543867-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Kenny Pi/YouTube</a></div>\n\n\n\n<p>While the video is just 40 seconds long, Pillonel says he is currently editing the full-length video to detail the entire process, so if you’re interested, you should <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/channel/UCGo22VEt5enuQHeQTXcPuzw&amp;xcust=1-1-543867-1-0-0&amp;sref=https://www.macworld.com/feed\">subscribe to his channel</a>. Pillonel says he is looking for a master’s thesis project to begin in March 2022, but something tells me he may have just found it.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"da8a54dd4793f92268258ef861fca9c89e09d1e2e5516a6555ddb310c4579b96","category":"Apple"}