{"title":"Pain perception as hierarchical Bayesian inference: A test case for the theory of constructed emotion","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15141?af=R","date":1717593595000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/4fdae241-e826-461d-85a2-64a541451e3c/nyas15141-gra-0001-m.png\" alt=\"Pain perception as hierarchical Bayesian inference: A test case for the theory of constructed emotion\" /><p>An intriguing perspective about human emotion, the theory of constructed emotion considers emotions as generative models according to the Bayesian brain hypothesis. The theory can be tested by examining its predictions for pain perception and its dysfunction in pathology. We review evidence for a predictive processing account of pain that supports this theory of emotion.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>An intriguing perspective about human emotion, the theory of constructed emotion considers emotions as generative models according to the Bayesian brain hypothesis. This theory brings fresh insight to existing findings, but its complexity renders it challenging to test experimentally. We argue that laboratory studies of pain could support the theory because although some may not consider pain to be a genuine emotion, the theory must at minimum be able to explain pain perception and its dysfunction in pathology. We review emerging evidence that bear on this question. We cover behavioral and neural laboratory findings, computational models, placebo hyperalgesia, and chronic pain. We conclude that there is substantial evidence for a predictive processing account of painful experience, paving the way for a better understanding of neuronal and computational mechanisms of other emotions.</p>","author":"Arnaud Poublan‐Couzardot, \nDeborah Talmi","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"da8b4b6f48f9ffe2a3bde32c78fcdd787e965fb01e0e28c65fad630d2d692652","category":"Environment"}