{"title":"Tile to Leverage Amazon Echo and Ring Devices to Better Compete With AirTags","link":"https://www.macrumors.com/2021/05/07/tile-amazon-sidewalk-integration/","date":1620421626000,"content":"Amazon <a href=\"https://www.aboutamazon.com/news/devices/echo-tile-and-level-devices-join-amazon-sidewalk\">today announced</a> that it is teaming up with Tile to add Amazon Sidewalk integration to Tile's Bluetooth trackers. Amazon Sidewalk, for those unfamiliar, is a network of Amazon Bluetooth devices that's designed to improve the connectivity of devices like the Ring and Amazon Echo.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/tile-amazon-sidewalk-integration.jpg\" />\r\n<br />\r\nTile will now be joining Amazon Sidewalk, and through this integration, Amazon Echo and Ring devices will be able to extend Tile's network coverage to help Tile users locate their lost items.\r\n<br />\r\n\r\n<br />\r\nTile users will also get the benefit of Amazon Alexa, and those with Alexa-enabled devices can say \"Alexa, find my [item]\" to have their Tile device start ringing. Multiple in-home Echo devices will allow misplaced items to be found faster around the house, and Tile CEO CJ Prober says the technology will also be useful outside the home.<blockquote>\"Tile helps millions of people every day find their things, and we're always looking for opportunities to enhance the finding experience for our customers. To that end, working with Amazon to extend our finding network by securely connecting to Amazon Sidewalk devices like Echo smart speakers was an obvious choice,\" said CJ Prober, CEO of Tile. \"Amazon Sidewalk will strengthen Tile's finding power for our devices and Find with Tile device partners that leverage our finding technology, making it even easier to find lost or misplaced keys, wallets, or other Tiled items both inside and outside the home.\"</blockquote>With Amazon Sidewalk, Tile will be able to better compete against <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, which are able to take advantage of the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> network. The ‌Find My‌ network uses hundreds of millions of Apple devices to help locate lost ‌AirTags‌, allowing them to be found when not in Bluetooth range of an owner's device.\r\n<br />\r\n\r\n<br />\r\nTile has a similar feature called <a href=\"https://www.thetileapp.com/en-us/blog/what-is-tile-network-community-find-lost-stolen-far-away\">the Tile Network</a> that takes advantage of other Tile users who have a Tile app, but there are nowhere near as many Tile users out in the wild as there are Apple users, which gave Apple a significant edge. There are, however, tons of Ring and Amazon Echo devices to bolster Tile's network, though people are not carrying these devices with them so it's still more limited than the ‌Find My‌ network.\r\n<br />\r\n\r\n<br />\r\nTile will join Amazon Sidewalk starting on June 14.<div>Tags: <a href=\"https://www.macrumors.com/guide/amazon/\">Amazon</a>, <a href=\"https://www.macrumors.com/guide/tile/\">Tile</a>, <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airtags.232\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/07/tile-amazon-sidewalk-integration/\">Tile to Leverage Amazon Echo and Ring Devices to Better Compete With AirTags</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/tile-to-leverage-amazon-echo-and-ring-devices-to-better-compete-with-airtags.2295265/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OUQyBOubbnk:g4yxKeohjk8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=OUQyBOubbnk:g4yxKeohjk8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/OUQyBOubbnk\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"da9bc7c61d7b40aab24f34e1813b0c761f6832d2cff7e5bae4234a396687e244","category":"Apple"}