{"title":"How Pink Floyd inspired research into medieval monks and volcanology","link":"https://arstechnica.com/?p=1929373","date":1680729239000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/eclipse3CROP-800x531.jpg\" alt=\"Illumination from the late 14th or early 15th century, which portrays two individuals observing a lunar eclipse\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/eclipse3CROP.jpg\">Enlarge</a> <span>/</span> Illumination from the late 14th or early 15th century, which portrays two individuals observing a lunar eclipse. It features the words \"La lune avant est eclipsee\" (\"the moon is eclipsed\"). (credit: <a href=\"https://www.unige.ch/communication/communiques/en/2023/lapport-accidentel-des-moines-medievaux-la-volcanologie\">gallica.bnf.fr / BnF</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Sébastien Guillet, an environmental scientist at the University of Geneva in Switzerland, was rocking out to Pink Floyd's classic <em>Dark Side of the Moon</em> album one day when he made a prescient connection. The darkest lunar eclipses all occurred within a year or so of major volcanic eruptions. And astronomers know the exact days of those eclipses. So medieval historical accounts of lunar eclipse sightings should be able to help scientists narrow down the timeframe in which major eruptions occurred during the High Medieval period spanning 1100 to 1300 CE. Guillet collaborated with several other scientists to conduct such a study, combining textual analysis with tree ring and ice core data. They described their findings in a <a href=\"https://www.nature.com/articles/s41586-023-05751-z\">new paper</a> published in the journal Nature.</p>\n<p>\"Climate scientists usually identify past volcanic eruptions by measuring the acidity and amount of volcanic ash in cores drilled from polar ice, or by inferring abrupt temperature changes in tree ring records,\" Andrea Seim (University of Freiburg) and Eduardo Zorita (Helmholtz-Zentrum Hereon) <a href=\"https://www.nature.com/articles/d41586-023-00850-3\">wrote in an accompanying commentary</a>. \"However, these sources sometimes disagree, because the location, intensity, and timing of eruptions can produce varying results, as can circulation of the atmosphere. Guillet and colleagues' approach offers an independent—and perhaps even more direct—source of information about the timing of volcanic eruptions, which could resolve some of these disagreements.\"</p>\n<p>Major eruptions can belch huge amounts of sulfur dioxide into the atmosphere, which gets converted into aerosols in the stratosphere. This produces volcanic dust. That dust then blocks incoming solar radiation, changing the Earth's surface temperatures, precipitation, and atmospheric circulation. Climate models suggest that this kind of volcano-induced cooling of about 1° Celsius over several years can lead to unusual precipitation patterns: major flooding in one area and droughts in another. It could also lower ocean temperatures and expand sea ice, so the effects could last decades or more. In fact, there has been speculation that major volcanic eruptions during the High Medieval period may have contributed to the onset of the <a href=\"https://en.wikipedia.org/wiki/Little_Ice_Age\">Little Ice Age</a> (circa 1300-1850).</p></div><p><a href=\"https://arstechnica.com/?p=1929373#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1929373&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"daa19963c0f39902362546ef73f16c2e25d2c14c56470a32f7d03c00205f562b","category":"Tech"}