{"title":"Evans Cycles enters the smart trainer market with the Pinnacle HC Home Turbo Trainer","link":"https://www.bikeradar.com/news/evans-cycles-pinnacle-hc-home-turbo-trainer/","date":1636638883000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Pinnacle-HC-Turbo-Home-Trainer-ae7594e.jpg?quality=90&amp;resize=620,413\" />                                            <p>Pinnacle, the in-house brand of cycling retailer Evans Cycles, has released its first <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>.</p>\n<p>The Pinnacle HC Turbo Home Trainer is a direct-drive smart trainer and is designed to offer an impressive array of stats considering its £700 RRP.</p>\n<p>According to Evans Cycles, the trainer can generate up to 2,500 watts of resistance and simulate inclines up to 20 per cent, and is accurate to +/- 2 per cent. That would put it among the best in the market in terms of spec at this price range.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The trainer is said to offer up to 2,500w of resistance and simulate gradients up to 20%.</span></figcaption><span> <i>Evans Cycles</i></span></div>\n<p>The HC Turbo Home Trainer is said to have both Bluetooth and ANT+ connectivity as well as an integrated cadence sensor, so it should work with the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">best indoor training apps</a>.</p>\n<p>Evans Cycles says the trainer weighs 15kg overall, with the flywheel accounting for 5.7kg of that weight. BikeRadar has found previously that trainers with flywheels of a similar weight produce realistic ride feels, which is an encouraging sign for the HC Turbo Home Trainer’s performance.</p>\n<p>According to Evans Cycles, the Pinnacle HC Turbo Home Trainer should also be quiet, claiming that at 19mph, it should only produce 52dB. If that is the case, your drivetrain is likely to be louder than the trainer, so it might be a good option for those looking to train in a flat or spare room without causing too much disturbance.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The HC Turbo Home Trainer’s form is functional and clean, if a little derivative.</span></figcaption><span> <i>Evans Cycles</i></span></div>\n<h2>Rise of the own brands</h2>\n<p>Evans Cycles’ decision to stock an own-brand turbo mirrors moves by Wiggle and Chain Reaction Cycles earlier this year, when both retailers began to sell the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/xplova-noza-s-smart-trainer-review/\">Xplova Noza S</a> trainer under the LifeLine house-brand name.</p>\n<p>The Pinnacle HC Turbo Home Trainer has been introduced at the same retail price and offers similar stats, so will compete squarely with the Xplova Noza S.</p>\n<p>BikeRadar’s senior technical writer <a href=\"https://www.bikeradar.com/author/bromleysimon/\">Simon Bromley</a> judged the Xplova Noza S to be a “stable, quiet, easy-to-use smart trainer with good ride quality”, but mentioned its power meter accuracy needs significant improvement.</p>\n<p>Simon will be testing the Pinnacle HC Turbo Home Trainer soon, so be sure to check back for his verdict in the near future to see how it fares.</p>","author":"Sam Challis","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"daa4a203795a487762a35802bc385b8eff6a178b1b8a29b33ad8a1723ba7bfda","category":"Cycling"}