{"title":"Self-actualization and B-values: Development and validation of two instruments in the Brazilian context","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302322","date":1717768800000,"content":"<p>by Gustavo Henrique Silva de Souza, Jorge Artur Peçanha de Miranda Coelho, Nilton Cesar Lima, Germano Gabriel Lima Esteves, Fernanda Cristina Barbosa Pereira Queiroz, Yuri Bento Marques</p>\r\n\r\nSelf-actualization is a complex psychological construct within Maslow’s motivation theory, characterized by numerous gaps in the empirical and measurement spectrums. Therefore, the objectives of this study are to develop, validate, and cross-verify measures for self-actualization attributes and B-values, focusing on job context and theoretical congruence with innovative behavior and human values related to the self-actualization construct (suprapersonal subfunction). This study involved a diverse sample of 621 Brazilian participants from 25 different professions, indicating the broad applicability of the findings. The proposed instruments underwent content and semantic validity assessments, followed by verification of factor validity and internal consistency. Results showed satisfactory content, semantic and factor validity and internal consistency parameters. The study reveals that self-actualization attributes can be understood through achieving one’s own potential and work meta-motivation, consistent with the adoption of B-values. Relationships with suprapersonal values (maturity, knowledge, and beauty) and innovative work behavior were also demonstrated, suggesting convergent validity evidence. The validation of SAAS and BVI contributes to understanding self-actualization and B-values in varied Brazilian contexts, offering insights for psychological assessment and intervention.","author":"Gustavo Henrique Silva de Souza","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"daa80c4485b78781c87dde583d5afcfd4d6e371493089577ff288a426ad4440f","category":"Interdisciplinary"}