{"title":"Stress Analysis of GFRP Lap Joints with Modified Adhesives at Various Temperatures","link":"https://www.preprints.org/manuscript/202408.0787/v2","date":1726040365000,"content":"This study examines stress distributions in adhesive joints under various loading and temperature conditions. Finite element analysis (FEA) was employed to compute the peel and shear stresses at the adhesive interface and bondline mid-section. Dependency analysis shows that mid-section peel stress significantly impacts the experimental shear strength of SLJs more than shear stress. This insight highlights the need to carefully analyze peel stress and bending moment factors. The analytical solutions proposed by Goland and Reissner were analyzed with modifications by Hart-Smith and Zhao. Hart-Smith’s approach performed more effectively, especially when the adhesive layer thickness (ta) is 0.5 mm and the overlap length to thickness ratio (c/ta) is ≥20. FEA revealed stress distributions at the adhesive/adherend interface and bondline mid-section. DP490 adhesive joints exhibited lower stresses than EA9696. Temperature variations significantly affected joint behavior, particularly above the adhesive’s glass transition temperature (Tg). Both EA9696 and DP490 adhesive joints displayed distinct responses to stress and temperature changes. The parabolic and biquadratic solutions for functionally graded adhesive (FGA) joints were compared. The biquadratic solution consistently yielded higher shear and peel stress values, with an increase ranging from 15% to 71% compared to the parabolic solution at various temperatures because of larger gradient of the Young's modulus distribution near the overlap ends. The ratio of peak peel stress to peak shear stress suggests selecting an adhesive with a superior peel strength or primarily reducing the peak peel stress by functionally grading is advisable, particularly if the adhesive is brittle. Comparison of stress distributions emphasize the importance of selecting adhesives based on stress type, temperature, and solution methods in optimizing adhesive bonding applications. These findings provide valuable insights for thermomechanical applications where thermal stimuli may be used for controlled debonding.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dab8beae90ad09e616a49db94c9f22cf72ac653dd0016e7d47da3d43e00e7548","category":"Interdisciplinary"}