{"title":"Protective effects of oyster polypeptide on cyclophosphamide‐induced immunosuppressed rats","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13537?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Oyster polypeptide (OP) is a mixture of oligopeptides extracted from oysters through enzyme lysis, separation, and purification. It is associated with immunomodulatory effects, but the underlying mechanisms are not known. This study therefore combined proton nuclear magnetic resonance (<sup>1</sup>H-NMR) urinary metabolomics and 16S rRNA gene sequencing of the gut microbiome to determine the immunoprotective mechanisms of OP in rats subjected to cyclophosphamide-induced immunosuppression.</p>\n<h2>RESULTS</h2>\n<p>Oyster polypeptide restored the body weight and the structure of spleen and thymus in rats with cyclophosphamide-induced immunosuppression. It upregulated the levels of white blood cells (WBCs), hemoglobin (HGB), platelets (PLT), red blood cells (RBCs), immunoglobulin G (IgG), immunoglobulin M (IgM), cytokines such as interleukin‑6 (IL-6) and tumor necrosis factor-<i>α</i> (TNF-<i>α</i>), and increased the numbers of CD3<sup>+</sup> and CD4<sup>+</sup> T cells in the immunosuppressed rats. The <sup>1</sup>H-NMR metabolomics results showed that OP significantly reversed the levels of ten metabolites in urine, including 2-oxoglutarate, citrate, dimethylamine, taurine, <i>N</i>-phenylacetylglycine, alanine, betaine, creatinine, uracil, and benzoate. The 16S rRNA gene sequencing results showed that OP restored the gut microbiome homeostasis by increasing the abundance of beneficial bacteria and reducing the abundance of pathogenic bacteria. Finally, a combination of metabolomics and microbiomics found that the metabolism of taurine and hypotaurine, and the metabolism of alanine, aspartate, and glutamate were disturbed, but these metabolic pathways were restored by OP.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrated that OP had immunoprotective effects in rats with cyclophosphamide-induced immunosuppression by restoring key metabolic pathways and the gut microbiome homeostasis. Our findings provide a framework for further research into the immunoregulatory mechanisms of OP and its potential use in drugs and nutritional supplements. © 2024 Society of Chemical Industry.</p>","author":"Ying He, \nYunyuan Nong, \nJunliang Qin, \nLinlin Feng, \nJinghua Qin, \nQianyi Wang, \nLijun Deng, \nSiqi Tang, \nMeiling Zhang, \nXiaofeng Fan, \nMin Dong, \nJinbin Wei, \nShihan Pan, \nZhiheng Su","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"dac4846b30f8d967147078332215323d76e7b2bfb69399b82fa627f91cc4228f","category":"Environment"}