{"title":"Panax notoginseng stems and leaves affect microbial community and function in cecum of duzang pigs","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txad142/7585178?rss=1","date":1705881600000,"content":"<span><div>Abstract</div><span>Panax notoginseng</span> is a Chinese medicine with a long history in which stems and leaves are the wastes of processing <span>Panax notoginseng</span> and have not been effectively utilized. The effects of diets containing <span>Panax notoginseng</span> stems and leaves on the cecal short-chain fatty acid (SCFA) concentration and microbiome of independent pigs were studied. Diets containing <span>Panax notoginseng</span> stems and leaves did not affect the concentration of SCFA in the cecal contents of Duzang pigs but affected the microbial composition and diversity. Firmicutes, Proteobacteria, and Bacteroidetes dominate in the cecal of Duzang pigs. Feeding Duzang pigs with a 10% <span>Panax notoginseng</span> stems and leaves diet increases the abundance of <span>Lactobacillus</span>, <span>Christensenellaceae R-7 group</span>, and <span>Akkermansia</span> in the cecal. We found 14 genera positively associated with acetate, and they were <span>Lactobacillus</span>, <span>Ruminococcaceae UCG 005</span>, <span>Ruminiclostridium 6; Escherichia Shigella</span> and <span>Family XIII AD3011 group</span> showed negative correlations. <span>Solobacterium</span>, <span>Desulfovibrio</span>, and <span>Erysipelatoclostridium</span> were positively associated with propionate. <span>Campylobacter</span>, <span>Clostridium sensu stricto 11</span>, and <span>Angelakisella</span> were positively associated with butyrate. In conclusion, <span>Panax notoginseng</span> stems and leaves could affect the cecal microbial community and functional composition of Duzang pigs. <span>Panax notoginseng</span> stems and leaves reduce the enrichment of lipopolysaccharide biosynthetic pathway of the cecal microbiome, which may have a positive effect on intestinal health. The higher abundance of GH25 family in Duzang pig’s cecal microbiome of fed <span>Panax notoginseng</span> stems and leaves diet. This increase may be the reason for the microbial diversity decrease.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"dac69f54feca8680616fd2222ae8be2107f21ad1ccef03ade678bd43eccb8b3a","category":"Environment"}