{"title":"Why did SpaceX give up on “catching” falling fairings? Its VP of launch explains","link":"https://arstechnica.com/?p=1964228","date":1693409352000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/payload-fairing-800x512.jpg\" alt=\"One half of a Falcon 9 payload fairing deploys its parafoil.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/payload-fairing.jpg\">Enlarge</a> <span>/</span> One half of a Falcon 9 payload fairing deploys its parafoil. (credit: Elon Musk/Instagram)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amid much fanfare, SpaceX started landing its Falcon 9 rockets in 2015, and it began reusing them less than two years later. The first stage of the Falcon 9 rocket, with nine engines and the bulk of the mass, accounts for about half of the cost of manufacturing a rocket, so this represents a considerable savings in time and money for SpaceX.</p>\n<p>However, as with most other boosters, there are two other main components of the Falcon 9 rocket. There is the second stage, which boosts a payload into orbit, and, for most missions, a payload fairing that protects the satellite during its transit through the atmosphere. SpaceX briefly studied recovering the second stage of the Falcon 9 but concluded it was not feasible without major modifications that would have greatly reduced the rocket's payload capacity.</p>\n<p>But what about the payload fairing? These are built in two pieces through a laborious process of laying down composite materials, not dissimilar to papier-mâché. The manufacture of fairings is time-consuming, and it costs about $6 million to produce both halves.</p></div><p><a href=\"https://arstechnica.com/?p=1964228#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964228&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dac715c882f9d4d528b3d1a1b2f21b3b71a04f7d606578344b99900e22e05df4","category":"Tech"}