{"title":"Can't pass or won't pass: the importance of motivation when quantifying improved connectivity for riverine brown trout Salmo trutta","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15628?af=R","date":1710504692000,"content":"<h2>Abstract</h2>\n<p>Reversing the negative impacts that anthropogenic habitat fragmentation has on animal movement is a key goal in the management of landscapes and conservation of species globally. Accurate assessment of measures to remediate habitat fragmentation, such as fish passage solutions in rivers, are imperative but are particularly challenging for territorial species, which are less likely to leave their existing home range, or populations composed of both migratory and resident individuals (i.e., partial migration). This investigation quantified the movements of translocated (captured upstream of the impediment and released downstream) and non-translocated (captured and released downstream of the impediment) riverine brown trout (<i>Salmo trutta</i> L.), a species known to perform a homing movement, through a fish pass using passive integrated transponder (PIT) telemetry. A significantly higher proportion of translocated fish approached, entered, and passed (on a wider range of flows) compared to non-translocated fish, consistent with the theory that motivation is a key driver in fish pass use. Translocated fish that entered the pass were significantly larger than those that approached but did not enter, presumably due to physiological capability. Translocated fish were a more reliable indicator of the fish passage solution effectiveness than non-translocated fish. Our findings hence imply that many fish passage solutions globally, and potentially measures to remediate habitat fragmentation for other taxa, may have been mistakenly assessed for unmotivated animals. Studying both non-translocated and translocated fish is recommended to provide more accurate and cost-effective fish passage solution assessments.</p>","author":"Jamie R. Dodd, \nIan G. Cowx, \nDomino A. Joyce, \nJonathan D. Bolland","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"dad05466e33cff5fa38cf164330f1e19cf139c6d5820e9a9001b2c2615d61a49","category":"Environment"}