{"title":"When innovation goes south: The tech that never quite worked out","link":"https://arstechnica.com/?p=1928303","date":1680355849000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1410034546-800x533.jpg\" alt=\"Image of a supersonic jet airliner.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1410034546-scaled.jpg\">Enlarge</a> <span>/</span> Once the future of travel, now a museum piece. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-last-concorde-that-has-flew-is-presented-at-technik-news-photo/1410034546?adppopup=true\">Didier Messens</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Vaclav Smil reminds us that despite the onslaught of popular techno-pundits claiming otherwise, immense and rapid progress in one realm does not mean immense and rapid progress in <em>all</em> realms.</p>\n<p>Let’s just get this out of the way at the start: Smil is Bill Gates’ favorite author. He’s written 40 books, all of them about some combination of energy, China, or the combination of food, agriculture, and ecology. His newest book, <a href=\"https://amzn.to/3nAffnN\" target=\"_blank\"><em>Invention and Innovation: A Brief History of Hype and Failure</em></a>, is somewhat of a departure, although it does touch on all of these. Primarily, it is a tale of thwarted promise.</p>\n<p>Smil is very intentional about the types of flops he highlights. He is not interested in embarrassing design failures (the Titanic, Betamax, Google Glass) or undesirable side effects of inventions everyone still uses despite them (prescription drugs, cars, plastic). Rather, he focuses on the categories chosen to demonstrate the limits of innovation. Although astoundingly rapid progress has been made in the fields of electronics and computing over the past 50 or so years, it does not follow that we are thus in some unprecedented golden age of disruptive, transformative growth in <em>every</em> field.</p></div><p><a href=\"https://arstechnica.com/?p=1928303#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1928303&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dad3ef8653da282dc686f7b86a4084f99a4e80d352b421dd4d9a4b9230a2fa40","category":"Tech"}