{"title":"Establishing the linkage between eba's instrumental and sensory descriptive profiles and their correlation with consumer preferences: implications for cassava breeding","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12518?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Gari and eba, forms of cassava semolina, are mainly consumed in Nigeria and other West African countries. This study aimed to define the critical quality traits of gari and eba, to measure their heritability, to define medium and high throughput instrumental methods for use by breeders, and to link the traits with consumer preferences. The definition of a food product's profiles, including its biophysical, sensory, and textural qualities, and the identification of the characteristics that determine its acceptability, are important if new genotypes are to be adopted successfully.</p>\n<h2>RESULTS</h2>\n<p>Eighty cassava genotypes and varieties (three different sets) from the International Institute of Tropical Agriculture (IITA) research farm were used for the study. Participatory processing and consumer testing data on different types of gari and eba products were integrated to prioritize the traits preferred by processors and consumers. The color, sensory, and instrumental textural properties of these products were determined using standard analytical methods, and standard operating protocols (SOPs) developed by the RTBfoods project (Breeding Roots, Tubers, and Banana Products for End-user Preferences, <a target=\"_blank\" href=\"https://rtbfoods.cirad.fr\">https://rtbfoods.cirad.fr</a>). There were significant (<i>P</i> &lt; 0.05) correlations between instrumental hardness and sensory hardness and between adhesiveness and sensory moldability. Principal component analysis showed broad discrimination amongst the cassava genotypes and the association of the genotypes concerning the color and textural properties.</p>\n<h2>CONCLUSIONS</h2>\n<p>The color properties of gari and eba, together with instrumental measures of hardness and cohesiveness, are important quantitative discriminants of cassava genotypes. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Oladeji Emmanuel Alamu, \nBéla Teeken, \nOluwatoyin Ayetigbo, \nMichael Adesokan, \nIsmail Kayondo, \nUgo Chijioke, \nTessy Madu, \nBenjamin Okoye, \nBello Abolore, \nDamian Njoku, \nIsmail Rabbi, \nChiedozie Egesi, \nRobert Ndjouenkeu, \nAlexandre Bouniol, \nKauê De Sousa, \nDominique Dufour, \nBusie Maziya‐Dixon","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"dad77e39b000e2f66d5877b0e8907f52e6b31d211dd9d2be83f23d964e7988de","category":"Environment"}