{"title":"Health-related quality of life and utility of maternity health states amongst post-partum Australians","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310913","date":1728309600000,"content":"<p>by Elizabeth Martin, Olivia Fisher, Jessica Tone, Narmandakh Suldsuren, Sanjeewa Kularatna, Michael Beckmann, Yvette D. Miller</p>\r\nBackground <p>This study aimed to measure patient-reported health-related quality of life amongst post-partum women in Queensland, Australia.</p> Methods <p>Patient-reported health-related quality of life data was prospectively collected from 134 post-partum women using the EQ-5D-5L at weekly intervals during the first six weeks following birth. Data across the five health domains of the EQ-5D-5L was converted to a single health utility value to represent overall health status. Linear mixed modelling and regression analysis were used to examine changes in utility over the first six weeks post-birth and determine associations between utility and clinical and demographic characteristics of post-partum women.</p> Findings <p>Gestation at birth and weeks post-partum were significantly associated with utility values when considered in a multivariate linear mixed model. Mean utility values increased by 0.01 for every week increase in gestation at birth, and utility values were 0.70 at one week post-partum and increased to 0.85 at six weeks post-partum, with the largest increase occurring between one- and two-weeks post-birth. When controlling for variables that were found to predict utility values across the first six weeks post-partum, no single state of health predicted utility values at one-week post-partum.</p> Conclusions <p>Maternity services can use our data and methods to establish norms for their own service, and researchers and maternity services can partner to conduct cost-effectiveness analysis using our more relevant utility values than what is currently available. Time since birth and gestational age of the woman’s baby should be considered when selecting post-partum health state utility values for maternity services cost-effectiveness analyses.</p>","author":"Elizabeth Martin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dae3a93b2d06e927e3a2963ae9a837a3b79b7760c301b96b92416818dcd353a5","category":"Interdisciplinary"}