{"title":"The Future of Developed Barrier Systems: 1. Pathways Toward Uninhabitability, Drowning, and Rebound","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003672?af=R","date":1712648646000,"content":"<h2>Abstract</h2>\n<p>Many barrier islands and spits (collectively, “barriers”) throughout the world are highly developed. As low-lying, sandy coastal landforms, barrier systems are naturally reshaped by processes associated with storms and sea-level rise (SLR). The resulting landscape changes threaten development, and in response, humans employ defensive measures that physically modify barrier geometry to reduce relatively short-term risk. These measures include the construction of large dunes, emplacement of beach nourishment, and removal of washover. Simulations conducted using a new coupled modeling framework show that, over decades to centuries, measures to protect roadways and communities alter the physical characteristics of barrier systems in ways that ultimately limit their habitability. We find that the pathway toward uninhabitability (via roadway drowning or community narrowing) and future system states (drowning or rebound) depends largely on dune management—because building dunes blocks overwash delivery to the barrier interior—and on initial conditions (barrier elevation and width). In the model, barriers can become lower and narrower with SLR to the point of drowning. The timing and occurrence of barrier drowning depends on randomness in the timing and intensity of storms and dune recovery processes. We find that under a constant rate of SLR, negative feedbacks involving storms can allow barriers that do not drown to rebound toward steady-state geometries within decades after management practices cease.</p>","author":"K. A. Anarde, \nL. J. Moore, \nA. B. Murray, \nI. R. B. Reeves","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"daed1939c23553c5cd9494b5e22935c938f06e2a2803f032d7736cd223abf7ce","category":"Environment"}