{"title":"Whole Genome Sequencing of the Entomopathogenic Fungus Fusarium solani KMZW-1 and Its Efficacy Against Bactrocera dorsalis","link":"https://www.preprints.org/manuscript/202409.1919/v1","date":1727179145000,"content":"Fusarium solani KMZW-1, is recognized for its potential as a biocontrol agent against agricultural and forestry pests, particularly due to its compatibility with integrated pest management (IPM) strategies. This study aimed to investigate the complete genome of F. solani KMZW-1 and assess its pathogenicity against Bactrocera dorsalis. Whole genome sequencing revealed a genome size of 47,239,278 bp, comprising 27 contigs, with a GC content of 51.16% and fungus identified as F. solani KMZW-1. The genome completeness was assessed as 97.93% using BUSCO analysis, DFVF sequence identifier was Fusarium 0G092560.1, AntiSMASH analysis identified 29 gene clusters associated with secondary metabolite biosynthesis providing insights into the genetic basis of its pathogenic mechanisms and biocontrol potential. Comparative genomic analysis found 269 unique genes of F. solani KMZW-1 and the collinearity analysis exhibited a high degree of synteny with Fusarium solani-melongenae. The pathogenicity of F. solani KMZW-1 was assessed using concentrations ranging from 1×10^4 to 1×10^11 conidia/mL. Higher concentrations (1×10^10 to 1×10^11 conidia/mL), resulted in significantly increased cumulative mortality rates of B. dorsalis adults compared to the control group. Notably, the pathogenicity was higher in male adults than in females. Probit regression analysis yielded LogLC50 values as 5.662 for fe-male and 4.486 for male B. dorsalis adults. In summary, F. solani KMZW-1 exhibits strong insecti-cidal activity against B. dorsalis and shows potential as a biocontrol agent with IPM strategies. These findings provide robust genomic evidence supporting the use of F. solani KMZW-1 in managing against B. dorsalis populations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dafc397e8f56a4ff88c22a21e55ec33dd17cfa97896bec12f693c14eb299b6e5","category":"Interdisciplinary"}