{"title":"High-Flow Oscillatory Ventilation in Pediatric Patients With Congenital Cardiovascular Diseases","link":"https://www.preprints.org/manuscript/202408.1354/v1","date":1724117913000,"content":"High-flow oscillatory ventilation (HFOV) is a common rescue treatment in infants and children with respiratory failure. This type of ventilation is an effective technique in numerous diseases that affect a child in the postnatal period, such as ARDS, meconium aspiration syndrome (MIS), postnatal pulmonary bleeding and idiopathic pulmonary hypertension (IPH). Although this ventilation technique is commonly recognized as a valuable therapeutic option in the general pediatric population, this is not the same for children with congenital cardiovascular diseases. The key mechanism of oscillatory ventilation is continuous positive pressure administered within the airways via a small tidal volume at high frequency. Tidal volumes are between 1 and 3 ml/kg delivered at 5 – 15 Hz equivalent to 300 – 900 breaths per minute. Few older studies conducted on humans and animals highlight that HFOV may be dangerous for congenital heart patients. According to these evidences, hemodynamic parameters such as blood pressure, wedge pressure, central venous pressure, heart rate and inotrope level can be dangerously changed for patients with congenital heart disease, therefore oscillatory ventilation should be avoided. Numerous retrospective studies have pointed out how oscillatory ventilation constitutes a valid therapeutic option in children with congenital heart disease. Recently, new evidences have highlighted how hemodynamic parameters are modified in a non-significant way by this type of ventilation, remaining beneficial as in the normal pediatric population. This narrative review aims to describe the mechanisms of oscillatory ventilation and collect all the available evidences to support its use in pediatric patients with congenital heart problems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db0f2192582e80f80abe2c328fc5da9adde1f1d97266fecd530adf1142ecfae3","category":"Interdisciplinary"}