{"title":"Sample Size and Geometric Morphometrics Methodology Impact the Evaluation of Morphological Variation","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae002/7585360?rss=1","date":1705881600000,"content":"<span><div>Synopsis</div>Geometric morphometrics has had a profound impact on our understanding of morphological evolution. However, factors such as sample size and the views and elements selected for two-dimensional geometric morphometric (2DGM) analyses, which are often dictated by specimen availability and time rather than study design, may affect the outcomes of those analyses. Leveraging large intraspecific sample sizes (<span>n</span> &gt; 70) for two bat species, <span>Lasiurus borealis</span> and <span>Nycticeius humeralis</span>, we evaluate the impact of sample size on calculations of mean shape, shape variance, and centroid size. Additionally, we assessed the concordance of multiple skull 2D views with one another and characterized morphological variation in skull shape in <span>L. borealis</span> and <span>N. humeralis</span>, as well as a closely related species, <span>Lasiurus seminolus</span>. Given that <span>L. seminolus</span> is a morphologically cryptic species with <span>L. borealis</span>, we assessed whether differences in skull shape and in 2DGM approach would allow species discrimination. We found that reducing sample size impacted mean shape and increased shape variance, that shape differences were not consistent across views or skull elements, and that trends shown by the views and elements were not all strongly associated with one another. Further, we found that <span>L. borealis</span> and <span>L. seminolus</span> were statistically different in shape using 2DGM in all views and elements. These results underscore the importance of selecting appropriate sample sizes, 2D views, and elements based on the hypothesis being tested. While there is likely not a generalizable sample size or 2D view that can be employed given the wide variety of research questions and systems evaluated using 2DGM, a generalizable solution to issues with 2DGM presented here is to run preliminary analyses using multiple views, elements, and sample sizes, thus ensuring robust conclusions.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"db14218ebd41fe8f1497d877c490e7bd8978e44412e609233997be0dc9ff458f","category":"Environment"}