{"title":"The Importance of Weather Factors on the Resilience of Airport Flight Based on Kolmogorov-Arnold Networks (KANs)","link":"https://www.preprints.org/manuscript/202409.0800/v1","date":1725960102000,"content":"To analyze the impact of weather factors on the resilience of airport flight operations, particularly on flight operation, economic performance, and transportation capacity, Kolmogorov-Arnold Network (KAN) model was used to identify key weather features and establish the mapping relationship between weather factors and airport operational resilience. Taking Xi'an Xianyang International Airport as an example, the weights of each route were determined using the Grey Relational Analysis method considering average daily flight volume, flight distance, and airport flow stability indicators. Flight operation records and weather data were utilized to calculate the importance of key weather factors on the resilience of critical flight operation indicators. The results indicate significant differences in average daily flight volume, flight distance, and airport flow stability across different routes, with routes in economically developed areas having a greater impact on airport flow stability. Temperature and wind speed changes are the key factors affecting flight operation and economic indicators, with importance values of 0.35 and 0.32 respectively. Wind direction change and wind speed change have the greatest impact on flight transportation capacity, with importance values of 0.7 and 0.65 respectively. Therefore, when conducting flight scheduling and risk assessment, special attention should be paid to key weather factors such as temperature and wind speed, while also considering the weight of each route to ensure flight safety, efficiency, and economic benefits.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db1de711969d1545a895fa4a8df676c3bfbcf449cc19895ab669a80f92e7d3b7","category":"Interdisciplinary"}