{"title":"Eraser Men: censoring the roads of the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-eraser-men","date":1625053829000,"content":"\n      <p><span>Just like that, a white penis has metamorphosed into a jolly butterfly. With hi-vis jackets on their shoulders, two men trace long lines on the tarmac, drawing curves and adding furtive features in a matter of seconds. Intrigued spectators come for a closer look, hands behind their backs. But Patrick Dancoisne and Joël Gautriand have no time to step back, appreciate their works of art or chat to the curious onlookers. They jump back in their van and shoot off in a cloud of dust.   </span></p>\n<div></div>\n<p><span>The duo bear the epithet of super heroes: </span><i><span>les effaceurs –</span></i><span> The Eraser Men. Employed by Doublet, the company tasked by Amaury Sport Organisation (ASO) with erecting and dismantling the advertising hoardings along the route since 2002, the Eraser Men begin by taking up arms against any unauthorised publicity. Then their battle moves on to all the eye-catching messages that could undermine the image of a popular, child-friendly and harmonious Tour, an event with no place for political messages or sexual innuendo. If only these two great French passions were more acceptable in an event beamed out to 190 countries by 100 different channels. Yet it remains that the penis that made its way onto TV screens a few days earlier was like a defeat to Patrick.</span></p>\n<p><span><em><strong><a href=\"https://www.rouleur.cc/pages/subscribe\">Support our content by subscribing to Rouleur</a></strong></em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E78A5101_1024x1024.jpg?v=1625048931\" /></span></p>\n<p><span>It’s 6:30am on the lip of the Col d’Izoard ahead of the day’s stage and this Eraser Man remembers the fateful moment. Even with the best efforts and will in the world, “you can’t always manage everything”, he says. Nevertheless, there’s no question of the same mistake repeating itself on this hotly anticipated mountain stage between Briançon and the summit of the Izoard which, for the first time in its history, will host a stage finish. </span></p>\n<p><span>For Patrick and Joël, the day looks difficult. With 1,030 metres of climbing in the final 14 kilometres and long straights at ten per cent gradient, the Izoard acts like a magnet for paintbrush-wielding fans. Below, in amongst the hairpin bends, some fluorescent green and white is already appearing from beneath the drizzle and the morning mists. “Come on, let’s go,” grunts Patrick after a quick glance at his watch.</span></p>\n<p><span>On this stage he and his accomplice will drive around 120 kilometres. “On the flat there is less graffiti,” Joël, who is making his Tour debut, points out. “We’ll go as far as 60 kilometres before the finish.” Having driven the route in reverse, the two men will then turn around and head back the way they came, tackling the new drawings that have appeared between their two runs. They have to leave this turning point at least 90 minutes before the first vehicles of the publicity caravan which, according to organisers, are scheduled to arrive on the Col d’Izoard at precisely 3.49pm.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-most-difficult-climbs\">Related: Tour de France 2021: the hardest climbs</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E78A4926_1024x1024.jpg?v=1625048967\" /></span></p>\n<p><span>This mountain stage is a time-trial for the Eraser Men, one that starts at seven in the morning. Patrick, all greying hair and square shoulders, takes the wheel. The slender figure of Joël is armed with his bible, the Tour roadbook, which contains the stage details and predicted timetable for each element of the Tour at each point up to the finish. </span></p>\n<p><span>Busy with other jobs, a young “man in blue” – dressed like all the employees of Doublet – sounds a warning to them from behind his hood</span><span>:</span><span> “Boys, you’re gonna see a lot of cocks.” Indeed they are; as the van begins its descent, the penis in all its myriad forms springs up as far as the eye can see. Every hundred metres or so, sometimes flying in formation, there are male genitalia; phalluses, cocks, willies, schlongs. For each one</span><span>,</span><span> the Eraser Men hop out in the middle of the road and grab their paint pots. Best case scenario: genitalia are artfully transformed into a butterfly or a bear. If time is pressing, several random brush strokes are enough to at least render it unrecognisably penile. Meanwhile the word “EPO” becomes less obvious as “EPQ”. Syringes – often accompanying </span><span>the names of riders</span><span> – are redrawn as ladders. The words “SOS réfugiés” – a call for action on the Mediterranean migrant crisis – are turned into an enigmatic 888. </span></p>\n<p><span>“We transform as much as we can,” Joël says, before Patrick groans: the black paint, which today has replaced the more traditional white they usually use, is far from satisfactory. The results of their adjustments are less clear. </span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E78A5126_1024x1024.jpg?v=1625049002\" /></span></p>\n\n<p><span>The duo will use more than 350 litres of water-based paint during the whole Tour, which is quite something when you consider that officially speaking, it is illegal to draw on a public highway.  As stated in article 322-1 of the French penal code, “inscriptions, signs or drawings, without prior authorisation… are punishable by a fine of 3750€ and community service”. But bike races turn a blind eye to it. According to legend, it all began in 1936 at the Giro d’Italia, where the supporters of Raffaele Di Paco, a rival of Charles Pélissier, became the first to cheer on their hero in this way. </span></p>\n<p><span>In the small hours, 41 year-old Gregory Boux emerged from his campervan. He wrote a nice “Vive le Tour” and an inevitable “Allez Bardet” on the road but no more. He ran out of paint. This former Pierre Rolland fan (“he never does anything any more”) understands the benefits of guys like Patrick and Joël. He is not a fan of the graffiti which keeps banging on about doping. “We write to encourage the riders, not to put them down,” he says.</span></p>\n<p><span>A little later the drizzle turns to steady rain and the two Eraser Men allow themselves a coffee break in Vars. It’s around ten in the morning and they have already covered more than half of the day’s route.</span></p>\n<p><span>Patrick is on his seventh Tour. His 57 years make him the old man of the Doublet boys in blue. For the remainder of the year he juggles two jobs, one as a barman and another working at an undertaker</span><span>’s</span><span>. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-angels-in-the-blue-overalls\">Related: The angels in the blue overalls: behind Shimano's neutral support</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E78A5247_1024x1024.jpg?v=1625049553\" /></span></p>\n<p><span>“I am a pallbearer, a master of ceremonies, and I pull pints,” he erupts. Like a good northern man, he was drawn into cycling by Paris-Roubaix, where the cobbled sector of Auchy-lez-Orchies traverses his home commune of Cappelle-en-Pévèle. “Roubaix is where you really see champions,” he adds.</span></p>\n<p><span>Little more than ten minutes later, the dynamic duo is back on the road. On one corner stands a fluorescent green message over ten metres long: OUR POLITICIANS ARE GANGSTERS.’ Patrick can’t hide his smile. “Now this is real art!” he says. </span></p>\n<p><span>Above them, a family watches the merry-go-round. They insist they had nothing to do with it. “But we agree with the message. Surely everybody does, don’t they?”</span><span> </span></p>\n<p><span>Further on, the van passes a tent draped in the flags of the CGT trade union. “Hulot is a thug! Macron OUT! Make EDF 100% public!” screams the tarmac. The Eraser Men whip out their brushes and a furious activist tumbles out of the tent. </span></p>\n<p><span>“What are you doing? You’ll see, when you hit retirement,” he yells. </span></p>\n<p><span>“I’m 57, so it won’t be long,” Patrick replies. “We’re just doing our job, that’s all.”</span></p>\n<p><span>“But we’ve always done this. It’s part of the Tour. It’s our right to express ourselves. Against Macron, at least.” </span></p>\n<p><span>Amongst the public, support generally sways towards the CGT. “Even if it’s unpleasant, everybody should have the right to write what they like,” says Madeline, who is waiting for the race with her family. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E78A5439_1024x1024.jpg?v=1625049049\" /></span></p>\n<p><span>Fabien Wille, professor of sports science at Lille University and author of the book </span><i><span>Tour de France: a media model</span></i><span> compares the Eraser Men to web moderators, only with a van instead of a mouse. To him it’s no surprise that ASO want to cover up the blemishes of certain messages written on the road. “Sport wants to be apolitical, but it’s impossible,” he says. </span></p>\n<p><span>Cameras attract the causes that need media coverage and “create spaces of protest”, as it was on July 7, 1982 when the steelworkers from Usinor de Denain held up the Tour riders mid-race, provoking the fury of Bernard Hinault. Several days later, the 1,300 workers learned of plans to shut the steelworks site the following year. It eventually shut in 1986. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-greatest-jerseys-of-the-tour-de-france\">Related: the greatest jerseys of the Tour de France</a></em></strong></p>\n<p><span>As the riders tackle the first-category Col de Vars, Joël and Patrick are just a few kilometres from the finish line. The crest of the Izoard is in sight. Their final effort of the day is to assemble the several-metre high inflatable polka dot jersey. But the duo can’t finish the climb. The publicity caravan has caught them up. They watch Warren Barguil take off in pursuit of Darwin Atapuma from the shoulder of the mountain and take the opportunity to work out their own stage classification. </span></p>\n<p><span>The day’s winner: a good 30 bits of graffiti in support of refugees. The penis came in second place with 18 drawings, but comfortably defended its position at the top of the graffiti GC. With its dozen or so messages, politics snuck onto the podium. On the other hand, only eight little syringes were classified today. What is the world coming to?</span></p>\n<p><i><span>This article is from Rouleur Issue 104, available to purchase now <a href=\"https://www.rouleur.cc/products/issue-104-tour-de-france\">here</a></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"db1ed7744c03bfb65170d80ccef4f81055f5074d349b3e43ad231f3a5dafba69","category":"Cycling"}