{"title":"Impact of Intra‐Skeletal Calcite on the Preservation of Coral Geochemistry and Implications for Paleoclimate Reconstruction","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004730?af=R","date":1714719600000,"content":"<h2>Abstract</h2>\n<p>The geochemistry of tropical coral skeletons is widely used in paleoclimate reconstructions. However, sub-aerially exposed corals may be affected by diagenesis, altering the aragonite skeleton through partial dissolution, or infilling of secondary minerals like calcite. We analyzed the impact of intra-skeletal calcite on the geochemistry (δ<sup>18</sup>O, Sr/Ca, Mg/Ca, Li/Mg, Li/Ca, U/Ca, B/Ca, Ba/Ca, and Mn/Ca) of a sub-aerially exposed <i>Porites</i> sp. coral. Each micro-milled coral sample was split into two aliquots for geochemistry and X-ray diffraction (XRD) analysis to quantify the direct impact of calcite on geochemistry. We modified the sample loading technique for XRD to detect low calcite levels (1%–2%; total uncertainty = 0.33%, 2<i>σ</i>) in small samples (∼7.5 mg). Calcite content ranged from 0% to 12.5%, with higher percentages coinciding with larger geochemical offsets. Sr/Ca, Li/Mg, Li/Ca, and δ<sup>18</sup>O-derived sea-surface temperature (SST) anomalies per 1% calcite were +0.43°C, +0.24°C, +0.11°C, and +0.008°C, respectively. A 3.6% calcite produces a Sr/Ca-SST signal commensurate with local SST seasonality (∼1.5°C), which we propose as the cut-off level for screening calcite diagenesis in paleo-temperature reconstructions. Inclusion of intra-skeletal calcite decreases B/Ca, Ba/Ca, and U/Ca values, and increases Mg/Ca values, and can therefore impact reconstructions of paleoclimate and the carbonate chemistry of the semi-isolated calcifying fluid in corals. This study emphasizes the importance of quantifying fine-scale calcite diagenesis to identify coral preservation levels and assure robust paleoclimate reconstructions.</p>","author":"Mudith M. Weerabaddana, \nDiane M. Thompson, \nEmma V. Reed, \nGabriela A. Farfan, \nJason D. Kirk, \nAlice C. Kojima, \nDavid L. Dettman, \nKalena de Brum, \nEmma Kabua, \nFlorence Edwards","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"db2257b584f071d136a004e395aa4320f6b97c9078e6c1099051a6a92306a41a","category":"Environment"}