{"title":"Curcumin alleviates osteoarthritis in mice by suppressing osteoclastogenesis in subchondral bone via inhibiting NF-κB/JNK signaling pathway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309807","date":1725544800000,"content":"<p>by Dong Ding, Guoqiang Liu, Jiangbo Yan, Qingyu Zhang, Fanding Meng, Limei Wang</p>\r\n\r\nThis study explored the mechanism of curcumin (CUR) suppressing osteoclastogenesis and evaluated its effects on osteoarthritis (OA) mouse. Bone marrow-derived macrophages were isolated as osteoclast precursors. In the presence or absence of CUR, cell proliferation was detected by CCK-8, osteoclastogenesis was detected by tartrate-resistant acid phosphatase (TRAP) staining, F-actin rings formation was detected by immunofluorescence, bone resorption was detected by bone slices, IκBα, nuclear factor kappa-B (NF-κB) and mitogen-activated protein kinase (MAPK) signaling pathways were detected using western blot, osteoclastogenesis-related gens were measured using quantitative polymerase chain reaction. A knee OA mouse model was designed by destabilizing the medial meniscus (DMM). Thirty-six male mice were divided into sham+vehicle, OA+vehicle, and OA+CUR groups. Mice were administered with or without CUR at 25 mg/kg/d from the first post-operative day until sacrifice. After 4 and 8 weeks of OA induction, micro-computed tomography was performed to analyze microstructure changes in subchondral bone, hematoxylin and eosin staining was performed to calculate the thickness of the calcified and hyaline cartilage layers, toluidine blue O staining was performed to assess the degenerated cartilage, TRAP-stained osteoclasts were counted, and NF-κB, phosphorylated Jun N-terminal Kinases (p-JNK), and receptor activator of nuclear factor κB ligand (RANKL) were detected using immunohistochemistry. CUR suppressed osteoclastogenesis and bone resorption without cytotoxicity. CUR restrained RANKL-induced activation of NF-κB, p-JNK and up-regulation of osteoclastogenesis-related genes. CUR delayed cartilage degeneration by suppressing osteoclastogenesis and bone resorption in early OA. The mechanism of CUR inhibiting osteoclastogenesis might be associated with NF-κB/JNK signaling pathway, indicating a novel strategy for OA treatment.","author":"Dong Ding","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"db26307139bd33a8bdb30d1a4ab3f2f95b5d0233052cbaaa22f21163f0a8c73b","category":"Interdisciplinary"}