{"title":"Toward a Data‐Effective Calibration of a Fully Distributed Catchment Water Quality Model","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036527?af=R","date":1724911140000,"content":"<h2>Abstract</h2>\n<p>Distributed hydrological water quality models are increasingly being used to manage natural resources at the catchment scale but there are no calibration guidelines for selecting the most effective gauging stations. In this study, we investigated the influence of calibration schemes on the spatiotemporal performance of a fully distributed process-based hydrological water quality model (mHM-Nitrate) for discharge and nitrate simulations at the Bode catchment in central Germany. We used a single- and two multi-site calibration schemes where the two multi-site schemes varied in number of gauging stations but each subcatchment represented different dominant land uses of the catchment. To extract a set of behavioral parameters for each calibration scheme, we chose a sequential multi-criteria method with 300,000 iterations. For discharge (<i>Q</i>), model performance was similar among the three schemes (NSE varied from 0.88 to 0.92). However, for nitrate concentration (NO3− ${\\mathit{NO}}_{3}^{\\mathit{-}}$), the multi-site schemes performed better than the single site scheme. This improvement may be attributed to that multi-site schemes incorporated a broader range of data, including low <i>Q</i> and NO3− ${\\mathit{NO}}_{3}^{\\mathit{-}}$ values, thus provided a better representation of within-catchment diversity. Conversely, adding more gauging stations in the multi-site approaches did not lead to further improvements in catchment representation but showed wider 95% uncertainty boundaries. Thus, adding observations that contained similar information on catchment characteristics did not seem to improve model performance; however, it increased uncertainty. These results highlight the importance of strategically selecting gauging stations that reflect the full range of catchment heterogeneity rather than seeking to maximize station number, to optimize parameter calibration.</p>","author":"Salman Ghaffar, \nXiangqian Zhou, \nSeifeddine Jomaa, \nXiaoqiang Yang, \nGünter Meon, \nMichael Rode","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"db2b36e4620ea5c4b75b5cea6d1b65d4829cc68ab11a02faf68642e7d1760c0e","category":"Environment"}