{"title":"Optimising Clinical Epidemiology in Disease Outbreaks: Analysis of ISARIC-WHO COVID-19 Case Report Form Utilisation","link":"https://www.preprints.org/manuscript/202407.1459/v1","date":1721289221000,"content":"Standardised forms for capturing clinical data promote consistency in data collection and analysis across study sites, enabling faster, higher-quality evidence generation. ISARIC and the World Health Organization have developed case report forms (CRFs) for the clinical characterisation of several infectious disease outbreaks. To improve the design and quality of future forms, we analysed the inclusion and completion rates of the 243 fields on the ISARIC-WHO COVID-19 CRF. Data from 42 diverse collaborations, covering 1,886 hospitals and 950,064 patients were analysed. A mean of 129.6 fields (53%) were included in the adapted CRFs implemented across the sites. Consistent patterns of field inclusion and completion aligned with globally recognised research priorities in outbreaks of novel infectious diseases. Outcome status was the most highly included (95.2%) and completed (89.8%) field, followed by admission demographics (79.1% and 91.6%), comorbidities (77.9% and 79.0%), signs &amp;amp; symptoms (68.9% and 78.4%) and vitals (70.3% and 69.1%). Mean field completion was higher in severe patients (70.2%) than in all patients (61.6%). The results indicate that clinical characterisation CRFs can be streamlined to reduce data collection time, including the modularisation of CRFs to offer a choice of data volume collection and the separation of critical care interventions. This data-driven approach to designing CRFs enhances the efficiency of data collection to inform patient care and public health response.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db376571bc9c54ddb729509bfb6562dc4756228161c2edb49e1ff019617654c7","category":"Interdisciplinary"}