{"title":"Nickel induces epithelial‐mesenchymal transition in pulmonary fibrosis in mice via activation of the oxidative stress‐mediated TGF‐β1/Smad signaling pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24229?af=R","date":1710506127000,"content":"<h2>Abstract</h2>\n<p>Nickel (Ni) is recognized as a carcinogenic metal, and its widespread use has led to severe environmental and health problems. Although the lung is among the main organs affected by Ni, the precise mechanisms behind this effect remain poorly understood. This study aimed to elucidate the physiological mechanisms underlying Ni-induced pulmonary fibrosis (PF), using various techniques including histopathological detection, biochemical analysis, immunohistochemistry, western blotting, and quantitative real-time PCR. Mice were treated with nickel chloride (NiCl<sub>2</sub>), which induced PF (detected by Masson staining), up-regulation of α-smooth muscle actin (α-SMA), and collagen-1 mRNA and protein expression. NiCl<sub>2</sub> was found to induce PF by: activation of the epithelial-mesenchymal transition (EMT) and the transforming growth factor-β1 (TGF-β1)/Smad signaling pathway; up-regulation of protein and mRNA expression of TGF-β1, p-Smad2, p-Smad3, vimentin, and N-cadherin; and down-regulation of protein and mRNA expression of E-cadherin. In addition, NiCl<sub>2</sub> treatment increased malondialdehyde content while inhibiting antioxidant activity, as indicated by decreased catalase, total antioxidant capacity, and superoxide dismutase activities, and glutathione content. Co-treatment with the effective antioxidant and free radical scavenger N-acetyl cysteine (NAC) plus NiCl<sub>2</sub> was used to study the effects of oxidative stress in NiCl<sub>2</sub>-induced PF. The addition of NAC significantly mitigated NiCl<sub>2</sub>-induced PF, and reversed activation of the TGF-β1/Smad signaling pathway and EMT. NiCl<sub>2</sub>-induced PF was therefore shown to be due to EMT activation via the TGF-β1/Smad signaling pathway, mediated by oxidative stress.</p>","author":"Shanchuan Cao, \nHeng Yin, \nXinglai Li, \nXin Zeng, \nJingbo Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"db38b57c6ebb15e6564b3bace96d34348342b8e1896bb80171557e294c206b7c","category":"Environment"}