{"title":"Effect soluble organic fraction mass fraction on emission characteristics of carbon black","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14369?af=R","date":1710333876000,"content":"<h2>Abstract</h2>\n<p>According to China's latest emission regulations for the year 2021, diesel vehicles are required to be equipped with a diesel particulate filter (DPF) in accordance with emission standards. To comprehensively understand the regeneration and emission performance of the DPF, an externally heated regeneration performance test bench was established. This study aims to investigate the influence of the soluble organic fraction (SOF) and types of carbon black on particle emissions from the outlet of the DPF. The experimental results indicate that both SOF and carbon black structure can affect DPF regeneration. When the SOF mass fraction increases to 20%, SOF plays a dominant role. The regeneration efficiency of Printex-U and FW200 carbon black is 62.4% and 60.6%, respectively, with total mass concentrations of 21.8 and 14.9 mg/m<sup>3</sup> at the DPF outlet. Compared to conditions without SOF, the regeneration efficiency and total mass concentration at the DPF outlet increase by 1.3 times and 6.6 times for Printex-U carbon black, and 1.8 times and 440 times for FW200 carbon black, respectively. Additionally, when SOF mass fraction is 0%, the highest proportion of the average particle diameter for both Printex-U and FW200 carbon black is in the [10, 20] nm range, at 20% and 95%, respectively. When the SOF mass fraction is increased to 20%, the proportions of the average particle diameter for both types of carbon black in the [10, 20] nm range rise to above 99%. This study provides a relevant experimental foundation for the emission control of DPF.</p>","author":"Jiansong Li, \nZhongwei Meng, \nJianxiong Liao","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"db3b2948d6de7975a412dd696f4267ea5de0ab9bd8170d94ec7de7b6c099382e","category":"Environment"}