{"title":"Selection maintains a nonadaptive floral polyphenism","link":"https://academic.oup.com/evlett/article/8/4/610/7658294?rss=1","date":1714003200000,"content":"<span><div>Abstract</div>Adaptive phenotypic plasticity evolves in response to the contrasting selection pressures that arise when organisms face environmental heterogeneity. Despite its importance for understanding how organisms successfully cope with environmental change, adaptive plasticity is often assumed but rarely demonstrated. We study here the adaptive nature of the extreme seasonal within-individual floral polyphenism exhibited by the crucifer <span>Moricandia arvensis</span>, a Mediterranean species that produces two different types of flowers depending on the season of the year. During spring, this species has large, cross-shaped, lilac flowers, while during summer, it develops small, rounded, white flowers. Although floral polyphenism was associated with increased plant fitness, selection moved floral traits away from their local optimum values during the harsh summer. This result strongly suggests that floral polyphenism is not adaptive in <span>M. arvensis</span>. The main factor selecting against floral polyphenism was pollinators, as they select for the same floral morph in all environments. Despite not being adaptive, floral polyphenism occurs throughout the entire distribution range of <span>M. arvensis</span> and has probably been present since the origin of the species. To solve this paradox, we explored the factors causing floral polyphenism, finding that floral polyphenism was triggered by summer flowering. Summer flowering was beneficial because it led to extra seed production and was favored by adaptive plasticity in leaf functional traits. Taken together, our study reveals a complex scenario in which nonadaptive floral polyphenism has been indirectly maintained over <span>M. arvensis</span> evolutionary history by selection operating to favor summer flowering. Our study provides thus strong evidence that nonadaptive plasticity may evolve as a byproduct of colonizing stressful environments.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"db3d050347d575a27ac8e2271cc36b8b77c17a2d2434b9913fb5d5ce20789845","category":"Environment"}