{"title":"A New Hope for Multiple Myeloma: Harnessing the Power of Non-Cancer Medications","link":"https://www.preprints.org/manuscript/202405.1938/v1","date":1716984117000,"content":"Multiple myeloma (MM) is a common type of cancer that unfortunately leads to a significant number of deaths each year. The majority of the reported MM cases are detected in the advanced stages, posing significant challenges for treatment. Additionally,  all MM patients eventually develop resistance or experience relapse, therefore advances in treatment are needed. However, developing new anti-cancer drugs, especially for MM, requires significant financial investment and a lengthy development process. The study of drug repurposing involves exploring the potential of existing drugs for new therapeutic uses. This can significantly reduce both time and costs, which is typically a major concern for MM patients. The utilization of pre-existing non-cancer drugs for various myeloma treatments presents a highly efficient and cost-effective strategy, considering their prior preclinical and clinical development. The drugs have shown promising potential in targeting key pathways associated with MM progression and resistance. Thalidomide exemplifies the success that can be achieved through this strategy. This review delves into the current trends, the challenges faced by conventional therapies for MM, and the importance of repurposing drugs for MM. This review highlights a noncomprehensive list of conventional therapies that have potentially significant anti-myeloma properties and anti-neoplastic effects. Additionally, we offer valuable insights into the resources that can help streamline and accelerate drug repurposing efforts in the field of MM.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db48ce33fe2e9d375bcd81cbf6f401f324a1b2e46746f716413f605b02081d31","category":"Interdisciplinary"}