{"title":"David Lappartient stands unopposed in bid for second UCI presidential term","link":"https://cyclingtips.com/2021/07/david-lappartient-stands-unopposed-in-bid-for-second-uci-presidential-term/","date":1625624651000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00031663-002-650x433.jpg\" /></div><h2>David Lappartient stands unopposed in bid for second UCI presidential term</h2><p>\n</p><p>In the lead-up to the 2021 UCI Congress and elections, due to be held in Belgium on September 24, the UCI has <a href=\"https://www.uci.org/news/2021/uci-presidency-and-uci-management-committee-publication-of-the-list-of-candidates\">published a list</a> of the candidates for the presidency and the management committee. </p>\n\n\n\n<p>The current UCI President, David Lappartient, is the only candidate for the presidency, which will mean that his re-election for a second term is essentially a formality. </p>\n\n\n\n<p>Lappartient steamrolled previous president Brian Cookson to assume the mantle at the 2017 Congress, running on a platform of greater investment in the continental federations and eradicating the scourge of technological fraud. In the years since, having uncovered no examples of “motor doping”, Lappartient has pivoted toward more nebulously protecting the integrity of the sport. </p>\n\n\n\n<figure><img /><figcaption>Lappartient at the 2017 UCI Congress. Photo: Simon Wilkinson</figcaption></figure>\n\n\n\n<p>Under Lappartient’s reign, Turkmenistan was awarded the 2021 Track World Championships. In 2020, Lappartient and influential Russian oligarch Igor Makarov went above and beyond by <a href=\"https://cyclingtips.com/2020/06/the-uci-just-gave-its-highest-award-to-a-dictator/\">handing the dictator of Turkmenistan, Gurbanguly Berdimuhamedov, a mysterious award</a> and then failing to disclose it publicly. This prompted an <a href=\"https://cyclingtips.com/2020/11/the-dictator-the-oligarch-and-the-uci-president/\">extensive CyclingTips investigation</a> of Makarov’s influence in the sport, Lappartient’s integrity, and the shadowy plays motivating the governance of cycling.</p>\n\n\n\n<p>Last month, citing COVID-19 as the reasoning – despite Turkmenistan not officially acknowledging its existence – the UCI announced that the <a href=\"https://cyclingtips.com/2021/06/uci-moves-track-worlds-from-covid-free-turkmenistan-due-to-covid/\">Track Champs had been moved</a>. The replacement host is yet to be announced. </p>\n\n\n\n<figure><img /><figcaption>Lappartient on a visit to Ashgabat Velodrome, wearing a jazzy Turkmenistan tracksuit.</figcaption></figure>\n\n\n\n<p>In addition to the UCI Presidency, Lappartient has close ties to the French Cycling Federation – of which he is a past president – and the Amaury Sports Organisation (ASO), organisers of the Tour de France. He simultaneously receives a salary as mayor of a town in Brittany that has enjoyed Tour de France hosting rights during his presidency, and welcomed the Tour to his home region in 2021. </p>\n\n\n\n<p>In addition to Lappartient’s unopposed re-election, the UCI announced the candidates for the management committee, which will be voted upon at the Congress. </p>\n\n\n\n<p>Automatically elected are the five continental federation presidents, some of whom have been around for decades and some of whom were newly elected this year. They are Dr Mohamed Wagih Azzam (for Africa), Enrico Della Casa (for Europe), José Manuel Pelaez (for the Americas), Osama Ahmed Abdullah Al Shafar (for Asia), and Tony Mitchell (for Oceania). </p>\n\n\n\n<p>There are some familiar names in the list of candidates for other management committee positions, including <a href=\"https://cyclingtips.com/2020/11/the-dictator-the-oligarch-and-the-uci-president/\">Makarov</a>, previous UEC president Rocco Cattaneo, Bob Stapleton, and the UCI’s head of anti-doping from 2006-2010, Australian Anne Gripper. Also standing for election is the brother of <a href=\"https://cyclingtips.com/2019/02/the-weekly-spin-the-intersection-of-pro-cycling-and-basic-human-rights/\">accused human rights abuser</a> Sheikh Nasser bin Hamad Al Khalifa, <a href=\"https://cyclingtips.com/2016/06/commentary-torture-allegations-too-big-for-cycling-to-ignore/\">founder of Bahrain Victorious</a>. </p>\n\n\n\n<p>The 2021 UCI Congress, held concurrently with this year’s Road World Championships, will also reveal the recipients of the 2025 and 2026 Road Worlds. The 2025 edition is widely tipped to be awarded to Rwanda, a country with a vibrant cycling culture but some lingering questions over the authoritarian rule of President Paul Kagame. <a href=\"https://migration.gov.tm/en/president-of-turkmenistan-receives-president-of-areti-international-group/\">Turkmen state media</a> has made <a href=\"https://business.com.tm/post/3933/the-president-of-turkmenistan-receives-the-head-of-areti\">repeated claims</a> that the country will host the 2026 Road World Championships, seemingly <a href=\"https://tdh.gov.tm/en/post/24352/president-of-turkmenistan-receives-president-of-areti-international-group\">under Makarov’s guiding hand</a>. The UCI has not directly responded to questions from CyclingTips about this.  </p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/david-lappartient-stands-unopposed-in-bid-for-second-uci-presidential-term/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"db4c7069180f7a15c1d128086f71be3dfcb1de1731a9097eae16c808da938988","category":"Cycling"}