{"title":"Audit shows increase in Women’s WorldTour team salaries for 2021","link":"https://www.cyclist.co.uk/news/9639/audit-shows-increase-in-women-s-worldtour-team-salaries-for-2021","date":1621504842000,"content":"<span>\n      <span><a href=\"/authors/joseph-delves\">Joseph Delves</a></span>\n  </span><div>  \n  <div>      <div><span>20 May 2021</span></div>    </div></div><p>\nConditions improve for those on the nine current UCI WorldTeams while other outfits loiter at Continental level</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/05/lizzie_deignan_pressesports_2028207_cycli-5.jpg?itok=ryq4JuYH\" />  </div>\n<div>\n      <p> The <a href=\"/tags/uci\">UCI</a> has released a report by external auditor EY Lausanne showing the average salary of racers competing for Women's WorldTeams has increased by 25% from 2020 to 2021.</p>\n<p>Last year elite women’s racing was split between UCI WorldTeams and UCI Women’s Continental Teams. Along with other qualification criteria, the payment of an increased minimum wage was one prerequisite to gaining the higher WorldTeam status.</p>\n<p>A rider survey in 2017 found as many as half of female riders racing for as little as €5,000 a year, with many also going unpaid. By comparison, minimum salaries for riders on WorldTeams were set at €15,000 in 2020, rising to €20,000 in 2021.</p>\n<p>Scheduled to reach €27,500 next year, by 2023 women’s WorldTour riders will be entitled to the same minimum salary as men riding at the UCI ProTeams level. Currently €32,100, this is still a tier down from the best-paid men’s WorldTour riders who are entitled to €39,068.</p>\n<h3>Closer median earnings</h3>\n<p>Looking to assess the effects of the changes for riders on the nine registered WorldTeams, the UCI appointed independent auditor EY Lausanne to investigate the impact on average salaries.</p>\n<p>The EY Lausanne study found that the average salary of members of the UCI Women's WorldTeams has increased by 25% from 2020 to 2021. According to the study, the creation of a minimum salary has also narrowed the gap in average salaries paid to UCI Women’s WorldTeam riders and members of the men’s UCI ProTeams.</p>\n<p>The report suggests that while in 2020 the latter earned on average 67.53% more than their female counterparts, this gap has been reduced to 44.21% in 2021.</p>\n<p>Comparing average salaries is difficult because of <a href=\"/news/9390/chris-froome-tops-list-of-cyclings-top-earners-according-to-reports\">the extreme variation between the amounts paid to star riders</a> versus domestiques. However, on a comparative median salary basis, the UCI now suggest riders in the Women's WorldTeams earn as much as their male counterparts in the UCI ProTeams.</p>\n<p>'The rise in UCI Women’s WorldTeam salaries and budgets shows that the reform of professional women’s road cycling is having a positive impact on women riders and their teams,' said UCI President David Lappartient.</p>\n<p>'There’s still work to be done to strengthen the sector and continue to develop it, but the creation of the UCI Women's WorldTeams, four years after the creation of the UCI Women's WorldTour, is a central element for the growth of women's cycling.'</p>\n<p>Riders on WorldTeams also enjoy benefits that would be standard in most other professions, such as health insurance, maternity leave, life insurance and paid holidays. These will soon be joined by mandated employer contributions towards a pension plan.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/9390/chris-froome-tops-list-of-cyclings-top-earners-according-to-reports\">Chris Froome tops list of cycling's top earners, according to reports</a></div>      <div><a href=\"/news/1803/giro-ditalia-2021-route-riders-start-list-live-tv\">Giro d'Italia 2021: Full details for this year's race plus daily photo galleries</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 114: on sale now!</a></div>    </div></div><p>\nThis year the nine UCI Women’s WorldTeams are Alé BTC Ljubljana, <a href=\"/tags/canyon-sram\">Canyon-Sram</a>, FDJ Nouvelle-Aquitaine Futuroscope, Liv Racing, <a href=\"/tags/movistar\">Movistar</a>, <a href=\"/tags/team-bikeexchange\">Team BikeExchange</a>, <a href=\"/tags/team-dsm\">Team DSM</a>, <a href=\"/tags/sd-worx\">SD Worx</a> and <a href=\"/tags/trek-segafredo\">Trek–Segafredo</a>.</p>\n<p>Riders on these squads will all benefit from the enhanced benefits and employment rights. However, the disproportionately large number of Continental Teams sitting a tier below suggests some team owners remain unwilling to commit to the increased levels of pay necessary to secure WorldTeam status, despite otherwise having the ability to qualify. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"db52c1ab111c2aaf1f6bda4bb84f1c7d6fbfb4f3434e51d170e47c8b26cd109a","category":"Cycling"}