{"title":"SARS-CoV-2 clade dynamics and their associations with hospitalisations during the first two years of the COVID-19 pandemic","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303176","date":1715349600000,"content":"<p>by Taavi Päll, Aare Abroi, Radko Avi, Heiki Niglas, Arina Shablinskaja, Merit Pauskar, Ene-Ly Jõgeda, Hiie Soeorg, Eveli Kallas, Andrio Lahesaare, Kai Truusalu, Dagmar Hoidmets, Olga Sadikova, Kaspar Ratnik, Hanna Sepp, Liidia Dotsenko, Jevgenia Epštein, Heleene Suija, Katrin Kaarna, Steven Smit, Lili Milani, Mait Metspalu, Ott Eric Oopkaup, Ivar Koppel, Erik Jaaniso, Ivan Kuzmin, Heleri Inno, Uku Raudvere, Mari-Anne Härma, Paul Naaber, Tuuli Reisberg, Hedi Peterson, Ulvi Gerst Talas, Irja Lutsar, Kristi Huik</p>\r\nBackground <p>The COVID-19 pandemic was characterised by rapid waves of disease, carried by the emergence of new and more infectious SARS-CoV-2 virus variants. How the pandemic unfolded in various locations during its first two years has yet to be sufficiently covered. To this end, here we are looking at the circulating SARS-CoV-2 variants, their diversity, and hospitalisation rates in Estonia in the period from March 2000 to March 2022.</p> Methods <p>We sequenced a total of 27,550 SARS-CoV-2 samples in Estonia between March 2020 and March 2022. High-quality sequences were genotyped and assigned to Nextstrain clades and Pango lineages. We used regression analysis to determine the dynamics of lineage diversity and the probability of clade-specific hospitalisation stratified by age and sex.</p> Results <p>We successfully sequenced a total of 25,375 SARS-CoV-2 genomes (or 92%), identifying 19 Nextstrain clades and 199 Pango lineages. In 2020 the most prevalent clades were 20B and 20A. The various subsequent waves of infection were driven by 20I (Alpha), 21J (Delta) and Omicron clades 21K and 21L. Lineage diversity via the Shannon index was at its highest during the Delta wave. About 3% of sequenced SARS-CoV-2 samples came from hospitalised individuals. Hospitalisation increased markedly with age in the over-forties, and was negligible in the under-forties. Vaccination decreased the odds of hospitalisation in over-forties. The effect of vaccination on hospitalisation rates was strongly dependent upon age but was clade-independent. People who were infected with Omicron clades had a lower hospitalisation likelihood in age groups of forty and over than was the case with pre-Omicron clades regardless of vaccination status.</p> Conclusions <p>COVID-19 disease waves in Estonia were driven by the Alpha, Delta, and Omicron clades. Omicron clades were associated with a substantially lower hospitalisation probability than pre-Omicron clades. The protective effect of vaccination in reducing hospitalisation likelihood was independent of the involved clade.</p>","author":"Taavi Päll","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"db63cadb53d5d2f920d25500e53d356989b98bdface13a7d39bb276ea9739a61","category":"Interdisciplinary"}