{"title":"Characterization of Hypercapnia Effects in Experimental Models with or without Acute Lung Injury: A Scoping Review","link":"https://www.preprints.org/manuscript/202408.2048/v1","date":1724835697000,"content":"Background: Ventilatory strategies in acute respiratory distress syndrome patients aim to mitigate the risk of acute lung injury (ALI). However, prolonged utilization of these strategies may precipitate alveolar carbon dioxide elevation and pH reduction. This scoping review endeavors to present extant knowledge concerning hypercapnia effects in experimental models, with or without ALI, specifically focusing on delineating the immunologically mediated pulmonary tissue damage; Methods: A systematic exploration encompassing PubMed, Web of Science, ScienceDirect, Cochrane Reviews, and Scielo databases was undertaken. Articles published between January 1, 2008, and December 31, 2022, were screened for their elucidation of hypercapnia's immunological impact on lung tissue, utilizing experimental or biological models, irrespective of ALI presence; Results: Following duplicate removal and predefined criteria filtering, 30 pertinent articles scrutinizing hypercapnia's influence on pulmonary epithelium were identified. It was observed that hypercapnia induces perturbations in innate immune response gene transcription, mediated via Nuclear Factor-kappa B attenuation. Furthermore, a compromised innate immune response against injurious agents was noted. Concurrently, disruption and subsequent resealing of alveolar epithelial cells were evidenced, primarily through Na/K-ATPase endocytosis, impeding fluid reabsorption at the alveolar epithelium level; Conclusions: In experimental settings, with or without ALI, hypercapnia's immunomediated mechanisms exacerbate innate immune system impairment and disrupt the respiratory epithelium's repair and healing processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db63ce726e05f237404864684f596738ce6c06dd2b1d172e9d1703f6192a779f","category":"Interdisciplinary"}