{"title":"The GPR30 Receptor is Involved in IL-6-Induced Metastatic Properties in MCF-7 Luminal Breast Cancer Cells","link":"https://www.preprints.org/manuscript/202407.2053/v1","date":1721912563000,"content":"Luminal breast cancer has a high incidence worldwide and is a severe health threat. Estrogen receptor alpha (ER-α) is activated by 17β-estradiol (E2), and its overexpression promotes cancerous characteristics. Luminal breast cancer is an epithelial type; however, the cytokine IL-6 secreted by cells from the tumor microenvironment stimulates the epithelial to mesenchymal transition (EMT) and promotes metastasis. Also, IL-6 decreases ER-α levels, favoring the tamoxifen (TMX) resistance development. However, genes under E2 regulation continue expressing even though this receptor is absent. GPR30 is an alternative E2 receptor present in both luminal and aggressive triple-negative breast cancer and is related to TMX resistance and cancer progression. The roles of GPR30 and IL-6 on metastasis have been individually established; however, their interplay remains unexplored. This study aims to elucidate the role of GPR30 in IL-6-induced metastatic properties in MCF-7 luminal breast cancer cells. Results showed that GPR30 contributes to the E2-induced MCF-7 proliferation because its inhibition with the antagonist G15 and the Pertussis toxin (PTX) diminished it. Besides, GPR30 upregulated vimentin and downregulated E-cadherin levels in MCF-7 and in TMX-resistant (R-TMX) cells and is also involved in the IL-6-induced migration, invasion, and TMX resistance in MCF-7 cells. In addition, in MDA-MB-231 triple-negative cells, both basal and IL-6-induced metastatic properties were related to GPR30 activity. These results indicate that the GPR30 receptor regulates the EMT induced by IL-6 in breast cancer cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db6b2ca56374d8547e258507706e6c510b72a2427579d74d097dbaa178ab31dd","category":"Interdisciplinary"}