{"title":"A technological biodiversity monitoring toolkit for biocredits","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14725?af=R","date":1723645142000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6c38f0d7-5c1a-4112-b894-28845e7e1a0c/jpe14725-toc-0001-m.png\" alt=\"A technological biodiversity monitoring toolkit for biocredits\" />\n<p>Technological solutions for biodiversity monitoring are not (yet) a panacea but are key for evidenceable monitoring at scale. For current use in biocredit markets, we advise these are combined with ground validation and human-collected ecological data. Developments in automation and machine learning will rapidly make these technologies more accessible and efficient.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBiodiversity is in crisis globally, and we consistently fail to hit global targets to stem its loss. Inspired by the Kunming-Montreal Global Biodiversity Framework, the biodiversity credit market offers an avenue for vital funding for biodiversity conservation projects around the world. Various biodiversity credit methodologies and standards are becoming available, and most will require the measurement and monitoring of biodiversity at scale.\n\nPrivate investment in conservation through biodiversity credits entails specific needs for biodiversity data collection, including the need for biodiversity claims to be verifiable. We conceptualise these requirements around ‘SAGED’ criteria: <i>Scalable</i>, <i>Accessible</i>, <i>Granular</i> (data of appropriate spatial, taxonomic and temporal resolution), <i>Evidenceable</i> and <i>Directly</i> measured (where possible).\n\nMeasuring and monitoring biodiversity across ecosystems, ecoregions and taxa is expensive and time-consuming with traditional survey methods. These methods often rely on access to experts with sufficient taxonomic and survey expertise, which is challenging in many parts of the world. Accordingly, we review biodiversity monitoring technologies and assess their readiness to fulfil key requirements of assessments for the purpose of nature accounting for biodiversity credits (particularly SAGED criteria).\n\nWe focus on monitoring technologies that are commonly cited by biodiversity credit methodologies, including (e)DNA metabarcoding, passive acoustic monitoring and various other remote sensing methods. We also explore the current limits of these techniques in obtaining appropriate biodiversity measures and metrics for biodiversity finance.\n\n<i>Synthesis and applications</i>. Technological solutions for biodiversity monitoring are not (yet) a panacea but are key for evidenceable monitoring at scale. For current use in biocredit markets, we advise these are combined with ground validation and human-collected ecological data. Developments in automation and machine learning will rapidly make these technologies more accessible and efficient.\n</p>","author":"Helen V. Ford, \nFranziska Schrodt, \nAlexandra Zieritz, \nDaniel A. Exton, \nGeertje van der Heijden, \nJonathan Teague, \nTim Coles, \nRichard Field","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"db80a36ea31183fddd31cba8ef34956ab8cca89aa2543b0623720e6d5f1073bb","category":"Environment"}