{"title":"Key Factors for A Successful Telemedicine Solution for Cardiovascular Diseases: A Systematic Review","link":"https://www.preprints.org/manuscript/202408.0610/v1","date":1723121647000,"content":"Background: Telemonitoring systems in cardiology have shown potential in improving chronic cardiovascular disease (CVD) management. This study aims to evaluate the impact of telemonitoring, mainly through mobile applications, on patient outcomes such as self-care, blood pressure control, quality of life, and hospitalization. Methods: We systematically reviewed studies assessing telemonitoring methods for patients with chronic CVD. The analysis included studies from various geographic regions and healthcare settings, focusing on qualitative outcomes without performing a meta-analysis. Results: Telemonitoring was found to aid in maintaining blood pressure and significantly enhance self-care abilities. Improvements in quality of life were observed in some studies, though results varied. Most studies indicated telemonitoring could effectively manage blood pressure and reduce hypertension-related complications. However, the heterogeneity of interventions and outcomes measured across trials posed challenges for a comprehensive meta-analysis. Conclusions: Integrating telemonitoring systems into routine care can significantly improve disease management and patient outcomes for chronic CVD patients. Future research should standardize telemonitoring interventions and outcome measures, conduct long-term studies, and evaluate the cost-effectiveness of these systems. Greater blindness in future randomized controlled trials and more studies on atrial fibrillation are also necessary. Significant potential exists for telemonitoring to improve patient outcomes and assist in managing chronic illnesses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db808d794ab36f16390cc778dcee7536b1d0d53c7c127d8673c4d2d8d5777421","category":"Interdisciplinary"}