{"title":"Gravel groupsets explained | Everything you need to know about Shimano, SRAM, Campagnolo and Microshift gravel groupsets","link":"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-groupsets/","date":1695715208000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Gravel-groupset-buyers-guide-63ea99b.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Gravel groupset buyer's guide\" title=\"Gravel groupset buyer's guide\" />                                            <p>Gravel groupsets are a burgeoning field, with many options from the major groupset marques (Shimano, SRAM and Campagnolo) as well as from more niche players.</p>\n<p>A gravel groupset is designed for drop-bar <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-gravel-bike/\">gravel bikes</a> (although there may be flat-bar options available too). It typically includes a crankset and cassette offering a wider, lower gear range than a <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupset</a> and a rear derailleur with a clutch to keep the chain running smoothly.</p>\n<p>In this buyer’s guide, we’ll concentrate on the extensive range of gravel groupsets, options and configurations offered by the big three manufacturers, with a quick delve into Microshift.</p>\n<p>Later on, we’ll help you decide which gravel groupset configuration is likely to suit your <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">gravel riding</a> style and give you some pointers on the main considerations when choosing.</p>\n<h2>What is a gravel groupset and what difference can it make to your bike?</h2>\n<p>A gravel bike groupset is designed to offer the gearing needed for riding off-road.</p>\n<p>As explained in more detail in our how to choose section below, that means gearing that provides lower ratios than a road bike groupset. This enables easier progress over steep, loose and muddy terrain on a bike that may be loaded up for greater self-sufficiency or for <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking/\">bikepacking</a>.</p>\n<p>Gravel groupsets borrow much tech from <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">mountain bike groupsets</a>, including their wide gear range and usually a <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">single chainring</a> option (usually denoted 1x) as well as double chainrings, denoted 2x.</p>\n<p>Some provide compatibility with MTB components as well, allowing you to mix and match for even more gearing choices.</p>\n<p>It’s common for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a> of a gravel groupset to include a clutch mechanism to assist with chain retention. It enables smoother progress and gear shifts when traversing uneven ground and reduces chain slap on the chainstays.</p>\n<h2>How to choose the right gravel groupset for you</h2>\n<p>A few key factors will influence which is the best gravel groupset configuration for your needs.</p>\n<h3>1x vs 2x</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX RX820 Unstoppable groupset\" title=\"Shimano GRX RX820 Unstoppable Crankset 2\" />\n\n</div><div><figcaption><span><i></i> A 1x crankset’s single chainring has deep teeth to improve chain retention.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>A key decision is whether you want a single-chainring (1x) or a double-chainring (2x) groupset. You’d think having twice as many gear ratios available would be a good thing, but in practice, the decision is far more nuanced.</p>\n<p>There are substantial overlaps between the gear ratios on the large and small chainrings for 2x systems, so the actual number of discrete ratios may not be a lot greater than with a 1x system.</p>\n<p>You might not get a significantly greater range overall either and some 1x ‘<a href=\"https://www.bikeradar.com/advice/buyers-guides/mullet-drivetrain/\">mullet’ builds</a> offer more range than almost all 2x systems because 1x derailleurs are designed to shift smoothly over very wide-range cassettes, while 2x rear derailleurs have more limited shift range.</p>\n<p>You may get smaller jumps between ratios with a 2x drivetrain, which can be useful for maintaining cadence over undulating terrain. On the other hand, once you get up to 11, 12 or 13-speed cassettes, the jumps between ratios in a 1x drivetrain may not be that great, particularly in the mid-range, where most riders spend most of their time.</p>\n<p>1x reduces complexity so there’s less to go wrong. Here, chainrings and derailleurs are designed to improve chain retention and the teeth on the chainring also help clear mud and dirt from the chain.</p>\n<p>Front derailleurs are prone to collecting dirt and debris from the rear wheel and they also impose constraints on bike design that limit how wide a rear tyre can be accommodated. SRAM’s Wide systems help here, but these are problems that are reduced or eliminated in 1x systems.</p>\n<p>Going 1x can also free up the left shift lever to operate a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-dropper-posts/\">dropper seatpost</a>, or you can run a ‘dumb’ left-side brake lever.</p>\n<h3>Is gravel gearing easier than road gearing?</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX RX820 Unstoppable groupset\" title=\"Shimano GRX RX820 Unstoppable Cassette Spread\" />\n\n</div><div><figcaption><span><i></i> Gravel groupsets offer really wide gear spreads for easier progress off-road.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>Modern gravel bike groupsets are designed to offer you lower gearing than a road bike groupset, to help you to haul yourself up steep, loose inclines. Typically, you’ll have a lowest gear of below 1:1. This usually means a slightly lower highest ratio than on a road bike – but how often do you use your smallest sprocket when riding?</p>\n<p>Most gravel bikes with a conventional 2x drivetrain, that has a cassette with an 11-tooth smallest sprocket, are fitted with a <a href=\"https://www.bikeradar.com/advice/buyers-guides/cranksets/\">sub-compact crankset</a>. Shimano GRX, for example, offers either 48/31t or 46/30t chainring combinations.</p>\n<p>1x SRAM and Campagnolo groupsets, which have 9- or 10-tooth smallest sprockets, offer similarly easy lowest gears and also incorporate chainrings that enable you to shift the ratios available towards lower ranges.</p>\n<h3>Electronic shifting vs mechanical shifting</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SRAM Apex AXS XPLR groupset\" title=\"Sram Apex AXS XPLR - 05\" />\n\n</div><div><figcaption><span><i></i> Apex is SRAM’s first 12-speed groupset to provide both electronic and mechanical options.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>Groupset brands have taken different approaches to electronic shifting for gravel bikes.</p>\n<p>Shimano’s latest <a href=\"https://www.bikeradar.com/news/shimano-grx-r820/\">12-speed gravel groupsets</a> currently offer mechanical shifting only, although there’s an electronic Di2 option in GRX 11-speed. <a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo Ekar</a> is also mechanical only.</p>\n<p>It’s SRAM that has made the strongest move into <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic shifting</a> for gravel bikes. All its 12-speed groupset offerings were electronic until it launched <a href=\"https://www.bikeradar.com/news/2023-sram-apex-groupset/\">Apex 12-speed mechanical</a>. Its 11-speed gravel groupsets are still mechanical though and available at Force, Rival and Apex level with 1x gearing.</p>\n<p>Electronic shifting is less prone to performance degradation through contamination than mechanical. There’s less to go wrong, although if it does, it’s less easily fixed than a cable-actuated system.</p>\n<p>Wrecking an electronic rear derailleur is an expensive proposition – significantly more so than with a mechanical system – although electronic derailleurs are built with tech designed to reduce the risk of damage.</p>\n<p>Even without a full write-off, there’s a lot more wear on a derailleur used off-road than on a road bike groupset component, so you may need to pay more for maintenance regardless of whether your system is electronic or mechanical.</p>\n<h3>Can I swap components?</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Sram Apex Eagle groupset\" title=\"Sram Apex Eagle - 11\" />\n\n</div><div><figcaption><span><i></i> Gravel components are not always compatible: SRAM Apex Eagle uses a different cassette and chain spacing from Apex XPLR, for example.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>For road bike groupsets, you can usually mix components from different tiers together, providing they have the same number of speeds. For example, you can use a 12-speed Shimano 105 cassette with a Dura-Ace derailleur or SRAM Rival AXS shifters with SRAM Red AXS derailleurs.</p>\n<p>With gravel, it can be a bit more tricky. <a href=\"https://www.bikeradar.com/reviews/components/groupsets/gravel-groupset/sram-apex-axs-xplr-review/\">SRAM Apex XPLR AXS</a>, for example, uses a different cassette spacing, chain and derailleur from <a href=\"https://www.bikeradar.com/reviews/components/groupsets/gravel-groupset/sram-apex-eagle-review/\">SRAM Apex Eagle AXS</a>. Shimano 12-speed single chainring components require a <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">Micro Spline freehub</a>, while 12-speed double chainring components use a cassette that sits on a road-going 11-speed HG freehub body. We’ve explained more on freehub compatibility below.</p>\n<p>It’s worth considering what you need for your riding, what constraints a specific choice places on incompatibility and how much replacement parts cost before opting for a specific groupset.</p>\n<h3>Do I need hydraulic braking?</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Sonder Colibri AL road bike\" title=\"Sonder Colibri AL - 03\" />\n\n</div><div><figcaption><span><i></i> Almost all gravel bike groupsets include hydraulic disc brakes.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Gravel bikes all use <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brakes/\">disc brakes</a>, but there’s a choice at the lower spec levels between mechanical and hydraulic systems. The majority of gravel groupsets, with the exception of <a href=\"https://www.bikeradar.com/news/microshift-sword/\">Microshift Sword</a>, have in-series hydraulic disc brakes.</p>\n<p>On lower-spec gravel bikes, though, you may find systems with, for example, Shimano Tiagra shifters operating GRX400 derailleurs and mechanical disc brakes from another brand such as <a href=\"https://www.bikeradar.com/brand/trp/\">TRP</a>. This tends to be a less expensive option than an in-series build with hydraulic disc brakes.</p>\n<p>These mixed systems work perfectly well, but hydraulic braking has significant advantages. First, the hydraulic brake hoses form an enclosed system, so they’re less prone to contamination than brake cables, which are exposed at the calipers.</p>\n<p>Secondly, cable systems can suffer performance degradation due to cable outer compression when you apply the brakes. There’s also friction between the outer and inner cables. Both these factors can lead to a spongy brake feel and less absolute braking power.</p>\n<p>Hydraulic systems aren’t prone to these problems and there’s no loss of efficiency, however tight the bends in the hoses are. Thus, they tend to give you more powerful braking and better brake feel.</p>\n<p>On the flipside, you can get air bubbles or other contamination in hydraulic hoses, which will require a bleed to refresh the brake fluid. <a href=\"https://www.bikeradar.com/advice/workshop/how-to-bleed-shimano-disc-brakes/\">Bleeding</a> a hydraulic disc brake is more messy, complex and costly than cleaning or replacing a <a href=\"https://www.bikeradar.com/advice/workshop/how-to-replace-brake-gear-cables/\">mechanical brake cable</a>.</p>\n<p>Mechanical shift/brake levers tend to be smaller than hydraulic ones too, which some riders may prefer.</p>\n<h2>Gravel groupset options and maximum range</h2>\n<p>There’s a wide range of gravel groupsets available in both 1x and 2x configurations. Your choice of groupset will determine the total range available and also the lowest gear ratio that you can obtain.</p>\n<p>Here’s a summary table of available options and the gear ratio spread between the highest and lowest gear for each configuration.</p>\n<div>\n                <table>\n                <colgroup>\n                            <col></col>\n                            <col></col>\n                            <col></col>\n                            <col></col>\n                            <col></col>\n                    </colgroup>\n        <thead>\n<tr>\n                                                                                        <th>Brand</th><th>Groupset</th><th>Speeds</th><th>1x max range</th><th>2x max range</th></tr>\n</thead>\n<tbody>\n\n        <tr>\n            <td><b>SRAM</b></td><td>Red AXS</td><td>12</td><td>440%</td><td>501%</td>        </tr>\n            <tr>\n            <td></td><td>Force AXS</td><td>12</td><td>440%</td><td>501%</td>        </tr>\n            <tr>\n            <td></td><td>Rival AXS</td><td>12</td><td>440%</td><td>501%</td>        </tr>\n            <tr>\n            <td></td><td>Mullet</td><td>12</td><td>520%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>Apex XPLR AXS/mechanical</td><td>12</td><td>440%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>Apex Eagle AXS/mechanical</td><td>12</td><td>520%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>Force</td><td>11</td><td>381%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>Rival</td><td>11</td><td>381%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>Apex</td><td>11</td><td>381%</td><td>-</td>        </tr>\n            <tr>\n            <td><b>Shimano</b></td><td>GRX820/610 Unbeatable</td><td>12</td><td>450%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>GRX820/610 Unstoppable</td><td>12</td><td>510%</td><td>-</td>        </tr>\n            <tr>\n            <td></td><td>GRX820/610 Undroppable</td><td>12</td><td>-</td><td>507%</td>        </tr>\n            <tr>\n            <td></td><td>GRX815/810/600</td><td>11</td><td>479%</td><td>478%</td>        </tr>\n            <tr>\n            <td></td><td>GRX400</td><td>10</td><td>-</td><td>502%</td>        </tr>\n            <tr>\n            <td><b>Campagnolo</b></td><td>Ekar</td><td>13</td><td>467%</td><td>-</td>        </tr>\n            <tr>\n            <td><b>Microshift</b></td><td>Sword</td><td>10</td><td>436%</td><td>548%</td>        </tr>\n    </tbody>\n    </table>\n    \n    \n    \n</div>\n\n<h2>Gravel groupset freehub compatibility</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano Micro Spline\" title=\"Shimano Micro Spline\" />\n\n</div><div><figcaption><span><i></i> 12-speed Shimano GRX 1x groupsets require a Micro Spline freehub for the cassette.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>As mentioned above, there’s now a wide range of <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">freehub</a> compatibility questions you need to consider when choosing your gravel bike groupset and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-wheels/\">gravel wheels</a> you intend to use.</p>\n<p>Many groupsets work with cassettes that fit on a standard 11-speed Shimano HG11 freehub, including all Shimano’s 11-speed or lower GRX groupsets. For 12-speed Shimano GRX, the 2x Undroppable cassettes also fit an HG11 freehub, but the 1x 12-speed options require a Micro Spline freehub.</p>\n<p>Almost all SRAM’s 12-speed cassettes require an XDR freehub. Again, there are exceptions: SRAM Apex XPLR includes an 11-44t option which requires an HG11 freehub. SRAM Apex Eagle has two options: the 10-50t and 10-52t require an XD freehub or can be fitted to an XDR freehub with a spacer; the 11-50t cassette fits on a standard HG11 freehub.</p>\n<p>There’s yet another freehub standard, N3W, used by Campagnolo for its Ekar cassettes.</p>\n<p>We’ve set it all out in the table below.</p>\n<div>\n                <table>\n                <colgroup>\n                            <col></col>\n                            <col></col>\n                            <col></col>\n                            <col></col>\n                    </colgroup>\n        <thead>\n<tr>\n                                                                        <th>Brand</th><th>Groupset</th><th>Speeds</th><th>Freehub</th></tr>\n</thead>\n<tbody>\n\n        <tr>\n            <td>SRAM</td><td>Red AXS</td><td>12</td><td>XDR</td>        </tr>\n            <tr>\n            <td></td><td>Force AXS</td><td>12</td><td>XDR</td>        </tr>\n            <tr>\n            <td></td><td>Rival AXS</td><td>12</td><td>XDR</td>        </tr>\n            <tr>\n            <td></td><td>Mullet</td><td>12</td><td>XD*</td>        </tr>\n            <tr>\n            <td></td><td>Apex AXS/mechanical</td><td>12</td><td>XDR/HG11†</td>        </tr>\n            <tr>\n            <td></td><td>Apex Eagle AXS/mechanical</td><td>12</td><td>XD*/HG11†</td>        </tr>\n            <tr>\n            <td></td><td>Force</td><td>11</td><td>HG11</td>        </tr>\n            <tr>\n            <td></td><td>Rival</td><td>11</td><td>HG11</td>        </tr>\n            <tr>\n            <td></td><td>Apex</td><td>11</td><td>HG11</td>        </tr>\n            <tr>\n            <td>Shimano</td><td>GRX 820/610 Unbeatable</td><td>12</td><td>Micro Spline</td>        </tr>\n            <tr>\n            <td></td><td>GRX 820/610 Unstoppable</td><td>12</td><td>Micro Spline</td>        </tr>\n            <tr>\n            <td></td><td>GRX 820/610 Undroppable</td><td>12</td><td>HG11</td>        </tr>\n            <tr>\n            <td></td><td>GRX815/810/600</td><td>11</td><td>HG11</td>        </tr>\n            <tr>\n            <td></td><td>GRX400</td><td>10</td><td>HG11</td>        </tr>\n            <tr>\n            <td>Campagnolo</td><td>Ekar</td><td>13</td><td>N3W</td>        </tr>\n            <tr>\n            <td>Microshift</td><td>Sword</td><td>10</td><td>HG11</td>        </tr>\n    </tbody>\n    </table>\n    \n    \n    \n</div>\n\n<p><em>* Can also use an XDR freehub with a 1.85mm spacer</em><br />\n<em>† Cassettes for Apex groupsets with an 11t smallest sprocket fit on an HG11 freehub</em></p>\n<h2>SRAM gravel groupsets explained</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cyclist bunny hopping on a Cervelo gravel bike with SRAM Apex AXS XPLR groupset\" title=\"Cyclist bunny hopping on a Cervelo gravel bike with SRAM Apex AXS XPLR groupset\" />\n\n</div><div><figcaption><span><i></i> SRAM has gravel-oriented XPLR 1x versions of all its groupsets.</span></figcaption><span> <i>SRAM</i></span></div>\n<p>Rather than labelling its groupsets specifically as gravel, SRAM offers gravel configurations of its road bike groupsets.</p>\n<p>It gets more complex though, because it also has XPLR variants of all its groupsets. These all use single chainrings, clutched rear derailleurs and cassettes with wider range than its 2x configurations. These are more gravel-specific, although they are an option on a road bike as well.</p>\n<p>You can mix and match road and MTB components in a so-called ‘mullet’ build, offering even more range.</p>\n<p>SRAM has muddied the waters further with its latest fourth-tier <a href=\"https://www.bikeradar.com/news/2023-sram-apex-groupset/\">Apex</a> 12-speed groupset, which includes an XPLR option related to its road bike groupsets as well as an Eagle option, which uses tech and components derived from mountain bikes. Both are 1x only.</p>\n<p>SRAM’s electronic options are labelled AXS and are all 12-speed. You’ll sometimes see the HRD acronym appended to groupset names, which denotes hydraulic disc brakes – which all its gravel configurations provide.</p>\n<h3>SRAM Red AXS</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Factor Ostro Gravel against a graffiti background\" title=\"DSC00299\" />\n\n</div><div><figcaption><span><i></i> SRAM Red eTap AXS XPLR offers a top-spec 1x option.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>For gravel riding, SRAM’s top-spec Red AXS 12-speed electronic groupset offers a 2x configuration, which will accept a 10-36t cassette. Paired with a 46/33t crankset, this provides a sub-1:1 gear ratio, which should enable you to haul yourself up the majority of gravel slopes, while the 10-tooth smallest sprocket still provides an adequate high-end range.</p>\n<p>SRAM also offers the <a href=\"https://www.bikeradar.com/reviews/components/groupsets/gravel-groupset/sram-red-etap-axs-xplr/\">Red XPLR AXS</a> rear derailleur, which can be used in a single-chainring setup with a cassette with up to a 10-44t range, opening up a second gravel-specific option.</p>\n<p>Both derailleurs include SRAM’s Orbit fluid damper to help reduce chain slap and keep the drivetrain quiet and precisely oriented.</p>\n<p>You can spec a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a> crankset for both 2x and 1x configurations; the 2x power meter is two-sided, while the 1x power meter measures power on the left crank only.</p>\n<h3>SRAM Force AXS</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jane Barr’s Liv Devote Advanced Pro SRAM Force AXS\" title=\"MG_BR_Gravel Champs_Jane Barr_138\" />\n\n</div><div><figcaption><span><i></i> SRAM Force AXS includes this Wide 2x option for gravel riders.</span></figcaption><span> <i>Matt Grayson</i></span></div>\n<p><a href=\"https://www.bikeradar.com/news/new-sram-force-etap-axs/\">Force AXS</a> provides the same range of 2x and 1x 12-speed electronic groupset configurations as Red AXS, so you can run the same components with the same gear ratios. Force AXS rear derailleurs use the same Orbit fluid damper as Red.</p>\n<p>Force AXS also offers you additional options with its Wide components. These shift the chainline 2.5mm outboard, which provides greater tyre clearance. There are both 1x and 2x configurations available. The 2x Wide groupset requires a specific Wide front derailleur.</p>\n<p>There are, however, constraints to the Wide component configurations. The double crankset is available with 43/30t chainrings only and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/cranksets/\">bolt circle diameter</a> is different from the non-Wide crankset, so you can’t swap chainrings. The 1x crankset is 40-tooth only.</p>\n<p>SRAM also offers Force-level power meter options. The 2x standard-spacing power meter measures separate left and right power, the 1x and both Wide power meters measure left-side power only.</p>\n<h3>SRAM Rival AXS</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cervélo Áspero Rival XPLR Etap AXS 1 disc gravel bike\" title=\"Cervélo Áspero Rival XPLR Etap AXS 1 - 07\" />\n\n</div><div><figcaption><span><i></i> SRAM Rival AXS offers similar 1x and 2x configurations to Force AXS.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-rival-etap-axs-review/\">SRAM Rival AXS</a> has the same range of non-Wide and Wide groupset options and gearing choices as Force AXS.</p>\n<p>The materials used lead to an increase in weight and there are some features of Force AXS that Rival AXS doesn’t offer: there’s a mechanical sprung clutch in Rival rather than Force’s fluid damper and all the Rival power meters are single-sided only, for example.</p>\n<h3>SRAM mullet build</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Propain Spindrift Al MX Performance full suspension mullet mountain bike\" title=\"Propain Spindrift Al Mix Performance SRAM GX Eagle AXS rear mech\" />\n\n</div><div><figcaption><span><i></i> A mullet build enables you to pair a road bike crankset with an Eagle AXS derailleur and cassette for a very wide gear spread.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>All of the above groupsets enable you to mix road-going shifters and cranksets with any of the MTB-derived Eagle AXS 12-speed derailleurs and cassettes in a 1x configuration.</p>\n<p>This enables you to spec your gravel bike with a cassette with a spread as wide as 10-52t for a monster gear range, although with significant jumps between gear ratios.</p>\n<h3>SRAM Apex</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SRAM Apex XPLR mechanical groupset\" title=\"SRAM Apex XPLR mechanical groupset\" />\n\n</div><div><figcaption><span><i></i> SRAM Apex XPLR includes this mechanical option as well as an electronic AXS alternative.</span></figcaption><span> <i>SRAM</i></span></div>\n<p>Things get complex with <a href=\"https://www.bikeradar.com/news/2023-sram-apex-groupset/\">SRAM Apex</a> 12-speed, although they start off simple because it’s 1x only and uses the Wide chainline. There are single-sided power meter options.</p>\n<p>First up, there’s Apex XPLR AXS. This offers electronic shifting with 10-36t, 10-44t and 11-44t cassettes. The last of these fits on a standard Shimano 11-speed freehub rather than requiring a wheel with an XDR freehub body.</p>\n<p>There’s also an Apex XPLR mechanical shifting option, which will accept the 10-44t and 11-44t cassettes only.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Sram Apex Eagle groupset\" title=\"Sram Apex Eagle - 09\" />\n\n</div><div><figcaption><span><i></i> SRAM Apex Eagle offers an in-series mullet build for gravel riders.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>Next, there’s Apex Eagle in electronic (AXS) and mechanical versions. This is effectively an in-series mullet build and works with a 10-50t, 11-50t or 10-52t cassette. The 11-50t cassette fits on a Shimano 11-speed freehub rather than XDR.</p>\n<p>Apex Eagle uses MTB-like spacing, so the cassettes are narrower than the Apex XPLR cassettes (and the rest of SRAM’s gravel offerings above).</p>\n<p>They also use an MTB-derived chain rather than the road-going Flat Top chain used by the other SRAM gravel groupsets.</p>\n<h3>SRAM Force 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Marin Gestalt X custom build commuter bicycle\" title=\"Marin Gestalt X custom build commuter bicycle\" />\n\n</div><div><figcaption><span><i></i> Force 1 is the top spec in SRAM’s legacy 11-speed mechanical drivetrains.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>SRAM’s legacy <a href=\"https://www.bikeradar.com/features/sram-1x-road-force-1-and-rival-1-groupsets-first-ride-video/\">11-speed gravel groupset</a> options all offer mechanical shifting, with the top-spec being Force 1 mechanical.</p>\n<p>This offers 40t and 42t cranksets with carbon arms, which can be paired with an 11-28t, 11-36t or 11-42t cassette, operated by a rear derailleur with a mechanical roller bearing clutch.</p>\n<h3>SRAM Rival 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Sonder Camino Ti Rival 1\" title=\"Sonder Camino Ti Rival 1 - long term - 04\" />\n\n</div><div><figcaption><span><i></i> SRAM Rival 1 has an alloy crankset in place of the carbon crank arms of Force 1.</span></figcaption><span> <i>Robyn Furtado / Our Media</i></span></div>\n<p>Rival 1 11-speed mechanical shares much of the tech of Force, but has 40t, 42t, 44t and 50t chainring options, and alloy crank arms. The rear derailleur, as with Force 1, can handle a cassette up to 11-42t.</p>\n<h3>SRAM Apex 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Apex 1x transmission takes a front derailleur out of the equation\" title=\"dscf9080-1516704240618-vcvazq22z88v-e9043c4\" />\n\n</div><div><figcaption><span><i></i> You still occasionally find lower-spec gravel bikes fitted with Apex 1x 11-speed.</span></figcaption><span> <i>Oli Woodman / Immediate Media</i></span></div>\n<p>Finally, there’s <a href=\"https://www.bikeradar.com/news/sram-apex-1-brings-1x-road-to-affordable-level/\">Apex 1 11-speed</a>, which again is designed for cassettes with 11-42t range and has 40t, 42t and 44t chainrings available. It’s seen rarely, but found occasionally on entry-level <a href=\"https://www.bikeradar.com/advice/buyers-guides/cheap-gravel-bike/\">budget gravel bikes</a>.</p>\n<h3>SRAM gravel bike brake options</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SRAM Force AXS groupset\" title=\"SRAM Force AXS groupset - 17\" />\n\n</div><div><figcaption><span><i></i> All of SRAM’s gravel groupsets offer in-series hydraulic disc brakes.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>SRAM has hydraulic disc brake calipers, labelled HRD, available to match all its groupset tiers. It additionally sells mechanical disc brakes under its Avid brand, which can be used with its cable-operated shifters. Its standard <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">brake pads</a> are organic with a steel backing plate.</p>\n<p>It sells two compatible <a href=\"https://www.bikeradar.com/features/6-of-the-best-disc-brake-rotors/\">rotor</a> series, CenterLine and CleanSweep. Both have a one-piece design as standard, although the CenterLine X rotor has a two-piece floating rotor design, which SRAM says saves a little weight. There’s a wide range of <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-rotors/\">rotor diameters</a> available, because they’re shared with MTB groupsets.</p>\n<h2>Shimano gravel groupsets explained</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX in Scott Addict Gravel bike.\" title=\"DSCF9115\" />\n\n</div><div><figcaption><span><i></i> Shimano GRX has 10, 11 and 12-speed gravel-specific options.</span></figcaption><span> <i>Kevin Fickling / Tyler Roemer / Shimano</i></span></div>\n<p>Shimano offers a wide range of gravel groupsets, which now span 10, 11 and 12 speeds. It claims its GRX was the first groupset designed specifically for gravel riding, although this is something of a moot point, because SRAM’s groupsets pre-dated it in offering single-ring and gravel configured double-chainring options.</p>\n<p>All Shimano’s GRX groupsets have mechanical shifting available, while at 11 speeds you can also choose electronic Di2 shifting (which will surely come to 12-speed offerings in future).</p>\n<p><a href=\"https://www.bikeradar.com/news/shimano-grx-r820/\">12-speed GRX</a> has three different groupset configurations, which Shimano calls Unbeatable, Unstoppable and Undroppable. All the components carry either the GRX820 or GRX610 label, with GRX820 offering higher-spec components than GRX610.</p>\n<h3>Shimano GRX820 Unbeatable 12-speed</h3>\n<div></div>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX RX820 Unbeatable groupset\" title=\"Shimano GRX RX820 Unbeatable Rear Derailleur\" />\n\n</div><div><figcaption><span><i></i> The Unbeatable configuration of Shimano GRX RX820 includes a 10-45t cassette.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>Unbeatable is a single-chainring 12-speed configuration aimed at fast gravel riding. It pairs a 40t or 42t chainring with a 10-45t cassette that fits on a Micro Spline freehub, as used by Shimano’s MTB groupsets and wheels, rather than the HG standard freehub used by its road-going wheels and freehubs.</p>\n<p>The derailleur used by Unbeatable is designated RX822-GS and will support a 45-tooth maximum cassette sprocket.</p>\n<p>The GRX 12-speed shifters have levers made from the same material as used in Shimano’s fishing rods, which is engineered to increase grip when wet. There is a left-side (cable-operated) dropper post lever available if you’re running 1x.</p>\n<h3>Shimano GRX820 Unstoppable 12-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Side profile shot of GRX RX820 Unstoppable being ridden over a dusty bridge in Bend, OR, USA\" title=\"GRX RX820 Groupset Profile\" />\n\n</div><div><figcaption><span><i></i> GRX RX820 includes parts from Shimano’s MTB groupsets, making an official Shimano mullet setup available.</span></figcaption><span> <i>(Kevin Fickling / Tyler Roemer / Shimano)</i></span></div>\n<p>Unstoppable extends the gear range of Shimano’s 12-speed gravel groupsets beyond that of Unbeatable by offering a single chainring mullet configuration, which operates with a 10-51t mountain bike cassette.</p>\n<p>Unstoppable uses a different RX822-SGS derailleur from Unbeatable to accommodate the 51-tooth largest cassette sprocket, although you can swap derailleur cages with the RX822-GS derailleur if you want to alter your gear range by changing your cassette.</p>\n<p>Because Shimano uses different cable pull ratios for its road and mountain bike groupsets, a mix-and-match mullet configuration for gravel riding wasn’t possible previously (except for electronic setups), so this offers a significant gear range extension over Shimano GRX 11-speed.</p>\n<p>Both single-chainring 12-speed GRX groupsets can also be used with an RX820-LA dropper seatpost lever in place of the left-hand brake-only lever.</p>\n<h3>Shimano GRX820 Undroppable 12-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX RX820 Undroppable groupset\" title=\"Shimano GRX RX820 Undroppable Crankset 3\" />\n\n</div><div><figcaption><span><i></i> Shimano GRX RX820 Undroppable uses a double-chainring setup.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>Undroppable GRX 12-speed configurations are based around a double-chainring setup and aimed at all-round gravel riding.</p>\n<p>The system includes a 48/31t sub-compact crankset paired with an 11-34t or 11-36t cassette (which fit on a standard road-going Shimano HG freehub).</p>\n<p>Shimano’s front derailleur has a chainline shifted 2.5mm outboard, as with SRAM’s Wide configurations, which allows more clearance for wider tyres.</p>\n<h3>Shimano GRX610</h3>\n<p>The GRX610 series offers more affordable 12-speed components than the GRX820 series, although not a complete groupset, because it lacks derailleurs and only comprises shift levers and cranksets.</p>\n<p>The single-chainring crankset has 38t and 40t chainrings available and will operate with a 10-45t or 10-51t MTB cassette, replicating the Unbeatable and Unstoppable configurations available at GRX820 level.</p>\n<p>The double-crankset Undroppable configuration has 46/30t chainrings and can be operated with the same 11-34t or 11-36t cassettes as the GRX820 series.</p>\n<p>All the GRX 12-speed groupset configurations operate with <a href=\"https://www.bikeradar.com/advice/buyers-guides/bicycle-chains/\">12-speed chains</a> from Shimano’s mountain bike groupsets, and Shimano lists Deore XT M8100 and SLX M7100 chains on its site.</p>\n<h3>Shimano GRX 12-speed brakes</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX RX820 Undroppable groupset\" title=\"Shimano GRX RX820 Undroppable Rotor\" />\n\n</div><div><figcaption><span><i></i> GRX includes in-series brakes at two different spec levels.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>We’ve covered brake levers above, but the actual brake mechanisms, the calipers and rotors, for Shimano GRX 12-speed groupsets are closely related across Shimano’s gravel bike range. They’re all hydraulically actuated too.</p>\n<p>The GRX BR-R820 brake calliper has the same 10 per cent wider pad clearance as the Dura-Ace, Ultegra and 105 12-speed systems, which Shimano claims will reduce incidences of brake rub either due to the rotor heating up or debris getting between the brake pads and the rotor.</p>\n<p>As with the road groupset brakes, there’s Servo Wave tech for better modulation and quicker initial bite.</p>\n<p>You can choose Shimano resin pads with or without cooling fins, or a metallic pad with fins.</p>\n<p>GRX820 also offers BL-RX812 <a href=\"https://www.bikeradar.com/features/18-10-19/\">inline brake levers</a> for mounting on the bar tops, which gives you an alternative braking position to using the main levers. They can also be used with 11-speed and 10-speed brakes.</p>\n<p>Shimano 12-speed levers are also compatible with BR-RX400 calipers, which again offer multiple pad options.</p>\n<p>In both cases, rotor options come from Shimano’s existing road and MTB offerings, use the CenterLock standard and are available in sizes from 140mm up to 220mm. The bike’s frame configuration will limit rotor-size compatibility though.</p>\n<h3>Shimano GRX815 Di2 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX-812 drivetrain\" title=\"Shimano GRX-812 drivetrain\" />\n\n</div><div><figcaption><span><i></i> At present, Di2 electronic shifting is only available with GRX 11-speed.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Shimano GRX810 series includes both mechanical and Di2 electronic options. They share components including the cassettes and cranksets, and both offer 1x and 2x configurations.</p>\n<p>Where they differ is the electronically operated derailleurs and the shifters to control them, as well as the internal battery that powers them. As with Shimano’s previous-generation road-going Di2 groupsets, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-grx-di2-review/\">GRX815 Di2</a> is a wired system from the shifters through to the central battery and the derailleurs, rather than the semi-wireless system now used by Shimano’s 12-speed road groupsets.</p>\n<p>There are different rear derailleurs for 1x and 2x, with the 2x option handling cassettes up to 34 teeth. The 1x system enables you to fit cassettes with up to 42 teeth. In both cases, the smallest sprocket has 11 teeth.</p>\n<p>You can operate the GRX 2x derailleur with road cassettes as well as Shimano’s dedicated gravel cassettes.</p>\n<p>The GRX800 series double crankset offers a 48/31t chainring combination, while the 1x crankset is available with either 40t or 42t.</p>\n<p>There is also a left-side (cable-operated) dropper post lever if you’re running 1x.</p>\n<h3>Shimano GRX810 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"RX810 rear derailleur\" title=\"Shimano GRX 11-speed review-5\" />\n\n</div><div><figcaption><span><i></i> GRX also offers an 11-speed mechanical option.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>The key difference with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-grx-review/\">GRX810 mechanical</a> is the replacement of the motor-driven derailleurs with cable-actuated ones. There are two rear-derailleur options, which both offer the same gear range as the Di2 rear derailleurs: 11-34t maximum with 2x and 11-42t with 1x.</p>\n<p>GRX810 mechanical operates with the same range of cassettes and cranksets as the Di2 version.</p>\n<h3>Shimano GRX600 11-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Orro Terra S GRX600 gravel bike\" title=\"Orro Terra S GRX600 - 04\" />\n\n</div><div><figcaption><span><i></i> GRX RX600 is a lower-spec 11-speed option with different gearing available to GRX RX810.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>GRX600 offers lower-tier options for a subset of Shimano’s 11-speed gravel components, but not a complete groupset.</p>\n<p>There are 2x and 1x GRX600 brake/shift levers available. The GRX600 series double crankset has 46/30t chainrings, while the GRX600 1x crankset has 40 teeth.</p>\n<p>You’ll often find gravel bikes specced with mixed GRX800 and GRX600 components (and sometimes with GRX400 level disc brake calipers, although there are in-series BR-RX810 calipers available).</p>\n<h3>Shimano GRX400 10-speed</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The Giant Revolt Advanced 1 gravel bike is equipped with Shimano GRX RX-400 brakes\" title=\"Giant Revolt Advanced 1 - 02\" />\n\n</div><div><figcaption><span><i></i> GRX RX400 offers a 10-speed groupset with in-series brake calipers.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>GRX400 is 10-speed and only available as a 2x system with a 46/30t crankset. The GRX rear derailleur has a clutched stabiliser mechanism that’s similar to the higher-spec GRX groupsets and will work with cassettes with largest sprockets between 32t and 36t.</p>\n<p>Shimano-branded 10-speed cassettes with a 36-tooth largest sprocket form part of its MTB line-up, but you may find bike brands have subbed in a cassette from another brand that offers an 11-36 tooth option. GRX400 is usually paired with an MTB chain as well.</p>\n<p>As mentioned above, there are BR-RX400 brake calipers that form part of the GRX400 groupset.</p>\n<h2>Campagnolo gravel groupsets explained</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Basso Palta Disc Ekar gravel bike\" title=\"Basso Palta Disc Ekar - 17\" />\n\n</div><div><figcaption><span><i></i> The Campagnolo Ekar groupset has 13 speeds.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Campagnolo only offers a single gravel bike groupset, Ekar, but this includes some interesting tech that pushes the boundaries of groupset tech.</p>\n<h3>Campagnolo Ekar</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Basso Palta Disc Ekar gravel bike\" title=\"Basso Palta Disc Ekar - 08\" />\n\n</div><div><figcaption><span><i></i> Campag’s Ekar cassette goes down to a tiny nine-tooth smallest sprocket.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo Ekar</a> is a single-chainring mechanical groupset. So far, nothing unique, but Ekar has 13 speeds, while the other big-name groupsets stop at 12 speeds maximum.</p>\n<p>Things get more interesting still, because Ekar is available with three different gear ranges, two of which start with a 9-tooth smallest sprocket, the last with 10 teeth.</p>\n<p>That gives you a range of gearing options to suit your riding; Campagnolo says its 9-36t cassette is a good option for gravel racing and faster gravel riding, while the 9-42t and 10-44t cassette options are more geared to adventure riding.</p>\n<p>All Ekar cassettes need a wheelset with Campagnolo’s latest <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">N3W freehub</a>.</p>\n<p>You can choose between 38, 40, 42 or 44-tooth chainrings to fine-tune your gear range.</p>\n<p>Campagnolo claims the Ekar groupset is the lightest gravel bike groupset available. The shift lever includes Campagnolo’s thumb shifter, unlike the latest <a href=\"https://www.bikeradar.com/features/tech/campagnolo-super-record-wireless-first-look/\">Super Record Wireless</a> electronic groupset, although this has been redesigned to make it easier to use both from the drops and the hoods.</p>\n<p>Ekar has its own brake calipers and rotors, although they’re closely related to those of its road bike groupsets and share their internals. There’s a gravel-specific DB310 organic compound brake pad, which is also compatible with Campagnolo’s road bike brakes, and rotors are available in 140mm or 160mm sizes.</p>\n<h2>Microshift gravel groupsets explained</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"20230227_TucsonSwordProduct_AMB_1123\" title=\"20230227_TucsonSwordProduct_AMB_1123\" />\n\n</div><div><figcaption><span><i></i> Microshift Sword is a capable, low-priced gravel groupset.</span></figcaption><span> <i>Microshift</i></span></div>\n<p>The lowest-spec gravel bike groupsets above all tend to be more expensive than budget road bike groupsets, due to the extra tech included such as the clutched derailleur and hydraulic disc brakes. So, on <a href=\"https://www.bikeradar.com/advice/buyers-guides/cheap-gravel-bike/\">budget gravel bikes</a>, it’s not uncommon to see a road bike groupset, usually Shimano Claris or Sora, or a mix of Shimano Tiagra and GRX400 components.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-microshift/\">Microshift groupsets</a> usually slot in below Shimano price-wise and many offer compatibility with Shimano components, so again you’ll sometimes see them in a mix-and-match configuration on lower-priced bikes.</p>\n<h3>Microshift Sword</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Microshift Sword on Cannondale Topstone\" title=\"Microshift Sword on Cannondale Topstone\" />\n\n</div><div><figcaption><span><i></i> Microshift Sword offers an impressive gear range in both 1x and 2x configurations.</span></figcaption><span> <i>Microshift</i></span></div>\n<p>The brand has recently launched a gravel bike groupset offering with <a href=\"https://www.bikeradar.com/features/tech/microshift-sword-groupset-analysis/\">Microshift Sword</a>. It’s 10-speed, clutched and available as 1x and 2x, although it doesn’t include brake calipers, rotors, a chain or a bottom bracket, so these would need to be sourced from another brand. The shifters work with cable disc brakes rather than hydraulic.</p>\n<p>Microshift Sword cranksets include 1x 40t or 42t options, while there are two 2x cranksets: 48/31t and 46/29t.</p>\n<p>The 1x configuration will handle an 11-48t cassette, while with 2x you can fit an 11-38t, both of which form part of the Sword groupset, so Microshift offers a little more range than Shimano. There are two options for both cassettes: either all-steel sprockets or mixed steel and alloy, which are over 100g lighter.</p>\n<p>Paired with a 46/29t crankset, Sword 2x gives you the widest gear spread of all at 548 per cent.</p>\n<p> </p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"db80293a7c64b2d47fac08830a0a389e051cd9f95217b654934b0c730da860b6","category":"Cycling"}