{"title":"Cyclist Doorstep Rides, No7: Maria David's Macclesfield mashup","link":"https://www.cyclist.co.uk/in-depth/9688/cyclist-doorstep-rides-no7-maria-davids-macclesfield-mashup","date":1622536136000,"content":"<span>\n      <span><a href=\"/authors/maria-david\">Maria David</a></span>\n  </span><div>  \n  <div>      <div><span>29 May 2021</span></div>    </div></div><p>\nTarmac, gravel, cobbles and rail trails all feature on this fun loop around Macclesfield</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/maria_david_doorstep_1_0.jpg?itok=ASr2lcaC\" />  </div>\n<div>\n      <p> <strong><strong>Over an eight-week period,</strong><em> Cyclist</em> and <em>komoot</em> are sharing some of their favourite rides and routes that are accessible from the doorstep. In the final part of the series, we hear from Maria David about a loop around Macclesfield offering a little bit of everything </strong></p>\n<p>I’ve developed a close relationship with Macclesfield over the years. Having spent time living and working there, it has now become my go-to place when I want to get away from the hurly-burly of London.</p>\n<p>My multi-terrain ride starts in the centre of Macclesfield, just outside the train station. From there the ride proceeds along the start of the Middlewood Way, a 10-mile ‘rail trail’. This traffic-free route is the former Macclesfield, Bollington and Marple railway line that was decommissioned in 1970.</p>\n<p>Many such lines have been converted into traffic-free paths, hence the name ‘rail trails’, and this one is well surfaced with hard-packed gravel, making it suitable for even road bikes.</p>\n<p><a href=\"https://www.komoot.com/collection/1121279/-cyclist-doorstep-rides\" target=\"_blank\"><strong>See the Cyclist Doorstep Rides Collection on komoot</strong></a></p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/9247/womens-tour-2021-postponed\">Women's Tour 2021 postponed</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 114: on sale now!</a></div>    </div></div><p>\nAfter Bollington, the path becomes looser gravel and it is at this point that my Liv Devote gravel bike becomes better adapted to the terrain.</p>\n<p>At The Boars Head pub in Poynton – a convenient place to stop and have a picnic – the route leaves the Middlewood Way and loops around onto the Macclesfield Canal, where you have a short spin on the road to reach Pott Shrigley village.</p>\n<p>It’s a slight shock to the system to have to suddenly ride sharply uphill after having been on pan-flat terrain since the start of the ride.</p>\n<p>Along the road I encounter various roadies passing through picturesque Pott Shrigley and on towards Bakestonedale Road, locally known as The Brickworks. It’s one of the most popular climbs in the northwest, with the fastest times up it having been recorded by TeamGB riders who regularly ride in the area.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/06/maria_david_doorstep_2.jpg\" />  </div>\n</div>\n<p>I won’t be challenging them today (or any day!), and push on to the bottom of Blaze Hill where I join Oakenbank Lane. This is not a road at all, but a stony path that rises and twists through woodland and fields, passing a tea room along its way to Rainow, another quaint village.</p>\n<p>Just be careful on the descent which is quite steep and dumps you abruptly onto a small road with regular farm traffic.</p>\n<p>\nAfter a short stint on the undulating main road towards Macclesfield, a sharp left-hand leads onto Bull Hill lane. As the name suggests, the road rises again – this time to reach the Cat and Fiddle pass, another legendary climb in this part of the world.</p>\n<p>On any other day, I would continue along this road to the summit where the Cat and Fiddle is England’s second highest altitude pub (and now the highest whisky distillery). But today, my Doorstep Ride goes along a short stretch to reach Walker Barn, where I again leave the tarmac behind to climb up the stony, and hence very bumpy, Charity Lane.</p>\n<p>There is a trail running parallel to the lane, but I choose not to use it today as the heavy rainfall recently has left it quite claggy and waterlogged. Instead I bump along the loose cobbles and imagine I am riding an ultra version of Carrefour de L’Arbre in Paris-Roubaix.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/06/maria_david_doorstep_4.jpg\" />  </div>\n</div>\n<p>Eventually, the route plunges along a steep technical descent (again, care is required here as the area is popular with walkers) to reach Macclesfield Forest, a popular haunt for gravel riding and mountain biking. There are various bridleways to follow, including a circular forest bridleway, but I stick to the northern edge of the forest and follow the bridleway down to the reservoirs.</p>\n<p>This area is perfect for a stop – either for a picnic beside the water, or a pub refreshment at Leather’s Smithy in Langley or Church House in Sutton.</p>\n<p>In my case today, however, the rain is tipping it down and as much as Macclesfield Forest looks lovely and atmospheric, I’m not in the mood to stay out and get drenched.</p>\n<p>So I join Macclesfield Canal and wend my way back to the centre of Macclesfield. It has been a morning well spent.</p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"db879f67b27b80084553b4b2a75589c346f7ea4c9298ff584329d1c2a9d99096","category":"Cycling"}