{"title":"Over 5,000 h at 85 °C Thermal Stability of Encapsulated Carbon–based Multiporous–Layered–Electrode Perovskite Solar Cells","link":"https://www.preprints.org/manuscript/202405.1386/v1","date":1716285429000,"content":"The key to the practical application of organometal–halide–crystals perovskite solar cells (PSCs) is to achieve thermal stability through robust encapsulation.  This paper presents a method to significantly extend the thermal stability lifetime of perovskite solar cells to over 5,000 h at 85 °C by demonstrating an optimal combination of encapsulation methods and perovskite composition for carbon–based multiporous–layered–electrode (MPLE)–PSCs.  We fabricated the four types of MPLE-PSCs using two encapsulation structures (over– and side–sealing with thermoplastic resin films) and two perovskite compositions ((5–AVA)x(methylammonium (MA))1–xPbI3 and (formamidinium (FA))0.9Cs0.1PbI3), and analyzed the 85 ºC thermal stability followed by ISOS–D–2 protocol.  Without encapsulation, FA0.9Cs0.1PbI3 exhibited higher thermal stability than (5–AVA)x(MA)1–xPbI3.  However, encapsulation reversed the phenomenon (that of (5–AVA)x(MA)1–xPbI3 became stronger).  The combination of (5–AVA)x(MA)1–xPbI3 perovskite absorber and over–sealing encapsulation effectively suppressed the thermal degradation, resulting in the PCE value at 91.2% of the initial value after 5,072 h.  On the other hand, another combination (side–sealing on (5–AVA)x(MA)1–xPbI3, over– and side–sealing on FA0.9Cs0.1PbI3) resulted in decreased stability.  The FA–based perovskite was decomposed for these degradation mechanisms by the condensation reaction between FA and carbon.  For side–sealing, the space between the cell and the encapsulant was estimated to contain approximately 1,260,000 times more H2O than in over–sealing, which catalyzed the degradation of the perovskite crystal.  Our results demonstrate that MA–based PSCs, which are generally considered to be thermally sensitive, can significantly extend their thermal stability after the proper encapsulation.  Therefore, we emphasize that finding the appropriate combination of encapsulation technique and perovskite composition is quite important to achieve further device stability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"db8d6f0f7e90a589f4f0b7f197863e554614a195ea143feb0067d64d985e64a1","category":"Interdisciplinary"}