{"title":"Variability in evapotranspiration in the Andean páramo as influenced by fog and rainfall","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2612?af=R","date":1705476137000,"content":"<h2>Abstract</h2>\n<p>Tropical mountains such as the páramos of the Andes, which serve as ‘water towers’ for local communities and downstream cities, are important areas for early detection of climate change. Here, fog and low-intensity rainfall are very common and play a key role in ecohydrological processes. Although evapotranspiration (ET) represents an important part of the water cycle, how ET and fog processes interact and how they affect páramo vegetation and water resources availability are poorly understood. This study investigated the effects of foggy (fog only) and mixed (fog and rainfall) conditions on ET. To determine whether fog significantly reduces ET, we compared ET and meteorological data under these two conditions with those during dry days. We found that on foggy days, when fog was most prevalent in the early morning, ET declined on average by 4% and net radiation (Rn) by 9.2%. Under mixed conditions, daily ET declined by 42% and Rn by 33%. In the páramo, where mean annual precipitation and ET are 1210 and 635 mm, respectively, the estimated annual reduction in ET due to fog and rainfall combined is between 77 and 174 mm. We found that during fog and rainfall mixed conditions, solar radiation was reduced, consequently constraining the energy available for ET while sustaining high relative humidity, ultimately reducing water loss. Our findings, which suggest that the presence of fog and low-intensity rainfall restricts water losses by evaporative demand, contribute to a better understanding of the ecohydrological importance of these water inputs in the Andes.</p>","author":"Gina Berrones, \nPatricio Crespo, \nGalo Carrillo‐Rojas, \nBradford P. Wilcox, \nRolando Célleri","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"db9b402d8350e6c8bbdf9656300ca73dfe2b6cee7ca1a779538293580cafa950","category":"Environment"}