{"title":"Mixed Mosaic Virus Infection and Its Impact on Photosynthetic Gene Expression in Sugarcane Fields in Indonesia","link":"https://www.preprints.org/manuscript/202404.1972/v1","date":1714459440000,"content":"Sugarcane mosaic virus (SCMV) and sugarcane streak mosaic virus (SCSMV) are the primary viruses responsible for mosaic diseases in sugarcane.  In this study, the mosaic viruses SCMV and SCSMV with the involvement of sorghum mosaic virus (SrMV) were surveyed from eight commercial sugarcane cultivars grown in fields at four locations in East Java, Indonesia. Sugarcane leaves with mosaic symptoms were assessed for disease incidence and severity, and symptomatic leaves were collected for analysis. The incidence and severity of mosaic symptoms were the highest in the PS881 and NX04 cultivars grown in Kediri compared to the other cultivars. RT-PCR analysis showed that SCSMV was present in all sugarcane cultivars and locations. Interestingly, double mixed infections with SCMV were found in PS881, PS882, and Cening, whereas triple mixed infections with SrMV were found in the PS881 cultivar. Phylogenetic analysis grouped SCSMV, SCMV, and SrMV together with isolates from Thailand (KP987832.1), Florida, USA (MT725538.1), and Agentina (EU189037.1). The expression of ascorbate peroxidase gene (Apx) was increased in the virus-infected sugarcane cultivars and prominently elevated in the triple mixed infection of PS881 cultivars. However, the catalase gene (Cat) was slightly upregulated in the mixed infection group. The chlorophyll content was significantly reduced in the leaves of PS58, PS881, PS882, NX04, and HW Merah, in parallel with the expression of the photosystem I gene (PsaA). The expression of photosynthetic genes, such as ribulose-1,5 bisphosphate carboxylase small sub-unit (RbcS), phosphoenolpyruvate carboxylase (Pepc), sucrose-phosphate synthase (Sps1), and PsaA, was significantly reduced and almost depleted in the triple mixed infection of PS881, except for Pepc expression, which remained approximately half of that in the control healthy sugarcane. The decrease in photosynthetic activity was confirmed by the decrease in ribulose-1,5 bisphosphate carboxylase (Rubisco) and PEPC proteins, as detected by immunoblot analysis. The decrease in photosynthetic parameters indicated that the mosaic viral infection substantially reduced the growth and yield of sugarcane.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dba10871e840ca4b1ffaf3123784b5c9bee78f13f8075ed5ffb76595480f2f66","category":"Interdisciplinary"}