{"title":"The rumor mill got a lot wrong about Apple’s iPhone 13 event","link":"https://www.macworld.com/article/357889/apple-california-streaming-event-rumors-wrong.html","date":1631719733000,"content":"<div>\n<section><div></div></section><p>Every time Apple holds an event, we pretty much know exactly what’s going to release. If you’ve been keeping up with the rumor mill for the weeks and months prior to the big day, the actual keynote is like watching a show you’ve already seen and waiting for your favorite scenes.</p>\n\n\n\n<p>But that wasn’t the case with <a href=\"https://www.macworld.com/article/357687/heres-everything-apple-announced-at-its-california-streaming-event.html\">the “California Streaming” event</a>. While the rumor mill got many things right, it also whiffed on numerous major predictions. For every correct guess—such as the iPhone 13’s bigger battery and the Apple Watch’s larger screen—there was a major miss, more than any other recent event. Here’s what the leakers and rumor mongers got wrong:</p>\n\n\n\n<h2>AirPods didn’t make an appearance</h2>\n\n\n\n<p>Perhaps the biggest miss of the day was the lack of an AirPods announcement. It feels like new AirPods have been rumored for every event since the iPhone 11, but nearly everyone agreed that they would finally show up alongside the iPhone 13. That didn’t happen and in fact, Apple didn’t even mention AirPods at all.</p>\n\n\n\n<h2>The iPhone 13 doesn’t have any satellite capabilities </h2>\n\n\n\n<p>A rumor that popped up a couple of weeks ago <a href=\"https://www.macworld.com/article/354402/iphone-13-low-earth-satellite-connectivity.html\">from Ming-Chi Kuo</a> and gained traction after a bit of confirmation by Mark Gurman, the iPhone 13 was expected to include low-earth satellite capabilities that would let the phone make calls and send texts when cellular service wasn’t available due to the inclusion of a new custom 5G modem. Alas, it didn’t come to pass, though at least Gurman cautioned that the feature almost certainly wouldn’t show up until next year and would be for basic emergency info and not phone calls.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-pro-max.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPhone 13 has some new features, but satellite connectivity isn’t one of them.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>The iPhone 13 doesn’t have an always-on display</h2>\n\n\n\n<p>We’ve been hearing rumblings about <a href=\"https://www.macworld.com/article/357190/iphone-13-display-always-on-promotion-high-refresh.html\">an always-on display</a> coming to the iPhone for years, and it seemed likely that the iPhone 13 was the model that was actually going to deliver it. We’ve seen renders, rumors, and leaks from prominent analysts including Gurman and Max Weinbach, but nary a mention of the feature made it to the keynote. Maybe in the iPhone 14.</p>\n\n\n\n<h2>The Apple Watch didn’t get a “flat” design </h2>\n\n\n\n<p>Another seemingly solid rumor was a new design for the Apple Watch. Months ago, <a href=\"https://www.macworld.com/article/346955/apple-watch-series-7-might-get-its-first-major-redesign.html\">Jon Prosser reported</a> on a flatter design for Apple’s wearable with sharper corners to match the iPhone, which was echoed recently by Gurman. While the Series 7 Watch did get a larger screen as predicted, the shape is still very much a squircle—and there’s nothing flat about it.</p>\n\n\n\n<h2>The Apple Watch Series 7 doesn’t have longer battery life</h2>\n\n\n\n<p>Apple hasn’t launched its tech specs page for the Apple Watch Series 7 yet, but if it had, you’d see this written in the Power section: Up to 18 hours. Reports leading up to the event were adamant that the Apple Watch would have a bigger battery, with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/PineLeaks/status/1435302680621092867&amp;xcust=1-1-357889-1-0-0&amp;sref=https://www.macworld.com/feed\">Weinbach claiming</a> it would see its “first real battery life improvement” since its launch. While Apple touted the new Apple Watch’s beefed-up charging capabilities, it said nothing about battery life during the event.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/Apple-watrch-series-7-side.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Apple Watch Series 7 has faster charging but the same battery life.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>The iPad mini doesn’t have a smart connector</h2>\n\n\n\n<p>The launch of the iPad mini at the “California Streaming” event was a surprise in itself, but the rumor mill accurately predicted most of the features of Apple’s new tablet. Except one. After <a href=\"https://www.macworld.com/article/348627/if-this-is-really-the-next-ipad-mini-it-cant-get-here-fast-enough.html\">a report by Prosser</a>, 9to5Mac also predicted the iPad mini would “feature a magnetic Smart Connector similar to the iPad Air and iPad Pro,” but that didn’t come to fruition. Apple instead released a new Smart Folio case in a few colors, but the only thing that attaches magnetically is the second-gen Apple Pencil.</p>\n\n\n\n<h2>The Apple Watch doesn’t have a new processor</h2>\n\n\n\n<p>One of the biggest rumors about the new Apple Watch was the new processor that was supposed to be faster and smaller with a new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/06/23/apple-watch-series-7-double-sided-s7-chip/&amp;xcust=1-1-357889-1-0-0&amp;sref=https://www.macworld.com/feed\">double-sided manufacturing process</a> to free up space for a bigger battery and other health components. Apple didn’t even discuss the chip during yesterday’s product announcement, and it isn’t mentioned on the Apple Watch Series 7 page—because it’s the same S6 system-in-package as in the Series 6.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-mini.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>There are new colors for everything—just not the ones we expected.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>The color predictions were way off</h2>\n\n\n\n<p>New colors were a big part of yesterday’s keynote, but the ones we expected—iPad mini matching the iPad Air, Sunset Gold, Bronze, and matte black, were kinda way off. The color of the year is Starlight, which is either off-white or very pale gold, depending on how you look at it. And the others were wrong too: the Pro has a new Sierra Blue color, the 13 gets a new shade of blue along with Midnight, the iPad mini now comes in purple, and the Apple Watch got an olive green hue, none of which were predicted.</p>\n\n\n\n<h2>The iPad mini got a major price hike</h2>\n\n\n\n<p>With a couple of exceptions, the rumors about the iPad mini were basically on the money, bringing an all-screen design, USB-C, and Apple Pencil 2 support. But what no one expected was a 25 percent price hike. The mini now costs $499, a whopping $100 jump over the previous model.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dba4f578715c94a76a8b781dc9bbe0cb0ab6200673e608c54e0715e5ac5a40a0","category":"Apple"}