{"title":"The last all-Belgian podium at the Tour of Flanders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/on-this-day-the-last-all-belgian-podium-at-the-tour-of-flanders","date":1617441799000,"content":"\n      <p>For much of the first half of the 20th century, Belgium-packed podiums were the rule rather than the exception. No other nation’s riders featured among the first three places in 28 of the first 34 editions, up to the end of the Second World War.</p>\n<p>As cycling became more international, literally less provincial, local dominance declined. Belgians have still won more than half the editions of De Ronde but the home winner has been more likely to be flanked by a Dutchman and an Italian, perhaps a Dane or German, even the odd Irishman (no offence, Sean).</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>The last time riders representing the race’s home nation stood on all three steps was 22 years ago.</p>\n<p>It was Peter van Petegem born in Brakel, twenty minutes or less from the Muur, as Flandrian as frites, who was on the highest of them; and it was at the foot of the Muur that the podium was decided. Two of the three, Van Petegem and Johan Museeuw, had been at the front of the lead group of ten that arrived as one in Geraardsbergen. As such they managed to avoid a tumble that took out the rest of the pack.</p>\n<p>With the pair slipping away from the rest as the road rose towards the chapel, the only other rider able to recover sufficiently from the crash had been the first to go to ground: Frank Vandenbroucke of Cofidis. Vandenbroucke was able to catch Museeuw and Van Petegem just over the crest of the Bosberg, the final climb of the day, 10km from the finish in Meerbeke.</p>\n<p>With four Rabobank riders chasing behind in full team time-trial mode, there could be no messing about from the newly formed trio of escapees. No-one soft-pedaled; none of them missed a turn.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/fabian-cancellara-and-the-tour-of-flanders-reflections-on-perfection\"><em><strong>Related – Fabian Cancellara and the Tour of Flanders</strong></em></a></p>\n<p>When the moment of truth arrived the three were lined out across the road as if in a drag race. Museeuw, less than a year on from shattering his knee-cap in that infamous Paris-Roubaix crash, knew he was third favourite and knew he had to go early. Van Petegem was the strongest and easily went round him. It was all Vandenbroucke could do to stay on Van Petegem’s wheel as he crossed the line in clear air to take his first Monument victory. Museeuw emptied his legs but sat up before the line.</p>\n<p>If the 1999 result was to be the high watermark for Belgian cycling for a generation, 2019 would prove a low. Not only was there no Belgian at all on the Flanders podium – for the first time since 2001 and only the 6th in the history of the race – but the highest placed home finisher was Oliver Naesen in 7th. Last year's result showed a glint of a possible return to form for the Belgians – as Wout van Aert has emerged as a Classics star. Will he cement his place this year?</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Alison McCarthy","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"dba7d1fdafc94bedaef300ff65e31406c398696d46419166870f8c6b5210c0b6","category":"Cycling"}