{"title":"Apple Podcasts Now Lists 2 Million Shows, But Almost Half of Those Titles Have Only Three or Fewer Episodes","link":"https://www.macrumors.com/2021/04/07/apple-podcasts-2-million-shows-inflated/","date":1617786588000,"content":"According to the latest podcast analytics, Apple's Podcasts platform recently surpassed 2 million titles, however almost a quarter of those shows have only published one episode, suggesting the numbers are inflated by so-called \"once-and-done\" podcasts.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Amplifipodcastpyramid_V5.jpg\" alt=\"\" width=\"1500\" height=\"844\" class=\"aligncenter size-full wp-image-792800\" />\r\n<br/>\r\nBreaking down the latest statistics provided by <a href=\"https://podcastindustryinsights.com/apple-podcasts-statistics/\">Podcast Industry Insights</a>, industry advisor <a href=\"https://www.amplifimedia.com/blogstein/why-there-really-arent-2-million-podcasts\">Amplifi Media</a> found that 26% of listed podcasts have published just one episode, suggesting that many content creators immediately went out of business or else never intended to continue creating beyond their opening act.\r\n<br/>\r\n\r\n<br/>\r\nAdjusting the mark, Amplifi found that 44% of podcasts have published three or fewer episodes, meaning if the arbitrary benchmark of a \"real podcast\" is set as a series of at least four episodes, then the total number of shows on Apple Podcasts is closer to 880,000.\r\n<br/>\r\n\r\n<br/>\r\nLooking at podcasts offering ten or more episodes, a little more than a third of all titles have achieved this number (around 36%), which places around 720,000 podcasts at the ten-episode level.\r\n<br/>\r\n\r\n<br/>\r\nThe statistical breakdown suggests that \"once-and-done\" podcasts clutter up the Apple Podcasts library with what might be considered \"dead-end\" content. Indeed, according to Podnews.net's James Cridland, 63% of single episode podcasts came via Spotify's Anchor and another 16% came from iHeart's Spreaker, both of which are free-to-use hosting providers that appeal to new podcasters who are still experimenting with the medium.\r\n<br/>\r\n\r\n<br/>\r\nAmplifi suggests that the way single-act runs inflate the 2 million shows number is equivalent to including TV shows that produced a pilot but never became a series in a list of all-time TV shows. Despite that assessment, however, Amplifi noted that not all podcasts are suited to multiple episodes:\r\n<br/>\r\n<blockquote>Not all podcasts are meant to be unending series. You can find plenty of great and evergreen content designed to run for just a handful of episodes. That’s part of the beauty of podcasting, but the one-and-done titles unfairly inflate the overall number of podcasts, and it is revealing that 44% have three or fewer episodes.</blockquote>Right now, the Podcasts app is free and Apple has no paid podcast content, but rumors have suggested that Apple is working on a <a href=\"https://www.macrumors.com/2021/01/15/apple-podcast-subscription-service/\">paid podcast subscription service</a> that would charge people to listen to podcasts.\r\n<br/>\r\n\r\n<br/>\r\nWith a paid subscription service, Apple could potentially lure high-profile creators with the promise of more money, stealing them away from other platforms like Spotify. \r\n<br/>\r\n\r\n<br/>\r\nIn perhaps a related move, Apple is making a <a href=\"https://www.macrumors.com/2021/03/09/podcast-app-wording-change-follow/\">small but notable change</a> to the way listeners can sign up to get updates on new podcast content, with the company changing the word \"Subscribe\" to \"Follow\" in the Podcasts app in iOS 14.5. \r\n<br/>\r\n\r\n<br/>\r\nThe word \"Subscribe\" may have misled Podcasts users into thinking that the podcasts cost money to listen to, in which case the change in language could facilitates the later introduction of a podcasting subscription service and will prevent confusion in the future.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/podcasts/\">Podcasts</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/04/07/apple-podcasts-2-million-shows-inflated/\">Apple Podcasts Now Lists 2 Million Shows, But Almost Half of Those Titles Have Only Three or Fewer Episodes</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-podcasts-now-lists-2-million-shows-but-almost-half-of-those-titles-have-only-three-or-fewer-episodes.2290883/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6BccUlH0ggE:isPt6W1HKso:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6BccUlH0ggE:isPt6W1HKso:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/6BccUlH0ggE\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dba7a5bba83c032874ca52117d3c23c507b4aec1f6934474655f8fd0ad6b2b11","category":"Apple"}