{"title":"Application of a Conceptual Stocking Model for Two Recreationally Important Species","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.70006?af=R","date":1729131027000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d5236e20-fb14-43d4-b05c-f9bfa0f520af/aff270006-gra-0001-m.png\" alt=\"Application of a Conceptual Stocking Model for Two Recreationally Important Species\" />\n<p>The objective of this study was to develop a conceptual model that may identify stocking locations that can help improve survival of stocked Walleye and White Bass. Final stocking maps identified the best 12.8 and 13.9% of the predicted area of Lake McConaughy for stocking Walleye and White Bass, respectively. The maps for both species were interestingly similar. These results are likely due to the similarities in predators consuming the stocked products and the zooplankton consumed by fingerlings of both species.\n\n</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>Fish stocking continues to be an important and often-used tool in fisheries management. Mortality of fish may be high in the first few days after stocking due to predation and a lack of appropriate food and habitat. The objective of this study was to develop a conceptual model that may identify stocking locations that can help improve the survival of stocked fish. We identified three factors—predator risk, zooplankton (food) availability and measures of habitat that could be important to the survival of stocked Walleye (<i>Sander vitreus</i>) and White Bass (<i>Morone chrysops</i>) fingerlings in Lake McConaughy, Nebraska. The spatial distribution of these factors was used to create a predictive surface to identify those stocking locations hypothesised to lead to higher survival. Final stocking maps identified the best 12.8% and 13.9% of the predicted area of Lake McConaughy for stocking Walleye and White Bass, respectively. Both maps predicted that the best locations were along the south-central shoreline of Lake McConaughy. The maps for both species were interestingly similar. These results are likely due to the similarities in predators consuming the stocked species and the zooplankton consumed by fingerlings of both species. Habitat availability may be less important, or other aspects of habitat may need to be considered. Identifying the best locations for stocking based on predation risk and the availability of food and habitat could increase the survival of stocked fishes and help managers reach population objectives.</p>","author":"Sean M. Farrier, \nKeith D. Koupal, \nPaul R. Burger, \nMelissa R. Wuellner","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"dba8f829d50e169e31993717ba192047e15a00ecd6d4cb9807e6fa8455aaa908","category":"Environment"}