{"title":"12.9-inch iPad Pro (2021) review: All souped-up with nothing to do","link":"https://www.macworld.com/article/349597/apple-12-9-inch-ipad-pro-2021-m1-retina-xdr-review.html","date":1624873500000,"content":"\n<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Excellent screen and design</li><li>Fantastic FaceTime features</li><li>Crazy fast CPU and GPU speeds</li></ul></div><div><h3>Cons</h3><ul><li>Expensive</li><li>Few pro features and apps</li></ul></div></div></div><h3>Our Verdict</h3><p>The 12.9-inch iPad Pro is the absolute best tablet Apple or anyone else has ever made. But with a starting price of $1,099, it’s hard to recommend buying it.</p>\n</div>\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>12.9-inch iPad Pro (2021)</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/ipad-pro-12-2021.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\tMSRP:\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t128GB Wi-Fi $1099 | 128GB Wi-Fi + Cellular $1299\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/us/shop/buy-ipad/ipad-pro&amp;subid1=1-1-349597-0-0-0\" target=\"_blank\">US$1099 at Apple</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<p>There’s no denying that the 12.9-inch iPad Pro is a gorgeous and incredibly powerful piece of hardware. It’s easily one of the nicest pieces of tech I’ve ever held and the fastest iPad ever made, and it’s hard to imagine any tablet released in the next five years doing much to top it.</p>\n\n\n\n<p>Of course, I could have written the same thing about the 2020 model. The 2021 iPad Pro doesn’t look all that much different than the model it replaces or the 2018 iPad Pro before that. And the upgrades the new model brings—most notably, the Retina XDR display, 5G modem, and M1 processor—won’t be immediately noticeable to anyone using it. Unless you’re comparing it side by side to the 2020 model, in fact, you probably won’t be able to tell which iPad Pro you’re actually using.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-vs-2020.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The M1 iPad Pro (right) is impressive, but the improvements over the 2020 model (left) aren’t immediately obvious.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>And even then, it’s tough to tell them apart. That shouldn’t be the only reason not to buy one, and if you’re willing to spend upwards of $3,000 on a tablet, it absolutely won’t be. But since money will most likely be an object, you’ll be just as happy spending less on last year’s model or just buying an iPad Air.</p>\n\n\n\n<h2>Center of attention</h2>\n\n\n\n<p>It might be strange to start an iPad review by discussing the camera, but it represents everything that’s great and frustrating about the iPad Pro. Apple insists on selling the iPad as a portrait device like the iPhone, even though the natural inclination is to pick it up and hold it lengthwise.</p>\n\n\n\n<p>After more than 10 years and dozens of iterations, I don’t know when Apple is going to admit that the iPad is a landscape device. I lost track of how many time I picked up the iPad Pro and blocked the camera with my thumb, thus blocking Face ID and forcing me to either change my grip or input my passcode. When picked up horizontally, the iPad’s camera is in the perfect spot to be blocked and it’s somewhat infuriating that no one at Apple seems to believe this is an issue.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-facetime-camera.jpg?quality=50&amp;strip=all&amp;w=799\" /><figcaption><p>The camera on the new iPad Pro (top) is far superior to the 2020 version (below).</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>As far as the front camera itself, Apple has upgraded it from a plain ƒ/2.2 7MP camera to an ƒ/2.4 12MP ultra wide camera with 2x optical zoom out. The difference is huge and if you take a lot of FaceTime calls both you and the person on the other end of the call will instantly notice the difference. It finally brings the iPad Pro’s selfie camera up to the level of the iPhone, which has had a higher-quality camera since the iPhone 11.</p>\n\n\n\n<p>Since the camera is likely to be unnaturally located to the left of your gaze while making a FaceTime call, Apple has launched a new feature called Center Stage that somewhat solves that issue. When you shift out of the center of the frame, the camera will pan and zoom to keep you in the center of the frame as if someone was filming you. It’s a fantastic feature that works smoothly and without distraction, and coupled with Attention Correction, it does nicely to hide the fact that most people will be looking the wrong way.</p>\n\n\n\n<p>But if that’s the only complaint I have about the iPad Pro’s design, then Apple has gotten a lot right. Move the camera and rotate the Apple logo, and the iPad Pro’s design is fantastic, if not a little stale. The design of the iPad Pro hasn’t changed much at all since the 2018 Liquid Retina redesign, and there’s a reason for that—it’s basically perfect. It’s a touch heavier and thicker than last year’s model but not something people are likely to notice, especially when the ergonomics are so good. It’s so similar to the 2020 model, in fact, that the old keyboard case folds just fine, even with 0.5mm of extra girth.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-screen.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The design of the iPad Pro is a bit stale at this point, but it’s hard to find much fault with it.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>The bezels are small enough to not be distracting yet wide enough to hold (thanks to top-notch edge rejection), and the curved corners on the display nicely reflect the contours of the device itself. I wouldn’t be opposed to a new color—once again, silver and space gray are the only options—but the design of the iPad Pro is still great years later.</p>\n\n\n\n<h2>A fantasticer display</h2>\n\n\n\n<p>If you’ve used the largest iPad Pro before, the screen is going to seem very similar. It’s the same 12.9 inches as it’s always been and doesn’t appear to be much different at first glance, even though Apple is now using mini-LED tech and changes $100 more.</p>\n\n\n\n<p>That’s not necessarily a criticism. Although the prior iPad Pro displays were all LCDs, they were among the best in the business, rivaling some competitors’ OLED screens. While you can certainly see the difference in the Retina XDR display when you compare it side by side to the Liquid Retina display on the previous model, the visual difference isn’t nearly as stark as the specs would have you believe.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-xdr.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Unless you’re directly comparing the 2021 iPad Pro (top) against the 2020 model (bottom), it’s extremely difficult to see the improvements.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>It’s definitely brighter (Apple says it can hit 1,600 nits but I couldn’t get it to go past 900 no matter how bright the surrounding light was), though most people will probably keep it at a much more visually palatable level. There’s also far better contrast that’s in line with OLED quality (1,000,000:1 versus 1,800:1), but again, unless you’re doing very specific tasks or watching very specific HDR movie scenes, you probably won’t notice.</p>\n\n\n\n<p>The upgrade will likely be more noticeable for creative professionals who use the Apple Pencil often and whose eyes will appreciate the kind of crisp color accuracy the Retina XDR display provides. If you have the need—and more importantly, the money—the 12.9-inch iPad Pro’s display won’t be a disappointment, but it also won’t be the tremendous visual upgrade the leap to Retina or OLED was on the iPhone.</p>\n\n\n\n<h2>Speed to spare, literally</h2>\n\n\n\n<p>The other upgrade Apple brought to this year’s iPad Pro is an M1 processor just like the one in the Apple silicon Macs. And just like the one in the Apple silicon Macs, it’s crazy fast.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-geekbench.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>If you’ve seen benchmarks for the <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">24-inch iMac</a> or <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a>, you’ll know exactly what the iPad Pro brings. Compared to the A14 in the <a href=\"https://www.macworld.com/article/234771/ipad-air-2020-review.html\">iPad Air</a>, it’s even faster than a hypothetical A14X, with a tremendous all-around speed, especially in Geekbench’s Compute tests. And the M1 completely blew away the previous iPad Pro when it comes to graphics.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-3dmark.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Despite the new chip, however, you’re not getting much better battery life. Apple has rated every iPad it’s ever made by the same 10 hours of battery life, give or take an hour or so, and the iPad Pro falls firmly within that range in my testing. That’s to say you won’t need to worry about plugging it in unless you use it for hours on end or leave it unplugged for days.</p>\n\n\n\n<p>Speaking of plugging it in, you’ll get the same 18W fast charging as you did on the 2020 model—sadly there’s no wireless charging or MagSafe yet—but the port now supports Thunderbolt devices for faster data transfers and higher-resolution monitors. The only problem is Apple still hasn’t upgraded iPadOS to match, particularly when it comes to external displays. The only option is to mirror the iPad Pro’s display to a second monitor, which is a less-than-ideal experience that falls woefully short of a dual-screen workstation. </p>\n\n\n\n<p>This year’s cellular model uses a 5G modem instead of an LTE one, so speeds will be quicker in areas where 5G networks are available. That’s nice to have but not all that necessary, especially if you have an iPhone 12 nearby. I tested Verizon’s 5G network and with top speeds around 80Mbps, it was faster than last year’s LTE model. But I got the results using my iPhone 12’s hotspot, so I’m not sure the extra expense and monthly fee is worth it now. It’s nice to have and offers a bit of future-proofing, but much like the screen, it’s not essential—or worth the $200 upgrade fee Apple is charging (versus $130 previously).</p>\n\n\n\n<h2>Held back by the same constraints</h2>\n\n\n\n<p>For the first time Apple is listing RAM specs for the iPad Pro and it starts at the same 8GB as the base M1 Macs with 16GB available at the 1GB and 2GB storage tiers. That’s a lot of RAM for an iPad—previously iPad Pro models topped out at 6GB and the iPad Air only has 4GB—and like the screen and the chip, I’m not quite sure all that memory is needed.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-camera.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 2021 iPad Pro has the same rear camera array as the 2020 model.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>On a Mac, more RAM is always good, but iPadOS isn’t macOS. Apps are currently limited to 5GB of RAM each, and even though iPadOS 15 will change that for some apps, it’s unlikely you’re ever going to do so much with your iPad Pro that you need 16GB of RAM. And with simplified multitasking, it’s unlikely for the system to ever use anywhere near the available memory. Some people will scoff at that notion, but the fact remains that you can do as much on the iPad Air, which has lesser specs and costs hundreds less.</p>\n\n\n\n<p>Apps open in an instant, scrolling is incredibly smooth, and Safari feels super snappy. So the 2021 iPad Pro certainly is fast—but so is the 2020 model. With benchmarks and specs that absolutely blow away the previous model, the 2021 iPad Pro should be leaps and bounds better than its predecessor.  The reasons why it’s not aren’t necessarily a failing of the iPad Pro but rather the way Apple has set up iPadOS. Despite breaking it away from the iPhone two years ago, the iPad’s operating system is still stuck in something of a rut, with no real benefit to pro users or gamers. The iPad Pro will run everything better, but the speed and graphics boosts just don’t make as much of a difference as they could.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-thunderboltjpg.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The M1 iPad Pro (top) is very similar to the 2020 model, but the USB-C port is now Thunderbolt and the antenna lines support 5G networks.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>And other than raising RAM limits, the iPadOS 15 update fails to take advantage of the tremendous speed in the iPad Pro. We’re still waiting for professional apps like Final Cut Pro and Xcode, and Apple doesn’t give power users any compelling reason to jump to the Pro. Some may argue that Face ID, the rear camera system and larger screen justify the cost, but the fact remains that the tangible benefit that you get when using a Mac Pro instead of a Mac mini just isn’t there when switching between an iPad Air and iPad Pro.</p>\n\n\n\n<h2>Should you buy a 12.9-inch iPad Pro?</h2>\n\n\n\n<p>The 12.9-inch iPad Pro is undoubtedly the best tablet Apple has ever made. There’s a lot to like about it—the display is gorgeous, the processor is desktop caliber and the front camera is quite good—but it also more expensive than ever.</p>\n\n\n\n<p>Yes, you’re getting more speed and pixels for your money, but whether that’s evident in your day-to-day use is another question. If you don’t mind spending $1,099 and up on a tablet, the 12.9-inch iPad Pro is the absolute cream of the tablet crop with more power, pixels, and performance than you’ll ever need. There really isn’t anything in the 12.9-inch iPad Pro’s class, including its 11-inch sibling. Quite frankly, the 12.9-inch iPad Pro has reached a point where Apple could take a break from updating it for three years and it would still run circles around any other tablet.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-back.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 2021 iPad Pro comes in silver and space gray, which are starting to feel a little stale.</p></figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>But despite few negatives and a 4-star score in this review, I wouldn’t actually recommend the 12.9-inch iPad Pro to anyone who wasn’t already dead set on buying one. The screen is nice but not noticeably better than last year’s. The chip is fast but not noticeably faster than last year’s. The front camera is improved but not noticea—OK, the front camera is a lot better. But that’s not really a reason to spend a thousand-plus dollars to upgrade. </p>\n\n\n\n<p>If you want one, get one. If you need to stretch your budget to afford one, however, just get last year’s model. Or better yet, get an iPad Air.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dbae65a0c891c00052d20bb3503ec8db6b98c42d95aa003520164e6664062a79","category":"Apple"}