{"title":"122 Impact of an active-dry yeast (Saccharomyces cerevisiae CNCM I-1077) delivered via free-choice mineral on growth parameters of beef cow-calf pairs grazing native rangelands","link":"https://academic.oup.com/jas/article/102/Supplement_3/334/7757259?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Throughout the grazing season, cows are exposed to forages of varying nutritive quality that must be efficiently utilized for reproductive and lactation performance for ranch profitability. Season, environment, and forage varieties can impact forage quality and animal performance. Supplementing active-dry yeast improves fiber digestibility; however, supplementing active-dry yeast to grazing, lactating beef cows has not been evaluated extensively. Therefore, the study objective was to evaluate the effects of feeding an active-dry yeast to range beef cows via free-choice mineral 30 d prior to calving through weaning on calf growth performance and cow body condition score (BCS). Multiparous red Angus cows (n = 436; 6.5 ± 1.9 yr) grazed open native rangeland near Medicine Lodge, Kansas from February to August 2023. At trial initiation, cows were sorted by initial BCS onto one of two mineral treatments: 1) CON; no yeast (n = 213 cows) or 2) SC 1077; <span>Saccharomyces cerevisiae</span> CNCM I-1077 (1 x 10<sup>10</sup> cfu/g; n = 223 cows). Mineral consumption was targeted at 113.4 g/d with fresh mineral added to feeders when depleted every 2 to 3 d. Mineral consumption and yeast viability was reported monthly. Individual calf birth weights were recorded on a 25% randomized sub-set group for each treatment due to management practice feasibility with treatment means extrapolated across the entire herd for calf gain calculations. At time of weaning, individual calf body weights (BW) and cow BCS were collected. The data were fitted using a linear model in R including treatment group, calf sex and cow age, wherein the difference between dietary groups was assessed through ANOVA. Statistical significance was considered at <span>P</span> ≤ 0.05. Neither treatment × cow age nor sex × treatment interactions were observed for all measured parameters (<span>P</span> ≥ 0.26). Mineral consumption (83.0 ± 9.1 g/d) was not different between the two treatments for the length of the trial (<span>P</span> = 0.55). Measured calf birth weights (31.9 ± 0.30 kg) were not different for the sub-set group (<span>P</span> = 0.44). Weaning weight, ADG, and BW gain were greater for SC 1077 calves compared with control calves for both the sub-set and entire herd (<span>P</span> ≤ 0.01). The SC 1077 mineral treatment improved cow BCS at time of weaning compared with controls for both sub-set groups and entire herd (<span>P</span> ≤ 0.02). Pregnancy rates were not different between treatments for the entire herd (<span>P</span> = 0.99) and the sub-set group (<span>P</span> = 0.32); however, a 6.8% numerical increase in pregnancy rate was observed for SC 1077. To conclude, providing SC 1077 via free-choice mineral improved cow BCS and calf growth parameters which could be attributed to improved cow rumen function and fiber digestibility.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"dbb7f4faeab062ee99882f0721574c46868dc8395e00127080bf2cbf0c01fd58","category":"Environment"}