{"title":"Breakaway revelations, climbing sensations, sprinting stars: Five breakout riders of the Giro d’Italia","link":"https://www.cyclingtips.com/2023/05/breakaway-revelations-climbing-sensations-sprinting-stars-five-breakout-riders-of-the-giro-ditalia/","date":1685119719000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1491543864.jpg?width=1200\" alt=\"Breakaway revelations, climbing sensations, sprinting stars: Five breakout riders of the Giro d’Italia\" /></figure><p>In Geraint Thomas and Primož Roglič, the general classification of this <a href=\"https://www.velonews.com/giro-ditalia/\">Giro d’Italia</a> is currently ruled by two of the peloton’s most established grand tour stars.</p>\n<p>But this <em>corsa rosa</em> isn’t all about known-name veterans.</p>\n<p>The breakaways, bunch sprints, and race for the top-10 has been dominated by a pack of bright-eyed new talents.</p>\n<p>Here are the five riders that have broken out at this year’s Giro d’Italia:</p>\n<h2>Derek Gee (Israel-Premier Tech)</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1493204308-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption><span>Is there a breakaway Derek Gee hasn’t been in?</span> (Photo: Stuart Franklin/Getty Images)</figcaption></figure>\n<p><strong>Age:</strong> 25<br />\n<strong>Nationality:</strong> Canadian<br />\n<strong><em>Breakaway bustin’ bird watcher</em></strong></p>\n<p>Three second-place finishes. Two fourth-place finishes. Countless kilometers in the break, no matter what the terrain.</p>\n<p>It seems a scandal that Derek Gee hasn’t claimed his first grand tour win after a breakaway-bustin, all-attacking ride through his Giro d’Italia debut. He was only denied victory by inches when Nico Denz outsprinted him last weekend and was best of the rest when Ben Healy left the breakaway swinging on the stage into Fossombrone.</p>\n<p>Gee came into the <em>corsa rosa</em> expecting to be pulling for Israel Premier-Tech captains Domenico Pozzovivo and Simon Clarke, but will likely come out of it one of Israel-Premier Tech’s new number ones as he rides through a long-spanning contract to 2025.</p>\n<p>Gee only recently made a full-time pivot from track to road and said he’s still trying to discover where he fits in the peloton.</p>\n<p>If he keeps doing what he’s been doing through the past 18 stages of this Giro, he’ll be just fine.</p>\n<p>Oh, and did we mention he’s a passionate ornithologist, too?</p>\n<h2>Jonathan Milan (Bahrain Victorious)</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1488184336-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption><span>Jonathan Milan brings wild brute strength to Giro finishlines.</span> (Photo: Stuart Franklin/Getty Images)</figcaption></figure>\n<p><strong>Age:</strong> 22<br />\n<strong>Nationality:</strong> Italian<br />\n<strong><em>Udine’s raging bull, unleashed</em></strong></p>\n<p>Jonathan Milan hasn’t been “riding” through his grand tour debut, he’s been bulldozing it.</p>\n<p>The strapping fast-finisher won the Giro’s first bunch kick, and his charging bull sprint style landed him second four times since. And despite his huge brawny frame, the mountains aren’t getting in his way either as he survives through the elevation-packed third week.</p>\n<p>If Milan makes it through Friday’s 19th “queen stage”, he’s also a dead-cert to become the first Italian <em>maglia ciclamino</em> since Elia Viviani in 2018.</p>\n<p>Milan has been a cornerstone of Italy’s all-slaying track pursuit team in recent seasons, and so he’s not altogether new.</p>\n<p>But after a few seasons kicking through the weeds in smaller road stage races, the towering Tolmezzan is now stamping himself as one of the fastest of the sprinter elite.</p>\n<p>The most remarkable part of it all? Milan so far seems to rely on brute strength and force of will.</p>\n<p>He’s gotten his results the past weeks by unleashing wild “wattbombs” of speed from way back in the wheels and lacks much of the subtlety or savvy positioning of his experienced rivals.</p>\n<p>Still only 20 years old, Milan is most definitely a rough diamond. If he can get those edges smoothed out, he’ll be unstoppable.</p>\n<h2>Filippo Zana (Jayco-AlUla)</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1493202615-720x480.jpeg?width=720\" alt=\"Filippo Zana won stage 18 of the 2023 Giro d'Italia\" width=\"720\" height=\"480\" /><figcaption><span>Filippo Zana won stage 18 of the 2023 Giro d’Italia</span> (Photo: Stuart Franklin/Getty Images)</figcaption></figure>\n<p><strong>Age:</strong> 24<br />\n<strong>Nationality:</strong> Italian<br />\n<strong><em>Home-town hero, grande gregario</em></strong></p>\n<p>Filippo Zana was already penciled onto this list of breakout riders before he outsprinted Thibaut Pinot atop the Val di Zoldo on stage 18 on Thursday, and he’s most certainly on it now.</p>\n<p>Zana flew his Italian <em>tricolore</em> like a true champion through his fourth Giro.</p>\n<p>He’s been <em>gregario</em> number one for Jayco-AlUla’s climber ace Eddie Dunbar, did all the legwork for Michael Matthews’ reduced sprint win on stage 3, and on Thursday, claimed his biggest win in front of his local crowd.</p>\n<p>Like some of the other riders on this list, Zana’s been around the fringes for a while.</p>\n<p>Three years with Bardiani-CSF-Faizanè saw the Venetian do the rounds in many of the doomed breakaways before he last season won big at the Italian national title in what proved a prophecy of his upward trajectory.</p>\n<p>Jayco-AlUla scooped Zana out of the ProTeam division this season on a three-year deal that showed they took this off-radar rider very seriously.</p>\n<p>The rest of the peloton will do too after his barnstormer ride this month.</p>\n<h2>Eddie Dunbar (Jayco-AlUla)</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1491534438-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption><span>Dunbar (blue and white, right) is hanging with the GC greats after four years stuck on the sidelines. (Photo: Tim de Waele / Getty)</span></figcaption></figure>\n<p><strong>Age:</strong> 26<br />\n<strong>Nationality:</strong> Irish<br />\n<strong><em>From the sidelines to the spotlight</em></strong></p>\n<p>It doesn’t seem fair to call Eddie Dunbar a “revelation” or a “breakout,” but in some ways he is.</p>\n<p>The diminutive Irishman rode a solid grand tour debut with Team Sky in 2019 at the Giro d’Italia, but never raced over three weeks since.</p>\n<p>Dunbar became the biggest victim of the British squad’s blockbuster grand tour roster and had to make do with one-week racing while Geraint Thomas, Egan Bernal, Richard Carapaz, and Tao Geoghegan Hart became go-to picks for any grand tour assault.</p>\n<p>Now with Jayco-AlUla, Dubar is seizing his chance in his first grand tour in four years.</p>\n<p>Dunbar quietly but very confidently rode through what seems like a renewed Giro “debut” after so long of a gap since his first grand tour, and now finds himself leading the “best of the rest” classification group.</p>\n<p>Currently fourth and three minutes away from a spot on the podium, it would take some wild shake-up to see Dunbar on one of those three steps in Roma.</p>\n<p>But he’s got a three-year deal with Jayco to grow into and now after so long, the GC world is his oyster.</p>\n<h2>Andreas Leknessund (Team DSM)</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1489783418-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption><span>Leknessund defended pink with aplomb and is still hanging out in the top-10.</span> (Photo: Stuart Franklin/Getty Images)</figcaption></figure>\n<p><strong>Age:</strong> 24<br />\n<strong>Nationality:</strong> Norwegian<br />\n<strong><em>The Giro’s northern star</em></strong></p>\n<p>Scroll down the GC standings Friday ahead of stage 19 and one name stands out.</p>\n<p>Two weeks after he was “gifted” the pink jersey by Remco Evenpoel with his gutsy race to the top of Lago Laceno, Andreas Leknessund is still loitering in eighth among a pack of GC stars.</p>\n<p>The young Norwegian became the most northerly-born racer to wear the <em>maglia rosa</em> when he began his five-day stint in pink and defended his prized pullover with aplomb during his tenacious ride through the Giro’s first week.</p>\n<p>A product of the Uno-X talent academy, Leknessund was long touted for big things. He already impressed through 2022 with a solid Tour de France debut and victories through Suisse and the Tour of Norway, and looks to have carried that momentum, and more, into 2023.</p>\n<p>Leknessund is out of contract this season.</p>\n<p>Whether he hangs on for a top-10 in Roma or not, the 24-year-old can be bargaining for another zero on the end of his salary when his negotiations with DSM or some other squad hit full swing.</p>\n<h2>Also big kudos to:</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/05/GettyImages-1492034507-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption><span>Marco Frigo lit up the 15th stage won by Brandon McNulty.</span> (Photo: Tim de Waele/Getty Images)</figcaption></figure>\n<p>These guys only don’t get bigger mentions because they’ve either already had their “breakout” moments, or were simply overshadowed by the “big five” above.</p>\n<p>Our kudos goes to:</p>\n<ul>\n<li>Nico Denz (Bora-Hansgrohe)</li>\n<li>Kaden Groves (Jayco-AlUla)</li>\n<li>Ben Healy (EF Education-EasyPost)</li>\n<li>Marco Frigo (Israel-Premier Tech)</li>\n<li>Thomas Gloag (Jumbo-Visma)</li>\n<li>Bruno Armirail (Groupama FDJ)</li>\n<li>Aurélien Paret-Peintre (Ag2r-Citroën)</li>\n</ul>","author":"VeloNews.com","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"dbba883ea752e9863c486d0bcdbab251618fa8a400b1d166c7bdc1e8848fc058","category":"Cycling"}