{"title":"iPhone 15 Pro Likely Feels Even Lighter Than It Really Is Due to Inertia Change","link":"https://www.macrumors.com/2023/09/17/iphone-15-pro-likely-feels-lighter-than-it-really/","date":1694953176000,"content":"The <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> likely feels considerably lighter than the <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a>, not just due to the switch from stainless steel to titanium, but also a change to the device's moment of inertia, according to calculations by Dr. Drang's <a href=\"https://leancrew.com/all-this/2023/09/iphone-15-pro-facts-and-estimates/\"><em>LeanCrew</em> blog</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-Pro-Internal-Chassis.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe ‌iPhone 15 Pro‌ weighs 187g, a 9% reduction of the ‌iPhone 14 Pro‌'s 206g weight. During its announcement, Apple highlighted that the new lightweight feel is facilitated by switching from a stainless steel frame to titanium. Those who have already spent some time with the ‌iPhone 15 Pro‌, including <em>MacRumors</em>' Dan Barbera, have <a href=\"https://www.macrumors.com/2023/09/15/the-macrumors-show-ijustine-talks-iphone-15/\">noted</a> just how much lighter the device feels in the hand. Yet new analysis suggests that the ‌iPhone 15 Pro‌ likely feels even lighter than its actual weight reduction due to a change of its moment of inertia. \r<br />\n\r<br />\nThe moment of inertia, a fundamental concept in physics, measures an object's resistance to rotational motion. Its value is determined by both the amount of mass an object has and how that mass is distributed. Crucially, the further away mass is positioned from an object's axis of rotation, the greater the moment of inertia. Thus, for commonly handled objects like smartphones, this resistance to rotation plays a significant role in how weighty or light they feel during daily use.\r<br />\n\r<br />\nApple's shift from stainless steel to titanium for the ‌iPhone 15 Pro‌'s outer band is pivotal in this change since a substantial portion of the phone's weight reduction is localized at its outer edges. Dr. Drang's analysis suggests that by minimizing mass predominantly at the perimeter, Apple achieved a reduction in the phone's moment of inertia that is more significant than would be expected from the sheer weight decrease alone.\r<br />\n\r<br />\n<blockquote>This reduction, which is more than the mass reduction, would make the iPhone 15 Pro easier to turn, and that may add to the impression that it's significantly lighter than the 14 Pro.\r<br />\n\r<br />\n[...]\r<br />\n\r<br />\nReducing the mass at the perimeter, which the change from stainless steel to titanium has done, has definitely reduced the moment of inertia more than a uniform reduction in mass would have. And that will make the 15 Pro easier to manipulate and will contribute—at least somewhat—to the impression of lightness.</blockquote>\r<br />\n\r<br />\nBased on an analysis of the new phones' dimensions and assuming the mass reduction is mostly around the phone's perimeter, the moment of inertia for the ‌iPhone 15 Pro‌ is estimated to be reduced by 14–15%. Overall this means that the ‌iPhone 15 Pro‌ doesn't just weigh less; its design ensures that its mass is distributed in a manner that makes it resist rotational motion less strongly. This results in a device that feels more agile and nimble, giving an amplified impression of lightness.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Buy Now)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/17/iphone-15-pro-likely-feels-lighter-than-it-really/\">iPhone 15 Pro Likely Feels Even Lighter Than It Really Is Due to Inertia Change</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-likely-feels-even-lighter-than-it-really-is-due-to-inertia-change.2402485/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dbc42c1fcd1295ba4833523ea0f74e5b8bbb4146f3a06c5feca8a2cd35d3dfb3","category":"Apple"}