{"title":"Association between physiotherapist sleep duration and working environment during the coronavirus disease 2019 pandemic in Japan: A secondary retrospective analysis study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306822","date":1720533600000,"content":"<p>by Fumito Morisawa, Yuji Nishizaki, Shuko Nojiri, Hiroyuki Daida, Tohru Minamino, Tetsuya Takahashi</p>\r\n\r\nStudies have reported that health care professionals experienced a lack of sleep during the coronavirus disease 2019 (COVID-19) pandemic and that such lack of sleep and working environment affect their performance. However, to the authors’ knowledge, no study has yet investigated the relationship between sleep duration and working environment among Japanese physiotherapists during the COVID-19 pandemic. This study retrospectively investigated the sleep duration of physiotherapists directly providing physiotherapy to patients with COVID-19 within the red zone and analyzed the association between sleep duration and working environment using logistic regression analysis. Among the 565 physiotherapists studied, the average sleep duration was 6 (6–7) h, and 381 (67.4%) had an average sleep duration of ≤6 h. Less experienced physiotherapists were 1.03 times more likely to sleep ≤6 h, and those in charge of patients with COVID-19 as the supervisor ordered were 0.64 times more likely to sleep ≤6 h. Moreover, physiotherapists with a significant increase in the frequency of internal online meetings and those who had been providing physiotherapy to patients with COVID-19 for &gt;6 months were 2.34 and 2.05 times more likely to sleep ≤6 h, respectively. During the COVID-19 pandemic in Japan, two-thirds of the physiotherapists directly providing physiotherapy to patients with COVID-19 slept less than the recommended duration. This study highlights the need for appropriate workload and work hour management for physiotherapists according to their experience and workload, as well as establishing a medical care system that includes work rotation to ensure that the recommended sleep duration is satisfied.","author":"Fumito Morisawa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dbd697e0bb441d9cf27c6c902b892f7090be5e32200b93a5e009e701d8e81973","category":"Interdisciplinary"}