{"title":"87 Estimation of genetic parameters for activity levels in North American Holstein cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/23/7757093?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>High-producing dairy cows face various challenges during their productive life, including metabolic and infectious diseases, heat stress, and intensive management practices. Therefore, dairy cattle breeding programs have begun to focus on novel traits related to the overall resilience of the cows. Resilience has been defined as the ability of an animal to be minimally affected or to recover quickly from environmental disturbances while maintaining a certain level of productivity. In dairy cattle, resilience can be evaluated using measurements of longitudinal indicator traits, such as activity level, which are repeatedly measured throughout the lifetime of the animal. Variability in activity (defined in this study as average steps per hour and daily steps taken) might be a key indicator of resilience, due to activity of contemporary group animals deviating from normal behavior in less resilient cattle. Before resilience indicators are defined based on variability in certain longitudinal traits, there is a need for evaluating the genetic background of the source variable. Therefore, the primary objective of this study was to estimate variance components and genetic parameters of activity traits in lactating Holstein cows. The data was collected from a large dairy farm located in Indiana, using milking systems. Records from 6,332 Holstein cows for the traits of average activity per hour and number of daily steps were used in the analyses. The models used for the estimation of variance components included the significant (<span>P</span> &lt; 0.05) fixed effects of contemporary group defined based on the concatenation of calving year and season, parity number (1, 2, 3+), pregnancy group (0 mo, 1-3 mo, 4-6 mo, and 7-9 mo), and days in milk (2-wkclasses), and the random effects of direct additive genetic, permanent environment, and residual effects. Genetic parameters were estimated for average activity per hour and daily steps for all parities together. Heritability estimates were calculated based on single-trait repeatability models and the (AI) REML method implemented in the BLUPF90+ software. Daily steps taken had a heritability (± SE) of 0.05 (± 0.02) and a repeatability of 0.29 (± 0.02). Activity per hour had a heritability estimate of 0.12 (± 0.04) and a repeatability of 0.57 (± 0.01). These results indicate that activity level is heritable in North American Holstein cattle and can be added to selection indexes if proven to be a key auxiliary trait for improving dairy cattle sustainability. As a next step, we will investigate the genetic relationship of activity traits with other relevant traits and derive resilience indicators based on variability in activity level.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"dbda5b0e89c4e03523a832dfcc9fc77fbb5b0755b307ab9d2d463de04bd338dc","category":"Environment"}