{"title":"Zwift Lays off 100+, co-CEO Resigns, Zwift Hub Series Discontinued","link":"https://www.dcrainmaker.com/2024/02/resigns-series-discontinued.html","date":1707325198000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2019/11/DSC_8932_thumb.jpg\" /></p>\n<p>Despite Zwift just announcing the new jointly-launched <a href=\"https://www.dcrainmaker.com/2024/02/wahoo-kickr-core-zwift-one-review-cog-click.html\">Wahoo KICKR CORE Zwift One trainer</a>, this hasn’t been a strong week for Zwift as a company. In fact, it’s arguably been the worst week the company has had in its history, with the largest known layoff event at the company to date, <a href=\"https://www.dcrainmaker.com/2023/03/zwift-layoffs-announces-reducing-workforce.html\">eclipsing last year’s big layoff announcements</a> with over 100 people laid off.</p>\n<p>Atop that, Zwift’s co-CEO Kurt Beidler has resigned. He came from Amazon just over a year ago, and was said to be primarily focused on the business and day-to-day operations aspect of it. While co-founder and original CEO Eric Min would largely be focused on the bigger vision of investor relations and external partnerships (e.g., Tour de France, UCI, etc…). With the resignation, Eric will return to being the sole CEO.</p>\n<p>And finally, adding injury to insult, Zwift has decided to discontinue the Zwift Hub smart trainers. This includes the just-launched Zwift Hub One with the Zwift Cog &amp; Click. Albeit, the Cog &amp; Click will live-on, being adapted to all Wahoo direct drive trainers made in the last 6 years.</p>\n<h3><span><strong>Zwift Layoffs:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/03/DSC_3384_thumb.jpg\" /></p>\n<p>Zwift announced the layoffs publicly via <a href=\"https://forums.zwift.com/t/zwift-organizational-changes-february-2024/623962\">their own Zwift Forums</a>, an interesting and somewhat rare move for the company to announce things in that manner. Nonetheless, it noted:</p>\n<blockquote><p>We shared with our team this morning that we are making a reduction in force. This was difficult news to deliver and we regret having to part ways with some incredibly talented and passionate people. Their contributions to our mission were substantial and we’re grateful for their work.</p></blockquote>\n<p>When asked for official comment on the number of individuals being laid off, as well as the regions or work focuses, Zwift declined to give a number.</p>\n<p>However, the current number from a very trusted individual I know, is 100+ employees at Zwift were laid off. It’s not clear precisely how many employees there were at Zwift prior to the layoffs, but last spring after the layoffs then, <a href=\"https://zwiftinsider.com/workforce-reduction/\">they had about 450 or so employees (napkin math).</a> Thus, another 100+ would mean roughly a 20-25% reduction – which is pretty massive.</p>\n<p>We may get confirmation of some of that shortly, as California laws require reporting of mass layoff events, via the <a href=\"https://edd.ca.gov/en/jobs_and_training/Layoff_Services_WARN/\">WARN system</a>. Given Zwift is headquartered in California, and has substantial employees there, my reading of the law states they should have filed a report on Tuesday, and it should show up on Thursday’s report. However, the nuances of exactly which employees show up on the report (in a worldwide company) gives them a fair bit of latitude in that the California-only number will be far smaller than actual. Still, I have zero reason to doubt the 100+ number.</p>\n<p>Zwift also confirmed they’ll be maintaining their existing sponsorships, including the Tour de France avec Femmes (the Women’s Tour de France), which is good to hear.</p>\n<p>As part of that, it was announced that one of the two CEOs was resigning.</p>\n<blockquote><p>Eric Min will continue as sole CEO and Kurt Beidler has chosen to resign. Zwift remains a healthy, global business with a passionate community. We have seen accelerated growth over the last year but in the current environment, we must focus on sustainable and efficient growth. Zwift will be more agile and focused on delivering great things for our community.</p></blockquote>\n<p>As a reminder, <a href=\"https://zwiftinsider.com/co-ceo/\">Kurt only joined 13 months ago</a>, and at the time, Eric Min said:</p>\n<blockquote><p>After a long search, I’m excited to announce that Kurt Beidler has joined Zwift as Co-CEO. Kurt joins us from Amazon, where he has led large teams and built multiple successful businesses over a 17-year run. For most of the past eight years, Kurt has been leading Amazon Kids+, a hardware/software/content subscription service structurally similar to Zwift. Kurt led the Kids+ team of several hundred people to grow Kids+ into the largest kid-focused subscription service in the world. Before that, Kurt built and ran several books and Kindle-related businesses across the US, Europe, Japan, and China.</p>\n<p>I will also be stepping into the role of Co-CEO, where I will partner closely with Kurt as he takes the reins of Zwift’s core business and ramps up in his new role. In the long term, while there are strategies where Kurt and I will partner closely together, the most significant value this new Co-CEO relationship brings to Zwift is the ability for Kurt and me to divide and conquer. There is much work to do! For me, rather than being spread thin trying to do it all myself, I will have time to go deeper into specific areas that are also critical to Zwift’s long-term success.</p></blockquote>\n<p>Again, the idea here was that Kurt would basically run the show day-to-day, including probably making some of the harder decisions that would be easier accomplished from an outsider perspective. Whereas Eric would do what Eric excels at: Working the room. I don’t mean that in a negative way, but rather, that Eric Min’s long-term strength has always been raising capital for Zwift, convincing organizations like the UCI (cycling’s main regulatory body), the Tour de France, the IOC (International Olympic Committee), etc… Literally, I can’t think of anyone in cycling, or even beyond cycling, that does a better job of those things.</p>\n<p>Whereas, I think many outside (if not inside) would say that Zwift has actually seen improvements since the co-CEO situation, in terms of work clarity and such. So it’s not clear how things will shake-out with Eric back as the singular CEO.</p>\n<h3><span><strong>Zwift Hub Discontinued:</strong></span></h3>\n<p><img title=\"Zwift-Hub-Dead.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/Zwift-Hub-Dead.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>Meanwhile, somewhat snuck under the radar of today’s news of the new Zwift/Wahoo trainer, is that Zwift is officially discontinuing the Zwift Hub. That trainer was launched <a href=\"https://www.dcrainmaker.com/2022/10/zwift-hub-smart-trainer-in-depth-review-the-best-bang-for-your-buck.html\">barely 18 months ago in October 2022</a>, and then revamped in <a href=\"https://www.dcrainmaker.com/2023/10/zwift-hub-one-zwift-cog-clicks-review.html\">October 2023 with the Zwift Hub One</a> (containing the Zwift Cog). At that point the existing cassette-enabled Zwift Hub got renamed to the Zwift Hub Classic (and <a href=\"https://www.dcrainmaker.com/2023/11/wahoo-further-reduces-kickr-core-prices-increases-zwift-partnership-again.html\">promptly discontinued</a>).</p>\n<p>As of today, both variants are now officially discontinued, and Zwift will continue to sell off units till stocks are depleted. It’s been on sale the last few weeks with a “till supplies last” note, causing some confusion. Your confusion is now clarified.</p>\n<p>This would mark the shortest smart trainer lifespan I’m aware of, a mere 4 months for the Zwift Hub One. Of course, its legacy lives on with the new KICKR CORE Cog, that takes the Cog and Click elements.</p>\n<p>This also means that JetBlack and Zwift’s previous manufacturing partners are out of the mix. JetBlack is still making a fan for Zwift, as well as a trainer table. Both of which I’ve been meaning to finish my reviews on. They’re both a good price-value compromise.</p>\n<p>Now, for some good news: Zwift has confirmed they will continue to support the Zwift Hub One and Zwift Hub Classic in terms of firmware updates. The company says they plan to provide firmware updates for the units for two years, including new feature updates. It remains to be seen what those feature updates are, and how much effort is really given to it. Zwift had taken over firmware ownership from JetBlack for the Zwift Hub series, and pulled it in-house. However, with the Wahoo KICKR CORE Zwift One, Wahoo owns the KICKR CORE firmware, not Zwift.</p>\n<p>Hopefully though, with Zwift continuing to have engineers for the Zwift Play and Click hardware, those engineers are able to handle the Zwift Hub firmware updates too (and, hopefully enough of them survived the layoffs).</p>\n<h3><span><strong>Going Forward:</strong></span></h3>\n<p><img title=\"ZwiftGoingForward.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/ZwiftGoingForward.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>Ultimately very little of the above is good news for Zwift employees, or Zwift consumers. Long-term, it may be good news for Zwift as a company, and consumers as users of the platform, if it means Zwift can stick around.</p>\n<p>At this point, Zwift’s biggest challenge is becoming profitable, and finding a way to keep investors somewhat happy. I say ‘somewhat’, because the harsh reality is that Zwift will almost never give those investors the massive return on investment they were looking for. With a previous billion-dollar valuation that many of those investments were made under, there’s no worldly or other-worldly scenario that Zwift sees that valuation again.</p>\n<p>While Zwift may slowly be growing, it’s growing at a literal fraction of a percent that Zwift had sold to investors. Further, while Zwift had often shown interest in someday IPO’ing, that’s not a realistic scenario at this juncture either. And while Zwift could be acquired, it’d be at bargain rates relative to the valuation.</p>\n<p>Said differently: Zwift has to do what Peloton, Strava, and others have had to do in the last year or two: Start acting and running like a real company with real costs, real income, and a real goal to be profitable. After all, the goal of any business isn’t to operate at a loss forever. It’s simply not sustainable.</p>\n<p>Hopefully, Zwift can find that better path. And further, hopefully, all those impacted by the layoffs can land on their feet, with better trails ahead.</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"dbde7afd31685f97fd6ae78c101e0169b87942d771d14dccf582bda8e864e4aa","category":"Cycling"}