{"title":"“For a man to go to hospital, then that would be his last option”: A qualitative study exploring men’s experiences, perceptions and healthcare needs in the implementation of Universal Health Coverage in Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002925","date":1715090400000,"content":"<p>by Sharon N. Mokua, Lorraine Ombogo, David Mathu, Prisca Otambo, Lilian Nyandieka, Stephen N. Onteri, Schiller J. Mbuka, James Kariuki, Ismail Ahmed, Violet Wanjihia, Joseph Mutai, Zipporah Bukania</p>\r\n\r\nThe achievement of Universal Health Coverage (UHC) requires equitable access and utilization of healthcare services across all population groups, including men. However, men often face unique barriers that impede their engagement with health systems which are influenced by a myriad of socio-cultural, economic, and systemic factors. Therefore, understanding men’s perspectives and experiences is crucial to identifying barriers and facilitators to their healthcare-seeking behaviour under UHC initiatives. This qualitative study sought to explore men’s perceptions, experiences, healthcare needs and potential strategies to inform an impartial implementation of Universal Health Coverage (UHC) in Kenya. The study employed a qualitative research design to investigate men’s healthcare experiences in 12 counties across Kenya. Thirty focus group discussions involving 296 male participants were conducted. Men were purposively selected and mobilized through the support of health facility-in-charges, public health officers, and community health extension workers. Data was coded according to emergent views and further categorized thematically into three main domains (1) Perspectives and experiences of healthcare access (2) Socio-cultural beliefs and societal expectations (3) Desires and expectations of health systems. Findings revealed complex sociocultural, economic, and health system factors that influenced men’s healthcare experiences and needs which included: masculinity norms and gender roles, financial constraints and perceived unaffordability of services, lack of male-friendly and gender-responsive healthcare services, confidentiality concerns, and limited health literacy and awareness about available UHC services. Our study has revealed a disconnect between men’s needs and the current healthcare system. The expectations concerning masculinity further exacerbate the problem and exclude men further hindering men’s ability to receive appropriate care. This data provides important considerations for the development of comprehensive and gender-transformative approaches challenging harmful masculine norms, pushing for financial risk protection mechanisms and gender-responsive healthcare delivery attuned to the unique needs and preferences of men.","author":"Sharon N. Mokua","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"dbdf9ce70400060ff55c57cd8933bbfa7a170033e8b6e18ba670c737f5b07424","category":"Environment"}