{"title":"Preview: What you need to know ahead of the women’s Amstel Gold Race","link":"https://cyclingtips.com/2021/04/preview-what-you-need-to-know-ahead-of-the-womens-amstel-gold-race/","date":1618561142000,"content":"<p>The Amstel Gold Race is back after being cancelled in 2020 due to the coronavirus pandemic. One of the most unpredictable one-days of the year, the Amstel Gold Race has delivered three exciting events since it was added to Ardennes week in 2017.</p>\n\n\n\n<p>Although the first edition was held in 2001, the race took a 13-year hiatus and only resumed in 2017. The race has since been won by three of the most popular riders in the sport right now: Anna van der Breggen, Chantal van den Broek-Blaak, and Kasia Niewiadoma. Van der Breggen won solo while Van den Broek-Blaak took the victory from a five-rider breakaway. </p>\n\n\n\n<p>Niewiadoma’s win in 2019 was, in typical Niewiadoma style, a jaw-dropping performance. After an aggressive race, Niewiadoma attacked on the Cauberg climb with 2.3 km to go. She rode solo for the remainder of the race with Annemiek van Vleuten close behind. On the final straight to the finish, Van Vleuten came very close to catching the Polish rider but Niewiadoma barely held on to take the victory.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>The first race of Ardennes week, Amstel Gold is hilly and challenging, so teams tend to swap some of their Classics riders for their rouleurs. Some riders who will line up in Valkenburg may have spent a few weeks at home training. Some will be coming straight out of the racing in Belgium. It’s a shift in the dynamic that adds a whole new layer to the three Ardennes races. </p>\n\n\n\n<h2>The course</h2>\n\n\n\n<p>Due to the ongoing pandemic, the organizers of the Amstel Gold Race have altered the route considerably. Instead of starting in Maastricht and winding through the Limburg region of the Netherlands before entering the final circuits south of Valkenburg, the race will start and finish just outside of Valkenburg. </p>\n\n\n\n<p>The women will race seven laps of the final 16.9 km circuit they raced at the end of the 2019 edition for a total of 115.5 km of racing. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-15-at-5.11.01-PM.png\" /></figure>\n\n\n\n<p>Each lap the peloton will race up three climbs; the Geulhemmerberg, the Bemelerberg, and the Cauberg. All three of the climbs are relatively short but will slowly chip away at the peloton. The Geulhemmerberg is 1 km in length with an average of 5%, while the Bemelerberg and the Cauberg are both just shy of 1,000 meters. The Cauberg is the steepest of the three at 6.5% average and 12% maximum grade.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/amstel-gold-race-ladies-edition-women-elite-2021-1340x540.png\" /></figure>\n\n\n\n<p>There is 1.8 km from the top of the Cauberg to the finish line – the perfect launching pad for a solo rider to get away. </p>\n\n\n\n<h2>The contenders </h2>\n\n\n\n<p>The Amstel Gold Race will favour a rider who is aggressive, can climb, has a good kick, and has the power to hold off any chasers for 1.8 km. A lot of the same riders who featured in the Tour of Flanders and Strade Bianche will once again be seen at the pointy end of the Amstel Gold Race. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00032465-036-1340x893.jpg\" /><figcaption>Kasia Niewiadoma waves hello before the start of the  stage 1 team time trial at the Giro d’Italia Internazionale Femminile in 2020.</figcaption></figure>\n\n\n\n<h2>Kasia Niewiadoma (Canyon-SRAM)</h2>\n\n\n\n<p>Kasia Niewiadoma won on this exact finish in 2019. She knows how to do it and she has a hunger for victory. She was aggressive in Trofeo Alfredo Binda, a similar type of race to Amstel Gold – hilly and unrelenting. </p>\n\n\n\n<p>Recently she showed incredible form at Dwars door Vlaanderen, and although she didn’t look 100% in Flanders, she has had a good chunk of time at home to recover and focus on the Ardennes.</p>\n\n\n\n<p>Niewiadoma really shines at the one-days. She’s been runner-up at the Giro Rosa, but her style goes with the one-day races like <a href=\"https://en.wikipedia.org/wiki/Kotlet_schabowy\" target=\"_blank\">schabowy</a> and sauerkraut. With only three of the spring one-days left don’t be surprised to see her grimace on the front of the peloton. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00033013-081-1340x831.jpg\" /><figcaption>Demi Vollering pictured during Ronde van Vlaanderen 2021.</figcaption></figure>\n\n\n\n<h2>Demi Vollering (SD Worx)</h2>\n\n\n\n<p>Rumblings before the start of the Amstel Gold Race have hinted that Anna van der Breggen will not take to the start due to illness. Even if she does, she’s been sick in the run-up which gives Demi Vollering a chance to show herself. Vollering almost – as in a <a href=\"https://cyclingtips.com/2021/04/pidcock-and-winder-take-brabantse-pijl-victories-cavendish-wins-yet-again-daily-news/\" target=\"_blank\">fingernail’s width almost</a> – won Brabantse Pijl earlier in the week. She has been been looking strong all season, finishing fifth at the Tour of Flanders and sixth in Strade Bianche. </p>\n\n\n\n<p>Vollering finished seventh in the 2019 edition of Amstel Gold when she was still riding for Parkhotel Valkenburg. She was in a select group of five that finished 10 seconds behind Niewiadoma and Van Vleuten. Since then she’s gotten better and better, especially this year where she has played a role in every race she’s attended. </p>\n\n\n\n<p>Vollering will start alongside Van der Breggen, Van den Broek-Blaak, Amy Pieters, Ashleigh Moolman Pasio, and Niamh Fisher-Black. As per usual, SD Worx has a few cards to play. As noted, Van den Broek-Blaak won in 2018 and Moolman Pasio looked great in Brabantse Pijl, but it would be great to see Vollering score her first big victory on Sunday. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/RhodePhoto_GentWevelgem_2021-4187-1340x893.jpg\" /><figcaption>Ruth Winder racing Gent-Wevelgem in 2021.</figcaption></figure>\n\n\n\n<h2>Ruth Winder (Trek-Segafredo)</h2>\n\n\n\n<p>After a dramatic win at Brabantse Pijl Ruth Winder is looking poised to take a big WorldTour victory soon. Winder was strong at the mid-week Classic, and with Lizzie Deignan and Elisa Longo Borghini absent, the US national champion finally got the chance to shine. </p>\n\n\n\n<p>Both Longo Borghini and Deignan are on the start list for Amstel Gold, and Longo Borghini continues to look like the strongest Trek-Segafredo rider on offer. Deignan hasn’t quite shown the form she demonstrated in 2020. </p>\n\n\n\n<p>The reason Winder might be Trek-Segafredo’s designated rider at Amstel Gold alongside Longo Borghini could be the nature of the climbs. Winder has a kick on the short climbs that is slightly better than Longo Borghini’s. The Italian national champion might be the team’s strongest climber but doesn’t have the same acceleration.</p>\n\n\n\n<p>Really the American team has two strong cards to play. Winder from a small group, Longo Borghini if she can get away solo. </p>\n\n\n\n<p>Another card they have is Tayler Wiles. Wiles has been riding selflessly all season. She finished 11th at Brabantse Pijl and was instrumental in Longo Borghini’s win at Trofeo Alfedo Binda. If she’s able to slip into a small group and get a headstart on the rest, Wiles could find herself in a perfect position to take the win.</p>\n\n\n\n<p><strong>Update: </strong>Lizzie Deignan is not racing Amstel Gold Race and has been replaced on the provisional start list by Lauretta Hansen. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/RhodePhoto-1032-1340x893.jpg\" /><figcaption>Annemiek van Vleuten during the 2021 Omloop Het Nieuwsblad.</figcaption></figure>\n\n\n\n<h2>Annemiek van Vleuten (Movistar)</h2>\n\n\n\n<p>At Brabantse Pijl Annemeik Van Vleuten set up a move for her teammate Leah Thomas that became the winning break of the day. Before that Van Vleuten won two races in a row, Dwars door Vlaanderen and the Tour of Flanders, both with strong moves near the end of the race. She came out of an altitude block after Strade Bianche flying and could definitely continue her winning streak with Amstel Gold Race, especially because the course favours a solo move. </p>\n\n\n\n<p>Van Vleuten has also formed an interesting dynamic with Thomas that could come in handy as the races get more selective. As noted, Thomas made the winning break at Brabantse Pijl, but she didn’t have the acceleration at the line. A strong time-trialist, Thomas is more suited to a race like Amstel Gold and could play a role on Sunday.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/RhodePhoto_BruggeDePanne2021103-1340x893.jpg\" /><figcaption>Grace Brown after winning the 2021 Oxyclean Classic Brugge-De Panne.</figcaption></figure>\n\n\n\n<h2>Grace Brown (BikeExchange)</h2>\n\n\n\n<p>After winning the Oxyclean Classic Brugge-De Panne in spectacular fashion Grace Brown went on to place third at the Tour of Flanders. Brown can get over the climbs and make any selection but doesn’t have as good a kick as some others. Her signature move is solo, and Amstel Gold Race is ideal for a solo victory. </p>\n\n\n\n<p>Amanda Spratt is also a rider to watch for Amstel Gold. Spratt finished third at Amstel Gold in 2018 and has targetted the Ardennes races in years past. She hasn’t thrown down yet in 2021 but has still looked good in the races so far. Fun fact: Spratt finished 11th in all three Ardennes races in 2019.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/CORVOS_00033013-088-1340x909.jpg\" /><figcaption>Kristen Faulkner pictured during Ronde van Vlaanderen, 2021.</figcaption></figure>\n\n\n\n<h2>A few other riders to watch out for …</h2>\n\n\n\n<p>With the change in course for this year’s Amstel Gold Race, a few riders who have proven strong on the climbs could have a shot on Sunday. One such rider is <strong>Kristen Faulkner </strong>(Tibco-SVB) who finished 10th at the Tour of Flanders. The American is new to racing, so having achieved that kind of result is <strong><a href=\"https://cyclingtips.com/2021/04/from-alaska-to-the-kwaremont-the-spectacular-rise-of-kristen-faulkner/\" target=\"_blank\">impressive, to say the least</a></strong>. Faulkner is a strong climber, and with a more selective race, she could continue to see strides in her development during the Ardennes. </p>\n\n\n\n<p>FDJ Nouvelle Aquitaine Futuroscope has three strong contenders for the race on Sunday: <strong>Emilia Fahlin</strong>, <strong>Marta Cavalli</strong> and <strong>Cecilie Uttrup Ludwig</strong>. All three have different strengths. Cavalli can get over the climbs and has a solid kick. Fahlin has been getting better and better this season and finished eighth at Brabantse Pijl earlier this week. Uttrup Ludwig is always one to watch when the racing gets tough and is still chasing that elusive first WT victory. Together Cavalli, Uttrup Ludwig, and Fahlin are a force. </p>\n\n\n\n<p>As the G.O.A.T. <strong>Marianne Vos</strong> (Team Jumbo-Visma) is always one to watch. She wasn’t thriving on the climbs of Flanders but the climbs in Limburg are shorter and more suited to Vos.</p>\n\n\n\n<p>Another rider who has been circling a victory this year is <strong>Soraya Paladin</strong> (Liv Racing). Paladin followed Longo Borghini’s move in Gent-Wevelgem and was strong at Trofeo Alfredo Binda. She will be strong on the climbs of Amstel Gold. </p>\n\n\n\n<p>It’s a bummer that Drops-Le Col s/b Tempur will not race Amstel Gold Race because Joscelin Lowden has been consistently improving throughout the spring. With no more cobbles and a more selective race she would have been a fun one to watch on Sunday. </p>\n\n\n\n<h2>The coverage </h2>\n\n\n\n<p>Amstel Gold Race can be seen live on GCN+ and Eurosport from 11:05 local time in Europe and Asia-Pacific. In North America and Australia, FloBikes is the place to go. </p>\n\n\n<p>    </p><div>\n    <div>\n\t<em>This preview will be updated when startlists are finalised. Follow the link for our <a href=\"https://cyclingtips.com/2021/04/preview-your-guide-to-the-2021-mens-amstel-gold-race/\" target=\"_blank\">preview of the 2021 men’s Amstel Gold Race</a>.</em>    </div>\n    </div>\n\t<p></p>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/preview-what-you-need-to-know-ahead-of-the-womens-amstel-gold-race/\">Preview: What you need to know ahead of the women’s Amstel Gold Race</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"dbe54acb3d71c487f64be9b3ac28b88719f6b4d2677ea08407aebbdc03f400aa","category":"Cycling"}