{"title":"Impact of pole dancing on mental wellbeing and sexual self-concept: Protocol for a systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307182","date":1721052000000,"content":"<p>by Xizi Li, Jianyu Shen, Kai Cui, Ying Wang</p>\r\nBackground <p>Despite the recognized psychological benefits of traditional dance forms, the impact of newer forms, such as pole dancing, on mental well-being and sexual self-concept remains underexplored. This protocol outlines a systematic review and meta-analysis aimed at elucidating the effects of pole dancing, a burgeoning non-pharmacological intervention, on these dimensions of mental health.</p> Methods <p>This systematic review was registered in the PROSPERO. We will follow the Preferred Reporting Items for Systematic Reviews and Meta-analysis Protocol to accomplish the systematic review protocol. This review will systematically search electronic databases, including PubMed, Embase, Web of Science, Medline, and CNKI, for randomized controlled trials (RCTs) assessing the impact of pole dancing on mental well-being and sexual self-concept. Two independent evaluators will screen the literature, extract data, and evaluate study quality and bias. Data synthesis will utilize Stata 14.0 and Revman 5.4, employing random-effects models. The Grading of Recommendations, Development, and Evaluation (GRADE) system will appraise evidence reliability, with subgroup analysis exploring heterogeneity sources. Publication bias will be assessed through funnel plots and Egger’s regression tests.</p> Discussion <p>This review aims to fill the gap in the current literature by providing a comprehensive evaluation of pole dancing’s psychological effects. It is anticipated that this systematic review and meta-analysis will offer valuable insights for health policy and practice, advocating for the inclusion of pole dancing in mental health and sexual well-being interventions.</p> Trial registration <p>Systematic review registration: PROSPERO CRD42024529369.</p>","author":"Xizi Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dbe82ccb6e0f124034fdc39e26806cd020e8943167f122773b41b0a4b042a88e","category":"Interdisciplinary"}