{"title":"Image Databases with Features Augmented with Singular Point Shapes for Enhanced Machine Learning","link":"https://www.preprints.org/manuscript/202407.0874/v1","date":1720667641000,"content":"This paper presents a repository of image databases where the image features are augmented with embedded vector field (VF) features to enhance the machine learning (ML) and increase classification statistics. Six VFs are formulated and used for the purpose of embedding. Three of them generate real shaped singular points (SPs): springing, sinking and saddle. The other three VFs generate seven kinds of SPs which include the real shaped SPs and four complex shaped SPs: repealing and attracting (out and in) spirals; clockwise and counterclockwise orbits (center). Also, the paper describes the VF singularities, their shapes, and locations according to the image objects. Then, the present work defines the mappings between the SPs’ shapes if the VFs are separately embedded into the same image. Thus, the paper infers which VFs are most appropriate for embedding into a particular image database such that the augmented SPs shapes enhance the ML classification. Examples of images with different embedded VFs are shown, in the text, to support and validate the theoretical conclusions. The contributions of the paper are: a description of the SPs location in an image; the mappings between the SPs of the different VFs; the definition of an imprint of an image in a VF; the generation of databases’ imprints. The advantage of classifying an image database with embedded VFs is that the new database enhances ML and improves the classification statistics if compared to the classification of the original image database with the same ML classifier. Furthermore, images with embedded SPs create a useful augmentation to the original image databases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dbe8bb1b791f6666a2059ab158fb75b0a3ea373185d48e2ced3d7cab38c564f6","category":"Interdisciplinary"}