{"title":"M3 MacBook Air: Everything you need to know","link":"https://www.macworld.com/article/2000691/13-15-inch-macbook-air-m3-release-date-specs-rumors-html.html","date":1701795132000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple held an <a href=\"https://www.macworld.com/article/1064916/apple-october-event-date-time-mac-ipad.html\">event on October 30</a>, 2023, at which it launched new 14-inch and 16-inch <a href=\"https://www.macworld.com/article/2111544/m3-macbook-pro-release-date-price-specs.html\">MacBook Pro</a> models with M3, M3 Pro and M3 Max chips, and discontinued the 13-inch MacBook Pro. The company also launched an <a href=\"https://www.macworld.com/article/1484743/24-inch-imac-release-date-specs-m2-m3-processor-price.html\">M3 iMac</a>. The MacBook Air was a no-show at that event. </p>\n\n\n\n<p>Now that the M3 chip has launched it is surely only a matter of time until it makes its way into the MacBook Air. But when? Here’s everything you need to know about the next generation MacBook Air, including the latest rumors, speculation based on current information and Apple’s history, and confirmed data.</p>\n\n\n\n<h2>M3 MacBook Air: Release date</h2>\n\n\n\n<p>The M2 MacBook Air launched in July 2022, so it’s already been on the market for over a year. However, Apple introduced the 15-inch MacBook Air with M2 in June 2023. Because that model has only been available for a few months it’s no real surprise that it wasn’t updated at Apple’s October event.  </p>\n\n\n\n<p>Back in July 2023, Bloomberg’s Mark Gurman had reported that Apple could release an update to the 13-inch MacBook Air in at <a href=\"https://www.macworld.com/article/1996129/m3-imac-macbook-air-pro-launch-2023-fall-event.html\">second fall event</a> in 2023. However, he later changed his prediction, suggesting that we could be waiting until the spring or summer of 2024 for a new MacBook Air. </p>\n\n\n\n<p>In an October newsletter, Gurman wrote: “Those waiting for a new MacBook Air will likely need to hold on a bit longer. I’m told that the 13-inch and 15-inch M3 models have just reached the EVT stage, or engineering verification test, which would put them on schedule for between spring and summer of next year at the earliest.” See: <a href=\"https://www.macworld.com/article/2107225/m3-pro-max-macbook-shipping-early-2024.html\">Apple’s M3 Mac roadmap gets clearer.</a></p>\n\n\n\n<p>On this basis, we expect the 13-inch and 15-inch MacBook Air M3 update will happen at a <a href=\"https://www.macworld.com/article/1484151/apple-spring-2023-event-date-time-how-to-watch-rumors.html\">spring event</a> or at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> in June 2024. Apple has already indicated that the Vision Pro will launch in early 2024, so they may appear at the same event. </p>\n\n\n\n<h2>M3 MacBook Air: Price</h2>\n\n\n\n<p>When Apple released the <a href=\"https://www.macworld.com/article/1948603/15-inch-macbook-air-m2-review.html\">M2 15-inch MacBook Air</a> in June 2023, the company reduced the price of the 13-inch model by $100/£100. Apple could use the M3 upgrade as an opportunity to raise the price back to $1,199, but we expect it to remain at the same price, at least in the U.S. </p>\n\n\n\n<p>Apple may reduce prices in the U.K. and other markets outside the U.S. after it raised prices in relation to exchange rate fluctuations at the end of 2022. In September 2023 the company reduced the pricing of iPhones to take into consideration currency fluctuations, and when Apple introduced the MacBook Pro M3-series prices of some models declined in the U.K. while remaining the same in the U.S. </p>\n\n\n\n<p>The M3 13-inch MacBook Air’s price and specifications will likely follow that of the current M2 13-inch MacBook Air or be close. For your reference, here are the prices and specifications of the M2 13-inch MacBook Air standard configurations:</p>\n\n\n\n<ul>\n<li>13-inch, M2 chip with 8-core CPU/8-core GPU, 8GB of memory, 256GB SSD: $1,099/£1,149</li>\n\n\n\n<li>13-inch, M2 chip with 8-core CPU/10-core GPU, 8GB of memory, 512GB SSD: $1,399/£1,449</li>\n\n\n\n<li>15-inch, M2 chip with 8-core CPU/10-core GPU, 8GB of memory, 512GB SSD: $1,299/£1,399</li>\n\n\n\n<li>15-inch, M2 chip with 8-core CPU/10-core GPU, 8GB of memory, 512GB SSD: $1,499/£1,599</li>\n</ul>\n\n\n\n<p>We are hopeful that the U.K. prices will fall back to the equivalent dollar price, so £1,099 and £1,399, for example. </p>\n\n\n\n<p>Apple currently sells the <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">13-inch MacBook Air M1</a> for the same $999/£999 as it cost when it launched in October 2020. It’s likely that Apple will discontinue the M1 MacBook Air while possibly lowering the price of the M2 model to $999 when the M3 model arrives.</p>\n\n\n\n<p>The M3 13-inch and 15-inch MacBook Air will be available through the usual retail outlets: the Apple Store, Amazon, and other popular retailers. You can find the best prices for a new MacBook Air in our <a href=\"https://www.macworld.com/article/673333/best-macbook-air-deals.html\">MacBook Air deals article</a>.</p>\n\n\n\n<h2>M3 MacBook Air: Design</h2>\n\n\n\n<p>When Apple released the M2 13-inch MacBook Air, it also gave it a complete redesign for the first time. It eliminated the tapered design and implemented a traditional look that’s similar to the 14-inch MacBook Pro.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4352514_original.jpg?quality=50&amp;strip=all\" alt=\"Macbook Air M2 in Schwarz aufgeklappt auf einem Tisch\" loading=\"lazy\" /><figcaption><p>An M3 13-inch MacBook Air will have the same design as the current M2 model.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Because this new design has been through only one generation of the Air, we don’t expect Apple to change much with the M3 upgrade. That’s fine because it’s already one of the thinnest and lightest you can buy:</p>\n\n\n\n<ul>\n<li>15-inch MacBook Air M2: 13.40 x 9.35 x 0.45in (34.04 x 23.76 x 1.15cm), 2.8 pounds (1.51kg)</li>\n\n\n\n<li>13-inch MacBook Air M2: 11.97 x 8.46 x 0.44in (30.41 x 21.5 x 1.13cm), 2.7 pounds (1.24kg)</li>\n\n\n\n<li>13-inch MacBook Air M1: 11.97 x 8.36 x 0.16-0.63in (30.41 x 21.24 x 0.41-1.61cm), 2.8 pounds (1.29kg)</li>\n</ul>\n\n\n\n<h2>M3 MacBook Air: Display</h2>\n\n\n\n<p>The M3 MacBook Air will likely use the same display as those on the M2 model. For the 13-inch MacBook Air, Apple uses a 13.6-inch Liquid Retina display with a 2,560-by-1,664 pixel resolution, a maximum brightness of 500 nits, P3 color support, and True Tone, a step up from the ones used in the M1 13-inch MacBook Air and the 13-inch MacBook Pro, which use a 13.3-inch Retina displays with a resolution of 2,560 by 1,600 pixels. The M1 Air’s display brightness is 400 nits, while the 13-inch Pro is at 500 nits. The M3 MacBook Pro now offers 600nits so there is a possibility we could see an improvement along those lines. We don’t expect to see Pro Motion, another feature of the MacBook Pro, on the next MacBook Air. </p>\n\n\n\n<p>Change could be on the way in the form of new mini-LEDs that can be brighter than the current ones, but more importantly, use less battery a the current brightness levels. These are, according to DigiTimes, coming to the 14- and 16-inch MacBook Pro, but it is feasible Apple could use them for the next generation MacBook Air. </p>\n\n\n\n<p>The M3 MacBook Air will likely keep the notch at the top of the display for the 1080p FaceTime camera, which <a href=\"https://www.macworld.com/article/677981/apple-exec-defends-macbook-pros-screen-notch.html\">doesn’t interfere</a> with the 16:10 aspect ratio of the screen area below it. We’d like to see Face ID on the MacBooks, but that’s unlikely to happen in the near future. </p>\n\n\n\n<p>Connecting an external display is done through one of the M3 MacBook Air’s Thunderbolt ports so it is only possible to support one display. The same is true of the M3 MacBook Pro, suggesting it’s a limitation of the M3 chip that the M3 Pro doesn’t share. The laptop can drive one external display with up to 6K resolution at 60Hz. If you need to connect more displays, you can try a <a href=\"https://www.macworld.com/article/675869/how-to-connect-two-or-more-external-displays-to-apple-silicon-m1-macs.html\">workaround that involves third-party hardware and software</a>.</p>\n\n\n\n<h2>M3 MacBook Air: Colors</h2>\n\n\n\n<p>Apple will likely offer the M3 MacBook Air in the same four colors as the M2 model: Midnight, Silver, Space Gray, and Starlight. There have been rumors for years that Apple is planning to launch MacBook Air colors that match the iMac’s colorful enclosure, but they haven’t come to pass. </p>\n\n\n\n<h2>M3 MacBook Air: Specs</h2>\n\n\n\n<p>We know the specs of the M3 chip: there is an 8-core CPU and 8- or 10-core GPU. That sounds similar to the M1 and M2, both of which have eight CPU cores, with the M2 also having a 10-Core GPU option. This new chip might sound similar to its predecessor, but the M3 chip is manufactured using a new 3nm process. This allows for more transistors than compared to the enhanced 5nm process used with the M2. In our tests we’ve already found the M3 to be faster than most iterations of the M1 Pro, showing just how far the chip has come. Read: <a href=\"https://www.macworld.com/article/556384/apple-silicon-iphone-ipad-mac-pro-max-benchmarks.html\">How the M3 stacks up to every other Apple processor.</a> </p>\n\n\n\n<p>The M3 also supports 8-24GB memory. Both the M1 and M2 started with 8GB of unified memory. Like the M3, the M2 is also configurable to 24GB of memory, the M1 maxed out at 16GB. We recommend getting the most memory you can afford as we don’t feel that the standard 8GB is really sufficient. In our experience, even if you’re not using high-end apps, Safari and Photoshop can use several gigs of RAM.</p>\n\n\n\n<p>Although Apple’s VP of worldwide product marketing, <a href=\"https://www.macworld.com/article/2130974/bob-borchers-defends-8gb-ram-macbook-pro-analogous-to-16gb-pc.html\">Bob Borchers has claimed</a> “8GB on an M3 MacBook Pro is probably analogous to 16GB on other systems.” This is because, when it switched to Apple silicon in the Mac, Apple introduced a unified memory system that integrates the RAM into the processor and can quickly allocate it to different parts of the system. </p>\n\n\n\n<p>The MacBook Air does not have any internal fans and we don’t expect that to change. While the fanless design may cause the M2 Air to slow down during CPU or GPU loads, the M3’s higher efficiency could help high-end performance.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4349554_original.jpg?quality=50&amp;strip=all\" alt=\"Neues Macbook Air M2 in Mitternacht mit Magsafe-Kabel auch in Mitternacht\" loading=\"lazy\" /><figcaption><p>The MacBook Air has a MagSafe port that supports fast charging.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The MacBook Air has two Thunderbolt 4/USB-C ports, a MagSafe 3 connector for a power adapter (the laptop can also be charged through Thunderbolt), and a headphone jack. If Apple adds more ports, it’s likely to just be an extra USB-C port.</p>\n\n\n\n<p>The current Air has Wi-Fi 6 wireless connectivity. After Apple brought Wi-Fi 6E to the Mac mini and MacBook Pro, it’s likely to bring it to the next MacBook Air, too.</p>\n\n\n\n<p>Are you hoping to see 5G on a MacBook. It won’t happen this time, but it is coming according to Bloomberg’s Mark Gurman. Read: <a href=\"https://www.macworld.com/article/2146450/5g-cellular-connectivity-mac-modem.html\">If you’re waiting for a 5G MacBook, it’s coming–but not for a while.</a></p>\n\n\n\n<h2>M3 MacBook Air: Battery and charging</h2>\n\n\n\n<p>The M2 13-inch MacBook Air has a 52.6-watt-hour lithium-polymer battery, while the 15-inch model offers a 66.5-watt-hour battery, and the upcoming M3 models will probably have the same size battery.</p>\n\n\n\n<p>Battery life hasn’t changed for the 14-inch and 16-inch M3 MacBook Pro models, so it’s unlikely to change with the M3 MacBook Air. </p>\n\n\n\n<p>Currently, Apple rates its Air battery with “up to 18 hours Apple TV app movie playback, and “up to 15 hours wireless web.” </p>\n\n\n\n<p>For charging, we could see an improvement compared to the current Air. The $1,099/£1,149 M2 13-inch MacBook Air includes a standard 30W USB-C Power Adapter, although the M3 MacBook Pro ships with a 70W USB-C charger, so that could change for the new Air. The $1,399/£1,449 model has a 35W Dual USB-C Port Compact Power Adapter for charging two devices at the same time. A USB-C to MagSafe 3 power cable is included with either model. The 13-inch and 15-inch MacBook Air also support fast charging with a 70W USB-C Power Adapter or another from our list of the <a href=\"https://www.macworld.com/article/819438/best-macbook-usb-c-charger.html\">best MacBook Air chargers</a>.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dbed24c84af2db34183aa848e24bbf857a750e17816383e3309231bd694c9050","category":"Apple"}