{"title":"Sonic hedgehog (shh) gene from Pseudopleuronectes yokohamae (Teleostei: Pleuronectidae): Molecular cloning, characterization, and expression profile during early embryonic, juvenile, and adult stages","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15839?af=R","date":1720161041000,"content":"<h2>Abstract</h2>\n<p>The hedgehog signaling pathway plays an important role in early development and growth of most vertebrates. Sonic hedgehog (<i>shh</i>) gene is a critical regulator of embryonic development in many species, including humans. However, it is not clear what roles <i>shh</i> can play in the development of fish. In this paper, <i>shh</i> gene was cloned from <i>Pseudopleuronectes yokohamae</i>. The full-length complementary DNA (cDNA) of <i>P. yokohamae</i> sonic hedgehog gene (<i>Pyshh</i>) comprises 3194 bp, with a 1317-bp open reading frame (ORF) that encodes a polypeptide of 438 amino acids with a typical HH-signal domain and Hint-N domain. The conserved sequences of the protein among species were predicted by using multiple sequence comparison. The phylogenetic tree construction showed that <i>Py</i>SHH is clustered in a branch of <i>Pleuronectidae</i>. To explore the expression of <i>Pyshh</i> gene in various tissues of <i>P. yokohamae</i>, we used real-time fluorescence quantitative PCR technology to detect it. The results showed that <i>Pyshh</i> gene is widely distributed in various tissues of <i>P. yokohamae</i> juveniles, different tissues of adult males and females, and is particularly expressed in immune organs. The <i>Pyshh</i> gene expression was higher in the muscle and brain of juvenile fish, and higher in bone, gill, and skin of male fish than that of female fish, suggesting that <i>Pyshh</i> might be involved in the formation of immune organs of <i>P. yokohamae.</i> The expression of <i>Pyshh</i> gene significantly upregulated from the gastrula stage to the hatching stage. Western blotting of the expression levels of <i>Py</i>SHH during different embryonic development stages revealed that <i>Py</i>SHH levels increased gradually during development stages from oosperm stage to hatching stage. These results indicate that <i>Pyshh</i> is highly conserved among species and plays a critical role in the complex process of embryonic development. Its precise regulation is essential for the proper formation of many organs and tissues in the body, and disruptions in its function may have serious consequences for the formation of immune organs in fish.</p>","author":"Zheng Zhang, \nJun Luo, \nHui Liu, \nShuai Wang, \nXilin An, \nXuejie Li, \nWei Wang","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"dbed416ac296d55ccda0660d4d419c858aad078255104d04684de7c6ed2ccf6e","category":"Environment"}