{"title":"AirPods Max 2 Launch Next Year: What to Expect (and What to Hope for)","link":"https://www.macrumors.com/2023/11/23/airpods-max-2-launch-next-year-what-to-expect/","date":1700743818000,"content":"AirPods Max are the oldest current-generation AirPods product still in Apple's lineup. It's been almost three years since Apple launched AirPods Max in December 2020, and only recently have we begun hearing rumors about Apple's plans for a new-generation model next year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/AirPods-Max-Gen-2-Feature-Dark-Red-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nAccording to well-connected <em>Bloomberg</em> reporter Mark Gurman, Apple will introduce a new version of the AirPods Max in <a href=\"https://www.macrumors.com/2023/10/29/gurman-usb-c-airpods-max-late-2024/\">late 2024</a>. Here's what we expect from the new version of Apple's premium over-ear headphones, followed by some potential features that we hope to see but are still unconfirmed for AirPods Max 2.\r<br />\n\r<br />\n<h2>2024 AirPods Max: What to Expect</h2>\r<br />\n<h3>USB-C</h3>\r<br />\nAccording to Gurman, Apple will replace the Lightning port found on the current-generation AirPods Max for a USB-C port. This will ensure the headphones comply with European regulations, and will bring consistency across the company's AirPods lineup.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/09/USB-C-Over-Lightning-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThis of course means AirPods Max 2 will come supplied with a USB-C to USB-C charging cable, rather than a Lightning to USB-C cable. Apple will also need to offer a USB-C to 3.5mm audio accessory cable so that users can plug AirPods Max 2 into 3.5mm audio ports.\r<br />\n\r<br />\n<h3>Bluetooth 5.3</h3>\r<br />\nThe Bluetooth 5.3 specification can already be found in the AirPods Pro 2, the iPhone 15 lineup, and the latest Apple Watch models. It is also supported by all Mac models released in 2023. Therefore it's almost inevitable that the second-generation ‌AirPods Max‌ will similarly feature the latest Bluetooth standard. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/airpods-max-lifestyle.jpg\" width=\"980\" height=\"653\" />\r<br />\nBluetooth 5.3 includes enhancements that can improve the reliability of the wireless connection as well as energy efficiency. The specification also includes LE Audio, but Apple does not appear to have implemented support for LE Audio in its devices yet.\r<br />\n\r<br />\n<h3>New Colors</h3>\r<br />\nApple will offer second-generation AirPods Max in fresh colors, according to an <a href=\"https://www.macrumors.com/2023/10/29/gurman-usb-c-airpods-max-late-2024/\">October 2023</a> <em>Bloomberg</em> report. Although what those colors might be is currently unknown.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/AirPods-Max-2022-Colors.jpg\" width=\"2808\" height=\"1579\" />\r<br />\nAirPods Max are currently available in Space Gray, Silver, Green, Sky Blue, and Pink, although interchangeable ear cushions allow for many color combinations. Apple sells standalone ear cushions for $69 per pair.\r<br />\n\r<br />\n<h2>2024 AirPods Max: What to Hope for</h2>\r<br />\nThe latest rumors suggest that no other major changes are expected for the AirPods Max 2, although Apple's plans could always change between now and when they are released in late 2024. Here are the improvements and changes that we hope Apple ultimately includes.\r<br />\n\r<br />\n<h3>H2 Chip\r<br />\nIt would seem reasonable for AirPods Max 2 to feature the H2 chip, Apple's custom silicon chip designed specifically for earbuds and headphones. The H2 chip enables improved computational audio to enhance sound quality on the current-generation ‌AirPods Pro‌ and improves battery life with better energy efficiency. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2019/10/airpods-pro-h2-chip.jpg\" width=\"1600\" height=\"900\" />\r<br />\nDespite the H2 chip's introduction with the AirPods Pro, Gurman's latest report suggests Apple currently does not plan to include the technology in the AirPods Max 2, which would also deprive the headphones of H2-specific features like Adaptive Audio, Personalized Volume, and improved noise cancelation and battery life.\r<br />\n\r<br />\n<h3>U2 Chip and Precision Finding</h3>\r<br />\nApple's U2 Ultra Wideband chip can be found in the latest iPhone 15 series, Apple Watch Series 9 and the Apple Watch Ultra 2, and allows for Precision Finding in the Find My app. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/precision-finding-airtag-design-session.jpeg\" width=\"1800\" height=\"1012\" />\r<br />\nThe current ‌AirPods Max‌ feature basic support for ‌Find My‌, but do not even feature the previous generation U1 chip. For Apple to add a U2 chip to AirPods Max 2 would therefore enable a much more precise way to locate the headphones when they are nearby.\r<br />\n\r<br />\n<h3>Redesigned Smart Case</h3>\r<br />\nWhen Apple unveiled the $549 ‌AirPods Max‌, the included Smart Case stirred up plenty of online chatter for its <a href=\"https://www.macrumors.com/2022/01/23/apple-questionable-design-decisions/\">odd appearance and poor overall protection</a> when compared to the traditional hard cases that come with other premium headphones.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/12/airpods-max-smart-case-video.jpg\" width=\"1600\" height=\"903\" />\r<br />\nApple's much-lampooned case birthed an avalanche of memes, which have irreverently compared it to all sorts of things, from handbags to lingerie, and even body parts. There are no rumors that Apple plans to redesign the case, although one Apple patent describes how a future model could come with a case that offers a <a href=\"https://www.macrumors.com/2022/07/05/apple-patent-airpods-max-case-design/\">more traditional portable housing</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods-Max\">AirPods Max (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/23/airpods-max-2-launch-next-year-what-to-expect/\">AirPods Max 2 Launch Next Year: What to Expect (and What to Hope for)</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airpods-max-2-launch-next-year-what-to-expect-and-what-to-hope-for.2411790/\">Discuss this article</a> in our forums<br /><br /></h3>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dbee7a06cd9295898143c80044c2b07ffadcbdfad23ec260b09732199c29aaed","category":"Apple"}