{"title":"Sexual selection in Thaumatotibia leucotreta (Meyrick) is shaped by contrasting geographic adaptations, but does it matter for area‐wide sex pheromone control tools?","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12898?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d8ea90a6-d32f-4aff-95aa-c16d495bcba5/aab12898-toc-0001-m.png\" alt=\"Sexual selection in Thaumatotibia leucotreta (Meyrick) is shaped by contrasting geographic adaptations, but does it matter for area-wide sex pheromone control tools?\" />\n<p>Geographically isolated populations of <i>Thaumatotibia leucotreta</i> (Meyrick) (Lepidoptera: Tortricidae) occur in South Africa, causing speculations of loss of sexual communication between these isolated populations and compromise the efficiency of sex pheromone tools. Investigations into these speculations were conducted, and results indicate that local adaptation and other selection forces in contrasting environments are important in sexual communication and selection in <i>T. leucotreta</i> but do not necessarily prevent recognition of sexual signals and attraction between geographically isolated populations.\n</p>\n<br />\n<h2>Abstract</h2>\n<p><i>Thaumatotibia leucotreta</i> (Meyrick) (Lepidoptera: Tortricidae) is a quarantine pest for certain export markets due to its phytosanitary status in affected crops in sub-Saharan Africa, including citrus. Consequently, there is a zero-tolerance policy for <i>T. leucotreta</i> in export markets. In South Africa, an integrated pest management strategy, incorporating a systems approach is used to achieve complete control of <i>T. leucotreta</i>. Preharvest management is multi-faceted, including reliance on sex pheromone tools such as monitoring, attract-and-kill, mating disruptions, and sterile insect technique (SIT). Geographically isolated populations of <i>T. leucotreta</i> occur in South Africa, and there is speculation concerning the possible loss of sexual communication between these isolated populations, thereby compromising the efficiency of sex pheromone tools. To investigate this possibility, we collected samples from five geographically isolated populations of <i>T. leucotreta</i> and a population used for SIT in South Africa. These were subjected to sexual attraction trials under choice and no-choice scenarios in a semi-natural environment. Results of the choice tests revealed that males of each population preferred their corresponding population females, except irradiated males. However, when we deprived males of their preferred females, these preferences dissipated, and they were equally attracted to females from all populations. These results indicate that local adaptation and other selection forces in contrasting environments are important in sexual communication and selection in <i>T. leucotreta</i> but do not necessarily prevent recognition of sexual signals and attraction between geographically isolated populations. These findings are crucial for area-wide IPM and precision control of <i>T. leucotreta</i>.</p>","author":"Pascal Aigbedion‐Atalor, \nJennifer Upfold, \nCandice Coombes, \nSean Moore, \nMartin Hill","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"dbefcefb93d5eb50c2c30882ffa0fb8e1425af7bf2e4524e12f19000d9aafe8f","category":"Environment"}