{"title":"PSIII-12 Influence of early gestational heat stress on biomarkers of mammary gland development in replacement gilts genomically selected for thermotolerance or thermosensitivity","link":"https://academic.oup.com/jas/article/102/Supplement_2/331/7664737?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Heat stress (HS) alters physiological and metabolic processes in lactating sows leading to decreased milk production, which is a major factor limiting growth and survivability of piglets. While genomic selection for thermotolerance may be a viable solution to alleviate the negative effects of HS on pig welfare, it may be linked to a reduction in milk production and subsequently, litter growth performance. Therefore, the study objective was to evaluate the effects of genomic selection for thermotolerance and its interaction with early gestational HS on biomarkers of mammary gland development in replacement gilts. We hypothesized that HS exposure as well as genomic selection for thermotolerance would negatively affect mammary epithelial proliferation rate. A total of 36 Landrace (33%) × Large White (67%) crossbred gilts divergently selected for thermotolerance (TOL; n = 18) or thermosensitivity (SEN; n = 18) were balanced by body weight, bred to a single Duroc sire, and then exposed to either thermoneutral (TN; constant 17 to 22°C) or cyclical HS (26 to 36°C) conditions until d 65 of gestation. From d 66 of gestation until farrowing, all pregnant gilts were exposed to TN conditions. Of the 36 total gilts bred, only 28 became pregnant yielding 15 HS gilts (n = 8 SEN and 7 TOL) and 13 TN gilts (n = 7 SEN and 6 TOL). On d 105 of gestation, a mammary biopsy was taken from all gilts, mammary tissue was placed into 10% buffered formalin, and KI67 immunohistochemical staining was performed to identify proliferating mammary epithelial cells (MEC). Proliferating and non-proliferating MEC populations were counted using ImageJ tool. Data were analyzed using PROC GLM in SAS 9.4 with individual gilt as the experimental unit. Overall, early gestational HS decreased (<span>P</span> &lt; 0.01; 16.53 ± 2.12%) the percent of proliferating MEC relative to those kept under TN conditions (26.42 ± 2.39%). However, no effect of genomic line divergence was detected with any comparison (<span>P</span> &gt; 0.05). In conclusion, early gestation HS, but not genomic selection for thermotolerance, had a negative impact on biomarkers of mammary gland development in replacement gilts. These data may suggest that early gestation HS could have a reductive effect on milk production capacity, which may negatively affect litter growth.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"dbf2871cfc595e3fb20ff5d91ee2e897afcbdc02444faf2b9bda72655bd62a89","category":"Environment"}