{"title":"Vaccine mandates work, especially when they’re done right","link":"https://arstechnica.com/?p=1790329","date":1630148832000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/vaccine-mandate-800x534.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/vaccine-mandate.jpeg\">Enlarge</a> (credit: Mario Tama | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><span>On Monday, the</span> US Food and Drug Administration gave <a href=\"https://arstechnica.com/science/2021/08/fda-approves-pfizers-covid-19-vaccine-now-called-comirnaty/\">formal, full approval</a> to the Covid-19 vaccine made by the drug companies Pfizer and BioNTech. You might’ve already gotten a dose of it, of course; millions of Americans have, thanks to an “<a href=\"https://www.fda.gov/media/144416/download\">emergency use authorization</a>” <a href=\"https://www.wired.com/story/the-fdas-green-light-for-a-vaccine-might-tank-ongoing-trials/\">awarded</a> in December 2020. But the new designation was more than just a formality. “If you’re one of the millions of Americans who said they will not get the shot until it has full and final approval from the FDA, it has now happened,” President Joe Biden said when he announced the approval. And, in the same speech: “If you’re a business leader, a non-profit leader, a state or local leader who has been waiting for full FDA approval to require vaccinations, I call on you now to do that—require it.”</p>\n<p>Pretty much right away, a lot of places did. Vaccines are safe, effective, and free, but somewhere around 30 percent of Americans haven’t got their shots. Carrots didn’t work; here come the sticks. And they might be able to crush the fourth wave of the Covid pandemic in the US—if they’re done right.</p>\n<p>Like the other vaccines still available under EUA, the Pfizer drug is extraordinarily good at keeping people from getting really sick or dying from Covid. But with more than 100,000 people in the hospital with Covid in the US—the most since January—and with the vast majority of them unvaccinated, it’s clear that alone isn’t enough. States, localities, and businesses have tried inducements like <a href=\"https://www.wired.com/story/wait-vaccine-lotteries-actually-work/\">prizes, cash, or lotteries</a>, little tricks designed to corral people into doing what’s good for them. In the language of behavioral economics, that’s called a nudge. But in states with low vaccine uptake, those nudges didn’t change the momentum. So now, it’s time for <a href=\"https://www.wired.com/story/the-dam-is-breaking-on-vaccine-mandates/\">mandates</a>. If you’re one of the 30 percent or so of Americans who haven’t gotten vaccinated yet, get ready for a good hard shove.</p></div><p><a href=\"https://arstechnica.com/?p=1790329#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790329&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dbfc458881ce7924142c2bd16ff4c20d4e129e36fa3561c5c268ce0c43e4c9c2","category":"Tech"}