{"title":"Looking for a used EV under $20,000? Here are some ideas","link":"https://arstechnica.com/?p=1787489","date":1629135758000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-597261528-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-597261528.jpg\">Enlarge</a> <span>/</span> What's the cheapest used electric car you'd take a punt on? Let us know in the comments. (credit: Sakkawokkie/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>When you write about cars, you can expect people to ask for your advice on which car they should buy. But when the question is actually \"which <em>used</em> car should I buy,\" many of us go quiet; driving an ever-rotating string of low-mileage new models leaves you unprepared to comment on long-term reliability or the like. Last week, a friend posed an even harder variant, asking for suggestions for a used plug-in electric vehicle. And my default suggestion of a sub-$20,000 BMW i3 wasn't going to cut it.</p>\n<p>As luck would have it, I noticed that Kelley Blue Book—which does keep track of things like long-term reliability and depreciation—just published a list of its best affordable used hybrids and EVs for 2021, with top-10 lists for cars that <a href=\"https://www.kbb.com/best-cars/best-used-hybrid-and-electric-cars-under-15000/\">cost less than $15,000</a> as well as those <a href=\"https://www.kbb.com/best-cars/top-10-best-used-hybrid-and-electric-cars-under-20000/\">under $20,000</a>.</p>\n<p>As you might expect at those price points, the lists are dominated by parallel hybrids like the Toyota Prius. No Teslas, I'm afraid—the cheapest used Model 3 that shows up in a brief search this morning still costs $28,000, and the rest all had prices that started with a three. But some battery EVs do make the KBB's top-10 list.</p></div><p><a href=\"https://arstechnica.com/?p=1787489#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1787489&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dbfcc1d61d1524d3804a370241af1f80c0101ed738f0b0d15a117142adeb63c7","category":"Tech"}