{"title":"Experimental Investigation of Spreading Factor, Payload Length and Collision Effects in LoRaWAN Radio Interface","link":"https://www.preprints.org/manuscript/202408.1408/v1","date":1724148079000,"content":"The number of physical devices connected to the Internet such as vehicles, household appliances and other \"things\" has been steadily increasing in recent years, thus forming the basis for the Internet of Things (IoT). IoT ecosystem extends beyond country borders and application domains, combining thousands of versatile devices that differ in terms of their structures, capabilities, and available resources. It is therefore not surprising that the landscape of wireless communication technologies and the degree of IoT devices available today is excessively broad and diverse. Interference between networks leads to frame collisions and consequent packet loss. Frame collisions occur when two or more packets overlap in time and frequency and use the same Long Range (LoRa) parameters, i.e. the same Spreading Factor (SF), Bandwidth (BW) and Carrier Frequency (CF). When most devices use the same configuration, collision probability is higher. The probability of frame collisions is also affected by traffic characteristics, particularly the periodicity of the transmission and the payload size. Larger payload sizes and more frequent transmissions accumulate with higher Time on Air (ToA) and channel occupancy [1]. Transmission powers and the location of the gateways also influences this situation. The aim of this experimental work is to verify the effects of collisions and interference in Long Range Wide Area Network (LoRaWAN), regarding the periodicity of transmissions and the payload sizes in a context of an inter-SF interference scenario. And to validate measuring tools like Received Signal Strength Indicator (RSSI), ToA and Packet Delivery Ratio (PDR) in the reliability of a network. We validate our conclusions by analyzing ToA according with RSSI and different data sizes, the RSSI for different SFs and different data sizes and finally the packet loss through the PDR for a better understanding of the reliability of packet transmission in our link. In the end we conclude that in an environment with inter-SF interference, the choice of SFs and packet lengths impacts ToA. When dealing with multiple devices near gateways, different SFs and varying packet lengths can lead to increased latency and longer ToA. Consequently, the risk of packet loss becomes more significant, especially if the signal-to-interference ratio (SIR) is low. This limitation will therefore affect scalability, particularly in Non-Line-Of-Sight (NLOS) scenarios.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dc035e488024c33f685c702d58fdef83eaa814615dd71ffd3e61d61845a27fd5","category":"Interdisciplinary"}