{"title":"The Indiana Pi Bill","link":"https://www.mentalfloss.com/article/30214/new-math-time-indiana-tried-change-pi-32","date":1694052048000,"content":"\n<p>Wikipedia:</p>\n\n<blockquote>\n  <p>The Indiana Pi Bill is the popular name for bill #246 of the 1897\nsitting of the Indiana General Assembly, one of the most notorious\nattempts to establish mathematical truth by legislative fiat.\nDespite its name, the main result claimed by the bill is a method\nto square the circle, although it does imply various incorrect\nvalues of the mathematical constant π, the ratio of the\ncircumference of a circle to its diameter. The bill, written by a\nphysician who was an amateur mathematician, never became law due\nto the intervention of Prof. C.A. Waldo of Purdue University, who\nhappened to be present in the legislature on the day it went up\nfor a vote.</p>\n</blockquote>\n\n<p><a href=\"https://web.archive.org/web/20210515024706/http://www.math.purdue.edu/people/bio/egoins/Indiana%20Pi%20Bill.html\">Here’s a good summary</a> (from modern day Purdue professor Edray Goins) of how this kook Edwin Goodwin arrived at π = 3.2.</p>\n\n<p>I was reminded of this laughable legislation<sup>*</sup> by a friend commenting on the <a href=\"https://daringfireball.net/linked/2023/09/06/uk-encryption-win\">U.K. abandoning its foolhardy attempt</a> to mandate the inspection of impossible-to-inspect end-to-end messaging. E2EE communication cannot be “scanned” for child pornography while remaining secure for all other purposes, but it would be nice if it could. Pi is not 3.2 and a circle cannot be squared, but it would nice if it were so. The U.K.’s legislation is every bit as much ignorant wishful thinking as Indiana’s was over a century ago.</p>\n\n<p>That Indiana bill was not defeated, however — it was apparently merely shelved. The U.K., likewise, has not repealed the law granting them the power to effectively ban end-to-end encryption — they’ve merely declared that they will not use it — yet. That’s dangerous. This law should be rescinded, not ignored.</p>\n\n<p><small>* <a href=\"https://www.biodiversitylibrary.org/page/14641808#page/455/mode/1up\">From Waldo’s own account of the saga</a> comes this gem of a quote (written in the third person), regarding an offer to be introduced to Goodwin: “A member then showed the writer a copy of the bill just passed and asked him if he would like an introduction to the learned doctor, its author. He declined the courtesy with thanks remarking that he was acquainted with as many crazy people as he cared to know.”</small></p>\n\n<p>Amen, Dr. Waldo.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/09/06/indiana-pi-bill\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"dc0578d01eff16a7f18ad27a098e495dd85bd29a4c41dd13e07cd2f5a60b5d2b","category":"Tech"}