{"title":"watchOS 8 is here with new fitness features, faces, and more","link":"https://www.macworld.com/article/348209/watchos-8-features-wallet-mindfulness-contacts-portraits-face-compatilibity-release-beta-how-to-install.html","date":1632159805000,"content":"<div>\n<section><div></div></section><p>After beta testing for months, Apple has released the latest watchOS 8 update. Here’s how to get it on your Apple Watch and the new features you should look out for:</p>\n\n\n\n<h2>watchOS 8: How to install</h2>\n\n\n\n<p>To update from your iPhone, you’ll first need to make sure your iPhone is updated to iOS 15 and your Apple Watch is connected to a charger. Then, head over to the Watch app on your iPhone, tap <em>My Watch</em>, then <em>General</em>, and <em>Software Update</em>. Then tap <em>Download and install and follow the prompts</em>. You can also update directly on your Apple Watch as well by going to the Settings app, then <em>General</em> and <em>Software Update</em>.</p>\n\n\n\n<h2>watchOS 8: Compatibility</h2>\n\n\n\n<p>watchOS 8 is available for Apple Watch Series 3 or later paired with an iPhone 6s or later.</p>\n\n\n\n<h2>watchOS 8: How to download the beta</h2>\n\n\n\n<p>Apple might have released watchOS 8, but it’s likely already at work on watchOS 8.1. To get on board with the beta releases, you can join the public beta by heading to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-344220-0-0-0%7Cxid:fr1621460822673ffd%7Cxid:fr1623079190904bjc%7Cxid:fr1623275179892gfh%7Cxid:fr1632159482480gig&amp;sref=https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">beta.apple.com</a> using the iPhone paired to the Apple Watch upon which they want to run the beta, signing in, and downloading the beta profile. You’ll download the profile to the Watch app on your iPhone, and you must then go into the Watch app, tap <em>General</em>, then scroll way down to <em>Profile</em> to enable it. Your watch will have to reset, then you can go to <em>Watch</em> &gt; <em>General</em> &gt; <em>Software Update</em> to download and install the beta.</p>\n\n\n\n<h2>watchOS 8 Features</h2>\n\n\n\n<h3>Keys in Wallet</h3>\n\n\n\n<p>The Wallet app on the Apple Watch is incredibly useful for making payments on the go, but in watchOS 8, it’ll be even more versatile. Apple is adding support for home, office, and hotel keys to Wallet on the Apple Watch, and users in participating U.S. states will also be able to upload their driver’s license or state ID for one less thing to carry.</p>\n\n\n\n<h3>Health and fitness</h3>\n\n\n\n<p>Health and fitness are some of the key components of the Apple Watch, and Apple is continuing the push them in watchOS 8. The Breathe app will now be called Mindfulness, and it add Reflect sessions that help you take some of the stress out of your day.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/watchos-8-mindfulness.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>The Sleep app will now track your respiratory rate and alert you to changes that may be alarming. And Tai Chi and Pilates will join the Workout apps while Fitness+ will welcome fitness coach Jeanette Jenkins and her popular strength and HIIT classes, along with new Artist Spotlight Series workouts.</p>\n\n\n\n<h3>New and redesigned apps</h3>\n\n\n\n<p>Apple has a bunch of new apps coming in watchOS 8, including Contacts, Find Devices, and Find Items, but more exciting is a focus on making the apps we use most often, better. Among the redesigned apps are Home, which offers Intercom support, the ability to control accessories by room, and live video of people at the door, Photos, which has a new mosaic layout and easy sharing via Messages and Mail, and Timer, which now lets you set multiple timers. The Weather app will give you next-hour precipitation notifications and severe weather alerts.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/watchos-8-photos.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<h3>Portraits and World Timer faces</h3>\n\n\n\n<p>A new watchOS release wouldn’t be complete without new watch faces, but this year there’s just one: Portraits. As its name implies, it uses the portrait mode photos on your iPhone “with an immersive, multilayered effect, intelligently recognizing faces in photos and cropping in to highlight the subject” so they’ll pop even more on the small screen. Also new to watchOS 8 will be a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/duraidabdul/status/1402374131895574528?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1402374131895574528%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2F9to5mac.com%2F2021%2F06%2F08%2Fnew-unreleased-world-timer-apple-watch-face-spotted-at-wwdc-21-session%2F&amp;xcust=1-1-348209-1-0-0&amp;sref=https://www.macworld.com/feed\">World Timer face</a>, which lets you see the time on various zones around the world.</p>\n\n\n\n<h3>Smart home improvements</h3>\n\n\n\n<p>The Home app has been totally revamped with a new overview showing status symbols for your most important HomeKit-enabled devices like thermostats, lights, and more. Scenes are suggested based on the time of day. You can see connected cameras, and even have two-way audio conversations on cameras that support it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/watchOS-8-intercom.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The new Home app screen displays important status symbols for your location.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h3>Focus modes</h3>\n\n\n\n<p>WatchOS 8 also supports Apple’s new Focus feature <a href=\"https://www.macworld.com/article/348123/ios-15-features-facetime-notifications-sharing-live-text-compatilibity-release-beta-how-to-install.html\">in iOS 15</a> and macOS Monterey. On the Watch, Focus “will automatically align with any Focus set on iOS, so that notifications from people and apps are filtered based on what a user is currently doing.” It also uses on-device AI to suggest apps and actions based on usage patterns.</p>\n</div>","author":"Macworld Staff","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dc0f007a5f427fea8f397acae73ff22ce90682c0d66e8f72907b0f6a55f0ce65","category":"Apple"}