{"title":"Investigations on Motion Responses of Suspended Submersible in Internal Solitary Wave Field","link":"https://www.preprints.org/manuscript/202403.0558/v1","date":1710144023000,"content":"While the underwater submersible encounters internal solitary wave (ISW), its loadings and motions would be seriously disturbed. To investigate the interaction effect between the suspended submersible and ISW, a three dimensional ISW-submersible interaction numerical model was established based on the Computational Fluid Dynamics (CFD) method. The generation and propagation of ISW was simulated in a two-layer fluid numerical wave tank according to the eKdV theory. The standard operation equation of submersible was introduced to simulate the six degree of freedom (6DoF) motions of submersible combined with the overset dynamic mesh method. The motion simulation method of submersible was effectively validated by comparing with published experimental results on the motion responses of the slender body under the ISW. Based on the constructed numerical model, the dynamic mechanism between the suspended submersible and ISW were studied, and the effects of the initial submerged depths and the ISW amplitudes on the dynamic responses of the submersible were revealed. According to the numerical results, the motions of the submersible have been significantly determined by its initial submerged depths. The submersible located above the ISW interface has a significant motion along the propagation direction of ISW and its motion trajectory resembles a counterclockwise semi ellipse. The motions of the submersible located below the ISW interface follows with the trace of the lower layer fluid which presented as an unclosed clockwise ellipse. The corresponding motions of the submersible would be increased as the increase of the ISW amplitudes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dc1009e5ba3225a07ccb758d6fcb1799699a2a245dc0368e16f8b8eb16e1cbff","category":"Interdisciplinary"}