{"title":"Cholinergic Stimulation Exerts Cardioprotective Effects and Alleviates Renal Inflammatory Responses after Acute Myocardial Infarction in Spontaneous Hypertensive Rats (SHRs)","link":"https://www.preprints.org/manuscript/202403.0653/v1","date":1710230999000,"content":"Background: In this investigation, we explored the effects of pharmacological cholinergic stimulation on cardiac function and renal inflammation following acute myocardial infarction (AMI) in spontaneously hypertensive rats (SHRs). Methods: Adult male SHRs were randomized into three experimental groups: sham-operated; AMI+Veh (infarcted, treated with vehicle); and AMI+PY (infarcted, treated with the cholinesterase inhibitor pyridostigmine bromide (PY) - 40 mg/kg, once daily for seven days). Rats were euthanized 7 or 30 days post-surgery. Clinical parameters were assessed on the day before euthanasia. Subsequent to euthanasia, blood samples were collected and renal tissues were harvested for histological and gene expression analyses aimed to evaluate inflammation and injury. Results: Seven days post-surgery, the AMI+PY group demonstrated improvements in left ventricular diastolic function and autonomic regulation, and a reduction in renal macrophage infiltration compared to the AMI+Veh group. Furthermore, there was a notable downregulation of pro-inflammatory gene expression and an upregulation of anti-inflammatory gene expression. Analysis 30 days post-surgery showed that PY treatment had a sustained positive effect on renal gene expression, correlated with a decrease in biomarkers indicative of subclinical kidney injury. Conclusion: Short-term cholinergic stimulation with PY provides both cardiac and renal protection by mitigating the inflammatory response after AMI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dc1e244e800575de389722924a4d41f1771b42b9464351b974b7ea8e13d02f5b","category":"Interdisciplinary"}