{"title":"Time series modeling of coastal fishery landings on the Southwestern Atlantic shelf: Influence of environmental drivers","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12688?af=R","date":1722470138000,"content":"<h2>Abstract</h2>\n<p>Time-series modeling of fisheries provides insights into stock tendencies and enables short-term forecasting of landings, aiding decision makers in establishing management priorities. The Rio de la Plata Estuary and its maritime front sustain valuable fisheries for Argentina and Uruguay, with striped weakfish (<i>Cynoscion guatucupa</i>), whitemouth croaker (<i>Micropogonias furnieri</i>), and Argentine hake (<i>Merluccius hubbsi</i>) historically representing highest catches. However, their landings have declined in recent decades. To support resource management, we investigated the effectiveness of Autoregressive Integrated Moving Average (ARIMA) models in capturing fishery landing dynamics and providing reliable short-term predictions. The best models exhibited a good fit and accurately captured the overall trends of landings. Residual variability unaccounted for by the model was analyzed in relation to time-lagged environmental conditions. A wavelet coherence analysis was employed to examine the effect of the most significant variables on landings. Results revealed that environmental conditions affect differentially landings of each species as a result of their particular ecological traits. Turbidity and salinity affected mainly <i>M. furnieri</i>, which inhabits the innermost part of the estuary. Additionally, <i>C. guatucupa</i>, inhabiting the outer estuary and coastal region, exhibited a stronger association with river runoff compared to <i>M. hubbsi</i>, which inhabits the continental shelf. This study provides the first evidence of ARIMA models' reliability in representing the temporal evolution of catch in these fisheries, offering valuable tools for short-term landings forecasting and facilitating sustainable management. Wavelet analysis findings will also contribute to enhancing our comprehension of trends in the correlation between environmental conditions and commercial landings.</p>","author":"Jesus C. Compaire, \nE. Marcelo Acha, \nDiego Moreira, \nClaudia G. Simionato","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"dc23bc4e37f0a0d59118cf110e057a6fc5e860d42c3f4ee2dd368b69f03ac9ba","category":"Environment"}