{"title":"Apple Overhauls Support App With Updated Layout and Easier Access to Local Providers","link":"https://www.macrumors.com/2023/05/16/apple-support-app-design-update/","date":1684257679000,"content":"Apple today updated its dedicated Support app that is designed to help Apple product owners get help with their iPhones, Macs, iPads, Apple Watches, and other accessories.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/support-app-updates.jpg\" alt width=\"2000\" height=\"1314\" />\r<br />\nAccording to Apple, the updated version of the app has a new layout to make it easier to view and manage calls, chats, and reservations, along with quicker access to the locations of nearby service providers.\r<br />\n\r<br />\nWhat this means in practice is that Apple has added a navigation bar to the bottom of the app with \"Support,\" \"Locations,\" and \"Activity\" tabs. The Activity tab lists all of the support activity over the past 90 days, such as past and upcoming reservations and calls, while Locations shows you a list of service providers and options to schedule a repair.\r<br />\n\r<br />\nThe main Support tab continues to offer all of the same functionality that it did before, with options to manage subscriptions, check <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a> coverage, and search for device advice.\r<br />\n\r<br />\nIn addition to the layout updates, Apple has also expanded Support app access to Vietnam and added Vietnamese as a supported language, with this change coming following the launch of the <a href=\"https://www.macrumors.com/2023/05/12/apple-online-store-vietnam/\">online Apple Store</a> in Vietnam. Apple says the Apple Support app is available in 174 regions and 32 languages.\r<br />\n\r<br />\nThe Apple Support app is a free app that can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/us/app/-/id1130498044\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-support/\">Apple Support</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/apple-support-app-design-update/\">Apple Overhauls Support App With Updated Layout and Easier Access to Local Providers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-overhauls-support-app-with-updated-layout-and-easier-access-to-local-providers.2389701/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dc2934039c5d9df1d2e30145a02372886c988b0b9f76050d928f4894fe6644ba","category":"Apple"}