{"title":"Comparison of BMD and TBS Scores in Patients with and without Vertebral Fractures and Thyroid Cancer with Long-Term TSH-Suppressed Therapy","link":"https://www.preprints.org/manuscript/202403.1252/v1","date":1711021670000,"content":"Abstract. Introduction: BMD study gives partial information on bone health in patients with TSH suppression therapy due to Differentiated Thyroid Cancer (DTC). TBS, a new parameter of bone microarchitecture is propose for bone quality study. This study analyze their long-term use in patients with DTC. Methods: BMD was measured by DXA and TBS with iNsigth software in 145 postmenopausal DTC patients. Vertebral Fractures (VFs) with a semi-quantitative x-ray method. Results: BMD at the end study was not different from initial. TBS  decreased from 1.35±0.1 to 1.27±0.1 (p=0.002). PTH, Osteocalcin, and BAP were increased, suggesting increased bone remodeling. There was an increase in osteoporosis and osteopenia (40.6% and 16.5% to 46.6% and 18.6%); 31% had partially degraded and 15.1% degraded TBS changed to 48,9% and  24,8% at the end study. VFs in 30 patients, was not different in age, BMI, calcium and alcohol ingestion, smoking, radioiodine, or thyroid parameters vs. without VFs. Odds ratio for VFs increased with osteopenia (OR 2.63). Combination of TBS plus TBS did not improve discrimination. Conclusions: TBS  was lowered while BMD  did not differ. Percentage of osteoporosis and osteopenia  and  of  partially degraded and degraded TBS  was higher at the end study.  Predominant discordance rate was found in partially degraded microarchitecture, in which the proportion of osteopenia was higher than normal or osteoporotic patients. AUC of TBS plus BMD did not improve discrimination. TBS, radioactive iodine, and sedentary lifestyle were the main differential data for patients with DTC and VFs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dc311476deacf38aa64b37598d70334720a2e19b1b2b33b467304bb9c60c04e9","category":"Interdisciplinary"}