{"title":"Apple Did Not Refuse to Testify Before the U.S. Senate","link":"https://www.ped30.com/2021/04/11/apple-cook-klobuchar-refusal/","date":1618193700000,"content":"\n<p>Business Insider (among others) <a href=\"https://www.businessinsider.com/apple-refuse-testify-senate-hearing-april-2021-4\">is reporting</a> that “Apple is reportedly refusing to testify at an upcoming congressional antitrust hearing” because of a testy letter from Senators Amy Klobuchar (D) and Mike Lee (R) that reads:</p>\n\n<blockquote>\n  <p>We write regarding Apple Inc.’s refusal to provide a witness to\ntestify in a timely manner before the Senate Judiciary Committee’s\nSubcommittee on Competition Policy, Antitrust, and Consumer Rights\nat a hearing to examine the competition issues raised by app\nstores. […] We strongly urge Apple to reconsider its position\nand to provide a witness to testify before the Subcommittee in a\ntimely manner.</p>\n</blockquote>\n\n<p>Apple’s response, via Mark Gurman at Bloomberg:</p>\n\n<blockquote>\n  <p>We have deep respect for your role and process on these matters\nand, as we told your staff, we are willing to participate in a\nhearing in the subcommittee. We simply sought alternative dates in\nlight of upcoming matters that have been scheduled for some time\nand that touch on similar issues.</p>\n</blockquote>\n\n<p>Apple is sending Kyle Andeer, the company’s chief compliance officer, to speak at the Senate antitrust hearing on April 21.</p>\n\n<p>Spitball: That week isn’t good for Apple because they’re planning to hold an event. But if the event is pre-filmed, would that preclude Tim Cook from being in Washington? Yes, I think. Even with these quarantine virtual announcement events, it’s still all hands on deck in Cupertino — just in case. And what if they’re filming it next week — a week he’d need to spend preparing for Senate testimony if he were testifying April 21? Cook needs to be ready, for example, to re-film his opening to address any sort of breaking news — something like a natural (or unnatural) disaster. Even though they’re filmed in advanced, these virtual events are meant to <em>feel</em> live.</p>\n\n<p><strong>Update:</strong> Spitball 2: There’s also <a href=\"https://en.wikipedia.org/wiki/Epic_Games_v._Apple\">Epic-v.-Apple</a>, which goes to trial May 3. That would certainly qualify as “upcoming matters that have been scheduled for some time and that touch on similar issues.”</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/11/apple-testify-senate\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"dc46add70af7d03aac0b9db9ff6d9c02bb2d154e58790b36cb48c3c977e6310c","category":"Tech"}