{"title":"Post-harvest regeneration is driven by ecological factors rather than wood procurement intensity in eastern Canadian forests","link":"https://academic.oup.com/forestry/article/97/5/663/7630115?rss=1","date":1710460800000,"content":"<span><div>Abstract</div>Biomass from surplus forest growth that is not harvested for wood supply of conventional industries can be an important source of feedstock for bioenergy. Its procurement can be integrated with little effort into current harvest operations. However, the increasing harvesting intensity to meet greater demand for biomass procurement can impact forest ecosystem functions because of its direct and indirect effects on woody debris and the regeneration of next-rotation stands. In this context, we aimed to determine the relationships between wood procurement intensity, woody debris inputs, and regeneration success over 2 years after harvesting. We tested four treatments of increasing wood procurement intensity using a randomized block design within six experimental sites along a gradient of varying forest characteristics of boreal and temperate forests. We assessed stand characteristics in terms of standing trees, woody debris, and regeneration pre- and post-harvest. We used mixed effects models to evaluate (i) the effects of wood procurement intensity and pre-harvest stand characteristics on the volume and cover of woody debris and (ii) the specific influence of woody debris on the presence of suitable planting microsites post-harvest. Furthermore, we used principal component regressions to explore the relationships between harvesting intensity and the presence of natural regeneration and competing vegetation as a function of pre- and post-harvest stand characteristics (iii). Our results showed that increasing wood procurement intensity reduced the volume of post-harvest woody debris while having a limited effect on regeneration. Increasing harvesting intensity had a negligible effect on suitable planting microsites in hardwood-dominated stands but it increased their presence in conifer-dominated stands. Natural regeneration and competing vegetation were mainly related to stand characteristics, and only broadleaf regeneration was sensitive to harvest intensity. We conclude that the relationships between wood procurement intensity and regeneration are complex and rely mainly on stand characteristics rather than wood procurement needs.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"dc55200c255ac89350914a4ed1a4e0fc5d72bfa21e5ebe2b8f81032ccdfbaff2","category":"Environment"}