{"title":"Effect of a Phytochemical-Rich Olive Derived Extract on Anthropometric, Hematological and Metabolic Parameters","link":"https://www.preprints.org/manuscript/202408.0102/v1","date":1722781434000,"content":"Background: Extra virgin olive oil is a fundamental component of the Mediterranean diet. It contains several molecules that sustain human well-being by modulating cellular metabolism and exerting antioxidant, anti-inflammatory, anti-ageing effects to protect normal tissues and can exert anti-angiogenic, and pro-apoptotic effects on cancer cells. Metabolites found in different parts of the olive tree, including leaves, also possess properties that might help in cancer prevention and promote wellness in aging. Olive mill wastewater (OMWW), a liquid residue produced during olive oil extraction, represents an environmental issue. However, it is enriched in phytochemicals with potential beneficial properties. Dietary supplements based on OMWW can be produced for nutritional supplementation with advantages to the ecology. Purpose: This work aims to measure hematochemical, anthropometric and metabolomic parameters in volunteers assuming an OMWW dietary supplement, OliphenoliaⓇ (OMWW-OL). Methods: The supplementation of OMWW-OL 25 mL twice daily for 30 days was tested on a pilot cohort of volunteers with characteristics close to metabolic syndrome. Hematochemical, anthropometric, and metabolomic parameters were analyzed before the intervention, at 30 days and 30 days after stopping consumption. Results: 29 volunteers were enrolled and 23 completed the study. The participants’ parameters at baseline were measured, and then twice daily at 30 days of treatment and 30 days after assumption discontinuation. Although treatment was with an olive derivative, weight and body mass index instead of increasing slightly decreased, particularly in women. Also, hydration increased, especially in women, while blood pressure, glycemia and insulin decreased. Cholesterol, low-density and high-density lipoproteins and triglycerides were stable while vitamin D levels, alongside calcium, sensibly increased. Albumin also increased and parameters related to sarcopenia displayed promising, although not statistically significant, trends toward positive effects. All the values were in support of an equilibrium with no damaging effects. By mass spectrometry analysis, we also found favorable changes in the vitamin D/histamine and homocysteine/methionine ratios, an increase in a new metabolite of unknown formula, and vitamin D/unknown metabolite ratio. Conclusions: Supplementation of OMWW-OL has no detrimental effects and, although with limited potency of a pilot study, might imply the beneficial modulation of several biological parameters, being potentially valuable for people at risk of metabolic syndrome. Some of these parameters could also be relevant as anti-ageing and in cancer prevention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dc66f9fee61576352881585295c63a7e39c9baf83fa2b12d5e62d1e50b7357a6","category":"Interdisciplinary"}