{"title":"Predicting key ectotherm population mortality in response to dynamic marine heatwaves: A Bayesian‐enhanced thermal tolerance landscape approach","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14620?af=R","date":1721545200000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b44d0209-6149-4b33-9db3-660377b193bb/fec14620-toc-0001-m.png\" alt=\"Predicting key ectotherm population mortality in response to dynamic marine heatwaves: A Bayesian-enhanced thermal tolerance landscape approach\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/11/predicting-key-ectotherm-population-mortality-in-response-to-dynamic-marine-heatwaves-a-bayesian-enhanced-thermal-tolerance-landscape-approach/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAs climate change intensifies heatwaves, quantifying associated mortality within ectothermic populations is crucial for effective conservation. Thermal tolerance landscape (TTL) models are useful predictive tools that assume exponentially decreasing survival durations in individuals with increasing temperatures. This assumption has been validated through regression analyses on data from constant temperature experiments, primarily focusing on adult-stage individuals. However, this approach does not allow for direct model validation with data from dynamic, real-world heatwave events and overlooks early recruitment stage vulnerabilities.\n\nThis study aimed to address these gaps using the blue mussel <i>Mytilus</i>, a foundation species forming extensive reefs along temperate coasts, as a model organism. We monitored survival rates of mussels (juveniles and adults) under constant heatwave (CHW) conditions in a laboratory experiment and under dynamic heatwave (DHW) scenarios simulated in an outdoor mesocosm experiment. Post-heatwaves, we also assessed recruitment rates within the mesocosms. TTL models were parametrised by employing Approximate Bayesian Computation with Sequential Monte Carlo (ABC-SMC) on each dataset separately.\n\nThe parameter distributions were similar across both experiments, and the ABC-SMC model predictions closely matched the observed survival declines, validating these models. In comparison, we found a lower predictive performance when using a Bayesian regression approach. Additionally, our best-fit model predicted that warming across the non-fatal DHW regimes would increase sublethal effects on mussels. The observed impact on the recruitment stage was more pronounced, with the recruitment rate following an exponential decay as sublethal effects increased. Our model projected minor (&lt;4%) sublethal effects in adult mussels during the century's five warmest summer temperature regimes, corresponding to 0%–32% declines in recruitment rates.\n\nOur research extends the TTL model validation, demonstrates the resilience of subtidal Baltic <i>Mytilus</i> to future extreme heatwaves and offers an approach to predict heatwave-induced population mortalities, applicable to other species and sensitive systems.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/11/predicting-key-ectotherm-population-mortality-in-response-to-dynamic-marine-heatwaves-a-bayesian-enhanced-thermal-tolerance-landscape-approach/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Jahangir Vajedsamiei, \nNiklas Warlo, \nH. E. Markus Meier, \nFrank Melzner","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"dc67afba6125d28b9f01ab8f14fe5a6219817d30f9b25977f286c0840451f497","category":"Environment"}