{"title":"Ads are coming for the Bing AI chatbot, as they come for all Microsoft products","link":"https://arstechnica.com/?p=1927881","date":1680279034000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing-800x387.jpeg\" alt=\"Ads are coming for the Bing AI chatbot, as they come for all Microsoft products\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing.jpeg\">Enlarge</a> (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Microsoft has spent a lot of time and energy over the last few months adding generative AI features to all its products, particularly its long-standing, long-struggling Bing search engine. And now the company is working on fusing this fast-moving, <a href=\"https://arstechnica.com/information-technology/2023/02/ai-powered-bing-chat-loses-its-mind-when-fed-ars-technica-article/\">sometimes unsettling</a> new technology with some old headaches: ads.</p>\n\n<p>In <a href=\"https://blogs.bing.com/search/march_2023/Driving-more-traffic-and-value-to-publishers-from-the-new-Bing\">a blog post earlier this week</a>, Microsoft VP Yusuf Mehdi said the company was \"exploring placing ads in the chat experience,\" one of several things the company is doing \"to share the ad revenue with partners whose content contributed to the chat response.\" The company is also looking into ways to let Bing Chat show sources for its work, sort of like the ways Google, Bing, and other search engines display a source link below snippets of information they think might answer the question you asked.</p>\n<div><img alt=\"One of Microsoft's experimental formats for highlighting information sources in Bing Chat. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing-chat-sources.png\" /><p>One of Microsoft's experimental formats for highlighting information sources in Bing Chat.  (credit: Microsoft)</p></div>\n<p>Sharing ad revenue with partners is an attempt to address a looming supply-and-demand problem for AI chatbots that dig through the Internet to find answers to user queries—someone needs to be making the content that Bing Chat uses to formulate its answers. If AI chatbots make content creation less lucrative, there's less information out there for AI chatbots to sift through, making it even harder for them to do what they're trying to do.</p></div><p><a href=\"https://arstechnica.com/?p=1927881#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927881&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dc766a1987485fb1970f84cc67a8f9293669c8555809343c75335aa045380f5c","category":"Tech"}