{"title":"Black hole is soaring between galaxies, leaving stars in its wake","link":"https://arstechnica.com/?p=1930219","date":1681038935000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1-800x450.png\" alt=\"image of a colored disk on a dark background, with a trail of small bright objects behind it.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1.png\">Enlarge</a> <span>/</span> Artist's impression of a supermassive black hole trailing galaxies behind it. (credit: <a href=\"https://hubblesite.org/contents/media/images/2023/010/01GWSDE2CV0KNBMMDW4X8R9REZ?news=true\">NASA, ESA, Leah Hustak</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If you saw a similar streak in one of your photos, you'd probably take a few moments to clean off the lens. But the streak, in this case, was in an image taken by the Hubble Space Telescope, which is not affected by the schmutz that daily life leaves on Earth-bound hardware. So, a team of researchers decided to figure out what the long, thin smear might represent.</p>\n<p>They're still not certain, but the best explanation appears to be the wake left behind by a supermassive black hole that's been shot free of the galaxy that used to host it. Its liberation likely resulted from two additional supermassive black holes, all brought together by a merger of galaxies. If this is right, it'll be the first instance of this behavior we've ever seen.</p>\n<h2>What is that?</h2>\n<p>Back in the days of film cameras, when it was sometimes possible to go months or even years between taking a photo and getting it developed, it wasn't unusual to pick up your newly developed snapshots and find yourself wondering what it was you had taken a picture of. You can almost hear echoes of those days in astronomers' description of seeing the smear across one of Hubble's images: \"an almost-straight, thin streak was readily apparent in a visual assessment of the data quality.\"</p></div><p><a href=\"https://arstechnica.com/?p=1930219#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930219&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dc7c08b84f393361e2267ff7db1e99b055c65639cb7d682794d21304d1ec9fe5","category":"Tech"}