{"title":"Netflix ยกเลิกแพ็คเกจสมาชิกพื้นฐาน (Basic) ทดลองที่แคนาดาประเทศแรก","link":"https://www.blognone.com/node/134545","date":1687794502000,"content":"<div><div><div><p>ย้ำก่อนว่าเรื่องนี้(ยัง)ไม่เกิดที่ประเทศไทย โดย Netflix เฉพาะในประเทศแคนาดา ได้ประกาศ<a href=\"https://help.netflix.com/en/node/24926/ca\">ยกเลิก</a>ตัวเลือกแพ็คเกจสมาชิกแบบพื้นฐาน (Basic) มีผลสำหรับผู้สมัครสมาชิกใหม่เท่านั้น แต่ลูกค้าที่อยู่ในแผนใช้งานนี้อยู่แล้ว ยังสามารถใช้แผนเดิมต่อไปได้จนกว่าจะยกเลิก หรือสลับแผน ก็จะไม่สามารถใช้แผน Basic นี้ได้อีก</p>\n<p>แคนาดาเป็นหนึ่งในประเทศที่ Netflix ใช้ทดสอบรูปแบบบริการใหม่ ๆ โดยก่อนหน้านี้ก็เป็น<a href=\"https://www.blognone.com/node/132560\">หนึ่งในประเทศนำร่องระบบป้องกันการหารบัญชี</a> ที่ต่อมาขยายมาใช้อีกหลายประเทศรวมทั้งประเทศไทย</p>\n<p>ในแคนาดา แพ็คเกจแบบ Basic มีราคา 9.99 ดอลลาร์แคนาดาต่อเดือน รองรับ 1 อุปกรณ์ ภาพแบบ HD การยกเลิกนี้ทำให้เหลือแพ็คเกจ 3 รูปแบบคือ Standard, Premium และแบบราคาถูกที่สุด Standard แบบมีโฆษณา 5.99 ดอลลาร์แคนาดาต่อเดือน จึงอาจมองได้ว่า Netflix พยายามผลักให้ลูกค้าไปใช้ Standard แบบมีโฆษณาแทน แลกกับการจ่ายน้อยลง หรือไม่อย่างนั้นก็ต้องจ่ายแพงขึ้นมาเลย</p>\n<p>สำหรับประเทศไทย แพ็คเกจมี 4 รูปแบบ คือ Basic, Standard, Premium และแพ็คเกจราคาถูกที่สุด Mobile ที่ให้ดูได้ผ่านมือถือเท่านั้น ซึ่งเป็นแพ็คเกจที่ Netflix มีเป็นตัวเลือกสำหรับหลายประเทศในเอเชีย</p>\n<p>ที่มา: <a href=\"https://www.engadget.com/netflix-is-removing-its-basic-plan-in-canada-092535002.html\">Engadget</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cbf92b7524f53c83f2e5c0b41ac15e8f.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div><div><a href=\"/topics/canada\">Canada</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"dc7e5f8ca58c76640e6b455d03c53d7be326e98a9d973dbd5f35990b1531c74f","category":"Thai"}