{"title":"Barriers and facilitators of early postpartum modern contraceptive method uptake in Dessie and Kombolcha City zones, northeast Ethiopia: Conventional content analysis qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305971","date":1721224800000,"content":"<p>by Niguss Cherie, Muluemebet Abera Wordofa, Gurmesa Tura Debelew</p>\r\nBackground <p>Despite progress in access to family planning services in many sub-Saharan African countries in recent decades, advances in effective early postpartum contraceptive adoption remain low, and the unmet need for early postpartum contraceptives is high. In Ethiopia, early postpartum modern contraceptive method uptake is still unacceptably low. The barriers/challenges have not yet been sufficiently explored. A deep and detailed understanding of the contextualized barriers and challenges in the adoption of early postpartum contraceptive methods is crucial in developing future locally-appropriate interventions.</p> Objectives <p>This study aimed to explore barriers/challenges to the uptake of early postpartum modern contraceptive methods after childbirth in Dessie and Kombolcha zones, in northeast Ethiopia.</p> Methods <p>Aconventional content analysis qualitative study was deployed in Dessie and Kombolcha town zones, northeast Ethiopia using a theoretical purposive sampling technique. A total of 57 study subjects were participated. The sample size was determined using the rule of information saturation through 7 key informant interviews, 6 in-depth interviews, and 5 focused-group discussions with 8–10 participants each. Data were collected using an unstructured interview guide and recorded using a digital audio recorder and field notes. The trustworthiness of the study was assured using different techniques. The collected data were transcribed and translated from native language to English. Atlas-ti version7 software was used to facilitate conventional content qualitative data analysis approach. Open coding, categories, subthemes, and overreaching themes were developed, and a conceptual model of barriers was organized through network analysis.</p> Result <p>Barriers to uptake of early postpartum modern contraception quoted by study participants and themed were related knowledge, attitude, family-community, health facility, contraceptive method, cultural, religious, fertility desire, gender issues, and misconceptions. The sub-themes of knowledge-related barriers that emerged were lack of awareness of the time to take birth control methods, not knowing the time pregnancy is likely after childbirth, and not being committed to taking contraceptives early enough after childbirth. Moreover, beliefs that modern contraceptives cause breast milk to dry up and perceived low fecundability after childbirth were indicated as attitude barriers. Health facility barriers were lack of reminders and follow-up mechanisms, sporadic service delivery and opening time, long waiting time, and card withdrawal process and providers’ approach. Social stigma, child sex preference, and religious restrictions against contraceptive use were community barriers.</p> Conclusion <p>Generally individual, facility-based, method-related, misconceptions, societal, and cultural barriers were identified as hindrances to the uptake of early postpartum modern contraceptive methods. There is a need for health-seeking behavioral interventions, innovative contraceptive methods, and facility-level interventions to overcome each identified barrier.</p>","author":"Niguss Cherie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dc83197fb6eb3f4c3b504dde50ac77cb2cc6277f0c089f9b7c961f9169b1a093","category":"Interdisciplinary"}