{"title":"Tree and mycorrhizal fungal diversity drive intraspecific and intraindividual trait variation in temperate forests: Evidence from a tree diversity experiment","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14549?af=R","date":1715144986000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/0b7b5ad5-e1a0-4100-968e-d1b7ac9d542f/fec14549-toc-0001-m.png\" alt=\"Tree and mycorrhizal fungal diversity drive intraspecific and intraindividual trait variation in temperate forests: Evidence from a tree diversity experiment\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/how-do-trees-adjust-their-leaves-in-response-to-tree-and-mycorrhiza-diversity/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe study of tree species coexistence is crucial to understand the assembly of forest communities. In this context, trees adjust their traits in response to the interactions with other trees and, specifically, as a result of the competition for resources. Further, mycorrhizal fungal diversity and associations are important drivers of ecosystem functioning in forests, but their role as drivers of intraspecific trait variation has been disregarded. Here, we studied intraspecific trait variation of trees in response to tree and mycorrhizal fungal diversity.\n\nWe sampled 3200 leaves from 640 trees belonging to 10 native, deciduous species in a tree diversity experiment in Central Germany. This experiment relies on the combination of gradients of tree richness and mycorrhizal associations. To handle large amounts of leaf samples, we acquired leaf-level spectral data and used deep learning to predict values for five leaf traits from the leaf economics spectrum (LES): specific leaf area, leaf dry matter content, carbon to nitrogen ratio, carbon content and phosphorus content. For every tree, we calculated the mean value for every trait and two multi-trait functional indices (functional richness and functional dispersion) based on values for individual leaves. Finally, we used sequencing-based data to assess the richness of mycorrhizal fungi associated with the trees.\n\nWe found that tree and mycorrhizal fungi richness had an effect on different leaf functional traits. Specifically, tree richness positively affected specific leaf area and, additionally, had a negative effect on the functional indicies, which revealed that the phenotypic diversity within the tree crown decreased with tree species richness. In addition, leaf carbon to nitrogen ratio decreased with increasing arbuscular mycorrhizal fungal richness in both arbuscular and ectomycorrhizal tree species. Finally, we did not find differences between arbuscular and ectomycorrhizal trees regarding their location within the LES.\n\nOur results suggest that trees modify their strategy in response to local tree diversity, not only by shifting trait values but also by shifting the variability intraindividually. In addition, higher mycorrhizal fungal diversity does not seem to lead to higher complementarity, but instead, tree and mycorrhizal fungi affect different aspects of leaf traits.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/how-do-trees-adjust-their-leaves-in-response-to-tree-and-mycorrhiza-diversity/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nEl estudio de la coexistencia entre especies es esencial para entender el ensamblaje de las comunidades forestales. En este contexto, lo árboles ajustan sus rasgos en respuesta a la interacción con otros árboles y, en concreto, como resultado de la competencia por recursos. Además, la diversidad de hongos micorrícicos y las asociaciones con estos también son factores importantes en el funcionamiento de los bosques, aunque su papel es ampliamente desconocido. En este trabajo hemos estudiado la variación intraespecífica de árboles en respuesta a la diversidad de árboles y hongos micorrícicos.\n\nMuestreamos 3.200 hojas en 640 individuos de 10 especies caducifolias en un experimento de diversidad de árboles en el centro de Alemania. Este experimento combina gradientes de riqueza de árboles con distintas combinaciones de asociaciones de micorrizas. Con el objetivo de procesar una gran cantidad de muestras de hojas, utilizamos espectroscopía y técnicas de ´deep learning´ para predecir los valores de cinco rasgos funcionales del espectro económico de la hoja: el área foliar específica, el contenido en materia seca de la hoja, la ratio entre carbono y nitrógeno, el contenido de carbono y el contenido de fósforo. Para cada árbol y a partir de los datos de hojas individuales, calculamos el valour medio para cada rasgo y dos índices funcionales (riqueza funcional y dispersión funcional). Por último, utilizamos datos de secuenciación para determinar la riqueza de hongos micorrícicos asociada a los árboles.\n\nNuestros resultados indican que la diversidad de árboles y hongos micorrícicos afectan a distintos rasgos funcionales. En concreto, la diversidad de árboles afecta positivamente al área foliar específica y, además, tiene un efecto negativo en los índices funcionales, lo que indica que la diversidad fenotípica dentro de la copa del árbol (la diversidad intraindividuo) disminuye con la diversidad de especies arbóreas. Además, la ratio entre carbono y nitrógeno de la hoja disminuye con la diversidad de hongos micorrícicos arbusculares tanto en especies de árboles arbusculares como en especies ectomicorrícicas. Por último, no encontramos diferencias entre árboles arbúsculares y ectomicorrícocos en cuanto a su posición en el espectro económico de la hoja.\n\nNuestros resultados indican que los árboles modifican su estrategia en respuesta a la diversidad de árboles, no sólo mediante cambios en los valores de los rasgos funcionales, pero también con cambios en la diversidad intraindividuo. Además, una mayor diversidad de hongos micorrícicos no siempre conlleva mayor complementariedad, sino que, en lugar de ello, los árboles y los hongos micorrícicos afectan a distintos aspectos de la variación de la hoja.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nDie Untersuchung der Koexistenz von Baumarten ist von entscheidender Bedeutung, um die Zusammensetzung von Waldgemeinschaften zu verstehen. In diesem Zusammenhang passen Bäume ihre Eigenschaften als Reaktion auf die Interaktionen mit anderen Bäumen und insbesondere aufgrund der Konkurrenz um Ressourcen an. Darüber hinaus sind die Vielfalt und Assoziationen von Mykorrhiza-Pilzen ebenfalls wichtige Faktoren für das Funktionieren von Waldökosystemen, ihre Rolle als Treiber für intraspezifische Merkmalsvariation wurde jedoch bislang selten untersucht. In unserer Studie haben wir die intraspezifische Merkmalsvariation von Bäumen als Reaktion auf die Baum- und Mykorrhiza-Pilzvielfalt analysiert.\n\nIn einem Baumdiversitätsexperiment in Mitteldeutschland haben wir 3.200 Blätter von 640 Bäumen von 10 einheimischen Laubbaumarten untersucht. Das Diversitätsexperiment basiert auf der Kombination von Gradienten der Baumartenzahl und Mykorrhiza-Assoziationen. Um große Mengen an Blattproben zu verarbeiten, haben wir Spektraldaten auf Blattebene erfasst und mithilfe von Deep Learning Werte für fünf Blattmerkmale aus dem Spektrum der Blattökonomie (leaf economics spectrum‘) vorhergesagt: spezifische Blattfläche, Blatttrockenmassegehalt, Kohlenstoff-Stickstoff-Verhältnis, Kohlenstoff- und Phosphorgehalt. Für jeden Baum haben wir den Mittelwert für jedes Merkmal sowie für alle Merkmale gemeinsam zwei Indizes für funktionelle Diversität basierend auf den Werten der einzelnen Blätter berechnet (‚functional richness‘und ‚functional dispersion‘zur Quantifizierung der Größe des Merkmalsraums und der Verteilung der einzelnen Werte darin). Zuletzt verwendeten wir sequenzierungsbasierte Daten, um die Vielfalt der mit den Bäumen assoziierten Mykorrhizapilze zu beurteilen.\n\nWir fanden heraus, dass der Reichtum an Baumarten und Mykorrhizapilzen einen Einfluss auf verschiedene funktionelle Blattmerkmale hatte. Insbesondere wirkte sich der Baumartenreichtum positiv auf die spezifische Blattfläche und negativ auf die beiden Indizes für funktionelle Vielfalt aus, was zeigte, dass die phänotypische Diversität innerhalb der Baumkrone (intraindividuelle Diversität) mit dem Baumartenreichtum abnahm. Darüber hinaus nahm das Kohlenstoff-Stickstoff-Verhältnis der Blätter mit zunehmendem arbuskulären Mykorrhizapilzreichtum sowohl bei arbuskulären als auch bei Ektomykorrhiza-Baumarten ab. Wir fanden keine Unterschiede zwischen arbuskulären und Ektomykorrhizabäumen hinsichtlich ihrer Lage innerhalb des Spektrums der Blattökonomie.\n\nUnsere Ergebnisse legen nahe, dass Bäume ihre Strategie als Reaktion auf die lokale Baumvielfalt ändern, nicht nur durch Verschiebung der Merkmalswerte, sondern auch durch intraindividuelle Veränderung der Variabilität. Darüber hinaus scheint eine höhere Diversität der Mykorrhiza-Pilze nicht zu einer höheren Komplementarität zu führen, sondern Baum- und Mykorrhiza-Pilze beeinflussen stattdessen unterschiedliche Aspekte der Blattmerkmalsvariation.\n</p>","author":"Pablo Castro Sánchez‐Bermejo, \nTilo Monjau, \nKezia Goldmann, \nOlga Ferlian, \nNico Eisenhauer, \nHelge Bruelheide, \nZeqing Ma, \nSylvia Haider","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"dc8a74606acc4b0e6e2f2d1c7bbbc723a0ea334bf9d2c7e7222cd5348b96ae66","category":"Environment"}