{"title":"Trends in research on cacti: the food of the future","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13306?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<p>Cacti are a distinguished group of plants that stand out for their great nutritional values, diverse uses, and unique morphology, allowing them to grow and thrive under different conditions such as dry, xeric, and even low-temperature environments. The world is going through significant climate changes that are affecting the agriculture system. Therefore, sustainable and multifunctional crops, as many species of the Cactaceae family are, might be a good alternative in the near future. In this work, the uses of cacti in human food were analyzed through a scientific prospection from the point of view of their temporal and spatial distribution and potential uses. Brazil is the country with more publications related to the scope of this work, followed by Mexico. The presence of cacti in these countries can influence their interest in these species, which might reflect the results encountered in this study. The uses and ethnobotanical applications of cacti vary in different countries worldwide. Cactus is consumed fresh (in salads), in preparations (jams and sweets), and juices, being also present in traditional dishes in countries like Mexico. This study emphasizes cacti's importance in people's diets and ongoing world changes. Their ability to thrive even in hot environments with low water resources will lead to a greater focus on these species in the upcoming years. Furthermore, these plants have great flavor and contain several beneficial chemical compounds with desirable nutritional and health properties. Therefore, knowledge dissemination combined with technological innovations will allow greater use of these multifunctional species for human consumption. © 2024 Society of Chemical Industry.</p>","author":"Júlia Matos Coqueiro, \nLyvia Daim Costa, \nLarissa Correia e Silva, \nLuísa dos Santos Conceição, \nPatrick da Silva Cardoso, \nCamila Duarte Ferreira Ribeiro, \nDeborah Murowaniecki Otero","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"dc97dd164b43a5530d292e94b0597fbafd02d9ec2bfcebe22e9fc64ea0b42285","category":"Environment"}