{"title":"How to make your bike more comfortable","link":"https://www.bikeradar.com/advice/sizing-and-fit/make-bike-more-comfortable/","date":1696438800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/O5A8110-Edit-68015db.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Ribble Hybrid AL Leisure Fully Loaded Edition\" title=\"Ribble Hybrid AL Leisure Fully Loaded Edition\" />                                            <p>Riding your bike is a wonderful thing, but discomfort as a result of a sub-par bike fit or setup will totally undermine your enjoyment.</p>\n<p>However, consider reading this guide before you put your bike on eBay and head off to the shop to try to find a more comfortable model.</p>\n<p>There’s a lot you can do to make your current bike more comfortable to ride, from tweaking your body position to careful component selection.</p>\n<p>One change might be all that is needed, or perhaps a few combined will do the trick. However complex the problem, this guide should help you recognise and address the issue(s), and pave the way toward more comfortable, more enjoyable and faster cycling.</p>\n<h2>Get your position dialled</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jack Evans riding Endurace CFR eTap with hands on the hoods\" title=\"AM9A9157-Enhanced-NR\" />\n\n</div><div><figcaption><span><i></i> A good bike position should allow you to ride for hours on end without discomfort.</span></figcaption><span> <i>Scott Windsor/Our Media</i></span></div>\n<p>The first port of call for a comfortable ride is to make sure that your position is right for you.</p>\n<p>‘Position’ or ‘fit’ describes how you sit on the bike.</p>\n<p>We have a detailed piece on how to set your <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-position/\">road bike position</a> and another for <a href=\"https://www.bikeradar.com/features/4-simple-steps-to-set-up-your-mountain-bike/\">mountain bike setup</a>.</p>\n<p>Key points are that you want your legs to be fairly extended at the bottom of the pedal stroke, without your hips rocking, so getting your saddle height right is very important.</p>\n<p>You should be positioned correctly over the pedals too, which means getting the saddle fore and aft positioning correct.</p>\n<p>You also need to be able to stretch to your handlebars comfortably, so bar height and stem length are important.</p>\n<p>Finally, if you’re riding clipped-in, you need your cleats set up correctly to avoid <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/cycling-foot-pain/\">foot pain</a>, leg and back discomfort.</p>\n<p>If all that seems daunting, a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-much-difference-does-a-bike-fit-make/\">professional bike fit</a> is a very worthwhile investment to get expert help and advice.</p>\n<p>Here, we go over the basics of dialling in your fit at home.</p>\n<h3>Handlebar height</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Triban 100 stem on a road bike in a workshop\" title=\"Handlebar height\" />\n\n</div><div><figcaption><span><i></i> Setting handlebar height is a balancing act between aerodynamics and comfort.</span></figcaption><span> <i>Stan Portus / Our Media </i></span></div>\n<p>Handlebar height alters quite a few things that affect your ride comfort.</p>\n<p>There’s the obvious one of how bent over you are as you ride. Being bent over too much can cause <a href=\"https://www.bikeradar.com/advice/fitness-and-training/lower-back-pain-cycling/\">lower back</a>, shoulder, arm, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hand-and-wrist-pain-cycling/\">hand</a> and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-prevent-neck-pain-when-road-riding/\">neck</a> pain.</p>\n<p>On the other hand, your bike may handle, climb and brake better if more of your weight is over the front wheel, plus you’ll likely <a href=\"https://www.bikeradar.com/advice/go-faster-for-free/\">be more aerodynamic</a>, so there’s a trade-off to be made.</p>\n<p>Secondly, altering your bar height will affect the reach from your saddle to the bars, so you might need to alter your stem length to compensate, although changes will usually be small.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Beginner's cycling skills for adults handlebar height\" title=\"Beginner's cycling skills for adults handlebar height\" />\n\n</div><div><figcaption><span><i></i> Handlebar height can be easily adjusted.</span></figcaption><span> <i>Wayne Reid / Our Media</i></span></div>\n<p>Our piece on how to adjust <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">handlebar height</a> will give you all the tools you need to make adjustments. It’s worth considering fitting a riser stem or flipping your existing stem over if you want to get the bars higher than the steerer tube will allow.</p>\n<h3>Saddle positioning and height</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Beginner's cycling skills for adults0035\" title=\"Beginner's cycling skills for adults0035\" />\n\n</div><div><figcaption><span><i></i> Saddle height is one a few ways of changing your seating position.</span></figcaption><span></span></div>\n<p>There’s a lot of adjustability in your saddle position and it’s easy to get it wrong.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">Saddle height</a> will affect how extended your legs are when cycling, how effectively you can pedal and how much stress you put on your muscles and joints to deliver power.</p>\n<p>You also need to ensure your fore and aft saddle positioning is correct, so you’re sitting over the pedals rather than too far behind them.</p>\n<p>Finally, your <a href=\"https://www.bikeradar.com/features/how-to-adjust-your-mountain-bike-saddle-angle/\">saddle angle</a> needs to be right, so that you’re not continually slipping forward or backward as you ride and needing to haul yourself back into the centre of your saddle.</p>\n<h3>Cleat position</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Picture showing the underside of a cycling shoe with fingers adjusting the position of the cleat\" title=\"new-fit-6-1503592766189-exf4zpyisbc-ce619ac\" />\n\n</div><div><figcaption><span><i></i> Adjusting cleat position allows you to tailor your stance width on the bike.</span></figcaption><span> <i>Thomas McDaniel / Immediate Media</i></span></div>\n<p>With <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless pedal</a> cleats limiting how much you can move your feet around as you ride, if you’ve got it wrong this can be reflected in aches and pains in muscles and joints right up the legs.</p>\n<p>It’s also worth bearing in mind that whether you ride a small 44cm or a large 64cm frame, all bikes of the same model have the same-width bottom bracket. That’s not going to give the best <a href=\"https://www.bikeradar.com/features/stance-width-what-it-is-and-why-you-should-care/\">stance width</a> (how far apart your feet are) for everyone across that size spectrum.</p>\n<p>There are only two ways to increase your stance width: fit your cleats further inboard or look for pedals with longer spindles.</p>\n<p>Shimano Ultegra and Dura-Ace pedals, for example, give you the option of a 4mm longer road pedal axle.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/components/pedals/wahoo-speedplay-zero-pedals-review/\">Speedplay pedals</a> also used to give you axle length options, but has now standardised on one length, although there’s lots of lateral adjustability in its cleat positioning.</p>\n<p>For more info, check out our detailed guide on how to <a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\">fit and adjust your clipless pedal cleats</a>.</p>\n<h2>Change your handlebar</h2>\n<h3>Fitting more comfortable mountain bike handlebars</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"DMR ODUB handlebars\" title=\"DMR ODUB handlebars\" />\n\n</div><div><figcaption><span><i></i> The shape of your handlebar can change the ride of your mountain bike.</span></figcaption><span></span></div>\n<p>On mountain bikes, your handlebar needs to match your riding style, in terms of width, rise and sweep.</p>\n<p>The shape of the bar will also affect how the bike handles. This because it will change your position on the bike and the steering geometry. So a bar swap is one way to fine-tune your position if you’re not comfortable.</p>\n<p>The degree of backsweep will also determine your hand and arm position. Some riders find a bar with more backsweep helps reduce hand, wrist and arm discomfort.</p>\n<p>Also note that you might need to swap your stem to a shorter one if you fit wider bars, or bars with a different backsweep, because this will increase your effective reach.</p>\n<p>Read our guide to choosing a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-handlebars/\">mountain bike handlebar</a> to learn more.</p>\n<h3>Fitting more comfortable road bike handlebars</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Joe Laverick’s Ribble Gravel SL Pro handlebar\" title=\"MG_BR_Gravel Champs_Joe Laverick_14\" />\n\n</div><div><figcaption><span><i></i> Flattened tops can reduce pressure points and distribute your weight more equally.</span></figcaption><span> <i>Matt Grayson</i></span></div>\n<p>For <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bikes</a>, the shape of the bar needs to be comfortable for you in a range of grip positions.</p>\n<p>Most <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">road bike handlebar</a> designs now feature shallow drops, so it’s easier to ride in them for longer periods – a necessary feature to get the most out of your road bike.</p>\n<p>If hand discomfort is an issue, look for a bar with a flattened top rather than the traditional round profile, as it will distribute pressure much more evenly when riding on the tops.</p>\n<p>Some bars have a forward or reverse sweep, which will alter wrist, arm and shoulder position. A backsweep will tuck your elbows in more.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Schmolke Carbon TLO Evo ICR handlebar and TLO stem on Schmolke Aerrow\" title=\"Schmolke Carbon TLO Evo ICR handlebar and TLO stem on Schmolke Aerrow\" />\n\n</div><div><figcaption><span><i></i> Carbon bars are more compliant than aluminium bars and can be designed with built-in flex.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Carbon bars are a pricey upgrade that can help with vibration damping, although if you’re looking to up comfort, a one-piece carbon bar stem might not be the answer because it will limit adjustability, in particular of bar angle.</p>\n<p>Like mountain bike bars, gravel bike handlebars are becoming increasingly wide.</p>\n<p>That might work for you on a road bike too, as it can give you more leverage so you don’t have to grip the bars so firmly to steer, but as with mountain bikes you might find that it leads to hand, wrist, arm or shoulder discomfort. You may need a shorter stem to compensate too.</p>\n<p>Also note that the extreme flare of some gravel bike bars will put your brake lever hoods in a position that might not be optimal for comfort if you ride on the hoods. The levers are designed to be most ergonomic in a near-vertical position.</p>\n<h2>Sort your control positioning and lever reach</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Road bike handlebars guide: how to choose the right ones\" title=\"Road bike handlebars guide: how to choose the right ones\" />\n\n</div><div><figcaption><span><i></i> Getting the right lever position can help minimise fatigue in your hands.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>If you have to stretch out your fingers to reach your shifters or brake levers, it can be tiring on your hands, particularly when braking on long descents.</p>\n<p>For mountain bike brake levers, you generally want your levers to sit roughly parallel with the ground. Rolling them too far forward puts an unnatural bend in your wrist and can make it harder to control your bike in steep terrain.</p>\n<p>On a road bike, you want your levers to be positioned so that they form a flat top surface that’s a continuation of the tops of the bends in the bars. This means your wrists won’t be too bent up or down when resting on the hoods.</p>\n<p>You also need to adjust the reach of your brake levers so that you can reach them easily, which can be a particular issue if you have smaller hands.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SRAM G2 brake lever\" title=\"SramGTMFYB_01Max cut 02.00_04_44_02.Still011\" />\n\n</div><div><figcaption><span><i></i> Many mountain bike levers will feature tool-free reach adjust.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Both mountain bike and road bike brake levers have built-in reach adjustment, usually via a screw in the lever body that lets you adjust reach. Make sure that the levers don’t bottom out on the bars when fully applied though.</p>\n<p>The shift to<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/\"> hydraulic disc brakes</a> has made braking action a lot lighter and less tiring than with older cable-operated brakes.</p>\n<p>You want to be able to use your shifter levers without too much hand pressure too, so well-set-up, clean and lubricated derailleurs and cables will help alleviate hand strain. Expensive as it is, <a href=\"https://www.bikeradar.com/news/electronic-or-mechanical-shifting-which-do-you-prefer/\">electronic shifting</a> is the ultimate in this regard.</p>\n<h2>Swap your bar tape or grips</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Ibis Ripley AF NGX trail mountain bike\" title=\"Ibis Ripley AF NGX trail mountain bike-8\" />\n\n</div><div><figcaption><span><i></i> High-quality mountain bike grips can increase shock absorption.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>You can do a lot for your hand comfort by upgrading your bar tape or grips.</p>\n<p>In both cases, it’s something that is of variable quality on new bikes. Some brands fit nice plushy tape or ergonomic grips to their bikes, whereas for others it’s an item that’s easy to scrimp on and save a few bucks.</p>\n<p>The <a href=\"https://www.bikeradar.com/features/best-mountain-bike-grips/\">best mountain bike grips</a> will increase shock absorption and grip on a mountain bike (or any other flat-bar bike).</p>\n<p>Most quality grips will lock onto your bars, so you don’t have to worry about them rotating in your hands. If you’ve got large hands, a longer grip may help with comfort too.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic wrapping bar tape\" title=\"Mechanic wrapping bar tape\" />\n\n</div><div><figcaption><span><i></i> Replacing your bar tape, or even doubling up can help reduce road vibrations.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Turning to drop bars, the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-handlebar-tape/\">best handlebar tape</a> will have the same impact on comfort as upgrading grips on flat bars, adding extra grip and shock absorption.</p>\n<p>Quality bar tape is quite technical, often with a core that’s designed to add comfort, wrapped in a grippy outer layer. Thickness varies greatly between tapes too – a thicker one will be more plushy than a thin one.</p>\n<p>You can also buy gel inserts that sit under the tape, providing extra cushioning.</p>\n<p>As a last resort, follow the example of the pros on the cobbles at <a href=\"https://www.bikeradar.com/features/pro-bike/paris-roubaix-tech-trends/\">Paris-Roubaix</a> and double-wrap your bar tape.</p>\n<h2>Fit wider tyres</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Road-bike-tyre-pressure-12-7a0edc8\" title=\"Road-bike-tyre-pressure-12-7a0edc8\" />\n\n</div><div><figcaption><span><i></i> Wider tyres will help reduce any feedback from the trail or road.</span></figcaption><span></span></div>\n<p>Fitting <a href=\"https://www.bikeradar.com/advice/buyers-guides/are-wider-tyres-faster/\">wider tyres</a> is an easy way to up the comfort of your bike, particularly with road and mountain bikes.</p>\n<p>In both road riding and mountain bikes, tyres have been getting wider for years, with 28mm tyres now the norm on new road bikes in place of the 23mm tyres specced only a few years ago.</p>\n<p>Mountain bike tyres are <a href=\"https://www.bikeradar.com/features/whats-the-fastest-tyre-size-for-mountain-biking/\">getting wider</a> too, with it rare to see anything narrower than 2.4in specced these days.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Engwe M20 commuting eBike\" title=\"Engwe M20 - 03\" />\n\n</div><div><figcaption><span><i></i> It’s not uncommon to see fat tyres on some electric hybrid bikes to improve their comfort.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>There are many hybrid<a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\"> commuter bikes</a> with wide 35mm-plus rubber now and most gravel bikes enable you to fit <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">gravel tyres</a> 40mm wide or more.</p>\n<p>The increased volume of a wider tyre will help isolate you from imperfections and bumps in the road surface or on the trail.</p>\n<p>More expensive tyres – particularly the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road bike tyres</a> – are also typically more compliant than cheaper ones, with higher thread counts in their casings and better-quality rubber that’s less rigid, both making for a more comfortable ride.</p>\n<p>Bike brands tend to be conservative about just how wide you can go, and often you can fit a wider tyre in a frame without clearance issues – unless you’re riding somewhere where you will pick up mud.</p>\n<h2>Reduce tyre pressure</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pressure gauge being used to check pressure of a Halo tyre on a Velocity Aileron rim.\" title=\"Gravel tyre pressure guide 2\" />\n\n</div><div><figcaption><span><i></i> Reducing tyre pressure can make a big difference to bike comfort.</span></figcaption><span> <i>Laura Dow / Our Media </i></span></div>\n<p>With more air volume under you, a wider tyre can be run at lower pressure without the risk of bottoming out on the rim. Lower pressures mean the tyre can deform around road imperfections rather than bouncing over them. That reduces vibration transmitted through the bike to you.</p>\n<p>Recommended <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">road bike tyre pressure</a> and <a href=\"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/\">mountain bike tyre pressure</a> are both lower than they used to be. That’s in part due to running wider tyres on wider rims, but also thanks to a general shift in mindset across all disciplines.</p>\n<h2>Try a different saddle</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The Whyte E-180 RS v3 full suspension eMTB is equipped with a Fizik Terra Aidon saddle\" title=\"Whyte E-180 RS v3 - 07\" />\n\n</div><div><figcaption><span><i></i> Saddles cater for different uses and sit bone anatomy.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>There are hundreds of saddles available, designed to cater to different uses and, more importantly, to different sit bone anatomy. So if your saddle doesn’t agree with you, it’s worth considering a swap to <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-the-best-saddle/\">choose the right bike saddle for you</a>.</p>\n<p>That doesn’t need to cost the earth, because saddle brands typically offer the same saddle profile at a range of price points, so if you’re not weight-obsessed you can pick up a new saddle relatively cheaply. If you like it, you can always upgrade to a more expensive model later.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Fizik Vento Argo Adaptive saddle on Connor Swift’s Pinarello Grevil F\" title=\"MG_BR_Gravel Champs_Connor Swift_54\" />\n\n</div><div><figcaption><span><i></i> 3D-printed saddles are becoming more popular, with some companies making custom designs using your sit bone measurements.</span></figcaption><span> <i>Matt Grayson</i></span></div>\n<p>Most big saddle brands have their own fit systems. They’re usually quite straightforward and you can run through the modeller online or visit a shop that has the fit system for the saddle brand you’re interested in.</p>\n<p>There’s often the option to try before you buy or return a saddle within a specified period if you and it don’t get along. Saddle choice is something that a professional bike fit will also usually address.</p>\n<h2>Add suspension</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"lauf seigla grit fork first ride\" title=\"lauf seigla grit fork first ride\" />\n\n</div><div><figcaption><span><i></i> The Lauf Grit fork may look peculiar, but it will add comfort and control to your gravel bike.</span></figcaption><span> <i>Snorri Tryggvason / Lauf</i></span></div>\n<p>Mountain bike suspension is incredibly good at keeping you comfortable, but you need to fine-tune your setup to get the most out of it.</p>\n<p>Start with our <a href=\"https://www.bikeradar.com/advice/workshop/how-to-set-up-your-mountain-bike-suspension-video-guides-to-help-you-get-the-most-from-your-bike/\">10-minute suspension setup guide</a>, then take a deep dive on how to adjust your <a href=\"https://www.bikeradar.com/features/how-to-adjust-the-rebound-and-compression-settings-on-your-mountain-bike/\">fork settings</a>. If you want to get your head around how it all works, check out our in-depth look at the most common <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">rear suspension systems</a>.</p>\n<p>If you’re on a road or gravel bike, there are various components you can buy that are designed specifically to add some shock absorption.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cannondale Synapse Disc Ultegra endurance road bike\" title=\"Cannondale Synapse Disc Ultegra 5\" />\n\n</div><div><figcaption><span><i></i> Carbon seatposts are generally comfier than alloy posts.</span></figcaption><span> <i>Felix Smith</i></span></div>\n<p>To start, in general, a carbon seatpost will be more compliant than an alloy one. A narrower-diameter seatpost will flex more than a wider one too, so if your road bike has a 31.6mm post a swap to a 27.2mm post with a shim in the top of the seat tube might offer more saddle comfort.</p>\n<p>Beyond that, there are proprietary seatpost designs such as the split-shaft <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/canyon-vcls-post-2-0-review/\">Canyon S25 VCLS 2.0 CF</a> seatpost, which you can fit to any bike designed for a 31.6mm post and the <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/redshift-shockstop-seatpost-review/\">Redshift Sports seatpost</a>.</p>\n<p>Up-front, <a href=\"https://shop.fullspeedahead.com/en/stems/gravel/ns-vas-stem\">FSA’s new NS VAS stem</a> includes a vibration-absorbing bushing that helps isolate the bars from the steerer, and the <a href=\"https://www.bikeradar.com/reviews/components/handlebars-and-stems/stems/redshift-shockstop-stem-review/\">Redshift Shockstop stem</a> offers true suspension with hinged sections and an elastomer damper that sits within the pivot.</p>\n<p>Still not happy? You could always fit the <a href=\"https://www.bikeradar.com/news/sram-rockshox-zipp-xplr/\">SRAM XPLR suspension fork</a> or a <a href=\"https://www.bikeradar.com/reviews/components/forks/suspension-forks/lauf-grit-fork-review/\">Lauf Grit fork</a>.</p>\n<h2>Improve your cycling skills</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Beginner's cycling skills for adults – signalling\" title=\"Beginner's cycling skills for adults – signalling\" />\n\n</div><div><figcaption><span><i></i> Just practising your riding skills can make you more comfortable on the bike.</span></figcaption><span> <i>Wayne Reid / Our Media</i></span></div>\n<p>Learning how to ride your bike doesn’t stop as soon as your stabilisers come off – <a href=\"https://www.bikeradar.com/advice/skills/technique/beginners-cycling-skills/\">essential cycling skills</a> such as learning how to negotiate road curbs and using the brakes effectively will improve your riding comfort.</p>\n<p>As you develop your riding skills, you will better understand how to maintain a comfortable and relaxed riding position which should help with any pains when out in the bike.</p>\n<p>Even learning to ride with your hands off the bars will increase your comfort as you will see how core body strength can reduce the weight on your hands alleviating pain in your arms and hands.</p>\n<h2>Consider your kit</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for summer cycling, Rapha base layer\" title=\"How to dress for summer cycling, Rapha base layer\" />\n\n</div><div><figcaption><span><i></i> What you wear can impact comfort on the bike.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Bike discomfort isn’t always the bike’s fault, sometimes it’s what you’re wearing.</p>\n<p>It’s worth considering whether you’ve got it right if you’re sore after a ride.</p>\n<h3>Wear padded shorts</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Universal Colours Chroma Women’s Bib Shorts\" title=\"Universal Colours Chroma Women’s Bib Short - 01\" />\n\n</div><div><figcaption><span><i></i> Bib shorts are widely considered to be the most comfortable riding shorts.</span></figcaption><span> <i>Sam Voaden / Our Media</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">best bib shorts</a> for men and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-cycling-shorts/\">best women’s cycling shorts</a> can be pricey, but they’ll usually have a high-quality seat pad that’s designed to keep you comfortable no matter how far you’re riding.</p>\n<p>The fit will usually be better than a cheaper pair of shorts too, and there will be features such as flatlock seams, so you’re less likely to experience chafing on the bike. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-chamois-cream/\">best chamois cream</a> can help here too.</p>\n<h3>Try padded gloves</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"DHB Aeron mitts with Elastic Interface pad\" title=\"DHB Aeron mitts with Elastic Interface pad\" />\n\n</div><div><figcaption><span><i></i> Padded gloves should help keep white-finger at bay.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>A good pair of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-summer-cycling-gloves/\">road mitts</a> (or full-finger <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-gloves/\">road cycling gloves</a> in the winter) or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-gloves/\">mountain bike gloves</a> will help with handlebar comfort too. They’ll typically have extra padding strategically placed to absorb vibration and shocks and protect the nerves in your palms, while still keeping your grip. Your hands will also be protected if you have a crash.</p>\n<p>Our guide on <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-to-wear-on-a-bike-ride/\">what to wear on a bike ride</a> takes you through everything you need to know.</p>\n<h3>Upgrade your shoes</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Fizik Artica GTX Tempo road cycling shoe\" title=\"Fizik Artica GTX Tempo shoes - 02\" />\n\n</div><div><figcaption><span><i></i> Shoe fit can affect not just your feet but your legs and hips too.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>They’re pricey to swap, but properly fitting shoes that suit your foot profile, whether <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">road cycling shoes</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-shoes-for-mountain-bikers/\">mountain bike shoes</a>, can make a lot of difference to ride comfort – not just in your feet but right up your legs and into your hips.</p>\n<p>If your feet are wallowing around in your shoes, you’re not going to pedal as efficiently as you might, and badly aligned feet can cause <a href=\"https://www.bikeradar.com/advice/fitness-and-training/it-band-injuries-and-cycling-what-you-need-to-know/\">IT band and hip pain</a>.</p>\n<p>If you need to screw down the closures tightly for your feet to be held in place, this can put a lot of pressure on the top of your midfoot, which again can become uncomfortable and cause cramps.</p>\n<p>Conversely, too tight a shoe will squeeze your feet, potentially restricting blood flow and could cause cramps.</p>\n<p>Recognising this, some brands make <a href=\"https://www.bikeradar.com/features/wide-shoes-why-you-need-them-and-which-brand-makes-the-best/\">wide-fit</a> as well as standard-fit versions of some of their shoes, although make sure you need this because it could exacerbate the twisting problem noted above.</p>\n<p>Also, as mentioned above, make sure that your <a href=\"https://www.bikeradar.com/features/how-to-set-up-clipless-pedal-cleats/\">cleats</a> are set up optimally. A pro bike fit should help here.</p>\n<h3>Change your insoles</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Selle Italia’s ID Match now adds footbeds\" title=\"Selle Italia’s ID Match - 01\" />\n\n</div><div><figcaption><span><i></i> Insoles can help you refine comfort without changing shoes.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>Good-quality footbeds can make a lot of difference to foot comfort too. Often, cycling shoes come with quite flat, unstructured insoles.</p>\n<p>Since your soles are transmitting all your pedal power to the bike, they need to be well supported. They’re stuck in one position too, whereas when you walk or run, you spring off the forefoot, which stretches the bones and tendons, and that static position can also be a cause of cramping in the midfoot.</p>\n<p>A good-quality footbed can help alleviate this. It will be more structured, may have swappable arch supports to suit the height of your instep and will often have a bump under the midfoot that helps keep the bones splayed out so that circulation to your forefoot is improved. Read our guide to quality <a href=\"https://www.bikeradar.com/features/5-arch-supports-and-why-your-cycling-feet-need-them/\">replacement footbed</a> options for more info.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"dc98a13912825767dcb764489b265d2b45b177f0d3271d1548e51f3cc5ca09c9","category":"Cycling"}