{"title":"Judge tosses Big Pharma suit claiming drug price negotiation is unconstitutional","link":"https://arstechnica.com/?p=2003073","date":1707853102000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-849503162-800x533.jpeg\" alt=\"Stephen Ubl, president and chief executive officer of Pharmaceutical Research and Manufacturers of America (PhRMA), speaks during a Bloomberg Live discussion in Washington, DC, on Tuesday, Sept. 19, 2017. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-849503162-scaled.jpeg\">Enlarge</a> <span>/</span> Stephen Ubl, president and chief executive officer of Pharmaceutical Research and Manufacturers of America (PhRMA), speaks during a Bloomberg Live discussion in Washington, DC, on Tuesday, Sept. 19, 2017.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/stephen-ubl-president-and-chief-executive-officer-of-news-photo/849503162?adppopup=true\">Getty | Andrew Harrer</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A federal judge in Texas <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.txwd.1172745079/gov.uscourts.txwd.1172745079.53.0.pdf\">dismissed a lawsuit Monday</a> brought by a heavy-hitting pharmaceutical trade group, which argued that forcing drug makers to negotiate Medicare drug prices is unconstitutional.</p>\n<p>The dismissal is a small win for the Biden administration, which is defending the price negotiations on multiple fronts. The lawsuit dismissed Monday is just one of nine from the pharmaceutical industry, all claiming in some way that the price negotiations laid out in the Inflation Reduction Act of 2022 are unconstitutional. The big pharmaceutical companies suing the government directly over the negotiations include Johnson &amp; Johnson, Bristol Myers Squibb, Novo Nordisk, Merck, and AstraZeneca.</p>\n<p>Last month, a federal judge in Delaware heard arguments from AstraZeneca's lawyers, which reportedly went poorly. AstraZeneca argued that Medicare's new power to negotiate drug prices violates the company's rights under the Fifth Amendment's due process clause. The forced negotiations deprive the company of “property rights in their drug products and their patent rights\" without due process, AstraZeneca claimed. But Colm Connolly, chief judge of the US District Court of Delaware, was skeptical of how that could be the case, according to <a href=\"https://www.statnews.com/2024/01/31/medicare-drug-price-negotiation-lawsuit-skepticism/\">a Stat reporter who was present for the hearing</a>. Connolly noted that AstraZeneca doesn't have to sell drugs to Medicare. \"You’re free to do what you want,\" Connolly reportedly said. \"You may not make as much money.\"</p></div><p><a href=\"https://arstechnica.com/?p=2003073#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2003073&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dca0ca25e069c197afb75b4a9fe60803fdd221474e1b29f535ce32df86aeed0e","category":"Tech"}