{"title":"Apple Vision Pro Virtual Keyboard Blasted As 'Complete Write-Off'","link":"https://www.macrumors.com/2024/01/15/apple-vision-pro-virtual-keyboard-criticism/","date":1705317952000,"content":"Anyone paying attention to Apple's Vision Pro headset unveiling at WWDC 2023 will have seen its virtual keyboard demo. The keyboard floats in mid-air, allowing you to input text in your spatial computing environment while wearing the device. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/apple-vision-pro-virtual-keyboard.jpg\" width=\"1278\" height=\"720\" />\r<br />\nHowever, anyone planning to ditch their physical keyboard may want to hold onto it for a little while longer: According to <em>Bloomberg</em>'s Mark Gurman, the virtual keyboard experience in visionOS 1.0 is \"a complete write-off,\" and most people will want to use a Bluetooth keyboard instead.\r<br />\n<blockquote>\"The Vision Pro virtual keyboard is a complete write-off at least in 1.0,\" wrote Gurman in an <a href=\"https://x.com/markgurman/status/1745907431564063208?s=20\">X post</a>. \"You have to poke each key one finger at a time like you did before you learned how to type. There is no magical in-air typing. You can also look at a character and pinch. You'll want a Bluetooth keyboard.\"</blockquote><a href=\"https://developer.apple.com/videos/play/wwdc2023/10073/\">According to Apple</a>, the buttons on the virtual keyboard are raised above the platter to mimic the affordance of pushing physical keys, and the keyboard even includes feedback via spatial sound effects to \"compensate for the missing tactile information.\" \r<br />\n\r<br />\nGoing on what Gurman said though, it doesn't sound like Apple has quite perfected the experience, which is probably always going to be degraded by the fatigue caused by having to hold your hands in the air to type, regardless of what Apple does to improve it in future software updates. Fortunately, Vision Pro can wirelessly connect to Mac accessories including the Magic Keyboard and the Magic Trackpad for more traditional tactile input. \r<br />\n\r<br />\n<div><blockquote><p>The Vision Pro virtual keyboard is a complete write-off at least in 1.0. You have to poke each key one finger at a time like you did before you learned how to type. There is no magical in-air typing. You can also look at a character and pinch. You’ll want a Bluetooth keyboard.</p>— Mark Gurman (@markgurman) <a href=\"https://twitter.com/markgurman/status/1745907431564063208?ref_src=twsrc%5Etfw\">January 12, 2024</a></blockquote> </div>\r<br />\nStarting at $3,499, Apple Vision Pro pre-orders open on Friday, January 19 at 5.00 a.m. PST, and the device goes on sale in the U.S. on Friday, February 2, with availability in Canada and the United Kingdom expected to follow later in the year.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/15/apple-vision-pro-virtual-keyboard-criticism/\">Apple Vision Pro Virtual Keyboard Blasted As 'Complete Write-Off'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-virtual-keyboard-blasted-as-complete-write-off.2416369/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dca09a2b45d02ce1aaa0cfd1b35009a4cc0006f8e0765cc80ef40a4ce22cb759","category":"Apple"}