{"title":"Report: Apple is willing to open up access to NFC payments in the EU","link":"https://www.macworld.com/article/2169718/iphone-third-party-nfc-payments-european-union.html","date":1702399087000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After switching from Lightning to USB-C and announcing <a href=\"https://www.macworld.com/article/2141884/iphone-imessage-rcs-support-later-in-2024.html\">support for RCS</a> in Messages in 2024, Apple might have one more surprise for iPhone critics: On Tuesday, Reuters <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/technology/apple-offers-settle-eu-antitrust-charges-apple-pay-sources-say-2023-12-12/&amp;xcust=1-1-2169718-1-0-0&amp;sref=https://www.macworld.com/feed\">reported</a> that Apple will allow other companies to access its Near-Field Communication (NFC) technology. Citing “three people familiar with the matter,” Apple is taking action to settle European Commission antitrust charges, as well as a possible monetary fine.</p>\n\n\n\n<p>Apple uses NFC for its tap-and-go payment system, Apple Pay, but does not allow other companies access to the technology. The EC brought up antitrust charges, citing that Apple’s practice gave the company an unfair advantage. With access to NFC, other companies will be able to develop payment systems to compete with Apple.</p>\n\n\n\n<p>According to Reuters, the EC is considering Apple’s offer to open access. It will be asking for feedback from “rivals and customers” to determine whether Apple’s offer is acceptable. The EC did not provide Reuters with an official comment on the matter.</p>\n\n\n\n<p>Reuters did not state if Apple’s NFC policy change will apply only to the European Union. Since Apple is not facing similar antitrust charges in the U.S., the company could leave its current practice in place.</p>\n\n\n\n<p>The change in NFC policy is just one of several changes that Apple has made due to policies in the EU. Most notably, <a href=\"https://www.macworld.com/article/1341179/apple-will-be-forced-to-switch-iphone-to-usb-c-by-2024.html\">Apple ditched its Lightning connector</a> in its new iPhones this year and has promised to support RCS in 2024. There are also reports that it will <a href=\"https://www.macworld.com/article/1434394/ios-17-third-party-app-stores-browsers-payment-systems-camera-nfc.html\">allow third-party app stores</a> in Europe, and Apple is currently fighting an EU <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/technology/apple-seeks-fend-off-eu-antitrust-charge-triggered-by-spotify-hearing-2023-06-29/&amp;xcust=1-1-2169718-1-0-0&amp;sref=https://www.macworld.com/feed\">antitrust charge involving Apple Music</a>.</p>\n\niOS, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dcaecc3ff939e6e4a4bd5bd8238ca641523e44c326d8dfcd075a6799021f6a87","category":"Apple"}