{"title":"Applying ensemble climate models to predict the fate of marginal coral reefs already existing at thermal and turbidity limits in arid tropical Australia","link":"https://rmets.onlinelibrary.wiley.com/doi/10.1002/cli2.66?af=R","date":1707292800000,"content":"<img src=\"https://rmets.onlinelibrary.wiley.com/cms/asset/ab2106a2-c3eb-4ff5-8412-6f9b36dc80da/cli266-gra-0001-m.png\" alt=\"Applying ensemble climate models to predict the fate of marginal coral reefs already existing at thermal and turbidity limits in arid tropical Australia\" />\n<p>Projected turbidity changes by 2100 in the Exmouth Gulf\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Marine fauna, including coral reefs, exist under particular oceanographic and meteorological (metocean) processes that maintain water quality within the range limits to which they have adapted over millennia. Climate-induced changes to these metocean processes could alter ambient marine water quality to ranges beyond those limits and at rates faster than species can adapt. Extreme (or marginal) coral reefs, such as those in arid tropical regions, already exist at the limits of their ranges for water quality parameters such as temperature and turbidity. Here, we apply projected anomalies from ensemble climate models to the metocean processes that drive turbidity in the Exmouth Gulf region of north Western Australia where habitats of significant environmental value exist. We also apply projected sea surface temperature anomalies to look at how a combined effect of turbidity and temperature might impact important habitats. We find that turbidity is predicted to increase in some parts of the Gulf and decrease in others due to differing metocean drivers of turbidity throughout the region. Temperature anomalies reveal year-round increases in temperature consistent with current summer marine heat wave events (&gt;2.5°C above mean temperatures). Climate models used in the predictions varied between themselves underscoring the importance of model choice and of using ensembles.</p>","author":"Paula Cartwright, \nNicola Browne, \nPeter Fearns, \nMick O'Leary, \nRyan Lowe","siteTitle":"Wiley: Climate Resilience and Sustainability: Table of Contents","siteHash":"e7509a6a763a901e53649c0568b0f7267c6e779cdc08f41bb80af5ed2bfb3753","entryHash":"dcb0d30ad86262f4c3a47ef94a37c66e1488dc9c2b179d04a2c15490cd60f25e","category":"Environment"}