{"title":"Microsoft Word for Mac is about to get two huge shortcuts we’ve wanted for years","link":"https://www.macworld.com/article/1655082/microsoft-word-mac-zoom-paste-plain-text-shortcut.html","date":1678709700000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>We don’t generally write about Microsoft apps here on Macworld, but if you use Word on your Mac, you’ll love these two new shortcuts coming to the app.</p>\n\n\n\n<p>In the latest beta version of Microsoft Word for 365 Insiders (Version 16.67.1113.0 or later), users will get new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://insider.office.com/en-us/blog/new-zoom-shortcuts-in-word&amp;xcust=1-1-1655082-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">keyboard shortcuts for zooming</a> so you don’t have to use the on-screen buttons anymore. To say the shortcut is overdue is something of an overstatement, since nearly every productivity app ever made—including most of Microsoft’s—uses keyboard shortcuts for zooming.</p>\n\n\n\n<p>The keystroke is familiar, and one you’ve likely tried in Word before to no avail. In an upcoming update, the common keystrokes Command-Plus (+) and Command-Minus (-) will zoom in and out respectively. Each press will increase or decrease the zoom by 10 percent, and Command-Zero (0) will reset the view to 100 percent.</p>\n\n\n\n<p>The other change involves an age-old feature that’s getting a long-overdue shortcut. If you’ve ever needed to paste a bit of text into a Word document, you’ve no doubt noticed that all of the formatting comes with it and you’ll need to surgically change everything—text size, color, bolding, etc. Microsoft has a “Clear Formatting” option in the Edit menu, or you could press the pop-up Eraser button, but the standard Command-Shift-V keystroke didn’t work to paste plain text. Additionally, Command-Option-C will copy the current formatting in your document and Command-Option-V will apply it to the text you’ve selected.</p>\n\n\n\n<p>Now it will. Microsoft has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://insider.office.com/en-us/blog/paste-text-only-shortcut-in-word?ocid=usoc_TWITTER_M365_spl100003894688686&amp;xcust=1-1-1655082-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">added the simple keystroke</a> to the latest Word beta in one of the most overdue features in the history of apps. Just press Command-Shift-V to paste the text without any images or links. As Microsoft plainly says, “pasted content matches the neighboring text formatting, rather than preserving its original font size, color, etc.” Genius.</p>\n\n\n\n<p>Microsoft hasn’t said when the features will end up in the full version of Word, but we expect they’ll arrive sometime in the spring. In the meantime, just know that good things are on the way.</p>\n\n\n\n<p>Microsoft Word is <a href=\"https://www.macworld.com/article/670586/microsoft-office-for-mac-buying-guide.html\">part of Office for Mac</a> and is available with a <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-1655082-1-0-0&amp;murl=https://www.microsoft.com/en-us/microsoft-365/buy/compare-all-microsoft-365-products\" target=\"_blank\">Microsoft 365 subscription</a> for $69.99/£59.99 per year or $6.99/£5.99 per month. A subscription-free <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-1655082-1-0-0&amp;murl=https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-670586-1-0-0&amp;murl=https://www.microsoft.com/en-us/microsoft-365/p/office-home-student-2021/CFQ7TTC0H8N8\" target=\"_blank\">Home &amp; Student</a> version is also available for $149.99, though it probably won’t get this feature until the next update later in 2023 or 2024.</p>\n\n\n\n<p>We give advice on what the best way to buy Microsoft Office for Mac is here: <a href=\"https://www.macworld.com/article/670586/microsoft-office-for-mac-buying-guide.html\">Microsoft Office for Mac: Microsoft 365 vs Office 2021 buying advice.</a> We also have advice on the <a href=\"https://www.macworld.com/article/668672/best-mac-word-processor.html\">Best Mac word processor</a>. </p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"1fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dcb3521d5bc5d6cebdb64aafea01ded6b6e6ad4ffcca41e5ac8b5a","category":"Apple"}