{"title":"‘If you want to win a Grand Tour, you take Sepp Kuss with you’","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/if-you-want-to-win-a-grand-tour-you-take-sepp-kuss-with-you","date":1693131000000,"content":"\n      <p><span>Ride, eat, sleep, repeat.</span></p>\n<p><span>For Sepp Kuss, who is starting his third Grand Tour of 2023 in Spain in the service of Jumbo-Visma team leaders, <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia </a>champions, Jonas Vingegaard and Primož Roglič, those words signify more than just a soundbite on a T-shirt.</span></p><div></div>\n<p><span>For the Coloradan climber, it's now become a way of life.</span></p>\n<p><span>“It wasn't the plan,” the 28-year-old American admits of his start in this year's <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, his third Grand Tour in four months.</span></p>\n<p><span>“In January, the plan was just to do the Tour and the Vuelta, which I have done in the past. When Wilco (Kelderman) crashed in Tirreno, I got the call that I would most likely do the Giro, so I started getting ready for the Giro. Then I was wondering ‘What's the schedule going to be now, because that changes things a bit...?’”</span></p>\n<p><span>“And the team said it was still possible I'd race the Tour and that it was not out of the question that I'd race the Vuelta,” Kuss explains. “But because there was another week of recovery with the way the World Championships were scheduled, this year was special, so then it wasn't out of the question to do the Vuelta.”</span></p>\n<p><span>“Once I'd mentalised that a bit more, it became more of a motivation than a burden of ‘Oh shit, I have to do another one!’ I treated it more as a challenge.”</span></p>\n<p><span><img alt=\"Sepp Kuss, Jumbo-Visma, Tour de France\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01009.jpg?v=1693130810\" /></span></p>\n<p><span>The club of riders that have completed all three tours of Italy, France and Spain in one year, is pretty select. Retired pro, Adam Hansen, now President of the CPA, rode all three six times, while Basque rider Marino Lejarreta pulled the feat off four times between 1987 and 1991. Kuss's consistency is all the more impressive though, given his regularity in the higher reaches of the GC, despite putting in big shifts on behalf of his leaders.</span></p>\n<p><span>Now Kuss, 12th overall in the Tour and 14th overall in the Giro, is riding his fifth straight Grand Tour. His team very much values his presence. “If you want to win, you take Sepp with you,” Roglič said on the eve of the Vuelta.</span></p>\n<p><span>“They're both some of the best riders in the world,” Kuss says of the team leaders that he has so far twice ushered to Grand Tour success this year. “In the end it's pretty simple: in order to win a Grand Tour, you need the best rider. You can only do so much as a team, so for me it makes it easier riding for Jonas and Primož. You know how good they are and how much they sacrifice.”</span></p>\n<p><span>Physically, Kuss says, tackling another Grand Tour isn't easy, but he adds “my position as a rider isn't like the guys that are fighting for the GC every day, which is both a physical and mental strain.”</span></p>\n<p><span>“It's never easy preparing for a GT or competing in a GT, but this year I've enjoyed the process. It's been a pretty simple schedule for me: race a GT and have three weeks away from home, but then there's always four or five weeks at home in between — on my own schedule more or less — and with my wife and friends.”</span></p>\n<p><span>“I've actually taken a lot of relaxation this season, even though I'm preparing for big races. So it hasn't felt like a big mental or physical burden. As a bike racer, I think I'm more built for the Grand Tours anyway, just the way they're raced, and different situations happen, even compared to a one-week race, or a one-day race.”</span></p>\n<p><span>Coloradan-born Kuss is a natural-born montagnard, as the French would say of someone very much at home in the mountains. Dad, Dolph, was a US national ski coach, whose son grew up competing in Nordic skiing, mountain biking and road racing.</span></p>\n<p><span>In fact, Sepp raced in Nordic skiing, for what he says was the first time for a long time, only last winter. “It's nice to be in a different sporting world,” he says, ”to go back to my roots a bit. It was a 10 or 15 kilometre skate race. It's a really beautiful, very hard, sport.”</span></p>\n<p><span>Articulate and intelligent, he studied English Literature at the University of Colorado in Boulder and majored in advertising. His talent on the bike captured the attention of the European scene in 2017, after he finished 10th on Mount Baldy in the Tour of California and won a summit finish in the Tour of Utah.</span></p>\n<p><span>That was when he first met Grischa Niermann, sports director at Jumbo-Visma.</span></p>\n<p><span>“He approached me in the Tour of California in 2017 and showed interest,” Kuss said. “It was surprising to me that a WorldTour team was interested, but I had a really good feeling about the team.”</span></p>\n<p><span>The next season, he won the Tour of Utah overall, from a field that also included Jack Haig, Mike Woods, Hugh Carthy and Neilson Powless. He also won three stages and was soon fast-tracked to the WorldTour.</span></p>\n<p><span>Kuss says that taking on all three Grand Tours is “not something I would do every year, but I think this year is really unique, really special.”</span></p>\n<p><span>“Now that I have done a fair amount of Grand Tours, I know how my body is doing and when I really need to think about recovering in the stage, or taking a day a bit easier — and when I can afford to be up there, for longer.”</span></p>\n<p><span>So what is the Sepp Kuss ritual of recovery between Grand Tours?</span></p>\n<p><span>“One full week of easy rides, of maybe one, two or three hours, but really easy,” he says. “I know some guys come completely off the bike for longer, but for me, if I am completely off the bike, I feel worse. I stay in the rhythm, ride and just enjoy. After a week, a week and a half, I ease into normal training again. Enough to keep the engine running.”</span></p>\n<p><span><img alt=\"Sepp Kuss, Tadej Pogacar, Tour de France\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_5325_706d2de3-e082-465a-ac22-e8b43422be45.jpg?v=1693130842\" /></span></p>\n<p><span>Does he think his form will maintain through the Vuelta? “I hope I can be just as good as I was in the Tour and in the Giro, but we will have to see. But I didn't want to do the Vuelta if I wasn't 100%. I want to be able to make a difference in the race.”</span></p>\n<p><span>“The Grand Tours suit me really well, they don't cost me as much mental energy as they would for certain riders. I try to enjoy it as much as possible. But being on this team, you enter every Grand Tour with a huge goal and that gets you through the race a lot easier, because every stage you're focussed.”</span></p>\n<p><span>The huge goal right now is a Grand Tour grand slam. If Jumbo-Visma arrive in Madrid, having pulled off that unprecedented achievement, Kuss will have had a major role in that success. He is too modest to see it that way, however.</span></p>\n<p><span>Ask him which were his most memorable days in Grand Tour racing and Kuss hesitates.</span></p>\n<p><span>Eventually he says: “Any day in the mountains when I was able to make a difference.” Roglič and Vingegaard will say that there have been enough days like that already. During this year's Vuelta, it's likely that there will be several more.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"dcb8df4ad473af71eeb60edb6e15467aa8ff8ff5a7985e4476bfdacaddf75a12","category":"Cycling"}