{"title":"Rice transcriptional repressor OsTIE1 controls anther dehiscence and male sterility by regulating JA biosynthesis","link":"https://academic.oup.com/plcell/article/36/5/1697/7595671?rss=1","date":1706659200000,"content":"<span><div>Abstract</div>Proper anther dehiscence is essential for successful pollination and reproduction in angiosperms, and jasmonic acid (JA) is crucial for the process. However, the mechanisms underlying the tight regulation of JA biosynthesis during anther development remain largely unknown. Here, we demonstrate that the rice (<span>Oryza sativa</span> L.) ethylene-response factor-associated amphiphilic repression (EAR) motif-containing protein TEOSINTE BRANCHED1/CYCLOIDEA/PROLIFERATING CELL FACTORS (TCP) INTERACTOR CONTAINING EAR MOTIF PROTEIN1 (OsTIE1) tightly regulates JA biosynthesis by repressing TCP transcription factor OsTCP1/PCF5 during anther development. The loss of OsTIE1 function in <span>Ostie1</span> mutants causes male sterility. The <span>Ostie1</span> mutants display inviable pollen, early stamen filament elongation, and precocious anther dehiscence. In addition, JA biosynthesis is activated earlier and JA abundance is precociously increased in <span>Ostie1</span> anthers. <span>OsTIE1</span> is expressed during anther development, and OsTIE1 is localized in nuclei and has transcriptional repression activity. OsTIE1 directly interacts with OsTCP1, and overexpression of <span>OsTCP1</span> caused early anther dehiscence resembling that of <span>Ostie1</span>. JA biosynthesis genes including rice <span>LIPOXYGENASE</span> are regulated by the OsTIE1-OsTCP1 complex. Our findings reveal that the OsTIE1-OsTCP1 module plays a critical role in anther development by finely tuning JA biosynthesis and provide a foundation for the generation of male sterile plants for hybrid seed production.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"dcbf00a1ef4735ae254ecbf94a68f78202bce10ac144dcbbbbfb5c4bfe12ce37","category":"Environment"}