{"title":"10 riders who changed mountain biking tech forever","link":"https://www.bikeradar.com/features/riders-who-changed-mountain-biking-tech/","date":1637337601000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/GettyImages-236654-695c6c9.jpg?quality=45&amp;resize=620,413\" />                                            <p>There are certain points in history where sports experience a quantum leap, such as when Dick Fosbury invented a whole new high-jump technique, or when Colin Chapman fitted small upside-down aeroplane wings to a Lotus F1 car.</p>\n<p>So, in our young and rapidly expanding pastime of mountain biking, what were the Damascene moments that allowed riders to break new ground? Who are the people responsible for the bikes we enjoy and the way we ride them today?</p>\n<p>Not just the famous names everyone’s heard of, but also the folk behind smaller changes that have still had a big impact on how we ride.</p>\n<p>From top athletes to businesspeople, maverick inventors to whizz-kid engineers, here are 10 individuals who helped hone and tweak the humble bicycle to become the incredibly efficient, reliable and entertaining off-road vehicle it is today, all of them drawn together by a common thread – a love for experiencing the outdoors on two wheels.</p>\n<h2>Nico Vouilloz</h2>\n<h3>Tech-savvy superstar racer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nico Vouilloz was the greatest rider of his day.</span></figcaption><span> <i>Thomas Mei / Lapierre</i></span></div>\n<p>Before Greg Minnaar became known as the GOAT, that title belonged to Frenchman Nicolas Vouilloz, who bagged more World Cup and World Champs wins than anyone before him.</p>\n<p>Not only was Nico’s riding talent and fitness famed, but so was his scientific approach to bike development and race analysis. He left nothing to chance, leading to a stream of victories in the nineties, capped off with a 10th World Champs gold medal in 2002.</p>\n<p>Vouilloz started racing downhill aged 14, won the Junior World Champs two years later and signed a pro deal with the Sunn-Chipie team in 1995.</p>\n<p>Working closely with manager Max Commencal (now of Commencal Bicycles) and suspension wizard Olivier Bossard (BOS), he helped them to develop more efficient bikes and gear for the team.</p>\n<p>As well as wind-cheating skinsuits, special tyre compounds and advanced suspension, they introduced set-up sheets and back-to-back testing over timed runs, combined with data acquisition software to record suspension movement and rider inputs. This is indispensable tech for World Cup teams today – and Nico was using it in the nineties! He now heads up the development of Lapierre’s full-suspension bikes.</p>\n\n<h2>Dan Critchlow</h2>\n<h3>First to push the bar (width)</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Burgtec was one of the first bands to push bars beyond the 710mm mark.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Alongside racing downhill at World Cup level, Dan Critchlow formed Burgtec in 2004 with the aim of creating and developing the sort of bike parts he and other UK riders really wanted. The brand made its name producing high-quality, CNC-machined aluminium products, including anodised stems and the iconic <a href=\"https://www.bikeradar.com/reviews/components/pedals/burgtec-penthouse-flat-mk5-pedals-review/\" target=\"_blank\">Penthouse Flat pedals</a>.</p>\n<p>Perhaps most importantly, though, it was the first company to make properly wide bars, breaking the universally accepted 710mm barrier and producing the 750mm <a href=\"https://www.bikeradar.com/reviews/components/handlebars-and-stems/handlebars/handlebars-mountain/burgtec-ridewide-carbon-handlebars-review/\">RideWide</a> handlebar in 2006.</p>\n<p>Before this, riders wanting more steering leverage and an escape from XC-style twitchy front ends ran heavy makeshift bar extenders on handlebars that hadn’t been tested for the high loads incurred.</p>\n<p>The RideWide bar was proof of concept to other manufacturers; now bars of over 800mm are available and 750mm is considered average. Burgtec has also fostered young talent and supported seasoned veterans, providing parts for Josh Bryceland, Steve Peat and Greg Minnaar, and continuing to supply the Santa Cruz Syndicate team and the 50:01 crew.</p>\n<h2>Joe Breeze</h2>\n<h3>The granddaddy of mountain biking</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Joe Breeze arguably invented mountain biking.</span></figcaption><span> <i>Breezer Bikes</i></span></div>\n<p>In the 1970s, Joe Breeze was a long-haired maverick in a lumberjack shirt looking for the next adrenaline hit. Originally a road and cyclocross racer, he was happiest when bombing down southern California’s fireroads as fast as possible.</p>\n<p>The bikes of the time weren’t up to the beatings they were receiving and didn’t handle the way Breeze and his friends wanted, so they acquired some Second World War-era Schwinn ‘ballooner bikes’ (so called because of their huge tyres), which they restored and modified to work better off-road.</p>\n<p>By the late seventies, a series of downhill time trials in Marin County, called Repack, was gaining popularity. Breeze and other competitors were looking for an edge. Asked to build a frame for off-road riding, he came up with the hand-built Breezer #1 in 1977.</p>\n<p>Joe shared his ideas, including a twin top tube design to increase stiffness, with fellow frame builder Tom Ritchey, who’d go on to become the frame supplier to MountainBikes, a Californian company formed by Gary Fisher – the first to coin the name – in 1979.</p>\n<p>Breeze’s creations improved the geometry and longevity of early mountain bikes, saving weight and making them not only quicker but also more reliable and fun to ride. He allowed riders to go further and faster, and made their bikes safer. We wonder if he ever imagined he was helping to spawn an entire sport and culture back in those halcyon days.</p>\n<h2>Juliana Furtado</h2>\n<h3>Racer turned advocate for women’s mountain biking</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Juliana Furtado is still closely involved with the industry.</span></figcaption><span> <i>Nathan Bilow / Allsport</i></span></div>\n<p>Juliana Furtado is yet another Californian who changed the face of mountain biking. A skier turned bike racer, Furtado showed the range of her fitness and skills when she won the first ever XC World Champs in 1990 and then became DH world champ in 1992. She took the World Cup XC overall in 1996, and competed in the Olympics.</p>\n<p>In 1997, she retired from racing and began to focus on developing women’s-specific mountain bike components, such as narrower bars, thinner grips, shorter stems and comfier saddles. Santa Cruz was quick to see the potential in her ideas, developing its first female-focused mountain bike model, called the Juliana.</p>\n<p>In 2013, Furtado developed the concept further, with the <a href=\"https://www.bikeradar.com/news/santa-cruz-launch-juliana-bicycles-womens-range/\">Juliana</a> becoming a complete range of bikes with different specs and amounts of travel. Furtado continues to work for Juliana, which now offers six women’s-specific models, and her success has inspired a plethora of brands to create mountain bike hardware tailored to female riders.</p>\n<h2>Gary Fisher</h2>\n<h3>Ahead-of-his-time tech pioneer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gary Fisher was way ahead of his time with many of his designs.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>Gary Fisher is a tech geek and early mountain biker who pioneered many of the technological advances we benefit from today. After his first business, MountainBikes, was wound up in 1983, Gary Fisher Mountain Bikes was created. Here, Fisher spent his time innovating, creating the first production full-suspension mountain bike, the Gary Fisher RS-1, in 1992, which featured the first four-bar linkage in mountain biking.</p>\n<p>The company was sold to Trek in 1993 but Fisher continued as company president and kept on innovating. His Genesis geometry experimented with different chainstay lengths, head angles and fork offsets, showing a great awareness of the importance of geometric changes to all riders, not just the pros.</p>\n<p>Gary Fisher was constantly looking to give racers an edge and improve the ride experience for all. This geometry was the basis of the short-offset fork crown (increasing with wheel size) and also the origin of the long cockpit/short chainstay format still favoured by some manufacturers today.</p>\n<p>In a visionary move, Fisher was one of the first to put 29in wheels on a mountain bike, in 2001, when everyone else was running 26in, coming up with the now-common term ‘<a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\" target=\"_blank\">twenty-niner</a>’.</p>\n<p>The bikes were undeniably fast and encouraged other brands to create models around the larger wheel size. A true pioneer, he continually pushed the boundaries of available technology forward, questioning the status quo and sculpting the look of modern mountain bikes.</p>\n<h2>Cy Turner</h2>\n<h3>UK hardtail hero</h3>\n<div>\n    <img /></div>\n    <div>\n    <span>\n                    <i>Steve Behr / Immediate Media</i>\n            </span>\n</div>\n<p>The creator and owner of Cotic Bikes, Cy is largely responsible for reviving the elegantly simple steel trail <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hardtail-mountain-bikes/\" target=\"_blank\">hardtail mountain bikes</a>, with 2001’s <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/cotic-soul-frame-only-review/\" target=\"_blank\">Cotic Soul</a>. His success was in combining the qualities of a steel frame (springy ride quality, simplicity and reliability) with modern geometry and parts.</p>\n<p>Many UK riders, fed up with failed pivot bearings and snapped aluminium frames, were delighted with the robust yet relatively lightweight frame with no moving parts and the ability to be repaired easily.</p>\n<p>Other brands soon followed his formula and started making longer, lower and slacker hardtails that could be ragged up and down hills. Cy kept on expanding and updating his range, and in 2011 created the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/cotic-rocketmax-gen3-silver-slx-review/\" target=\"_blank\">Cotic Rocket</a>, a robust and reliable full-suspension frame, by adding an aluminium rear end and pivot bearings to one of his steel front triangles.</p>\n<p>Twenty years since it arrived on the scene, Cotic continues to use steel tubing and push its geometry, staying true to the ideals that have spawned many other artisan steel hardtails.</p>\n<h2>Paul Turner</h2>\n<h3>Suspension fork forefather</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Turner is one of the most influential people in mountain bike design.</span></figcaption><span></span></div>\n<p>Paul Turner was a young and enthusiastic mountain biker when he founded RockShox in 1989. The company began with a single product, the RS-1, which was the first production <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\" target=\"_blank\">suspension fork</a> and paved the way for almost all future designs.</p>\n<p>Primitive by today’s standards, the RS-1 was a revolution at the time. Delivering 48mm of travel via 25mm-diameter stanchions and an elastomer spring/damper, and used by Greg Herbold to win the first DH World Champs in 1990, it offered reliable suspension to the masses.</p>\n<p>Turner followed it with the Mag, Quadra and Judy, then continued to innovate with forks such as the BoXXer (DH) and SID (XC). Leaving RockShox in 1997, he created the envelope-pushing Maverick full-suspension bike.</p>\n<p>Turner’s enduring legacy is the continued presence of RockShox at the cutting edge of mountain bike suspension tech. He remains an ambassador for the sport, running Bike Park Maui in Hawaii and supporting the local scene.</p>\n<h2>Fabien Barel</h2>\n<h3>Forward-thinking geometry pioneer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fabien Barel is a true legend of downhill racing.</span></figcaption><span> <i>David Rome / Immediate Media</i></span></div>\n<p>Fabien Barel is one of the most famous downhill racers of all time, known for his ballsy riding, calculated race head and top fitness, but also his technical knowledge, which saw him engineer solutions to problems with his bikes and kit. The Kona Stab he rode to victory in 2004 had outlandish geometry that baffled other teams, but looks less out of place next to the ‘longer, lower, slacker’ bikes of today.</p>\n<p>The Frenchman then moved to the Mondraker team and worked with fellow racer Cesar Rojo on the Summum – arguably the most extreme <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\" target=\"_blank\">downhill bike</a> of its time, in terms of both geometry and adjustability. Fabien kept taking things further, eventually experimenting with a 59-degree head angle!</p>\n<p>The partnership with Mondraker was fruitful, with Rojo pushing the design side and Barel proving it worked on the race track, topping the podium at the Maribor World Cup in 2009.</p>\n<p>Embodying the motorsport philosophy of ‘win on Sunday, sell on Monday’, these frame-shape and suspension changes were then passed on to the brand’s production bikes – most notably, its Forward Geometry concept, which took length out of the stem and added it to the top tube, and led to the adoption of longer reaches and slacker head angles across the industry.</p>\n<p>When a broken femur in 2010 shortened one of his legs, Barel created a custom-shaped chainring to even out his power delivery. As testament to his tenacity and engineering, he took fourth at the following year’s opening World Cup round.</p>\n<p>After being crowned world champ three times and numerous World Cup wins, Fabien turned to enduro with new sponsors Canyon, winning the first Enduro World Series event in May 2013. He went on to spearhead the EWS and develop Canyon’s range of all-mountain bikes, and now runs the Canyon team.</p>\n<h2>Jeff Steber</h2>\n<h3>All-dominating DH bike designer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Jeff Steber founded Intense Cycles in 1992.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>In 1992, Jeff Steber founded Intense Cycles, hand-welding exquisite aluminium frames. His most iconic creation was the Intense M1, a 6in-travel, downhill-specific bike, which looks closer to a modern downhill rig than the mixed bag of steep-angled, 4in-travel full-sus frames that preceded it.</p>\n<p>The technology was so far ahead of the time that between 1996 and 2000 many major bike manufacturers (including Muddy Fox, Mongoose, Giant, Iron Horse and Haro) were buying M1 frames and painting them in their own branding. Jeff carried on innovating, creating successors with more travel and better geometry, which enjoyed World Cup success and strong sales.</p>\n<p>He then created a prototype called the 2951, a custom version of the 951 DH frame designed around 29in wheels. This was in 2009, when adoption of 29ers outside of XC racing was slow – DH teams and riders didn’t realise the grip and rollover advantages of larger wheels.</p>\n<p>It never went into production, but paved the way for a 29er to win a DH World Cup, which finally happened under Greg Minnaar in 2017. Steber continues to run Intense, making mountain bike exotica and supplying a factory World Cup team owned by American downhill titan Aaron Gwin.</p>\n<h2>Mike Sinyard</h2>\n<h3>Helped turn mountain biking mainstream</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Specialized arguably brought the mountain bike to the masses.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>As the founder and chairman of Specialized – arguably the first company to mass-produce a mountain bike – Mike Sinyard helped push mountain biking into the mainstream. In 1974, he started building bikes to ride off-road. Locally-sourced parts weren’t up to the task, so he began importing components, seeing what broke and what lasted.</p>\n<p>With mountain biking gaining in popularity, Sinyard took a gamble and went into production. The result was the Specialized Stumpjumper.</p>\n<p>With its steel frame and fork, modified BMX quill stem and custom bar, the Stumpy weighed a respectable 30lb (14kg). Its 15-speed SunTour gears, cranks and cantilever brakes were all designed for drop-bar touring. Released in 1981, some 500 rolled off the Japanese production line that year.</p>\n<p>The key selling points were that it was widely available and affordable, at US$750. It was a hit, spawning hundreds of copycat bikes.</p>\n<p>Sinyard saw the potential in full-suspension frames in the early nineties and licensed Horst Leitner’s Horst-link suspension system for the 1993 FSR (above). In 2005, Specialized pioneered the now-popular park-style bike with the SX Trail – a 7in-travel ‘all-mountain’ bike that could still be pedalled all day.</p>\n<p>Specialized also played a big role in popularising the 29er. In 2011, 29in wheels had only been adopted by serious XC racers, but Specialized rolled them out across its range. The <a href=\"https://www.bikeradar.com/news/specialized-enduro-29-launched/\">Enduro 29</a> went on to be one of the most popular enduro race bikes.</p>\n<p>Specialized has remained at the sharp end of racing throughout the decades, too, developing bikes with some of the sport’s top names.</p>","author":"Will Soffe","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"dcd44bd518f549399931239883835d4a246a0326d46be95805974a7d8f84c859","category":"Cycling"}