{"title":"Loose patch clamp membrane current measurements in cornus ammonis 1 neurons in murine hippocampal slices","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15123?af=R","date":1716399022000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/57bc75bc-d425-48f8-b657-7484315fa568/nyas15123-gra-0001-m.png\" alt=\"Loose patch clamp membrane current measurements in cornus ammonis 1 neurons in murine hippocampal slices\" /><p>Hippocampal pyramidal neuronal activity has been previously studied using conventional patch clamp in isolated cells and brain slices. We here introduce the loose patch clamping study of voltage-activated currents from in situ pyramidal neurons in murine cornus ammonis 1 (CA1) hippocampal coronal slices.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Hippocampal pyramidal neuronal activity has been previously studied using conventional patch clamp in isolated cells and brain slices. We here introduce the loose patch clamping study of voltage-activated currents from in situ pyramidal neurons in murine cornus ammonis 1 hippocampal coronal slices. Depolarizing pulses of 15-ms duration elicited early transient inward, followed by transient and prolonged outward currents in the readily identifiable junctional region between the stratum pyramidalis (SP) and oriens (SO) containing pyramidal cell somas and initial segments. These resembled pyramidal cell currents previously recorded using conventional patch clamp. Shortening the depolarizing pulses to &gt;1–2 ms continued to evoke transient currents; hyperpolarizing pulses to varying voltages evoked decays whose time constants could be shortened to &lt;1 ms, clarifying the speed of clamping in this experimental system. The inward and outward currents had distinct pharmacological characteristics and voltage-dependent inactivation and recovery from inactivation. Comparative recordings from the SP, known to contain pyramidal cell somas, demonstrated similar current properties. Recordings from the SO and stratum radiatum demonstrated smaller inward and outward current magnitudes and reduced transient outward currents, consistent with previous conventional patch clamp results from their different interneuron types. The loose patch clamp method is thus useful for in situ studies of neurons in hippocampal brain slices.</p>","author":"Federico Bertagna, \nShiraz Ahmad, \nRebecca Lewis, \nS. Ravi P. Silva, \nJohnjoe McFadden, \nChristopher L.‐H. Huang, \nHugh R. Matthews, \nKamalan Jeevaratnam","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"dcd6ae6842b411a3f6ebda47207d7356b0c4375096bc5182f3a5a5acea145235","category":"Environment"}