{"title":"A new framework for estimating abundance of animals using a network of cameras","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10606?af=R","date":1709280000000,"content":"<h2>Abstract</h2>\n<p>While many ecology studies require estimations of species abundance, doing so for mobile animals in an accurate, non-invasive manner remains a challenge. One popular stopgap method involves the use of remote video-based surveys using several cameras, but abundance estimates derived from this method are computed with conservative metrics (e.g., <i>maxN</i> computed as the maximum number of individuals seen simultaneously on a single video). We propose a novel methodological framework based on a remote-camera network characterized by known positions and non-overlapping field-of-views. This approach involves a temporal synchronization of videos and a maximal speed estimate for studied species. Such a design allows computing a new abundance metric called <i>Synchronized maxN</i> (<i>SmaxN</i>). We provide a proof-of-concept of this approach with a network of nine remote underwater cameras that recorded fish for three periods of 1 h on a fringing reef in Mayotte (Western Indian Ocean). We found that abundance estimation with <i>SmaxN</i> yielded up to four times higher values than <i>maxN</i> among the six fish species studied. <i>SmaxN</i> performed better with an increasing number of cameras or longer recordings. We also found that using a network of synchronized cameras for a short time period performed better than using a few cameras for a long duration. The <i>SmaxN</i> algorithm can be applied to many video-based approaches. We built an open-sourced R package to encourage its use by ecologists and managers using video-based censuses, as well as to allow for replicability with <i>SmaxN</i> metric.</p>","author":"Camille Magneville, \nCapucine Brissaud, \nValentine Fleuré, \nNicolas Loiseau, \nThomas Claverie, \nSébastien Villéger","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"dce4234621336c82e3c58e81c9ceb67eb4a9f2371e3ae73724ca475f2ba15c93","category":"Environment"}