{"title":"ISPs claim broadband prices aren’t too high—Biden admin isn’t buying it","link":"https://arstechnica.com/?p=1765202","date":1621017496000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/getty-internet-money-800x508.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/getty-internet-money.jpg\">Enlarge</a> (credit: Getty Images | Guirong Hao)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Biden administration officials are not convinced by the broadband industry's claims that Internet prices aren't too high, according to a <a href=\"https://www.axios.com/biden-broadband-lobbying-prices-internet-service-e8ef850e-ed00-44ee-88a6-ab296b2cf29e.html\">report today by Axios</a>.</p>\n<p>The White House <a href=\"https://arstechnica.com/tech-policy/2021/03/biden-broadband-plan-will-be-hated-by-big-isps-welcomed-by-internet-users/\">announced on March 31</a> that President Biden \"is committed to working with Congress to find a solution to reduce Internet prices for all Americans.\" Though Biden hasn't revealed exactly how he intends to reduce prices, the announcement set off a flurry of lobbying by trade groups representing ISPs to convince Biden and the public that Americans are not paying too much for Internet access. ISPs even claim that prices have dropped, despite government data showing that the price Americans pay has risen four times faster than inflation.</p>\n<p>A Biden official told Axios that the ISPs have not made a convincing case. \"A senior administration official told Axios the bulk of the evidence shows prices have gone up recently and prices are higher than they are for comparable plans in Europe,\" Axios wrote. \"Biden noted the high cost of Internet service in March, and the official told Axios, 'I don't think we've seen anything since he made those comments to make us feel like we were wrong about that. We're still committed to taking some bold action to make sure that we bring those prices down for folks.'\"</p></div><p><a href=\"https://arstechnica.com/?p=1765202#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765202&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dceb694e30482381ca654a0646a441960f22bc31b76be8693377d11bf853af88","category":"Tech"}