{"title":"Macroinvertebrates but Not Diatoms Are Affected by Streamflow Alteration Below Hydropower Diversions","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2712?af=R","date":1725527361000,"content":"<h2>ABSTRACT</h2>\n<p>River regulation due to dams and other intake structures has impacted the hydrology, water quality and biology of rivers worldwide. The release of minimum flows still represents the strategy aimed at maintaining certain aspects of the original flow patterns. However, there remains a limited understanding of the consequences of artificially induced flows on water quality and aquatic life across various types of rivers. This study was conducted in Trentino (south-eastern Alps, Italy) in 60 perennial river reaches (400–2005 m a.s.l.), all located downstream of water abstractions for different hydropower plants. The main goal of this research was to compare the effect of different residual flows on macroinvertebrates and diatoms. The overall effect of discharge was low but still significant only for macroinvertebrates, whereas diatoms were affected mostly by the water chemistry. Both groups responded to the substrate composition and to the hydromorphology, which in turn resulted to be strongly correlated. The biotic indices, originally developed to respond to pollution, were unaffected by the flow reduction, raising concerns about the potential consequences that assessment based on this approach may have on the evaluation of ecological flow. This study emphasizes the importance of considering the broader ecological context in which flow alterations occur, particularly the interaction of hydromorphology and substrate, in understanding their impact on aquatic biota.</p>","author":"Daniel Spitale, \nMarco Fezzi, \nNadia Zorzi, \nElisabeth Slomp, \nSandro Rigotti, \nAlex Borrini, \nOlena Bilous, \nMarco Cantonati","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"dd0c8f9f513932b8e203e4bbebdcd84359bbe80d499809d7b47d0ba224485708","category":"Environment"}