{"title":"Unveiling the reproductive and migrative behavior of Trichiurus lepturus in a tropical environment: Insights and implications","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15735?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>This study aimed to understand the reproductive biology and migrative behavior of the largehead hairtail <i>Trichiurus lepturus</i> in a tropical area, specifically off Pernambuco coast, northeastern Brazil. Commercial catches from fish corrals provided samples for analysis, including measurements, weight recording, and examination of gonads to determine its maturation stage. Reproductive analyses were performed, such as sex ratio, gonado-somatic index, and sizes at first maturity. There was a slightly higher proportion of females among the 141 largehead hairtail specimens analysed. No significant differences were observed in length distributions between males and females. However, during the winter, significant differences were observed in length distributions for grouped sexes. The species exhibited a seasonal migratory pattern, with a higher presence on the continental shelf during the winter. The study identified strategic allocation of energy in feeding activities and temporal spacing of reproductive cycles, as indicated by the sex ratio and abundance of individuals during different seasons. Fish corrals probably do not harm largehead hairtail population off the southwestern Atlantic tropical coast, with minimal capture of individuals below the size of first maturity. The insights of the study into reproductive and migration patterns contribute to future assessments and management strategies for this species and corral fisheries.</p>","author":"Lucas Santos, \nLuan G. F. Leite, \nHumber A. Andrade","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"dd0ebfaf0a2d4a214955d006e1b0b4e58b251dafd7dff719c8e052f0386d2cd7","category":"Environment"}