{"title":"Pollinator intraspecific body size variation and sociality influence their interactions with plants","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14511?af=R","date":1712119233000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/a0b9135b-cb94-434e-ab50-ac48ac668bf7/fec14511-toc-0001-m.png\" alt=\"Pollinator intraspecific body size variation and sociality influence their interactions with plants\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/19/the-role-of-bee-body-size-variation-and-sociality-in-their-interactions-with-plants/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSpecies morphological and behavioural traits are key determinants of which pollinator species interact with which plant species. However, individuals within species are not identical in their traits and this diversity could help us understand plant–pollinator interaction patterns.\n\nUsing three independent data sets, we assessed whether bee intraspecific body size variation (ITV) and sociality influenced pollinator interaction specialisation, intraspecific niche partitioning, centrality in the interaction network and phylogenetic diversity of the plants visited.\n\nWe found that solitary pollinators were more specialised in their interactions with plants and had lower intraspecific niche partitioning compared to social pollinators. Furthermore, solitary pollinators with higher ITV had higher centrality in the network and visited a higher phylogenetic diversity of plants compared to solitary species with lower ITV, whereas the opposite pattern emerged for social pollinators. Pollinator ITV did not differ between social and solitary bee species.\n\nOur findings show that the effect of pollinator body size variation on plant–pollinator interactions depends on pollinator species sociality. Specifically, solitary pollinators with higher ITV and social pollinators with lower ITV seem to be the most important contributors to maintaining the evolutionary diversity of the plant community, and also the species with the largest potential to affect (via cascade effects) the entire plant–pollinator network.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/19/the-role-of-bee-body-size-variation-and-sociality-in-their-interactions-with-plants/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nLos caracteres morfológicos y comportamentales de las especies son importantes determinantes de las interacciones entre especies. Sin embargo, los individuos de una misma especie presentan variaciones en sus valores de caracteres y dicha diversidad puede ayudarnos a entender los patrones de interacción entre especies.\n\nUsando tres sets de datos colectados de manera independiente, evaluamos el efecto de la variación intraespecífica del tamaño corporal (ITV) y de los hábitos sociales de especies de polinizadores sobre la especialización en sus interacciones con plantas, la partición de nicho, la centralidad de sus roles en las redes de interacción y la diversidad filogenética de las plantas que visitan.\n\nEncontramos que los polinizadores solitarios fueron más especializados en sus interacciones con plantas y repartieron menos los recursos entre los individuos de cada especie, comparado con especies de polinizadores sociales. Asimismo, polinizadores solitarios con mayor ITV tuvieron roles más centrales en las redes y visitaron un mayor rango filogenético de especies de plantas, comparado con especies solitarias de ITV bajo, mientras que el patrón opuesto emergió en polinizadores sociales. Además, no hubo diferencias en ITV entre polinizadores sociales y solitarios.\n\nEl efecto de la variación del tamaño corporal de polinizadores sobre las interacciones planta-polinizador dependen del hábito social de las especies. Específicamente, las especies de polinizadores solitarias con mayor ITV y las de polinizadores sociales con bajo ITV, son las que más contribuyen a mantener la diversidad filogenética de plantas. Estas especies presentan, también, el mayor potencial de afectar a las comunidades de plantas y polinizadores a través de efectos cascada, debido a sus roles centrales en las redes de interacción.\n</p>","author":"Guadalupe Peralta, \nJulian Resasco, \nSydney Worthy, \nCarol M. Frost, \nAngie T. Guevara, \nIsabella Manning, \nLuciano Cagnolo, \nLaura A. Burkle","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"dd1a05a5d273003940b4f37c4fac36d14f726d092027c1238511793fb01ab3db","category":"Environment"}