{"title":"Lessons for future pandemics: Temporal evolution and rural-urban variations in the impacts of the COVID-19 on opioid use treatment","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310386","date":1726236000000,"content":"<p>by Zhongyang He, Jonathan M. Heess, Travis Young, Zhen Lei</p>\r\n\r\nThe COVID-19 pandemic introduced imminent and lasting impacts on the opioid crisis in the U.S., including a significant increase in opioid overdose and deaths and in use of telehealth in treatment. What lessons can we learn from the treatment transition during the pandemic that could help tackle the opioid crisis when future pandemics strike? In this paper, we conducted a phone survey with opioid treatment facilities in Pennsylvania to examine the COVID-19’s impacts on treatment facilities and individuals with opioid use disorder during the first year of the pandemic. We separated the lockdown period (Mid-March through Mid-May, 2020) from the reopening period that followed, and urban areas from rural areas, to explore temporal evolution and rural-urban variations in the COVID-19’s impacts. We found rural-urban heterogeneity in facilities’ adoption of telehealth in treatment and in challenges and risk factors faced by their clients during the lockdown period. During the reopening, telehealth was adopted by most facilities, and telehealth-related challenges became less salient; however, both rural and urban facilities reported higher relapse risks faced by their clients, citing factors more likely to be at clients’ end and related to socioeconomic stressors and mental health. Our results highlight the vitality of addressing socioeconomic and mental health challenges faced by individuals with OUD, via government policies and community interventions, when future pandemics strike. The findings also indicate the importance of maintaining facilities’ financial well-being to provide treatment services.","author":"Zhongyang He","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dd1bf600a00360c56ab4f9f7379c5fd8641cd9518f93e40ebb8ae582d0c49d51","category":"Interdisciplinary"}