{"title":"Apple Building Chip Team to Bring More Wireless Component Production In-House","link":"https://www.macrumors.com/2021/12/16/apple-chip-team-irvine/","date":1639679441000,"content":"Apple is creating a new office that will focus on wireless chip production as the company works to bring more of its chip development in-house, reports <em><a href=\"https://www.bloomberg.com/news/articles/2021-12-16/apple-builds-team-in-new-office-to-bring-wireless-chips-in-house\">Bloomberg</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Apple-5G-Modem-Feature-Triad.jpg\" />\r\n<br />\r\nApple is hiring a few dozen engineers for an office in Southern California to develop components that may eventually replace parts that are currently sourced from companies like Broadcom, Skyworks, and Qualcomm. The office is located in Irvine, California, which is close to Los Angeles and where major chip makers are located.\r\n<br />\r\n\r\n<br />\r\nBased on job listings, Apple is seeking employees who have expertise in modem chips and wireless semiconductors, and at the facility, employees will work on wireless radios, radio-frequency integrated semiconductors, and semiconductors for connecting to Bluetooth and WiFi.<blockquote>\"Apple's growing wireless silicon development team is developing the next generation of wireless silicon!\" one job listing says. Another says employees will \"be at the center of a wireless SoC design group with a critical impact on getting Apple's state-of-the-art wireless connectivity solutions into hundreds of millions of products.\"</blockquote>Apple in 2020 signed a <a href=\"https://www.macrumors.com/2020/01/23/apple-broadcom-multi-year-supply-deal/\">multi-year deal with Broadcom</a>, which was set to last for three and a half years, which means it will expire in 2023. Under the terms of the deal, Broadcom supplies Apple with \"range of specified high-performance wireless components and modules.\"\r\n<br />\r\n\r\n<br />\r\nWhen the contract expires, Apple will no longer need to use Broadcom components and can instead rely on its own components.\r\n<br />\r\n\r\n<br />\r\nApple has been working to bring more of its chip production in-house to reduce its reliance on third-party suppliers. Apple is fairly far along on its development of a 5G modem chip, for example, and when work on that chip is complete, the company will be able to <a href=\"https://www.macrumors.com/2019/04/16/apple-qualcomm-settlement/\">stop sourcing 5G chips</a> from Qualcomm.\r\n<br />\r\n\r\n<br />\r\nCurrent rumors suggest that Apple's modem chips will be ready for use in the <a href=\"https://www.macrumors.com/2021/05/10/kuo-apple-designed-5g-modem/\">2023 iPhone models</a>, so Apple will continue to use Qualcomm chips for the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> lineup.\r\n<br />\r\n\r\n<br />\r\nLongtime Apple supplier TSMC <a href=\"https://www.macrumors.com/2021/11/23/tsmc-apple-5g-modem-2023/\">will manufacture</a> the Apple-designed 5G modems for the 2023 iPhones, and Qualcomm has <a href=\"https://www.macrumors.com/2021/11/16/qualcomm-2023-modem-chips-iphone/\">already acknowledged</a> that it expects to supply only 20 percent of the modems for the 2023 <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, with Apple largely relying on its own 5G chips.<br />This article, \"<a href=\"https://www.macrumors.com/2021/12/16/apple-chip-team-irvine/\">Apple Building Chip Team to Bring More Wireless Component Production In-House</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-building-chip-team-to-bring-more-wireless-component-production-in-house.2327902/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i8lmMwTGKkU:powwy6ULsnI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i8lmMwTGKkU:powwy6ULsnI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"dd218fafabbbe426a4c5eede7b573347d2d39897ac163e281d3b10e29b34d29e","category":"Apple"}