{"title":"Starlink launches first “cellphone towers in space” for use with LTE phones","link":"https://arstechnica.com/?p=1993408","date":1704301750000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/starlink-direct-to-cell-800x552.jpeg\" alt=\"A batch of Starlink satellites prior to launch\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/starlink-direct-to-cell-scaled.jpeg\">Enlarge</a> <span>/</span> Starlink satellites with direct-to-cell capability.  (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>SpaceX last night launched the first six Starlink satellites that will provide cellular transmissions for customers of T-Mobile and other carriers.</p>\n<p>SpaceX <a href=\"https://www.spacex.com/launches/mission/?missionId=sl-7-9\">said it launched</a> 21 satellites overall, including \"the first six Starlink satellites with Direct to Cell capabilities that enable mobile network operators around the world to provide seamless global access to texting, calling, and browsing wherever you may be on land, lakes, or coastal waters without changing hardware or firmware. The enhanced Starlink satellites have an advanced modem that acts as a cellphone tower in space, eliminating dead zones with network integration similar to a standard roaming partner,\" the company said.</p>\n<p>Besides T-Mobile in the US, several carriers in other countries have signed up to use the direct-to-cell satellites. SpaceX said the other carriers are Rogers in Canada, KDDI in Japan, Optus in Australia, One NZ in New Zealand, Salt in Switzerland, and Entel in Chile and Peru.</p></div><p><a href=\"https://arstechnica.com/?p=1993408#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993408&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dd2157fe86d8f7a3d6fd4888b2a81f22219d8ccde2ebda5dc79c696f75c70bf9","category":"Tech"}