{"title":"รวมรีวิว iPhone 15 และ iPhone 15 Pro: USB-C คือจุดเด่น กล้องปรับปรุงขึ้นมาก","link":"https://www.blognone.com/node/135836","date":1695204640000,"content":"<div><div><div><p>สื่อต่างประเทศเริ่มออกรีวิว iPhone 15 และ iPhone 15 Pro แล้ว ก่อนเริ่มวางขายทั่วไปวันศุกร์ที่ 22 กันยายนนี้ การเปลี่ยนแปลงสำคัญของ iPhone ปีนี้ก็คือพอร์ต USB-C ที่มาแทน Lightning ขณะที่รุ่น Pro ก็จัดสเป็กเต็ม ปรับปรุงกล้อง บอดี้ไทเทเนียม และใส่ปุ่ม Action Button เข้ามา</p>\n<p>iPhone ปีนี้ยังใช้วิธีขายแบบแยกเป็นสองกลุ่ม คือรุ่นทั่วไป iPhone 15 และ iPhone 15 Plus ต่างกันที่ขนาดจอ 6.1 กับ 6.7 นิ้ว มีตัวเลือก 5 สี, ได้ Dynamic Island เป็นครั้งแรก, ชิป A16 Bionic</p>\n<p>ส่วนรุ่นบนสุดเรือธงคือ iPhone 15 Pro และ iPhone 15 Pro Max นอกจากขนาดจอที่ต่างกัน ยังมีความสามารถการซูมที่ต่างกัน 3x สำหรับ Pro และ 5x สำหรับ Pro Max, ชิป A17 Pro, จอ always-on, ปุ่มด้านข้าง Action Button และบอดี้ไทเทเนียมที่ทำให้เครื่องเบาลง ราคาขายเท่ากับ iPhone 14 ทุกคอนฟิก ยกเว้น iPhone 15 Pro Max ที่ตัดรุ่น 128GB ออกไป ทำให้ราคาเริ่มต้นสูงขึ้น</p>\n<p>ภาพรวมของรีวิวมองการเปลี่ยนแปลงเทียบกับรุ่นก่อนหน้า โดยบอกว่าถ้าเทียบกับ iPhone 14 อาจไม่เห็นการเปลี่ยนแปลงมากนัก แต่ถ้าเป็น iPhone 12 หรือ iPhone 13 จะเห็นความต่างพอสมควร</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6a577cd4f1957ef944bb9965cf65def6.jpg\" alt /></p>\n<h3>กล้อง</h3>\n<p>กล้องของ iPhone 15, iPhone 15 Plus อัพเกรดให้กล้องหลักเป็น 48MP พร้อมกับซูมออปติคัล 2x ทำให้ได้ภาพที่ละเอียดมากขึ้น เล่นกับการครอปภาพได้ดีขึ้น ตัวเลือกที่ตั้งค่าได้คือ 24MP กับ 48MP ในโหมด 1x ส่วนอัลตร้าไวด์ยังอยู่ที่ 12MP อีกลูกเล่นที่เพิ่มมาคือภาพโหมด Portrait สามารถแก้ไขจุดโฟกัสได้ในภาพที่ถ่ายไปแล้ว ขณะที่กล้องหน้าและโหมดวิดีโอนั้นคล้ายรุ่นเดิม</p>\n<p>ส่วนกล้องของ iPhone 15 Pro และ iPhone 15 Pro Max เพิ่มตัวเลือกทางยาวโฟกัส 35mm, 28mm และ 24mm เข้ามา ทำให้เหมาะกับผู้ใช้ที่คุ้นเคยการตั้งค่าในกล้องถ่ายรูป อีกจุดขายคือระยะซูมออปติคัลที่ 3x และ 5x สำหรับ Pro และ Pro Max ตามลำดับ ใช้การออกแบบที่สะท้อนแบบปริซึมไปเซ็นเซอร์ ทำให้โทรศัพท์ไม่ต้องเพิ่มความหนามากนัก เมื่อเทียบกับสมาร์ทโฟนซูมระยะไกลค่ายอื่น การทดสอบพบว่าแม้ในภาพระดับ 5x ก็สามารถเก็บรายละเอียดของภาพได้ดี แต่มีข้อดีข้อด้อยที่ต่างกัน หากเทียบกับ Galaxy S23 Ultra และ Pixel 7 Pro ขึ้นกับสภาพแสง รายละเอียดภาพ สีผิว การถ่ายภาพโคลสอัพ</p>\n<p>ขณะที่การถ่ายวิดีโอในรุ่น Pro โดยเฉพาะโหมด Cinematic ที่รองรับการซูมถึง 3x ได้รายละเอียดภาพและสีที่เป็นมาตรฐาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5bb28f25f5a3842b12c923cee339c25d.png\" /></p>\n<h3>แบตเตอรี่ ระยะเวลาใช้งาน และ USB-C</h3>\n<p>แบตเตอรี่อาจไม่ใช่จุดขายของ iPhone 15 ปีนี้ เพราะแอปเปิลบอกว่าระยะเวลาใช้งานนั้นเท่ากับรุ่น iPhone 14 ผลการทดสอบแบบใช้งานเว็บต่อเนื่องในรุ่น Pro อยู่ได้ประมาณ 11 ชั่วโมง ซึ่งดีกว่า iPhone 14 เล็กน้อย ส่วนการใช้งานทั่วไปตลอดทั้งวันพบว่าแบตเตอรี่ยังเหลือ</p>\n<p>USB-C ที่เป็นการเปลี่ยนแปลงสำคัญใน iPhone ปีนี้ ส่วนของ iPhone 15 นั้น แม้การส่งข้อมูลจะจำกัดความเร็วที่ USB 2.0 แต่การชาร์จรองรับ 27W รวมถึงการต่อจอที่ 4K60Hz ขณะที่ iPhone 15 Pro ได้ USB 3 ที่เร็วกว่า ในหลายรีวิวต่างบอกว่าคนที่ใช้อุปกรณ์แอปเปิลอื่นอยู่แล้ว จะพบว่าชีวิตดีขึ้นมาก เพราะไม่ต้องหาสาย Lightning มาใช้เฉพาะ iPhone อีกแล้ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3844a9a60d2662290810ef8c7d1a83ca.png\" alt /></p>\n<h3>ประเด็นอื่น</h3>\n<p>Action Button ซึ่งถูกแทนที่สวิตช์เปิด-ปิดเสียงด้านข้าง มีเฉพาะรุ่น Pro นั้น อาจต้องใช้ความเคยชินสักระยะ ปุ่มต้องออกแรงกดเล็กน้อย กรณีใช้เปิด-ปิดเสียงอาจทำให้ผู้ใช้งานงงว่าตอนนี้เปิดหรือปิดกันแน่ ซึ่งแอปเปิลก็แก้ปัญหาให้ Haptic Engine ตอบสนองแตกต่างกัน</p>\n<p>การเล่นเกม ซึ่งแอปเปิลบอกว่ารุ่น Pro มีการปรับปรุงชิป A17 Pro ให้รองรับการเล่นเกมความละเอียดสูง รวมถึง Ray Tracing ยังไม่สามารถรีวิวได้เพราะเกมยังไม่มีออกมาให้ทดสอบ</p>\n<p>iPhone 15 และ iPhone 15 Plus มีตัวเลือก 5 สี ซึ่งแม้แอปเปิลบอกว่าใช้เทคโนโลยีการขึ้นสีบอดี้แบบใหม่ แต่อาจไม่เห็นความต่างมากนักจากภายนอก จุดเด่นคือน้ำหนักเบาลงเมื่อเทียบกับรุ่นขนาดจอเท่ากันใน iPhone 11 ถึง iPhone 13 และยิ่งเป็นรุ่น Pro ที่ใช้วัสดุไทเทเนียม แม้<a href=\"https://www.blognone.com/node/135713\">ตัวเลข</a>อาจไม่ลดลงมาก แต่รีวิวส่วนใหญ่เห็นตรงกันว่ารู้สึกถึงความแตกต่างได้ชัดเจน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b2dbc7af14bcd1902ccfa6629470bade.png\" alt /></p>\n<p>ข้อสรุปจากหลายรีวิวเป็นดังนี้</p>\n<ul>\n<li><strong>iPhone 15:</strong> ได้ USB-C มีตัวเลือกหลายสี กล้องปรับปรุงมาก แต่จอยังได้ 60Hz และ USB 2.0</li>\n<li><strong>iPhone 15 Pro:</strong> ได้ USB-C กล้องปรับปรุงหลายอย่าง บอดี้ไทเทเนียมทำให้เครื่องเบาลง ปุ่ม Action button ยังต้องใช้ความคุ้นเคย ข้อเสียคือซูม 5x จำกัดเฉพาะรุ่น Pro Max ตัวเลือกสีก็ไม่หลากหลาย บางรีวิวบอกว่ามีแค่สีน้ำเงินที่เรียกว่าสีได้</li>\n</ul>\n<p>คะแนนรีวิว</p>\n<ul>\n<li><strong>CNET</strong> ให้ <a href=\"https://www.cnet.com/tech/mobile/apple-iphone-15-and-15-plus-review-pro-features-for-less/\">iPhone 15</a> คะแนน 8.9/10 ส่วน <a href=\"https://www.cnet.com/tech/mobile/apple-iphone-15-pro-and-15-pro-max-review-love-at-first-zoom/\">iPhone 15 Pro</a> ให้ 9.2/10</li>\n<li><strong>Engadget</strong> ให้ <a href=\"https://www.engadget.com/iphone-15-pro-max-review-apple-makes-a-strong-case-for-its-biggest-phone-130018980.html\">iPhone 15 Pro</a> คะแนน 93/100</li>\n<li><strong>Tom's Guide</strong> ให้ทั้ง <a href=\"https://www.tomsguide.com/reviews/apple-iphone-15\">iPhone 15</a> และ <a href=\"https://www.tomsguide.com/reviews/iphone-15-pro\">iPhone 15 Pro</a> ที่ 4/5</li>\n<li><strong>The Verge</strong> ให้<a href=\"https://www.theverge.com/23879619/apple-iphone-15-pro-max-review\">ทุก</a><a href=\"https://www.theverge.com/23879726/apple-iphone-15-plus-review\">รุ่น</a>ที่คะแนน 8/10</li>\n<li><strong>XDA</strong> <a href=\"https://www.xda-developers.com/iphone-15-pro-max-review/\">ให้คะแนน</a> 9/10</li>\n<li><strong>Wired</strong> <a href=\"https://www.wired.com/review/apple-iphone-15/\">ให้คะแนน</a> iPhone 15 ที่ 7/10</li>\n<li><strong><a href=\"https://petapixel.com/2023/09/19/the-iphone-15-pro-and-pro-max-review-for-photographers/\">PetaPixel</a></strong> ไม่มีคะแนน</li>\n</ul>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/review\">Review</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"dd2df381eefcf9e942f4b0ccfaef04371b9f208cfc03d188bdb6e01e4fd25329","category":"Thai"}