{"title":"Global state of the art of teaching life cycle assessment in higher education","link":"http://link.springer.com/10.1007/s11367-024-02319-5","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Purpose</h3>\n                      <p>Globally, there is an increased demand for education on life cycle assessment (LCA). In response, there has been an increase in course availability, but also a lack of clarity on the comprehensiveness of these offerings and the resulting student competencies.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>A global survey was conducted to obtain empirical evidence on teaching LCA. The survey explored the availability of LCA courses globally and the depth of the teaching, including expected core competencies and related teaching and learning workloads. A purposive sampling strategy was adopted wherein eligible participants were approached by the researchers.</p>\n                    </span>\n                    <span>\n                      <h3>Results and discussion</h3>\n                      <p>According to the survey, annually, over 10,000 students participate in more than 200 LCA courses. The results reflected the interdisciplinary nature of LCA with courses being taught across different disciplines, including engineering, chemical sciences, and economics. Estimated workload demands for achieving different competency levels were significantly lower than those estimated by an expert panel before. This may be attributed in part to respondents not accounting for the full workload beyond classroom interactions. Nonetheless, workload demands increased with competency levels.</p>\n                    </span>\n                    <span>\n                      <h3>Conclusions and recommendations</h3>\n                      <p>The results emphasize the need for a common understanding of LCA teaching with regard to content, literacy levels, and competencies to avoid false expectations of the labor and research markets in terms of available expertise. Therefore, LCA curriculum development and program planning remain significant challenges and essential tasks for the global LCA community.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"dd330acacd79d8fea23dca45df3a20e2825fa1d842ebdb16c42af57555da6ec1","category":"Environment"}