{"title":"Short-Term Evolution after Mitral Transcatheter Edge-to-Edge Repair: Clinical Value of Novel Echocardiographic Biomarkers","link":"https://www.preprints.org/manuscript/202405.0612/v1","date":1715262176000,"content":"Background. Transcatheter edge-to-edge repair (TEER) is a safe and effective treatment in symptomatic patients with mitral regurgitation (MR). We aimed to investigate the short-term impact of mitral TEER on left ventricular (LV) performance and identify echocardiographic prognostic indicators. Methods. Seventy-eight patients with severe MR (organic and functional etiologies) were included retrospectively. All patients had a baseline and short-term echocardi-ography after TEER and were followed up for the primary composite endpoint (heart failure hos-pitalization and cardiovascular death) over a median period of 13 months. Results. A significant decrease in left ventricular ejection fraction (LVEF), all myocardial work indices (except global wasted work), and left atrial reservoir were observed after TEER. Additionally, there was an im-provement in the pulmonary artery systolic pressure and tricuspid annular plane systolic excur-sion/pulmonary artery systolic pressure (TAPSE/PASP) ratio. 34% of all patients presented the primary composite endpoint. A TAPSE/PASP ratio post-TEER &lt; 0.47 (HR: 4.76, p-value = 0.039), and left atrial reservoir post-TEER &lt; 9.0% (HR: 2.77, p-value = 0.047) were independently associ-ated with the primary endpoint. Conclusions. Echocardiography post-TEER reflects impairment in ventricular performance due to preload reduction and right ventricular to pulmonary artery coupling improvement. Short-term echocardiography after TEER identifies high-risk patients who could benefit from a close clinical follow-up.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd39f33c1adfdcd35c417263fdcc5bdb4c7a90dc36f4c7d2fc43b6f2c12a91ec","category":"Interdisciplinary"}