{"title":"Exploring the causal relationship between airborne particulate matter and ulcerative colitis: A two-sample mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300066","date":1709906400000,"content":"<p>by Chong Fu, Qi Wang, Yan Chen, Yanping Zhang</p>\r\nBackground <p>Existing research has demonstrated links between airborne particulate matter and ulcerative colitis (UC) onset. Through Mendelian randomization, this study aims to further delineate the causal association between specific types of airborne particulates and UC.</p> Methods <p>A two-sample Mendelian randomization analysis was undertaken to investigate the causality between airborne particulate matter and UC. Genetic datasets for both airborne particulates and UC were derived from accessible genome-wide association studies (GWAS). We employed a range of MR techniques, such as inverse variance weighted (IVW), weighted median, MR-Egger, and Wald Ratio, to validate the causality. In addition, sensitivity assessments were executed to ensure result reliability.</p> Results <p>The data indicate a probable positive correlation between PM<sub>2.5</sub> exposure and UC risk (OR: 3.6; 95% CI: [1.2–11.3]; P = 0.026). The statistical strength for causal determination via the IVW approach stood at 0.87, with a Type I error rate set at 0.025. Assessments using Cochran’s Q test, MR-Egger intercept, MR-PRESSO, and leave-one-out sensitivity analyses did not identify notable heterogeneity, pleiotropy, or biases in the overall relationship between PM<sub>2.5</sub> and UC. Furthermore, the MR-Steiger assessment indicated that PM<sub>2.5</sub> exposure level determinants predominantly affect UC vulnerability.</p> Conclusion <p>The findings underscore the potential involvement of PM<sub>2.5</sub> in UC pathogenesis.</p>","author":"Chong Fu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dd4ed431d4384c2a30257a189e3ce4671dee1eeff88f54da2c1835cec287affd","category":"Interdisciplinary"}