{"title":"Impact of Fibrin Gel Architecture on Hepatocyte Growth Factor Release and Its Role in Modulating Cell Behavior for Tissue Regeneration","link":"https://www.preprints.org/manuscript/202406.0117/v1","date":1717467002000,"content":"A novel scaffold design has been created to enhance tissue engineering and regenerative medicine by optimizing the controlled, prolonged release of hepatocyte growth factor (HGF), a powerful chemoattractant for endogenous mesenchymal stem cells. We present a new stacked scaffold that is made up of three different fibrin gel layers, each of which has HGF integrated into the matrix. The design attempts to preserve HGF's regenerative properties for long periods of time, which is necessary for complex tissue regeneration. These multi-layered fibrin gels have been mechanically evaluated using rheometry, and their degradation behavior has been studied using D-Dimer ELISA. Understanding the kinetics of HGF release from this novel scaffold configuration is essential for understanding HGF's long-term sustained bioactivity. A range of cell-based tests were carried out to verify the functionality of HGF following extended incorporation. These tests included 2-photon microscopy using phalloidin staining to examine cellular morphology, SEM analysis for scaffold-cell interactions, and scratch and scatter assays to assess migration and motility. The analyses show that the novel stacking scaffold promotes vital cellular processes for tissue regeneration in addition to supporting HGF's bioactivity. This scaffold design was developed for in situ tissue engineering. Using the body as a bioreactor, the scaffold should recruit mesenchymal stem cells from their niche thus combining the regenerative abilities of HGF and MSCs to promote tissue remodeling and wound repair.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd54fd245aa05945dd93e098e2ce6f588e0b21456b7cae44f8df3b0ea7f1cfaf","category":"Interdisciplinary"}