{"title":"Apple To Halt Sales of Apple Watch Ultra 2 & Series 9: Explained","link":"https://www.dcrainmaker.com/2023/12/apple-to-halt-sales-of-apple-watch-ultra-2-series-9.html","date":1702921186000,"content":"<p><img title=\"AppleWatchSPO2.jpeg\" src=\"https://media.dcrainmaker.com/images/2023/12/AppleWatchSPO2.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>Apple has confirmed they’ll be halting sales of the <a href=\"https://www.dcrainmaker.com/2023/09/apple-watch-series-9-in-depth-review-a-sports-focus.html\">Apple Watch Series 9</a> and <a href=\"https://www.dcrainmaker.com/2023/09/apple-watch-ultra-2-in-depth-review-focused-sports-progress.html\">Apple Watch Ultra 2</a>, following a ruling this past October by the International Trade Commission that ruled in favor of a patent dispute with Masimo, a medical technology company (the original judge’s decision was last January, this was an appeal). That company has claimed that Apple violated its blood oxygen sensor technology in recent Apple Watch iterations, including the Series 9 and Apple Watch Ultra 2 (as well as numerous other past units, including the Apple Watch Series 6, Series 7, Series 8, and Apple Watch Ultra 1). This does not impact any sales outside the United States.</p>\n<p>Apple had one last option prior to halting sales, which was a presidential veto, but that hasn’t been taken up yet. That Presidential Review Period expires a week from now, on December 25th, 2023.</p>\n<h3><span><strong>Halting of Sales:</strong></span></h3>\n<p>However, Apple has announced they’ll pull the Apple Watch editions in the US, effective December 21st, 2023 at 3 PM US Eastern from their website. Then by December 24th, 2023, their US retail locations will no longer offer it for sale.  Note that this does not impact the Apple Watch SE, which doesn’t have the blood oxygen sensing technology in it.</p>\n<p>Now, the sales halt is a bit complicated in the near term, but more clear-cut once we get beyond December 25th, 2023. From now until that point, Apple can continue selling the device to both consumers and resellers (e.g., Amazon, Best Buy, etc…). However, beyond the 25th, Apple is unable to sell the impacted models to entities in the US. However, Apple confirmed this won’t impact 3rd party sales. Thus, any units that retailers have can still be sold after that date (e.g., Best Buy or Amazon can continue selling just fine till their stocks run out).</p>\n<p>Apple confirmed to DC Rainmaker, <a href=\"https://9to5mac.com/2023/12/18/apple-halting-apple-watch-series-9-and-apple-watch-ultra-2-sales/\">a statement originally given to 9to5Mac</a>, which states:</p>\n<blockquote><p>A Presidential Review Period is in progress regarding an order from the U.S. International Trade Commission on a technical intellectual property dispute pertaining to Apple Watch devices containing the Blood Oxygen feature. While the review period will not end until December 25, Apple is preemptively taking steps to comply should the ruling stand. This includes pausing sales of the Apple Watch Series 9 and Apple Watch Ultra 2 from Apple.com starting December 21, and from Apple retail locations after December 24.</p>\n<p>Apple’s teams work tirelessly to create products and services that empower users with industry-leading health, wellness, and safety features. Apple strongly disagrees with the order and is pursuing a range of legal and technical options to ensure that Apple Watch is available to customers.</p>\n<p>Should the order stand, Apple will continue to take all measures to return Apple Watch Series 9 and Apple Watch Ultra 2 to customers in the U.S. as soon as possible.</p></blockquote>\n<p>Note that Apple confirmed to DC RAINMAKER there’s no impact to existing/sold units in terms of the feature, it’s not going anywhere, nor being disabled in any way.</p>\n<h3><span><strong>The Technology:</strong></span></h3>\n<p>The technology in question here is Apple’s implementation of the blood oxygen sensing technology, which Masimo claims Apple first implemented within their <a href=\"https://www.dcrainmaker.com/2020/09/apple-watch-series-6-first-run-accuracy-spo2-sensor-data.html\">Apple Watch Series 6 watches back in September 2020</a>. However, Masimo’s lawsuit actually predates that, instead <a href=\"https://9to5mac.com/2020/01/09/apple-masimo-apple-watch-lawsuit/\">first launched in January 2020</a> over other heart-rate sensing portions and a meeting that was previously held between Apple and the company in 2013. The dispute was then brought forward to the International Trade Commission in June 2021. You can see the red pulse oxygen sensor LEDs on this Apple Watch Series 6:</p>\n<p><img title=\"AppleWatchSEries6Sensor.png\" src=\"https://media.dcrainmaker.com/images/2023/12/AppleWatchSEries6Sensor-1.png\" width=\"720\" height=\"479\" /></p>\n<p>As part of that case, Masimo said Apple had 103 violations across 5 different patents. Keeping in mind that a single patent can have numerous different ‘novel’ things inside of it. We saw this with the <a href=\"https://www.dcrainmaker.com/2023/04/injunction-request-against.html\">Wahoo/Zwift case earlier this year</a>, where a single patent ID has numerous claims within it. In this case, the ITC ruled that only five claims were violated, within two different patents.</p>\n<p>From a legal standpoint, there are still a few options left for Apple. Outside of a US presidential review change, Apple says they’re appealing ITC’s decision to the Federal Circuit, and further, a US Trade Representative can decide to disapprove ITC’s solutions for various reasons.</p>\n<p>Of course, Apple continues to state that they don’t believe they violated any patents, and further, has counter-filed two patent infringement lawsuits against Masimo a year ago, back in October 2022. As part of that effort, Apple was invalidating Masimo patents based on prior work that Masimo had patented. And in fact, this past September 2023, <a href=\"https://www.reuters.com/legal/litigation/us-court-upholds-rulings-apple-masimo-smartwatch-patent-fight-2023-09-12/\">Apple won an appeals court ruling to invalidate portions of a Masimo patent</a>.</p>\n<p>Now, I haven’t dug into the claims deep enough to make an informed decision about Masimo vs Apple. However, lawsuits have long been simmering between various device makers and medical sensor companies over the years. Both Masimo and Philips have had their fair share of attempting to sue or otherwise trigger investigations into Apple, <a href=\"https://www.usitc.gov/secretary/fed_reg_notices/337/337_1190_notice_01102020sgl.pdf\">Garmin, Fitbit</a>, and a slate of companies you’ve never heard of. Heck, the two have even sued each other. We saw Masimo sue Phillips over this very <a href=\"https://www.reuters.com/article/us-philips-masimo-verdict-idINKCN0HQ54W20141002/\">blood oxygen-sensing technology a decade ago,</a> winning a $466M judgment (which was eventually settled for $300M).</p>\n<p>And, it would seem that Masimo might be gearing up for another round of lawsuits too. A few months ago I received a note from a lawyer representing the company asking for clarifications regarding what I knew about the Epson running watch’s sensor (<a href=\"https://www.dcrainmaker.com/2014/08/pulsesense-activity-trackers.html\">from this post</a>):</p>\n<blockquote><p>“Hello Ray, My name is Rhett [redacted], and I am an attorney for Masimo. I would like to speak with you about an article you wrote in August 2014 in which you reviewed the Epson Pulsense. Specifically, I am looking to confirm the date and a few other details of your review. We are willing to compensate you for your time at your normal rate. Please let me know if you are available to speak sometime. I can be reached at [redacted]@knobbe.com or 949-xxx-xxxx.Thank you, Rhett [redacted]”</p></blockquote>\n<p>I typically don’t respond to legal requests from any company, so as to not get in the middle of things (and thus, I didn’t respond to this e-mail). Also, I thought it was slightly odd to confirm the date of the review, since it’s plainly listed on the page, as well as not ask about<a href=\"https://www.dcrainmaker.com/2015/03/epson-runsense-810-review.html\"> later watches/products with the same sensor</a> in it.</p>\n<p><img title=\"Epson.jpeg\" src=\"https://media.dcrainmaker.com/images/2023/12/Epson-1.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>This is notable because, at the time, it was very popular to license optical heart rate sensors from Phillips. However, the Epson running watches were unique in that Epson claimed to have fully developed their optical heart rate sensor in-house (and various discussions I had at the time certainly seemed to confirm that). In fact, their optical HR sensing accuracy was very good for the time in most cases, including in later units. Of course, Epson exited the GPS running market many years ago, after a short attempt (albeit a pretty impressive first go at the time).</p>\n<h3><strong>Going Forward:</strong></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb.jpg\" width=\"720\" height=\"480\" srcset=\"https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb.jpg 720w, https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb-200x132.jpg 200w, https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb-124x82.jpg 124w, https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb-300x200.jpg 300w, https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb-278x185.jpg 278w, https://media.dcrainmaker.com/images/2023/09/DSC_8277_thumb-125x83.jpg 125w\" /></p>\n<p>In any case, it’ll be interesting to see how this ends up. Certainly, with both Apple and Masimo having successfully had a few rounds land on each other’s plates recently, they may get to an agreement sooner. Perhaps Masimo thought Apple would come forward with a settlement rather than halt sales. Or perhaps Apple has another sensor option up its sleeve. Certainly, there are other ways to solve this problem, as other companies have shown. And further, this case has been on the slow roll for years since it’s not as though Apple was surprised by it. Perhaps Apple didn’t expect to lose the October ruling.</p>\n<p>Either way, if you’re in the US and aiming to pick up an Apple Watch Series 9 or Apple Watch Ultra 2, it’s likely things are about to get scarce quick. Somewhat impressive that retailers are bothering to keep running sales on them. With that – thanks for reading!</p>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you're shopping for the Apple Watch Series 9 or Apple Watch Ultra 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you shop with <a href=\"https://pros-closet.sjv.io/OrnmMN\">TPC (The Pro's Closet)</a>, you'll <b>save $40 on purchases over $200 with coupon code DCRAIN40</b>! The Pro's Closet has been a long-time partner of the site here - including sponsoring videos like my <a href=\"https://www.dcrainmaker.com/2022/06/cargo-bike-amsterdam-race-report-power.html\">cargo bike race</a>, as well as just being an awesome Colorado-based company full of good humans. Check them out with the links below and the <b>DCRAIN40</b> coupon!</p>\r\n\r\n\r\n\r\n\r\n\r\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2022/09/apple-watch-series-8-in-depth-sports-fitness-review.html\" target=\"_blank\">Apple Watch Series 9</a></h4><div><a href=\"https://www.amazon.com/Apple-Smartwatch-Midnight-Aluminum-Fitness/dp/B0CHX5R8BP?crid=2GMH67DQ2SKM9&amp;keywords=Apple%2Bwatch%2Bseries%2B9&amp;qid=1697584423&amp;sprefix=ap%2Caps%2C1460&amp;sr=8-3&amp;ufe=app_do%3Aamzn1.fos.c3015c4a-46bb-44b9-81a4-dc28e6d374b3&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=830b6de4195114d227958cefdee24dba&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"107\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/10/AppleWatchSeries9-Transparent-107x125.png\" srcset=\"https://media.dcrainmaker.com/images/2023/10/AppleWatchSeries9-Transparent-107x125.png 107w, https://media.dcrainmaker.com/images/2023/10/AppleWatchSeries9-Transparent-200x233.png 200w, https://media.dcrainmaker.com/images/2023/10/AppleWatchSeries9-Transparent-720x838.png 720w, https://media.dcrainmaker.com/images/2023/10/AppleWatchSeries9-Transparent.png 1289w\" /></a><span>On Sale!</span></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Apple-Smartwatch-Midnight-Aluminum-Fitness/dp/B0CHX7PGCS?crid=2GMH67DQ2SKM9&amp;keywords=Apple+watch+series+9&amp;qid=1697584423&amp;sprefix=ap%2Caps%2C1460&amp;sr=8-3&amp;ufe=app_do%3Aamzn1.fos.c3015c4a-46bb-44b9-81a4-dc28e6d374b3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=85a5c0d621f641b9fdf4383a5c3de421&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$390</span></a> </div></div><div><div><h4><a href=\"https://www.dcrainmaker.com/2023/09/apple-watch-ultra-2-in-depth-review-focused-sports-progress.html\" target=\"_blank\">Apple Watch Ultra 2</a></h4><div><a href=\"https://www.amazon.com/Apple-Cellular-Smartwatch-Precision-Extra-Long/dp/B0CHWYVS23?crid=2HXWS0SS6W4FE&amp;keywords=Apple+watch+ultra+2&amp;qid=1695813034&amp;sprefix=apple+watch+ultra+%2Caps%2C264&amp;sr=8-3&amp;ufe=app_do%3Aamzn1.fos.2b70bf2b-6730-4ccf-ab97-eb60747b8daf&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=9a6a25fb474ede92bccecaf342fed228&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"106\" height=\"125\" src=\"https://media.dcrainmaker.com/images/2023/09/AppleWatchUltra2AlpineLoopBlueTransparent-106x125.png\" srcset=\"https://media.dcrainmaker.com/images/2023/09/AppleWatchUltra2AlpineLoopBlueTransparent-106x125.png 106w, https://media.dcrainmaker.com/images/2023/09/AppleWatchUltra2AlpineLoopBlueTransparent-200x236.png 200w, https://media.dcrainmaker.com/images/2023/09/AppleWatchUltra2AlpineLoopBlueTransparent-720x851.png 720w, https://media.dcrainmaker.com/images/2023/09/AppleWatchUltra2AlpineLoopBlueTransparent.png 1269w\" /></a><span>On Sale!</span></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Apple-Cellular-Smartwatch-Precision-Extra-Long/dp/B0CHWYVS23?keywords=apple%2Bwatch%2Bultra&amp;qid=1700692618&amp;sr=8-1-spons&amp;ufe=app_do%3Aamzn1.fos.17d9e15d-4e43-4581-b373-0e5c1a776d5d&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-twitter-20&amp;linkId=c6de218c2596a43a1200982fb67d4f17&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$780</span></a> </div></div></div>\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p></div>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"dd5607d7e1a8d1d7a45ff366cfca999abc8352e716eb3b0c9493f9b76c523d51","category":"Cycling"}