{"title":"Filter feeders living on suspension feeders: New insights into the lifestyle and distribution of Arcturidae Dana, 1849 (Crustacea: Isopoda) around Iceland","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12826?af=R","date":1726247411000,"content":"<h2>Abstract</h2>\n<p>The focus of the present study was on arcturid isopods occurring in the subarctic region around Iceland. Data from two decades of sampling with an epibenthic sledge (EBS) during numerous expeditions of the BIOICE (Benthic Invertebrates of Icelandic Waters; 1992–2004) and IceAGE (Icelandic marine Animals: Genetics and Ecology; 2011—ongoing) projects were incorporated into an integrative taxonomy approach. This approach linked distribution records, morphological and molecular examinations, with video and image data observed during recent expeditions in 2018 (MSM75) and 2020 (SO276) using the Remotely Operated Vehicles (ROVs) PHOCA and Kiel 6000 from GEOMAR. The resulting dataset from 120 sampling locations included 6852 specimens, a large percentage of which were fixed in formalin during BIOICE. Ethanol-fixed specimens collected during IceAGE were used to link morphotypes with haplotypes and occurrence locations, focusing on the coral association of the genus <i>Astacilla</i> Cordiner, 1793. The IceAGE sampling was complemented by ROV image and video data and noninvasive sampling, making it possible to obtain pictures of living specimens of <i>A. longicornis</i>. The species <i>A. longicornis</i> Sowerby, 1806 showed a distribution linked to cold-water occurrence and was sampled from <i>Paramuricea placomus</i>. <i>Astacilla boreaphilis</i> Stranky &amp; Svavarsson, 2006, occurring only south of Iceland, showed high morphological variation in the spine pattern of adult females, while the molecular results indicated no clear pattern of potentially ongoing species radiation or cryptic species. <i>Astacilla granulata</i> was exclusively found north of Iceland. Thus, the species' distribution is potentially influenced by the Greenland-Faroe Ridge, which separates the North Atlantic from the Arctic Ocean.</p>","author":"Vivien Lukas Hartmann, \nEmanuel Pereira, \nNancy F. Mercado‐Salas, \nAnne‐Nina Lörz, \nJörundur Svavarsson, \nSaskia Brix","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"dd5b842c40aa97b20b7376ec9fffe1d86341c772a7e0f6d5b9bdc99501bad7c6","category":"Environment"}