{"title":"High prevalence of long-term olfactory disorders in healthcare workers after COVID-19: A case-control study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306290","date":1719842400000,"content":"<p>by Johannes Frasnelli, Arnaud Tognetti, Anja L. Winter, Evelina Thunell, Mats J. Olsson, Nina Greilert, Jonas K. Olofsson, Sebastian Havervall, Charlotte Thålin, Johan N. Lundström</p>\r\nBackground <p>More than a year after recovering from COVID-19, a large proportion of individuals, many of whom work in the healthcare sector, still report olfactory dysfunctions. However, olfactory dysfunction was common already before the COVID-19 pandemic, making it necessary to also consider the existing baseline prevalence of olfactory dysfunction. To establish the adjusted prevalence of COVID-19 related olfactory dysfunction, we assessed smell function in healthcare workers who had contracted COVID‐19 during the first wave of the pandemic using psychophysical testing.</p> Methods <p>Participants were continuously tested for SARS‐CoV‐2 IgG antibodies since the beginning of the pandemic. To assess the baseline rate of olfactory dysfunction in the population and to control for the possibility of skewed recruitment of individuals with prior olfactory dysfunction, consistent SARS-CoV‐2 IgG naïve individuals were tested as a control group.</p> Results <p>Fifteen months after contracting COVID‐19, 37% of healthcare workers demonstrated a quantitative reduction in their sense of smell, compared to only 20% of the individuals in the control group. Fifty-one percent of COVID‐19‐recovered individuals reported qualitative symptoms, compared to only 5% in the control group. In a follow-up study 2.6 years after COVID-19 diagnosis, 24% of all tested recovered individuals still experienced parosmia.</p> Conclusions <p>In summary, 65% of healthcare workers experienced parosmia/hyposmia 15 months after contracting COVID-19. When compared to a control group, the prevalence of olfactory dysfunction in the population increased by 41 percentage points. Parosmia symptoms were still lingering two-and-a half years later in 24% of SARS-CoV-2 infected individuals. Given the amount of time between infection and testing, it is possible that the olfactory problems may not be fully reversible in a plurality of individuals.</p>","author":"Johannes Frasnelli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dd60274befa12951f724a1fdea7d8166fb40a7f0eeb8133d3f34dbd70fda54d3","category":"Interdisciplinary"}