{"title":"Causes of Hospitalization in Children with Down Syndrome","link":"https://www.preprints.org/manuscript/202407.1003/v1","date":1720781377000,"content":"Background and Objectives: Down syndrome (DS) is the most common chromosomal disorder in the world. It is caused by the imbalance of the chromosomal constitution of 21, by free trisomy, translocation or mosaicism. Children and adolescents with Down syndrome have immune dysregulation and are more susceptible to infections. This study aims to evaluate hospitalizations of children and adolescents with DS in the pediatric ward of Botucatu Clinics Hospital (HCFMB), to classify the population of children included in the study regarding age, diagnosis, outpatient follow-up, length of stay and need for Intensive Care Unit (ICU). Thus, it will be possible to improve care for these children, aiming to reduce these hospitalizations. Materials and Methods: It was an observational, cross-sectional study, with retrospective data collection from the last 10 years of hospitalization, from January 2013 to December 2021, of children and adolescents with DS, in the pediatric ward, emergency room and ICU of HCFMB. Children hospitalized in this period in the pediatric ward and ICU, in the age range of 30 days to 15 years (age of acceptance for admission to this service) were included in this study. Those who at some point had the exclusion of the diagnosis of DS were excluded. The evaluation of comorbidities that culminated in the need for hospitalization in this population can be the focus of actions to improve diagnoses and conducts for this population, to prevent worsening and hospitalizations in future populations. Results: The statistical analysis of the data was performed. In this analysis, 80 children with DS were evaluated, with a total of 283 hospitalizations and it was noticed that 46 of them had more than one hospitalization in this period. The most prevalent age group was 1 to 3 years, and the main cause was due to problems in respiratory system (99 cases). Among respiratory causes, the main cause of hospitalization was due to pneumonia, in 50% of cases, followed by acute respiratory failure, in 14%. The average hospitalization time was 8 days and in 49 hospitalizations the children required the ICU. The main cause of hospitalization in the ICU was due to respiratory causes (36%), followed by cardiac malformations (14%). During the ICU hospitalizations, there were 13 deaths, and we observed a higher prevalence of heart conditions and, in some cases, positive urine cultures in these children. Conclusions: preventive actions, such as vaccinations and improved monitoring of these children, without outpatient follow-up or during hospitalization, should be carried out. Thus, it has been developed a proposal for a risk score for mortality in children and adolescents with DS admitted to the ICU, and those patients with five or more points should be monitored more closely. A meeting will be held with the genetics, cardiology, and pediatric ICU teams to discuss this score and propose a surveillance plan for these patients at the HCFMB and potentially for the pediatric community in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd636d389523224eba6b0082b629902396c48f835d9fd3e7b6361ae6c88e0ec4","category":"Interdisciplinary"}