{"title":"How Mahomes’ Chiefs Beat Hurts’ Eagles in Super Bowl 2023","link":"https://www.espn.com/nfl/story/_/id/35649198/how-patrick-mahomes-chiefs-played-perfect-second-half-super-bowl-2023-nfl-win-jalen-hurts-eagles","date":1676325109000,"content":"\n<p>Bill Barnwell, writing for ESPN:</p>\n\n<blockquote>\n  <p>One good way to measure offensive dominance is down set\nconversion rate, which looks at every time a team took the ball\non first down and sees whether it turned that series into a first\ndown or a touchdown. The Chiefs converted 93.8% of their first\ndowns into another first down or a touchdown in the second half,\nand the only reason they didn’t hit 100% is because <a href=\"https://www.espn.com/nfl/player/_/id/16782/jerick-mckinnon\">Jerick\nMcKinnon</a> slid down on the 1-yard line to set up the\ntitle-winning field goal. ESPN has data going back through 2000,\nand no team has ever done that in <a href=\"https://www.espn.com/nfl/insider/story/_/id/35649386/making-case-chiefs-eagles-super-bowl-lvii-greatest-ever\">the second half of a Super\nBowl before</a>. Just three teams have done it in the second\nhalf of <em>any</em> playoff game.</p>\n\n<p>There’s a lot to get to with this Super Bowl, but let’s start\nthere. How did the Chiefs pull off a flawless second half on\noffense? After watching this game live and again a second time,\nthere are a few things that stood out.</p>\n</blockquote>\n\n<p>Fantastic recap/breakdown of yesterday’s game. Long story short: the Chiefs spooked the Eagles with motion that convinced the Eagles to commit to busting up would-be jet sweeps, and instead threw the ball to players in now-uncovered zones. The Chiefs were literally perfect in the second half and needed to be to win the game.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/02/13/super-bowl-barnwell\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"5dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"dd69dd8fe06bfdaf7a012b5b6e11c665ba5a6e176f1ee68e39a204","category":"Tech"}