{"title":"Fungal Methane Production Under High Hydrostatic Pressure in Deep Subseafloor Sediments","link":"https://www.preprints.org/manuscript/202408.0914/v1","date":1723547941000,"content":"Fungi inhabiting deep subseafloor sediments have been shown to possess anaerobic methane (CH₄) production capabilities under atmospheric conditions. However, their ability to produce CH₄ under in situ conditions with high hydrostatic pressure (HHP) remains unclear. Here, Schizophyllum commune 20R-7-F01, isolated from ~ 2 km below the seafloor, was cultured in Seawater Medium (SM) in culture bottles fitted with sterile syringes for pressure equilibration. Subsequently, these culture bottles were transferred into 1-liter stainless steel pressure vessels at 30 °C for 5 days to simulate in situ HHP and anaerobic environments. Our comprehensive analysis of bioactivity, biomass, transcriptomics revealed that S. commune not only survived but significantly enhanced CH₄ production, reaching approximately 2.5 times higher levels under 35 MPa HHP compared to 0.1 MPa standard atmospheric pressure. Pathways associated with carbohydrate metabolism, methylation, hydrolase activity, cysteine and methionine metabolism, and oxidoreductase activity were notably activated under HHP. Specifically, key genes involved in fungal anaerobic CH₄ synthesis, including methyltransferase mct1 and dehalogenase dh3, were upregulated 7.9- and 12.5-fold, respectively, under HHP. Enhanced CH₄ production under HHP was primarily attributed to oxidative stress induced by pressure, supported by intracellular Reactive Oxygen Species (ROS) levels and comparative treatments with cadmium chloride and hydrogen peroxide. These findings suggest that fungi persisting in deep-sea sediments over millions of years have the potential to significantly contribute to global CH₄ flux.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd6a44285a2bf76e84e338b232ddb646d7b93454638d736972e783c1632a7c5b","category":"Interdisciplinary"}