{"title":"Herpesviruses steal one cell’s protein, use it to infect another","link":"https://arstechnica.com/?p=1814480","date":1637506852000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Virus-replication-center-800x800.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Virus-replication-center.jpg\">Enlarge</a> <span>/</span> Herpesviruses getting ready to infect new cells. (credit: <a href=\"https://www.usgs.gov/media/images/chelonid-herpesvirus-5-replication\">Thierry Work, USGS</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One of the defining features of viruses is that they rely on host proteins in order to reproduce. A host cell will often copy viral genes into RNAs and then translate those RNAs into proteins, for example. Typically, a mature virus that's ready to spread to another cell has little more than viral proteins, the virus's genetic material, and maybe some of the host's membrane. It doesn't need much else; all the proteins it needs to reproduce further should be present in the next cell it infects.</p>\n<p>But some data released this week may have found an exception to this pattern. Members of the herpesvirus family appear to latch on to a protein in the first cell they infect and then carry this protein along with them to the next cell. This behavior might be helpful because of the normal targets of herpesviruses—neurons, which have a very unusual cell structure.</p>\n<h2>A long way to the nucleus</h2>\n<p>Like other viruses, herpesviruses start off by infecting cells that are exposed to the environment. But from there, they move on to nerve cells, where they take up residency, persisting even when there's no overt indications of infection. These infected cells then serve as a launching point for re-establishing active infections, causing lifetime problems for anyone unfortunate enough to have been infected.</p></div><p><a href=\"https://arstechnica.com/?p=1814480#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814480&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dd73edf55dfad040d353b19197544b0db5ea7c712a9de3dd8eb10f477bc3a67b","category":"Tech"}