{"title":"PlayStation เผย 10 เกม Live Service ที่กำลังพัฒนาอยู่จะแตกต่างจากเกมที่มีอยู่แล้วในตลาด","link":"https://www.blognone.com/node/133658","date":1683019675000,"content":"<div><div><div><p>ก่อนหน้าหน้าทาง <strong>PlayStation</strong> ได้เสริมทัพทีมพัฒนาเกมโดยซื้อกิจการเข้ามา อย่าง <strong>Bungie</strong>, <strong>Haven Studio</strong> และ <strong>Firewalk Studios</strong> ซึ่งตอนนี้ PlayStation Studios กำลังพัฒนาเกมประเภท Live Service อยู่ประมาณ 10 เกม ในวันนี้ทาง PlayStation ได้ออกมาประกาศเพิ่มเติมว่าเกมที่พวกเขากำลังพัฒนาอยู่นั้นจะแตกต่างจากที่มีอยู่ในอุตสาหกรรม ไม่ว่าจะเป็นแนวเกมหรือกลุ่มผู้เล่น</p>\n<p>คำกล่าวนี้มาจากคุณ Herman Hulst <strong>หัวเรือใหญ่แห่ง Sony Interactive Entertainment Worldwide Studios</strong> ที่ให้สัมภาษณ์กับทาง <strong>Gamesindustry.biz</strong> ว่า “ตอนนี้มันค่อนข้างเสี่ยงที่พูดถึงเกมแบบ Live Service เพราะเหมือนกับว่าเกมที่มีอยู่ตอนนี้มีประเภทเดียว และ ลักษณะการทำธุรกิจก็มีประเภทเดียวเช่นกัน ซึ่งทาง PlayStation Studios กำลังพัฒนาเกมสำหรับ Live Service อยู่ โดยวางเป้าหมายไว้ว่าจะแตกต่างทั้งแนวเกม, กำหนดการ และ ขนาดของเกม” คุณ Herman Hulst ยังกล่าวอีกว่า “เรากำลังสร้างเกมสำหรับกลุ่มเป้าหมายที่แตกต่าง และผมมั่นใจจากผลงานที่ผ่านมาที่การสร้างโลก และเรื่องราว ที่แฟน ๆ PlayStation รัก”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/54635d946de2cc94421d008e56e3d0a0.jpg\" /></p>\n<p>คุณ Hulst ได้อธิบายเพิ่มเติมว่าทุกสตูดิโอที่ PlayStation ที่ซื้อกิจการเข้ามานั้นมีแนวทางเป็นของตัวเอง บางบริษัทก็ทำงานกับ PlayStation มานานหลายปีในฐานะหุ้นส่วนภายนอกก่อนที่จะซื้อกิจการเข้ามา และการซื้อกิจการเพิ่มนั้นจะเกิดขึ้นหรือไม่ ขึ้นอยู่กับโซนีว่ามีเป้าหมายหรืออยากเติบโตไปทางไหน อย่างไร ซึ่งการเป็นส่วนหนึ่ง PlayStation Studios นั้นจะช่วยให้การทำงานร่วมกันกับ Studios ที่มีอยู่ทั่วโลก ในแง่ของเทคโนโลยี และบริการต่าง ๆ สำหรับการสร้างเกม ซึ่งทำให้ทุกสตูดิโอมีเป้าหมายเดียวกันคือ การสร้างเกมที่ดีที่สุดเท่าที่จะทำได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/082dc8fd7b778fd61e8929c04346f4c6.jpg\" /></p>\n<p>ในตอนนี้ PlayStation กำลังเร่งพัฒนาเกม Live Service อยู่มากกว่า 10 เกม ซึ่งวางแผนว่าจะปล่อยเกมเหล่านี้ภายในปี 2026 โดยหนึ่งในนั้นมีเกมของ Naughty Dog ที่อยู่ในจักรวาลเดียวกับ The Last of Us</p>\n<p>ที่มา - <a href=\"https://www.gamesindustry.biz/playstation-our-live-service-games-will-target-different-genres-release-schedules-and-audiences\">Gamesindustry.biz</a> via <a href=\"https://www.ign.com/articles/playstations-10-live-service-games-will-be-from-different-genres-and-for-different-audiences\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/sony\">Sony</a></div><div><a href=\"/topics/firewalk-studios\">Firewalk Studios</a></div><div><a href=\"/topics/bungie\">Bungie</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"dd838054f2bbdff45fbe431f8be8c5a40ad6f27d75b21ae11bbad239b2f1f22b","category":"Thai"}