{"title":"New – Amazon EFS Intelligent-Tiering Optimizes Costs for Workloads with Changing Access Patterns","link":"https://aws.amazon.com/blogs/aws/new-amazon-efs-intelligent-tiering-optimizes-costs-for-workloads-with-changing-access-patterns/","date":1630597262000,"content":"<p><a href=\"https://aws.amazon.com/efs\">Amazon Elastic File System</a> (Amazon EFS) offers four storage classes: two Standard storage classes, Amazon EFS Standard and <a href=\"https://aws.amazon.com/blogs/aws/optimize-storage-cost-with-reduced-pricing-for-amazon-efs-infrequent-access/\">Amazon EFS Standard-Infrequent Access</a> (EFS Standard-IA), and two One Zone storage classes, <a href=\"https://aws.amazon.com/blogs/aws/new-lower-cost-one-zone-storage-classes-for-amazon-elastic-file-system/\">Amazon EFS One Zone</a>, and Amazon EFS One Zone-Infrequent Access (EFS One Zone-IA). Standard storage classes store data within and across multiple availability zones (AZ). One Zone storage classes store data redundantly within a single AZ, at 47 percent lower price compared to file systems using Standard storage classes, for workloads that don’t require multi-AZ resilience.</p> \n<p>The EFS Standard and EFS One Zone storage classes are performance-optimized to deliver lower latency. The Infrequent Access (IA) storage classes are cost-optimized for files that are not accessed every day. With EFS lifecycle management, you can move files that have not been accessed for the duration of the lifecycle policy (7, 14, 30, 60, or 90 days) to the IA storage classes. This will reduce the cost of your storage by up to 92 percent compared to EFS Standard and EFS One Zone storage classes respectively.</p> \n<p>Customers love the cost savings provided by the IA storage classes, but they also want to ensure that they won’t get unexpected data access charges if access patterns change and files that have transitioned to IA are accessed frequently. Reading from or writing data to the IA storage classes incurs a data access charge for every access.</p> \n<p>Today, we are launching Amazon EFS Intelligent-Tiering, a new EFS lifecycle management feature that automatically optimizes costs for shared file storage when data access patterns change, without operational overhead.</p> \n<p>With EFS Intelligent-Tiering, lifecycle management monitors the access patterns of your file system and moves files that have not been accessed for the duration of the lifecycle policy from EFS Standard or EFS One Zone to EFS Standard-IA or EFS One Zone-IA, depending on whether your file system uses EFS Standard or EFS One Zone storage classes. If the file is accessed again, it is moved back to EFS Standard or EFS One Zone storage classes.</p> \n<p>EFS Intelligent-Tiering optimizes your costs even if your workload file data access patterns change. You’ll never have to worry about unbounded data access charges because you only pay for data access charges for transitions between storage classes.</p> \n<p><strong><u>Getting started with EFS Intelligent-Tiering</u></strong><br /> To get started with EFS Intelligent-Tiering, create a file system using the <a href=\"https://console.aws.amazon.com/efs/home?#/file-systems/create\">AWS Management Console</a>, enable <strong>lifecyle management</strong> and set two lifecycle policies.</p> \n<p>Choose a <strong>Transition into IA</strong> option to move infrequently accessed files to the IA storage classes. From the drop down list, you can choose lifecycle policies of 7, 14, 30, 60, or 90 days. Additionally, choose a <strong>Transition out of IA</strong> option and select <strong>On first access</strong> to move files back to EFS Standard or EFS One Zone storage classes on access.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/31/2021-efs-int-1.png\" /></p> \n<p>For an existing file system, you can click the <strong>Edit</strong> button on your file system to enable or change lifecycle management and EFS Intelligent-Tiering.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/31/2021-efs-int-2.png\" /></p> \n<p>Also, you can use the <code>PutLifecycleConfiguration</code> API action or put-lifecycle-configuration command specifying the file system ID of the file system for which you are enabling lifecycle management and the two policies for EFS Intelligent-Tiering.</p> \n<pre><code>$ aws efs put-lifecycle-configuration \\\n   --file-system-id File-System-ID \\\n   --lifecycle-policies \"[{\"TransitionToIA\":\"AFTER_30_DAYS\"},\n     {\"TransitionToPrimaryStorageClass\":\"AFTER_1_ACCESS\"}]\"\n   --region us-west-2 \\\n   --profile adminuser\n</code></pre> \n<p>You get the following response:</p> \n<pre><code>{\n  \"LifecyclePolicies\": [\n    {\n        \"TransitionToIA\": \"AFTER_30_DAYS\"\n    },\n    {\n        \"TransitionToPrimaryStorageClass\": \"AFTER_1_ACCESS\"\n    }\n  ]\n}</code></pre> \n<p>To disable EFS Intelligent-Tiering, set both the <strong>Transition into IA</strong> and <strong>Transition out of IA</strong> options to <strong>None</strong>. This will disable lifecycle management, and your files will remain on the storage class they’re on.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/08/31/2021-efs-int-3.png\" /></p> \n<p>Any files that have already started to move between storage classes at the time that you disabled EFS Intelligent-Tiering will complete moving to their new storage class. You can disable transition policies independently of each other.</p> \n<p>For more information, see <a href=\"https://docs.aws.amazon.com/efs/latest/ug/lifecycle-management-efs.html\">Amazon EFS lifecycle management</a> in the Amazon EFS User Guide.</p> \n<p><strong><u>Now Available</u></strong><br /> Amazon EFS Intelligent-Tiering is available in all AWS Regions where Amazon EFS is available. To learn more, join us for the third annual and completely free-to-attend <a href=\"https://pages.awscloud.com/AWS-Storage-Day-2021.html\">AWS Storage Day 2021</a> and tune in to our livestream on the <a href=\"https://www.twitch.tv/aws\">AWS Twitch channel</a> today.</p> \n<p>You can send feedback to the <a href=\"https://forums.aws.amazon.com/forum.jspa?forumID=222\">AWS forum for Amazon EFS</a> or through your usual AWS Support contacts.</p> \n<p>– <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"dd85a53bc1d0ce06fbd866e91a057532c639f3292244bed652bf96b2bc40f1d5","category":"Tech"}