{"title":"ScRNA-seq Unveils the Functional Characteristics of Glioma-Associated Macrophages and the Regulatory Effects of Chlorogenic Acid on the Immune Microenvironment—A Study Based on Mouse Models and Clinical Practice","link":"https://www.preprints.org/manuscript/202408.0392/v1","date":1722918141000,"content":"Glioma is the most common primary malignant brain tumors. Despite advances in surgical techniques and treatment regimens, the therapeutic effects remain unsatisfactory. Immunotherapy has brought new hope to glioma patients, but the immunosuppressive nature of the tumor microenvironment (TME) has limited the therapeutic outcomes. This study aims to reveal the subpopulations and functional characteristics of tumor-associated macrophages (TAMs), to explore the regulatory effects of chlorogenic acid on the immune microenvironment, and investigate its potential for clinical application. In this study, Chlorogenic acid slowed tumor growth in the mouse model and extended the survival time of the mice. ScRNA-seq analysis elucidated the differentiation trajectories and functional characteristics of BMDMs and microglia, revealing the regulatory effects of chlorogenic acid on these two populations. It enhanced the antigen-presenting function of macrophages and the gene expression related to T-cell immune activation, activated microglia through the JAK-STAT pathway, and improved antitumor functions. Using the target prediction database, a PPI and molecular docking model were constructed, confirming the good affinity of chlorogenic acid with STAT1. A case of a patient treated with chlorogenic acid was reviewed, who survived for 5 years and 6 months, achieved partial remission (PR) after 9 months of treatment, and remains alive with no new symptoms or toxic side effects. Our study revealed the subtypes and differentiation trajectories of tumor-associated macrophages. Chlorogenic acid significantly improved the immune microenvironment of glioma by modulating the function of bone marrow-derived mono-macrophages (BMDMs) and microglia, demonstrating good antitumor effects. This study provides new insights for targeting the regulation of the TME and offers theoretical and practical support for the clinical application of chlorogenic acid.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd89b856428418fc379a7df092030fe1a060ba0c61868ead35383611ccf5a863","category":"Interdisciplinary"}