{"title":"Google might already be replacing some Ad sales jobs with AI","link":"https://arstechnica.com/?p=1992648","date":1703181263000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google-800x523.jpg\" alt=\"A large Google logo is displayed amidst foliage.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Sean+Gallup\">Sean Gallup | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google is wrapping its head around the idea of being a generative AI company. The \"<a href=\"https://arstechnica.com/information-technology/2023/01/fearing-chatgpt-google-enlists-founders-brin-and-page-in-ai-fight/\">code red</a>\" called in response to ChatGPT has had <a href=\"https://arstechnica.com/google/2023/05/google-at-i-o-2023-weve-been-doing-ai-since-before-it-was-cool/\">Googlers scrambling</a> to come up with AI features and ideas. Once all the dust settles on that work, Google might turn inward and try to \"optimize\" the company with some of its new AI capabilities. With artificial intelligence being the hot new thing, how much of Google's, uh, <em>natural</em> intelligence needs to be there?</p>\n<p>A report at <a href=\"https://www.theinformation.com/articles/google-plans-ad-sales-restructuring-as-automation-booms\">The Information</a> says that AI might already be taking people's jobs at Google. The report cites people briefed on the plans and says Google intends to \"consolidate staff, including through possible layoffs, by reassigning employees at its large customer sales unit who oversee relationships with major advertisers.\" According to the report, the jobs are being vacated because Google's new AI tools have automated them. The report says a future restructuring was apparently already announced at a department-wide Google Ads meeting last week.</p>\n<p>Google announced a \"<a href=\"https://blog.google/products/ads-commerce/ai-powered-ads-google-marketing-live/\">new era of AI-powered ads</a>\" in May, featuring a \"natural-language conversational experience within Google Ads, designed to jump-start campaign creation and simplify Search ads.\" Google said its new AI could scan your website and \"generate relevant and effective keywords, headlines, descriptions, images, and other assets,\" making the Google Ads chatbot one part designer and one part sales expert.</p></div><p><a href=\"https://arstechnica.com/?p=1992648#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992648&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dd8c50cbb26da2f510e57dac49f8a0948e030b42348e6e2c4901f52813ca4e7d","category":"Tech"}