{"title":"Characterization of small-scale net fisheries off the coast of Guyana","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306332","date":1719583200000,"content":"<p>by Rovindra Lakenarine, Netra Chhetri, Neha Chhetri, Jesse Senko</p>\r\n\r\nFish stocks have declined rapidly over the past half-century due to the increased demand for seafood and unsustainable fishing practices. The incidental capture of non-target species (bycatch) is a pervasive issue in fisheries management and has led to population declines in non-target species worldwide. The fisheries sector in Guyana currently supports the livelihoods of over 10,000 Guyanese and contributes approximately 2% to the country’s GDP. Bycatch is believed to be a major threat to Guyana’s marine fisheries, especially the small-scale sector, due to a lack of management infrastructure and limited data and monitoring. Here, we assessed bycatch in Guyana’s artisanal gillnet and Chinese seine fisheries through vessel observations and semi-structured interviews with local fishers. Most of the discarded species documented had no commercial importance to the fisheries in Guyana. Although no statistical difference was observed among the bycatch rates in the gillnet and Chinese seine fisheries, the latter generally had more discarded individuals, most of which were juveniles. The Shannon-Weiner diversity index showed a greater diversity of bycatch species in the gillnet fisheries compared to the Chinese seine. Jaccard’s similarity index indicated a low similarity among the gear types. Even though most fishers were aware of bycatch, they did not view it as a major issue and were not interested in reducing their discards. We recommend a collaborative approach in exploring solutions to ensure the ecological and socioeconomic sustainability of the fisheries sector.","author":"Rovindra Lakenarine","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dd903a9026a578b1b7c2a15ee338ee6cde33d568cd1018248d8b0fbf0138f220","category":"Interdisciplinary"}