{"title":"Microbial Protein Production using Lignocellulosic Biomass and Nitrogen Fixation","link":"https://www.preprints.org/manuscript/202404.0213/v1","date":1712065282000,"content":"The expanding global population has increased the demand for sustainable protein sources, and microbial protein (MP) has emerged as a promising alternative. However, conventional carbon (glucose) and nitrogen (ammonia, urea) sources needed for MP production pose environmental and economic issues. This study aims to produce protein using lignocellulosic biomass (LCB) as a carbon source and the nitrogen fixation ability of Klebsiella oxytoca M5A1 as a nitrogen source. The study investigates the pretreatment of LCB (switchgrass), enzymatic hydrolysis, protein quantification, and high-performance liquid chromatography system (HPLC) analysis to track glucose utilization and organic acid production. K. oxytoca M5A1 harnessed free nitrogen from the atmosphere through nitrogen fixation and used abundant, cheap glucose from LCB to produce MP and organic acids as by-products. Protein production occurred in two phases: first within the initial 8 hours and secondly, within the last 16 hours. The highest protein concentration was at 40 hours, with approximately 68.3% protein content. HPLC analysis revealed a dynamic profile of glucose utilization and organic acids (Lactic acid, Propionic acid, Acetic acid, and Succinic acid). K. oxytoca M5A1 exhibited an early high rate of glucose consumption, and conversion to organic acids that were later used for second-phase protein production. The acids profile revealed intra-conversion from one acid to another via metabolic pathways (glycolysis and tricarboxylic acid cycle). Overall, leveraging LCB and the nitrogen-fixing ability of K. oxytoca M5A1 for MP production offers an eco-friendly and cost-effective alternative to traditional protein sources, contributing to a sustainable circular economy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd91fab246ed96ab7656584dfcaadb455472a981b4c570443453164dc6ecda48","category":"Interdisciplinary"}