{"title":"Potential of Using Entomopathogenic Fungi for Controlling Colorado Potato Beetle (Leptinotarsa decemlineata Say.) Populations Under Climate Change","link":"https://www.preprints.org/manuscript/202409.1754/v1","date":1727081575000,"content":"This article presents the results of isolating and identifying EPF species and screening thermotolerant and highly virulent EPF strains that are promising for controlling Colorado potato beetle populations. Soil samples were collected from southern Kazakhstan for the isolation of fungi used in the experiments. Using the insect bait method, 41 isolates of EPF were obtained from the soils of southern Kazakhstan. PCR analysis based on ITS and TEF loci (elongation factor Ef1a) showed that all the isolates belong to the species B. bassiana. However, analysis of the ITS locus revealed two cryptic species: B. bassiana and B. pseudobassiana. No other fungal species were detected, likely due to the insufficient informativeness of the ITS and TEF loci in distinguishing species. Further studies with other loci are required. As a result of selecting natural isolates for virulence and thermotolerance, the following strains were identified: B13, B14, B15, B22, B23, B24, B25, B23-23, Bc4, Bc7, and Bc8. These strains showed high virulence (100% on the 11th day after treatment) and tolerance to suboptimal temperatures (+15°C and +30°C). Therefore, they are considered the most promising for use in the context of climate change. The data suggest that, despite the source of the isolates, EPF have great potential for controlling Colorado potato beetle populations, as the majority of isolates lead to fatal outcomes. Their geographical origin primarily influences their temperature preferences, which negatively affect their effectiveness in field conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dd946674133e98765639ed231ef625b97dc9d7e7a51efe73e1d9dabd5c4d9eb0","category":"Interdisciplinary"}