{"title":"‘It’s a good time now’ – Mitch Docker is retiring without regrets","link":"https://cyclingtips.com/2021/05/its-a-good-time-now-mitch-docker-is-retiring-without-regrets/","date":1621382840000,"content":"<p>Mitch Docker has announced that 2021 will be his final year in the pro peloton. The 34-year-old from Melbourne hopes to end his 13-year professional career on the Roubaix velodrome in October. </p>\n\n\n\n<p>“I could go on for a few years and be at the same point I am now,” he tells me. “I would still be happy and motivated but I have reached the point of no regrets. And I want to avoid the point that I start to hate doing another pull at the front of the peloton.” </p>\n\n\n\n<p>Docker’s career started with a stint as a stagiaire for French team Ag2r at the <a href=\"https://cyclingtips.com/2020/02/the-chaos-tour-the-bike-race-that-had-it-all-but-almost-never-happened/\" target=\"_blank\">2005 Herald Sun Tour</a>. It was a week after his 19th birthday and he was in his first year at university. </p>\n\n\n\n<p>“After a successful season in Europe Simon Gerrans came over to this race to win it,” Docker recalls. “Back then it was in October. It was before the Tour Down Under existed [in its current form] and quite a prestigious race. The Ag2r team only allowed him to bring five guys with him. We had shared the same trainer John Beasley and I got a spot on that team.</p>\n\n\n\n<p>“I could do things that week I never thought I could and it was probably my best Sun Tour ever. I was like a sponge taking in as much knowledge from the pros that I could.” </p>\n\n\n<p>    </p><div>\n    <div>\n\t<em>Follow the link for an <a href=\"https://cyclingtips.com/2020/02/the-chaos-tour-the-bike-race-that-had-it-all-but-almost-never-happened/\" target=\"_blank\">in-depth look back at the 2005 Herald Sun Tour</a>, a race filled with chaos and drama, and that almost never happened.</em>    </div>\n    </div>\n\t<p></p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/CORVOS_00017059-346-1340x893.jpg\" /><figcaption>Mitch Docker at the 2011 Paris-Roubaix. </figcaption></figure>\n\n\n\n<p>Docker ended up with Drapac-Porsche the year after and signed with European team Skil-Shimano in 2009. He would start his first Paris-Roubaix that year. A defining moment in his career came two years later in the 2011 edition of the Cobbled Classic. </p>\n\n\n\n<p>“That day I found myself with the best riders in the world and realized I was one of them,” he says. “It was a breakthrough year for me <em>[Docker finished sixth in Gent-Wevelgem two weeks before – ed.]</em>. I remember seeing my wife at sector seven and that was such a special moment too. I felt like I could do this, I could be part of the professional peloton.” Docker finished a solid 15th that day.</p>\n\n\n\n<p>Roubaix has always been a key moment in Docker’s season, a beacon on the horizon when things were tough. There would always be Roubaix. The paradox, however, was that after that top-15 result his role in the team changed. He would have to empty the tank for someone else when he joined GreenEdge in 2012 and later with EF Education First-Drapac in 2018. “I knew I could never ride a Roubaix like I did on Skil-Shimano,” he says. “I could never be that free anymore.”</p>\n\n\n\n<p>The cobbles in the north of France are close to Docker’s heart and he hopes to end his career there. He is not sure if he will ride the race for EF Education-Nippo but knows he will be ready if happens. “Even if I win the race, I will retire,” he says with a smile. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/CORVOS_00026932-180-1340x893.jpg\" /><figcaption>Mitch Docker and Mathew Hayman.</figcaption></figure>\n\n\n\n<p>Not surprisingly the most important lesson in Docker’s pro career also came from the most gruelling and beautiful of Spring Classics. He raced with Mat Hayman the day the Australian won in 2016 and it was Hayman who gave him a valuable life lesson.</p>\n\n\n\n<p>“Mat told me to always keep riding in Roubaix,” Docker says. “If you crash, have a flat, whatever, always keep riding. You never know what happens in Paris-Roubaix and you can find yourself at the front [after crashes and mechanicals]. I try to apply this to all my races.</p>\n\n\n\n<p>“You can think after a setback that there will always be next week but if you do this every week, you run out of next weeks at the end of the year. You have a whole season of next weeks and no results. Further on in your career you tend to get complacent but I always tried to race with the mindset of ‘keep riding’ because you don’t know what happens in a race.” </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CO9-NR9F4w6/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CO9-NR9F4w6/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Mitch Docker (@mitchbowen)</a></p></div></blockquote> \n\n\n\n<p>Docker announced his retirement on Instagram on Monday and was blown away by the responses he got. </p>\n\n\n\n<p>“People told me they had enjoyed watching me on TV and I thought ‘When was that? I am never even on TV!’” he says with a laugh. “It’s just great that people appreciate you for what you did, for the insights you gave them at some point. You know your teammates appreciate your work but it’s nice to know you were seen by others too.</p>\n\n\n\n<p>“I never did it for the thank you’s but that little pat on the back feels good. It’s nice to see I had an effect in the peloton and was noticed.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Kramon_Vuelta2019_st6_3756-1340x754.jpeg\" /></figure>\n\n\n\n<p>Docker doesn’t have an extensive race program this year but feels that might be a good way to transition back to life after cycling. </p>\n\n\n\n<p>“Due to COVID, the strict protocols and all the extra costs that come with it, the [EF Education-Nippo] team are focusing on the bigger WorldTour races and don’t ride as many smaller races,” Docker explains. “It seems like a budget thing but it’s OK. It feels like a good way to transition from 80-90 race days to life back in Australia next year.” </p>\n\n\n\n<p>Docker plans to move back from Spain to Melbourne, Australia after this season with his wife and two children. He hasn’t been home in over 18 months.</p>\n\n\n\n<p>“It’s a good time now,” he says. “I could have continued and was motivated to go on but I also like going back home and see my parents still in good health and enjoying their grandkids. It might be a little bruise to the ego from being a pro athlete to not being that anymore though.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/CORVOS_00026252-037-1340x894.jpg\" /><figcaption>Mitch Docker at the 2016 Paris-Nice.</figcaption></figure>\n\n\n\n<p>Docker has always been a valued domestique on every team he has ridden for. Although he has never won a big Classic or a Grand Tour stage, he looks back at what he achieved with pride. </p>\n\n\n\n<p>“I got to represent Australia at four world championships and at the Commonwealth Games,” he says. “That was a proud moment because you know you are from one of the strong countries and are one of the strongest riders. It means you did something right!” </p>\n\n\n\n<p>With Docker, a stand-out mullet and moustache leaves the peloton, but his experience, stories and insights will hopefully remain for the audience of his podcast, <a href=\"https://lifeinthepeloton.com/\" target=\"_blank\">Life in the Peloton</a>. Perhaps he could now call it Life After the Peloton. Either way, Docker doesn’t want to lock himself into a post-racing career just yet.</p>\n\n\n\n<p>“I love making podcasts,” he says. “The whole process of preparation, researching and interviewing is great but I don’t know if Life <em>in</em> the Peloton is a good name for when I am no longer in the peloton. I would also like to try my hand at commentary although I realize it’s probably not as easy as it seems,” he says with a smile. </p>\n\n\n\n<p>“I don’t know yet what I will do next year. I will try different projects. Maybe I will stay in the sport or do something completely different. I don’t know yet.” </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/its-a-good-time-now-mitch-docker-is-retiring-without-regrets/\">‘It’s a good time now’ – Mitch Docker is retiring without regrets</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ddad15ebf44457bbc6721b903650a26a081fb5183f951c86babac3186f7c5b3b","category":"Cycling"}