{"title":"Phenotypic characterization of Guraghe and Jimma cattle breeds in Ethiopia: Implications for breed differentiation and <i>in-situ</i> conservation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303559","date":1716300000000,"content":"<p>by Amine Mustefa, Tesfalem Aseged, Hizkel Kenfo, Kebebew Hunde</p>\r\n\r\nThe aim of this study was to phenotypically characterize Guraghe and Jimma cattle breeds at the farm level and quantify the relationships between them. Eight morphometric measurements and sixteen morphological traits were recorded for a total of 313 (221 females and 92 males) randomly selected adult cattle from three purposively selected districts. Univariate and multivariate analysis procedures of Statistical Analysis Software (SAS 9.0) were used to analyze the data. Clear morphological and morphometric variations were not observed between the two cattle breeds. All of the studied cattle populations possessed straight-edged ears, a sloppy rump profile, and straight face and back profiles. Moreover, the majority of the studied cattle possess widely spaced curved horns, red-colored uniform body color patterns, and erected small humps located at the cervicothoracic position. In addition to their phenotypic similarities, multivariate analysis also failed to reveal significant differences between the two breeds. These results suggest the inseparable nature of the two cattle breeds. However, such similarities in phenotypic traits between the two cattle breeds do not necessarily indicate genetic similarities. Therefore, further genetic characterization is recommended to quantify the degree of genetic relationship between the breeds. In the meantime, it is recommended to design breed-specific in situ conservation as well as genetic improvement programs that consider cattle breeds as one. Furthermore, an inclusive and uniform breed name that can represent the two cattle populations is obtained from the country’s steering committee for indigenous animal genetic resources.","author":"Amine Mustefa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ddbccbea1ad8c40ee72126db89d9d097beedd0d877d18b7abf83d2891a8c22a4","category":"Interdisciplinary"}