{"title":"Colistin-resistance genes in <i>Escherichia coli</i> isolated from patients with urinary tract infections","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305431","date":1718200800000,"content":"<p>by Waleed M. Al Momani, Nour Ata, Ahmed O. Maslat</p>\r\nBackground <p>The incidence of antimicrobial resistance is alarmingly high because it occurs in humans, environment, and animal sectors from a “One Health” viewpoint. The emergence of plasmid-carried mobile colistin-resistance (<i>MCR</i>) genes limits the efficacy of colistin, which is the last-line treatment for multidrug resistance (MDR) against gram-negative infections.</p> Objectives <p>The current study aimed to investigate emergence of colistin-resistance (<i>MCR</i> 1–5) genes in <i>E</i>. <i>coli</i> isolated from patients with urinary tract infections (UTIs) in Jordan.</p> Methods <p><i>E</i>. <i>coli</i> (n = 132) were collected from urine specimens. The <i>E</i>. <i>coli</i> isolated from human UTI patients were examined the resistance to colistin based on the presence of <i>MCR</i> (1–5). All isolates were tested against 20 antimicrobials using the standard disk diffusion method. The broth microdilution technique was used to analyze colistin resistance. In addition, the <i>MCR</i> (1–5) genes were detected using multiplex PCR.</p> Results <p>Out of the 132 isolates, 1 isolate was colistin-resistant, having a minimum inhibitory concentration of 8 μg/mL and possessing <i>MCR</i>-1. All the <i>E</i>. <i>coli</i> isolates showed high resistance to penicillin (100%), amoxicillin (79.55%), cephalexin (75.76%), nalidixic acid (62.88%), tetracycline (58.33%), or cefepime (53.79).</p> Conclusion <p>To our knowledge, this is the first report on the presence of plasmid-coded <i>MCR</i>-1 in <i>E</i>. <i>coli</i> from a patient with UTIs in Jordan. This is a problematic finding because colistin is the last-line drug for the treatment of infections caused by MDR gram-negative bacteria. There is a crucial need to robustly utilize antibiotics to control and prevent the emergence and prevalence of colistin-resistance genes.</p>","author":"Waleed M. Al Momani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ddbe7e765d0db2dfd09aa04bf91575f0c23eb9396844e236fa1589cd2a7de158","category":"Interdisciplinary"}