{"title":"Phytohormonal regulation determines the organization pattern of shoot aerenchyma in greater duckweed (Spirodela polyrhiza)","link":"https://academic.oup.com/plphys/article/195/4/2694/7634782?rss=1","date":1711324800000,"content":"<span><div>Abstract</div>Airspace or aerenchyma is crucial for plant development and acclimation to stresses such as hypoxia, drought, and nutritional deficiency. Although ethylene-mediated signaling cascades are known to regulate aerenchyma formation in stems and roots under hypoxic conditions, the precise mechanisms remain unclear. Moreover, the cellular dynamics underlying airspace formation in shoots are poorly understood. We investigated the stage-dependent structural dynamics of shoot aerenchyma in greater duckweed (<span>Spirodela polyrhiza</span>), a fast-growing aquatic herb with well-developed aerenchyma in its floating fronds. Using X-ray micro-computed tomography and histological analysis, we showed that the spatial framework of aerenchyma is established before frond volume increases, driven by cell division and expansion. The substomatal cavity connecting aerenchyma to stomata formed via programmed cell death (PCD) and was closely associated with guard cell development. Additionally, transcriptome analysis and pharmacological studies revealed that the organization of aerenchyma in greater duckweed is determined by the interplay between PCD and proliferation. This balance is governed by spatiotemporal regulation of phytohormone signaling involving ethylene, abscisic acid, and salicylic acid. Overall, our study reveals the structural dynamics and phytohormonal regulation underlying aerenchyma development in duckweed, improving our understanding of how plants establish distinct architectural arrangements. These insights hold the potential for wide-ranging application, not only in comprehending aerenchyma formation across various plant species but also in understanding how airspaces are formed within the leaves of terrestrial plants.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"ddc957b13a2dd4340dbb250c75a35a69b0e8f6a9be94bb3f948f47c0b07aa6c5","category":"Environment"}