{"title":"Women's Tour of Scandinavia 2023 - route, contenders and predictions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/womens-tour-of-scandinavia-2023-route-contenders-and-predictions","date":1692700005000,"content":"\n      <p>After a week-long break post-<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">World Championships</a>, the Women’s WorldTour calendar resumes on Wednesday August 23, 2023, with the second edition of the Tour of Scandinavia or ‘Battle of the North’. While this particular iteration of the event is in its second year, the race has been held since 2014 in its former guise as the Tour of Norway.</p>\n<p>The idea behind the ‘Battle of the North’ was to bring together the interests of Norway, Denmark, and Sweden to host a multinational stage race that the organisers hoped to extend to six or more days. Unfortunately, road racing in Sweden has taken a hit in recent years due to financial and bureaucratic restraints meaning that not only will this race not cross its border, but the longstanding Vårgårda Westsweden races have also been axed from the calendar. The absence of Swedish stages means that the Tour of Scandinavia moves from a six-day event across three countries in 2022 to a five-day race across two – Norway and Denmark – in 2023.</p>\n<div></div>\n<h3><strong>Stage one: Mysen - Halden, 124.6km</strong></h3>\n<p><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ToSc-stage1-2023.png?v=1692633998\" alt /></strong></p>\n<p>The first stage of the Tour of Scandinavia 2023 starts in Halden, where the fourth stage of last year’s race ended. It is also a town that has been part of the race since its inception in 2014. Last year Alexandra Manly of Jayco Alula took the win in the bunch kick ahead of Chloe Hosking, and the profile of this opening stage is flatter still, making it even more likely that the bunch will come to the line intact. The two QOM points look unlikely to deter the sprinters, but the finishing circuit – which the riders will tackle three times – includes a punchy 1.5km climb that could catch some out or even provide a launchpad for a late break. </p>\n<h3><strong>Stage two: Vikersund - Norefjell, 150.5km</strong></h3>\n<p><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ToSc-stage2-2023.png?v=1692634009\" alt /></strong></p>\n<p>A summit finish atop Norefjell has become a fixture of this race since it returned to the calendar after Covid in 2021, and the climb provided the launchpad for Cecilie Uttrup Ludwig’s winning move in 2022. This year, however, they approach the Norefjell summit from a slightly different route, taking in the challenging 10km Djupsjøveien climb before the finish line 5km beyond the summit. Even with the gradients easing off towards the top, the climb will likely force the GC hopefuls into action and will prove decisive in the overall competition.</p>\n<h3>Stage three: Kongsberg - Larvik, 134.9km</h3>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ToSc-stage3-2023-1.png?v=1692634026\" alt /></p>\n<p>There is no rest for the riders after the Norefjell finish, with stage three bringing a lumpy point-to-point towards the coast of Norway before the race heads to Denmark for the final two stages. The host towns are new additions to the race, with the start in Kongsberg giving way to a relatively calm start to the day before the peloton takes on the first categorised climb after 50km of racing. The profile continues its lumpy traverse towards Larvik, where the riders must tackle a steep 1.4km rise to the finish, which is sure to favour a punchier rider. </p>\n<h3><strong>Stage four: Herning - Herning (ITT), 16.4 km</strong></h3>\n<div><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ToSc-stage4-2023_1024x1024.png?v=1692634040\" /></div>\n<p>Stage four presents the first time a time trial has been included in this race. With the addition of a time trial stage at the Tour de France Femmes and other stage races following suit, the prayers of the time trialists of the bunch have been answered this season, and GC riders have had to spend more time on their time trial bikes. The 16.4km route around the town of Herning is a course for the time trial purists with very little in the way of climbing. The only challenge is the technical corners around the town centre. The GC riders will have to ensure they do not lose time on their rivals. </p>\n<h3><strong>Stage 5: Middelfart - Haderslev, 143.9km</strong></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ToSc-stage5-2023-3.png?v=1692634053\" alt /></span></p>\n<p><span>The fifth and final stage is the second-longest of the race and one of the flattest. Starting in the picturesque coastal town of Middelfart, the peloton heads along the primarily flat roads of central Denmark via the Lillebælt bridge on their way to Haderslev, where they will complete three laps of a 7.5 km finishing circuit. </span></p>\n<h3><strong>Contenders </strong></h3>\n<p><span>Last year’s winner, Cecilie Uttrup Ludwig, will be looking to defend her Tour of Scandinavia overall title. The FDJ-SUEZ rider has had a quieter season by her high standards but showed her current form at the World Championships, where she rode to third place behind the formidable SD Worx duo of Lotte Kopecky and Demi Vollering. While the Norefjell climb was where the Danish rider made her winning move in 2022, she is a rider who also thrives on punchy climbs and will be looking for time on those stages. The time trial, however, might be the 27-year-old’s biggest hurdle in the quest to defend her overall win.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/BA9I2790-scaled.jpg?v=1692633665\" /></span><em><span>Cecilie Uttrup Ludwig was last year's Tour of Scandinavia winner </span></em></p>\n<p><span>One rider who will be looking forward to the time trial is Annemiek van Vleuten. In one of her final races as a pro, the former winner of the Tour of Norway will be looking to make use of the form she claimed she was unable to unleash due to multiple mechanicals at the World Championships road race. Van Vleuten hasn’t shown her usual dominance in 2023, not even making the GC podium at the Tour de France Femmes, but she will want to claim as many victories to add to her tally of over 100 before her career is out. As a rider who prefers a long climb to split the race up, the Norefjell climb is her best chance at gaining time on her GC rivals and as the Olympic time trial champion, stage four won’t phase her either. <br /><br />Van Vleuten is also surrounded by a strong Movistar team with Danish rider Emma Norsgaard – winner of stage six of the Tour de France Femmes – who can challenge in sprints or from a break, and another Tour stage winner in Liane Lippert for whom the punchy stages are well suited.</span></p>\n<p><span>SD Worx has yet to release their lineup for the race, but if Tour de France Femmes winner Demi Vollering takes to the start line, she will be the favourite to win. However, after a tough programme consisting of the Tour and World Championships, Vollering appears to be enjoying some downtime racing criteriums in the Netherlands alongside newly-crowned world champion Lotte Kopecky and European champion Lorena Wiebes. Marlen Reusser is also unlikely to race after the statement she made at the World Championships around her exhaustion from being overworked this season. SD Worx will likely take some of their younger – but no less talented – riders to this race, such as Blanka Vas, Niamh Fisher Black and Anna Shackley. The latter two are strong climbers who may find themselves in contention on Norefjell, while Vas has proven her sprinting prowess at both the Tour de Suisse Women and the World Championships road race, where she took the U23 title from a sprint. </span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/BA9I3570-scaled.jpg?v=1692633759\" /></span><em><span>Marianne Vos won four out of six stages in last year's race</span></em></p>\n<p><span>Elsewhere, Lidl-Trek has a GC hopeful in the form of Amanda Spratt, with the backing of her compatriot Brodie Chapman returning to racing after a fraught season. Jayco Alula brings a strong climbing pair with Ane Santesteban and Urška Žigart and a sprint hopeful in the form of Ruby Roseman-Gannon. If Jumbo-Visma brings former Tour of Norway winner Marianne Vos, she will be a favourite for the punchier stages. And Fenix-Deceuninck, who have had their best season to date, have the surprise of Christina Schweinberger in their midsts should they choose to take her. <br /></span></p>\n<h3><strong>Prediction</strong></h3>\n<p><span>Annemiek van Vleuten will be on the hunt for one of the final GC victories of her career, especially without having taken the Tour de France Femmes title around which she focused her season. With a strong Movistar squad around her and a course that suits her strengths, it’s hard to look past Van Vleuten for the overall win. That is unless SD Worx brings along Demi Vollering or Marlen Reusser. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ddd8826dcadfbdadbb675a730ad3caef8bafba0f8a9ef8a171bbe6700255629b","category":"Cycling"}