{"title":"Different dynamics and controls of enzyme activities of leaf and root litter during decomposition","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14500?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5fd396c8-3edf-4c1a-abc1-26e614a26270/fec14500-toc-0001-m.png\" alt=\"Different dynamics and controls of enzyme activities of leaf and root litter during decomposition\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/05/relative-effects-of-litter-soil-and-microbial-attributes-on-enzyme-activities-vary-with-decomposition-process-under-a-subtropical-land-use-change/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLitter enzyme dynamics are strongly shaped by litter, soil and microbial attributes during decomposition; however, the enzyme dynamics of leaf and root litter remain unresolved due to contrasting differences in rates and controls on leaf and root litter decomposition.\n\nHerein, we conducted a 784-day field experiment to evaluate the relative importance of litter, alkaline soil and microbial attributes to enzyme activities and their C:N:P stoichiometry of leaf and root litter during decomposition under subtropical land use change in China.\n\nWe found that only the C- and N-acquiring enzyme activities of shrub leaves were greater than those of wood and crop, and there was no significant difference in P-acquiring enzyme activity among the three species of leaves. Both the C- and P-acquiring enzyme activities of crop roots were significantly lower than those of afforested lands (i.e. woodland and shrubland). The N-acquiring activities of wood roots were significantly lower than those of shrub and crop. At the temporal dynamics, the C-, N- and P-acquiring enzyme activities of the leaves decreased with mass loss, which was affected by the shift in litter nutrients (e.g. N and P) and soil moisture during decomposition. In contrast, the three enzyme activities of roots increased with mass loss, largely due to the increase in microbial biomass of bacteria regulated by litter stoichiometry. The enzymatic C:nutrient (N and P) ratios declined with mass loss, but the enzymatic P:N ratios remained relatively constant with mass loss during the leaf litter decomposition. Whereas, both of the enzymatic C:nutrient ratios and enzymatic P:N ratios decreased with mass during the root litter decomposition. Our results showed that the enzymatic C:N:P stoichiometry of decaying leaves and roots was predominantly predicted by microbial biomass and bacterial biomass, respectively.\n\nOverall, we outlined the pattern of contrasting contributions of litter, soil and microbial attributes to enzyme dynamics during decomposition, which provided a framework for better understanding litter C, N and P dynamics in relation to microbial resource allocation strategy during decomposition.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/05/relative-effects-of-litter-soil-and-microbial-attributes-on-enzyme-activities-vary-with-decomposition-process-under-a-subtropical-land-use-change/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Chunyan Long, \nFan Yang, \nQiong Chen, \nQian Zhang, \nXiaoli Cheng","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"ddf2f6b0b6770ca8f757c254e1a416d8d5d2705b8095b328cdd32500fe44b16e","category":"Environment"}