{"title":"Former Apple Engineer's Mimestream Gmail Client for Mac Gets Official Launch, Free Beta Access to End Tomorrow","link":"https://www.macrumors.com/2023/05/25/mimestream-gmail-client-macos-released/","date":1685005913000,"content":"Mimestream, the Gmail client for macOS founded by former Apple Mail engineer Neil Jhaveri, this week ended more than two years of beta development with the official release of <a href=\"https://mimestream.com/blog/mimestream-launches\">Mimestream 1.0</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/mimestream-1-0.jpg\" alt width=\"1600\" height=\"800\" />\r<br />\nAs a native app written in Swift and designed with AppKit and SwiftUI for a clean, stock appearance, Mimestream's UI will be familiar to many Apple Mail users, but the app is exclusively for accessing Gmail (support for other services is being considered).\r<br />\n\r<br />\nMimestream uses the Gmail API rather than a standard IMAP connection to support features like categorized inboxes, aliases and signatures, server-side filters, templates, labels, vacation responses, mentions, undo send, archive, and more. \r<br />\n\r<br />\nSupport for multiple Gmail accounts is included with a unified inbox, and the app integrates fully with macOS to offer system-level notifications, system-level <a href=\"https://www.macrumors.com/guide/ios-dark-mode/\">Dark Mode</a> support, keyboard shortcuts, swipe gestures, and linking email profiles to Focus Filters.\r<br />\n\r<br />\nAmong <a href=\"https://mimestream.com/blog/whats-new-in-1.0\">several new features</a> for its 1.0 release, Mimestream also supports Profiles, so separate Gmail accounts can be divided into \"Work\" and \"Personal,\" for example, and different icons and colors can be assigned to them. There's also a Mimestream menu bar item for quickly checking for unread messages without opening the app.\r<br />\n\r<br />\n<div></div>\r<br />\nDuring its lengthy free beta phase, more than 220 updates and over 100 features were added to the app, and the startup has expanded from its original solo developer to a five-person team. \r<br />\n\r<br />\nNow that beta development has ended, it's becoming a <a href=\"https://mimestream.com/pricing/\">paid-for client</a>. Mimestream 1.0 is $4.99 per month or $49.99 per year, but the annual plan is being offered at a discounted launch price of $29.99 for the first year until June 9. A free <a href=\"https://mimestream.com/download\">14-day trial</a> is also available, with no credit card required.\r<br />\n\r<br />\nOf the more than 167,000 people who have been using the app in beta in macOS 12 or later, access to the app will expire on May 26, 2023, but users will be able to move onto the 14-day trial in Mimestream 1.0 to try the new features. For users on macOS 11 or 10.15, the existing beta versions will <a href=\"https://mimestream.com/blog/macOS-12-required\">continue to work on those OS versions</a>. Interested users can check the <a href=\"https://portal.productboard.com/mimestream/1-mimestream-roadmap/tabs/4-planned\">company's roadmap</a> to learn about what else is planned for the app.<div>Tag: <a href=\"https://www.macrumors.com/guide/gmail/\">Gmail</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/25/mimestream-gmail-client-macos-released/\">Former Apple Engineer's Mimestream Gmail Client for Mac Gets Official Launch, Free Beta Access to End Tomorrow</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/former-apple-engineers-mimestream-gmail-client-for-mac-gets-official-launch-free-beta-access-to-end-tomorrow.2390478/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ddf4221149acb957433ff1e51c68e548a73a270e4e7747bc4a427d856fcb1f3e","category":"Apple"}