{"title":"Knowledge of female genital cutting among health and social care professionals in Francophone Belgium: A cross-sectional survey","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002225","date":1721311200000,"content":"<p>by Sarah O’Neill, Fabienne Richard, Sophie Alexander, Isabelle Godin</p>\r\n\r\nThe provision of optimal, equitable and gender-sensitive health-care to women and girls with FGM/C is challenging. Research indicates that health-professionals in receiving countries lack knowledge, confidence and competence in managing FGM/C. In order to develop policies that are suitable to the wide heterogeneity of women from FGM/C practising groups, it is paramount to identify what appropriate care might consist of and what are the knowledge gaps of health and social-care providers. The study-objective was to gain an understanding of the knowledge and practices of professionals working in the area of health in Francophone Belgium where no previous KAP has been done. An anonymous questionnaire with 24 questions was developed targeting healthcare and social-care professionals. The questionnaire was distributed between 6 May and 30 August 2021 via professional organisations for midwifery, social work, GPs, infectious disease specialists, paediatricians and gynaecologists. The results are presented as frequencies, differences in proportions between groups were tested with Pearson’s Chi-square, when applicable. Correlations were tested by the Pearson correlation coefficient. The threshold of statistical significance is 5%. Four-hundred-and-sixty individuals filled in the questionnaire of which 42% were medical-doctors, 6% nurses, 27% midwives and 25% non-medical professionals (social-workers and psychologists). 55% of non-medical professionals had provided support for women with FGM/C. Almost 40% of health-professionals knew that there were 4 types of FGM and were able to correctly describe them, 15% were unable to correctly describe any of the 4 types. Those who had already provided care for women with FGM/C were more numerous to know that there were 4 types (52%). Two health-professionals had received requests to perform FGM/C. Twenty-seven midwives and medical-doctors had received requests for re-infibulation. Growing numbers of health and social-care professionals are providing care for women with FGM/C. However, knowledge of FGM/C is suboptimal. Continuous professional training is crucial.","author":"Sarah O’Neill","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"ddf54d70115e895ec3c099aa0357721d1096edbb3f56ae9428a37582ebe734fd","category":"Environment"}