{"title":"Management of Post-Surgical Pain and Postural Dysfunction Through Focused Mechano-Acoustic Vibrations: a Pilot Observational Study","link":"https://www.preprints.org/manuscript/202410.1832/v1","date":1729683084000,"content":"Background/Objectives: Nowadays there is a progressive increase in surgical interventions in the fields of cardiology and oncology. This situation increasingly involves the need to identify strategies for managing complications that may affect patients in the post-surgical period, during the rehabilitation phase. Among the symptoms most frequently encountered in this context are pain and postural dysfunction, for which a decisive support could derive from the application of Focused Mechano-Acoustic Vibrations (FMAVs) therapy. Methods: In this pilot observational study, 20 patients (12 women and 8 men; average age of 48 years) who underwent cardiac or oncological surgery were observed during the execution of a FMAVs treatment protocol applied in the post-operative period. Patients were evaluated at the beginning and at the end of the protocol through the Numeric Pain Rating Scale (NPRS) and the computerized postural analysis for the calculation of the Postural Biometric Index (PBI), that quantifies postural dysfunctions. All patients were treated with 8 biweekly sessions of FMAVs applied on specific Myofascial Trigger Points (MTrPs). Results: At the end of the protocol, significant reductions of 26.4% for pain detected by NPRS and 17.9% for postural dysfunction detected by PBI were observed. Conclusions: Treatment with FMAVs can determine improvements in pain and postural dysfunction in cardiac and oncological patients subjected to surgery. This preliminary study lays the foundation for further in-depth research on the topic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ddf829d8da361b2fb8193bc9df1c94f0be21e1d953e0df7082b2c4ca806b5633","category":"Interdisciplinary"}