{"title":"PSV-9 Effects of increasing amounts of high-oleic or conventional soybeans in diets fed to mid-lactation dairy cows on measures of dry matter intake and lactation","link":"https://academic.oup.com/jas/article/102/Supplement_2/336/7665064?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of the study was to determine effects of increasing amounts of conventional (CONV) or high-oleic (HO) soybean in diets fed to mid-lactation dairy cows on dry matter intake (DMI) and performance. Rumen and duodenally cannulated cows (n = 8) were split into two groups and placed in a split-plot design. The whole plot factor was type of soybean (CONV vs. HO) and was provided to cows in a crossover arrangement so that each cow was provided both types of soybeans throughout the experiment. The subplot factor was amount of soybeans (0, 4, 8, 12%). Each group of cows receiving the same type of soybean were placed in a 4 x 4 Latin square with treatment sequences balanced for carryover effects. Diets were formulated to contain 18.5% crude protein and to slightly exceed requirements for ruminally degradable protein. Additions of soybeans replaced soybean meal and soybean hulls so that diets provided similar amounts of soy-based protein and fiber. During the last 4 d of each 14-d period, spot samples of feed, orts, and milk were collected together with measures of milk production and feed intake. Data were analyzed using the MIXED procedure of SAS. There were no interactions of soybean type and amount on lactation or DMI except for measures of milkfat, milk energy concentration and milkfat yield. Increasing amounts of HO resulted in a quadratic response in milkfat and energy concentration together with measures of milkfat yield. Specifically, these measures were greater (<span>P</span> ≤ 0.02) when cows were fed diets containing 4 and 8% HO compared with diets containing 0 or 12% HO; increasing amounts of CONV had no impact (<span>P</span> ≥ 0.32) on milkfat and energy concentration or milkfat yield. Measures of milk yield were not affected by type or amount of soybean (<span>P</span> ≥ 0.54), but measures of energy corrected milk yield (ECM) tended to respond differently to increasing amounts of soybean from either CONV or HO (<span>P</span> = 0.07). Interestingly, ECM responded quadratically (<span>P</span> = 0.02) to increasing amounts of HO but not to increasing amounts of CONV (<span>P</span> ≥ 0.58). Overall, however, ECM tended (<span>P</span> = 0.06) to be slightly greater with HO compared with CONV (42.5 vs. 41.1 kg/d). Yet, DMI was also greater (<span>P</span> ≤ 0.01) with HO compared with CONV (26.6 vs. 24.4 kg/d). Differences in DMI, therefore, resulted in a tendency (<span>P</span> = 0.07) for greater efficiency of ECM production when cows were fed CONV vs. HO. Overall, treatments had no effect on measures of milk protein, urea-nitrogen, solids-not-fat or lactose concentrations or yields. These data seem to indicate that performance responses among lactating cows to increasing amounts of HO are dynamic but that responses to CONV are not.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ddfa6d21abc85bd56da287b410fa8fbd075bf965c3cc63dbc1eff03c2a0ee2c2","category":"Environment"}