{"title":"Effect of seasonal changes in temperature on capture efficiency in the blue mussel, Mytilus edulis, fed seston and microplastics","link":"https://onlinelibrary.wiley.com/doi/10.1111/ivb.12446?af=R","date":1729242285000,"content":"<h2>Abstract</h2>\n<p>Suspension-feeding bivalve molluscs are dominant benthic fauna in many near-shore environments, with phytoplankton often being their main prey type. Feeding, which involves hydrosol filtration and mucociliary processes to capture particles and process them for digestion, occurs at low Reynolds numbers. Changes in water temperature have been shown to affect feeding processes of bivalves as a result of altered physiological processes or temperature-dependent changes in kinematic viscosity of water. Most studies, however, have focused on feeding rates and have manipulated temperature under laboratory conditions. In this study, experiments were conducted using ambient seawater and acclimatized blue mussels, <i>Mytilus edulis</i>, to examine particle capture efficiency over a 1-year period. During this period, water temperature decreased from ~18°C to 5°C with a concomitant increase in viscosity of ~41%. The capture of a wide variety of bacteria and phytoeukaryotes (0.8–8 μm), as well as two sizes of polystyrene microspheres (1 and 6 μm), was quantified to calculate capture efficiency. Data demonstrate that temperature, and the concomitant change in water viscosity, had no significant effect on capture efficiency. Cyanobacteria were captured at significantly higher rates than other bacteria of similar size. These results suggest that the laterofrontal cirri of blue mussels act as paddles rather than sieves because capture efficiency was constant over a range of viscosities and Reynolds numbers. Additionally, the efficient capture of some bacteria and smaller phytoeukaryotes by the mussels suggests that these plankters could play a larger role in the diet of <i>M. edulis</i> than previously considered. The ecological impact of these findings, especially regarding differences in capture efficiency of different bacterial cells, warrants further study.</p>","author":"Maria Rosa, \nMartina Capriotti, \nKayla Austin, \nSandra E. Shumway, \nJ. Evan Ward","siteTitle":"Wiley: Invertebrate Biology: Table of Contents","siteHash":"288dc5c0698e157be6008116ed4a15ccbcde55ff21b19d813cd3a3ab63550757","entryHash":"ddfb816ec4b435b1cbca1e17d28a9e71cd668d98633fcd9a4afebbc2b9ede0fc","category":"Environment"}