{"title":"Body size and early marine conditions drive changes in Chinook salmon productivity across northern latitude ecosystems","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17508?af=R","date":1728383334000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1627dce3-63a8-43df-8972-812c14699124/gcb17508-toc-0001-m.png\" alt=\"Body size and early marine conditions drive changes in Chinook salmon productivity across northern latitude ecosystems\" />\n<p>Chinook salmon in the Yukon-Kuskokwim region have declined dramatically, threatening community well-being and traditional subsistence ways of life. Northern latitude ecosystems are warming four times faster than the global average and environmental conditions impact Chinook salmon throughout their life cycle; however, the relative impact of environmental conditions on Chinook salmon productivity is not well understood. We find that the body size of adult spawners and marine conditions during the first year at sea are important drivers of Chinook salmon productivity in the Yukon-Kuskokwim region and that the impact of individual drivers varies across populations.</p>\n<br />\n<h2>Abstract</h2>\n<p>Disentangling the influences of climate change from other stressors affecting the population dynamics of aquatic species is particularly pressing for northern latitude ecosystems, where climate-driven warming is occurring faster than the global average. Chinook salmon (<i>Oncorhynchus tshawytscha</i>) in the Yukon-Kuskokwim (YK) region occupy the northern extent of their species' range and are experiencing prolonged declines in abundance resulting in fisheries closures and impacts to the well-being of Indigenous people and local communities. These declines have been associated with physical (e.g., temperature, streamflow) and biological (e.g., body size, competition) conditions, but uncertainty remains about the relative influence of these drivers on productivity across populations and how salmon–environment relationships vary across watersheds. To fill these knowledge gaps, we estimated the effects of marine and freshwater environmental indicators, body size, and indices of competition, on the productivity (adult returns-per-spawner) of 26 Chinook salmon populations in the YK region using a Bayesian hierarchical stock-recruitment model. Across most populations, productivity declined with smaller spawner body size and sea surface temperatures that were colder in the winter and warmer in the summer during the first year at sea. Decreased productivity was also associated with above average fall maximum daily streamflow, increased sea ice cover prior to juvenile outmigration, and abundance of marine competitors, but the strength of these effects varied among populations. Maximum daily stream temperature during spawning migration had a nonlinear relationship with productivity, with reduced productivity in years when temperatures exceeded thresholds in main stem rivers. These results demonstrate for the first time that well-documented declines in body size of YK Chinook salmon were associated with declining population productivity, while taking climate into account.</p>","author":"Megan L. Feddern, \nRebecca Shaftel, \nErik R. Schoen, \nCurry J. Cunningham, \nBrendan M. Connors, \nBenjamin A. Staton, \nAl von Finster, \nZachary Liller, \nVanessa R. von Biela, \nKatherine G. Howard","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"de1649596faf32e65947c5d25b35b79c6782a08e524a1e8c98720a5576f50aca","category":"Environment"}