{"title":"Road safety attitude and behaviour among motorcycle riders in Ghana: A focus on traffic locus of control and health belief","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309117","date":1724421600000,"content":"<p>by Abdul-Raheem Mohammed, Buhari Gunu Yussif, Mustapha Alhassan</p>\r\n\r\nRoad traffic accident is a leading cause of death and various life deformities worldwide. This burden is even higher among motorcycle riders in lower-to-middle-income countries. Despite the various interventions made to address the menace, the fatalities continue to be on the ascendency. One major area that has received little attention is the attitude and behaviour of motorcycle riders. The present study aimed to examine the contribution of traffic Locus of Control (LoC) and health belief on road safety attitude and behaviour. 317 motorcycle riders participated in the study. The participants completed a questionnaire comprising various sections such as motorcycle riding behaviour, road safety attitude, risk perception, the intention to use helmets, and traffic LoC. The results showed a significant positive correlation between road safety attitude and behaviour (<i>r</i> (295) = .33, <i>p</i> &lt; .001). Drifting towards internal LoC was associated with more positive behaviour on the roads (<i>r</i> (295) = -.23, <i>p</i> &lt; .001). Intention to use helmet, health motivation, perceived susceptibility, perceived benefits, and perceived barriers were the factors in the health belief model that were associated with road safety attitude (<i>r</i> (295) = .404, <i>p</i> &lt; .001). Finally, the multiple linear regression model showed that road safety attitude and traffic LoC made significant contributions to road user behaviour [<i>F</i>(3, 293) = 13.73, <i>p</i> &lt; .001]. These findings have important implications towards shaping responsible behaviour among motorcycle riders.","author":"Abdul-Raheem Mohammed","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"de32ccd2ca12aef0c7effda89c9ebea7b8e96179ed63975338ae6050ecf0679b","category":"Interdisciplinary"}