{"title":"Natural colonisation rates in a UK upland landscape under different conservation management approaches following sheep removal","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12338?af=R","date":1717916400000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/640e9745-8326-4c04-b707-cc22516db5a7/eso312338-toc-0001-m.png\" alt=\"Natural colonisation rates in a UK upland landscape under different conservation management approaches following sheep removal\" />\n<p>Density of naturally colonised trees increased over time following the removal sheep from a site. The rate of colonisation was the same regardless of whether extensive cattle grazing replaced sheep grazing or areas were left ungrazed. Density of naturally colonised trees was also greater closer to woodlands and on areas of limestone soil.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNatural colonisation could provide a cost-effective means to increase woodland coverage across the UK uplands. However, there is a shortage of evidence of which factors affect the success of natural colonisation, including grazing management. The species of grazer, grazing intensity and the stage of regeneration may alter the impact of grazing on the ability of trees to colonise an area.\n\nIn this study, we quantify the effect of removing sheep from an area in the Yorkshire Dales National Park, England, and explore whether cattle or ungrazed management alters tree colonisation rates. We also tested other environmental factors such as distance from woodland, elevation and soil geology to understand the other constraints on natural colonisation. Naturally colonised trees were recorded within 60 plots at Ingleborough National Nature Reserve and surrounding Yorkshire Wildlife Trust reserves. A series of generalised linear models, with a negative binomial distribution, were created to understand the effects that years since removal of sheep, current management, elevation, distance from woodland and soil geology had on the number of naturally colonising trees.\n\nThe number of naturally colonising trees per hectare was 16% higher each year after sheep removal, with both cattle and ungrazed management being equally effective in promoting natural colonisation. Natural colonisation decreased by 25% for every additional 100 m from the nearest woodland and naturally colonising trees were much more frequent on limestone soil.\n\n<i>Practical implication</i>. This study shows that sheep grazing is a key limiting factor of natural colonisation in the UK uplands. Significant natural colonisation was possible on both cattle grazed and ungrazed sites and developed at a similar rate, highlighting a change in grazing animal can be as important as grazing cessation. Tree planting will still be required to restore tree cover to areas away from seed sources and improve diversity of future woodlands.\n</p>","author":"G. Porton, \nR. Wrigley, \nC. E. Scott, \nD. V. Spracklen","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"de3e6d8db3b7a796aea706db7b43bff8c5ed98b76c9107c1513acf424f13783b","category":"Environment"}