{"title":"Apomixis beyond trees in the Brazilian savanna: new insights from the orchid Zygopetalum mackayi","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae037/7700356?rss=1","date":1719446400000,"content":"<span><div>Abstract</div>n the Neotropics, the focus of apomictic studies predominantly centres on trees within the Brazilian savanna, characterized, mostly as sporophytic and facultative, associated with polyploidy and polyembryony. To enhance our understanding of the mechanisms governing apomixis and sexual reproduction in tropical herbaceous plants, we clarify the relationship between apomixis, chromosome counts, and polyembryony in the epiphytic orchid <span>Zygopetalum mackayi</span>, which forms a polyploid complex within rocky outcrops in both the Brazilian savanna and the Atlantic forest. To define embryo origins and describe megasporogenesis and megagametogenesis, we performed manual self-pollinations in first-day flowers of cultivated plants, considering all three cytotypes (2<span>x</span>, 3<span>x</span>, 4<span>x</span>) of this species. Flowers and fruits at different stages were collected to describe the development and morphology of ovules and seeds considering sexual and apomictic processes. As self-pollination treatments resulted in high fruit abortion in diploids, we also examined pollen tube development in aborted flowers and fruits to search for putative anomalies. Megasporogenesis and megagametogenesis occur regularly in all cytotypes. Apomixis is facultative and sporophytic, and associated with polyploid cytotypes, while diploid individuals exclusively engage in sexual reproduction. Polyembryony is caused mainly by the production of adventitious embryos from nucellar cells of triploids and tetraploids, but also by the development of multiple archesporia in all cytotypes. Like other apomictic angiosperms within the Brazilian savanna, our findings demonstrate that apomixis in <span>Z. mackayi</span> relies on pollinators for seed production. We also consider the ecological implications of these apomictic patterns in <span>Z. mackayi</span> within the context of habitat loss and its dependence on pollinators.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"de400f69008b9683ed242c2c3d57f8185c4aca9333d4d1a7dd987003e12dfd70","category":"Environment"}