{"title":"Making sense of The Last of Us‘s thrilling, affecting season finale","link":"https://arstechnica.com/?p=1923159","date":1678672852000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal-bella-ramsey_0-800x533.jpg\" alt=\"The view is pretty great...\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal-bella-ramsey_0.jpg\">Enlarge</a> <span>/</span> The view is pretty great... (credit: HBO)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>New episodes of <em>The Last of Us</em> are premiering on HBO every Sunday night, and Ars' Kyle Orland (who's played the games) and Andrew Cunningham (who hasn't) <a href=\"https://arstechnica.com/series/hbos-the-last-of-us-season-one/\">will be talking about them here every Sunday evening</a>. While these recaps don't delve into every single plot point of the episode, there are obviously <strong>heavy spoilers</strong> contained within, so go watch the episode first if you want to go in fresh.</p>\n<div><strong>Kyle</strong>: We made it to the last of <em>The Last of Us</em> season one! Which means I get to ask you the first question I asked myself after playing the first game; the one I've been waiting weeks to ask you; and probably the most important and lingering question of the whole season:\n<p>Does Ellie believe Joel?</p>\n</div>\n<div><strong>Andrew</strong>: OK, I definitely came away from this with an entirely different lingering question! But like many episodes of <em>The Last of Us</em>, maybe we should cut away from the action so that we can jump back in time and then work our way back up to those questions?\n<p>In this episode, Joel and Ellie make it! They're in Reno, and they find the doctors they've been trying to find this whole time. They just need to let the doctors run a few tests, and then they can ride off into the sunset together, their surrogate father/daughter bond intact and healthy and totally great. Right?</p>\n</div>\n<div><strong>Kyle</strong>: There are plenty of other questions, to be sure, but I wanted to start with the one that lingers most after that gripping final shot.\n<p>But yes, backing up a bit, I like how this episode gets back to some quiet time between Joel and Ellie, who get to joke around and feed giraffes and be generally wistful about their journey together. They have obviously and fully become a surrogate father/daughter pair to each other, which is saying something, given how reluctant they were to even be in the same space back at the beginning of the series.</p>\n</div>\n<div><strong>Andrew</strong>: There are nice moments. But now that Joel is fully open to letting Ellie occupy the role of his dead daughter, there's a sort of manic, almost desperate note to his relationship with her at the episode's outset. Joel's stolid, monosyllabic veneer is gone, and now that it is, he's talking too much; he's suddenly <em>too</em> eager to connect.</div>\n<div><strong>Kyle</strong>: You could also argue he's suddenly <em>too</em> eager to protect his surrogate daughter at the expense of humanity...</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal.jpg\"><img alt=\"What did you do, Joel, and why did you do it?\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal-640x427.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal-1280x853.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/pedro-pascal.jpg\">What did you do, Joel, and why did you do it?</a> (credit: HBO)</p></div>\n<div><strong>Andrew</strong>: Yes! Yes. That's the thing.\n<p>Unlike just about every other group of people we've run into in <em>The Last of Us</em> universe, there doesn't seem to be anything especially sinister about the Reno Fireflies. Yes, they decide pretty quickly that the only way to study and transmit Ellie's immunity is to remove her brain (This is explained somewhat in yet another episode-opening flashback where we meet Ellie's mother and do in fact learn the incredible true story of how Ellie got her knife, a joke I made a few recaps ago that ended up coming true).</p>\n<p>But they are not, as far as we know, a community of sadistic evangelical vigilante brain-removers. They are, to borrow a phrase, <a href=\"https://www.youtube.com/watch?v=Xa6c3OTr6yA\">putting the needs of the many ahead of the needs of the few</a>. And it's not that I don't feel deeply for Joel, who is clearly not ready or willing or able to lose another daughter. But his response to the situation...</p>\n<p>It leads me to my question: is Joel the bad guy? Have we, the audience, been hoodwinked by Pedro Pascal's dadly charms into rooting for a monster?</p>\n</div>\n<div><strong>Kyle</strong>: To me, this is not, in the end, a very interesting or difficult question. Any objective look at the situation would conclude that Joel obviously made the wrong choice here. Saving humanity from cordyceps is strikingly more valuable than protecting Ellie's life.\n<p>The only way to come to the opposite conclusion is by being hopelessly sentimental about the whole thing. And Joel's actions are made even worse because, as Marlene points out, Ellie would pretty clearly be willing to sacrifice herself for that greater good.</p>\n<p>That said, I think both the game and the show do a good job of threading the needle between not <em>defending</em> Joel's actions but still <em>explaining</em> them. By the time we get to these final scenes, we understand how and why a very broken Joel would essentially sacrifice the human race for this girl he met relatively recently. You don't have to agree with it to understand it from Joel's point of view, and I think that's an amazing narrative feat.</p>\n</div>\n<div><a name=\"page-2\"></a></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_5.jpg\"><img alt=\"What wouldn't you do to protect this face?\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_5-640x427.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_5-1280x853.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_5.jpg\">What wouldn't you do to protect this face?</a> (credit: HBO)</p></div>\n<div><strong>Andrew</strong>: Yeah, it’s telling that the biggest problem I have with what happens gets back to your question. It’s objectively not great that Joel goes on a rampage at the expense of what could be a society-salvaging vaccine, and objectively not great that he kills not just armed Fireflies but unarmed civilians.\n<p>But getting back to your initial question, I think the most monstrous, selfish thing he does is <em>lie about it</em> to a girl who has huge trust issues and who relies on him for everything. Maybe you can understand why Joel is doing what he’s doing, but it’s an unfathomable betrayal of this person who he claims to care about.</p>\n</div>\n<div><strong>Kyle</strong>: Joel knows what he did is unforgivable and that Ellie would never forgive him if he told her the truth at that moment. And yes, that alone makes him pretty irredeemable in my eyes (though there are plenty of sentimental people out there who think Joel did the right thing).\n<p>But then there's those last few seconds of the season—that tight close-up on Ellie's face—where you can almost see the gears turning in her head. Does she just trust Joel so much that she just puts any doubts aside? Is she <em>convincing</em> herself to believe Joel for the sake of her own sanity? Or does she know Joel is lying and is just pretending to accept his story to protect their relationship?</p>\n</div>\n<div><strong>Andrew</strong>: Whether she believes him or just buys into the lie to protect their relationship will have big implications for next season because it's hard to imagine this not catching up with them. If that is the question the show is wrestling with, I think that's a whole lot more interesting than saying, \"Well, Joel did what he did for understandable reasons, so ultimately it's OK that he did it.\"\n<p>I was thinking about how this game came out in 2013 and how a decade ago we were still very much in the middle of an anti-hero era in movies and TV. I'm mostly thinking of <em>The Sopranos</em>, <em>Mad Men</em>, <em>Breaking Bad</em>, and their many imitators. These shows asked viewers to explore the psyches of (mostly) white (mostly) men who were doing bad things, but who could still elicit sympathy and understanding because of some combination of good writing and great, charismatic performances.</p>\n<p>The problem was that sometimes those shows were <em>too</em> good at what they were doing, and at least some viewers went from <em>understanding</em> and <em>sympathizing</em> with those characters to <em>rooting</em> for them in ways that could be uncomfortable. Walter White was ultimately a manipulative drug kingpin, a murderer and a serial liar, a megalomaniac addicted to power and its exercise. A non-trivial portion of the show's fanbase spent most of the series <a href=\"https://www.nytimes.com/2013/08/24/opinion/i-have-a-character-issue.html\">upset at his wife for being \"an annoying bitch\" who was insufficiently supportive of his criminal enterprise</a>.</p>\n<p>I really liked what <em>The Last of Us</em> finale accomplished insofar as it subverted my expectations. I went in ready for a mostly heartwarming tale of found family in an apocalyptic setting, and the season does deliver that. But this episode's haunted, desperate Joel, too eager to project his dead daughter onto Ellie and too willing to go on a killing spree in the interest of \"protecting\" her, adds an uncomfortable layer on top of their dynamic.</p>\n<p>How I feel about season two will depend on whether the show wants to acknowledge and explore that discomfort or whether it wants us to think that Joel is a flawed badass who was \"right\" to do what he did just because he did it for sympathetic reasons.</p>\n<p>So that's my season-ending mini-essay. As a game player who has some idea of what's coming next, how did the finale leave you? How are you feeling about this season as a game adaptation?</p>\n</div>\n<div><a name=\"page-3\"></a></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/ashley-johnson.jpg\"><img alt=\"Mother, victim, knife donor...\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/ashley-johnson-640x427.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/ashley-johnson-1280x853.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/ashley-johnson.jpg\">Mother, victim, knife donor...</a> (credit: HBO)</p></div>\n<div><strong>Kyle</strong>: I don't want to spoil too much about <em>Part 2</em> (and presumably season two of the show) by talking about where this plot thread goes. I will say that I thought the ambiguity of the ending in the first game/season was so well done that I felt continuing Joel and Ellie's story could only lessen it, which I think is what ended up happening.\n<p><em>Part 2</em> aside, I feel like <em>Part 1</em> has one of the best-presented endings in gaming, which carries over quite well here. These final scenes paper over a lot of the narrative's weaker moments. And that close-up on Ellie's face—with all the vagaries in every slight twitch of her eyes and chin—was even more impressive in a 2013 game, where motion-captured performances tended to be much broader and more over-the-top.</p>\n<p>The show finale includes almost shot-for-shot remakes of many of the key scenes at the end of the game, right down to the music cues in many instances. But there is one subtle but important narrative change I noticed, which goes <a href=\"https://arstechnica.com/gaming/2023/01/kyle-and-andrew-dissect-the-last-of-us-television-premiere/\">all the way back to the first episode</a>.</p>\n<p>Remember when that '60s talk show panelist suggested that a fungal outbreak wouldn't just be society-destroying but that <em>a cure wouldn't even be possible</em>?</p>\n<p>In the game, while it's not 100 percent clear that the doctors will succeed in turning Ellie's brain into a vaccine, there's nothing explicitly suggesting it's a foolish effort. In the show, that one line at the very beginning of the first episode kind of changes the entire calculus.</p>\n<p>If that panelist was right, then maybe Joel was (accidentally) right to save Ellie? Was that line an effort to soften Joel's decision in the end and make his actions more forgivable?</p>\n</div>\n<div><strong>Andrew</strong>: Well, there’s “not possible,” and “we don’t believe it to be possible.” Ellie’s immunity in the first place is “impossible,” if anything I think that “impossible” line is meant to make Ellie’s immunity feel more extraordinary.\n<p>This is one of the things about this season that feels too rushed. We know that “smearing Ellie’s blood on an open wound” doesn’t fix anything, but that’s also not how medicine works unless you’re a kid who doesn’t know anything about medicine. So the show’s immediate jump to “the only way to get a cure is by harvesting Ellie’s brain!” feels a bit fast, even by the standards of post-apocalypse frontier medicine.</p>\n<p>Regardless, I’m not sure the talk show does much to redeem Joel because it seems pretty unlikely that he would be thinking of one throwaway line from one talk show that would’ve aired when he was a kid. And if we’re going off that line, are we supposed to be shouting, “This whole mission is stupid! A cure is impossible!” at our screens this whole time?</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_4-1.jpg\"><img alt=\"Sitting and waiting for season two...\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_4-1-640x427.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_4-1-1280x853.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bella-ramsey_4-1.jpg\">Sitting and waiting for season two...</a> (credit: HBO)</p></div>\n<div><strong>Kyle</strong>: Knowing where the season was going to end up, yeah, I was kind of wondering about that one line and internally screaming about it for the entire season.\n<p>I'm not trying to suggest Joel had arcane medical knowledge driving his decision. But in the context of a TV show, it's hard to see why the creators would throw in a line like that for any reason other than adding a bit of \"maybe Ellie's death would have been in vain\"-type doubt nine episodes later...</p>\n</div>\n<div><strong>Andrew</strong>: All we know is that they made it to the Firefly doctors, and they decided within a couple of hours that they needed to scoop her brain out. I’m just saying that if the show is going to try to make us feel better about what Joel did, it needed to/will need to do a bit more lifting on the “well, the cure is impossible anyway, so it’s fine” front.\n<p>My last question for you: as a video game adaptation, do you think <em>The Last of Us</em> is better or worse than the current best video game adaptation, <em>Super Mario Bros.</em> (1993)?</p>\n</div>\n<div><strong>Kyle</strong>: The <em>SMB</em> movie had the better use of fungus, perhaps...\n<p>Joking aside, this adaptation made me think a lot of the 2009 <em>Watchmen</em> movie, which I think suffered from being way too faithful to the source material. Here we had just the right amount of faithfulness with (mostly) useful additions/changes for the new medium.</p>\n<p>The source material provided a good starting point, but if they had just <em>ended</em> with that starting point, I think the conversion wouldn't have worked nearly as well.</p>\n</div>\n<div><strong>Andrew</strong>: That’s a useful comparison point for any adaptation. “How faithful is this to the source material, on a scale from the <em>Watchmen</em> movie to the <em>Watchmen</em> HBO miniseries?”\n<p>I’m looking forward to season two, but I need to fire up a change dot org petition to get us back to 13 episode seasons, please and thanks.</p>\n<div><strong>Kyle</strong>: The <a href=\"https://www.ign.com/articles/the-last-of-us-showrunner-says-part-2-is-more-than-a-seasons-worth-of-television\">latest reports</a> suggest they're looking to adapt the second game into more than one season, which ought to help the pacing a bit.</div>\n<div><strong>Andrew</strong>: Huh, OK. That might be too far in the other direction, but we’ll see...\n<p>And that, I think, is “the last of us” talking about this season!! Ha ha ha!</p>\n</div>\n<div><strong>Kyle</strong>: Ha ha ha ha! (freeze frame on Kyle and Andrew laughing and slapping backs. Roll credits)</div>\n</div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1923159\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1923159&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"de48780ec87f2918ceefbb378572e8ae3e0d86a109f9d35d235668","category":"Tech"}