{"title":"Technological Interface Components that Support Accelerated ‎Learning in the Acquisition of Foreign Language Vocabulary","link":"https://www.preprints.org/manuscript/202409.1415/v1","date":1726659657000,"content":"There is a need to find innovative learning methods that enable accelerated learning of ‎a foreign language. This study examined the effect of computer-assisted language ‎learning (CALL) in acquiring a foreign language, which combines cognitive and ‎emotional stimuli in the background. ‎\nThe study explored two factors related to the acquisition of a foreign language: the ‎duration and scope of the learning process and the depth of internalization of the newly ‎acquired language. Another objective was to assess the learning method in two ‎learning environments, a multimedia setting and a virtual reality headset (VRH), to ‎determine if the learning environment affects the learning results and leads to better ‎vocabulary retention. ‎\nOne hundred native French speakers, with an average age of 47.5, participated in the ‎study and had no prior knowledge of a new native language. We randomly divided the ‎participants into two groups (multimedia and VRH). They studied 550 words in a new ‎native language for five days: 30 minutes each evening and 15 minutes in the morning.‎\nThe post-learning test pointed out that both groups improved their vocabulary scores ‎significantly. Approximately one month after the learning experience, we administered ‎a knowledge retention test to 32 participants and found that the level of knowledge had ‎been retained. Finally, background variables (e.g., gender, age, previous knowledge of ‎the new native language) did not affect the learning results. ‎\nThe findings indicate that CALL, which integrates background cognitive and ‎emotional stimuli in both learning environments, significantly accelerates learning ‎pace, broadens the scope of newly acquired words, and ensures retention. The level of ‎improvement observed in our study is notably higher than reported in the literature ‎that had previously evaluated CALL and in-class language acquisition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"de4ae2f447cd127092f5e562eb1f8aa19dc36e84718b8894741a97faddbd6698","category":"Interdisciplinary"}