{"title":"Apple Car History - Where Did Development Go Wrong?","link":"https://www.macrumors.com/guide/apple-car-history/","date":1709158759000,"content":"After spending a decade <a href=\"https://www.macrumors.com/roundup/apple-car/\">developing an autonomous car</a>, Apple this week decided it was time to pull an <a href=\"https://www.macrumors.com/guide/airpower/\">AirPower</a> and <a href=\"https://www.macrumors.com/2024/02/27/apple-cancels-electric-car-project/\">shut down the project</a>. The <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a> is no more, and Apple is no longer planning to release an Apple-branded electric vehicle.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe hundreds of engineers and car experts who were working on the vehicle will be laid off or distributed to other teams within Apple, including the AI team. The ‌Apple Car‌ is one of the longest running rumors that we've been reporting on without a product materializing, so we thought we'd take a look back at some of the key moments in the ‌Apple Car‌'s history to provide some insight into what went wrong.\r<br />\n\r<br />\n<h2>2015 - Early Development</h2>\r<br />\nIn early 2015, a van leased to Apple <a href=\"https://www.macrumors.com/2015/02/04/mysterious-apple-car/\">surfaced on the streets</a> of Concord, California with LiDAR equipment on its roof. Apple had been using vans like this for mapping purposes, but the hardware looked similar to hardware being used by companies testing self-driving software. This one vehicle sighting ended up sparking a slew of rumors.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2015/04/winningappleconceptcar1.jpg\" width=\"800\" height=\"450\" /><em><div>An imagined <a href=\"https://www.macrumors.com/2015/04/07/designers-fanciful-apple-car-concepts/\">Apple Car concept</a></div></em>\r<br />\nThat same month, an <a href=\"https://www.macrumors.com/2015/02/09/apple-project-tesla-competitor/\">unnamed Apple employee</a> told <em>Business Insider</em> that Apple would \"give Tesla a run for its money,\" and <em>Financial Times</em> claimed that Apple <a href=\"https://www.macrumors.com/2015/02/13/apple-automotive-research-lab/\">was recruiting</a> automotive technology and vehicle design experts to work in a \"top-secret research lab.\" <em>The <a href=\"https://www.macrumors.com/guide/wsj-com/\">Wall Street Journal</a></em> <a href=\"https://www.macrumors.com/2015/02/13/apple-working-on-electric-car/\">then broke a story</a> with in-depth details on the hundreds of employees working on an Apple-branded minivan-like electric vehicle.\r<br />\n\r<br />\nThere were a number of other key headlines and details shared in 2015.\r<br />\n<ul>\r<br />\n <li>Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> reportedly approved the self-driving car project in 2014.</li>\r<br />\n <li>At the time, the project was led by Steve Zadesky, Apple VP of Product Design and a former Ford engineer. It was overseen by Dan Riccio, Apple's SVP of hardware engineering.</li>\r<br />\n <li>In 2015, <em>Bloomberg</em> said that Apple was <a href=\"https://www.macrumors.com/2015/02/19/apple-car-production-2020/\">hoping to produce the car</a> by 2020. Later, <a href=\"https://www.macrumors.com/2015/09/21/apple-car-development-speeds-up/\">the WSJ said</a> it could be ready as soon as 2019.</li>\r<br />\n <li>Apple was said to be meeting with Magna Steyr, <a href=\"https://www.macrumors.com/2015/03/05/bmw-denies-i3-apple-car-report/\">BMW</a>, and automotive companies as it sought a partner.</li>\r<br />\n <li><em>The Guardian</em> published a report that Apple wasn't just working on an electric vehicle, it was working on an <a href=\"https://www.macrumors.com/2015/08/14/apple-car-test-track-discussions/\">autonomous vehicle</a>. The report also said that Apple had prototypes ready for testing, which wasn't accurate.</li>\r<br />\n <li>Former General Motors CEO Dan Akerson said that Apple was underestimating the difficulty of operating in the car business. \"They have no idea what they're getting into,\" he said.</li>\r<br />\n <li>Apple hired a ton of vehicle experts from automotive companies and from companies with expertise in autonomous vehicles.</li>\r<br />\n <li>Apple's \"secret\" car headquarters <a href=\"https://www.macrumors.com/2015/03/13/apple-car-hq-sunnyvale/\">were located</a> in Sunnyvale, California, close to the Infinite Loop campus.</li>\r<br />\n</ul>\r<br />\n\r<br />\n<h2>2016 and 2017 - First Signs of Strife Lead to Major Upheaval</h2>\r<br />\nThe first hints of trouble with the ‌Apple Car‌ project surfaced in January 2016, with ‌Apple Car‌ lead Steve Zadesky <a href=\"https://www.macrumors.com/2016/01/22/apple-car-steve-zadesky-to-leave-apple/\">departing the company</a>. Around this time, Apple <a href=\"https://www.macrumors.com/2016/01/08/apple-car-cars-auto-domains/\">registered several domain names</a>, including apple.car and apple.auto.\r<br />\n\r<br />\nFormer Apple SVP of technologies Bob Mansfield came out of retirement <a href=\"https://www.macrumors.com/2016/07/28/apple-car-autonomous-driving-system/\">to head up the project</a>, and under his direction, rumors suggested that Apple was focusing on an autonomous driving system with the aim of partnering with a car manufacturer in the future. Apple kept aggressively hiring, and at this time, split development into the hardware for the car and the software that would run on it.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/04/Apple-Car-front-side.jpg\" width=\"800\" height=\"265\" /><em><div>Another ‌Apple Car‌ concept from <a href=\"https://www.macrumors.com/2016/04/14/motor-trend-apple-car-renders/\">Motor Trend</a></div></em>\r<br />\nWith the transition to Mansfield's leadership, hundreds of employees were fired or reassigned, and in late 2016, there was a major upheaval. Apple \"abandoned\" plans to build its own vehicle and gave Mansfield's team <a href=\"https://www.macrumors.com/2016/10/17/apple-late-2017-deadline-self-driving-system/\">a 2017 deadline</a> to prove the feasibility of a self-driving system.\r<br />\n\r<br />\nIn early 2017, white Lexus RX450h SUVs outfitted with LiDAR equipment and piloted by Apple employees <a href=\"https://www.macrumors.com/2017/04/27/apple-self-driving-lexus-suv-spotted/\">were spotted in the Bay Area</a>, and Apple has used these vehicles to test its autonomous driving systems up until now. Apple was also rumored to be testing its self-driving technology <a href=\"https://www.macrumors.com/2017/11/28/apple-autonomous-vehicles-arizona-test-site/\">at a facility in Arizona</a>. \r<br />\n\r<br />\n<div></div>\r<br />\nApple at this time was also working on <a href=\"https://www.macrumors.com/2017/08/22/apple-self-driving-campus-shuttle/\">building an autonomous shuttle</a> in partnership with Volkswagen to ferry employees to the Infinite Loop campus, but that was nixed.\r<br />\n\r<br />\n‌Tim Cook‌ made the unusual decision to confirm that Apple was <a href=\"https://www.macrumors.com/2017/06/13/tim-cook-confirms-apple-autonomous-driving/\">working on autonomous driving</a>. \"We're focusing on autonomous systems,\" Cook said. \"It's a core technology that we view as very important.\" He went on to say that it was the \"mother of all AI projects,\" describing it as \"one of the most difficult AI projects actually to work on.\"\r<br />\n<h2>2018 and 2019 - Full Car Shelved, Quiet Work on Autonomous Driving Systems</h2>\r<br />\nIn 2018, Apple <a href=\"https://www.macrumors.com/2018/05/14/apple-expands-self-driving-car-fleet/\">continued to expand</a> the number of SUVs it was using to test autonomous driving software. Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said that the ‌Apple Car‌ would be Apple's next \"star product\" and that it would launch in 2023 to 2025. Kuo claimed it would revolutionize the auto market, likening it to the launch of the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>.\r<br />\n\r<br />\n2018 was a quiet year for the ‌Apple Car‌ as Apple worked on self-driving systems behind the scenes, but toward the end of the year there was speculation that the car project was back on due to the hiring of former <a href=\"https://www.macrumors.com/2018/08/10/former-tesla-lead-engineer-returns-to-apple/\">Ford lead engineer Doug Field</a>.\r<br />\n\r<br />\nIn 2019, there were little hints that the ‌Apple Car‌ was still in the works. Apple <a href=\"https://www.macrumors.com/2019/04/17/apple-car-next-generation-lidar-sensors-report/\">had talks</a> with LiDAR sensor suppliers, looking for advanced designs. Apple <a href=\"https://www.macrumors.com/2019/06/25/apple-acquires-self-driving-car-startup-drive-ai/\">also purchased</a> self-driving vehicle startup Drive.ai.\r<br />\n\r<br />\nMid-year, there was a fun rumor that Jony Ive had wanted to design the ‌Apple Car‌ <a href=\"https://www.macrumors.com/2019/06/28/jony-ive-apple-car-without-steering-wheel/\">without a steering wheel</a>, a concept that would resurface later.\r<br />\n\r<br />\n<h2>2020 and 2021 - Another Leadership Shakeup Renews Interest in Apple Car</h2>\r<br />\n2020 was the year of the pandemic, and for 11 months, we heard nothing about the ‌Apple Car‌. Behind the scenes though, the project was undergoing another leadership change. Bob Mansfield was out, and ‌Apple Car‌ development <a href=\"https://www.macrumors.com/2020/12/08/apple-car-join-giannandrea/\">shifted to John Giannandrea</a>, Apple's AI chief, with Doug Field overseeing day-to-day operations.\r<br />\n\r<br />\nIn December, rumors suggested an Apple-branded vehicle <a href=\"https://www.macrumors.com/2020/12/21/apple-car-production-rumored-2024/\">was back on</a>, and that Apple was <a href=\"https://www.macrumors.com/2020/12/09/apple-car-tsmc-chips/\">allegedly in talks</a> with well-known automotive electronics suppliers.\r<br />\n\r<br />\n2021 brought numerous rumors of an <a href=\"https://www.macrumors.com/2021/01/10/apple-hyundai-apple-car-deal/\">Apple partnership with Hyundai</a> for the ‌Apple Car‌, and Hyundai even confirmed the relationship before walking it back. The deal <a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">ultimately dissolved</a>, perhaps because of Hyundai's lack of discretion. Apple held talks with <a href=\"https://www.macrumors.com/2021/02/05/apple-car-kia-talks-georgia-assembly/\">multiple Japanese automakers</a>, but no partnership materialized. For a time, there were rumors that <a href=\"https://www.macrumors.com/2021/02/02/kuo-apple-car-use-hyundai-e-gmp-platform/\">Apple would use</a> Hyundai's E-GMP electric battery platform, but that didn't happen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/csm_hyundai-ev-platform-apple-car.jpg\" width=\"1345\" height=\"618\" />\r<br />\nToward the end of the year, Doug Field left Apple, and there was yet another leadership change, with Apple Watch chief Kevin Lynch taking over under John Giannandrea.\r<br />\n\r<br />\n<h2>2022 and 2023 - Steering Wheel-Free Design Rumored as Project Loses Focus</h2>\r<br />\nIn 2022, ‌Apple Car‌ rumors heated up after <em>The Information</em> <a href=\"https://www.macrumors.com/2022/07/11/apple-car-design-rumors/\">published a report</a> suggesting that Apple was working on a design with four seats that faced inward, a curved ceiling, and large seat-back screens that raised and lowered. There was talk of a car without a steering wheel or pedals.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2015/02/canoo-interior-1.jpg\" width=\"2000\" height=\"1333\" /><em><div>‌Apple Car‌ was rumored to have a design similar to the Canoo, pictured in the image above. Canoo's self-driving car has no steering wheel and a limousine-like interior.</div></em>\r<br />\nThe same report said that Apple's self-driving technology was lacking, with Apple's SUVs hitting curbs, having trouble staying in their lanes, and struggling to navigate streets. One vehicle reportedly almost ran into a person.\r<br />\n\r<br />\nLate in 2022, <em>Bloomberg</em> said that Apple had <a href=\"https://www.macrumors.com/2022/12/06/apple-car-project-scaled-back-delayed/\">again abandoned plans</a> for a fully autonomous vehicle, instead aiming for a self-driving mode that worked on highways. Apple was said to be <a href=\"https://www.macrumors.com/2022/12/06/apple-car-pricing-2026-launch/\">planning an Apple Car launch for 2026</a>, offering a scaled back version of the vehicle.\r<br />\n\r<br />\nRather than the fantastical design without a steering wheel, the car was said to have a more traditional design and a price point around $100,000.\r<br />\n\r<br />\nRumors about the ‌Apple Car‌ dried up in 2023 and we heard little about it all year. In September 2023, Apple analyst ‌Ming-Chi Kuo‌ said the project had \"lost all visibility,\" and he warned that without an acquisition, Apple would not have a chance of producing a car within the next several years.\r<br />\n\r<br />\n<h2>2024 - Apple Car in Trouble</h2>\r<br />\nIn January 2024, <em>Bloomberg</em> said that Apple <a href=\"https://www.macrumors.com/2024/01/23/apple-car-scaled-down-2028-launch/\">had scaled back the Apple Car design</a> a <strong>second</strong> time, forgetting plans of more advanced autonomous functionality. Apple wanted the car to be able to drive on its own on highways, but that was too ambitious. Instead, Apple settled for driver-assistance features similar to how Tesla vehicles operate, with the car offering steering and brake/acceleration support.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/12/vanamara-apple-car-concept3.jpg\" width=\"1500\" height=\"808\" /><div><em>An <a href=\"https://www.macrumors.com/2021/12/10/apple-car-3d-render-based-on-patents/\">Apple Car concept</a> based on Apple's patented designs</em></div>\r<br />\nWhile Apple had been aiming for a 2026 launch, with the new project changes, that was pushed to 2028. <em>Bloomberg</em> warned that if Apple decided it was unable to provide an electric vehicle with this more limited feature set, executives might cancel the project.\r<br />\n\r<br />\nJust a month after that report, Apple executives decided to go ahead and <a href=\"https://www.macrumors.com/2024/02/27/apple-cancels-electric-car-project/\">give up on the Apple Car</a>, focusing instead on AI. Some ‌Apple Car‌ employees will move to Apple's generative AI team, while others will be laid off or will need to apply for new positions within Apple.\r<br />\n\r<br />\nAs of now, the ‌Apple Car‌ joins two other canceled Apple projects - <a href=\"https://www.macrumors.com/2019/03/29/apple-officially-cancels-airpower/\">the AirPower</a> charging mat nixed in 2019 and the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> set that was <a href=\"https://www.macrumors.com/2015/05/18/apple-nixed-plans-for-television-set/\">rumored for several years</a> right around 2014.\r<br />\n\r<br />\n<h2>Wrap-Up</h2>\r<br />\nLooking back at the ‌Apple Car‌'s history, it's clear that the multiple leadership changes and almost yearly redirects of the project ultimately led to Apple's decision to end work on developing a vehicle.\r<br />\n\r<br />\nApple executives were never quite convinced of the viability of an ‌Apple Car‌ because of the enormous cost and safety risk involved with autonomous driving capabilities, and there was no one at Apple that was able to bring it to fruition.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-car-history/\">Apple Car History - Where Did Development Go Wrong?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-car-history-where-did-development-go-wrong.2420682/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"de4a49115a7f1c044232c510c8af5cf68ef3ff340ce5fba8e8045c2f0a935635","category":"Apple"}