{"title":"Targeting skeletal muscle health with exercise in people with type 1 diabetes: A protocol for HOMET1D, a prospective observational trial with matched controls","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303448","date":1716386400000,"content":"<p>by Irena A. Rebalka, Kenneth S. Noguchi, Kayla R. Bulyovsky, Matthew I. Badour, Emma S. Juracic, Khandra Barrett, Aditya Brahmbhatt, Baraa Al-Khazraji, Zubin Punthakee, Christopher G. R. Perry, Dinesh A. Kumbhare, Maureen J. MacDonald, Thomas J. Hawke</p>\r\nIntroduction <p>Individuals with type 1 diabetes (T1D) experience a complex set of alterations to skeletal muscle metabolic, neuromuscular, and vascular health; collectively referred to as diabetic myopathy. While the full scope of diabetic myopathy is still being elucidated, evidence suggests that even when individuals with T1D are physically active, indices of myopathy still exist. As such, there is a question if adherence to current physical activity guidelines elicits improvements in skeletal muscle health indices similarly between individuals with and without T1D. The objectives of this trial are to: 1) compare baseline differences in skeletal muscle health between adults with and without T1D, 2) examine the association between participation in a home-based exercise program, detraining, and retraining, with changes in skeletal muscle health, and 3) examine the roles of age and sex on these associations.</p> Methods and analysis <p>This will be a prospective interventional trial. Younger (18–30 years) and older (45–65 years) males and females with T1D and matched individuals without T1D will engage in a four-phase, 18-week study sequentially consisting of a one-week lead-in period, 12-week exercise training program, one-week detraining period, and four-week retraining period. The exercise program will consist of aerobic and resistance exercise based on current guidelines set by Diabetes Canada. Metabolic, neuromuscular, and vascular outcome measures will be assessed four times: at baseline, post-exercise program, post-detraining, and post-retraining. Differences in baseline metrics between those with and without T1D will be examined with independent sample t-tests, and with two-way analyses of variance for age- and sex-stratified analyses. Changes across the duration of the study will be examined using mixed-model analyses.</p> Dissemination <p>Findings from this research will be shared locally and internationally with research participants, clinicians, diabetes educators, and patient advocacy organizations via in-person presentations, social media, and scientific fora.</p> Trial registration number <p>NCT05740514.</p>","author":"Irena A. Rebalka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"de4ba7931cfd2d52c53cbd8cb012bc5fb5ebe68eb881d10754f65f64e0d87b33","category":"Interdisciplinary"}