{"title":"เป็นเรื่องบังเอิญหรือตั้งใจ ตัวละครหลักในซีรีส์ Hawkeye ใช้แต่มือถือ Google Pixel","link":"https://www.blognone.com/node/126012","date":1637833414000,"content":"<div><div><div><p>หลังซีรีส์ Hawkeye ออกฉายทาง Disney+ และ Disney+ Hotstar ในบ้านเรา เหล่าคนรักมือถือหลายๆ คนคงสังเกตว่าตัวละครในเรื่องใช้มือถือ Google Pixel แทบจะทุกคน แม้ซอฟต์แวร์จะเป็นแบบคัสตอมจนดูไม่ออกว่าเป็นแอนดรอยด์ แต่รูปลักษณ์เรียบง่ายของมือถือก็ชัดเจนว่าเป็น Google Pixel</p>\n<p>ทั้ง Clint Barton หรือ Hawkeye ยังใช้ Google Pixel 3 สี Just Black ที่วางขายในปี 2018 อยู่ ส่วน Laura Barton ภรรยาของ Clint ก็ใช้ Pixel 3 สี Not Pink เช่นกัน แม้ตามเนื้อเรื่องแล้ว เหตุการณ์ในซีรีส์จะเกิดขึ้นหลัง Avengers: Endgame แปลว่าน่าจะเกิดภายในปี 2023 หรือหลังจากนั้นก็ตาม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/87c59c063c394b51aa9d6b72635d46e8.png\" /></p>\n<p>ส่วน Kate Bishop ตัวละครหลักอีกตัวที่จะมาสืบทอดตำแหน่ง Hawkeye รวมถึง Eleanor Bishop แม่ของเธอ ก็ใช้ Google Pixel 4 ที่เปิดตัวในปี 2019 เป็นสี Just Black และรันซอฟต์แวร์แบบคัสตอมเช่นกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/47f11687ea6e05c7632a699867ab3cf2.png\" /></p>\n<p>Clint Barton เคยใช้ Google Pixel 3 มาแล้วเมื่อปี 2019 ใน The Avengers: Endgame ซึ่งครั้งนั้นน่าจะเป็นการโปรโมทของ Google แต่ครั้งนี้ ยังไม่แน่ชัดว่าการที่ตัวละครหลักหลายตัวใช้มือถือ Google Pixel นีเป็นการร่วมโปรโมตระหว่าง Google กับ Marvel หรือเปล่า หรือ Marvel เพียงแค่เห็นว่ารูปลักษณ์ของ Pixel ดูเรียบง่าย และสะดวกในการตัดต่อใส่เอฟเฟกต์หน้าจอมือถือ คงต้องติดตามข่าวกันต่อไป</p>\n<p>ที่มา - <a href=\"https://9to5google.com/2021/11/24/google-pixel-hawkeye/\">9to5Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/pixel\">Pixel</a></div><div><a href=\"/topics/marvel\">Marvel</a></div><div><a href=\"/topics/disney-plus\">Disney+</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"de4bc105277de2058b275ebea2a7c839ef98056b5093937694946f62554fbaf0","category":"Thai"}