{"title":"Webb Telescope confirms nearby rocky planet has no significant atmosphere","link":"https://arstechnica.com/?p=1927087","date":1679944227000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/image-5-800x450.jpeg\" alt=\"Image of a grey planet orbiting a dim red star.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/image-5.jpeg\">Enlarge</a> <span>/</span> An illustration of what the inner portion of the TRAPPIST-1 system might look like.  (credit: <a href=\"https://esawebb.org/news/weic2309/?lang\">NASA, ESA, CSA, J. Olmsted (STScI), T. P. Greene (NASA Ames), T. Bell (BAERI), E. Ducrot (CEA), P. Lagage (CEA)</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>At this point, we've discovered lots of exoplanets that fall under the general label \"Earth-like.\" They're rocky, and many orbit at distances from their host stars to potentially have moderate temperatures. But \"like\" is doing a lot of work there. In many cases, we have no idea whether they even have an atmosphere, and the greenhouse effect means that the atmosphere can have a huge impact on the planet's temperature. So the Earth-like category can include dry, baking hellscapes like Venus with its massive atmosphere, as well as dry, frozen tundras with sparse atmospheres like Mars.</p>\n<p>But we're slowly getting the chance to image the atmospheres of rocky exoplanets. And today, researchers are releasing the results of turning the Webb Space Telescope on a rocky planet orbiting a nearby star, showing that the new hardware is so sensitive that it can detect the star blocking out light originating from the planet. The results suggest that the planet has very little atmosphere and is mostly radiating away heat from being baked by its nearby star.</p>\n<h2>The ultra-cool dwarf and its seven planets</h2>\n<p>TRAPPIST-1 is a small, reddish star—in astronomical terminology, it's an \"ultra-cool dwarf\"—that's about 40 light-years from Earth. While the star itself is pretty nondescript, it's notable for having lots of planets, with seven in total having been identified so far. All of these are small, rocky bodies, much like the ones that occupy the inner portion of our Solar System. While the star emits very little light, the planets are all packed in closer to it than Mercury is to the Sun.</p></div><p><a href=\"https://arstechnica.com/?p=1927087#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927087&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"de56f9e5b6d83d85ffd9305a7eae72230a9d854864dfec9a97d9370a89951e73","category":"Tech"}