{"title":"Hepatitis C Virus E1E2 Structure, Diversity, and Implications for Vaccine Development","link":"https://www.preprints.org/manuscript/202403.1439/v1","date":1711351976000,"content":"Hepatitis C virus (HCV) is a major medical health burden and leading cause of chronic liver disease and cancer worldwide. More than 58 million people are chronically infected with HCV, with 1.5 million new infections occurring each year. An effective HCV vaccine is a major public health and medical need as recognized by the World Health Organization. However, due to the high variability of the virus and its ability to escape the immune response, HCV rapidly accumulates mutations making a vaccine a formidable challenge. An effective vaccine must elicit broadly neutralizing antibodies (bnAbs) in a consistent fashion. After decades of studies from basic research through clinical development, the antigen of choice is considered to be the E1E2 envelope glycoprotein due to conserved, broadly neutralizing antigenic domains located in the constituent subunits of E1, E2, and the E1E2 heterodimeric complex itself. The challenge has been elicitation of robust humoral and cellular responses leading to broad virus neutralization due to the relatively low immunogenicity of this antigen. In view of this challenge, structure-based vaccine design approaches to stabilize key antigenic domains have been hampered due to the lack of E1E2 atomic-level resolution structures to guide them. Another challenge has been development of a delivery platform in which a multivalent form of the antigen can be presented in order to elicit a more robust anti-HCV immune response. Recent nanoparticle vaccines are gaining prominence in the field due to their ability to facilitate a controlled multivalent presentation and trafficking to lymph nodes, where they can interact with both the cellular and humoral components of the immune system. This review focuses on recent advances in understanding the E1E2 heterodimeric structure to facilitate a rational design approach and the potential for development of a multivalent nanoparticle-based HCV E1E2 vaccine. Both aspects are considered important in the development of an effective HCV vaccine that can effectively address viral diversity and escape.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"de5722c78318f21faa1fcc2a3ac87966998c0ff4330fac61d5a2b56be3112e11","category":"Interdisciplinary"}