{"title":"Today’s best deals: LG OLED TVs, Roku 4K streamers, Xbox Game Pass, and more","link":"https://arstechnica.com/?p=1807115","date":1635365512000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/dealmaster102721-800x444.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/dealmaster102721.jpg\">Enlarge</a> (credit: Ars Technica)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Dealmaster has finished reading <a href=\"https://arstechnica.com/gadgets/2021/10/macos-12-monterey-the-ars-technica-review/\" target=\"_blank\">Ars' mammoth macOS 12 review</a>, which means the time has come for another roundup of the best tech deals we could find from across the web.</p>\n<p>Today's rundown is headlined by a few notable discounts on LG's line of C1 OLED TVs, as <a href=\"https://amzn.to/2XUHj94\" target=\"_blank\">both the 48-</a> and <a href=\"https://amzn.to/3Gr4EAw\" target=\"_blank\">55-inch models</a> are down to new lows of $1,100 and $1,300, respectively, at various retailers. Both deals are about $200 off the usual prices we've seen online <a href=\"https://arstechnica.com/gadgets/2021/01/lg-2021-plans-include-brighter-hdr-in-tvs-its-first-oled-pc-monitor-and-more/\" target=\"_blank\">since the C1 launched</a> earlier this year. They join a roughly $300 discount <a href=\"https://amzn.to/3vOE8wd\" target=\"_blank\">on the 65-inch model</a> that first arose toward the end of September, also marking the lowest price we've tracked.</p>\n<p>The C1 is more or less the flagship model in LG's current line of OLED TVs, as it generally offers the best mix of price and performance. We don't typically review TVs at Ars, but like most of its OLED predecessors, the C1 has garnered widely positive reviews for producing stellar picture quality (largely thanks to the super-deep contrast of good OLED panels), smooth motion, wide viewing angles, low input lag, a thin and attractive design, and a user interface in webOS that supports most of the major streaming apps and isn't a total pain to use. It has gamer-friendly features like four HDMI 2.1 inputs and variable refresh rate support, and it works with all of the most commonly used HDR standards.</p></div><p><a href=\"https://arstechnica.com/?p=1807115#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807115&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"de58522056981b44ac03b6ce3ad0f9b4a4bf97b22e189dab25d3289ba0dfb756","category":"Tech"}