{"title":"Google’s answer to ChatGPT, Google Bard, is out","link":"https://arstechnica.com/?p=1925539","date":1679410734000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google-800x523.jpg\" alt=\"A large Google logo is displayed amidst foliage.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Sean+Gallup\">Sean Gallup | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google Bard is out—sort of. Google says you can now join the waitlist to try the company's generative AI chatbot at the newly launched <a href=\"https://bard.google.com/\">bard.google.com</a> site. The company is going with \"Bard\" and not the \"Google Assistant\" chatbot branding it was previously using. Other than a sign-up link and an FAQ, there isn't much there right now.</p>\n<p>Google's <a href=\"https://blog.google/technology/ai/try-bard/\">blog post</a> calls Bard \"an early experiment,\" and the project is covered in warning labels. The Bard site has a bright blue \"Experiment\" label right on the logo, and the blog post warns, \"Large language models will not always get it right. Feedback from a wide range of experts and users will help Bard improve.\" A disclaimer below the demo input box warns, \"Bard may display inaccurate or offensive information that doesn't represent Google's views.\"</p>\n<p>Microsoft has been criticized for taking a very aggressive stance toward rolling out AI, even cutting its<a href=\"https://arstechnica.com/tech-policy/2023/03/amid-bing-chat-controversy-microsoft-cut-an-ai-ethics-team-report-says/\"> AI ethics team</a>. Google is trying to paint itself as more cautious, saying, \"Our work on Bard is guided by our AI Principles, and we continue to focus on quality and safety. We’re using human feedback and evaluation to improve our systems, and we’ve also built in guardrails, like capping the number of exchanges in a dialogue, to try to keep interactions helpful and on topic.\"</p></div><p><a href=\"https://arstechnica.com/?p=1925539#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925539&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"de59c6e41e60122012c2eedf1b667e3dcdddfc3f0addee19a5232b3ef42e0b02","category":"Tech"}