{"title":"iPhone 15 and iPhone 15 Pro: Who should and shouldn’t upgrade","link":"https://www.macworld.com/article/2069492/iphone-15-and-iphone-15-pro-upgrade-or-not.html","date":1694773800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s new iPhone 15 and iPhone 15 Pro are <a href=\"https://apple.sjv.io/c/321564/435395/7636?subid1=1-1-2069492-1-0-0&amp;u=https://www.apple.com/shop/buy-iphone/iphone-15-pro\">available for preorder beginning today at 8 am ET</a>, and iPhone users everywhere are all asking the same question: Should I buy one? Everyone wants a new phone every year, but deciding whether this is the year to get one is never easy. Here are our recommendations for all of the recent iPhone models:</p>\n\n\n\n<div><div>\n<h2>iPhone 14 Pro Max</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade: </strong>Yes</li>\n\n\n\n<li><strong>Why? </strong>The iPhone 15 Pro Max is a major upgrade over the iPhone 14 Pro Max for two reasons: It’s 20 grams lighter and it has a 6X telephoto camera. You’ll also get a faster chip, refined titanium design, faster data transfers with USB-C, and an Action button for quickly launching the camera and other app actions.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade:</strong> If the weight of the iPhone 14 Pro Max doesn’t bother you and you don’t take many pictures that need a zoom lens. And you really want to keep your Lightning port.</li>\n</ul>\n</div></div>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/reviews/3817705/iphone_14_pro_review_1.jpg?quality=50&amp;strip=all\" alt=\"iPhone 14 Pro\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div><div>\n<h2>iPhone 14 Pro</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> No</li>\n\n\n\n<li><strong>Why?</strong> The iPhone 15 Pro is a very good phone, but it’s not much of an upgrade over the iPhone 14 Pro. The titanium frame trims the weight some but it’s not nearly as dramatic as the iPhone 15 Pro Max, and the camera system is essentially the same, with a 48M main, 12MP ultra-wide, and 3X telephoto camera. </li>\n\n\n\n<li><strong>Who should upgrade:</strong> People who really like titanium and use their iPhones for extreme gaming. The A17 Pro chip brings a new 6-core GPU with hardware-accelerated ray tracing for “more fluid graphics and true‑to‑life lighting.”</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 14/14 Plus</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> No</li>\n\n\n\n<li><strong>Why:</strong> The iPhone 15 picks up a few of the Pro features from last year, including the A16 chip and 48MP main camera, but for the most part, it’s a very similar phone to last year’s iPhone 14 Pro with a lesser screen and no telephoto lens. If you were okay with skipping the iPhone 14 Pro last year, you’ll be OK with skipping the iPhone 15 this year. </li>\n\n\n\n<li><strong>Who should upgrade:</strong> People who do a lot of photo editing will appreciate the 48MP camera, but most people won’t notice the benefits of the new camera.</li>\n</ul>\n\n\n</div></div>\n\n\n\n<div><div>\n<div><div>\n<h2>iPhone 13 Pro Max</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade: </strong>Yes</li>\n\n\n\n<li><strong>Why: </strong>We recommended iPhone 14 Pro Max users upgrade to the iPhone 15 Pro Max, and the recommendation is even stronger for the iPhone 13 Pro Max. The iPhone 15 Pro Max is lighter and faster, has the Dynamic Island and an always-on display, a massively better camera system with a 48MP main lens and 6X telephoto, and Crash Detection and Emergency SOS/Roadside Assistance via Satellite. It’s a no-brainer upgrade.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade: </strong>People who don’t have the budget right now for a $1,199 phone. However, Apple will give you up to $580 for your iPhone 13 Pro Max, which will soften the hit to your wallet.</li>\n</ul>\n</div></div>\n</div></div>\n\n\n\n<div><div>\n<div><div>\n<h2>iPhone 13 Pro</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Probably</li>\n\n\n\n<li><strong>Why:</strong> For all of the reasons mentioned in the iPhone 13 Pro Max section above. The lack of a 6X telephoto lens is a bit of a sticking point, especially since it’s rumored to come to the iPhone 16 Pro next year. But the iPhone 15 Pro is still a very good upgrade over the iPhone 13 Pro for the same $999 price as it was in 2021.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade: </strong>As always, if you’re happy with your iPhone 13 Pro, you should stick with it. Battery life and performance should still be top-notch, and you’ll get several more years of iOS upgrades.</li>\n</ul>\n\n\n\n<div><figure><img src=\"https://www.idg.se/editorial/980/path/1.757395.1634476578!imageUploader/2953023777.jpg?quality=50&amp;strip=all\" alt=\"iPhone 13 Pro\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n</div></div>\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 13</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Yes</li>\n\n\n\n<li><strong>Why: </strong>The iPhone 15 is essentially an iPhone 14 Pro without a dedicated telephoto camera or an always-on display. It has an A16 chip, 48MP main camera, and the Dynamic Island as well as a slew of smaller upgrades, including 2X digital zoom, better portraits, and longer battery life.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade:</strong> The iPhone 13 is still a solid iPhone, but the main reason to stick with it is the color. The iPhone 15 has a very pale blue while the iPhone 13 has the best shade of blue Apple ever made.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n\n\n<h2>iPhone 13 mini</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Probably not</li>\n\n\n\n<li><strong>Why: </strong>If you bought an iPhone 13 mini, you bought it because you like small phones. Since Apple no longer sells an iPhone with a 5.4-inch display, you should probably hold onto it as long as you can. You should get several more years of iOS updates through iOS 20.</li>\n\n\n\n<li><strong>Who should upgrade:</strong> If you want a bigger phone or a better camera, then you’ll sadly need to dump your mini. </li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 12 Pro/12 Pro Max</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Definitely</li>\n\n\n\n<li><strong>Why:</strong> The iPhone 13 Pro and Pro Max were a huge leap over the iPhone 12 Pro and Pro Max, so you’re getting nearly 10 hours of battery life, 50 percent better performance, a ProMotion display, Macro mode, ProRes video, and Cinematic Mode–along with a far superior telephoto camera and wide-angle camera, lighter titanium design, and the Dynamic Island. Need we say more?</li>\n\n\n\n<li><strong>Who shouldn’t upgrade:</strong> If you’re on a tight budget, you’ll be able to squeeze another year out of the iPhone 12 Pro.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 12/12 mini</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Yes (with a but)</li>\n\n\n\n<li><strong>Why?</strong> Come to the iPhone 15 for better performance and longer battery life, stay for the vastly improved camera and display.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade:</strong> If money is tight, the iPhone 12 is still a very good phone that Apple sold until this week. And like the 13 mini, if you love small phones, stick with your iPhone 12 mini as long as you can.</li>\n</ul>\n\n\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 11 Pro/11 Pro Max</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Absolutely</li>\n\n\n\n<li><strong>Why?</strong> The iPhone 11 Pro and 11 Pro Max were Apple’s first Pro phones and they’ve come a long way since then. How long? The iPhone 11 Pro models don’t have 5G, MagSafe, or Night mode.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade:</strong> We can’t think of anyone who should be holding onto their iPhone 11 Pro Max at this point. But if you want a reason, it’s the last iPhone that has curved edges.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iPhone 11</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> YES</li>\n\n\n\n<li><strong>Why?</strong> The iPhone 11 is the last model with an LCD, so you can imagine how much better the iPhone 15 will be. </li>\n\n\n\n<li><strong>Who shouldn’t upgrade? </strong>Unless you really hate OLED displays, it’s time.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<div><div>\n<div><div>\n<h2>iPhone XR/XS/XS Max or earlier</h2>\n\n\n\n<ul>\n<li><strong>Should you upgrade:</strong> Seriously.</li>\n\n\n\n<li><strong>Why? </strong>The iPhone XS is the last version to support iOS 17, so you’re probably starting to feel the performance dip. We won’t list all of the improvements you’ll get with one of the iPhone 15 models, but trust us, there are a lot.</li>\n\n\n\n<li><strong>Who shouldn’t upgrade?</strong> At this point, no one.</li>\n</ul>\n\n\n</div></div>\n\n\n</div></div>\n</div></div>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"de5a8ac9ae1174b31347bb2f973668cbbbf533da8e66f7a075da97bc76b1e35a","category":"Apple"}