{"title":"พบ Google Drive จำกัด \"จำนวนไฟล์\" ที่สามารถเก็บได้สูงสุด - Google ยืนยันกระทบน้อยมาก","link":"https://www.blognone.com/node/133259","date":1680315067000,"content":"<div><div><div><p>มีรายงานจากผู้ใช้งาน Google Drive บางคน พบข้อความเตือนว่าไม่สามารถสร้างไฟล์ใหม่เพิ่มได้ โดยบอกว่าบัญชีนี้สร้างไฟล์เกินจำนวนที่จำกัด 5 ล้านไฟล์แล้ว โดยแนะนำให้ลบไฟล์ออก และเคลียร์ใน Trash ต่อด้วย เพื่อให้สามารถใช้งานต่อได้</p>\n<p>เนื่องจากกูเกิลไม่เคยบอกเงื่อนไข ว่าจำนวนไฟล์ที่ผู้ใช้งานสร้างได้สูงสุดคือเท่าใด จึงมีการ<a href=\"https://issuetracker.google.com/issues/268606830?pli=1\">แจ้งปัญหาใน IssueTracker</a> และพบว่าบัญชีที่เสียเงินเพิ่มพื้นที่ก็พบข้อความเตือนแบบนี้เช่นกัน</p>\n<p>ปัจจุบันเงื่อนไขใช้งานที่<a href=\"https://support.google.com/a/users/answer/7338880?hl=en\">กูเกิลระบุไว้ในหน้าซัพพอร์ต</a> มีเพียงจำนวนไฟล์ที่แชร์ โดยสามารถแชร์ไฟล์ในไดรฟ์ได้สูงสุด 4 แสนรายการ หากเกินนั้นต้องปลดการแชร์ออก ไม่มีการระบุจำนวนไฟล์ที่สามารถสร้างได้ใน 1 ไดรฟ์</p>\n<p>ตัวแทนของกูเกิลชี้แจงปัญหานี้ โดยยืนยันว่าการจำกัดจำนวนของไฟล์นั้นไม่ใช่บั๊ก แต่เป็นระบบเพื่อป้องกันความปลอดภัย จากการใช้งานที่ไม่เหมาะสม โดยจำนวนที่จำกัดนั้น คือตัวเลขที่ 1 บัญชีผู้ใช้งาน สามารถสร้างไฟล์ได้ทั้งหมดในทุกที่ ไม่ใช่จำนวนไฟล์ที่สามารถเก็บได้ใน 1 Drive นอกจากนี้กูเกิลบอกว่าข้อจำกัดนี้ไม่กระทบกับผู้ใช้งานส่วนใหญ่ ซึ่งจากการตรวจสอบพบผู้ใช้งานที่เจอปัญหานี้เป็นจำนวนน้อยมาก ๆ</p>\n<p>ที่มา: <a href=\"https://arstechnica.com/gadgets/2023/03/google-drive-does-a-surprise-rollout-of-file-limits-locking-out-some-users/\">Ars Technica</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/39faa8ce24766ee1e61960da68c9a878.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-drive\">Google Drive</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/google-workspace\">Google Workspace</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"de768ad77f81ecc0319176c7194f3b755015c5762902440d6915ad969094f47d","category":"Thai"}