{"title":"Deep Indentation Tests of Soft Materials Using Mobile and Stationary Devices","link":"https://www.preprints.org/manuscript/202407.2511/v1","date":1722408597000,"content":"Measurements of the properties of soft materials are important from the point of view of medical diagnostics of soft tissues as well as testing the quality of food products and many technical materials. One of the frequently used techniques for testing such materials, attractive due to its non-invasive nature, is the indentation technique, which does not puncture the material. The difficulty of testing soft materials, which affects the objectivity of its results, is related to the problems of stable positioning of the studied material in relation to the indentation apparatus, especially with a device held by the operator. This work concerns the comparison of test results using an indentation apparatus mounted in mobile and stationary handles. The tested materials are cylindrical samples of polyurethane foams with three different stiffnesses and the same samples with a 0.5- or 1-mm-thick silicone layer. The presented research uses an apparatus with a flat cylindrical indenter, with a surface area of 1 cm2, pressed to a depth of 10 mm (so-called deep tests). Based on the recorded force changes over time, five descriptors of the indentation test were determined and compared for both types of handles. The tests performed showed that the elastic properties of foam materials alone and with a silicone layer can be effectively characterized by the maximum forces during recessing and retraction, and the slopes of the recessing and retraction curves. In the case of two-layer materials, these descriptors reflect both the characteristics of the foams and the silicone layer. The results showed that the above property of the deep indentation method distinguishes it from the shallow indentation method. The repeatability of tests performed in the mobile and stationary holders were determined to be comparable.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"de773fe51ded82a9fc3e22748332ad370ea9db13af5a762e2374a859b36ba70d","category":"Interdisciplinary"}