{"title":"Apple 'Magic Battery' Will Power Vision Pro Headset","link":"https://www.macrumors.com/2023/08/09/apple-magic-battery-vision-pro-headset/","date":1691570070000,"content":"Apple is calling the Vision Pro headset's external battery pack a \"Magic Battery,\" based on code references found in tvOS beta 5.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Orange.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nPreviously referred to as \"<a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe Battery Pack</a>\" for its similarity to the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> battery pack of the same name, the Magic Battery provides Apple's mixed reality headset with two hours of tethered power. New references to the name were spotted by independent Apple code researcher <a href=\"https://twitter.com/aaronp613/status/1689067430503469056?s=20\">aaronp613</a>. \r<br />\n\r<br />\nThere is a single woven braided power cable that attaches to the left side of the Vision Pro headset. The cable can be plugged into a static power source or plugged into a Magic Battery for use on the go. \r<br />\n\r<br />\nThe Magic Battery is designed to fit in a pocket, and can be swapped out for additional power on the go, but the device ships with a single battery, so users will have to buy more battery packs to extend battery life when away from a power outlet.\r<br />\n\r<br />\nApple's Vision Pro has been criticized for relying on a separate battery pack that is worn at the waist. Most AR/VR headsets on the market have an integrated battery, but Apple decided in testing that the added weight of an internal battery would make the Vision Pro too heavy and uncomfortable to wear.\r<br />\n\r<br />\n<div><blockquote><p>LOL</p>— Marques Brownlee (@MKBHD) <a href=\"https://twitter.com/MKBHD/status/1689072479833141248?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote> </div>\r<br />\nSet to be released in early 2024, the $3,499 Vision Pro includes more high-end hardware than any headset currently on the market, featuring two high-resolution 4K micro-OLED displays, 12 cameras and five sensors for monitoring hand gestures and mapping the external environment, two Apple silicon processors, and more. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/09/apple-magic-battery-vision-pro-headset/\">Apple 'Magic Battery' Will Power Vision Pro Headset</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-magic-battery-will-power-vision-pro-headset.2398157/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"de79526176c5a3024e7d640ff7ff1bbe87483e67b0e07452f466ee3d43000936","category":"Apple"}