{"title":"Mark Zuckerberg อธิบาย ตั้งใจทำคลิปรีวิว Visio Pro เพราะลองแล้ว Meta Quest เจ๋งกว่าทุกอย่าง","link":"https://www.blognone.com/node/138288","date":1708417598000,"content":"<div><div><div><p>Mark Zuckerberg ให้สัมภาษณ์กับรายการพ็อดแคสต์ Morning Brew Daily (ตอนเดียวกับข่าว <a href=\"https://www.blognone.com/node/138267\">ลูกสาวคิดว่าพ่อทำอาชีพเลี้ยงวัว เพราะไม่เข้าใจว่า Meta คืออะไร</a>) อธิบายเหตุผลที่<a href=\"https://www.blognone.com/node/138192\">เขาในฐานะผู้นำอันดับ 1 ขององค์กรต้องออกมาทำคลิปรีวิวผลิตภัณฑ์ของคู่แข่ง</a> จนเป็นที่โจษจัน</p>\n<p>Mark อธิบายแบบเดียวกับในคลิปต้นฉบับบน Instagram ว่าตอนแรกเขาคาดการณ์ว่า Vision Pro จะเจ๋งกว่า Meta Quest เพราะราคาแพงกว่า 7 เท่า แต่ Meta Quest จะเหนือกว่าในแง่ \"ราคาต่อคุณค่า\" แต่เมื่อได้ลองแว่น Vision Pro ด้วยตัวเองแล้ว เขาก็ได้ข้อสรุปว่า Meta Quest เหนือกว่าแทบทุกด้าน โดยไม่ต้องนำราคามาเทียบเลย ซึ่งการที่ Vision Pro มีแบรนด์ Apple ติดมาด้วย คนทั่วไปย่อมคิดว่าต้องดีกว่าเสมอ เขาต้องการตอบโต้แนวคิดแบบนี้จึงอยากมาทำคลิป</p>\n<p>อย่างไรก็ตาม Mark บอกว่าการที่ Vision Pro เข้ามาแข่งขันในตลาดนี้ ย่อมเป็นประโยชน์ต่อผู้บริโภค ตัวเขาเองเป็นคนที่ชอบการแข่งขัน การที่มีคู่แข่งที่ทำสินค้าออกมาได้ดี ย่อมทำให้เขาและทีมงานมีแรงบันดาลใจในการแข่งขันให้ชนะมากขึ้น แถมการที่แอปเปิลมาช่วยจุดกระแสแว่นสวมหัวมาอีกครั้งก็ทำให้คนทั่วไปสนใจตลาดนี้ เมื่อมาลองหาข้อมูลแล้วพบว่า Meta Quest ดีกว่าในราคาเพียง 500 ดอลลาร์ ก็ช่วยให้ยอดขาย Quest เพิ่มขึ้นเช่นกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/dfe06972647e425c0cf1960fcf672ce0.jpeg\" /></p>\n<p>เมื่อถูกถามเปรียบเทียบว่าคลิปรีวิว Vision Pro ของเขาจะเหมือนกับที่ในอดีต Steve Ballmer ซีอีโอของไมโครซอฟท์เคยหัวเราะเยาะ iPhone ในปี 2007 หรือไม่ คำตอบของ Mark คือเขาไม่ได้หัวเราะเยาะแอปเปิล และเขามองแอปเปิลเป็นคู่แข่งที่น่ากลัว เขาเพียงแค่เล่าความจริงตามที่เป็น และเขาเชื่อว่าแอปเปิลจะปรับปรุงแว่นได้เร็วแน่ๆ แต่เขาก็มั่นใจว่า Meta จะทำได้เร็วกว่า โมเดลธุรกิจของ Meta เป็นโมเดลเปิดแบบเดียวกับพีซีในอดีต ต่างไปจากโมเดลปิดของแอปเปิล ซึ่งเขามั่นใจว่าโมเดลของเขาจะชนะในระยะยาว</p>\n<p>เขายังพูดถึงทิศทางในระยะยาวว่าจะมุ่งสู่ Mixed Reality มากขึ้น เป็นการผสมผสานระหว่างวัตถุเสมือนกับวัตถุจริง ซึ่งสะท้อนให้เห็นจากความแตกต่างสำคัญของ Meta Quest 2 กับ Meta Quest 3 อยู่ที่ฟีเจอร์ color passthrough ช่วยให้โลกความเป็นจริงซ้อนทับเข้ามาในแว่นได้ เป้าหมายระยะยาวของเขาคือการสร้างโลกที่มีโฮโลแกรมซ้อนทับอยู่บนโลกจริงๆ</p>\n<p>เขาบอกว่าอุปกรณ์แว่นลักษณะนี้คืออนาคตของพีซีหรือทีวีจอใหญ่ ไม่ได้ทับกับตลาดสมาร์ทโฟน ซึ่งจะยังเป็นอุปกรณ์คอมพิวเตอร์ที่สำคัญที่สุดของคนส่วนใหญ่ต่อไป ในอีกทางหนึ่งยังมีแว่น <a href=\"https://www.blognone.com/node/135975\">Ray-Ban Smart Glasses</a> ที่ขนาดเล็ก ฟีเจอร์ยังไม่ต้องเยอะเท่ากับแว่นเต็มรูปแบบ พลังประมวลผลไม่ต้องเยอะเท่า แต่ครอบคลุมฟีเจอร์พื้นฐาน เช่น ถ่ายภาพได้ มีไมโครโฟน-ลำโพง ฟังเสียง พูดคุยสนทนากับ AI ได้ แว่นลักษณะนี้จะเพียงพอสำหรับคนทั่วๆ ไปแล้ว</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/meta-quest\">Meta Quest</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/virtual-reality\">Virtual Reality</a></div><div><a href=\"/topics/mixed-reality\">Mixed Reality</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"de8e829fcf8bba10bf9c06d06a222e089c9860f67c5ed0f56b9586d453c9e6f8","category":"Thai"}