{"title":"Evaluation of clinicians’ knowledge and practice regarding pharmacotherapy of Non-Hodgkin’s lymphoma: A multi-center study in Yemen","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304209","date":1717596000000,"content":"<p>by Mohammed Mohammed Battah, Hadzliana Zainal, Doa’a Anwar Ibrahim, Nur Hafzan Binti Md Hanafiah, Syed Azhar Syed Sulaiman</p>\r\n\r\nNon-Hodgkin lymphoma (NHL) is a hematological malignancy that requires effective pharmacotherapy for optimal management. There is limited information regarding Yemeni clinicians’ knowledge and practice of NHL pharmacotherapy. This study aims to assess the knowledge and practice of physicians and nurses in Yemen regarding pharmacotherapy of NHL. A cross-sectional study was conducted in Sana’a, Yemen, from January 1, 2022, to January 31, 2023. Two self-administrated and validated questionnaires were distributed to 99 physicians and 164 nurses involved in pharmacotherapy for NHL in different oncology centers and units across Yemen. Convenience samples were used to recruit participants. A binary logistic regression analysis was performed to identify factors associated with nurses’ and physicians’ knowledge and practice. The correlation coefficient was used to examine the relationship between knowledge and practice. A total of 77 physicians and 105 nurses completed the questionnaires. The results showed that 54.3% of nurses and 66.2% of physicians had poor knowledge of NHL pharmacotherapy. In terms of practice, 83.8% of nurses and 75.3% of physicians exhibited poor practice regarding NHL pharmacotherapy. Multivariable logistic regression analysis identified that nurses who received sufficient information about chemotherapy displayed a significant association with good knowledge, while nurses working in the chemotherapy administration department were significant predictors of good practice. Among physicians, those working in the National Oncology Center (NOC) in Sana’a demonstrated good practice. Correlation analysis revealed a positive relationship between nurses’ knowledge and their practice. The study’s results confirm deficiencies in knowledge and practice of pharmacotherapy for NHL among physicians and nurses in Yemen. Efforts should be made to enhance their understanding of treatment guidelines and to improve patient care. Improvement in educational programs and training opportunities may contribute to improving patient outcomes in the management of NHL.","author":"Mohammed Mohammed Battah","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"de95ae0bb297ef1b815f0edafd30e0147ee4e1adb8f508762ee2f8a7a095750b","category":"Interdisciplinary"}