{"title":"Future amazon basin wetland hydrology under projected climate change","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000225","date":1727704800000,"content":"<p>by Nic Gedney, Conrado Rudorff, Richard A. Betts</p>\r\n\r\nClimate change over the Amazon basin has the potential to cause major hydrological and ecological impacts over the region’s extensive wetlands. To investigate this the Joint UK Land Environment Simulator (JULES) land surface model is first extended to include riverine inundation. Potential impacts of future climate change on Amazon basin wetlands are then evaluated by driving this updated JULES model with modelled meteorology projections from six different climate simulations reaching approximately 4°C global warming at the end of the 21<sup>st</sup> Century. The projected changes in inundation extent and seasonality are assessed over four major wetland regions. The simulations project, on average, a significant decrease in total Amazon basin inundated area of 11% (range: -36% to +9%) by the 2090s. This considerable spread is primarily driven by disparity in simulated precipitation changes, ultimately driven by sea surface temperature differences. The wetter contemporary climate simulations simulate the greatest drying by the end of this Century, resulting in the largest wetland area reductions. The largest qualitative disagreement is over the western Iquitos wetland, with inundated area changes ranging from a very large reduction of -53% to an increase of 12%. A new wetland classification scheme is developed to summarise the projected changes in wetland seasonality. The largest drops in simulated wetland season length occur over the Central/East Manaus and West Iquitos wetland regions, with reductions of up to 10 and 8 months respectively. Such significant changes in future inundation are likely to have a major impact on regional wetland hydrology and their ecosystems.","author":"Nic Gedney","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"de9ebf796a0f31af925f05b3afe879e76484d4e99c9fbc58fc630498ebfebaf3","category":"Environment"}