{"title":"Biophysical Analysis of a Minimalistic Kidney Model Expressing SGLT1 Reveals Crosstalk Between Luminal and Lateral Membranes and a Plausible Mechanism of Isosmotic Transport","link":"https://www.preprints.org/manuscript/202406.1779/v1","date":1719397290000,"content":"We extended our model of the S1 tubular segment to address the mechanisms by which SGLT1 interacts with lateral Na/K pumps and tight junctional complexes to generate isosmotic fluid reabsorption via tubular segment S3. The strategy applied allowed simulation of laboratory experiments. Reproducing known experimental results constrained the range of acceptable model outputs and contributed to minimizing the free parameter space. \n1. In experimental conditions, published Na and K concentrations of proximal kidney cells were found to deviate substantially from their normal physiological levels. Analysis of the mechanisms involved suggested insufficient oxygen supply as the cause and indirectly, that a main function of the Na/H exchanger (NHE3) is to extrude protons stemming from mitochondrial energy metabolism.\n2. The water path from the lumen to the peritubular space is through aquaporins on the cell membrane and claudin-2 at paracellular tight junctions, with a smaller additional contribution to water transport by the coupling of 1 glucose:2 Na:200 H2O in SGLT1. \n3. A Na+-uptake component passed through paracellular junctions by solvent drag in Na- and water-permeable claudin-2, thus bypassing the Na/K-pump, in agreement with the findings of early studies. \n4. Electrical cross talk between apical rheogenic SGLT1 and lateral rheogenic Na/K pumps results in tight coupling of luminal glucose uptake and transepithelial water flow. \n5. Isosmotic transport is achieved by Na-mediated ion recirculation at the peritubular membrane.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dea336b244441617446db3ab3221e43d87a33e84b800c439f74faea1bcc67b9d","category":"Interdisciplinary"}