{"title":"Astronomers solve mystery of how a mirror-like planet formed so close to its star","link":"https://arstechnica.com/?p=1952412","date":1689003843000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Exoplanet_LTT9779_b_orbiting_its_host_star_pillars-800x450.png\" alt=\"An artist impression of exoplanet LTT9779b orbiting its host star. The planet is around the size of Neptune and reflects 80 percent of the light shone on it.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Exoplanet_LTT9779_b_orbiting_its_host_star_pillars.png\">Enlarge</a> <span>/</span> An artist impression of exoplanet LTT9779b orbiting its host star. The planet is around the size of Neptune and reflects 80 percent of the light shone on it. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It has been about three decades since the first confirmed exoplanet was discovered. In the following 30 years, using a variety of telescopes and instruments on the ground and in space, <a href=\"http://exoplanet.eu/catalog/\">astronomers have cataloged</a> more than 5,000 planets around other stars.</p>\n<p>As part of this process of scientific discovery, astronomers have confirmed that our Milky Way galaxy teems with billions of planets. They exist around many (if not most) stars, and they come in all sizes and flavors. There are very large and very small planets and very hot and very cold ones. There are more than a few that could harbor life as we know it on Earth.</p>\n<p>After this initial wave of discovery, powered by such NASA survey missions as the Kepler Space Telescope and the Transiting Exoplanet Survey Satellite, second-generation instruments like Europe's small Cheops satellite have sought to characterize the nature of these exoplanets. Launched less than three years ago on a Soyuz rocket, the Cheops instrument has delivered some valuable insights on planets orbiting other stars.</p></div><p><a href=\"https://arstechnica.com/?p=1952412#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952412&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dea7dea86e312149fb5c24d5d24a14b810f5895b1c07bd9fc804fa93ef956308","category":"Tech"}