{"title":"Enhanced Prototypical Network with Customized Region-Aware Convolution for Few-Shot SAR ATR","link":"https://www.preprints.org/manuscript/202407.2260/v1","date":1722239318000,"content":"With prosperous development and successful application of deep learning technologies in the field of remote sensing, numerous deep-learning based methods have emerged for synthetic aperture radar (SAR) automatic target recognition (ATR) tasks over the past few years. Generally, most deep-learning based methods can achieve outstanding recognition performance in condition that an abundant of labeled samples are available to train the model. However, in real application scenarios, it is difficult and costly to acquire and to annotate abundant SAR images due to the imaging mechanism of SAR, which poses a big challenge to existing SAR ATR methods. Thereby, SAR target recognition under the situation of few-shot, where only a scarcely few of labeled samples are available, is a fundamental problem that needs to be solved. In this paper, we put forward a new method named enhanced prototypical network with customized region-aware convolution (CRCEPN) to specially tackle the few-shot SAR ATR tasks. To be specific, We first develop a feature extraction network based on a customized and region-aware convolution, which can adaptively adjust convolutional kernels and their receptive fields according to each SAR image’s own characteristics as well as the semantical similarity among spatial regions, thus augmenting its capability to extract more informative and discriminative features. To achieve accurate and robust target identity prediction under the few-shot condition, we then propose an enhanced prototypical network which can improve the representation ability of the class prototype by properly making use of training and test samples together, thus effectively raising the classification accuracy. Meanwhile, a new hybrid loss is designed to learn a feature space with both inter-class separability and intra-class tightness as much as possible, which can further upgrade the recognition performance of the proposed method. Experiments performed on the moving and stationary target acquisition and recognition (MSTAR) dataset and the OpenSARShip dataset demonstrate that the proposed method is competitive with some state-of-the-art methods for few-shot SAR ATR tasks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"deaf0dbb5c77ab9125ba4f0b25ac30a7444a34b0914347f794952adee91ff345","category":"Interdisciplinary"}