{"title":"How can Remco Evenepoel counter Jumbo-Visma's growing threat at the Vuelta a España?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/how-can-remco-evenepoel-counter-jumbo-vismas-growing-threat-at-the-vuelta-a-espana","date":1693681383000,"content":"\n      <p>Remco Evenepoel started stage eight of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> on the backfoot, the momentum in the GC race shifting away from him.</p>\n<div></div>\n<p>Two days ago, on the race’s last venture into challenging terrain, he was dropped worryingly early on the finishing climb to the observatory at Javalambre, and lost both the red jersey and, more importantly, significant time to his mian GC rivals: eight seconds to Enric Mas (Movistar), 18 seconds to Cian Uijtdebroeks (Bora-Hansgrohe) and João Almeida (UAE Team Emirates), 25 seconds to Almeida’s teammate Juan Ayuso, and 32 seconds to Jumbo-Visma’s Primož Roglič and Jonas Vingegaard. On top of that, he also had many more potential GC threats to occupy him, dangerous riders such as Sepp Kuss (Jumbo-Visma), Marc Soler (UAE Team Emirates) and young wildcard Lenny Martinez (Groupama-FDJ) all leapfrogging him and gaining several minutes after getting into the day’s successful break.</p>\n<p>Perhaps sensing blood, Jumbo-Visma took it up at the front of the peloton during the stage, with domestiques Robert Gesink and Dylan van Baarle setting a fast enough pace to catch the day’s break. It was an assertive statement of intent, and one that suggested they were out for a stage win, and to make ground in the race for the red jersey.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-jumbo-conundrum-who-will-emerge-as-the-teams-leader-at-the-vuelta\"><strong><em>Read more: A Jumbo conundrum: who will emerge as the team's leader at the Vuelta?</em></strong></a></p>\n<p>All this considered, the way the stage ultimately played out could hardly have gone much better for Evenepoel. For all Jumbo-Visma’s work earlier in the day, it was Evenepoel’s teammates who took control on the decisive steep uphill of Xorret de Catí, with Louis Vervaeke and Mattia Cattaneo riding at the tempo the Belgian wanted. When the expected attack from Jumbo-Visma came from Kuss, Evenepoel responded perfectly, riding at a tempo just quick enough to keep the American in sight, but not quite quick enough to catch him and leave himself open to counter-attacks. And then once Kuss was brought back one kilometre from the top, Evenepoel continued to lead the group fast enough to deter any more attacks, and a group of eight GC favourites made it to the top of the climb together.</p>\n<p>Evenepoel’s only misstep was at the finish a couple of kilometres later, where he was overtaken at the finish by Roglič to finish second on the stage, losing out on both a second stage win and a few more bonus seconds. He looked annoyed immediately after, and it soon transpired why — it turned out he hadn’t realised that all of the riders from the original break had been caught, and that he had been sprinting with Roglič for the stage victory. Yet aside from feeling sheepish at this mistake (“I feel a bit stupid, actually”, he explained with an embarrassed smile), things were looking much more positive than they did after stage six.</p>\n<p>However, we should not get too carried away about how rosier Evenepoel’s prospects look after today. The fact remains that his team is weaker than those of his major GC rivals, and any vulnerability they have today was spared mostly by a parcours that made the race relatively easy to control. Though the terrain was rolling for much of the day, none of the climbs preceding Xorret de Catí were ranked higher than category two, and therefore not difficult to set about either attacking or attempting to isolate Evenepoel. As for Xorret de Catí, it was the kind of short, steep effort where teammates aren’t as much use as they are on longer, steady climbs, and where it’s easier for a rider to set their own tempo, as Evenepoel did for much of its second half. He himself talked about how the plan was for them to go hard only “for the first steep kilometre’’, and then “after that I will do my own race”.</p>\n<p><img alt=\"Vuelta a España 2023 stage eight\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230902VUE02020-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1693681123\" /></p>\n<p>On the proper mountain stages to come later in the race, Soudal-Quick-Step could still be seriously exposed. As good as Cattaneo and Vervaeke were today, Jan Hirt was dropped early on the climb and unable to offer Evenepoel assistance, which is especially worrying seeing as the Czech rider had been his most dependable climbing domestique in the race up until now. He’ll need Hirt and these other climbers to support him deep into stages like the double-header in the Pyrenees next week and in Asturias, where selections could be made earlier, leaving him vulnerable to multi-pronged attacks from Jumbo-Visma if isolated.</p>\n<p>Kuss’ attack on Xorret de Catí today feels like it will be a sign of things to come. Jumbo-Visma are using him in a much more aggressive role than usual, freeing him up to attack rather than just set the pace on the climbs. Consequently, he now leads the general classification, giving Evenepoel a third Jumbo-Visma rider to have to neutralise along with the deadly duo of Vingegaard and Roglič. As things stand, Evenepoel can’t afford to just ride defensively against him either, as he has 2:31 to make up on him — although he’ll be hoping to gain most, if not all, of that on Tuesday’s time trial in Valladolid.</p>\n<p>Worse still, UAE Team Emirates riders also remain amassed at the top of the GC, with Ayuso and Almeida within 38 seconds of Evenepoel, and Soler almost two minutes ahead after staying with the group of favourites today following his breakaway exploits a couple of days ago. Add to that the threat of Enric Mas, who’s climbing well and remains just 11 seconds behind, and Evenepoel and Soudal-Quick-Step will have a lot of fires to put out throughout this Vuelta if they are to defend their title.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"deb72dc312f6429c50130649f178d0296b3b34d403bd91427b537fa4b891a98b","category":"Cycling"}