{"title":"Disparities in COVID-19 vaccine uptake among rural hard-to-reach population and urban high-risk groups of Bangladesh","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302056","date":1714399200000,"content":"<p>by Zerin Jannat, Hemel Das, Md. Wazed Ali, Tasnuva Wahed, Md. Nurul Alam, Md. Jasim Uddin</p>\r\nBackground <p>Vaccination has been an indispensable step in controlling the coronavirus disease pandemic. In early 2021, Bangladesh launched a mass vaccination campaign to boost the COVID-19 vaccination rate when doses were available and immunized millions in the country. Although deemed a success, disparities became conspicuous in vaccination coverage across population of different socioeconomic background.</p> Methods <p>The purpose of this cross-sectional study was to assess the vaccination coverage for three doses and detect disparities in uptake of the COVID-19 vaccine among rural population of hard-to-reach areas and urban individuals belonging to the high-risk group -defined in our study as individuals from elusive population such as floating population/street dwellers, transgender, addicts and disabled population. We conducted household survey (n = 12,298) and survey with high risk group of people (2,520). The collected primary data were analysed using descriptive statistical analysis.</p> Results <p>Our findings show that coverage for the first dose of COVID-19 vaccination was high among respondents from both rural Hard-to-reach (HTR) (92.9%) and non-HTR (94.6%) areas. However, the coverage for subsequent doses was observed to reduce significantly, especially for third dose (52.2% and 56.4% for HTR and non-HTR, respectively).</p> Conclusion <p>Vaccination coverage among urbanites of high-risk group was found to be critically low. Vaccine hesitancy was also found to be high among individuals of this group. It is essential that the individuals of urban high-risk group be prioritized. Individuals from this group could be provided incentives (transport for disabled, monetary incentive to transgenders; food and medicine for drug user and floating people) and vaccination centers could be established with flexible schedule (morning/afternoon/evening sessions) so that they receive vaccine at their convenient time. Community engagement can be used for both high-risk group and rural population to enhance the COVID-19 vaccination coverage and lower disparities in uptake of the vaccine doses nationwide.</p>","author":"Zerin Jannat","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dec31206c308946979ad384214dc3bbd56d9c574c08eb642074fe12fa2534464","category":"Interdisciplinary"}