{"title":"Potential to grow carp oedema virus (genogroup I) in monolayers of carp‐derived primary cells with further implication in cell analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13934?af=R","date":1715361848000,"content":"<h2>Abstract</h2>\n<p>Carp oedema virus (CEV) has distinct molecularly identified genogroups of viral mutations, denoted as I, IIa, and IIb. Failure to propagate CEV in vitro limits studies towards understanding its interactions with host cells. Here, virus isolates belonging to genogroup I collected during natural outbreaks in the Czech Republic were employed for routine CEV cultivation in monolayers of carp-derived primary cells, common carp brain (CCB) cells, and epithelioma papulosum cyprinid (EPC) cells. Induction of cytopathic effects (CPEs) was observed and recorded in affected cells. Cell survival rate was evaluated under serial dilutions of the CEV inoculum. Virus cell entry was quantified and visualized by qPCR and transmission electron microscopy, respectively. Study findings indicate primary gills epithelia likely present the most suitable matrix for CEV growth in vitro. Cells of the head kidney and spleen facilitate virus entry with microscopically confirmed CPEs and the presence of cytoplasmic pleomorphic virus particles. Cells of the trunk kidney and gonads are unlikely to permit virus cell entry and CPEs development. Although CEV cultivation in cell lines was inconclusive, EPC cells were CEV permissible. Monolayers of carp-derived primary cells show promise for CEV cultivation that could enable elaborate study of mechanisms underlying cellular binding and responses.</p>","author":"Ehdaa Eltayeb Eltigani Abdelsalam, \nZuzana Bláhová, \nAli Asghar Baloch, \nVeronika Piačková","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"ded23863c64ffbf8d1ff685215b6391d4bca0a668131559a526921de6a78d91e","category":"Environment"}