{"title":"Growth Performance, Blood Metabolites, Carcass Characteristics and Meat Quality of Lambs Fed Diets Containing Different Energy Levels Supplemented with Rumen-Protected Choline","link":"https://www.preprints.org/manuscript/202405.0344/v1","date":1715062655000,"content":"This study aimed to examine the effects of metabolizable energy (ME) level and rumen-protected choline (RPC) supplementation on the growth performance, carcass characteristics, meat quality, serum energy, lipid, and protein profiles of Karayaka. Individually housed Karayaka lambs (n = 28), with initial body weight (BW) of 26.85 ± 0.26 kg, were randomly assigned (2 × 2 factorial design) to one of four dietary treatments with two levels of ME (optimum: 2750 or low: 2500 kcal ME/kg dry matter) and two levels of RPC (0 or 4 g/d/lamb). The experiment lasted 66 d, with the first 10 d of acclimation and the next 56 d of the formal experimental period. The data on BW, dietary matter intake (DMI), and serum glucose concentrations confirm that our model successfully induced low energy using 250 kcal/kg less energy than the optimum level. RPC supplementation did not significantly affect average daily DMI, total average daily gain (ADG), or feed conversion ratio (FCR) at any energy level. Additionally, there was no substantial effect on carcass characteristics, meat quality, serum lipids, energy metabolism indicators, and liver function parameters. There was also no interaction effect of RPC × ME on the parameters tested. However, at 56 d into the experiment, the interaction effect of RPC × ME on serum urea-N was highly significant, and RPC supplementation led to lower serum urea-N levels (p = 0.001). The results of this study do not support the use of RPC supplementation to improve animal performance or carcass characteristics in lambs that received a reduced diet of 250 kcal ME/kg.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dee0132647014229e62e5ef0b44da6aee8c37aafc237a958666458d6e6624917","category":"Interdisciplinary"}