{"title":"A Pilot Study to Research Associations between Alzheimer&rsquo;s Disease and Suicide: The Questionnaire Feasibility","link":"https://www.preprints.org/manuscript/202405.1144/v1","date":1715938599000,"content":"Background:\nThere have been reports of numerous risk factors for Alzheimer's disease. Although widely investigated, some points during the evolution of the disease have been obscure. One of them is a great frustration with therapeutic expectations. Why has there been an increase in suicidal behavior in treatments with anti-beta-amyloid drugs? Interpersonal stress is one of the factors that may be connecting Alzheimer's disease to suicide.\nMethod:\nTo observe possible associations between Alzheimer's disease and suicide, two validated questionnaires were selected. We recruited 20 elderly patients over 65 years old to observe the feasibility of further research using these instruments. The study was considered viable if all participants showed no difficulty in understanding the questions and completed both questionnaires in less than 30 minutes with a tendency to homogeneity. A description of the statistical data obtained was made.\nResults:\nAll participants adequately understood the questions and completed the questionnaires in less than 30 minutes. In 10% of the sample, suicide attempts occurred throughout their lives. The average age of respondents was 75 years old. The QoSL Pareto diagram demonstrated a large concentration.  The data demonstrated homogeneity.\n\n\nConclusions:\nThe application of the questionnaires in a sample suitable for carrying out analytical statistics was demonstrated. We have two great tools to try to understand the possible association between Alzheimer's disease and suicide.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dee5eee2448789594b073dfb80ec15efc4a07a28e62db722e73feb1b5b9441b2","category":"Interdisciplinary"}