{"title":"Cate Blanchett nails the outlaw look as Lilith in Borderlands official trailer","link":"https://arstechnica.com/?p=2004687","date":1708539599000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Cate Blanchett stars as an infamous outlaw named Lilith in director Eli Roth's <em>Borderlands</em>, adapted from the popular gaming franchise. </p></div>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Borderlands_(series)\"><em>Borderlands</em></a> video game franchise is one of the bestselling of all time, racking up more than $1 billion globally in sales over all the titles in the series. So naturally, there would be a film adaptation: the forthcoming <a href=\"https://en.wikipedia.org/wiki/Borderlands_(film)\"><em>Borderlands</em></a>, directed by Eli Roth (<em>Cabin Fever</em>, <em>The House with a Clock in its Walls</em>). Lionsgate just dropped the official trailer, and Roth has certainly captured the trademark cel-shaded look of the film—especially Cate Blanchett's fluorescent-haired outlaw. </p>\n<p>The <em>Borderlands</em> games all take place on a planet called Pandora, home to many dangerous lifeforms as well as bandits and raiders—former prisoners of corporations that previously tried to colonize the planet, believing there were precious minerals to be mined. Pandora's long-extinct race, called the Eridians, also left behind numerous alien artifacts, which eventually led to the discovery that there are various mythical vaults purportedly filled with treasure and guarded by ancient monsters. Along with corporate and military interests, there are renegade Vault Hunters who seek to claim the hidden treasures for themselves.</p>\n<p>It might feel like <em>Borderlands</em> the film has been in development forever. Lionsgate announced the adaptation in 2015 and initially considered Leigh Whannell (<em>The Invisible Man</em>) to direct. The script went through multiple revisions by several different writers, and Roth was hired as director in February 2020. Primary filming took place in Budapest, Hungary, in 2021, mid-pandemic, with reshoots occurring early in 2023. Tim Miller (Terminator: Dark Fate) directed the reshoots with Roth's blessing since, by then, the latter was already working on another film (2023's Thanksgiving). Initial first-look images were released in June 2021, although those were just black-and-white silhouettes of the cast.</p></div><p><a href=\"https://arstechnica.com/?p=2004687#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004687&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dee6217daaccb9d4d5f9cded95e156eb800ad397415e2be6ea3cb835f6d57d4a","category":"Tech"}