{"title":"Multi‐omics analysis of chemical composition variation among different muscle types in Hu lamb","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13962?af=R","date":1728889200000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Consumers' preferences for lamb meat vary greatly depending on the specific cut. Variations in the chemical composition across different muscle types play a crucial role in determining meat quality, particularly with regard to flavor. Therefore, it is essential to study the variations in chemical composition among different muscle types in lamb, as well as the mechanisms behind their formation, aiming to understand the flavor variation across the muscle types.</p>\n<h2>RESULTS</h2>\n<p>Flank muscles showed significantly higher intramuscular fat content and muscle fiber diameter compared to triceps brachii and biceps femoris (BF), at the same time as displaying a significantly lower percentage of type I muscle fibers. Forty-three differentially abundant volatile compounds (DAVC) were identified across five muscles, with the majority of DAVCs being more abundant in the BF. In total, 161 differentially abundant lipids were identified across five muscles, with triglycerides (TG), phosphatidylcholines (PC), phosphatidyl ethanolamines (PE) and phosphatidylmethanol (PMeOH) showing a strong correlation with DAVCs. A lipid-gene regulatory network was established, encompassing 664 lipids and 11 107 genes, leading to the identification of pathways and genes that regulate the metabolism of PEs, PMeOH, PCs and TGs.</p>\n<h2>CONCLUSION</h2>\n<p>The present study showed the significant variation in flavor compounds among the five edible muscles, as well as the potential reasons for their formation. The results potentially provide a theoretical foundation for improving the meat quality of lamb. © 2024 Society of Chemical Industry.</p>","author":"Xueying Zhang, \nZhongyu Wang, \nChongyang Liu, \nWenqiao Li, \nZehu Yuan, \nFadi Li, \nXiangpeng Yue","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"def2a587beb4fcee3462510b074271503b94cf90bf9ccaff264b18a9c3eb1a58","category":"Environment"}