{"title":"Deterministic Quantum Mechanics &ndash; Part I &ndash; Conceptual Framework","link":"https://www.preprints.org/manuscript/202405.1244/v1","date":1716191799000,"content":"A deterministic quantum mechanics theory is presented in a series of papers starting with the present one. The proposed theory is shown to be consistent with the current mainstream statistical quantum theory as well as with classical physics. It produces solutions, which demonstrate that causality, physical reality, and determinism are restored and can explain in simple form concerns that are raised by results from the current mainstream statistical quantum theory. The meaning of particle- wave duality and complementarity, the possibility of a particle, like the electron, to cross through the nucleus as it does when the angular momentum of the electron is zero at the ground state of the hydrogen atom, the possibility of a point-size particle to have an “intrinsic spin”, the possibility of “quantum jumps” as the electron transitions instantaneously from one stable orbital to another without passing through the space in between the orbitals and does that at irregular time intervals, and the natural collapse of the wave function as part of the solution are some of the results that emerge from the proposed deterministic quantum mechanics theory. The phenomenon of entanglement is shown to be consistent with the proposed deterministic quantum mechanics theory. The Bohr-Schrödinger energy levels leading to the experimentally confirmed spectral lines, as well as the fine structure constant emerge directly from the solution of the equations governing theproposed deterministic quantum mechanics presented in Part II of these series of papers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"def5944769b49f32aab31edc0ab2a80e83e618896f42a3fb2d927303b0728c33","category":"Interdisciplinary"}