{"title":"หนังสือไม่มีเนื้อหาสาระที่ AI เขียน ติดอันดับหนังสือขายดีบน Kindle Unlimited ของ Amazon แย่งรายได้จากนักเขียนจริง","link":"https://www.blognone.com/node/134616","date":1688124291000,"content":"<div><div><div><p>Vice รายงานว่า รายการหนังสือยอดนิยมบน Kindle Unlimited ของ Amazon เต็มไปด้วยหนังสือที่สร้างขึ้นจาก AI หลายสิบเล่มเพื่อหวังสร้างกำไร โดยเป็นหนังสือที่ไม่มีเนื้อหาสาระและอาจจะส่งผลกระทบต่อรายได้ของนักเขียนและสำนักพิมพ์</p>\n<p>Caitlyn Lynch เป็นนักเขียนอิสระได้ทวีตข้อความว่า “The AI bots have broken Amazon” บอตจาก AI กำลังทำให้ Amazon พัง เนื่องจากวันจันทร์ที่ผ่านมา 100 อันดับหนังสือขายดี ในหมวด “Teen &amp; Young Adult Contemporary Romance eBooks” มีเพียง 19 เล่มเท่านั้นที่เป็นหนังสือจริงที่เขียนจากคน ส่วนที่เหลือล้วนเป็นหนังสือสร้างจาก AI ทั้งนั้น เช่น When the three attacks, Apricot bar code architecture เป็นต้น ซึ่งบางเล่มได้รับคะแนนรีวิวเพียง 1 ดาวเท่านั้น ทำให้คนส่วนใหญ่เรียกหนังสือเหล่านี้ว่า “fake AI book.”</p>\n<p>Lynch ยังพูดเสริมอีกว่า Amazon ควรแก้ปัญหานี้โดยเร็วที่สุด เพราะไม่งั้นจะเกิดผลกระทบภายหลังเนื่องจากรายได้ที่นักเขียนหรือสำนักพิมพ์ได้รับ ขึ้นอยู่กับจำนวนหน้าที่มีคนอ่านใน Kindle ดังนั้นถ้าหนังสือที่สร้างขึ้นโดย AI มีจำนวนเยอะขึ้น ก็จะส่งผลให้รายได้ของนักเขียนใน Kindle ลดลงและในที่สุดนักเขียนอาจจะนำหนังสือออกจากระบบ Kindle Unlimited</p>\n<p>ถึงแม้ว่าตอนนี้หนังสือเหล่านี้ไม่ได้ติดอันดับอยู่ในหมวดขายดีบนเว็บแล้ว แต่ก็ยังสามารถค้นหาและหาซื้ออ่านได้บนเว็บ Kindle Unlimited ของ Amazon</p>\n<blockquote><p>The AI bots have broken Amazon.Take a look at the Best Sellers in Teen &amp; Young Adult Contemporary Romance eBooks top 100 chart.I can see 19 actual legit books.<a href=\"https://t.co/fy9rtV6Ck6\">https://t.co/fy9rtV6Ck6</a>The rest are AI nonsense clearly there to click farm.<a href=\"https://twitter.com/AmazonKDP?ref_src=twsrc%5Etfw\">@AmazonKDP</a> what are you doing about it? <a href=\"https://t.co/cziuKcQrq3\">pic.twitter.com/cziuKcQrq3</a></p>\n<p>— Caitlyn Lynch aka Catherine Bilson (@caitlynlynch6) <a href=\"https://twitter.com/caitlynlynch6/status/1673215622753456129?ref_src=twsrc%5Etfw\">June 26, 2023</a></p></blockquote>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ef4aee52f66ef4e03334e93e2e85446f.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.vice.com/en/article/v7b774/ai-generated-books-of-nonsense-are-all-over-amazons-bestseller-lists\">Vice</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/kindle-unlimited\">Kindle Unlimited</a></div><div><a href=\"/topics/ebook\">eBook</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"def9cc5cf4b934c098a956ce7ff7f61c1989aa7623122510f8924ee9c4d8b0f6","category":"Thai"}