{"title":"International Coalition of Policy Groups Urges Apple to Abandon 'Plans to Build Surveillance Capabilities into iPhones'","link":"https://www.macrumors.com/2021/08/19/policy-groups-urge-apple-abandon-csam-scanning/","date":1629361439000,"content":"An international coalition of more than 90 policy and rights groups <a href=\"https://cdt.org/insights/international-coalition-calls-on-apple-to-abandon-plan-to-build-surveillance-capabilities-into-iphones-ipads-and-other-products/\">published an open letter</a> on Thursday urging Apple to abandon its plans to \"build surveillance capabilities into iPhones, iPads, and other products\" – a reference to the company's intention to <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">scan users' photo libraries for images of child sex abuse</a> (via <em><a href=\"https://www.reuters.com/technology/exclusive-policy-groups-ask-apple-drop-plans-inspect-imessages-scan-abuse-images-2021-08-19/\">Reuters</a></em>).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/Child-Safety-Feature-yellow.jpg\" /><blockquote>\"Though these capabilities are intended to protect children and to reduce the spread of child sexual abuse material (CSAM), we are concerned that they will be used to censor protected speech, threaten the privacy and security of people around the world, and have disastrous consequences for many children,\" the groups wrote in the letter.</blockquote>Some signatories of the letter, organized by the U.S.-based nonprofit Center for Democracy &amp; Technology (CDT), are concerned that Apple's on-device CSAM scanning system could be subverted in nations with different legal systems to search for political or other sensitive content.  \r\n<br />\r\n<blockquote>\"Once this backdoor feature is built in, governments could compel Apple to extend notification to other accounts, and to detect images that are objectionable for reasons other than being sexually explicit,\" reads the letter.</blockquote>The letter also calls on Apple to abandon planned changes to iMessage in family accounts, which would try to identify and blur nudity in children's messages, letting them view it only if parents are notified. The signatories claim that not only could the step endanger children in intolerant homes or those seeking educational material, it would also break end-to-end encryption for iMessage.\r\n<br />\r\n\r\n<br />\r\nSome signatories come from countries in which there are already heated legal battles over digital encryption and privacy rights, such as Brazil, where WhatsApp has been repeatedly blocked for failing to decrypt messages in criminal probes. Other signers are based in India, Mexico, Germany, Argentina, Ghana and Tanzania. Groups that have also signed include the American Civil Liberties Union, Electronic Frontier Foundation, Access Now, Privacy International, and the Tor Project.\r\n<br />\r\n\r\n<br />\r\nApple's plan to detect known CSAM images stored in <a href=\"https://www.macrumors.com/guide/icloud-photo-library/\">iCloud Photos</a> has been <a href=\"https://www.macrumors.com/2021/08/05/security-researchers-alarmed-apple-csam-plans/\">particularly controversial</a> and has prompted concerns from security researchers, academics, privacy groups, and others about the system potentially being abused by governments as a form of mass surveillance. The company has tried to address concerns by publishing <a href=\"https://www.apple.com/child-safety/pdf/Security_Threat_Model_Review_of_Apple_Child_Safety_Features.pdf\">additional documents</a> and a <a href=\"https://www.macrumors.com/2021/08/09/apple-faq-csam-detection-messages-scanning/\">FAQ page</a> explaining how the image-detection system will work and arguing that the risk of false detections is low. \r\n<br />\r\n\r\n<br />\r\nApple has also said it would refuse demands to expand the image-detection system beyond pictures of children flagged by recognized databases of child sex abuse material, although as <em>Reuters</em> points out, it has not said that it would pull out of a market rather than obeying a court order. <div>Tags: <a href=\"https://www.macrumors.com/guide/apple-privacy/\">Apple privacy</a>, <a href=\"https://www.macrumors.com/guide/apple-child-safety-features/\">Apple child safety features</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/19/policy-groups-urge-apple-abandon-csam-scanning/\">International Coalition of Policy Groups Urges Apple to Abandon 'Plans to Build Surveillance Capabilities into iPhones'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/international-coalition-of-policy-groups-urges-apple-to-abandon-plans-to-build-surveillance-capabilities-into-iphones.2307998/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fF-oCuoCzkQ:V56Dl50576o:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fF-oCuoCzkQ:V56Dl50576o:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/fF-oCuoCzkQ\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"defa1d05ad499bba4bdffed297be1a8755efed2033d33bfc26f878c7305ad575","category":"Apple"}