{"title":"Hydrothermal Conditions Modulate the Impact of Climate Extremes on Vegetation Growth in the Northern Hemisphere","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13898?af=R","date":1723870169000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Climate extremes are becoming more frequent under global warming, with substantial repercussions for vegetation growth. The degree to which climate extremes increase the risk of high-impact events on vegetation growth is of high concern.</p>\n<h2>Location</h2>\n<p>Northern Hemisphere (north of 30°N).</p>\n<h2>Time Period</h2>\n<p>From 2001 to 2022.</p>\n<h2>Major Taxa Studied</h2>\n<p>Plants.</p>\n<h2>Methods</h2>\n<p>We utilised solar-induced chlorophyll fluorescence (SIF) and the normalised difference vegetation index (NDVI) as proxies for vegetation growth. We performed event coincidence and sensitivity analyses to attribute satellite-derived vegetation growth extremes to diverse climate extremes (extreme heat, cold, wet and drought) in the Northern Hemisphere.</p>\n<h2>Results</h2>\n<p>Our results showed that extreme heat and cold were the main climatic extremes that induced positive and negative vegetation growth extremes north of 30°N, respectively, mainly in cold and humid ecosystems (boreal and temperate forests). Water-related extreme events accounted for less than one-third of vegetation extremes. The contribution of drought to positive vegetation growth extreme events (approximately 17%), mainly in cold and humid ecosystems, was even slightly higher than that of extreme wet (approximately 12%), which predominantly impacted relatively warm and arid ecosystems (croplands and temperate grasslands). We further identified potential climatic thresholds that could reverse vegetation growth responses to climate extremes (temperature is 12.5°C and climatic water deficit is -60 mm, approximately). We also showed that the past two decades of warming and precipitation changes did not induce a shift in the main climatic drivers of vegetation extremes across northern ecosystems.</p>\n<h2>Main Conclusions</h2>\n<p>Our results emphasise the crucial role of background hydrothermal conditions in the attribution of vegetation growth extremes to diverse climate extremes across northern ecosystems and have substantial implications for predicting how Northern Hemisphere vegetation will respond to increasing climate extremes in the future.</p>","author":"Zhen Xu, \nDuqi Liu, \nLujie Zhao","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"df04d0af87db6dcec952ec57b1448590accefb1892a71326e6ae333d754ca1fe","category":"Environment"}