{"title":"Towards Sustainability in Seed Supply for African Catfish, Clarias gariepinus (Burchell, 1822) Culture in Kenya: Lessons from Asian Catfishes Industry","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/1341858?af=R","date":1711350000000,"content":"<p>The culture of African catfish, <i>Clarias gariepinus</i>, is constrained by the high mortality of fry, occasioning a shortage of high-quality seeds for stocking by farmers. Asia, a continent with many success stories for aquaculture, leads in farmed production of some catfishes, a diverse group of 37 different families. Globally, the culture of catfishes ranks fifth in global farmed finfish production. Globally, Vietnam leads in the production and export of farmed striped catfish, <i>Pangasianodon hypophthalmus</i>, with 1,400,000 tonnes produced annually from about 7,000 hectares. Similarly, China farmed the non-native Channel catfish, <i>Ictalurus punctatus</i>, into the major crop, with a current annual production of 250,000 tonnes. On the contrary, <i>C. gariepinus</i>, the main farmed catfish species in Africa, records low annual yields, with 240,000 tonnes for the whole continent. This paper explores the factors behind the high production of <i>P. hypophthalmus</i> and <i>I. punctatus</i> in Vietnam and China, respectively, and draws lessons for <i>C. gariepinus</i> farmers in Africa. Specifically, the use of differentiated hatchery and nursery husbandry practices was critical in boosting seed production, quantity, availability, and distribution for expanding the culture of <i>P. hypophthalmus</i> in Vietnam. Improvement of fish species through well-designed genetic improvement programs helped China substantially increase production of <i>I. punctatus</i>. For both species, intensive fish production, as well as the adoption and implementation of suitable policies, increased seed production from hatcheries in both countries. These are discussed as some of the factors that spurred catfish production in the two Asian countries. We argue that if these are adopted by farmers in Africa, they could help improve the production of farmed <i>C. gariepinus</i> on the continent for food and nutrition security as well as generation of livelihood for local communities.</p>","author":"James E. Barasa, \nDon Felix Ouma, \nPravesh Kumar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"df067d481e587aa605b1320e261a430a2ed13e65639ce649e9bde5db9b29a5ae","category":"Environment"}