{"title":"Reddit’s new API pricing will kill off Apollo on June 30","link":"https://arstechnica.com/?p=1946446","date":1686253573000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-reddit-icon-800x533.jpg\" alt=\"The Reddit app icon on a smartphone screen.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-reddit-icon.jpg\">Enlarge</a> <span>/</span> The Reddit iOS app icon. (credit: Getty Images | Yuriko Nakao )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If there was any doubt about Reddit's most popular third-party app, Apollo, surviving the $20 million API bill Reddit <a href=\"https://arstechnica.com/gadgets/2023/05/reddits-api-pricing-results-in-shocking-20-million-a-year-bill-for-apollo/\">slapped it with</a> last week, wonder no more. Like most third-party apps, Apollo developer Christian Selig <a href=\"https://www.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/\">announced</a> Apollo would shut down on June 30. The news comes on the heels of a movement gaining support across Reddit, where currently almost 1,500 subreddits plan to \"<a href=\"https://arstechnica.com/gadgets/2023/06/reddits-plan-to-kill-third-party-apps-sparks-widespread-protests/\">go dark</a>\" on June 12 to protest the high API prices.</p>\n<p>Selig writes, \"June 30th will be Apollo's last day. I've talked to a lot of people, and come to terms with this over the last weeks as talks with Reddit have deteriorated to an ugly point.\" Selig says that while charging some amount of money for Reddit's API would be \"understandable,\" the developer says Reddit's costs and timelines are just too much to overcome and that \"[i]t's much cheaper for me to simply shut down.\" Selig says Apollo will continue working until the end of the month, when they will delete the API token.</p>\n<p>It's not clear that Reddit wants third-party apps to survive this pricing change, as we don't know of a single app that says it can continue under Reddit's terms. Selig says Reddit wants $12,000 for 50 million API requests, while Imgur, a similar social media photo site, charges $166 for 50 million API calls. Selig says even if users were willing to pay out of pocket for the API costs, Reddit announced the new billing plan one month before it would take effect, and Selig says that's just not feasible for developers.</p></div><p><a href=\"https://arstechnica.com/?p=1946446#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946446&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"df0a8589bc2bfa2c026f5b94f50e901f6658bf530eb63c45695569dbf0d936eb","category":"Tech"}