{"title":"PSV-4 Exposure to prenatal tributyrin improved pre-weaning growth performance and reduced fat deposition in the muscle of market age pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/272/7665024?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Organic acids, including short chain fatty acids, medium chain fatty acids, and tricarboxylic acid, are used as alternatives to antibiotics for the purpose of growth promotion in livestock species. Butyric acid has been used extensively for its various functions in intestinal health and barrier function, as well as its actions as a histone deacetylase inhibitor. Many of the issues relating to using butyric acid as a feed supplement are overcome by utilizing tributyrin (TB), a butyrate prodrug. Dietary supplementation of TB to sows during gestation was able to improve pre-weaning litter performance. Sows (n = 52, 42 gestational days) were randomly assigned to either a control diet or control diet supplemented with 2% TB. All diets were made isocaloric with the addition of oil and wheat flour. Dietary treatments continued until 112 d of gestation. After farrowing, piglet growth performance was monitored. Once offspring reached 6 mo of age, 30 gilts from the most median performing litters were identified for tissue collection and evaluation of meat characteristics. Sows that received tributyrin during gestation tended to have greater total litter weights at birth (<span>P</span> &lt; 0.1); however, average individual birthweights were not statistically different between control and TB litters. The TB piglets tended to be heavier at weaning (<span>P</span> &lt; 0.1). Pre-weaning average daily gains were higher in piglets exposed to prenatal TB (<span>P</span> &lt; 0.01). Body weights and hot carcass weights did not differ significantly in gilts at market age. There was, however, a trend of increased dressing percentage from TB treated offspring, accompanied by significantly reduced back fat at the 10<sup>th</sup> rib (<span>P</span> &lt; 0.1 and <span>P</span> &lt; 0.05 respectively). These data suggest that TB supplementation results in both temporary and permanent improvements to growth and development. This study provides further evidence that prenatal TB can have long term effects on muscle growth and meat quality. Further studies are needed to ultimately determine whether prenatal or postnatal supplementation is ideal for improving long-term growth performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"df0ce34a239e6b720483bf4f7c40b8e75e81fca7600489221b3baf62b5d9b445","category":"Environment"}