{"title":"Late-stage diagnosis: The driving force behind high breast cancer mortality in Ethiopia: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307283","date":1721397600000,"content":"<p>by Habtamu Geremew, Eyasu Bamlaku Golla, Mulat Belay Simegn, Alegntaw Abate, Mohammed Ahmed Ali, Hawi Kumbi, Smegnew Gichew Wondie, Misganaw Asmamaw Mengstie, Werkneh Melkie Tilahun</p>\r\nIntroduction <p>Breast cancer continues to be the most common malignancy and the leading cause of cancer-related deaths in Ethiopia. The poor prognosis and high mortality rate of breast cancer patients in the country are largely caused by late-stage diagnosis. Hence, understanding the epidemiology of late-stage diagnosis is essential to address this important problem. However, previous reports in Ethiopia indicated inconsistent findings. Therefore, this literature review was conducted to generate dependable evidence by summarizing the prevalence and determinants of late-stage diagnosis among breast cancer patients in Ethiopia.</p> Methods <p>Pertinent articles were retrieved by systematically searching on major electronic databases and gray literature. Data were extracted into an Excel spreadsheet and analyzed using the STATA 17 statistical software. The pooled estimates were summarized using the random effect meta-analysis model. Heterogeneity and small study effect were evaluated using the I<sup>2</sup> statistics and Egger’s regression test in conjunction with the funnel plot, respectively. Meta-regression, sub-group analysis, and sensitivity analysis were also employed. Protocol registration number: CRD42024496237.</p> Results <p>The pooled prevalence of late-stage diagnosis after combining reports of 24 studies with 8,677 participants was 65.85 (95% CI: 58.38, 73.32). Residence (adjusted OR: 1.92; 95% CI: 1.45, 2.53), patient delay at their first presentation (adjusted OR: 2.65; 95% CI: 1.56, 4.49), traditional medicine use (adjusted OR: 2.54; 95% CI: 1.89, 3.41), and breast self-examination practice (adjusted OR: 0.28; 95% CI: 0.09, 0.88) were significant determinants of late-stage diagnosis.</p> Conclusion <p>Two-thirds of breast cancer patients in Ethiopia were diagnosed at an advanced stage. Residence, delay in the first presentation, traditional medicine use, and breast self-examination practice were significantly associated with late-stage diagnosis. Public education about breast cancer and its early detection techniques is crucial to reduce mortality and improve the survival of patients. Besides, improving access to cancer screening services is useful to tackle the disease at its curable stages.</p>","author":"Habtamu Geremew","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"df0fb7d717e5be9eab114826bf9fe34097529d39f7a74f69ad826e8c29144fb4","category":"Interdisciplinary"}