{"title":"Prediction of Difficult Airway Using Arne Score and Flexible Laryngoscopy in Patients with Laryngeal Pathology","link":"https://www.preprints.org/manuscript/202403.0821/v1","date":1710405167000,"content":"Background and Objectives: ARNE score was developed for the prediction of difficult airway for both general and ENT surgery with a universal cut-off value. We tested the accuracy of this score in the case of laryngeal surgery and provided an insight of its combination with flexible laryngoscopy. Materials and Methods: This prospective pilot clinical study included 100 patients who were being scheduled for microscopic laryngeal surgery. We have calculated ARNE score for every patient and flexible laryngoscopy was provided preoperative. Difficult intubation was assessed according to intubation difficulty score (IDS). Results: A total of 33% patients had difficult intubation according to IDS. ARNE score showed to be accurate for prediction of difficult intubation in laryngology with P&amp;lt;0.0001 and AUC 0.784. Flexible laryngoscopy showed to be an independent parameter with P&amp;lt;0.0001 and AUC 0.766. We have defined a new cut-off value of 15.50 for laryngology, according to AUC curve. After the patients were divided in two groups, according to the new cut-off value and provided cut-off value, AUC improved to 0.707 from 0.619 respectively. Flexible laryngoscopy improved the prediction model of ARNE score to AUC 0.882 and of new cut-off value to AUC 0.833. Conclusions: It is recommended to use flexible laryngoscopy together with ARNE score in difficult airway prediction in patients with laryngeal pathology. Also, universally recommended cut-off value of 11 can not be effectively used in laryngology and a new cut-off value of 15.50 is recommended.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"df244b10dfb39be3132dfbd3d9401fbbb4640787344d96a180e69855f4848fe2","category":"Interdisciplinary"}