{"title":"A next-gen iPad Air is in the works but probably isn’t coming till 2024","link":"https://www.macworld.com/article/1998359/next-gen-ipad-air-in-works-launch-schedule-mystery.html","date":1689683826000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s tablet release schedule continues to defy prediction, with news that the 6th-gen iPad Air is currently in development but may or may not launch later this year.</p>\n\n\n\n<p>In this weekend’s edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-07-16/apple-creates-new-vision-products-group-vpg-for-future-mixed-reality-headsets-lk5g2ee4&amp;xcust=1-1-1998359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, Bloomberg leaker-analyst Mark Gurman briefly mentioned the next iPad Air, mysteriously revealing that it is currently in development and will receive a “boost” to its specifications, but declining to say when it will come out.</p>\n\n\n\n<p>“For those wondering about the iPad—another product that typically gets refreshed in October—I wouldn’t expect any major upgrades until the M3 iPad Pros with OLED screens arrive next year,” Gurman wrote. “But an iPad Air model that boosts its specifications is also in development.”</p>\n\n\n\n<p>A lot hinges on the word “but” at the start of the second sentence. Is Gurman saying that, while no <em>major</em> iPad launches can be expected this side of Christmas, a non-major, spec-bump-only iPad Air will appear in the fall of 2023? Or is he merely saying that an Air is in development as well as the new Pro models, without committing himself to a launch schedule for it?</p>\n\n\n\n<p>Ambiguous wording aside, it would be odd for the sixth Air not to launch until 2024. The <a href=\"https://www.macworld.com/article/625135/ipad-air-m1-review.html\">5th-gen Air</a> was kindly received by reviewers when it came out in March 2022, but that was 16 months ago; the wait will have reached 19 months by the time of the expected October event, and a whopping 21 months by the end of this year. And since Gurman indicates it will have little more than a new chip and Wi-Fi 6E, a lengthy delay seems unnecessary.</p>\n\n\n\n<p>There was a gap of 17 months between the <a href=\"https://www.macworld.com/article/234771/ipad-air-2020-review.html\">fourth</a> and fifth Airs, and even that felt too much for a simple refresh. Between those two releases, Apple launched new versions of the standard iPad, iPad mini, and iPad Pro, each of which in different ways surpassed the Air and minimized its appeal. On multiple occasions, we’ve written about the problems caused by Apple’s <a href=\"https://www.macworld.com/article/540082/ipad-air-tablet-problems-price-storage-updates.html\">staggered iPad release schedule</a> and it would feel deeply counterproductive for Apple to let the iPad Air go two years without a refresh.</p>\n\n\n\n<p>The iPad Pro, by contrast, was last refreshed in October 2022, a comparatively brief nine months ago, so a 2024 update seems reasonable. When this happens, of course, the new Pro will likely rain on the 6th-gen iPad Air’s parade, but that seems to be how Apple likes to do these things.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"df259a7df8ee417353d08944fd2d3de05b144c6cd15b2feb59e5a54a52a13ea5","category":"Apple"}