{"title":"Effects of bacterial cellulose/thyme essential oil emulsion coating on the shelf life of chilled chicken meat","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13392?af=R","date":1709553911000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Bacterial cellulose (BC) is a fiber substance produced by microbial fermentation. It is widely used in the food preservation industry because of its extremely pure texture, high crystallinity and high biocompatibility. In the present study, bacterial cellulose/thyme essential oil (BC/TEO-E) with antibacterial and fresh-keeping functions was prepared by ultrasonic treatment of modified bacterial cellulose for encapsulation of thyme essential oil, which effectively inhibited the spoilage of chilled chicken.</p>\n<h2>RESULTS</h2>\n<p>The purified BC, produced by <i>Acetobacter xylinum</i> ATCC 53524, was ultrasonically treated wih different times (0, 30, 60 and 90 min). Transmission electron microscopy, scanning electron microscopy, Fourier transformed infrared spectroscopy, X-ray diffraction, differential scanning calorimetry and zeta potential were used to characterize the structure of BC after ultrasound, showing that BC, treated for 30 min, had the optimal fiber structure, crystallinity (85.8%), thermal stability (347.77 °C) and solution stability (−26.63 ± 1.96 mV). BC/TEO-E was prepared by a homogenizer for the preservation of chilled chicken. Optical microscopy indicated that the BC/TEO-E prepared by 0.5% BC had optimal dispersion and stability, and even no delamination was observed in the emulsion. Compared with other groups (control, 0.5% BC and Tween-E), the total number of colonies and coliforms in chilled chicken treated with 0.5% BC/TEO-E was the lowest during the whole storage period (12 days), indicating that it can effectively inhibit bacterial growth. In addition, total volatile base nitrogen (TVB-N), thiobarbituric acid reactive substances, pH and drip loss results showed that 0.5% BC/TEO-E could effectively inhibit the spoilage of chilled chicken compared to the other treatment groups.</p>\n<h2>CONCLUSION</h2>\n<p>All of the results acquired in the present study indicate that BC/TEO-E has a potential application in chilled chicken preservation. © 2024 Society of Chemical Industry.</p>","author":"Yuelong Xu, \nJiajin Xin, \nYunbin Lyu, \nChong Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"df2b4980706a9e46e488baa0d17b63f8f7f455d313cb0dd09fc93dbac61f5ba0","category":"Environment"}