{"title":"UPLC-MS based metabonomics revealed the protective effects of Buyang Huanwu decoction on ischemic stroke rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae052/7638321?rss=1","date":1711843200000,"content":"<span><div>Abstract</div><div>Objective</div>Storke is a leading cause of death and disability affecting million people worldwide, 80% of which is ischemic stroke (IS). Recently, traditional Chinese medicines (TCMs) have received great attentions in treating IS due to their low poisonous effects and high safety. Buyang Huanwu Decoction (BHD), a famous and classical Chinese prescription, has been used for treating stroke-induced disability for centuries. Yet, its underlying mechanism is still in fancy.<div>Methods</div>We first constructed an IS model by middle cerebral artery occlusion (MCAO). Then, a metabonomics study on serum samples was performed using UHPLC-QTOF/MS, followed by multivariate data analysis including principal components analysis (PCA) and orthogonal partial least squares-discriminate analysis (OPLS-DA).<div>Results</div>Metabolic profiling of PCA indicated metabolic perturbation caused by MCAO was regulated by BHD back to normal levels, which is in agreement with the neurobehavioral evaluations. In the OPLS-DA, 12 metabolites were screened as potential biomarkers involved in MCAO-induced IS. Three metabolic pathways were recognized as the most relevant pathways, involving one carbon pool by folate, sphingolipid metabolism and inositol phosphate metabolism. BHD significantly reversed the abnormality of 7 metabolites to normal levels.<div>Conclusions</div>This is the first study to investigate the effect of BHD on IS at the metabolite level and to reveal the underlying mechanisms of BHD, which is complementary to neurobehavioral evaluation. In a broad sense, the current study brings novel and valuable insights to evaluate efficacy of TCMs, to interpret the action mechanisms, and to provide the theoretical basis for further research on the therapeutic mechanisms in clinical practice.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"df39611ccd5a0da35d2366d7961067645d034f5da89f6302df38ab56e72cb8f0","category":"Environment"}