{"title":"Top Stories: iPhone SE 3 in Early 2022, macOS Monterey Tips, AirPower Revival, and More","link":"https://www.macrumors.com/2021/12/04/top-stories-iphone-se-2022-monterey-tips/","date":1638626400000,"content":"The rush of Black Friday deals has passed, and while there's likely still some holiday shopping to be done, attention is also turning back to rumors with a look ahead to what we can expect in 2022.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/Top-Stories-87-Thumbnail.jpg\" />\r\n<br />\r\nRumors this week included the next iPhone SE reportedly coming early next year and a multi-device charger similar to Apple's canceled AirPower, while we also took a look at what we might see for a redesigned MacBook Air next year. Read on for details on these stories and more!\r\n<br />\r\n\r\n<br />\r\n<h2>New iPhone SE Reportedly on Track for Release Early Next Year</h2>\r\n<br />\r\nAs the holiday season gets underway, things have been relatively quiet in the world of Apple, but we are starting to hear some rumors about products that we can expect to launch in 2022, including a <a href=\"https://www.macrumors.com/2021/11/30/iphone-se-3-release-date-rumor/\">third-generation iPhone SE in the first quarter of the year</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/04/iPhone-SE-Cosmopolitan-Clean.png\" />\r\n<br />\r\nAccording to Taiwanese research firm TrendForce, a key new feature of this iPhone SE will be support for 5G networks, while the device is also expected to be <a href=\"https://www.macrumors.com/2021/07/20/2022-iphone-se-a15-chip-5g/\">equipped with an A15 chip</a> like iPhone 13 models.\r\n<br />\r\n\r\n<br />\r\nThe current iPhone SE was released in April 2020 and features a similar design as the iPhone 8, with a 4.7-inch display, Touch ID home button, and thick bezels. The new iPhone SE is expected to remain the most affordable iPhone model in Apple's lineup.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Still Working on AirPower-Like Charger, Also Long-Range Wireless Charging and Reverse Charging</h2>\r\n<br />\r\nWhile it has been nearly three years since Apple announced that its AirPower wireless charging mat <a href=\"https://www.macrumors.com/2019/03/29/apple-officially-cancels-airpower/\">was canceled</a> due to quality issues, rumors have suggested Apple is still working on a similar accessory.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/AirPower-With-AirPods-and-iPhone-Charging-Feature.jpg\" />\r\n<br />\r\nThe latest word came from <em>Bloomberg</em>'s Mark Gurman, who believes that Apple still intends to <a href=\"https://www.macrumors.com/2021/11/29/apple-airpower-long-range-reverse-wireless/\">create a wireless charging accessory that could charge multiple devices</a> like an iPhone, Apple Watch, and AirPods all at once.\r\n<br />\r\n\r\n<br />\r\n<h2>macOS Monterey: 40 Tips, Tricks, and Features You Might Have Missed</h2>\r\n<br />\r\nApple released <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> in late October with several new features like AirPlay to Mac and Live Text, and others coming soon, including SharePlay for FaceTime and Universal Control.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/20-monterey-tips-feature.jpg\" />\r\n<br />\r\nThis week, we shared a helpful list of <a href=\"https://www.macrumors.com/guide/macos-monterey-tips/\">40 tips, tricks, and features that are worth checking out in macOS Monterey</a>, including some lesser-known settings that are available in apps and across the operating system.\r\n<br />\r\n\r\n<br />\r\n<h2>Five Features to Look Forward to in the 2022 MacBook Air</h2>\r\n<br />\r\nWhile the latest MacBook Air is already a fan favorite thanks to the impressive performance of the M1 chip, rumors suggest that a new version of the notebook is already in development with an even faster Apple silicon chip and a significant redesign.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/mba-colorful-blue-feature.jpg\" />\r\n<br />\r\nIn addition to our <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air roundup</a>, we've put together a list of <a href=\"https://www.macrumors.com/2021/11/30/macbook-air-2022-five-features/\">five features to look forward to in the 2022 MacBook Air</a> based on everything that we've heard so far.\r\n<br />\r\n\r\n<br />\r\n<h2>How to See 'Spotify Wrapped' for Apple Music</h2>\r\n<br />\r\nTowards the end of each year, streaming music service Spotify provides a <a href=\"https://www.macrumors.com/2021/12/01/spotify-wrapped-2021/\">\"Spotify Wrapped\" recap of each user's listening habits</a> and favorite songs. Spotify Wrapped is a highly anticipated year-end feature that Spotify users love, and Apple Music listeners may be wondering how to get their own \"Wrapped\" rundown.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/apple-music-replay-iphone-feature.jpg\" />\r\n<br />\r\nThe closest equivalent to \"Spotify Wrapped\" for Apple Music subscribers is \"Apple Music Replay,\" and <a href=\"https://www.macrumors.com/how-to/spotify-wrapped-apple-music-replay/\">we've shared step-by-step instructions on how to access this feature</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Introduces New MacBook Upgrade Program for Business Partners</h2>\r\n<br />\r\nApple has <a href=\"https://www.macrumors.com/2021/11/29/apple-macbook-upgrade-program-businesses/\">launched a new MacBook Upgrade Program</a> that allows small business partners in the U.S. to finance MacBook Air and MacBook Pro purchases, with monthly payments starting at $30 per month.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/Mac-Notebook-Upgrade-Program-16x9.jpg\" />\r\n<br />\r\nUnlike the iPhone Upgrade Program, this program is not available to consumers at this time. For small businesses, <a href=\"https://www.macrumors.com/2021/11/29/apple-macbook-upgrade-program-businesses/\">make sure to read our coverage of the program</a> for additional details, including how to sign up.\r\n<br />\r\n\r\n<br />\r\n<h3>MacRumors Newsletter</h3>\r\n<br />\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br />\r\n\r\n<br />\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/dec-2-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/04/top-stories-iphone-se-2022-monterey-tips/\">Top Stories: iPhone SE 3 in Early 2022, macOS Monterey Tips, AirPower Revival, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-iphone-se-3-in-early-2022-macos-monterey-tips-airpower-revival-and-more.2326187/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=p7K3rN38YwY:fQAYqJvwaM8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=p7K3rN38YwY:fQAYqJvwaM8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"df3ceae6c77db4b23903f54025085d86cc594feba9a48ac2278252bd17d4c8e0","category":"Apple"}