{"title":"PSI-6 Growth performance of weaned pigs fed an activated zinc oxide to replace pharmacological content of dietary zinc oxide","link":"https://academic.oup.com/jas/article/102/Supplement_2/345/7665049?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to determine the effect of replacing feed-grade zinc oxide (ZnO) with decreased contents of an activated zinc oxide (aZnO) on growth performance of weaned pigs. A total of 720 pigs (Landrace × Yorkshire × Duroc; TOPICS, Richfield, MN) with an initial body weight (BW) of 5.88 ± 0.97 kg were distributed into 60 pens with 12 pigs per pen following a randomized complete block design. After weaning at 18 d of age, pigs were fed one of five diets differing in ZnO source and Zn content during a 3-phase feeding program for 42 d (Table 1). Experimental diets were formulated to meet minimum nutrient requirements. Mortality was monitored daily and analyzed using survival analysis. Performance data were analyzed by multiple linear regression, with BW gain as dependent variable and Zn source (ZnO, aZnO) and Zn content as the independent variables for each phase. Linear regression analysis used diet A as baseline (150 ppm ZnO). In addition, groups receiving diet E and B, both supplemented with the same ZnO level during phase-1, were compared using a t-test. A linear relationship was observed between BW gain and dietary Zn content (<span>P</span> &lt; 0.001) and Zn source (<span>P</span> = 0.026). A slope ratio between the two Zn sources indicated that pigs provided with aZnO had a 72% greater growth rate compared with ZnO. In addition, during Phase 1, when both diets B and E offered similar Zn concentrations (1,200 ppm) as ZnO and aZnO, pigs fed aZnO outperformed ZnO-fed pigs by 490 g (<span>P</span> &lt; 0.001). The mortality was 7.6% less (<span>P</span> = 0.009) for diet C than diet A. No differences were detected among pigs fed the test diets in Phases 1, 2 and 3 for other variables. In conclusion, results show the potential of aZnO as a suitable replacement for ZnO, but also underscore the effect of dietary Zn content on pig performance and mortality. The aZnO source is a suitable replacement for ZnO, enhancing growth performance in weaned pigs and demonstrating potential for reducing overall Zn usage, thereby mitigating the environmental impact of swine production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"df601f9e4c4e53afeb1ea1927b53ebcb37436f94a0ed89af764aa1bff93af387","category":"Environment"}