{"title":"Roku Streaming Devices Default to ‘Scary’ Privacy","link":"https://foundation.mozilla.org/en/privacynotincluded/roku-streaming-sticks/","date":1613707880000,"content":"\n<p>Mozilla’s Privacy Not Included project’s take on Roku:</p>\n\n<blockquote>\n  <p>Roku is the nosey, gossipy neighbor of connected devices. They\ntrack just about everything! And then they share that data with\nway too many people. According to Roku’s privacy policy, they\nshare your personal data with advertisers to show you targeted ads\nand create profiles about you over time and across different\nservices and devices. Roku also gives advertisers detailed data\nabout your interactions with advertisements, your demographic\ndata, and audience segment. Roku shares viewing data with\nmeasurement providers who may target you with ads. Roku may share\nyour personal information with third parties for their own\nmarketing purposes. One of the researchers working on this guide\nsaid, “It had such a scary privacy policy, I didn’t even connect\nit to my TV.” Another researcher referred to Roku as a “privacy\nnightmare.”</p>\n</blockquote>\n\n<p>You can opt-out, but they won’t ask you. You have to go look for it, which means most Roku users don’t even know they’re being snooped on this way.</p>\n\n<p>Most (all?) major smart TVs are privacy disasters too. Privacy is probably the main Apple TV advantage I didn’t mention the other day <a href=\"https://daringfireball.net/linked/2021/02/14/why-does-apple-tv-still-exist\">when speculating on why Apple TV even still exists</a>. But even on an Apple TV box, you’re at the mercy of each app you use, and the major streaming services all collect information on everything you do. I mean, how else would their recommendation algorithms work? Or even just picking from where you left off in a movie you paused a day or two ago?</p>\n\n<p>But Roku (and similar boxes, and smart TVs) track you at the system level.</p>\n\n<p>I don’t let my LG TV connect to the internet. I mean why would I, if I don’t use its built-in apps for anything?</p>\n\n<div>\n<a  title=\"Permanent link to ‘Roku Streaming Devices Default to ‘Scary’ Privacy’\"  href=\"https://daringfireball.net/linked/2021/02/18/roku-privacy\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"df6a2dda4beaae51ff1e89bd92987bd64f000fb1231ca3e50f78dc012d8475e6","category":"Tech"}