{"title":"MOOTS + SBT GRVL WRAP UP 2021—","link":"https://moots.com/moots-sbt-grvl-wrap-up/","date":1629397897000,"content":"<p>More than just a one-day race.<span> </span></p>\n<p>All eyes were on our little part of Colorado this past week with the 2<sup>nd</sup> installment of SBT GRVL. Since holding the first edition in 2019 and cancelling the 2020<span></span> version due to COVID, Steamboat has been waiting anxiously for the follow up to that stellar first year event. From a local’s perspective the 2<sup>nd</sup> running of SBT GRVL lived up to every ounce of promise of being a well-run event from start to finish. Chapeau to the entire staff and dozens of volunteers that made it happen.</p>\n<p>By virtue of being based in Steamboat Springs and having used these roads to develop our gravel line, we could not help but to be excited to welcome the gravel community to our home. Our area has a population of about 10K people so when you add 3000 racers, support staff and industry friends we can safely say that the event doubled our population.<span> </span></p>\n<p>We had targeted the event as our first public appearance as a brand since COVID sent everything downhill in April of 2020.<span>  </span>So, we set plans in place to get visitors engaged and fired up about the sweet riding we have right out our door.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0291-copy-scaled.jpg\" /></p>\n<p>LET’S GET SOCIAL</p>\n<p>To kick things off we held a small social at our favorite taco establishment. You might recognize the name Taco Cabo if you have attended our Ranch Rally event over the years. Moots invited the staff from SBT GRVL, event sponsors, F.O.M. (friends of Moots), industry partners and of course the full Moots staff, to have a beer and a few tacos on Thursday night. It was a great way to relax, catch up and get stoked for the days to come. I can tell you that after having to sit out the last year or more from events, this felt super special on all fronts.<span> </span></p>\n<p> </p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0309-copy-scaled.jpg\" /></p>\n<p>MOOTS-SBT GRVL PRE-RIDE</p>\n<p>On Friday we hosted a pre-ride from our facility at 9am. Who doesn’t want to go on a 300-person group ride on beautiful dirt and gravel roads? We even had a cattle drive pause the ride for a few moments and as a good reminder…you never know what you might run into while out graveling! Always give them space, always ride with your head up! Once the cattle drive passed, riders accused us of planting the 30 head of cattleas a “Chamber of Commerce moment”. Nope, it happens frequently around these parts.<span> </span></p>\n<p>Our pre-ride provided a mid-point aid station and factory tours once finished with the ride. A great day to meet so many people from all over the country and beyond. The gravel community is a wonderful group to be around. We thank everyone of you that took the time to come ride with us!<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0306-copy-1-scaled.jpg\" /></p>\n<p>The ranch hands had it all under control. They were moving the cattle due to the drought we are under. Onto a patch of land that had a water spring that was still running.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0307-copy-scaled.jpg\" /></p>\n<p>Excellent work by the riders to move to the side and let the cattle get to their pasture.</p>\n<p> </p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0375-copy-scaled.jpg\" /></p>\n<p>Moots VIP gathering on Saturday morning. Awesome group from all over the US and beyond.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0386-copy-scaled.jpg\" /></p>\n<p>Limited Edition patches.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0397-copy-scaled.jpg\" /></p>\n<p>EXPO CITY</p>\n<p>It’s been a while since most of the industry has had true expo at an event. Held in downtown Steamboat on Yampa Street the area was bustling with activity as racers cruised the street checking out brands and catching up with friends. It felt especially good to talk with riders and explain to them that our bikes are made right here in town. …that is a special feeling to say the least.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0161-copy.jpeg\" /></p>\n<p>RACE DAY</p>\n<p>Working with the event organizers we positioned our van in the first hour of the race as a last-ditch mechanical help outpost. Our goal was to help anyone that had an issue with their bike for them to continue in their event. We did just that…a few flat tires, a broken chain and a cranky rear derailleur. What we didn’t expect was casualties of the medical type. In that first section of 52E/Salt Creek, things got wild for a few folks. Smashed elbow, broken rib, and road rash. The small first aid kit that lives in the Moots van was quickly exhausted as a we wrapped and applied pressure. EMT’s were on the scene quickly and took over from there.<span> </span></p>\n<p><a href=\"https://flic.kr/s/aHsmWvx7ge\">MOOTS PHOTO GALLERY// SBT GRVL 2021</a></p>\n<p>Back at the finish we also hosted a Moots hospitality shade area. We came prepared with mini-Cokes, seltzer waters and high-fives. We collected as many Moots riders as possible to pose for a finish photo up against our frame-box back drop.(CLICK LINK ABOVE TO VIEW/DOWNLOAD) To hear the stories, see the smiles and hear that their Moots was ideal for the event made us all smile knowing we had made the perfect bike for the unperfect roads they had just ridden. Many are already making plans for the 2022 edition. We hope you are too, and we can’t wait to ride with you then!<span> </span></p>\n<p>Thanks to everyone that stopped in, rode with us, and raced their guts out on our bikes. We’ll be here ready to do it again in 2022.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0314-copy-scaled.jpg\" /></p>\n<p>See you soon friends! Ya’ll come back ya hear!</p>\n<p> </p>\n<p>The post <a href=\"https://moots.com/moots-sbt-grvl-wrap-up/\">MOOTS + SBT GRVL WRAP UP 2021—</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"df6dd32e378e90861ae980eda1dbd8eb1440469f09be6b0b3213bc757420b0fc","category":"Cycling"}