{"title":"Supplemental nesting habitat increases bee abundance in apple orchards","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14570?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b2d710aa-bb8d-445b-8010-9e866e67c05c/jpe14570-toc-0001-m.png\" alt=\"Supplemental nesting habitat increases bee abundance in apple orchards\" />\n<p>These findings suggest that bee populations in apple orchards can be limited by nesting resources such that addition of constructed nesting habitat could be an effective means of increasing pollinator numbers in orchards, and potentially, supporting bee conservation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIdentifying the resources that limit bee populations is essential for both bee conservation and pollination management in agroecosystems. Land-use change typically leads to decreased habitat availability for wild pollinators, including loss of nesting habitat, which is an essential but often-overlooked resource for wild bees. Cavity-nesting bees, such as many <i>Osmia</i> spp. (Hymenoptera: Megachilidae), occupy holes in wood or reeds to build their nests; due to their nesting habits, they are frequently scarce in agricultural settings. Nevertheless, under the right circumstances, these bees can be ideal pollinators of apple and other orchard crops. Artificial nesting structures (‘bee hotels’ or ‘trap-nests’) are often used to study cavity-nesting bees and have been proposed as tools for bee conservation.\n\nTo evaluate the effects of additional nesting habitat on the local abundance of pollinators, we selected 24 sites in apple orchards in eastern Canada in 2021 and 2022. Each site comprised two study plots: one in which we installed artificial nesting structures for cavity-nesting bees, and one without added nesting habitat (control).\n\nPollinator surveys were conducted in both plot types to measure pollinator visits to apple blossoms and, after apple bloom, to flowers in the undergrowth and/or in shrubs. Numbers and size of developing fruit were also recorded. Both <i>Osmia</i> bees and overall pollinator numbers were significantly higher in the treatment with trap-nests (respectively, 33% and 22% higher during the 2021 growing season, and 113% and 30% higher during apple bloom across the 2 years of the study); however, there was no consistent difference in apple size or fruit set between the two treatments. Thus, trap-nests locally increased the numbers of cavity-nesting bees as well as total pollinator numbers, but they had little effect on apple yield, likely because apple production was not pollinator limited in the years of this study.\n\n<i>Synthesis and applications</i>. These findings suggest that bee populations in apple orchards can be limited by nesting resources such that addition of constructed nesting habitat could be an effective means of increasing pollinator numbers in orchards, and potentially, supporting bee conservation.\n</p>\n<h2>Résumé</h2>\n<p>\n\nL'identification des ressources qui limitent les populations d'abeilles est essentielle pour la conservation des abeilles et la gestion de la pollinisation dans les agroécosystèmes. Les changements d'utilisation des terres entraînent généralement une diminution de la disponibilité d'habitat pour les pollinisateurs sauvages, y compris la perte d'habitat de nidification, une ressource essentielle mais souvent négligée pour les abeilles sauvages. Les abeilles nichant dans les cavités, comme plusieurs espèces d'<i>Osmia</i> (Hymenoptera: Megachilidae), occupent des trous dans le bois ou les roseaux pour construire leurs nids; en raison de leurs habitudes de nidification, elles sont souvent rares dans les milieux agricoles, bien que, dans les bonnes circonstances, ces abeilles puissent être des pollinisateurs idéaux pour les pommiers et autres récoltes des vergers. Les structures de nidification artificielles (‘hôtels à abeilles’, ‘nids pièges’ ou ‘boîtes à nids’) sont utilisées pour étudier les abeilles nichant dans des cavités et ont été proposées comme des solutions pour promouvoir la conservation des abeilles.\n\nPour évaluer les effets d'installer des ressources de nidification supplémentaires sur l'abondance locale de pollinisateurs, des structures de nidification artificielles pour les abeilles nichant dans des cavités ont été installées à 24 sites dans des vergers de pommiers dans l'est du Canada en 2021 et 2022. Chaque site avait deux traitements: un avec des boîtes de nidification et un sans boîtes de nidification (témoin).\n\nDes marches transversales ont été effectuées pour mesurer le contact global des pollinisateurs avec les fleurs de pommiers et, après la fin de la floraison des pommiers, avec les fleurs des sous-bois et/ou des arbustes. Le nombre de bourgeons de pommiers et de fruits en développement ont également été enregistrés. Le nombre d'abeilles <i>Osmia</i> et le nombre global de pollinisateurs était tous deux significativement plus élevé dans le traitement avec les nids (33% et 22% plus élevé, respectivement, en 2021, et 113% et 30% plus élevé, respectivement, en 2022); cependant, il n'y avait aucune différence significative dans la mise à fruits ou la taille des fruits entre les deux traitements. Ainsi, les nids semblent augmenter localement le nombre d'abeilles nichant dans des cavités ainsi que le nombre total de pollinisateurs, mais ils n'ont aucun effet apparent sur le rendement en pommes, probablement parce que la production de pommes n'était pas limitée par les pollinisateurs au cours des années de cette étude.\n\n<i>Synthèse et applications</i>. Ces résultats suggèrent que les populations d'abeilles dans les vergers de pommiers sont limitées par les ressources de nidification de manière que l'ajout d'habitats de nidification serait un moyen efficace d'augmenter le nombre de pollinisateurs dans les vergers, et, potentiellement, de soutenir la conservation des abeilles.\n</p>","author":"Batoule F. Hyjazie, \nJessica R. K. Forrest","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"df702370d6344edefcc0387cbc0da665ad1f74ea7f36eb472d2a96c4ef804c5f","category":"Environment"}