{"title":"Newly discovered exoplanet could have liquid water, lots of volcanoes","link":"https://arstechnica.com/?p=1940609","date":1684519630000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/image-5-800x450.jpeg\" alt=\"Image of a planet covered in red glowing cracks and spots\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/image-5.jpeg\">Enlarge</a> <span>/</span> An artist's conception of what a volcano-rich exoplanet might look like. (credit: <a href=\"https://www.nasa.gov/feature/goddard/2023/nasa-s-spitzer-tess-find-potentially-volcano-covered-earth-size-world\">NASA’s Goddard Space Flight Center/Chris Smith</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For most of the exoplanets we've discovered, we know very few details. We know a bit about the star they orbit and maybe a partial list of other planets in the same system. And we typically know either how large they are or how heavy they are. It's not a lot to go on.</p>\n<p>But we can infer a lot when we start combining those details. That's the case for a newly discovered exoplanet orbiting a small star about 90 light-years from Earth. The planet itself has a radius and mass very similar to the Earth's, suggesting it also has a rocky composition. Based on what we know of the star, it can potentially contain liquid water. And, based on the forces exerted by nearby planets, it's likely to have very active geology, potentially including volcanoes.</p>\n<h2>An extra, extra-solar planet</h2>\n<p>The exosolar system at the star LP 791-18 was first discovered by the <a href=\"https://arstechnica.com/science/2018/04/nasas-new-planet-finder-is-in-space-now-what/\">Transiting Exoplanet Survey Satellite</a> (TESS). TESS had spotted two planets orbiting LP 791-18, which is one of the smallest—and thus dimmest—stars known to host planets. The innermost planet, LP 791-18b, is about 20 percent larger than Earth and takes less than a day to complete an orbit, meaning it's close enough to the star to be very hot. Farther out, with a five-day orbit, is LP 791-18c, a sub-Neptune that's more than double Earth's size.</p></div><p><a href=\"https://arstechnica.com/?p=1940609#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1940609&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"df70b225d97ae90c9573c4d87bed420e6d6911a658f5df43a8f70e733f166bb3","category":"Tech"}