{"title":"สหรัฐฯ ร่วมมือออสเตรเลีย ให้บริการโทรศัพท์แชตเข้ารหัสหลอกขายกลุ่มค้ายาเสพติด รวบจับทีเดียวนับร้อยราย","link":"https://www.blognone.com/node/123070","date":1623129241000,"content":"<div><div><div><p>ตำรวจออสเตรเลีย (Australian Federal Police - AFP) ร่วมมือกับ FBI กวาดล้างกลุ่มอาชญากรค้ายาเสพติดวันเดียวจับได้ 224 ราย และกำลังตามจับอีก 526 รายเฉพาะในออสเตรเลีย และยังมีการจับกุมที่เกี่ยวข้องอีก 18 ประเทศ โดยอาศัยการแทรกซึมเข้าไปยังแก๊งค้ายาด้วยการขายโทรศัพท์แชตเข้ารหัส ANoM ในชื่อปฎิบัติการ Ironside</p>\n<p>Ironside เริ่มมาตั้งแต่ปี 2018 หลัง AFP ร่วมมือกับ FBI ทลายบริการแชตเข้ารหัส Phantom Secure ที่นิยมในกลุ่มค้ายาเสพติดได้สำเร็จ ทั้งสองหน่วยงานรู้ว่ากลุ่มค้ายาเสพติดจะต้องการบริการแบบเดิมอีกครั้ง เมื่อ FBI ยึดแพลตฟอร์ม ANoM ที่เป็นโทรศัพท์พิเศษที่ติดตั้งแอปแชตเฉพาะกิจได้ จึงให้บริการต่อมาเรื่อยๆ เพื่อเก็บข่าวกรองสำหรับการจับกุม</p>\n<p>กลุ่มค้ายาเสพติดจะต้องซื้อโทรศัพท์และส่งให้เครือข่ายของตัวเองไปเรื่อยๆ ทำให้ AFP และ FBI รู้ว่ามีใครเกี่ยวข้องกับธุรกิจผิดกฎหมายบ้าง รวมถึงสามารถถอดรหัสข้อความในแชตออกมาเป็นข่าวกรอง โดยนอกจากธุรกิจค้ายาเสพติดแล้วยังมีธุรกิจค้าอาวุธและคำสั่งฆ่า รวมการจับจากข่าวกรองของปฎิบัติการ Ironside ยึดยาเสพติดได้ 3.7 ตัน, อาวุธ 104 ชิ้น, เงินสด 44 ล้านดอลลาร์ออสเตรเลีย, และทรัพย์สินอื่นรวมหลายร้อยล้านดอลลาร์ออสเตรเลีย</p>\n<p>แม้ว่า ANoM จะได้รับความนิยมจนสามารถจับกุมได้เป็นวงกว้างแต่ AFP ก็ยอมรับว่ามีแพลตฟอร์มแชตเข้ารหัสที่ได้รับความนิยมสูงกว่า ANoM ใช้งานในหมู่อาชญากรอยู่</p>\n<p>ที่มา - <a href=\"https://www.afp.gov.au/news-media/media-releases/afp-led-operation-ironside-smashes-organised-crime\">AFP</a></p>\n<p><strong>note</strong>: เวอร์ชั่นแรกของบทความนี้ระบุว่า AFP และ FBI สร้างแพลตฟอร์ม ANoM ขึ้นเอง หลังตรวจสอบซ้ำพบว่าเป็นแพลตฟอร์มที่ยึดมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1e0168338748ad59a0f9a4ca7d3bcaa8.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/australia\">Australia</a></div><div><a href=\"/topics/fbi\">FBI</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"df7258fca3c2f92e763afab76078eebc63e51c9a2dd256d0e218218b0859212e","category":"Thai"}