{"title":"Evaluation of Mis-Selection of Boundary Vertebrae and Its Effect on Measuring Cobb Angle and Curve Length in Adolescent Idiopathic Scoliosis","link":"https://www.preprints.org/manuscript/202406.0497/v1","date":1717766187000,"content":"The Cobb angle is critical in assessing adolescent idiopathic scoliosis (AIS) patients. This study aimed to evaluate the error in selecting the cranial and caudal limit vertebrae on AIS digital X-rays of experienced and novice observers and its correlation with the error in measuring the Cobb angle and determining the length of the scoliotic curves. Using the TraumaMeter v.873 software, eight raters (four experienced and four novices) independently evaluated 68 scoliotic curves on 42 AIS X-rays across three sessions one month apart according to Hopkins’ criteria of absolute reliability. Two spine specialist experts using the Cobb method established the gold standard measurements. The percentage of error in the selection of the cranial vertebrae (the most-tilted vertebra above the apex) is higher than in the caudal vertebrae (the most-tilted vertebrae below the apex) (44.7%, CI95% 41.05-48.3 compared to 35%, CI95% 29.7-40.4). The error in the choice of the most tilted vertebrae, in number of vertebrae per scoliotic curve, was MBE (mean bias error) =0.45, CI95% 0.38-0.52 in the cranial and MBE=0.35, CI% 0.69-0.91 in the caudal. The percentage of errors in the choice of boundary vertebrae is lower for the experienced than for the novices, both in cranial and caudal. The experienced chose at least one boundary vertebrae incorrectly in 52% of the meas-urements and the novices in 65.1%. The error in the Cobb angle did not depend on the number of boundary vertebrae chosen incorrectly (r=0.198, p=0.111). Of the 50% of Cobb angle measurements closest to the actual value, 55.4% (454) were obtained by incorrectly selecting at least one boundary vertebra. There was a positive correlation (r=0.673, p=0.000) between the error in selecting the boundary vertebrae and the error in determining the length of the scoliotic curves. The error in quantifying the length of scoliotic curves was MBE=0.43, CI95% 0.35-0.51 vertebrae per curve. We can conclude that errors in selecting boundary vertebrae are common among experienced and novice observers, with a greater frequency of error in the cranial vertebrae. There is no correlation between the error in selecting the boundary vertebrae and the error in measuring the Cobb angle. Contrary to the consensus, the accuracy of determining the length of the scoliotic curve is limited by the Cobb method’s reliance on the correct selection of boundary vertebrae. Inappropriate choice of boundary vertebrae leads to an estimated error in determining the length of the scoliotic curves of 0.805 vertebrae for each boundary vertebra chosen incorrectly.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"df73b2bd2195fe7c33cc2545c4337bab12c1f6920ba58c26df9e036bc208fb48","category":"Interdisciplinary"}