{"title":"Improving the Resident Interview Process with Structural and Statistical Bias Correction","link":"https://www.preprints.org/manuscript/202410.1817/v1","date":1729695045000,"content":"Background: Several studies have questioned the reliability of the interview process in predicting resident success. Objective: Statistical analysis of the resident interview structure might guide process improvements and increase the validity of the selection methodologyMethod: We performed a prospective comparative analysis of our general surgery residency interview process over two consecutive academic years (AY 2022 and 2023). We used descriptive statistics as well as a mixed effects ordered logit model to measure bias and guide process improvement. Results: Eighty total students were interviewed. We found numerous statistical biases including leniency bias exacerbated by the unequal distribution of evaluators; significant differences in the variance from evaluator’s scoring (p&lt;0.0001) and non-normal distribution (p&lt;0.001). Rater reliability was “good” in both years: 0.69 (C.I. 0.51-0.82). Using uncorrected means, on average, each student was statistical different from 11.5±1.1 other students. Using our model, we improved the number of statistically distinct groupings as each student now differed by 30±1.0 others (p&lt;0.0001). In AY23, we restructured the interviews so that all the evaluators scored every student which greatly improved the interview accuracy using the same mixed model; R-squared of 0.95 versus 0.70; and a smaller percent of students had a change in their rank using with the improved structure (57% versus 90%, p&lt;0.05), compared to AY22.Conclusions: Due to numerous statistical biases, there is little differentiation between students and thus little validity in the process for scoring students using raw mean scores. This can be overcome by developing a structured interview and correcting for statistical biases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"df79fcd39c861295d0099b650ffcf64bfdcdad526fd5ce569a829d7cd3cd9a61","category":"Interdisciplinary"}