{"title":"Too close to call: What can stage 19 of the Giro d'Italia tell us about Geraint Thomas and Primož Roglič’s form?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/on-a-knife-edge-what-does-stage-19-tell-us-about-geraint-thomas-and-primoz-roglic-s-form","date":1685129348000,"content":"\n      <p><span>They look so different in their riding styles, Geraint Thomas with his tall, gangly figure pedalling smoothly and methodically up the mountains, Primož Roglič much smaller in stature, his cadence kept high and his shoulders slumping slightly as the pace gets harder. Thomas has ridden steadily during this <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, while Roglič’s form has wavered up and down, from dropping from the back of the group one day, to launching attacks the next. Off the bike, the two riders are worlds apart too: Thomas giving long answers in interviews that give a real insight into how the Welshman is feeling, Roglič more blunt and reserved: “We see how tomorrow goes, huh.”</span></p>\n<div></div>\n<p><span>Yet despite all these opposites between them, Thomas and Roglič could not have been closer in ability during these final mountain stages of the Giro. There has seemed to be barely anything separating the two riders when it comes to physical form; when Thomas rides Roglič can follow, when Roglič attacks, Thomas can latch on to his wheel. As we head into the final time trial of the race tomorrow, just 26 seconds separates the two riders on the general classification. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AL209233.jpg?v=1685129194\" alt /></span></p>\n<p><span>Most of this time deficit comes from Roglič’s bad day on stage 16 to Monte Bondone, when João Almeida (UAE Team Emirates) took an emphatic stage win, dropping the Slovenian rider in the final few kilometres before the line. Thomas, on the other hand, was able to stick to the wheel of Almeida and not lose any time to the Portuguese rider on GC. In fact, after that stage, it looked like the battle for the general classification victory might just be between Ineos and UAE, with Roglič out of the picture completely. It all changed again after Almeida’s bad day on stage 18, though, when Roglič re-found his legs and attacked again catapulting himself back up to second place on the general classification. Once again, Thomas could follow close behind. Today, it was a similar scenario: Roglič was attacking, and it was up to everyone else to respond.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-20-preview-a-mountain-time-trial\"><strong><em>Read more: Giro d'Italia stage 20 preview - the decisive mountain time trial</em></strong></a></p>\n<p><span>We’ve been waiting a long time in this Giro d’Italia for general classification action like we saw in stage 19, to watch the strongest climbers in the race battle it out, <em>mano a mano</em>, for victory. We still were only treated to a slither of it today, with Roglič launching his attack with less than two kilometres to go until the finish line. He did so through the crowds of screaming fans that lined the roads of the Tre Cime di Lavaredo climb, opening up a small gap to Thomas in a few powerful pedal strokes. Quickly, however, the pink jersey wearer was able to respond and close it down, latching himself straight back onto the back wheel of his rival. With Thomas refusing to pull through, the likes of Almeida caught back up to the duo, and we had a stalemate once again.</span></p>\n<p><span>That was until 500 metres of the stage remaining, when it was Thomas himself who tried to snatch a few seconds back on the approach to the finish line. Resplendent in the <em>maglia rosa</em> and through gritted teeth, the Welsh rider hauled himself out of the saddle to put distance between him and Roglič. It worked at first, but it didn’t take long for the Jumbo-Visma rider to respond. As the anguish on Thomas’s face showed us, 500 metres is a long way on steep gradients, and Roglič was able to regain the lost ground quickly, eventually surpassing Thomas just before the line and sneaking a time gap of three seconds between the two riders. </span></p>\n<p><span>A loss of three seconds is by no means a disaster for Thomas, but it happened because he made a mistake. He misjudged his attack and perhaps misjudged how good his legs were really feeling. It was the first time in this race that we’ve seen Thomas get a little bit over excited, and when your rivals are so close and so attentive behind, small mistakes like this can be costly. If there is anything that the last two mountain stages have taught us, it is that Roglič and Thomas are evenly matched. Neither is far stronger, but neither is far weaker, that means that both of them must be careful not to make even a small error. Thomas did that today in the run in to the finish, and he paid for it. It was a small price, but a price nonetheless.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/MP2_3191.jpg?v=1685129314\" alt /></span></p>\n<p><span>This makes tomorrow’s time trial stage a tantalising prospect. It’s going to come down to which rider can execute a perfect ride, which of them can keep a cool head and who can time their effort optimally, walking the line of going hard enough while sustaining their effort all the way to the finish. When two rivals are separated by so little, everything matters. Thomas was perhaps fortunate that he did not make the mistake he made at the finish line today any further down the mountain, as the result of it could have been a time loss far greater than three seconds. The same cannot be said for the time trial tomorrow.</span></p>\n<p><span> If this Giro d’Italia has been a steady build up of tension until now, the last two days have given signs of things getting hotter and hotter. Tomorrow, it reaches boiling point.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"df7e4d554d32f4b435ed373492c9db66abe68b6e1114d5dbe245a752b59b8116","category":"Cycling"}