{"title":"Hands-on with the original iPod: ‘Definitely’ worth $399","link":"https://www.macworld.com/article/163599/original-ipod-hands-on.html","date":1634990400000,"content":"<div>\n<section><div></div></section><p><strong>Editor’s note: </strong><em>This article originally ran on November 1, 2001.</em></p>\n\n\n\n<p>When I first heard the details about the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=http://www.apple.com/ipod&amp;subid1=1-1-163599-1-0-0\">iPod</a>, Apple’s “breakthrough digital device,” I thought it sounded okay, but wasn’t a “must-have” item for me. However, now that I’ve used one for almost a week, I’ve changed my mind. </p>\n\n\n\n<p>I received an evaluation unit of the iPod the day before I drove from Nashville to Indianapolis to cover the EDUCAUSE conference — a five-hour haul. I downloaded half a dozen albums (Sara Evans, Elton John and Ryan Gold) to listen to on the road. No, I’m not a dangerous driver. I didn’t plug in the “ear bud” headphones that come with the iPod. Instead, I used a cassette plug-in adapter, which I’ve used previously for my portable CD player, to play the songs on the iPod through my car’s speakers.</p>\n\n\n\n<p>You simply plug a cassette-shaped device into your cassette player and the other end into the earphone jack on your iPod. Hit play and the songs on the digital device play through the automobile speakers. The audio quality wasn’t as crystal clear as with a good set of headphones or high quality external speakers, but the songs sounded good and certainly made a long trip down the interstate more enjoyable.</p>\n\n\n\n<p>But that’s not what really sold me on the iPod. As I always do when heading on a business trip, I began backing up files from my desktop Mac to my external VST FireWire hard drive–only to find that the hard drive had died.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/ipod-front-side.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>The solution was for the iPod to do double duty as a FireWire hard drive. I enabled the FireWire disk mode option, and it immediately mounted on the desktop. I then used it as I would any other 5 GB hard drive. I backed up my word processing and e-mail files for transfer to my iBook. With iTunes 2.0 installed on both my desktop and laptop Mac, this was a seamless process. The result: I ended up with a combination music player/hard disk drive that was 6.5 ounces and slipped into my pocket.</p>\n\n\n\n<p>The iPod and iTunes are extremely easy to use. I love the ease of audio synchronization. Just plug the device into your Mac via a FireWire cable and the portable device and your iTunes library sync easily and quickly.</p>\n\n\n\n<p>When using the iPod for digital music, its navigation is the best I’ve ever seen. It’s a no-brainer to organize and scroll through lots of music files thanks to the scroll wheel on the front.</p>\n\n\n\n<p>The iPod has a built-in amplifier that provides a smooth sound. The ear-bud headphones, with “18mm drivers using Neodymium transducer magnets” sound great. But they, and all the headphones like them, tend to make my ears sore after a while. And they have a tendency to fall out of my ears.</p>\n\n\n\n<p>The iPod’s use of FireWire is one of its strong points. Apple says it’s over 30 times faster than USB-based music players. I haven’t actually gotten my stopwatch out to test this, but it feels extremely fast. Plus, its FireWire cable is of the six-pin variety, so the iPod’s battery charges when it’s connected to your Mac. This is the first time that anyone has created a product that charges off FireWire, and it certainly reduces cable clutter. Still, Apple kindly includes an external power adapter in case you’re on the road without a Mac.</p>\n\n\n\n<p>The iPod is powered by a built-in rechargeable Lithium Polymer battery that Apple says will handle 10 hours of playback on a single charge. I’m on hour 11 now and there’s life in the thing yet. A battery that actually exceeds its specs? Now that’s rare.</p>\n\n\n\n<p>As you’d probably guess from Apple’s products of recent years, the iPod looks great. It’s sleek with a front that’s a soft, iBook-like white encased in clear plastic. The back is shiny silver metal. Alas, both the plastic and the metal scratch easily.</p>\n\n\n\n<p>What else did I like? The iPod’s 160×128 backlit LCD has great contrast and is easy to read. The digital device can pick up a song again if it falls “asleep” during playback. And the “hold” switch is very useful for thwarting accidental pauses, fast-forwards and power downs.</p>\n\n\n\n<p>There have been complaints that Apple should make the iPod work with other music jukeboxes besides iTunes and that the device should be Windows compatible. From my personal viewpoint, I’m perfectly happy using it with iTunes due to the perfect integration between the software and the hardware. And iTunes 2 itself is mighty fine. The latest version of Apple’s music software includes support for several languages (including Japanese), the ability to burn MP3 files onto a CD, an equalizer and crossfader.</p>\n\n\n\n<p>As for connectivity with Windows devices, well, if Apple isn’t worried about any lost sales in this area, then I could care less. It works with my Mac and if that causes some envy among Windows users, well then maybe they should look at the Mac platform to see what else they’re missing.</p>\n\n\n\n<p>I do agree with others that Apple should have included a belt clip with the iPod. Although Apple says it’s designed for a pocket, runners such as myself could use a belt clip when logging in our daily miles. After all, it contains 32MB of playback buffer memory, which allows it to load up 20 minutes of music ahead of playback to ensure there’s no skipping.</p>\n\n\n\n<p>However, MacCentral reader John Gettler found a US$10 solution: a universal clip <a href=\"http://www.amazon.com/exec/obidos/tg/stores/detail/-/wireless/B00004XMP8/103-1789298-9696607?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">that’s available for ordering online</a>. He thinks Apple should offer the clip as an accessory. </p>\n\n\n\n<p>Also, Apple needs a cover for the FireWire opening on the top of the device. Rainwater and dirt could certainly ruin it.</p>\n\n\n\n<p>And the thing that would really make the iPod indispensable for me would be the capability to record audio files via a microphone and drag them to my Mac. For a roving reporter, this would be incredibly useful.</p>\n\n\n\n<p>But even without the things on my wish list, I’m now a lighter traveler. My portable CD player stays at home, along with my external FireWire drive. Both have been replaced by a 6.5-ounce device.</p>\n\n\n\n<p>Is it worth $399 to me? Definitely.</p>\n\n\n\n<p>Now if only there were only a PIM (personal information manager) that would auto sync with my Mac’s contact/calendar info via FireWire as smoothly as the iPod does with my music library (hint, hint, hint).</p>\n</div>","author":"Dennis Sellers","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"df8f0a4dfde212923bdc399abb38f4f79a0dbc41238548ef04ff7b58cb860e2c","category":"Apple"}