{"title":"Effect of progestin-based contraceptives on HIV-associated vaginal immune biomarkers and microbiome in adolescent girls","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306237","date":1721052000000,"content":"<p>by Mélodie A. Nasr, Annette Aldous, Jason Daniels, Christopher Joy, Eleanor Capozzi, Michelle Yang, Patricia Moriarty, Vanessa Emmanuel-Baker, Sharyn Malcolm, Stefan J. Green, Veronica Gomez-Lobo, Mimi Ghosh</p>\r\n\r\nAdolescent girls bear a disproportionate burden of both the HIV epidemic and unintended pregnancies; yet important questions remain unanswered regarding the effects of hormonal contraceptives on the vaginal immune microenvironment, which can impact HIV susceptibility in this group. Multiple studies report genital immune alterations associated with the progestin-based contraceptive Depot medroxyprogesterone acetate (DMPA) in adult women, but there is little available data in adolescents. The objective of this longitudinal cohort study was to evaluate the effects of short-term use of three progestin-based contraceptives, levonorgestrel intrauterine device (LNG-IUD), subdermal etonogestrel (ETNG), and injectable DMPA, on HIV-associated vaginal immune biomarkers and microbiome in adolescent girls. Fifty-nine sexually active, HIV-uninfected girls aged 15-19, were recruited from the Washington DC metro area and self-selected into Control (condoms only), combined oral contraceptive pills, LNG-IUD, ETNG and DMPA groups. Vaginal swabs were collected at baseline prior to contraceptive use and at 3-month follow-up visit. Vaginal secretions were tested for pro-inflammatory (IL-1α, IL-1β, TNF-α, IL-6, IL-8, MIP-3α, IP-10, RANTES, MIP-1α, MIP-1β) and anti-inflammatory/anti-HIV (Serpin-A1, Elafin, Beta-Defensin-2, SLPI) immune biomarkers using ELISA and for anti-HIV activity using TZM-bl assay. Vaginal microbiome was evaluated using 16S rRNA gene sequencing. Data were analyzed using SAS Version 9. Among the 34 participants who completed both visits, no significant changes in median biomarker concentrations, HIV inhibition and microbiome composition were observed between baseline and follow-up visits for any of the contraceptive groups. IL-8 (p&lt;0.01), MIP-3α (0.02), Elafin (p = 0.03) and RANTES (p&lt;0.01) differed significantly by race whereas IL-6 was significantly different by age (p = 0.03). We conclude that 3-month use of LNG-IUD, ETNG and DMPA have minimal effects on adolescent vaginal immune microenvironment, and therefore unlikely to impact HIV risk. Future studies with larger sample size and longer follow-up are recommended to continue to evaluate effects of contraceptives on the lower genital tract immunity and susceptibility to sexually transmitted infections.","author":"Mélodie A. Nasr","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"df9a5b7b39ef9ea8ae50101c9fdfad7b4ff20dd930d2f8d25a012fbb2636a92f","category":"Interdisciplinary"}