{"title":"Impact of urban disturbance on soil insect communities in a Brazilian Atlantic Forest biological station","link":"http://link.springer.com/10.1007/s11252-024-01613-2","date":1738368000000,"content":"<h3>Abstract</h3>\n                    <p>Urbanization constitutes a major threat to biodiversity. Understanding its effects on insect communities is relevant because they are key elements of trophic interactions, and indicators and targets of conservation. Herein, we investigated the influence of meteorological and habitat factors on the soil entomofauna in three areas with distinct levels of urbanization at the Parque Estadual da Pedra Branca, Brazil. We investigated whether community structure differs among areas with different levels of urbanization, and how changes in the environment affect soil insect community composition and distribution. We systematically monitored communities for 12 months in three areas along a gradient of anthropogenic disturbance, representing preserved secondary forest, disturbed forest and peridomicile areas. The results revealed that the degree of urbanization affects insect communities, with a strong effect of habitat factors, such as canopy cover, presence of flooded areas, quantity of fallen trunks and mean temperature. Insect abundance did not show significant differences among areas, while biomass was higher in disturbed forest than in preserved forest and peridomicile areas. Additionally, insect richness and diversity were higher in preserved and disturbed forests than in peridomicile areas, with no significant difference between preserved and disturbed forests. Our results can be used to enhance the understanding of the effects of urbanization on taxonomically and functionally diverse groups of insects, and to advise residents and urban planners about the consequences of urbanization on biodiversity and ecosystem services in urban-sylvatic interface areas.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"dfa3d0afc2222cf55beb26babdc0f76e4c1e363a7ef302fdf80ac32ac2ab52ec","category":"Environment"}