{"title":"Students’ experience of interpersonal interactions quality in e-Learning: A qualitative research","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298079","date":1711461600000,"content":"<p>by Rita Mojtahedzadeh, Shirin Hasanvand, Aeen Mohammadi, Sahar Malmir, Mehdi Vatankhah</p>\r\nBackground <p>Online Interaction is a critical characteristic of distance learning, and effective online communication models empower students.</p> Purpose <p>This research aimed to explain students’ experiences on the quality of interpersonal interactions in e-learning.</p> Method <p>This study was conducted from November 2021 to October 2022. The qualitative descriptive design via conventional content analysis was utilized. Purposeful and maximum variation methods recruited sixteen participants from three medical science universities in Iran. The data were collected through semi-structured, in-depth, face-to-face, or online interviews. Interviews were recorded through a digital recorder, and analysis was achieved simultaneously with data collection using Graneheim and Lundman (2004). The Lincoln and Guba criteria, including credibility, dependability, transferability, and confirmability, were used to improve the trustworthiness of the findings.</p> Results <p>The results indicated the importance of different dimensions related to teaching-learning. It seems crucial to develop a comfortable and safe environment to improve interpersonal interactions. Educators should be provided with pedagogical skills to support interactions. In addition, focusing on some learners’ soft skills is also vital. In addition to the significance of the teacher’s inclusive role, the educational content must have critical standards. Constructive feedback and the proper use of simultaneous and non-simultaneous communication tools and social networks are other important issues in strengthening interpersonal relationships. Ultimately, comprehensive and ongoing support of learners improves the quality of interpersonal interactions.</p> Conclusions <p>The results indicated the significance of different dimensions of teaching-learning as facilitating factors of interpersonal interactions. The proper use of simultaneous and non-simultaneous communication tools and social networks are other important issues in strengthening interpersonal relationships. Ultimately, comprehensive and ongoing support of learners improves the quality of interpersonal interactions.</p> Implications <p>The results of this study give teachers the insight to keep essential issues in mind when developing their online courses and students to be aware of their roles in the online learning process. Also, the characteristics of simultaneous and non-synchronous platforms, social messaging networks, and learner support are crucial.</p>","author":"Rita Mojtahedzadeh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dfa78730b3d2f5e13d38761c4ae9dc918bd6066a26c7980c52a3eaec49a01aa7","category":"Interdisciplinary"}