{"title":"Platelet-derived microvesicles isolated from type-2 diabetes mellitus patients harbour an altered miRNA signature and drive MDA-MB-231 triple-negative breast cancer cell invasion","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304870","date":1718892000000,"content":"<p>by Anca Tutuianu, Chinedu A. Anene, Mikayla Shelton, Valerie Speirs, Donald C. Whitelaw, Joanne Thorpe, Wayne Roberts, James R. Boyne</p>\r\n\r\nThe underlying causes of breast cancer are diverse, however, there is a striking association between type 2 diabetes and poor patient outcomes. Platelet activation is a common feature of both type 2 diabetes and breast cancer and has been implicated in tumourigenesis through a multitude of pathways. Here transcriptomic analysis of type 2 diabetes patient-derived platelet microvesicles revealed an altered miRNA signature compared with normoglycaemic control patients. Interestingly, interrogation of these data identifies a shift towards an oncogenic signature in type 2 diabetes-derived platelet microvesicles, with increased levels of miRNAs implicated in breast cancer progression and poor prognosis. Functional studies demonstrate that platelet microvesicles isolated from type 2 diabetes patient blood are internalised by triple-negative breast cancer cells <i>in vitro</i>, and that co-incubation with type 2 diabetes patient-derived platelet microvesicles led to significantly increased expression of epithelial to mesenchymal transition markers and triple-negative breast cancer cell invasion compared with platelet microvesicles from healthy volunteers. Together, these data suggest that circulating PMVs in type 2 diabetes patients may contribute to the progression of triple-negative breast cancer.","author":"Anca Tutuianu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dfa7f21987806d95fa73061cff2d7f9b9b56a85fa49e17ad1bdd6e77af9cfb7d","category":"Interdisciplinary"}