{"title":"★ Google’s Pixel 8 Launch Event","link":"https://daringfireball.net/2023/10/googles_pixel_8_event","date":1696543435000,"content":"\n<p>The Verge, as usual, <a href=\"https://www.theverge.com/2023/10/4/23895660/google-pixel-8-event-news-roundup/\">has a wonderful page summarizing everything announced or demoed at yesterday’s Pixel event</a>, including <a href=\"https://www.youtube.com/watch?v=00uU6PdTjKE\">a 15-minute summary video</a>. The Verge is so good at things like this, I dare describe them as indispensable.</p>\n\n<p>At the highest level it’s impossible not to draw a direct comparison to Apple’s iPhone 15 event last month. The two companies announced the exact same slate of products:</p>\n\n<ul>\n<li>New flagship phones, both Pro and non-pro</li>\n<li>New smartwatches</li>\n<li>New wireless earbuds with AR noise filtering features</li>\n</ul>\n\n<p>New phones, new watches, new earbuds. The Apple and Google versions of these products are all direct competitors to each other. No normal person buys both an iPhone and a Pixel, or both an Apple Watch and Pixel Watch, or both AirPods Pro and Pixel Buds Pro. But it’s more profound than that. Practically speaking, no one mixes and matches these products. Why would anyone? If you own an iPhone, it’s hard to think of a single reason why you’d try to pair it with a Pixel Watch or Pixel Buds. And if your phone is a Pixel, you <em>can’t</em> even pair it with an Apple Watch.</p>\n\n<p>As I wrote about Apple’s event last month, these three product categories go together. They form an ecosystem of truly personal computing devices: the ones we take with us nearly everywhere, which work together in ways that just don’t apply to other devices. There are zillions of people who own the Apple triumvirate — iPhone, Apple Watch, AirPods — who use a PC laptop and something other than an Apple TV box for streaming. And there are surely plenty of Android users who use a MacBook. A Mac <em>can</em> be a great device for use in Google’s overall ecosystem.</p>\n\n<p>It’s also impossible not to comment on just how much less interest there is in Google’s Pixel ecosystem. Google’s event garnered only a sliver of the attention Apple’s did, and their devices, similarly, have only a fraction of the sales Apple’s do. On the one hand I’m tempted to say the difference is just commensurate with how much better at hardware Apple is than Google. But I think there’s more to it than that. There’s something ineffable about it. There are aspects of marketshare traction — in any market — that can’t be explained by side-by-side product comparisons alone.</p>\n\n<p>For a long time, Apple just couldn’t regain traction in the PC market. Even after Mac OS X was released, even after the Jobs/Ive regime had restored both <a href=\"https://512pixels.net/2016/04/the-mac-product-grid/\">sense</a> and <a href=\"https://www.theverge.com/23808948/imac-twenty-five-visual-history-apple-design-models\">panache</a> to the hardware lineup, it seemed like the best Apple could do was tread water, marketshare-wise. But they kept at it. We remember the long-running “Get a Mac” ad campaign with Justin Long (“I’m a Mac”) and John Hodgman (“and I’m a PC”) not just because it was clever but because it really did coincide with a reversal of fortune for the Mac in the market. People really did start switching from Windows PCs. So great was Windows’s market share that here we are 17 years after the start of that ad campaign and <a href=\"https://www.cnbc.com/2023/07/11/apples-mac-market-share-jumped-even-though-pc-sales-fell-for-the-sixth-consecutive-quarter.html\">the Mac continues to grow</a>.</p>\n\n<p>Are Google’s Pixel devices — the phones especially — ever going to have such a moment? I just don’t see it happening. Most tellingly, they don’t even take much share of the U.S. <em>Android</em> market, let alone the U.S. smartphone market, let alone the worldwide phone market. Here’s 9to5Google, <a href=\"https://9to5google.com/2023/07/28/google-pixel-us-q2-2023-shipments/\">reporting back in July regarding a market share report from Counterpoint</a>:</p>\n\n<blockquote>\n  <p>Through that, though, Apple actually managed to up its share of \nthe overall US smartphone market in Q2 2023 by 10%. That takes the \niPhone to a 55% share of overall shipments, with Android brands \ncompeting for the remaining 45%. Apple has had higher numbers \nprior, hitting 57% in Q4 of last year, but there’s still a clear \ntrend where Android is continuing to lose ground. </p>\n\n<p>However, Google Pixel managed to be a bright spot throughout. \nPixel shipments in the US grew by 48% year-over-year in Q2, the \nonly major brand that managed to do so. That’s still a mere 3% of \nshipments over the quarter, but that’s also during a time where \nonly a single Pixel device actually launched. </p>\n</blockquote>\n\n<p>3 percent market share in the U.S. — Pixel’s best market — is a pretty dim “bright spot”. I don’t know how anyone could compute this, other than anecdata observed in Mountain View cafeterias, but I’d wager that more Google employees carry an iPhone than carry a Pixel. There was a trend on Threads last week where — inspired by Linda Yaccarino showing the world that she didn’t have the X app on her iPhone’s home screen — people were showing screenshots of their own home screens. It struck me, watching them scroll by, just how many people have multiple Google apps among their most-used iOS apps — Maps, Gmail, Chrome. That’s a sign of strength for Google, as a company, but it’s obviously a hindrance to getting iPhone users invested in Google’s overall ecosystem to switch their phone to a Pixel. The best software from Google is available on all phones; the best from Apple is only available on iPhones.<sup><a href=\"#fn1-2023-10-05\">1</a></sup></p>\n\n<p>Something is just missing from the Pixel’s potential appeal, and I don’t think it was announced yesterday. I really am glad that Google seemingly remains committed to its Pixel devices, but I just don’t see the angle that’s going to change their popularity. I suspect I could save this column and publish it a year from now instead of today, and barely change a word.</p>\n\n<hr />\n\n<p>The most striking features Google announced yesterday were <a href=\"https://www.theverge.com/2023/10/4/23895660/google-pixel-8-event-news-roundup/\">regarding AI-assisted photography</a>. “Magic Editor” lets you move and remove objects and people. “Best Take” is a feature I’ve long wished for yet still feel uneasy about: if you snap multiple photos of a group of people, Best Take will choose the “best” face for each person from the group of images, merging them into a single, well, best take. For decades we’ve all been able to do this manually using Photoshop and other image editors, and merging multiple image captures into a single resulting “photo” is how features like HDR work. But Google seems more willing to brush aside any ethical concerns about what exactly a <em>photograph</em> is. On Threads, <a href=\"https://www.threads.net/@reckless1280/post/Cx-3qcLrQH8\">Nilay Patel wrote</a>:</p>\n\n<blockquote>\n  <p>Google is framing its new AI camera tools as making “memories” not \nphotos which... run this to the end and it’s just a camera \ndesigned to tell lies about what really happened. I don’t know \nthat any news organization can accept journalistic photos from a \nPixel 8 at this point. </p>\n</blockquote>\n\n<p>The difference from something like HDR is that even if HDR is generating one image from multiple sensor readings, the purpose is to more accurately reflect what the photographer’s eyes actually saw, from that vantage point, at that moment in time. Pixel phone photography is racing ahead to a world where images reflect moments that never actually were. Is the purpose of a camera to capture things as they were, or as they should have been?</p>\n\n<p>Is that dishonest? Is all of digital photography headed in this direction, inevitably, and Google is just willing to blaze the trail that everyone else will soon enough follow? I don’t know. But it was the segment of yesterday’s event that most struck me: technically impressive, but ethically blithe.</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>Try this on for an analogy: Google treats its entire Pixel portfolio like Apple treats Apple TV hardware. They make the best parts of it available on other platorms, greatly reducing the perceived value of their own hardware. Why switch to a Pixel when almost all of Google’s apps are available on iOS? Why switch to an Apple TV box when the TV app and iTunes Store are built into your “smart” TV? <a href=\"#fnr1-2023-10-05\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"dfb6c8ac671b90341d60892118cf62dd725472bd94b075f5b92876a2b1235417","category":"Tech"}