{"title":"Audi subverts the luxury sedan with new grandsphere concept","link":"https://arstechnica.com/?p=1791520","date":1630603846000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GrandSphere60914-980x735.jpg\" /></div>\n        <p>\n          At first glance, the grandsphere is recognizably an Audi fastback sedan. But it upends the usual luxury car way of doing things.                      [credit:\n                        Audi                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Audi's design team is in the midst of what might be called its \"sphere trilogy,\" exploring how autonomous driving might alter the luxury car experience. At Monterey Car Week in August, <a href=\"https://www.cnet.com/roadshow/news/audi-skysphere-concept-debut/\">the team showed off the skysphere</a>, which morphs from stubby sports car to autonomous cruiser, extending its wheelbase as the driver's controls fold out of sight. Soon, we'll see the (presumably compact) urbansphere, but today, it's the grandsphere sedan's turn. And no, none of the names are capitalized.</p>\n<p>The grandsphere doesn't need morphing bodywork; the vehicle is long enough that there's always more than enough room inside, regardless of who's driving. At first glance, the car looks like a grand tourer, but there's a visual trick at work. The base of the windshield is way out ahead of the A-pillar, curving out almost as far as the front axle.</p>\n<p>At the front, Audi's distinctive grille (actually called the Singleframe) is no longer an actual grille; it's there so the grandsphere is recognizably an Audi. Even in our video briefing, the Singleframe appeared as if it—and therefore the rest of the car—was a render, thanks to the way it was lit from within. (Save the <a href=\"https://www.theverge.com/tldr/2021/9/1/22652236/ted-lasso-roy-kent-cgi-conspiracy-theory\">CGI conspiracies for <em>Ted Lasso</em></a>; the car is a real, full-size, physical concept.)</p></div><p><a href=\"https://arstechnica.com/?p=1791520#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791520&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dfbe1e03bd0c64c4c65a4e42e4a189d3f284a6ed99e015c7a21c12a8cb70928f","category":"Tech"}