{"title":"Exploring road safety using alignment perspective features in real driving images: A case study on mountain freeways","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305241","date":1718632800000,"content":"<p>by Shijian He, Hongmei Fu, Jie Wang, Jiacheng Yang, Yanqing Yao, Jiaojiao Kuang, Xiangliang Xiao</p>\r\nIntroduction <p>While driving, drivers frequently adapt their driving behaviors according to their perception of the road’s alignment features. However, traditional two-dimensional alignment methods lack the ability to capture these features from the driver’s perspective.</p> Method <p>This study introduces a novel method for road alignment recognition, employing image recognition technology to extract alignment perspective features, namely alignment perspective skewness (APS) and alignment perspective kurtosis (APK), from in-real driving images. Subsequently, the K-means clustering algorithm is utilized for road segment classification based on APS and APK indicators. Various sliding step length for clustering are employed, with step length ranging from 100m to 400m. Furthermore, the accident rates for different segment clusters are analyzed to explore the relationship between alignment perspective features and traffic safety. A 150 km mountain road section of the Erlianhaote-Guangzhou freewway from Huaiji to Sihui is selected as a case study.</p> Results <p>The results demonstrate that using alignment perspective features as classification criteria produces favorable clustering outcomes, with superior clustering performance achieved using shorter segment lengths and fewer cluster centers. The road segment classification based on alignment perspective features reveals notable differences in accident rates across categories; while traditional two-dimensional parameters-based classification methods fail to capture these differences. The most significant differences in accident rates across categories are observed with segment length of 100m, with the significance gradually diminishing as segment length increases and disappearing entirely when the length exceeds 300m.</p> Implication <p>These findings validate the reliability of using alignment perspective features (APS and APK) for road alignment classification and road safety analysis, providing valuable insights for road safety management.</p>","author":"Shijian He","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dfc4ab4b1d32abc00f79d469a9942ff9ad0ddab4115f516af830ed0a3ec4d573","category":"Interdisciplinary"}