{"title":"Effects of 2D hydrodynamic model resolution on habitat estimates for rearing Coho Salmon in contrasting channel forms","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4341?af=R","date":1720420756000,"content":"<h2>Abstract</h2>\n<p>Estimating the impacts of water allocation decisions on fish populations and habitat availability is an important part of environmental flow assessments, especially in locations where water resources are limited. Two-dimensional hydrodynamic models (2DHMs) are commonly coupled with biological models to estimate fish habitat quality, area, and capacity across a range of proposed streamflows. Increasingly, resource managers are relying on landscape-scale model domains with coarse model resolutions to maintain feasible computational loads, but this may affect habitat estimates if the mesh element size of the model exceeds the spatial scale relevant to the organism. We investigated how coarsening the resolution of a 2DHM influences the area and spatial distribution of estimated Coho Salmon (<i>Oncorhynchus kisutch</i>) fry habitats. We used an interpolation scheme that upscaled mesh elements from a high-resolution (0.25 m<sup>2</sup>) 2DHM to quantify and visualize the effects of 2DHM resolution on estimates of Coho Salmon fry habitat for two contrasting channel morphologies and across a broad range of streamflows. Estimates of Coho Salmon fry habitat at increasingly coarser resolutions led to 20%–50% reductions in weighted usable habitat area (WUA) across several streamflow scenarios for a complex channel type, but did not impact estimates in a confined, flume-like channel. Additionally, flow-to-habitat area relationships were not congruent at a given streamflow when resolution coarsened. Along with almost 500% more high-quality habitat area estimated in the complex channel type over the confined, discrepancies in habitat area increased with higher flows in areas defined as optimal for rearing Coho Salmon fry. Considering that complex channel types contain critical habitat for Coho Salmon fry, this study suggests coarse 2DHM resolutions may exclude important wetted edge and off-channel habitats from environmental flow assessments.</p>","author":"Reuben B. Smit, \nDamon H. Goodman, \nJosh Boyce, \nNicholas A. Som","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"dfca896fd681554134f7e29d24c78a2cf93aa5258616a3b978ab626c5f5dcbe4","category":"Environment"}