{"title":"หัวหน้าทีมแพทย์ BioNTech ระบุ วัคซีน COVID-19 อาจต้องฉีด 3 โดส คาดต้องฉีดกระตุ้นทุกปี","link":"https://www.blognone.com/node/122301","date":1619061072000,"content":"<div><div><div><p>Dr. Özlem Türeci ผู้ร่วมก่อตั้งและหัวหน้าทีมแพทย์ (Chief Medical Officer) ของ BioNTech ที่พัฒนาวัคซีน COVID-19 ร่วมกับ Pfizer ได้ให้สัมภาษณ์กับ CNBC ว่าเธอคาดว่าผู้คนน่าจะต้องฉีดวัคซีนโดสที่ 3 เมื่อภูมิคุ้มกันเริ่มอ่อนลง ซึ่งสอดคล้องกับที่ซีอีโอของ Pfizer เคยระบุไว้ก่อนหน้านี้</p>\n<p>นอกจากนี้เธอยังคาดว่าต่อไปผู้คนจะต้องฉีดวัคซีนนี้เพื่อกระตุ้นภูมิทุกปีเหมือนวัคซีนไข้หวัดใหญ่ ด้วยเหตุผลเดียวกันคือนักวิทยาศาสตร์คิดว่าภูมิคุ้มกันจะลดลงเมื่อเวลาผ่านไป</p>\n<p>ก่อนหน้านี้ Albert Bourla ซีอีโอของ Pfizer เคยให้ข้อมูลว่าผู้คนน่าจะต้องรับวัคซีนโดสที่ 3 ภายใน 12 เดือนหลังจากฉีดครบ 2 โดสที่เป็นขั้นต่ำ โดย Pfizer เคยกล่าวว่าวัคซีนของตนมีประสิทธิภาพมากกว่า 91% ในการป้องกันไวรัส และมากกว่า 95% ในการป้องกันโรคร้ายแรงภายใน 6 เดือนหลังรับวัคซีนโดสที่ 2 ซึ่งวัคซีนของ Moderna ก็มีประสิทธิภาพในระดับใกล้เคียงกัน</p>\n<p>อย่างไรก็ตาม นักวิจัยยังไม่ทราบว่าวัคซีนจะยังป้องกันไวรัสได้ดีเพียงใดหากพ้น 6 เดือนไปแล้ว แต่ก็แปลว่าทุกประเทศจะต้องการวัคซีนเพิ่มขึ้นอีกอย่างมากในอนาคต ซึ่งขณะนี้รัฐบาลไบเดนก็กำลังจะจัดหาวัคซีนเพิ่มอีก</p>\n<p>ที่มา - <a href=\"https://www.cnbc.com/2021/04/21/scientist-who-helped-develop-pfizer-biontech-covid-vaccine-agrees-third-shot-is-needed-as-immunity-wanes.html\">CNBC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d3ee8116e902ef220033013367d60c21.jpg\" /><br />\nภาพวัคซีน BNT162b2 จาก <a href=\"https://twitter.com/BioNTech_Group/status/1329754864851841025/photo/1\">BioNTech</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/pfizer\">Pfizer</a></div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/vaccine\">vaccine</a></div><div><a href=\"/topics/medical\">Medical</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"dfce673bd5c8159872b54400b5a346ac4ba9e2622bec0f9419fbd065fbcd5ff2","category":"Thai"}