{"title":"WebTraceSense - A Framework for the Visualization of User Log Interactions","link":"https://www.preprints.org/manuscript/202408.0110/v1","date":1722594442000,"content":"The current surge in the deployment of web applications underscores the need to consider users' individual preferences in order to enhance their experience. In response to this, an innovative approach is emerging that focuses on the detailed analysis of interaction data captured by web browsers. This data, which includes metrics such as the number of mouse clicks, keystrokes, and navigation patterns, offers insights into user behaviour and preferences. By leveraging this information, developers can achieve a higher degree of personalization in web applications, particularly in the context of interactive elements such as online games. This paper presents the WebTraceSense project, which aims to pioneer this approach by developing a framework that encompasses a backend and frontend, advanced visualization modules, a DevOps cycle, and the integration of AI and statistical methods. The backend of this framework will be responsible for securely collecting, storing, and processing vast amounts of interaction data from various websites. The frontend will provide a user-friendly interface that allows developers to easily access and utilize the platform’s capabilities. One of the key components of this framework is the visualization modules, which will enable developers to monitor, analyse, and interpret user interactions in real-time, facilitating more informed decisions about user interface design and functionality. Furthermore, the WebTraceSense framework incorporates a DevOps cycle to ensure continuous integration and delivery, thereby promoting agile development practices and enhancing the overall efficiency of the development process. Moreover, the integration of AI methods and statistical techniques will be a cornerstone of this framework. By applying machine learning algorithms and statistical analysis, the platform will not only personalize user experiences based on historical interaction data but also infer new user behaviours and predict future preferences. In order to validate the proposed components, a case study was conducted which demonstrated the usefulness of the WebTraceSense framework in the creation of visualizations based on an existing dataset.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"dfd7b5ab24818421951f01ccd039f77b19b9380b7a51d730afd4d3fc9aca4b5c","category":"Interdisciplinary"}