{"title":"Branchial Motion Assessment in Abalone Using Photoplethysmography","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/6672198?af=R","date":1702627200000,"content":"<p>The abalone, a gastropod mollusk belonging to the Haliotidae family, has been a subject of research with a focus on its behavior in response to various environmental factors, including temperature fluctuations and hypoxia. While existing studies have primarily explored abalone behavior in relation to environmental changes, there remains a significant amount to be discovered regarding their behavioral patterns. There are studies in which recordings of readings have been made (indirect methods) of the heart rate of the abalone since it is believed that it is one of the parameters affected due to the changes in temperature and dissolved oxygen in its environment. The main disadvantage of some procedures to measure heart rate in abalone is that an incision is made near the heart, through this incision the measurement is made using the photoplethysmography technique. Another parameter that is affected by these changes (temperature and hypoxia) is respiratory rate. Temperature is an important factor that can reduce oxygen solubility and thus alter abalone respiration; so in this work, we propose to use the technique of photoplethysmography: a method involving the measurement of changes in volume within a biological organ, which offers a unique opportunity to monitor these changes. We adapt this technique to measure gill movements in abalone, a critical indicator of respiratory activity in these marine mollusks. By utilizing a pulse oximetry setup and synchronous detection, we establish an innovative approach to gill movement analysis. This approach employs a pulse train and synchronous demodulation technique, the train of pulses is guided through an optical fiber to one of the respiratory orifices of the abalone to effectively detect and analyze the gill movements of abalone. Additionally, the role of frequency of its gill movements is highlighted as another critical variable of interest within the broader study of <i>Haliotis fulgens</i>, shedding light on the multifaceted nature of abalone behavior and responses to their surroundings. This research contributes to a deeper understanding of abalone physiology and behavior, offering insights into their adaptation to changing environmental conditions.</p>","author":"R. Z. Bautista L칩pez, \nJ. Y치침ez Mendiola, \nM. T. Sicard Gonz치lez, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"dfe9b89dd7a4ce553c3762787542a68a0290e862196566120c922893c8bc84ac","category":"Environment"}