{"title":"How To Choose Typefaces For Fintech Products: Our Best Practices Guide (Part 1)","link":"https://smashingmagazine.com/2023/10/choose-typefaces-fintech-products-guide-part1/","date":1697194800000,"content":"<p>Hi! My name is Daria, and for the last two years, I’ve been working at Devexperts. I have experience creating various products, from crypto wallets to exchange administration platforms. Our target audience is diverse from professional and non-professional brokers, novice and experienced traders to dealing staff and trade desk operators. All of them use financial tools daily, and some of them — with high intensity. </p>\n<p>Сontinuous use of the product under high tension conditions (which is common when we talk about the financial sphere) might cause eyestrain and general weariness. Consequently, users might make poor decisions and become inattentive to details, which will lead to harming their investment portfolios. My goal, as a designer, is to prevent these drawbacks and make daily operations comfortable.</p>\n<p>The main designer’s instrument to work with the product is the UI kit, a collection of reusable components, such as controls, color palettes, effects, and <strong>text styles</strong>. Typography is an important part of it as it defines a text style library and conveys the most valuable and powerful instrument — the information — from platform to user.</p>\n<p>To explain my approach to digital product typography, I invite you to go over each step, from research to implementation. Before diving deep, let’s cover the basic terms.</p>\nBasic Terminology Before We Begin\n<p><strong>A typeface</strong> (or a font family) is a range of graphically similar fonts with a common visual idea behind them. For example, Helvetica is a typeface. </p>\n<p><strong>A font</strong> is part of a typeface. It is a collection of symbols that might differ in weight (Semibold/Bold/Black), might be upright or italic (Regular/Cursive/Italic), have various widths (Narrow/Wide), and so on.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/font-family.jpg\" /></p>\n<p>Please keep in mind that these two terms are often interchangeable, even when used by type designers. </p>\n<p>Now that we have our basic terms defined let’s go over our suggestions on the workflow when creating or choosing a font for a fintech product. </p>\nStep 1: Detect Data Types And User Flows\n<p>If you’re a fintech designer in the trading sphere, you’ll mainly deal with <strong>spreadsheets</strong>. Usually, they represent fundamental page units with data on markets. </p>\n<p>Other standard data media include product cards and forms for order entry, cancellation, adjustment, and so on. Product cards provide users with more detailed information on trading instruments, while forms allow users to interact with markets. These interactions are <strong>user flows</strong>. </p>\n<p>What do all these different kinds of information have in common? They’re all displayed as texts. In this case, the core design values are the following:</p>\n<ul>\n<li>An appropriate typeface, </li>\n<li>Working with typography, </li>\n<li>A layout,</li>\n<li>An accurate representation of information.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/interface.jpg\" /></p>\n<p>In the picture above, you can see the example of a platform for exchange administrators with all typical types of data. A spreadsheet displays a list of trades and dozens of their parameters. At the back is an example of a trading instrument card (currency pair) with dynamic quotes that update in real time. The chart displays trade history with prices and volumes, and the Market Depth graph at the right shows the current state of the market — the volume of Buy and Sell orders and their prices. </p>\n<p>Now when we have defined the most common types of data in fintech products, let’s zoom in and see what specific circumstances we need to consider in our product.</p>\nStep 2: Consider Your Requirements\n<p>Best design practices facilitate current requirements and consider potential scenarios of product evolution. When working on a fintech product, you should also consider features such as  <strong>language support</strong>, <strong>special characters</strong>, and <strong>use conditions</strong>. Let’s have a look at these spheres and highlight the most considerable points in each of them.</p>\n<h3>Language Support</h3>\n<p>Forecasting specific typographical cases at the start of a project might be a great investment for future development. For instance, product localization and translation to various languages is one such case. Should your product support one or multiple languages? If multiple, try to understand the average difference in word lengths. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/distribution-word-lengths-various-languages.jpg\" /></p>\n<p>For example, German words are generally much longer than English ones. Compared to these two, French and Spanish words are somewhere in between. Consequently, French or German versions need more text space in design than the English one, which will cause layout changes. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/screens.jpg\" /></p>\n<p>Many languages also use diacritics (additional typographical signs above and under the letters). These writing systems may require more space between lines to make texts more legible. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/spacing-differences-depending-use-diacritics.jpg\" /></p>\n<p><a href=\"https://en.wikipedia.org/wiki/Logogram\">Logographic or logosyllabic writing systems</a> are quite the opposite: unlike Latin-based languages, they are usually very compact. Few font families support both hieroglyphic and Latin languages, though. So, if you can’t find an appropriate font for your needs, you’ll have to pick out two different typefaces that will match visually. </p>\n<p>Having information on supported writing systems and future localizations will allow you to choose a typeface with all the necessary languages. Contact the product owner or manager to determine which languages may appear in your product. This way, you will develop a design for all corner cases and create a visual system fit for all localizations. </p>\n<h3>Required Symbols</h3>\n<p>Another critical aspect to consider from the start is special characters. For example, in the fintech sphere, the designer deals with trading markets and often needs to use a variety of currency symbols, math formulas, and decimals.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/usd-symbols.jpg\" /></p>\n<p>There are plenty of ways to find out what glyphs a typeface includes. You can learn this information on Type Foundries websites and typeface marketplaces. Check the type specimen to explore all supported features, glyphs, languages, and characteristics. </p>\n<p>If you already have a typeface on your laptop, it’s easy to check glyphs in a Font book if you use macOS or a Character map if you operate Windows. </p>\n<p>Below, we have an example from macOS. Select the font and switch to the repertoire preview mode to find an entire spreadsheet. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/spreadsheet-pt-serif-regular-glyphs.jpg\" /></p>\n<p>You can also make use of a font-managing app. One of its perks is the <strong>font library management</strong> according to characteristics. There are many such apps, so it should be easy to find the one that suits your taste and budget. A good option might be <a href=\"https://typefaceapp.com/\">Typeface</a> or <a href=\"https://fontba.se/\">FontBase</a> if you’re looking for a free app. </p>\n<p>Another challenge with glyphs that awaits you is Figma. Unlike Adobe products, it doesn’t offer a glyph panel. It means you don’t see the full contents of a font and can’t choose a symbol you need directly on Figma. However, you can copy the required glyph from the Font  Book or Character map and paste it into your design. </p>\n<h3>Use Conditions</h3>\n<p>When you start a new project, consider what type of information it represents and the most common use conditions. For example, if it’s an article, it’s mostly text information with extensive accented quotes, or the text consists of short paragraphs broken down by photos. We presume that the user will most likely read it in a calm setting, as it is the most comfortable way to concentrate on a long text and will need half an hour to finish it. </p>\n<p>Let’s review a drastically different case. We’re designing a product for professional use overloaded with data comprising mostly repetitive figures. Users operate various gadgets to work with the data all day in varying conditions. They can get tired and lack attention but must analyze the data and react swiftly. </p>\n<p><strong>When we work with fintech products, we mainly work with the second scenario.</strong> Our average user deals with numbers and important operations. Investors analyze markets and trade securities, while trade desk operators manage orders. Even a slight hiccup in data performance may cause a great mistake in operations. A carefully selected typeface and precise layout will help you support your user and make their workflow convenient. </p>\nStep 3: Discover Typeface Options\n<p>Understanding typeface features will help you decide on the most suitable fonts. For this reason, we’ll first break down the categories and characteristics of typefaces. </p>\n<h3>Classes</h3>\n<p>Typeface classification has been a subject of discussion for typographers for a long time. (For further information, you can read “<a href=\"https://clagnut.com/blog/2367/\">The trouble with font classifications</a>” and “<a href=\"https://ilovetypography.com/2021/05/31/talking-about-fonts/\">Talking about type:\nfrom Aristotle to Arial</a>.”) For years the common classification, adopted by <a href=\"https://en.wikipedia.org/wiki/ATypI\">Association Typographique Internationale</a> was the Vox-ATypI system, invented by <a href=\"https://en.wikipedia.org/wiki/Maximilien_Vox\">Maximilien Vox</a> in 1954. This system is based on two characteristics of type: visual traits and the historical period of its appearance. It included nine categories that were later expanded to 11 by ATypI. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/vox-atypI-classification-system.jpg\" /></p>\n<p>However, typography has developed dramatically, and this system does not reflect modern type design, as it simply ignores a big part of contemporary typefaces. Most modern typefaces tend to have a mix of characteristics from different historical periods and refer to several categories. <a href=\"https://atypi.org/2021/04/27/atypi-de-adopted-the-vox-atypi-typeface-classification-system/\">The endorsement of this system was withdrawn in 2021</a>, and, at the current moment, the association is working on a new system that would meet needs of modern typographers.</p>\n<p>The Vox system might be useful for the exploration of type design history and research if you want to dive deep into this theme. However, for the daily use of a product designer, <strong>classification according to visual characteristics rather than historical periods might be more helpful</strong>. The division into four abstract meta-groups, based on the Vox system with some <a href=\"https://www.fonts.com/content/learning/fontology/level-1/type-anatomy/type-classifications\">additions from modern typeface design</a>, will help you to classify typefaces clearly enough.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/classification.jpg\" /></p>\n<p><strong>Note</strong>: <em>If you’d like to dig further, you may want to check <a href=\"http://www.designhistory.org/Type_milestones_pages/TypeClassifications.html\">other classification systems</a>.</em></p>\n<h3>Typeface Proportions</h3>\n<p>Typefaces fall under two headings: <strong>proportional</strong> or <strong>monospaced</strong>, according to the ratio of proportions within the font. </p>\n<p>Proportional types have varying widths of letters according to tradition, rules, and the ideas of their designers. </p>\n<p>Monospaced fonts, in contrast, comprise characters of equal width. Design of the glyphs in monospaced typeface may vary: wide characters, such as <strong>m</strong> or <strong>w</strong>, may have narrow proportions to fit the width. Such thin letters as <strong>i</strong> or <strong>l</strong> may have a lot of empty space around or long serifs to fill this space. In any case, the width of each letter, including its space around, will be equal.</p>\n<p>Proportional typefaces are natural and traditionally used for daily needs. <strong>Monospaced fonts are usually used in specific cases</strong> when it is essential to set text in accurate columns with each symbol below the other, such as tables with numerals, sales checks, programming code, and so on.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/comparison-proportional-monospaced-fonts.jpg\" /></p>\n<h3>Characteristics</h3>\n<p>An essential measurement we constantly work with is the size of a typeface or its <strong>x-height</strong>. It’s the height of the actual letter in lowercase from the baseline to the mean line that equals character x. <strong>Capital height</strong> refers to the size of uppercase letters. <strong>Small caps</strong> are the characters whose height is between lowercase and caps. They are a great instrument for particular cases. </p>\n<p><strong>Ascenders and descenders</strong> are the elements that go above the mean line and beyond the baseline. The long stem in <strong>h</strong> is an ascender, and the falling tail in <strong>y</strong> is a descender. </p>\n<p><strong>A counter</strong> is an enclosed space inside a letter. For example, in <strong>o’s</strong> or <strong>q’s,</strong> the white inner space is a counter. </p>\n<p><strong>Serifs</strong> are short strokes at the end of stems that differentiate Serif typefaces from Sans Serifs.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/visualized-font-parameters.jpg\" /></p>\n<p><strong>An aperture</strong> describes to what extent symbols are open. A large aperture means that such letters as <strong>c</strong> or <strong>s</strong> are open and have a lot of space between their strokes. When these symbols are tight and closed, the aperture is small. This characteristic specifies legibility: a large aperture helps distinguish similar letters in small sizes, such as <strong>c</strong> and <strong>o</strong>.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/aperture-examples.jpg\" /></p>\n<p><strong>Contrast</strong> is a difference between stroke thickness in vertical and horizontal stems.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/contrast-examples.jpg\" /></p>\n<p>These terms are basic but essential for understanding how the characteristics of a typeface affect its legibility. If you want to dig into this word, check out the <a href=\"https://www.monotype.com/resources/studio/typography-terms\">Monotype terms dictionary</a>.</p>\nStep 4: Define The Typeface’s Purpose\n<p>All typefaces may be divided into “display” (or “headline”) and “text” groups. However, there are existing cases when typeface works well both as text and display. (For more information, check “<a href=\"https://www.fonts.com/content/learning/fontology/level-1/type-anatomy/text-v-display\">Text v. Display</a>” and “<a href=\"https://www.fonts.com/content/learning/fontology/level-2/making-type-choices/selecting-display-type-getting-started\">Selecting Display Type: Getting Started</a>.”) Both these sides have their character and tone of voice, but they’re meant to be used in different contexts and situations. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/scale-typefaces.jpg\" /></p>\n<p><strong>Display fonts are better suited for headings, accents, and other cases for large font-size texts.</strong> They often have tighter spacing and sophisticated shapes that fade and may cause visual noise in small sizes. But it never hurts to consider the circumstances of use. Users might need more time to recognize a display font with complicated shapes, even in a large size. </p>\n<p>High contrast is also a font characteristic of the display role and long ascenders and descenders.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/differences-between-text-display-fonts.jpg\" /></p>\n<p>Alternatively, body text fonts have a simplified appearance and a high level of legibility in small sizes. <strong>When choosing a typeface for a body text, go for one with low or no contrast.</strong> In this case, high contrast will affect readability: thin strokes will cause visual vibration and negatively influence readability. Large aperture and open shapes are also a good choice as they help keep similar letters distinct, such as <strong>c</strong> and <strong>o</strong>. </p>\n<p>Different graphics in similar letters, such as <strong>i</strong>, <strong>l</strong>, and <strong>I</strong>, help perceive letters, especially without context (when used in tickers, codes, sets of symbols, and so on). Most text fonts have enlarged x-height and counters, a slight difference in heights between lowercase and caps, and short ascenders/descenders. Thus, it saves vertical space for lengthy texts and ensures their legibility.</p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/comparison-font-families-same-point-size.jpg\" /></p>\n<p>If you have plenty of data and need to save horizontal space, a font with compact proportions may be a suitable solution. But avoid overly narrow fonts and consider a font size because you might need to enlarge it a little and add positive tracking, i.e., increased letter spacing (for further information about tracking, don’t forget to check Part 2). </p>\n<p>Body text in a nice, readable font often needs strong visual accents in your design. You can approach this necessity by differentiating fonts depending on the type of information. For example, you may use Serif for headers and Sans-Serif for body text. The ultimate working solution, though, is to pick a single Font family because it has the same shapes and proportions. For example, IBM Plex has a variety of styles and supports several writing systems. </p>\n<p><img src=\"https://files.smashing.media/articles/choose-typefaces-fintech-products-guide-part1/ibm.jpg\" /></p>\n<p>A typeface name itself can tell you about its purpose. Terms “Text,” “Display,” “Compact,” and “Caption” in the font’s name will help you make the right choice. </p>\n<p>In my projects, I  usually use Sans-Serif fonts with low contrast for practical reasons. Sans Serif doesn’t have a bright appearance or small details. Consequently, it draws little attention to itself and reduces visual noise, making the text easier to read. As a result, the user quickly receives, understands, and processes information.</p>\nPrepare For Part 2!\n<p>This article reviewed the key points to consider when choosing typefaces. We also reviewed all font parameters and started investigating how to choose the most suitable font for various scenarios. </p>\n<p>The next part will be all about applying the fonts we chose. We’ll discuss how to work with texts and tables and what to pay attention to when handling special characters. </p>\n<p>Another major topic will be readability improvement through the length of text lines, line spacing, letter spacing, and tracking. </p>\n<p>We’ll also touch upon the topic of color contrast. It goes hand in hand with caring for users with all kinds of needs and work conditions. </p>\n<p>Stay tuned!</p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/06/measuring-performance-typefaces-users-part1/\">Measuring The Performance Of Typefaces For Users (Part 1)</a>,” Thomas Bohm</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/10/typographic-hierarchies/\">Typographic Hierarchies</a>,” Alma Hoffmann</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/12/fluid-typography-predict-problem-users-zoom-in/\">Fluid Typography: Predicting A Problem With Your User’s Zoom-In</a>,” Ruslan Yevych</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/08/designing-accessible-text-over-images-part1/\">Designing Accessible Text Over Images: Best Practices, Techniques, And Resources (Part 1)</a>,” Hannah Milan</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"dfea0c659813ef9fa9af72649a549451f8966cd45524c0ab6aa424c4bd2f2c40","category":"Tech"}