{"title":"A larger augmented-reality field of view improves interaction with nearby holographic objects","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311804","date":1729519200000,"content":"<p>by Eva M. Hoogendoorn, Daphne J. Geerse, Jip Helsloot, Bert Coolen, John F. Stins, Melvyn Roerdink</p>\r\n\r\nAugmented-reality (AR) applications have shown potential for assisting and modulating gait in health-related fields, like AR cueing of foot-placement locations in people with Parkinson’s disease. However, the size of the AR field of view (AR-FOV), which is smaller than one’s own FOV, might affect interaction with nearby floor-based holographic objects. The study’s primary objective was to evaluate the effect of AR-FOV size on the required head orientations for viewing and interacting with real-world and holographic floor-based objects during standstill and walking conditions. Secondary, we evaluated the effect of AR-FOV size on gait speed when interacting with real-world and holographic objects. Sixteen healthy middle-aged adults participated in two experiments wearing HoloLens 1 and 2 AR headsets that differ in AR-FOV size. To confirm participants’ perceived differences in AR-FOV size, we examined the head orientations required for viewing nearby and far objects from a standstill position (Experiment 1). In Experiment 2, we examined the effect of AR-FOV size on head orientations and gait speeds for negotiating 2D and 3D objects during walking. Less downward head orientation was required for looking at nearby holographic objects with HoloLens 2 than with HoloLens 1, as expected given differences in perceived AR-FOV size (Experiment 1). In Experiment 2, a greater downward head orientation was observed for interacting with holographic objects compared to real-world objects, but again less so for HoloLens 2 than HoloLens 1 along the line of progression. Participants walked slightly but significantly slower when interacting with holographic objects compared to real-world objects, without any differences between the HoloLenses. To conclude, the increased size of the AR-FOV did not affect gait speed, but resulted in more real-world-like head orientations for seeing and picking up task-relevant information when interacting with floor-based holographic objects, improving the potential efficacy of AR cueing applications.","author":"Eva M. Hoogendoorn","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dfed5a58a611237bb88ef0f527f99ddda7a5730e92894209ef48ceb8642f44f0","category":"Interdisciplinary"}