{"title":"macOS Monterey’s best feature is still MIA in the fifth beta","link":"https://www.macworld.com/article/353198/macos-monterey-universal-access-mia-beta.html","date":1628850600000,"content":"<div>\n<section><div></div></section><p>With the release of <a href=\"https://www.macworld.com/article/350094/macos-monterey-developer-beta-public-beta-install-access-utility-macs.html\">the fifth beta to developers and public testers</a> earlier this week, Apple is probably about halfway through the macOS Monterey testing cycle. Our resident Mac expert Roman Loyola describes it as stable, with many of the features operating just as they should.</p>\n\n\n\n<p>Except for the best one that is. Of all the features unveiled during the WWDC demo, the most intriguing was Universal Control, which lets you use your Mac’s keyboard and trackpad to control a nearby iPad. Had there been an audience during Craig Federighi’s demo there would have been oohs, aahs, and multiple applause breaks. It might have even earned a patented Steve Jobs “Boom!”</p>\n\n\n\n<p>But after five betas, we still haven’t seen any trace of Universal Control. While it appeared to be seamless and downright magical during in the keynote, the feature apparently isn’t even beta-ready despite being two months into testing. That doesn’t necessarily mean it won’t be included in the first release, but it’s not exactly reassuring.</p>\n\n\n\n<p>Universal Control looks like the best Mac feature in years. An extension of the Continuity and Handoff features that connect your iPhone and Mac, Universal Control transforms the relationship between the Mac and the iPad by turning the tablet into not just a second display like Sidecar but one that lets you point, drag, and drop as if it was part of the same screen. </p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-apple-monterey-universal-control-1.png?w=1200\" /><figcaption><p>Universal Control lets you use your Mac’s mouse and keyboard to control your iPad.</p></figcaption></figure></div>\n\n\n\n<p>You can drag files from an iPad Air onto your Mac’s desktop or from your MacBook into the Files app on your iPad while using the trackpad on your MacBook. It’s the kind of feature we didn’t actually know we needed but could end up being indispensable. </p>\n\n\n\n<p>You’ll need <a href=\"https://www.macworld.com/article/348192/macos-12-monterey-features-universal-control-shortcuts-safari-airplay-focus-compatibility-release-beta-how-to-install.html\">a relatively new Mac and iPad to use it</a>, but it could be a game-changer for the relationship between iOS and macOS. We’ve been waiting for years to see what Apple’s plan for the seeming inevitable merging of the two systems would be, and Universal Access seems like the first step toward that future.</p>\n\n\n\n<p>But we need to get it first. Thankfully, the feature still exists on the macOS Monterey site and hasn’t been updated with a “coming soon” tag, so we have no reason to believe that it would be delayed. But it wouldn’t be without precedent. Last year, Apple delayed its <a href=\"https://www.macworld.com/article/344420/app-tracking-transparency-privacy-ad-tracking-iphone-ipad-how-to-change-settings.html\">App Tracking Transparency privacy feature</a> in iOS 14, and <a href=\"https://www.macworld.com/article/234026/how-to-make-group-facetime-calls-on-the-iphone-ipad-or-mac.html\">Group FaceTime</a> didn’t arrive until iOS 12.1.</p>\n\n\n\n<p>For now, however, we’ll be waiting and hoping that Universal Access arrives in macOS Monterey beta 6. </p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"dff19b10b0a813c0f8ae8628af872bec602ba9000b54e2fda85f46c1dc466343","category":"Apple"}