{"title":"Considering Decoupled Phenotypic Diversification Between Ontogenetic Phases in Macroevolution: An Example Using Triggerfishes (Balistidae)","link":"https://academic.oup.com/sysbio/article/73/2/434/7630215?rss=1","date":1710460800000,"content":"<span><div>Abstract</div>Across the Tree of Life, most studies of phenotypic disparity and diversification have been restricted to adult organisms. However, many lineages have distinct ontogenetic phases that differ from their adult forms in morphology and ecology. Focusing disproportionately on the evolution of adult forms unnecessarily hinders our understanding of the pressures shaping evolution over time. Non-adult disparity patterns are particularly important to consider for coastal ray-finned fishes, which can have juvenile phases with distinct phenotypes. These juvenile forms are often associated with sheltered nursery environments, with phenotypic shifts between adults and juvenile stages that are readily apparent in locomotor morphology. Whether this ontogenetic variation in locomotor morphology reflects a decoupling of diversification dynamics between life stages remains unknown. Here we investigate the evolutionary dynamics of locomotor morphology between adult and juvenile triggerfishes. We integrate a time-calibrated phylogenetic framework with geometric morphometric approaches and measurement data of fin aspect ratio and incidence, and reveal a mismatch between morphospace occupancy, the evolution of morphological disparity, and the tempo of trait evolution between life stages. Collectively, our results illuminate how the heterogeneity of morpho-functional adaptations can decouple the mode and tempo of morphological diversification between ontogenetic stages.</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"dff5895bd20feca50b3420ac5461ff2bb74ae9a9561564b72cae48d9a52512ec","category":"Environment"}