{"title":"Mandiant, the security firm Google bought for $5.4 billion, gets its X account hacked","link":"https://arstechnica.com/?p=1993618","date":1704331934000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/doesnt-exist-800x780.jpg\" alt=\"Mandiant, the security firm Google bought for $5.4 billion, gets its X account hacked\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/doesnt-exist.jpg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google-owned security firm Mandiant spent several hours trying to regain control of its account on X (formerly known as Twitter) on Wednesday after an unknown scammer hijacked it and used it to spread a link that attempted to steal cryptocurrency from people who clicked on it.</p>\n<p>“We are aware of the incident impacting the Mandiant X account and are working to resolve the issue,” company officials wrote in a statement. “We've since regained control over the account and are currently working on restoring it.” The statement didn’t answer questions asking if the company had determined how the account was compromised.</p>\n<p>The hacked Mandiant account was initially used to masquerade as one belonging to Phantom, a company that offers a wallet for storing cryptocurrency. Posts on X encouraged people to visit a malicious website to see if their wallet was one of 250,000 that were eligible for an award of tokens. Over several hours, X employees played tug-of-war with the unknown scammer, with scam posts being removed only to reappear, according to people who followed the events.</p></div><p><a href=\"https://arstechnica.com/?p=1993618#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993618&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dff86ad0ba7a36cc436202f35b5ee304c1d7f48bd4bb60611f373494a05b414f","category":"Tech"}