{"title":"Hell freezes over, MS Paint adds support for layers and PNG transparency","link":"https://arstechnica.com/?p=1969084","date":1695065167000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Paint_Layers-800x502.jpeg\" alt=\"Layers in MS Paint! Cats and dogs living together! Mass hysteria!\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Paint_Layers.jpeg\">Enlarge</a> <span>/</span> Layers in MS Paint! Cats and dogs living together! Mass hysteria! (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The venerable, equally derided and beloved MS Paint app has been on a roll lately, picking up a major redesign, dark-mode support, better zoom controls, and other fit-and-finish updates all within the last couple of years. But today Microsoft announced that it is finally adding two features that could make the app a bit more useful for power users: support for Photoshop-esque image layers and the ability to open and save transparent PNGs.</p>\n<p>If you've never worked in an image editor other than Paint, layers give you the opportunity to decide which elements in an image appear above and below other elements. Say you're working on an image with a blue sky background, an airplane on top of it, and a cloud on top of the sky and the airplane. In an image program without support for layers, adding new elements to an image like this is always destructive—you lose the ability to see and edit the part of the sky that is covered by the plane and the cloud, and the part of the plane that is covered by the cloud. Layers also make it easier to reposition elements in an image, since all the elements you used to make the image are still fully intact.</p>\n\n<p>Support for creating, editing, and saving transparent PNG images goes hand in hand with support for layers, since it's useful to be able to pull a single object out of an existing image so you can put it in a new one. Transparent PNG support goes well with <a href=\"https://blogs.windows.com/windows-insider/2023/09/07/background-removal-in-paint-begins-rolling-out-to-windows-insiders/\">the automated background removal button</a> that Microsoft added to Paint builds earlier this month.</p></div><p><a href=\"https://arstechnica.com/?p=1969084#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969084&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dffc46a1a97379ce5582ff99e63f5ca1c574cc6c6f7e2f937e3933e847eae716","category":"Tech"}