{"title":"Therapeutic potentials of nonpeptidic V2R agonists for partial cNDI-causing V2R mutants","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303507","date":1715781600000,"content":"<p>by Ritsuki Kuramoto, Ryoji Kise, Mayu Kanno, Kouki Kawakami, Tatsuya Ikuta, Noriko Makita, Asuka Inoue</p>\r\n\r\nLoss-of-function mutations in the type 2 vasopressin receptor (V2R) are a major cause of congenital nephrogenic diabetes insipidus (cNDI). In the context of partial cNDI, the response to desmopressin (dDAVP) is partially, but not entirely, diminished. For those with the partial cNDI, restoration of V2R function would offer a prospective therapeutic approach. In this study, we revealed that OPC-51803 (OPC5) and its structurally related V2R agonists could functionally restore V2R mutants causing partial cNDI by inducing prolonged signal activation. The OPC5-related agonists exhibited functional selectivity by inducing signaling through the G<sub>s</sub>-cAMP pathway while not recruiting β-arrestin1/2. We found that six cNDI-related V2R partial mutants (V88<sup>2.53</sup>M, Y128<sup>3.41</sup>S, L161<sup>4.47</sup>P, T273<sup>6.37</sup>M, S329<sup>8.47</sup>R and S333<sup>8.51</sup>del) displayed varying degrees of plasma membrane expression levels and exhibited moderately impaired signaling function. Several OPC5-related agonists induced higher cAMP responses than AVP at V2R mutants after prolonged agonist stimulation, suggesting their potential effectiveness in compensating impaired V2R-mediated function. Furthermore, docking analysis revealed that the differential interaction of agonists with L312<sup>7.40</sup> caused altered coordination of TM7, potentially contributing to the functional selectivity of signaling. These findings suggest that nonpeptide V2R agonists could hold promise as potential drug candidates for addressing partial cNDI.","author":"Ritsuki Kuramoto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"dffdc14808b403b4da2aff5ab775675c7874c9b920e5a11e43c931a31031f96c","category":"Interdisciplinary"}