{"title":"Fallacy of attributing the U.S. firearm mortality epidemic to mental health","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0290138","date":1722866400000,"content":"<p>by Archie Bleyer, Stuart E. Siegel, Jaime Estrada, Charles R. Thomas Jr.</p>\r\nBackground <p>Annual global data on mental disorders prevalence and firearm death rates for 2000–2019, enables the U.S. to be compared with comparable counties for these metrics.</p> Methods <p>The Institute for Health Metrics and Evaluation (IHME) Global Health Burden data were used to compare the prevalence of mental disorders with overall, homicide and suicide firearm death rates including homicides and suicides, in high sociodemographic (SDI) countries.</p> Results <p>Overall and in none of the nine major categories of mental disorders did the U.S. have a statistically-significant higher rate than any of 40 other high SDI countries during 2019, the last year of available data. During the same year, the U.S. had a statistically-significant higher rate of all deaths, homicides, and suicides by firearm (all p&lt;&lt;0.001) than all other 40 high SDI countries. Suicides accounted for most of the firearm death rate differences between the U.S. and other high SDI countries, and yet the prevalence of mental health disorders associated with suicide were not significantly difference between the U.S. and other high SDI countries.</p> Conclusion <p>Mental disorder prevalence in the U.S. is similar in all major categories to its 40 comparable sociodemographic countries, including mental health disorders primarily associated with suicide. It cannot therefore explain the country’s strikingly higher firearm death rate, including suicide. Reducing firearm prevalence, which is correlated with the country’s firearm death rate, is a logical solution that has been applied by other countries.</p>","author":"Archie Bleyer","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e002f8b9df27a9425a6ec32e5121c48687773f00c9af2eb66bc535a8fbd24543","category":"Interdisciplinary"}