{"title":"The Impact of Virtual Reality as a Rehabilitation Method using TRAVEE system on Functional Outcomes, and Disability in Stroke Patients: A Pilot Study","link":"https://www.preprints.org/manuscript/202409.2100/v1","date":1727340795000,"content":"Background: Stroke is the third leading cause of disability, primarily due to motor, sensory, and cognitive impairments. Virtual reality (VR) has shown promising results in post-stroke rehabilita-tion, particularly for upper limb recovery. The World Health Organization Disability Assessment Schedule 2.0 (WHODAS 2.0), aligned with the International Classification of Functioning, Disa-bility, and Health (ICF) principles, is a valid tool for measuring disability regardless of its cause. This study aimed to investigate the feasibility of VR TRAVEE system in upper limb rehabilitation for stroke patients. Methods: 14 stroke patients with residual hemiparesis were enrolled in the study. They underwent a 10-day program combining conventional therapy (CnvT) with VR rehabilitation. At baseline (T0), upper limb was assessed using the Modified Ashworth Scale (MAS), Active Range of Motion (AROM), and the Numeric Rating Scale (NRS) for pain. These assessments were repeated after the 10-day rehabilitation program (T1). Additionally, disability was measured using WHODAS 2.0 at T0 and again 30 days after completing the program. Results: Significant im-provements were observed in AROM, MAS scores for the shoulder, elbow, wrist, and metacar-pophalangeal joints as well as in the reduction of shoulder pain (p˂0.001). WHODAS scores de-creased across all six domains, with a statistically significant improvement in the cognition domain (p=0.011). Conclusions: Combining CnvT with VR as a rehabilitation approach enhances motor function in the upper limb. This method has the potential to reduce disability scores and promote neuroplasticity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e0066f86e8243548162ab0d19ef04bffe4bb35eabdfe730a2c85fe607301612a","category":"Interdisciplinary"}