{"title":"Towards an In-depth Evaluation of the Performance, Suitability and Plausibility of Few-Shot Meta Transfer Learning on An Unknown Out-of-Distribution Cyber-attack Detection","link":"https://www.preprints.org/manuscript/202409.0787/v1","date":1725970833000,"content":"The emergence of few-shot learning as a potential approach to address the problem of data scarcity by learning underlying pattern from a few training sample had so far given a mix-result especially on the suitability of model-agnostic meta learning, transfer learning, and optimization strategy to rapidly learn valid information from few sample. In this research, we did an in-depth evaluation of meta- learning to determine their plausibility and suitability for previously unknown cyberattack detection by first retrieving the original research artifacts of current state of the art meta learning to repeat the experiment with original dataset before replicating the experiment with two different malware dataset which had not been previously done with meta-transfer learning. On each of the experiments, meta-transfer learning gave good results on digital character recognition dataset but abysmal result on Malimg and Malevis malware images datasets thereby indicating its unreliability for detecting cyberattacks and the need for an improvement to the state-of-the-art meta transfer learning towards a better attack detection. Transfer learning performance is independent on imbalance and hence does not influence its performance since both malware dataset used for this experiment result in high validation loss and balancing the dataset doesn't result in reduced validation loss,the successful learning transfer seen on digital character recognition dataset is not unconnected to the fact that several languages have similar characters and digits thereby enhancing the successful learning transfer unlike malware datasets, and more importantly the finding that current meta-learning transfer approach doesn't generalize well on malware dataset and hence not suitable for detecting previously unseen out-of-distribution attack.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e0081a2c8f5c00fb74f5547c8b21f2e7ba51e194557bd0688574a059820f45c3","category":"Interdisciplinary"}