{"title":"Lightweight’s entry into gravel wheels is a lightweight proposition","link":"https://cyclingtips.com/2021/09/lightweight-pfadfinder-evo-gravel-wheels/","date":1631840856000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Lightweight-Pfadfinder-Evo-gravel-wheels-650x366.jpg\" /></div><h2>Lightweight’s entry into gravel wheels is a lightweight proposition</h2><p>\n</p><p>The gravel market continues to be a bright spark of cycling industry enthusiasm and growth – so much so that we’re even seeing the most traditional of performance road brands enter the fray. </p>\n\n\n\n<p>Not all of them seem to wholly understand what ‘gravel’ is, however. For today’s case study, let’s take a look at Lightweight’s entry into the gravel market. </p>\n\n\n\n<p>The company has just released the Pfadfinder Evo, a newly-named wheelset that appears to take the place of the very similar <a href=\"https://r2-bike.com/LIGHTWEIGHT-Wheelset-28-Wegweiser-EVO-Disc-Clincher\" target=\"_blank\">Wegweiser EVO Disc</a>. Here, the ‘new’ Pfadfinder Evo offers Lightweight’s bonded and wholly carbon fibre construction that no doubt retains the direct and stiff handling that Lightweight wheels are known for. In fact, with 20 bonded spokes front and rear, Lightweight actually suggests there is <em>more</em> stiffness to be had. </p>\n\n\n\n<p>Whether you actually want that on rough terrain is a question only you can answer. </p>\n\n\n\n<p>Lightweight also states that its new 36 mm-depth gravel wheels feature a revised lay-up for significantly increased robustness. And they’ve kept with using DT Swiss’ Star Ratchet mechanism for proven hub durability and easy compatibility across all popular drivetrain systems. Good, good.</p>\n\n\n\n<p>However, it’s in the fine details where the sales proposition becomes less of a home run. Lightweight quotes a 24 mm rim width that’s suitable for up to 40 mm tyres, but that’s actually the external rim width. Internally you’ll find a mere 18.2 mm separating the two hooked rim sidewalls – a width that’s perfectly suitable for use with a 23 mm tyre. On gravel wheels. </p>\n\n\n\n<p>And then there’s the fact that these undoubtedly rigid-riding Lightweight hoops aren’t actually all that lightweight. The claimed weight for a pair is 1,430 grams. For comparison, that’s 20 grams more than a US$1,600 pair of <a href=\"https://cyclingtips.com/2021/05/roval-expands-terra-gravel-range-with-affordable-cl-and-c-carbon-wheels/\" target=\"_blank\">Roval Terra CL wheels</a> – a wheel that features a comparable depth rim, a bonus 6.8 mm between the rim hooks, and the same freehub mechanism. </p>\n\n\n\n<p>An 18.2 mm wheel which talks up its stiffness feels pretty out of place for the gravel market. And that’s even before you consider that the Pfadfinder Evo, being a Lightweight product, seems certain to come with a heavyweight price tag (which, for reasons unknown, hasn’t yet been announced). </p>\n\n\n\n<p>All in all, it seems pretty clear that Lightweight’s approach to gravel differs from many others in the industry. In reality, the <a href=\"https://lightweight.info/en/wheels/pfadfinder-evo\" target=\"_blank\">Pfadfinder Evo</a> is a high-end, cool-looking, and performance focussed All-Road wheel that will please those who desire a price-no-object ‘gravel’ bike to keep on the road. </p>\n\n\n\n<p>Either way, it’s a no from me. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/lightweight-pfadfinder-evo-gravel-wheels/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e00efa5983128b2361e5021e58491a5f4416fe2bed350f1ce6346a20e808869c","category":"Cycling"}