{"title":"Exploring the role of HPV: from Sexually transmitted infection to Oropharyngeal Cancers","link":"https://www.preprints.org/manuscript/202403.1092/v1","date":1710831920000,"content":"Human papillomavirus (HPV) is one the most common sexually transmitted infections (STI), spreading through direct sexual contact to oropharynx and anogenital regions. Although most infected individuals may be asymptomatic and naturally undergo viral clearance, in some individuals’ HPV infection causes carcinogenesis of the infected epithelia. HPV now accounts for over 70% of oropharyngeal carcinomas (OPC). Over 90% of these OPC are associated with HPV 16, one of the 14 high-risk subtypes. In recent years, HPV positive (HPV+) OPC has been one of the most rapidly rising cancers, by new cancer incidence rates, especially among men. They present some unique infection driven cellular and molecular features, in comparison to other head and neck carcinomas (HNC), constituting distinct preventive, therapeutic and prognostic strategies - with significant strides made in this area. However, HPV+OPC are routinely detected at a later stage, adding to the disease burden and overall survival. In this review, we provide a summary of HPV from a STI to malignant transformation, while also parsing through the immune response environment. We further collate key literature around infection sites, diagnostics and clinical management, while throwing light on the current state of epidemiology, transmission, screening and prevention strategies. Indeed, our improving understanding of the disease’s molecular biology has added some success to the prognostic outcomes of certain HPV+OPC across clinical trials examining targeted therapeutics and immunotherapy. This work is directed towards improving our current understanding of HPV and associated oncogenic landscape, to guide screening, early detection, triaging and further prevention and management strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e01c059d2a7712e6f7851d354c3005a58461fe58fe33e9b4706f3ceac633364f","category":"Interdisciplinary"}