{"title":"Poly‐γ‐glutamic acid enhanced the yield and photosynthesis of soybeans by adjusting soil aggregates and water distribution","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13520?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Poly-<i>γ</i>-glutamic acid (<i>γ</i>-PGA) is employed extensively in agriculture to enhance soil water retention; however, the underlying mechanism by which <i>γ</i>-PGA improves soil structure and soybean productivity in arid regions remains poorly understood. A micro-scale field experiment was conducted in the arid region of northwest China, employing five concentrations of <i>γ</i>-PGA to investigate its impacts on soybean yield, photosynthesis, and water-use efficiency, as well as soil aggregates and water distribution. The five levels of <i>γ</i>-PGA were 0 (CK), 10 (P1), 20 (P2), 40 (P3), and 80 kg ha<sup>−1</sup> (P4).</p>\n<h2>RESULTS</h2>\n<p>The results demonstrated that the application of <i>γ</i>-PGA significantly improved soybean yield, photosynthesis, and chlorophyll content. It resulted in a decrease in soil aggregate content with a maximum diameter of less than 0.053 mm and an increase in the stability of soil aggregates in the uppermost layer of the soil (0–30 cm). The application of <i>γ</i>-PGA significantly increased soil water content, particularly in the uppermost layer of the soil, and effectively reduced water consumption and improving water use efficiency in soybeans. Overall, the P3 treatment exhibited the most pronounced improvement of soybean yield, photosynthesis, water-use efficiency, as well as distribution of soil aggregates and water. The correlation matrix heatmap also revealed a strong correlation between improvement of soybean yield or photosynthesis at various <i>γ</i>-PGA application levels and the enhancement of soil stability or soil water content.</p>\n<h2>CONCLUSION</h2>\n<p>The multivariate regression analysis revealed that an optimal application level of 46 kg ha<sup>−1</sup>\n<i>γ</i>-PGA could enhance effectively both yield and water use efficiency of soybean in the arid region of northwest China. © 2024 Society of Chemical Industry.</p>","author":"Bo Jing, \nWenjuan Shi, \nYing Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e031a66e6b33b2c6c0b0df9ebe9ef0c52a8cda60adc21267d5d0aa0eb06a904c","category":"Environment"}