{"title":"If the MacBook Pro’s notch is in the way, you can hide it","link":"https://www.macworld.com/article/546104/how-to-macbook-pro-macos-monterey-block-notch-menu-bar.html","date":1635423600000,"content":"<div>\n<section><div></div></section><p>With the <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-price-release.html\">14- and 16-inch MacBook Pro</a>, Apple took a note from the iPhone and added a notch at the top of the display that houses the FaceTime camera. Also like the iPhone, Apple decided to fill the space around the notch with the menu bar.</p>\n\n\n\n<p><strong>Update 10/28:</strong> <em>Apple has posted an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212842&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">official support document</a> regarding the notch.</em></p>\n\n\n\n<p>For most people, it won’t be an issue. Unless you’re the kind of person who uses a lot of menu bar icons or runs their screen at a larger resolution, menu bar items will simply occupy the space to the right of the notch, and menu items will stick to the left. However, since the macOS menu bar is much more customizable and versatile than the iPhone’s status bar, some apps with lengthy menus could cause issues, as evidenced by a viral tweet that made the rounds this week:</p>\n\n\n\n<figure><div>\n<blockquote><p>WHO DESIGNED THIS?! 😂 <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/ADVqmfdqV2&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/ADVqmfdqV2</a></p>— Quinn Nelson (@SnazzyQ) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/SnazzyQ/status/1453143798251339778?ref_src=twsrc%5Etfw&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">October 26, 2021</a></blockquote></div></figure><p>In its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/design/human-interface-guidelines/macos/menus/menu-anatomy/#menu-and-menu-item-titles&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">Human Interface Guidelines</a>, Apple is urging developers to make menus less of an issue with the notch by favoring “short, one-word menu titles.” As Apple explains, “A short, single-word app name (and) … one-word menu titles work especially well in the menu bar because they take little space and are easy for people to scan.” </p>\n\n\n\n<p>Additionally, the funky menu bar extra behavior in the tweet will also hopefully be fixed. Apple is encouraging “exposing app-specific functionality in other ways” such as the Dock. It’ll take time and there will be some pushback, but over the course of the next several months, jumping menus and obscured menu bar extras should become less of an issue. </p>\n\n\n\n<p>In the meantime, Apple has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212842&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">provided a fix of sorts</a>. When you’re in full-screen mode, you have the option to display the menu bar <em>under</em> the notch with a black strip around the notch. This is handy if the app you’re using isn’t displaying the menu properly while in full-screen mode but you’ll lose some screen real estate.</p>\n\n\n\n<p>To activate this, click on an app’s icon in the Finder and Get Info on it (Command+I on your keyboard, or go to <em>File</em> &gt; <em>Get Info</em>). If it’s available, you’ll find an option in the General section to “Scale to fit below built-in camera.” Check that box, close <em>Get Info</em>, and then when you launch the app and go into full-screen mode, the menu bar will be positioned under the notch.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/macos-monterey-get-info-scale-to-fit.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Get Info on an app to turn on the “Scale to fit below built-in camera” option.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>According to Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/documentation/bundleresources/information_property_list/nsprefersdisplaysafeareacompatibilitymode&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">Developer Documentation for User Interface</a>, this setting shows up if a developer doesn’t write their software to switch on its own. If a developer decides to write their software to use the mode they deem best for their app, the option is not available. Some of the apps that we found with this option so far include Final Cut Pro, Logic Pro, Xcode, iMovie, GarageBand, the iWork apps, Adobe Premiere Pro 2021, Affinity Photo, Civilization VI, Cisco Webex Meetings, Spitfire Audio, and Cinema 4D. It’s entirely possible that those apps and others will be updated by their developers to use a preferred mode.</p>\n\n\n\n<p>As noted in our <a href=\"https://www.macworld.com/article/546363/14-inch-macbook-pro-m1-pro-review.html\">full review of the 14-inch M1 Pro MacBook Pro</a>, the notch doesn’t technically infringe on the MacBook Pro’s screen area. The screen below the notch is a 16-by-10 space like before, and the notch and screen on each side of it are “extra” space. When the menu bar is placed in that notch area, it’s actually giving you more room to work with than the previous MacBook Pro displays.</p>\n\n\n\n<p>In case you’re wondering, this option is not available for the macOS Monterey Finder, which is basically an app that runs in full-screen mode all the time. So you can’t block out the notch by default, at least for now.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mbp-camera-notch.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Top: By default, the menu bar runs through the notch. If menu listings run into the notch, the menus continue after the gap. <span>Bottom: WIth “Scale to fit below built-in camera” the menu bar is below the notch.</span><span> </span>(Note: iMovie in this photo is in full-screen mode. Also, the camera has been enhanced to make it more visible.)</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>As far as menu bar extras, Apple will only allow them to fill the right side of the notch, and will only show what can fit. So if you use numerous extras, some might go missing: “When menu bar space is constrained, the system prioritizes the display of menu bar menus, as well as essential menu bar extras, such as Clock. To ensure that menus remain readable, the system may decrease the space between the titles, truncating them if necessary.”</p>\n\n\n\n<p>There are also <a href=\"https://www.macworld.com/article/548163/macbook-pro-black-out-notch-apps-utilities.html\">utilities that will remove the notch</a>, such as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://topnotch.app&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">Top Notch</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://goodsnooze.gumroad.com/l/nASbe&amp;xcust=1-1-546104-1-0-0&amp;sref=https://www.macworld.com/feed\">Forehead</a>. We’re sure there will be many others to come.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e036e7f5b9d9e1efa6003fb13f25a5e4d4e8a571db79dd60f47200395a66f7f1","category":"Apple"}