{"title":"Smashing Podcast Episode 65 With Alex Older: How Do You Run A Grassroots Conference?","link":"https://smashingmagazine.com/2023/09/smashing-podcast-episode-65/","date":1695715200000,"content":"<p>We’re talking about running grassroots conferences and meet-ups. What does it take to organize a small industry event for your community? Drew McLellan talks to WDC’s Alex Older to find out.</p>\n<p><strong>Note</strong>: <em>This episode of The Smashing Podcast isn’t sponsored by anyone. However, our guest Alex has generously offered listeners a **</em>10% discount on tickets to WebDevConf<em>**. So if you’re in or able to get to Bristol for the conference go to <a href=\"http://webdevconf.com/\">webdevconf.com</a> for tickets and use the code <code>smashing</code> to claim your discount. Thanks Alex!</em></p>\n\n\n<h3>Show Notes</h3>\n<ul>\n<li>Alex Older’s <a href=\"https://alexolder.com/\">website</a>.</li>\n<li>Save the date for <a href=\"https://webdevconf.com/\">WDC2023</a>: 20 October in Bristol, UK.</li>\n</ul>\n<h4>Weekly Update</h4>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2023/09/gradients-blend-modes-hover-effect/\">Gradients, Blend Modes, And A Really Cool Hover Effect</a> <em>written by Preethi Sam</em></li>\n<li><a href=\"https://www.smashingmagazine.com/2023/09/facilitating-inclusive-online-workshops-part1/\">Facilitating Inclusive Online Workshops</a> <em>written by Ben Shih</em></li>\n<li><a href=\"https://www.smashingmagazine.com/2023/09/revealing-images-css-mask-animations/\">Revealing Images With CSS Mask Animations</a> <em>written by Temani Afif</em></li>\n<li><a href=\"https://www.smashingmagazine.com/2023/09/smashing-magazine-tinacms-manage-editorial-workflow/\">How Smashing Magazine Uses TinaCMS To Manage An Editorial Workflow</a> <em>written by Geoff Graham</em></li>\n<li><a href=\"https://www.smashingmagazine.com/2023/09/path-css-easing-linear-function/\">The Path To Awesome CSS Easing With The linear Function</a> <em>written by Jhey Tompkins</em></li>\n</ul>\n<h3>Transcript</h3>\n<p></p><p><a href=\"https://alexolder.com/\"><img src=\"https://files.smashing.media/articles/smashing-podcast-episode-65/alex-older.jpg\" /></a> Drew: He’s a full stack developer and founder of development agency Bluefly Digital here in the UK. He’s also the founder and core organizer of the UK’s longest running web design conference, WDC, which is now entering its 14th year, all of which makes him the perfect candidate for our discussion today. So we know he’s an accomplished developer, business owner, and conference organizer, but did you know he invented the pork jam roly-poly? My smashing friends, please welcome Alex Older. Hi, Alex. How are you?</p>\n<p>Alex Older: Hi, Drew. I’m good. I’m smashing.</p>\n<p>Drew: Good to hear it. Congratulations on what’s about to be the 14th year of WDC...</p>\n<p>Alex: [inaudible] facts are wrong there.</p>\n<p>Drew: My facts are wrong? Oh...</p>\n<p>Alex: So it might be the 14th event, but it’s been running since 2007.</p>\n<p>Drew: Okay. So the 14th edition, is what we should be saying, the 14th edition of WDC.</p>\n<p>Alex: Yeah. Absolutely.</p>\n<p>Drew: Okay. My introduction and everything is incorrect due to my poor research, but I think we’ll get away with it. But your 14th edition this October.</p>\n<p>Alex: Yes.</p>\n<p>Drew: For those who don’t know, it’s a very much... It’s a local feeling event, even though actually its reach is felt across the region and across the UK. Correct me if I’m wrong here, you have a day of workshops, and then a conference day, or have done in the past?</p>\n<p>Alex: We have done in the past. What I’ve found is that, whilst it’s great to do workshops, is that it can be quite hard to find subjects that are appealing to a lot of people. I’ve seen it work for events and conferences that are very focused in one area. So if it’s a WordPress conference or a design systems conference or something like that, because they’re focusing on one area, a workshop relating to that works a lot better than stuff for WDC, because it’s very general.</p>\n<p>Drew: Yeah. It’s a broad subject area, isn’t it? So finding enough people who want to focus down on a small bit for a workshop is trickier.</p>\n<p>Alex: Yes.</p>\n<p>Drew: Yeah. That makes sense. I remember a few years back, I attended one of your workshops, I think it was a node workshop with Jack Franklin, which was great. I learned a lot that day. That was brilliant. These days you’re sticking to just the main conference day?</p>\n<p>Alex: Yeah. So last year because of various things, we hadn’t done an event for a few years, so we decided to come back with a bang and do two days, which was nice because it meant we could get lots of people to come and speak for it, and it drew a slightly different crowd as well, which was quite nice. But the organizing headache of it all, I was like, \"No, I’m just going to do one day.\" It’s a lot nicer just to manage one day with eight speakers than it is to try and manage two days with 16 speakers, because it doubles all the worry.</p>\n<p>Drew: Yes. So what was it that spurred you to start this in the first place? Where did the idea come from?</p>\n<p>Alex: So I started... This is where I realized how old I am. So I started uni in 2006, and Joe Leach came in one of our induction days, and gave a talk about what the world of the web is, and what it does, and all this, that, and the other. And a couple of friends of mine were talking to me afterwards, \"But I don’t understand what this is or that is.\" And so the idea from there also came about that we were learning command line Java.</p>\n<p>Drew: Okay. My condolences.</p>\n<p>Alex: Yes. And the university I was at was there going, \"You need to learn this module, because if we go to this job site and put in this web development without Java, the results disappear. You get a third of the results.\" So a lot of it was trying to show my fellow students that what people are doing in the web isn’t necessarily what’s being taught, and showing that actually the web technologies that are out there aren’t necessarily what we’re learning in a classroom or in a lecture. And also trying to get rid of the idea of buzzwords as well. So it started off as an event to get professionals in to speak to students, and then go, \"As we’re in Bristol, if you’re in the area and want to come to the event, come to the event.\" So that’s how it started, and it’s just grown from there as I went through uni.</p>\n<p>Drew: That’s amazing. When I think about everything that’s involved in running an event like a conference, it must be like finding venues, finding speakers, finding an audience, it’s overwhelming. As someone personally, I’ve had a bit of a long-running community side project, I’m thinking of the website I used to run, 24 ways, and I just know that organizing something like that year after year, it really takes it out of you. I can’t imagine if it was then a physical event, like a web conference. So what is it that keeps you coming back year after year and doing it again to yourself?</p>\n<p>Alex: It might sound really bad, but it’s effectively... One of the reasons I keep doing it is because it gives me a chance to go to a conference, with life and family and everything else. You don’t get as much time as you think you might to go to all these things and fly around and go to events. So it’s a chance for me to see people I’ve heard of talking about something they love doing, and gets me out of the house for at least a couple of days. So it was there, kept going because I want to do an event, and it just benefits me that I don’t have to pay for a ticket, as it were. And then I just have to stand up in front of people and make a fool of myself, very briefly.</p>\n<p>Drew: But you get to put on your dream event as much as possible. You can tailor it to you.</p>\n<p>Alex: Yes, exactly. And it’s not an event we take far too seriously. And I’ve been fortunate enough with venues that we’ve always, aside from a small test of another venue, we’ve always been at the same venue. And it’s in a really good location in the center of Bristol. And it just means that if people are coming in, it’s quite easy for them to go, \"That’s where the venue is, and there are 20 hotels around it. So I can come into Bristol, I can stay in Bristol, and walk to the event, and it’s all good.\"</p>\n<p>Drew: So talking about practicalities then, when you’re thinking about organizing another addition of this, you say you’ve got your preferred venue. So what comes first? Finding a date? Or...</p>\n<p>Alex: Yes. So over 14 events, we’ve... It used to be that it was organized early September, because the unis would start then, and it would then mean that I could speak to the union and go, \"This is when the event is.\" It would mean that they can tie it into stuff that they’re doing. And since then, it’s migrated to October, and it’s always been the first Friday in October, except for this year because we’ve had to push it back for other reasons. But we go, \"This is the date...\" It’s always October now. And then from that, I know the venue’s there, the venue hasn’t gone up in flames, it’s quite established, and it’s... Because it’s at the Watershed, so it’s quite an established venue in Bristol. And so I know that’s sorted, I know roughly when it is, and then it’s just working back from then to make sure that things are launched with enough time to make sales to cover the bills.</p>\n<p>Drew: So how do you decide on the lineup? So you’ve got your dates sorted, you’ve got the event booked. How do you decide what’s going to happen on stage on that day?</p>\n<p>Alex: So I think I’ve been very fortunate, and I’ve lucked into a lot of it. So I’ve gone, \"I really want to see Drew speak,\" so I’ll invite you along, and you’ll tell me what you’re speaking about. And then I’ll go, \"I want to see someone else,\" and I’ll invite them along. Over the last few years I’ve teamed up with Luke to put the event on. So because of his role, he’s got a lot more contacts that I maybe wouldn’t have come across. And so it’s going, I really like what this person’s tweeting about or blogging about, and I’ve read this article, and they happen to be based in Leeds or Manchester, and I’ll invite them down. And I’ve been really lucky in that, over the years, the theme of the day has echoed through every talk.\nAnd I even had, at one point I had Paul Boag speaking, and he panicked a bit, he was like, \"But my talk is really similar to the talk that was on now.\" And it was like, he was speaking to me, there was a talk between the one he was going on about and his, and he was worried that his would basically be sounding the same. And I said to him, \"It doesn’t matter. What your talk does will tie everything together at the end of the day.\" And it worked really well. So I’ve been really lucky, in that there’s been a theme that’s worked with a spattering of other bits and pieces in the middle.</p>\n<p>Drew: Yeah. It’s funny how that can happen, because there’s often themes running through the industry at a certain time. Everybody’s thinking about the next ideas, and often they are interconnected, because the web as an industry is moving forward towards the same sort of places. I can remember a similar situation speaking at a conference, where the talk that came directly before mine covered about, I don’t know, about 25% of the same stuff that I was about to go over. And so I had to get on stage and I’d say things like, \"I hope you’re seeing a theme here. You’re seeing what we’re trying between us, what we’re trying to say,\" and make it sound intentional. And of course it wasn’t a problem. It was reinforcing the ideas. It was actually saying, \"Here’s the important ideas that we’re all thinking about at the moment.\"</p>\n<p>Alex: Yeah, exactly. And I think it helps attendees as well almost see that these people are up in front of them saying these things, and it’s not just one person saying these things, it’s four or five, and they’re not necessarily saying it in... It’s not a pulled quote that they’re going over and over again. They’re saying it in their way and how it applies to them and what they’re doing.</p>\n<p>Drew: Yeah. It reinforces the point and gives different perspectives on it as well at the same time. So at this point, we’ve got a venue, we’ve got a date, you’ve invited some people to speak, they’re working away on their presentations and looking forward to visiting Bristol. How do you go about getting the word out? How do you sell tickets? How do you find an audience and let people know?</p>\n<p>Alex: I cross my fingers, and... So I think my biggest thing is I’m not that social, as it were, and what I do is I hope that the speakers who are coming to the event will go, \"I’m speaking at this event, here it is.\" I’ve got an adequate Twitter following for the conference. And what I also do is, before tickets are launched, I’ll say, \"Look, register your interest. We’ll tell you as soon as you can get a ticket,\" and stuff like this. And I’m really thankful that there’s a kind of almost core community around the event that will go, \"Yep, I’m coming, I’ve bought my ticket, it’s there, I’ll be there.\"\nAnd slowly but surely word spreads out to different areas of the country as people... Some people would take a chance in it and go, \"I had a really great time.\" And then many years ago, it used to be the thing that people would write up their experiences and do a review, and for a while you could see the referrals coming in through analytics and stuff and going, \"Okay.\" And so it’s grown word of mouth more than, I need to make sure I’m speaking to this publisher or this site or whoever to mention my event.</p>\n<p>Drew: Sorry, I’ve noticed that your ticket prices are incredibly low for a full-day conference. So it’s, what, the full price is...</p>\n<p>Alex: The full price this year is going to be £100.</p>\n<p>Drew: £100. Which is great value. And I guess that enables people to take a bit of a punt on... If it’s not going to cost them too much to get to Bristol, and they’ve heard good things, 100 quid, actually that’s exceptional value.</p>\n<p>Alex: Yeah, exactly. The idea is that it... The theory being is that, if you’re missing a day of work and you’re a freelancer, you don’t get paid for that day of work. So the idea being that the whole trip to Bristol, staying in Bristol, coming to the event, shouldn’t cost more than a day of work. And the whole idea of the ticket price is that it covers the event cost. I don’t sit there and go, \"I need to charge 250 quid a ticket to make X amount at the end of the event once all the bills are settled.\" I need to be at zero once all the bills are settled, so that it can keep funding itself every year.\nAnd I’ve been unfortunate a few times where it’s lost money, but over 14 events, it’s happened twice. So being able to sit there and go, I know... People will then know and come to expect that the cost of the ticket is reasonable, and I’m not suddenly sitting there going, \"Yeah, now I’ve got 100,000 Twitter followers, I’m going to charge this much money because it’ll make it.\" I’m going to keep doing what I’m doing, because it gives even the smaller freelancers the chance to attend an event that isn’t out of a price range.</p>\n<p>Drew: And do you find, as a result, your audience is primarily freelancers and primarily people who are paying their own way for their ticket? Sounds like that’s the sort of...</p>\n<p>Alex: I think these days now it’s more of a 50/50 split, because being able to see the way... Because I use Tito for the ticket sales, is that I can see how tickets are ordered. And there are lots of freelance, but then you’ll get an order for five, ten tickets from one company. There are definitely companies out there that are buying tickets for their employees to attend the event, but there are freelancers as well. And it makes quite a nice mix, because we’ve even had partnerships with companies in the past who are recruiting. So there might be freelancers who are like, \"I’ve been doing this for a couple of years and it’s all right, but I’ve met these guys at WDC, and I had a chat with them, and they’ve got a job, and I might apply for it.\" So hopefully the idea [inaudible] the networking side [inaudible] event leads to that, and the split in ticket sales between freelancers and companies and bits and pieces like that spurs that on, I think.</p>\n<p>Drew: Yes. And I think it’s in contrast to what we’ve seen from a lot of the... Because going back ten years, there were a lot more conferences, single-day conferences at affordable prices that were going on in the UK. And we had Carsonified back in the day running their events, Future Of... We used to have things from Clearleft, dConstruct, and... What’s the typography one called? Ampersand.\nAnd some of those people are still running conferences, Clearleft are still running conferences, but what we’ve seen from them is they’ve gone very upmarket, where a ticket will cost over £1,000 or... And I very much suspect their audience are people who are not paying their own way, that their company has sent them, or it’s a significant business purchase, not an individual thinking, \"I’ll just go and learn about this thing.\" So it’s interesting that most of the UK market of what’s left of conferences has tended to go up higher-end. Is there something about putting conferences on in the UK that makes it really hard, that you’ve got to charge a lot of money? Or... I’m just wondering if you have any insight what goes on there.</p>\n<p>Alex: I don’t think so. I think a lot of it is that the more higher-end conferences seem to be in London, and from that, the venue’s going to cost an extortionate amount of money. And then you’ve got to get... Especially depending on who your target is, you’ve got to have the right names of people in the industry at that event, which will then be charging their fee, which will be relevant to their experience, and so on and so forth. Whereas outside of London, a venue hire doesn’t cost a huge amount of money, hotel costs don’t cost a huge amount of money, and everything else.\nBut I think that the target for those upscale events, as you say, is our big organizations who have maybe heard of a keyword that happens to be relevant and gone, \"We must put some resource into this, and we’ve got our spending for the year, and if we don’t spend it, we lose it.\" Drew, you’ll go into that event and you might go, \"Oh, great,\" and then you realize that maybe two or three of the talks are relevant to what you’re doing, and not all of it. And I think that there’s obviously a place for them, but outside of that, the costs of everything are a lot less.\nAnd for me, it’s not just about putting on the event, it’s about being able to put on all the bits around it, and make more of a community effort to it, and have a community around the event, than it is to go, \"I’ve put on this massive event, and we’ve got eight great speakers, it’s going to cost you two grand for a ticket.\" But you’ll go to the day, you’ll leave, and that’ll be it, because you’re probably London-based, so you’ve gone home.</p>\n<p>Drew: Yeah. Yes. It’s amazing the different feel that a more community-based conference like WDC has, than some of the more upmarket and therefore a little bit more corporate events have. And I think you’re right about... Because you mentioned briefly about the ability to network and things, and if you are a freelancer, a community event like this is a great opportunity to get to meet other people, meet potential customers, but also potential collaborators or contacts. And as a freelancer, it’s always useful to know other people with different specialisms who you might want to bring into a project, and it’s a great opportunity to make those connections and meet people. Once you’re advertising your tickets, they’re on sale, you’ve got your fingers crossed, hoping that people buy tickets, I guess you’ve got quite a lot on the line at that point. You’ve committed to a whole load of costs. How do you cope with that? Does it keep you up at night?</p>\n<p>Alex: No, because [inaudible] this year’s a bit different to the norm, because normally... So with an event in October, we launched late spring, so April, May sort of time. And then the first thing... If I’ve got that gap between launching the site for the year and the event, what I’ll do, the first thing that I do is I’ll go, \"Let me get in 50 ticket sales.\" So I’ll do what I’ve called in the past a super early bird ticket. I get those ticket sales in, and I know that I’ve got... I believe normally I’ve got the cost of the venue and half the hotel cost covered at that point. And they’re normally on sale for two weeks or until they sell out.\nSo I sit there and try and make a deal about the fact that there’s only 50 of them, and once and they’re gone. And so once I get that in, it sits away in a pot, and I’ve got a space in my banking that’s for WDC, and every ticket sale money just sits in there until I need to pay the bills. And then what tends to happen after that is you then hit the summer, and everything goes quiet.</p>\n<p>Drew: Yep.</p>\n<p>Alex: So you get to a point where you’re like, \"I’ve got at least this cost covered. I’m only out a little bit of money.\" And then everyone gets back to work in September and it picks up again. And at that point it’s the general admission tickets for the event. And then you get to the point... I think normally by then, I know I’ve got the base costs covered, because of the way I cover speaker travel and stuff, I know all I’ve got to worry about then is their travel. And some people will be Bristol-based anyway. Some people will... I’ve had it before where some people have driven in with friends and everything else. So actually, you’re not sat there going, \"Oh no, I’m going to be... I’ve got all this expense to cover that I haven’t covered yet.\" So what I’ve got to cover now is very small, and every time a ticket sale comes in, it gets closer and closer to zero.</p>\n<p>Drew: Yep. So those super early bird, which presumably has snapped up by your core regulars who are going to come back every year, because they just know it’s great and they don’t need to know anything about the lineup, they just know they’re coming.</p>\n<p>Alex: Yeah. Yes. I did once do blind birds, where I went, \"This is the date of the event. And over the next couple of months, we’ll sort out all the speakers and stuff.\" And they did all right. It wasn’t an instant success, but I hope that as the track record grows, more and more people go, \"If he does a blind bird and it’s 50 quid, I’ll do that.\" So...</p>\n<p>Drew: It’s worth a gamble because the odds are pretty good.</p>\n<p>Alex: Yeah, exactly. Yeah.</p>\n<p>Drew: Yeah. And that then helps your cashflow to make sure that any initial expenses are coverable. Yes. That’s smart. The conference industry as it is has taken a pretty big hit over the last few years with the pandemic and things. I’m guessing you just didn’t run WDC through the pandemic, because you couldn’t.</p>\n<p>Alex: Yeah, so we got... It was really unfortunate. I’m just going to bring up the... Because I’m slowly filling out the site. So we didn’t run in 2019, 2020, 2021. 20 19 was because of family commitments and my kids being very little, and they take up an extraordinary amount of time.\nAnd then what I was trying to do through the pandemic and stuff like that was at least have something there that people could watch and get to. And we’d done a slot on a conference where we had... It was like a Q&amp;A session, but a very tongue in cheek Q&amp;A session. And I was trying to plan to do something like that, to have people keep engaged, but that again didn’t happen. People got busy. So it took a break just before that, and I was like, \"I’m getting ready for 2020.\" [inaudible] probably sat there in January going, \"The ideas are forming...\" [inaudible] And then everything went all to hell. So we took a break. And then, as I say, we came back last year once we were past it all. And as I say, we’re back now, and this is what we’re doing, and trying to now essentially build up a bit more momentum to be like, \"So we’re back this year, we’re going to be back next, year after that, we’re going to keep going, keep people interested in those things happening.\"</p>\n<p>Drew: And did you find that the audience returned as you’d expected last year? Or was it a little bit slower?</p>\n<p>Alex: It was a little bit slower. I think partly that was down to, it was a two-day event. And I spoke to various people about the fact that two days for them, especially with everything else that was going on, is that... It’s just a bit too much time to take off. Which I completely understood and would never... If someone’s got to do something else than attend my conference, then let them do it. I’m not going to hold it against them. And that was part of the reason, to go back to one, is one, it’s always on a Friday. The worst you’ve got to do is travel... If you are an employee, you can travel to Bristol the Thursday evening after the event... Not after the event, sorry. After work. That’s the one. And then you’re traveling home again on a Saturday. So you’re not there panicking that you’ve got to get up after the event, get back on a train to get to an office. No, you’ve got the Saturday, so you can... I’ve known people who’ve gone, \"Well, I’m going to spend the day in Bristol.\"</p>\n<p>Drew: The important point then as well is, if you are a freelancer deep in the weeds of a project, taking one Friday off to do some personal development stuff and go to WDC is... No client’s going to bat an eyelid, really.</p>\n<p>Alex: Yeah [inaudible].</p>\n<p>Drew: I’m not around this Friday, back on Monday and... Fine.</p>\n<p>Alex: Yeah. And the worst I seem to have had on a Friday is, \"Could you look at this on Monday for me?\" Yeah, of course. That’s Monday. That’s after the weekend. So I’ve had it a couple of times where there’s been talks going on and I’m like, \"Okay, phone down, respond to the email. Okay, done.\" And then there’s nothing.</p>\n<p>Drew: Yeah. I feel as we dig into the weeds of what’s involved in organizing a conference, there’s a lot going on. It’s a big endeavor, right?</p>\n<p>Alex: Yeah. There’s always little things you forget about. And as you’ve covered venue... Date, venue, speakers, and hotels, probably the four big things you’ve got to get sorted out. Then you’ve got to worry about the schedule on the day. The schedule on the day, there’s always one you forget about, because they’re all there, and you sit and go, \"When are they speaking?\" Or... And the big one as well is that people always tweet or contact you to go, \"What is the schedule? What are they talking about?\" You’re like, \"Okay, yeah, I’ve got to put those details together for them.\" Because [inaudible] it works, especially for bigger organizations, is that they want to be able to see what these people are talking about to make sure it’s relevant if they’re sending employees. And then you’ve got lanyards, stickers or... I do pin badges, I’ve got a little set of pin badges that I’ve done. Then you’ve got to worry about volunteers. And volunteers I always forget about, and they’re amazing. They give up their time to sit in the Watershed, and they sit out the front and check people into the event.</p>\n<p>Drew: Do registration and... [inaudible]</p>\n<p>Alex: While I run around crazily going... I’ve got to put banners up here, so I’ve got to make sure I’ve got banners, and I’ve got to make sure that this person’s set up and ready to speak, and... Thankfully the tech team at the Watershed are amazing. So I come in and they go, \"Yeah, okay. We’re doing this again. Okay.\" And they get everyone set up, it’s all working, and they’re all mic’d up and all ready to go. And volunteers just sit there and go, \"Right, they’re in, they’re in.\" And you check on them a couple of times, and they’re like, \"Yep, I’ve had these people.\"\nWhat other small details are there? Oh, getting myself to the event. So I live just on the outskirts of Bristol, so what I’ve done in the past is I’ve driven in the morning to get to the venue for 8:00 with a... And I’ve got it in the garage now, it’s a conference box, which has various bits of...</p>\n<p>Drew: Canned food, firelighters. Emergency flares.</p>\n<p>Alex: [inaudible] Hi-vis jackets. It’s got all the bits and pieces that have built up over the years. Because you sit there and go, \"I can put an event on for 300 people, and so I want 300 of these things.\" And then you get 200 people show up. So you have to go, \"I’ve got 100...\" I’ve got old dot grid notebooks and stuff that are from event many years ago that I’m like, \"I’ve got those to put out so people can have them, because I don’t want them in my garage.\" So what I’m now doing is I’m making sure that I can book a hotel room for myself, to make sure I can get up at 4:00 in the morning, because I can’t sleep anyway, because I’m like, \"I’m putting on conference today,\" and being close to the venue anyway. And... What else? There’s loads of little bits you always forget about every time you put on a thing, you’re like, \"I did that last year. Why did I forget this year?\" And stuff like that.</p>\n<p>Drew: I guess it’s one of the advantages of having a regular venue that you go back to year after year.</p>\n<p>Alex: Yes.</p>\n<p>Drew: Is that, as you say with the tech team, they know you, they know your event, they know what they’re doing. You don’t have to waste energy thinking about, \"Where do we put the registration desks? Where do we do this?\" Because you just know. You’ve done it before, you just fall into the pattern, and it takes off a lot of mental load.</p>\n<p>Alex: Yeah. Yeah. If it was my first one, I’d be... I wouldn’t sleep for the week before the event, because I’d be like, \"Have I got X? Have I got Y? No. Oh, no. What am I going to do?\" And then I’ve been really fortunate with, if we’re doing printing of schedules and stuff and name badges, is that I’ve got a printer I can go to the week before and go, \"I need this.\" [inaudible] \"Okay, great.\" And within... In the past, I’ve had a 24-hour notification to go, \"It’s been dispatched.\" You’re like, \"This is great.\" And then I’ve gone, \"There was a typo and it’s my fault. I’m really sorry. Can you print these?\" So thankfully I’ve now got my wife and a couple of friends who will proofread anything I send that’s going to be printed.</p>\n<p>Drew: Yeah. Yes. When you’re used to working digitally, sending stuff to print is terrifying, isn’t it?</p>\n<p>Alex: Yeah. I don’t know about you, but it’s the thing I’m always saying to clients is, \"You’ve got to remember a website can be changed, as and when you want it to be changed. Can’t do that with a schedule book that you’ve printed out.\"</p>\n<p>Drew: No. And have you ever had any situations like with speakers needing to cancel last minute, or being ill, or anything like that?</p>\n<p>Alex: I’ve had an issue with a speaker before where, because of train... We’ve had issues with train strikes and stuff before. I had an issue with a speaker who went to get on a train, to find out that the train was canceled, and they were traveling down late the night before, and they were meant to be on early first thing the following morning. So there was a lot of panic there about what we were going to do, and they made it in the end, and it was just... Essentially, I could probably give a course in crisis management for it. We had... Again, last year, even though I’ve done 14 events, I’ve never spoken at them, because it’s not something I do. And last year we got to a point where I was like, \"We’ve got one lightning slot, and the person we wanted to speak at it is unavailable.\" And I think was 48 hours before that slot was to take place, I was like, \"I’ll do it. How bad can it be?\"\nAnd having spoken to people who’ve never spoken at events before, who’ve done it, and their nerves and stuff like this, I thought I had a really good idea for a talk for 15 minutes. It’s only 15 minutes. And I was there panicking about it, and thankfully we had Gavin Strange on after me. I spotted him walking in the room after I was about seven minutes in. I’m like, \"I’ve run out of content, I’ve run out of stuff to say,\" because I’d panicked my way through it. I was like, \"That’s me done.\" [inaudible]\nSo a lot of it is just making sure... Knowing enough in advance when things are happening, I think. We’ve been caught out with train strikes, I think at least twice now. And that’s always the thing... If it’s something we can control, so if it’s a speaker who’s sat there [inaudible] \"I’m really sorry, I can’t do it,\" we can... We’ve done it before where we’ve had a slightly extended break, or moved things around ever so slightly because they’ve been unable to attend. But something that we can’t control is industrial action and bits and pieces like that. Thankfully they published it well in advance [inaudible] like, \"Is this going to impact travel?\" And it did last year, which was a bit annoying. And had it been a one-day event, it wouldn’t have happened.</p>\n<p>Drew: Yeah. What seems to be clear is that organizing something like WDC, you probably can’t do it as a business. It has to be something you do out of passion and you do because of the love for it, because it’s so much work. And to be able to keep it to being so accessible in terms of cost and things, as a business move, it doesn’t make any sense, right?</p>\n<p>Alex: No. If I wanted to do it as a business, I’d have to charge a lot more for a ticket, and I couldn’t do one event a year. I’d have to explore options and go down those very narrow lanes of content to make it a business. And at that point I’m like, \"Do I really want to organize 10 events plus a year to run a business?2 And the answer’s no.</p>\n<p>Drew: Yeah. It’s a complete change of business, isn’t it?</p>\n<p>Alex: Yeah, exactly.</p>\n<p>Drew: No longer a software engineer, an event organizer. What would you say to somebody who is thinking about setting something like WDC up, who wanted to do that themselves, a grass root, accessible event, other than don’t do it in Bristol in October? Would you have any advice to give to them?</p>\n<p>Alex: So I’ve spoken to people about it before, and the advice I can give is, if you’ve got the community locally... I’ve been very fortunate with the web scene in Bristol, is that if there’s the community locally and you start off with meetups and networking locally, then if you then put on an event that’s aimed at that community, the chances are that it’ll start in Bristol... Not in Bristol, sorry. It’ll start in your location of choice that isn’t Bristol. And what will happen is that the people who are local will obviously have a network that’s ever so slightly further apart, and it’ll grow out that way. And if you get the right people to speak at that event as well, they will tweet about it and everything else. And that’s the way WDC has grown, is through, as I say, word of mouth.\nI got extremely lucky in that I could work with the uni that I was at to put on the first three events. And so if there’s a partner who’s willing to help you as well [inaudible] \"I’ve got an idea for this, but what I need is just someone to help me cover the cost,\" you can grow it that way as well. So if you know that there’s a community in your area, and it’s... The other thing that I think is very important is good travel links for people traveling in. So obviously Bristol’s quite a good location, because we can get trains from the Southwest, from the East, from the North, all relatively easily. The travel links are really good for Bristol. So if you’ve got that infrastructure in place as well, it means that people coming from outside of your area, can get to it, stay there, and get home again without fuss.\nAnd it’s making sure that you’re getting people talking about things that people want to listen to. So it can be about following trends, but what we’ve done with our lightning talks is that it’s a 15-minute slot that you don’t have to talk about web stuff. You can talk about anything. So we’ve had people talking about building desks and furniture and stuff like that, which is great to show that people in the industry do other things. It’s not that you sit in front of a computer all day. Find the community to build the event in the middle of, and let it... I’ve been very fortunate [inaudible] word of mouth, it’ll grow, because whilst your network could be 50 people, their network is then another 50 people for each one of them, and it grows that way.</p>\n<p>Drew: Fantastic. I’ve been learning all about what it takes to put on an independent web conference. What have you been learning about lately, Alex?</p>\n<p>Alex: So I’ve been learning about Eleventy. Because I’m a big WordPress person. I’ve been doing WordPress for 15 years professionally. And the conference site has been a mismatch of different things over the years. So I’ve been learning Eleventy to pull it all together in one platform. Because obviously it’s a conference, so nothing changes dynamically a lot. So what I’m currently doing is filling in the back catalog of event sites, so that people can see what... Because we’ve tried fun themes and stuff with them over the years, is that I’m using Eleventy to bring all that in and going, \"How do I do this with this thing?\" And \"Why does it error when I do this thing this way, and do something similar but not quite the same this way?\"</p>\n<p>Drew: It’s always very challenging and a little bit humbling, isn’t it? When you pick up a different bit of software, where you know how to do the task with something else you’re familiar with, and you pick up something different, and suddenly you feel like an idiot.</p>\n<p>Alex: Yes.</p>\n<p>Drew: But also, it’s so fulfilling, isn’t it? Once you figure out how to do something and just... That sort of dopamine hit you get from achieving things is amazing.</p>\n<p>Alex: Yeah. For me it’s like, \"But the documentation says this.\" And what’s getting in my way of using documentation properly is that I think I can do it another way, because in the other systems I use and the frameworks I use, this is how I do it. [inaudible] read what we’re saying. You’re like, \"Fine. I surrender.\"</p>\n<p>Drew: I surrender. I will do what the documentation says. If you, dear listener, would like to hear more from Alex, you can find his personal site at alexolder.com, and of course, WebDevConf returns to Bristol on the 20th of October this year. You can find all about that and get your tickets at webdevconf.com. Thanks for joining us today, Alex. Did you have any parting words?</p>\n<p>Alex: No, but please do say hello, because I don’t use social stuff very much because I’m always busy. But do say hello if you ever see me anywhere.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"e03eb18f09677d71d052a6ab5042cbf02dfe5d644bb5c1cf84e1c9ce6893fc58","category":"Tech"}