{"title":"Best MTB knee pads 2023 | Top-rated pads for mountain biking","link":"https://www.bikeradar.com/advice/buyers-guides/best-mtb-knee-pads/","date":1682352000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Knee-Pads-Best-of-opener-430489a.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Best of: Trail Knee Pads\" title=\"Knee Pads - Best of opener\" />                                            <p>After a helmet, a pair of the best mountain bike knee pads is probably the wisest protection to use. That’s because your knees are generally one of the first – and most painful – parts of the body to hit the ground in a crash.</p>\n<p>As a moving part, your knees are also vital to protect, and wearing pads is one of the best ways to keep you on your bike, rather than resting on the couch.</p>\n<p>Knee pads vary wildly, though. Some are super-lightweight sleeves, more for scuff protection than big hits, while others wouldn’t look out of place on a motocross bike. As such, the padding can vary from simple Kevlar-wrapped foam and high-tech materials that are malleable until hit and then seemingly magically harden up, to hard-plastic skid plates covering impact-absorbing materials.</p>\n<p>Fit is vital. A baggy, loose feel may aid comfort, but it can lead to the pad moving in a crash, decreasing the protection it offers. Some designs rely on a long upper sock with a silicone gripper to keep them in place, while others have Velcro straps so you can cinch them down over your thighs and calves.</p>\n<p>The trade-off for more security and protection tends to be less comfort and breathability. Unless you want to whip off your shoes at the top and bottom of every climb, your pads are likely to stay on throughout your ride. As such, you need a pair that don’t chafe on long climbs or get too sweaty when the sun comes out.</p>\n<p>We’ve taken the pads in this list on both short spins and longer <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">cross-country</a> rides to find out which pads go unnoticed on longer rides, and which get the sweatiest. While protection is vital, if pads don’t feel good you’re less likely to wear them, so comfort has taken equal precedence in our reviews.</p>\n<p>If you’re in the market for protection, we also have lists bringing together the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-helmets-for-trail-riding/\">best mountain bike helmets</a> and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-elbow-pads/\">best MTB elbow pads</a>.</p>\n<h2>Best knee pads for mountain biking 2023 as reviewed by our expert testers</h2>\n<h3>Sweet Protection knee pads</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Sweet Protection pads are some of our favourites.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £90 / $100 / €100 as tested</li>\n<li><strong>Protection:</strong> SAS-TEC knee cup</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>The Sweet Protection knee pads have quickly become our favourite pads out on the trails, thanks to their great comfort, secure fit and coverage.</p>\n<p>The pads sat just right on our tester’s legs. The stretchy sleeve has thick neoprene panels that help the pads hold their shape, even with bent knees.</p>\n<p>At the bottom and top is a fabric with a rubbery backing. Paired with a single Velcro strap up top, the pads stay resolutely in place.</p>\n<p>There is a thin stretchy panel and perforated fabric behind the knee to stop things from getting too sweaty. The pads warm up quickly but they do dry pretty fast, so wearing them for a multi-day trip shouldn’t be an issue.</p>\n<p>For protection, the pads use SAS-TEC knee cups, which harden on impact, a bit like D3O. While there might not be enough protection for downhill riding, these are some of the best trail pads available.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/sweet-protection-knee-pads-review/\">Read our full Sweet Protection knee pads review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>7iDP Project knee pads</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The 7iDP Projects are pricey, but they are packed with features.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £110 / $120 / AU$220 as tested</li>\n<li><strong>Protection:</strong> Extra protection around the outside of the knee</li>\n<li><strong>Sizes:</strong> S, M, L, XL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>While expensive, the 7iDP Project knee pads are feature-packed, justifying the price.</p>\n<p>The pad itself, which is protected by an exterior skid plate, is extensively shaped around the knee, so feels odd when you’re putting it on, but great once there. It encases the sides of your knee, so while these pads don’t have the most protection real-estate on test, the padding is exactly where it needs to be.</p>\n<p>The sleeve is made from a compressive knit material that’s exceptionally comfortable on all-day rides, and a rear cut-out boosts comfort further.</p>\n<p>These are rock-solid in use, with upper and lower silicone strips, and a unique double Velcro strap system. We’ve found the core material stiffens in the cold, softening once some body warmth gets in. For pads with plenty of front protection, a bit extra at the sides wouldn’t go amiss.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/7idp-project-knee-pads-review/\">Read our full 7iDP Project knee pads review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Endura MT500 Hard Shell</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The MT500 Hard Shell pads use an impact-reactive D3O insert.</span></figcaption><span> <i>Endura</i></span></div>\n<ul><li><strong>Price:</strong> £80 / $115 as tested</li>\n<li><strong>Protection:</strong> Plastic shells and D3O insert</li>\n<li><strong>Sizes:</strong> S/M, M/L, L/XL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>While they might not be the lightest pads, there’s no getting away from how protective and comfortable the Endura MT500 Hard Shell knee pads are.</p>\n<p>The pads use a combination of D3O inserts behind hard plastic shells. This padding is attached to a sleeve that extends above the knee for plenty of coverage. There is also some PU foam padding to protect the side of the knee.</p>\n<p>To stay in place, the pads have silicone grippers and broad Velcro straps at the top of the sleeves. There is a second strap around the top of your calf muscle, which enables you to tailor the fit of the pads further. We found this means the pads didn’t slip down or bunch behind your knee and remained comfy even on long rides.</p>\n<p>The pads do get a bit warm, but that’s no surprise given the protection on offer.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/endura-mt500-hard-shell-knee-pads-review/\">Read our full Endura MT500 Hard Shell knee pads review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Fox Enduro D3O</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Fox Enduro D3O knee guards offer exactly what we’re after.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £75 / $85 / AU$140 / €85 as tested</li>\n<li><strong>Protection:</strong> D3O insert</li>\n<li><strong>Sizes:</strong> S, M, L, XL</li>\n<li><strong>Colour:</strong> Black, Grey Vintage</li>\n</ul><p>Despite the ‘Enduro’ tag, we feel these are slightly more <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail-bike</a> orientated because with a relatively simple D3O pad, they don’t offer as much protection as some other knee pads. However, they’ve won favour with a number of our testers thanks to their exceptional comfort and relatively keen pricing.</p>\n<p>While the pad isn’t the most pre-shaped, the sleeve onto which it’s built hugs your leg closely, pulling the pad in and keeping it securely in place. With a snug fit and minimal rubbing, we’ve been happy keeping these on during all-day epics.</p>\n<p>To help keep the air flowing, the rear section of the pad is perforated. The sock extends high up the thigh, where a silicone gripper holds it in place. At the bottom, the elasticated hem is tight enough to boost security without causing discomfort.</p>\n<p>The pad itself is fairly long, extending low enough to stop most debris flipped up by the front tyre from leaving a mark on your shin.</p>\n<p>The Enduros are lightweight, knee-warmer-style pads, so we wouldn’t take them on the chunkiest of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-bikes/\">enduro</a> rides, but for riders looking for all-day comfort with plenty of protection and ventilation, these come out top dog.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/fox-enduro-d3o-knee-guards-review/\">Read our full Fox Enduro D3O Knee Guards review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Rapha Trail</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Rapha’s Trail knee pads strike a great balance between comfort, coverage and protection.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<ul><li><strong>Price:</strong> £80 / $110 / AU$140 / €95 as tested</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>Rapha has hit the ground running with its debut knee pads. These are extremely comfortable and have good coverage and protection.</p>\n<p>The feel of the material is similar to a set of <a href=\"https://www.bikeradar.com/reviews/clothing/arm-and-leg-warmers/\">knee warmers</a> in that they are made from a very soft and stretchy fabric. There’s a silicone print on the inside too, to ensure they stay in place, which we can attest they do.</p>\n<p>The padding is made in collaboration with RHEON Labs from an ‘active polymer’ and is soft and malleable but hardens on impact.</p>\n<p>The knee pads didn’t disappoint when pedalling, despite having a reassuring bulk and they fit well under most mountain biking shorts. We’d be happy to pedal in these all day and they would stay perfectly in place while giving you peace of mind.</p>\n<p>The knee pads aren’t as breathable as some other options on the market, but for the comfort and coverage they provide, it’s a small penalty.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/rapha-trail-knee-pads-review/\">Read our full Rapha Trail knee pads review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Troy Lee Designs Raid</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Troy Lee Designs’ Raid knee pads aren’t light, but do have plenty of padding.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £110 / $115 / AU$220 as tested</li>\n<li><strong>Weight:</strong> 423g</li>\n</ul><p>The Troy Lee Designs Raid pads are some of the most protective pads here. Substantial D3O padding covers a large part of the knee area and extends reassuringly far down the shin.</p>\n<p>Foam pads add protection along both sides of the knee, as well as just above the kneecap, making them feel very safe on dicey terrain.</p>\n<p>Despite this, the fit is extremely comfortable, whether standing up straight or pedalling for long rides, and this feedback is echoed by several testers.</p>\n<p>They stay up exceptionally well thanks to a pre-curved knee cup and a strap that sits above (not below) the thickest part of the calf. The Velcro strap above the knee allows the tightness to be tailored to the rider and stops it from moving around.</p>\n<p>They’re not light, and they’re a bit warm, but given the level of protection on offer, we think this is easy to forgive. They’re comfortable enough for long rides and protective enough for gnarly <a href=\"https://www.bikeradar.com/features/routes-and-rides/best-trail-centres-in-england/\">bike park</a> laps on the black run.</p>\n<p>If you’re after big-terrain security without the comfort penalty, they have the versatility to justify the price tag.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<section><div>\n        \n<h2>What to look for in MTB knee pads</h2>\n<h3>Velcro straps</h3>\n<p>Being able to tighten things down with a Velcro strap adds security, but also weight, warmth and faff. If you want the best protection, though, Velcro-secured pads are likely a good option.</p>\n<h3>Behind the knee</h3>\n<p>The area behind the knee is often where pads cause the most skin irritation. Thinner, more breathable materials tend to bunch and chafe less. Some pads have a cut-out here, which may add cost but can definitely help with comfort.</p>\n<h3>Articulated or not?</h3>\n<p>Your knees bend thousands of times during a ride and your pads need to be able to move with them. Soft pads articulate easily, but harder designs may have cut-outs to help them flex as you pedal.</p>\n<h3>Side protection</h3>\n<p>While the front-of-knee protection is most obvious, some designs have extra padding on the sides. This can really help when you bang your knee on the top tube!</p>\n<h3>Shin protection</h3>\n<p>Pads extend differing lengths down your shin – the deeper they go, the more protection they offer, but also more warmth and potentially more discomfort too, if the pad itself isn’t particularly flexible.</p>\n<p>\n\n    </p></div>\n    </section><h3>Bliss ARG Minimalist</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Bliss ARG Minimalists are certainly not minimal in length.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £70 / AU$90 as tested</li>\n<li><strong>Protection:</strong> Super Shock Absorbing ARG</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL</li>\n<li><strong>Colour:</strong> Black/Blue</li>\n</ul><p>The ARG Minimalists feature some of the longest pads we’ve seen. With the top of the sleeve extending well under some <a href=\"https://www.bikeradar.com/reviews/clothing/mountain-bike-shorts/undershorts-and-short-liners/\">liner shorts</a>, these stay in place nicely and feel unrestrictive.</p>\n<p>The thin, stretchy sleeve is topped and bottomed by elasticated hems with a dotted silicone strip. It has a thin, leg-warmer-style construction, with a slightly more perforated material behind the knee, which we didn’t find bunched during riding.</p>\n<p>The big blue pad is pre-formed to fit the shape of the knee, and while there’s plenty of space inside, we didn’t find it flared out or lacked security. We’ve witnessed some big crashes with these pads, where they’ve done their job well.</p>\n<p>The Lycra sleeve means the fit is snug, but it extends a long way down the leg, so we needed to pull the pads up high to prevent the lower hem from being loose around the calf.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/bliss-arg-minimalist-knee-pad-review/\">Read our full Bliss ARG Minimalist review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Fox Enduro Pro D3O</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Pro D30 pads provide enough coverage for fast-paced trail riding.</span></figcaption><span></span></div>\n<ul><li><strong>Price:</strong> £95 as tested</li>\n<li><strong>Protection:</strong> D3O foam</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL, XXL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>The Fox Enduro Pro D3O pads offer great comfort once on, with the D3O insert wrapping well around the knee, though we found they needed warming up on cooler days.</p>\n<p>A slip-on design is used for the Lycra sleeve, with an even tension pulling the insert close to the knee, making for a slim silhouette that should fit beneath most riding pants.</p>\n<p>Silicone embroidered onto the sleeve on the openings keeps the pads from falling down.</p>\n<p>While the CE Level-1 rated protection doesn’t give the same peace of mind as burlier pads, they remained comfortable for long days in the saddle.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/fox-enduro-pro-d30-knee-pads-review/\">Read our full Fox Enduro Pro D3O review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>G-Form Pro Rugged</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> They might be light, but they do wrap fairly far around the knee.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £100 / $80 as tested</li>\n<li><strong>Protection:</strong> Impact-absorbing SmartFlex pads</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL, XXL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>G-Form’s pads use a D3O-like material that hardens on impact to offer plenty of protection, along with comfort-giving flexibility.</p>\n<p>The pads’ contoured shape shows through the hardwearing outer material, while the inner sleeve is medium-thickness Lycra, which is very soft against the skin.</p>\n<p>For lighter-weight pads, the Pro Ruggeds wrap fairly far around the knee, as well as higher and lower than some. They stay in place well, with silicone dimpling around the lower hem and a strip up top too, backed by a Velcro strap. This attaches at the rear of the leg, which isn’t as intuitive as securing at the front.</p>\n<p>The thicker material at the front of the sleeve adds warmth over similar-looking pads, but it’s not hot enough to cause issues on longer rides.</p>\n<p>While pricey, the quality makes them feel worth it.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/g-form-pro-rugged-knee-guard-review/\">Read our full G-Form Pro Rugged Knee Guard review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>iXS Carve Evo+</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> These iXS knee guards have removable pads for easy washing.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £90 / $115 / €100 as tested</li>\n<li><strong>Protection:</strong> Xmatter protection foam</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL, XXL</li>\n<li><strong>Colour:</strong> Camel, Grey</li>\n</ul><p>These are some of the bulkiest pads we’ve tested, with plenty of protection and a secure fit making them feel very safe. The flip side is that there’s noticeable bunching behind the knee.</p>\n<p>You can remove the pad itself for washing, and it’s shaped nicely to fit the knee and flexible enough to prevent any digging in. There’s extra padding above and to the side too. The iXS pads are held securely in place by straps at the top and bottom, which have plenty of adjustment.</p>\n<p>While the sleeve isn’t the tallest, a thin silicone strip holds it in place. It’s largely made from a thick yet stretchy material that’s warm, but there’s perforated fabric at the back for ventilation. These pads are hot, but that’s acceptable given the protection offered, even if it does make them best suited to shorter sessions.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Leatt 3DF 6.0</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The 3DF pads might be bulky but they remained comfortable on all but the longest of rides.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £87 / $100 / AU$154 / €100 as tested</li>\n<li><strong>Protection:</strong> 3DF</li>\n<li><strong>Sizes:</strong> S, M, L, XL</li>\n<li><strong>Colour:</strong> Fuel/Black, White/Black, Black</li>\n</ul><p>The 3DF pads surprised us because, despite their bulky protection, they remained comfortable on all but the longest of rides (where a sleeve-style lighter pad always wins out).</p>\n<p>A one-piece main pad is backed up by a pair of harder, yet still flexible, outer skid panels, as well as impact-foam side protection that extends up to the lower thigh. The sleeve extends fairly far up the leg and has both a silicone strip and a Velcro strap to keep it in place. Lower down, there’s a simple elasticated hem to hold things up.</p>\n<p>The interior material feels good against the skin, and the medium-sized cutaway at the back means there’s no bunching and minimal flaring to contend with.</p>\n<p>They’re fairly big, so are warm, but we found they worked better for longer rides than some more protective pads.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/leatt-3df-6-0-knee-guards-review/\">Read our full Leatt 3DF 6.0 Knee Guards review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Pearl Izumi Elevate</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The D3O pad is quite long and there is high-density foam on top, too.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £120 / $125 / AU$230 as tested</li>\n<li><strong>Protection:</strong> D3O viscoelastic LP1 pads</li>\n<li><strong>Sizes:</strong> XS, S, M, L, XL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>The Pearl Izumi Elevate Knee Guards combine fairly high levels of protection with a lightweight-feeling design that’s very comfy in use, but at a high price.</p>\n<p>The D3O pad is quite long, and extends far around the knee, with the outermost section backed up by further high-density foam on top. It’s visible through the mesh front, and ventilation is as good as you’d expect from looking at it. This is enhanced by mesh fabric at the rear and a large cut-out behind the knee.</p>\n<p>The rest of the sleeve is very light, and extends high up and low down the leg, with a silicone gripper for security. There’s a touch of excess material at the top of the knee, and you need to pull them up high to get the best fit.</p>\n<p>Our only real complaint, price aside, is that the open sleeve through which the D3O insert can be removed can catch on your feet as you put the pads on.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/pearl-izumi-elevate-knee-guard-review/\">Read our full Pearl Izumi Elevate Knee Guard review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>POC Joint VPD System</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> POC’s Joint VPD System knee pads offer CE level-2 rated protection and are designed to be light and flexible for trail riding.</span></figcaption><span> <i>Andy Lloyd / OurMedia</i></span></div>\n<ul><li><strong>Price:</strong> £140 / $150 / AU$225 / €160 as tested</li>\n<li><strong>Protection:</strong> POC VPD insert</li>\n<li><strong>Sizes:</strong> S, M, L</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>Although pricey, POC’s Joint VPD System knee pads proved incredibly comfortable and offer a good level of protection.</p>\n<p>The pads rely on POC’s VPD (visco-elastic polymer dough) insert. This is designed to remain flexible when in use but hardens on impact. There are three different layers of the material, which POC says not only helps absorb any energy in an impact, but also makes them highly breathable.</p>\n<p>They’re not the longest knee pads going in terms of coverage but they fit well and come in at a decent weight, too, at 372g.</p>\n<p>They remained comfortable on long rides and you can pedal comfortably, almost forgetting you’re wearing them.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/poc-joint-vpd-system-knee-pads-review/\">Read our full POC Joint VPD System knee pads review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Troy Lee Designs Stage</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Troy Lee Designs’ Stage knee guards use D3O protection, which is nicely shaped around the knee.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Price:</strong> £90 / $89 / AU$158 / €90 as tested</li>\n<li><strong>Protection:</strong> D3O</li>\n<li><strong>Sizes:</strong> XS / S, M / L, XL / XXL</li>\n<li><strong>Colour:</strong> Black</li>\n</ul><p>Troy Lee Designs’ Stage knee guards performed well and are a comfortable and highly breathable option.</p>\n<p>They articulate particularly well when pedalling and fit well underneath trousers or shorts.</p>\n<p>You can feel the edge of the D3O insert on your shin when your leg is fully extended, though, but we only really noticed it on longer rides. The coverage is decent but they don’t have quite the same levels of protection as other options, as they only have a CE Level 1 rating.</p>\n<p>We also found they’ve held up well after two years of riding, proving a durable option.</p>\n<p>As well as not providing the same levels of protection, there are only three sizes, which we’d recommend trying before you buy.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/troy-lee-designs-stage-knee-guards-review/\">Read our full Troy Lee Designs Stage knee guards review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Robin Weaver","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e04434466a2ec58d7fa136e7e51121be92be162e9c5636469cf7d2a99eccea7f","category":"Cycling"}