{"title":"Future Apple Watch Update to Enable Pairing With Multiple Apple Devices Rather Than Just One iPhone, Claims Leaker","link":"https://www.macrumors.com/2023/04/27/apple-watch-pairing-multiple-apple-devices/","date":1682591084000,"content":"Apple is working on software updates that will make it possible for users to pair their Apple Watch with multiple Apple devices, including iPhone, iPad, and Mac, according to a new rumor. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-devices-mac-iphone-ipad-watch-collage.jpg\" alt width=\"1600\" height=\"940\" />\r<br />\nCurrently, an Apple Watch can be paired to one iPhone only, and though it is possible to pair multiple Apple Watch models to the same iPhone, Apple offers no facility for pairing or syncing Apple Watches to other devices in its ecosystem. \r<br />\n\r<br />\nOnce an Apple Watch is paired to an iPhone, it can be used in conjunction with an iPad logged into the same Apple ID to follow Apple Fitness+ workout routines on the iPad's screen. Also, Mac users can use their Apple Watch to unlock their computer, authenticate apps and view passwords, and authorize online Apple Pay transactions, but that is where the exceptions end.\r<br />\n\r<br />\nThese limitations could be set to change, however. According to the <a href=\"https://twitter.com/analyst941/status/1651405783764983808?s=20\">Twitter account holder @analyst941</a>, Apple is planning changes to the pairing/syncing process that mean an Apple Watch will no longer be tied to a single iPhone, but will instead be able to sync across multiple iPhones, iPads, and Macs.\r<br />\n\r<br />\nThe leaker confesses that they do not know how this will be implemented, but iCloud syncing could be one possibility, similar to how AirPods work across devices. Whether this means that an iPhone will still be required for setting up an Apple Watch before it can sync with other Apple devices logged into the same iCloud account is unclear.\r<br />\n\r<br />\nThe leaker added that they do not know whether the change will come this year with watchOS 10, iOS 17, iPadOS 17, and macOS 14, or if it will be held over until 2024.\r<br />\n\r<br />\nThe anonymous source behind today's rumor leaked accurate information about the <a href=\"https://www.macrumors.com/2022/08/31/iphone-14-pro-camera-cutout-indicators/\">iPhone 14 Pro's Dynamic Island</a> before the device was announced last year. However, they do not have a long-term track record with rumors yet, so there is no guarantee the latest information they shared will prove to be accurate.<div>Tag: <a href=\"https://www.macrumors.com/guide/analyst941/\">Analyst941</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/27/apple-watch-pairing-multiple-apple-devices/\">Future Apple Watch Update to Enable Pairing With Multiple Apple Devices Rather Than Just One iPhone, Claims Leaker</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/future-apple-watch-update-to-enable-pairing-with-multiple-apple-devices-rather-than-just-one-iphone-claims-leaker.2387950/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e050db2b916381776deb7e71278f3301d46b8fc912544b2f8980ef8cb9367439","category":"Apple"}