{"title":"Sports Illustrated Published Painfully Bad Articles by Fake AI-Generated Writers","link":"https://futurism.com/sports-illustrated-ai-generated-writers","date":1701204389000,"content":"\n<p>Maggie Harrison, writing for Futurism:</p>\n\n<blockquote>\n  <p>The only problem? Outside of Sports Illustrated, Drew Ortiz \ndoesn’t seem to exist. He has no social media presence and no \npublishing history. And even more strangely, his profile photo on \nSports Illustrated <a href=\"https://archive.is/ndV3A\">is for sale</a> on a website that sells \nAI-generated headshots, where he’s described as “neutral white \nyoung-adult male with short brown hair and blue eyes.” </p>\n\n<p>Ortiz isn’t the only AI-generated author published by Sports \nIllustrated, according to a person involved with the creation of \nthe content who asked to be kept anonymous to protect them from \nprofessional repercussions. “There’s a lot,” they told us of the \nfake authors. “I was like, what are they? This is ridiculous. This \nperson does not exist.” </p>\n\n<p>“At the bottom [of the page] there would be a photo of a person \nand some fake description of them like, ‘oh, John lives in \nHouston, Texas. He loves yard games and hanging out with his dog, \nSam.’ Stuff like that,” they continued. “It’s just crazy.” </p>\n\n<p>The AI authors’ writing often sounds like it was written by an \nalien; <a href=\"https://web.archive.org/web/20221004090814/https://www.si.com/review/full-size-volleyball/\">one Ortiz article</a>, for instance, warns that volleyball \n“can be a little tricky to get into, especially without an actual \nball to practice with.” </p>\n</blockquote>\n\n<p>What an incredible fall from grace for what was, for decades, a truly great magazine. I can see how they thought they’d get away with it, though — Sports Illustrated’s human-written articles are now mostly clickbait junk anyway.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/28/sports-illustrated-ai-fraud\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"e0558624dc5020ed0a7d1db22c1e82f43807278f6a8ce3bf4c321804befdaf92","category":"Tech"}