{"title":"Changes in the expression of genes encoding xanthophyl acyltransferases during the postharvest ripening of avocado (Persea americana) fruit","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13409?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Avocado fruit is rich in xanthophylls, which have been related to positive effects on human health. Xanthophyl acetyltransferases (XATs) are enzymes catalyzing the esterification of carboxylic acids to the hydroxyl group of the xanthophyll molecule. This esterification is thought to increase the lipophilic nature of the xanthophyll and its stability in a lipophilic environment. Studies on XATs in fruits are very scarce, and no studies had been carried out in avocado fruit during postharvest. The objective of this work was to investigate the changes in the expression of genes encoding XAT, during avocado fruit ripening.</p>\n<h2>RESULTS</h2>\n<p>Avocado fruits were obtained from a local market and stored at 15 °C for 8 days. The fruit respiration rate, ethylene production, and fruit peel's color space parameters (<i>L</i>*, <i>a</i>*, <i>b</i>*) were measured during storage. Fruit mesocarp samples were taken after 1, 3, 5, and 7 days of storage and frozen with liquid nitrogen. Total RNA was extracted from fruit mesocarp, and the quantification of the two genes designated as COGE_ID: 936743791 and COGE_ID: 936800185 encoding XATs was performed with real-time quantitative reverse transcription polymerase chain reaction using actin as a reference gene. The presence of a climacteric peak and large changes in color were recorded during postharvest. The two genes studied showed a large expression after 3 days of fruit storage.</p>\n<h2>CONCLUSIONS</h2>\n<p>We conclude that during the last stages of ripening in avocado fruit there was an active esterification of xanthophylls with carboxylic acids, which suggests the presence of esterified xanthophylls in the fruit mesocarp. © 2024 Society of Chemical Industry.</p>","author":"Elhadi‐M Yahia, \nMiguel‐Angel Hernández‐Oñate, \nAngel‐Javier Ojeda‐Contreras, \nJorge Mercado‐Ruiz, \nLarissa Cordero‐Chávez, \nEduardo‐Antonio Trillo‐Hernández, \nMartín‐Ernesto Tiznado‐Hernández","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e0557f04e8126be2b1d34e157e65ce332635bedbbc68c6bc70ecf35ec62e07ba","category":"Environment"}