{"title":"Movement of juvenile migratory birds from settlement to adulthood across the non‐breeding range","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14138?af=R","date":1719825887000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6b5ea1f2-0488-46e1-971e-b7b3a9b564d9/jane14138-toc-0001-m.png\" alt=\"Movement of juvenile migratory birds from settlement to adulthood across the non-breeding range\" />\n<p>Long-term, range-wide resightings of hundreds of colour-marked individual Black-tailed Godwits, from their first migration to adulthood show that individuals rarely change their non-breeding regions. This has important implications for the conservation of migratory populations and shows that the factors influencing where juveniles settle will be key determinants of non-breeding distributions and of the rate and direction of changes in distributions. An adult Black-tailed godwit (<i>Limosa limosa islandica</i>) on the Icelandic-breeding grounds (photograph: T. G. Gunnarsson).</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAmong migratory vertebrates, high levels of fidelity to non-breeding sites during adulthood are common. If occupied sites vary in quality, strong site fidelity can have profound consequences for individual fitness and population demography. Given the prevalence of adult site fidelity, the regions of the non-breeding range to which juveniles first migrate, and the scale of any subsequent movements, are likely to be pivotal in shaping distributions and demographic processes across population ranges.\n\nHowever, inherent difficulties in tracking migratory individuals through early life mean that opportunities to quantify juvenile settlement and movements across non-breeding ranges, and the mechanisms involved, are extremely rare.\n\nThrough long-term, range-wide resightings of hundreds of colour-marked individuals from their first migration to adulthood and the application of state-space models, we quantify levels of juvenile and adult regional-scale movements and distances at different life stages across the whole non-breeding distribution range in a migratory shorebird, the Black-tailed Godwit (<i>Limosa limosa islandica</i>).\n\nWe show that the probability of individuals changing non-breeding regions (seven historical wintering regions spanning the Western Europe range) at all ages is very low (mean movement probability = 10.9% from first to subsequent winter, and 8.3% from first adult winter to later winters). Movement between regions was also low between autumn and winter of the same year for both juveniles (mean movement probability = 17.0%) and adults (10.4%). The great majority of non-breeding movements from the first autumn to adulthood were within regions and less than 100 km.\n\nThe scarcity of regional-scale non-breeding movements from the first autumn to adulthood means that the factors influencing where juveniles settle will be key determinants of non-breeding distributions and of the rate and direction of changes in distributions.\n</p>\n<h2>Útdráttur</h2>\n<p>\n\nMjög algengt er meðal hryggdýra sem stunda far að fullorðnir einstaklingar sýni mikla tryggð við svæði sem þeir nota árið um kring. Ef svæði sem stofn notar eru mjög misgóð getur slík átthagatryggð haft mikil áhrif á hæfni einstaklinga og lýðfræði stofna. Þar sem átthagatryggð er útbreidd meðal fullorðinna getur skipt miklu máli fyrir útbreiðslu og lýðfræði stofna hvernig ungliðar velja sér svæði og hversu mikill hreyfanleiki þeirra er.\n\nÞar sem erfitt er að fylgja einstaklingum frá æsku til fullorðinsára hafa tækifæri til að kanna mynstur sem þessi á mælikvarða heilla útbreiðslusvæða verið mjög sjaldgæf.\n\nMeð því að fylgja hundruðum einstaklingsmerktra íslenskra jaðrakana (<i>Limosa limosa islandica</i>) frá æsku til fullorðinsára var lagt mat á hreyfingamynstur ungfugla og fullorðinna fugla yfir allt vetrarútbreiðslusvæðið. Notuð voru ástandslíkön (e. state-space models) til að kanna hreyfingarmynstur.\n\nÍ ljós kom að litlar líkur eru á að fuglar færi sig milli vetrarsvæða (sjö söguleg svæði sem ná yfir allt vetrarútbreiðslusvæðið í V-Evrópu) á öllum æviskeiðum (meðallíkur á tilfærslu 10,9% frá fyrsta til annars veturs og 8,3% milli vetra á fullorðinsaldri). Ferðalög milli svæða voru einnig sjaldgæf milli hausts og vetrar innan sama árs (17,0% fyrir ungfugla á fyrsta hausti og 10,4% fyrir fullorðna). Langflestar hreyfingar frá fyrsta hausti til fullorðinsára voru innan svæða og innan við 100 km.\n\nÞað hversu sjaldgæf ferðalög milli svæða eru, allt frá fyrsta hausti til fullorðinsára, bendir til að þeir þættir sem ráða því hvar ungfuglar lenda á vetrarstöðvum á fyrsta hausti ævi sinnar séu lykilþáttur í að ákvarða útbreiðslusvæði sem og hraða og stefnu breytinga á útbreiðslu.\n</p>","author":"Tómas Grétar Gunnarsson, \nJosé A. Alves, \nJames J. Gilroy, \nBöðvar Þórisson, \nWilliam J. Sutherland, \nPeter M. Potts, \nJennifer A. Gill","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"e05c77e65c8332eaac13260b244be796970773b238595e54ae43576753a7e4ca","category":"Environment"}