{"title":"Unlocking AI Adoption in Local Governments: Best Practice Lessons from Smart Cities","link":"https://www.preprints.org/manuscript/202406.0159/v1","date":1717491275000,"content":"In an era marked by swift technological progress, the pivotal role of Artificial Intelligence (AI) is increasingly evident across various sectors, including local governments. These governmental bodies are progressively leveraging AI technologies to enhance service delivery to their communities, ranging from simple task automation to more complicated engineering endeavours. While more and more local governments are adopting AI, it is imperative to understand the functions, implications, and consequences of AI. Despite the growing importance of this domain, a significant gap persists within the scholarly discourse. This study strives to bridge this void by exploring the applications of AI technologies within the context of local government service provision and using this inquiry to generate lessons and best practices for similar smart city initiatives. Through a comprehensive grey literature review, we analysed 262 real-world AI implementations across 170 local governments worldwide. The findings underscore several key points: (a) There has been a consistent upward trajectory in the adoption of AI by local governments over the last decade; (b) Local governments from China, the US, and the UK are at the forefront of AI adoption; (c) Among local government AI technologies, Natural Language Processing and Robotic Process Automation emerge as the most prevalent ones; (d) Local governments primarily deploy AI across 28 distinct services; (e) Information management, back-office work, and transportation and traffic management are leading domains in terms of AI adoption. This study enriches the extant body of knowledge by providing an overview of existing AI applications within the sphere of local governance. It offers insights for smart city policymakers and decision-makers considering the adoption, expansion, or refinement of AI technologies in urban service provision. Additionally, it underscores the importance of using these insights to guide the successful integration and optimisation of AI in future smart city projects, ensuring they meet the evolving needs of communities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e062b01685a3f8b9d6f444da3669d98d876033f40da5d70542ccab0a7daf1298","category":"Interdisciplinary"}