{"title":"WSJ Reports That Apple and Goldman Sachs Are Parting Ways on Apple Card","link":"https://www.wsj.com/finance/banking/apple-pulls-plug-on-goldman-credit-card-partnership-ca1dfb45","date":1701223134000,"content":"\n<p>AnnaMaria Andriotis, reporting for The Wall Street Journal (<a href=\"https://apple.news/AUUOrnDm9QTiEj7T66kNLmg\">News+</a>):</p>\n\n<blockquote>\n  <p>Apple is pulling the plug on its credit-card partnership with \nGoldman Sachs, the final nail in the coffin of the Wall Street \nbank’s bid to expand into consumer lending. </p>\n\n<p>The tech giant recently sent a proposal to Goldman to exit from \nthe contract in the next roughly 12-to-15 months, according to \npeople briefed on the matter. The exit would cover their entire \nconsumer partnership, including the credit card the companies \nlaunched in 2019 and the savings account rolled out this year. </p>\n\n<p>It couldn’t be learned whether Apple has already lined up a new \nissuer for the card. </p>\n</blockquote>\n\n<p>Apple Card is a strange product — everyone I know who has one likes it (including me), but <a href=\"https://daringfireball.net/linked/2023/07/03/goldman-apple-card-losses\">Goldman itself has reported</a> that they’ve lost $3 billion since 2020 on it. The savings accounts <a href=\"https://daringfireball.net/linked/2023/08/03/apple-card-savings\">are a hit with customers</a> too.</p>\n\n<p>American Express is rumored to be one possible partner, but it would be pretty strange for Apple Cards to transmogrify from MasterCard to Amex cards overnight. There are still a lot of businesses — particularly throughout Europe — that accept MasterCard but not Amex. It’s not just that Apple Card would no longer be accepted at businesses where previously it was, but that would highlight the fact that Apple Card is really just an Apple-branded card issued by a company that isn’t Apple. Apple wants you to think of Apple Card as, well, an Apple credit card.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/28/apple-goldman-breakup\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"e066752303b29a84e95bf46edb2d745036920b963e78a368166637c764b41866","category":"Tech"}