{"title":"PSII-2 Effect of piglet processing and castration on growth performance in feeder pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/261/7664738?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Early in life castration in swine is a common practice to improve muscle and fat deposition and avoid “boar taint”, which is caused by production of androsterone and skatole within the intact male. The objective of this study was to evaluate the effect of performing piglet processing and castration on the same day compared with a 2-d protocol processing on d 1 and castrating on d 7. To determine the effect of processing protocol on subsequent growth in piglets, 42 piglets were randomly assigned at birth to one of two processing protocols: d 3 processing (“early”) or d 1 and d 7 processing (late). For both castration dates, males were castrated using the open method of castration. A sterile scalpel blade was used to make two vertical cuts posterior to each testicle before complete removal of each testicle. Both male and female piglets were assigned to a processing protocol, but only male piglets underwent castration as a sterility procedure. Females on the same processing protocol were subject to similar processing methods and vaccinations but were not sterilized. Body weights were collected on all piglets at d 1, 3, 7, 14, 21, 28 (weaning), and 56. For males, vocalization during the castration procedure was also recorded and analyzed along with growth and performance measures. At weaning (d 28), the early castrated barrows group weighed significantly more than the late castrated barrows; however, there were no significant differences in the body weight at weaning for the early group (males + females) as a whole compared with the late group (males + females) as a whole. This indicates that while males benefited from an early castration and were able to gain more body weight during the pre-weaning phase when processing occurred on d 3 rather than on d 1 and 7, females undergoing two processing dates gained less body weight between birth and weaning.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e06c748b5d787999e1117f26e2d632ee1a99e6643eaaa48a9bb21fd69733eb0e","category":"Environment"}