{"title":"Hands-on with Apple Vision Pro: This is not a VR headset","link":"https://arstechnica.com/?p=1945928","date":1686092930000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_4028-800x600.jpeg\" alt=\"An AR headset sits on a stand in a public viewing area.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_4028-scaled.jpeg\">Enlarge</a> <span>/</span> This is Apple’s Vision Pro headset. It looks a bit like a particularly bulky pair of ski goggles, with the materials and design language of Apple’s AirPods Max headphones. (credit: Samuel Axon)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CUPERTINO, Calif.—Going into the Vision Pro demo room at Apple’s WWDC conference, I wasn’t sure what to expect. The keynote presentation, which showed everything from desktop productivity apps to dinosaurs circling a Vision Pro user in space, seemed impressive, but augmented reality promotional videos often do.</p>\n<p>They depict a seamless experience in which the elements of digital space merge with the user’s actual surroundings completely. When you actually put on the headset, though, you'll often find that the promotional video was pure aspiration and reality still has some catching up to do. That was my experience with HoloLens, and it has been that way with consumer AR devices like Nreal, too.</p>\n<p>That was not my experience with Vision Pro. To be clear, it wasn’t perfect. But it’s the first time I’ve tried an AR demo and thought, “Yep, what they showed in the promo video was pretty much how it really works.”</p></div><p><a href=\"https://arstechnica.com/?p=1945928#p3\">Read 58 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1945928&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e073202fe6ecbfae841e31743873e24bb16a6766c8359575831b2c9689871745","category":"Tech"}