{"title":"Retinal prosthesis edge detection (RPED) algorithm: Low-power and improved visual acuity strategy for artificial retinal implants","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305132","date":1718719200000,"content":"<p>by Yeonji Oh, Jonggi Hong, Jungsuk Kim</p>\r\n\r\nThis paper proposes a retinal prosthesis edge detection (RPED) algorithm that can achieve high visual acuity and low power. Retinal prostheses have been used to stimulate retinal tissue by injecting charge via an electrode array, thereby artificially restoring the vision of visually impaired patients. The retinal prosthetic chip, which generates biphasic current pulses, should be located in the foveal area measuring 5 mm × 5 mm. When a high-density stimulation pixel array is realized in a limited area, the distance between the stimulation pixels narrows, resulting in current dispersion and high-power dissipation related to heat generation. Various edge detection methods have been proposed over the past decade to reduce these deleterious effects and achieve high-resolution pixels. However, conventional methods have the disadvantages of high-power consumption and long data processing times because many pixels are activated to detect edges. In this study, we propose a novel RPED algorithm that has a higher visual acuity and less power consumption despite using fewer active pixels than existing techniques. To verify the performance of the devised RPED algorithm, the peak signal-to-noise ratio and structural similarity index map, which evaluates the quantitative numerical value of the image are employed and compared with the Sobel, Canny, and past edge detection algorithms in MATLAB. Finally, we demonstrate the effectiveness of the proposed RPED algorithm using a 1600-pixel retinal stimulation chip fabricated using a 0.35 μm complementary metal-oxide-semiconductor process.","author":"Yeonji Oh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e07687cea06ee25ed6a1b73e78c42b487c8b5e9cbdd0dea4ad81e1aa39a7f968","category":"Interdisciplinary"}