{"title":"From Issue 122: Alison Jackson has outdoor energy","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/from-issue-122-alison-jackson-has-outdoor-energy","date":1695281400000,"content":"\n      <p><em>This is an abridged version of an article from Rouleur 122: The Travel Edition. To read the full feature with 2023 Paris-Roubaix Femmes winner Alison Jackson, <a href=\"https://www.rouleur.cc/pages/subscribe\">subscribe today and receive your copy of the latest magazine</a>.</em></p>\n<p><em>*  *  *</em></p>\n<p>The bison and grain farm where Alison Jackson was born and raised, close to the Alberta/Saskatchewan border in rural western Canada, is about 7,000km from Roubaix, but the two places are even more distant figuratively. Professional cycling remains a largely Eurocentric affair and so when we hear or read that a cyclist grew up in a rural setting, a vision might come to mind: bucolic farms close to one another and fairly close to any number of towns. Accessible train lines. Paved roads with regular traffic. A lively market in the quaint village down the road, where fresh croissants are sold across the square from a charming café. And a vibrant cycling culture.</p>\n<p><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_Live_BANNER_3x1_C_2.jpg?v=1695295991\" /></a></p>\n<p>There’s that, and then there’s the western Canadian prairie, where people eat donuts not croissants, farmers drive pick-up trucks along flat gravel roads, there aren’t many quaint villages and there aren’t many people who cycle...or, for that matter, people. The prairies are notable mostly for their emptiness. How empty? England has 56 million people spread across 130,000 square kilometres. Canada’s three prairie provinces cover an area 15 times that size with maybe a million hardy rural souls scattered around like a handful of seeds in a huge garden.</p>\n<p>Not that it isn’t lovely in its own way. On a warm, lazy summer afternoon the view at the eastern edge of the Jackson farm is one of rich green and flaxen carpets of wheat, corn and canola stretching to the horizon, an immense and gently undulating agricultural landscape itself made small under the vast dome of the dusty blue atmosphere. The air and light are so pure they almost qualify as nutrition. It’s a terrain occupied by ranchland, farmland, bush, bog, lakes and rivers, as well as various prairie roads, some paved, most gravel, many of them utterly straight lines for 50km or more.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/122_-_closeups_-_by_Alessandra_Bucci-8480.jpg?v=1695051324\" />Growing up, Jackson could see as far as her imagination could take her, because there’s nothing to interrupt the view in any direction. The only thing stopping you from seeing clear to the Atlantic Ocean 3,500 kilometres to the east is the curve of the earth. Now that’s rural. It’s empty, it’s enormous, and the uncharitable might say that the most striking feature of this part of the world is its lack of striking features.</p>\n<p><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><em><strong>See Alison Jackson at this year's Rouleur Live</strong></em></a></p>\n<p>But you have to understand, it’s a landscape that can work both ways. It can either flatten you into insignificance beneath its ungraspable scale or it can open your eyes to help you see that most of the barriers in our lives are the ones we put in our own way. It’s a place that lets you create yourself. It’s a blank canvas, if you accept the responsibility for painting your own story.</p>\n<p>Jackson played every sport imaginable growing up on the farm. She went to school in Vermillion, the small town half an hour north. She played soccer, did gymnastics, ran and danced. She swam, because she was dying to learn how to surf. She had what her mother called “outdoor energy.” When she wasn’t doing something athletic, she was playing with her siblings. When she wasn’t doing that, she was helping her mother around the house. When she wasn’t doing that, she was helping her father with farm chores. And while she was doing any of those things, she was probably dancing. It’s an intrinsic part of her being.</p>\n<p>Over the last couple of years, Jackson, 34, has become something of an internet sensation for her joyous social media dance numbers. “She gets it,” EF-Tibco-SVB team boss Linda Jackson [no relation] said in an interview. “She’s energetic, she’s astute with marketing and she knows how to promote herself.”</p>\n<p>“Really, I always wanted to be a farmer,” says Jackson, back in Alberta for the 2023 Canadian Championships (she won the road race). “My dad always wanted my brother to be a farmer – he ended up being a teacher – and every time he’d take my brother around the farm to do things, I’d be there saying, ‘Take me, take me!’”</p>\n<p>Her sister and her husband have four kids, aged six, four, two and newborn. They’re building a new house just down the road from the main house, with an eye to eventually running the farm. “And so when I’m here,” says Jackson, “I’m mostly just a fun aunt. The truth is, the kids are just about the only people who can match my energy. Sometimes, I have my own personal contest with them, to see who has to quit and sit down first, me or the kids. So far, I’m winning.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/122_-_closeups_-_by_Alessandra_Bucci-8482.jpg?v=1695051347\" />But for all the outdoor energy and sports, there was one thing Jackson did not do much growing up, and that was ride a bike. “I did not grow up cycling,” she laughs. As she was close to graduating from high school, Jackson didn’t know what was next.</p>\n<p><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><em><strong>Subscribe to Rouleur magazine to read the full article</strong></em></a></p>\n<p>“I had no idea,” she says. “I wanted to be a professional dancer. Or a surfer! But I also wanted to do something with an NGO or a church group. All I knew was that I wanted to make the world a better place.”</p>\n<p>After a hiking expedition to the Himalayas and a one-year programme at the Columbia Bible College, she returned home to find that a labourer her father had hired had left a rusty old hardware store bicycle sitting in the barn. She hopped on it and realised it was a quicker way to get around than walking or running. She was 18. Jackson was still running, swimming and riding around on her battered old bike when a friend told her about triathlons, which was when it began to dawn on her just how natural an athlete she was.</p>\n<p>After a training period, she qualified at the World amateur level in her age group in 2008. While she was working as an intern at Columbia, she sought out training groups for swimming, cycling and running. The coach of the running club she’d joined was also the coach of the newly-started running team at Trinity Western University in Vancouver. They let Jackson ride on the bus with them to one race in Whistler, a race she ended up winning.</p>\n<p>Trinity Western offered her an athletic scholarship. Now 20, she had switched out the hardware store clunker in favour of a road bike her Alberta-based triathlon coach had loaned her. One day, her sister was visiting her in Vancouver and they decided to ride to the seniors' home to attend the knitting club. <span>“I really wanted to hear stories and so I called this old folks' home and asked if they had any old people there who like to tell stories. They said, uh, yeah, so I said, okay, do any of them knit? I bet we could start a knitting club.'”</span></p>\n<p><span>(Should you ever be fortunate enough to have a conversation of any length with Alison Jackson, this is the kind of thing that will happen. You will be following the chat in one direction, at which point Jackson will introduce a sub-strand of conversation so charming and quirky, and perhaps even tangentially related to the primary direction of the conversation, that you will be left grinning and somewhat dizzy. Just go with it.) </span></p>\n<p><span>“Anyway, we cycle over to knit with the old people, my sister on the rusty old bike and me on the other one. I only had one helmet, so I let her use it. But we're riding there and my sister thought the traffic was scary, so she heads back, which is fine, except she took the helmet. I go to the knitting club and on the way back some guy makes a left, doesn't even see me. I slam into him. The bike explodes and there's this dent in his door the size of me. I was okay except for this gash in my finger and its blood everywhere! Someone calls an ambulance and I end up at the hospital, but really just with a cut fingers.”</span></p>\n<p><span>The hospital sent a police officer to Jackson's apartment to to let her sister know Jackson had been in an accident and bring her to the hospital. After Jackson was released, she and her sister walked out the front door of the hospital and realised they had no way home. Jackson had arrived by ambulance and her sister by police car. “We were still such farm kids!” said Jackson. “We didn't know how to take a bus or a taxi! </span><span>We stood there thinking, now what are we supposed to do? We just started walking. It was two hours back to my apartment.”</span></p>\n<p><span>When the insurance money for the destroyed bike came through, she replaced the borrowed bike and used the remainder of the funds to get a new bike at one of the local shops. And so, at the age of 20 and already an elite athlete on a running and swimming scholarship at a Canadian college, Jackson finally got a bicycle of her own by starting a knitting club at a seniors' home to hear stories, cycling there, and then getting hit by a car on her way home. Pretty normal, right? </span></p>\n<p><span>*  *  *</span></p>\n<p><em>Alison Jackson will be at this year's Rouleur Live on Friday 3 and Saturday 4 November, 2023 at the Truman Brewery, London. <a href=\"https://www.rouleur.cc/pages/rouleur-live\">Buy your tickets today.</a></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e0783bc105ccf9c050f3c1501913f8747b0fcfe1861f450a1a3792b72fe55ce9","category":"Cycling"}