{"title":"Vuelta a España 2023 stage 21 preview: The grand finale in Madrid","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-21-preview","date":1694877810000,"content":"\n      <p><b>Distance: </b>101.1km<b><br /></b><b>Start location: </b>Hipódromo de la Zarzuela<b><br /></b><b>Finish location: </b>Madrid<b><br /></b><b>Start time: </b>17:14 CEST<b><br /></b><b>Finish time (approx): <span>19:58 CEST</span></b></p>\n<p>The Madrid finale of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> might not be as iconic as its <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> equivalent on the Champs-Élysées in Paris, but there are plenty of beautiful sites and grand architecture to rival it. While Paris has the Louvre, Madrid boasts their own world-leading museum with impressive art collection in the Prado; Paris has the Arc de Triomphe, Madrid the Puerta de Alcalá triumphal arch; and just as the peloton at the Tour de France memorably circumnavigates the Place de la Concorde, here the riders go past the Fountain of Neptune that stands proud at the centre of the Plaza de Cánovas del Castillo.</p>\n<div></div>\n<p>Also like the circuit in Paris, this 5.8km circuit in Madrid is made up mostly of long, wide boulevards for the riders to race along. Most of course involves riding up and down the tree lined Passo del Prado, with a brief diversion at the Plaza de Cibeles to travel up the famous shopping hub of Gran Via, before returning to finish at Plaza de Colón, where a monument to Christopher Columbus stands. There will therefore be a few sharp right-hand corners for the riders to negotiate, including one hairpin bend at the southern end of Passo del Prado about 1km from the finish, making this a fairly technical circuit.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/f0ee6.png?v=1694699641\" alt /></p>\n<p><em>Stage profile sourced via the Vuelta website </em></p>\n<p>It might be technical, but it’s also very flat, meaning a sprint finish is more guaranteed here than in any other stage of the Vuelta. In fact, each of the seven editions that have ended here since 2014 bucked the trend with a time trial in Santiago de Compostela have all been decided by a bunch finish. The duo of Luke Plapp and Julius Johansen came closer than most to surviving from a breakaway last year, only being reeled in 800m from the line, but the sprinters still had their way. At least, a lead-out man did: Juan Sebastian Molano produced such a powerful lead-out for his sprinter Pascal Ackermann that the German didn’t manage to come around his UAE Team Emirates teammate’s wheel, and Molano kept sprinting to the line to take victory.</p>\n<p>While the GC will have been decided by now, the points classification could still be in play. Given the nature of the whole race’s parcours, it would take a very in-form sprinter, and one who was capable of taking points in hillier terrain. But recent editions have seen sprinters who are specifically targeting the classification winning it ahead of the GC contenders who pick up points by default, so it is still possible that one of the fastmen could win the green jersey with a final haul of points today. Even sprinters who did enter Madrid leading the classification haven’t had enough left to actually take stage victory here in recent years, though — Andre Greipel was the last to do so in the green jersey way back in 2009. This deep into the Vuelta, it’s not necessarily the sprinter who has been quicker earlier in the race who wins, but whoever has recovered the best.</p>\n<h3>Contenders</h3>\n<p>The grand finale in Madrid is most certainly going to come down to a sprint finish, so it will be one last chance for the fast men who have made it through all 21 stages of this brutal Vuelta a España. <br /><br />A rider who will be hoping to repeat history from the 2022 edition will be <strong>Juan Sebastián Molano</strong> (UAE Team Emirates), who unexpectedly won the final stage last year. He’s looked in great form in the final bunch sprints this year, even claiming a stage win. He’ll be hoping to double up on his victories in Madrid. <br /><br />Leading the points classification, <strong>Kaden Groves</strong> (Alpecin-Deceuninck) will hope to take this stage. In the opening week, he looked almost unstoppable, taking two back-to-back wins. However, in the last sprint opportunities, luck was not on his side, with a dropped chain on one stage and a crash in the final few kilometres on stage 19. If everything goes his way in Madrid, we expect to see him on the podium. <br /><br />Stage 19 winner <strong>Alberto Dainese</strong> (DSM-Firmenich) will be a strong contender for this stage. His team lead-out was caught up in the same crash as Groves on stage 19, but he still managed to power to the line first. With his team back in action for the final stage, riders will want to keep an eye on the Italian rider. The rider behind him on stage 19 was <strong>Filippo Ganna</strong> (Ineos Grenadiers). He has now taken two second-place finishes in a bunch sprint and may fancy his chances one last time in this race. <br /><br />Other sprinters who may be in contention for taking the last stage will be <strong>Geoffrey Soupe</strong> (TotalEnergies), <strong>Edward Theuns</strong> (Lidl-Trek), <strong>Marijn van der Berg</strong> (EF Education-EasyPost), <strong>Milan Menten</strong> (Lotto Dstny), <strong>Dries Van Gestel</strong> (TotalEnergies), and <strong>Lewis Askey</strong> (Groupama-FDJ).</p>\n<h3>Prediction</h3>\n<p>We think <strong>Kaden Groves</strong> will take the final stage in the city of Madrid.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e07ceeb44a38f2525a1cc65a3d6195d598524cb841339c241eea9ead47803f9e","category":"Cycling"}