{"title":"An Increase in the Prevalence of Clinically-Relevant Resistance-Associated Substitutions in Four Direct-Acting Antiviral Regimens: A Study Using GenBank HCV Sequences","link":"https://www.preprints.org/manuscript/202407.0005/v1","date":1719814179000,"content":"Direct-acting antivirals (DAAs) revolutionized therapeutics of chronic hepatitis C. The emergence and transmission of HCV variants with resistance-associated substitutions (RASs) can undermine HCV treatment. This study aimed to assess the prevalence and temporal trends of RASs in HCV with a particular focus on the clinically-relevant RASs (cr-RASs). Near-complete HCV GenBank sequences archived in the Los Alamos HCV Database were analyzed. The study period was divided into two phases; before 2011 and 2011 onwards. Identification of RASs across three DAA classes; NS3, NS5A, and NS5B inhibitors was based on the 2020 EASL guidelines. The AASLD-IDSA recommendations were used to identify cr-RASs for three HCV genotypes/subtypes (1a, 1b, and 3) for four DAA regimens; ledipasvir/sofosbuvir; elbasvir/grazoprevir; sofosbuvir/velpatasvir; and glecaprevir/pibrentasvir. The final HCV dataset comprised 3443 sequences and the prevalences of RASs were 50.4%, 60.2%, and 25.3% in NS3, NS5A, and NS5B, respectively. In subtype 1a, resistance to ledipasvir/sofosbuvir was 32.8%, while resistance to elbasvir/grazoprevir was 33.0%. For genotype 3, resistance to sofosbuvir/velpatasvir and glecaprevir/pibrentasvir was 4.2% and 24.9%, respectively. Significant increase in cr-RASs was observed across the two study phases as follows: for ledipasvir/sofosbuvir in subtype 1a, cr-RASs increased from 30.2% to 35.8% (p=0.019); for elbasvir/grazoprevir in subtype 1a, cr-RASs increased from 30.4% to 36.1% (p=0.018); In subtype 1b, neither ledipasvir/sofosbuvir nor elbasvir/grazoprevir showed any cr-RASs in the first phase, but both were present at a prevalence of 6.5% in the second phase (p&amp;lt;0.001); for sofosbuvir/velpatasvir in genotype 3, cr-RASs increased from 0.9% to 5.2% (p=0.006); and for glecaprevir/pibrentasvir, cr-RASs increased from 12.0% to 29.1% (p&amp;lt;0.001). Rising prevalence of HCV RASs and cr-RASs was discernible. This highlights the necessity for ongoing surveillance and adaptation of novel therapeutics to manage resistance effectively. Updating of the clinical guidelines and treatment regimens are recommended to counteract the evolving resistance to DAAs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e07ee3e00618ff5adc1b7b62956aad480c96223a4c25c731b3aa63376fb7fd3f","category":"Interdisciplinary"}