{"title":"Exploring the return-on-investment for scaling screening and psychosocial treatment for women with common perinatal mental health problems in Malawi: Developing a cost-benefit-calculator tool","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308667","date":1723471200000,"content":"<p>by Annette Bauer, Martin Knapp, Jessica Weng, Dalitso Ndaferankhande, Edmund Stubbs, Alain Gregoire, Genesis Chorwe-Sungani, Robert C. Stewart</p>\r\n\r\nThis study sought to develop a user-friendly decision-making tool to explore country-specific estimates for costs and economic consequences of different options for scaling screening and psychosocial interventions for women with common perinatal mental health problems in Malawi. We developed a simple simulation model using a structure and parameter estimates that were established iteratively with experts, based on published trials, international databases and resources, statistical data, best practice guidance and intervention manuals. The model projects annual costs and returns to investment from 2022 to 2026. The study perspective is societal, including health expenditure and productivity losses. Outcomes in the form of health-related quality of life are measured in Disability Adjusted Life Years, which were converted into monetary values. Economic consequences include those that occur in the year in which the intervention takes place. Results suggest that the net benefit is relatively small at the beginning but increases over time as learning effects lead to a higher number of women being identified and receiving (cost‑)effective treatment. For a scenario in which screening is first provided by health professionals (such as midwives) and a second screening and the intervention are provided by trained and supervised volunteers to equal proportions in group and individual sessions, as well as in clinic versus community setting, total costs in 2022 amount to US$ 0.66 million and health benefits to US$ 0.36 million. Costs increase to US$ 1.03 million and health benefits to US$ 0.93 million in 2026. Net benefits increase from US$ 35,000 in 2022 to US$ 0.52 million in 2026, and return-on-investment ratios from 1.05 to 1.45. Results from sensitivity analysis suggest that positive net benefit results are highly sensitive to an increase in staff salaries. This study demonstrates the feasibility of developing an economic decision-making tool that can be used by local policy makers and influencers to inform investments in maternal mental health.","author":"Annette Bauer","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e07f703d1de77147b1c82006d4ed6f2bd70350d101ccb5633dff2628f676fec2","category":"Interdisciplinary"}