{"title":"Restoring University of Lagos’s Campus Wetlands and Green Corridors: Sustainable Ecotourism and Landscape Design Approach","link":"https://www.preprints.org/manuscript/202405.0379/v1","date":1715075651000,"content":"Teaching, learning, research, and development are all supported in a favorable atmosphere at the University of Lagos (UNILAG). The wetland systems made up of freshwater that are extremely biodiverse makeup about 10% of the total land area. Flooding, deforestation, excessive sedimentation, blockages to streams, abuse, overuse, and invasion of wetlands are some of the recent environmental challenges that the university faced. Urban heat island impacts, contaminants in the air, wetland degradation, social issues including stress, and a detachment from nature are all major concerns. With the green corridor behind the faculties of law and management science serving as a model supported by sustainability as a true foundation for UNILAG's campus landscapes, this article investigates the sustainable restoration of wetlands within the boundaries of the university. The use of qualitative techniques was employed, utilizing the Strengths-Weaknesses-Opportunities-Threats (SWOT) analysis. Additionally, a geospatial mapping of the wetlands and tributaries that connect the Lagos Lagoon was conducted to evaluate the intrinsic ecological goods and services through a series of analytical steps, beginning with an analysis of the land area, current biodiversity, hydrology, and its potential through landscape mapping and analysis. The biophysical setup, landscape features, climatic data analysis, the ecological goods and services derived from the wetlands, and the records of flooding and rainfall are all included in the geospatial evaluation and analysis. The educational institution's site planning for the remediation of its wetlands takes into account the actual evolution of the area's drainage network. Throughout the wetlands, low carbon emissions are generated by off-road bike lanes, trails for walking, and raised hardwood platforms. Combining native plant species and park furniture, the academic landscape atmosphere will be improved in each of the wetlands and aesthetic values. the country's \"University of First Choice\" and its biophysically restored wetlands will help illuminate the landscape while the green corridors have an innate ability to attract human affinity within the academic community. All of these elements are implemented following an environmentally friendly landscape planning, management, design model, and enforcement process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e083d6e06a8e912dc0071e00f506e977a3b5490ad49238434977e27d5c6e1b93","category":"Interdisciplinary"}