{"title":"Molecular Analysis of Metabolites Synthesized by Candida albicans and Staphylococcus aureus in In Vitro Cultures and Bronchoalveolar Lavage Specimens Reflecting Single or Duo-factor Pneumonia","link":"https://www.preprints.org/manuscript/202404.1033/v1","date":1713268468000,"content":"Current microbiological methods for pneumonia diagnosis require invasive specimen collection and time-consuming analytical procedures. There is a need for less invasive and faster methods to detect lower respiratory tract infection. The analysis of volatile metabolites excreted by pathogenic microorganisms provides the basis for developing such a method. Given the synergistic role of Candida albicans in increasing the virulence of pathogenic bacteria causing pneumonia and the cross-kingdom metabolic interactions between microorganisms, we compare the emission of volatiles from Candida albicans yeasts and the bacteria Staphylococcus aureus using single and mixed co-cultures and apply that knowledge to human in vivo investigations. Gas-chromatography-mass spectrometry (GC-MS) analysis resulted in the identification of sixty-eight volatiles that were found to have significantly different levels in cultures compared to reference medium samples. Certain volatiles found in co-culture originated mainly from C. albicans metabolism (e.g., isobutyl acetate), whereas other volatiles primarily came from S. aureus (e.g., ethyl 2-methylbutyrate). Isopentyl valerate reflects synergic interactions of both microbes, as its level in co-cultures was found to be approximately three times higher than the sum of its amounts in monocultures. Hydrophilic-lipophilic balanced (HLB) coated meshes for thin-film microextraction (TFME) were used to pre-concentrate volatiles directly from bronchoalveolar lavage (BAL) specimens collected from patients suffering from ventilation-associated pneumonia (VAP) that was caused explicitly by C. albicans and S. aureus. GC-MS analyses confirmed the existence of in vitro-elucidated microbial VOCs in human specimens. Significant differences in BAL-extracted amounts respective to the pathogen causing pneumonia were found. The model in vitro experiments provided evidence that cross-kingdom interactions between pathogenic microorganisms affect the synthesis of the volatile compounds. The TFME meshes coated with HLB particles proved to be suitable for extracting VOCs from human material, enabling the translation of in vitro experiments on the microbial volatilome to the in vivo situation involving infected patients. This indicates the direction that should be taken for further clinical studies on VAP diagnosis based on volatile analysis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e08f48ebb66c2e395df13d752c8eb2c9ff73f1d55ac00a55baef314974514526","category":"Interdisciplinary"}