{"title":"Diverse Genetic Conflicts Mediated by Molecular Mimicry and Computational Approaches to Detect Them","link":"https://www.preprints.org/manuscript/202403.1765/v1","date":1711629111000,"content":"In genetic conflicts, driver and killer elements achieve biased survival, replication, or transmission over sensitive and targeted elements through a wide range of molecular mechanisms, including mimicry. Driving mechanisms manifest at all organismal levels, from the biased propagation of individual genes, as demonstrated by transposable elements, to the biased transmission of genomes, as illustrated by viruses, to the biased transmission of cell lineages, as in cancer. Targeted genomes are vulnerable to molecular mimicry through the conserved motifs they use for their own signaling and regulation. Mimicking these motifs enables a selfish element to control core target processes, and can occur at the sequence, structure, or functional level. Molecular mimicry was first appreciated as an important phenomenon more than twenty years ago. Modern genomics technologies, databases, and machine learning approaches offer tremendous potential to study the distribution of molecular mimicry across genetic conflicts in nature. Here, we explore the theoretical expectations for molecular mimicry between conflicting genomes, the trends in molecular mimicry mechanisms across known genetic conflicts, and outline how new examples can be gleaned from population genomic datasets. We discuss how mimics involving short sequence-based motifs or gene duplications can evolve convergently from new mutations. Whereas, processes that involve divergent domains or fully-folded structures occur among genomes by horizontal gene transfer. These trends are largely based on a small number of organisms and should be reevaluated in a general, phylogenetically independent framework. Currently, publicly available databases can be mined for genotypes driving non-mendelian inheritance patterns, epistatic interactions, and convergent protein structures. A subset of these conflicting elements may be molecular mimics. We propose approaches for detecting genetic conflict and molecular mimicry from these datasets.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e0a654233b35e490a89b58d31159773a44696980ed5eeab9f095159a348537d4","category":"Interdisciplinary"}