{"title":"Final Fantasy VII Rebirth ได้คะแนนเฉลี่ย 93/100 คะแนนดีสุดนับตั้งแต่ FFIX","link":"https://www.blognone.com/node/138363","date":1708667976000,"content":"<div><div><div><p>Final Fantasy VII Rebirth เกมภาคที่ 2 ของการหยิบ Final Fantasy VII (1997) มาสร้างใหม่ มีบทวิจารณ์จากสื่อต่าง ๆ ออกมาแล้วได้คะแนนเฉลี่ยสูงถึง 93/100 คะแนนจาก Opencritic และ Metacritic หลายสื่อชมว่าตัวเกมยกระดับ และแก้ข้อสังเกตจากภาค Remake ได้ดีแผนที่แบบโลกเปิดมีความลึกหลายระดับแม้จะเนื้อหาที่เกิน ๆ และมินิเกมที่น่าเบื่อหลุดมาบ้างก็ตาม โดยมีตัวอย่างบทวิจารณ์จากสื่อดังนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cea13ac6fd3a2fafa4da922ebbc11f53.jpeg\" /></p>\n<p><strong><a href=\"https://www.gamespew.com/2024/02/final-fantasy-vii-rebirth-review/\">GameSpew</a> 10/10</strong>: Rebirth เหนือกว่า Remake ในทุกด้าน มันเป็นผลงานชิ้นเอก มันบอกเล่าเรื่องราวที่ยิ่งใหญ่กว่าพร้อมจุดหักมุมที่ทำให้ผู้เล่นอินได้ ถึงแม้ว่าองค์ประกอบเรื่องราวใหม่ ๆ อาจทำให้ผู้เล่นบางคนไม่เข้าใจ แต่มันทำให้เกมดูสดใหม่ขึ้นมันเกินความคาดหมาย ต่อยอดจากเกมต้นฉบับและ Remake อย่างแท้จริง Square Enix มอบภาคต่อที่ให้ความรู้สึกยิ่งใหญ่และดีขึ้นในทุก ๆ ด้าน</p>\n<p><strong><a href=\"https://noisypixel.net/final-fantasy-vii-rebirth-review/\">Noisy Pixel</a> 10/10</strong>: Rebirth เป็นภาคต่อที่เหนือความคาดหมายในเกือบทุกด้าน มันผสมผสานการเล่าเรื่องที่น่าสนใจ, การต่อสู้ที่สร้างสรรค์ และเนื้อหาที่น่าสนใจมากมายเพื่อมอบการผจญภัยที่ยากจะลืมเลือน ด้วยความที่ภาคต่อนี้ถือเป็นการปูทางไปสู่ภาคสุดท้าย เลยทำให้แฟน ๆ ต่างตั้งตารอสิ่งที่จะเกิดขึ้นต่อไปอย่างใจจดใจจ่อ Square Enix ก้าวข้ามตัวเองได้อย่างแท้จริง โดยแสดงให้เห็นถึงความลุ่มลึก และศักยภาพที่จักรวาล Final Fantasy VII ทำได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/798fe5edf5f1c455b76a5f57718f34d2.jpeg\" /></p>\n<p><strong><a href=\"https://jp.ign.com/final-fantasy-vii-remake-part-2/73595/review/vii\">IGN Japan</a> 10/10</strong>:  Rebirth อัดแน่นไปด้วยเนื้อหาที่สร้างขึ้นมาอย่างดี แม้ว่าการเดินทางครั้งใหม่ของ Cloud จะยังไม่เสร็จสิ้น แต่ Rebirth ก็นำเสนอเรื่องราวสะเทือนอารมณ์เกิดขึ้นที่ทำได้ด้วยการรีเมคเท่านั้น แม้ว่าจะมีมินิเกมจำนวนเล็กน้อยที่น่าเบื่อ แต่ Final Fantasy VII Rebirth ก็เป็นประสบการณ์ที่ยอดเยี่ยมตั้งแต่การสำรวจไปจนถึงการต่อสู้ มันมอบคุณภาพ, ปริมาณ และความหลากหลายในเนื้อหามากจนแทบจะไม่มีเนื้อหาอะไรที่เหมือนกันเลย</p>\n<p><strong><a href=\"https://www.gameinformer.com/review/final-fantasy-vii-rebirth/cracking-the-planet-wide-open\">Game Informer</a> 8.5/10</strong>: เกมภาคนี้มีเนื้อหากว้างขวาง และถึงแม้จะมีข้อดีมากมาย เช่น วิธีสำรวจโลกอันเป็นที่รักแบบใหม่ และสถานที่ท่องเที่ยวที่หลากหลาย แต่มันก็มาพร้อมกับข้อเสีย เกมของพวกเขาไม่ได้แตกต่างจากเกมอื่น ๆ ที่แฟน ๆ เกมแนวนี้เคยสัมผัส แต่การเล่นเป็นตัวละครที่น่ารักก็ช่วยบรรเทาความเจ็บปวดนี้ได้ แต่ความน่าเบื่อ และเนื้อหาที่บวม ๆ เกิน ๆ ของส่วน Open World อาจขัดขวางทำให้ Rebirth เปล่งประกายน้อยลง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3fca2b608f41fa865a1207fa8671eca1.jpeg\" /></p>\n<p><strong><a href=\"https://gamerescape.com/2024/02/22/review-final-fantasy-vii-rebirth/\">Gamer Escape</a> 8/10</strong>: ตอนนี้เราทุกคนควร Move On จาก Final Fantasy VII เวอร์ชันต้นฉบับได้แล้ว Rebirth พลิกโฉมให้ FFVII กลายเป็นสิ่งที่ยิ่งใหญ่ และแปลกใหม่ แต่เกมก็มีจุดอ่อนเช่นการต่อสู้ มันมีจุดที่ทำให้เล่น ๆ หยุด ๆ อยู่เยอะ  แต่หากคุณตั้งตารอคอยเกมนี้ คุณจะไม่ผิดหวัง</p>\n<p><strong><a href=\"https://evilgamerz.com/final-fantasy-vii-rebirth/\">Evilgamerz</a> 7.5/10</strong>: การเขียนบทวิจารณ์เกมนี้เป็นการวิจารณ์ที่ยากที่สุด เพราะว่า Rebirth ทำทุกอย่างเพื่อให้คนรักเกมนี้มากที่สุดเท่าที่จะเป็นไปได้ แม้จะมีการปรับเปลี่ยนเนื้อเรื่อง แต่มันยังคงดีเยี่ยม เพลงประกอบก็ยอดเยี่ยม และกราฟิกในระหว่างคัตซีนก็ทำได้ดี ส่วน Open World ไม่ได้แย่แต่มันเต็มไปด้วยเนื้อหาที่ไม่มีความหมาย ซึ่งมันทำหน้าที่เป็นตัวเติมเต็มให้โลกและการต่อสู้ได้ไม่เพียงพอ บางทีการเล่นก็ถูกขัดจังหวะบ่อยครั้งจนผลลัพธ์ทั้งหมดโน้มไปทาง \"ก็โอเค\" มากขึ้น ซึ่งนั่นไม่ใช่สิ่งที่เกมนี้ควรเป็น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/950693316ae4cff00394b0706ae1fb19.jpg\" /></p>\n<p>สำหรับเกมซีรี่ส์ Final Fantasy ภาคสุดท้าย(ที่ไม่นับภาคเสริม)ที่คะแนนรวมแตะ 90/100 คือสมัย Final Fantasy XII เมื่อปี 2006 ที่ทำคะแนนได้ 92/100 ในขณะที่ภาค XIII ทำได้ที่ 83/100, ภาค XIV: A Realm Reborn ทำได้ 86/100, ภาค XV ทำได้ 81/100 และภาค XVI ทำได้ 87/100</p>\n<p>Final Fantasy VII Rebirth วางจำหน่ายวันที่ 29 กุมภาพันธ์นี้บน PS5 ราคาแบบดิจิทัลจะเริ่มต้นที่ 2,290 บาท ในขณะที่แบบแผ่นนั้นราคาจะแตกต่างกันไปในละร้านเนื่องจากเกมภาคนี้ Sony ประเทศไทยไม่ได้เป็นตัวแทนจัดจำหน่ายแบบตอน Final Fantasy XVI</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/31cd6df37447ccbb66aeab7e5a4c8a7a.jpeg\" /></p>\n<p>ที่มา - <a href=\"https://www.metacritic.com/game/final-fantasy-vii-rebirth/\">Metacritic</a> และ <a href=\"https://opencritic.com/game/15136/final-fantasy-vii-rebirth\">Opencritic</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/final-fantasy\">Final Fantasy</a></div><div><a href=\"/topics/square-enix\">Square Enix</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e0c6fbe3648d6c013e05796ec1dc0d85766b05d5cfc079befa2896ff7eca8575","category":"Thai"}