{"title":"Managed honeybee hives negatively affect the reproduction of native plants in a dryland nature reserve","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14646?af=R","date":1717565101000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6649e3ee-1cc9-47d3-8514-3af87593d434/jpe14646-toc-0001-m.png\" alt=\"Managed honeybee hives negatively affect the reproduction of native plants in a dryland nature reserve\" />\n<p>Beekeeping is increasingly turning to natural areas in search of better quality honey; however, increased honeybee abundance in the field could influence the reproduction of native plants. Our results show that the introduction of managed hives negatively affected the reproduction of self-incompatible native plants. This result allows us to make several recommendations for conservation and management actions concerning beekeeping in natural areas, regarding the among-year rotation of the location of hives, the number of hives per site, and the need to monitor the reproduction of self-incompatible species.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe honeybee, <i>Apis mellifera</i>, stands out for its positive image due to its contribution to crop pollination and honey production, which facilitated its widespread distribution. However, large apiaries resulting in high honeybee densities could increase pollination frequency while increasing competition for floral resources, ultimately affecting native plant fitness.\n\nWe studied the impact of managed honeybee hives on pollination and reproductive success of native plants in Villavicencio Nature Reserve, Mendoza, Argentina. During the flowering peak, we studied pollination and reproduction of three native plant species (<i>Larrea divaricata</i>, <i>L. cuneifolia</i> and <i>Zuccagnia punctata</i>) near and far from the hives. We estimated pollen deposition on flower stigmas, pollen tubes developed in flower pistils, fruit set, seed set and seed viability.\n\nWe found that the honeybee hives had a positive effect on the reproduction of the self-compatible species, <i>L</i>. <i>divaricata</i>. For the self-incompatible species, results differed among species: Hives had positive effects on the pollination and negative effects on the reproduction of <i>L</i>. <i>cuneifolia</i>, while they had negative effects on the reproduction of <i>Z</i>. <i>punctata</i>.\n\n<i>Synthesis and applications.</i> Beekeeping is increasingly turning to natural areas in search of better quality honey; however, increased honeybee abundance in the field could influence the reproduction of native plants. Our results show that the introduction of managed hives negatively affected the reproduction of self-incompatible native plants. This result allows us to make several recommendations for conservation and management actions concerning beekeeping in natural areas, regarding the among-year rotation of the location of hives, the number of hives per site, and the need to monitor the reproduction of self-incompatible species.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLa abeja de la miel, <i>Apis mellifera</i>, destaca por su imagen positiva gracias a su contribución a la polinización de cultivos y a la producción de miel, lo que ha facilitado su amplia distribución. Sin embargo, los grandes apiarios que dan lugar a altas densidades de abejas melíferas podrían aumentar tanto la frecuencia de polinización como la competencia por los recursos florales, lo que en última instancia podría afectar el éxito reproductivo de las plantas nativas.\n\nEstudiamos el impacto de colmenas de la abeja de la miel sobre la polinización y la reproducción de plantas nativas en la Reserva Natural Villavicencio, Mendoza, Argentina. Durante el pico de floración, estudiamos la polinización y la reproducción de tres plantas nativas (<i>Larrea divaricata</i>, <i>L</i>. <i>cuneifolia</i> y <i>Zuccagnia punctata</i>) cerca y lejos de las colmenas. Estimamos el depósito de polen en los estigmas de las flores, los tubos polínicos desarrollados en los pistilos, la producción de frutos y semillas y la viabilidad de las semillas.\n\nObservamos que las colmenas de abejas de la miel tienen un efecto positivo sobre la reproducción de la especie autocompatible, <i>L</i>. <i>divaricata</i>. Mientras que los resultados difirieron entre las especies autoincompatibles: las colmenas tuvieron efectos positivos sobre la polinización y negativos sobre la reproducción de <i>L</i>. <i>cuneifolia</i>, mientras que tuvieron efectos negativos sobre la reproducción de <i>Z</i>. <i>punctata</i>.\n\n<i>Síntesis y aplicaciones</i>. La apicultura se vuelca cada vez más hacia zonas naturales en busca de una mejor calidad de miel; sin embargo, el aumento de la abundancia de abejas melíferas en el campo podría influir en la reproducción de plantas nativas. Nuestros resultados muestran que la introducción de colmenas manejadas afectó negativamente a la reproducción de plantas nativas autoincompatibles. Este resultado nos permite recomendar varias acciones de conservación y gestión relativas a la apicultura en áreas naturales, incluyendo la rotación interanual de la ubicación de las colmenas, el número de colmenas por sitio y la necesidad de vigilar la reproducción de especies autoincompatibles.\n</p>","author":"María Paula Pascual Tudanca, \nHugo Debandi, \nDiego P. Vázquez","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"e0d7de412bb5640855e6e9cab33b6f6d71c087f9b180ffc830abaee4172d5970","category":"Environment"}