{"title":"Can a $3,500 headset replace your TV? We tried Vision Pro to find out","link":"https://arstechnica.com/?p=2001721","date":1707493316000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/Vision-Pro-accessories-980x600.jpeg\" /></div>\n          <p>\n            The Apple Vision Pro with AirPods Pro, Magic Keyboard, Magic Trackpad, and an Xbox Series X|S controller.                          [credit:\n                              Samuel Axon                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>The Vision Pro is the strangest product Apple has introduced in the time I've been covering the company. By now, it's well established that the headset is both impressively cutting-edge and ludicrously expensive.</p>\n<p>You could certainly argue that its price means it’s only for Silicon Valley techno-optimists with too much money to burn or for developers looking to get in on the ground floor on the chance that this is the next gold rush for apps. But the platform will need more than those users to succeed.</p>\n<p>Part of Apple’s pitch behind the price tag seems to be that the Vision Pro could replace <em>several</em> devices, just like the iPhone did back in the late 2000s. It could replace your laptop, your tablet, your 4K TV, your video game console, your phone or other communications device, your VR headset, and so on. If it truly replaced all of those things, the price wouldn’t seem quite so outrageous to some.</p></div><p><a href=\"https://arstechnica.com/?p=2001721#p3\">Read 54 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2001721&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e0d8748de744b9d0acea7b5a3ed49f0eb279fb2348dfb66570f7b7f22fd13a12","category":"Tech"}