{"title":"CEO: Raspberry Pi is “where we said we’d be” for 2023, recovery to follow","link":"https://arstechnica.com/?p=1940153","date":1684440945000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/pi_factory.jpg\" alt=\"Raspberry Pi on prodution line\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/pi_factory.jpg\">Enlarge</a> <span>/</span> It's hard to recover from a shortage, especially when buyers take on stockpiling habits, Raspberry Pi CEO Eben Upton said in a recent interview. But the British company is on track to return some stock to individual buyers. (credit: Raspberry Pi)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Having to make the pandemic-pressure choice to either disappoint hobbyists and educators or let small businesses built on his company's platform falter was \"the single hardest decision I've had to make in my business career,\" Raspberry Pi co-founder and CEO Eben Upton says in <a href=\"https://www.youtube.com/watch?v=-_aL9V0JsQQ\">a new video interview</a>.</p>\n<p>Jeff Geerling, having flown to Raspberry Pi's headquarters in Cambridge, England, with his supporters' backing, digs in on <a href=\"https://arstechnica.com/gadgets/2022/12/raspberry-pi-inventory-improving-could-reach-pre-pandemic-levels-in-2023/\">Upton's \"Supply chain update\"</a> from December 2022. Upton said then that by the third quarter of 2023, \"hundreds of thousands\" of mainstream Pi units should be available, with Zero units, then 3 and 3B models, then 4.</p>\n<div><div></div><p>Jeff Geerling interviewing Raspberry Pi CEO and co-founder Eben Upton. </p></div>\n<p>Upton told Geerling that \"we are where we said we'd be in December,\" with a \"lousy first quarter\" of 750,000-800,000 units produced due to shifting production for the Christmas period. But now real progress on backlog-filling and availability is being made. Upton expects to move 2 million Pis in the second quarter, then \"unconstrained\" third and fourth quarters of 2023.</p></div><p><a href=\"https://arstechnica.com/?p=1940153#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1940153&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e0e3f4e9803231cb4e42920e5c35fba0ca34935c572ba71429098377cec58dc9","category":"Tech"}