{"title":"“I do think that accessibility is a really major thing that has come [out] of [the] pandemic”: The lived experiences of resilience and health-related quality of life among a diverse sample of graduate students during the COVID-19 pandemic","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309171","date":1724162400000,"content":"<p>by Katie J. Shillington, Shauna M. Burke, Tara Mantler, Jennifer D. Irwin</p>\r\n\r\nThe COVID-19 pandemic has negatively impacted the mental health and wellbeing of post-secondary students. Resilience has been found to serve as a protective factor against mental distress among students during the pandemic. Despite the plethora of research that exists on post-secondary students during this crisis, most studies exploring students’ health and resilience are quantitative and lack diversity. To date, the lived experiences of health-related quality of life (HRQOL) and resilience among graduate students representing diversity in age, gender, ethnicity, parental status, university, degree, and faculty during the COVID-19 pandemic remain unknown. As a part of a larger study, the purpose of this qualitative paper was to understand the lived experiences of resilience and HRQOL among a diverse sample of graduate students approximately 18 months into the COVID-19 pandemic in Ontario, Canada. A total of 14 students participated in semi-structured interviews exploring HRQOL domains, factors that supported/undermined participants’ resilience, challenges/barriers to being resilient, and participants’ inner strength. Thematic analysis revealed 5 themes: (1) cultural influences on resilience; (2) the role of privilege/power in shaping resilience; (3) how life stage and past experiences support resilience; (4) how the COVID-19 pandemic has undermined the resilience of equity-deserving groups; and (5) the role of disability/chronic pain. This work presents a unique dichotomy between how the COVID-19 pandemic has disrupted the lives of some graduate students, while simultaneously creating opportunities for others to thrive. Findings from this work underscore the importance of creating inclusive and accessible educational spaces to support graduate students’ resilience and HRQOL currently, and in times of crisis.","author":"Katie J. Shillington","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e0e55c7368c147939778be48dbd3cd28a4bb1737bd5aa93c94dbedc09d90b390","category":"Interdisciplinary"}