{"title":"Evaluation of quadriceps muscle cross-sectional area using an ultrasonic diagnostic equipment with a wide field of view","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311043","date":1727186400000,"content":"<p>by Yasumoto Matsui, Marie Takemura, Yasuo Suzuki, Tsuyoshi Watanabe, Keisuke Maeda, Shosuke Satake, Hidenori Arai</p>\r\n\r\nSkeletal muscle index measurement via dual-energy X-ray absorptiometry or bioelectrical impedance analysis is used to evaluate muscle mass when diagnosing sarcopenia. However, inherent challenges exist with these methods. We previously focused on muscle mass evaluation in the quadriceps femoris by using computed tomography (CT). In this observational study, we utilized a new ultrasound device with a wide field of view that can obtain CT-like images and investigated its usefulness. Reproducibility was investigated by calculating the intra- and inter-examiner intraclass correlation coefficient (ICC) by using three examiners and performing five measurements in 12 participants. In 123 participants (48 men, 75 women, mean age 78.2 ± 8.1 years), we investigated the correlation between the quadriceps cross-sectional area measured with supine ultrasound and CT images as well as between supine and sitting ultrasound images. Unadjusted, age-adjusted, and age–sex-adjusted correlations were calculated. Reproducibility was excellent (intra-examiner ICC[1,1]: 0.978, 0.987, and 0.994; inter-examiner ICC[2,1]: 0.993). The unadjusted, age-adjusted, and age–sex-adjusted correlations between the quadriceps cross-sectional area measured using supine ultrasound and CT were 0.949, 0.940, and 0.894, respectively. For sitting ultrasound, the corresponding values were 0.958, 0.953, and 0.912, respectively. Correlations between the supine and sitting ultrasound measurements were also good, with corresponding values of 0.952, 0.945, and 0.904, respectively. The tested ultrasound device showed excellent measurement reproducibility and had good correlations with CT images. Further studies with an increased numbers of clinical cases and additional evaluations should allow the device to become a screening tool for diagnosing sarcopenia.","author":"Yasumoto Matsui","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e1028458cd335bf7b4c6236b17da8117ae0194b9d563558bcca0861ca9f46c4d","category":"Interdisciplinary"}