{"title":"Development of a pharmacy-based HIV PrEP service delivery intervention for Washington, District of Columbia (DC): A study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311694","date":1729087200000,"content":"<p>by Waimar Tun, Mamaswatsi Kopeka, Donaldson F. Conserve, Jennifer Gomez-Berrospi, Samuel Janson, Courtney Johnson, Adedotun Ogunbajo, Ngozi Joy Idika, Jenesis Duran, Arianna Lendino, Bezawit Bekele, Maya Rezende Tsao, Sumaiya Nezam, Arona Dieng, Naana Koranteng-Yorke, Bridget Martin, BRIDGE Team , Demarc Hickson</p>\r\n\r\nPharmacy-based PrEP service delivery models can help address many of the barriers that inhibit the uptake of PrEP. In an increasing number of states, legislation has been passed, or is under consideration, to allow pharmacists to initiate PrEP without a prescription from a physician or other prescriber. However, there is not yet legislation in Washington, DC to allow pharmacy-based PrEP despite its potential to curb new cases of HIV, which disproportionately affect the Black community in the area. The DC Ends HIV Plan has a goal of less than 130 new cases of HIV per year by 2030, which would require that over 13,000 high-risk residents use PrEP. However, in 2021 only 6,724 Washingtonians were taking PrEP. This study seeks to address the absence of critical formative research into the factors that would influence the implementation of pharmacy-based PrEP in Washington DC using the Implementation Mapping (IM) framework. A needs assessment will be conducted through in-depth interviews (IDIs) with pharmacists (n = 6), PrEP providers (n = 6), current PrEP users (n = 6), DC Department of Health officials (n = 2), DC Board of Pharmacy officials (n = 4) and pharmacy-based PrEP experts (n = 4) to provide input on the operational aspects of pharmacy-based PrEP model as a strategy to increase PrEP uptake. Information gathered through this needs assessment will be used to develop standard operating procedures for the introduction of pilot pharmacy-based PrEP into community-based retail pharmacies.","author":"Waimar Tun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e10a5494fc32f8c5bb6947c4bc42118bc79db7b25cb53f0eea73e12d0e0c8e17","category":"Interdisciplinary"}