{"title":"COVID-19 vaccine effectiveness among South Asians in Canada","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003490","date":1722520800000,"content":"<p>by Rahul Chanchlani, Baiju R. Shah, Shrikant I. Bangdiwala, Russell J. de Souza, Jin Luo, Shelly Bolotin, Dawn M. E. Bowdish, Dipika Desai, Karl Everett, Scott A. Lear, Mark Loeb, Zubin Punthakee, Diana Sherifali, Gita Wahi, Sonia S. Anand</p>\r\n\r\nWe evaluated the effectiveness of COVID-19 vaccines among South Asians living in Ontario, Canada compared to non-South Asians and compared the odds of symptomatic COVID-19 infection and related hospitalizations and deaths among non-vaccinated South Asians and non-South Asians. This was a test negative design study conducted in Ontario, Canada between December 14, 2020 and November 15, 2021. All eligible individuals &gt;18 years with symptoms of COVID-19 were subdivided by ethnicity (South Asian vs other) and vaccination status (vaccinated versus not). The primary outcome was vaccine effectiveness as defined by COVID-19 infections, hospitalizations, and deaths, and secondary outcome was the odds of COVID-19 infections, hospitalizations, and death comparing non-vaccinated South Asians to non-vaccinated non-South Asians. 883,155 individuals were included. Among South Asians, two doses of COVID-19 vaccine prevented 93.8% (95% CI 93.2, 94.4) of COVID-19 infections and 97.5% (95% CI 95.2, 98.6) of hospitalizations and deaths. Among non-South Asians, vaccines prevented 86.6% (CI 86.3, 86.9) of COVID-19 infections and 93.1% (CI 92.2, 93.8) of hospitalizations and deaths. Non-vaccinated South Asians had higher odds of symptomatic SARS-CoV-2 infection compared to non-vaccinated non-South Asians (OR 2.35, 95% CI 2.3, 2.4), regardless of their immigration status. COVID-19 vaccines are effective in preventing infections, hospitalizations and deaths among South Asians living in Canada. The observation that non-vaccinated South Asians have higher odds of symptomatic COVID-19 infection warrants further investigation.","author":"Rahul Chanchlani","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e1146f6f80551ad6a2f41cc85f6dc6a93887aa28ff3adb7afc1520a8e6b88ea5","category":"Environment"}