{"title":"280 AntagomiR-22-3p Injection alters miRNA expression and muscle fiber type of intrauterine growth restricted lambs","link":"https://academic.oup.com/jas/article/102/Supplement_3/197/7757446?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>microRNAs (miRNA) are small non-coding RNAs that modulate muscle satellite cell proliferation. Previous research identified miR-22-3p as differentially expressed during ovine muscle development and in vitro experiments showed that antagomir-22-3p treatment enhanced satellite cell proliferation. The objective of this study was to test in vivo vascular injection of antagomir-22-3p in lateral saphenous vein on miRNA and HDAC family mRNA expression in intrauterine growth restricted lambs. Pregnant ewes (n = 18) with twins were either fed at 100% of NRC (CON) or nutrient restricted (60% NRC; NR) from gestational d 85 to parturition. On d 12 of age, NR lambs (n = 8) were randomly selected and given a systemic injection of antagomir-22-3p in the lateral saphenous vein of the right leg (MIR-NR). CON lambs (n = 8) were also randomly selected and given a sham injection of PBS in the lateral saphenous vein of the right leg (SHAM-CON). Antagomir-22-3p was reconstituted in phosphate buffered saline (PBS). Injections were given for 3 consecutive days and lambs harvested 24 d later. Blood samples were collected from each lamb weekly to monitor miR-22-3p expression. Lambs were slaughtered 24 d after the first injection and muscle mass measured. Muscle samples were removed for miR-22-3p and mRNA expression of potential targets. Cell-free circulating RNA was isolated from blood samples and miR-22-3p expression examined over time. Cell-free circulating miR-22-3p expression was downregulated (<span>P</span> &lt; 0.05) for MIR-NR compared with SHAM-CON on d 14 after injection. On d 21 after injection, miR-22-3p expression in plasma tended (<span>P</span> = 0.08) to be down-regulated in MIR-NR compared with SHAM-CON. Lamb body weight and muscle weights at harvest were similar between MIR-NR and SHAM-CON treatments. In heart and semimembranosus (SM) muscles, expression of miR-22-3p was down-regulated (<span>P</span> &lt; 0.05) in MIR-NR compared with SHAM-CON. In the gastrocnemius and semitendinosus muscle, miR-22-3p expression was unchanged (<span>P</span> &gt; 0.05). The number of type I and IIa muscle fibers were greater (<span>P</span> &lt; 0.05) for MIR-NR than SHAM-CON. Muscle fiber area of Type I, IIa or IIx fibers did not differ (<span>P</span> &gt; 0.05) by treatment. The number of type IIx fibers did not differ (<span>P</span> &gt; 0.05) between treatments. MIR-NR treatment appears to shift muscle fibers towards more oxidative metabolism and down-regulate HDAC-1, 3, and 11 and SIRT6 in SM. The systemic injection of antagomir-22-3<span>P</span> down-regulated miR-22-3p expression in circulation and in muscle tissues, which altered expression of HDAC/SIRT genes involved in muscle fiber type conversion and hypertrophy.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e120f5c7e9809b5ba5961c98fa9c006d51ce146cb11ffe5d1b6880daf6e707bb","category":"Environment"}