{"title":"Tandem bicycles explained, from how to ride them to all the different types","link":"https://www.bikeradar.com/advice/buyers-guides/tandem-cycles-explained/","date":1697454013000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/05/cecil-tandem-15-cf9ca36-scaled.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Cecil the tandem\" title=\"Cecil the tandem\" />                                            <p>Tandem cycles often conjure images of romantic pairings, typified by the song <em>Daisy Bell (Bicycle Built for Two)</em>. However, tandems aren’t just for courting lovers. They can be used for all kinds of cycling, from touring to racing and for riders with disabilities.</p>\n<p>This guide to tandems will give you an understanding of the different types of tandem cycles. We cover everything from traditional two-person tandems to family options (triplet and quad) and even side-by-side and recumbent tandems, and explain how to choose the right one for you and your tandem team.</p>\n<p>You’ll also find tips on getting started on tandems and the roles of captain and stoker, as well as explaining the different drivetrain options so you’re fully prepared when you enter the market to buy a tandem.</p>\n<h2>What is a tandem?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bespoked 2021 custom bike gallery BikeRadar\" title=\"Bespoked 2021 custom bike gallery BikeRadar\" />\n\n</div><div><figcaption><span><i></i> We fell in love with this well-abused Bilenky tandem.</span></figcaption><span> <i>Will Jones / Immediate Media</i></span></div>\n<p>Typically, a tandem is a bicycle designed for two riders. The riders move ‘in tandem’, cycling together.</p>\n<p>Tandems have been around for about as long as bicycles (solo bikes in tandem parlance).</p>\n<p>They’re available in a wide variety of styles to suit the needs of different riders, from regular upright bicycles designed for two riders to tandems that mix recumbent and upright types.</p>\n<p>While they are less common, you can get family tandems with three (triplet) or even four (quad) seats. There are also tandems where the riders sit side by side rather than one in front of the other.</p>\n<p>Only one of the riders controls the cycle (captain), with the other providing additional power (stoker).</p>\n<p>A traditional-style tandem has a single frame, two wheels and an inter-connected drivetrain between the captain and stoker, linked together with a timing chain.</p>\n<h2>What are the advantages of tandem bikes?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Visually impaired female triathlete training together with her guide and coach on a tandem bicycle.\" title=\"Visually impaired female triathlete training together with her guide and coach on a tandem bicycle\" />\n\n</div><div><figcaption><span><i></i> Tandems can be great for visually impaired riders, or those with cognitive or balance issues.</span></figcaption><span> <i>Eir Miura / Getty Images</i></span></div>\n<p>Aside from the companionship of cycling in tandem and the conversation that comes with it, one of the main advantages of tandem cycling is you create a unified pace without there being a ‘faster or slower’ rider, as you sometimes find in pairs.</p>\n<p>With two people working in unison and less weight than a pair of bicycles combined, it’s easy to cover large distances.</p>\n<p>Tandems can be considered a form of <a href=\"https://www.bikeradar.com/advice/buyers-guides/adaptive-bikes/\">adaptive cycle</a>. For riders with certain disabilities, tandems mean you do not have to give up the joy of cycling.</p>\n<p>Visually impaired riders and those with cognitive and balance issues are able to ride without fear. While tandem cycling is no longer a mainstream Olympic event, it remains an important Paralympic cycling discipline.</p>\n<p>Riders of different abilities are able to work as a team and enjoy a cycle ride without worrying about one being ‘faster’ than the other or holding the other one back.</p>\n<p>Critically, they’re also <a href=\"https://www.bikeradar.com/features/riding-a-tandem-is-dumb-and-you-should-try-it/\">great fun</a>. Riding a tandem is a cycling experience quite unlike any other and is something every rider should endeavour to try.</p>\n<h2>How to ride a tandem</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jack Luke and Laura riding tandem.\" title=\"01_cecil_the_tandem-1500377411887-kpkb678p9s5x-1512571518977-ojijvejlt5qe-fa24742\" />\n\n</div><div><figcaption><span><i></i> Don’t let a difficult start deter you.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Learning how to ride a tandem may well determine your entire future as a tandem cyclist – it’s easy to be put off by a difficult start, but don’t let this deter you.</p>\n<p>Success depends largely on communication – whether it’s the system you follow for starting and stopping, or the way you communicate the road ahead or the vehicles behind. Without clear and effective communication, it’s easy for either rider to become frustrated and for them to fall over.</p>\n<h3>The role of the captain</h3>\n<p>The captain sits on the front of a conventional tandem and is in charge of the steering, braking and <a href=\"https://www.bikeradar.com/advice/skills/technique/how-to-change-gears-on-a-bike/\">shifting gears</a>.</p>\n<p>The captain is generally the stronger rider, and is the first to get on a tandem and the last to get off. They create stability and need to be able to put both legs down when the cycle is stationary.</p>\n<p>Many adaptive or companion tandems will have the captain at the back, enabling a greater view or a recumbent seating position for the second rider.</p>\n<h3>The role of the stoker</h3>\n<p>The second rider is known as the stoker. The stoker on a tandem is crucial for the extra power needed to move the weight of a tandem.</p>\n<p>Sitting behind the pilot, they have no control over the cycle, but how they move around can impact the stability of the tandem. If the stoker tries to move independently, they can easily destabilise the bike in the same way a pillion passenger can on a motorcycle.</p>\n<h3>Starting and stopping</h3>\n<p>Having an agreed process for starting and stopping is important when riding a tandem.</p>\n<p>Both riders must use the same leg to push down and start, and have to remove the same leg first when they come to a stop.</p>\n<p>If you don’t, either you won’t have enough power to start or you won’t be able to support the weight of the cycle when you come to a standstill. We recommend you decide on this process before setting off and practise in a quiet area.</p>\n<p>The front rider has an inherently more comfortable riding position, with their saddle placed in the middle of the frame. They also have an awareness of what is coming up ahead and can prepare mentally, while physically the flex in the frame takes out some of the harshness of the ride.</p>\n<p>The rear rider is positioned closer to the rear wheel and without visual cues can find bumps and potholes bone-rattling and disconcerting – it’s hard to shift your weight in anticipation of a pothole if you can’t see it coming.</p>\n<p>Adding a suspension <a href=\"https://www.bikeradar.com/advice/buyers-guides/seatposts/\">seatpost</a> to a rear tandem saddle can increase comfort considerably.</p>\n<h2>Different types of tandem</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Paralympian Aileen McGlynn (left) riding a tandem with pilot Ellie Stone at the 2022 Commonwealth Games.\" title=\"aileen-mcglynn-tandem\" />\n\n</div><div><figcaption><span><i></i> Paralympian Aileen McGlynn (left) riding a tandem with pilot Ellie Stone at the 2022 Commonwealth Games.</span></figcaption><span> <i>Adrian Dennis / AFP via Getty Images</i></span></div>\n<p>Think of a cycling discipline and there will be a tandem equivalent – riders of all stripes have discovered the joys of riding a bicycle made for two.</p>\n<p>Here are some of the most common types of tandem and what to expect from them.</p>\n<ul>\n<li><strong>Comfort tandem:</strong> with an upright riding position and a low step-through frame, these are easy to ride. They’re generally set up for urban riding and gentle terrain.</li>\n<li><strong>Road tandem:</strong> the tandem equivalent of a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a>, these can be high-spec speed machines or simple drop-bar bikes designed to ride on road surfaces alone.</li>\n<li><strong>Track tandem:</strong> a tandem designed for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-started-at-track-cycling/\">riding in a Velodrome</a> and often used for para-cycling events.</li>\n<li><strong>Electric tandem:</strong> covering all tandem disciplines, electric assist is a great addition to the world of tandem cycling. The extra weight of tandems means they are even more fun to ride with an extra bit of boost from a <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">motor</a> and many have a pair of batteries in sync to enable extra distance.</li>\n<li><strong>Hybrid tandem:</strong> flat handlebars, a modicum of suspension on the front wheel and slightly wider tyres than a road tandem, these cycles will take you from the town to the kitty-litter cycle path and even onto gentle woodland trails.</li>\n<li><strong>MTB tandem:</strong> both hardtail and full-suspension mountain bike tandems exist, with riders taking on everything from the Megavalanche (a mass-start downhill MTB race in France) to the <a href=\"https://www.bikeradar.com/features/routes-and-rides/horse-for-the-course-silk-road-mountain-race/\">Silk Mountain Race</a>.</li>\n<li><strong>Recumbent tandem:</strong> with either stoker or both riders sitting on a recumbent seat with a horizontal pedalling position, these tandems are a fabulous way to get less able-bodied riders out cycling.</li>\n<li><strong>Companion tandem:</strong> designed for riders with physical, neurological and/or balance issues, these tandems often have the stoker at the front. Some even have twin wheels at the rear to provide greater stability.</li>\n<li><strong>Family tandem:</strong> with an adult riding as captain and a lower, smaller-framed rear end enabling a child to ride as stoker, these tandems (commonly known as kiddyback tandems) can be built as triplets, taking three riders. When buying a family tandem, check longevity in terms of the ability to add longer seatposts and reduce the reach of the stem as the child grows.</li>\n</ul>\n<h2>What to look for in tandem bikes</h2>\n<h3>Tandem frame</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jonathan Dixon and Karolina Deutsch Calfee tandem\" title=\"Jonathan Dixon and Karolina Deutsch Calfee tandem\" />\n\n</div><div><figcaption><span><i></i> Oversized tubing helps reduce any wobbling and wallowing.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>For many years, the popularity of tandems suffered due to their frames being weak. The ride was uncomfortable and ‘wafty’ as they flexed inappropriately.</p>\n<p>Modern tandems address this with oversized tubing or additional stays running the length of the bike or acting as secondary seatstays and chainstays within the frame. They have successfully reduced wobble and wallow.</p>\n<p>Beyond ride feel, the other important factor to consider is size. Some frames come in different sizes, while others are ‘one size fits all’ with guideline heights for the captain and stoker. If possible, you should try a tandem before buying it so you can ensure it fits both riders, particularly if either or both riders sit outside the typical bike-sizing bell curve.</p>\n<p>The lifespan of a ‘family’ tandem can be extended with longer seatposts and <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-stems/\">stems</a>, but if riders are not comfortable they won’t enjoy it.</p>\n<h3>Tandem wheels</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"10 in rear disc rotor on bicycle frame\" title=\"10 in rear disc rotor on bicycle frame\" />\n\n</div><div><figcaption><span><i></i> Tandem wheels tend to have a large number of spokes.</span></figcaption><span> <i>Oli Woodman / Immediate Media</i></span></div>\n<p>The load on tandem wheels is greater than on bikes for one rider.</p>\n<p>Consequently, the wheels need to be stronger. Some tandems use 26in wheels, where the smaller diameter can provide greater stiffness than larger wheels. However, many others use tandem-specific wheels with a larger number of spokes (up to 48).</p>\n<p>The rear-hub spacing is also typically wider on tandems. Older tandems, for example, typically used 145mm-wide rear ends to accommodate a drag or <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brakes/\">disc brake</a>.</p>\n<p>Check the wear on the hubs, spokes and tyres regularly and keep them well maintained to prevent problems.</p>\n<h3>Tandem brakes</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jonathan Dixon and Karolina Deutsch Calfee tandem\" title=\"Jonathan Dixon and Karolina Deutsch Calfee tandem\" />\n\n</div><div><figcaption><span><i></i> Large disc rotors help slow tandems down.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The weight and velocity of a tandem going downhill are far greater than a solo bicycle, which means sufficient braking power is essential.</p>\n<p>Modern tandems will use hydraulic disc brakes and large <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-rotors/\">disc rotors</a>.</p>\n<p>In addition, some touring and road tandems employ a third brake designed for use specifically on long hills.</p>\n<p>The third brake is typically controlled by the captain, but some tandem teams hand this responsibility over to the stoker.</p>\n<p>Over extended periods, brake fluid can overheat and ‘cook’, so having a third brake that can be left on during a descent will save the regular brakes and reduce the overall speed.</p>\n<p>Regular maintenance and inspection of <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">brake pads</a> is essential with tandems because pads wear at a far faster rate than a solo bike. Rims should also be inspected regularly on rim-brake tandems.</p>\n<h3>Tandem drivetrains</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The bike strikes a good balance between stability and speedy handling\" title=\"05_cecil_the_tandem-1500377411897-1spkhgwoge2f0-7bedcf6\" />\n\n</div><div><figcaption><span><i></i> Tandems have two drivetrains.</span></figcaption><span> <i>Jack Luke / OurMedia</i></span></div>\n<p>Unlike solo bicycles, tandems have two drivetrains.</p>\n<p>The first runs from the stoker’s cranks to the rear derailleur. This isn’t any different from a typical bicycle drivetrain.</p>\n<p>The second connects the captain and stoker’s cranks, usually via a second <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">chain</a> on the non-driveside of the tandem. This is known as the timing chain.</p>\n<p>This necessitates the use of special crank arms for three of the four cranks.</p>\n<p>Some bikes use a timing chain that runs on the same side as the rest of the drivetrain, but these are in the minority.</p>\n<p>With the increased weight of a tandem, the range of gears is more critical.</p>\n<p>Large cogs to enable easier climbing are sometimes chosen over smaller, high-gear cogs that give efficient speed on the flat.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"24/34/44 gearing on touring tandem\" title=\"24/34/44 gearing on touring tandem\" />\n\n</div><div><figcaption><span><i></i> The gear range of a tandem is critical due to the extra weight.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>When choosing a tandem, it’s important to consider where you’re most likely to want the extra benefits – for climbing or for speed on the flat.</p>\n<p>Some tandems come fitted with a pinion gearbox. Replacing external chainrings, this gearbox has all the cogs housed within an oil bath. Pinion gearboxes can have larger ratios of gears, giving benefits at both ends of the spectrum – climbing and on the flat.</p>\n<p>They are less delicate than external chainring and derailleur gear systems, and because a tandem is heavier in general the extra weight of a pinion gearbox is less noticeable. Combined with an <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a>, this can be a great solution for assisted long-distance cycling or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-touring-bike-how-to-choose-the-right-one-for-you/\">touring</a>.</p>\n<h3>Tandem cranksets and pedalling</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Though it's a bit more complicated than standard tandem setups, the DaVinci drivetrain's independent pedaling and extra-wide gearing range are compelling features to many tandem buyers.\" title=\"1251197710710-iwzeokhsaux7-a1bf157\" />\n\n</div><div><figcaption><span><i></i> The DaVinci Designs ICS enables the stoker or captain to stop pedalling.</span></figcaption><span> <i>James Huang/BikeRadar.com</i></span></div>\n<p>On most tandems, the <a href=\"https://www.bikeradar.com/advice/buyers-guides/cranksets/\">cranks</a> are lined up to be in sync at every point (in-phase).</p>\n<p>Some teams prefer to ride with their cranks slightly out of phase, positioning them a few degrees apart (up to 10 degrees or a couple of teeth on the chainring). This enables the captain (stronger rider) to take the initial force of the revolution, with the stoker following on.</p>\n<p>It’s possible to get tandems where the cranks are not both turning at the same time. Da Vinci Designs’ Independent Coasting System (ICS) enables either captain or stoker to stop pedalling and coast before joining back in.</p>\n<p>Dutch adaptive cycling specialist Van Raam has also created a system where the stoker can choose whether their hub is engaged, disengaged or independent, giving them the choice of how they pedal.</p>\n<p>With the hub engaged, the stoker pedals in-phase; with it disengaged, they can coast and with it independent, the stoker can pedal in their own gear at their own pace.</p>\n<h3>Suspension seatposts for tandems</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tandem with suspension seat post.\" title=\"cecil tandem-12\" />\n\n</div><div><figcaption><span><i></i> Suspension seatposts on tandems help smooth out bumpy rides.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The stoker’s position on the frame means they can feel every bump and pothole, with little or no visual warning. This is both uncomfortable and disconcerting.</p>\n<p>Suspension seatposts reduce high-frequency vibrations from the road or trail and dampen the larger bumps. Most tandems come with a suspension seatpost for the stoker as stock, but they can be bought independently if not.</p>\n<h2>How much does a tandem cost?</h2>\n<p>The market for tandem cycles is smaller than solo cycles, but it’s catered to by some great specialist bike retailers. Some retailers cater to both new and used markets, while others are frame builders and manufacturers selling directly to the public.</p>\n<p>Although you’re buying a single frame and two wheels, it’s not the same as buying a single bicycle. On average, you can expect to pay from around £1,000 upwards in the UK or $800 in the USA.</p>\n<p>There is a buoyant <a href=\"https://www.bikeradar.com/features/how-to-buy-a-used-or-second-hand-bike-online/\">second-hand bike market</a> for tandems too, providing a more affordable way into the world of tandem cycling.</p>","author":"Vicky Balfour","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e1234cda658835ec82f3bd1d84ea84667e7bce7cb0b7081bcf67a25f9ef9ff70","category":"Cycling"}