{"title":"Assessing river ecological status through Eurasian otter diet analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4311?af=R","date":1715924313000,"content":"<h2>Abstract</h2>\n<p>To identify and mitigate biodiversity decline, it is necessary to develop and implement appropriate ecological assessment methods. This particularly relevant in ecosystems under strong human pressure, such as riverine environments, in which ecological assessment requires several standardized methods useful in a wide range of riverine characteristics and habitats. In this work, we related otter diet composition with a set of environmental variables in representative river reaches of two contiguous river basins with a high diversity of habitats and varying degrees of human alteration. Our goal was to determine to what extent otter prey communities were sensitive to habitat characteristics and human pressures. Our results suggest that otter prey community in heavily anthropized rivers vary significantly across three gradients: habitat productivity, habitat structure and habitat stability. We also compared the results obtained from the otter diet with those obtained from electrofishing. Overall, the otter diet changed spatially in a similar way to the fish community sampled by electrofishing, but both methods showed disagreements that suggest different biases in some habitats and for some species. We conclude that otter diet analysis is a potential supplementary method for assessing river ecological status and that human alterations related to habitat structural simplification and water extraction can prevent freshwater biodiversity recovery in human-dominated landscapes despite improvements in biochemical water quality.</p>","author":"Arnau Tolrà, \nJoan Lluís Riera, \nJordi Ruiz‐Olmo","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"e12b359a3e97f101e9e31b3ca96c85147bfea9967d6d791373e1ea6c61e0373a","category":"Environment"}