{"title":"General practitioners’ perspectives on statutory skin cancer screening–A questionnaire-based cross-sectional survey in Germany","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308508","date":1723125600000,"content":"<p>by Lydia Reinhardt, Cristin Strasser, Theresa Steeb, Anne Petzold, Markus V. Heppt, Anja Wessely, Carola Berking, Friedegund Meier</p>\r\nBackground <p>In Germany, skin cancer screening (SCS) is available free of charge every two years to all those with statutory health insurance over the age of 35. General Practitioners (GP) can carry out the screening if they have completed an 8-hour training course. GPs play a crucial role in the implementation of SCS and act as gatekeepers between initial patient contact and referral to dermatologists.</p> Objective <p>To record how comprehensively GPs carry out SCS in terms of patient information and body examination, as well as to explore GPs opinions on the feasibility of SCS.</p> Methods <p>A cross-sectional survey was conducted. A questionnaire was sent to GPs with permission to perform SCS in two regions of Germany (Bavaria and Saxony) between August and September 2021. Data were analyzed using descriptive analysis. Subgroup analysis was performed according to regions (federal state, location of physician´s office), professional experience (experience in years, number of monthly screenings, age) and gender. Open questions were evaluated using qualitative content analysis.</p> Results <p>In the survey, 204 GPs responded. Genitalia (40.7%, 83/203), anal fold (62.3%, 127/204) and oral mucosa (66.7%, 136/204) were the least examined body regions during screening. Information on risks (false-positive findings: 18.6%, 38/203; false-negative findings: 13.2%, 27/203; overdiagnosis: 7.8%, 16/203) and benefits (48.0%, 98/202) were not always provided. GPs who performed screenings more frequently were more likely to provide information about the benefits of SCS (p&lt;0.001; &gt;10 vs. &lt;5 screenings per month). Opinions were provided on uncertainties, knowledge requirements, structural and organizational requirements of SCS, SCS training and evaluation. The organization and remuneration of the SCS programme was seen as a barrier to implementation. GPs expressed uncertainties especially in unclear findings and in dermatoscopy.</p> Conclusion <p>Uncertainties in the implementation of the SCS should be addressed by offering refresher courses. Good networking between GPs and dermatologists is essential to improve SCS quality.</p>","author":"Lydia Reinhardt","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e13046b8a4bc0b2fb45f3acd0e11079e3b893b4d246030e1abf49ee8ecf099c0","category":"Interdisciplinary"}