{"title":"Do clinical practice guidelines follow sustainable healthcare principles? A review of respiratory guidance","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000078","date":1695391200000,"content":"<p>by Naba Khan, Sarah C. Walpole, Olga M. Rostkowska, James N. Smith, Fiona A. Miller</p>\r\nBackground <p>Respiratory care is an important site for climate action, given that common treatments for conditions such as asthma and COPD produce significant greenhouse gas emissions, even as respiratory health is negatively impacted by climate change. Clinical guidelines provide key information for healthcare professionals and can promote approaches to healthcare that can mitigate negative environmental impacts, and optimise patient treatment, care delivery, and equitable outcomes, and bring awareness and legitimacy to sustainable healthcare practices.</p> Methods <p>Twenty national and international clinical respiratory guidelines were purposively selected and screened for inclusion of four principles of sustainable clinical practice: prevention, patient empowerment and self-care, lean service delivery, and low carbon alternatives. A screening framework specific to respiratory care implications was developed and used to review each guideline for mention of relevant topics, recommendations, and explicit links to sustainability in relation to each principle.</p> Findings <p>Sustainable clinical care principles were evident in most guidelines reviewed, environmental sustainability was mentioned infrequently. Many guidelines emphasised prevention (more secondary than primary) and support for patient preference and streamlining care, yet there was rarely mention of how these recommendations could contribute to lowering the environmental impacts of health systems. Low carbon alternatives were mentioned in only three guidelines.</p> Conclusions <p>While many clinical respiratory guidelines make recommendations in accordance with the principles of prevention, patient empowerment and self-care, and lean service delivery, reducing the carbon footprint of healthcare was rarely mentioned in the guidelines. Including explicit attention to the environmental impact of clinical care in guidance could support efforts to reduce the wider harms of healthcare, meanwhile, noting the clinical benefits of sustainable approaches could promote the uptake of recommendations.</p>","author":"Naba Khan","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"e137cacb0e8e40afc995a908e0dc86083f3f8f62e02283f93abaefa931f5efc7","category":"Environment"}