{"title":"Want an M3 Mac? It looks like you’ll need to wait till next year","link":"https://www.macworld.com/article/2062385/m3-processor-macbook-october-event-2024-launch.html","date":1694444905000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s possible that Tuesday’s <a href=\"https://www.macworld.com/article/673671/how-to-watch-apples-event.html\">Wonderlust event</a> to unveil the latest iPhones and Apple Watches could be the last major product release of this year for Apple. Past reports have said that Apple had plans to do a Mac update later this fall to introduce the highly anticipated M3 chip, but a new report has dampened those expectations.</p>\n\n\n\n<p>According to analyst Ming-Chi Kuo on X (formerly Twitter), the next generation of M-series chips, the M3, won’t make its debut in a MacBook until next year. Kuo has a reputation as a reliable analyst who keeps an eye on supply chain trends.</p>\n\n\n\n<figure><div>\n<blockquote><p>看起來到今年年底前，Apple應該都不會發售新款的MacBook (配備M3系列處理器) 機型了<br />==<br />It seems that Apple will not launch new MacBook models (equipped with M3 series processors) before the end of this year.</p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1700193866178343036?ref_src=twsrc%5Etfw&amp;xcust=1-1-2062385-1-0-0&amp;sref=https://www.macworld.com/feed\">September 8, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Several other sources have reported that Apple plans to release M3 Macs this fall. Last month, Bloomberg’s Mark Gurman said that Apple’s <a href=\"https://www.macworld.com/article/2030760/m3-lineup-cpu-cpu-memory-macbook-imac-mac-mini.html\">M3’s release cycle</a> would likely start in October with the M3 chip in the 13-inch MacBook Pro, 13- and 15-inch MacBook Air, Mac mini, and iMac. The M3 Pro, Max, and Ultra versions would then roll out throughout 2024. Gurman has not commented on Kuo’s post, though has reported that Apple might not hold a second fall event this year.</p>\n\n\n\n<p>Kuo doesn’t cite any possible reasons for a later unveiling of the M3–it’s not clear if this was Apple’s intention all along or if there were production issues that caused the release to be pushed back. The M3 has been reported to be manufactured using a 3nm process, which would make it the <a href=\"https://www.macworld.com/article/1953800/apple-m3-cpu-gpu-speed-performance.html\">first 3nm chip in a laptop or desktop computer</a>. The 3nm process is new for chip manufacturer TSMC and its production capacity is comparatively small, so it’s possible that Apple needed to adjust its release schedule. <a href=\"https://www.macworld.com/article/1446844/3nm-processor-advantage-qualcomm-mediatek-tsmc.html\">The A17 Bionic in the iPhone 15 Pro</a> that will be released on Tuesday is expected to be a 3nm chip as well, and iPhone production takes priority over the Mac.</p>\n\n\n\n<p>The 3nm process allows for more transistors to fit on a chip, which could potentially provide a performance boost that exceeds the typical 15 to 20 percent seen between chip generations. The M3 could also offer better power efficiency, which would increase a laptop’s battery life.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e1415950306dbe4a3ff24d79f90b32182ff4d208794e0b218b87fe7086bef6a9","category":"Apple"}