{"title":"Apple Watch SE 3: Everything We Know So Far","link":"https://www.macrumors.com/2023/10/24/apple-watch-se-3-everything-we-know/","date":1698156307000,"content":"The third-generation <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a> is expected to launch next year, but with few rumors about the new low-cost Apple smartwatch, what can we expect to see?\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Apple-Watch-SE-3-Mock-Feature.jpg\" width=\"2250\" height=\"1265\" />\r<br />\nEarlier this year, technology research firm Omdia <a href=\"https://www.macrumors.com/2023/02/08/apple-watch-series-x-larger-display-rumor/\">reported</a> that the third-generation ‌Apple Watch SE‌ will feature the same display sizes as the Apple Watch Series 8. The Apple Watch Series 8 and Series 9 have the same display size as the Apple Watch Series 7, which introduced a slightly more rounded and larger casing design to accommodate bigger displays that have slimmer bezels.\r<br />\n\r<br />\nAs such, it seems highly likely that the third-generation ‌Apple Watch SE‌ will adopt the design of the Apple Watch Series 7, as well as its larger displays and casing sizes. This means it would be available in 41mm and 45mm case sizes, compared to 40mm and 44mm for the current ‌Apple Watch SE‌, providing almost 20% more display area.\r<br />\n\r<br />\nThe second-generation ‌Apple Watch SE‌ features the S8 chip, which is based on the A13 Bionic and effectively analogous to the previous S6 and S7 chips. With a third-generation version of the ‌Apple Watch SE‌, it is highly likely that the device will get an upgrade to the S9 chip, which is based on A15 Bionic chip, at minimum. It could even get the \"S10\" chip from next year's other Apple Watch models.\r<br />\n\r<br />\nThe S9 contains 60% more transistors to deliver 30% faster performance compared to the ‌Apple Watch SE‌'s S8 chip. It also has a four-core Neural Engine that is up to twice as fast. These improvements allow <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> requests to be processed on-device, resulting in quicker and more reliable responses, as well as access to health and fitness data. Dictation is also 25% more accurate as a result of the processor bump.\r<br />\n\r<br />\n<ul>\r<br />\n<li><a href=\"https://www.macrumors.com/guide/apple-watch-se-vs-series-9/\">Apple Watch SE vs. Series 9 Buyer's Guide: 25+ Differences Compared</a></li>\r<br />\n</ul>\r<br />\n\r<br />\nThe second-generation ‌Apple Watch SE‌ features Apple's second-generation optical heart sensor. Apple introduced the third-generation optical heart sensor on the Series 6 back in 2020, so in 2024, it could finally be time to bring the updated sensor to the low-cost Apple Watch.\r<br />\n\r<br />\nFast charging was introduced on the Apple Watch Series 7 to reach up to 80% charge in about 45 minutes. The functionality was withheld from the second-generation ‌Apple Watch SE‌, but it seems like a feature that Apple could decide to finally bring over with the third-generation of the device. \r<br />\n\r<br />\n<h3>What Will Stay the Same?</h3>\r<br />\nThe second-generation ‌Apple Watch SE‌ introduced a color-matched nylon composite back case to reduce costs. The third-generation model is likely to carry over this feature, reserving the more premium ceramic back case for the main Apple Watch line.\r<br />\n\r<br />\nThe blood oxygen sensor and Blood Oxygen app, electrical heart sensor and ECG app, and body temperature sensing functionality are likely to be exluded from the third-generation ‌Apple Watch SE‌. Both the first- and second-generation ‌Apple Watch SE‌ models have offered a more basic selection of health monitoring features, with Apple upselling customers to the main Apple Watch series to obtain capabilities like ECG capture. If it does gain any new health features from the main Apple Watch line, ECG is the most likely since it was introduced on 2018's Series 4.\r<br />\n\r<br />\nLikewise, the ‌Apple Watch SE‌ has never possessed an Ultra Wideband chip, so the chance of Apple giving the new model the second-generation Ultra Wideband chip also seems slim.\r<br />\n\r<br />\n<h3>Release Date</h3>\r<br />\nThe previous generations of the ‌Apple Watch SE‌ launched in September 2020 and September 2022, as outlined in the <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_SE\">MacRumors Buyer's Guide</a>. The ‌Apple Watch SE‌ is expected to <a href=\"https://www.macrumors.com/2023/07/30/no-apple-watch-se-3-expected-this-year/\">stick to a two-year upgrade cycle</a> going forward, according to <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>, suggesting that the third-generation model will arrive in September 2024.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_SE\">Apple Watch SE (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/24/apple-watch-se-3-everything-we-know/\">Apple Watch SE 3: Everything We Know So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-se-3-everything-we-know-so-far.2408525/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e1516139df2686a1624ca03c398bf12ad8c1cc26e98acb77a96f577d64fd1705","category":"Apple"}