{"title":"A Comprehensive Review of Piezoelectric Ultrasonic Motors: Classifications, Characterization, Fabrication, Applications and Future Challenges","link":"https://www.preprints.org/manuscript/202408.2241/v1","date":1725332388000,"content":"Piezoelectric ultrasonic motors (USMs) are actuators that use ultrasonic frequency piezoelectric vibration generated waves to transform electrical energy into rotary or translating motion. USMs are paid more attention because they offer distinct qualities over traditional magnet-coil-based motors, such as miniaturization, great accuracy, speed, non-magnetic nature, silent operation, straightforward construction, broad temperature operations, and adaptability. This review study focuses on the principle of USMs and their classifications, characterization, fabrication methods, applications, and future challenges. Firstly, the classifications of USMs, especially, standing wave, traveling wave, hybrid mode, multi degree of freedom USMs are summarized, and their respective functioning principles are explained. Secondly, the finite element modelling analysis for design and performance predictions, the conventional and nano/micro fabrication methods, and, the various characterization methods are presented. Thirdly, their advantages, such as high accuracy, small size, and silent operation and their benefits over conventional motors for the different specific applications are examined. In addition, the substantial contributions to a variety of tech-nical fields like surgical robots, industrial, aerospace, and biomedical applications are introduced. Finally, their future prospects and challenges in USMs development, with an emphasis on downsizing, increasing efficiency, and new materials are outlined.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e158e96eb913efee274d04f56d84e068ce106d6c00b0b8e37e751d2e1666488f","category":"Interdisciplinary"}