{"title":"Research on strength of Bilateral Support Bearing of PDC -Cone Hybrid Bit","link":"https://www.preprints.org/manuscript/202408.0706/v1","date":1723197868000,"content":"The existing PDC(Polycrystalline Diamond Compacts) -cone hybrid bit bearing adopts a unilateral support structure, which is prone to stress concentration in the journal area, resulting in fracture and wear failure of the bearing, thus reducing the service life of the hybrid bit. In this paper, a new type of double supported bearing hybrid bit is proposed. The static strength analysis of unilateral and bilateral support bearing structures is carried out by finite element simulation, and the stress and strain distribution of the two structures under the load of 20KN-100KN is obtained. Experimental devices for unilateral and bilateral support bearing structures are designed and manufactured to complete 50KN-100KN static pressure loading experiments. The results showed that the stress and strain of unilateral and bilateral support bearing increased linearly with the increase of load. Compared with unilateral bearing, when the load was 100KN, the maximum Mises stress of bilateral bearing decreased from 358.80MPa to 211.10MPa, with a decrease of 41.16%. The maximum contact stress decreased from 415.20MPa to 378.10MPa, decreased by 8.94%, and the maximum principal strain decreased from 11.01e-4 to 9.71e-4, decreased by 11.81%. The axial strain in the danger zone was reduced by 14.68% and 17.35%, respectively. It is found that the contact stress of the simulation data is highly correlated with the bearing life, and the service life of the bilateral bearing bit is increased by 8.94%. The simulation data and experimental results provide data support for the production of hybrid bits with bilateral bearing support.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e159391e2ebf41dbf9c1d9d0171851c929f32f09784a5a3fbd602b439ebf2d2e","category":"Interdisciplinary"}