{"title":"Aging by autodigestion","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312149","date":1729173600000,"content":"<p>by Frank A. DeLano, Geert W. Schmid-Schönbein</p>\r\n\r\nThe mechanism that triggers the progressive dysregulation of cell functions, inflammation, and breakdown of tissues during aging is currently unknown. We propose here a previously unknown mechanism due to tissue autodigestion by the digestive enzymes. After synthesis in the pancreas, these powerful enzymes are activated and transported inside the lumen of the small intestine to which they are compartmentalized by the mucin/epithelial barrier. We hypothesize that this barrier leaks active digestive enzymes (e.g. during meals) and leads to their accumulation in tissues outside the gastrointestinal tract. Using immune-histochemistry we provide evidence in young (4 months) and old (24 months) rats for significant accumulation of pancreatic trypsin, elastase, lipase, and amylase in peripheral organs, including liver, lung, heart, kidney, brain, and skin. The mucin layer density on the small intestine barrier is attenuated in the old and trypsin leaks across the tip region of intestinal villi with depleted mucin. The accumulation of digestive enzymes is accompanied in the same tissues of the old by damage to collagen, as detected with collagen fragment hybridizing peptides. We provide evidence that the hyperglycemia in the old is accompanied by proteolytic cleavage of the extracellular domain of the insulin receptor. Blockade of pancreatic trypsin in the old by a two-week oral treatment with a serine protease inhibitor (tranexamic acid) serves to significantly reduce trypsin accumulation in organs outside the intestine, collagen damage, as well as hyperglycemia and insulin receptor cleavage. These results support the hypothesis that the breakdown of tissues in aging is due to autodigestion and a side-effect of the fundamental requirement for digestion.","author":"Frank A. DeLano","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e178d757946635d01ff575ecaf0c50329833adc2da800f0499e38185638d4b3c","category":"Interdisciplinary"}