{"title":"Differential responses to weather and land‐cover conditions explain spatial variation in winter abundance trends in a migratory bird of conservation concern","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14804?af=R","date":1729585879000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5cae8a19-63b3-4f8a-8560-7417338a5e6d/jpe14804-toc-0001-m.png\" alt=\"Differential responses to weather and land-cover conditions explain spatial variation in winter abundance trends in a migratory bird of conservation concern\" />\n<p>We demonstrate the potential to delineate animal populations based on spatial patterns in population dynamics using long-term abundance monitoring data, which are commonly the only available data for conservation practitioners. By grouping sites based on spatial patterns in local abundance trends, we can further test hypotheses about how these groups are differentially affected by changing environmental conditions. This information is important for informing efficient conservation planning over large areas when financial resources are limited.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEffective conservation strategies for animal populations require knowledge of relationships between population dynamics and their environmental drivers. However, these processes often vary within animal populations, requiring site-specific conservation planning. Given limited financial resources, identifying groups of sites with similar population dynamics can help practitioners efficiently implement conservation programs to larger areas. We evaluated spatial patterns and environmental drivers of wintering site trends in a migratory bird of conservation concern, the Greenland white-fronted goose (<i>Anser albifrons flavirostris</i>).\n\nWe used latent class analysis to identify trend patterns in 35 years of abundance data among 59 geographically discrete Greenland white-fronted goose wintering sites. We developed a state-space abundance model in a Bayesian framework to quantify the effects of weather and land-cover conditions experienced throughout spring migration, summer breeding, autumn migration and wintering periods on variation in wintering site abundance.\n\nWe identified two main patterns in Greenland white-fronted goose abundance trends: northeastern wintering sites declined on average by 3% per year, while southwestern wintering sites declined on average by 14% per year. Differential responses to weather and habitat conditions likely explained variation among groups, as geese at southwestern wintering sites were more negatively affected by harsh weather conditions (e.g. low temperatures and high precipitation on breeding areas) and poor habitat conditions (i.e. low-quality grasslands and croplands) on wintering areas.\n\nFuture conservation efforts to improve the suitability and nutritional quality of agricultural areas, especially cereal croplands in autumn and early winter and grasslands in late winter and early spring, could potentially improve local habitat conditions, especially in the southwestern wintering sites where abundance declines were steepest.\n\n<i>Synthesis and applications</i>. We demonstrate the potential to delineate animal populations based on spatial patterns in population dynamics using long-term abundance monitoring data, which are commonly the only available data for conservation practitioners. By grouping sites based on spatial patterns in local abundance trends, we can further test hypotheses about how these groups are differentially affected by changing environmental conditions. This information is important for informing efficient conservation planning over large areas when financial resources are limited.\n</p>","author":"Alexander R. Schindler, \nAnthony D. Fox, \nChristopher K. Wikle, \nBart M. Ballard, \nAlyn J. Walsh, \nSeán B. A. Kelly, \nMitch D. Weegman","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"e179c9c3b41046c4b35782b1224e3d0c9e74ea8e20d84406a87d4c2dd00e3c68","category":"Environment"}